{"content": "What you are seeing is a Photoshopped Google search image that was posed as a real Wells Fargo wire transfer sent to 17 employees via email by the CEO. The account it was sent from is supposedly Michael’s lawyer in New York. When I Googled his name, I found nothing. The dates at the bottom of the PDF are exactly the same (the last time I checked it was 2016), the account #’s end in the same digits, and the expected delivery date was the same day these confirmation emails were sent out. Was the money in our accounts? No. Also note that the forged wire transfer states the money was sent out Aug 2nd, the same day I asked for transparency and was ignored. Even the damn transfer time stamps are exactly the same! I still didn’t get the pay stub I requested. Whoever photoshopped these documents has the intelligence of a 5th grader, but even worse is the person who thought this was a good idea. Think about it. The scam artist sat there and concocted this in his head instead of telling us the truth that the money wasn’t there. He then weighed the pros and cons and decided it was worth it. Then he took the time to Photoshop in each of his 17 employees’ names (or he forced someone else to do his dirty work). He then had the nerve to walk into the office with a smile and say that he has proof that he sent the wire transfers! He also said that if the money wasn’t in our accounts it wasn’t his fault and to call our banks to complain about it. I recall the moment clearly when Michael sat next to me and emailed me my wire transfer confirmation first. I replied to his email with “Thank you”. He looked up from his computer and said “I’m sitting right here. You can tell me to my face!” with a self-satisfied smile. I did. Later that same day, when everyone was cheerful and joking from the relief the wire confirmations brought, Michael said under his breath in our second language, “Look at those Chinese kids. They’re pretty happy they got paid, huh?”", "title": "", "creatorid": "5a995d883209", "name": "2441_9", "sentenceid": "50c2", "parent": "2441", "commentid": "ccf78311b870", "child": ""}