{"name": "2000", "title": "The Pros and Cons of the Star Running Backs in This NFL Draft Class", "sentences": [{"5358": "The Pros and Cons of the Star Running Backs in This NFL Draft Class"}, {"4ae0": "Initial scouting impressions of Leonard Fournette, Dalvin Cook, Christian McCaffrey, and Alvin Kamara"}, {"efaa": "In the lead-up to each of the past two NFL drafts, a pressing question for teams was if — and when — it was acceptable to take a running back in the first round. In 2015, Todd Gurley and Melvin Gordon became the first backs in a three-year window to be selected in the first 32 picks; last spring, Ezekiel Elliott was snapped up at no. 4 overall, a signal that the Cowboys were going all-in on their ground game."}, {"dd8d": "The running back debate is likely to continue this year in part because the 2017 class includes high-level talent at the position, and in part because some big names from the last few college football seasons are available. With a former no. 1 recruit, a former Heisman Trophy finalist, and multiple All-Americans in the pool, the landing spots of this year’s backs should be a constant source of curiosity."}, {"407b": "On last week’s episode of the The Ringer NFL Show, NFL.com’s Lance Zierlein joined me to provide a primer on the 2017 crop. To build on that, here’s a breakdown of my initial impressions of the four backs who could go in the first round."}, {"fc37": "Leonard Fournette, LSU"}, {"02cd": "Fournette is the type of prodigious talent who even casual college football fans knew about before his arrival in Baton Rouge. The consensus no. 1 recruit in the class of 2014, he looked like a man among boys from the moment he stepped on the field as a true freshman. Even at 18 years old, Fournette produced highlights reminiscent of this clip of the Indianapolis Colts mascot playing against a group of kindergartners."}, {"5783": "The same qualities that made Fournette the most promising high school player in a generation and someone who rushed for 1,953 yards during his sophomore season at LSU are now lifting him into top-10 pick consideration. He bowls over defenders at 6-foot-1 and 240 pounds; trying to tackle Fournette is like trying to drag down a bad-intentioned kitchen appliance that can run the 40-yard dash in 4.5 seconds."}, {"c718": "That top-end burst is what makes Fournette such a coveted prospect in the eyes of many around the league. And while a massive back who treats safeties like speed bumps is undeniably entertaining, Fournette’s appeal transcends that: He combines his physicality with enough acceleration to gash opponents at every turn. He doesn’t need more than a sliver of daylight before he’s standing in the end zone as an entire defense wonders what the hell just happened."}, {"a11e": "Fournette’s big flaw is that he could be better at finding those slivers and creating for himself. His ability to power through holes may be his best trait, but he’s rarely able to manufacture an opening. It’s also unlikely that he will ever become an above-average receiver, a premier blocking back in pass protection (his effort and technique are both wanting), or a runner who thrives on vision and helps set up blocking schemes. By hammering defenders and taking advantage of his rare combination of physical traits, though, he may still be able to elevate a team’s ground game all by himself."}, {"62cd": "There aren’t many 240-pound backs making an impact in the modern NFL. (Only two — New England’s LeGarrette Blount and Tennessee’s Derrick Henry — got more than 100 carries last season.) In Fournette’s case, that may be a good thing."}, {"36f1": "Dalvin Cook, Florida State"}, {"e0a6": "For those who appreciate the small nuances of the running back position, watching Cook play is pure bliss. The former Seminoles star has a rare gift for setting up both blockers and defenders with where he’s going and how fast he’s getting there."}, {"75b4": "Many of the top runners in the league, like Pittsburgh’s Le’Veon Bell and Buffalo’s LeSean McCoy, understand the way their movements affect a defense to the point that they sometimes give off the impression they can see into the future. Exploiting cutback lanes and openings that didn’t exist a second earlier often gets described as vision, but Cook doesn’t have to see a crease to know where one will appear."}, {"44a3": "Cook’s effectiveness in that regard is enhanced by his ability to slow down or speed up in an instant. It doesn’t take long for him to get going after coming to a halt, and that makes it easy for him to manipulate defenders into playing at his tempo."}, {"6ce7": "As a receiver, Cook should be able to contribute to most schemes right away. He’ll let the occasional pass hit the ground, and there are moments that he struggles in pass protection when matched up against larger rushers. But both of those issues seem to stem from mental lapses rather than a lack of ability. Of greater concern is Cook’s tendency to fumble; he had 13 over his three seasons at Florida State, including six during the 2016 campaign. That’s a habit that any team thinking about making Cook the focal point of its offense will have to discuss in detail."}, {"f437": "Cook did himself no favors at the combine, finishing in the single-digit percentiles among running backs in the three-cone drill (seventh) and 20-yard shuttle (sixth). Neither mark indicates much change-of-direction prowess from a non-power back who weighed in at 210 pounds. And even his solid 40-yard dash time (4.49 seconds) is slower than his play speed."}, {"f132": "Chart via Mockdraftable.com"}, {"d12c": "His tape, though, should quell most front-office hesitations. Cook’s natural running skill is undeniable, and he has the potential to make everyone around him better."}, {"6f7d": "Christian McCaffrey, Stanford"}, {"8fdb": "McCaffrey might be the most fascinating back in this year’s class. How high a team takes him and how he’s eventually used are two of the most interesting questions in this draft. A huge chunk of his production at Stanford came on the ground (including 1,603 of his 1,913 yards from scrimmage as a junior), but his frame and style of play both raise concerns about his viability as a traditional runner at the next level."}, {"3004": "At 202 pounds, McCaffrey is on the small side for a running back. That’s exacerbated by the fact that he stands 5-foot-11, while many of the league’s other small, effective runners (such as Dion Lewis, Gio Bernard, and Danny Woodhead) pack roughly the same amount of bulk onto considerably shorter frames. Even in college, McCaffrey’s lack of power as a rusher was evident. He isn’t going to shed many tackles, and his usefulness in tighter spaces can be limited. He had enough vision to consistently hit big runs in college, but as the lanes become smaller in the NFL, he may have trouble emerging as a reliable early-down option."}, {"d95c": "It’s what he can do on passing downs, though, that makes him an enticing option toward the back of the first round. As a receiving target, McCaffrey should be able to step onto the field and contribute immediately. He catches the ball with ease and is supremely gifted as a route runner. Stanford deployed him in a variety of ways, and McCaffrey looked comfortable doing every one. Whether he was cooking a defensive back on a double move or slicing up a linebacker on an option route, he proved dynamic; creative play designers can and should salivate over his versatility."}, {"a23e": "As the NFL grows increasingly pass-happy, teams are relying on shotgun formations, sub packages, and personnel mismatches more than ever before. That makes backs with McCaffrey’s skill set exceedingly valuable. Even if his appeal is primarily tied to the passing game, McCaffrey is a surefire playmaker. He can be used as a runner in certain formations and as a wideout who can pick apart coverage in others."}, {"c611": "A Four-Step Guide to Watching Football Like a ScoutAhead of April’s NFL draft, how do you separate the hundreds of prospects from each other? Look not at what they do…theringer.com"}, {"2f0c": "Alvin Kamara, Tennessee"}, {"4e32": "Kamara doesn’t boast the name recognition of the other three guys on this list, but after showcasing ridiculous explosion at the combine (a 39.5-inch vertical jump and a 131-inch broad jump), the former Volunteers running back deserves mention in any conversation about this year’s crop at the position. He had a limited workload during the last two seasons at Tennessee (210 total rushes and only five games in which he racked up 15-plus carries), yet he made an impression with his touches. The first trait that sticks out on tape is his balance, even after contact."}, {"bafd": "Kamara is able to sustain hits and keep on moving, which is just one of the ways he displays body control as a runner. His ability to gather himself before accelerating to top speed is evident on film, and a key reason why his 40-yard dash time (4.56 at the combine) may not be as telling as his explosion numbers. Simply put, he’s a threat to break a big play any time he touches the ball."}, {"c568": "His decision-making in the open field can be curious, as he has a tendency to run toward tacklers when there’s plenty of space to exploit. That speaks to concerns about his instincts. He can be indecisive when looking for creases that haven’t yet developed; when seams unfold, though, he knows how to make teams pay."}, {"72f9": "That ability is part of what makes Kamara so intriguing as a receiving option. He’s dangerous on screens and can create mismatches from the slot. Plus, he’s adept enough as a route runner to catch passes out of the backfield. Kamara lacks the profile of other backs in this draft, but make no mistake: He has the skills to thrive in the modern NFL."}], "child": "2000_1\t2000_2\t2000_3\t2000_4\t2000_5\t2000_6", "timestamp": "Mar 20", "content": "The Pros and Cons of the Star Running Backs in This NFL Draft Class Initial scouting impressions of Leonard Fournette, Dalvin Cook, Christian McCaffrey, and Alvin Kamara In the lead-up to each of the past two NFL drafts, a pressing question for teams was if — and when — it was acceptable to take a running back in the first round. In 2015, Todd Gurley and Melvin Gordon became the first backs in a three-year window to be selected in the first 32 picks; last spring, Ezekiel Elliott was snapped up at no. 4 overall, a signal that the Cowboys were going all-in on their ground game. The running back debate is likely to continue this year in part because the 2017 class includes high-level talent at the position, and in part because some big names from the last few college football seasons are available. With a former no. 1 recruit, a former Heisman Trophy finalist, and multiple All-Americans in the pool, the landing spots of this year’s backs should be a constant source of curiosity. On last week’s episode of the The Ringer NFL Show, NFL.com’s Lance Zierlein joined me to provide a primer on the 2017 crop. To build on that, here’s a breakdown of my initial impressions of the four backs who could go in the first round. Leonard Fournette, LSU Fournette is the type of prodigious talent who even casual college football fans knew about before his arrival in Baton Rouge. The consensus no. 1 recruit in the class of 2014, he looked like a man among boys from the moment he stepped on the field as a true freshman. Even at 18 years old, Fournette produced highlights reminiscent of this clip of the Indianapolis Colts mascot playing against a group of kindergartners. The same qualities that made Fournette the most promising high school player in a generation and someone who rushed for 1,953 yards during his sophomore season at LSU are now lifting him into top-10 pick consideration. He bowls over defenders at 6-foot-1 and 240 pounds; trying to tackle Fournette is like trying to drag down a bad-intentioned kitchen appliance that can run the 40-yard dash in 4.5 seconds. That top-end burst is what makes Fournette such a coveted prospect in the eyes of many around the league. And while a massive back who treats safeties like speed bumps is undeniably entertaining, Fournette’s appeal transcends that: He combines his physicality with enough acceleration to gash opponents at every turn. He doesn’t need more than a sliver of daylight before he’s standing in the end zone as an entire defense wonders what the hell just happened. Fournette’s big flaw is that he could be better at finding those slivers and creating for himself. His ability to power through holes may be his best trait, but he’s rarely able to manufacture an opening. It’s also unlikely that he will ever become an above-average receiver, a premier blocking back in pass protection (his effort and technique are both wanting), or a runner who thrives on vision and helps set up blocking schemes. By hammering defenders and taking advantage of his rare combination of physical traits, though, he may still be able to elevate a team’s ground game all by himself. There aren’t many 240-pound backs making an impact in the modern NFL. (Only two — New England’s LeGarrette Blount and Tennessee’s Derrick Henry — got more than 100 carries last season.) In Fournette’s case, that may be a good thing. Dalvin Cook, Florida State For those who appreciate the small nuances of the running back position, watching Cook play is pure bliss. The former Seminoles star has a rare gift for setting up both blockers and defenders with where he’s going and how fast he’s getting there. Many of the top runners in the league, like Pittsburgh’s Le’Veon Bell and Buffalo’s LeSean McCoy, understand the way their movements affect a defense to the point that they sometimes give off the impression they can see into the future. Exploiting cutback lanes and openings that didn’t exist a second earlier often gets described as vision, but Cook doesn’t have to see a crease to know where one will appear. Cook’s effectiveness in that regard is enhanced by his ability to slow down or speed up in an instant. It doesn’t take long for him to get going after coming to a halt, and that makes it easy for him to manipulate defenders into playing at his tempo. As a receiver, Cook should be able to contribute to most schemes right away. He’ll let the occasional pass hit the ground, and there are moments that he struggles in pass protection when matched up against larger rushers. But both of those issues seem to stem from mental lapses rather than a lack of ability. Of greater concern is Cook’s tendency to fumble; he had 13 over his three seasons at Florida State, including six during the 2016 campaign. That’s a habit that any team thinking about making Cook the focal point of its offense will have to discuss in detail. Cook did himself no favors at the combine, finishing in the single-digit percentiles among running backs in the three-cone drill (seventh) and 20-yard shuttle (sixth). Neither mark indicates much change-of-direction prowess from a non-power back who weighed in at 210 pounds. And even his solid 40-yard dash time (4.49 seconds) is slower than his play speed. Chart via Mockdraftable.com His tape, though, should quell most front-office hesitations. Cook’s natural running skill is undeniable, and he has the potential to make everyone around him better. Christian McCaffrey, Stanford McCaffrey might be the most fascinating back in this year’s class. How high a team takes him and how he’s eventually used are two of the most interesting questions in this draft. A huge chunk of his production at Stanford came on the ground (including 1,603 of his 1,913 yards from scrimmage as a junior), but his frame and style of play both raise concerns about his viability as a traditional runner at the next level. At 202 pounds, McCaffrey is on the small side for a running back. That’s exacerbated by the fact that he stands 5-foot-11, while many of the league’s other small, effective runners (such as Dion Lewis, Gio Bernard, and Danny Woodhead) pack roughly the same amount of bulk onto considerably shorter frames. Even in college, McCaffrey’s lack of power as a rusher was evident. He isn’t going to shed many tackles, and his usefulness in tighter spaces can be limited. He had enough vision to consistently hit big runs in college, but as the lanes become smaller in the NFL, he may have trouble emerging as a reliable early-down option. It’s what he can do on passing downs, though, that makes him an enticing option toward the back of the first round. As a receiving target, McCaffrey should be able to step onto the field and contribute immediately. He catches the ball with ease and is supremely gifted as a route runner. Stanford deployed him in a variety of ways, and McCaffrey looked comfortable doing every one. Whether he was cooking a defensive back on a double move or slicing up a linebacker on an option route, he proved dynamic; creative play designers can and should salivate over his versatility. As the NFL grows increasingly pass-happy, teams are relying on shotgun formations, sub packages, and personnel mismatches more than ever before. That makes backs with McCaffrey’s skill set exceedingly valuable. Even if his appeal is primarily tied to the passing game, McCaffrey is a surefire playmaker. He can be used as a runner in certain formations and as a wideout who can pick apart coverage in others. A Four-Step Guide to Watching Football Like a ScoutAhead of April’s NFL draft, how do you separate the hundreds of prospects from each other? Look not at what they do…theringer.com Alvin Kamara, Tennessee Kamara doesn’t boast the name recognition of the other three guys on this list, but after showcasing ridiculous explosion at the combine (a 39.5-inch vertical jump and a 131-inch broad jump), the former Volunteers running back deserves mention in any conversation about this year’s crop at the position. He had a limited workload during the last two seasons at Tennessee (210 total rushes and only five games in which he racked up 15-plus carries), yet he made an impression with his touches. The first trait that sticks out on tape is his balance, even after contact. Kamara is able to sustain hits and keep on moving, which is just one of the ways he displays body control as a runner. His ability to gather himself before accelerating to top speed is evident on film, and a key reason why his 40-yard dash time (4.56 at the combine) may not be as telling as his explosion numbers. Simply put, he’s a threat to break a big play any time he touches the ball. His decision-making in the open field can be curious, as he has a tendency to run toward tacklers when there’s plenty of space to exploit. That speaks to concerns about his instincts. He can be indecisive when looking for creases that haven’t yet developed; when seams unfold, though, he knows how to make teams pay. That ability is part of what makes Kamara so intriguing as a receiving option. He’s dangerous on screens and can create mismatches from the slot. Plus, he’s adept enough as a route runner to catch passes out of the backfield. Kamara lacks the profile of other backs in this draft, but make no mistake: He has the skills to thrive in the modern NFL. ", "author": "Robert Mays", "parent": ""}