{"name": "2001", "title": "The Heisman Race That Wasn’t", "sentences": [{"810c": "The Heisman Race That Wasn’t"}, {"2024": "Why this season’s most touted running backs failed to live up to the hype"}, {"aea3": "There’s some version of the 2016 college football season in which Lamar Jackson didn’t, by mid-October, already have the Heisman Trophy wrapped up and hanging from his mantel in a Christmas stocking."}, {"3689": "I don’t want to live in that alternate world, where Jackson twisted an ankle or failed to awe us with field-shrinking lopes through Florida State’s secondary. Watching him rupture defenses has been the season’s greatest thrill. But a real Heisman battle would have been an entertaining addition to this eminently predictable campaign, and we should have had one, courtesy of a slew of talented running backs who appeared ready to challenge the award’s quarterback hegemony."}, {"15e4": "Alas, the prospect of those backs trying to one-up each other with 200-yard, three-touchdown outputs every week never materialized. Jackson’s coronation is coming, meaning that for now, the Heisman race that wasn’t is a more interesting story than the Heisman win that’s all but guaranteed."}, {"9452": "In the last decade, the only two running backs to win the Heisman hailed from Alabama, including Derrick Henry last season. No back even approached contention in a number of recent years, but last season signaled a rushing renaissance in the sport. Five running backs finished in the top eight in the 2015 Heisman voting. The last time that happened was 2006; the last time it happened before that was 1987, when a back from Holy Cross finished third in the voting."}, {"f2e0": "We’ve Got Bad News for This Year’s Preseason Heisman FavoritesThey’re about to get stiff-armedtheringer.com"}, {"74c6": "Fresh off that positional resurgence, seven running backs entered the season with 25:1 or better odds to win the trophy, per Bovada. Then the games began, and the stuffed rush attempts and injuries piled up. One by one, the hopefuls’ Heisman chances derailed. LSU’s Leonard Fournette hurt an ankle. Stanford’s Christian McCaffrey hurt, um, something, even if coach David Shaw won’t say exactly what. Georgia’s Nick Chubb lost his open-field magic. And so on."}, {"74e6": "Overall, those seven backs — the above three plus Florida State’s Dalvin Cook, Oregon’s Royce Freeman, Oklahoma’s Samaje Perine, and Alabama’s Bo Scarbrough — are down 31 percent in all-purpose yards per game and 32 percent in touchdowns per game, as compared to their marks from last season. Only Alabama’s Scarbrough has posted better numbers than he did a year ago, except he ranks fourth on his own team in rushing yards and was more of a high-ceiling flier than an actual contender anyway."}, {"7aaa": "It didn’t have to be this way. It shouldn’t have been this way. The field started off so strong, including Chubb, who opened the season with a 222-yard showing against a ranked North Carolina squad in his first game back from a gruesome knee injury. But Chubb’s performance, like his team’s, quickly collapsed."}, {"319e": "The Georgia back has surpassed 100 all-purpose yards just once in six games since Week 1. Part of the problem is the blocking in front of him, as Georgia ranks 100th in FBS in Football Outsiders’ adjusted line yards metric, which measures the offensive line’s contribution to a team’s rushing total. Last year, the Bulldogs ranked 36th; the year before, when Chubb ascended to the national scene, Georgia ranked fourth."}, {"6c5f": "Even when he’s had holes, though, Chubb’s typical burst hasn’t been present. Since Week 1, he’s had only one rush of 20-plus yards. The disappearance of long runs has been a common factor behind these backs’ 2016 declines. Perine, who has reached 100 yards rushing in just one game this year and will miss at least two weeks with a hamstring injury, has a season-long run of just 30 yards, after he managed five runs that exceeded that length last year. In the first half of last season, Fournette had rushes of 71, 62, 75, and 87 yards; this year, he has no runs longer than 35."}, {"7025": "The lack of big plays hasn’t just harmed these backs’ numbers; they’ve also reflected the minimal impact they’ve had on the national landscape this year. Last season was full of big rushing moments, from Fournette turning defenders into bowling pins, to McCaffrey giving viewers a dose of his weekly wizardry, to eventual Heisman winner Henry running over, through, and around — pick any preposition, basically — wannabe tacklers."}, {"c00a": "College Football’s Best Defender Is a PoetTexas A&M star Myles Garrett is so much more than a pass rushertheringer.com"}, {"f179": "It’s not as if big runs as a whole are down, either. Just look at LSU, where backup Derrius Guice is tied for the FBS lead with 11 carries of 20-plus yards. For the season, Guice is outrushing Fournette by 178 yards and four touchdowns despite receiving five fewer carries than his more touted teammate. Even with Fournette slated to return to the lineup this weekend after missing three games in the season’s first half, Guice’s performance should transform LSU’s rushing attack into more of a timeshare than it has been thus far in Fournette’s career."}, {"050c": "There’s another, perhaps more obvious factor behind these backs’ statistical downturns: Their teams just aren’t very good. Besides Scarbrough’s Tide, all of those teams already have multiple losses. Stanford, Georgia, and Oregon are among the country’s biggest disappointments on a teamwide level; LSU fired its coach; and Oklahoma and Florida State lost their national title aspirations in September."}, {"0f57": "When their teams fall behind by large margins early in games, it’s hard for backs to amass yardage — McCaffrey had only a dozen carries in Stanford’s 44–6 loss to Washington last month — and when teams are falling behind specifically because of woeful passing attacks, it’s hard for backs to weave their way between eight defenders in the box, no matter how talented they might be."}, {"e7dc": "McCaffrey is the most extreme example here, as Stanford ranks 116th in the country in passing yards per game. The multipurpose back has been good when he’s played, but “good” wasn’t what fans expected after he set the national record for all-purpose yardage last year as a sophomore. He’s yet to deliver a breathtaking kick return, and without a reliable quarterback to relieve pressure from the running game, his rushing numbers have stalled: In half of his games a year ago, McCaffrey averaged more than 6 yards per rush, and he hasn’t reached that number once this season. His big-play frequency has stalled, too: His nine plays of 50-plus yards and seven of 60-plus from last year have fallen to two and zero, respectively, so far in 2016."}, {"c718": "McCaffrey still holds slim Heisman odds — 50:1, per Bovada’s latest update — but it’s hard to imagine him rebounding from a stretch that’s seen him manage just 84 rushing yards in three weeks. Only Florida State’s Cook (33:1 odds), who has picked up his pace after a slow start and has a chance to shine against no. 4 Clemson in two weeks, has any realistic shot to contend from the running back position this year."}, {"0bdb": "Then again, that distinction may be overlooking the actual best runner in the country. Sure, he happens to play the quarterback position, but Jackson ranks third in the country in rushing yards per game, first in rushing touchdowns, and first in yards per rush (minimum 100 attempts). The ground-bound Heisman battle we were promised never unfolded, yet that’s not just because the aforementioned seven backs failed to perform: Given his highlight-worthy improvisations and statistical production, Jackson might have run away from the competition anyway."}], "child": "2001_1\t2001_2", "timestamp": "Oct 21, 2016", "content": "The Heisman Race That Wasn’t Why this season’s most touted running backs failed to live up to the hype There’s some version of the 2016 college football season in which Lamar Jackson didn’t, by mid-October, already have the Heisman Trophy wrapped up and hanging from his mantel in a Christmas stocking. I don’t want to live in that alternate world, where Jackson twisted an ankle or failed to awe us with field-shrinking lopes through Florida State’s secondary. Watching him rupture defenses has been the season’s greatest thrill. But a real Heisman battle would have been an entertaining addition to this eminently predictable campaign, and we should have had one, courtesy of a slew of talented running backs who appeared ready to challenge the award’s quarterback hegemony. Alas, the prospect of those backs trying to one-up each other with 200-yard, three-touchdown outputs every week never materialized. Jackson’s coronation is coming, meaning that for now, the Heisman race that wasn’t is a more interesting story than the Heisman win that’s all but guaranteed. In the last decade, the only two running backs to win the Heisman hailed from Alabama, including Derrick Henry last season. No back even approached contention in a number of recent years, but last season signaled a rushing renaissance in the sport. Five running backs finished in the top eight in the 2015 Heisman voting. The last time that happened was 2006; the last time it happened before that was 1987, when a back from Holy Cross finished third in the voting. We’ve Got Bad News for This Year’s Preseason Heisman FavoritesThey’re about to get stiff-armedtheringer.com Fresh off that positional resurgence, seven running backs entered the season with 25:1 or better odds to win the trophy, per Bovada. Then the games began, and the stuffed rush attempts and injuries piled up. One by one, the hopefuls’ Heisman chances derailed. LSU’s Leonard Fournette hurt an ankle. Stanford’s Christian McCaffrey hurt, um, something, even if coach David Shaw won’t say exactly what. Georgia’s Nick Chubb lost his open-field magic. And so on. Overall, those seven backs — the above three plus Florida State’s Dalvin Cook, Oregon’s Royce Freeman, Oklahoma’s Samaje Perine, and Alabama’s Bo Scarbrough — are down 31 percent in all-purpose yards per game and 32 percent in touchdowns per game, as compared to their marks from last season. Only Alabama’s Scarbrough has posted better numbers than he did a year ago, except he ranks fourth on his own team in rushing yards and was more of a high-ceiling flier than an actual contender anyway. It didn’t have to be this way. It shouldn’t have been this way. The field started off so strong, including Chubb, who opened the season with a 222-yard showing against a ranked North Carolina squad in his first game back from a gruesome knee injury. But Chubb’s performance, like his team’s, quickly collapsed. The Georgia back has surpassed 100 all-purpose yards just once in six games since Week 1. Part of the problem is the blocking in front of him, as Georgia ranks 100th in FBS in Football Outsiders’ adjusted line yards metric, which measures the offensive line’s contribution to a team’s rushing total. Last year, the Bulldogs ranked 36th; the year before, when Chubb ascended to the national scene, Georgia ranked fourth. Even when he’s had holes, though, Chubb’s typical burst hasn’t been present. Since Week 1, he’s had only one rush of 20-plus yards. The disappearance of long runs has been a common factor behind these backs’ 2016 declines. Perine, who has reached 100 yards rushing in just one game this year and will miss at least two weeks with a hamstring injury, has a season-long run of just 30 yards, after he managed five runs that exceeded that length last year. In the first half of last season, Fournette had rushes of 71, 62, 75, and 87 yards; this year, he has no runs longer than 35. The lack of big plays hasn’t just harmed these backs’ numbers; they’ve also reflected the minimal impact they’ve had on the national landscape this year. Last season was full of big rushing moments, from Fournette turning defenders into bowling pins, to McCaffrey giving viewers a dose of his weekly wizardry, to eventual Heisman winner Henry running over, through, and around — pick any preposition, basically — wannabe tacklers. College Football’s Best Defender Is a PoetTexas A&M star Myles Garrett is so much more than a pass rushertheringer.com It’s not as if big runs as a whole are down, either. Just look at LSU, where backup Derrius Guice is tied for the FBS lead with 11 carries of 20-plus yards. For the season, Guice is outrushing Fournette by 178 yards and four touchdowns despite receiving five fewer carries than his more touted teammate. Even with Fournette slated to return to the lineup this weekend after missing three games in the season’s first half, Guice’s performance should transform LSU’s rushing attack into more of a timeshare than it has been thus far in Fournette’s career. There’s another, perhaps more obvious factor behind these backs’ statistical downturns: Their teams just aren’t very good. Besides Scarbrough’s Tide, all of those teams already have multiple losses. Stanford, Georgia, and Oregon are among the country’s biggest disappointments on a teamwide level; LSU fired its coach; and Oklahoma and Florida State lost their national title aspirations in September. When their teams fall behind by large margins early in games, it’s hard for backs to amass yardage — McCaffrey had only a dozen carries in Stanford’s 44–6 loss to Washington last month — and when teams are falling behind specifically because of woeful passing attacks, it’s hard for backs to weave their way between eight defenders in the box, no matter how talented they might be. McCaffrey is the most extreme example here, as Stanford ranks 116th in the country in passing yards per game. The multipurpose back has been good when he’s played, but “good” wasn’t what fans expected after he set the national record for all-purpose yardage last year as a sophomore. He’s yet to deliver a breathtaking kick return, and without a reliable quarterback to relieve pressure from the running game, his rushing numbers have stalled: In half of his games a year ago, McCaffrey averaged more than 6 yards per rush, and he hasn’t reached that number once this season. His big-play frequency has stalled, too: His nine plays of 50-plus yards and seven of 60-plus from last year have fallen to two and zero, respectively, so far in 2016. McCaffrey still holds slim Heisman odds — 50:1, per Bovada’s latest update — but it’s hard to imagine him rebounding from a stretch that’s seen him manage just 84 rushing yards in three weeks. Only Florida State’s Cook (33:1 odds), who has picked up his pace after a slow start and has a chance to shine against no. 4 Clemson in two weeks, has any realistic shot to contend from the running back position this year. Then again, that distinction may be overlooking the actual best runner in the country. Sure, he happens to play the quarterback position, but Jackson ranks third in the country in rushing yards per game, first in rushing touchdowns, and first in yards per rush (minimum 100 attempts). The ground-bound Heisman battle we were promised never unfolded, yet that’s not just because the aforementioned seven backs failed to perform: Given his highlight-worthy improvisations and statistical production, Jackson might have run away from the competition anyway. ", "author": "Zach Kram", "parent": ""}