{"name": "2010", "title": "Lamar Jackson Is Part Messiah, Part Mystery", "sentences": [{"0621": "Lamar Jackson Is Part Messiah, Part Mystery"}, {"fadc": "Heading into a crucial matchup with Florida State, it’s unclear if Louisville’s quarterback is a future Heisman winner or a flavor of the month. Either way, he’s fun as hell to watch."}, {"729c": "One of the joys of the beginning of each college football season is its knack for generating surprise superstars. A lot of this comes down to basic math: There are 128 teams in the FBS, and an average of more than 100 players per roster, meaning, by a conservative estimate, there are upward of 13,000 players at the NCAA’s top level. That makes it virtually impossible to keep track of all the nation’s major roster developments, and also tough (but not unheard of!) to predict who will emerge as the Next Big Thing. There are just too many guys in the running, and for every Johnny Manziel there’s a Jeremy Johnson; for every Trevone Boykin, a Gunner Kiel."}, {"cb17": "This helps explain why, for all the time devoted this offseason to fawning over Christian McCaffrey, Leonard Fournette, and Deshaun Watson, many fans and analysts failed to properly hype Louisville quarterback Lamar Jackson. The sophomore showed flashes in 2015, capping his inconsistent freshman campaign with a clinical dissection of Texas A&M in last December’s Music City Bowl. But few anticipated what would happen next: Jackson ripping off his everyman disguise to reveal the full-fledged football superhero beneath."}, {"5384": "Through the first two weeks of the 2016 season, Jackson has accounted for 1,015 yards of total offense with 13 touchdowns. During the Cardinals’ 62–28 win at Syracuse last Friday, he fell 1 rushing yard shy of becoming the first player in FBS history to pass for 400 yards and run for 200 in the same game. He is 6-foot-3 and 205 pounds and plays much like the dual-threat quarterback on your favorite college team, if only that QB were faster, taller, stronger, and generally way better at football. Jackson, who has already drawn comparisons to Denard Robinson and Michael Vick, resembles the type of player you would assemble in a lab: He boasts top-flight sprinter speed, impressive pocket awareness, and an absolute cannon for an arm."}, {"c9d5": "In the blink of an eye, Jackson has gone from a promising but unproven project to the front-runner sitting atop every Heisman Trophy watch list; Louisville has vaulted from intriguing ACC dark horse to the no. 10 team in the AP poll. Heading into Saturday’s clash with no. 2 Florida State, Jackson has become a bona fide phenomenon while also somehow remaining an unknown."}, {"27c6": "Jackson was born on January 7, 1997, which makes him younger than the movie Independence Day, but old enough to decimate any defense standing in his path. He attended Boynton Beach (Fla.) High prior to heading to Louisville, and he feigned that he might commit to Florida before signing with the Cardinals on February 4, 2015."}, {"d885": "As happens with any player who suddenly rockets from relative anonymity into the spotlight, tidbits from Jackson’s past have begun to go viral, painting a scattered but still incomplete picture of who he is. These snapshots naturally facilitate a bit of mythologizing, which makes sense: Just look at this freaking clip."}, {"da34": "As a high school senior, Jackson racked up 1,293 passing yards, 1,039 rushing yards, and 39 total touchdowns for a Boynton Beach squad that finished 9–2. He was rated as a composite three-star recruit, according to 247Sports.com, and named to the Florida Class 6A all-state team. Yet none of that is nearly as significant as the fact that he once pulled off a move that’s the football equivalent of braking while a car in pursuit speeds aimlessly past. That juke is a Looney Tunes–caliber fakeout."}, {"3bdc": "Dig a little deeper, and it’s clear that Jackson has done similarly ridiculous things at other points in his life. There was the time he drained a one-handed, full-court basketball shot; the time he dusted Rajon Rondo in a footrace; the time he sat next to sophomore wide receiver Traveon Samuel on the bench so that their jerseys spelled out SAMUEL L. JACKSON, an act of God that prompted a shout-out from the actor himself. And, of course, there was the time that he casually chucked a football 95 yards through the air."}, {"449c": "After the Louisville quarterback made his college debut at Auburn last September, a game in which he threw for 100 yards, rushed for 106 more, and almost brought the Cardinals back from a 24–0 deficit, Tigers coach Gus Malzahn said: “That freshman quarterback, he’s electric. … He’s going to be hard to deal with.” In retrospect, we should have known then that Jackson was going to be something special."}, {"e576": "A Scientific Examination of Alabama-Ole Miss\"We can do science,\" Carl Sagan wrote in , \"and with it we can improve our lives.\" So let us do science*, and by so…theringer.com"}, {"1b0c": "But there’s a reason he came into the 2016 season on the fringes of the national conversation, and that’s because his freshman season was more than just a four-month highlight of him stunting on people. He was benched in favor of Kyle Bolin for extended stretches of the 2015 campaign, and he went a combined 17-of-38 passing for 271 yards in two uninspiring outings prior to his destruction of Texas A&M in last year’s bowl game. For as gaudy as his numbers were last fall — 1,840 passing yards and 960 rushing yards with 23 total touchdowns — he also went through his progressions at an astonishingly slow pace, a tendency that SB Nation’s Ian Boyd broke down in excellent detail in June. It’s plausible that Jackson’s 2016 performances against Charlotte and Syracuse were primarily the product of the defenses he was playing against; they had a better chance of stopping Jackson than you, me, and nine random strangers, but not by a whole lot."}, {"2d38": "This is where we are at with Jackson. He’s wowed us, bursting onto the scene as college football’s September darling, but we’re not quite sure if it’s safe to really believe. Entering this weekend, he’s both a messiah and a mystery."}, {"a643": "It’s worth noting that there are plenty of other story lines surrounding the Cardinals’ showdown with Florida State. For Louisville, this is being billed as the biggest game in program history, despite the Cards’ 2013 victory in the Sugar Bowl and 2006 triumph over West Virginia in a matchup between top-five teams. ESPN’s College GameDay will be in attendance, and a win would assuredly launch the program into the thick of the College Football Playoff race. It’s also remarkable that we’ve made it this far into a story about Louisville without even mentioning Bobby Petrino — the man, the myth, and the motorcycle — whose reputation is hideous but offensive acumen is beyond reproach."}, {"f1b1": "Jim Harbaugh Isn’t a Football Coach — He’s an ExperienceWhat’s it like inside this Michigan Man’s brain?theringer.com"}, {"23fe": "From the Seminoles’ standpoint, this game is equally fascinating, as they too have a supremely gifted young quarterback in redshirt freshman Deondre Francois. After he struggled in the first half of this year’s opener against Ole Miss, Francois channeled his inner Jameis Winston, finishing with 478 total yards and two touchdowns in a 45–34 win. He followed that up by shredding Charleston Southern in a 52–8 rout, and his play will be especially critical now that Florida State has lost star safety Derwin James to a meniscus tear. The Noles remain title contenders, but they may be in a strangely vulnerable spot."}, {"4571": "Above all, though, this game will serve as the nation’s formal introduction to Jackson. Some may have seen him run circles around A&M, or hurdle Syracuse’s helpless defenders, and their reaction probably went something like this baby’s after tasting ice cream for the first time. Jackson has the upside to push Clemson’s Watson as the best quarterback in the nation, but he also could just as easily go the way of another September Heisman favorite, declining in the second half before eventually free-falling in the NFL draft and settling into a role as the unheralded backup for the Jets."}, {"4776": "Saturday’s game represents a showcase for Louisville as a whole, but this is Jackson’s moment. He’s off to a record-setting start. He has our attention. All he has to do now is keep playing like the greatest college football quarterback who ever lived."}], "child": "2010_1", "timestamp": "Sep 16, 2016", "content": "Lamar Jackson Is Part Messiah, Part Mystery Heading into a crucial matchup with Florida State, it’s unclear if Louisville’s quarterback is a future Heisman winner or a flavor of the month. Either way, he’s fun as hell to watch. One of the joys of the beginning of each college football season is its knack for generating surprise superstars. A lot of this comes down to basic math: There are 128 teams in the FBS, and an average of more than 100 players per roster, meaning, by a conservative estimate, there are upward of 13,000 players at the NCAA’s top level. That makes it virtually impossible to keep track of all the nation’s major roster developments, and also tough (but not unheard of!) to predict who will emerge as the Next Big Thing. There are just too many guys in the running, and for every Johnny Manziel there’s a Jeremy Johnson; for every Trevone Boykin, a Gunner Kiel. This helps explain why, for all the time devoted this offseason to fawning over Christian McCaffrey, Leonard Fournette, and Deshaun Watson, many fans and analysts failed to properly hype Louisville quarterback Lamar Jackson. The sophomore showed flashes in 2015, capping his inconsistent freshman campaign with a clinical dissection of Texas A&M in last December’s Music City Bowl. But few anticipated what would happen next: Jackson ripping off his everyman disguise to reveal the full-fledged football superhero beneath. Through the first two weeks of the 2016 season, Jackson has accounted for 1,015 yards of total offense with 13 touchdowns. During the Cardinals’ 62–28 win at Syracuse last Friday, he fell 1 rushing yard shy of becoming the first player in FBS history to pass for 400 yards and run for 200 in the same game. He is 6-foot-3 and 205 pounds and plays much like the dual-threat quarterback on your favorite college team, if only that QB were faster, taller, stronger, and generally way better at football. Jackson, who has already drawn comparisons to Denard Robinson and Michael Vick, resembles the type of player you would assemble in a lab: He boasts top-flight sprinter speed, impressive pocket awareness, and an absolute cannon for an arm. In the blink of an eye, Jackson has gone from a promising but unproven project to the front-runner sitting atop every Heisman Trophy watch list; Louisville has vaulted from intriguing ACC dark horse to the no. 10 team in the AP poll. Heading into Saturday’s clash with no. 2 Florida State, Jackson has become a bona fide phenomenon while also somehow remaining an unknown. Jackson was born on January 7, 1997, which makes him younger than the movie Independence Day, but old enough to decimate any defense standing in his path. He attended Boynton Beach (Fla.) High prior to heading to Louisville, and he feigned that he might commit to Florida before signing with the Cardinals on February 4, 2015. As happens with any player who suddenly rockets from relative anonymity into the spotlight, tidbits from Jackson’s past have begun to go viral, painting a scattered but still incomplete picture of who he is. These snapshots naturally facilitate a bit of mythologizing, which makes sense: Just look at this freaking clip. As a high school senior, Jackson racked up 1,293 passing yards, 1,039 rushing yards, and 39 total touchdowns for a Boynton Beach squad that finished 9–2. He was rated as a composite three-star recruit, according to 247Sports.com, and named to the Florida Class 6A all-state team. Yet none of that is nearly as significant as the fact that he once pulled off a move that’s the football equivalent of braking while a car in pursuit speeds aimlessly past. That juke is a Looney Tunes–caliber fakeout. Dig a little deeper, and it’s clear that Jackson has done similarly ridiculous things at other points in his life. There was the time he drained a one-handed, full-court basketball shot; the time he dusted Rajon Rondo in a footrace; the time he sat next to sophomore wide receiver Traveon Samuel on the bench so that their jerseys spelled out SAMUEL L. JACKSON, an act of God that prompted a shout-out from the actor himself. And, of course, there was the time that he casually chucked a football 95 yards through the air. After the Louisville quarterback made his college debut at Auburn last September, a game in which he threw for 100 yards, rushed for 106 more, and almost brought the Cardinals back from a 24–0 deficit, Tigers coach Gus Malzahn said: “That freshman quarterback, he’s electric. … He’s going to be hard to deal with.” In retrospect, we should have known then that Jackson was going to be something special. A Scientific Examination of Alabama-Ole Miss\"We can do science,\" Carl Sagan wrote in , \"and with it we can improve our lives.\" So let us do science*, and by so…theringer.com But there’s a reason he came into the 2016 season on the fringes of the national conversation, and that’s because his freshman season was more than just a four-month highlight of him stunting on people. He was benched in favor of Kyle Bolin for extended stretches of the 2015 campaign, and he went a combined 17-of-38 passing for 271 yards in two uninspiring outings prior to his destruction of Texas A&M in last year’s bowl game. For as gaudy as his numbers were last fall — 1,840 passing yards and 960 rushing yards with 23 total touchdowns — he also went through his progressions at an astonishingly slow pace, a tendency that SB Nation’s Ian Boyd broke down in excellent detail in June. It’s plausible that Jackson’s 2016 performances against Charlotte and Syracuse were primarily the product of the defenses he was playing against; they had a better chance of stopping Jackson than you, me, and nine random strangers, but not by a whole lot. This is where we are at with Jackson. He’s wowed us, bursting onto the scene as college football’s September darling, but we’re not quite sure if it’s safe to really believe. Entering this weekend, he’s both a messiah and a mystery. It’s worth noting that there are plenty of other story lines surrounding the Cardinals’ showdown with Florida State. For Louisville, this is being billed as the biggest game in program history, despite the Cards’ 2013 victory in the Sugar Bowl and 2006 triumph over West Virginia in a matchup between top-five teams. ESPN’s College GameDay will be in attendance, and a win would assuredly launch the program into the thick of the College Football Playoff race. It’s also remarkable that we’ve made it this far into a story about Louisville without even mentioning Bobby Petrino — the man, the myth, and the motorcycle — whose reputation is hideous but offensive acumen is beyond reproach. Jim Harbaugh Isn’t a Football Coach — He’s an ExperienceWhat’s it like inside this Michigan Man’s brain?theringer.com From the Seminoles’ standpoint, this game is equally fascinating, as they too have a supremely gifted young quarterback in redshirt freshman Deondre Francois. After he struggled in the first half of this year’s opener against Ole Miss, Francois channeled his inner Jameis Winston, finishing with 478 total yards and two touchdowns in a 45–34 win. He followed that up by shredding Charleston Southern in a 52–8 rout, and his play will be especially critical now that Florida State has lost star safety Derwin James to a meniscus tear. The Noles remain title contenders, but they may be in a strangely vulnerable spot. Above all, though, this game will serve as the nation’s formal introduction to Jackson. Some may have seen him run circles around A&M, or hurdle Syracuse’s helpless defenders, and their reaction probably went something like this baby’s after tasting ice cream for the first time. Jackson has the upside to push Clemson’s Watson as the best quarterback in the nation, but he also could just as easily go the way of another September Heisman favorite, declining in the second half before eventually free-falling in the NFL draft and settling into a role as the unheralded backup for the Jets. Saturday’s game represents a showcase for Louisville as a whole, but this is Jackson’s moment. He’s off to a record-setting start. He has our attention. All he has to do now is keep playing like the greatest college football quarterback who ever lived. ", "author": "Ben Glicksman", "parent": ""}