{"name": "2019", "title": "Leonard Fournette Is Testing the Process", "sentences": [{"3e38": "NFL Combine Daily Dispatch"}, {"bceb": "Leonard Fournette Is Testing the Process"}, {"e7d9": "What matters more: explosion or speed? The LSU running back’s draft stock following his combine workout might settle that ongoing draft debate. Plus, more takeaways from Friday’s action in Indy."}, {"ba15": "The 2017 NFL combine has arrived, meaning it’s time for prospects to perform drills in their underwear, franchises to chart their futures, and anonymous scouts to provide irresponsible quotes. So who and what is creating the most buzz? The Ringer NFL staff has you covered, providing five thoughts from each day in Indianapolis."}, {"12c1": "1. Leonard Fournette isn’t just facing off against his fellow running backs — he’s facing off against NFL trends. Draft stock is a funny thing at this time of year. Great players with hours of tape proving their greatness can still see their stock rise or fall on a seemingly day-by-day, drill-by-drill basis. This year, that’s been especially true for Fournette, the LSU product who was marked for stardom before he ever stepped foot on campus."}, {"20cc": "Fournette’s weight (240) scared teams earlier this week, and his vertical jump (28.5 inches) scared them even more."}, {"710e": "The buzz in Indianapolis following that 28-inch jump was predictable; the team employees I chatted with wondered if Fournette was perhaps not the athletic freak he was once thought to be."}, {"976f": "But for some scouts, that notion quickly dissipated, with Fournette’s stock rising again as quickly as it had fallen after the running back posted a 4.51 40-yard dash time, impressive for a player of his size."}, {"7f34": "The seesawing discussion surrounding Fournette mirrors the debate taking place in NFL front offices around the country: What combine drills are actually important? In recent years, the 40-yard dash has begun to carry less weight, with even Wade Phillips coming out of the woodwork to take a shot at the drill:"}, {"de33": "Instead of overvaluing fast 40s, teams are increasingly looking at “explosion” — namely, jumping ability and cutting ability. Fournette still has a chance to jump high and far at his pro day, but with more successful NFL teams looking at drills like the vertical and broad jump as predictors of professional burst, the poor numbers Fournette posted on Friday may end up hurting him more than his impressive 40 time helps him."}, {"1b4b": "The Draft Trend Uniting This Season’s Playoff FieldIt’s explosivetheringer.com"}, {"c13f": "2. Christian McCaffrey and Alvin Kamara are making a run. NFL teams focused on explosion found running backs other than Fournette to drool over on Friday. The first was Tennessee’s Kamara, who led running backs in the vertical jump (39.5) and broad jump (10 feet, 11 inches). Scouts Inc. ranks Kamara 30th overall, but the former Vol could see a bump if teams fall in love with how he tested on Friday. The other is Stanford’s McCaffrey, whose 6.53-second 3-cone drill was the second best among running backs since 2003."}, {"4aba": "Earlier this week, McCaffrey said he didn’t think there was anyone in this draft class who could be as versatile as he can “as far as running between the tackles, outside pass protect, play X, Z, slot and do a lot of things in the return game as well.” It’s rare to see such an athlete who can play so many positions, and his testing numbers (aside from his paltry 10 bench-press reps) will rocket him up draft boards."}, {"db43": "3. The combine gave us a reason to quote No Country for Old Men. We live in an age of hyperbole, but believe me when I say that Friday’s combine events gave us the greatest moment in football history. The NFL, innovative as ever, decided to publicly stage a coin flip for the 14th pick in the draft, for which the Vikings and Colts had tied. However, the Vikings shipped their pick to Philadelphia in the Sam Bradford trade, so the toss was actually between the Eagles and Colts. The NFL wrangled Eagles executive VP Howie Roseman, Colts general manager Chris Ballard, and, bizarrely, Vikings general manager Rick Spielman (who, again, does not have a dog in this fight) on a stage in the middle of the combine. The excitement was palpable."}, {"2a58": "This took place in the middle of the combine, meaning it was during a time when the talent evaluators in question should have been watching prospects. They were understandably annoyed at having to participate in the show: Spielman made two references onstage to wanting to leave; Ballard, when asked about taking over the Colts, simply said that he wanted to flip the coin as soon as possible. They were as honest as you’ll ever see NFL executives be in public."}, {"f0fd": "Anyway, the Eagles won the toss, Roseman mockingly raised his arms, and the executives hurried off the stage. Is it too soon to request that all 250-plus picks be decided in this fashion next season?"}, {"690b": "4. Some curious teams are meeting with top quarterbacks. It’s not usually newsworthy when teams meet with players, but at the combine, only 60 formal interviews are allowed per franchise. So when a team whose roster is already set at a given position decides to use some of its interview slots on a highly rated player from that group, it raises some eyebrows. Enter Mitch Trubisky, who’s considered one of the top QB prospects, and who revealed on Friday that he’s met with the Chiefs, Chargers, and Saints, who are all currently have entrenched quarterbacks but may be looking for a future piece to stash away. The Chiefs and Saints also met with Deshaun Watson."}, {"a757": "It’s clear that, given the uncertainty over where this year’s top quarterbacks will go, some teams that are covered at the position have decided to keep an eye on some of the top passers just in case they stumble into a value that’s too tempting to ignore. Remember, Aaron Rodgers was supposed to go first overall in 2005, but he wound up falling to pick 24, where the Green Bay Packers selected him even though they still had Brett Favre. Of course, the Packers used a similar strategy three years later when Brian Brohm fell out of the first round, and he wound up being terrible. But still! It’s always worth watching when teams with good quarterbacks talk to other quarterbacks."}, {"7acc": "5. Speaking of talking quarterbacks: Remember that passers are always prepared to speak in clichés. Last month, while accepting an award in Texas, Watson joked that the Cowboys should trade Tony Romo and Dak Prescott to the Browns and draft him instead. Not surprisingly, that bit got lumped in with the other 3 million jokes made at the Browns’ expense, and on Friday, Watson had to clarify that he would in fact play for Cleveland."}, {"d67b": "This was the most exciting thing a quarterback said on Friday. Really. It was kind of a weird day for the position. None of these players are sure-fire future NFL stars, so naturally, they were mostly asked about their faults. Trubisky said that every team is asking him about his lack of starting experience — just one season — and that he’s telling them he’s a “student of the game.” He talked extensively about what a football junkie he is. Not a big surprise. DeShone Kizer, meanwhile, got peppered with questions about his 4–8 season at Notre Dame, which he explained by saying he “didn’t make enough plays.” These passers clearly had a plan to handle criticism with clichés, and the approach proved effective: They avoided making news — and they made Cleveland happy."}], "child": "2019_1\t2019_2", "timestamp": "Mar 3", "content": "NFL Combine Daily Dispatch Leonard Fournette Is Testing the Process What matters more: explosion or speed? The LSU running back’s draft stock following his combine workout might settle that ongoing draft debate. Plus, more takeaways from Friday’s action in Indy. The 2017 NFL combine has arrived, meaning it’s time for prospects to perform drills in their underwear, franchises to chart their futures, and anonymous scouts to provide irresponsible quotes. So who and what is creating the most buzz? The Ringer NFL staff has you covered, providing five thoughts from each day in Indianapolis. 1. Leonard Fournette isn’t just facing off against his fellow running backs — he’s facing off against NFL trends. Draft stock is a funny thing at this time of year. Great players with hours of tape proving their greatness can still see their stock rise or fall on a seemingly day-by-day, drill-by-drill basis. This year, that’s been especially true for Fournette, the LSU product who was marked for stardom before he ever stepped foot on campus. Fournette’s weight (240) scared teams earlier this week, and his vertical jump (28.5 inches) scared them even more. The buzz in Indianapolis following that 28-inch jump was predictable; the team employees I chatted with wondered if Fournette was perhaps not the athletic freak he was once thought to be. But for some scouts, that notion quickly dissipated, with Fournette’s stock rising again as quickly as it had fallen after the running back posted a 4.51 40-yard dash time, impressive for a player of his size. The seesawing discussion surrounding Fournette mirrors the debate taking place in NFL front offices around the country: What combine drills are actually important? In recent years, the 40-yard dash has begun to carry less weight, with even Wade Phillips coming out of the woodwork to take a shot at the drill: Instead of overvaluing fast 40s, teams are increasingly looking at “explosion” — namely, jumping ability and cutting ability. Fournette still has a chance to jump high and far at his pro day, but with more successful NFL teams looking at drills like the vertical and broad jump as predictors of professional burst, the poor numbers Fournette posted on Friday may end up hurting him more than his impressive 40 time helps him. The Draft Trend Uniting This Season’s Playoff FieldIt’s explosivetheringer.com 2. Christian McCaffrey and Alvin Kamara are making a run. NFL teams focused on explosion found running backs other than Fournette to drool over on Friday. The first was Tennessee’s Kamara, who led running backs in the vertical jump (39.5) and broad jump (10 feet, 11 inches). Scouts Inc. ranks Kamara 30th overall, but the former Vol could see a bump if teams fall in love with how he tested on Friday. The other is Stanford’s McCaffrey, whose 6.53-second 3-cone drill was the second best among running backs since 2003. Earlier this week, McCaffrey said he didn’t think there was anyone in this draft class who could be as versatile as he can “as far as running between the tackles, outside pass protect, play X, Z, slot and do a lot of things in the return game as well.” It’s rare to see such an athlete who can play so many positions, and his testing numbers (aside from his paltry 10 bench-press reps) will rocket him up draft boards. 3. The combine gave us a reason to quote No Country for Old Men. We live in an age of hyperbole, but believe me when I say that Friday’s combine events gave us the greatest moment in football history. The NFL, innovative as ever, decided to publicly stage a coin flip for the 14th pick in the draft, for which the Vikings and Colts had tied. However, the Vikings shipped their pick to Philadelphia in the Sam Bradford trade, so the toss was actually between the Eagles and Colts. The NFL wrangled Eagles executive VP Howie Roseman, Colts general manager Chris Ballard, and, bizarrely, Vikings general manager Rick Spielman (who, again, does not have a dog in this fight) on a stage in the middle of the combine. The excitement was palpable. This took place in the middle of the combine, meaning it was during a time when the talent evaluators in question should have been watching prospects. They were understandably annoyed at having to participate in the show: Spielman made two references onstage to wanting to leave; Ballard, when asked about taking over the Colts, simply said that he wanted to flip the coin as soon as possible. They were as honest as you’ll ever see NFL executives be in public. Anyway, the Eagles won the toss, Roseman mockingly raised his arms, and the executives hurried off the stage. Is it too soon to request that all 250-plus picks be decided in this fashion next season? 4. Some curious teams are meeting with top quarterbacks. It’s not usually newsworthy when teams meet with players, but at the combine, only 60 formal interviews are allowed per franchise. So when a team whose roster is already set at a given position decides to use some of its interview slots on a highly rated player from that group, it raises some eyebrows. Enter Mitch Trubisky, who’s considered one of the top QB prospects, and who revealed on Friday that he’s met with the Chiefs, Chargers, and Saints, who are all currently have entrenched quarterbacks but may be looking for a future piece to stash away. The Chiefs and Saints also met with Deshaun Watson. It’s clear that, given the uncertainty over where this year’s top quarterbacks will go, some teams that are covered at the position have decided to keep an eye on some of the top passers just in case they stumble into a value that’s too tempting to ignore. Remember, Aaron Rodgers was supposed to go first overall in 2005, but he wound up falling to pick 24, where the Green Bay Packers selected him even though they still had Brett Favre. Of course, the Packers used a similar strategy three years later when Brian Brohm fell out of the first round, and he wound up being terrible. But still! It’s always worth watching when teams with good quarterbacks talk to other quarterbacks. 5. Speaking of talking quarterbacks: Remember that passers are always prepared to speak in clichés. Last month, while accepting an award in Texas, Watson joked that the Cowboys should trade Tony Romo and Dak Prescott to the Browns and draft him instead. Not surprisingly, that bit got lumped in with the other 3 million jokes made at the Browns’ expense, and on Friday, Watson had to clarify that he would in fact play for Cleveland. This was the most exciting thing a quarterback said on Friday. Really. It was kind of a weird day for the position. None of these players are sure-fire future NFL stars, so naturally, they were mostly asked about their faults. Trubisky said that every team is asking him about his lack of starting experience — just one season — and that he’s telling them he’s a “student of the game.” He talked extensively about what a football junkie he is. Not a big surprise. DeShone Kizer, meanwhile, got peppered with questions about his 4–8 season at Notre Dame, which he explained by saying he “didn’t make enough plays.” These passers clearly had a plan to handle criticism with clichés, and the approach proved effective: They avoided making news — and they made Cleveland happy. ", "author": "Kevin Clark", "parent": ""}