{"name": "2025", "title": "Myles Garrett Should Be the No. 1 Pick", "sentences": [{"b280": "NFL Combine Daily Dispatch"}, {"de40": "Myles Garrett Should Be the No. 1 Pick"}, {"d2d0": "He looks the part, he plays the part, and he broad-jumps the part, too. Plus, Jabrill Peppers is good at running, cutting, and leaping — but is he good at football?"}, {"eebb": "The 2017 NFL combine has arrived, meaning it’s time for prospects to perform drills in their underwear, franchises to chart their futures, and anonymous scouts to provide irresponsible quotes. So who and what is creating the most buzz? The Ringer NFL staff has you covered, providing five thoughts from each day in Indianapolis."}, {"21a0": "1. Myles Garrett made things simple for the Browns at no. 1. With an otherworldly athletic showing on Sunday, Garrett may have erased any doubts among Cleveland’s brass that he deserves to be first off the board. The former Texas A&M pass rusher followed up an impressive performance on the bench press Saturday (he repped out 225 pounds 33 times, second among defensive linemen to Auburn’s Carl Lawson’s 35) by running a 4.64 40-yard dash, jumping 41 inches in the vert, and leaping 10-foot-8 in the broad jump. That’s crazy explosiveness for a 6-foot-4, 272-pound human, and confirms both the eye test and stats (36 sacks in three seasons) that already told us Garrett’s a franchise-changing talent."}, {"76b3": "2. Hassan Reddick may have earned himself a green room invite. Coming into the combine, many outlets had Reddick pegged as an early-second-round prospect. But after the Temple defensive end/linebacker hybrid ran the 40 in 4.52 seconds, leaped 36.5 inches in the vertical jump, and registered an absurd 11-foot-1 broad jump on Sunday, he all but cemented his status as a first-round pick."}, {"512a": "Some teams might view Reddick as an off-ball weakside linebacker at 6-foot-1, 237 pounds, while others might think he’s best on the inside. He could even end up as a pass-rushing outside linebacker in a 3–4 scheme or a pure 4–3 defensive end. But whatever the case, teams covet that type of lower-body explosion on the edge as a pass rusher and that kind of speed in coverage. Reddick’s athletic versatility will make him appealing to just about any team come April."}, {"2cc7": "(Getty Images)"}, {"0874": "3. We don’t know where Jabrill Peppers will play, but we do know this: He’s explosive. Peppers is one of the most polarizing prospects in the draft, a player with no defined position who’s as likely to end up playing linebacker, which is where he’s listed in Indianapolis, as he is safety, which is what he considers himself. Hell, at 5-foot-11, 213 pounds he may even end up playing running back or slot receiver at the next level, and he also has experience as a return man and wildcat quarterback. We won’t know where Peppers fits best in the pros until he gets onto the field, but the combine confirmed that he’s one of the best athletes in the draft."}, {"733d": "The Michigan star ran the 40-yard dash in 4.46 seconds, easily tops among linebackers and fifth best at the position since 2003. He added great explosion numbers with a 35.5-inch vertical jump and a 10-foot-8 broad jump. Teams may be wary about his lack of experience at any one position, but it’s hard to imagine that someone in the first round won’t fall in love with those numbers and his versatility."}, {"1ff2": "4. Get used to hearing the names Jordan Willis and Derek Rivers. Every draft there are a couple of relative unknowns from smaller or lesser programs that shoot up draft boards after the combine, and this year, two prime candidates are Youngstown State’s Derek Rivers and Kansas State’s Jordan Willis."}, {"4470": "John Ross Is the Fastest Prospect We’ve Ever SeenThe receiver’s record-breaking 40-yard dash only hints at his massive upsidetheringer.com"}, {"c938": "The 6-foot-3, 255-pound Willis blew the doors off Lucas Oil Stadium, running a 4.53 in the 40 while registering a 39-inch vertical jump, a 10-foot-5 broad jump, a 6.85-second three-cone drill, and a 4.28-second short shuttle as part of the defensive line group. That vert measurement was bested only by Garrett, and the three-cone number is something you’d expect to see from a wide receiver or defensive back. (It was also the eighth-best time among defensive linemen since 2006.) Rivers, at 6-foot-3, 248 pounds, wasn’t far behind in any category, running a 4.61 40 with a 35-inch vertical, a 10-foot-3 broad jump, a 6.94-second three-cone, and a 4.4-second short shuttle. After seeing those numbers, plenty of teams are gonna be watching tape of the Penguins and Wildcats this week."}, {"9ca3": "5. Remember: It doesn’t matter who these prospects are meeting with. Of course, it’s easy to get excited about your favorite player meeting with your favorite team at the combine, but as Washington safety Budda Baker reminded us, it not worth reading into who’s talking to whom."}, {"6bb6": "Between formal meetings and informal chats that take place in Indianapolis all week, it’s common for prospects to come into contact with just about every club in the league during their time at the combine. Plus, many teams will hide their interest in a player by not meeting with him in Indy. There’s a lot to learn from what happens at the combine, but you won’t figure out who’s going where by trying to read meeting-report tea leaves."}], "child": "2025_1\t2025_2\t2025_3\t2025_4", "timestamp": "Mar 5", "content": "NFL Combine Daily Dispatch Myles Garrett Should Be the No. 1 Pick He looks the part, he plays the part, and he broad-jumps the part, too. Plus, Jabrill Peppers is good at running, cutting, and leaping — but is he good at football? The 2017 NFL combine has arrived, meaning it’s time for prospects to perform drills in their underwear, franchises to chart their futures, and anonymous scouts to provide irresponsible quotes. So who and what is creating the most buzz? The Ringer NFL staff has you covered, providing five thoughts from each day in Indianapolis. 1. Myles Garrett made things simple for the Browns at no. 1. With an otherworldly athletic showing on Sunday, Garrett may have erased any doubts among Cleveland’s brass that he deserves to be first off the board. The former Texas A&M pass rusher followed up an impressive performance on the bench press Saturday (he repped out 225 pounds 33 times, second among defensive linemen to Auburn’s Carl Lawson’s 35) by running a 4.64 40-yard dash, jumping 41 inches in the vert, and leaping 10-foot-8 in the broad jump. That’s crazy explosiveness for a 6-foot-4, 272-pound human, and confirms both the eye test and stats (36 sacks in three seasons) that already told us Garrett’s a franchise-changing talent. 2. Hassan Reddick may have earned himself a green room invite. Coming into the combine, many outlets had Reddick pegged as an early-second-round prospect. But after the Temple defensive end/linebacker hybrid ran the 40 in 4.52 seconds, leaped 36.5 inches in the vertical jump, and registered an absurd 11-foot-1 broad jump on Sunday, he all but cemented his status as a first-round pick. Some teams might view Reddick as an off-ball weakside linebacker at 6-foot-1, 237 pounds, while others might think he’s best on the inside. He could even end up as a pass-rushing outside linebacker in a 3–4 scheme or a pure 4–3 defensive end. But whatever the case, teams covet that type of lower-body explosion on the edge as a pass rusher and that kind of speed in coverage. Reddick’s athletic versatility will make him appealing to just about any team come April. (Getty Images) 3. We don’t know where Jabrill Peppers will play, but we do know this: He’s explosive. Peppers is one of the most polarizing prospects in the draft, a player with no defined position who’s as likely to end up playing linebacker, which is where he’s listed in Indianapolis, as he is safety, which is what he considers himself. Hell, at 5-foot-11, 213 pounds he may even end up playing running back or slot receiver at the next level, and he also has experience as a return man and wildcat quarterback. We won’t know where Peppers fits best in the pros until he gets onto the field, but the combine confirmed that he’s one of the best athletes in the draft. The Michigan star ran the 40-yard dash in 4.46 seconds, easily tops among linebackers and fifth best at the position since 2003. He added great explosion numbers with a 35.5-inch vertical jump and a 10-foot-8 broad jump. Teams may be wary about his lack of experience at any one position, but it’s hard to imagine that someone in the first round won’t fall in love with those numbers and his versatility. 4. Get used to hearing the names Jordan Willis and Derek Rivers. Every draft there are a couple of relative unknowns from smaller or lesser programs that shoot up draft boards after the combine, and this year, two prime candidates are Youngstown State’s Derek Rivers and Kansas State’s Jordan Willis. John Ross Is the Fastest Prospect We’ve Ever SeenThe receiver’s record-breaking 40-yard dash only hints at his massive upsidetheringer.com The 6-foot-3, 255-pound Willis blew the doors off Lucas Oil Stadium, running a 4.53 in the 40 while registering a 39-inch vertical jump, a 10-foot-5 broad jump, a 6.85-second three-cone drill, and a 4.28-second short shuttle as part of the defensive line group. That vert measurement was bested only by Garrett, and the three-cone number is something you’d expect to see from a wide receiver or defensive back. (It was also the eighth-best time among defensive linemen since 2006.) Rivers, at 6-foot-3, 248 pounds, wasn’t far behind in any category, running a 4.61 40 with a 35-inch vertical, a 10-foot-3 broad jump, a 6.94-second three-cone, and a 4.4-second short shuttle. After seeing those numbers, plenty of teams are gonna be watching tape of the Penguins and Wildcats this week. 5. Remember: It doesn’t matter who these prospects are meeting with. Of course, it’s easy to get excited about your favorite player meeting with your favorite team at the combine, but as Washington safety Budda Baker reminded us, it not worth reading into who’s talking to whom. Between formal meetings and informal chats that take place in Indianapolis all week, it’s common for prospects to come into contact with just about every club in the league during their time at the combine. Plus, many teams will hide their interest in a player by not meeting with him in Indy. There’s a lot to learn from what happens at the combine, but you won’t figure out who’s going where by trying to read meeting-report tea leaves. ", "author": "Danny Kelly", "parent": ""}