{"name": "2027", "title": "The Browns Don’t Sound Like They Want to Draft a Quarterback", "sentences": [{"39e2": "NFL Combine Daily Dispatch"}, {"2028": "The Browns Don’t Sound Like They Want to Draft a Quarterback"}, {"93a1": "Cleveland head coach Hue Jackson indicated that a support system needs to come before a quarterback. Plus, Christian McCaffrey is OK being an X factor, and Forrest Lamp’s arms grow by an inch."}, {"086e": "The 2017 NFL combine has arrived, meaning it’s time for prospects to perform drills in their underwear, franchises to chart their futures, and anonymous scouts to provide irresponsible quotes. So who and what is creating the most buzz? The Ringer NFL staff has you covered, providing five thoughts from each day in Indianapolis."}, {"633e": "1. Despite reports to the contrary, Hue Jackson doesn’t sound like he’s about to draft a first-round quarterback. They’ve needed a franchise QB basically forever, but the Browns traded the second-overall pick instead of selecting either Jared Goff or Carson Wentz. With the first and 12th picks this year, the Browns will have multiple opportunities at guys like Mitch Trubisky, Deshaun Watson, and Deshone Kizer, but their head coach indicated they’d be looking elsewhere come April."}, {"168f": "Of course, it could all be a smoke screen, but between his official press conference at the podium in Indy and his informal huddle-up right after, Jackson repeated the same thought three times: He’s a big believer in assembling a strong support system (which the Browns do not have) before throwing a young quarterback into the fray."}, {"d20d": "“I think there are all kinds of ways to [build an offense],” he said. “You have to support [the quarterback] position the right way. It’s not just about putting a quarterback on the team and saying, ‘Here we go.’ You have to make sure he has enough weapons. You have to make sure you’re able to protect him, and you put him in the right spot so he can have success.”"}, {"9eca": "Don’t forget: Jackson got the Browns job in large part because of the second-ranked offense (by DVOA) he coordinated in Cincinnati in 2015. That group featured the best pass-blocking offensive line in the NFL, in addition to an elite receiver in A.J. Green, two top-tier supporting receivers in Mohamed Sanu and Marvin Jones, an elite touchdown-making tight end in Tyler Eifert, and a punishing and efficient run game with Jeremy Hill and Giovani Bernard. Oh, and the Bengals had a great defense too. That foundation — one of the league’s best — made it relatively easy for Andy Dalton, who had the best season of his career and was an MVP candidate until breaking his thumb late in the year."}, {"00c9": "Ranking the Offseason Capital of All 32 NFL TeamsWho’s rich with draft picks and cap space?theringer.com"}, {"8962": "2. John Lynch’s nontraditional résumé just might work. The 49ers’ decision to hire Lynch as their new general manager came out of nowhere; he has no official experience as an NFL scout, coach, or personnel executive. But the unique mix of experiences Lynch brings to the table will present a fascinating case study: Can a guy who played quarterback in college and safety in the pros, spent one combine with the Broncos looking at safeties, and was a TV analyst build a talent-rich and deep roster at the highest level?"}, {"68b9": "Seahawks GM John Schneider thinks Lynch can. On Wednesday, Schneider called Lynch a “football junkie,” and mentioned that he’d met with him over the past few years for help in evaluating the safety position. When talking to the media Thursday, Lynch confirmed Schneider’s account. As the Niners adopt Seattle’s single-high 4–3 defense under new defensive coordinator Robert Saleh, what Lynch and his scouting team does at that position could make or break his whole tenure in San Francisco. As we saw last year with Seattle, an elite deep-middle safety is the linchpin of that defense, and after earning the trust of the guy who drafted Earl Thomas and Kam Chancellor, Lynch now has the chance to find those kinds of players on his own."}, {"349b": "As for the offensive side of the ball: Lynch is a former DB, and he thinks his time on TV is going to provide him with a unique perspective on the most important position in the sport."}, {"83b2": "“As a broadcaster, one of the great things you did every week was production meetings,” he said on Thursday. “Each and every week, that meant sitting down with quarterbacks. That gave me a much better understanding of the DNA of the ones that are successful, and maybe some of the shortcomings of the guys that haven’t proven successful in this league.”"}, {"5cb1": "Christian McCaffrey (AP Images)"}, {"fe9a": "3. Christian McCaffrey is fine being the X factor. When McCaffrey spoke to the media on Thursday, the main thing that stood out was how he seemed perfectly comfortable not having a defined position. He believes he can be a feature back, but he also views himself as a dynamic return man and a receiver."}, {"5a1f": "“I don’t think there’s anyone else that can do all the things I can,” he said. “Running between the tackles, outside, pass protecting, playing ‘X,’ ‘Z,’ slot, and doing a lot of things in the return game as well — I think that’s what sets me apart.”"}, {"6855": "The 5-foot-11, 202-pound playmaker plans on doing all the running back positional drills this week in Indianapolis, but he’ll work out as a receiver at his pro day later this spring. McCaffrey is the son of former NFL receiver Ed McCaffrey and protégé of former pro receiver Brandon Stokley, and his ability to play in the backfield or out wide will only make him more valuable in the pass-heavy and flexible NFL."}, {"5d49": "4. Play calling is an art — but it’s also a process. It was fun to hear Dolphins head coach (and play caller) Adam Gase pull back the curtain on Thursday. He talked about his struggles to get more out of tight end Jordan Cameron, who finished the year with eight receptions for 60 yards in three games before concussion symptoms ended his season: “I mean, I don’t know how many times I went back and watched Cleveland tape the year that he had 80 catches to see what I was doing wrong; what did I have to try to do?”"}, {"abb1": "Gase also touched on the necessity of a back-and-forth between a play caller and his quarterback: “I think that Ryan [Tannehill] is really comfortable with what he wants now. He’s not going to be afraid to communicate it with me; I think even toward the end of last year, he was really good at making sure I knew how he felt about what we were doing. If I called something that he didn’t like, he would let me know.”"}, {"3ab7": "“That’s where I want him to be,” Gase said. “I want him to feel like this is his, he can say whatever he wants when he needs to say it, and I’m going to be able to react to it. At the end of the day, he’s the one playing, I’m not. Our job is to put him in the best position possible.”"}, {"cdb9": "The 13 Riskiest Free Agents in the NFLMeet your favorite team’s newest mistaketheringer.com"}, {"8d8a": "5. College offensive linemen have become major wild cards. It’s a theme of the past several combines: Spread-based college programs aren’t properly preparing offensive linemen for the next level. Now, it’s not college football’s responsibility to coach players up on the pro game, but when you see three- or four-year college starters who have never once lined up in a three-point stance and fired out into the defensive line, it makes the evaluation difficult."}, {"3b40": "Essentially, teams guess on whether or not a particular prospect’s physical traits will translate to the next level. And even if a prospect can end up hacking it in the NFL, it’s becoming harder to know where along the line they should actually play."}, {"5996": "Western Kentucky tackle/guard/center Forrest Lamp says he’s prepared for anything. The Hilltoppers’ top prospect was a mainstay at left tackle during his college career, and his athleticism and nimble feet project well to that spot at the next level. But after his arms measured in at 31¼ inches at the Senior Bowl, many immediately slated him in for a life on the inside; that lack of length would really hurt him on the blind side. But then his arms measured in at 32¼ inches here in Indy on Thursday. Whether it was a numerical error at the Senior Bowl or a perfectly timed growth spurt, that inch just increased Lamp’s draft stock."}, {"ec3b": "“Some teams look at numbers more than others,” he said, in reference to his arm length. “There’s some teams that told me I can play tackle, there’s some teams that told me I’d play guard, and there’s some teams that told me I’d play just center, because of my arms. Some teams believe more in ability than numbers. It all depends on the team.”"}, {"0c1e": "A projected first-round pick by some, Lamp said he’s most comfortable on the blind side, but will play any position his new team wants him to play. That’s the new reality for offensive-line prospects."}], "child": "2027_1\t2027_2\t2027_3\t2027_4", "timestamp": "Mar 2", "content": "NFL Combine Daily Dispatch The Browns Don’t Sound Like They Want to Draft a Quarterback Cleveland head coach Hue Jackson indicated that a support system needs to come before a quarterback. Plus, Christian McCaffrey is OK being an X factor, and Forrest Lamp’s arms grow by an inch. The 2017 NFL combine has arrived, meaning it’s time for prospects to perform drills in their underwear, franchises to chart their futures, and anonymous scouts to provide irresponsible quotes. So who and what is creating the most buzz? The Ringer NFL staff has you covered, providing five thoughts from each day in Indianapolis. 1. Despite reports to the contrary, Hue Jackson doesn’t sound like he’s about to draft a first-round quarterback. They’ve needed a franchise QB basically forever, but the Browns traded the second-overall pick instead of selecting either Jared Goff or Carson Wentz. With the first and 12th picks this year, the Browns will have multiple opportunities at guys like Mitch Trubisky, Deshaun Watson, and Deshone Kizer, but their head coach indicated they’d be looking elsewhere come April. Of course, it could all be a smoke screen, but between his official press conference at the podium in Indy and his informal huddle-up right after, Jackson repeated the same thought three times: He’s a big believer in assembling a strong support system (which the Browns do not have) before throwing a young quarterback into the fray. “I think there are all kinds of ways to [build an offense],” he said. “You have to support [the quarterback] position the right way. It’s not just about putting a quarterback on the team and saying, ‘Here we go.’ You have to make sure he has enough weapons. You have to make sure you’re able to protect him, and you put him in the right spot so he can have success.” Don’t forget: Jackson got the Browns job in large part because of the second-ranked offense (by DVOA) he coordinated in Cincinnati in 2015. That group featured the best pass-blocking offensive line in the NFL, in addition to an elite receiver in A.J. Green, two top-tier supporting receivers in Mohamed Sanu and Marvin Jones, an elite touchdown-making tight end in Tyler Eifert, and a punishing and efficient run game with Jeremy Hill and Giovani Bernard. Oh, and the Bengals had a great defense too. That foundation — one of the league’s best — made it relatively easy for Andy Dalton, who had the best season of his career and was an MVP candidate until breaking his thumb late in the year. Ranking the Offseason Capital of All 32 NFL TeamsWho’s rich with draft picks and cap space?theringer.com 2. John Lynch’s nontraditional résumé just might work. The 49ers’ decision to hire Lynch as their new general manager came out of nowhere; he has no official experience as an NFL scout, coach, or personnel executive. But the unique mix of experiences Lynch brings to the table will present a fascinating case study: Can a guy who played quarterback in college and safety in the pros, spent one combine with the Broncos looking at safeties, and was a TV analyst build a talent-rich and deep roster at the highest level? Seahawks GM John Schneider thinks Lynch can. On Wednesday, Schneider called Lynch a “football junkie,” and mentioned that he’d met with him over the past few years for help in evaluating the safety position. When talking to the media Thursday, Lynch confirmed Schneider’s account. As the Niners adopt Seattle’s single-high 4–3 defense under new defensive coordinator Robert Saleh, what Lynch and his scouting team does at that position could make or break his whole tenure in San Francisco. As we saw last year with Seattle, an elite deep-middle safety is the linchpin of that defense, and after earning the trust of the guy who drafted Earl Thomas and Kam Chancellor, Lynch now has the chance to find those kinds of players on his own. As for the offensive side of the ball: Lynch is a former DB, and he thinks his time on TV is going to provide him with a unique perspective on the most important position in the sport. “As a broadcaster, one of the great things you did every week was production meetings,” he said on Thursday. “Each and every week, that meant sitting down with quarterbacks. That gave me a much better understanding of the DNA of the ones that are successful, and maybe some of the shortcomings of the guys that haven’t proven successful in this league.” Christian McCaffrey (AP Images) 3. Christian McCaffrey is fine being the X factor. When McCaffrey spoke to the media on Thursday, the main thing that stood out was how he seemed perfectly comfortable not having a defined position. He believes he can be a feature back, but he also views himself as a dynamic return man and a receiver. “I don’t think there’s anyone else that can do all the things I can,” he said. “Running between the tackles, outside, pass protecting, playing ‘X,’ ‘Z,’ slot, and doing a lot of things in the return game as well — I think that’s what sets me apart.” The 5-foot-11, 202-pound playmaker plans on doing all the running back positional drills this week in Indianapolis, but he’ll work out as a receiver at his pro day later this spring. McCaffrey is the son of former NFL receiver Ed McCaffrey and protégé of former pro receiver Brandon Stokley, and his ability to play in the backfield or out wide will only make him more valuable in the pass-heavy and flexible NFL. 4. Play calling is an art — but it’s also a process. It was fun to hear Dolphins head coach (and play caller) Adam Gase pull back the curtain on Thursday. He talked about his struggles to get more out of tight end Jordan Cameron, who finished the year with eight receptions for 60 yards in three games before concussion symptoms ended his season: “I mean, I don’t know how many times I went back and watched Cleveland tape the year that he had 80 catches to see what I was doing wrong; what did I have to try to do?” Gase also touched on the necessity of a back-and-forth between a play caller and his quarterback: “I think that Ryan [Tannehill] is really comfortable with what he wants now. He’s not going to be afraid to communicate it with me; I think even toward the end of last year, he was really good at making sure I knew how he felt about what we were doing. If I called something that he didn’t like, he would let me know.” “That’s where I want him to be,” Gase said. “I want him to feel like this is his, he can say whatever he wants when he needs to say it, and I’m going to be able to react to it. At the end of the day, he’s the one playing, I’m not. Our job is to put him in the best position possible.” The 13 Riskiest Free Agents in the NFLMeet your favorite team’s newest mistaketheringer.com 5. College offensive linemen have become major wild cards. It’s a theme of the past several combines: Spread-based college programs aren’t properly preparing offensive linemen for the next level. Now, it’s not college football’s responsibility to coach players up on the pro game, but when you see three- or four-year college starters who have never once lined up in a three-point stance and fired out into the defensive line, it makes the evaluation difficult. Essentially, teams guess on whether or not a particular prospect’s physical traits will translate to the next level. And even if a prospect can end up hacking it in the NFL, it’s becoming harder to know where along the line they should actually play. Western Kentucky tackle/guard/center Forrest Lamp says he’s prepared for anything. The Hilltoppers’ top prospect was a mainstay at left tackle during his college career, and his athleticism and nimble feet project well to that spot at the next level. But after his arms measured in at 31¼ inches at the Senior Bowl, many immediately slated him in for a life on the inside; that lack of length would really hurt him on the blind side. But then his arms measured in at 32¼ inches here in Indy on Thursday. Whether it was a numerical error at the Senior Bowl or a perfectly timed growth spurt, that inch just increased Lamp’s draft stock. “Some teams look at numbers more than others,” he said, in reference to his arm length. “There’s some teams that told me I can play tackle, there’s some teams that told me I’d play guard, and there’s some teams that told me I’d play just center, because of my arms. Some teams believe more in ability than numbers. It all depends on the team.” A projected first-round pick by some, Lamp said he’s most comfortable on the blind side, but will play any position his new team wants him to play. That’s the new reality for offensive-line prospects. ", "author": "Danny Kelly", "parent": ""}