{"name": "2028", "title": "McKinley, Charlton, Barnett top Cowboys’ 1st Round Wish List", "sentences": [{"156c": "McKinley, Charlton, Barnett top Cowboys’ 1st Round Wish List"}, {"d158": "By Gerverus Flagg"}, {"3f29": "The Dallas Cowboys hold the 28th pick in the 2017 NFL Draft. With glaring needs on defense and three vital members of the secondary set to become free agents, the Cowboys are expected to target a defensive end or corner back at the end of round 1. Cowboys owner, Jerry Jones, has made his desire for a “war daddy,” a defensive player that commands more than one blocker on every snap, well known over the course of the offseason. (Think J.J. Watt)"}, {"acf7": "After their home team completed an impressive 13–3 regular season that ended with another disappointing, early exit from the playoffs, fans in Dallas have many reasons to be optimistic. In order to match, and hopefully improve upon, last year’s success, Dallas must address their pass rush deficiency. With the division rival, New York Giants, adding another offensive weapon in free agency (Giants signed Brandon Marshall to a 2 yr. deal), and the NFC elites (Seahawks, Falcons, Packers) having premier passers, the Cowboys must find a way to pressure the quarterback to make a playoff push into late January."}, {"161e": "Enter the talented defensive ends, Takkarist McKinley, Taco Charlton and Derek Barnett. With the Cleveland Browns expected to fill their dearth of overall roster talent with Texas A&M’s defensive end, Myles Garrett, as the first overall selection, and other teams with top ten picks expected to snatch up household names like Jonathan Allen and Solomon Thomas, the Cowboys are certain to thoroughly evaluate the game tape and combine workouts of McKinley, Charlton and Barnett."}, {"9d30": "Takkarist McKinley doing positional drills at 2017 NFL Combine."}, {"053b": "Despite being widely considered a Top 15 talent, UCLA’s McKinley may be around when the Cowboys select at 28 because of a shoulder injury that requires surgical repair. The surgery is expected to sideline McKinley from anywhere between 4–6 months. McKinley has a nonstop motor and elite athletic traits that would make him an ideal right defensive end (RDE) for defensive coordinator, Rod Marinelli. Marinelli preaches all-out effort to his unit, and McKinley’s willingness to run from sideline to sideline in pursuit of the ball is evident on tape. What’s also evident on tape is his lack of skill in hand fighting and his inability to get off blocks at the point of attack in the run game. In UCLA’s game against Utah, McKinley, going against who many consider a first round offensive tackle prospect in Garett Boles, teases scouts with his pass rush potential. McKinley’s electric first step and natural ability to bend the edge are evident."}, {"6037": "However, in his game against Stanford, McKinley was frequently bullied at the point of attack and struggled to detach himself from blocks. While the Cowboys have been willing to draft tantalizing defensive prospects with injury concerns in the past (e.g. Sean Lee, Jaylon Smith), the team can ill afford to once again enter training camp without the services of their rookie DE draft pick, as 2016 4th round selection, Charles Tapper, missed the entirety of the 2016 season with a lower back injury."}, {"27a4": "Derek Barnett participates in positional drills during 2017 NFL Combine."}, {"c328": "Compared to McKinley, Derek Barnett is a champion hand fighter in the trenches. His ability to tie his feet with his hands, and thus his punch, is what separates him from other DE prospects. Barnett was extremely productive during his time at Tennessee, breaking Hall of Famer Reggie White’s career sack record, notching his 33rd sack in his final game with the Vols. Barnett is a tough football player and elite competitor, as evidenced by his impressive combine performance despite reports that he was battling the flu just one day prior to the event. While his toughness is unquestionable, I have concerns about Barnett’s seeming lack of quick twitch ability. I say “seeming,” because despite what I saw on film, Barnett posted an impressive time during the combine’s 3 Cone Drill (6.96 seconds), which landed him in the Top 5 of all defensive linemen. During the game against Nebraska, in which Barnett set the Vol’s sack record, I noticed several times where Barnett was unable to keep up with the ball carrier’s sudden movements and changes of direction. While watching the tape, I also noticed several instances where Barnett ran too far up field, past the quarterback, allowing the passer to step up in the pocket. This has to be addressed at the next level. Often, Barnett beats tackles by being able to anticipate the snap count, rather than with a consistent, explosive first step. In short, he wins because of excellent timing of the snap and poor kickslides by the offensive linemen."}, {"508c": "At the next level, QBs will hard count him, neutralizing his ability to jump the snap, thus forcing him to win using alternate methods. Barnett is a great player, one whom I expect to have a successful career as a pro. That said, I believe he’s better suited as a left defensive end (LDE) in Rod Marinelli’s 4–3 scheme. In Marinelli’s scheme, the LDE has more run stopping responsibilities, whereas the RDE is expected to generate pressure against the quarterback. Barnett would excel as a LDE, where he can set the edge against the run and slide inside to 3-technique to provide a pass rush in sub packages and obvious passing situations."}, {"ade5": "Taco Charton at 2017 NFL Combine"}, {"02b7": "Michigan’s Taco Charlton would be my pick at 28. Scouts are enamored with Charlton’s rare combination of size, length and athleticism. At 6’6” 277 lbs., Charlton perfectly fits the mold for a RDE in the Cowboys’ 4–3 system. Time in the weight room will help him perform on a more consistent basis, but Taco is the war daddy along the defensive front Jerry Jones so desperately desires. A few things stood out while watching Charlton’s performance against Florida State in the Orange Bowl. While he must learn to do a better job of using his length to separate from blockers, he’s more than willing to chase down run plays from the back side and set the edge against runs his way. Charlton impressed me with his speed-to-power on pass rushing downs and flashed a spin move that can be deadly as he adds to his arsenal of moves at the next level. Under the tutelage of Rod Marinelli and defensive line coach and Cowboy legend, Leon Lett, Charlton has the frame and skillset to become a perennial All-Pro. One play in particular stood out to me during the Orange Bowl game. Lined up at RDE, Charlton reads run away as his offensive tackle blocks down. He squeezes down the gap as defensive ends are taught to do, and as soon as he sees a tight end working across the formation, behind the line of scrimmage, Charlton diagnoses play action pass. In a seemingly effortless motion, he drops his hips and takes off sprinting after the QB, closing the 7-yard distance between the two in a hurry, forcing the QB to throw the ball into the dirt. That play alone exemplifies Charlton’s scary combination of ability and potential."}, {"d167": "With the Colts and Ravens also desperate for pass rush help, and their draft positions at 15 & 16 respectively, Charlton may be off the board before the Cowboys can turn in their pick for the talented defensive end. However, with both of the aforementioned teams utilizing a 3–4 defense, many expect the two to target McKinley or Charles Harris, smaller pass rushers who can stand up to play OLB. Some mocks even have the Colts taking Fournette or Cook in an effort to take some pressure off of Andrew Luck by establishing a run game. If Charlton is still on the board at 28, I expect the Cowboys to run their pick to the podium to pair Charlton with Demarcus Lawrence, David Irving and Maliek Collins, forming a promising, young defensive front for years to come."}, {"7774": "This is the reaction I expect from Jerry if the Cowboys are able to land Taco Charlton with the 28th pick in Round 1."}], "child": "2028_12028_12028_12028_12028_1", "timestamp": "Mar 8", "content": "McKinley, Charlton, Barnett top Cowboys’ 1st Round Wish List By Gerverus Flagg The Dallas Cowboys hold the 28th pick in the 2017 NFL Draft. With glaring needs on defense and three vital members of the secondary set to become free agents, the Cowboys are expected to target a defensive end or corner back at the end of round 1. Cowboys owner, Jerry Jones, has made his desire for a “war daddy,” a defensive player that commands more than one blocker on every snap, well known over the course of the offseason. (Think J.J. Watt) After their home team completed an impressive 13–3 regular season that ended with another disappointing, early exit from the playoffs, fans in Dallas have many reasons to be optimistic. In order to match, and hopefully improve upon, last year’s success, Dallas must address their pass rush deficiency. With the division rival, New York Giants, adding another offensive weapon in free agency (Giants signed Brandon Marshall to a 2 yr. deal), and the NFC elites (Seahawks, Falcons, Packers) having premier passers, the Cowboys must find a way to pressure the quarterback to make a playoff push into late January. Enter the talented defensive ends, Takkarist McKinley, Taco Charlton and Derek Barnett. With the Cleveland Browns expected to fill their dearth of overall roster talent with Texas A&M’s defensive end, Myles Garrett, as the first overall selection, and other teams with top ten picks expected to snatch up household names like Jonathan Allen and Solomon Thomas, the Cowboys are certain to thoroughly evaluate the game tape and combine workouts of McKinley, Charlton and Barnett. Takkarist McKinley doing positional drills at 2017 NFL Combine. Despite being widely considered a Top 15 talent, UCLA’s McKinley may be around when the Cowboys select at 28 because of a shoulder injury that requires surgical repair. The surgery is expected to sideline McKinley from anywhere between 4–6 months. McKinley has a nonstop motor and elite athletic traits that would make him an ideal right defensive end (RDE) for defensive coordinator, Rod Marinelli. Marinelli preaches all-out effort to his unit, and McKinley’s willingness to run from sideline to sideline in pursuit of the ball is evident on tape. What’s also evident on tape is his lack of skill in hand fighting and his inability to get off blocks at the point of attack in the run game. In UCLA’s game against Utah, McKinley, going against who many consider a first round offensive tackle prospect in Garett Boles, teases scouts with his pass rush potential. McKinley’s electric first step and natural ability to bend the edge are evident. However, in his game against Stanford, McKinley was frequently bullied at the point of attack and struggled to detach himself from blocks. While the Cowboys have been willing to draft tantalizing defensive prospects with injury concerns in the past (e.g. Sean Lee, Jaylon Smith), the team can ill afford to once again enter training camp without the services of their rookie DE draft pick, as 2016 4th round selection, Charles Tapper, missed the entirety of the 2016 season with a lower back injury. Derek Barnett participates in positional drills during 2017 NFL Combine. Compared to McKinley, Derek Barnett is a champion hand fighter in the trenches. His ability to tie his feet with his hands, and thus his punch, is what separates him from other DE prospects. Barnett was extremely productive during his time at Tennessee, breaking Hall of Famer Reggie White’s career sack record, notching his 33rd sack in his final game with the Vols. Barnett is a tough football player and elite competitor, as evidenced by his impressive combine performance despite reports that he was battling the flu just one day prior to the event. While his toughness is unquestionable, I have concerns about Barnett’s seeming lack of quick twitch ability. I say “seeming,” because despite what I saw on film, Barnett posted an impressive time during the combine’s 3 Cone Drill (6.96 seconds), which landed him in the Top 5 of all defensive linemen. During the game against Nebraska, in which Barnett set the Vol’s sack record, I noticed several times where Barnett was unable to keep up with the ball carrier’s sudden movements and changes of direction. While watching the tape, I also noticed several instances where Barnett ran too far up field, past the quarterback, allowing the passer to step up in the pocket. This has to be addressed at the next level. Often, Barnett beats tackles by being able to anticipate the snap count, rather than with a consistent, explosive first step. In short, he wins because of excellent timing of the snap and poor kickslides by the offensive linemen. At the next level, QBs will hard count him, neutralizing his ability to jump the snap, thus forcing him to win using alternate methods. Barnett is a great player, one whom I expect to have a successful career as a pro. That said, I believe he’s better suited as a left defensive end (LDE) in Rod Marinelli’s 4–3 scheme. In Marinelli’s scheme, the LDE has more run stopping responsibilities, whereas the RDE is expected to generate pressure against the quarterback. Barnett would excel as a LDE, where he can set the edge against the run and slide inside to 3-technique to provide a pass rush in sub packages and obvious passing situations. Taco Charton at 2017 NFL Combine Michigan’s Taco Charlton would be my pick at 28. Scouts are enamored with Charlton’s rare combination of size, length and athleticism. At 6’6” 277 lbs., Charlton perfectly fits the mold for a RDE in the Cowboys’ 4–3 system. Time in the weight room will help him perform on a more consistent basis, but Taco is the war daddy along the defensive front Jerry Jones so desperately desires. A few things stood out while watching Charlton’s performance against Florida State in the Orange Bowl. While he must learn to do a better job of using his length to separate from blockers, he’s more than willing to chase down run plays from the back side and set the edge against runs his way. Charlton impressed me with his speed-to-power on pass rushing downs and flashed a spin move that can be deadly as he adds to his arsenal of moves at the next level. Under the tutelage of Rod Marinelli and defensive line coach and Cowboy legend, Leon Lett, Charlton has the frame and skillset to become a perennial All-Pro. One play in particular stood out to me during the Orange Bowl game. Lined up at RDE, Charlton reads run away as his offensive tackle blocks down. He squeezes down the gap as defensive ends are taught to do, and as soon as he sees a tight end working across the formation, behind the line of scrimmage, Charlton diagnoses play action pass. In a seemingly effortless motion, he drops his hips and takes off sprinting after the QB, closing the 7-yard distance between the two in a hurry, forcing the QB to throw the ball into the dirt. That play alone exemplifies Charlton’s scary combination of ability and potential. With the Colts and Ravens also desperate for pass rush help, and their draft positions at 15 & 16 respectively, Charlton may be off the board before the Cowboys can turn in their pick for the talented defensive end. However, with both of the aforementioned teams utilizing a 3–4 defense, many expect the two to target McKinley or Charles Harris, smaller pass rushers who can stand up to play OLB. Some mocks even have the Colts taking Fournette or Cook in an effort to take some pressure off of Andrew Luck by establishing a run game. If Charlton is still on the board at 28, I expect the Cowboys to run their pick to the podium to pair Charlton with Demarcus Lawrence, David Irving and Maliek Collins, forming a promising, young defensive front for years to come. This is the reaction I expect from Jerry if the Cowboys are able to land Taco Charlton with the 28th pick in Round 1. ", "author": "Gerverus Flagg", "parent": ""}