{"name": "2073", "title": "Youth Soccer: Why “the system” is failing our players", "sentences": [{"51c5": "Youth Soccer: Why “the system” is failing our players"}, {"6d09": "I’ve seen the scenario countless times, players that line up with numbers on their shorts, vying for a spot on the “A” team at every tryout. Parents, nervously hoping their child gets picked on the top team, waiting for that email or phone call with a checkbook at their side. They would rather see their kid be placed on a team with little, to no playing time, than having to say they are somehow relegated to a “B” squad. I tell you, the entire system is flawed, my friends. It’s all a big circle and it starts with the pay to play model. I’ve heard it countless times: “we should have professional clubs, just like in Europe, where the players don’t pay if they have the talent.” In theory, yes that would be ideal, however, we’re missing a key component: money. The truth is, it costs money to rent fields, buy uniforms, participate in tournaments, travel (when necessary) and pay club staff (there are those who volunteer, bless their soul). When you think about it, we don’t live in a soccer culture, yet. The United States Soccer Federation isn’t pouring money into the infrastructure for youth clubs to operate, unlike it’s European or South American counterparts. As mentioned in an article by Will Parchman(2016), “pay to play is a symptom.” The sad truth is that for now, pay to play is one of the only ways for clubs to survive in this country. A major byproduct then is that results matter. Not development results, rather results in the win-loss column. As paying customers, some parents demand wins, as they attribute a club’s appeal based on the overall performance of their teams. Obviously, this mentality spills over to the coaches, who no longer focus on correct development. They have to make sure they win, in order to avoid those paying customers seeking other options at the end of the season. I see it week in and week out. “Who needs to learn possession? You can smash the ball 40 yards down the field and have three players run onto it, eventually one time they’ll get through.” Personally, I’d rather lose every game than attempt to play in such a way, not to mention the negative effect it can have on players attempting to reach a higher level. Imagine a fifteen-year-old kid that has been taught to clear the ball every time he touches it. What chance does he have to make an impression to play beyond club soccer? That my friends is where the system is failing us, as coaches, parents, and especially players. But there is hope. There are coaches and parents who get it, who are not afraid to stick to their guns and focus on what’s really important: player development. Parents that understand the value of teaching the correct way to play the game and support coaches instead of criticizing them. Coaches who care only about the well-being of their players, setting their ego aside and looking at the bigger picture. Development is the only way forward my friends."}, {"9214": "Riccardo Sbabo is a Staff Coach and Technical Director in Germantown, TN."}, {"f015": "References:"}, {"5960": "Parchman, W. (2016, June 1). Pay-to-play is a symptom, not the problem itself. Retrieved September 13, 2016, from http://www.topdrawersoccer.com/the91stminute/2016/06/pay-to-play-is-a-symptom-not-the-problem-itself/"}, {"2d00": "Empty soccer bench image by Neekoh.fi"}, {"b901": "All other photos were created by the author"}, {"c72c": "www.futsal901.com"}], "child": "2073_1", "timestamp": "Sep 13, 2016", "content": "Youth Soccer: Why “the system” is failing our players I’ve seen the scenario countless times, players that line up with numbers on their shorts, vying for a spot on the “A” team at every tryout. Parents, nervously hoping their child gets picked on the top team, waiting for that email or phone call with a checkbook at their side. They would rather see their kid be placed on a team with little, to no playing time, than having to say they are somehow relegated to a “B” squad. I tell you, the entire system is flawed, my friends. It’s all a big circle and it starts with the pay to play model. I’ve heard it countless times: “we should have professional clubs, just like in Europe, where the players don’t pay if they have the talent.” In theory, yes that would be ideal, however, we’re missing a key component: money. The truth is, it costs money to rent fields, buy uniforms, participate in tournaments, travel (when necessary) and pay club staff (there are those who volunteer, bless their soul). When you think about it, we don’t live in a soccer culture, yet. The United States Soccer Federation isn’t pouring money into the infrastructure for youth clubs to operate, unlike it’s European or South American counterparts. As mentioned in an article by Will Parchman(2016), “pay to play is a symptom.” The sad truth is that for now, pay to play is one of the only ways for clubs to survive in this country. A major byproduct then is that results matter. Not development results, rather results in the win-loss column. As paying customers, some parents demand wins, as they attribute a club’s appeal based on the overall performance of their teams. Obviously, this mentality spills over to the coaches, who no longer focus on correct development. They have to make sure they win, in order to avoid those paying customers seeking other options at the end of the season. I see it week in and week out. “Who needs to learn possession? You can smash the ball 40 yards down the field and have three players run onto it, eventually one time they’ll get through.” Personally, I’d rather lose every game than attempt to play in such a way, not to mention the negative effect it can have on players attempting to reach a higher level. Imagine a fifteen-year-old kid that has been taught to clear the ball every time he touches it. What chance does he have to make an impression to play beyond club soccer? That my friends is where the system is failing us, as coaches, parents, and especially players. But there is hope. There are coaches and parents who get it, who are not afraid to stick to their guns and focus on what’s really important: player development. Parents that understand the value of teaching the correct way to play the game and support coaches instead of criticizing them. Coaches who care only about the well-being of their players, setting their ego aside and looking at the bigger picture. Development is the only way forward my friends. Riccardo Sbabo is a Staff Coach and Technical Director in Germantown, TN. References: Parchman, W. (2016, June 1). Pay-to-play is a symptom, not the problem itself. Retrieved September 13, 2016, from http://www.topdrawersoccer.com/the91stminute/2016/06/pay-to-play-is-a-symptom-not-the-problem-itself/ Empty soccer bench image by Neekoh.fi All other photos were created by the author www.futsal901.com ", "author": "Riccardo Sbabo", "parent": ""}