{"name": "2091", "title": "Mt. Everest or Motherhood?", "sentences": [{"0944": "Mt. Everest or Motherhood?"}, {"5fa9": "“I don’t know how you do it all.”"}, {"a4c3": "Genuine and thoughtful, the young girl that works for me meant it sincerely. She’s approaching 30 and her appreciative green eyes sparkled at me with admiration and respect. And it meant a lot to me."}, {"9f7b": "To me, her comment meant that I was doing a good job at being a mom. It didn’t just mean — “wow, you handle a lot.” We follow each other on social media and she’s flooded with swimming lesson photos, lazy days on swings and ballet twirls so she understands that there is another world where I thrive with two little ones under the age of 5."}, {"9f66": "I vividly remember when I was her age. I was working in New York and I rarely left the office before 10PM. I intimately understand the hours and dedication it took at that point in my life. And I’ll never forget taking a step back one day and looking at all the female executives above me and feeling like an outsider. There was no one that I looked at and felt like — wow, I want that life."}, {"3fc9": "I’ll never forget the joy an executive not to be named extolled when she told me about her zen rock garden. Zen. rock. garden. This was the most complex thing she could find time to care for. And none of these women were married. And if they were, their husbands were their children. Needless to say, I knew I needed to find a different job and path and a place where I felt like I could be a partner — not even a mother — but a partner with someone and have a life beyond my job."}, {"deef": "And I honestly never saw myself as a mother. I loved to work. I loved to feel like I was bringing value to an organization. I loved to travel and have my post-work life of going to see live music and trying new restaurants in Brooklyn and the Lower East Side. It wasn’t that I was so focused on my career I didn’t want children. I just didn’t see myself as the mother type."}, {"9106": "And truth be told, children felt like something so massive and incomprehensible. Even after moving to Portland, Oregon, after New York City, I distinctly remember having a delayed flight after a vacation, getting back home at 3AM and thinking “How do parents deal with this? How does someone land completely depleted at 3AM and then have to put little people to bed?” It felt so far beyond my grasp in addition to being exhausting and, put frankly, a very unattractive added complexity to my life."}, {"0340": "So back to the young girl that works for me and who asked the question I hear the minute people find out I have children — how do you do it all? I gave her more than the demure “Thank you” which I typically do when someone says something like that to me. I told her the truth. And that it doesn’t have to feel like something untenable as I had thought when I was her age."}, {"96dc": "I gave her some honest color and bared a piece of myself. I explained that my children aren’t an added layer of complexity or this hectic aspect of my life that I barely manage. They are an added layer of magic to everything. The mornings are these sun streaming moments of warmth filled with smiles and pure love. I can’t wait until they wake up in the morning. Their pajamas smell like syrup. I burry my face in their bellies and I love taking their chubby hands in mine. They give me purpose and I have perspective. I can go into my day knowing that I am the lucky one to have little ones that breathe meaning into my life. Simply put — I had no idea how much I was going to love being a mother."}, {"c4ee": "I don’t know why I had the urge to give my co-worker so much sappy color. And trust me, I was very matter of fact about the above. I could have been just as easily giving driving directions. It’s because it’s the truth. While it may be emotionally touching, it wasn’t meant to be. It’s something that I felt a female at her age should know and shouldn’t be afraid of. And she was surprised to hear it. She was so accustomed to hearing about the weight and nuisance that comes with having children that she had never heard someone refer to their children like I did and that made me sad. And that’s why I felt the need to say something."}, {"6392": "Society is far more comfortable commiserating about parenting and often feels uncomfortable talking about how it makes their life better. And granted, I have a successful career so I can afford luxuries that do make parenting more enjoyable so I don’t want to be completely short-sighted. But the women I interact with and engage with day to day are just as successful if not more so and these are the women that are trepidatious about motherhood. So this is for them."}, {"ec6b": "I’ll never forget the moment I decided to have children. My husband and I had just returned from a trip over Thanksgiving. We had an incredible time and talked about whether we really wanted to have children and interestingly enough, where we netted out that was that it might not be for us given our careers and the enjoyment we garnered from our lives with each other. A few weeks later, we visited childhood friends of mine that have two kids. The Christmas Tree was up and stockings were on the fireplace and all the kids could talk about was Santa. “Did you know Santa is coming?” the little one wistfully chirped. The anticipation they had and the joy they felt brought this new meaning to a holiday that, truth be told, I had found to be a bit of a pain with work budget pressures in the fourth quarter coupled with dreary never-ending holiday commitments. My friend’s child’s question and his excitement was simple and real and perfect. And I knew I needed and wanted that outlook on the world where I could reimagine my current space and place in the world with an objectivity that I’d treasure and learn from. And I received that by having children."}, {"f897": "Having children should not feel like Mount Everest in front of you. I understand the unknown can feel like a burden but having little people should not. I’ve been there and I get it. And I wish someone had been more positive about having kids and painted a more attractive picture. And truth be told, knowing this wouldn’t have changed the trajectory of where I am but I think it would have removed the anxiousness I felt when approaching motherhood. So if I can help eliminate that obstacle for someone else, I figured I should try."}, {"22e4": "Entertainment and advertising consistently paint mom as this one that is harried and who loses touch with society and that’s simply not the case. And I am here to prove it. So while I’d like to take credit for “doing it all,” I can’t. I’m the lucky one."}], "child": "2091_1\t2091_2\t2091_3", "timestamp": "Apr 5", "content": "Mt. Everest or Motherhood? “I don’t know how you do it all.” Genuine and thoughtful, the young girl that works for me meant it sincerely. She’s approaching 30 and her appreciative green eyes sparkled at me with admiration and respect. And it meant a lot to me. To me, her comment meant that I was doing a good job at being a mom. It didn’t just mean — “wow, you handle a lot.” We follow each other on social media and she’s flooded with swimming lesson photos, lazy days on swings and ballet twirls so she understands that there is another world where I thrive with two little ones under the age of 5. I vividly remember when I was her age. I was working in New York and I rarely left the office before 10PM. I intimately understand the hours and dedication it took at that point in my life. And I’ll never forget taking a step back one day and looking at all the female executives above me and feeling like an outsider. There was no one that I looked at and felt like — wow, I want that life. I’ll never forget the joy an executive not to be named extolled when she told me about her zen rock garden. Zen. rock. garden. This was the most complex thing she could find time to care for. And none of these women were married. And if they were, their husbands were their children. Needless to say, I knew I needed to find a different job and path and a place where I felt like I could be a partner — not even a mother — but a partner with someone and have a life beyond my job. And I honestly never saw myself as a mother. I loved to work. I loved to feel like I was bringing value to an organization. I loved to travel and have my post-work life of going to see live music and trying new restaurants in Brooklyn and the Lower East Side. It wasn’t that I was so focused on my career I didn’t want children. I just didn’t see myself as the mother type. And truth be told, children felt like something so massive and incomprehensible. Even after moving to Portland, Oregon, after New York City, I distinctly remember having a delayed flight after a vacation, getting back home at 3AM and thinking “How do parents deal with this? How does someone land completely depleted at 3AM and then have to put little people to bed?” It felt so far beyond my grasp in addition to being exhausting and, put frankly, a very unattractive added complexity to my life. So back to the young girl that works for me and who asked the question I hear the minute people find out I have children — how do you do it all? I gave her more than the demure “Thank you” which I typically do when someone says something like that to me. I told her the truth. And that it doesn’t have to feel like something untenable as I had thought when I was her age. I gave her some honest color and bared a piece of myself. I explained that my children aren’t an added layer of complexity or this hectic aspect of my life that I barely manage. They are an added layer of magic to everything. The mornings are these sun streaming moments of warmth filled with smiles and pure love. I can’t wait until they wake up in the morning. Their pajamas smell like syrup. I burry my face in their bellies and I love taking their chubby hands in mine. They give me purpose and I have perspective. I can go into my day knowing that I am the lucky one to have little ones that breathe meaning into my life. Simply put — I had no idea how much I was going to love being a mother. I don’t know why I had the urge to give my co-worker so much sappy color. And trust me, I was very matter of fact about the above. I could have been just as easily giving driving directions. It’s because it’s the truth. While it may be emotionally touching, it wasn’t meant to be. It’s something that I felt a female at her age should know and shouldn’t be afraid of. And she was surprised to hear it. She was so accustomed to hearing about the weight and nuisance that comes with having children that she had never heard someone refer to their children like I did and that made me sad. And that’s why I felt the need to say something. Society is far more comfortable commiserating about parenting and often feels uncomfortable talking about how it makes their life better. And granted, I have a successful career so I can afford luxuries that do make parenting more enjoyable so I don’t want to be completely short-sighted. But the women I interact with and engage with day to day are just as successful if not more so and these are the women that are trepidatious about motherhood. So this is for them. I’ll never forget the moment I decided to have children. My husband and I had just returned from a trip over Thanksgiving. We had an incredible time and talked about whether we really wanted to have children and interestingly enough, where we netted out that was that it might not be for us given our careers and the enjoyment we garnered from our lives with each other. A few weeks later, we visited childhood friends of mine that have two kids. The Christmas Tree was up and stockings were on the fireplace and all the kids could talk about was Santa. “Did you know Santa is coming?” the little one wistfully chirped. The anticipation they had and the joy they felt brought this new meaning to a holiday that, truth be told, I had found to be a bit of a pain with work budget pressures in the fourth quarter coupled with dreary never-ending holiday commitments. My friend’s child’s question and his excitement was simple and real and perfect. And I knew I needed and wanted that outlook on the world where I could reimagine my current space and place in the world with an objectivity that I’d treasure and learn from. And I received that by having children. Having children should not feel like Mount Everest in front of you. I understand the unknown can feel like a burden but having little people should not. I’ve been there and I get it. And I wish someone had been more positive about having kids and painted a more attractive picture. And truth be told, knowing this wouldn’t have changed the trajectory of where I am but I think it would have removed the anxiousness I felt when approaching motherhood. So if I can help eliminate that obstacle for someone else, I figured I should try. Entertainment and advertising consistently paint mom as this one that is harried and who loses touch with society and that’s simply not the case. And I am here to prove it. So while I’d like to take credit for “doing it all,” I can’t. I’m the lucky one. ", "author": "Megan Imbres", "parent": ""}