{"name": "2099", "title": "How to End up with a Career That You Never Wanted", "sentences": [{"6b18": "How to End up with a Career That You Never Wanted"}, {"6a06": "It always starts with a good reason:"}, {"73e3": "“Grad school’s a good fall back.”"}, {"4a8c": "“So I can have the optionality later…”"}, {"2980": "“It’ll get my parents off my back while I figure out what I really want to do…”"}, {"a75c": "Then comes the studying, the flashcards, and the pre-tests."}, {"72b8": "You take the exam and don’t like your score– so you take it again. And, since you got such a great score, this time, you might as well apply to few brand-name schools. After all, isn’t that why you took the test in the first place?"}, {"92cb": "So you write your application essays, prepare for the interviews, and, sure enough, you get into your second-choice school."}, {"fadf": "By this point, you’ve put so much time and energy into applying that you’d be crazy not to accept your spot (or at least that’s what your friends and family say)."}, {"0a26": "So you accept the spot, assuring yourself that even if this isn’t what you want it’ll still look good on your resume."}, {"2419": "Two years and $100,000 later you graduate. Now it’s time to actually get a job. Unfortunately, in order to go to grad school, you had to take on a good deal of debt, so taking a risky job or following your passion, is now out of the question."}, {"47b3": "Instead, you opt for a respectable job with a decent salary. You work hard in order to make more money, to fuel night-time and weekend activities that distract you from the workday."}, {"597a": "Eventually, though, because you don’t truly love what you do, you stop taking on extra responsibility at work. You don’t put in the time to master your craft. Your peers start to race ahead as your career sputters and stalls."}, {"9df4": "You’d like to change jobs but now you’ve got a lifestyle that’s been structured around your income bracket and a family that depends on your salary. Starting all over feels impossible. So here you are– stuck in a career you never wanted in the first place."}, {"da56": "This may seem like an overly grim picture, but it’s the outline of a story I’ve heard in many different forms while interviewing applicants for Tradecraft. Some are just graduating college wondering if they should go to grad school. Others are later into their career, trying to find a way out of a job that makes them unhappy. Wherever you are in your career, this post is meant to help you avoid the mistakes of others and find a career path that’s right for you."}, {"4f67": "How did it come to this?"}, {"54a0": "First, it helps to understand the common psychological biases that lead people to make bad career decisions."}, {"87eb": "It starts with small commitments, like studying for an entrance test, that can bias your mind in profound ways. When deciding whether or not to take a re-test, you look back on how much you’ve studied and can easily trick yourself into thinking that you wouldn’t have worked so hard if you didn’t really want to go to grad school."}, {"c8b1": "By the time the acceptance letter arrives you can’t help but think about all the time you’ve sunk into working for towards this goal, and you start to believe that there’s no turning back."}, {"0607": "What could you have done instead?"}, {"9292": "How to Find a Fulfilling Career Path"}, {"55e0": "First thing’s first– you need a goal."}, {"a71c": "Research shows that people tend to find fulfillment in careers that offer them a sense of autonomy, mastery, and purpose. Since roles that offer all these gifts are quite rare, it’s important that you seek to develop rare and valuable skills that you can offer in return (here’s a great book if you want to dive further into this idea)."}, {"6a4d": "“It’s better to have a goal and change it, than to be sprinting towards an outcome that you’re not certain you even want.”"}, {"47ba": "But how can you know which career path will allow you to develop skills like these? A helpful framework for evaluating different career paths comes from the book The Startup of You:"}, {"abc9": "When evaluating possible career paths you’ll want to consider:"}, {"31c8": "Note: If you’re looking for somewhere to start, my biased recommendation is that you look into working at a technology startup. Their unique combination of large-scale problems and resource constraints will push you to learn and grow much faster than most other careers."}, {"81a7": "Either way, you should pick the hypothesis that seems most promising and find ways to test it, such as:"}, {"bf70": "If you sense a fit, dive in and double down. You’ll likely make some small pivots along the way. Perhaps instead of being a product designer at a health tech company you decide you’re more interested in ed-tech. Maybe instead of doing paid acquisition, you decide you like content marketing. That’s okay. It’s better to have a goal and change it than to be sprinting towards an outcome that you’re not even sure you want."}, {"73e2": "To learn more about how to execute a career transition, once you’ve got a role in mind, here’s a great post by a Tradecraft colleague."}, {"e977": "Don’t I Need a Backup Plan?"}, {"0609": "Sure you do."}, {"a49f": "We live in a fast-changing world where technology is progressively automating jobs that were once the exclusive domain of human beings. So by all means, make sure you have a backup plan."}, {"6711": "But not just any role serves as a good backup. Your safety role should be a one that:"}, {"f835": "This is the reason that well-trodden paths involving grad schools– like law, accounting, or medicine– don’t make for good backup plans."}, {"ff90": "In Summary"}, {"76b0": "I am certainly not saying that no one should aim to become a lawyer, a doctor, or an accountant (I know plenty of people who have found fulfilling careers in these fields). What I am advising is to be deliberate about the path you take. Don’t sink your time and money towards a career path that you haven’t tested. Instead, make intentional choices to build a career that will give you the greatest shot at fulfillment."}, {"bd37": "At Tradecraft we’ve helped a few hundred people transition into fast-growing startups like Facebook, Uber, Medium, Udemy, Gusto etc. If you’re serious about making this your career path and you want hands-on help with tactics & execution, drop us a line."}], "child": "2099_1\t2099_2\t2099_3\t2099_4\t2099_5\t2099_6\t2099_72099_1\t2099_2\t2099_3\t2099_4\t2099_5\t2099_6\t2099_7", "timestamp": "Jul 5, 2016", "content": "How to End up with a Career That You Never Wanted It always starts with a good reason: “Grad school’s a good fall back.” “So I can have the optionality later…” “It’ll get my parents off my back while I figure out what I really want to do…” Then comes the studying, the flashcards, and the pre-tests. You take the exam and don’t like your score– so you take it again. And, since you got such a great score, this time, you might as well apply to few brand-name schools. After all, isn’t that why you took the test in the first place? So you write your application essays, prepare for the interviews, and, sure enough, you get into your second-choice school. By this point, you’ve put so much time and energy into applying that you’d be crazy not to accept your spot (or at least that’s what your friends and family say). So you accept the spot, assuring yourself that even if this isn’t what you want it’ll still look good on your resume. Two years and $100,000 later you graduate. Now it’s time to actually get a job. Unfortunately, in order to go to grad school, you had to take on a good deal of debt, so taking a risky job or following your passion, is now out of the question. Instead, you opt for a respectable job with a decent salary. You work hard in order to make more money, to fuel night-time and weekend activities that distract you from the workday. Eventually, though, because you don’t truly love what you do, you stop taking on extra responsibility at work. You don’t put in the time to master your craft. Your peers start to race ahead as your career sputters and stalls. You’d like to change jobs but now you’ve got a lifestyle that’s been structured around your income bracket and a family that depends on your salary. Starting all over feels impossible. So here you are– stuck in a career you never wanted in the first place. This may seem like an overly grim picture, but it’s the outline of a story I’ve heard in many different forms while interviewing applicants for Tradecraft. Some are just graduating college wondering if they should go to grad school. Others are later into their career, trying to find a way out of a job that makes them unhappy. Wherever you are in your career, this post is meant to help you avoid the mistakes of others and find a career path that’s right for you. How did it come to this? First, it helps to understand the common psychological biases that lead people to make bad career decisions. It starts with small commitments, like studying for an entrance test, that can bias your mind in profound ways. When deciding whether or not to take a re-test, you look back on how much you’ve studied and can easily trick yourself into thinking that you wouldn’t have worked so hard if you didn’t really want to go to grad school. By the time the acceptance letter arrives you can’t help but think about all the time you’ve sunk into working for towards this goal, and you start to believe that there’s no turning back. What could you have done instead? How to Find a Fulfilling Career Path First thing’s first– you need a goal. Research shows that people tend to find fulfillment in careers that offer them a sense of autonomy, mastery, and purpose. Since roles that offer all these gifts are quite rare, it’s important that you seek to develop rare and valuable skills that you can offer in return (here’s a great book if you want to dive further into this idea). “It’s better to have a goal and change it, than to be sprinting towards an outcome that you’re not certain you even want.” But how can you know which career path will allow you to develop skills like these? A helpful framework for evaluating different career paths comes from the book The Startup of You: When evaluating possible career paths you’ll want to consider: Note: If you’re looking for somewhere to start, my biased recommendation is that you look into working at a technology startup. Their unique combination of large-scale problems and resource constraints will push you to learn and grow much faster than most other careers. Either way, you should pick the hypothesis that seems most promising and find ways to test it, such as: If you sense a fit, dive in and double down. You’ll likely make some small pivots along the way. Perhaps instead of being a product designer at a health tech company you decide you’re more interested in ed-tech. Maybe instead of doing paid acquisition, you decide you like content marketing. That’s okay. It’s better to have a goal and change it than to be sprinting towards an outcome that you’re not even sure you want. To learn more about how to execute a career transition, once you’ve got a role in mind, here’s a great post by a Tradecraft colleague. Don’t I Need a Backup Plan? Sure you do. We live in a fast-changing world where technology is progressively automating jobs that were once the exclusive domain of human beings. So by all means, make sure you have a backup plan. But not just any role serves as a good backup. Your safety role should be a one that: This is the reason that well-trodden paths involving grad schools– like law, accounting, or medicine– don’t make for good backup plans. In Summary I am certainly not saying that no one should aim to become a lawyer, a doctor, or an accountant (I know plenty of people who have found fulfilling careers in these fields). What I am advising is to be deliberate about the path you take. Don’t sink your time and money towards a career path that you haven’t tested. Instead, make intentional choices to build a career that will give you the greatest shot at fulfillment. At Tradecraft we’ve helped a few hundred people transition into fast-growing startups like Facebook, Uber, Medium, Udemy, Gusto etc. If you’re serious about making this your career path and you want hands-on help with tactics & execution, drop us a line. ", "author": "Nick deWilde", "parent": ""}