{"name": "2100", "title": "A growing number of people think their job is useless. Time to rethink the meaning of work", "sentences": [{"ea91": "A growing number of people think their job is useless. Time to rethink the meaning of work"}, {"eb9e": "The value of your work should not be determined by your paycheck, says Rutger Bergman, argues Rutger Bergman. Image: REUTERS/Neil Hall"}, {"b7a9": "Rutger Bregman, Correspondent, De Correspondent, Netherlands"}, {"4bed": "A great deal has been written in recent years about the perils of automation. With predicted mass unemployment, declining wages, and increasing inequality, clearly we should all be afraid."}, {"f03a": "By now it’s no longer just the Silicon Valley trend watchers and technoprophets who are apprehensive. In a study that has already racked up several hundred citations, scholars at Oxford University have estimated that no less than 47% of all American jobs and 54% of those in Europe are at a high risk of being usurped by machines. And not in a hundred years or so, but in the next 20. “The only real difference between enthusiasts and skeptics is a time frame,” notes a New York University professor. “But a century from now, nobody will much care about how long it took, only what happened next.”"}, {"a15d": "I admit, we’ve heard it all before. Employees have been worrying about the rising tide of automation for 200 years now, and for 200 years employers have been assuring them that new jobs will naturally materialize to take their place. After all, if you look at the year 1800, some 74% of all Americans were farmers, whereas by 1900 this figure was down to 31%, and by 2000 to a mere 3%. Yet this hasn’t led to mass unemployment. In 1930, the famous economist John Maynard Keynes was predicting that we’d all be working just 15-hour weeks by the year 2030. Yet, since the 1980s, work has only been taking up more of our time, bringing waves of burnouts and stress in its wake."}, {"4060": "Meanwhile, the crux of the issue isn’t even being discussed. The real question we should be asking ourselves is: what actually constitutes “work” in this day and age?"}, {"61e9": "What is “work” anyway?"}, {"1145": "In a 2013 survey of 12,000 professionals by the Harvard Business Review, half said they felt their job had no “meaning and significance,” and an equal number were unable to relate to their company’s mission, while another poll among 230,000 employees in 142 countries showed that only 13% of workers actually like their job. A recent poll among Brits revealed that as many as 37% think they have a job that is utterly useless."}, {"ae45": "They have, what anthropologist David Graeber refers to as, “bullshit jobs”. On paper, these jobs sound fantastic. And yet there are scores of successful professionals with imposing LinkedIn profiles and impressive salaries who nevertheless go home every evening grumbling that their work serves no purpose."}, {"07c4": "Image: REUTERS/Toru Hanai"}, {"6445": "Let’s get one thing clear though: I’m not talking about the sanitation workers, the teachers, and the nurses of the world. If these people were to go on strike, we’d have an instant state of emergency on our hands. No, I’m talking about the growing armies of consultants, bankers, tax advisors, managers, and others who earn their money in strategic trans-sector peer-to-peer meetings to brainstorm the value-add on co-creation in the network society. Or something to that effect."}, {"3b23": "So, will there still be enough jobs for everyone a few decades from now? Anybody who fears mass unemployment underestimates capitalism’s extraordinary ability to generate new bullshit jobs. If we want to really reap the rewards of the huge technological advances made in recent decades (and of the advancing robots), then we need to radically rethink our definition of “work.”"}, {"d566": "The paradox of progress"}, {"1c61": "It starts with an age-old question: what is the meaning of life? Most people would say the meaning of life is to make the world a little more beautiful, or nicer, or more interesting. But how? These days, our main answer to that is: through work."}, {"a23b": "Our definition of work, however, is incredibly narrow. Only the work that generates money is allowed to count toward GDP. Little wonder, then, that we have organized education around feeding as many people as possible in bite-size flexible parcels into the employment establishment. Yet what happens when a growing proportion of people deemed successful by the measure of our knowledge economy say their work is pointless?"}, {"6378": "That’s one of the biggest taboos of our times. Our whole system of finding meaning could dissolve like a puff of smoke."}, {"1462": "The irony is that technological progress is only exacerbating this crisis. Historically, society has been able to afford more bullshit jobs precisely because our robots kept getting better. As our farms and factories grew more efficient, they accounted for a shrinking share of our economy. And the more productive agriculture and manufacturing became, the fewer people they employed. Call it the paradox of progress: the richer we become, the more room we have to waste our time. It’s like Brad Pitt says in Fight Club: too often, we’re “working jobs we hate so we can buy shit we don’t need.”"}, {"e5b6": "The time has come to stop sidestepping the debate and home in on the real issue: what would our economy look like if we were to radically redefine the meaning of “work”? I firmly believe that a universal basic income is the most effective answer to the dilemma of advancing robotization. Not because robots will take over all the purposeful jobs, but because a basic income would give everybody the chance to do work that is meaningful."}, {"6c50": "Rutger Bregman is the author of ‘Utopia For Realists’, published by Bloomsbury in the U.K. and by Little, Brown in the U.S."}, {"b6eb": "I believe in a future where the value of your work is not determined by the size of your paycheck, but by the amount of happiness you spread and the amount of meaning you give. I believe in a future where the point of education is not to prepare you for another useless job, but for a life well lived. I believe in a future where “jobs are for robots and life is for people.”"}, {"8418": "And if basic income sounds Utopian to you, then I’d like to remind you that every milestone of civilization — from the end of slavery to democracy to equal rights for men and women — was once a Utopian fantasy too. Or, as Oscar Wilde wrote long ago: “Progress is the realization of Utopias.”"}, {"d0e9": "This article has been translated from Dutch by Elizabeth Manton."}, {"0fee": "Have you read?"}, {"b54e": "Originally published at www.weforum.org."}], "child": "2100_1\t2100_2\t2100_3\t2100_42100_1\t2100_2\t2100_3\t2100_42100_1\t2100_2\t2100_3\t2100_4", "timestamp": "Apr 12", "content": "A growing number of people think their job is useless. Time to rethink the meaning of work The value of your work should not be determined by your paycheck, says Rutger Bergman, argues Rutger Bergman. Image: REUTERS/Neil Hall Rutger Bregman, Correspondent, De Correspondent, Netherlands A great deal has been written in recent years about the perils of automation. With predicted mass unemployment, declining wages, and increasing inequality, clearly we should all be afraid. By now it’s no longer just the Silicon Valley trend watchers and technoprophets who are apprehensive. In a study that has already racked up several hundred citations, scholars at Oxford University have estimated that no less than 47% of all American jobs and 54% of those in Europe are at a high risk of being usurped by machines. And not in a hundred years or so, but in the next 20. “The only real difference between enthusiasts and skeptics is a time frame,” notes a New York University professor. “But a century from now, nobody will much care about how long it took, only what happened next.” I admit, we’ve heard it all before. Employees have been worrying about the rising tide of automation for 200 years now, and for 200 years employers have been assuring them that new jobs will naturally materialize to take their place. After all, if you look at the year 1800, some 74% of all Americans were farmers, whereas by 1900 this figure was down to 31%, and by 2000 to a mere 3%. Yet this hasn’t led to mass unemployment. In 1930, the famous economist John Maynard Keynes was predicting that we’d all be working just 15-hour weeks by the year 2030. Yet, since the 1980s, work has only been taking up more of our time, bringing waves of burnouts and stress in its wake. Meanwhile, the crux of the issue isn’t even being discussed. The real question we should be asking ourselves is: what actually constitutes “work” in this day and age? What is “work” anyway? In a 2013 survey of 12,000 professionals by the Harvard Business Review, half said they felt their job had no “meaning and significance,” and an equal number were unable to relate to their company’s mission, while another poll among 230,000 employees in 142 countries showed that only 13% of workers actually like their job. A recent poll among Brits revealed that as many as 37% think they have a job that is utterly useless. They have, what anthropologist David Graeber refers to as, “bullshit jobs”. On paper, these jobs sound fantastic. And yet there are scores of successful professionals with imposing LinkedIn profiles and impressive salaries who nevertheless go home every evening grumbling that their work serves no purpose. Image: REUTERS/Toru Hanai Let’s get one thing clear though: I’m not talking about the sanitation workers, the teachers, and the nurses of the world. If these people were to go on strike, we’d have an instant state of emergency on our hands. No, I’m talking about the growing armies of consultants, bankers, tax advisors, managers, and others who earn their money in strategic trans-sector peer-to-peer meetings to brainstorm the value-add on co-creation in the network society. Or something to that effect. So, will there still be enough jobs for everyone a few decades from now? Anybody who fears mass unemployment underestimates capitalism’s extraordinary ability to generate new bullshit jobs. If we want to really reap the rewards of the huge technological advances made in recent decades (and of the advancing robots), then we need to radically rethink our definition of “work.” The paradox of progress It starts with an age-old question: what is the meaning of life? Most people would say the meaning of life is to make the world a little more beautiful, or nicer, or more interesting. But how? These days, our main answer to that is: through work. Our definition of work, however, is incredibly narrow. Only the work that generates money is allowed to count toward GDP. Little wonder, then, that we have organized education around feeding as many people as possible in bite-size flexible parcels into the employment establishment. Yet what happens when a growing proportion of people deemed successful by the measure of our knowledge economy say their work is pointless? That’s one of the biggest taboos of our times. Our whole system of finding meaning could dissolve like a puff of smoke. The irony is that technological progress is only exacerbating this crisis. Historically, society has been able to afford more bullshit jobs precisely because our robots kept getting better. As our farms and factories grew more efficient, they accounted for a shrinking share of our economy. And the more productive agriculture and manufacturing became, the fewer people they employed. Call it the paradox of progress: the richer we become, the more room we have to waste our time. It’s like Brad Pitt says in Fight Club: too often, we’re “working jobs we hate so we can buy shit we don’t need.” The time has come to stop sidestepping the debate and home in on the real issue: what would our economy look like if we were to radically redefine the meaning of “work”? I firmly believe that a universal basic income is the most effective answer to the dilemma of advancing robotization. Not because robots will take over all the purposeful jobs, but because a basic income would give everybody the chance to do work that is meaningful. Rutger Bregman is the author of ‘Utopia For Realists’, published by Bloomsbury in the U.K. and by Little, Brown in the U.S. I believe in a future where the value of your work is not determined by the size of your paycheck, but by the amount of happiness you spread and the amount of meaning you give. I believe in a future where the point of education is not to prepare you for another useless job, but for a life well lived. I believe in a future where “jobs are for robots and life is for people.” And if basic income sounds Utopian to you, then I’d like to remind you that every milestone of civilization — from the end of slavery to democracy to equal rights for men and women — was once a Utopian fantasy too. Or, as Oscar Wilde wrote long ago: “Progress is the realization of Utopias.” This article has been translated from Dutch by Elizabeth Manton. Have you read? Originally published at www.weforum.org. ", "author": "World Economic Forum", "parent": ""}