{"name": "2101", "title": "How to Get Ahead When You Have Nothing to Offer", "sentences": [{"8d03": "How to Get Ahead When You Have Nothing to Offer"}, {"3ec0": "Dear young reader,"}, {"7802": "You’ve been lied to."}, {"f89c": "Ever since you were a little kid, you were told that in order to be successful, you have to train, prepare, study, and pick up certain skills. Only once you have these skills can you take life by the horns and get ahead. Once you are qualified, only then can you get that job you dream of, land that raise, make that money, or move to that neighborhood in which you want to live. So you study hard, you specialize, you stay up late and take internships in the industry in which you work."}, {"f920": "But you struggle still to get ahead. It feels like everybody else is moving up in their game as you move up. As you try to get ahead, so does everybody else who is nearly as skilled. So you study harder. You work to become more qualified. You put in long hours in entry-level jobs and work your way up the corporate ladder. The stakes keep getting higher as you move higher and it still seems like you can never get ahead."}, {"0206": "Or even worse, you have nothing to offer even after all of this studying and working towards qualifications. Sure, you may have the bare requirements for the job, like a college degree or a fancy internship, but when you come to the table and a potential employer or business partner or investor asks you what you can offer, you feel yourself grasping for straws and bullshitting your way through the conversation."}, {"8c05": "How did this happen? You followed the advice of your well-meaning guidance counselors, teachers, career coaches, and mentors. You went to the best college you could afford and you didn’t slack off."}, {"828f": "Or, you’re just starting down this process and you have an uneasy feeling in your stomach that what I just described is what’s going to happen to you."}, {"90ef": "I’ve seen it happen firsthand. I’ve spent the last four years traveling the country and working with young people to accelerate their careers. I can feel the uneasiness on college campuses and the look of “what have I gotten myself into?” in recent grads’ eyes."}, {"e380": "It doesn’t have to be this way."}, {"5bb3": "In fact, if you’re a young person today, you have a superpower that older, more established people lack."}, {"90a2": "We all have two things in life: time and opportunity costs. These two functions of the fourth dimension interact with each other but are not the same for everybody."}, {"511d": "Time is the great equalizer. A hobo and a billionaire both have the same amount of time in the day. You have 24 hours in your day. Warren Buffett has 24 hours in his day. Elon Musk has 24 hours in his day. Donald Trump has 24 hours in his day."}, {"b52f": "The most productive and prolific among us do not magically create time out of thin air. You can figure out all of the productivity hacks you want, but listening to every episode of The Tim Ferriss Show is not going to open up a wormhole and give you more hours than everybody else in the day."}, {"c963": "This is something that should reassure you and empower you. You can leverage this egalitarianism of the universe in your favor. This is where your superpower comes in handy: low opportunity cost."}, {"f2c4": "Opportunity cost is an economic concept that refers to what you miss out on by not choosing the next-best use of your time. Any choice you make has opportunity cost. That I chose to sit down and write this article instead of reading a book or working on spreadsheet work brings with it the cost of not getting those things done. As you become more skilled or experienced or specialized, in theory, your opportunity cost goes up. A brain surgeon has higher opportunity cost than a janitor. Warren Buffett has higher opportunity cost than you do. If Warren wanted to go on vacation, imagine all of the value that would not be captured since he wouldn’t be working! If you chose to go on vacation, chances are the value you wouldn’t capture would be less than that which Warren wouldn’t capture."}, {"74b1": "For Warren to use his time effectively, he should spend it doing that which has the highest return for him. This could be learning more about potential investments, managing existing investments, or doing high-value meetings. No matter how much he optimizes his time, though, he’s going to leave value on the floor."}, {"118d": "See where I’m going with this?"}, {"287e": "We needn’t use extravagant examples like Warren Buffett or Bill Gates to get the point across, either. A small business owner or a startup founder has a ton of things that need to be accomplished on any given day but her time is limited to 24 hours (realistically, 20–16 hours to account for sleeping). This time might be best spent focusing on her product or leading team meetings or sitting down with investors."}, {"429a": "In a perfect world, this is why we have division of labor. The startup founder might find her time is best spent meeting with potential clients but the books still need to get done, so she hires a bookkeeper. Marketing may need to be accomplished so she hires a marketer. An inbound funnel needs to be managed so she hires a sales rep."}, {"8e27": "But we live in an imperfect world. Often it doesn’t make sense to hire a full-time marketer for quite a while, or to have a dedicated person handle sales until everything else is also handled. Until revenue starts flowing, it can be downright stupid to start dividing labor that early."}, {"4d1b": "But time marches on. She hits the point of diminishing marginal returns with compartmentalizing her work."}, {"cf70": "This is where you come in."}, {"9c5b": "There exist people in this world — they are all around you, I promise you — with high opportunity cost and who need things done, many of which are not highly specialized things. You have low opportunity cost and you aren’t so specialized as to be pigeonholed into a specific area."}, {"174c": "You can solve this problem for them. You can create value without having to be super-qualified and specialized. Value-creation is the core of getting ahead. While your peers are busy racking up credentials, you can start racking up social capital."}, {"e281": "I’m not just blowing abstract smoke here. I’ve lived this myself and have seen dozens of young people live it out. Personally, I went from being an undergrad studying philosophy (don’t ask…) to becoming a founding team member of a prominent education startup to now even confidently launching my own companies. All without being “qualified.”"}, {"b6fa": "Here’s how I did it:"}, {"2824": "When a sophomore in college, I was doing well and learning a lot. I had landed a research fellowship that allowed me to learn a lot about philosophy (and be paid for it!) and had even designed a course for the major. But if you had asked me what I was qualified in doing, I would have chuckled and told you, “sitting on the beach and reading books about moral psychology.” That’s about it. I lied to myself and told myself I could “write well” (if you think writing well in school means writing well in the real world, you’re in for a rude awakening)."}, {"3514": "And I was bored out of my mind."}, {"76d6": "I had met somebody (cc/ Isaac Morehouse, who has elucidated the below concept of social capital well over the last few years) a few years prior with whom I kept in touch and I knew was building a company (I was even in the focus group). I knew he had a ton of things to get done. He was busy launching a company while working at another company and taking care of his wife and kids."}, {"59ce": "I offered to take some work — any work — off his plate."}, {"fcde": "In time, I learned new skills about writing copy, doing sales, and organizing content for the product and my role became more specialized, but I started with nothing to offer besides time and an extra set of hands."}, {"f120": "In time, I was hired full-time and given equity in the company — something I could never have achieved in such a short time if I made my case based on “qualifications.” It is from this position that I’ve been able to publish a book, appear on major news networks, and meet mentors and new business partners I would have never otherwise interacted with on my old track."}, {"3c0b": "For a while, I wasn’t being paid in cash (though that did come sooner rather than later). I was paid in something much more valuable: social capital."}, {"c3ca": "Like money, social capital can accrue in an account of sorts when you make deposits and can shrink when you make withdrawals. You make deposits when you create surplus value for others that isn’t captured by cash money. You don’t have to work for free while going to school to do this. You can do this by introducing two people who should know each other, by doing favors for people who need an extra set of hands, and by picking up the value left on the floor. (Similarly, when you make introductions that waste people’s time, when you yourself unnecessarily waste somebody’s time — learn how to google questions! — and when you drop extra value on the floor, you make withdrawals.) Once this account is sufficiently large, you can cash it in for benefits and goodies that money cannot buy — you can’t just purchase a job."}, {"4a32": "Besides focusing way too much on qualifications, the other mistake young people make is focusing on the wrong kind of capital. They focus on the job that will pay them the most money now rather than the one that will allow them to accrue the most social capital, open the most doors, and gain the most applicable skills they’ll need later on."}, {"8e0a": "So, how do you get ahead when you have “nothing” to offer?"}, {"da2a": "You leverage your low opportunity cost to pick up value left on the floor. This might not immediately get you cold, hard cash, but it will give you social capital. Deposit this social capital in your social capital account, let it accrue value and let that interest compound and new doors will open to you."}, {"12a6": "Find value to be picked up."}, {"578f": "Pick it up."}, {"1077": "Accrue social capital."}, {"5123": "Dominate your career."}], "child": "2101_1\t2101_2\t2101_3\t2101_4\t2101_5\t2101_6\t2101_7\t2101_8\t2101_9\t2101_10\t2101_11\t2101_12", "timestamp": "Apr 9", "content": "How to Get Ahead When You Have Nothing to Offer Dear young reader, You’ve been lied to. Ever since you were a little kid, you were told that in order to be successful, you have to train, prepare, study, and pick up certain skills. Only once you have these skills can you take life by the horns and get ahead. Once you are qualified, only then can you get that job you dream of, land that raise, make that money, or move to that neighborhood in which you want to live. So you study hard, you specialize, you stay up late and take internships in the industry in which you work. But you struggle still to get ahead. It feels like everybody else is moving up in their game as you move up. As you try to get ahead, so does everybody else who is nearly as skilled. So you study harder. You work to become more qualified. You put in long hours in entry-level jobs and work your way up the corporate ladder. The stakes keep getting higher as you move higher and it still seems like you can never get ahead. Or even worse, you have nothing to offer even after all of this studying and working towards qualifications. Sure, you may have the bare requirements for the job, like a college degree or a fancy internship, but when you come to the table and a potential employer or business partner or investor asks you what you can offer, you feel yourself grasping for straws and bullshitting your way through the conversation. How did this happen? You followed the advice of your well-meaning guidance counselors, teachers, career coaches, and mentors. You went to the best college you could afford and you didn’t slack off. Or, you’re just starting down this process and you have an uneasy feeling in your stomach that what I just described is what’s going to happen to you. I’ve seen it happen firsthand. I’ve spent the last four years traveling the country and working with young people to accelerate their careers. I can feel the uneasiness on college campuses and the look of “what have I gotten myself into?” in recent grads’ eyes. It doesn’t have to be this way. In fact, if you’re a young person today, you have a superpower that older, more established people lack. We all have two things in life: time and opportunity costs. These two functions of the fourth dimension interact with each other but are not the same for everybody. Time is the great equalizer. A hobo and a billionaire both have the same amount of time in the day. You have 24 hours in your day. Warren Buffett has 24 hours in his day. Elon Musk has 24 hours in his day. Donald Trump has 24 hours in his day. The most productive and prolific among us do not magically create time out of thin air. You can figure out all of the productivity hacks you want, but listening to every episode of The Tim Ferriss Show is not going to open up a wormhole and give you more hours than everybody else in the day. This is something that should reassure you and empower you. You can leverage this egalitarianism of the universe in your favor. This is where your superpower comes in handy: low opportunity cost. Opportunity cost is an economic concept that refers to what you miss out on by not choosing the next-best use of your time. Any choice you make has opportunity cost. That I chose to sit down and write this article instead of reading a book or working on spreadsheet work brings with it the cost of not getting those things done. As you become more skilled or experienced or specialized, in theory, your opportunity cost goes up. A brain surgeon has higher opportunity cost than a janitor. Warren Buffett has higher opportunity cost than you do. If Warren wanted to go on vacation, imagine all of the value that would not be captured since he wouldn’t be working! If you chose to go on vacation, chances are the value you wouldn’t capture would be less than that which Warren wouldn’t capture. For Warren to use his time effectively, he should spend it doing that which has the highest return for him. This could be learning more about potential investments, managing existing investments, or doing high-value meetings. No matter how much he optimizes his time, though, he’s going to leave value on the floor. See where I’m going with this? We needn’t use extravagant examples like Warren Buffett or Bill Gates to get the point across, either. A small business owner or a startup founder has a ton of things that need to be accomplished on any given day but her time is limited to 24 hours (realistically, 20–16 hours to account for sleeping). This time might be best spent focusing on her product or leading team meetings or sitting down with investors. In a perfect world, this is why we have division of labor. The startup founder might find her time is best spent meeting with potential clients but the books still need to get done, so she hires a bookkeeper. Marketing may need to be accomplished so she hires a marketer. An inbound funnel needs to be managed so she hires a sales rep. But we live in an imperfect world. Often it doesn’t make sense to hire a full-time marketer for quite a while, or to have a dedicated person handle sales until everything else is also handled. Until revenue starts flowing, it can be downright stupid to start dividing labor that early. But time marches on. She hits the point of diminishing marginal returns with compartmentalizing her work. This is where you come in. There exist people in this world — they are all around you, I promise you — with high opportunity cost and who need things done, many of which are not highly specialized things. You have low opportunity cost and you aren’t so specialized as to be pigeonholed into a specific area. You can solve this problem for them. You can create value without having to be super-qualified and specialized. Value-creation is the core of getting ahead. While your peers are busy racking up credentials, you can start racking up social capital. I’m not just blowing abstract smoke here. I’ve lived this myself and have seen dozens of young people live it out. Personally, I went from being an undergrad studying philosophy (don’t ask…) to becoming a founding team member of a prominent education startup to now even confidently launching my own companies. All without being “qualified.” Here’s how I did it: When a sophomore in college, I was doing well and learning a lot. I had landed a research fellowship that allowed me to learn a lot about philosophy (and be paid for it!) and had even designed a course for the major. But if you had asked me what I was qualified in doing, I would have chuckled and told you, “sitting on the beach and reading books about moral psychology.” That’s about it. I lied to myself and told myself I could “write well” (if you think writing well in school means writing well in the real world, you’re in for a rude awakening). And I was bored out of my mind. I had met somebody (cc/ Isaac Morehouse, who has elucidated the below concept of social capital well over the last few years) a few years prior with whom I kept in touch and I knew was building a company (I was even in the focus group). I knew he had a ton of things to get done. He was busy launching a company while working at another company and taking care of his wife and kids. I offered to take some work — any work — off his plate. In time, I learned new skills about writing copy, doing sales, and organizing content for the product and my role became more specialized, but I started with nothing to offer besides time and an extra set of hands. In time, I was hired full-time and given equity in the company — something I could never have achieved in such a short time if I made my case based on “qualifications.” It is from this position that I’ve been able to publish a book, appear on major news networks, and meet mentors and new business partners I would have never otherwise interacted with on my old track. For a while, I wasn’t being paid in cash (though that did come sooner rather than later). I was paid in something much more valuable: social capital. Like money, social capital can accrue in an account of sorts when you make deposits and can shrink when you make withdrawals. You make deposits when you create surplus value for others that isn’t captured by cash money. You don’t have to work for free while going to school to do this. You can do this by introducing two people who should know each other, by doing favors for people who need an extra set of hands, and by picking up the value left on the floor. (Similarly, when you make introductions that waste people’s time, when you yourself unnecessarily waste somebody’s time — learn how to google questions! — and when you drop extra value on the floor, you make withdrawals.) Once this account is sufficiently large, you can cash it in for benefits and goodies that money cannot buy — you can’t just purchase a job. Besides focusing way too much on qualifications, the other mistake young people make is focusing on the wrong kind of capital. They focus on the job that will pay them the most money now rather than the one that will allow them to accrue the most social capital, open the most doors, and gain the most applicable skills they’ll need later on. So, how do you get ahead when you have “nothing” to offer? You leverage your low opportunity cost to pick up value left on the floor. This might not immediately get you cold, hard cash, but it will give you social capital. Deposit this social capital in your social capital account, let it accrue value and let that interest compound and new doors will open to you. Find value to be picked up. Pick it up. Accrue social capital. Dominate your career. ", "author": "Zak Slayback", "parent": ""}