{"name": "2105", "title": "The Real Reason Everyone Loves The BBC Dad Video", "sentences": [{"b346": "The Real Reason Everyone Loves The BBC Dad Video"}, {"d250": "Who can resist a little kid in glasses?"}, {"7ebf": "The dancing is cute but the glasses are killer."}, {"d43f": "We live on the internet now, so we’ve all seen the video of the “BBC Dad,” a.k.a. Korean studies professor Robert Kelly being interviewed live on air via video chat when his kids barge in. But what is it about this video that is so great?"}, {"deaa": "Is it the dad, who relatably sighs, like “aw jeez, not now guys” kind of way? Is it the way he closes his eyes, raising his impeccably arched eyebrows, and seems to be praying for this not to be happening to him, not right now? Is it the way he palms his daughter in the chest and shoves her back into the bed, hoping against hope to get her out of the shot?"}, {"178e": "Is it the baby in the rolly walker, which in England they call very sweetly a ‘rambler,’ who rambles on through the open door, blithely following his older sister into a cool part of the house he doesn’t usually get to see?"}, {"88b0": "Is is the mom, who is the mom and not the nanny by the way, who slides in on her socks in a panic, glides down onto her knees and grabs one child wrist in each hand and drags them backwards through the door, all the while in a low crouch, hoping against hope that she is not in the shot?"}, {"4f1d": "No, it is the little girl in pink plastic glasses. She is by far and away the element that “makes” this viral video “work” and be “so hilarious” and “amazing.” From the way she comes march-dancing in, swinging her arms, eating what looks to be a marker, to leaning back on what is presumably the guest bed in the dad’s makeshift home office slash spare bedroom, to the way she is dragged out completely horizontal, one thing is consistent: the pink plastic glasses."}, {"8fc4": "Little kids in rec specs are the cutest, it’s just a fact."}, {"33ee": "Today, when the Wall Street Journal published a follow-up video with the whole family on camera. This is pretty much proof positive of a few things: 1) The dad is still annoyed by the distraction of his wriggling kids but swears he has a sense of humor about it, 2) 8-month-olds do not want to sit still, and 3) a four-year-old in glasses is outrageously cute. Watch her at the end as she walks up to the camera with a little plastic flower. It’s the glasses!"}], "child": "2105_1\t2105_2", "timestamp": "Mar 14", "content": "The Real Reason Everyone Loves The BBC Dad Video Who can resist a little kid in glasses? The dancing is cute but the glasses are killer. We live on the internet now, so we’ve all seen the video of the “BBC Dad,” a.k.a. Korean studies professor Robert Kelly being interviewed live on air via video chat when his kids barge in. But what is it about this video that is so great? Is it the dad, who relatably sighs, like “aw jeez, not now guys” kind of way? Is it the way he closes his eyes, raising his impeccably arched eyebrows, and seems to be praying for this not to be happening to him, not right now? Is it the way he palms his daughter in the chest and shoves her back into the bed, hoping against hope to get her out of the shot? Is it the baby in the rolly walker, which in England they call very sweetly a ‘rambler,’ who rambles on through the open door, blithely following his older sister into a cool part of the house he doesn’t usually get to see? Is is the mom, who is the mom and not the nanny by the way, who slides in on her socks in a panic, glides down onto her knees and grabs one child wrist in each hand and drags them backwards through the door, all the while in a low crouch, hoping against hope that she is not in the shot? No, it is the little girl in pink plastic glasses. She is by far and away the element that “makes” this viral video “work” and be “so hilarious” and “amazing.” From the way she comes march-dancing in, swinging her arms, eating what looks to be a marker, to leaning back on what is presumably the guest bed in the dad’s makeshift home office slash spare bedroom, to the way she is dragged out completely horizontal, one thing is consistent: the pink plastic glasses. Little kids in rec specs are the cutest, it’s just a fact. Today, when the Wall Street Journal published a follow-up video with the whole family on camera. This is pretty much proof positive of a few things: 1) The dad is still annoyed by the distraction of his wriggling kids but swears he has a sense of humor about it, 2) 8-month-olds do not want to sit still, and 3) a four-year-old in glasses is outrageously cute. Watch her at the end as she walks up to the camera with a little plastic flower. It’s the glasses! ", "author": "Silvia Killingsworth", "parent": ""}