{"name": "2121", "title": "$PHP = 💩;", "sentences": [{"0740": "$PHP = 💩;"}, {"2f88": "It’s well known that PHP is a dead programming language and that its 22-year-old ecosystem is effectively useless now that we have Node and its fancy new asynchronous frameworks. Node’s superiority is evident because everyone knows that single-threaded, asynchronous, programs are better by default. Faster. Stronger, even."}, {"604a": "“But Simon! Why?!”, you’re probably yelling at your MacBook screen. Here’s why:"}, {"88f2": "Job Prospects"}, {"f74c": "PHP developers are not in demand at all. After ~22 years, all companies using PHP immediately gave up on it as soon as Node v0.0.1 was released because it was instantly the better application environment. Furthermore, everyone knows that to be a successful new startup (unlike Slack) you have to create Node-based web APIs backed by MongoDB. It’s simply impossible to be successful otherwise."}, {"3ca6": "Here’s some science to back up these claims."}, {"85bd": "$caption = ‘PHP devs can\\’t find jobs to support their families’;"}, {"6caa": "Language Ecosystem"}, {"81eb": "The ecosystem surrounding a language is probably the single most important factor in deciding not to use it. Luckily for us, PHP has been around long enough that its ecosystem is full of large, well-maintained, and full-featured frameworks to hate like its Rails-equivalent Laravel or its enterprise frameworks Symfony and Zend. Unlike PHP, Node developers don’t have to worry about finding a framework to hate because everyone just writes their own. By writing their own framework, a developer can truly separate themselves from their competition by reinventing the wheel in a way that makes sense to them. This practice also doubles as job security for the developer, as seen in the Scientific™ Job Prospects research results above. It also triples as Developer Cool Factor™ (all great developers write their own frameworks, check out Magic-Box or MortarJS)."}, {"2606": "The overwhelming evidence for Node’s superior ecosystem can be witnessed below."}, {"af4c": "$caption = ‘More frameworks is more better’;"}, {"8d82": "Time Breakdown"}, {"e036": "Of course, a developer’s true level of productivity can only be measured in how they spend their time. Seen here, PHP developers waste more time writing code and building functional applications than they do cultivating Developer Cool Factor™ mass and GitHub stars. This is obviously going to reflect negatively on them when they apply to work at a startup and is thus an unproductive use of their time because, as we all know, GitHub stars are a quantitative way to measure developer skill."}, {"cf1d": "PHP developers’ inability to contribute to society is made obvious below."}, {"5a6d": "Things You Can’t do as a PHP Developer"}, {"bba1": "PHP as a Business Tool"}, {"72c9": "We all know that PHP is unquestionably inferior and cannot support a legitimate business’s application, so here is a list of failed businesses using PHP compared to a list of successful businesses implementing Node-based web services."}, {"d5df": "$caption = ‘Node is a remarkably efficient tool of evil’;"}, {"dcff": "Conclusion"}, {"8226": "Every developer knows that the quickest and most efficient path to getting anything accomplished is to complain a lot and start from scratch. The market will always wait for your startup to finish building its framework first. Besides, why should we bother to offload work and rely on a language’s open source community when we can just do everything ourselves?"}, {"c2ae": "At Fuzz we enjoy working with every programming language (especially PHP!) and we love open source ☺. Check out our GitHub!"}], "child": "2121_1\t2121_2\t2121_3\t2121_4\t2121_5\t2121_6\t2121_7\t2121_8\t2121_9\t2121_10\t2121_11\t2121_12\t2121_13\t2121_14\t2121_15\t2121_16\t2121_17\t2121_18\t2121_19\t2121_20\t2121_21\t2121_22\t2121_23\t2121_24\t2121_25", "timestamp": "Apr 7", "content": "$PHP = 💩; It’s well known that PHP is a dead programming language and that its 22-year-old ecosystem is effectively useless now that we have Node and its fancy new asynchronous frameworks. Node’s superiority is evident because everyone knows that single-threaded, asynchronous, programs are better by default. Faster. Stronger, even. “But Simon! Why?!”, you’re probably yelling at your MacBook screen. Here’s why: Job Prospects PHP developers are not in demand at all. After ~22 years, all companies using PHP immediately gave up on it as soon as Node v0.0.1 was released because it was instantly the better application environment. Furthermore, everyone knows that to be a successful new startup (unlike Slack) you have to create Node-based web APIs backed by MongoDB. It’s simply impossible to be successful otherwise. Here’s some science to back up these claims. $caption = ‘PHP devs can\\’t find jobs to support their families’; Language Ecosystem The ecosystem surrounding a language is probably the single most important factor in deciding not to use it. Luckily for us, PHP has been around long enough that its ecosystem is full of large, well-maintained, and full-featured frameworks to hate like its Rails-equivalent Laravel or its enterprise frameworks Symfony and Zend. Unlike PHP, Node developers don’t have to worry about finding a framework to hate because everyone just writes their own. By writing their own framework, a developer can truly separate themselves from their competition by reinventing the wheel in a way that makes sense to them. This practice also doubles as job security for the developer, as seen in the Scientific™ Job Prospects research results above. It also triples as Developer Cool Factor™ (all great developers write their own frameworks, check out Magic-Box or MortarJS). The overwhelming evidence for Node’s superior ecosystem can be witnessed below. $caption = ‘More frameworks is more better’; Time Breakdown Of course, a developer’s true level of productivity can only be measured in how they spend their time. Seen here, PHP developers waste more time writing code and building functional applications than they do cultivating Developer Cool Factor™ mass and GitHub stars. This is obviously going to reflect negatively on them when they apply to work at a startup and is thus an unproductive use of their time because, as we all know, GitHub stars are a quantitative way to measure developer skill. PHP developers’ inability to contribute to society is made obvious below. Things You Can’t do as a PHP Developer PHP as a Business Tool We all know that PHP is unquestionably inferior and cannot support a legitimate business’s application, so here is a list of failed businesses using PHP compared to a list of successful businesses implementing Node-based web services. $caption = ‘Node is a remarkably efficient tool of evil’; Conclusion Every developer knows that the quickest and most efficient path to getting anything accomplished is to complain a lot and start from scratch. The market will always wait for your startup to finish building its framework first. Besides, why should we bother to offload work and rely on a language’s open source community when we can just do everything ourselves? At Fuzz we enjoy working with every programming language (especially PHP!) and we love open source ☺. Check out our GitHub! ", "author": "Simon Yousoufov", "parent": ""}