{"name": "2126", "title": "The Open-Closed Principle เปลี่ยนพฤติกรรม Code โดยไม่แก้ไข Code ทำยังไงหละนี้ (ตอน 2)", "sentences": [{"a1de": "The Open-Closed Principle เปลี่ยนพฤติกรรม Code โดยไม่แก้ไข Code ทำยังไงหละนี้ (ตอน 2)"}, {"5410": "สวัสดีครับ บทความนี้ก็เป็นตอนที่ 2 ของ The Open-Closed Principle นะครับ เพราะฉะนั้นแนะนำให้ทุกท่านไปอ่านตอนที่ 1 ก่อนนะครับ (ใครที่อ่านมาแล้วก็แนะนำให้กลับไปอ่านครับ 555+ เพราะเนื้อหามันต่อกัน บทความสั้นๆครับประมาณ 5 นาทีเท่านั้นเอง)"}, {"6005": "The Open-Closed Principle เปลี่ยนพฤติกรรม Code โดยไม่แก้ไข Code ทำยังไงหละนี้ (ตอน 1)“ Dutch Door — A door divided in two horizontally so that either part can be left open or closed. ”medium.com"}, {"5131": "จากตอนที่แล้วโปรแกรมเล่นเสียงดนตรีของเราก็มีรูปร่างดังรูปนี้ครับ"}, {"030c": "เรามี Instrument(เครื่องดนตรี) interface ที่ Class ของเครื่องดนตรีทุกชนิดต้อง Implement มันก่อนครับ (เหตุผลเพราะอะไร ไปอ่านตอนที่ 1 นะครับผม)"}, {"5526": "ตอนนี้ผมก็มีเครื่องดนตรี 4 ชนิดครับ คือ IndianLute(พิณ) Fiddle(ซอ) Dulcimer(ขิม) และ Flute(ขลุ่ย)"}, {"ef0e": "แล้วก็ Function ที่เอาไว้เล่นเครื่องดนตรีพวกนี้ครับ"}, {"704e": "จะเห็นว่าตอนนี้เราไม่สนใจแล้วนะครับ ว่าเครื่องดนตรีนั้นเป็นประเภทอะไร (ดีด สี ตี เป่า) แค่รู้ว่ามันเล่นได้ก็พอครับ (ก็คือการ Abstract โดยใช้ Interface นั่นเอง)"}, {"b559": "เวลาที่เราจะใช้ Function นี้ เพื่อที่จะให้มันเล่นเสียงดนตรีก็ตามนี้ครับ"}, {"cd81": "JavaScript ES6+: var, let, or const?Perhaps the most important thing you can learn to be a better coder is to keep things simple. In the context of…medium.com"}, {"1cb9": "หลังจากส่ง Software ตัวนี้ให้ลูกค้า ลูกค้าก็ใช้งานได้ราบรื่นดีครับ ไม่มีปัญหาอะไร จนผ่านไป 6 เดือน ลูกค้าอยู่ดีดีก็มาหาที่บริษัทครับ(มากับ Requirement ใหม่แน่ๆ) แล้วก็บอกว่า อยากให้ Software ตัวนี้จัดอันดับการเล่นของเครื่องดนตรีแต่ละชนิดได้ด้วย (นั่นไงว่าแล้วว)"}, {"f3b6": "ในฐานะของ Programmer ตอนนี้คงมีสบถอยู่ในใจกันมั่งหละครับ เปลี่ยนอีกแล้วหรอเนี่ยยยย อุตส่าห์ Apply OCP ไปแล้ว(จากตอนที่ 1) ไม่คิดว่าจะต้องมายุ่งกับ function นี้อีกแล้ว OMG"}, {"9d0c": "555+ คือจะบอกว่าไม่มีอะไรที่เป็น Ideal หรือ Perfect ครับ ต่อให้เราจะใช้กี่ Principles กี่ Patterns แต่ด้วยอำนาจของ Requirement ใหม่ๆ จากลูกค้าแล้ว มันก็ยังมีโอกาสที่ทำให้เราต้องไปแก้ Code ในส่วนนั้นอยู่ดีครับ"}, {"8f09": "“ Fool me once, shame on you. Fool me twice, shame on me. ”"}, {"8ecc": "ประเด็นสำคัญมันอยู่ตรงนี้ครับ เวลาเขียน Software ขึ้นมา อย่าเขียนมันเพื่อ Changes ที่ยังไม่เกิดครับ ให้รอ Changes ที่มาจากลูกค้าก่อน(ครั้งแรก) แล้ว Apply OCP ใน Code ส่วนนั้นของเราครับ เท่ากับว่าต่อไป(ครั้งต่อๆไป) ถ้าลูกค้าต้องการให้เราเปลี่ยนแปลงพฤติกรรมของ Code เราในแนวนี้อีก ใน Requirement หน้า เราไม่ต้องกลับมาแก้ไข Code ในส่วนนี้อีกแล้ว แค่เขียน Code เพิ่ม (Open for extension, closed for modification)"}, {"353c": "อาจจะยังไม่เห็นภาพ ยกตัวอย่าง ในตอนที่ 1 ลูกค้า Require เข้ามาคือต้องการเพิ่มประเภทของเครื่องดนตรี เราก็ทำการ Apply OCP ไปใน Code ที่เกี่ยวข้อง พอครั้งที่ 2 ลูกค้าต้องการเพิ่มเครื่องดนตรีประเภทอื่นๆอีก จะเห็นได้ว่าเราไม่ต้องกลับไปแก้ไข Code ใน playAllInstruments function อีกต่อไปแล้ว"}, {"6e81": "แต่ในตอนที่ 2 นี้ ลูกค้า Require ให้เราเล่นเครื่องดนตรีตามลำดับ ซึ่งมันเป็น Requirement ใหม่เลย(การจัดอันดับ ไม่ได้เกี่ยวข้องกับ การเพิ่มชนิดของเครื่องดนตรีเลย) นี้แหละครับก็คือเหตุผลที่ทำให้ผมต้องกลับไปยุ่งกับ playAllInstruments function อีกครั้งนึง เพื่อทำให้มันจัดอันดับการเล่นได้"}, {"c939": "เพราะฉะนั้น สิ่งที่เราต้องทำต่อไปก็คือ ใช้ OCP apply ใน requirement ใหม่นี้ แล้วถ้าต่อไปลูกค้าต้องการจัดอันดับการเล่นของเครื่องดนตรีในตำแหน่งอื่นๆ เราไม่จำเป็นต้องมาแก้ไข Code ของเราอีกต่อไปแล้ว"}, {"2f50": "อีกครั้งครับ"}, {"b8c2": "“ Fool me once, shame on you. Fool me twice, shame on me. ”"}, {"7e6e": "ให้ลูกค้า fool เราแค่ครั้งเดียวพอครับ ถ้าต่อไปมี Requirement แนวนี้มาอีก เรานั่งยิ้มได้เลย ทำการแก้ไขแปปเดียว แต่เราอาจจะบอกลูกค้าว่าสัก 1 เดือนก็ได้นะ 555+"}, {"74af": "ร่ายมาซะยาวตอนนี้ท่านผู้อ่านคงคิดในใจว่า แล้วเมื่อไรคุณเมิงจะแก้ไขปัญหาหละเนี่ย เอาหละครับ เรามาเริ่มกันเถอะ หลังจากนั่งคุยกับลูกค้าอยู่เป็นชั่วโมงผมก็ได้ Requirement ใหม่มาดังนี้"}, {"0f5d": "นั่งๆคิดดูมันก็คล้ายกับ การจัดอันเพลงใน Playlist เลยนะครับ เพลงที่ถูกจัดอันดับจะเล่นตามลำดับที่เราต้องการ ส่วนเพลงที่เหลือเล่นแบบ random ครับผม"}, {"3eae": "ต่อมาผมก็มานั่งแปลความเป็นภาษา Programming อีกที ถ้าผมผ่าน variable นี้เข้าไปใน playAllInstruments function ของผม"}, {"7527": "โปรแกรมของผมจะต้องเล่นเสียงดนตรีในลำดับดังนี้ครับ"}, {"8113": "// (1)                                      flute.play() // ขลุ่ย                        dulcimer.play() // ขิม                      indianLute.play() // พิณ                    fiddle.play() // ซอ "}, {"c2ee": "// (2)flute.play() // ขลุ่ยdulcimer.play() // ขิมfiddle.play() // ซอindianLute.play() // พิณ"}, {"1bb3": "จะเห็นได้ว่า พิณ กับ ซอ จะเล่นในลำดับไหนก็ได้ครับ ขอให้มันเล่นหลัง ขลุ่ย กับ ขิม ก็พอ เอาหละครับ Requirement มาเท่านี้ ก็ทำเท่านี้พอครับ"}, {"9cda": "สิ่งต่อไปที่เราต้องคิดคือถ้าต่อไป ลูกค้าอยากให้เล่น ขิม ก่อน ขลุ่ย หละ หรือ อยากให้เล่น ซอ พิณ ขิม ลำดับตามนี้หละ “เราจะ apply OCP ยังไงในรอบนี้เพื่อให้รอบหน้าเราไม่ต้องมาแก้ไข Code ในส่วนนี้อีก ถ้าเกิดมี Requirement แนวเดิมๆ แนวนี้เข้ามาอีก”"}, {"0e73": "ทำไงดี ทำไงดี ทำไงดี? หลังจากนั่ง เปิด google, stackoverflow บลา บลา บลา ผมก็ได้คำตอบดังนี้"}, {"5fcd": "ผมจะใช้ Table-Driven Approach นะครับผม มองให้มันเป็นตารางนะครับ"}, {"c8b5": "Flute(ขลุ่ย)อยู่แถวที่ 1, Dulcimer(พิณ)อยู่แถวที่ 2"}, {"d58d": "จะเห็นได้ว่าใน function playAllInstruments ของผมมีเพิ่มมา 1 บรรทัดครับ คือ"}, {"218a": "const orderedInstrument = sortInstrumentsByPlaylist(instruments)"}, {"fee3": "ก็คือพอรับ instruments มาก็เอาไป sort ที่ sortInstrumentsByPlaylist function ก่อนครับ"}, {"32c2": "สร้าง getClassNameOf function ขึ้นมา Refactoring เล็กน้อยครับให้ Code มันอ่านง่ายขึ้นนิดหน่อย 555+"}, {"a64f": "const getClassNameOf = function (obj: Object) {    return obj.constructor.name}"}, {"76e2": "Higher-Order Functions :: Eloquent JavaScriptTzu-li and Tzu-ssu were boasting about the size of their latest programs. 'Two-hundred thousand lines,' said Tzu-li,…eloquentjavascript.net"}, {"0d6e": "จะบอกว่าเสร็จแล้วครับ :)"}, {"8990": "ที่ต้องทำหลักๆคือสร้าง function ขึ้นมา sort โดยใช้ ค่าจากใน playlist แล้ว return เครื่องดนตรีที่จัดอันดับเรียบร้อยแล้วออกไปครับ"}, {"1826": "คราวนี้เรามาดูประสิทธิผลกันครับ"}, {"694a": "หลังจากเสร็จผมก็ส่งมอบงานให้ลูกค้าเรียบร้อยครับ ลูกค้าก็ใช้โปรแกรมตัวนี้ไปอย่าง Happy ครับ เหมือนจะจบอย่าง Happy Ending แต่ ยังครับยัง !!!"}, {"bffb": "ผ่านไป 3 เดือน ลูกค้าเข้ามาที่บริษัท(อีกแล้ว 555+) พร้อมมอบหมาย Requirement ใหม่ให้เรา ดังนี้"}, {"8ae6": "ใครที่อ่านมาถึงตรงนี้แล้วเข้าใจ จะเห็นได้ว่า ผมนี้นั่งยิ้มเลยครับ แต่ก็ทำหน้าเครียดบอกลูกค้าไปว่า ขอเวลาเดือนนึง !!! (เป็นตัวอย่างที่ไม่ดีอีกแล้ว)"}, {"0444": "หลังจากลูกค้าเดินออกไป ผมก็เปิด Youtube ฟังเพลง นั่งเล่น Facebook สบายใจอยู่ 30 นาที แล้วก็เริ่มแก้ไขโปรแกรมของผมดังนี้"}, {"8eb4": "2. จัดลำดับ playlist ใหม่"}, {"2933": "เสร็จครับ เสร็จแล้ว บอกลูกค้าไปเดือนนึงซะงั้น"}, {"a73e": "ในข้อหนึ่งนี้ที่ code เพิ่ม Class Guitar เข้าไป นี้คือเป็นไปตามOCP Principle นะครับ (Open for extension) แต่ในข้อ 2 นี้ มัน break rule นี้หว่า (Closed for modification) จะเห็นได้ว่ามันต้องกลับมาแก้ไข Code ใน playlist const นี้ !!!"}, {"cd41": "สุดท้ายนี้ ไม่มีอะไรที่เป็น Ideal หรือ อุดมคติครับ เราต้องรู้จักพลิกแพลงบ้างครับ"}, {"9cd7": "การทำตามกฎ ตาม Principle จะบอกว่ามันดีครับ แต่เมื่อไรที่เราเห็นว่าการ Break กฎ หรือ Principle มันมีข้อดีมากกว่าข้อเสีย เราจะทำตามกฎเพื่ออะไรหละครับ ??? จริงไหมหละครับ"}, {"88bf": "“ เพราะฉะนั้นทำอะไร เราต้องมีสติครับ ไม่ใช่น่ามืดตามัว ตามกฎ ตามคนอื่น คนรอบข้างไปซะทุกอย่าง ในชีวิตจริงก็เหมือนกันนะ ”"}, {"3aa2": "The Open-Closed Principal ก็ขอจบลงเพียงเท่านี้นะครับผม หวังว่าท่านผู้อ่านจะได้รับความรู้ ได้ Concept ใหม่ๆไม่มากก็น้อยนะครับ ขอบคุณที่อ่านจนจบครับผม ถ้ามีอะไรอยากแนะนำ หรือติชมก็เต็มที่ได้เลยครับ โพสที่ comment ข้างล่างได้เลย ยินดีรับฟังทุกความเห็นครับผม"}, {"ece5": "ส่วนในบทความหน้าเรามารู้จักกับตัว L ใน SOLID กัน จะเป็นอะไรรอติดตามนะครับผม : )"}, {"7a7a": "ฝาก Fanpage ด้วยครับผม: https://www.facebook.com/imkrish.developer/"}, {"b3be": "สำหรับ Open-Closed Principle ตอนที่ 1 นะครับ อ่านได้ที่นี้เลยครับ"}, {"56b0": "The Open-Closed Principle เปลี่ยนพฤติกรรม Code โดยไม่แก้ไข Code ทำยังไงหละนี้ (ตอน 1)“ Dutch Door — A door divided in two horizontally so that either part can be left open or closed. ”medium.com"}, {"5823": "สำหรับใครอยากรู้ว่าทำไมเราควร Apply SOLID Principlesใน Software ของเรา อ่านที่บทความนี้ได้เลยครับ"}, {"5093": "Design Smells — Software ของคุณมีกลิ่นหรือเปล่า ?อันนี้ก็เป็นบทความแรกของผมนะครับ ผิดพลาดตรงไหน อยากติตรงไหนก็เต็มที่ได้เลยครับ ยินดีครับ จะได้นำไปปรับปรุงสำหรับบทความ…medium.com"}, {"b170": "สำหรับ Principle แรกของ SOLID: The Single-Responsibility Principle อ่านได้ที่นี้จ้า"}, {"b5d8": "The Single-Responsibility Principle มันคืออะไรกันแน่?สวัสดีครับ ในบทความนี้จะพาทุกท่านมารู้จักกับ Principle แรกใน SOLID นั่นก็คือ Smedium.com"}, {"5e4c": "Reference:"}, {"8521": "Robert cecil martin. (2002). Agile Software Development, Principles, Patterns, and Practices. (1st ed.). England: Pearson."}, {"1f1d": "“ Happiness Only Real When Shared ”"}, {"700b": "ที่เริ่มเขียน Blog เพราะไปดูหนังเรื่องนึงแล้วเจอ Quote นี้ ผมก็เลยจะลองดูครับว่ามันจริงหรือเปล่า"}], "child": "2126_12126_12126_1", "timestamp": "Jul 10, 2016", "content": "The Open-Closed Principle เปลี่ยนพฤติกรรม Code โดยไม่แก้ไข Code ทำยังไงหละนี้ (ตอน 2) สวัสดีครับ บทความนี้ก็เป็นตอนที่ 2 ของ The Open-Closed Principle นะครับ เพราะฉะนั้นแนะนำให้ทุกท่านไปอ่านตอนที่ 1 ก่อนนะครับ (ใครที่อ่านมาแล้วก็แนะนำให้กลับไปอ่านครับ 555+ เพราะเนื้อหามันต่อกัน บทความสั้นๆครับประมาณ 5 นาทีเท่านั้นเอง) The Open-Closed Principle เปลี่ยนพฤติกรรม Code โดยไม่แก้ไข Code ทำยังไงหละนี้ (ตอน 1)“ Dutch Door — A door divided in two horizontally so that either part can be left open or closed. ”medium.com จากตอนที่แล้วโปรแกรมเล่นเสียงดนตรีของเราก็มีรูปร่างดังรูปนี้ครับ เรามี Instrument(เครื่องดนตรี) interface ที่ Class ของเครื่องดนตรีทุกชนิดต้อง Implement มันก่อนครับ (เหตุผลเพราะอะไร ไปอ่านตอนที่ 1 นะครับผม) ตอนนี้ผมก็มีเครื่องดนตรี 4 ชนิดครับ คือ IndianLute(พิณ) Fiddle(ซอ) Dulcimer(ขิม) และ Flute(ขลุ่ย) แล้วก็ Function ที่เอาไว้เล่นเครื่องดนตรีพวกนี้ครับ จะเห็นว่าตอนนี้เราไม่สนใจแล้วนะครับ ว่าเครื่องดนตรีนั้นเป็นประเภทอะไร (ดีด สี ตี เป่า) แค่รู้ว่ามันเล่นได้ก็พอครับ (ก็คือการ Abstract โดยใช้ Interface นั่นเอง) เวลาที่เราจะใช้ Function นี้ เพื่อที่จะให้มันเล่นเสียงดนตรีก็ตามนี้ครับ JavaScript ES6+: var, let, or const?Perhaps the most important thing you can learn to be a better coder is to keep things simple. In the context of…medium.com หลังจากส่ง Software ตัวนี้ให้ลูกค้า ลูกค้าก็ใช้งานได้ราบรื่นดีครับ ไม่มีปัญหาอะไร จนผ่านไป 6 เดือน ลูกค้าอยู่ดีดีก็มาหาที่บริษัทครับ(มากับ Requirement ใหม่แน่ๆ) แล้วก็บอกว่า อยากให้ Software ตัวนี้จัดอันดับการเล่นของเครื่องดนตรีแต่ละชนิดได้ด้วย (นั่นไงว่าแล้วว) ในฐานะของ Programmer ตอนนี้คงมีสบถอยู่ในใจกันมั่งหละครับ เปลี่ยนอีกแล้วหรอเนี่ยยยย อุตส่าห์ Apply OCP ไปแล้ว(จากตอนที่ 1) ไม่คิดว่าจะต้องมายุ่งกับ function นี้อีกแล้ว OMG 555+ คือจะบอกว่าไม่มีอะไรที่เป็น Ideal หรือ Perfect ครับ ต่อให้เราจะใช้กี่ Principles กี่ Patterns แต่ด้วยอำนาจของ Requirement ใหม่ๆ จากลูกค้าแล้ว มันก็ยังมีโอกาสที่ทำให้เราต้องไปแก้ Code ในส่วนนั้นอยู่ดีครับ “ Fool me once, shame on you. Fool me twice, shame on me. ” ประเด็นสำคัญมันอยู่ตรงนี้ครับ เวลาเขียน Software ขึ้นมา อย่าเขียนมันเพื่อ Changes ที่ยังไม่เกิดครับ ให้รอ Changes ที่มาจากลูกค้าก่อน(ครั้งแรก) แล้ว Apply OCP ใน Code ส่วนนั้นของเราครับ เท่ากับว่าต่อไป(ครั้งต่อๆไป) ถ้าลูกค้าต้องการให้เราเปลี่ยนแปลงพฤติกรรมของ Code เราในแนวนี้อีก ใน Requirement หน้า เราไม่ต้องกลับมาแก้ไข Code ในส่วนนี้อีกแล้ว แค่เขียน Code เพิ่ม (Open for extension, closed for modification) อาจจะยังไม่เห็นภาพ ยกตัวอย่าง ในตอนที่ 1 ลูกค้า Require เข้ามาคือต้องการเพิ่มประเภทของเครื่องดนตรี เราก็ทำการ Apply OCP ไปใน Code ที่เกี่ยวข้อง พอครั้งที่ 2 ลูกค้าต้องการเพิ่มเครื่องดนตรีประเภทอื่นๆอีก จะเห็นได้ว่าเราไม่ต้องกลับไปแก้ไข Code ใน playAllInstruments function อีกต่อไปแล้ว แต่ในตอนที่ 2 นี้ ลูกค้า Require ให้เราเล่นเครื่องดนตรีตามลำดับ ซึ่งมันเป็น Requirement ใหม่เลย(การจัดอันดับ ไม่ได้เกี่ยวข้องกับ การเพิ่มชนิดของเครื่องดนตรีเลย) นี้แหละครับก็คือเหตุผลที่ทำให้ผมต้องกลับไปยุ่งกับ playAllInstruments function อีกครั้งนึง เพื่อทำให้มันจัดอันดับการเล่นได้ เพราะฉะนั้น สิ่งที่เราต้องทำต่อไปก็คือ ใช้ OCP apply ใน requirement ใหม่นี้ แล้วถ้าต่อไปลูกค้าต้องการจัดอันดับการเล่นของเครื่องดนตรีในตำแหน่งอื่นๆ เราไม่จำเป็นต้องมาแก้ไข Code ของเราอีกต่อไปแล้ว อีกครั้งครับ “ Fool me once, shame on you. Fool me twice, shame on me. ” ให้ลูกค้า fool เราแค่ครั้งเดียวพอครับ ถ้าต่อไปมี Requirement แนวนี้มาอีก เรานั่งยิ้มได้เลย ทำการแก้ไขแปปเดียว แต่เราอาจจะบอกลูกค้าว่าสัก 1 เดือนก็ได้นะ 555+ ร่ายมาซะยาวตอนนี้ท่านผู้อ่านคงคิดในใจว่า แล้วเมื่อไรคุณเมิงจะแก้ไขปัญหาหละเนี่ย เอาหละครับ เรามาเริ่มกันเถอะ หลังจากนั่งคุยกับลูกค้าอยู่เป็นชั่วโมงผมก็ได้ Requirement ใหม่มาดังนี้ นั่งๆคิดดูมันก็คล้ายกับ การจัดอันเพลงใน Playlist เลยนะครับ เพลงที่ถูกจัดอันดับจะเล่นตามลำดับที่เราต้องการ ส่วนเพลงที่เหลือเล่นแบบ random ครับผม ต่อมาผมก็มานั่งแปลความเป็นภาษา Programming อีกที ถ้าผมผ่าน variable นี้เข้าไปใน playAllInstruments function ของผม โปรแกรมของผมจะต้องเล่นเสียงดนตรีในลำดับดังนี้ครับ // (1)                                      flute.play() // ขลุ่ย                        dulcimer.play() // ขิม                      indianLute.play() // พิณ                    fiddle.play() // ซอ  // (2)flute.play() // ขลุ่ยdulcimer.play() // ขิมfiddle.play() // ซอindianLute.play() // พิณ จะเห็นได้ว่า พิณ กับ ซอ จะเล่นในลำดับไหนก็ได้ครับ ขอให้มันเล่นหลัง ขลุ่ย กับ ขิม ก็พอ เอาหละครับ Requirement มาเท่านี้ ก็ทำเท่านี้พอครับ สิ่งต่อไปที่เราต้องคิดคือถ้าต่อไป ลูกค้าอยากให้เล่น ขิม ก่อน ขลุ่ย หละ หรือ อยากให้เล่น ซอ พิณ ขิม ลำดับตามนี้หละ “เราจะ apply OCP ยังไงในรอบนี้เพื่อให้รอบหน้าเราไม่ต้องมาแก้ไข Code ในส่วนนี้อีก ถ้าเกิดมี Requirement แนวเดิมๆ แนวนี้เข้ามาอีก” ทำไงดี ทำไงดี ทำไงดี? หลังจากนั่ง เปิด google, stackoverflow บลา บลา บลา ผมก็ได้คำตอบดังนี้ ผมจะใช้ Table-Driven Approach นะครับผม มองให้มันเป็นตารางนะครับ Flute(ขลุ่ย)อยู่แถวที่ 1, Dulcimer(พิณ)อยู่แถวที่ 2 จะเห็นได้ว่าใน function playAllInstruments ของผมมีเพิ่มมา 1 บรรทัดครับ คือ const orderedInstrument = sortInstrumentsByPlaylist(instruments) ก็คือพอรับ instruments มาก็เอาไป sort ที่ sortInstrumentsByPlaylist function ก่อนครับ สร้าง getClassNameOf function ขึ้นมา Refactoring เล็กน้อยครับให้ Code มันอ่านง่ายขึ้นนิดหน่อย 555+ const getClassNameOf = function (obj: Object) {    return obj.constructor.name} Higher-Order Functions :: Eloquent JavaScriptTzu-li and Tzu-ssu were boasting about the size of their latest programs. 'Two-hundred thousand lines,' said Tzu-li,…eloquentjavascript.net จะบอกว่าเสร็จแล้วครับ :) ที่ต้องทำหลักๆคือสร้าง function ขึ้นมา sort โดยใช้ ค่าจากใน playlist แล้ว return เครื่องดนตรีที่จัดอันดับเรียบร้อยแล้วออกไปครับ คราวนี้เรามาดูประสิทธิผลกันครับ หลังจากเสร็จผมก็ส่งมอบงานให้ลูกค้าเรียบร้อยครับ ลูกค้าก็ใช้โปรแกรมตัวนี้ไปอย่าง Happy ครับ เหมือนจะจบอย่าง Happy Ending แต่ ยังครับยัง !!! ผ่านไป 3 เดือน ลูกค้าเข้ามาที่บริษัท(อีกแล้ว 555+) พร้อมมอบหมาย Requirement ใหม่ให้เรา ดังนี้ ใครที่อ่านมาถึงตรงนี้แล้วเข้าใจ จะเห็นได้ว่า ผมนี้นั่งยิ้มเลยครับ แต่ก็ทำหน้าเครียดบอกลูกค้าไปว่า ขอเวลาเดือนนึง !!! (เป็นตัวอย่างที่ไม่ดีอีกแล้ว) หลังจากลูกค้าเดินออกไป ผมก็เปิด Youtube ฟังเพลง นั่งเล่น Facebook สบายใจอยู่ 30 นาที แล้วก็เริ่มแก้ไขโปรแกรมของผมดังนี้ 2. จัดลำดับ playlist ใหม่ เสร็จครับ เสร็จแล้ว บอกลูกค้าไปเดือนนึงซะงั้น ในข้อหนึ่งนี้ที่ code เพิ่ม Class Guitar เข้าไป นี้คือเป็นไปตามOCP Principle นะครับ (Open for extension) แต่ในข้อ 2 นี้ มัน break rule นี้หว่า (Closed for modification) จะเห็นได้ว่ามันต้องกลับมาแก้ไข Code ใน playlist const นี้ !!! สุดท้ายนี้ ไม่มีอะไรที่เป็น Ideal หรือ อุดมคติครับ เราต้องรู้จักพลิกแพลงบ้างครับ การทำตามกฎ ตาม Principle จะบอกว่ามันดีครับ แต่เมื่อไรที่เราเห็นว่าการ Break กฎ หรือ Principle มันมีข้อดีมากกว่าข้อเสีย เราจะทำตามกฎเพื่ออะไรหละครับ ??? จริงไหมหละครับ “ เพราะฉะนั้นทำอะไร เราต้องมีสติครับ ไม่ใช่น่ามืดตามัว ตามกฎ ตามคนอื่น คนรอบข้างไปซะทุกอย่าง ในชีวิตจริงก็เหมือนกันนะ ” The Open-Closed Principal ก็ขอจบลงเพียงเท่านี้นะครับผม หวังว่าท่านผู้อ่านจะได้รับความรู้ ได้ Concept ใหม่ๆไม่มากก็น้อยนะครับ ขอบคุณที่อ่านจนจบครับผม ถ้ามีอะไรอยากแนะนำ หรือติชมก็เต็มที่ได้เลยครับ โพสที่ comment ข้างล่างได้เลย ยินดีรับฟังทุกความเห็นครับผม ส่วนในบทความหน้าเรามารู้จักกับตัว L ใน SOLID กัน จะเป็นอะไรรอติดตามนะครับผม : ) ฝาก Fanpage ด้วยครับผม: https://www.facebook.com/imkrish.developer/ สำหรับ Open-Closed Principle ตอนที่ 1 นะครับ อ่านได้ที่นี้เลยครับ The Open-Closed Principle เปลี่ยนพฤติกรรม Code โดยไม่แก้ไข Code ทำยังไงหละนี้ (ตอน 1)“ Dutch Door — A door divided in two horizontally so that either part can be left open or closed. ”medium.com สำหรับใครอยากรู้ว่าทำไมเราควร Apply SOLID Principlesใน Software ของเรา อ่านที่บทความนี้ได้เลยครับ Design Smells — Software ของคุณมีกลิ่นหรือเปล่า ?อันนี้ก็เป็นบทความแรกของผมนะครับ ผิดพลาดตรงไหน อยากติตรงไหนก็เต็มที่ได้เลยครับ ยินดีครับ จะได้นำไปปรับปรุงสำหรับบทความ…medium.com สำหรับ Principle แรกของ SOLID: The Single-Responsibility Principle อ่านได้ที่นี้จ้า The Single-Responsibility Principle มันคืออะไรกันแน่?สวัสดีครับ ในบทความนี้จะพาทุกท่านมารู้จักกับ Principle แรกใน SOLID นั่นก็คือ Smedium.com Reference: Robert cecil martin. (2002). Agile Software Development, Principles, Patterns, and Practices. (1st ed.). England: Pearson. “ Happiness Only Real When Shared ” ที่เริ่มเขียน Blog เพราะไปดูหนังเรื่องนึงแล้วเจอ Quote นี้ ผมก็เลยจะลองดูครับว่ามันจริงหรือเปล่า ", "author": "imKrish Developer", "parent": ""}