{"name": "2141", "title": "Kick starting Android Development with Kotlin — Setting up Android Studio", "sentences": [{"8e92": "Kick starting Android Development with Kotlin — Setting up Android Studio"}, {"497f": "Content"}, {"26da": "In this article we will only focus on how to setup Kotlin in Android Studio."}, {"ba26": "In case you missed my previous article or don’t know about Kotlin then check this article (Why Kotlin-ize your Android Development)"}, {"068f": "Setting up Kotlin in Android Studio"}, {"7a6e": "It’s pretty easy to setup Kotlin in Android Studio because it’s based upon IntelliJ IDE made by JetBrains which also happens to be the makers of Kotlin. Hence making a tighter integration between Kotlin and Android Studio."}, {"94ef": "Kotlin Plugin"}, {"7520": "Initially we need to install the Kotlin Plugin in Android Studio."}, {"4e25": "Steps to install the plugin:"}, {"fd12": "Installing Kotlin Plugin in Android Studio"}, {"b8d6": "Now your Android Studio has got the power to write Kotlin code."}, {"a6ab": "Configure Project with Kotlin"}, {"69be": "Once we have created a new Android project. We need to configure Kotlin for the project."}, {"7447": "PS: Before doing this, create a new Android project as you usually do"}, {"f7b8": "After doing this, Android Studio will automatically make the necessary changes to your project files. You need might to “Sync” it."}, {"599d": "Convert Java to Kotlin file"}, {"9eec": "If your new project has some existing Java files. You can convert them into Kotlin file using the following steps:"}, {"7478": "It automatically changes your Java code into Kotlin code and I have to say it works pretty good."}, {"9a15": "Thanks to the Kotlin plugin which makes it easier to start building Android apps in Kotlin"}, {"82a0": "Run, Kotlin, Run"}, {"8bfc": "That’s all. Just run your Android app on a real device or a emulator."}, {"65dd": "What’s next"}, {"b15e": "In the next articles we will dive deep into the coding part and look more into Kotlin features for Android."}], "child": "2141_1\t2141_22141_1\t2141_22141_1\t2141_2", "timestamp": "Mar 21", "content": "Kick starting Android Development with Kotlin — Setting up Android Studio Content In this article we will only focus on how to setup Kotlin in Android Studio. In case you missed my previous article or don’t know about Kotlin then check this article (Why Kotlin-ize your Android Development) Setting up Kotlin in Android Studio It’s pretty easy to setup Kotlin in Android Studio because it’s based upon IntelliJ IDE made by JetBrains which also happens to be the makers of Kotlin. Hence making a tighter integration between Kotlin and Android Studio. Kotlin Plugin Initially we need to install the Kotlin Plugin in Android Studio. Steps to install the plugin: Installing Kotlin Plugin in Android Studio Now your Android Studio has got the power to write Kotlin code. Configure Project with Kotlin Once we have created a new Android project. We need to configure Kotlin for the project. PS: Before doing this, create a new Android project as you usually do After doing this, Android Studio will automatically make the necessary changes to your project files. You need might to “Sync” it. Convert Java to Kotlin file If your new project has some existing Java files. You can convert them into Kotlin file using the following steps: It automatically changes your Java code into Kotlin code and I have to say it works pretty good. Thanks to the Kotlin plugin which makes it easier to start building Android apps in Kotlin Run, Kotlin, Run That’s all. Just run your Android app on a real device or a emulator. What’s next In the next articles we will dive deep into the coding part and look more into Kotlin features for Android. ", "author": "Akshay Chordiya", "parent": ""}