{"name": "2172", "title": "Using smart phones as a primary source for qualitative user research", "sentences": [{"1d17": "Using smart phones as a primary source for qualitative user research"}, {"6a63": "Introducing the start screen interview"}, {"de8e": "I work as a service design lead in Berlin. One of my regular activities is to do qualitative user research with customers of all sorts. I love this part of my job, because it produces so many unexpected insights and is a great way to connect with people in a short time. As part of my job, I often train others in user research as well. For a recent workshop I developed a quick method to teach the beauty of qualitative interviews. This article aims to describe the method and will enable you to apply it yourself."}, {"c8f7": "Those of you familiar with Design Thinking might have heard of the “wallet exercise”. It is a beautiful short exercise to teach people the difference between ideas based on what you think is good and what other people need. When I was asked to teach user research at an internal leadership training of a German corporate, I first wanted to do the wallet exercise. But after a brief consideration, I realised that many people at this leadership training might not have their wallet with them (because the wallet would most likely be in the hotel room). So the question was: Which very personal object would they all carry with them, that can be used for user research? In time of ubiquitous mobile phones, the answer wasn’t very hard — their phones."}, {"124e": "What is the start screen interview?"}, {"3a1d": "The start screen interview is an interview technique that uses people’s mobile phones (usually smart phones) as a starting point for storytelling. It triggers stories about the interviewee’s behaviour, personal anecdotes, preferences of all sorts and is a great conversation starter. It is based on the assumptions that:• most people carry a (smart) phone with them• the phone often has a very personal photo at the lock screen• everyone has different apps on their start screen after login (usually for a good reason)• everyone’s way of organising their apps is very personal"}, {"6d5f": "Given that these assumption are at least partially correct, this is an awesome start for user research."}, {"8e4a": "How to do the start screen interview?"}, {"e565": "The first interview part focuses on the photo on the lock screen. What is the story behind the photo? When was it taken? Why did you choose it as your lock screen? For how long have you been using it as a lock screen? In combination with “the 5 whys” the first initial photo turns out to be an invaluable source of personal clues."}, {"25df": "The second part of the interview focuses on the first screen that is shown after logging into a phone. This part is often way more functional and tells us stories about what a person is doing and how they structure their daily life. I usually focus on two main aspects here:"}, {"aaa3": "Two very different screens. Probably two very different personalities, too."}, {"63c6": "I have made very good experiences with this interview technique when I wanted to show that even a short qualitative interview can produce striking insights. Often, skeptics of user research are able to see how much one can learn in a short amount of time, so this might even be useful for your next sales pitch for user research. The method needs close to no additional equipment and is great for beginners because the object (the phone) provides the anchor points and structure (first log screen, then start screen) by itself."}, {"cb0a": "Please feel free to use the start screen interview as you like and share your experiences with me. I would be curious to hear which experiences you made with it and how you adapted it to your needs. If you want to know how to run a workshop based on the method, check out my other article ‘Experiencing the difference of qualitative and quantitative research’ as well."}], "child": "2172_1", "timestamp": "Feb 7", "content": "Using smart phones as a primary source for qualitative user research Introducing the start screen interview I work as a service design lead in Berlin. One of my regular activities is to do qualitative user research with customers of all sorts. I love this part of my job, because it produces so many unexpected insights and is a great way to connect with people in a short time. As part of my job, I often train others in user research as well. For a recent workshop I developed a quick method to teach the beauty of qualitative interviews. This article aims to describe the method and will enable you to apply it yourself. Those of you familiar with Design Thinking might have heard of the “wallet exercise”. It is a beautiful short exercise to teach people the difference between ideas based on what you think is good and what other people need. When I was asked to teach user research at an internal leadership training of a German corporate, I first wanted to do the wallet exercise. But after a brief consideration, I realised that many people at this leadership training might not have their wallet with them (because the wallet would most likely be in the hotel room). So the question was: Which very personal object would they all carry with them, that can be used for user research? In time of ubiquitous mobile phones, the answer wasn’t very hard — their phones. What is the start screen interview? The start screen interview is an interview technique that uses people’s mobile phones (usually smart phones) as a starting point for storytelling. It triggers stories about the interviewee’s behaviour, personal anecdotes, preferences of all sorts and is a great conversation starter. It is based on the assumptions that:• most people carry a (smart) phone with them• the phone often has a very personal photo at the lock screen• everyone has different apps on their start screen after login (usually for a good reason)• everyone’s way of organising their apps is very personal Given that these assumption are at least partially correct, this is an awesome start for user research. How to do the start screen interview? The first interview part focuses on the photo on the lock screen. What is the story behind the photo? When was it taken? Why did you choose it as your lock screen? For how long have you been using it as a lock screen? In combination with “the 5 whys” the first initial photo turns out to be an invaluable source of personal clues. The second part of the interview focuses on the first screen that is shown after logging into a phone. This part is often way more functional and tells us stories about what a person is doing and how they structure their daily life. I usually focus on two main aspects here: Two very different screens. Probably two very different personalities, too. I have made very good experiences with this interview technique when I wanted to show that even a short qualitative interview can produce striking insights. Often, skeptics of user research are able to see how much one can learn in a short amount of time, so this might even be useful for your next sales pitch for user research. The method needs close to no additional equipment and is great for beginners because the object (the phone) provides the anchor points and structure (first log screen, then start screen) by itself. Please feel free to use the start screen interview as you like and share your experiences with me. I would be curious to hear which experiences you made with it and how you adapted it to your needs. If you want to know how to run a workshop based on the method, check out my other article ‘Experiencing the difference of qualitative and quantitative research’ as well. ", "author": "Manuel Großmann", "parent": ""}