{"name": "2176", "title": "The difference between a journey map and a service blueprint", "sentences": [{"daa6": "The difference between a journey map and a service blueprint"}, {"d624": "Co-authored by Megan Erin Miller and Erik Flowers"}, {"d86a": "Everything that happens in our lives is a type of journey. It might be a journey that spans a few minutes, a few years, or an entire lifetime. It could be going to college, the birth of your first child, or a memorable vacation. These journeys don’t just happen on their own. Out of our view, there’s a whole orchestration going on to create the conditions for them to happen."}, {"fade": "During that college experience, hundreds or thousands of people were working to keep the college running. Hospitals and doctors were providing care making education and support accessible to the soon-to-be parents. The airline, hotel, and cruise companies were working to keep everything they produce and manage working so you can have that vacation experience with as little friction as possible."}, {"a882": "Mapping these experiences is a key part of being a human-centered business, and it is important to look at both perspectives — what the person experiences, and what went on outside of their view to make it happen. Customer journey mapping and service blueprinting are two complementary methods that can help us see both sides of our services."}, {"78e0": "Yet these two methods are often confused; what is a journey map, and what is a service blueprint, and how are they different?"}, {"2996": "Set the stage"}, {"ae4e": "Before we dive in, we need a little context. We need to understand the notion of “the stage” in service design, a cornerstone concept that is essential for understanding the difference between customer journeys and service blueprints. “The stage” is comprised of three perspectives: the front stage, the backstage, and the behind-the-scenes."}, {"5d98": "The literal metaphor is helpful here. If you imagine a simple stage in a theater, the front stage is where the action happens and what the audience can see; for us, customers act on the front stage."}, {"6f22": "The backstage is where all the support processes live that produce the front stage, the lights, the sets, the crew, all of which should be invisible to the customer, but often isn’t. The backstage is us, the organization and all the things we do to make that front stage happen."}, {"dd8d": "Then there is the behind-the-scenes, where all the intangible things that the organization must do to make both the front and backstage possible. Rules, regulations, policies, budgets; all the things that aren’t really a part of either the front or back stage."}, {"584a": "These three places are where service design has the opportunity to make an impact. Through different methods, we can better understand different stages. Let’s talk about the methods in question."}, {"cedf": "What is a journey map?"}, {"54ed": "A journey map captures iconic experiences that customers have, from their point of view; the front stage of the service experience. In creating a journey map, you use customer narratives and customer data to plot their experience over time, mapping what they are doing, thinking, and feeling, and what they are interacting with along the way."}, {"e2ce": "What you end up with is a visceral journey that helps you see and evaluate the experience your customer is having from their point of view."}, {"2e72": "A good journey tells the story of what the customer went through as a narrative that flows like an author wrote it; the author being the customer. It contains all the richness of the experience — the emotion, the internal dialog, the highs and lows — that a true story would. It’s our chance as creators to step into the customer’s shoes and “see” how they would experience it. Empathy at its core."}, {"6856": "You can create a journey map by interviewing customers to capture their insights, and then map them against each other to find commonalities, patterns, and trends. In addition, you can also piece together a customer journey map from data that is already being collected on the customer experience."}, {"1ced": "This method helps you map and make visible the end-to-end of the experience a customer has. This is the front stage of the experience, and is comprised of all the interactions they have in the context of their lives and how they interface with your business."}, {"788a": "Beyond capturing the current experience your customers are going through, journey mapping can also be used to imagine and ideate on the future, using the format as a tool to speculate on what a customer might see and do in a future experience."}, {"c21a": "Typically, a journey map is not a depiction of an actual real-world, single customer’s experience. A journey map is an aggregate of experiences compiled from customer research and the knowledge of subject-matter experts in your organization."}, {"2642": "The nature of how customers traverse the stage is unique to every single customer, but when you aggregate those paths together into a narrative, it helps you see the experience as a journey from the customer’s perspective."}, {"dc8e": "This is a powerful storytelling tool that paints a picture and allows people a chance to see something through a common lens. Journey mapping builds empathy and also lets you identify areas of the experience that you want to improve or learn more about."}, {"4109": "What is a service blueprint?"}, {"dee0": "Now let’s turn to service blueprinting. Where journey mapping focuses on exposing the end-to-end of your customer’s front stage experience, blueprinting focuses on exposing the surface-to-core of the business that makes up the backstage and behind the scenes of how you deliver and operate, and ties that to the customer’s experience."}, {"5cc6": "What journey maps and customer narratives don’t show is the internal workings of the organization. The service blueprint seeks to uncover and document (often for the first time!) all the things that go on beneath the surface and the internal makeup of the organization that creates it. It is data visualization of how your company works; the deep, dark inner workings of how the things a customer experiences are actually produced."}, {"cd5d": "There are huge complexities that go unseen that are the support structures beneath every journey — the responsibilities of the internal actors, the systems that support those actors, all the processes and policies that dictate what can and cannot be done. Service blueprinting shows you a picture that not only includes the breadth of what happens along the journey, but all the depth that makes up the substance that the journey traverses across."}, {"7a4e": "Building the blueprint"}, {"593e": "To create a service blueprint, you first need to have identified one or more end-to-end journeys, called scenarios, that you want to blueprint. These scenarios should be based in the customer journey, but can also include organizational scenarios that happen internally away from the customer’s view. It is the story of what happens at each step along the way to make the scenario “go.”"}, {"1497": "By going deep into each step in the scenario, you can expose the breadth and depth of the experience that supports and produces the stage where the journey takes place. This process relies on a cross-functional collaboration between different parts of the organization, in order to represent all aspects of the external and internal experience."}, {"58dd": "The end results is a complete picture of how the experience is delivered, end-to-end and surface-to-core. It is a powerful document that simultaneously gives you a high level view of the experience, and at the same time a detailed view into what is going on under the surface, moment-to-moment. Without this comprehensive surface-to-core view of who we are as an organization and our part in this journey we are creating, we can’t we make meaningful changes to how we serve our customers."}, {"3948": "The difference between the two"}, {"5130": "While journey mapping can help you document surface customer experiences, service blueprinting helps you “evidence” the reality of your organization. The fundamental value a blueprint provides is an objective picture, based in the reality of how your organization delivers, what they deliver, and the end-to-end view of how it is orchestrated."}, {"89f1": "There are many journeys and many customers, but there’s only one of your business, only one collection of systems, policies, and actors that make up what you offer. That is what the blueprint uncovers; the backstage that is used over and over again by the customers. We map customer experiences all the time, but rarely do we take the time to map out and document our own businesses."}, {"af54": "An experience is only as cohesive as the teams that produce it, and any attempt to make meaningful changes to an experience requires a deep understanding of the makeup of the organization that builds the stage for that experience. Blueprinting is not about documenting the customer experience. It uses the customer experience as starting point, and unpacks it to expose how the organization supports that journey."}, {"a0ee": "This is why a blueprint can seem detached from the customer and detached from the empathy that designers are told again and again is the top priority. It’s important to point out that the blueprint doesn’t seek to remove the empathetic aspect of design, and is not in conflict with a journey map’s purpose — it is simply focusing on a different dimension of that experience; the substrate it is created from. It is the objective answer to the question of “What does our organization consist of, both tangibly and intangibly, that allows these journeys to exist?”"}, {"b608": "A customer journey can only exist on what an organization can deliver; it is confined to and constrained by your internal capability. By taking a big step back and using the blueprint to truly see the end-to-end and surface-to-core all together as one, it grants you the freedom to then make big or small changes to how your organization delivers, which results in the improvement and evolution of the customer journeys it supports."}, {"bd66": "When to use what method"}, {"bad9": "If you don’t have an understanding of how your customers are experiencing what you offer, then journey mapping is a great way to uncover that, make it tangible for your organization, and build empathy around the customer."}, {"8dbd": "A journey can tell a rich story about what happens to a person that is hard to capture if it’s not turned into a narrative. That narrative is a powerful tool to rally a group around true human-centered design, and that can be an end unto itself."}, {"42d9": "If you already have a good understanding of your customer experience, or identified a particular pain point for the customer or the internal teams, then blueprinting should be your next step."}, {"a1cd": "It will allow you to dive deep into how you deliver an experience and how your organization functions (for better or worse), allowing you to address organizational pain and breakdown of processes internally. The cross-functional collaboration it fosters brings diverse organizational knowledge into a central place for the first time."}, {"b2f3": "However, don’t just go chasing customer pain. There are cases when a customer’s experience can be perfectly delightful, but behind-the-scenes the organization is going to great lengths to patch it together and maintain the appearance of cohesion."}, {"e71e": "In reality, you might be losing tremendous amounts of time, money, and employee moral by maintaining a great customer experience by using inefficient and painful internal processes. In cases like these, you might consider using the journey mapping tool to map the emotional experiences of your internal actors in order to understand organizational pain, challenges, and opportunities for improvement."}, {"ecbc": "Blueprinting is an obvious must in these cases, because it will help you understand the complexities of your organization, and let you tie underlying factors to a customer journey so that you don’t lose sight of how future changes — in the form of reduced costs, increased efficiency, boosted moral, and the overall health of the business itself — might impact the customer."}, {"608a": "We have to pay attention to these internal organizational experiences just as much as we pay attention to the customer experience."}, {"c966": "Conclusion"}, {"3b13": "Journey mapping and service blueprinting are both critical methods to understand and use in doing service design work. It is important to understand the difference between the two, and how they compliment each other. Journey mapping is about a front stage lens through which to better understand and empathize with the customer’s experience."}, {"aa62": "Blueprinting is about the backstage (and behind-the-scenes) of your business and how that backstage ties to the customer’s experience. Whether you are seeking deeper understanding of the experience your organization has created, or a deep analysis of your business, these methods will help you identify ways to create meaningful improvements to your internal processes and your customer’s experiences."}, {"1801": "The next time you look at a customer journey, try digging beneath the surface to look down to the core of what is supporting that journey. Understanding how it all adds up to create that surface customer journey means now you know. And knowing is half the battle."}, {"d26d": "You should give this article a 💚 , follow Erik Flowers and Megan Erin Miller on Medium, and on Twitter @erik_flowers and @meganerinmiller!"}, {"3a18": "Continue the conversation, and join the global Service Design Community of Practice in Slack at www.practicalservicedesign.com/community"}, {"a563": "Resources"}], "child": "2176_1\t2176_2\t2176_3\t2176_4\t2176_5\t2176_6\t2176_7\t2176_82176_1\t2176_2\t2176_3\t2176_4\t2176_5\t2176_6\t2176_7\t2176_82176_1\t2176_2\t2176_3\t2176_4\t2176_5\t2176_6\t2176_7\t2176_8", "timestamp": "Mar 8, 2016", "content": "The difference between a journey map and a service blueprint Co-authored by Megan Erin Miller and Erik Flowers Everything that happens in our lives is a type of journey. It might be a journey that spans a few minutes, a few years, or an entire lifetime. It could be going to college, the birth of your first child, or a memorable vacation. These journeys don’t just happen on their own. Out of our view, there’s a whole orchestration going on to create the conditions for them to happen. During that college experience, hundreds or thousands of people were working to keep the college running. Hospitals and doctors were providing care making education and support accessible to the soon-to-be parents. The airline, hotel, and cruise companies were working to keep everything they produce and manage working so you can have that vacation experience with as little friction as possible. Mapping these experiences is a key part of being a human-centered business, and it is important to look at both perspectives — what the person experiences, and what went on outside of their view to make it happen. Customer journey mapping and service blueprinting are two complementary methods that can help us see both sides of our services. Yet these two methods are often confused; what is a journey map, and what is a service blueprint, and how are they different? Set the stage Before we dive in, we need a little context. We need to understand the notion of “the stage” in service design, a cornerstone concept that is essential for understanding the difference between customer journeys and service blueprints. “The stage” is comprised of three perspectives: the front stage, the backstage, and the behind-the-scenes. The literal metaphor is helpful here. If you imagine a simple stage in a theater, the front stage is where the action happens and what the audience can see; for us, customers act on the front stage. The backstage is where all the support processes live that produce the front stage, the lights, the sets, the crew, all of which should be invisible to the customer, but often isn’t. The backstage is us, the organization and all the things we do to make that front stage happen. Then there is the behind-the-scenes, where all the intangible things that the organization must do to make both the front and backstage possible. Rules, regulations, policies, budgets; all the things that aren’t really a part of either the front or back stage. These three places are where service design has the opportunity to make an impact. Through different methods, we can better understand different stages. Let’s talk about the methods in question. What is a journey map? A journey map captures iconic experiences that customers have, from their point of view; the front stage of the service experience. In creating a journey map, you use customer narratives and customer data to plot their experience over time, mapping what they are doing, thinking, and feeling, and what they are interacting with along the way. What you end up with is a visceral journey that helps you see and evaluate the experience your customer is having from their point of view. A good journey tells the story of what the customer went through as a narrative that flows like an author wrote it; the author being the customer. It contains all the richness of the experience — the emotion, the internal dialog, the highs and lows — that a true story would. It’s our chance as creators to step into the customer’s shoes and “see” how they would experience it. Empathy at its core. You can create a journey map by interviewing customers to capture their insights, and then map them against each other to find commonalities, patterns, and trends. In addition, you can also piece together a customer journey map from data that is already being collected on the customer experience. This method helps you map and make visible the end-to-end of the experience a customer has. This is the front stage of the experience, and is comprised of all the interactions they have in the context of their lives and how they interface with your business. Beyond capturing the current experience your customers are going through, journey mapping can also be used to imagine and ideate on the future, using the format as a tool to speculate on what a customer might see and do in a future experience. Typically, a journey map is not a depiction of an actual real-world, single customer’s experience. A journey map is an aggregate of experiences compiled from customer research and the knowledge of subject-matter experts in your organization. The nature of how customers traverse the stage is unique to every single customer, but when you aggregate those paths together into a narrative, it helps you see the experience as a journey from the customer’s perspective. This is a powerful storytelling tool that paints a picture and allows people a chance to see something through a common lens. Journey mapping builds empathy and also lets you identify areas of the experience that you want to improve or learn more about. What is a service blueprint? Now let’s turn to service blueprinting. Where journey mapping focuses on exposing the end-to-end of your customer’s front stage experience, blueprinting focuses on exposing the surface-to-core of the business that makes up the backstage and behind the scenes of how you deliver and operate, and ties that to the customer’s experience. What journey maps and customer narratives don’t show is the internal workings of the organization. The service blueprint seeks to uncover and document (often for the first time!) all the things that go on beneath the surface and the internal makeup of the organization that creates it. It is data visualization of how your company works; the deep, dark inner workings of how the things a customer experiences are actually produced. There are huge complexities that go unseen that are the support structures beneath every journey — the responsibilities of the internal actors, the systems that support those actors, all the processes and policies that dictate what can and cannot be done. Service blueprinting shows you a picture that not only includes the breadth of what happens along the journey, but all the depth that makes up the substance that the journey traverses across. Building the blueprint To create a service blueprint, you first need to have identified one or more end-to-end journeys, called scenarios, that you want to blueprint. These scenarios should be based in the customer journey, but can also include organizational scenarios that happen internally away from the customer’s view. It is the story of what happens at each step along the way to make the scenario “go.” By going deep into each step in the scenario, you can expose the breadth and depth of the experience that supports and produces the stage where the journey takes place. This process relies on a cross-functional collaboration between different parts of the organization, in order to represent all aspects of the external and internal experience. The end results is a complete picture of how the experience is delivered, end-to-end and surface-to-core. It is a powerful document that simultaneously gives you a high level view of the experience, and at the same time a detailed view into what is going on under the surface, moment-to-moment. Without this comprehensive surface-to-core view of who we are as an organization and our part in this journey we are creating, we can’t we make meaningful changes to how we serve our customers. The difference between the two While journey mapping can help you document surface customer experiences, service blueprinting helps you “evidence” the reality of your organization. The fundamental value a blueprint provides is an objective picture, based in the reality of how your organization delivers, what they deliver, and the end-to-end view of how it is orchestrated. There are many journeys and many customers, but there’s only one of your business, only one collection of systems, policies, and actors that make up what you offer. That is what the blueprint uncovers; the backstage that is used over and over again by the customers. We map customer experiences all the time, but rarely do we take the time to map out and document our own businesses. An experience is only as cohesive as the teams that produce it, and any attempt to make meaningful changes to an experience requires a deep understanding of the makeup of the organization that builds the stage for that experience. Blueprinting is not about documenting the customer experience. It uses the customer experience as starting point, and unpacks it to expose how the organization supports that journey. This is why a blueprint can seem detached from the customer and detached from the empathy that designers are told again and again is the top priority. It’s important to point out that the blueprint doesn’t seek to remove the empathetic aspect of design, and is not in conflict with a journey map’s purpose — it is simply focusing on a different dimension of that experience; the substrate it is created from. It is the objective answer to the question of “What does our organization consist of, both tangibly and intangibly, that allows these journeys to exist?” A customer journey can only exist on what an organization can deliver; it is confined to and constrained by your internal capability. By taking a big step back and using the blueprint to truly see the end-to-end and surface-to-core all together as one, it grants you the freedom to then make big or small changes to how your organization delivers, which results in the improvement and evolution of the customer journeys it supports. When to use what method If you don’t have an understanding of how your customers are experiencing what you offer, then journey mapping is a great way to uncover that, make it tangible for your organization, and build empathy around the customer. A journey can tell a rich story about what happens to a person that is hard to capture if it’s not turned into a narrative. That narrative is a powerful tool to rally a group around true human-centered design, and that can be an end unto itself. If you already have a good understanding of your customer experience, or identified a particular pain point for the customer or the internal teams, then blueprinting should be your next step. It will allow you to dive deep into how you deliver an experience and how your organization functions (for better or worse), allowing you to address organizational pain and breakdown of processes internally. The cross-functional collaboration it fosters brings diverse organizational knowledge into a central place for the first time. However, don’t just go chasing customer pain. There are cases when a customer’s experience can be perfectly delightful, but behind-the-scenes the organization is going to great lengths to patch it together and maintain the appearance of cohesion. In reality, you might be losing tremendous amounts of time, money, and employee moral by maintaining a great customer experience by using inefficient and painful internal processes. In cases like these, you might consider using the journey mapping tool to map the emotional experiences of your internal actors in order to understand organizational pain, challenges, and opportunities for improvement. Blueprinting is an obvious must in these cases, because it will help you understand the complexities of your organization, and let you tie underlying factors to a customer journey so that you don’t lose sight of how future changes — in the form of reduced costs, increased efficiency, boosted moral, and the overall health of the business itself — might impact the customer. We have to pay attention to these internal organizational experiences just as much as we pay attention to the customer experience. Conclusion Journey mapping and service blueprinting are both critical methods to understand and use in doing service design work. It is important to understand the difference between the two, and how they compliment each other. Journey mapping is about a front stage lens through which to better understand and empathize with the customer’s experience. Blueprinting is about the backstage (and behind-the-scenes) of your business and how that backstage ties to the customer’s experience. Whether you are seeking deeper understanding of the experience your organization has created, or a deep analysis of your business, these methods will help you identify ways to create meaningful improvements to your internal processes and your customer’s experiences. The next time you look at a customer journey, try digging beneath the surface to look down to the core of what is supporting that journey. Understanding how it all adds up to create that surface customer journey means now you know. And knowing is half the battle. You should give this article a 💚 , follow Erik Flowers and Megan Erin Miller on Medium, and on Twitter @erik_flowers and @meganerinmiller! Continue the conversation, and join the global Service Design Community of Practice in Slack at www.practicalservicedesign.com/community Resources ", "author": "Megan Erin Miller", "parent": ""}