{"name": "2178", "title": "Digital with a Lean Team", "sentences": [{"2517": "Digital with a Lean Team"}, {"ff94": "A year into my position as Director of Digital at the Jewish Museum of New York, I wrote this essay on digital minimalism now published in issue 20 of Museum-iD magazine, based on a talk I gave at Museum Ideas 2016 in London."}, {"7bf9": "With the rapidly expanding role of digital at museums, we often quantify measurements of success with growth — increases in website traffic, social media followers, click-through rates, and user downloads. More is more when it comes to digital progress, but very rarely do our staff sizes and resources grow accordingly to accommodate for these changes."}, {"ba49": "At the last Museum Ideas conference in London, I presented a lecture titled “Less is More: Digital with a Lean Team.” Just nine months into my job as Director of Digital at the Jewish Museum, my intention was not to flaunt a shiny new product or present case studies with accompanying vanity metrics, but to spread the reality of a new concept — that less is more and you don’t have to do it all when it comes to digital. Contrary to popular belief, not every project or exhibition needs a microsite, and museums don’t have to be on every social media channel or have their own app. Digital projects instead should be prioritized and tailored to your audience needs, and relative to the size of the team and the resources that you need to support them."}, {"8075": "Prior to the Jewish Museum, I was Associate Director of Digital Marketing at the Guggenheim Museum, where the responsibilities of my current department of three: overseeing our website, email marketing, social media, search, mobile, video, audio, photography, and digital asset management, were carried out by five departments and more than twenty five staff members. Taking a step back as the director of a newly created department within a 112-year old institution, I made a conscious decision to scale back before moving forward, reducing our digital footprint when it came to one-off websites, social media channels with low engagement, and reimagining our mobile strategy. Following a deep look at the analytics, I asked: What are we trying to achieve? How does this initiative align with our mission? Who is our audience? If the digital initiative did not fit the bigger picture, I got rid of it."}, {"1d97": "Over the last few years, innovations in digitization, social media, and digital media at museums have enabled our ability to bring art and knowledge to an interconnected global online audience. Technology can be incredibly powerful in reaching those goals, but also risks overgrowth and overthinking the needs of our visitors. So from now on I exercise a new measurement of success: if technology is the answer, then what was the question?"}], "child": "2178_1\t2178_2\t2178_3", "timestamp": "Mar 26", "content": "Digital with a Lean Team A year into my position as Director of Digital at the Jewish Museum of New York, I wrote this essay on digital minimalism now published in issue 20 of Museum-iD magazine, based on a talk I gave at Museum Ideas 2016 in London. With the rapidly expanding role of digital at museums, we often quantify measurements of success with growth — increases in website traffic, social media followers, click-through rates, and user downloads. More is more when it comes to digital progress, but very rarely do our staff sizes and resources grow accordingly to accommodate for these changes. At the last Museum Ideas conference in London, I presented a lecture titled “Less is More: Digital with a Lean Team.” Just nine months into my job as Director of Digital at the Jewish Museum, my intention was not to flaunt a shiny new product or present case studies with accompanying vanity metrics, but to spread the reality of a new concept — that less is more and you don’t have to do it all when it comes to digital. Contrary to popular belief, not every project or exhibition needs a microsite, and museums don’t have to be on every social media channel or have their own app. Digital projects instead should be prioritized and tailored to your audience needs, and relative to the size of the team and the resources that you need to support them. Prior to the Jewish Museum, I was Associate Director of Digital Marketing at the Guggenheim Museum, where the responsibilities of my current department of three: overseeing our website, email marketing, social media, search, mobile, video, audio, photography, and digital asset management, were carried out by five departments and more than twenty five staff members. Taking a step back as the director of a newly created department within a 112-year old institution, I made a conscious decision to scale back before moving forward, reducing our digital footprint when it came to one-off websites, social media channels with low engagement, and reimagining our mobile strategy. Following a deep look at the analytics, I asked: What are we trying to achieve? How does this initiative align with our mission? Who is our audience? If the digital initiative did not fit the bigger picture, I got rid of it. Over the last few years, innovations in digitization, social media, and digital media at museums have enabled our ability to bring art and knowledge to an interconnected global online audience. Technology can be incredibly powerful in reaching those goals, but also risks overgrowth and overthinking the needs of our visitors. So from now on I exercise a new measurement of success: if technology is the answer, then what was the question? ", "author": "JiaJia Fei", "parent": ""}