{"name": "2183", "title": "#SMSports isn’t always black and white", "sentences": [{"ac38": "#SMSports isn’t always black and white"}, {"a9e1": "One of the hard parts of running a sports team’s social media accounts is coming up with the strategy for losing in the playoffs. It’s never fun to think about ending the season sooner than you (and your fans) hope for, but it’s definitely part of the job."}, {"7a23": "On Saturday night the Cincinnati Bengals finished their season with a loss to the Pittsburgh Steelers. The final score of the game was overshadowed by penalties and the actions of some of the fans in the stands."}, {"66df": "At the end of the game, the Bengals social media team decided to go silent, and were critiqued on social media. Their fans were upset about the loss, and I’m guessing that the crew in Cincinnati didn’t want to rub it in to a fan base already stung by losing the game."}, {"573a": "With all of this in mind, I posed a quick question on Twitter that saw some very insightful discussion."}, {"6c66": "A majority of people didn’t envy the position that the Bengals social media team was in."}, {"545e": "There isn’t really a good way to “win” this situation. You post a score, it gives your fans the opportunity to shout at you. You don’t post the score, it gives your fans another reason to shout."}, {"9638": "Many in the industry agreed that, the team should post something to close out the game. It didn’t have to be an in-your-face graphic or anything special, but closing out the season with at least a final tweet. The team was going to have to talk to reporters, so the social media accounts should at least post something."}, {"db91": "There are a handful of different ways the team could have handled the loss. They could have simply concluded the season with a “Thank You Fans” graphic (no score), or used something similar to what the Houston Texans did after their loss earlier in the day to the Kansas City Chiefs. Simple, easily digestible and not too in your face."}, {"0f2d": "While tweeting out of the score or final graphic seems easy enough, most of us don’t know what’s going on behind the scenes. A lot of responses noted that none of us were actually in the press box or on the field making the decision in the moment."}, {"6c8b": "Yet another layer to the story (that I didn’t even think of), was that there could easily be a sponsor tied into all final score graphics. It would be easy enough to skip the graphic, but this is just another scenario to consider when looking at the decision to go silent."}, {"680c": "It’s definitely worth noting that while some leagues shorten up their posting schedule at the end of the season, many NFL teams continue their regular posting schedule. These accounts shift a little bit and become a little more news-y, but both the Texans and Minnesota Vikings accounts continued their normal post-game strategy after their respective playoff losses."}, {"5cbf": "The Bengals did end up posting the final story a couple of hours after the game, and continued posting today. It seems to me like they wanted to let the initial storm die down before they began posting again."}, {"fcb9": "How would you have handled the situation? Leave a comment, or shoot me a tweet (be sure to use the #smsports hashtag)."}, {"9559": "Note: It’s always easy to critique when you aren’t actually in the press box or on the field making the decision in the moment. The Bengals team handled the loss the way they wanted to handle the loss. I was just attempting to gather some insights from industry professionals, and shed some light on the fact that sending a tweet is not always as black and white as some may think it is."}], "child": "2183_1", "timestamp": "Jan 11, 2016", "content": "#SMSports isn’t always black and white One of the hard parts of running a sports team’s social media accounts is coming up with the strategy for losing in the playoffs. It’s never fun to think about ending the season sooner than you (and your fans) hope for, but it’s definitely part of the job. On Saturday night the Cincinnati Bengals finished their season with a loss to the Pittsburgh Steelers. The final score of the game was overshadowed by penalties and the actions of some of the fans in the stands. At the end of the game, the Bengals social media team decided to go silent, and were critiqued on social media. Their fans were upset about the loss, and I’m guessing that the crew in Cincinnati didn’t want to rub it in to a fan base already stung by losing the game. With all of this in mind, I posed a quick question on Twitter that saw some very insightful discussion. A majority of people didn’t envy the position that the Bengals social media team was in. There isn’t really a good way to “win” this situation. You post a score, it gives your fans the opportunity to shout at you. You don’t post the score, it gives your fans another reason to shout. Many in the industry agreed that, the team should post something to close out the game. It didn’t have to be an in-your-face graphic or anything special, but closing out the season with at least a final tweet. The team was going to have to talk to reporters, so the social media accounts should at least post something. There are a handful of different ways the team could have handled the loss. They could have simply concluded the season with a “Thank You Fans” graphic (no score), or used something similar to what the Houston Texans did after their loss earlier in the day to the Kansas City Chiefs. Simple, easily digestible and not too in your face. While tweeting out of the score or final graphic seems easy enough, most of us don’t know what’s going on behind the scenes. A lot of responses noted that none of us were actually in the press box or on the field making the decision in the moment. Yet another layer to the story (that I didn’t even think of), was that there could easily be a sponsor tied into all final score graphics. It would be easy enough to skip the graphic, but this is just another scenario to consider when looking at the decision to go silent. It’s definitely worth noting that while some leagues shorten up their posting schedule at the end of the season, many NFL teams continue their regular posting schedule. These accounts shift a little bit and become a little more news-y, but both the Texans and Minnesota Vikings accounts continued their normal post-game strategy after their respective playoff losses. The Bengals did end up posting the final story a couple of hours after the game, and continued posting today. It seems to me like they wanted to let the initial storm die down before they began posting again. How would you have handled the situation? Leave a comment, or shoot me a tweet (be sure to use the #smsports hashtag). Note: It’s always easy to critique when you aren’t actually in the press box or on the field making the decision in the moment. The Bengals team handled the loss the way they wanted to handle the loss. I was just attempting to gather some insights from industry professionals, and shed some light on the fact that sending a tweet is not always as black and white as some may think it is. ", "author": "Mac Slavin", "parent": ""}