{"name": "2189", "title": "Trump can’t stop tweeting about the election", "sentences": [{"cd71": "Trump can’t stop tweeting about the election"}, {"1d83": "Unlike Queen Elsa, he just can’t let it go."}, {"2e3e": "A protester in New York City holds a sign mocking President Trump’s Twitter habits, in February. CREDIT: Rainmaker Photo/MediaPunch/IPX"}, {"b283": "On November 8, 2016, Donald Trump received nearly 3 million fewer votes than Hillary Clinton, but won the majority of electoral votes and became president-elect. That was 146 days ago."}, {"ed60": "On January 20, 2017, Donald Trump was inaugurated and became the 45th President of the United States of America (the 44th person to hold the job, since Grover Cleveland’s non-consecutive terms are both counted). That was 73 days ago."}, {"4eb8": "Apparently no one has broken it to Donald Trump that the 2016 campaign is over. He frequently brings up last year’s election, often in response to totally unrelated questions."}, {"1f82": "A ThinkProgress review of his tweets since taking office found that he has brought up the 2016 election, the media coverage of that race, the Clinton campaign, and his surprising win at least 24 times in less than three months."}, {"6b10": "1."}, {"2b5d": "2."}, {"6680": "3."}, {"28a2": "4."}, {"5cf5": "5."}, {"0e5e": "6."}, {"bda6": "7."}, {"2bb3": "8."}, {"b689": "9."}, {"9c3f": "10."}, {"40cb": "11."}, {"08cf": "12."}, {"bc0f": "13."}, {"e319": "14."}, {"d05e": "15."}, {"f4e8": "16."}, {"a688": "17."}, {"48f7": "18."}, {"324a": "19."}, {"9725": "20."}, {"17a0": "21."}, {"211f": "22."}, {"32ce": "23."}, {"b1c1": "24."}], "child": "2189_1\t2189_2\t2189_3\t2189_4\t2189_5\t2189_6\t2189_7", "timestamp": "Apr 3", "content": "Trump can’t stop tweeting about the election Unlike Queen Elsa, he just can’t let it go. A protester in New York City holds a sign mocking President Trump’s Twitter habits, in February. CREDIT: Rainmaker Photo/MediaPunch/IPX On November 8, 2016, Donald Trump received nearly 3 million fewer votes than Hillary Clinton, but won the majority of electoral votes and became president-elect. That was 146 days ago. On January 20, 2017, Donald Trump was inaugurated and became the 45th President of the United States of America (the 44th person to hold the job, since Grover Cleveland’s non-consecutive terms are both counted). That was 73 days ago. Apparently no one has broken it to Donald Trump that the 2016 campaign is over. He frequently brings up last year’s election, often in response to totally unrelated questions. A ThinkProgress review of his tweets since taking office found that he has brought up the 2016 election, the media coverage of that race, the Clinton campaign, and his surprising win at least 24 times in less than three months. 1. 2. 3. 4. 5. 6. 7. 8. 9. 10. 11. 12. 13. 14. 15. 16. 17. 18. 19. 20. 21. 22. 23. 24. ", "author": "Josh Israel", "parent": ""}