{"name": "2191", "title": "What I wish I knew before joining Mastodon", "sentences": [{"a16f": "What I wish I knew before joining Mastodon"}, {"67c3": "Where I attempt to explain Mastodon through Harry Potter gifs"}, {"ee7d": "Mastodon’s been around for six months, but chances are, you’re just joining now because you’ve seen the articles about “anti-Twitter” in Verge, Vice, Mashable, Quartz or some other tech publication — not to mention the quality Twitter trolling from Mastodon the heavy metal band."}, {"2432": "Plus the fact that Mastodon’s flagship account, Mastodon.social (more on this later), has temporarily stopped adding new users as its 24-year-old German developer Eugen Rochko attempts some quality control makes this club feel more exclusive."}, {"04f4": "As of April 9, 2017, more than 130,000 Mastodon accounts have been made. More than 42,000 of those accounts are registered on Mastodon.social."}, {"c0ee": "But while Mastodon feels familiar as Twitter, it’s different enough that it initially feels like an episode of “Black Mirror.”"}, {"3fa8": "Here’s what I learned in the past 48 hours of joining Mastodon and what I wish I knew before joining:"}, {"73ef": "What are instances and which one should I join:"}, {"0566": "Since signing up for Mastodon.social is closed until future notice, you might have noticed a message that says “Choose one of the various public instances to sign up!”"}, {"2068": "Even though Mastodon.social has been limiting the amount of new users temporarily, you can still sign up for Mastodon by joining any instance."}, {"977b": "Instances are sort of like subreddits in that each are moderated by a dedicated team of volunteers and each may have their own specific rules, interests, themes or cultures. But unlike Reddit, each Mastodon instance is hosted on different servers by an independent team of administrators and developers who enforce the Mastodon instance’s rules."}, {"b5ba": "Here’s a good list of some of the available instances, whether registration is open and how to find them."}, {"f788": "tootsuite/mastodonmastodon - A GNU Social-compatible microblogging servergithub.com"}, {"ba0f": "But you can learn more about any Mastodon instance before joining by visiting the instances’ about me page."}, {"957c": "The instance that you join matters since this might determine who you initially meet."}, {"bee1": "If you’re looking for a site to suggest a randomized instance that’s accepting new users, try this:"}, {"45de": "tooter.today — Find a nice Mastodon instanceThis tool makes it easy to find a Mastodon instance if you’re not sure where to start.tooter.today"}, {"c44e": "Instances with more members might be more connected to other instances and you will see completely different local and federated timelines depending on which instance you join (more on this later)."}, {"04ee": "You can still contact and connect with people who’ve joined Mastodon from other instances, but like an email address, the instance you join follows you around."}, {"3274": "For example, if you want to message me on Mastodon, you have to type @qinaliu@mastodon.social in a toot (more on this later)."}, {"a63d": "Since each user is tied to an instance, people can also steal your username and identity on another instance (it’s sort of like how email addresses at @gmail.com and @yahoo.com and @aol.com are all different). And since you can join and log into as many Mastodon instances as you’d like, you can technically be in multiple places at the same time."}, {"bcf7": "How Mastodon compares to Twitter:"}, {"e304": "Mastodon, while prehistoric in some regards (the timeline is thankfully still chronological and you “Favourite” rather than “Like” posts here), feels intuitive since it resembles Twitter so much."}, {"1c67": "The interface looks like TweetDeck — except the columns aren’t customizable, you can’t schedule posts, you can’t build lists, trends are harder to track or search, and well, Mastodon isn’t Twitter."}, {"11f1": "On Mastodon:"}, {"86d9": "But those are some of the more obvious differences. Mastodon.social is built as a “Twitter user’s utopia”: one where advertising, racism and hate speech is strictly prohibited and equality is key."}, {"4e71": "To limit potential harassment, Mastodon is only searchable by hashtags (this might change in the future) and you can’t “quote-toot.” Mastodon also features customizable privacy filters for each toot."}, {"3f9c": "Additionally, Rochko also introduced a content warning filter…"}, {"0f6d": "…which users have used to hide punchlines to jokes:"}, {"a9e2": "Another major difference is how toots are received. Since the number of replies, boosts and favourites on a toot are hidden until you click on a toot, it’s not as important for a toot to get boosted or favourited. Since timelines are in chronological order rather than the algorithmic one Twitter, Facebook and Instagram have adopted, every toot also has an equal shot of being seen."}, {"eccc": "The point of all this isn’t to collect likes or follows, but perhaps so people might actually have conversations."}, {"695a": "But if a part of you gets joy from building a following, know that your follower count looks different depending on which instance someone’s on."}, {"d29b": "Unlike Twitter, Mastodon also doesn’t suggest people you should follow anymore (although that was a feature when the social network first launched). You find people by seeing what they’re tooting."}, {"c4e4": "And you click on toots to see threads of conversations."}, {"2e9e": "The difference between a local timeline and a federated timeline"}, {"71c8": "Mastodon gives you the option to toggle between your local and federated timelines."}, {"7956": "Toots from your instance appear in chronological order in your local timeline while toots from accounts people in your instance follow might appear in the federated timeline."}, {"04f1": "Getting people to show up in your federated timelines takes a bit of exploration and world building. As accounts in your instance follow more people from other instances, the more accounts can potentially show up in your instance’s federated timeline. There’s a bunch of Followbots that seemed to have been created for the purpose of globalization and connecting people across instances."}, {"fb39": "This means that depending on what instance you’re on, your local and federated timelines could look completely different as someone else’s on another Mastodon instance."}, {"cfdb": "But if you still don’t get it, here’s another explanation of local and federated timelines:"}, {"3592": "Who should I follow on Mastodon?"}, {"7a3c": "While the local and federated timelines can help you find accounts that might be interesting to follow, Mastodon isn’t as fun until you follow some accounts. Like Twitter, you can curate your “Home” timeline, but unlike Twitter, it’s harder to search for people to follow unless you know their Mastodon handle."}, {"5fa4": "I’m at @qinaliu@mastodon.social if you want to give me a follow, but here’s a list of other journalists and influencers:"}, {"9fdb": "Someone also started a public Google Doc database for artists, musicians and filmmakers on Mastodon:"}, {"10ca": "Mastodon Creatives / Artists / Musicians / Illustrators / Animators / FilmmakersSheet1 Handle, Interests, Notes/ URLs/ etc., Birdsite/ other handle @ pseudomichael@ mastodon. network, motion graphics…docs.google.com"}, {"5db2": "How to get “verified” on Mastodon"}, {"bd11": "Let’s be honest: you just want to get one of those check marks ✅ next to your name."}, {"6b72": "It’s super easy to do on Mastodon and it’s not just limited to celebrities, journalists and other influencers like on Twitter. All you really have to do is insert a check emoji next to your display name."}, {"ee83": "Mastodon users use the ✅ to poke fun at the complicated verification process on Twitter."}, {"045d": "In addition to fake Twitter accounts on Mastodon, there’s a bunch of Mastodon accounts that poke fun of the Twitter verification process:"}, {"7342": "I’ve even seen some users upload the Twitter egg as their avatars."}, {"1f2b": "What do people talk about on Mastodon?"}, {"d9e5": "It’s like Fight Club in that the first rule of Fight Club is that you don’t talk about Fight Club outside of Fight Club."}, {"aaa4": "Since cross-posting from Mastodon to Twitter doesn’t work and posting about Mastodon on Twitter might be frowned upon, what do Mastodon users talk about on Mastodon?"}, {"4034": "Mastodon, of course! #Mastodon is consistently the №1 hashtag people used, according to a Trendbot that tracks trending hashtags."}, {"74fd": "Cats are also popular. (This is the Internet, after all.)"}, {"03b2": "But if you’re new, searching the hashtag #introduction or #introductions is a good place to search and toot to find other people with similar interests who might be worth following."}, {"e4bb": "So should I use hashtags on Mastodon?"}, {"0ab2": "It depends. Words in toots aren’t searchable yet, but hashtags are. Using hashtags with words helps your toots become more searchable and it might help you connect with someone with common interests. But if you don’t want potential trolls to find something by keyword, don’t use a hashtag."}, {"b0b8": "Is there an app for that?"}, {"f317": "Of course! There’s an app for everything. I haven’t tried them all, but here’s a good list of apps for iOS, Android and Chrome:"}, {"97e6": "tootsuite/mastodonmastodon - A GNU Social-compatible microblogging servergithub.com"}, {"42ee": "Tusky for Android and Amaroq on iOS seem to be the most popular ones recommended."}, {"eea6": "Why am I seeing pineapples all over Mastodon?"}, {"528f": "Alright, so I’m no P.J. Vogt, Alex Goldman or any of the other awesome producers at the podcast “Reply All,” but I’m going to attempt to “Yes, Yes, No” this for you guys."}, {"ae7d": "🍍🍍🍍 on Mastodon got started by Alex Weiner (@acw@mastodon.social), a software developer who uses APL. Since APL sounds like 🍎, he really likes 🍎 and any words including 🍎 like 🎄🍎."}, {"2b6f": "So he started tooting 🍍 to new people as a form of “hello,” “welcome,” “aloha” — and you get the idea."}, {"c794": "And he also started boosting toots with 🍍."}, {"bfa3": "So 🍍 became the emoji shorthand for boost."}, {"5e65": "And 🍍ing also became Internet slang for when your Mastodon follower count surpasses your Twitter follower count."}, {"cecc": "But pineapple appreciation didn’t end there. Other people started posting 🍍 in their display name."}, {"3689": "And even Rochko made a pineapple joke."}, {"e827": "So to recap, if you get a 🍍 on Mastodon, it’s…"}, {"1678": "Plus, pineapples are awesome."}, {"960d": "Except if you’re the president of Iceland, who doesn’t like 🍍🍕."}, {"dbba": "So was that a “Yes, Yes, Yes”?"}], "child": "2191_1\t2191_2\t2191_3\t2191_4\t2191_5\t2191_6\t2191_7\t2191_8\t2191_9", "timestamp": "Apr 9", "content": "What I wish I knew before joining Mastodon Where I attempt to explain Mastodon through Harry Potter gifs Mastodon’s been around for six months, but chances are, you’re just joining now because you’ve seen the articles about “anti-Twitter” in Verge, Vice, Mashable, Quartz or some other tech publication — not to mention the quality Twitter trolling from Mastodon the heavy metal band. Plus the fact that Mastodon’s flagship account, Mastodon.social (more on this later), has temporarily stopped adding new users as its 24-year-old German developer Eugen Rochko attempts some quality control makes this club feel more exclusive. As of April 9, 2017, more than 130,000 Mastodon accounts have been made. More than 42,000 of those accounts are registered on Mastodon.social. But while Mastodon feels familiar as Twitter, it’s different enough that it initially feels like an episode of “Black Mirror.” Here’s what I learned in the past 48 hours of joining Mastodon and what I wish I knew before joining: What are instances and which one should I join: Since signing up for Mastodon.social is closed until future notice, you might have noticed a message that says “Choose one of the various public instances to sign up!” Even though Mastodon.social has been limiting the amount of new users temporarily, you can still sign up for Mastodon by joining any instance. Instances are sort of like subreddits in that each are moderated by a dedicated team of volunteers and each may have their own specific rules, interests, themes or cultures. But unlike Reddit, each Mastodon instance is hosted on different servers by an independent team of administrators and developers who enforce the Mastodon instance’s rules. Here’s a good list of some of the available instances, whether registration is open and how to find them. tootsuite/mastodonmastodon - A GNU Social-compatible microblogging servergithub.com But you can learn more about any Mastodon instance before joining by visiting the instances’ about me page. The instance that you join matters since this might determine who you initially meet. If you’re looking for a site to suggest a randomized instance that’s accepting new users, try this: tooter.today — Find a nice Mastodon instanceThis tool makes it easy to find a Mastodon instance if you’re not sure where to start.tooter.today Instances with more members might be more connected to other instances and you will see completely different local and federated timelines depending on which instance you join (more on this later). You can still contact and connect with people who’ve joined Mastodon from other instances, but like an email address, the instance you join follows you around. For example, if you want to message me on Mastodon, you have to type @qinaliu@mastodon.social in a toot (more on this later). Since each user is tied to an instance, people can also steal your username and identity on another instance (it’s sort of like how email addresses at @gmail.com and @yahoo.com and @aol.com are all different). And since you can join and log into as many Mastodon instances as you’d like, you can technically be in multiple places at the same time. How Mastodon compares to Twitter: Mastodon, while prehistoric in some regards (the timeline is thankfully still chronological and you “Favourite” rather than “Like” posts here), feels intuitive since it resembles Twitter so much. The interface looks like TweetDeck — except the columns aren’t customizable, you can’t schedule posts, you can’t build lists, trends are harder to track or search, and well, Mastodon isn’t Twitter. On Mastodon: But those are some of the more obvious differences. Mastodon.social is built as a “Twitter user’s utopia”: one where advertising, racism and hate speech is strictly prohibited and equality is key. To limit potential harassment, Mastodon is only searchable by hashtags (this might change in the future) and you can’t “quote-toot.” Mastodon also features customizable privacy filters for each toot. Additionally, Rochko also introduced a content warning filter… …which users have used to hide punchlines to jokes: Another major difference is how toots are received. Since the number of replies, boosts and favourites on a toot are hidden until you click on a toot, it’s not as important for a toot to get boosted or favourited. Since timelines are in chronological order rather than the algorithmic one Twitter, Facebook and Instagram have adopted, every toot also has an equal shot of being seen. The point of all this isn’t to collect likes or follows, but perhaps so people might actually have conversations. But if a part of you gets joy from building a following, know that your follower count looks different depending on which instance someone’s on. Unlike Twitter, Mastodon also doesn’t suggest people you should follow anymore (although that was a feature when the social network first launched). You find people by seeing what they’re tooting. And you click on toots to see threads of conversations. The difference between a local timeline and a federated timeline Mastodon gives you the option to toggle between your local and federated timelines. Toots from your instance appear in chronological order in your local timeline while toots from accounts people in your instance follow might appear in the federated timeline. Getting people to show up in your federated timelines takes a bit of exploration and world building. As accounts in your instance follow more people from other instances, the more accounts can potentially show up in your instance’s federated timeline. There’s a bunch of Followbots that seemed to have been created for the purpose of globalization and connecting people across instances. This means that depending on what instance you’re on, your local and federated timelines could look completely different as someone else’s on another Mastodon instance. But if you still don’t get it, here’s another explanation of local and federated timelines: Who should I follow on Mastodon? While the local and federated timelines can help you find accounts that might be interesting to follow, Mastodon isn’t as fun until you follow some accounts. Like Twitter, you can curate your “Home” timeline, but unlike Twitter, it’s harder to search for people to follow unless you know their Mastodon handle. I’m at @qinaliu@mastodon.social if you want to give me a follow, but here’s a list of other journalists and influencers: Someone also started a public Google Doc database for artists, musicians and filmmakers on Mastodon: Mastodon Creatives / Artists / Musicians / Illustrators / Animators / FilmmakersSheet1 Handle, Interests, Notes/ URLs/ etc., Birdsite/ other handle @ pseudomichael@ mastodon. network, motion graphics…docs.google.com How to get “verified” on Mastodon Let’s be honest: you just want to get one of those check marks ✅ next to your name. It’s super easy to do on Mastodon and it’s not just limited to celebrities, journalists and other influencers like on Twitter. All you really have to do is insert a check emoji next to your display name. Mastodon users use the ✅ to poke fun at the complicated verification process on Twitter. In addition to fake Twitter accounts on Mastodon, there’s a bunch of Mastodon accounts that poke fun of the Twitter verification process: I’ve even seen some users upload the Twitter egg as their avatars. What do people talk about on Mastodon? It’s like Fight Club in that the first rule of Fight Club is that you don’t talk about Fight Club outside of Fight Club. Since cross-posting from Mastodon to Twitter doesn’t work and posting about Mastodon on Twitter might be frowned upon, what do Mastodon users talk about on Mastodon? Mastodon, of course! #Mastodon is consistently the №1 hashtag people used, according to a Trendbot that tracks trending hashtags. Cats are also popular. (This is the Internet, after all.) But if you’re new, searching the hashtag #introduction or #introductions is a good place to search and toot to find other people with similar interests who might be worth following. So should I use hashtags on Mastodon? It depends. Words in toots aren’t searchable yet, but hashtags are. Using hashtags with words helps your toots become more searchable and it might help you connect with someone with common interests. But if you don’t want potential trolls to find something by keyword, don’t use a hashtag. Is there an app for that? Of course! There’s an app for everything. I haven’t tried them all, but here’s a good list of apps for iOS, Android and Chrome: tootsuite/mastodonmastodon - A GNU Social-compatible microblogging servergithub.com Tusky for Android and Amaroq on iOS seem to be the most popular ones recommended. Why am I seeing pineapples all over Mastodon? Alright, so I’m no P.J. Vogt, Alex Goldman or any of the other awesome producers at the podcast “Reply All,” but I’m going to attempt to “Yes, Yes, No” this for you guys. 🍍🍍🍍 on Mastodon got started by Alex Weiner (@acw@mastodon.social), a software developer who uses APL. Since APL sounds like 🍎, he really likes 🍎 and any words including 🍎 like 🎄🍎. So he started tooting 🍍 to new people as a form of “hello,” “welcome,” “aloha” — and you get the idea. And he also started boosting toots with 🍍. So 🍍 became the emoji shorthand for boost. And 🍍ing also became Internet slang for when your Mastodon follower count surpasses your Twitter follower count. But pineapple appreciation didn’t end there. Other people started posting 🍍 in their display name. And even Rochko made a pineapple joke. So to recap, if you get a 🍍 on Mastodon, it’s… Plus, pineapples are awesome. Except if you’re the president of Iceland, who doesn’t like 🍍🍕. So was that a “Yes, Yes, Yes”? ", "author": "Qina Liu", "parent": ""}