{"name": "2198", "title": "Introducing Live 360 Video", "sentences": [{"5daf": "Introducing Live 360 Video"}, {"070e": "Hey Periscope Community,"}, {"5992": "We’ve always said that joining a broadcast is like stepping into someone else’s shoes and seeing the world through their eyes. Today, we’re introducing a more immersive way to experience those moments — with live 360 video."}, {"bbb3": "With 360 video on Periscope, you can experience moments with the broadcaster and take a look around — it’s one step closer to actually being there. Starting today, you’ll be able to join live 360 videos on Periscope and Twitter from some incredible broadcasters — getting front-row access at exclusive events, traveling to places across the globe, and getting up close with well-known personalities."}, {"5037": "Live 360 video isn’t just about taking you to places you’ve never been; it’s about connecting you with people and letting you experience something new with them. With these videos, the broadcaster anchors the experience so you can be present with them from whatever environment they’re sharing from. When they smile, you’ll smile, and when they laugh, maybe you’ll laugh too."}, {"0ca9": "360 broadcast badge on Periscope"}, {"63ec": "Live 360 videos are marked with a badge. When you see a 360 broadcast on Periscope or Twitter, you can change the point of view by moving your phone or tapping and scrolling around the screen — all while watching live."}, {"6758": "We’re testing 360 broadcasts with a small group of partners, and will be rolling out this feature more broadly during the coming weeks. You can apply to join the waitlist here."}, {"7ff3": "Much love,"}, {"280f": "Team Periscope"}], "child": "2198_1\t2198_2\t2198_3\t2198_4\t2198_5\t2198_6\t2198_7\t2198_8\t2198_9\t2198_10\t2198_11\t2198_12\t2198_13\t2198_14\t2198_15\t2198_16", "timestamp": "Dec 28, 2016", "content": "Introducing Live 360 Video Hey Periscope Community, We’ve always said that joining a broadcast is like stepping into someone else’s shoes and seeing the world through their eyes. Today, we’re introducing a more immersive way to experience those moments — with live 360 video. With 360 video on Periscope, you can experience moments with the broadcaster and take a look around — it’s one step closer to actually being there. Starting today, you’ll be able to join live 360 videos on Periscope and Twitter from some incredible broadcasters — getting front-row access at exclusive events, traveling to places across the globe, and getting up close with well-known personalities. Live 360 video isn’t just about taking you to places you’ve never been; it’s about connecting you with people and letting you experience something new with them. With these videos, the broadcaster anchors the experience so you can be present with them from whatever environment they’re sharing from. When they smile, you’ll smile, and when they laugh, maybe you’ll laugh too. 360 broadcast badge on Periscope Live 360 videos are marked with a badge. When you see a 360 broadcast on Periscope or Twitter, you can change the point of view by moving your phone or tapping and scrolling around the screen — all while watching live. We’re testing 360 broadcasts with a small group of partners, and will be rolling out this feature more broadly during the coming weeks. You can apply to join the waitlist here. Much love, Team Periscope ", "author": "Periscope", "parent": ""}