{"name": "2199", "title": "Share the Periscope love — now on iMessage and iPad", "sentences": [{"be2e": "Share the Periscope love — now on iMessage and iPad"}, {"c306": "Dear Periscope Community,"}, {"2fa9": "Using Periscope on iOS and iPad just got a lot more exciting with the release of iOS 10. Today, we’re announcing a number of new features for people using Periscope on iOS devices, with some fun, new ways to express yourself and discover broadcasts on Periscope — and elsewhere! Ever wanted to share the Periscope love to people outside of a live broadcast? Us too! You can now send our signature Periscope hearts on iMessage with custom-designed stickers created for iOS 10. The pink, blue and teal hearts you’ve come to love on Periscope are all available, along with some of our favorite custom hearts."}, {"27ca": "Periscope iMessage Stickers"}, {"5a34": "Additionally, Periscope now has universal support for iPad, putting a bigger, more beautiful watch and discovery experience in your hands. The iPad app is available to download in the App Store today."}, {"a06a": "Live videos are continually created and shared on Periscope, so we’ve created an easier way to discover and watch broadcasts related to the same topic. The global feed will now highlight broadcasts that feature similar experiences, events or ideas. Also available today is autoplaying, larger live video in the home and global feeds — it’s a more beautiful, easy way to watch what’s live."}, {"3cd0": "Finally, you can now see when people you follow join your broadcast. As your connections join you live, their avatars will hang out at the bottom of the screen with you."}, {"c178": "Check out all of these updates and download the latest version of Periscope for iOS in the App Store here."}, {"db43": "Much love, Team Periscope"}, {"4cda": "P.S. For more, here’s our broadcast on the release:"}], "child": "2199_1\t2199_2\t2199_3\t2199_4\t2199_5\t2199_6", "timestamp": "Sep 13, 2016", "content": "Share the Periscope love — now on iMessage and iPad Dear Periscope Community, Using Periscope on iOS and iPad just got a lot more exciting with the release of iOS 10. Today, we’re announcing a number of new features for people using Periscope on iOS devices, with some fun, new ways to express yourself and discover broadcasts on Periscope — and elsewhere! Ever wanted to share the Periscope love to people outside of a live broadcast? Us too! You can now send our signature Periscope hearts on iMessage with custom-designed stickers created for iOS 10. The pink, blue and teal hearts you’ve come to love on Periscope are all available, along with some of our favorite custom hearts. Periscope iMessage Stickers Additionally, Periscope now has universal support for iPad, putting a bigger, more beautiful watch and discovery experience in your hands. The iPad app is available to download in the App Store today. Live videos are continually created and shared on Periscope, so we’ve created an easier way to discover and watch broadcasts related to the same topic. The global feed will now highlight broadcasts that feature similar experiences, events or ideas. Also available today is autoplaying, larger live video in the home and global feeds — it’s a more beautiful, easy way to watch what’s live. Finally, you can now see when people you follow join your broadcast. As your connections join you live, their avatars will hang out at the bottom of the screen with you. Check out all of these updates and download the latest version of Periscope for iOS in the App Store here. Much love, Team Periscope P.S. For more, here’s our broadcast on the release: ", "author": "Periscope", "parent": ""}