{"name": "2220", "title": "Owed to the IRS", "sentences": [{"3788": "Owed to the IRS"}, {"301a": "O Tax Man with your green eye shade,It’s you we love to hate.Your pencil sharp is like a blade,Your forms, a paper weight"}, {"7772": "Which bears down heavy on our coin.We wring our hands and groan.In fellowship we gird our loins,For we are not alone."}, {"5f2b": "On April’s Ides, deep in the night,We toil at our mathAnd hope our numbers add up rightLest we incur your wrath."}, {"a5d3": "Shoe boxes chocked with paper slips,Small coffins of our year,The contents, stapled, paper clipped,Are disinterred in fear"}, {"7708": "Of what the autopsy will show.Our deductions, revealed,May help us dodge a mighty blowOr leave us no appeal"}, {"9ff4": "To mercy ‘neath your prying sight.Then we must write a check.The scramble to avoid a kiteLeaves us a nervous wreck."}, {"3b82": "Off to the P.O. we must goAnd stand in spooling lineOf citizens disgorging doughLest they incur a fine."}, {"256c": "We heave a great collective sigh,We grab ourselves a beerAnd thank the Lord this exerciseTakes place but once a year."}, {"51d6": "For Jim Bowers and Jesse Casas, with deep appreciation."}], "child": "2220_1\t2220_2\t2220_3\t2220_42220_1\t2220_2\t2220_3\t2220_4", "timestamp": "Apr 15", "content": "Owed to the IRS O Tax Man with your green eye shade,It’s you we love to hate.Your pencil sharp is like a blade,Your forms, a paper weight Which bears down heavy on our coin.We wring our hands and groan.In fellowship we gird our loins,For we are not alone. On April’s Ides, deep in the night,We toil at our mathAnd hope our numbers add up rightLest we incur your wrath. Shoe boxes chocked with paper slips,Small coffins of our year,The contents, stapled, paper clipped,Are disinterred in fear Of what the autopsy will show.Our deductions, revealed,May help us dodge a mighty blowOr leave us no appeal To mercy ‘neath your prying sight.Then we must write a check.The scramble to avoid a kiteLeaves us a nervous wreck. Off to the P.O. we must goAnd stand in spooling lineOf citizens disgorging doughLest they incur a fine. We heave a great collective sigh,We grab ourselves a beerAnd thank the Lord this exerciseTakes place but once a year. For Jim Bowers and Jesse Casas, with deep appreciation. ", "author": "Meg", "parent": ""}