{"name": "2221", "title": "How to create a corporate culture that isn’t just bullsh*t — Part One: Hiring", "sentences": [{"0d36": "How to create a corporate culture that isn’t just bullsh*t — Part One: Hiring"}, {"9dac": "It is easy to write about the many failings of start-up culture. What is harder is to provide actual solutions for improving a workplace environment not just for women but for all employees."}, {"70b5": "Image credit: #WOCinTech"}, {"c69c": "“Culture is not great when it is an undefined set of attributes used to determine whether or not someone is a “fit” for an organization. Or if it’s used in the same sentence as “snacks” and “ping pong” tables."}, {"47ed": "This was the #1 highlighted passage in my article, 5 red flags every woman should look for when considering a job at start-up. It started a lot of conversation and being the solutions-oriented gal I am, I wanted to provide some actual things companies can do to create a culture that promotes a healthy and profitable work environment."}, {"5006": "In a three part series, I will breakdown how a company can create a culture that attracts and retains top talent covering:"}, {"bb09": "Hiring — Because a diverse workforce is also a stronger more creative workforce."}, {"1166": "Meetings and Communications — The every day manifestations of a company’s culture."}, {"d929": "Growth — Because retaining employees is just as important as attracting them."}, {"1077": "Let’s begin by defining culture, so that there is shared understanding. I’ve grabbed the definition from Project Include, an open community working toward providing meaningful diversity and inclusion solutions for tech companies,"}, {"dac1": "The culture of a company determines who joins, who succeeds, how people behave, how teams run, and how the company performs."}, {"037c": "Let’s kick off this three part culture party with who joins."}, {"d2e9": "The recruitment phase is the first taste a potential hire gets when meeting your company. I’m going to cover three topics: Job Descriptions, Hiring without bias, and Salary and Transparency."}, {"5783": "Job descriptions — Words matter"}, {"be20": "Maria Klawe and Harvey Mudd University accomplished an incredible feat in 2016. With the national average for computer science degrees conferred to women at 18% (down from its peak of 37% in the 1980s), Klawe and Harvey Mudd were able to raise the rate at their university to 55%. More than half of the students graduating with a degree in Computer Science from Harvey Mudd in 2016 were women."}, {"ded7": "How did she do it? One of the things she did was make the introductory course less intimidating. A course previously called “Introduction to programming in Java” was rebranded “Creative approaches to problem solving in science and engineering using Python.” By taking away language that reinforced stereotypes about computer science she was able to get more women to at least try their hand at programming. Read: Women who choose Computer Science, Google."}, {"1455": "The lesson here is that words are important. Let’s take a look at some job descriptions from one of the most stereotypically aggro positions in the tech industry — the infamous, “Growth Hacker.”"}, {"03a9": "We need a badass growth hacker to increase our pre-sales"}, {"edc0": "To be transparent with you, you need to be a challenger. You’ll get equity upon salary because we believe that until the product is on the market, sales will kick some ass!"}, {"d019": "Walking into work every day like…"}, {"a9bb": "“Just wear something” dress code"}, {"59f7": "You sure about that?"}, {"477d": "We are looking for a combination Growth Hacker/ Marketing-Intern, get-your-hands-dirty, and get-stuff-done type of person to be manager."}, {"6787": "Intern Manager? What does that even mean?"}, {"fe0a": "The right person looks like this:You are a rock star or have a passion for content and social media marketing"}, {"9f5f": "Stop it."}, {"8f4a": "Can we all agree to stop using the word Rock Star? To begin with, it’s term pretty much reserved for men with substance abuse problems and also unless you’re Bowie or Prince (God rest them) or equivalent you shouldn’t be calling yourself as such. I’d also like to request a moratorium on Ninjas as well. Just stop."}, {"7118": "PerksTop of the line Apple hardware! (If you don’t already have your own)"}, {"ecde": "Oh you don’t have the newest most expensive tech? AWKWARD."}, {"e210": "Here is what I get from these job descriptions. These are hyper-aggressive growth environments. I’ll be working alongside people younger than me, most likely brogrammers. They will want me to work super long hours without fair compensation."}, {"b6f4": "Now, my judgments of these companies based on their descriptions may not be true, but this is my interpretation based on their word choice and the tone of what they wrote."}, {"c429": "Here is an example of similar language written differently:"}, {"e9b0": "- Focus on solving big problems, and have an equal willingness to roll up sleeves for the smallest tasks.- Passion for our mission and commitment to be a part of our innovation and growth."}, {"f1d9": "BENEFITS- Many opportunities to grow within the company and shape our growth strategy.- A workplace that emphasizes well-being, substantial paid time off and offers a range of wellness benefits."}, {"b77e": "Here is what I get from this job description. This is a mission-driven company who wants you to care about what they do. I’ll be working on big, important projects but they are seeking people who don’t think they’re too big for small tasks. They prioritize my growth within the organization alongside the growth of the company, while emphasizing healthy work-life balance."}, {"44b1": "Even the blandest job descriptions communicate the good and bad of what your company values. Don’t weed out potential candidates with language that intimidates or signals things about your company that aren’t necessarily true."}, {"b2e1": "Hiring without Bias — We all have it"}, {"3762": "You have to be living under a rock on Mars if you haven’t read any of the work published on the unconscious bias in hiring, with studies showing that white candidates receive 50% more callbacks for interviews than black candidates with the exact same resume. Another study from Columbia business school showed bias in STEM careers, where hiring managers were more likely to hire male over female candidates,"}, {"fcb1": "In an experiment in which participants were hired to perform a mathematical task, both male and female managers were twice as likely to hire a man than a woman — even when the managers had no information beyond a candidate’s appearance and, therefore, gender."}, {"acf1": "Because boys are better at math, a gender stereotype so deeply ingrained that even 2nd grade girls have internalized it smh."}, {"e179": "So if we can agree that bias exists, let’s agree to some things we can do to prevent it."}, {"438b": "Resume cleaning and scoringThere are several organizations that exist to help with this, like Blendoor’s merit-based matching system, but you can also attempt to do it yourself. Remove the name of the candidate and name of their university and any other racial, gender, or socio-economic markers on the resume. For each position for which you are hiring, create a scorecard for what you are looking for within their background and experience. Do the same for the actual interview process as implicit bias can lead us to rationalize why we like one candidate over the other. Read: Seven steps to reduce bias in hiring."}, {"0ab2": "AssignmentsAssignments for positions in tech are commonplace and a good way to measure a candidate’s qualifications. While you shouldn’t be giving candidates burdensome assignments that take hours of their time and brainpower (a topic for another day), if you are going to give them an assignment the grading and evaluation should be done without their name. Have a third party number each assignment so that you can judge them based on their quality alone."}, {"c2a0": "Salary and Transparency — Transparency breeds trust"}, {"67e9": "Let’s start with this: Do.not.ask.for.previous.salary."}, {"efdd": "You already have a salary range budgeted for this position. Asking someone for their previous salary is you trying to get them for as cheap as possible. The State of Massachusetts, New York City and Philadelphia (Cali where you at?) have already made this a no-no, can we just agree that it’s a bad idea? Not only does it perpetuate inequity it opens you up to people over-inflating their salaries (lying) to get as much out of you as possible. Pro tip for interviewees: Don’t do that."}, {"2f9e": "“To compete for talent, your organization must also know what the market is paying for certain skills and develop fair and reasonable salary ranges for the positions in your company. This combination of compensation benchmarking followed by setting or updating salary ranges helps you attract and retain top talent.” — Pay Scale, “How to perform compensation benchmarking and set salary ranges.”"}, {"0587": "Early in the interview process state the salary range, the factors you are considering that would contribute to the low, medium and high of that range, and the benefits and equity that would be involved as well during the hiring process. Don’t offer a salary outside the range you’ve pre-determined. If the offer is market-rate competitive and you’ve considered their experience then the offer is sound."}, {"6382": "This does a few things:"}, {"4590": "At the end of the day there is simply too much easily-accessible data to escape candidates and employees finding out that they are underpaid in their industry or compared to their peers. Transparency breeds trust. Salary negotiation is the first time that you are communicating to future new employee how you value them. If you manage the exchange honestly and with transparency you are instilling in that individual an understanding that they will be treated honestly and with transparency as an employee. Read: Treated with respect. Employees who feel valued and respected are probably more likely to stick around."}, {"f310": "Hiring is an expensive and time-consuming pursuit. As a marketer who focuses on growth and retention it’s simple: I’m not investing my advertising dollars to acquire users who are going to churn (because I’d be bad at my job and my boss would fire me). Fix your leaky bucket, because the cost of losing an employee can be up to 2X of that employee’s annual salary."}, {"fe6a": "Stay tuned for the next installment where we cover meetings and communication. Want more articles like this? Visit www.women.work."}], "child": "2221_1\t2221_2\t2221_32221_1\t2221_2\t2221_32221_1\t2221_2\t2221_32221_1\t2221_2\t2221_3", "timestamp": "Apr 13", "content": "How to create a corporate culture that isn’t just bullsh*t — Part One: Hiring It is easy to write about the many failings of start-up culture. What is harder is to provide actual solutions for improving a workplace environment not just for women but for all employees. Image credit: #WOCinTech “Culture is not great when it is an undefined set of attributes used to determine whether or not someone is a “fit” for an organization. Or if it’s used in the same sentence as “snacks” and “ping pong” tables. This was the #1 highlighted passage in my article, 5 red flags every woman should look for when considering a job at start-up. It started a lot of conversation and being the solutions-oriented gal I am, I wanted to provide some actual things companies can do to create a culture that promotes a healthy and profitable work environment. In a three part series, I will breakdown how a company can create a culture that attracts and retains top talent covering: Hiring — Because a diverse workforce is also a stronger more creative workforce. Meetings and Communications — The every day manifestations of a company’s culture. Growth — Because retaining employees is just as important as attracting them. Let’s begin by defining culture, so that there is shared understanding. I’ve grabbed the definition from Project Include, an open community working toward providing meaningful diversity and inclusion solutions for tech companies, The culture of a company determines who joins, who succeeds, how people behave, how teams run, and how the company performs. Let’s kick off this three part culture party with who joins. The recruitment phase is the first taste a potential hire gets when meeting your company. I’m going to cover three topics: Job Descriptions, Hiring without bias, and Salary and Transparency. Job descriptions — Words matter Maria Klawe and Harvey Mudd University accomplished an incredible feat in 2016. With the national average for computer science degrees conferred to women at 18% (down from its peak of 37% in the 1980s), Klawe and Harvey Mudd were able to raise the rate at their university to 55%. More than half of the students graduating with a degree in Computer Science from Harvey Mudd in 2016 were women. How did she do it? One of the things she did was make the introductory course less intimidating. A course previously called “Introduction to programming in Java” was rebranded “Creative approaches to problem solving in science and engineering using Python.” By taking away language that reinforced stereotypes about computer science she was able to get more women to at least try their hand at programming. Read: Women who choose Computer Science, Google. The lesson here is that words are important. Let’s take a look at some job descriptions from one of the most stereotypically aggro positions in the tech industry — the infamous, “Growth Hacker.” We need a badass growth hacker to increase our pre-sales To be transparent with you, you need to be a challenger. You’ll get equity upon salary because we believe that until the product is on the market, sales will kick some ass! Walking into work every day like… “Just wear something” dress code You sure about that? We are looking for a combination Growth Hacker/ Marketing-Intern, get-your-hands-dirty, and get-stuff-done type of person to be manager. Intern Manager? What does that even mean? The right person looks like this:You are a rock star or have a passion for content and social media marketing Stop it. Can we all agree to stop using the word Rock Star? To begin with, it’s term pretty much reserved for men with substance abuse problems and also unless you’re Bowie or Prince (God rest them) or equivalent you shouldn’t be calling yourself as such. I’d also like to request a moratorium on Ninjas as well. Just stop. PerksTop of the line Apple hardware! (If you don’t already have your own) Oh you don’t have the newest most expensive tech? AWKWARD. Here is what I get from these job descriptions. These are hyper-aggressive growth environments. I’ll be working alongside people younger than me, most likely brogrammers. They will want me to work super long hours without fair compensation. Now, my judgments of these companies based on their descriptions may not be true, but this is my interpretation based on their word choice and the tone of what they wrote. Here is an example of similar language written differently: - Focus on solving big problems, and have an equal willingness to roll up sleeves for the smallest tasks.- Passion for our mission and commitment to be a part of our innovation and growth. BENEFITS- Many opportunities to grow within the company and shape our growth strategy.- A workplace that emphasizes well-being, substantial paid time off and offers a range of wellness benefits. Here is what I get from this job description. This is a mission-driven company who wants you to care about what they do. I’ll be working on big, important projects but they are seeking people who don’t think they’re too big for small tasks. They prioritize my growth within the organization alongside the growth of the company, while emphasizing healthy work-life balance. Even the blandest job descriptions communicate the good and bad of what your company values. Don’t weed out potential candidates with language that intimidates or signals things about your company that aren’t necessarily true. Hiring without Bias — We all have it You have to be living under a rock on Mars if you haven’t read any of the work published on the unconscious bias in hiring, with studies showing that white candidates receive 50% more callbacks for interviews than black candidates with the exact same resume. Another study from Columbia business school showed bias in STEM careers, where hiring managers were more likely to hire male over female candidates, In an experiment in which participants were hired to perform a mathematical task, both male and female managers were twice as likely to hire a man than a woman — even when the managers had no information beyond a candidate’s appearance and, therefore, gender. Because boys are better at math, a gender stereotype so deeply ingrained that even 2nd grade girls have internalized it smh. So if we can agree that bias exists, let’s agree to some things we can do to prevent it. Resume cleaning and scoringThere are several organizations that exist to help with this, like Blendoor’s merit-based matching system, but you can also attempt to do it yourself. Remove the name of the candidate and name of their university and any other racial, gender, or socio-economic markers on the resume. For each position for which you are hiring, create a scorecard for what you are looking for within their background and experience. Do the same for the actual interview process as implicit bias can lead us to rationalize why we like one candidate over the other. Read: Seven steps to reduce bias in hiring. AssignmentsAssignments for positions in tech are commonplace and a good way to measure a candidate’s qualifications. While you shouldn’t be giving candidates burdensome assignments that take hours of their time and brainpower (a topic for another day), if you are going to give them an assignment the grading and evaluation should be done without their name. Have a third party number each assignment so that you can judge them based on their quality alone. Salary and Transparency — Transparency breeds trust Let’s start with this: Do.not.ask.for.previous.salary. You already have a salary range budgeted for this position. Asking someone for their previous salary is you trying to get them for as cheap as possible. The State of Massachusetts, New York City and Philadelphia (Cali where you at?) have already made this a no-no, can we just agree that it’s a bad idea? Not only does it perpetuate inequity it opens you up to people over-inflating their salaries (lying) to get as much out of you as possible. Pro tip for interviewees: Don’t do that. “To compete for talent, your organization must also know what the market is paying for certain skills and develop fair and reasonable salary ranges for the positions in your company. This combination of compensation benchmarking followed by setting or updating salary ranges helps you attract and retain top talent.” — Pay Scale, “How to perform compensation benchmarking and set salary ranges.” Early in the interview process state the salary range, the factors you are considering that would contribute to the low, medium and high of that range, and the benefits and equity that would be involved as well during the hiring process. Don’t offer a salary outside the range you’ve pre-determined. If the offer is market-rate competitive and you’ve considered their experience then the offer is sound. This does a few things: At the end of the day there is simply too much easily-accessible data to escape candidates and employees finding out that they are underpaid in their industry or compared to their peers. Transparency breeds trust. Salary negotiation is the first time that you are communicating to future new employee how you value them. If you manage the exchange honestly and with transparency you are instilling in that individual an understanding that they will be treated honestly and with transparency as an employee. Read: Treated with respect. Employees who feel valued and respected are probably more likely to stick around. Hiring is an expensive and time-consuming pursuit. As a marketer who focuses on growth and retention it’s simple: I’m not investing my advertising dollars to acquire users who are going to churn (because I’d be bad at my job and my boss would fire me). Fix your leaky bucket, because the cost of losing an employee can be up to 2X of that employee’s annual salary. Stay tuned for the next installment where we cover meetings and communication. Want more articles like this? Visit www.women.work. ", "author": "Krisserin Canary", "parent": ""}