{"name": "2227", "title": "The First Teaser for ‘The Last Jedi’ Is Just Enough to Chew On", "sentences": [{"2f27": "The First Teaser for ‘The Last Jedi’ Is Just Enough to Chew On"}, {"8d29": "A new ‘Star Wars’ trailer has Luke Skywalker and Rey lightsaber-training, and it reminds us of ‘Empire Strikes Back.’ Is it Christmas yet?"}, {"9f79": "“It’s time for the Jedi to end,” Luke Skywalker says as the teaser for Star Wars: The Last Jedi comes to a close. It’s a handy reminder: Rogue One was entertaining, but no matter how many galaxy-adjacent stories Disney drops, the main draw of Star Wars will always be the continuation of the franchise’s original story. And now we’ve got a trailer for the latest edition to pick apart for clues."}, {"6903": "The big question is: When does Luke talk about wanting to shut down the Jedi Order? The Force Awakens came to a close with the new trilogy’s heroine, Rey, tracking down and then forlornly staring at Luke — Who is her father? You tell me — on a planet that resembles the coast of Northern Ireland. Rey’s mission was to find Luke and bring him back into the fold in the struggle against the First Order. It’s possible Luke’s defeatist attitude is part of the early conflict of The Last Jedi, as Rey works to persuade him to come out of exile. Much of the rest of the teaser for The Last Jedi, which is in the hands of Rian Johnson (Looper, Breaking Bad’s “Ozymandias”), is centered on what seems to be Luke training Rey, so one would think she is at least partially successful in her quest. And that can yield only good things! Training montages! Lightsaber drills! Maybe Rey will even make an X-wing levitate."}, {"f139": "(Walt Disney Studios Motion Pictures)"}, {"99f3": "One of the smartest things J.J. Abrams did as director of The Force Awakens was to invent a new story and a new cast of characters, but retrofit them to the narrative of George Lucas’s first three Star Wars films. The Force Awakens was set up to mirror A New Hope, and from the looks of this teaser, The Last Jedi will run parallel to The Empire Strikes Back — only now, Luke is Yoda, training Rey, who is this trilogy’s Luke, who is probably her dad."}, {"6034": "(Walt Disney Studios Motion Pictures)"}, {"0184": "The Empire Strikes Back is also one of the best sequels ever made, so buckle up."}, {"f1af": "As for a few other things going on in this surprisingly plot-light teaser: Rian Johnson is a bold director with a deft hand at crafting action scenes, and these two minutes of footage make me even more confident that he’s going to knock his run at Star Wars out of the park; I can’t wait to be reunited with emo Kylo Ren; you can look forward to learning more about what happened regarding the massacre at Luke’s school for gifted Jedi; and this (potentially Godzilla-riffing) sequence looks incredibly dope:"}, {"371f": "(Walt Disney Studios Motion Pictures)"}, {"9b77": "The Last Jedi teaser is artfully assembled, keeping just about everything close to the vest while simultaneously giving fans plenty to drool over. Though I know this is just the beginning in the deluge of promotional products, I really don’t need to see anything more. I can buy my tickets now, right?"}], "child": "2227_1\t2227_2\t2227_3\t2227_4\t2227_5\t2227_6", "timestamp": "Apr 14", "content": "The First Teaser for ‘The Last Jedi’ Is Just Enough to Chew On A new ‘Star Wars’ trailer has Luke Skywalker and Rey lightsaber-training, and it reminds us of ‘Empire Strikes Back.’ Is it Christmas yet? “It’s time for the Jedi to end,” Luke Skywalker says as the teaser for Star Wars: The Last Jedi comes to a close. It’s a handy reminder: Rogue One was entertaining, but no matter how many galaxy-adjacent stories Disney drops, the main draw of Star Wars will always be the continuation of the franchise’s original story. And now we’ve got a trailer for the latest edition to pick apart for clues. The big question is: When does Luke talk about wanting to shut down the Jedi Order? The Force Awakens came to a close with the new trilogy’s heroine, Rey, tracking down and then forlornly staring at Luke — Who is her father? You tell me — on a planet that resembles the coast of Northern Ireland. Rey’s mission was to find Luke and bring him back into the fold in the struggle against the First Order. It’s possible Luke’s defeatist attitude is part of the early conflict of The Last Jedi, as Rey works to persuade him to come out of exile. Much of the rest of the teaser for The Last Jedi, which is in the hands of Rian Johnson (Looper, Breaking Bad’s “Ozymandias”), is centered on what seems to be Luke training Rey, so one would think she is at least partially successful in her quest. And that can yield only good things! Training montages! Lightsaber drills! Maybe Rey will even make an X-wing levitate. (Walt Disney Studios Motion Pictures) One of the smartest things J.J. Abrams did as director of The Force Awakens was to invent a new story and a new cast of characters, but retrofit them to the narrative of George Lucas’s first three Star Wars films. The Force Awakens was set up to mirror A New Hope, and from the looks of this teaser, The Last Jedi will run parallel to The Empire Strikes Back — only now, Luke is Yoda, training Rey, who is this trilogy’s Luke, who is probably her dad. (Walt Disney Studios Motion Pictures) The Empire Strikes Back is also one of the best sequels ever made, so buckle up. As for a few other things going on in this surprisingly plot-light teaser: Rian Johnson is a bold director with a deft hand at crafting action scenes, and these two minutes of footage make me even more confident that he’s going to knock his run at Star Wars out of the park; I can’t wait to be reunited with emo Kylo Ren; you can look forward to learning more about what happened regarding the massacre at Luke’s school for gifted Jedi; and this (potentially Godzilla-riffing) sequence looks incredibly dope: (Walt Disney Studios Motion Pictures) The Last Jedi teaser is artfully assembled, keeping just about everything close to the vest while simultaneously giving fans plenty to drool over. Though I know this is just the beginning in the deluge of promotional products, I really don’t need to see anything more. I can buy my tickets now, right? ", "author": "Andrew Gruttadaro", "parent": ""}