{"name": "2228", "title": "An Ode to Letty Ortiz, the Secret MVP of the ‘Fast & Furious’ Franchise", "sentences": [{"1abd": "An Ode to Letty Ortiz, the Secret MVP of the ‘Fast & Furious’ Franchise"}, {"1bf9": "Michelle Rodriguez’s character fought like hell, died, came back to life, and is still taking names"}, {"7d16": "For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of The Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time."}, {"9aa3": "Let me be clear: This is not a thing about how Letty Ortiz, alpha female of the Fast & Furious franchise, is dope because she manages to exist within a male-centered movie universe as a woman who will not be marginalized, or disrespected, or, truly, treated as anything other than capable and equal. I mean, yes, those things are true. But this isn’t that. This is a thing about how Letty Ortiz, alpha female of the Fast & Furious franchise, is dope because she is fucking dope."}, {"5e67": "These are just some of the things I have seen Letty Ortiz do:"}, {"a447": "(Universal Pictures)"}, {"7f1d": "Back in 2015, back right when Furious 7 was released, Alyssa Rosenberg wrote an article for The Washington Post about why she liked Letty so much. The line from it that stuck with the most, and the one that I think about a lot whenever I rewatch one of the F&F movies she’s in: “While she’s often in danger, she’s rarely in distress.” That’s such a smart and nuanced observation, and one that is essential when sussing out why Letty has become a figure of admiration."}, {"6983": "(Universal Pictures)"}, {"370b": "I cannot lie: It means a lot to me that Letty Ortiz is named “Letty Ortiz,” and that she is played by a woman named Michelle Rodriguez. There are many conversations on the internet about the importance of positive representation in film and television and so on, and that is great. I love it. Sometimes I wonder what that type of responsibility feels like to the people who end up in those spots. It has to be a heavy thing, daunting and intimidating."}, {"9642": "The Definitive ‘Fast & Furious’ Movie RankingsBefore ‘Fate of the Furious’ is released, Shea Serrano and Andrew Gruttadaro are taking stock: Which is the best ‘Fast…theringer.com"}, {"f98a": "Pretend that all of the movie characters you have ever known and seen were real and lived in the same space and time as you and I do currently. What do you think Letty Ortiz would say if somebody asked her about being tasked with serving as the role model for all of the people who are proud that her last name ends in a “Z”? I bet it would be something dope. Because Letty Ortiz is fucking dope."}, {"3c1c": "Letty Ortiz is the third-best character of all the characters in the F&F’s core group, otherwise known as Dom’s group."}, {"45a8": "Who Is the Fastest and Most Furious in ‘Fast & Furious’?We measured it all out, one quarter-mile at a timetheringer.com"}, {"e966": "All of the key characters in Dom’s group, ranked:"}, {"1bf6": "(I feel bad for not including Tego Leo and Rico Santos in this. I’m sorry.)"}, {"1f82": "Is Letty Ortiz the most complicated character in any of the Fast & Furious movies? She is, right? It feels a lot like she is."}, {"c5c8": "She fell in love with Dominic, who is a wonderful movie character, absolutely, but kind of not that great of a guy to fall in love with. Remember when Letty tried to talk him out of committing that final heist in the first movie, the one that ended with Vince nearly dead and everyone all of a sudden being chased by the police? Remember how she tried to talk him out of running off without her (he wanted to because he said she was going to get hurt staying with him) and then he did it anyway while she was asleep and then later on she almost died?"}, {"25f6": "She constantly fought against the sexism that came with living as a woman in the illegal-street-racer circuit. The best time was when she raced that one guy at Race Wars in the first movie."}, {"367e": "She got amnesia and then got recruited into a rival crew. The two best parts about this: (1) When she shot Dom. (I was S-H-O-C-K-E-D.) (2) The way that she was the one who worked through all of the stuff in her own head to eventually find her way back to the group. She saved herself, which is just great. Because remember, Fast 6 (which is the one where all the amnesia stuff happened) ended with her having joined back up with Dom and everyone, but still not having regained her memory. She was going on straight gut there, which was a remarkable jump to make."}, {"e426": "She rose from the dead. I will never get over this and never not be thankful for it. She’s the only character in the series who’s come back from the dead. Of all of the main good-guy characters, Jesse died and Han died and Gisele died and Letty died. Only one came back. And after she came back is really when her storyline took off. (My favorite part about this is that Rodriguez said that she had no idea her character was coming back. She found out when she watched Fast Five in a movie theater, because at the end of Fast Five they show Hobbs with a folder of pictures of her still alive. Imagining what her face looked like in that moment always makes me happy.)"}, {"1d47": "Here’s the best thing about Letty Ortiz, and it’s a thing that only she does in the series and a thing she does so well that you don’t even notice it unless you’re all the way paying attention: She makes every single character a better version of who they are and what they are. Sometimes she amplifies a character’s obvious strength (her stoicism makes Roman Pearce seem even funnier; her toughness makes Brian’s accidental charming goofiness seem even more charming; the boom of her presence makes Han seem even more invisible; etc.). And sometimes she draws out parts from a character we wouldn’t have noticed or seen otherwise, and the most obvious example is the way she takes Dominic, who is like a giant piece of marble in a muscle shirt, and turns him into a gooey, earnest, cuddlebug."}, {"6f08": "Without Letty, it’s an entirely different, thoroughly less interesting movie series. Without Letty, everything is just way less dope."}], "child": "2228_1\t2228_2\t2228_3\t2228_4\t2228_5\t2228_6\t2228_7", "timestamp": "Apr 14", "content": "An Ode to Letty Ortiz, the Secret MVP of the ‘Fast & Furious’ Franchise Michelle Rodriguez’s character fought like hell, died, came back to life, and is still taking names For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of The Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time. Let me be clear: This is not a thing about how Letty Ortiz, alpha female of the Fast & Furious franchise, is dope because she manages to exist within a male-centered movie universe as a woman who will not be marginalized, or disrespected, or, truly, treated as anything other than capable and equal. I mean, yes, those things are true. But this isn’t that. This is a thing about how Letty Ortiz, alpha female of the Fast & Furious franchise, is dope because she is fucking dope. These are just some of the things I have seen Letty Ortiz do: (Universal Pictures) Back in 2015, back right when Furious 7 was released, Alyssa Rosenberg wrote an article for The Washington Post about why she liked Letty so much. The line from it that stuck with the most, and the one that I think about a lot whenever I rewatch one of the F&F movies she’s in: “While she’s often in danger, she’s rarely in distress.” That’s such a smart and nuanced observation, and one that is essential when sussing out why Letty has become a figure of admiration. (Universal Pictures) I cannot lie: It means a lot to me that Letty Ortiz is named “Letty Ortiz,” and that she is played by a woman named Michelle Rodriguez. There are many conversations on the internet about the importance of positive representation in film and television and so on, and that is great. I love it. Sometimes I wonder what that type of responsibility feels like to the people who end up in those spots. It has to be a heavy thing, daunting and intimidating. The Definitive ‘Fast & Furious’ Movie RankingsBefore ‘Fate of the Furious’ is released, Shea Serrano and Andrew Gruttadaro are taking stock: Which is the best ‘Fast…theringer.com Pretend that all of the movie characters you have ever known and seen were real and lived in the same space and time as you and I do currently. What do you think Letty Ortiz would say if somebody asked her about being tasked with serving as the role model for all of the people who are proud that her last name ends in a “Z”? I bet it would be something dope. Because Letty Ortiz is fucking dope. Letty Ortiz is the third-best character of all the characters in the F&F’s core group, otherwise known as Dom’s group. Who Is the Fastest and Most Furious in ‘Fast & Furious’?We measured it all out, one quarter-mile at a timetheringer.com All of the key characters in Dom’s group, ranked: (I feel bad for not including Tego Leo and Rico Santos in this. I’m sorry.) Is Letty Ortiz the most complicated character in any of the Fast & Furious movies? She is, right? It feels a lot like she is. She fell in love with Dominic, who is a wonderful movie character, absolutely, but kind of not that great of a guy to fall in love with. Remember when Letty tried to talk him out of committing that final heist in the first movie, the one that ended with Vince nearly dead and everyone all of a sudden being chased by the police? Remember how she tried to talk him out of running off without her (he wanted to because he said she was going to get hurt staying with him) and then he did it anyway while she was asleep and then later on she almost died? She constantly fought against the sexism that came with living as a woman in the illegal-street-racer circuit. The best time was when she raced that one guy at Race Wars in the first movie. She got amnesia and then got recruited into a rival crew. The two best parts about this: (1) When she shot Dom. (I was S-H-O-C-K-E-D.) (2) The way that she was the one who worked through all of the stuff in her own head to eventually find her way back to the group. She saved herself, which is just great. Because remember, Fast 6 (which is the one where all the amnesia stuff happened) ended with her having joined back up with Dom and everyone, but still not having regained her memory. She was going on straight gut there, which was a remarkable jump to make. She rose from the dead. I will never get over this and never not be thankful for it. She’s the only character in the series who’s come back from the dead. Of all of the main good-guy characters, Jesse died and Han died and Gisele died and Letty died. Only one came back. And after she came back is really when her storyline took off. (My favorite part about this is that Rodriguez said that she had no idea her character was coming back. She found out when she watched Fast Five in a movie theater, because at the end of Fast Five they show Hobbs with a folder of pictures of her still alive. Imagining what her face looked like in that moment always makes me happy.) Here’s the best thing about Letty Ortiz, and it’s a thing that only she does in the series and a thing she does so well that you don’t even notice it unless you’re all the way paying attention: She makes every single character a better version of who they are and what they are. Sometimes she amplifies a character’s obvious strength (her stoicism makes Roman Pearce seem even funnier; her toughness makes Brian’s accidental charming goofiness seem even more charming; the boom of her presence makes Han seem even more invisible; etc.). And sometimes she draws out parts from a character we wouldn’t have noticed or seen otherwise, and the most obvious example is the way she takes Dominic, who is like a giant piece of marble in a muscle shirt, and turns him into a gooey, earnest, cuddlebug. Without Letty, it’s an entirely different, thoroughly less interesting movie series. Without Letty, everything is just way less dope. ", "author": "Shea Serrano", "parent": ""}