{"name": "2234", "title": "No Hate for ‘Fate’", "sentences": [{"470a": "No Hate for ‘Fate’"}, {"6ee0": "With ‘The Fate of the Furious,’ the franchise ups the ante with Charlize Theron and Helen Mirren, under the stewardship of director F. Gary Gray. The result? More unabashedly dumb fun."}, {"618a": "For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of The Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time."}, {"b9c1": "It’s by now consensus that the Fast & Furious franchise left behind the nominal subgenre of racing movies some time ago. The Fate of the Furious, the newest installment, is a case in point: If it’s edge-of-your-seat drag races you’re looking for, abandon these movies and call RuPaul."}, {"0f45": "Not to worry — the movies haven’t left it all behind. You don’t become one of the most successful franchises in history by betraying expectations. Fate of the Furious starts with a quick homage to its origins, giving Dom Toretto (Vin Diesel, of course) a chance to flex his racing know-how with some low-stakes street action. It’s the first scene in the movie, set during his honeymoon in Cuba, and it has all the things a Fast race needs: the street-level whiz-bang of the camera, the corny insults, and the improbably souped-up nonsense of the competition itself. It’s exciting, but it doesn’t last. Really, it’s a scene meant to sum up Dom, and thus the movie. It illustrates his sense of honor and camaraderie, his generosity, and, of course, his loyalty."}, {"ae0a": "The Family Values of ‘Fast & Furious’As the preeminent family-friendly franchise, ‘Fast’ can teach you a thing or twotheringer.com"}, {"1d0c": "That’s all going to seemingly get flipped on its head once Toretto gets turned by a vicious hacker named Cipher. I guess it’s not fair to spoil how she persuades Toretto to betray everything he stands for — but if it didn’t entail preying on Toretto’s love of family, would this even be a Fast & Furious movie? Cipher, apparently the most powerful hacker in the world, is actually a funny choice of villain. You know the Fast & Furious franchise is officially post–Racing Movie when the bad guy is a hacker with dreadlocks — played by Charlize Theron! The movie is wild. Here are some of Theron’s finest lines: “It’s zombie time!” “I don’t want you to beg. I want you to learn.” Spooky stuff. On the flip side, there’s also lazy cheese like “Make it rain” and “Let’s get this party started” — the quality control here is, as always, inconsistent. It’s not a great character."}, {"0b20": "Theron, however, with her wild glare and steel-curtain cheekbones, is a fascinating force of evil — per usual. It’s a lane I should be tired of. Some movies (Snow White and the Huntsman and The Huntsman: Winter’s War, for example) have abused that gift. Fate puts it to good use. More than anything, Cipher — who I’m pretty sure can’t even drive, that’s how post-Racing we are — exemplifies the weird ways the franchise has lately sought to stretch its limits. Box-office numbers suggest we haven’t gotten bored yet, but each movie in the franchise seems to operate as if we were, upping the ante in curious, if not always satisfying, ways. (Dear Tokyo Drift: I’m talking about you.)"}, {"c094": "The Definitive ‘Fast & Furious’ Movie RankingsBefore ‘Fate of the Furious’ is released, Shea Serrano and Andrew Gruttadaro are taking stock: Which is the best ‘Fast…theringer.com"}, {"ba88": "Eight movies in, and it’s no wonder that the franchise’s creators would feel an itch to get weird. (Marvel, are you taking notes?) I’m still not sure I’ve recovered from the flying cars in Furious 7 — emotionally, I mean. As a concept, it’s beautiful, and that movie’s director, James Wan, pulled it off with a stupefying sense of cool. But, like, what? When you think about it, though, the Fast movies were fantasies long before they began attempting to defy gravity out of habit. The franchise’s lush sense of place and pleasure, its (frankly) nonsensical insistence on indestructible family bonds between huge bald men, and most especially, the sublime sense of speed: These are all cinematic fantasies, and they’re the Fast movies’ stock and trade. They are the joy of watching the films."}, {"a25d": "In that sense, flying cars aren’t so weird. Nothing in Fate approaches quite that level of whimsy, anyway — unless you count Cipher thinking she can get away with those dreadlocks. If anything, the movie feels comparatively straightforward. Even the multiple good-guy/bad-guy switcheroos feel, by this franchise’s standards, old hat. Familiar tropes give actors room to play, however, and this Fast ensemble is particularly charismatic. Ludacris and Tyrese remain fascinating comedic talents, and Michelle Rodriguez is, as always, a compelling presence no matter how skimpy her role. The true highlights are, as expected, Dwayne Johnson and Jason Statham, whose frenemy bickering verges on schoolyard flirtation. Their interplay is the funniest thing in the movie."}, {"db6d": "When the Fast movies are at their best, rote story beats have a way of taking on lives of their own. Fate, in fact, is overwhelmed with side stories and relationships that really ought to be their own movies. Give me a movie in which the Rock teaches war dances to his daughter’s soccer team — and is also, like, a superhero cop. Give me a movie in which Helen Mirren is a crime matriarch whose sons, Statham and Luke Evans, bicker like idiots for two hours: Animal Kingdom, but funnier. Give me Vin Diesel on his honeymoon in Cuba, giving away fancy cars like the bald, Bronx-born Robin Hood that he is, for two hours. I don’t want to watch Fate of the Furious so much as I want to chop it for parts."}, {"129f": "Vin Diesel Is More Than Just an Action StarHe is greater than the sum of his partstheringer.com"}, {"8098": "The movie is directed by F. Gary Gray, who has to date directed one all-time-great movie (the Queen Latifah–led crime drama Set It Off), one really good movie (The Italian Job), and one fascinating but poorly written movie (Straight Outta Compton). Gray has a feel for camaraderie. Set It Off and The Italian Job live and die by their abilities to convince us that their characters are in it together. Given that pedigree — The Italian Job especially — it’s a wonder that Gray is only now the director of a Fast & Furious movie."}, {"07d2": "Gray for the most part does the franchise justice. Every director thus far has had to lend the series their visual stamp, and for Gray, that’s a stunning cascade of cars launched from a New York parking tower. It’s quite a sight — a reminder that Fate doesn’t need to be good to be a good time. For all the clear ways they’re factory-made machines, what sets the Fast movies apart is that they nevertheless feel smaller, humbler, and more familial than your common blockbuster fare. Artistically, there are better franchises — and certainly, there are better movies. Rarely, however, is a movie this big such unabashedly dumb fun."}, {"ed1a": "An earlier version of this piece misstated one of Charlize Theron’s character’s lines; the line is “I don’t want you to beg. I want you to learn.”"}], "child": "2234_1\t2234_2\t2234_3\t2234_4\t2234_5\t2234_6", "timestamp": "Apr 14", "content": "No Hate for ‘Fate’ With ‘The Fate of the Furious,’ the franchise ups the ante with Charlize Theron and Helen Mirren, under the stewardship of director F. Gary Gray. The result? More unabashedly dumb fun. For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of The Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time. It’s by now consensus that the Fast & Furious franchise left behind the nominal subgenre of racing movies some time ago. The Fate of the Furious, the newest installment, is a case in point: If it’s edge-of-your-seat drag races you’re looking for, abandon these movies and call RuPaul. Not to worry — the movies haven’t left it all behind. You don’t become one of the most successful franchises in history by betraying expectations. Fate of the Furious starts with a quick homage to its origins, giving Dom Toretto (Vin Diesel, of course) a chance to flex his racing know-how with some low-stakes street action. It’s the first scene in the movie, set during his honeymoon in Cuba, and it has all the things a Fast race needs: the street-level whiz-bang of the camera, the corny insults, and the improbably souped-up nonsense of the competition itself. It’s exciting, but it doesn’t last. Really, it’s a scene meant to sum up Dom, and thus the movie. It illustrates his sense of honor and camaraderie, his generosity, and, of course, his loyalty. The Family Values of ‘Fast & Furious’As the preeminent family-friendly franchise, ‘Fast’ can teach you a thing or twotheringer.com That’s all going to seemingly get flipped on its head once Toretto gets turned by a vicious hacker named Cipher. I guess it’s not fair to spoil how she persuades Toretto to betray everything he stands for — but if it didn’t entail preying on Toretto’s love of family, would this even be a Fast & Furious movie? Cipher, apparently the most powerful hacker in the world, is actually a funny choice of villain. You know the Fast & Furious franchise is officially post–Racing Movie when the bad guy is a hacker with dreadlocks — played by Charlize Theron! The movie is wild. Here are some of Theron’s finest lines: “It’s zombie time!” “I don’t want you to beg. I want you to learn.” Spooky stuff. On the flip side, there’s also lazy cheese like “Make it rain” and “Let’s get this party started” — the quality control here is, as always, inconsistent. It’s not a great character. Theron, however, with her wild glare and steel-curtain cheekbones, is a fascinating force of evil — per usual. It’s a lane I should be tired of. Some movies (Snow White and the Huntsman and The Huntsman: Winter’s War, for example) have abused that gift. Fate puts it to good use. More than anything, Cipher — who I’m pretty sure can’t even drive, that’s how post-Racing we are — exemplifies the weird ways the franchise has lately sought to stretch its limits. Box-office numbers suggest we haven’t gotten bored yet, but each movie in the franchise seems to operate as if we were, upping the ante in curious, if not always satisfying, ways. (Dear Tokyo Drift: I’m talking about you.) The Definitive ‘Fast & Furious’ Movie RankingsBefore ‘Fate of the Furious’ is released, Shea Serrano and Andrew Gruttadaro are taking stock: Which is the best ‘Fast…theringer.com Eight movies in, and it’s no wonder that the franchise’s creators would feel an itch to get weird. (Marvel, are you taking notes?) I’m still not sure I’ve recovered from the flying cars in Furious 7 — emotionally, I mean. As a concept, it’s beautiful, and that movie’s director, James Wan, pulled it off with a stupefying sense of cool. But, like, what? When you think about it, though, the Fast movies were fantasies long before they began attempting to defy gravity out of habit. The franchise’s lush sense of place and pleasure, its (frankly) nonsensical insistence on indestructible family bonds between huge bald men, and most especially, the sublime sense of speed: These are all cinematic fantasies, and they’re the Fast movies’ stock and trade. They are the joy of watching the films. In that sense, flying cars aren’t so weird. Nothing in Fate approaches quite that level of whimsy, anyway — unless you count Cipher thinking she can get away with those dreadlocks. If anything, the movie feels comparatively straightforward. Even the multiple good-guy/bad-guy switcheroos feel, by this franchise’s standards, old hat. Familiar tropes give actors room to play, however, and this Fast ensemble is particularly charismatic. Ludacris and Tyrese remain fascinating comedic talents, and Michelle Rodriguez is, as always, a compelling presence no matter how skimpy her role. The true highlights are, as expected, Dwayne Johnson and Jason Statham, whose frenemy bickering verges on schoolyard flirtation. Their interplay is the funniest thing in the movie. When the Fast movies are at their best, rote story beats have a way of taking on lives of their own. Fate, in fact, is overwhelmed with side stories and relationships that really ought to be their own movies. Give me a movie in which the Rock teaches war dances to his daughter’s soccer team — and is also, like, a superhero cop. Give me a movie in which Helen Mirren is a crime matriarch whose sons, Statham and Luke Evans, bicker like idiots for two hours: Animal Kingdom, but funnier. Give me Vin Diesel on his honeymoon in Cuba, giving away fancy cars like the bald, Bronx-born Robin Hood that he is, for two hours. I don’t want to watch Fate of the Furious so much as I want to chop it for parts. Vin Diesel Is More Than Just an Action StarHe is greater than the sum of his partstheringer.com The movie is directed by F. Gary Gray, who has to date directed one all-time-great movie (the Queen Latifah–led crime drama Set It Off), one really good movie (The Italian Job), and one fascinating but poorly written movie (Straight Outta Compton). Gray has a feel for camaraderie. Set It Off and The Italian Job live and die by their abilities to convince us that their characters are in it together. Given that pedigree — The Italian Job especially — it’s a wonder that Gray is only now the director of a Fast & Furious movie. Gray for the most part does the franchise justice. Every director thus far has had to lend the series their visual stamp, and for Gray, that’s a stunning cascade of cars launched from a New York parking tower. It’s quite a sight — a reminder that Fate doesn’t need to be good to be a good time. For all the clear ways they’re factory-made machines, what sets the Fast movies apart is that they nevertheless feel smaller, humbler, and more familial than your common blockbuster fare. Artistically, there are better franchises — and certainly, there are better movies. Rarely, however, is a movie this big such unabashedly dumb fun. An earlier version of this piece misstated one of Charlize Theron’s character’s lines; the line is “I don’t want you to beg. I want you to learn.” ", "author": "K. Austin Collins", "parent": ""}