{"name": "2237", "title": "Jude Law, the New Young Dumbledore, Should Be the New Young Everything", "sentences": [{"de2f": "Jude Law, the New Young Dumbledore, Should Be the New Young Everything"}, {"065f": "First the Vatican, now the ‘Fantastic Beasts’ sequel … Jude Law may not technically be young, but who says that should stop him?"}, {"a98c": "If you, like me, are still recovering from the discovery that Colin Farrell is going to be played by Johnny Depp, or that Colin Farrell was playing Johnny Depp all along, or that Colin Farrell and Johnny Depp were both playing each other, or something, the question of who will play young Albus Dumbledore in the forthcoming Fantastic Beasts and Where to Find Them sequel has been a source of some worry. There’s a lot to cover when it comes to Young Dumbledore, of course, seeing as we already know that he:"}, {"908b": "1. Is very good at magic"}, {"b29a": "2. Has a dramatic breakup with evil dark warlock Gellert Grindelwald (Depp and formerly Farrell, kind of) that culminates in a sexy magic battle with a tragic ending"}, {"ce36": "3. Becomes the owner of THE ELDER WAND"}, {"4c4e": "4. At some point develops into the single most important nonfamilial influence of your childhood, and"}, {"e1e0": "5. Might be a time-traveling Ron Weas — ha-ha, just kidding, we won’t go down that path of terrors here"}, {"6471": "Anyway, the news: Variety reports that Jude Law, a.k.a. the young Pope of The Young Pope, is going to play Young Dumbledore. This is fantastic news, but more importantly, it is also the second entry in what I hope will be an uninterrupted epoch of Jude Law playing every single “Young” role in Hollywood."}, {"65d8": "Empirically speaking, Jude Law in fact is not young: I watched Gattaca in middle school integrated science. He has five children. His middle name is Heyworth. He wore, uh, this. He’s 44. But: Look at his skin. If Jude Law sold lotion, I would buy it. Beam me up to your hydrated bronzer paradise, and let us drink eight glasses a day from the eternal waters of the Fountain of Judeth. (Or the Elixir of Life, if you prefer.) Yes, fine, Jude Law may not exactly be young — but he’s done a damn good job of being Young, so who cares? Let him play Young Everything."}, {"d8e6": "Here are some figures that I think Jude Law would be a prime target to play a young version of. Young Thomas Jefferson. Young Twain. Young Hitchcock. Young Jesus. Young Elvis. Young Sinatra. Young Churchill. Young Belichick. Young Poe. Young Tom Cruise. Young my dad. I’m just spitballing."}, {"b5ad": "What I’m trying to say is: I can’t wait for Young Albus, played by the Young Jude Law, and I hope they never hire an Old actor again."}], "child": "2237_1\t2237_2\t2237_3", "timestamp": "Apr 12", "content": "Jude Law, the New Young Dumbledore, Should Be the New Young Everything First the Vatican, now the ‘Fantastic Beasts’ sequel … Jude Law may not technically be young, but who says that should stop him? If you, like me, are still recovering from the discovery that Colin Farrell is going to be played by Johnny Depp, or that Colin Farrell was playing Johnny Depp all along, or that Colin Farrell and Johnny Depp were both playing each other, or something, the question of who will play young Albus Dumbledore in the forthcoming Fantastic Beasts and Where to Find Them sequel has been a source of some worry. There’s a lot to cover when it comes to Young Dumbledore, of course, seeing as we already know that he: 1. Is very good at magic 2. Has a dramatic breakup with evil dark warlock Gellert Grindelwald (Depp and formerly Farrell, kind of) that culminates in a sexy magic battle with a tragic ending 3. Becomes the owner of THE ELDER WAND 4. At some point develops into the single most important nonfamilial influence of your childhood, and 5. Might be a time-traveling Ron Weas — ha-ha, just kidding, we won’t go down that path of terrors here Anyway, the news: Variety reports that Jude Law, a.k.a. the young Pope of The Young Pope, is going to play Young Dumbledore. This is fantastic news, but more importantly, it is also the second entry in what I hope will be an uninterrupted epoch of Jude Law playing every single “Young” role in Hollywood. Empirically speaking, Jude Law in fact is not young: I watched Gattaca in middle school integrated science. He has five children. His middle name is Heyworth. He wore, uh, this. He’s 44. But: Look at his skin. If Jude Law sold lotion, I would buy it. Beam me up to your hydrated bronzer paradise, and let us drink eight glasses a day from the eternal waters of the Fountain of Judeth. (Or the Elixir of Life, if you prefer.) Yes, fine, Jude Law may not exactly be young — but he’s done a damn good job of being Young, so who cares? Let him play Young Everything. Here are some figures that I think Jude Law would be a prime target to play a young version of. Young Thomas Jefferson. Young Twain. Young Hitchcock. Young Jesus. Young Elvis. Young Sinatra. Young Churchill. Young Belichick. Young Poe. Young Tom Cruise. Young my dad. I’m just spitballing. What I’m trying to say is: I can’t wait for Young Albus, played by the Young Jude Law, and I hope they never hire an Old actor again. ", "author": "Claire McNear", "parent": ""}