{"name": "2238", "title": "In ‘Detroit,’ Kathryn Bigelow Brings Her Camera Home", "sentences": [{"3d35": "In ‘Detroit,’ Kathryn Bigelow Brings Her Camera Home"}, {"12d9": "To late-’60s America, specifically, and it looks heavy"}, {"8334": "“It’s a war zone out there,” a character says in voiceover early in the trailer (released Wednesday) for Detroit, Kathryn Bigelow’s upcoming film about that city’s 1967 riot. That might sound like an exaggeration — but this is a Kathryn Bigelow film, and Kathryn Bigelow knows how to make movies about war, the spaces in which they take place, and the effects they have on the men and women who fight and live through them. (Her interest in the psychology of conflict runs deep enough to occasionally outweigh historical accuracy.) Bigelow is an American director, but she had to go abroad to find her big break. After early films like Near Dark and Point Break, she spent some time in the Hollywood wilderness. Then she went to the Middle East, where she made The Hurt Locker and Zero Dark Thirty in rapid succession, and secured a reputation — hinted at in her early films — as a technically brilliant, emotionally nuanced director of action movies."}, {"d78f": "Now she’s coming home. To Detroit, specifically. And it looks intense."}, {"f9f1": "(Annapurna Pictures)"}, {"4a72": "Detroit will tell some portion of the story of that city’s 1967 riot, five days that stand among the most violent in the history of American cities. The film opens up some new themes for Bigelow — race in America, inequitable police treatment, discriminatory urban planning — in addition to the exploration of conflict and state violence. Detroit looks like it will focus primarily on a specific incident at the Algiers Motel, an encounter between the motel’s guests and local and national law enforcement that resulted in the deaths of three African American civilians, and injury to a number of the motel’s other guests. Let’s set aside questions of politics and history for a moment, because those characters will be played by an extremely exciting group of actors: John Boyega takes a break from shooting Star Wars movies to mount up as a security guard with a conscience, Jason Mitchell continues to age into a steal-your-scene character actor, and Anthony Mackie adds some wizened conscience. These are actors who deserve to carry a massive, weighty movie."}, {"2cd6": "For her faults, Kathryn Bigelow has spent the past decade as America’s foremost interpreter of war. Detroit looks like a tough movie, unstinting and violent and sober. Thankfully, Kathryn Bigelow is pretty good at telling those kinds of stories."}, {"0d65": "An earlier version of this piece misidentified the character played by John Boyega; he is a security guard, not a police officer."}], "child": "2238_1", "timestamp": "Apr 12", "content": "In ‘Detroit,’ Kathryn Bigelow Brings Her Camera Home To late-’60s America, specifically, and it looks heavy “It’s a war zone out there,” a character says in voiceover early in the trailer (released Wednesday) for Detroit, Kathryn Bigelow’s upcoming film about that city’s 1967 riot. That might sound like an exaggeration — but this is a Kathryn Bigelow film, and Kathryn Bigelow knows how to make movies about war, the spaces in which they take place, and the effects they have on the men and women who fight and live through them. (Her interest in the psychology of conflict runs deep enough to occasionally outweigh historical accuracy.) Bigelow is an American director, but she had to go abroad to find her big break. After early films like Near Dark and Point Break, she spent some time in the Hollywood wilderness. Then she went to the Middle East, where she made The Hurt Locker and Zero Dark Thirty in rapid succession, and secured a reputation — hinted at in her early films — as a technically brilliant, emotionally nuanced director of action movies. Now she’s coming home. To Detroit, specifically. And it looks intense. (Annapurna Pictures) Detroit will tell some portion of the story of that city’s 1967 riot, five days that stand among the most violent in the history of American cities. The film opens up some new themes for Bigelow — race in America, inequitable police treatment, discriminatory urban planning — in addition to the exploration of conflict and state violence. Detroit looks like it will focus primarily on a specific incident at the Algiers Motel, an encounter between the motel’s guests and local and national law enforcement that resulted in the deaths of three African American civilians, and injury to a number of the motel’s other guests. Let’s set aside questions of politics and history for a moment, because those characters will be played by an extremely exciting group of actors: John Boyega takes a break from shooting Star Wars movies to mount up as a security guard with a conscience, Jason Mitchell continues to age into a steal-your-scene character actor, and Anthony Mackie adds some wizened conscience. These are actors who deserve to carry a massive, weighty movie. For her faults, Kathryn Bigelow has spent the past decade as America’s foremost interpreter of war. Detroit looks like a tough movie, unstinting and violent and sober. Thankfully, Kathryn Bigelow is pretty good at telling those kinds of stories. An earlier version of this piece misidentified the character played by John Boyega; he is a security guard, not a police officer. ", "author": "Sam Schube", "parent": ""}