{"name": "2273", "title": "Fan Theory Friday: Is ‘Life’ A ‘Venom’ Prequel?!?!", "sentences": [{"435a": "Fan Theory Friday: Is ‘Life’ A ‘Venom’ Prequel?!?!"}, {"ae58": "So strange it could be true."}, {"4747": "This week’s fan theory is ripped from the headlines and hot off the press, so let’s jump into it straightaway, because this time next week it’ll either be proven or passé."}, {"2946": "You’ve heard about this movie Life, right? Not the Martin Lawrence/Eddie Murphy prohibition-era prison escape movie (which is awesome), rather the new Alien-esque sci-fi thriller from the writers of Deadpool starring Jake Gyllenhaal, Ryan Reynolds, and Rebecca Ferguson as part of the crew of an international space station who discovers life on Mars in the form of some goo or something that naturally presents a dire and all-to-real threat to humanity, leaving it to our intrepid crew to find a way to destroy it before it can reach Earth and destroy all of us."}, {"cd1f": "The film got some headlines this week when a Redditor by the sweet tag of Toomuchsoul spotted something familiar in Life’s latest trailer: footage from Sam Raimi’s Spider-Man 3. It’s just a brief crowd shot, but it sticks out like a sore thumb as it’s the only shot in the trailer that doesn’t take place in space."}, {"01c0": "It’s inclusion was taken to be just another example of stock footage recycling — it actually happens more than you think — but then something seemingly unrelated happened: Sony, out of the clear blue, announced they were developing a standalone Venom movie for next year. That’s when the internet started sizzling, because it only took about point-two seconds for people to connect Venom, being one of the villains from Spider-Man 3, to Life."}, {"7041": "See, in the comics and the movie, Venom isn’t a humanoid, it’s an alien symbiote that attaches itself to a humanoid and takes them over. In the comics, the symbiote came home with Peter from the Secret Wars, and in Raimi’s film it falls to Earth on a meteor. In both cases it attaches first to Peter, turning his classic red-and-blue suit black and making him do terrible, terrible things like dance, then to Eddie Brock, who becomes Venom. Looking back on the Life trailer, said goo from Mars does appear to be some kind of adhesive symbiote capable of starting small and spreading man-sized, and the inclusion of a single crowd shot — on Earth — would seem to indicate our crew isn’t successful in destroying it."}, {"9941": "That leads to one very interesting question: is Life a secret prequel to next year’s Venom?"}, {"ff05": "All the above evidence is well and good, but what really gives this theory legs are Reese and Wernick, the writers, who do have Marvel connections via ­Deadpool, and Sony, the studio behind Spider-Man 3, Life, and Venom."}, {"396f": "Now, of course, there’s also some detracting evidence, like the fact that neither Reese nor Wernick appears to be attached to Venom in any way — though they wouldn’t have to be — and more notably the inclusion of Ryan Reynolds in Life, who of course already acts in the Marvel Universe as Deadpool. Detractors would say that his presence negates this being a surreptitious Marvel prequel."}, {"51d3": "That is, unless his character dies in Life."}, {"1b3e": "Then he’s just an actor playing two unconnected roles in the same universe, kinda like Chris Evans has been the Human Torch and Captain America. Not technically the same universe, I know, but for that matter Deadpool and the current Marvel Cinematic Universe aren’t synced up yet, which would make Reynolds’ roles in Deadpool and Life more like Michael B. Jordan’s in Fantastic Four and the upcoming Black Panther: related by comic blood, but not cinematic. Plus, if you’re going to use someone as a red herring detractor, Reynolds is the guy."}, {"288d": "So what do you think? Has Sony just pulled off the sliest prequel in cinema history, or do Redditors have too much time on their hands? Sound off your thoughts in the comments, but do it quick because we don’t have to wait too long to find out if this is true or not, as Life opens next Friday. And whether it turns out to be a theory that holds water or leaks like a colander, it’s a helluva lot of fun to think about."}, {"5754": "Catch up on Fan Theory Fridays right here."}, {"7813": "Special thanks to FSR’s Christopher Campbell for cluing me to this one."}], "child": "2273_1", "timestamp": "Mar 17", "content": "Fan Theory Friday: Is ‘Life’ A ‘Venom’ Prequel?!?! So strange it could be true. This week’s fan theory is ripped from the headlines and hot off the press, so let’s jump into it straightaway, because this time next week it’ll either be proven or passé. You’ve heard about this movie Life, right? Not the Martin Lawrence/Eddie Murphy prohibition-era prison escape movie (which is awesome), rather the new Alien-esque sci-fi thriller from the writers of Deadpool starring Jake Gyllenhaal, Ryan Reynolds, and Rebecca Ferguson as part of the crew of an international space station who discovers life on Mars in the form of some goo or something that naturally presents a dire and all-to-real threat to humanity, leaving it to our intrepid crew to find a way to destroy it before it can reach Earth and destroy all of us. The film got some headlines this week when a Redditor by the sweet tag of Toomuchsoul spotted something familiar in Life’s latest trailer: footage from Sam Raimi’s Spider-Man 3. It’s just a brief crowd shot, but it sticks out like a sore thumb as it’s the only shot in the trailer that doesn’t take place in space. It’s inclusion was taken to be just another example of stock footage recycling — it actually happens more than you think — but then something seemingly unrelated happened: Sony, out of the clear blue, announced they were developing a standalone Venom movie for next year. That’s when the internet started sizzling, because it only took about point-two seconds for people to connect Venom, being one of the villains from Spider-Man 3, to Life. See, in the comics and the movie, Venom isn’t a humanoid, it’s an alien symbiote that attaches itself to a humanoid and takes them over. In the comics, the symbiote came home with Peter from the Secret Wars, and in Raimi’s film it falls to Earth on a meteor. In both cases it attaches first to Peter, turning his classic red-and-blue suit black and making him do terrible, terrible things like dance, then to Eddie Brock, who becomes Venom. Looking back on the Life trailer, said goo from Mars does appear to be some kind of adhesive symbiote capable of starting small and spreading man-sized, and the inclusion of a single crowd shot — on Earth — would seem to indicate our crew isn’t successful in destroying it. That leads to one very interesting question: is Life a secret prequel to next year’s Venom? All the above evidence is well and good, but what really gives this theory legs are Reese and Wernick, the writers, who do have Marvel connections via ­Deadpool, and Sony, the studio behind Spider-Man 3, Life, and Venom. Now, of course, there’s also some detracting evidence, like the fact that neither Reese nor Wernick appears to be attached to Venom in any way — though they wouldn’t have to be — and more notably the inclusion of Ryan Reynolds in Life, who of course already acts in the Marvel Universe as Deadpool. Detractors would say that his presence negates this being a surreptitious Marvel prequel. That is, unless his character dies in Life. Then he’s just an actor playing two unconnected roles in the same universe, kinda like Chris Evans has been the Human Torch and Captain America. Not technically the same universe, I know, but for that matter Deadpool and the current Marvel Cinematic Universe aren’t synced up yet, which would make Reynolds’ roles in Deadpool and Life more like Michael B. Jordan’s in Fantastic Four and the upcoming Black Panther: related by comic blood, but not cinematic. Plus, if you’re going to use someone as a red herring detractor, Reynolds is the guy. So what do you think? Has Sony just pulled off the sliest prequel in cinema history, or do Redditors have too much time on their hands? Sound off your thoughts in the comments, but do it quick because we don’t have to wait too long to find out if this is true or not, as Life opens next Friday. And whether it turns out to be a theory that holds water or leaks like a colander, it’s a helluva lot of fun to think about. Catch up on Fan Theory Fridays right here. Special thanks to FSR’s Christopher Campbell for cluing me to this one. ", "author": "H. Perry Horton", "parent": ""}