{"name": "2304", "title": "The Definitive Character Definition", "sentences": [{"b89a": "The Definitive Character Definition"}, {"f3da": "Who truly owns the portrayal of any given character?"}, {"f754": "I was looking at a picture of the Dark Knight today and it got me thinking about characters from both movies, comics, animations and books that have been played by different characters over the years and that have multiple interpretations across different mediums. The public tends to favour one actor over the other or one version over the other and this usually leads to polarization which shows up in how the different characters are received and their eventual take on the Box-Office (if they are movies)."}, {"1301": "The perfect example of this of course is James Bond who has been played by numerous actors over the past five decades; beginning with Sean Connery in Dr. No (1962). Before this of course we had the novels penned by Ian Flemming. Now not to take away from this argument; but before I wrote this I had never read the novels but I am very certain that the versions we have onscreen differ a bit from the characterization and attributes in the movies. If I am wrong, please correct me dear reader."}, {"9542": "Everyone loves Sean Connery. he is charismatic, has such a strong presence and comes off as a man’s man and he has a face that makes you believe he can literally make the pants melt off the ladies. He played James Bond as a quiet but capable spy."}, {"35f5": "Then most recently, we have Daniel Craig who has played the most fierce and brutal James Bond to date. A true assassin in every sense of the word. The rugged man that you believe is more capable of killing with his bare hands than charming a lady (despite what the movies tell us)."}, {"7850": "Now when you compare the various Bonds over the years, you realise that that they were all playing the Bonds that era wanted to see. James Bond movies have always been over the top and a little on the eccentric side sometimes but the gadgets, global scale and the ladies have made it so timeless that whoever gets to plays the role of 007 is a major event (alongside the theme song)."}, {"6b7c": "I digress…"}, {"712f": "The point here is that all these “Bonds” had fans and detractors. Heck after Pierce Brosnan, I didn’t like that Mr. Craig was chosen. I felt he wasn’t handsome enough and that he didn’t have that charm and charisma that I felt Brosnan had but after watching him over the years especially after Skyfall, I realised that he really didn’t need any of that to play an awesome Bond."}, {"080c": "Daniel Craig as James Bond"}, {"d73b": "He’s a Bond for the times. Perfectly placed to play the down to earth, rugged “Borne” type protagonist and thus brilliantly cast. When you look at this, saying who the best Bond is becomes entirely subjective and comparing them becomes unfair as the parameters used cannot be the same."}, {"d539": "We should instead look at the movie in which they have been placed and rate them based on that particular movie and not based on what has come before. It’s like comparing the amount of money a movie needs to make to break even back in the 1930’s with what is needed now. Things like inflation come into play and the margins of profit from then and now are hugely different. The same with characters from movies."}, {"f188": "Each era has a definitive type of acting and we cannot expect an actor from 2016 to act the same role the same way an actor from 1930 would."}, {"b3d5": "Another beautiful example is The Joker from Batman."}, {"9c03": "Heath Ledger as The Joker"}, {"20fe": "Who is the definitive Joker? I’m sure a lot would say Heath Ledger pictured above right?"}, {"81a7": "Not necessarily…"}, {"183c": "I have a very good friend who feels that while Heath Ledger’s Joker is pretty cool, he’s still not as good as The Joker as voiced by Mark Hamill from the video games and the animations. He feels that he (Mark Hamill’s Joker) is a better representation of the character than what Heath portrayed as it is more in line with canon. I don’t agree or rather I didn’t."}, {"825f": "It is all of that which led me to put this down because I feel that our view is too one-sided and doesn’t take into cognizance that no two actors are the same and thus no two persons can do the same thing or play the same roles the exact same way."}, {"3d5c": "If it was the remake of a movie, then I could understand as it would be the artistic value being compared and that is alright. I mean we can look at Ben-Hur that was released this year and compare it with the 1959 version and note that while the modern version has updated special effects (sfx), it is flat and doesn’t have the emotional core that made the Charlton Heston original such a classic."}, {"cbea": "To end this lengthy write-up, I’ll give an honorary mention to Jared Leto’s Joker. I didn’t like him much and felt he was a bit over the top. Who knows, if Suicide Squad had been a better movie, I may have appreciated his character a little bit more."}, {"bf98": "Let’s look forward to the future with anticipation as we wait to see what the new Spider-Man/Peter Parker (Tom Holland) delivers. Not to mention the inevitable recasting of The Wolverine among many others."}], "child": "2304_12304_1", "timestamp": "Sep 26, 2016", "content": "The Definitive Character Definition Who truly owns the portrayal of any given character? I was looking at a picture of the Dark Knight today and it got me thinking about characters from both movies, comics, animations and books that have been played by different characters over the years and that have multiple interpretations across different mediums. The public tends to favour one actor over the other or one version over the other and this usually leads to polarization which shows up in how the different characters are received and their eventual take on the Box-Office (if they are movies). The perfect example of this of course is James Bond who has been played by numerous actors over the past five decades; beginning with Sean Connery in Dr. No (1962). Before this of course we had the novels penned by Ian Flemming. Now not to take away from this argument; but before I wrote this I had never read the novels but I am very certain that the versions we have onscreen differ a bit from the characterization and attributes in the movies. If I am wrong, please correct me dear reader. Everyone loves Sean Connery. he is charismatic, has such a strong presence and comes off as a man’s man and he has a face that makes you believe he can literally make the pants melt off the ladies. He played James Bond as a quiet but capable spy. Then most recently, we have Daniel Craig who has played the most fierce and brutal James Bond to date. A true assassin in every sense of the word. The rugged man that you believe is more capable of killing with his bare hands than charming a lady (despite what the movies tell us). Now when you compare the various Bonds over the years, you realise that that they were all playing the Bonds that era wanted to see. James Bond movies have always been over the top and a little on the eccentric side sometimes but the gadgets, global scale and the ladies have made it so timeless that whoever gets to plays the role of 007 is a major event (alongside the theme song). I digress… The point here is that all these “Bonds” had fans and detractors. Heck after Pierce Brosnan, I didn’t like that Mr. Craig was chosen. I felt he wasn’t handsome enough and that he didn’t have that charm and charisma that I felt Brosnan had but after watching him over the years especially after Skyfall, I realised that he really didn’t need any of that to play an awesome Bond. Daniel Craig as James Bond He’s a Bond for the times. Perfectly placed to play the down to earth, rugged “Borne” type protagonist and thus brilliantly cast. When you look at this, saying who the best Bond is becomes entirely subjective and comparing them becomes unfair as the parameters used cannot be the same. We should instead look at the movie in which they have been placed and rate them based on that particular movie and not based on what has come before. It’s like comparing the amount of money a movie needs to make to break even back in the 1930’s with what is needed now. Things like inflation come into play and the margins of profit from then and now are hugely different. The same with characters from movies. Each era has a definitive type of acting and we cannot expect an actor from 2016 to act the same role the same way an actor from 1930 would. Another beautiful example is The Joker from Batman. Heath Ledger as The Joker Who is the definitive Joker? I’m sure a lot would say Heath Ledger pictured above right? Not necessarily… I have a very good friend who feels that while Heath Ledger’s Joker is pretty cool, he’s still not as good as The Joker as voiced by Mark Hamill from the video games and the animations. He feels that he (Mark Hamill’s Joker) is a better representation of the character than what Heath portrayed as it is more in line with canon. I don’t agree or rather I didn’t. It is all of that which led me to put this down because I feel that our view is too one-sided and doesn’t take into cognizance that no two actors are the same and thus no two persons can do the same thing or play the same roles the exact same way. If it was the remake of a movie, then I could understand as it would be the artistic value being compared and that is alright. I mean we can look at Ben-Hur that was released this year and compare it with the 1959 version and note that while the modern version has updated special effects (sfx), it is flat and doesn’t have the emotional core that made the Charlton Heston original such a classic. To end this lengthy write-up, I’ll give an honorary mention to Jared Leto’s Joker. I didn’t like him much and felt he was a bit over the top. Who knows, if Suicide Squad had been a better movie, I may have appreciated his character a little bit more. Let’s look forward to the future with anticipation as we wait to see what the new Spider-Man/Peter Parker (Tom Holland) delivers. Not to mention the inevitable recasting of The Wolverine among many others. ", "author": "Osasu Elaiho", "parent": ""}