{"name": "2312", "title": "Suicide Squad", "sentences": [{"7080": "Suicide Squad"}, {"2e5d": "It’s official, DC doesn’t have a clue"}, {"a3fc": "Ihave had a long day at work right and it’s almost 8pm. I decide to go see Suicide Squad for 9:05pm. At this point it has been showing for over a week at the cinemas. Other than the trailers, I’d pretty much avoided any spoilers or news concerning Suicide Squad."}, {"61d7": "I even stayed away from my favourite dude on YouTube who reviews movies; Jeremy Jahns and so I figured I’d have a lovely enough time before heading home and calling it a night. What follows is my experience."}, {"3e0c": "One thing is certain; studios need to rethink how they go about making their superhero movies and movies in general because what we have here, isn’t encouraging at all for the future."}, {"2d20": "Now on to the review"}, {"4ba1": "Margot Robbie as Harley Quin holds her own but that isn’t saying much"}, {"ad56": "So Suicide Squad is the latest in the DC Extended Universe, set sometime after Batman v Superman: Dawn of Justice but definitely before Justice League."}, {"9491": "We meet our band of misfits via an introduction by Amanda Waller (Viola Davis has found a role that seems tailor made for her. DC might be terrible with casting their heroes and villains but they sure got this) told through a montage. It’s a standard “this is who they were before we caught them” sequence and they only show some characters and not all."}, {"d043": "This just feels weird, like the movie had been rushed and you feel like certain scenes have been chopped to keep it within a particular running time."}, {"1a39": "It does show us the two characters we should care about though; Harley Quinn played down to a T by Margot Robbie and Deadshot played by Will Smith back in form if I do say so myself. He was witty, a badass and showed more leadership qualities than the man who has been put in charge to run their team."}, {"c710": "Before the movie was released, I’d taken issue with Margot’s outfit being there for the sake of sexualizing her character but that totally isn’t the case. It fits with what is portrayed here and you’ll notice that it doesn’t weaken her in any way and she can hold out on her own and doesn’t need anyone to save her (take that Lois Lane!)."}, {"3551": "The rest of the characters truly are forgettable (well except for Enchantress although truth be told she is sort of forgettable). The Aussie accent of “Captain Boomerang” was just distracting (even if he is Australian). Really, who keeps giving Jai Courtney these roles? His acting is still wooden and even if he wasn’t in this movie, it wouldn’t have made a lick of difference."}, {"9289": "The story itself is watered down to the bare essence and isn’t inspiring at all. It’s like a child got hold of a new toy, got some from his friends and decided to play “director\" and see what parts would stick if he jammed them all together."}, {"0444": "It is an instantly inconsequential movie. The effects aren’t out of this world, the music is noisy, there are a few cool scenes now and then but it isn’t enough to make you cheer at the end of the movie."}, {"79f9": "As soon as the last scene ended and the credits began to roll, I was out of the hall so fast not caring if there was a mid-credit or post-credit scene. At one point I’d even gone for bathroom break knowing I wouldn’t miss anything and I didn’t."}, {"3fcd": "As soon as the last scene ended and the credits began to roll, I was out of the hall so fast not caring if there was a mid-credit or post-credit scene"}, {"587f": "It still gives me pause why this movie has even made as much as it has at the box-office right now. It seems there truly is a disparity between critics and the general movie viewing public."}, {"c6c1": "If that’s the case though, then why didn’t I enjoy it? Why do I think it’s such a silly movie that the only way to enjoy it is to just have fun watching stuff being blown up and be happy about that?"}, {"daf2": "Is that enough? I don’t think so! I believe movies should hold themselves to a higher meaning and standard and strive to draw us in with good stories and and beautiful acting that cause us to leave the cinema hall shaking our heads in wonderment at what just happened or laughing our asses when we remember hilarious events that occurred."}, {"d3cc": "Jared Leto is weird as The Joker and not in a good way"}, {"b1ce": "When I think of this movie just a couple hours after seeing it, this is what comes to mind: “Heath Ledger is by far a better Joker than Jared Leto will ever be and I believe DC has horrible taste in casting their iconic villains”"}, {"e72b": "Watch this movie if you must. Watch it because you are an action fan junkie and you want to see Will Smith back in action. Watch it because Margot Robbie holds her own and watch it because you are a fan of DC and a lover of all things superhuman. Other than that, keep away. You’ll forget about it the minute the curtain calls."}, {"332b": "Final Score: 3/10"}], "child": "2312_1\t2312_2\t2312_3\t2312_4\t2312_5\t2312_62312_1\t2312_2\t2312_3\t2312_4\t2312_5\t2312_6", "timestamp": "Aug 12, 2016", "content": "Suicide Squad It’s official, DC doesn’t have a clue Ihave had a long day at work right and it’s almost 8pm. I decide to go see Suicide Squad for 9:05pm. At this point it has been showing for over a week at the cinemas. Other than the trailers, I’d pretty much avoided any spoilers or news concerning Suicide Squad. I even stayed away from my favourite dude on YouTube who reviews movies; Jeremy Jahns and so I figured I’d have a lovely enough time before heading home and calling it a night. What follows is my experience. One thing is certain; studios need to rethink how they go about making their superhero movies and movies in general because what we have here, isn’t encouraging at all for the future. Now on to the review Margot Robbie as Harley Quin holds her own but that isn’t saying much So Suicide Squad is the latest in the DC Extended Universe, set sometime after Batman v Superman: Dawn of Justice but definitely before Justice League. We meet our band of misfits via an introduction by Amanda Waller (Viola Davis has found a role that seems tailor made for her. DC might be terrible with casting their heroes and villains but they sure got this) told through a montage. It’s a standard “this is who they were before we caught them” sequence and they only show some characters and not all. This just feels weird, like the movie had been rushed and you feel like certain scenes have been chopped to keep it within a particular running time. It does show us the two characters we should care about though; Harley Quinn played down to a T by Margot Robbie and Deadshot played by Will Smith back in form if I do say so myself. He was witty, a badass and showed more leadership qualities than the man who has been put in charge to run their team. Before the movie was released, I’d taken issue with Margot’s outfit being there for the sake of sexualizing her character but that totally isn’t the case. It fits with what is portrayed here and you’ll notice that it doesn’t weaken her in any way and she can hold out on her own and doesn’t need anyone to save her (take that Lois Lane!). The rest of the characters truly are forgettable (well except for Enchantress although truth be told she is sort of forgettable). The Aussie accent of “Captain Boomerang” was just distracting (even if he is Australian). Really, who keeps giving Jai Courtney these roles? His acting is still wooden and even if he wasn’t in this movie, it wouldn’t have made a lick of difference. The story itself is watered down to the bare essence and isn’t inspiring at all. It’s like a child got hold of a new toy, got some from his friends and decided to play “director\" and see what parts would stick if he jammed them all together. It is an instantly inconsequential movie. The effects aren’t out of this world, the music is noisy, there are a few cool scenes now and then but it isn’t enough to make you cheer at the end of the movie. As soon as the last scene ended and the credits began to roll, I was out of the hall so fast not caring if there was a mid-credit or post-credit scene. At one point I’d even gone for bathroom break knowing I wouldn’t miss anything and I didn’t. As soon as the last scene ended and the credits began to roll, I was out of the hall so fast not caring if there was a mid-credit or post-credit scene It still gives me pause why this movie has even made as much as it has at the box-office right now. It seems there truly is a disparity between critics and the general movie viewing public. If that’s the case though, then why didn’t I enjoy it? Why do I think it’s such a silly movie that the only way to enjoy it is to just have fun watching stuff being blown up and be happy about that? Is that enough? I don’t think so! I believe movies should hold themselves to a higher meaning and standard and strive to draw us in with good stories and and beautiful acting that cause us to leave the cinema hall shaking our heads in wonderment at what just happened or laughing our asses when we remember hilarious events that occurred. Jared Leto is weird as The Joker and not in a good way When I think of this movie just a couple hours after seeing it, this is what comes to mind: “Heath Ledger is by far a better Joker than Jared Leto will ever be and I believe DC has horrible taste in casting their iconic villains” Watch this movie if you must. Watch it because you are an action fan junkie and you want to see Will Smith back in action. Watch it because Margot Robbie holds her own and watch it because you are a fan of DC and a lover of all things superhuman. Other than that, keep away. You’ll forget about it the minute the curtain calls. Final Score: 3/10 ", "author": "Osasu Elaiho", "parent": ""}