{"name": "2343", "title": "The Best Year Of My Life", "sentences": [{"80ce": "The Best Year Of My Life"}, {"ed44": "What Happens When You Look Back On The Last Decade"}, {"ff00": "Here’s a picture of me when I was 16:"}, {"c218": "Dat hair though."}, {"1439": "That year, I went to England. All by myself, in a foreign country, for the first time ever away from home. I spent two weeks in a language school, parts of which looked like Hogwarts."}, {"8286": "It was the year the last Harry Potter book came out. The camp supervisors took a couple of kids into London to get their copies on release day. I missed it. One day later, one of the guides brought me one. I read it in 3 days."}, {"3e5b": "It was the best year of my life."}, {"153b": "Here’s a picture of me when I was 17:"}, {"dd27": "Come on Albert, you’re not doing it!"}, {"d019": "I went to England again to do an “internship abroad” with my best friend. For 10 days we mostly sorted cardboard boxes, ate Pizza Hut twice a day and passed out on sweets every night after a 4 hour Family Guy & Simpsons marathon."}, {"29a6": "It was the year I got drunk for the first time and the year I madly fell in love with a girl who’d never have the same feelings for me."}, {"4fd5": "It was the best year of my life."}, {"09f7": "Here’s a picture of me when I was 18:"}, {"fb3a": "We came. We raved. We went asleep at 7 PM."}, {"82d6": "3 days after my 18th birthday, I drove my friends to the club 45 minutes away in a blizzard. We partied all night before I had to bring back all the drunkees to their homes. I was only wearing a t-shirt, because it was so hot inside the club, but outside it was freezing. The cops pulled me over for trying to “avoid a red light by making a U-turn.”"}, {"5631": "Had to pay 20 bucks for doing nothing wrong. But I could finally drive by myself."}, {"5884": "It was the best year of my life."}, {"3bcc": "Here’s a picture of me when I was 19:"}, {"6e30": "Looking sharp."}, {"15c1": "That was New Year’s Eve. I graduated high school that year. 2nd best of the school. My parents were so proud. College set me straight pretty fast though. No more resting on my laurels."}, {"7c8d": "I threw a big party at my house with all my closest friends. Two of my best friends met that way and have been besties ever since."}, {"2a7f": "It was the best year of my life."}, {"ed34": "Here’s a picture of me when I was 20:"}, {"d632": "That makes 2 people in this picture, who are having an awesome day."}, {"6788": "Note the guy waving in the back. No idea who that is. England again with two of my best friends. Finally getting a sense of style. At least a little bit."}, {"6cc5": "That year I learned how to deal with college better. I did an internship at an industrial plant. Had to start work at 7 AM every day. It was hard."}, {"b0c1": "But I met a girl during that time. I took my 10 year old cousin to see her at a horse show. She had blonde hair and the bluest eyes I’d ever seen. I almost had a heart attack looking into them. When I told her, she said she liked my eyes too. I didn’t eat for a week, that’s how full my stomach was with butterflies."}, {"6d83": "Then, she got back together with her ex-boyfriend."}, {"c010": "It was the best year of my life."}, {"e9ec": "Here’s a picture of me when I was 21:"}, {"3485": "I swear I didn’t hang around like this all the time."}, {"1c2a": "I went to the United States that year to study abroad for two semesters. There were a few other Germans and we took many trips to places like New Hampshire, Boston, Maine, Niagara Falls, Toronto, Chicago, New York, Montreal and even Mexico."}, {"1e26": "On the last night in Playa Del Carmen our dinner consisted of crisscuts, chips, oreos, muffins, donuts, more oreos, milkshakes and Hershey’s chocolate syrup."}, {"8c29": "It was the best year of my life."}, {"7877": "Here’s a picture of me when I was 22:"}, {"a2d5": "Damn sweat smudges on the GoPro. Oh well."}, {"3458": "That day I was really scared I might die. I had climbed that hill all by myself and forgotten where I’d come from. I was out of orange juice and Google maps didn’t show any paths. Thanks to the pictures I’d taken before, I found my way back."}, {"ccc4": "Before going back home to Germany, a friend invited me to travel along with him (thanks R!) and we went to Boston, Las Vegas, Arizona, Utah, Hawaii, Seattle, Alabama and ended with the Champions League finals (Dortmund vs. Bayern!) in London."}, {"90ef": "The same year I went to Sri Lanka, Japan, Korea and Australia. Met my first proper girlfriend."}, {"96ef": "It was the best year of my life."}, {"70af": "Here’s a picture of me when I was 23:"}, {"918a": "Who wouldn’t laugh in that seat?"}, {"7b12": "Yes, that’s a 560 bhp BMW M5. I interned for 6 months at BMW M that year. It was a means of procrastinating on my Bachelor’s thesis, but a pretty good one at that."}, {"89d2": "I spent the entire summer in Munich, marketing one of the coolest products on earth. I fell in love with the city and decided to move there one day."}, {"720e": "It was the best year of my life."}, {"a104": "Here’s a picture of me when I was 24:"}, {"f13c": "The calm before the productive storm."}, {"4944": "After graduating, I took a year off to try freelance and started writing. A lot. That Sunday, when I took this peaceful, 5-minute break on our back porch, I wrote a 3,000+ word blog post in one go, which ended up on a very popular productivity blog."}, {"158b": "I spent the entire year in a serious, committed relationship and figured out I really am boyfriend material (ha-ha!)."}, {"9920": "I didn’t make a lot of money, but I learned more than ever about business, being creative and work than ever before."}, {"34f4": "It was the best year of my life."}, {"98fe": "Here’s a picture of me when I was 25:"}, {"3c07": "This picture represents me so well it’s not even funny."}, {"97e6": "In 2016, I moved back to Munich. Like I said I would. Started a graduate degree after working for myself for two years. Still working alongside school. Trying to finance myself and not depend on anyone’s money."}, {"1101": "I’m single again, and I work more than ever, but I’m having so much fun, I’m not even sure it’s legal to be that excited."}, {"9bc8": "It was the best year of my life."}, {"27be": "2017 is just over a month old. I’ve reached hundreds of thousands of people with my writing in just the first few weeks of the year. Exams are rolling around the corner. I’ll turn 26 in a few days. A house song is playing on repeat as I’m writing this."}, {"8fb9": "So far, it’s the best year of my life."}, {"f08a": "Looking back on the past 10 years, I can wholeheartedly say it doesn’t matter how old you are."}, {"8efd": "If you stop waiting for life to get better and just start living, I promise you amazing things will happen. Not every day, but every so often. Where you end up in life doesn’t matter much, as long as you’re having fun on the way."}, {"b322": "Once you realize that, every year will be the best year of your life."}, {"33f4": "Think it’s smart? Hit the heart! 💙"}, {"502c": "I write more here."}, {"e4c9": "Originally published at www.quora.com."}], "child": "2343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_62343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_6", "timestamp": "Mar 21", "content": "The Best Year Of My Life What Happens When You Look Back On The Last Decade Here’s a picture of me when I was 16: Dat hair though. That year, I went to England. All by myself, in a foreign country, for the first time ever away from home. I spent two weeks in a language school, parts of which looked like Hogwarts. It was the year the last Harry Potter book came out. The camp supervisors took a couple of kids into London to get their copies on release day. I missed it. One day later, one of the guides brought me one. I read it in 3 days. It was the best year of my life. Here’s a picture of me when I was 17: Come on Albert, you’re not doing it! I went to England again to do an “internship abroad” with my best friend. For 10 days we mostly sorted cardboard boxes, ate Pizza Hut twice a day and passed out on sweets every night after a 4 hour Family Guy & Simpsons marathon. It was the year I got drunk for the first time and the year I madly fell in love with a girl who’d never have the same feelings for me. It was the best year of my life. Here’s a picture of me when I was 18: We came. We raved. We went asleep at 7 PM. 3 days after my 18th birthday, I drove my friends to the club 45 minutes away in a blizzard. We partied all night before I had to bring back all the drunkees to their homes. I was only wearing a t-shirt, because it was so hot inside the club, but outside it was freezing. The cops pulled me over for trying to “avoid a red light by making a U-turn.” Had to pay 20 bucks for doing nothing wrong. But I could finally drive by myself. It was the best year of my life. Here’s a picture of me when I was 19: Looking sharp. That was New Year’s Eve. I graduated high school that year. 2nd best of the school. My parents were so proud. College set me straight pretty fast though. No more resting on my laurels. I threw a big party at my house with all my closest friends. Two of my best friends met that way and have been besties ever since. It was the best year of my life. Here’s a picture of me when I was 20: That makes 2 people in this picture, who are having an awesome day. Note the guy waving in the back. No idea who that is. England again with two of my best friends. Finally getting a sense of style. At least a little bit. That year I learned how to deal with college better. I did an internship at an industrial plant. Had to start work at 7 AM every day. It was hard. But I met a girl during that time. I took my 10 year old cousin to see her at a horse show. She had blonde hair and the bluest eyes I’d ever seen. I almost had a heart attack looking into them. When I told her, she said she liked my eyes too. I didn’t eat for a week, that’s how full my stomach was with butterflies. Then, she got back together with her ex-boyfriend. It was the best year of my life. Here’s a picture of me when I was 21: I swear I didn’t hang around like this all the time. I went to the United States that year to study abroad for two semesters. There were a few other Germans and we took many trips to places like New Hampshire, Boston, Maine, Niagara Falls, Toronto, Chicago, New York, Montreal and even Mexico. On the last night in Playa Del Carmen our dinner consisted of crisscuts, chips, oreos, muffins, donuts, more oreos, milkshakes and Hershey’s chocolate syrup. It was the best year of my life. Here’s a picture of me when I was 22: Damn sweat smudges on the GoPro. Oh well. That day I was really scared I might die. I had climbed that hill all by myself and forgotten where I’d come from. I was out of orange juice and Google maps didn’t show any paths. Thanks to the pictures I’d taken before, I found my way back. Before going back home to Germany, a friend invited me to travel along with him (thanks R!) and we went to Boston, Las Vegas, Arizona, Utah, Hawaii, Seattle, Alabama and ended with the Champions League finals (Dortmund vs. Bayern!) in London. The same year I went to Sri Lanka, Japan, Korea and Australia. Met my first proper girlfriend. It was the best year of my life. Here’s a picture of me when I was 23: Who wouldn’t laugh in that seat? Yes, that’s a 560 bhp BMW M5. I interned for 6 months at BMW M that year. It was a means of procrastinating on my Bachelor’s thesis, but a pretty good one at that. I spent the entire summer in Munich, marketing one of the coolest products on earth. I fell in love with the city and decided to move there one day. It was the best year of my life. Here’s a picture of me when I was 24: The calm before the productive storm. After graduating, I took a year off to try freelance and started writing. A lot. That Sunday, when I took this peaceful, 5-minute break on our back porch, I wrote a 3,000+ word blog post in one go, which ended up on a very popular productivity blog. I spent the entire year in a serious, committed relationship and figured out I really am boyfriend material (ha-ha!). I didn’t make a lot of money, but I learned more than ever about business, being creative and work than ever before. It was the best year of my life. Here’s a picture of me when I was 25: This picture represents me so well it’s not even funny. In 2016, I moved back to Munich. Like I said I would. Started a graduate degree after working for myself for two years. Still working alongside school. Trying to finance myself and not depend on anyone’s money. I’m single again, and I work more than ever, but I’m having so much fun, I’m not even sure it’s legal to be that excited. It was the best year of my life. 2017 is just over a month old. I’ve reached hundreds of thousands of people with my writing in just the first few weeks of the year. Exams are rolling around the corner. I’ll turn 26 in a few days. A house song is playing on repeat as I’m writing this. So far, it’s the best year of my life. Looking back on the past 10 years, I can wholeheartedly say it doesn’t matter how old you are. If you stop waiting for life to get better and just start living, I promise you amazing things will happen. Not every day, but every so often. Where you end up in life doesn’t matter much, as long as you’re having fun on the way. Once you realize that, every year will be the best year of your life. Think it’s smart? Hit the heart! 💙 I write more here. Originally published at www.quora.com. ", "author": "Niklas Goeke", "parent": ""}