{"name": "2347", "title": "The Five Key Strategies Behind How I Coach for Permanent Behavior Change", "sentences": [{"382a": "The Five Key Strategies Behind How I Coach for Permanent Behavior Change"}, {"29eb": "Magic tactics for anyone who is interested in Psychology."}, {"10bd": "I haven’t written about the science of Coach in a long time. The behavior change strategies have improved massively since we launched."}, {"7edd": "We put these strategies into code, teach them to coaches, and I use them when I coach. But they’re all things that anyone with an interest in psychology could pick up."}, {"47b4": "The first version from 2013 (when we were called Lift) focused on a concept from BJ Fogg at Stanford called BMAT. It’s a powerful concept that still works as a base."}, {"d5f6": "BJ taught me how to teach you BMAT in under 2-minutes, so let me give you that quick lesson. I promise you’ll be smarter because of it:"}, {"1d92": "BJ describes BMAT as an equation. To get a Behavior (B), you need three things to come together: Motivation (M), Ability (A), and a Trigger (T)."}, {"aab2": "So the tracking features of Coach fill the BMAT model as follows:"}, {"4f2a": "With that model, you literally can now call yourself a behavior designer."}, {"015b": "Imagine you want to recommend ways to help your friend stop smoking. How would you apply BMAT? What’s stopping them and why are they turning to you?"}, {"7e28": "Do you need to warn them of the health risks (Motivation)? Of course not. They know this. Do you think their struggles are because nicotine is addictive? Obviously. Try tackling Ability by recommending a way to ween them off, like gum or the patch."}, {"86a6": "See? Easy. Frameworks like BMAT are (mostly) all that behavior design is about (well, plus the infinite complexity of humans)."}, {"92af": "When Coach moved into higher levels of coaching we also moved into higher levels of behavior design. Specifically, there are now live, human coaches involved and they get much more personal and specific."}, {"e70e": "All coaches coach a little bit differently, so I’m going to focus on the strategies I use."}, {"c6c8": "These are the strategies I focus on, no matter what I’m coaching for. My coaching has ranged from productivity to writing to full on leadership and executive development."}, {"0726": "#1. Momentum First."}, {"88eb": "“The greatest thing about tomorrow is I will be better than I am today.” ~ Tiger Woods (pre-scandal)."}, {"71e7": "A consistent, iterative approach always beats attempting an epic all-at-once change."}, {"0fdd": "The key concepts in building momentum are:"}, {"c77d": "One of my favorite Momentum stories is a client who came in struggling to write for 8 hours without procrastinating. He imagined 8 hours of non-stop, fully-focused writing."}, {"6a53": "However, his first exercise only addressed three minutes of time. How fast could he sit down at his desk and write one sentence."}, {"b61e": "If you can’t stay focused for one minute, what are you doing talking about focusing for 8 hours? The success story is that three minutes became two hours, which became a habit, which became a Phd."}, {"b5eb": "For this goal, the MVP was a three minutes. The cool thing is that this framework works all the way up to mega goals like starting a company: Before you have a million dollars in revenue, you need one dollar in revenue."}, {"9068": "#2. Manage Your Cognitive Budget"}, {"05ee": "When Steve Jobs dressed for the day, he reached for the top turtleneck on his stack of black turtlenecks. That was one decision saved to spend later on something more important. ~ Superhuman Cognitive Stamina"}, {"c4d0": "You have a set amount of willpower and time each day. Decide where you want to spend that budget."}, {"8599": "In the BMAT model, there are two sides to ability."}, {"8752": "One side is your skill level. That reflects your ability to do a task. Raising your skill is one way to address the BMAT concept of Ability."}, {"ba4c": "The other side of ability is the difficulty of the task. Lowering the difficulty is the other way to address BMAT’s Ability concept."}, {"1bd2": "If possible, always reduce the difficulty of a task. When it comes to conserving your cognitive budget, laziness is a virtue. Skip, simplify, automate, outsource, cheat, take short cuts. Do everything possible to make your task easier."}, {"2d0e": "That way, when you do work hard, your hard work goes toward the most important tasks."}, {"e2ca": "Imagine you have trouble getting out of bed when your alarm goes off. Most people view this as a willpower issue. Can you wake up or do you hit snooze?"}, {"d53f": "Now, imagine you simply move your alarm. Move it across the room. Now you are physically required to get out of bed to turn the alarm off. That’s cheating! You don’t have to spend any of your precious willpower debating with yourself."}, {"6785": "Many people feel obligated to battle the alarm clock. But why struggle? Instead, take the lazy way and just move the alarm."}, {"6fcd": "You can cheat through environmental design (as above), by building habits that you do automatically or by automating and outsourcing parts of your life."}, {"5dcd": "#3. Trigger Bi-modal Decision Making"}, {"8c16": "In the Daniel Kahneman book, Thinking, Fast and Slow, he describes two sides to your brain."}, {"f908": "One is fast and effortless to use. However, it’s largely driven by emotion and often subconscious and thus not even something you’re aware of. That’s your Fast system."}, {"9356": "The other is slow, effortful and fully rational. This is the part we wish was in control. This is your Slow system."}, {"6d8d": "For a more metaphorical vision, imagine a sleepy rider on top of a blundering elephant. The rider is your rational, conscious brain, waking up occasionally to do the right thing. The elephant is what’s in control the rest of the time."}, {"7587": "So the behavior design strategy here is to make decisions with both systems. Most often this means waking the rider to examine what the elephant is doing."}, {"a632": "For this reason, I often recommend Meditation as the literal practice of using your rational brain to peak in on your subconscious."}, {"467c": "For a practical case, consider using meditation to eliminate procrastination. Researchers consider procrastination to be a subconscious strategy for avoiding minor anxieties. If you could actually articulate the anxiety, you would laugh at yourself and move on. (Full explanation of using meditation to beat procrastination.)"}, {"a651": "There are lots of other ways to trigger a bi-modal decision. For example, any time you talk your problems out with someone. This is at least 50% of the job of a coach — to be a smart, engaged listener for your problems. Verbalizing a problem guarantees that you engage your rational brain."}, {"a9f2": "#4. Deliberate Practice."}, {"72b6": "High seniority. Low competency."}, {"4cd5": "The worst thing you can be called in the high-performance world is an “experienced non-expert.”"}, {"4389": "This refers to people who’ve practiced a job or skill for years, but continue to be mediocre."}, {"7c83": "This happens for two reasons."}, {"65c4": "Don’t be this person."}, {"5c2d": "The flip side is being attentive to how you practice skill development so that your practice is challenging and relevant. This is called deliberate practice."}, {"b783": "The deliberate practice strategy pairs with momentum to produce compounding results. Every day you make a small, but permanent improvement to your abilities."}, {"6865": "#5. Change frameworks."}, {"6a89": "Sometimes it’s better to be a truck"}, {"dbc4": "Because our brains are so small and weak, we are constantly simplifying the world into mental frameworks."}, {"6358": "This is the ultimate life hack. We couldn’t function without this skill."}, {"d3d7": "However, the downside to frameworks is that we often forget that our frameworks are imperfect models of the world."}, {"0e36": "A coach told me once, “The thing that got you here is now the thing that’s holding you back.”"}, {"f142": "That phrase reflects the most common pattern in executive coaching. A person succeeded based on one view of the world, but then got to a new level where that view is no longer functional."}, {"3293": "For example, many programmers stake their entire reputation on the quality of their craftsmanship. Their code works and runs fast. Eventually, these programmers will get promoted and will be surprised by a negative performance evaluation that’s focused on whether or not their well-crafted code has customers."}, {"b7a7": "If you’ve heard the Peter Principle, that people are promoted to their level of incompetence, then this is the alternative explanation. Post-promotion, people often don’t realize that their worldview needs to change."}, {"fe88": "Unfortunately, this is incredibly hard to see on your own. And it’s incredibly hard to point out to someone else."}, {"9c14": "In coaching, we call this tactic reframing and it almost always happens in the context of a story."}, {"51a3": "For example, in the case of the programmer above (I’ve met many of these), I often tell a story (full version) about a complicated project that generated polite applause from customers and a trivial project that generated a standing ovation."}, {"067b": "Technically, this story is the bi-modal decision going backward. The story explains a rational concept in terms that your emotional mind will comprehend. Doing both gives you a chance to see the world through the lens of a different framework."}, {"3ef1": "This is day #11 of a daily writing experiment. Yesterday’s post was:"}, {"f791": "How to Beat Your “Hard Equals Valuable” BiasThis is the most important product lesson I ever learned.betterhumans.coach.me"}], "child": "2347_12347_12347_1", "timestamp": "Aug 17, 2016", "content": "The Five Key Strategies Behind How I Coach for Permanent Behavior Change Magic tactics for anyone who is interested in Psychology. I haven’t written about the science of Coach in a long time. The behavior change strategies have improved massively since we launched. We put these strategies into code, teach them to coaches, and I use them when I coach. But they’re all things that anyone with an interest in psychology could pick up. The first version from 2013 (when we were called Lift) focused on a concept from BJ Fogg at Stanford called BMAT. It’s a powerful concept that still works as a base. BJ taught me how to teach you BMAT in under 2-minutes, so let me give you that quick lesson. I promise you’ll be smarter because of it: BJ describes BMAT as an equation. To get a Behavior (B), you need three things to come together: Motivation (M), Ability (A), and a Trigger (T). So the tracking features of Coach fill the BMAT model as follows: With that model, you literally can now call yourself a behavior designer. Imagine you want to recommend ways to help your friend stop smoking. How would you apply BMAT? What’s stopping them and why are they turning to you? Do you need to warn them of the health risks (Motivation)? Of course not. They know this. Do you think their struggles are because nicotine is addictive? Obviously. Try tackling Ability by recommending a way to ween them off, like gum or the patch. See? Easy. Frameworks like BMAT are (mostly) all that behavior design is about (well, plus the infinite complexity of humans). When Coach moved into higher levels of coaching we also moved into higher levels of behavior design. Specifically, there are now live, human coaches involved and they get much more personal and specific. All coaches coach a little bit differently, so I’m going to focus on the strategies I use. These are the strategies I focus on, no matter what I’m coaching for. My coaching has ranged from productivity to writing to full on leadership and executive development. #1. Momentum First. “The greatest thing about tomorrow is I will be better than I am today.” ~ Tiger Woods (pre-scandal). A consistent, iterative approach always beats attempting an epic all-at-once change. The key concepts in building momentum are: One of my favorite Momentum stories is a client who came in struggling to write for 8 hours without procrastinating. He imagined 8 hours of non-stop, fully-focused writing. However, his first exercise only addressed three minutes of time. How fast could he sit down at his desk and write one sentence. If you can’t stay focused for one minute, what are you doing talking about focusing for 8 hours? The success story is that three minutes became two hours, which became a habit, which became a Phd. For this goal, the MVP was a three minutes. The cool thing is that this framework works all the way up to mega goals like starting a company: Before you have a million dollars in revenue, you need one dollar in revenue. #2. Manage Your Cognitive Budget When Steve Jobs dressed for the day, he reached for the top turtleneck on his stack of black turtlenecks. That was one decision saved to spend later on something more important. ~ Superhuman Cognitive Stamina You have a set amount of willpower and time each day. Decide where you want to spend that budget. In the BMAT model, there are two sides to ability. One side is your skill level. That reflects your ability to do a task. Raising your skill is one way to address the BMAT concept of Ability. The other side of ability is the difficulty of the task. Lowering the difficulty is the other way to address BMAT’s Ability concept. If possible, always reduce the difficulty of a task. When it comes to conserving your cognitive budget, laziness is a virtue. Skip, simplify, automate, outsource, cheat, take short cuts. Do everything possible to make your task easier. That way, when you do work hard, your hard work goes toward the most important tasks. Imagine you have trouble getting out of bed when your alarm goes off. Most people view this as a willpower issue. Can you wake up or do you hit snooze? Now, imagine you simply move your alarm. Move it across the room. Now you are physically required to get out of bed to turn the alarm off. That’s cheating! You don’t have to spend any of your precious willpower debating with yourself. Many people feel obligated to battle the alarm clock. But why struggle? Instead, take the lazy way and just move the alarm. You can cheat through environmental design (as above), by building habits that you do automatically or by automating and outsourcing parts of your life. #3. Trigger Bi-modal Decision Making In the Daniel Kahneman book, Thinking, Fast and Slow, he describes two sides to your brain. One is fast and effortless to use. However, it’s largely driven by emotion and often subconscious and thus not even something you’re aware of. That’s your Fast system. The other is slow, effortful and fully rational. This is the part we wish was in control. This is your Slow system. For a more metaphorical vision, imagine a sleepy rider on top of a blundering elephant. The rider is your rational, conscious brain, waking up occasionally to do the right thing. The elephant is what’s in control the rest of the time. So the behavior design strategy here is to make decisions with both systems. Most often this means waking the rider to examine what the elephant is doing. For this reason, I often recommend Meditation as the literal practice of using your rational brain to peak in on your subconscious. For a practical case, consider using meditation to eliminate procrastination. Researchers consider procrastination to be a subconscious strategy for avoiding minor anxieties. If you could actually articulate the anxiety, you would laugh at yourself and move on. (Full explanation of using meditation to beat procrastination.) There are lots of other ways to trigger a bi-modal decision. For example, any time you talk your problems out with someone. This is at least 50% of the job of a coach — to be a smart, engaged listener for your problems. Verbalizing a problem guarantees that you engage your rational brain. #4. Deliberate Practice. High seniority. Low competency. The worst thing you can be called in the high-performance world is an “experienced non-expert.” This refers to people who’ve practiced a job or skill for years, but continue to be mediocre. This happens for two reasons. Don’t be this person. The flip side is being attentive to how you practice skill development so that your practice is challenging and relevant. This is called deliberate practice. The deliberate practice strategy pairs with momentum to produce compounding results. Every day you make a small, but permanent improvement to your abilities. #5. Change frameworks. Sometimes it’s better to be a truck Because our brains are so small and weak, we are constantly simplifying the world into mental frameworks. This is the ultimate life hack. We couldn’t function without this skill. However, the downside to frameworks is that we often forget that our frameworks are imperfect models of the world. A coach told me once, “The thing that got you here is now the thing that’s holding you back.” That phrase reflects the most common pattern in executive coaching. A person succeeded based on one view of the world, but then got to a new level where that view is no longer functional. For example, many programmers stake their entire reputation on the quality of their craftsmanship. Their code works and runs fast. Eventually, these programmers will get promoted and will be surprised by a negative performance evaluation that’s focused on whether or not their well-crafted code has customers. If you’ve heard the Peter Principle, that people are promoted to their level of incompetence, then this is the alternative explanation. Post-promotion, people often don’t realize that their worldview needs to change. Unfortunately, this is incredibly hard to see on your own. And it’s incredibly hard to point out to someone else. In coaching, we call this tactic reframing and it almost always happens in the context of a story. For example, in the case of the programmer above (I’ve met many of these), I often tell a story (full version) about a complicated project that generated polite applause from customers and a trivial project that generated a standing ovation. Technically, this story is the bi-modal decision going backward. The story explains a rational concept in terms that your emotional mind will comprehend. Doing both gives you a chance to see the world through the lens of a different framework. This is day #11 of a daily writing experiment. Yesterday’s post was: How to Beat Your “Hard Equals Valuable” BiasThis is the most important product lesson I ever learned.betterhumans.coach.me ", "author": "Tony Stubblebine", "parent": ""}