{"name": "2353", "title": "Bruce Lee: The Inevitability of Success", "sentences": [{"0be3": "Bruce Lee: The Inevitability of Success"}, {"2a6b": "In 1969, nobody expected a thin Asian man with a high pitched voice to become one of the most influential characters of the 20th century."}, {"d928": "Nobody knew, that is, except Bruce Lee."}, {"fe33": "That year, Bruce Lee wrote a letter to himself:"}, {"1ca3": "My Definite Chief Aim"}, {"abce": "I, Bruce Lee, will be the first highest paid Oriental super star in the United States. In return I will give the most exciting performances and render the best of quality in the capacity of an actor. Starting 1970 I will achieve world fame and from then onward till the end of 1980 I will have in my possession $10,000,000. I will live the way I please and achieve inner harmony and happiness."}, {"744b": "Bruce LeeJan. 1969"}, {"f0f4": "Four years later, he was dead."}, {"29a9": "But in those four years, Bruce achieved everything he said he would and more. At 32 years of age, he had already changed the face of film and martial arts forever."}, {"b22b": "Bruce’s letter is overflowing with confidence. But where did this confidence come from?"}, {"679f": "We may never know the whole answer, but Bruce’s writings — collected in books like Letters of the Dragon and Striking Thoughts — give us a clue."}, {"e79e": "In particular, let’s take a look at a letter written by Bruce Lee over a decade before his death, when he was still a 21-year-old student at the University of Washington."}, {"4a7c": "As you read, try to hold an image in your mind of letter from a typical 21-year-old…"}, {"7a5e": "Dear Pearl,"}, {"387d": "This letter is hard to understand. It contains my dreams and my ways of thinking, as a whole, you can call it my way of life. It will be rather confusing as it is difficult to write down exactly how I feel. Yet I want to write and let you know about it. I’ll do my best to write it clearly and I hope that you, too, will keep an open mind in this letter, and don’t arrive at any conclusions till you are finished."}, {"877b": "There are two ways of making a good living, one is the result of hard working, and the other, the result of the imagination (requires work, too, of course). It is a fact that labour and thrift produce a competence, but fortune, in the sense of wealth, is the reward of the man who can think of something that hasn’t been thought of before. In every industry, in every profession, ideas are what America is looking for. Ideas have made America what she is, and one good idea will make a man what he wants to be."}, {"39a8": "One part of my life is gung fu. This art influences me greatly in the formation of my character and ideas. I practice gung fu as a physical culture, a form of mental training, a method of self-defense, and a way of life. Gung fu is the best of all martial art; yet the Chinese derivatives of judo and karate, which are only basics of gung fu, are flourishing all over the U.S. This so happens because no one has heard of this supreme art; also there are no competent instructors… I believe my long years of practice back up my title to become the first instructor of this movement. There are yet long years ahead of me to polish my techniques and character. My aim, therefore, is to establish a first Gung Fu Institute that will later spread out all over the U.S. (I have set up a time limit of 10 to 15 years to complete the whole project). My reason in doing this is not the sole objective of making money. The motives are many and among them are: I like to let the world know about the greatness of this Chinese art; I enjoy teaching and helping people; I like to have a well-to-do home for my family; I like to originate something; and the last but yet one of the important is because gung fu is part of myself."}, {"51fc": "I know my idea is right, and therefore the results would be satisfactory. I don’t really worry about the reward, but to set in motion the machinery to achieve it. My contribution will be the measure of my reward and success."}, {"12c7": "Before he passed away, some asked the late Dr Charles P. Steimetz, the electrical genius, in his opinion “What branch of science would make the most progress in the next twenty-five years?” He paused and thought for several minutes then like a flash replied, “spiritual realisation.” When a man comes to a conscious vital realisation of those great spiritual forces within himself and begins to use those forces in science, in business and in life, his progress in the future will be unparalleled."}, {"26a1": "I feel I have this great creative and spiritual force within me that is greater than faith, greater than ambition, greater than confidence, greater than determination, greater than vision. It is all these combined. My brain becomes magnetized with this domination force which I hold in my hand."}, {"0c4a": "When you drop a pebble into a pool of water, the pebble starts a series of ripples that expand until they encompass the whole pool. This is exactly what will happen when I give my ideas a definite plan of action. Right now, I can project my thoughts into the future, I can see ahead of me. I dream (remember that practical dreamers never quit). I may now own nothing but a little place down in basement, but once my imagination has got up to a full head of steam, I can see painted on a canvas of my mind a picture of a fine, big five or six storey Gung Fu Institute with branches all over the States. I am not easily discouraged, readily visualize myself as overcoming obstacles, winning out over setbacks, achieving “impossible” objectives."}, {"c049": "Whether it is the God-head or not, I feel this great force, this unstopped power, this dynamic something within me. This feeling defies description, and [there is] no experience with which this feeling may be compared. It is something like a strong emotion mixed with faith, but a lot stronger."}, {"6d2c": "All in all, the goal of my planning and doing is to find the true meaning in life — peace of mind. I know that the sum of all the possessions I mentioned does not necessarily add up to peace of mind; however, it can be if I devote [my energy] to real accomplishment of self rather than neurotic combat. In order to achieve this peace of mind, the teaching of detachment of Taoism and Zen proved to be valuable…."}, {"3ce1": "Probably, people will say I’m too conscious of success. Well, I am not. You see, my will to do springs from the knowledge that I CAN DO. I’m only being natural, for there is no fear or doubt inside my mind."}, {"4f34": "Pearl, success comes to those who become success-conscious. If you don’t aim at an object, how the heck on earth do you think you can get it?’"}, {"7f20": "Warm regards,Bruce"}, {"bb4a": "Wow."}, {"b3a7": "There’s a lot to highlight here, but here’s what stood out the most to me:"}, {"4178": "You always hear people say that your belief defines the limits of your possibility, but talk is cheap. Bruce Lee is one of the few that lived his life walking the walk."}, {"e816": "“If you always put limit on everything you do, physical or anything else. It will spread into your work and into your life. There are no limits. There are only plateaus, and you must not stay there, you must go beyond them.”"}, {"3514": "The above letter came from Letters of the Dragon, a collection of Bruce’s letters filled with practical wisdom, philosophical ramblings and beautiful sketches of martial arts techniques."}, {"7f5e": "Want more? Join over 16,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here."}], "child": "2353_1\t2353_2\t2353_3\t2353_4\t2353_5\t2353_6\t2353_7\t2353_8\t2353_9\t2353_10\t2353_11\t2353_12\t2353_13\t2353_14\t2353_15\t2353_16\t2353_17\t2353_18\t2353_19\t2353_20\t2353_21\t2353_22\t2353_23\t2353_24\t2353_252353_1\t2353_2\t2353_3\t2353_4\t2353_5\t2353_6\t2353_7\t2353_8\t2353_9\t2353_10\t2353_11\t2353_12\t2353_13\t2353_14\t2353_15\t2353_16\t2353_17\t2353_18\t2353_19\t2353_20\t2353_21\t2353_22\t2353_23\t2353_24\t2353_252353_1\t2353_2\t2353_3\t2353_4\t2353_5\t2353_6\t2353_7\t2353_8\t2353_9\t2353_10\t2353_11\t2353_12\t2353_13\t2353_14\t2353_15\t2353_16\t2353_17\t2353_18\t2353_19\t2353_20\t2353_21\t2353_22\t2353_23\t2353_24\t2353_25", "timestamp": "Feb 25", "content": "Bruce Lee: The Inevitability of Success In 1969, nobody expected a thin Asian man with a high pitched voice to become one of the most influential characters of the 20th century. Nobody knew, that is, except Bruce Lee. That year, Bruce Lee wrote a letter to himself: My Definite Chief Aim I, Bruce Lee, will be the first highest paid Oriental super star in the United States. In return I will give the most exciting performances and render the best of quality in the capacity of an actor. Starting 1970 I will achieve world fame and from then onward till the end of 1980 I will have in my possession $10,000,000. I will live the way I please and achieve inner harmony and happiness. Bruce LeeJan. 1969 Four years later, he was dead. But in those four years, Bruce achieved everything he said he would and more. At 32 years of age, he had already changed the face of film and martial arts forever. Bruce’s letter is overflowing with confidence. But where did this confidence come from? We may never know the whole answer, but Bruce’s writings — collected in books like Letters of the Dragon and Striking Thoughts — give us a clue. In particular, let’s take a look at a letter written by Bruce Lee over a decade before his death, when he was still a 21-year-old student at the University of Washington. As you read, try to hold an image in your mind of letter from a typical 21-year-old… Dear Pearl, This letter is hard to understand. It contains my dreams and my ways of thinking, as a whole, you can call it my way of life. It will be rather confusing as it is difficult to write down exactly how I feel. Yet I want to write and let you know about it. I’ll do my best to write it clearly and I hope that you, too, will keep an open mind in this letter, and don’t arrive at any conclusions till you are finished. There are two ways of making a good living, one is the result of hard working, and the other, the result of the imagination (requires work, too, of course). It is a fact that labour and thrift produce a competence, but fortune, in the sense of wealth, is the reward of the man who can think of something that hasn’t been thought of before. In every industry, in every profession, ideas are what America is looking for. Ideas have made America what she is, and one good idea will make a man what he wants to be. One part of my life is gung fu. This art influences me greatly in the formation of my character and ideas. I practice gung fu as a physical culture, a form of mental training, a method of self-defense, and a way of life. Gung fu is the best of all martial art; yet the Chinese derivatives of judo and karate, which are only basics of gung fu, are flourishing all over the U.S. This so happens because no one has heard of this supreme art; also there are no competent instructors… I believe my long years of practice back up my title to become the first instructor of this movement. There are yet long years ahead of me to polish my techniques and character. My aim, therefore, is to establish a first Gung Fu Institute that will later spread out all over the U.S. (I have set up a time limit of 10 to 15 years to complete the whole project). My reason in doing this is not the sole objective of making money. The motives are many and among them are: I like to let the world know about the greatness of this Chinese art; I enjoy teaching and helping people; I like to have a well-to-do home for my family; I like to originate something; and the last but yet one of the important is because gung fu is part of myself. I know my idea is right, and therefore the results would be satisfactory. I don’t really worry about the reward, but to set in motion the machinery to achieve it. My contribution will be the measure of my reward and success. Before he passed away, some asked the late Dr Charles P. Steimetz, the electrical genius, in his opinion “What branch of science would make the most progress in the next twenty-five years?” He paused and thought for several minutes then like a flash replied, “spiritual realisation.” When a man comes to a conscious vital realisation of those great spiritual forces within himself and begins to use those forces in science, in business and in life, his progress in the future will be unparalleled. I feel I have this great creative and spiritual force within me that is greater than faith, greater than ambition, greater than confidence, greater than determination, greater than vision. It is all these combined. My brain becomes magnetized with this domination force which I hold in my hand. When you drop a pebble into a pool of water, the pebble starts a series of ripples that expand until they encompass the whole pool. This is exactly what will happen when I give my ideas a definite plan of action. Right now, I can project my thoughts into the future, I can see ahead of me. I dream (remember that practical dreamers never quit). I may now own nothing but a little place down in basement, but once my imagination has got up to a full head of steam, I can see painted on a canvas of my mind a picture of a fine, big five or six storey Gung Fu Institute with branches all over the States. I am not easily discouraged, readily visualize myself as overcoming obstacles, winning out over setbacks, achieving “impossible” objectives. Whether it is the God-head or not, I feel this great force, this unstopped power, this dynamic something within me. This feeling defies description, and [there is] no experience with which this feeling may be compared. It is something like a strong emotion mixed with faith, but a lot stronger. All in all, the goal of my planning and doing is to find the true meaning in life — peace of mind. I know that the sum of all the possessions I mentioned does not necessarily add up to peace of mind; however, it can be if I devote [my energy] to real accomplishment of self rather than neurotic combat. In order to achieve this peace of mind, the teaching of detachment of Taoism and Zen proved to be valuable…. Probably, people will say I’m too conscious of success. Well, I am not. You see, my will to do springs from the knowledge that I CAN DO. I’m only being natural, for there is no fear or doubt inside my mind. Pearl, success comes to those who become success-conscious. If you don’t aim at an object, how the heck on earth do you think you can get it?’ Warm regards,Bruce Wow. There’s a lot to highlight here, but here’s what stood out the most to me: You always hear people say that your belief defines the limits of your possibility, but talk is cheap. Bruce Lee is one of the few that lived his life walking the walk. “If you always put limit on everything you do, physical or anything else. It will spread into your work and into your life. There are no limits. There are only plateaus, and you must not stay there, you must go beyond them.” The above letter came from Letters of the Dragon, a collection of Bruce’s letters filled with practical wisdom, philosophical ramblings and beautiful sketches of martial arts techniques. Want more? Join over 16,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here. ", "author": "Charles Chu", "parent": ""}