{"name": "2354", "title": "How to Sell Anything: Aristotle and the Ancient Art of Persuasion", "sentences": [{"cafe": "How to Sell Anything: Aristotle and the Ancient Art of Persuasion"}, {"a3c9": "During a few short weeks in 1952, a man named Mortimer J. Adler sold a million dollars worth of books."}, {"8fab": "Not that he wanted to sell that many books. He kind of had to."}, {"4711": "Today, Adler is best known for his bestselling How to Read a Book. But in 1952, he was working on Great Books of the Western World — a 54-volume set of essentials for a liberal education."}, {"95e5": "The set was almost ready for release, but there was a slight problem: Adler’s publisher didn’t have enough money to print to the first edition."}, {"c3c7": "Adler leaped to action. He immediately drafted a letter, sending it to 1000 potential clients. A few weeks later, he received 250 checks in the mail. Each check was worth $4500 in today’s dollars."}, {"1d1d": "Without context, it’s hard to appreciate how incredible this was."}, {"a063": "In direct mail advertising, the standard response rate is 2%. Yet, Adler somehow managed to get over 10 times that."}, {"9420": "How did some pudgy philosopher with glasses manage to outsell some of the best marketers of the generation?"}, {"9dc1": "Well, if you think about it, sales is about persuasion, and persuasion is — at its core — about human nature."}, {"6cc6": "If there’s one thing a philosopher must understand, it is human nature."}, {"c35d": "Here’s an excerpt from How to Speak How to Listen, where Adler connects salesmanship (persuasion) to the philosophy of Aristotle:"}, {"1cc9": "“Aristotle is the master of that art — the art of persuasion — about which he wrote a lengthy treatise entitled Rhetoric. To boil down its essential message […] Aristotle pointed out three main tactics to be employed if one wished to succeed in the business of persuasion. There are no better names for these three main instruments of persuasion than the words the Greeks used for them: ethos, pathos and logos.”"}, {"f843": "These days, internet marketers offer “sales secrets” at ridiculous prices, but there’s nothing new under the sun."}, {"7a68": "Marketers today use the same principles of ethos, pathos and logos that Aristotle figured out over 2000 years ago."}, {"68dc": "Let’s take a look."}, {"634f": "-Ethos-"}, {"b2a3": "Remember those terrible essays you wrote in elementary school?"}, {"dcca": "Mine started like this:"}, {"0344": "I like cats. I think you should like cats too. There are three reasons why I like cats. First, cats are cute. Second…"}, {"5804": "Okay, I’ll stop before you fall asleep."}, {"9e94": "Essays are often written to persuade. Despite what Ms. Wormwood taught you in grade four, the worst possible way to persuade someone is to start with a logical argument."}, {"c2ed": "Instead, Adler says we should start with ethos:"}, {"cd17": "“Of the three factors in persuasion — ethos, pathos, and logos — ethos should always come first.”"}, {"2955": "In greek, ethos means “character.” But in the context of persuasion, what it really means is: show you are trustworthy. To persuade someone, we need to prove we are worth listening to."}, {"a624": "Some ways to do this:"}, {"ff73": "For a modern example, here’s an email signup page from Ramit Sethi, an internet marketer:"}, {"f826": "You can see how Rmit slips ethos into the page, citing sources to “prove” he is trustworthy. If you get his emails (which sell expensive courses), you’ll notice he tells stories about successful clients."}, {"f92a": "Once trust is in place, the next step is pathos."}, {"cb2b": "-Pathos-"}, {"f69a": "After you establish credibility via ethos, the next step in persuasion is to incite the emotions."}, {"919e": "Here’s Adler again in How to Speak How to Listen:"}, {"8565": "“Pathos consists in arousing the passions of the listeners, getting their emotions running in the direction of the action to be taken. […] Reasons and arguments may be used to reinforce the drive of the passions, but [they] have no force at all unless your listeners are already disposed emotionally to move in the direction that your reasons and arguments try to justify."}, {"0bf2": "Humans are emotional creatures."}, {"6602": "We like to think we are rational, but what we actually do is crave something and then make up reasons to support our actions."}, {"9b84": "Again, let’s look at that same page from Ramit:"}, {"0b48": "Notice the words and phrases that Ramit uses to trigger our emotions: Rich. More money. Bonus. Free. Insider Kit. Access."}, {"82e9": "If you’re like me, you might’ve seen the page and started to think: Oh my god, I’m gonna miss out on something valuable if I don’t sign up. It’s just my email address anyway. How much could it hurt?"}, {"7d08": "Of course, that’s exactly how Ramit wants you to feel."}, {"d5f8": "Finally, after ethos and pathos, is logos."}, {"7af4": "-Logos-"}, {"3c7a": "“Few things are as destructive and limiting as a worldview that assumes people are mostly rational.” -Scott Adams"}, {"429a": "By now, I hope it’s clear why logos (logic) is the least important of the three factors in persuasion."}, {"b460": "For the last time, let’s look at the same page from Ramit. I highlighted every logical argument on his page…"}, {"510c": "…there aren’t any."}, {"d554": "You don’t need logic to make people take action."}, {"e619": "Logos is seasoning on the steak. It makes it taste better, but it’s not a necessity."}, {"908c": "Persuasion and salesmanship get a bad reputation. We associate it with liars, cheats and the ugly side of capitalism."}, {"43e1": "But this isn’t always the case."}, {"80d9": "Persuasion is a tool, and tools are amoral."}, {"0217": "Whether you’re a freelancer trying to convince a client that you are worth what you charge or just a human trying to convince a family member to make a much-needed lifestyle change, persuasion is on your side."}, {"ff78": "Many of the quotes in this article came from Adler’s How to Speak How to Listen."}, {"7f5e": "Want more? Join over 16,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here."}], "child": "2354_1\t2354_2\t2354_3\t2354_4\t2354_5\t2354_6\t2354_7\t2354_8\t2354_9\t2354_10\t2354_11\t2354_122354_1\t2354_2\t2354_3\t2354_4\t2354_5\t2354_6\t2354_7\t2354_8\t2354_9\t2354_10\t2354_11\t2354_12", "timestamp": "Feb 25", "content": "How to Sell Anything: Aristotle and the Ancient Art of Persuasion During a few short weeks in 1952, a man named Mortimer J. Adler sold a million dollars worth of books. Not that he wanted to sell that many books. He kind of had to. Today, Adler is best known for his bestselling How to Read a Book. But in 1952, he was working on Great Books of the Western World — a 54-volume set of essentials for a liberal education. The set was almost ready for release, but there was a slight problem: Adler’s publisher didn’t have enough money to print to the first edition. Adler leaped to action. He immediately drafted a letter, sending it to 1000 potential clients. A few weeks later, he received 250 checks in the mail. Each check was worth $4500 in today’s dollars. Without context, it’s hard to appreciate how incredible this was. In direct mail advertising, the standard response rate is 2%. Yet, Adler somehow managed to get over 10 times that. How did some pudgy philosopher with glasses manage to outsell some of the best marketers of the generation? Well, if you think about it, sales is about persuasion, and persuasion is — at its core — about human nature. If there’s one thing a philosopher must understand, it is human nature. Here’s an excerpt from How to Speak How to Listen, where Adler connects salesmanship (persuasion) to the philosophy of Aristotle: “Aristotle is the master of that art — the art of persuasion — about which he wrote a lengthy treatise entitled Rhetoric. To boil down its essential message […] Aristotle pointed out three main tactics to be employed if one wished to succeed in the business of persuasion. There are no better names for these three main instruments of persuasion than the words the Greeks used for them: ethos, pathos and logos.” These days, internet marketers offer “sales secrets” at ridiculous prices, but there’s nothing new under the sun. Marketers today use the same principles of ethos, pathos and logos that Aristotle figured out over 2000 years ago. Let’s take a look. -Ethos- Remember those terrible essays you wrote in elementary school? Mine started like this: I like cats. I think you should like cats too. There are three reasons why I like cats. First, cats are cute. Second… Okay, I’ll stop before you fall asleep. Essays are often written to persuade. Despite what Ms. Wormwood taught you in grade four, the worst possible way to persuade someone is to start with a logical argument. Instead, Adler says we should start with ethos: “Of the three factors in persuasion — ethos, pathos, and logos — ethos should always come first.” In greek, ethos means “character.” But in the context of persuasion, what it really means is: show you are trustworthy. To persuade someone, we need to prove we are worth listening to. Some ways to do this: For a modern example, here’s an email signup page from Ramit Sethi, an internet marketer: You can see how Rmit slips ethos into the page, citing sources to “prove” he is trustworthy. If you get his emails (which sell expensive courses), you’ll notice he tells stories about successful clients. Once trust is in place, the next step is pathos. -Pathos- After you establish credibility via ethos, the next step in persuasion is to incite the emotions. Here’s Adler again in How to Speak How to Listen: “Pathos consists in arousing the passions of the listeners, getting their emotions running in the direction of the action to be taken. […] Reasons and arguments may be used to reinforce the drive of the passions, but [they] have no force at all unless your listeners are already disposed emotionally to move in the direction that your reasons and arguments try to justify. Humans are emotional creatures. We like to think we are rational, but what we actually do is crave something and then make up reasons to support our actions. Again, let’s look at that same page from Ramit: Notice the words and phrases that Ramit uses to trigger our emotions: Rich. More money. Bonus. Free. Insider Kit. Access. If you’re like me, you might’ve seen the page and started to think: Oh my god, I’m gonna miss out on something valuable if I don’t sign up. It’s just my email address anyway. How much could it hurt? Of course, that’s exactly how Ramit wants you to feel. Finally, after ethos and pathos, is logos. -Logos- “Few things are as destructive and limiting as a worldview that assumes people are mostly rational.” -Scott Adams By now, I hope it’s clear why logos (logic) is the least important of the three factors in persuasion. For the last time, let’s look at the same page from Ramit. I highlighted every logical argument on his page… …there aren’t any. You don’t need logic to make people take action. Logos is seasoning on the steak. It makes it taste better, but it’s not a necessity. Persuasion and salesmanship get a bad reputation. We associate it with liars, cheats and the ugly side of capitalism. But this isn’t always the case. Persuasion is a tool, and tools are amoral. Whether you’re a freelancer trying to convince a client that you are worth what you charge or just a human trying to convince a family member to make a much-needed lifestyle change, persuasion is on your side. Many of the quotes in this article came from Adler’s How to Speak How to Listen. Want more? Join over 16,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here. ", "author": "Charles Chu", "parent": ""}