{"name": "2359", "title": "We’ve Got the Achievement-Happiness Connection Backwards. Here’s How to Fix It.", "sentences": [{"8f3e": "We’ve Got the Achievement-Happiness Connection Backwards. Here’s How to Fix It."}, {"44e5": "The Founding Fathers Must Have Been Aristotle Groupies"}, {"4d38": "Happy people in a positive environment perform better than grumpy ones in a negative environment. Happiness directly impacts performance. The data is in, and it really is that simple."}, {"dab0": "But something doesn’t seem quite right. Aren’t happy people less serious? They’re so busy having fun, when do they actually have time to get any work done? Because there’s no way work is fun… that’s why it’s called work… right?"}, {"b7ae": "Happiness is the state of well-being characterized by emotions ranging from contentment to intense joy.-Siri"}, {"d6ad": "Siri’s definition sounds lovely, but there’s got to be more to it than that. The founding fathers didn’t declare life, liberty, and the pursuit of positive emotions as our inalienable rights. Certainly they meant something more than that."}, {"e854": "The founding fathers likely meant something closer to Aristotle’s definition — human flourishing, or psychologist Shawn Achor’s — the joy we feel striving after our potential, or Leo Rosten’s:"}, {"957e": "Happiness comes only when we push our brains and hearts to the farthest reaches of which we are capable.-Leo Rosten"}, {"e6d7": "Now that’s more like it. With those definitions, it’s easier to see the links between happiness and performance. Life, liberty, and the pursuit of human flourishing."}, {"4658": "Positive Emotions are Performance Enhancing Drugs"}, {"7a56": "When we experience positive emotions, our brains increase the production of dopamine and serotonin — chemicals that help us think more quickly and creatively, and improve our analytical and complex problem solving skills."}, {"7dd9": "Subjects hooked up to fMRI machines show increased activity in the pre-frontal cortex when they are in a good mood. This is the part of our brain (right behind our forehead) that separates us from other primates and allows us to do our deepest, most complex thinking."}, {"9aea": "When we experience negative pressure or stress, cortisol displaces those good chemicals, activating our amygdala — the ‘oldest’ part of our brain (just above our spinal cord) that we share with the rest of the animal kingdom — triggering a ‘fight or flight’ response."}, {"1a2a": "In some situations, ‘fight or flight’ is absolutely appropriate:We stumble across a grizzly bear on our evening stroll. Those shapes moving towards us at the end of the dark alley.The comments section of our latest social media post."}, {"d125": "When our amygdala is firing, we’re not thinking any more critically than a lizard or a puppy dog. We just don’t want to be eaten."}, {"971d": "Leaders and managers have an enormous impact on the environment that their teams walk into every day."}, {"5fd0": "They aren’t just choosing their own mood, thereby impacting their own performance — they’re setting the tone for everyone around them."}, {"5d35": "Through small choices in behaviors — choosing to thank someone for “just doing her job” or choosing to ask about how someone’s vacation or weekend was — managers send ripples through the organization."}, {"a8b0": "Ripples that really do get people thinking more deeply and creatively. And really do get people doing better work."}, {"ad92": "A study cited in Shawn Achor’s “The Happiness Advantage” found that teams with encouraging managers outperformed their peers by 31%. That’s quite a happiness advantage."}, {"af9f": "For years, we’ve had the achievement / happiness loop backwards."}, {"2aa2": "I’ll be so happy when this project is done.Once I get that promotion, I’ll finally feel like I’ve made it.Things will be so much better after I hit my numbers."}, {"bcfd": "It’s time to flip that logic. Happiness first, and the results will follow."}, {"7ad1": "If you’d like some guidance on incorporating the concepts from this post in your life or work, I’d love to help. Find me at Christopher Sowers — Coach Profile on Coach.me. You can use the promo code CHRIS11873WEEK for a free week of online coaching."}], "child": "2359_1\t2359_2\t2359_32359_1\t2359_2\t2359_32359_1\t2359_2\t2359_32359_1\t2359_2\t2359_3", "timestamp": "Feb 27", "content": "We’ve Got the Achievement-Happiness Connection Backwards. Here’s How to Fix It. The Founding Fathers Must Have Been Aristotle Groupies Happy people in a positive environment perform better than grumpy ones in a negative environment. Happiness directly impacts performance. The data is in, and it really is that simple. But something doesn’t seem quite right. Aren’t happy people less serious? They’re so busy having fun, when do they actually have time to get any work done? Because there’s no way work is fun… that’s why it’s called work… right? Happiness is the state of well-being characterized by emotions ranging from contentment to intense joy.-Siri Siri’s definition sounds lovely, but there’s got to be more to it than that. The founding fathers didn’t declare life, liberty, and the pursuit of positive emotions as our inalienable rights. Certainly they meant something more than that. The founding fathers likely meant something closer to Aristotle’s definition — human flourishing, or psychologist Shawn Achor’s — the joy we feel striving after our potential, or Leo Rosten’s: Happiness comes only when we push our brains and hearts to the farthest reaches of which we are capable.-Leo Rosten Now that’s more like it. With those definitions, it’s easier to see the links between happiness and performance. Life, liberty, and the pursuit of human flourishing. Positive Emotions are Performance Enhancing Drugs When we experience positive emotions, our brains increase the production of dopamine and serotonin — chemicals that help us think more quickly and creatively, and improve our analytical and complex problem solving skills. Subjects hooked up to fMRI machines show increased activity in the pre-frontal cortex when they are in a good mood. This is the part of our brain (right behind our forehead) that separates us from other primates and allows us to do our deepest, most complex thinking. When we experience negative pressure or stress, cortisol displaces those good chemicals, activating our amygdala — the ‘oldest’ part of our brain (just above our spinal cord) that we share with the rest of the animal kingdom — triggering a ‘fight or flight’ response. In some situations, ‘fight or flight’ is absolutely appropriate:We stumble across a grizzly bear on our evening stroll. Those shapes moving towards us at the end of the dark alley.The comments section of our latest social media post. When our amygdala is firing, we’re not thinking any more critically than a lizard or a puppy dog. We just don’t want to be eaten. Leaders and managers have an enormous impact on the environment that their teams walk into every day. They aren’t just choosing their own mood, thereby impacting their own performance — they’re setting the tone for everyone around them. Through small choices in behaviors — choosing to thank someone for “just doing her job” or choosing to ask about how someone’s vacation or weekend was — managers send ripples through the organization. Ripples that really do get people thinking more deeply and creatively. And really do get people doing better work. A study cited in Shawn Achor’s “The Happiness Advantage” found that teams with encouraging managers outperformed their peers by 31%. That’s quite a happiness advantage. For years, we’ve had the achievement / happiness loop backwards. I’ll be so happy when this project is done.Once I get that promotion, I’ll finally feel like I’ve made it.Things will be so much better after I hit my numbers. It’s time to flip that logic. Happiness first, and the results will follow. If you’d like some guidance on incorporating the concepts from this post in your life or work, I’d love to help. Find me at Christopher Sowers — Coach Profile on Coach.me. You can use the promo code CHRIS11873WEEK for a free week of online coaching. ", "author": "Christopher Sowers", "parent": ""}