{"name": "2361", "title": "Get Better Results By Being a Little Bit Behind", "sentences": [{"25f7": "Get Better Results By Being a Little Bit Behind"}, {"43f0": "There’s a sweet spot for how much effort we’ll expend, and it depends on the competition and context. Too far behind, and we give up. Without hope of catching up, we stop trying. Too far ahead, and we go on cruise control. Even just slightly ahead, there’s risk of complacency. The sweet spot is where we’re just a little bit behind. Trailing, but close enough that with a bit of additional effort, we can catch up. We can see the leaders, and they aren’t out of reach."}, {"4091": "Berger & Pope, “Can Losing Lead to Winning?” Management Science, May 2011"}, {"bd66": "Researchers at The Wharton School and The University of Chicago have studied effort and motivation in this context. They analyzed over 18,000 professional basketball games, and found that teams who trail at halftime by one point win more often than teams that lead by one point. Similarly, the data in the included chart show that participants in a typing contest who were told they were “slightly behind” increased their speed in the next round more than any of the other groups."}, {"d79c": "In his book “Talent is Overrated,” Geoff Colvin applies similar findings to how we learn and grow. We spend our time in one of three zones — (1) the Comfort Zone, where activities come naturally and easily, (2) the Learning Zone, where we engage in skills that are just out of reach, and (3) the Panic Zone, where activities are so difficult that we don’t even know where to begin. For growth and development, it’s easy to see where we should spend our time."}, {"dcf3": "We don’t have to look very hard to find things that we’re a little bit behind on. At work, we ignore the things that are going well and meeting objectives and focus our attention on the projects and people that are a little bit (or even way) behind."}, {"c7e7": "You can get better results by focusing your message. Frame the problem such that the solution/goal is within striking distance. You’re behind, but the recovery plan is achievable with that little bit of extra effort. You’re one point down at halftime, not 20. Put yourself and the people around you in the Learning Zone, and steer clear of the Panic Zone."}, {"6e8f": "Some tips for staying in the Learning Zone:"}, {"4542": "If you’d like some guidance on incorporating the concepts from this post in your life or work, I’d love to help. Find me at Christopher Sowers — Coach Profile on Coach.me. You can use the promo code CHRIS11873WEEK for a free week of online coaching."}], "child": "2361_12361_1", "timestamp": "Jan 13", "content": "Get Better Results By Being a Little Bit Behind There’s a sweet spot for how much effort we’ll expend, and it depends on the competition and context. Too far behind, and we give up. Without hope of catching up, we stop trying. Too far ahead, and we go on cruise control. Even just slightly ahead, there’s risk of complacency. The sweet spot is where we’re just a little bit behind. Trailing, but close enough that with a bit of additional effort, we can catch up. We can see the leaders, and they aren’t out of reach. Berger & Pope, “Can Losing Lead to Winning?” Management Science, May 2011 Researchers at The Wharton School and The University of Chicago have studied effort and motivation in this context. They analyzed over 18,000 professional basketball games, and found that teams who trail at halftime by one point win more often than teams that lead by one point. Similarly, the data in the included chart show that participants in a typing contest who were told they were “slightly behind” increased their speed in the next round more than any of the other groups. In his book “Talent is Overrated,” Geoff Colvin applies similar findings to how we learn and grow. We spend our time in one of three zones — (1) the Comfort Zone, where activities come naturally and easily, (2) the Learning Zone, where we engage in skills that are just out of reach, and (3) the Panic Zone, where activities are so difficult that we don’t even know where to begin. For growth and development, it’s easy to see where we should spend our time. We don’t have to look very hard to find things that we’re a little bit behind on. At work, we ignore the things that are going well and meeting objectives and focus our attention on the projects and people that are a little bit (or even way) behind. You can get better results by focusing your message. Frame the problem such that the solution/goal is within striking distance. You’re behind, but the recovery plan is achievable with that little bit of extra effort. You’re one point down at halftime, not 20. Put yourself and the people around you in the Learning Zone, and steer clear of the Panic Zone. Some tips for staying in the Learning Zone: If you’d like some guidance on incorporating the concepts from this post in your life or work, I’d love to help. Find me at Christopher Sowers — Coach Profile on Coach.me. You can use the promo code CHRIS11873WEEK for a free week of online coaching. ", "author": "Christopher Sowers", "parent": ""}