{"timestamp": "Apr 11", "child": "2391_1\t2391_2", "title": "Startup: Apakah Semua Sama?", "content": "Startup: Apakah Semua Sama? Disclaimer : Segala sesuatu yang saya katakan mungkin akan lebih megarah kepada pemikiran subjektif, dan saya tidak sedang mencari pembenaran, tetapi kebenaran. Silahkan berikan komentar di bawah, jika ada yang kurang sesuai untuk kita cari kebenarannya. Introduction Beberapa waktu yang lalu, saya sempat mengalami pergumulan tentang bagaimana Startup saya, NED Studio, seharusnya bekerja, berjalan ataupun beroperasi. Bagaimana kami seharusnya mendefinisikan nilai jual (value) startup kami, bagaimana seharusnya mengembangkam nilai(value) startup kami, bersamaan dengan bertahan hidup. Dan beberapa pandangan yang sering membuat saya “galau” adalah ketika seseorang mengatakan “liat startup X, mereka begini” atau “contohlah startup X, dia bisa memperoleh uang”. Saya secara subjectif tidak ingin meniru mereka, tetapi saya tidak mampu menjelaskan dengan objektif. Dan akhirnya saya mencoba mempelajari beberapa startup dengan jalan yang mereka tempuh dan bagaimana hal tersebut relevan terhadap startup dan mimpi kami. Dan salah satu hal utama yang saya temukan adalah prinsip dasar tentang apa yang diinginkan founder terhadap startupnya sehingga ia membentuk sebuah startup yang dijelaskan Steve Blank dengan judul “Six Types of Startup” Jenis Startup Steve Blank, dalam penjelasan di video youtube, Customer Development: Second Decade, menjelaskan bahwa terdapat 6 jenis Startup yaitu: 1. Lifestyle Startup Lifestyle Startup adalah startup yang dibentuk untuk menghidupi atau menjiwai atau menikmati passion dari founder-nya. Kata kunci untuk jenis ini adalah “live founders passion”. 2. Social Startup Social Startup adalah startup yang dibentuk untuk mengubah dunia menjadi lebih baik. Kata kunci untuk jenis ini adalah “make the world better”. 3. Small-Business Startup Small-Business Startup adalah startup yang dibentuk untuk mencukupi kehidupan keluarga. Kata kunci untuk jenis ini adalah “feed the familty”. 4. Buyable Startup Buyable Startup adalah startup yang dibentuk untuk dijual kepada perusahaan yang lebih besar. Kata kunci untuk jenis ini adalah “acquired by other company”. 5. Scalable Startup Scalable Startup adalah startup yang dibentuk untuk benar-benar menjadi perusahaan besar atau raksasa. Kata kunci untuk jenis ini adalah “born to be big”. Real Impact Dalam implementasi nyatanya, hal ini penting sebagai fondasi dasar untuk mengambilan keputusan. Hal tersebut adalah level subjektif dari founder tentang bagaimana menjalankan startupnya yang selanjutnya berhubungan dengan kesiapan untuk menangung konsekuensinya. Dan untuk memberi gambaran lebih jelas, saya berikan contoh berikut ini : Saya rasa Anda mengerti tentang kata “Tentu tidak” yang saya maksud adalah secara prinsip. Hal tersebut saya katakan tanpa memperhatikan faktor lain karena faktor lain tersebut terlalu luas untuk dibahas di sini. Hahaha :P Hal di atas adalah contoh kecil dari bagaimana pengambilan keputusan itu sangat dipengaruhi oleh “Apa yang founder inginkan sehinga dia membangun startup” atau jika mengunakan bahasa formal adalah “Apa Visi dari Startup tersebut”. Oleh karena itu, jika Anda sampai pada titik mengalami “ke-galau-an” seperti saya di atas, coba Anda mendalami lebih dalam tentang founder dan visi startup Anda. Hal ini untuk melihat keinginan dan kesiapan founder Anda. Jika kamu tahu apa perbedaanmu dengan orang lain, maka kamu akan tahu apa yang harus kamu tiru atau tidak dari orang lain. ", "sentences": [{"c460": "Startup: Apakah Semua Sama?"}, {"2ac6": "Disclaimer : Segala sesuatu yang saya katakan mungkin akan lebih megarah kepada pemikiran subjektif, dan saya tidak sedang mencari pembenaran, tetapi kebenaran. Silahkan berikan komentar di bawah, jika ada yang kurang sesuai untuk kita cari kebenarannya."}, {"a026": "Introduction"}, {"7370": "Beberapa waktu yang lalu, saya sempat mengalami pergumulan tentang bagaimana Startup saya, NED Studio, seharusnya bekerja, berjalan ataupun beroperasi. Bagaimana kami seharusnya mendefinisikan nilai jual (value) startup kami, bagaimana seharusnya mengembangkam nilai(value) startup kami, bersamaan dengan bertahan hidup. Dan beberapa pandangan yang sering membuat saya “galau” adalah ketika seseorang mengatakan “liat startup X, mereka begini” atau “contohlah startup X, dia bisa memperoleh uang”. Saya secara subjectif tidak ingin meniru mereka, tetapi saya tidak mampu menjelaskan dengan objektif. Dan akhirnya saya mencoba mempelajari beberapa startup dengan jalan yang mereka tempuh dan bagaimana hal tersebut relevan terhadap startup dan mimpi kami. Dan salah satu hal utama yang saya temukan adalah prinsip dasar tentang apa yang diinginkan founder terhadap startupnya sehingga ia membentuk sebuah startup yang dijelaskan Steve Blank dengan judul “Six Types of Startup”"}, {"1c4b": "Jenis Startup"}, {"b0d1": "Steve Blank, dalam penjelasan di video youtube, Customer Development: Second Decade, menjelaskan bahwa terdapat 6 jenis Startup yaitu:"}, {"8340": "1. Lifestyle Startup"}, {"acf0": "Lifestyle Startup adalah startup yang dibentuk untuk menghidupi atau menjiwai atau menikmati passion dari founder-nya. Kata kunci untuk jenis ini adalah “live founders passion”."}, {"ca12": "2. Social Startup"}, {"3afa": "Social Startup adalah startup yang dibentuk untuk mengubah dunia menjadi lebih baik. Kata kunci untuk jenis ini adalah “make the world better”."}, {"82ce": "3. Small-Business Startup"}, {"64d4": "Small-Business Startup adalah startup yang dibentuk untuk mencukupi kehidupan keluarga. Kata kunci untuk jenis ini adalah “feed the familty”."}, {"9c5a": "4. Buyable Startup"}, {"5a53": "Buyable Startup adalah startup yang dibentuk untuk dijual kepada perusahaan yang lebih besar. Kata kunci untuk jenis ini adalah “acquired by other company”."}, {"6483": "5. Scalable Startup"}, {"8caa": "Scalable Startup adalah startup yang dibentuk untuk benar-benar menjadi perusahaan besar atau raksasa. Kata kunci untuk jenis ini adalah “born to be big”."}, {"5db7": "Real Impact"}, {"fcbb": "Dalam implementasi nyatanya, hal ini penting sebagai fondasi dasar untuk mengambilan keputusan. Hal tersebut adalah level subjektif dari founder tentang bagaimana menjalankan startupnya yang selanjutnya berhubungan dengan kesiapan untuk menangung konsekuensinya. Dan untuk memberi gambaran lebih jelas, saya berikan contoh berikut ini :"}, {"bcc5": "Saya rasa Anda mengerti tentang kata “Tentu tidak” yang saya maksud adalah secara prinsip. Hal tersebut saya katakan tanpa memperhatikan faktor lain karena faktor lain tersebut terlalu luas untuk dibahas di sini. Hahaha :P"}, {"36fc": "Hal di atas adalah contoh kecil dari bagaimana pengambilan keputusan itu sangat dipengaruhi oleh “Apa yang founder inginkan sehinga dia membangun startup” atau jika mengunakan bahasa formal adalah “Apa Visi dari Startup tersebut”."}, {"81ae": "Oleh karena itu, jika Anda sampai pada titik mengalami “ke-galau-an” seperti saya di atas, coba Anda mendalami lebih dalam tentang founder dan visi startup Anda. Hal ini untuk melihat keinginan dan kesiapan founder Anda."}, {"e088": "Jika kamu tahu apa perbedaanmu dengan orang lain, maka kamu akan tahu apa yang harus kamu tiru atau tidak dari orang lain."}], "author": "Leo Pripos Marbun", "name": "2391", "parent": ""}