{"timestamp": "Oct 11, 2016", "child": "2400_1\t2400_2\t2400_3\t2400_4\t2400_5\t2400_6\t2400_7\t2400_8\t2400_9\t2400_10\t2400_11\t2400_12\t2400_13\t2400_14\t2400_15\t2400_16\t2400_17\t2400_18\t2400_19\t2400_20\t2400_21\t2400_22\t2400_23\t2400_24\t2400_25", "title": "Venture Capital is About Human Capital", "content": "Venture Capital is About Human Capital Gregg Johnson, CEO of Invoca For the first 5 years or so after I became a VC I didn’t talk much about what I thought a VC should be excellent at since frankly I wasn’t sure. I was mostly doing my job and trying to figure out how to be better every day. After a decade on the job I’ve started to speak more openly when newer industry colleagues now ask me what I’ve learned. The number one advice I give is “stop trying to be too smart”. Most VCs did well academically and had enough career success that a venture firm was willing to give them an investment role or they were able to raise their own fund. It’s easy to think the role of a VC is to have strong opinions about markets, trends, tech dynamics and so forth. We think we’re supposed to act smart and have insights that others don’t possess. I don’t think this is the job. Entrepreneurs are supposed to have insights that others don’t have and we’re supposed to be good judges about which entrepreneurs and executives have both the most clever ideas and the right skill sets to do transformational things against all odds. So I tell people we’re fundamentally in the people business. Our core skill is being able to identify talent and how to persuade the most talented people with whom we have access that we would be valuable to work with. We then help surround founders with other talent who want to join important causes but don’t have the startup idea themselves. We help founders through difficult moments, we help coach, we act as sparring partners, we help them resolve conflicts when they’re fighting with co-founders and we help them deal with adversity as well as successes. That’s why I often say The role of VC is “chief psychologist.” We might help a management team deal with a vexing strategic question or a thorny negotiation but these are mostly tactical. The biggest difference we can make is helping support talented teams with complementary talent. Think about how profound a difference adding Sheryl Sandberg early at Facebook was to Mark Zuckerberg and knowing that he should stay in charge of product and strategy while she ran operations. Fundamentally venture capital is about human capital. The role of VC is sparring partner. The role is to challenge the thinking precisely because we get a bird’s eye view across many situations and many of us have been in the driver’s seat ourselves in our younger days. And as a VC I often cultivate relationships with the most talented people with whom I’ve worked over the years and look for opportunities to work with them again. It’s rare to find extraordinarily talented individuals who are natural leaders and who are driven to succeed and who have a passion for startups so when you do you work hard to find opportunities for them. Today I couldn’t be more delighted to tell you about one such individual — Gregg Johnson — who just left Salesforce.com after 10 years to come and be the CEO of Invoca, a company I proudly backed. Gregg and I worked together at Salesforce more than a decade ago. Gregg was a graduate of Stanford and a Wharton MBA and had worked at the consulting firm BCG so I knew he was smart and capable. But what I noticed about my time with Gregg was how quickly he turned thoughts into actions. I noticed that team members naturally gravitated to him because he was a doer more than a pontificator. And in an industry of sharp-elbows he is amongst the most likable people I know. So when I left and became a VC I stayed in close touch with Gregg and he was on my very short list to hopefully work with again one day. The rest of our team included the founding CTO of Maker Studios (Ryan Lissack) and the CEO of DataSift (Tim Barker) so we seemed to all be in good company of ex Salesforce execs looking to make a difference. But Gregg stayed and grew and took on more responsibilities and became a senior member of Salesforce’s Marketing Cloud team. I think he wanted a meaty role if he was going to leave and finally we had something compelling. Invoca has grown its enterprise customer base 550% in the past three years including major customers like Microsoft, Allstate and SunTrust. It has grown recurring revenue by more than 500% and deal-size by 276%. Importantly, we recently announced a $30 million financing that gives us the resources we need to build a global enterprise software company. For years I struggled to convince people that phone calls mattered. While everybody was infatuated with the “truthy” belief that in the future nobody will make calls as we all interact with AI chatbots, the volume of calls has exploded with inbound calls to businesses skyrocketing to nearly 170 billion per year over the next few years. The explosion of mobile phones has led to a boom in inbound click-to-call traffic that has proven to convert at a higher close rate and increase average-order-value over web-only sales & marketing. For some of my more skeptical portfolio companies I simply asked them to run a trial of inbound sales calls and they were shocked. For some companies it is now > 70% of the deals they’re closing and they’ve seen it as their secret weapon. Marketing departments, software partners and investors have now woken up to this opportunity. The existing Invoca team has been in place and functioning incredibly well the last few years and I’m so honored that Gregg has decided to come on board and help lead us to the next level. I have often said that “a few key people make all the difference in any company — no matter how big or small” and that is my core principle as a VC. I can try to be as smart as possible on market trends, industry dynamics and so forth. In the end I know the only true differentiator in venture capital is the company you keep. It’s the people who want to work with you. It’s the founders who are willing to let you join their boards. It’s the executives who trust you to join the early-stage startups you’ve funded. It’s the executives at bigger companies who trust you and are willing to partner with the startups you’ve backed because they know your word is good. Venture Capital is a people business. Nothing fancier. And the real talent are the teams on the field. ", "sentences": [{"527a": "Venture Capital is About Human Capital"}, {"85ba": "Gregg Johnson, CEO of Invoca"}, {"455e": "For the first 5 years or so after I became a VC I didn’t talk much about what I thought a VC should be excellent at since frankly I wasn’t sure. I was mostly doing my job and trying to figure out how to be better every day."}, {"cd65": "After a decade on the job I’ve started to speak more openly when newer industry colleagues now ask me what I’ve learned."}, {"a215": "The number one advice I give is “stop trying to be too smart”. Most VCs did well academically and had enough career success that a venture firm was willing to give them an investment role or they were able to raise their own fund. It’s easy to think the role of a VC is to have strong opinions about markets, trends, tech dynamics and so forth. We think we’re supposed to act smart and have insights that others don’t possess."}, {"42a4": "I don’t think this is the job."}, {"5ba6": "Entrepreneurs are supposed to have insights that others don’t have and we’re supposed to be good judges about which entrepreneurs and executives have both the most clever ideas and the right skill sets to do transformational things against all odds."}, {"0dd9": "So I tell people we’re fundamentally in the people business. Our core skill is being able to identify talent and how to persuade the most talented people with whom we have access that we would be valuable to work with. We then help surround founders with other talent who want to join important causes but don’t have the startup idea themselves. We help founders through difficult moments, we help coach, we act as sparring partners, we help them resolve conflicts when they’re fighting with co-founders and we help them deal with adversity as well as successes."}, {"f4d0": "That’s why I often say"}, {"0193": "The role of VC is “chief psychologist.”"}, {"f7e0": "We might help a management team deal with a vexing strategic question or a thorny negotiation but these are mostly tactical. The biggest difference we can make is helping support talented teams with complementary talent. Think about how profound a difference adding Sheryl Sandberg early at Facebook was to Mark Zuckerberg and knowing that he should stay in charge of product and strategy while she ran operations."}, {"8b23": "Fundamentally venture capital is about human capital."}, {"807d": "The role of VC is sparring partner. The role is to challenge the thinking precisely because we get a bird’s eye view across many situations and many of us have been in the driver’s seat ourselves in our younger days."}, {"937d": "And as a VC I often cultivate relationships with the most talented people with whom I’ve worked over the years and look for opportunities to work with them again. It’s rare to find extraordinarily talented individuals who are natural leaders and who are driven to succeed and who have a passion for startups so when you do you work hard to find opportunities for them."}, {"186d": "Today I couldn’t be more delighted to tell you about one such individual — Gregg Johnson — who just left Salesforce.com after 10 years to come and be the CEO of Invoca, a company I proudly backed."}, {"bc4f": "Gregg and I worked together at Salesforce more than a decade ago. Gregg was a graduate of Stanford and a Wharton MBA and had worked at the consulting firm BCG so I knew he was smart and capable. But what I noticed about my time with Gregg was how quickly he turned thoughts into actions. I noticed that team members naturally gravitated to him because he was a doer more than a pontificator. And in an industry of sharp-elbows he is amongst the most likable people I know."}, {"b5b3": "So when I left and became a VC I stayed in close touch with Gregg and he was on my very short list to hopefully work with again one day. The rest of our team included the founding CTO of Maker Studios (Ryan Lissack) and the CEO of DataSift (Tim Barker) so we seemed to all be in good company of ex Salesforce execs looking to make a difference."}, {"1bea": "But Gregg stayed and grew and took on more responsibilities and became a senior member of Salesforce’s Marketing Cloud team. I think he wanted a meaty role if he was going to leave and finally we had something compelling."}, {"9d8f": "Invoca has grown its enterprise customer base 550% in the past three years including major customers like Microsoft, Allstate and SunTrust. It has grown recurring revenue by more than 500% and deal-size by 276%. Importantly, we recently announced a $30 million financing that gives us the resources we need to build a global enterprise software company."}, {"c6b0": "For years I struggled to convince people that phone calls mattered. While everybody was infatuated with the “truthy” belief that in the future nobody will make calls as we all interact with AI chatbots, the volume of calls has exploded with inbound calls to businesses skyrocketing to nearly 170 billion per year over the next few years."}, {"c946": "The explosion of mobile phones has led to a boom in inbound click-to-call traffic that has proven to convert at a higher close rate and increase average-order-value over web-only sales & marketing. For some of my more skeptical portfolio companies I simply asked them to run a trial of inbound sales calls and they were shocked. For some companies it is now > 70% of the deals they’re closing and they’ve seen it as their secret weapon."}, {"aea1": "Marketing departments, software partners and investors have now woken up to this opportunity."}, {"4453": "The existing Invoca team has been in place and functioning incredibly well the last few years and I’m so honored that Gregg has decided to come on board and help lead us to the next level."}, {"eee8": "I have often said that “a few key people make all the difference in any company — no matter how big or small” and that is my core principle as a VC. I can try to be as smart as possible on market trends, industry dynamics and so forth."}, {"ec99": "In the end I know the only true differentiator in venture capital is the company you keep. It’s the people who want to work with you. It’s the founders who are willing to let you join their boards. It’s the executives who trust you to join the early-stage startups you’ve funded. It’s the executives at bigger companies who trust you and are willing to partner with the startups you’ve backed because they know your word is good."}, {"b4c1": "Venture Capital is a people business. Nothing fancier. And the real talent are the teams on the field."}], "author": "Mark Suster", "name": "2400", "parent": ""}