{"timestamp": "Sep 21, 2016", "child": "2401_1\t2401_2\t2401_3\t2401_4\t2401_5\t2401_6\t2401_7\t2401_8\t2401_9\t2401_10\t2401_11\t2401_12\t2401_13\t2401_14\t2401_15\t2401_16\t2401_17\t2401_18\t2401_19\t2401_20\t2401_21\t2401_22\t2401_23\t2401_24\t2401_25", "title": "Why I Backed a 24-Year-Old Trying to Assess Human Potential", "content": "Why I Backed a 24-Year-Old Trying to Assess Human Potential Today Upfront Ventures is announcing that we’ve backed Rebecca Kantar’s startup Imbellus, a company designed to assess human potential and ultimately change the way we teach children. We led a $4 million investment along with Thrive Capital, GLG and Sound Ventures. The news blogs will cover the what, how and how much but I want to focus on the “why” and try to be instructive of what I think makes for a great A-round startup. I speak a lot on college campuses and entrepreneur events and amongst the most common things I’m asked to talk about are: I have standard answers to all of these questions at least as far as my personal funding preference are concerned. Hard Problems I encourage entrepreneurs to try and tackle harder problems even if it makes fund raising more difficult and is less likely to succeed. As entrepreneurs many people are driven to solve their personal issues right in front of them, which leads a disproportionate number of founders to focus on: music, bars, restaurants, photos, etc. There is nothing wrong with focusing on these if you’re passionate but know that you have a large set of competitors and industries in which it’s hard to eke out a meaningful business. Mission Driven I also am looking for founders that are on a personal mission to solve a big problem. I know that “mission driven” sounds nebulous or some convenient definition of anything we want to fund. But really it’s something I look for. It’s actually very easy to spot when a founder has decided to focus on a concept because he or she has “spotted an opening in the market” or building a derivative business that is “Uber for X” or “Airbnb for Y” or “Dropbox for Z.” There’s nothing wrong with these businesses but as a VC you tend to see 5 similar ideas all at the same time and knowing that it’s going to just come down to who executes the best it’s hard to pull the trigger on a A-round until you have more data on who’s winning. Building any business is hard, all-consuming, frustrating and fraught with personal challenges. When a founder is “opportunity driven” it’s too easy to quit at the first bump in the road. When a founder is “mission driven” you get the sense that he or she will do whatever it takes to make an impact in the market they serve and will keep persevering whatever the startup trends of the month. 70% Team, 30% Market I also talk often about how much the team plays a critical role in my decision backing an A-round company because so much changes as a company develops. Incumbents launch products, VCs throw cash at other competitors, team members quit, the economy dips — whatever. But only truly talented entrepreneurs show the grit required to respond rapidly to a changing environment. When you think about great companies that have survived market changes or platform changes you think about Facebook, Snapchat, Uber and the like and have to respect their great ability to constantly adapt. So Why Imbellus? When I first met with Rebecca Kantar I was stunned with the wide scope of her vision for building a company. Her mission was vast: She wanted to change the way we teach children in America. But she had such concrete plans for the 10+ years that it would take to build towards her goal. She highlighted for me how we measure human potential today and it’s based on the workforce that existed post WWII where teaching rote memorization of facts — math, reading comprehension, writing, basic science, etc. - was sufficient for the jobs that existed in the industrial economy. We assessed skills by standardized tests designed to assess competency in this basic knowledge and this persisted in both the workplace interview environment as well as how we admit students into colleges. Inevitably as a society we began “teaching to the tests” and we design curricula around proficiency in these basic skills. But we of course now live in a “knowledge economy” that has to constantly adapt to changing market conditions. As leaders we intuitively know that while basic skills in math, science, reading & writing are necessary — they are not sufficient. As leaders we know that to succeed in today’s economy we need people who possess abilities to deal with large volumes of information and cut through the clutter to get to what’s important. We need leaders who can rigorously prioritize. We need leaders who can deal with a vague set of inputs and rationalize decision matrices. We need leaders who know how to accomplish feats through teamwork and collaboration. We need people who have emotional intelligence as well as actual fact-based knowledge. Fundamentally the system feels broken. We educate and train and test for a set of skills designed to succeed in 1950. Imbellus is designing systems to assess how candidates analyze information, develop ideas, make decisions and solve problems that aren’t based on rote memorization of facts. There aren’t necessarily right or wrong answers and each company may index differently for how its employees need to score across various dimensions to succeed in that particular organization or job functions. The systems they are building are adaptive and computer generated so they can’t be studied, memorized or gamed. It is a super early-stage company so over time we’ll reveal more about the methods, systems and types of assessments we’re building. But what was clear to me in backing Rebecca was that I was getting behind somebody who has unbridled ambition, is mission-driven and has a differentiated plan for how to solve a problem that we all know exists but feels intractable. Truly, in many ways, my concern was the inverse of normal business pitches. My only concern was whether we could limit Rebecca’s scope of work enough to focus on shorter-term, more tangible problems that could lead to a business before the mission. Luckily Rebecca herself is highly adaptive and was able to rigorously prioritize which problems to solve first. Invariably she would no doubt score very highly on her own assessment tests. It’s rare that I feel so inspired by one entrepreneur and his or her vision. Rebecca is truly unique and I can’t wait to see what she and her team at Imbellus deliver over the coming years. It obviously takes an entire team to build and execute against such an ambitious project. Wishing all of Team Imbellus much success in your journey. ", "sentences": [{"543c": "Why I Backed a 24-Year-Old Trying to Assess Human Potential"}, {"ebe0": "Today Upfront Ventures is announcing that we’ve backed Rebecca Kantar’s startup Imbellus, a company designed to assess human potential and ultimately change the way we teach children. We led a $4 million investment along with Thrive Capital, GLG and Sound Ventures."}, {"1c40": "The news blogs will cover the what, how and how much but I want to focus on the “why” and try to be instructive of what I think makes for a great A-round startup."}, {"3e6a": "I speak a lot on college campuses and entrepreneur events and amongst the most common things I’m asked to talk about are:"}, {"cb0f": "I have standard answers to all of these questions at least as far as my personal funding preference are concerned."}, {"2eab": "Hard Problems"}, {"e970": "I encourage entrepreneurs to try and tackle harder problems even if it makes fund raising more difficult and is less likely to succeed. As entrepreneurs many people are driven to solve their personal issues right in front of them, which leads a disproportionate number of founders to focus on: music, bars, restaurants, photos, etc."}, {"2f69": "There is nothing wrong with focusing on these if you’re passionate but know that you have a large set of competitors and industries in which it’s hard to eke out a meaningful business."}, {"47da": "Mission Driven"}, {"842c": "I also am looking for founders that are on a personal mission to solve a big problem. I know that “mission driven” sounds nebulous or some convenient definition of anything we want to fund. But really it’s something I look for. It’s actually very easy to spot when a founder has decided to focus on a concept because he or she has “spotted an opening in the market” or building a derivative business that is “Uber for X” or “Airbnb for Y” or “Dropbox for Z.”"}, {"8958": "There’s nothing wrong with these businesses but as a VC you tend to see 5 similar ideas all at the same time and knowing that it’s going to just come down to who executes the best it’s hard to pull the trigger on a A-round until you have more data on who’s winning."}, {"8fae": "Building any business is hard, all-consuming, frustrating and fraught with personal challenges. When a founder is “opportunity driven” it’s too easy to quit at the first bump in the road. When a founder is “mission driven” you get the sense that he or she will do whatever it takes to make an impact in the market they serve and will keep persevering whatever the startup trends of the month."}, {"6e07": "70% Team, 30% Market"}, {"c871": "I also talk often about how much the team plays a critical role in my decision backing an A-round company because so much changes as a company develops. Incumbents launch products, VCs throw cash at other competitors, team members quit, the economy dips — whatever. But only truly talented entrepreneurs show the grit required to respond rapidly to a changing environment. When you think about great companies that have survived market changes or platform changes you think about Facebook, Snapchat, Uber and the like and have to respect their great ability to constantly adapt."}, {"febb": "So Why Imbellus?"}, {"77d5": "When I first met with Rebecca Kantar I was stunned with the wide scope of her vision for building a company. Her mission was vast: She wanted to change the way we teach children in America. But she had such concrete plans for the 10+ years that it would take to build towards her goal."}, {"bd36": "She highlighted for me how we measure human potential today and it’s based on the workforce that existed post WWII where teaching rote memorization of facts — math, reading comprehension, writing, basic science, etc. - was sufficient for the jobs that existed in the industrial economy. We assessed skills by standardized tests designed to assess competency in this basic knowledge and this persisted in both the workplace interview environment as well as how we admit students into colleges."}, {"563c": "Inevitably as a society we began “teaching to the tests” and we design curricula around proficiency in these basic skills."}, {"0548": "But we of course now live in a “knowledge economy” that has to constantly adapt to changing market conditions. As leaders we intuitively know that while basic skills in math, science, reading & writing are necessary — they are not sufficient."}, {"e6a6": "As leaders we know that to succeed in today’s economy we need people who possess abilities to deal with large volumes of information and cut through the clutter to get to what’s important. We need leaders who can rigorously prioritize. We need leaders who can deal with a vague set of inputs and rationalize decision matrices. We need leaders who know how to accomplish feats through teamwork and collaboration. We need people who have emotional intelligence as well as actual fact-based knowledge."}, {"a26e": "Fundamentally the system feels broken. We educate and train and test for a set of skills designed to succeed in 1950."}, {"d34e": "Imbellus is designing systems to assess how candidates analyze information, develop ideas, make decisions and solve problems that aren’t based on rote memorization of facts. There aren’t necessarily right or wrong answers and each company may index differently for how its employees need to score across various dimensions to succeed in that particular organization or job functions."}, {"b05c": "The systems they are building are adaptive and computer generated so they can’t be studied, memorized or gamed."}, {"a669": "It is a super early-stage company so over time we’ll reveal more about the methods, systems and types of assessments we’re building."}, {"4146": "But what was clear to me in backing Rebecca was that I was getting behind somebody who has unbridled ambition, is mission-driven and has a differentiated plan for how to solve a problem that we all know exists but feels intractable."}, {"ebe3": "Truly, in many ways, my concern was the inverse of normal business pitches. My only concern was whether we could limit Rebecca’s scope of work enough to focus on shorter-term, more tangible problems that could lead to a business before the mission. Luckily Rebecca herself is highly adaptive and was able to rigorously prioritize which problems to solve first. Invariably she would no doubt score very highly on her own assessment tests."}, {"3b0a": "It’s rare that I feel so inspired by one entrepreneur and his or her vision. Rebecca is truly unique and I can’t wait to see what she and her team at Imbellus deliver over the coming years. It obviously takes an entire team to build and execute against such an ambitious project. Wishing all of Team Imbellus much success in your journey."}], "author": "Mark Suster", "name": "2401", "parent": ""}