{"timestamp": "Apr 12", "child": "2403_1\t2403_2\t2403_3\t2403_4\t2403_5\t2403_6\t2403_7\t2403_8\t2403_9\t2403_10\t2403_11\t2403_12\t2403_13\t2403_14\t2403_15", "title": "Why Great Executives Avoid Shiny Objects", "content": "Why Great Executives Avoid Shiny Objects The modern world is filled with constant distractions. Only those with maniacal focus on results and a willingness not to engage in every activity achieve extraordinary results. As executives we’re all seemingly accessible at any moment to anybody via email, Twitter, Facebook, LinkedIn or Text. We are over-intro’d and at the same time under-resourced in terms of staff to handle the barrage of in-bound requests. And every leader also has teams with constant priorities where they need: Input, feedback, decisions or meetings. We’re expected to be at conferences, events, sales meetings and be publicly visible. People expect blog posts, Tweets, panels, speeches. And then there are investors who want updates, calls, reports, check-ins. The modern world is daunting. Many leaders fall into the trap of doing too many things but not accomplishing enough. I have written about this before and often recommend to executives that they do less, but complete more by avoiding the shiny objects and distractions stop us from living up to our true potential. I think of activities as a funnel. Every new opportunity and every door opened is at the “top end of your funnel” meaning that may or may not come to fruition: A business development conversation, a first customer meeting, the first candidate in a recruiting process, the first time you talk with a journalist or the first meeting to consider your business strategy. Having interesting and frequent opportunities at the top of your funnel is important, of course, but the ultimate score is only measured on the bottom end of the funnel. Meeting with 12 biz dev targets makes for great conversations with your board but doesn’t matter for shit if none of them close in the end or if you don’t get the right deals done. Meeting a lot of candidates to find your head of marketing is all well and good but if 3 months later you still have no one in the role you’re still down a person. Taking tons of VC meetings is relatively easy but getting 1 or 2 to truly engage is much harder and takes total focus. The amount of time it takes to move along a few things forward in the bottom of your funnel is disproportionate long and hard relative to the time and ease of each new top-of-funnel activity, which is why many executives allocate their time on the wrong things. We all know executives who constantly talk a good game about vision and the things they’re going to do but actually never seem to deliver results. Eventually the bullshitting wears thin. We all know people who love to talk up their game but never deliver. People chase shiny objects precisely because opening is orders-of-magnitude easier than closing. My greatest personal successes in business have come from this one trait of being tenacious to the point of obsession on the most critical things and a willingness to totally disengage on less important activities until my plate is cleared. I am willing to disengage at times from the flurry of “activity” because when I have something that needs to be finished the only way I know how is maniacally focus on the bottom end of my funnel. It’s why sometimes I respond to emails in 5 minutes at other times I go dark for a week at a time. I learned this from Steven Covey so many years ago in the 7 Habits of Highly Effective People Step one: Be proactiveStep two: Begin with the end in mindStep three: Put first things first. Put first things first. Get non-core things out of your way. Move stuff down the funnel and be careful about widening your funnel if you’re not closing enough of your tasks. Recruiting, business development, shipping product, writing blog posts, networking … it’s all the same. Lots of people start, very few finish. Opening is a skill in its own right, but coffee is for closers. ", "sentences": [{"c84a": "Why Great Executives Avoid Shiny Objects"}, {"f1fe": "The modern world is filled with constant distractions. Only those with maniacal focus on results and a willingness not to engage in every activity achieve extraordinary results."}, {"6c07": "As executives we’re all seemingly accessible at any moment to anybody via email, Twitter, Facebook, LinkedIn or Text. We are over-intro’d and at the same time under-resourced in terms of staff to handle the barrage of in-bound requests."}, {"c6c6": "And every leader also has teams with constant priorities where they need: Input, feedback, decisions or meetings. We’re expected to be at conferences, events, sales meetings and be publicly visible. People expect blog posts, Tweets, panels, speeches. And then there are investors who want updates, calls, reports, check-ins."}, {"17fa": "The modern world is daunting. Many leaders fall into the trap of doing too many things but not accomplishing enough."}, {"06fe": "I have written about this before and often recommend to executives that they do less, but complete more by avoiding the shiny objects and distractions stop us from living up to our true potential."}, {"b4df": "I think of activities as a funnel. Every new opportunity and every door opened is at the “top end of your funnel” meaning that may or may not come to fruition: A business development conversation, a first customer meeting, the first candidate in a recruiting process, the first time you talk with a journalist or the first meeting to consider your business strategy."}, {"fb85": "Having interesting and frequent opportunities at the top of your funnel is important, of course, but the ultimate score is only measured on the bottom end of the funnel."}, {"69a0": "Meeting with 12 biz dev targets makes for great conversations with your board but doesn’t matter for shit if none of them close in the end or if you don’t get the right deals done."}, {"f5e8": "Meeting a lot of candidates to find your head of marketing is all well and good but if 3 months later you still have no one in the role you’re still down a person. Taking tons of VC meetings is relatively easy but getting 1 or 2 to truly engage is much harder and takes total focus."}, {"a12e": "The amount of time it takes to move along a few things forward in the bottom of your funnel is disproportionate long and hard relative to the time and ease of each new top-of-funnel activity, which is why many executives allocate their time on the wrong things."}, {"d6ca": "We all know executives who constantly talk a good game about vision and the things they’re going to do but actually never seem to deliver results. Eventually the bullshitting wears thin. We all know people who love to talk up their game but never deliver. People chase shiny objects precisely because opening is orders-of-magnitude easier than closing."}, {"c489": "My greatest personal successes in business have come from this one trait of being tenacious to the point of obsession on the most critical things and a willingness to totally disengage on less important activities until my plate is cleared. I am willing to disengage at times from the flurry of “activity” because when I have something that needs to be finished the only way I know how is maniacally focus on the bottom end of my funnel. It’s why sometimes I respond to emails in 5 minutes at other times I go dark for a week at a time."}, {"5463": "I learned this from Steven Covey so many years ago in the 7 Habits of Highly Effective People"}, {"2398": "Step one: Be proactiveStep two: Begin with the end in mindStep three: Put first things first."}, {"f286": "Put first things first. Get non-core things out of your way. Move stuff down the funnel and be careful about widening your funnel if you’re not closing enough of your tasks."}, {"29cc": "Recruiting, business development, shipping product, writing blog posts, networking … it’s all the same. Lots of people start, very few finish."}, {"bb2e": "Opening is a skill in its own right, but coffee is for closers."}], "author": "Mark Suster", "name": "2403", "parent": ""}