{"timestamp": "Feb 20", "child": "2405_1\t2405_2\t2405_3\t2405_4\t2405_5\t2405_6\t2405_7\t2405_8\t2405_9\t2405_10\t2405_11\t2405_12\t2405_13\t2405_14", "title": "Doing the Right Thing > Doing Things Right", "content": "Doing the Right Thing > Doing Things Right It’s easy to find yourself caught in the trap of just GSD (getting shit done) and not stepping back to be thoughtful about whether you’d benefit from doing fewer things but doing those things truly well. It’s the parable of the tree-chopping team that is so focused on efficiency of how fast it can fell a tree that it doesn’t bother to make sure it is clearing the forest in the right direction when one person actually stops the constant cutting to climb a tree and make sure they’re cutting in the right direction. On the surface this person is losing efficiency but in the long-run the gains for direction setting are huge. This has always resonated with me because each of us has such limited time and ability to get things done personally that our impact is much great from direction setting. And measuring activities or output can mislead you into thinking you’re doing a great job. So my corollary has always been “doing the right things is more important than doing things right.” Sounds simple but in practice I promise you most organization fall into the latter trap. Here’s how it goes: You have a business development group with two people. They are tasked with “getting deals done” so they race around talking to tons of potential partners inking anything from channel sale deals, product integration, international distribution agreements, co-marketing arrangements, M&A discussions, etc. You can often measure how many deals were achieved but there often doesn’t flow a steady stream of revenues / profits from these deals. That is your fault as a leader because biz dev folks will measure deals rather than impact unless you set their direction. You have a marketing department with three people. They’re tasked with doing … marketing. So they create a task list of all the marketing activities an organization can do: press releases, web site updates, customer case studies, blog posts, daily Tweets, Facebook fan page, attending conferences, etc. You get a lot of traffic — not always results. If you aren’t careful every PR team will measure inches over impact. Vanity metrics will make you feel good about site traffic of SEO over conversion rate or purchases of your product will get more attention than retention. Efficiency can be an addictive drug. The fact is — you manage what you measure. When you hire people in functional roles they want to show that they’re achieving results and results are easiest to measure by tasks accomplished. But many CEO’s and management teams fail to set clear guidelines on what the company objectives are and make sure that everybody is driving toward the same goal. It’s actually quite hard to lay out an annual company strategy that is articulate and underpinned by facts. So many CEO’s just carry on being … CEO’s → fund raise, get media attention, attend conferences, hire staff, “set direction”, whatever. But this leads to organizational drift because staff will continue to produce “work.” The reality is that you might be better off doing less activity but doing “the right” activities really well. To do the right activities you need to start with a top down assessment with what you’re trying to achieve in your organization. It’s why I always encourage teams to learn how to do “top town thinking” and not just bottom-up planning. I often find and eschew CEO’s who want press coverage, want to always be at conferences and speak on panels or want to copy features that their competitors offer without knowing whether their customers care about these features. So they direct staff to meet these objectives without considering what the purpose of activity is and what the end result will be. People will certainly follow orders and do the things you ask of them. It is more rare for me to find founders with a strong sense of purpose who are “mission driven” and not easily distracted by competition, praise or what others think. These tend to be the founders I back and in the first few years if the public is head scratching a bit — I usually think it’s more likely we’re heading in the right direction. No true innovation breakthroughs come from doing what’s obvious. Do the hard work and try to define your companies objectives and get them on paper. Be clear on your mission. Everybody should be able to answer the question, “why am I doing this?” Otherwise they’re likely to be doing things right, but not the right things. ", "sentences": [{"502a": "Doing the Right Thing > Doing Things Right"}, {"7334": "It’s easy to find yourself caught in the trap of just GSD (getting shit done) and not stepping back to be thoughtful about whether you’d benefit from doing fewer things but doing those things truly well."}, {"1b30": "It’s the parable of the tree-chopping team that is so focused on efficiency of how fast it can fell a tree that it doesn’t bother to make sure it is clearing the forest in the right direction when one person actually stops the constant cutting to climb a tree and make sure they’re cutting in the right direction. On the surface this person is losing efficiency but in the long-run the gains for direction setting are huge."}, {"783a": "This has always resonated with me because each of us has such limited time and ability to get things done personally that our impact is much great from direction setting. And measuring activities or output can mislead you into thinking you’re doing a great job."}, {"000a": "So my corollary has always been “doing the right things is more important than doing things right.” Sounds simple but in practice I promise you most organization fall into the latter trap."}, {"9e9b": "Here’s how it goes:"}, {"889c": "You have a business development group with two people. They are tasked with “getting deals done” so they race around talking to tons of potential partners inking anything from channel sale deals, product integration, international distribution agreements, co-marketing arrangements, M&A discussions, etc. You can often measure how many deals were achieved but there often doesn’t flow a steady stream of revenues / profits from these deals. That is your fault as a leader because biz dev folks will measure deals rather than impact unless you set their direction."}, {"86aa": "You have a marketing department with three people. They’re tasked with doing … marketing. So they create a task list of all the marketing activities an organization can do: press releases, web site updates, customer case studies, blog posts, daily Tweets, Facebook fan page, attending conferences, etc. You get a lot of traffic — not always results. If you aren’t careful every PR team will measure inches over impact. Vanity metrics will make you feel good about site traffic of SEO over conversion rate or purchases of your product will get more attention than retention. Efficiency can be an addictive drug."}, {"340f": "The fact is — you manage what you measure."}, {"7ea1": "When you hire people in functional roles they want to show that they’re achieving results and results are easiest to measure by tasks accomplished. But many CEO’s and management teams fail to set clear guidelines on what the company objectives are and make sure that everybody is driving toward the same goal. It’s actually quite hard to lay out an annual company strategy that is articulate and underpinned by facts."}, {"943a": "So many CEO’s just carry on being … CEO’s → fund raise, get media attention, attend conferences, hire staff, “set direction”, whatever. But this leads to organizational drift because staff will continue to produce “work.”"}, {"ec2d": "The reality is that you might be better off doing less activity but doing “the right” activities really well. To do the right activities you need to start with a top down assessment with what you’re trying to achieve in your organization."}, {"8e45": "It’s why I always encourage teams to learn how to do “top town thinking” and not just bottom-up planning."}, {"c719": "I often find and eschew CEO’s who want press coverage, want to always be at conferences and speak on panels or want to copy features that their competitors offer without knowing whether their customers care about these features. So they direct staff to meet these objectives without considering what the purpose of activity is and what the end result will be. People will certainly follow orders and do the things you ask of them."}, {"4786": "It is more rare for me to find founders with a strong sense of purpose who are “mission driven” and not easily distracted by competition, praise or what others think. These tend to be the founders I back and in the first few years if the public is head scratching a bit — I usually think it’s more likely we’re heading in the right direction. No true innovation breakthroughs come from doing what’s obvious."}, {"a877": "Do the hard work and try to define your companies objectives and get them on paper. Be clear on your mission. Everybody should be able to answer the question, “why am I doing this?” Otherwise they’re likely to be doing things right, but not the right things."}], "author": "Mark Suster", "name": "2405", "parent": ""}