{"timestamp": "Feb 7", "child": "2406_1\t2406_2\t2406_3\t2406_4\t2406_5\t2406_6\t2406_7\t2406_8\t2406_9\t2406_10\t2406_11\t2406_12\t2406_13\t2406_14\t2406_15", "title": "Mark Cuban on Why You Need to Study Artificial Intelligence or You’ll be a Dinosaur in 3 Years", "content": "Mark Cuban on Why You Need to Study Artificial Intelligence or You’ll be a Dinosaur in 3 Years Mark Cuban opened the Upfront Summit in an epic interview by Jason Hirschhorn, founder of Media REDEF. Machine Learning / AI They discussed many topics ranging from protection of the press to what Mark looks for in an entrepreneur to investing outside of Silicon Valley and of course Trump and sports. But perhaps to most insightful was their discussion about Machine Learning / AI. Mark made a fortune by being early in Local Area Networking, streaming and then High Definition video so perhaps it’s worth listening. He said that he believes AI will have a bigger impact than any technology in the last 30 years. “Artificial Intelligence, deep learning, machine learning — whatever you’re doing if you don’t understand it — learn it. Because otherwise you’re going to be a dinosaur within 3 years.” Mark also said that what happens in the next 5–10 years is just going to blow everybody away, especially in the field of automation. He thinks even programming is vulnerable to being automated and reducing the number of available programming jobs. Startups Outside Silicon Valley Jason asked Mark is he thought it was possible to build non-Silicon Valley successful startups. Mark said that the beauty of Silicon Valley isn’t the money available for financing it’s the money available for exits. Part of the problem is that companies don’t go public any more. If more companies outside Silicon Valley went public that would shift the balance of power. 20 years ago there were 9,000 public companies. Now there are 4,000. There’s a ton of capital only available for people who go public so people not going public is myopic. And he believes with less companies going public there is less competition. He said if Instagram went public. Or Oculus or twitch went public there would be more competition and he believes that as a country this isn’t good for us. If more companies around the country went public it would create more ecosystems because any time there are smart people gathered money will find them and fund them — but there need to be exits. Mark also pointed out that the number of investments he personally makes in San Francisco has dropped by 90%. Here is the full YouTube interview. Great Entrepreneurs Jason: What do you look for when you’re looking at an entrepreneur? Mark: smart, continuous learning (90% of Mark’s reading now is about neural networks, machine learning — that’s where everything is going), put in the time to execute, willing to sell, care about making a profit — at some point you have to make money. All of the investments he’s making are related to the artificial intelligence world. Greatest Public Startups Jason: You are still an investor in Netflix, right? Mark: My two biggest holdings are Netflix and Amazon. They are the two best startups in the industry with Google and Facebook being good companies behind them. Protecting Freedom of the Press Jason: The documentary at the Sundance film festival about Gawker (Nobody Speak) convinced me that although I didn’t like Gawker this really was a 1st amendment issue and it scares me about protecting the Fourth Estate (an independent press). How are we going to protect the Fourth Estate? Mark: The media industry needs to just do what it does. Four years will go fast. But NY Times, WaPo & CNN can’t get caught up in just trying to make Trump or make Trump followers happy. Politics. Jason: Do you meet with the President if he calls? Mark: Look, when you sit down with Trump or speak 1–1 on the phone, he’s personable. He’s nice. And you think, ok, this guys alright. And then for whatever reason when you walk out the room he’s Dr. Jekyll, Mr. Hyde. We all fall into the same trap, we roll our eyes at what he says and then think we’re going to use logic to convince his supporters to change their minds — it doesn’t work. [Suster side note — read this powerful book The Righteous Mind if you want to understand why logic doesn’t work to persuade voters — most important post-election book I’ve read.] Mark: 23% of eligible voters voted for Trump. 25% of eligible voters voted against him. 52% didn’t vote. We — and the media — should only focus on the undecided. Only 9% of American adults get news from Twitter so we aren’t getting the news from his Tweets, we’re getting news from how the media covers his Tweets. “Trump isn’t going to change. But what’s critically important is how we respond. Demonstrations, yes, but they have to be peaceful. They have to be civil.” But it is hard to be patient when he’s such an idiot. And we have a president that’s never sent an email in his life. Combatting Online Trolls Dick Costolo thought during his tenure he didn’t do enough to combat trolls. You have mentioned you have an idea how to combat things. What is it? Mark: If I Tweet and somebody responds to my Tweet and trolls me — I should have the ability to kick them out of the thread. Trollers don’t troll because they want to say something, they troll because they want somebody to notice them. I’d like to exclude them from this thread or permanently. Or I should be able to Tweet and say that nobody can comment on this Tweet. Or I should be able to reply but have my reply be private. In fact, we’re building an app to do just this. Sports A final 5+ minutes talked about sports. Mostly about how the NFL is a problem sport due to concussions and injuries. But if you’re a sports or Cuban fan you’ll want to listen to this bit, too. Suster Sidenote There were many famous speakers and attendees at the Upfront Summit but I was given a very strict assignment by my two boys (11 & 13) — the only thing they cared about was that I got a photo with Mark Cuban. They are huge fans of Shark Tank. Often my sons are in the car when I’m talking with entrepreneurs or my partners about deals. After years of watching Shark Tank it’s heartening to hear them make comments like, “I don’t know why he gave up so much equity? Why didn’t he just do a licensing deal?” Ha. Gotta love great role models. So here ya go, boys. ", "sentences": [{"d1eb": "Mark Cuban on Why You Need to Study Artificial Intelligence or You’ll be a Dinosaur in 3 Years"}, {"0e11": "Mark Cuban opened the Upfront Summit in an epic interview by Jason Hirschhorn, founder of Media REDEF."}, {"4d76": "Machine Learning / AI"}, {"8b8f": "They discussed many topics ranging from protection of the press to what Mark looks for in an entrepreneur to investing outside of Silicon Valley and of course Trump and sports. But perhaps to most insightful was their discussion about Machine Learning / AI."}, {"7035": "Mark made a fortune by being early in Local Area Networking, streaming and then High Definition video so perhaps it’s worth listening. He said that he believes AI will have a bigger impact than any technology in the last 30 years."}, {"35fd": "“Artificial Intelligence, deep learning, machine learning — whatever you’re doing if you don’t understand it — learn it. Because otherwise you’re going to be a dinosaur within 3 years.”"}, {"69f3": "Mark also said that what happens in the next 5–10 years is just going to blow everybody away, especially in the field of automation. He thinks even programming is vulnerable to being automated and reducing the number of available programming jobs."}, {"cdbf": "Startups Outside Silicon Valley"}, {"2a93": "Jason asked Mark is he thought it was possible to build non-Silicon Valley successful startups."}, {"4ff2": "Mark said that the beauty of Silicon Valley isn’t the money available for financing it’s the money available for exits. Part of the problem is that companies don’t go public any more. If more companies outside Silicon Valley went public that would shift the balance of power. 20 years ago there were 9,000 public companies. Now there are 4,000. There’s a ton of capital only available for people who go public so people not going public is myopic."}, {"64fa": "And he believes with less companies going public there is less competition. He said if Instagram went public. Or Oculus or twitch went public there would be more competition and he believes that as a country this isn’t good for us. If more companies around the country went public it would create more ecosystems because any time there are smart people gathered money will find them and fund them — but there need to be exits."}, {"492a": "Mark also pointed out that the number of investments he personally makes in San Francisco has dropped by 90%."}, {"9106": "Here is the full YouTube interview."}, {"cfa7": "Great Entrepreneurs"}, {"1f18": "Jason: What do you look for when you’re looking at an entrepreneur?"}, {"0450": "Mark: smart, continuous learning (90% of Mark’s reading now is about neural networks, machine learning — that’s where everything is going), put in the time to execute, willing to sell, care about making a profit — at some point you have to make money. All of the investments he’s making are related to the artificial intelligence world."}, {"294e": "Greatest Public Startups"}, {"a0b9": "Jason: You are still an investor in Netflix, right?"}, {"60b6": "Mark: My two biggest holdings are Netflix and Amazon. They are the two best startups in the industry with Google and Facebook being good companies behind them."}, {"23b5": "Protecting Freedom of the Press"}, {"a07f": "Jason: The documentary at the Sundance film festival about Gawker (Nobody Speak) convinced me that although I didn’t like Gawker this really was a 1st amendment issue and it scares me about protecting the Fourth Estate (an independent press). How are we going to protect the Fourth Estate?"}, {"5809": "Mark: The media industry needs to just do what it does. Four years will go fast. But NY Times, WaPo & CNN can’t get caught up in just trying to make Trump or make Trump followers happy."}, {"753a": "Politics."}, {"0c94": "Jason: Do you meet with the President if he calls?"}, {"f09c": "Mark: Look, when you sit down with Trump or speak 1–1 on the phone, he’s personable. He’s nice. And you think, ok, this guys alright. And then for whatever reason when you walk out the room he’s Dr. Jekyll, Mr. Hyde."}, {"58d5": "We all fall into the same trap, we roll our eyes at what he says and then think we’re going to use logic to convince his supporters to change their minds — it doesn’t work."}, {"51f7": "[Suster side note — read this powerful book The Righteous Mind if you want to understand why logic doesn’t work to persuade voters — most important post-election book I’ve read.]"}, {"904e": "Mark: 23% of eligible voters voted for Trump. 25% of eligible voters voted against him. 52% didn’t vote. We — and the media — should only focus on the undecided. Only 9% of American adults get news from Twitter so we aren’t getting the news from his Tweets, we’re getting news from how the media covers his Tweets."}, {"dbed": "“Trump isn’t going to change. But what’s critically important is how we respond. Demonstrations, yes, but they have to be peaceful. They have to be civil.”"}, {"72b7": "But it is hard to be patient when he’s such an idiot. And we have a president that’s never sent an email in his life."}, {"ab50": "Combatting Online Trolls"}, {"8c92": "Dick Costolo thought during his tenure he didn’t do enough to combat trolls. You have mentioned you have an idea how to combat things. What is it?"}, {"73eb": "Mark: If I Tweet and somebody responds to my Tweet and trolls me — I should have the ability to kick them out of the thread. Trollers don’t troll because they want to say something, they troll because they want somebody to notice them. I’d like to exclude them from this thread or permanently. Or I should be able to Tweet and say that nobody can comment on this Tweet. Or I should be able to reply but have my reply be private. In fact, we’re building an app to do just this."}, {"c725": "Sports"}, {"a159": "A final 5+ minutes talked about sports. Mostly about how the NFL is a problem sport due to concussions and injuries. But if you’re a sports or Cuban fan you’ll want to listen to this bit, too."}, {"be88": "Suster Sidenote"}, {"cb35": "There were many famous speakers and attendees at the Upfront Summit but I was given a very strict assignment by my two boys (11 & 13) — the only thing they cared about was that I got a photo with Mark Cuban. They are huge fans of Shark Tank. Often my sons are in the car when I’m talking with entrepreneurs or my partners about deals. After years of watching Shark Tank it’s heartening to hear them make comments like, “I don’t know why he gave up so much equity? Why didn’t he just do a licensing deal?” Ha. Gotta love great role models. So here ya go, boys."}], "author": "Mark Suster", "name": "2406", "parent": ""}