{"timestamp": "Mar 30, 2016", "child": "2409_1", "title": "An Inside Scoop on the Funding Environment and What it Might Mean for You", "content": "An Inside Scoop on the Funding Environment and What it Might Mean for You $30 million. That’s how much Invoca raised and we’re announcing it today. It is an heroic accomplishment in a brutal fund-raising market in which only market leaders can bring in that sort of money. But the story started more than 6 months ago. And the narrative may tell you something about your own journey one day. We started planning our fund raising as much as 14 months ago. Invoca had grown steadily and consistently since 2009 and by 2015 SaaS companies with scale had become hot — trading at a median of 7.3x forward sales with some as high as 12x sales. Many had started IPO’ing and we started to think about our future. Investors sat with the founder & CEO, Jason Spievak, and asked him what he wanted to do about the future. Did he want to see if Invoca could be public some day? Did he want to see whether a strategic buyers made sense in the next couple of years? Did he want to grow more slowly and opt to attain profitability? Collectively we chose growth and the market was rewarding high growth rates over any other factor so we felt that we ought to bring in an experienced CEO who had taken companies public, who had led large, international sales organizations and who was poised to take Invoca to the next level. Jason himself had enjoyed “the art of the start” as I think Guy Kawasaki once coined. So we brought in experience hand Mark Woodward who had taken 2 companies public and had a storied sales leadership turned CEO career where he learned in academy-rich Oracle. The future seemed certain, the steps seemed obvious, the rewards felt imminent and everyone felt elated and ready for the challenge. We knew better than to start funding raising in August, when larger VC firms have a harder time assembling full decision teams — so in August we would plan and September we would commence. September started easily enough. Many VC firms expressed interest, nearly every one took a meeting and several called Mark and the team back for meetings. Mark dutifully went to partner meetings, back-channel references began, firms started calling existing VCs to “test prices” and we started debating whom our best partner would be. As we extended into October the Fall winds began blowing, the chill foreshadowing changes afoot and we could only begin to see the warning signs of a brick wall we were flying toward in the fog in our immediate vision. Every VC who’s been the business for a long time realized first hand that the VC markets were changing rapidly as early as Q3 of 2015. They either had a portfolio company in market and weren’t getting offers as quickly as expected or they knew a friend in the biz who was recounting this to them in a session VCs strangely call “comparing notes.” If you want to see what was on my mind — I started foreshadowing change publicly in October 2015 with a forecast of what I expected in 2016 VC funding markets at a presentation I gave at the annual Cendana VC/LP conference hosted by Michael Kim. Word travels at light speed amongst this small network of people who all know each other and even though they’re rivals they also sit on boards together and many probably went to business school together. So when something in changing those at ground zero, in my word, “get the memo.” Of course it’s not literally a memo but that’s a metaphor for knowing that things have dramatically changed. If you’re not in this closed group of VCs you will eventually figure out the new game but the memo arrives more slowly. Many of the industry’s top thinkers were at Cendana’s annual meeting and panel after panel privately debated what they were seeing. The Invoca board and Mark gathered and discussed how our process was going. We still had such strong inbound interest we decided to stay the course and would surely be done by November. Six firms had expressed strong interest, two had strong champions already trying to test price and round size and one had made it clear they were planning to submit a term sheet the following week. But of course public markets had begun gyrating. Below is a graph of the NASDAQ the US public barometer of technology companies. There was a huge dip in late August 2015 that scared the shit out of many people followed by another one at the end of September. By late October the markets had seemingly recovered. Volatility seemed to be up but investors frankly didn’t know what to make of things. With “uncertainty” taking hold, rounds were taking longer to complete. Earlier in the year companies left, right and center had artificially been anointed “unicorn status,” this left many investors feeling with FOMO: Fear of missing out. I feel safe in knowing that I was one of the few who publicly called bullshit. Investors had grown too used to the idea that any deal you funded would get marked up to a higher valuation in the next round and that’s clearly not always true. 2012–2015 were boom times in tech startups as prices were always moving up leading to FOMO leading to higher than normal multiples driven by a massive entry of new investors in the market. Invoca was raising at the tail end of this market phenomenon at this time doing tens of millions in SaaS recurring revenue and growing at a nice clip. Invoca is the market leader in a hot and growing category: marketing automation for telephony driven by the explosion in smart phones where a phone call is a single click of a button. They had signed major enterprise accounts like Dish, DirectTV, Allstate, Microsoft, SunTrust and others. Here are some stats to give you a sense:• Year over year revenue grew 51% in 2015 and we’re forecasting the same again for 2016• Total customers grew 20% year/year• CMRR (contracted monthly recurring revenue) grow 100% y/y• ARPU (average revenue per user) in our large enterprise accounts grew 67% while gross profit was up 163%• Gross margins in the year improved 150 basis points improving our overall profitability We provided all this data to investors and were also transparent about the things that hadn’t gone as planned. As I mentioned, at the start of the process median SaaS multiples were around 7.3x forward sales, we hinted at a range north of 5x but “we’d be flexible” and we meant it. As we headed into Q4 it was clear that firms were elongating the process. They were close but needed more data and needed more time: A couple more reference calls, a few new data requests, one more partner meeting to debate things. One by one they “loved us” but just didn’t know if they could get there in our timescales. Mutual funds had begun marking down the valuations of their private investments in high-profile deals. Fall turned to winter. 2015 turned to 2016. January began a market tumble. We still seemed very close and many firms were still “digging in.” And then this happened: While the much beloved Twitter had been going through a long and slow decline over many months, LinkedIn and Tableau Software went through a big-bang correction (a reversion to the mean) in a single day in early February. FOMO was NOMO. As in no more. SaaS valuations had completely reverted to the mean and were now trading at 4.2x forward revenue for public comps (comparable stocks). Invoca was an amazing company with a bright future but we knew what we had to do. We cut price and doubled down on an aggressive campaign to call back people who had been on the fence given the economic climate of prices dropping. Our business continued to succeed and fortunately the management team agreed to keep their eyes on the ball of running the company while Mark and the board focused on investors. When markets turn to fear, smart investors turn to greed (metaphorically speaking) and saw the opportunity very clearly. The market around us may have been melting but market leaders in a category always get funded — it’s just a matter of focus and execution on the fund-raising process. We also have to offer a huge thank you to Randy Churchill at Square1 Bank who worked closely with us during this time (we had venture debt) to ensure we had the time we needed to complete our fund raise. If ever anybody had questioned the value of venture debt in a market like Q1, 2016 they did not. Talking with new investors, with prices set to historical norms for SaaS businesses investors felt the risks were mitigated. We had grown into a more reasonable burn rate so raising capital meant we would have many years of cash on the balance sheet. We targeted $20 million in a raise and ended up pulling in $30 million. We were now in a “market clearing” zone and had several choices and were even fortunate enough to turn some investors away. We no longer have our backs against the wall. Invoca has enough capital where we should never need to fund raise again. The company has rediscovered frugality and knows the value of a strong balance sheet. Like the market, Invoca has learned the importance of pragmatic growth over “growth at all costs” because when markets shift companies that run lean always have more options than those that only have a growth agenda. Great companies get financed. Most investors still believe in the winner-take-most attributes of a market and Invoca’s financing will in itself help act as a continued moat as smaller competitors will struggle to match our R&D pace or to globalize as we take our platform abroad. We have a very experienced management team and can serve large, enterprise accounts, who will surely scrutinize balance sheets before committing important projects to other startups. But the truth is that arriving in this enviable position — to be able to announce a $30 million financing and continue our company’s growth, it required a humbleness of our executive team and founders to recognize that the market was changing beneath their feet. They had to focus on getting a “W” one day over the short-term dilution impact of raising at a price lower than they had set out to achieve. Luckily we were never a unicorn so we didn’t have to have a destructive massive down-round that makes it harder (but not impossible) to get done. And as mobile continues to dominate the computing landscape and telephone-based sales campaigns continue to prove that they are cost-effective, have higher close rates than forms on the Internet and lead to increases in average order values (cross sell & up sell) — we believe we’ve now positioned the company for the longer boom. But I’d say there are a few more gray hairs around the table :) In this market some startups will understand “the trade” of a long-term W over short-term bravado. Some startups will get ahead of the difficult task of attracting capital in markets with more scrutiny and will adjust burn-rates, growth rates and prices. Some startups will have a hard time reorienting. And my guess is the market will normalize throughout 2016 and by 2017 much of the shake out will have taken place. I hope you enjoyed the inside account of what actually happens in a market that is going through transition. It’s a story that repeats itself yet hard to perceive when you’re a central character. Obviously these stories are ones many don’t like to share but it helps to be open about the journey when it has a happy ending. Congratulations Team Invoca. And thank you for keeping your heads down and just focusing on serving customers throughout the past 6 months. Onward and upward. Update: I just found this very short video the company did announcing the funding. It’s great so I thought I’d include it. I think you’ll enjoy :) ", "sentences": [{"f447": "An Inside Scoop on the Funding Environment and What it Might Mean for You"}, {"631c": "$30 million. That’s how much Invoca raised and we’re announcing it today. It is an heroic accomplishment in a brutal fund-raising market in which only market leaders can bring in that sort of money. But the story started more than 6 months ago. And the narrative may tell you something about your own journey one day."}, {"813c": "We started planning our fund raising as much as 14 months ago. Invoca had grown steadily and consistently since 2009 and by 2015 SaaS companies with scale had become hot — trading at a median of 7.3x forward sales with some as high as 12x sales. Many had started IPO’ing and we started to think about our future."}, {"0b0d": "Investors sat with the founder & CEO, Jason Spievak, and asked him what he wanted to do about the future. Did he want to see if Invoca could be public some day? Did he want to see whether a strategic buyers made sense in the next couple of years? Did he want to grow more slowly and opt to attain profitability?"}, {"2ab6": "Collectively we chose growth and the market was rewarding high growth rates over any other factor so we felt that we ought to bring in an experienced CEO who had taken companies public, who had led large, international sales organizations and who was poised to take Invoca to the next level. Jason himself had enjoyed “the art of the start” as I think Guy Kawasaki once coined."}, {"213e": "So we brought in experience hand Mark Woodward who had taken 2 companies public and had a storied sales leadership turned CEO career where he learned in academy-rich Oracle. The future seemed certain, the steps seemed obvious, the rewards felt imminent and everyone felt elated and ready for the challenge. We knew better than to start funding raising in August, when larger VC firms have a harder time assembling full decision teams — so in August we would plan and September we would commence."}, {"4864": "September started easily enough. Many VC firms expressed interest, nearly every one took a meeting and several called Mark and the team back for meetings. Mark dutifully went to partner meetings, back-channel references began, firms started calling existing VCs to “test prices” and we started debating whom our best partner would be."}, {"7c1d": "As we extended into October the Fall winds began blowing, the chill foreshadowing changes afoot and we could only begin to see the warning signs of a brick wall we were flying toward in the fog in our immediate vision."}, {"5660": "Every VC who’s been the business for a long time realized first hand that the VC markets were changing rapidly as early as Q3 of 2015. They either had a portfolio company in market and weren’t getting offers as quickly as expected or they knew a friend in the biz who was recounting this to them in a session VCs strangely call “comparing notes.”"}, {"7f65": "If you want to see what was on my mind — I started foreshadowing change publicly in October 2015 with a forecast of what I expected in 2016 VC funding markets at a presentation I gave at the annual Cendana VC/LP conference hosted by Michael Kim. Word travels at light speed amongst this small network of people who all know each other and even though they’re rivals they also sit on boards together and many probably went to business school together."}, {"7329": "So when something in changing those at ground zero, in my word, “get the memo.” Of course it’s not literally a memo but that’s a metaphor for knowing that things have dramatically changed. If you’re not in this closed group of VCs you will eventually figure out the new game but the memo arrives more slowly. Many of the industry’s top thinkers were at Cendana’s annual meeting and panel after panel privately debated what they were seeing."}, {"d4a9": "The Invoca board and Mark gathered and discussed how our process was going. We still had such strong inbound interest we decided to stay the course and would surely be done by November. Six firms had expressed strong interest, two had strong champions already trying to test price and round size and one had made it clear they were planning to submit a term sheet the following week."}, {"fcb9": "But of course public markets had begun gyrating. Below is a graph of the NASDAQ the US public barometer of technology companies. There was a huge dip in late August 2015 that scared the shit out of many people followed by another one at the end of September. By late October the markets had seemingly recovered. Volatility seemed to be up but investors frankly didn’t know what to make of things."}, {"065e": "With “uncertainty” taking hold, rounds were taking longer to complete. Earlier in the year companies left, right and center had artificially been anointed “unicorn status,” this left many investors feeling with FOMO: Fear of missing out. I feel safe in knowing that I was one of the few who publicly called bullshit."}, {"59f4": "Investors had grown too used to the idea that any deal you funded would get marked up to a higher valuation in the next round and that’s clearly not always true. 2012–2015 were boom times in tech startups as prices were always moving up leading to FOMO leading to higher than normal multiples driven by a massive entry of new investors in the market."}, {"1a2a": "Invoca was raising at the tail end of this market phenomenon at this time doing tens of millions in SaaS recurring revenue and growing at a nice clip. Invoca is the market leader in a hot and growing category: marketing automation for telephony driven by the explosion in smart phones where a phone call is a single click of a button. They had signed major enterprise accounts like Dish, DirectTV, Allstate, Microsoft, SunTrust and others."}, {"d2cb": "Here are some stats to give you a sense:• Year over year revenue grew 51% in 2015 and we’re forecasting the same again for 2016• Total customers grew 20% year/year• CMRR (contracted monthly recurring revenue) grow 100% y/y• ARPU (average revenue per user) in our large enterprise accounts grew 67% while gross profit was up 163%• Gross margins in the year improved 150 basis points improving our overall profitability"}, {"1c6d": "We provided all this data to investors and were also transparent about the things that hadn’t gone as planned. As I mentioned, at the start of the process median SaaS multiples were around 7.3x forward sales, we hinted at a range north of 5x but “we’d be flexible” and we meant it. As we headed into Q4 it was clear that firms were elongating the process."}, {"f866": "They were close but needed more data and needed more time: A couple more reference calls, a few new data requests, one more partner meeting to debate things."}, {"a7a5": "One by one they “loved us” but just didn’t know if they could get there in our timescales. Mutual funds had begun marking down the valuations of their private investments in high-profile deals. Fall turned to winter. 2015 turned to 2016. January began a market tumble. We still seemed very close and many firms were still “digging in.” And then this happened:"}, {"a9e7": "While the much beloved Twitter had been going through a long and slow decline over many months, LinkedIn and Tableau Software went through a big-bang correction (a reversion to the mean) in a single day in early February."}, {"48c2": "FOMO was NOMO. As in no more."}, {"7e1a": "SaaS valuations had completely reverted to the mean and were now trading at 4.2x forward revenue for public comps (comparable stocks). Invoca was an amazing company with a bright future but we knew what we had to do. We cut price and doubled down on an aggressive campaign to call back people who had been on the fence given the economic climate of prices dropping."}, {"5f30": "Our business continued to succeed and fortunately the management team agreed to keep their eyes on the ball of running the company while Mark and the board focused on investors. When markets turn to fear, smart investors turn to greed (metaphorically speaking) and saw the opportunity very clearly."}, {"2952": "The market around us may have been melting but market leaders in a category always get funded — it’s just a matter of focus and execution on the fund-raising process. We also have to offer a huge thank you to Randy Churchill at Square1 Bank who worked closely with us during this time (we had venture debt) to ensure we had the time we needed to complete our fund raise. If ever anybody had questioned the value of venture debt in a market like Q1, 2016 they did not."}, {"00fe": "Talking with new investors, with prices set to historical norms for SaaS businesses investors felt the risks were mitigated. We had grown into a more reasonable burn rate so raising capital meant we would have many years of cash on the balance sheet. We targeted $20 million in a raise and ended up pulling in $30 million. We were now in a “market clearing” zone and had several choices and were even fortunate enough to turn some investors away."}, {"ec82": "We no longer have our backs against the wall. Invoca has enough capital where we should never need to fund raise again. The company has rediscovered frugality and knows the value of a strong balance sheet. Like the market, Invoca has learned the importance of pragmatic growth over “growth at all costs” because when markets shift companies that run lean always have more options than those that only have a growth agenda."}, {"2c22": "Great companies get financed. Most investors still believe in the winner-take-most attributes of a market and Invoca’s financing will in itself help act as a continued moat as smaller competitors will struggle to match our R&D pace or to globalize as we take our platform abroad. We have a very experienced management team and can serve large, enterprise accounts, who will surely scrutinize balance sheets before committing important projects to other startups."}, {"3d3f": "But the truth is that arriving in this enviable position — to be able to announce a $30 million financing and continue our company’s growth, it required a humbleness of our executive team and founders to recognize that the market was changing beneath their feet. They had to focus on getting a “W” one day over the short-term dilution impact of raising at a price lower than they had set out to achieve. Luckily we were never a unicorn so we didn’t have to have a destructive massive down-round that makes it harder (but not impossible) to get done."}, {"9736": "And as mobile continues to dominate the computing landscape and telephone-based sales campaigns continue to prove that they are cost-effective, have higher close rates than forms on the Internet and lead to increases in average order values (cross sell & up sell) — we believe we’ve now positioned the company for the longer boom."}, {"ce0d": "But I’d say there are a few more gray hairs around the table :)"}, {"4130": "In this market some startups will understand “the trade” of a long-term W over short-term bravado. Some startups will get ahead of the difficult task of attracting capital in markets with more scrutiny and will adjust burn-rates, growth rates and prices. Some startups will have a hard time reorienting. And my guess is the market will normalize throughout 2016 and by 2017 much of the shake out will have taken place."}, {"14e2": "I hope you enjoyed the inside account of what actually happens in a market that is going through transition. It’s a story that repeats itself yet hard to perceive when you’re a central character. Obviously these stories are ones many don’t like to share but it helps to be open about the journey when it has a happy ending."}, {"d70a": "Congratulations Team Invoca. And thank you for keeping your heads down and just focusing on serving customers throughout the past 6 months. Onward and upward."}, {"6e78": "Update: I just found this very short video the company did announcing the funding. It’s great so I thought I’d include it. I think you’ll enjoy :)"}], "author": "Mark Suster", "name": "2409", "parent": ""}