{"timestamp": "Mar 25, 2016", "child": "2410_1\t2410_2\t2410_3\t2410_4\t2410_5\t2410_6\t2410_7", "title": "How to Decrease the Odds That Your Startup Fails", "content": "How to Decrease the Odds That Your Startup Fails Many startup businesses — tech or otherwise — fail. In our industry we applaud the efforts for entrepreneurs to have tried and we know that today’s failure can bring the experience for tomorrow’s success. We also know that even though many of us who are experienced in startup successes & failures look at businesses and say, “That will never work” (as many people said about Uber) or “You can’t make any money in that business” (as many said about WhatsApp or Dropbox) and of course some entrepreneurs pull off extraordinary things we never thought possible. Trying outrageous new things or even trying mundane things but in new ways but with extreme quality & innovation is what fuels the tech startup industry. Yet I can’t help thinking there are many predictable failures that come from a lack of basic planning. It turns out that to build a successful company you ultimately need this strange thing called “revenue” that people don’t just hand you: You need to earn it. And there’s this other thing called “gross margin,” which shows the quality of your revenue. It says that selling an airplane ticket for $500 and getting paid a $5 fees by the airlines (1% gross margin) is not the same thing as selling $500 of software that you built (>90% gross margin). If you don’t understand the basics of this I’ve written this primer on Startup economics you might appreciate — mostly to get journalists to stop saying, “That company isn’t even profitable!” when often that’s a stupid comment. Lately I’ve been having to say things I thought I’d never have to remind people, like, “getting to positive gross margin in several territories is a very low bar to claim success” or “profitable excluding marketing costs” is not actually a real thing. But today I want to give you advice on how to decrease your odds of failure in a startup. You may still fail but at least you’ll have less chance of failing for the wrong reasons. Most of this advice boils down to an argument in favor of basic planning before starting a company or raising money. In many ways the fact that it has become so cheap to start a company and relatively cheap to raise angel/seed money that we as an industry have gotten lazy on basic planning. The questions that a VC mulls before writing a check are precisely the questions you should be asking yourself. 1. Market SizeIt’s ok to target a small market and you can probably build a niche business that is extremely valuable to you as an individual. But this isn’t likely to be a VC-backable business (which to be clear is totally ok). So if you go after a niche market then you need to raise small amounts of money, keep your costs exceedingly low, and get to cashflow positive as quickly as is possible. Running up big losses or trying to grow extraordinarily fast through paid marketing initiatives that have long payback periods will be the kiss of death for you. Marketing with long payback is precisely what requires venture capital. If your goal is to build a scalable startup then you need to focus on where large amounts of money are spent and/or where large amounts of money will be spent. I like to use the example of a company I backed called MakeSpace because it’s such an easy an obvious market to understand. MakeSpace provides physical storage. They pick up your stuff and drop it off at your house when you want it back. They photograph your stuff and provide a beautiful app where you can see what you have at any moment. So, let’s start with the basics. The US market is worth more than $25 billion and Europe is the same. Asia is smaller but growing as wealth increases in large, urban environments. So when Sam Rosen came to me with the idea of disrupting storage with a product that is priced cheaper than existing incumbents and he could build a product that is a better service I was intrigued. There are a million ways to either research your industries market size and you’re likely to have to do some basic estimations to figure out much of that is addressable to you. In our industry we call that a TAM (total addressable market) and I’m sure you can even Google methods for calculating a TAM. Let me be very direct. If you’re not even spending any time thinking about what your market could be you’re simply being lazy and unprepared. For example, if you’re going to build a travel planning website (as many, many startup entrepreneurs do) your basic research would be: Answering these questions and other basic planning will tell you where the value is accrued in the enormous travel category, who is serving this market today and you can find whether your entry into the market is likely to create a big business. Many startups in stead launch “cool” products that their friends and peers love initially but don’t yield large amounts of revenue or profits and certainly can’t support the costs structure. Alternatively you may have figured out a way to capture a disproportionate amount of money in an under-served part of the market (as Airbnb have) and build an enormous company. But not doing basic research makes no sense. Equally, hoping to unseat TripAdvisor without understand their SEO strengths and how much it would cost to knock them down would be naïve. 2. Market StructureSize of market matters but so, too, does “market structure.” Are you going into an industry (say, music?) dominated by a few very large incumbents who control much of the distribution or are you going into a market that is “fragmented” where nobody controls the industry. You can enter either but your strategy must be very different and I can tell you that fragmented markets are easier to disrupt. For all of the talk about Salesforce.com controlling the CRM market I’m told they still have less than 20% market share. In a way, CRM is actually fairly fragmented but to enter that market you’d have to come up with a part of the value chain not dominated by Salesforce or Microsoft Dynamics today. If you look at the structure of the travel industry above — of course we know that the hotel industry is fragmented while the airline industry is reasonable consolidated. So if you’re going to build a front-end booking structure for either it’s probably more lucrative to do so for hotels vs. airlines. In the airline industry if 2–3 majors won’t play ball with you then it’s hard to build a valuable user experience. And to be successful you’d have to figure out how to unseat the likes of Kayak with its existing brand and tech assets. No, thanks. Airbnb’s success is that it unleashed a totally new market of inventory for travelers tired of paying too much for hotels and an entire supply of people who want to make a little extra money to make ends meet. If you look at the storage market I referenced above, the largest player — Public Storage — does about $2.4 billion in sales and thus controls less than 10% of the market. The top 5 players combined control less than 25% of the market. Storage is what’s known as “highly fragmented,” meaning easier for a new entrant to get traction if it could design a better product / service / experience. This is precisely why MakeSpace is growing so rapidly in its core markets: New York, Chicago and Washington DC where they can literally come and pick up your furniture and move it away and you never had to visit a facility and they do this at a cheaper price than incumbents by centralizing the location and thus having cheaper infrastructure costs. Sam did all this analysis before even deciding to build V1 of his software and before we put serious money behind him launching. He took seed money to test whether consumers cared and he started by not taking furniture to test the market with the least complexity. After a year in the market, MakeSpace was growing rapidly and our biggest issue was CAC (customer acquisition costs) relative to payback period (when we get our marketing investment back) and relative to LTV (lifetime value). The metrics were good but we wondered how much better they would be when we expanded our product. We first rolled out furniture in a newer market — Washington DC, and we increased ARPU (average revenue per month, per customer) by > 300%, we lowered our CAC (this is because the number of people who came to our site and converted went up) and thus we decreased our payback period. Boom. That is how great businesses are built. We did the planning work up front. We tested a simpler version of our product in the market first to prove product/market fit before raising a ton of capital, we build software to handle the complexity of the “mundane things” like driver routing, logistics tracking, warehouse management, photo processing, etc and we expanded our offering to test whether we could convert at better rates with an expanded offering. And our software allowed us to offer: tighter pick-up windows, better utilization of “uploader staff” and to launch new products & services that I won’t discuss because they’re in development now. If you create a business and start building products and go into an incubator or raise angel/seed money and don’t think about Market Size and Market Structure I only have one question: Why? 3. Incumbent Strengths & WeaknessesSo by now you should know your industry’s market size & structure. You should know at each part of the value chain where the value is controlled. But you also need to understand the incumbents’ strengths and weaknesses and their likely responses to your successes. In an industry where you’re reselling airplane tickets, for example, you need to think about the power they may or may not have over you. In the early days of every business the incumbents tend not to respond because you’re too small and insignificant. As they see you grow the become intrigued and probably analyze your business model and potential. If you start to hit your success stride they will respond. As an investor that’s precisely what goes through my mind. If you’re not successful then who cares. But I’m investing on the assumption you will be successful, of course. So if you are then I have to ask myself, “What are the incumbents going to do when you grow?” In the airline industry they have the ability to withhold inventory unless you’re an 800-pound gorilla where they can’t afford not to have your traffic while their competitors have it. But that’s harder to build in 2016 than it was in say 2005. If you figure out how to scale a video product inside of Facebook really, really, quickly they’re likely to allow it to happen for a while so they can study the positive & negative impacts on user experiences. But then they’re likely going to “traffic shape” so that you’re not too dominant. No platform is naïve enough to allow an outsider to grow enormously large in their ecosystem without an appropriate tax or benefit to them. The perfect competitors are the ones where they unable to respond due to The Innovator’s Dilemma. Let me come back to MakeSpace to show you this point. Once we launched of course incumbents could try to create a product in which they pick up your stuff. At their scale this would be hard but doable. They could try to figure out how to do logistics, warehouse tracking, photo-processing and route management. It would take 2 years to catch up but believe me they have the capital to do so. They might struggle to hire a-players because, well, would you go work at Public Storage to build their software capabilities? Or would you go to a disruptor in stead? But assuming they were able to copy us. They literally can’t respond to our core differentiator. They can’t continually lower the costs of providing the storage because they’re hamstrung by these huge assets called “local storage facilities” that were their great differentiator as they pushed to be closer and closer to the customers for “convenience” although I’ve never heard that term from any storage customers. Our centralization is their achilles heel. It is Blockbuster video in the dawn of Netflix. And when you have a market where the competitor response can be that they throw money and resources at a problem but truly competing would be undermining their core business model and assets … BOOOOOM. Choose that market. 4. MicroeconomicsSmart investors think a lot about what we call “unit economics” or what is the economics of service one customers. We need to market to that customer to make them aware of our product or service. That marketing can be PR or SEO or influencer distribution or other forms of “unpaid” marketing. But in the end these all have a cost — it’s just hidden. PR requires time and effort from your team that isn’t spent elsewhere and thus is a real cost. SEO doesn’t just happen — it requires a content strategy, inbound links, relevancy, keyword strategies, etc. And influencers may help once or twice but ultimately nothing is free. You may have paid marketing: SEM, Social Media Ads, Banner Ads, email lists, etc. Any way you slice it acquiring users and/or customers isn’t free. Then you need to understand the economic benefit to the user. It it just more time that they save? Efficiency? Will they save hard dollars? How much? Why? How will you charge? Will the user pay? Will a third-party pay (advertisers, data companies)? If a third-party ad: what CPMs do they pay today, what minimum volume of traffic will you need, will you sell direct or through an ad broker? Will you have premium ads or remnant ads? Then you need to understand what these people are paying for similar products and services today. You can’t just make this up. If you want to do food delivery you need to know if the consumer pays or the restaurant pays and why. You need to understand what alternatives they have and how that will shape the amount of money they’ll spend. If you want to sell a “coffee in a box” subscription — is it premium to their buying Starbucks or Nespresso or cheaper? Will they supplement those purchases or replace it? In any market you’re competing with one thing that all people must compete with, “share of wallet,” which in most markets is not unlimited (unless you’re selling extreme luxury goods). If you’re selling to moms — what are they spending for comparable products today? What will they not spending on if they’re ramping up on your products? What price will your customer ultimately accept? This is based on “price elasticity” and you can google that to understand it better. Essentially products that are “inelastic” means price increases don’t affect demand much (think cigarettes, drugs, alcohol) and if they’re “elastic” it means small price increases can massively drop demand but equally large price decreases can massively increase demand. What are the customer’s alternatives? In economics this is known as a “substitute product.” If you launch a fizzy water product you may think your competitors are Badoit and San Pelligrino but a substitute product might be flat water like Propel or cold green tea. Most products have substitutes and it’s worth knowing. Our portfolio company Ring had a new “security doorbell” which is truly a new market. But there are competitors (high end alarm systems like from ADT) and there are substitutes (like trying to use a less sophisticated product like DropCam, which is great as a camera but doesn’t have any of the security features built in and isn’t constructed to work well outside your house and in a secure way. That’s why Ring is amongst the fastest growing company in our portfolio. But to assume there are no substitutes would be wrong. Of course the hardest competitor for most of us is simply customer inertia. CompetitionIf you want to succeed you need to study the competitors. You won’t likely launch into a market with nobody else present. You need to ask yourself honestly how your product or service is going to be significantly better in some way than the competition that exists in the market. You need a wedge. You may be cheaper, you may have more features, you may be easier to use, you may target one under-served demographic (think Bevel by Walker & Co) or you may just be better at sales & marketing than the competition with an equivalent (or even inferior) product. But not to study what else is happening in a market is wrong. Why would you consider the competitors in a market AFTER you’ve spent 18 months building product on somebody else’s money and with a team you’ve pried away from their existing jobs. You only have your limited time on this Earth and to find out some competitor disadvantage after years of work is crazy to me. But it is often what happens with first-time entrepreneurs who are spoiled for choice with angel investors willing to fund with little thought or with the plethora of incubators that now exists who need a steady flow of options to hope to have the next big winner so they may not ask all the tough questions. But you should. Why wouldn’t you? HistoryFinally. Study your history. If you want to launch a company that competes with RottenTomatoes you need to study both why they are successful and what happened to the 20 other companies that tried to knock them off their stools. Do you think nobody has tried to better IMDB? I’ve seen 10 tries. Want to eradicate Evite? Why have so many before you failed? TripAdvisor? Yeah, we all know it’s imperfect. But it’s a fierce competitor that killed many a company before it. Every market is littered with companies that came before you. That doesn’t mean you won’t succeed. But not to ask yourself the questions of “what went wrong there” and “what could we learn from it” is to give up your biggest advantage: the ability to stand on the shoulders of those who came before you. ConclusionPlan. Think. Study. Test. Validate data. Validate firmly held positions. Know your planned sources of differentiation and adjust as you learn. Read plenty of “what went wrong” eulogies by founders and see what you can learn. But also understand that the lens from which they tell you the answer is both imperfect and has a narrative bias. The right answer might be (as I read recently), “we should have hired more people and raised more money, more quickly and either succeeded quickly or found out we were wrong quickly and moved on to the next company.” But it might also be, “We chose the wrong market, we didn’t understand the value drivers, we didn’t do enough planning and we did what we thought was cool but the market didn’t validate that.” ", "sentences": [{"341f": "How to Decrease the Odds That Your Startup Fails"}, {"06fb": "Many startup businesses — tech or otherwise — fail. In our industry we applaud the efforts for entrepreneurs to have tried and we know that today’s failure can bring the experience for tomorrow’s success. We also know that even though many of us who are experienced in startup successes & failures look at businesses and say, “That will never work” (as many people said about Uber) or “You can’t make any money in that business” (as many said about WhatsApp or Dropbox) and of course some entrepreneurs pull off extraordinary things we never thought possible."}, {"b031": "Trying outrageous new things or even trying mundane things but in new ways but with extreme quality & innovation is what fuels the tech startup industry."}, {"1cfa": "Yet I can’t help thinking there are many predictable failures that come from a lack of basic planning. It turns out that to build a successful company you ultimately need this strange thing called “revenue” that people don’t just hand you: You need to earn it. And there’s this other thing called “gross margin,” which shows the quality of your revenue. It says that selling an airplane ticket for $500 and getting paid a $5 fees by the airlines (1% gross margin) is not the same thing as selling $500 of software that you built (>90% gross margin)."}, {"b976": "If you don’t understand the basics of this I’ve written this primer on Startup economics you might appreciate — mostly to get journalists to stop saying, “That company isn’t even profitable!” when often that’s a stupid comment. Lately I’ve been having to say things I thought I’d never have to remind people, like, “getting to positive gross margin in several territories is a very low bar to claim success” or “profitable excluding marketing costs” is not actually a real thing."}, {"431b": "But today I want to give you advice on how to decrease your odds of failure in a startup. You may still fail but at least you’ll have less chance of failing for the wrong reasons. Most of this advice boils down to an argument in favor of basic planning before starting a company or raising money. In many ways the fact that it has become so cheap to start a company and relatively cheap to raise angel/seed money that we as an industry have gotten lazy on basic planning."}, {"2433": "The questions that a VC mulls before writing a check are precisely the questions you should be asking yourself."}, {"4bf2": "1. Market SizeIt’s ok to target a small market and you can probably build a niche business that is extremely valuable to you as an individual. But this isn’t likely to be a VC-backable business (which to be clear is totally ok). So if you go after a niche market then you need to raise small amounts of money, keep your costs exceedingly low, and get to cashflow positive as quickly as is possible. Running up big losses or trying to grow extraordinarily fast through paid marketing initiatives that have long payback periods will be the kiss of death for you. Marketing with long payback is precisely what requires venture capital."}, {"d7f1": "If your goal is to build a scalable startup then you need to focus on where large amounts of money are spent and/or where large amounts of money will be spent. I like to use the example of a company I backed called MakeSpace because it’s such an easy an obvious market to understand. MakeSpace provides physical storage. They pick up your stuff and drop it off at your house when you want it back. They photograph your stuff and provide a beautiful app where you can see what you have at any moment. So, let’s start with the basics. The US market is worth more than $25 billion and Europe is the same. Asia is smaller but growing as wealth increases in large, urban environments."}, {"c472": "So when Sam Rosen came to me with the idea of disrupting storage with a product that is priced cheaper than existing incumbents and he could build a product that is a better service I was intrigued."}, {"d063": "There are a million ways to either research your industries market size and you’re likely to have to do some basic estimations to figure out much of that is addressable to you. In our industry we call that a TAM (total addressable market) and I’m sure you can even Google methods for calculating a TAM."}, {"1904": "Let me be very direct. If you’re not even spending any time thinking about what your market could be you’re simply being lazy and unprepared. For example, if you’re going to build a travel planning website (as many, many startup entrepreneurs do) your basic research would be:"}, {"c14f": "Answering these questions and other basic planning will tell you where the value is accrued in the enormous travel category, who is serving this market today and you can find whether your entry into the market is likely to create a big business. Many startups in stead launch “cool” products that their friends and peers love initially but don’t yield large amounts of revenue or profits and certainly can’t support the costs structure."}, {"b8af": "Alternatively you may have figured out a way to capture a disproportionate amount of money in an under-served part of the market (as Airbnb have) and build an enormous company. But not doing basic research makes no sense. Equally, hoping to unseat TripAdvisor without understand their SEO strengths and how much it would cost to knock them down would be naïve."}, {"6a60": "2. Market StructureSize of market matters but so, too, does “market structure.” Are you going into an industry (say, music?) dominated by a few very large incumbents who control much of the distribution or are you going into a market that is “fragmented” where nobody controls the industry. You can enter either but your strategy must be very different and I can tell you that fragmented markets are easier to disrupt."}, {"280f": "For all of the talk about Salesforce.com controlling the CRM market I’m told they still have less than 20% market share. In a way, CRM is actually fairly fragmented but to enter that market you’d have to come up with a part of the value chain not dominated by Salesforce or Microsoft Dynamics today."}, {"6db6": "If you look at the structure of the travel industry above — of course we know that the hotel industry is fragmented while the airline industry is reasonable consolidated. So if you’re going to build a front-end booking structure for either it’s probably more lucrative to do so for hotels vs. airlines. In the airline industry if 2–3 majors won’t play ball with you then it’s hard to build a valuable user experience. And to be successful you’d have to figure out how to unseat the likes of Kayak with its existing brand and tech assets. No, thanks. Airbnb’s success is that it unleashed a totally new market of inventory for travelers tired of paying too much for hotels and an entire supply of people who want to make a little extra money to make ends meet."}, {"f339": "If you look at the storage market I referenced above, the largest player — Public Storage — does about $2.4 billion in sales and thus controls less than 10% of the market. The top 5 players combined control less than 25% of the market. Storage is what’s known as “highly fragmented,” meaning easier for a new entrant to get traction if it could design a better product / service / experience."}, {"36ac": "This is precisely why MakeSpace is growing so rapidly in its core markets: New York, Chicago and Washington DC where they can literally come and pick up your furniture and move it away and you never had to visit a facility and they do this at a cheaper price than incumbents by centralizing the location and thus having cheaper infrastructure costs. Sam did all this analysis before even deciding to build V1 of his software and before we put serious money behind him launching. He took seed money to test whether consumers cared and he started by not taking furniture to test the market with the least complexity."}, {"c8d1": "After a year in the market, MakeSpace was growing rapidly and our biggest issue was CAC (customer acquisition costs) relative to payback period (when we get our marketing investment back) and relative to LTV (lifetime value). The metrics were good but we wondered how much better they would be when we expanded our product. We first rolled out furniture in a newer market — Washington DC, and we increased ARPU (average revenue per month, per customer) by > 300%, we lowered our CAC (this is because the number of people who came to our site and converted went up) and thus we decreased our payback period."}, {"c546": "Boom. That is how great businesses are built. We did the planning work up front. We tested a simpler version of our product in the market first to prove product/market fit before raising a ton of capital, we build software to handle the complexity of the “mundane things” like driver routing, logistics tracking, warehouse management, photo processing, etc and we expanded our offering to test whether we could convert at better rates with an expanded offering."}, {"1f53": "And our software allowed us to offer: tighter pick-up windows, better utilization of “uploader staff” and to launch new products & services that I won’t discuss because they’re in development now."}, {"5df0": "If you create a business and start building products and go into an incubator or raise angel/seed money and don’t think about Market Size and Market Structure I only have one question: Why?"}, {"05be": "3. Incumbent Strengths & WeaknessesSo by now you should know your industry’s market size & structure. You should know at each part of the value chain where the value is controlled. But you also need to understand the incumbents’ strengths and weaknesses and their likely responses to your successes."}, {"857c": "In an industry where you’re reselling airplane tickets, for example, you need to think about the power they may or may not have over you. In the early days of every business the incumbents tend not to respond because you’re too small and insignificant. As they see you grow the become intrigued and probably analyze your business model and potential. If you start to hit your success stride they will respond."}, {"44dd": "As an investor that’s precisely what goes through my mind. If you’re not successful then who cares. But I’m investing on the assumption you will be successful, of course. So if you are then I have to ask myself, “What are the incumbents going to do when you grow?”"}, {"e341": "In the airline industry they have the ability to withhold inventory unless you’re an 800-pound gorilla where they can’t afford not to have your traffic while their competitors have it. But that’s harder to build in 2016 than it was in say 2005. If you figure out how to scale a video product inside of Facebook really, really, quickly they’re likely to allow it to happen for a while so they can study the positive & negative impacts on user experiences. But then they’re likely going to “traffic shape” so that you’re not too dominant. No platform is naïve enough to allow an outsider to grow enormously large in their ecosystem without an appropriate tax or benefit to them."}, {"7edf": "The perfect competitors are the ones where they unable to respond due to The Innovator’s Dilemma. Let me come back to MakeSpace to show you this point. Once we launched of course incumbents could try to create a product in which they pick up your stuff. At their scale this would be hard but doable. They could try to figure out how to do logistics, warehouse tracking, photo-processing and route management. It would take 2 years to catch up but believe me they have the capital to do so. They might struggle to hire a-players because, well, would you go work at Public Storage to build their software capabilities? Or would you go to a disruptor in stead?"}, {"bc57": "But assuming they were able to copy us. They literally can’t respond to our core differentiator. They can’t continually lower the costs of providing the storage because they’re hamstrung by these huge assets called “local storage facilities” that were their great differentiator as they pushed to be closer and closer to the customers for “convenience” although I’ve never heard that term from any storage customers."}, {"da49": "Our centralization is their achilles heel. It is Blockbuster video in the dawn of Netflix. And when you have a market where the competitor response can be that they throw money and resources at a problem but truly competing would be undermining their core business model and assets … BOOOOOM. Choose that market."}, {"f52e": "4. MicroeconomicsSmart investors think a lot about what we call “unit economics” or what is the economics of service one customers. We need to market to that customer to make them aware of our product or service. That marketing can be PR or SEO or influencer distribution or other forms of “unpaid” marketing. But in the end these all have a cost — it’s just hidden. PR requires time and effort from your team that isn’t spent elsewhere and thus is a real cost. SEO doesn’t just happen — it requires a content strategy, inbound links, relevancy, keyword strategies, etc. And influencers may help once or twice but ultimately nothing is free."}, {"29d2": "You may have paid marketing: SEM, Social Media Ads, Banner Ads, email lists, etc. Any way you slice it acquiring users and/or customers isn’t free. Then you need to understand the economic benefit to the user. It it just more time that they save? Efficiency? Will they save hard dollars? How much? Why? How will you charge? Will the user pay? Will a third-party pay (advertisers, data companies)? If a third-party ad: what CPMs do they pay today, what minimum volume of traffic will you need, will you sell direct or through an ad broker? Will you have premium ads or remnant ads?"}, {"6142": "Then you need to understand what these people are paying for similar products and services today. You can’t just make this up. If you want to do food delivery you need to know if the consumer pays or the restaurant pays and why. You need to understand what alternatives they have and how that will shape the amount of money they’ll spend. If you want to sell a “coffee in a box” subscription — is it premium to their buying Starbucks or Nespresso or cheaper? Will they supplement those purchases or replace it?"}, {"e1dd": "In any market you’re competing with one thing that all people must compete with, “share of wallet,” which in most markets is not unlimited (unless you’re selling extreme luxury goods)."}, {"95b7": "If you’re selling to moms — what are they spending for comparable products today? What will they not spending on if they’re ramping up on your products?"}, {"9cc5": "What price will your customer ultimately accept? This is based on “price elasticity” and you can google that to understand it better. Essentially products that are “inelastic” means price increases don’t affect demand much (think cigarettes, drugs, alcohol) and if they’re “elastic” it means small price increases can massively drop demand but equally large price decreases can massively increase demand."}, {"63d6": "What are the customer’s alternatives? In economics this is known as a “substitute product.” If you launch a fizzy water product you may think your competitors are Badoit and San Pelligrino but a substitute product might be flat water like Propel or cold green tea. Most products have substitutes and it’s worth knowing."}, {"9515": "Our portfolio company Ring had a new “security doorbell” which is truly a new market. But there are competitors (high end alarm systems like from ADT) and there are substitutes (like trying to use a less sophisticated product like DropCam, which is great as a camera but doesn’t have any of the security features built in and isn’t constructed to work well outside your house and in a secure way. That’s why Ring is amongst the fastest growing company in our portfolio. But to assume there are no substitutes would be wrong."}, {"e87c": "Of course the hardest competitor for most of us is simply customer inertia."}, {"3cb9": "CompetitionIf you want to succeed you need to study the competitors. You won’t likely launch into a market with nobody else present. You need to ask yourself honestly how your product or service is going to be significantly better in some way than the competition that exists in the market. You need a wedge. You may be cheaper, you may have more features, you may be easier to use, you may target one under-served demographic (think Bevel by Walker & Co) or you may just be better at sales & marketing than the competition with an equivalent (or even inferior) product. But not to study what else is happening in a market is wrong."}, {"ed73": "Why would you consider the competitors in a market AFTER you’ve spent 18 months building product on somebody else’s money and with a team you’ve pried away from their existing jobs. You only have your limited time on this Earth and to find out some competitor disadvantage after years of work is crazy to me. But it is often what happens with first-time entrepreneurs who are spoiled for choice with angel investors willing to fund with little thought or with the plethora of incubators that now exists who need a steady flow of options to hope to have the next big winner so they may not ask all the tough questions. But you should. Why wouldn’t you?"}, {"d08b": "HistoryFinally. Study your history. If you want to launch a company that competes with RottenTomatoes you need to study both why they are successful and what happened to the 20 other companies that tried to knock them off their stools. Do you think nobody has tried to better IMDB? I’ve seen 10 tries. Want to eradicate Evite? Why have so many before you failed? TripAdvisor? Yeah, we all know it’s imperfect. But it’s a fierce competitor that killed many a company before it."}, {"257b": "Every market is littered with companies that came before you. That doesn’t mean you won’t succeed. But not to ask yourself the questions of “what went wrong there” and “what could we learn from it” is to give up your biggest advantage: the ability to stand on the shoulders of those who came before you."}, {"f639": "ConclusionPlan. Think. Study. Test. Validate data. Validate firmly held positions. Know your planned sources of differentiation and adjust as you learn. Read plenty of “what went wrong” eulogies by founders and see what you can learn. But also understand that the lens from which they tell you the answer is both imperfect and has a narrative bias. The right answer might be (as I read recently), “we should have hired more people and raised more money, more quickly and either succeeded quickly or found out we were wrong quickly and moved on to the next company.” But it might also be, “We chose the wrong market, we didn’t understand the value drivers, we didn’t do enough planning and we did what we thought was cool but the market didn’t validate that.”"}], "author": "Mark Suster", "name": "2410", "parent": ""}