{"timestamp": "Mar 1, 2016", "child": "2412_1", "title": "What Do LPs Think of the Venture Capital Markets for 2016?", "content": "What Do LPs Think of the Venture Capital Markets for 2016? At the Upfront Summit in early February, we had a chance to have many off-the-record conversations with Limited Partners (LPs) who fund Venture Capital (VC) funds about their views of the market. While I’m not an LP, the following post represents my discussions with more than 100 LP firms — specifically ones that do fund VCs — and full survey data from 73 firms, so I’ve tried to capture the essence of what I’ve learned. We All Know That Dollars into Venture Have Gone Up …As a starting point, we know that the dollars into venture have steadily rebounded to pre great-recession levels, with just under $30 billion committed to US technology venture capital in 2015. While there is much discussion about VCs starting to pull back on their investments into startups, the LPs we surveyed don’t expect to slow the pace of investment into VC funds themselves — at least for the foreseeable future. …But LPs Have Been Putting Out More Money Than They Are Getting BackLPs have been feeling great about venture capital due to holding valuable paper positions in companies like Uber, Lyft, Airbnb, Dropbox, all of which they feel confident will drive large cash distributions in the future. However, they have been sending VCs far more investment checks in the last ten years than they’ve gotten back as distributions. In fact, if you add the capital flows of the past ten years, there have been just shy of $50 billion in net cash outlays. And that’s real cash that LPs can’t put to work in other asset classes. So one problem often not talked about is that if LPs don’t get money back and accumulate more cash outflows, eventually they will either have to pare back investments into venture or they’ll have to increase the percentage of dollars they allocate to venture (at the expense of other asset types). LPs Still Believe Strongly in Venture Capital as a Diverse Source of ReturnsThe good news for our industry is that the LPs who fund the VC industry are still very big believers in the long-term gains they will get from venture and are still allocating capital to the industry in good times and bad. That’s money that fuels our startup ecosystems. In our poll of 73 LP funds, we saw only 7% who felt they were overweight in venture given the current market climate, versus 22% of the firms who are actually looking to grow their dollars in venture. And while there is a narrative that most LPs only want to invest in the long-standing Silicon Valley brands that have existed for the past 40 years, there is evidence that many LPs understand that it is possible for new entrants in our industry to stake out grounds of differentiation. In just over a decade, new firms like USV, Foundry, Spark, True Ventures, First Round, Greycroft (I might add Upfront) have made names for themselves from a non-traditional Silicon Valley stance. More recently, Thrive, Homebrew, IA Ventures, K9, Social + Capital, Cowboy, SK Capital, Ludlow, Forerunner and many, many others have emerged as newly differentiated brands. There are so many I fear that listing a few will get me in trouble with the many I didn’t list. Sorry! But here’s the chart that should hearten all new firms … 40% of LPs tell us that they’re looking to add new names to their rosters. LPs See The Over-Valuations and Don’t Like ItAll isn’t completely rosy in the LP views of the venture industry. LPs have followed the recent press about the over-valuation and over-funding of the startup industry, and they experience these phenomena first hand. Some 75% of LPs polled said they are concerned about investment pace, burn and valuations; for now, only 6% seem “deeply concerned.” I suspect that over the next 18 months, they’ll see another phenomenon that they likely haven’t seen since 2008–09: mark-downs of the VCs’ portfolios. This strangely may come even more quickly in the more successful funds, because any funds (ours included) who still hold some public stock from a recent IPO will likely be seeing write-downs sooner due to the immediacy and transparency of public stocks being repriced. But the problem for LPs is that as VCs write bigger checks with increased frequency, these firms go “back in the market” to raise funds more quickly than in the past. A normal VC fund raises a new fund every three years if they are strong performers. Some are slightly faster — two and a half years — and sometimes it takes longer to deploy capital, closer to four years. In recent years, some funds have literally raised new funds inside of 18 months — staggering amounts of capital at that. I suspect those days will end soon, and 61% of LPs polled said they felt VCs were coming back to market too quickly. The Biggest Area of Concern is Late Stage InvestmentsWith valuations rising fastest in late-stage venture and the competition that is well-known from corporate VCs, mutual funds, hedge funds (and even LPs), it is unsurprising that LPs are most concerned about late-stage VC. 68% of LPs surveyed expressed caution that the late-stage part of the market is over-valued. But of course, for every angle of the market where one person sees caution, another spots opportunities. Some LPs have privately speculated that later-stage VCs may have a field day in the next 18 months, buying up large positions in firms with strong revenue at attractive prices given the recent squeeze on funding. It’s not an opportunity for the weak of stomach, as these deals are hard to get done and even harder to keep on course. But there’s no doubt, some will make money.Another Area of Concern is in the Seed Investor ClassI have also heard LPs express concern over the last few years about the seed stage of venture. One narrative is that too many funds have been created, and without a strong sense of differentiation, there will be too many mediocre seed funds. Another big area of concern expressed by LPs is that some seed funds may get “squeezed” in both good scenarios and bad. In good scenarios, they don’t have funds large enough to follow their winners. In bad markets, they can be wiped out by recaps and liquidation preferences unless they save enough reserves to protect their positions. The data itself bears out some of these fears. 89% of LPs survey expressed some level of concern about the seed market. 65% said they will invest in seed funds but are very discerning about which ones, and 23% expressed concern that there are just too many seed funds — they’re worried about capacity. Anecdotally, most LPs believe the best seed funds still deliver superior returns to other parts of the market, but they simply can’t put enough dollars to work in the handful they truly respect. Many Seed Investors Have Solved the Cash Problem with Opportunity FundsA few years ago, the best seed funds responded to the challenge of being cash-strapped by raising “opportunity funds,” which can invest in the seed investor’s best deals as those deals grow. Of course, this raises a host of questions about conflicts of interest, valuations, and whether early-stage investors are well-suited to invest in later-stage deals. But both seed investors and LPs alike agree that as long as these programs are managed sensibly, their existence is useful. A whopping 85% of LPs were favorable to opportunity funds as long as they were done with a pragmatic approach and with favorable economics. Most LPs Don’t Believe That Traditional VCs are Being SqueezedOccasionally, some of the larger funds will argue that traditional VCs will be “squeezed.” They say that “the big guys are getting bigger and can compete for the full lifecycle of investments” on one side, and “the seed investors are out-hustling traditional VC” on the other side. Frankly, I’ve never believed this argument. As a traditional VC, the growth of seed funds has been a blessing to me because it increases the total number of startups for us to evaluate. We’ve also become very adept at partnering with seed funds. And other than a handful of deals that scale in the blink of an eye, I really haven’t felt too much pressure from bigger VCs moving down into our territory. Funds that are more comfortable writing $20 million checks in more proven businesses simply don’t want to also compete for less proven deals in need of $4–5 million. Luckily, LPs seem to agree with this thesis. Only 17% bought the premise that traditional VCs are being squeezed, versus 34% who prefer to focus the majority of their efforts on traditional A/B round VC funds. And of course, 50% want a good balance across all stages: seed, traditional and growth. Perhaps the Biggest Change in the LP Ecosystem is the Number Now Seeking Direct InvestmentsThe booming tech markets and the dollars being allocated in the venture sector have created one seldom-discussed consequence over the past three years — the sheer number of LP dollars looking for “direct investment” (i.e., dollars going directly into portfolio companies vs. the funds themselves). Nearly 40% of all LPs surveyed said that direct investments were becoming an important part of their program (17% said they’re very important), and a further 44% of LPs are opportunistically doing direct investments. There are even LP fund-of-funds who raise capital with a main marketing pitch of providing better access to direct investments. SummaryLPs remain staunch supporters of the venture capital industry, and their investment pace into VC seems likely to hold steady for the next one to two years (barring any unforeseen negative market events). This support will start to meet headwinds in the next three to four years if our industry doesn’t find a way to drive more exits and recycle capital back into the ecosystem. Without some cash distributions, eventually LPs will become stretched. I expect the LP conversations in the next 12–18 months to be about the inevitable mark-down of VC portfolios; however, many LPs are long on venture capital for the same reasons I am. Any correction will be followed by the long march of technology disruption and the profits disproportionally allocated to the winners. The full presentation can be downloaded on SlideShare or viewed below Final upfront lp survey data 2016 from Mark Suster ", "sentences": [{"c354": "What Do LPs Think of the Venture Capital Markets for 2016?"}, {"717f": "At the Upfront Summit in early February, we had a chance to have many off-the-record conversations with Limited Partners (LPs) who fund Venture Capital (VC) funds about their views of the market. While I’m not an LP, the following post represents my discussions with more than 100 LP firms — specifically ones that do fund VCs — and full survey data from 73 firms, so I’ve tried to capture the essence of what I’ve learned."}, {"b44f": "We All Know That Dollars into Venture Have Gone Up …As a starting point, we know that the dollars into venture have steadily rebounded to pre great-recession levels, with just under $30 billion committed to US technology venture capital in 2015. While there is much discussion about VCs starting to pull back on their investments into startups, the LPs we surveyed don’t expect to slow the pace of investment into VC funds themselves — at least for the foreseeable future."}, {"f015": "…But LPs Have Been Putting Out More Money Than They Are Getting BackLPs have been feeling great about venture capital due to holding valuable paper positions in companies like Uber, Lyft, Airbnb, Dropbox, all of which they feel confident will drive large cash distributions in the future. However, they have been sending VCs far more investment checks in the last ten years than they’ve gotten back as distributions. In fact, if you add the capital flows of the past ten years, there have been just shy of $50 billion in net cash outlays."}, {"68ca": "And that’s real cash that LPs can’t put to work in other asset classes. So one problem often not talked about is that if LPs don’t get money back and accumulate more cash outflows, eventually they will either have to pare back investments into venture or they’ll have to increase the percentage of dollars they allocate to venture (at the expense of other asset types)."}, {"863a": "LPs Still Believe Strongly in Venture Capital as a Diverse Source of ReturnsThe good news for our industry is that the LPs who fund the VC industry are still very big believers in the long-term gains they will get from venture and are still allocating capital to the industry in good times and bad. That’s money that fuels our startup ecosystems. In our poll of 73 LP funds, we saw only 7% who felt they were overweight in venture given the current market climate, versus 22% of the firms who are actually looking to grow their dollars in venture."}, {"dd6d": "And while there is a narrative that most LPs only want to invest in the long-standing Silicon Valley brands that have existed for the past 40 years, there is evidence that many LPs understand that it is possible for new entrants in our industry to stake out grounds of differentiation. In just over a decade, new firms like USV, Foundry, Spark, True Ventures, First Round, Greycroft (I might add Upfront) have made names for themselves from a non-traditional Silicon Valley stance. More recently, Thrive, Homebrew, IA Ventures, K9, Social + Capital, Cowboy, SK Capital, Ludlow, Forerunner and many, many others have emerged as newly differentiated brands. There are so many I fear that listing a few will get me in trouble with the many I didn’t list. Sorry!"}, {"206f": "But here’s the chart that should hearten all new firms … 40% of LPs tell us that they’re looking to add new names to their rosters."}, {"ce61": "LPs See The Over-Valuations and Don’t Like ItAll isn’t completely rosy in the LP views of the venture industry. LPs have followed the recent press about the over-valuation and over-funding of the startup industry, and they experience these phenomena first hand. Some 75% of LPs polled said they are concerned about investment pace, burn and valuations; for now, only 6% seem “deeply concerned.”"}, {"723f": "I suspect that over the next 18 months, they’ll see another phenomenon that they likely haven’t seen since 2008–09: mark-downs of the VCs’ portfolios. This strangely may come even more quickly in the more successful funds, because any funds (ours included) who still hold some public stock from a recent IPO will likely be seeing write-downs sooner due to the immediacy and transparency of public stocks being repriced."}, {"7cda": "But the problem for LPs is that as VCs write bigger checks with increased frequency, these firms go “back in the market” to raise funds more quickly than in the past. A normal VC fund raises a new fund every three years if they are strong performers. Some are slightly faster — two and a half years — and sometimes it takes longer to deploy capital, closer to four years. In recent years, some funds have literally raised new funds inside of 18 months — staggering amounts of capital at that. I suspect those days will end soon, and 61% of LPs polled said they felt VCs were coming back to market too quickly."}, {"f784": "The Biggest Area of Concern is Late Stage InvestmentsWith valuations rising fastest in late-stage venture and the competition that is well-known from corporate VCs, mutual funds, hedge funds (and even LPs), it is unsurprising that LPs are most concerned about late-stage VC. 68% of LPs surveyed expressed caution that the late-stage part of the market is over-valued."}, {"d3dc": "But of course, for every angle of the market where one person sees caution, another spots opportunities. Some LPs have privately speculated that later-stage VCs may have a field day in the next 18 months, buying up large positions in firms with strong revenue at attractive prices given the recent squeeze on funding. It’s not an opportunity for the weak of stomach, as these deals are hard to get done and even harder to keep on course. But there’s no doubt, some will make money.Another Area of Concern is in the Seed Investor ClassI have also heard LPs express concern over the last few years about the seed stage of venture. One narrative is that too many funds have been created, and without a strong sense of differentiation, there will be too many mediocre seed funds. Another big area of concern expressed by LPs is that some seed funds may get “squeezed” in both good scenarios and bad. In good scenarios, they don’t have funds large enough to follow their winners. In bad markets, they can be wiped out by recaps and liquidation preferences unless they save enough reserves to protect their positions."}, {"170a": "The data itself bears out some of these fears. 89% of LPs survey expressed some level of concern about the seed market. 65% said they will invest in seed funds but are very discerning about which ones, and 23% expressed concern that there are just too many seed funds — they’re worried about capacity. Anecdotally, most LPs believe the best seed funds still deliver superior returns to other parts of the market, but they simply can’t put enough dollars to work in the handful they truly respect."}, {"7bf4": "Many Seed Investors Have Solved the Cash Problem with Opportunity FundsA few years ago, the best seed funds responded to the challenge of being cash-strapped by raising “opportunity funds,” which can invest in the seed investor’s best deals as those deals grow. Of course, this raises a host of questions about conflicts of interest, valuations, and whether early-stage investors are well-suited to invest in later-stage deals. But both seed investors and LPs alike agree that as long as these programs are managed sensibly, their existence is useful. A whopping 85% of LPs were favorable to opportunity funds as long as they were done with a pragmatic approach and with favorable economics."}, {"012e": "Most LPs Don’t Believe That Traditional VCs are Being SqueezedOccasionally, some of the larger funds will argue that traditional VCs will be “squeezed.” They say that “the big guys are getting bigger and can compete for the full lifecycle of investments” on one side, and “the seed investors are out-hustling traditional VC” on the other side. Frankly, I’ve never believed this argument. As a traditional VC, the growth of seed funds has been a blessing to me because it increases the total number of startups for us to evaluate. We’ve also become very adept at partnering with seed funds."}, {"37de": "And other than a handful of deals that scale in the blink of an eye, I really haven’t felt too much pressure from bigger VCs moving down into our territory. Funds that are more comfortable writing $20 million checks in more proven businesses simply don’t want to also compete for less proven deals in need of $4–5 million."}, {"b5b7": "Luckily, LPs seem to agree with this thesis. Only 17% bought the premise that traditional VCs are being squeezed, versus 34% who prefer to focus the majority of their efforts on traditional A/B round VC funds. And of course, 50% want a good balance across all stages: seed, traditional and growth."}, {"f5fe": "Perhaps the Biggest Change in the LP Ecosystem is the Number Now Seeking Direct InvestmentsThe booming tech markets and the dollars being allocated in the venture sector have created one seldom-discussed consequence over the past three years — the sheer number of LP dollars looking for “direct investment” (i.e., dollars going directly into portfolio companies vs. the funds themselves)."}, {"33cb": "Nearly 40% of all LPs surveyed said that direct investments were becoming an important part of their program (17% said they’re very important), and a further 44% of LPs are opportunistically doing direct investments. There are even LP fund-of-funds who raise capital with a main marketing pitch of providing better access to direct investments."}, {"06e7": "SummaryLPs remain staunch supporters of the venture capital industry, and their investment pace into VC seems likely to hold steady for the next one to two years (barring any unforeseen negative market events). This support will start to meet headwinds in the next three to four years if our industry doesn’t find a way to drive more exits and recycle capital back into the ecosystem. Without some cash distributions, eventually LPs will become stretched. I expect the LP conversations in the next 12–18 months to be about the inevitable mark-down of VC portfolios; however, many LPs are long on venture capital for the same reasons I am. Any correction will be followed by the long march of technology disruption and the profits disproportionally allocated to the winners."}, {"2f82": "The full presentation can be downloaded on SlideShare or viewed below"}, {"8e6c": "Final upfront lp survey data 2016 from Mark Suster"}], "author": "Mark Suster", "name": "2412", "parent": ""}