{"timestamp": "Feb 26, 2016", "child": "2413_1", "title": "Spotting, Nurturing and Mentoring Talent — The Power of Troy Carter", "content": "Spotting, Nurturing and Mentoring Talent — The Power of Troy Carter I recently sat down with Troy Carter to talk about what he does and why he believes it is applicable to venture capital. The “what” is well known in LA circles — Troy discovered a little known young singer named Stefani Joanne Angelina Germanotta aka Lady Gaga and helped her launch her career. The “what” Troy Carter does also led him to be an early investor in Uber, Lyft, Dropbox, Warby Parker and several other great startups of the last era. And more recently he has turned that into a fund called CrossCulture VC such that many in Silicon Valley and beyond now know Troy as well. Troy represents what I believe the best magic of Los Angeles is — the merging together of creative talent with technical talent and he brings the lessons learned from these two fields into investments nationally. But can you really cross over from spotting music talent to spotting tech talent? And can the lessons of what be applied to the other? I think you’ll learn more in watching the 20-minute interview that Troy Carter and I did than you will in most tech interviews because he cuts down to the raw essence of what it takes any product to be discovered and nurtured and the power of being able to connect the right emerging artist with the right influencers in a market. Influencers are inundated with requests for their time and have to develop filters of whom they trust and therefore who can refer them deals. The old saying in Hollywood is that “It’s not what you know but whom you know” but the truth is always more deceptive and the tech industry is a lot more susceptible to this notion than you may think. Even an extraordinary engineer or product lead who have built a breakthrough product aren’t guaranteed success unless they can get access to capital, get much needed press to drive low-cost customer acquisition and persuade fickle business leaders to join their company and help them shape their businesses beyond tech innovation. And whom you know is really just about who is willing to go to bat for you, break through filters, and vouch for the quality of your product and of you. So what did it take for Gaga to break out and what does Troy preach to startups? I think the common denominator and the one word is ‘hustle’ When Troy and Lady Gaga were introduced the market had been in a free fall from the financial crisis of 2007–09 and Troy had had some setbacks professionally while Lady Gaga was sleeping on her grandmother’s couch in West Virginia, having just been dropped by Def Jam Records. They were already at the bottom and as Troy says, when you’re at your bottom “You can’t fall off the floor, so let’s get to work!” And as with tech startups there is truth to the adage, “The harder I work the luckier I get.” Lady Gaga played 4–5 clubs a night in Los Angeles and New York when she was a relatively undiscovered talent. They had a philosophy called “The first 50,” which was a metaphor for “how can we find the first 50 fans” (or super fans) and win them over. The cross-over to tech was immediately apparent to me and probably intuitively to Troy even though he didn’t know it. In the 90’s most of us studied, “Crossing the Chasm” by Geoffrey Moore in which he preached serving a narrow market that are passionate fans about your tech product before trying to bring it to the masses. The hard core supporters become your “referenceable accounts” and Moore’s teachings probably influence us today subconsciously more than many in the tech industry probably realize. In many ways this was the precursor to the MVP philosophy our era espoused by Steve Blank and the ideas we discuss around product/market fit. So I guess Troy and Lady Gaga were touring in search of this product / market fit. They were playing small clubs to the gay community (her early ardent fans or “first 50”) and they were getting a warm reception so they wanted to double down on this community. They hired a consultant in the LGBT community who had relationships with all of the most popular gay clubs (who you know) and they built from there. The history of tech will always tell you there was a defining moment for companies (like Twitter at SXSW in 2007) but the reality is often more nuanced. Same with Gaga “It was a series of inflection points. It wasn’t one explosive thing that just happened. It was us planting seeds in every place.” But Gaga wasn’t like every product. She was disruptive. So the radio stations wouldn’t play her. They told Troy that it wasn’t a fit for the stations, it wasn’t pop music and they didn’t want to play it. So Troy and Lady Gaga were amongst the earliest artists that turned to social media and tech platforms to break out. If you haven’t read my post about how Justin Bieber broke out, you should. It’s the same story. So Troy was early in music to learn about the power of YouTube, Facebook, Twitter and so forth. And by using tech products they were able to market themselves to gay audiences globally where US radio in a way would have limited their success. When they couldn’t get US radio stations to play Gaga Troy got the idea to have her music played in Canada and used that to persuade neighboring radio stations in places like Buffalo to also play her music and he built off of early successes to spread the music to contiguous markets. That is PRECISELY what Shep Gordon said he did to help Alice Cooper break out two decades before. When I listen to Troy talk through this stories and others the parallels between our industries are more obvious. And when you want to understand the character of Troy Carter I would note one subtle thing that could easily be lost. Watch Troy as I interview him. He really is paying unbelievably close attention to every question I ask. He’s looking intently at me the whole time, he’s trying to derive meaning from what I’m asking him. He’s earnest trying to answer each question with the insights he learned. I point this out because over the last decade I’ve interviewed hundreds of people. Few pay this level of attention in an interview and few engage this completely in a conversation. I honestly think this is one of Troy’s intangibles. He seeks to really understand the party he’s sitting with and dedicate himself completely to that understanding in the moment. I say that because that’s what I experienced in my private meetings with Troy as well. And in a world where most people you’re sitting with are simply waiting for you to stop talking so they can say whatever is in their heads already — this level of paying attention, trying to understand the person you’re sitting with & truly engaging is rare. I point out this subtlety because it is precisely the subtleties in life the determine ordinary performance from extraordinary. I believe the most successful people in business and life are the people who really pay attention to these details, who truly try to understand the motives and intentions of the person with whom they’re interacting and try to find common ground (or decide this isn’t a person they can work with). So this essence is what I believe has allowed Troy to cross over so successfully. Troy says 5 years ago he had never heard of “venture capital” yet when I’ve seen him be interviewed before or even in our discussions he uses industry terms in technology and venture that display a sophisticated understanding of the way our industry works in a way that only a truly engaged and curious person could master in a short period of time. This interview was done on the investor-only day of the Upfront Summit and was remarked by many as “the highlight of the day” and for the first time is now being released to anybody who would like to see it. We covered the Gaga breakout story but also But we also talked about how: But I thought Troy really nailed it when he talked about his investment philosophy going forward. He said that “Hip hop is a multi-billion dollar business and it was built off an opportunity that nobody else saw because they didn’t understand the culture.” And he knows how important it is to have role models for young Black and Latino entrepreneurs both as fellow entrepreneurs and as investors. And he said it so elequently “If you can’t see it, you can’t be it” So inspiration plays a large role in encouraging others in the community to know they can do it as well. And his venture capital philosophy of CrossCulture VC, “You have a huge demographic shift that’s happening in America. Globally.” “Mattel stepped up and changed the face of Barbie. Barbie looks a lot different than she did decades ago. Or even three weeks ago.” And in serving these markets authenticity matters. And CrossCulture seems to be at the ground floor of this opportunity. I hope I’ve persuaded you that 20 minutes watching Troy speak is well worth your time. Appendix: ** Note if you watch the end of the video you’ll see that I asked for this to be “off the record” but the reality is that Troy wasn’t pitching his fund but just asking my questions so I checked and we were ok releasing even this last ‘confidential’ part of the interview for that reason. ", "sentences": [{"4968": "Spotting, Nurturing and Mentoring Talent — The Power of Troy Carter"}, {"d684": "I recently sat down with Troy Carter to talk about what he does and why he believes it is applicable to venture capital. The “what” is well known in LA circles — Troy discovered a little known young singer named Stefani Joanne Angelina Germanotta aka Lady Gaga and helped her launch her career."}, {"2522": "The “what” Troy Carter does also led him to be an early investor in Uber, Lyft, Dropbox, Warby Parker and several other great startups of the last era. And more recently he has turned that into a fund called CrossCulture VC such that many in Silicon Valley and beyond now know Troy as well."}, {"5912": "Troy represents what I believe the best magic of Los Angeles is — the merging together of creative talent with technical talent and he brings the lessons learned from these two fields into investments nationally. But can you really cross over from spotting music talent to spotting tech talent? And can the lessons of what be applied to the other?"}, {"3bf3": "I think you’ll learn more in watching the 20-minute interview that Troy Carter and I did than you will in most tech interviews because he cuts down to the raw essence of what it takes any product to be discovered and nurtured and the power of being able to connect the right emerging artist with the right influencers in a market. Influencers are inundated with requests for their time and have to develop filters of whom they trust and therefore who can refer them deals."}, {"4ceb": "The old saying in Hollywood is that “It’s not what you know but whom you know” but the truth is always more deceptive and the tech industry is a lot more susceptible to this notion than you may think. Even an extraordinary engineer or product lead who have built a breakthrough product aren’t guaranteed success unless they can get access to capital, get much needed press to drive low-cost customer acquisition and persuade fickle business leaders to join their company and help them shape their businesses beyond tech innovation."}, {"5f79": "And whom you know is really just about who is willing to go to bat for you, break through filters, and vouch for the quality of your product and of you."}, {"eab9": "So what did it take for Gaga to break out and what does Troy preach to startups?"}, {"8bc1": "I think the common denominator and the one word is ‘hustle’"}, {"1381": "When Troy and Lady Gaga were introduced the market had been in a free fall from the financial crisis of 2007–09 and Troy had had some setbacks professionally while Lady Gaga was sleeping on her grandmother’s couch in West Virginia, having just been dropped by Def Jam Records. They were already at the bottom and as Troy says, when you’re at your bottom"}, {"cde1": "“You can’t fall off the floor, so let’s get to work!”"}, {"020c": "And as with tech startups there is truth to the adage, “The harder I work the luckier I get.” Lady Gaga played 4–5 clubs a night in Los Angeles and New York when she was a relatively undiscovered talent. They had a philosophy called “The first 50,” which was a metaphor for “how can we find the first 50 fans” (or super fans) and win them over."}, {"1b5e": "The cross-over to tech was immediately apparent to me and probably intuitively to Troy even though he didn’t know it. In the 90’s most of us studied, “Crossing the Chasm” by Geoffrey Moore in which he preached serving a narrow market that are passionate fans about your tech product before trying to bring it to the masses. The hard core supporters become your “referenceable accounts” and Moore’s teachings probably influence us today subconsciously more than many in the tech industry probably realize. In many ways this was the precursor to the MVP philosophy our era espoused by Steve Blank and the ideas we discuss around product/market fit."}, {"76f4": "So I guess Troy and Lady Gaga were touring in search of this product / market fit."}, {"dc5f": "They were playing small clubs to the gay community (her early ardent fans or “first 50”) and they were getting a warm reception so they wanted to double down on this community. They hired a consultant in the LGBT community who had relationships with all of the most popular gay clubs (who you know) and they built from there. The history of tech will always tell you there was a defining moment for companies (like Twitter at SXSW in 2007) but the reality is often more nuanced. Same with Gaga"}, {"cb8a": "“It was a series of inflection points. It wasn’t one explosive thing that just happened. It was us planting seeds in every place.”"}, {"b45a": "But Gaga wasn’t like every product. She was disruptive. So the radio stations wouldn’t play her. They told Troy that it wasn’t a fit for the stations, it wasn’t pop music and they didn’t want to play it. So Troy and Lady Gaga were amongst the earliest artists that turned to social media and tech platforms to break out. If you haven’t read my post about how Justin Bieber broke out, you should. It’s the same story. So Troy was early in music to learn about the power of YouTube, Facebook, Twitter and so forth. And by using tech products they were able to market themselves to gay audiences globally where US radio in a way would have limited their success."}, {"52ab": "When they couldn’t get US radio stations to play Gaga Troy got the idea to have her music played in Canada and used that to persuade neighboring radio stations in places like Buffalo to also play her music and he built off of early successes to spread the music to contiguous markets. That is PRECISELY what Shep Gordon said he did to help Alice Cooper break out two decades before."}, {"7918": "When I listen to Troy talk through this stories and others the parallels between our industries are more obvious. And when you want to understand the character of Troy Carter I would note one subtle thing that could easily be lost. Watch Troy as I interview him. He really is paying unbelievably close attention to every question I ask. He’s looking intently at me the whole time, he’s trying to derive meaning from what I’m asking him. He’s earnest trying to answer each question with the insights he learned. I point this out because over the last decade I’ve interviewed hundreds of people. Few pay this level of attention in an interview and few engage this completely in a conversation."}, {"af0e": "I honestly think this is one of Troy’s intangibles. He seeks to really understand the party he’s sitting with and dedicate himself completely to that understanding in the moment. I say that because that’s what I experienced in my private meetings with Troy as well. And in a world where most people you’re sitting with are simply waiting for you to stop talking so they can say whatever is in their heads already — this level of paying attention, trying to understand the person you’re sitting with & truly engaging is rare."}, {"2d55": "I point out this subtlety because it is precisely the subtleties in life the determine ordinary performance from extraordinary. I believe the most successful people in business and life are the people who really pay attention to these details, who truly try to understand the motives and intentions of the person with whom they’re interacting and try to find common ground (or decide this isn’t a person they can work with)."}, {"a241": "So this essence is what I believe has allowed Troy to cross over so successfully. Troy says 5 years ago he had never heard of “venture capital” yet when I’ve seen him be interviewed before or even in our discussions he uses industry terms in technology and venture that display a sophisticated understanding of the way our industry works in a way that only a truly engaged and curious person could master in a short period of time."}, {"8a66": "This interview was done on the investor-only day of the Upfront Summit and was remarked by many as “the highlight of the day” and for the first time is now being released to anybody who would like to see it."}, {"8877": "We covered the Gaga breakout story but also"}, {"bed0": "But we also talked about how:"}, {"8b6c": "But I thought Troy really nailed it when he talked about his investment philosophy going forward. He said that"}, {"98e7": "“Hip hop is a multi-billion dollar business and it was built off an opportunity that nobody else saw because they didn’t understand the culture.”"}, {"039d": "And he knows how important it is to have role models for young Black and Latino entrepreneurs both as fellow entrepreneurs and as investors. And he said it so elequently"}, {"a587": "“If you can’t see it, you can’t be it”"}, {"0b01": "So inspiration plays a large role in encouraging others in the community to know they can do it as well."}, {"e78a": "And his venture capital philosophy of CrossCulture VC,"}, {"3c52": "“You have a huge demographic shift that’s happening in America. Globally.” “Mattel stepped up and changed the face of Barbie. Barbie looks a lot different than she did decades ago. Or even three weeks ago.”"}, {"96ef": "And in serving these markets authenticity matters. And CrossCulture seems to be at the ground floor of this opportunity. I hope I’ve persuaded you that 20 minutes watching Troy speak is well worth your time."}, {"2b52": "Appendix:"}, {"1c4d": "** Note if you watch the end of the video you’ll see that I asked for this to be “off the record” but the reality is that Troy wasn’t pitching his fund but just asking my questions so I checked and we were ok releasing even this last ‘confidential’ part of the interview for that reason."}], "author": "Mark Suster", "name": "2413", "parent": ""}