{"timestamp": "Feb 24, 2016", "child": "2414_1", "title": "MakeSpace Raises an Additional $17.5 million and Unveils Strategy to Make Public Storage the Next Blockbuster Video", "content": "MakeSpace Raises an Additional $17.5 million and Unveils Strategy to Make Public Storage the Next Blockbuster Video MakeSpace, the leading provider of next-generation storage for consumers, today announced an additional $17.5 million in funding on TechCrunch led by Harmony Partners and Upfront Ventures to double its footprint of 3 cities (New York, Chicago & Washington DC) to 6 in 2016. We raised this capital in what has increasingly become a difficult market for fund raising so I’d like to share with you some details on how we get it done. StrategyWhen Sam Rosen brought me the idea of MakeSpace 3 years ago we both marveled at some obvious facts. The public storage market was $24 billion (now approaching $27 billion) in the US alone (> $50 billion worldwide) and the largest player in the space — Public Storage — had less than 10% market share. Fragmented markets can be a great target for disruption. Public Storage does about $2.4 billion in revenue and has a public enterprise value of $44 billion. Why is it so valuable? Basically it’s traded as a Real Estate Investment Trust (REIT) and its investors likely see a large property portfolio with a steady stream of cashflows from full facilities and the ability of storage companies to increase prices every year on captive customers who in our research mostly won’t drive more than a few miles to take their goods to storage. And where they see stability we saw a sitting duck. They are the classic case of the Innovator’s Dilemma because they fundamentally can’t innovate on their product and can’t lower costs or their business craters. They have high-priced property and zero innovation. And it’s easy to run circles around them as our product differentiation shows. Incumbents became increasingly annoyed with our successes in the country’s largest market — NYC — that they started even taking out ads against us. Little old us. Sound familiar? Public Storage is the Blockbuster Video of their industry and we set out to build Netflix. If you want to know how that worked out for the respective parties see the chart below. It’s no wonder incumbents don’t want us to exist. The Early YearsI’m a stickler for focus, being efficient with capital and building out operational excellence, so our strategy initially was very constrained. We wanted to launch in one market (the largest — NYC), with a simple product offering (bins, not furniture) and prove out product/market fit. Check. It worked perfectly. In just one year we captured 2% of all new customers in NYC who wanted to store household items other than furniture. Here’s Sam in the early days taking our first ever delivery of bins. Expanding to CitiesMy partners were perhaps the best retail investors through the 1980's/90's having backed companies like Costco, Starbucks, Dick’s Sporting Goods, Ulta Beauty & Cosmetics amongst many others. They had instilled in me a discipline that few well-funded but inexperienced startups have. They basically said that retail businesses that worked well in one city or location often struggled when they went multi city. There are some obvious reasons for this. The most important is management bandwidth. What you could previously do in a day’s drive now required remote management and processes. Companies have to decide how much centralization or decentralization of resources should exist in, for example, marketing: Local campaigns & budgets or centrally coordinated ones? There are no easy answers. So at MakeSpace we decided to hold our product constant (bins) and learn how to build multi-cities. We launched in Chicago and Washington DC for reasons I’ll withhold for trade secrets but our goal was to build an “operating playbook” for a market and a “marketing playbook” and build a management layer that could handle coordination across cities. And while Sam has always been the face of the business one of our secret weapons was that we had Rahul Gandhi running operations. This division of labor and responsibilities has proved invaluable and they are both on the board so we have good and robust debates. I’ll admit that this process was more difficult than any of us expected. It tested our beliefs about pricing, products and marketing overall of our service. We had long debates about what the market differences were and what our best responses were. Honestly? This was painful. And it happened as we were contemplating fund raising. We knew we could ramp up marketing spend and show increased user numbers but we felt that was the wrong decision because our CAC was higher than we wanted, our conversion was lower than we wanted and our payback was too long. So we went in the opposite direction. We decided to cut costs for a few months until we figured out our best approach. Growing our Product LinesWe realized two things in our product-line extension. First, customers in these new markets didn’t want to buy in “bins” and they demanded furniture. Of course we always knew the market would want furniture and we knew that 50% of the market wouldn’t store with us unless we had furniture. But taking furniture meant increasing product complexity to better handle warehouse management, truck sizes, number of pick-up /deliver agents and even insurance policies. So we took a breather to build our software and processes before launching. We knew we had competitors in the market offering furniture but we didn’t want to be distracted by what our competitors were doing — we wanted to launch the product we wanted from a position of strength. We quietly then launched furniture in Chicago and Washington DC and — BOOM — game changer. The Perfect StormWe figured out a whole bunch of things that came together at the same time in what I can only describe as “product / market fit.” Our ARPU tripled (for obvious reasons) our CAC went down by 50%, our conversion rate on our home page went up by 350% and our payback on CAC was cut in half. It was a perfect storm. We had also built out a sales team and a marketing team and they had become fully operational. The truth is that we also became better at telling our story. Customers knew how to buy our products better because in stead of packaging and pricing the way we thought made sense “by the bin” they were able to more effectively compare us to local alternatives. The above graphic shows our current pricing for NYC storage and you can see a direct comparison with our legacy competitor in NYC with the upper tiers used more for small businesses. We started sharing our data with Mark Lotke at Harmony Partners who immediately understood the inflection points in our business. We truly had a meeting of the minds in terms of how to build a brand, roll-out products and scale a company. Mark was an early investor in E*TRADE and so many of his lessons from there resonated with Sam, Rahul and me. Building a Large Software LeadIn the past 3 years we did a lot of things the outsiders simply didn’t know about us. We built warehouse management processes and software. Sure, new entrants can get up and running easily with third-party storage facilities but we aren’t in this for quick momentum. We’re in this to build the Amazon of storage. So we starting building at industrial scale. We built logistics tracking, hub-and-spoke routing, least-cost route optimization, photo processing software and mobile apps. 80% of our software was “below the surface” and not apparent to the market or competition. We were fine with that. I’ve heard all of the VC arguments about using other people’s facilities, not wanting to invest in physical infrastructure (warehouses, trucks) and even silly ideas like wanting peer-to-peer storage. This simply comes from being better at spreadsheets than operations. Amazon became the 800-pound gorilla by knowing how to use CAPEX as a strategic advantage and how world-class logistics offered an unparalleled cost advantage and quality advantage in the long term. So we’ve been popping up facilities like these (some large — hubs, some smaller — spokes and some soon to be mega-warehouses) and we see our unit costs dipping to the point where it will look positively arcane to have a clunky storage facility in middle of a major city like Manhattan or San Francisco. What Comes Next?There is simply no doubt in my mind a startup in this industry will be worth several billion dollars. It’s up to MakeSpace to execute well and maintain its market leadership position. We know that others will build serious products, have great teams and will raise money from great firms. Frankly, if there weren’t strong entrants it only means this isn’t an attractive market opportunity and our view that more people want to take us on only validates the market. We’re simply not focused on anything other than the green field in front of us because we know the legacy players control the majority of the market share. We want to turn Public Storage into Blockbuster sooner rather than later. We want to leverage our Amazon-inspired logistics infrastructure to massively lower the cost of storage for all. The Innovator’s Dilemma teaches us that through lower costs and lower margins we can expand the total market opportunity by encouraging totally new customers and use cases. We have already begun to extend our software to build new product offerings not yet announced. You will see unparalleled innovations in customer service, scheduling, tracking and pick-up / delivery options. We can’t wait to show you what we can do now that we’re able to take the belt out a notch or two and bring MakeSpace to more cities and I hope to a neighborhood near you in the near future. ", "sentences": [{"477c": "MakeSpace Raises an Additional $17.5 million and Unveils Strategy to Make Public Storage the Next Blockbuster Video"}, {"b978": "MakeSpace, the leading provider of next-generation storage for consumers, today announced an additional $17.5 million in funding on TechCrunch led by Harmony Partners and Upfront Ventures to double its footprint of 3 cities (New York, Chicago & Washington DC) to 6 in 2016. We raised this capital in what has increasingly become a difficult market for fund raising so I’d like to share with you some details on how we get it done."}, {"2df3": "StrategyWhen Sam Rosen brought me the idea of MakeSpace 3 years ago we both marveled at some obvious facts. The public storage market was $24 billion (now approaching $27 billion) in the US alone (> $50 billion worldwide) and the largest player in the space — Public Storage — had less than 10% market share. Fragmented markets can be a great target for disruption. Public Storage does about $2.4 billion in revenue and has a public enterprise value of $44 billion."}, {"f6ef": "Why is it so valuable? Basically it’s traded as a Real Estate Investment Trust (REIT) and its investors likely see a large property portfolio with a steady stream of cashflows from full facilities and the ability of storage companies to increase prices every year on captive customers who in our research mostly won’t drive more than a few miles to take their goods to storage."}, {"c05c": "And where they see stability we saw a sitting duck. They are the classic case of the Innovator’s Dilemma because they fundamentally can’t innovate on their product and can’t lower costs or their business craters. They have high-priced property and zero innovation. And it’s easy to run circles around them as our product differentiation shows. Incumbents became increasingly annoyed with our successes in the country’s largest market — NYC — that they started even taking out ads against us. Little old us. Sound familiar?"}, {"1c0e": "Public Storage is the Blockbuster Video of their industry and we set out to build Netflix. If you want to know how that worked out for the respective parties see the chart below. It’s no wonder incumbents don’t want us to exist."}, {"6c89": "The Early YearsI’m a stickler for focus, being efficient with capital and building out operational excellence, so our strategy initially was very constrained. We wanted to launch in one market (the largest — NYC), with a simple product offering (bins, not furniture) and prove out product/market fit. Check. It worked perfectly. In just one year we captured 2% of all new customers in NYC who wanted to store household items other than furniture."}, {"5885": "Here’s Sam in the early days taking our first ever delivery of bins."}, {"cb36": "Expanding to CitiesMy partners were perhaps the best retail investors through the 1980's/90's having backed companies like Costco, Starbucks, Dick’s Sporting Goods, Ulta Beauty & Cosmetics amongst many others. They had instilled in me a discipline that few well-funded but inexperienced startups have. They basically said that retail businesses that worked well in one city or location often struggled when they went multi city."}, {"39cb": "There are some obvious reasons for this. The most important is management bandwidth. What you could previously do in a day’s drive now required remote management and processes. Companies have to decide how much centralization or decentralization of resources should exist in, for example, marketing: Local campaigns & budgets or centrally coordinated ones? There are no easy answers."}, {"8f22": "So at MakeSpace we decided to hold our product constant (bins) and learn how to build multi-cities. We launched in Chicago and Washington DC for reasons I’ll withhold for trade secrets but our goal was to build an “operating playbook” for a market and a “marketing playbook” and build a management layer that could handle coordination across cities. And while Sam has always been the face of the business one of our secret weapons was that we had Rahul Gandhi running operations. This division of labor and responsibilities has proved invaluable and they are both on the board so we have good and robust debates."}, {"dc82": "I’ll admit that this process was more difficult than any of us expected. It tested our beliefs about pricing, products and marketing overall of our service. We had long debates about what the market differences were and what our best responses were. Honestly? This was painful. And it happened as we were contemplating fund raising. We knew we could ramp up marketing spend and show increased user numbers but we felt that was the wrong decision because our CAC was higher than we wanted, our conversion was lower than we wanted and our payback was too long."}, {"733c": "So we went in the opposite direction. We decided to cut costs for a few months until we figured out our best approach."}, {"2872": "Growing our Product LinesWe realized two things in our product-line extension. First, customers in these new markets didn’t want to buy in “bins” and they demanded furniture. Of course we always knew the market would want furniture and we knew that 50% of the market wouldn’t store with us unless we had furniture. But taking furniture meant increasing product complexity to better handle warehouse management, truck sizes, number of pick-up /deliver agents and even insurance policies."}, {"acaf": "So we took a breather to build our software and processes before launching. We knew we had competitors in the market offering furniture but we didn’t want to be distracted by what our competitors were doing — we wanted to launch the product we wanted from a position of strength. We quietly then launched furniture in Chicago and Washington DC and — BOOM — game changer."}, {"5ec1": "The Perfect StormWe figured out a whole bunch of things that came together at the same time in what I can only describe as “product / market fit.” Our ARPU tripled (for obvious reasons) our CAC went down by 50%, our conversion rate on our home page went up by 350% and our payback on CAC was cut in half. It was a perfect storm. We had also built out a sales team and a marketing team and they had become fully operational."}, {"7aed": "The truth is that we also became better at telling our story. Customers knew how to buy our products better because in stead of packaging and pricing the way we thought made sense “by the bin” they were able to more effectively compare us to local alternatives. The above graphic shows our current pricing for NYC storage and you can see a direct comparison with our legacy competitor in NYC with the upper tiers used more for small businesses."}, {"c2a5": "We started sharing our data with Mark Lotke at Harmony Partners who immediately understood the inflection points in our business. We truly had a meeting of the minds in terms of how to build a brand, roll-out products and scale a company. Mark was an early investor in E*TRADE and so many of his lessons from there resonated with Sam, Rahul and me."}, {"f496": "Building a Large Software LeadIn the past 3 years we did a lot of things the outsiders simply didn’t know about us. We built warehouse management processes and software. Sure, new entrants can get up and running easily with third-party storage facilities but we aren’t in this for quick momentum. We’re in this to build the Amazon of storage. So we starting building at industrial scale. We built logistics tracking, hub-and-spoke routing, least-cost route optimization, photo processing software and mobile apps. 80% of our software was “below the surface” and not apparent to the market or competition. We were fine with that."}, {"986e": "I’ve heard all of the VC arguments about using other people’s facilities, not wanting to invest in physical infrastructure (warehouses, trucks) and even silly ideas like wanting peer-to-peer storage. This simply comes from being better at spreadsheets than operations. Amazon became the 800-pound gorilla by knowing how to use CAPEX as a strategic advantage and how world-class logistics offered an unparalleled cost advantage and quality advantage in the long term. So we’ve been popping up facilities like these (some large — hubs, some smaller — spokes and some soon to be mega-warehouses) and we see our unit costs dipping to the point where it will look positively arcane to have a clunky storage facility in middle of a major city like Manhattan or San Francisco."}, {"2ef4": "What Comes Next?There is simply no doubt in my mind a startup in this industry will be worth several billion dollars. It’s up to MakeSpace to execute well and maintain its market leadership position. We know that others will build serious products, have great teams and will raise money from great firms. Frankly, if there weren’t strong entrants it only means this isn’t an attractive market opportunity and our view that more people want to take us on only validates the market."}, {"d971": "We’re simply not focused on anything other than the green field in front of us because we know the legacy players control the majority of the market share. We want to turn Public Storage into Blockbuster sooner rather than later. We want to leverage our Amazon-inspired logistics infrastructure to massively lower the cost of storage for all. The Innovator’s Dilemma teaches us that through lower costs and lower margins we can expand the total market opportunity by encouraging totally new customers and use cases."}, {"6178": "We have already begun to extend our software to build new product offerings not yet announced. You will see unparalleled innovations in customer service, scheduling, tracking and pick-up / delivery options."}, {"ed62": "We can’t wait to show you what we can do now that we’re able to take the belt out a notch or two and bring MakeSpace to more cities and I hope to a neighborhood near you in the near future."}], "author": "Mark Suster", "name": "2414", "parent": ""}