{"timestamp": "Feb 15, 2016", "child": "2416_1\t2416_2", "title": "So What is The Right Level of Burn Rate for a Startup These Days?", "content": "So What is The Right Level of Burn Rate for a Startup These Days? There is much talk these days that startup valuations have decreased and may continue to do so and that the amount of time it takes to fund raise may take longer. As I have pointed out in previous posts, 91% of VCs surveyed believe prices are declining (30% believe substantially) and 77% believe that funding will take longer than it has in the past. This has led VC & entrepreneur bloggers alike to similar conclusions: start raising capital early and be careful about having too high of a burn rate because that lessens the amount of runway you have until you need more cash. But the hardest question to actually answer is, “What is the right burn rate for your company?” and if anybody gives you a specific number I would be a bit skeptical because there is no universal answer. It’s a very personal topic and I’d like to offer you a framework to decide for yourself, based on the following factors: How Long is it Taking to Raise Capital at Your Stage in the Market?The earlier the round, the less capital you need and the more reasonable your valuation the less time that is needed generally to raise capital. In other words, raising $2 million at a $6 million pre-money valuation has always been easier & quicker than raising $20 million at any valuation. I know it sounds obvious but just so you understand: There are more capital sources available for earlier-stage capital, the information on which they are evaluating the investment is less (it is almost certainly just team and product) and the risk of the investor getting things wrong is diminished. When you raise larger rounds there is more “due diligence,” which includes: calling customers, looking at financial metrics, doing cohort analysis (looking for trends like changes in churn rates), evaluating competitor positioning and understanding more of the competency of your executive team. While there is no “one size fits all” I used to give the advice that you should plan about 4.5 months for fund raising start to finish and make sure you have at least 6 months of cash if it takes longer. In recent years it seems many deals got done in 2–3 months or shorter and that still may be true at the earliest stages. My advice: be cautious, start early, get to know investors before you need capital, do your research on who is a likely good fit and understand that fund-raising is always part of your job — not something you do in “fund-raising season” for 2–3 months every other year. People who think of fund raising as a “distraction away from the core business” fundamentally don’t understand that running a business comprises of: Shipping products, selling to & servicing customers, marketing, HR, recruiting, financial reporting AND making sure you have enough money to support operations. In other words, fund-raising is a permanent part of the job of the CEO (and CFO) of a company so whether you allocate 5% of your time to it or 20% — it is a year-round activity even if just in the background. When you ask yourself how Uber became the powerhouse it is — in addition to great software & operations and the right innovation at the right time — it was also the fact that they knew how to constantly tap the capital markets to grow the business, making it harder for many competitors to do so. Who are Your Existing Investors?How much your company should burn should also have a direct correlation with who your existing investors are and I strongly advise that you have open conversations with them about their comfort levels and also the level of support you are likely to receive going forward. I’m surprised how few entrepreneurs have this open conversation with their investors. In fact, most entrepreneurs I know don’t ask — why is that? Wouldn’t you rather know where you stand? There are ways to do this politely and even if your investors don’t answer as directly as you may like — there is at least something that can be read into this. So. If you have a strong lead investor known for backing his or her entrepreneurs in tough times and that investor gives you a sense for her comfort level in writing your next check then you can have a higher burn rate than if you don’t feel you have a strong lead investor. If you have mostly angels or don’t feel your existing investor can support you without new capital from the outside then you might want a smaller burn rate. Remember those party rounds that became so popular over the past few years because they allowed higher prices and more favorable terms for entrepreneurs? Well if you took that option I would simply advise that you be a little bit more cautious with your burn rate. Here’s why: If you have 5 firms who each gave you $500k you have 3 distinct problems: Are Your Existing Investors Over Their Skis?This is another thing I strongly advise entrepreneurs to understand and even talk with their VCs about. Let me play open book so you can understand the situation better. At Upfront Ventures 90% of the first-check investments we do are seed or A-round (and 2/3rd of these are A-rounds) with about 10% of our first-checks (in number) being B-rounds. As a primarily A-round investor with a nearly $300 million fund our average first-check size is about $3.5 million. We invest about half of our fund in our initial investments and we “reserve” about 50% of our investments to follow on in our best deals. Obviously if a company is doing phenomenally well we’ll try to invest more capital and if a company is taking time to mature we’ll be more cautious. But even companies that take time to mature will usually get at least a second check of support from us as long as they are showing strong signs of innovating and as long as we believe they are still committed to the long-term viability of the business and as long as they show financial prudence. In our best deals we hope to invest $10–15 million over the life of the fund. So if we’ve invested $3–4 million in your company there is a strong chance you will get some level of support from us because on a relative basis we are not “over committed” and even in tough times for you, allocating $1–2 million is part of our scope and strategy to get you through unforeseen situations. If on the other hand we have committed $10 million and if you don’t have 3 other investors around the table and if you’re burning $800k / month (implying you need $10 million more to fund one-year’s operations or nearly $15 million to fund 18 months) — we’re simply “over our skis” in order to help you because we wouldn’t put $25 million in one company at our size fund. So even if we LOVE your business you are stretching our ability to fund you in tough times. You ought to have a sense for your existing investors’ capacities relative to your company. How Strong is Your Access to Capital?Talking about existing investors is one way of talking about “access to capital” because if you already have VCs then you have “access.” And then you’re just assessing whether you can get access to new VCs or whether your existing VCs can help you in tough times. I talk about “access to capital” in the context of fund raising because it is the biggest determinant of your likelihood of raising. If you went to Stanford with a bunch of VCs who you count as friends (and who respect you) plus you worked at the senior ranks of Facebook, Salesforce.com, Palantir or Uber — you have very strong access — obviously. But many people aren’t in this situation. If your company has raised angel money and maybe some capital from seed funds that are less well known or are new — then your access to capital may be less strong. What is Your Risk Appetite?It is also impossible to tell you the right burn rate for your company without knowing your risk tolerance. Quite simply — some people would rather “go hard” and accept the consequence of failure if they don’t succeed. Other people are more cautious and have a lot more at stake if the company doesn’t succeed (like maybe they put in their own money or their family’s money). So whenever people ask me for advice I normally start by asking: There is no right answer. Only you can know. But check your risk tolerance. Again, I know this sounds very obvious but in practice it isn’t always. Some companies may be able to become “cockroaches” or “ramen profitable” but cutting costs and staff substantially and getting to a burn rate that last 2 years. But that could impact the future upside of the company. So you might have a company that is “medium valuable” in the long-run because with no capital it was hard to innovate and create a market leader. That’s ok for some entrepreneurs (and investor) and not for others. Also. You may think that it’s ok to “cut to the bone” but you may find out that your team didn’t want to join that sort of company so you may cut back really far only to find that the remaining people leave. Simply put — if you’re going to cut to the bone make sure that the team you intend to keep is aligned culturally with this decision. Being ramen profitable is the right decision for some team and the wrong decision for others. Only you know. Keep your burn rate in line with your: Access to capital & risk tolerance levels. How Reasonable Was Your Last Valuation?There are two other factors you may consider. One is how reasonable your last round valuation was. If you raised $10 million at a $40 million pre-money on a company with limited revenue and if your investors are telling you that they’re concerned about your future because they doubt that outsiders will fund you at your current performance level then I would be more cautious with my burn rate — even if it means slashing costs. There are only four solutions to this problem: How Complicated is Your Cap Table?Cap Table issues are seldom understood by entrepreneurs. Again, my best advice is to talk with your VCs openly or at least the ones you trust the most to be open. If you raised a $2 million seed round at a $6 million pre then a $5 million A-round at a $20 million pre then a $20 million B-round at a $80 million pre and if your company has stalled you may have a cap table problem. Let me explain. The $20 million investor may now believe that you’re never going to be worth $300 million or more (they invested hoping for no less than a 3x). So if they’re in the mindset that they’re better off getting their $20 million back versus risking more capital then they may prefer just to sell your company for whatever you can get for it. Even if you sold for $20 million they’d be thinking “I have senior liquidation preference so I get my money back.”) The early stage investor probably still owns 15% of your company and thought he or she had a great return coming (after all — it got marked up to $100 million post-money valuation just 12 months ago!). But they are “over their skis” on ability to help you because they’re an early-stage investor so they’re dependent on your B-round investor or outside money. They don’t want you to sell for $20 million because they may still believe in you AND they know that they’ll get no return from this (and your personal return will be very small). You are in a classic cap table pinch. You don’t even realize that the later-stage investor doesn’t support you any more. Solution: For starters get your seed & A investors helping. They may be able to persuade your B-round investor to be more reasonable. They may push you to cut costs. They may suggest cap table adjustments as a compromise. Or they may ferret out that your B-round investor just won’t budge. But at least you’ll know where you stand before deciding what to do about burn. Note that I’m not making any value judgments about seed, A or B (or C or growth) investors. Just trying to point out that at times they’re not always aligned and most entrepreneurs don’t understand this math. More ReadingIf you want to read more on the burn rate topic I’ve written about it before. I also wrote this primer that is more how to find, target and close VC investment. Appendix:As with yesterday I’m still at a soccer tournament with my son (he’s asleep — but we made the championship round!). So I have no time to edit or word check. I hope this post is at least helpful for those surveying what to do about burn rates and the market. And if I made mistakes or typos feel free to let me know and I’ll fix tomorrow. ", "sentences": [{"31ae": "So What is The Right Level of Burn Rate for a Startup These Days?"}, {"bf29": "There is much talk these days that startup valuations have decreased and may continue to do so and that the amount of time it takes to fund raise may take longer. As I have pointed out in previous posts, 91% of VCs surveyed believe prices are declining (30% believe substantially) and 77% believe that funding will take longer than it has in the past."}, {"6748": "This has led VC & entrepreneur bloggers alike to similar conclusions: start raising capital early and be careful about having too high of a burn rate because that lessens the amount of runway you have until you need more cash."}, {"4588": "But the hardest question to actually answer is, “What is the right burn rate for your company?” and if anybody gives you a specific number I would be a bit skeptical because there is no universal answer. It’s a very personal topic and I’d like to offer you a framework to decide for yourself, based on the following factors:"}, {"e66c": "How Long is it Taking to Raise Capital at Your Stage in the Market?The earlier the round, the less capital you need and the more reasonable your valuation the less time that is needed generally to raise capital. In other words, raising $2 million at a $6 million pre-money valuation has always been easier & quicker than raising $20 million at any valuation."}, {"9d88": "I know it sounds obvious but just so you understand: There are more capital sources available for earlier-stage capital, the information on which they are evaluating the investment is less (it is almost certainly just team and product) and the risk of the investor getting things wrong is diminished. When you raise larger rounds there is more “due diligence,” which includes: calling customers, looking at financial metrics, doing cohort analysis (looking for trends like changes in churn rates), evaluating competitor positioning and understanding more of the competency of your executive team."}, {"1fd5": "While there is no “one size fits all” I used to give the advice that you should plan about 4.5 months for fund raising start to finish and make sure you have at least 6 months of cash if it takes longer. In recent years it seems many deals got done in 2–3 months or shorter and that still may be true at the earliest stages."}, {"d06f": "My advice: be cautious, start early, get to know investors before you need capital, do your research on who is a likely good fit and understand that fund-raising is always part of your job — not something you do in “fund-raising season” for 2–3 months every other year. People who think of fund raising as a “distraction away from the core business” fundamentally don’t understand that running a business comprises of: Shipping products, selling to & servicing customers, marketing, HR, recruiting, financial reporting AND making sure you have enough money to support operations."}, {"f273": "In other words, fund-raising is a permanent part of the job of the CEO (and CFO) of a company so whether you allocate 5% of your time to it or 20% — it is a year-round activity even if just in the background."}, {"d8c1": "When you ask yourself how Uber became the powerhouse it is — in addition to great software & operations and the right innovation at the right time — it was also the fact that they knew how to constantly tap the capital markets to grow the business, making it harder for many competitors to do so."}, {"2ba1": "Who are Your Existing Investors?How much your company should burn should also have a direct correlation with who your existing investors are and I strongly advise that you have open conversations with them about their comfort levels and also the level of support you are likely to receive going forward. I’m surprised how few entrepreneurs have this open conversation with their investors."}, {"00d1": "In fact, most entrepreneurs I know don’t ask — why is that? Wouldn’t you rather know where you stand? There are ways to do this politely and even if your investors don’t answer as directly as you may like — there is at least something that can be read into this."}, {"4561": "So. If you have a strong lead investor known for backing his or her entrepreneurs in tough times and that investor gives you a sense for her comfort level in writing your next check then you can have a higher burn rate than if you don’t feel you have a strong lead investor."}, {"55e7": "If you have mostly angels or don’t feel your existing investor can support you without new capital from the outside then you might want a smaller burn rate."}, {"2658": "Remember those party rounds that became so popular over the past few years because they allowed higher prices and more favorable terms for entrepreneurs? Well if you took that option I would simply advise that you be a little bit more cautious with your burn rate. Here’s why: If you have 5 firms who each gave you $500k you have 3 distinct problems:"}, {"2ad0": "Are Your Existing Investors Over Their Skis?This is another thing I strongly advise entrepreneurs to understand and even talk with their VCs about. Let me play open book so you can understand the situation better."}, {"2a1a": "At Upfront Ventures 90% of the first-check investments we do are seed or A-round (and 2/3rd of these are A-rounds) with about 10% of our first-checks (in number) being B-rounds. As a primarily A-round investor with a nearly $300 million fund our average first-check size is about $3.5 million. We invest about half of our fund in our initial investments and we “reserve” about 50% of our investments to follow on in our best deals."}, {"f885": "Obviously if a company is doing phenomenally well we’ll try to invest more capital and if a company is taking time to mature we’ll be more cautious. But even companies that take time to mature will usually get at least a second check of support from us as long as they are showing strong signs of innovating and as long as we believe they are still committed to the long-term viability of the business and as long as they show financial prudence."}, {"32ba": "In our best deals we hope to invest $10–15 million over the life of the fund."}, {"ec4b": "So if we’ve invested $3–4 million in your company there is a strong chance you will get some level of support from us because on a relative basis we are not “over committed” and even in tough times for you, allocating $1–2 million is part of our scope and strategy to get you through unforeseen situations."}, {"182f": "If on the other hand we have committed $10 million and if you don’t have 3 other investors around the table and if you’re burning $800k / month (implying you need $10 million more to fund one-year’s operations or nearly $15 million to fund 18 months) — we’re simply “over our skis” in order to help you because we wouldn’t put $25 million in one company at our size fund. So even if we LOVE your business you are stretching our ability to fund you in tough times."}, {"38c6": "You ought to have a sense for your existing investors’ capacities relative to your company."}, {"8fbb": "How Strong is Your Access to Capital?Talking about existing investors is one way of talking about “access to capital” because if you already have VCs then you have “access.” And then you’re just assessing whether you can get access to new VCs or whether your existing VCs can help you in tough times."}, {"f3f8": "I talk about “access to capital” in the context of fund raising because it is the biggest determinant of your likelihood of raising. If you went to Stanford with a bunch of VCs who you count as friends (and who respect you) plus you worked at the senior ranks of Facebook, Salesforce.com, Palantir or Uber — you have very strong access — obviously."}, {"cc1a": "But many people aren’t in this situation. If your company has raised angel money and maybe some capital from seed funds that are less well known or are new — then your access to capital may be less strong."}, {"124b": "What is Your Risk Appetite?It is also impossible to tell you the right burn rate for your company without knowing your risk tolerance. Quite simply — some people would rather “go hard” and accept the consequence of failure if they don’t succeed. Other people are more cautious and have a lot more at stake if the company doesn’t succeed (like maybe they put in their own money or their family’s money)."}, {"4ff4": "So whenever people ask me for advice I normally start by asking:"}, {"869a": "There is no right answer. Only you can know. But check your risk tolerance."}, {"15ad": "Again, I know this sounds very obvious but in practice it isn’t always. Some companies may be able to become “cockroaches” or “ramen profitable” but cutting costs and staff substantially and getting to a burn rate that last 2 years. But that could impact the future upside of the company. So you might have a company that is “medium valuable” in the long-run because with no capital it was hard to innovate and create a market leader. That’s ok for some entrepreneurs (and investor) and not for others."}, {"7cf0": "Also. You may think that it’s ok to “cut to the bone” but you may find out that your team didn’t want to join that sort of company so you may cut back really far only to find that the remaining people leave. Simply put — if you’re going to cut to the bone make sure that the team you intend to keep is aligned culturally with this decision."}, {"5516": "Being ramen profitable is the right decision for some team and the wrong decision for others. Only you know. Keep your burn rate in line with your: Access to capital & risk tolerance levels."}, {"b5d3": "How Reasonable Was Your Last Valuation?There are two other factors you may consider. One is how reasonable your last round valuation was. If you raised $10 million at a $40 million pre-money on a company with limited revenue and if your investors are telling you that they’re concerned about your future because they doubt that outsiders will fund you at your current performance level then I would be more cautious with my burn rate — even if it means slashing costs."}, {"ea12": "There are only four solutions to this problem:"}, {"a650": "How Complicated is Your Cap Table?Cap Table issues are seldom understood by entrepreneurs. Again, my best advice is to talk with your VCs openly or at least the ones you trust the most to be open."}, {"989a": "If you raised a $2 million seed round at a $6 million pre then a $5 million A-round at a $20 million pre then a $20 million B-round at a $80 million pre and if your company has stalled you may have a cap table problem. Let me explain."}, {"dbed": "The $20 million investor may now believe that you’re never going to be worth $300 million or more (they invested hoping for no less than a 3x). So if they’re in the mindset that they’re better off getting their $20 million back versus risking more capital then they may prefer just to sell your company for whatever you can get for it. Even if you sold for $20 million they’d be thinking “I have senior liquidation preference so I get my money back.”)"}, {"77d1": "The early stage investor probably still owns 15% of your company and thought he or she had a great return coming (after all — it got marked up to $100 million post-money valuation just 12 months ago!). But they are “over their skis” on ability to help you because they’re an early-stage investor so they’re dependent on your B-round investor or outside money."}, {"de4f": "They don’t want you to sell for $20 million because they may still believe in you AND they know that they’ll get no return from this (and your personal return will be very small)."}, {"40e8": "You are in a classic cap table pinch. You don’t even realize that the later-stage investor doesn’t support you any more."}, {"90d8": "Solution: For starters get your seed & A investors helping. They may be able to persuade your B-round investor to be more reasonable. They may push you to cut costs. They may suggest cap table adjustments as a compromise. Or they may ferret out that your B-round investor just won’t budge. But at least you’ll know where you stand before deciding what to do about burn."}, {"a519": "Note that I’m not making any value judgments about seed, A or B (or C or growth) investors. Just trying to point out that at times they’re not always aligned and most entrepreneurs don’t understand this math."}, {"ee96": "More ReadingIf you want to read more on the burn rate topic I’ve written about it before. I also wrote this primer that is more how to find, target and close VC investment."}, {"fc4d": "Appendix:As with yesterday I’m still at a soccer tournament with my son (he’s asleep — but we made the championship round!). So I have no time to edit or word check. I hope this post is at least helpful for those surveying what to do about burn rates and the market. And if I made mistakes or typos feel free to let me know and I’ll fix tomorrow."}], "author": "Mark Suster", "name": "2416", "parent": ""}