{"timestamp": "May 6, 2016", "child": "2419_1\t2419_2\t2419_3\t2419_4", "title": "The TACO Challenge", "content": "The TACO Challenge Yesterday was Cinco de Mayo. In the US this is often confused as Mexican Independence Day, which is actually September 16th and is called Grito de Dolores. That made some people think of taco bowls and love Hispanics. Whatever. Our portfolio company mitú, the fastest growing digital video company focused on the Latino market in the US (in English) and globally (in Spanish) has taken a different approach to the taco. T.A.C.O. — Take Action, Commit Others mitú wants to mobilize 1 million of them into voting with an emphasis on mobilizing Millennials. Sometimes in the US presidential electoral system it can feel like your personal vote doesn’t matter enough. Perhaps you live in a state that seems likely to vote in one direction or the other and you know the battleground will be elsewhere since we operate on an electoral college and not a popular vote. mitú has a way that you can help wherever you live — as long as you are willing to help spread the word. T.A.C.O. Take action, commit others. Help spread to word to encourage more Latinos to register and make their voices heard in every state and stop the hatred and xenophobia spread by those who try to divide us as a nation. So join the chorus of voices that include Magic Johnson, Russell Simmons and thousands of others in spreading the word for Latinos to mobilize. Please Tweet “I’m joining the @wearemitu #TACOchallenge to help register 1 million Latinos to vote. RT to join me! http://bit.ly/mituTACO” or similar to help spread the word. The link takes readers to an event tomorrow — May 7th — in Los Angeles to take the t.a.c.o challenge that will be opened by Mayor Garcetti, encouraging young Latinos to vote. Will you join me in a T.A.C.O? You can read more about the Taco Challenge here. Besos y abrazos, Beatriz, for taking up this initiative. You’re an inspiration. ", "sentences": [{"fda1": "The TACO Challenge"}, {"c99c": "Yesterday was Cinco de Mayo. In the US this is often confused as Mexican Independence Day, which is actually September 16th and is called Grito de Dolores."}, {"7774": "That made some people think of taco bowls and love Hispanics. Whatever."}, {"56d7": "Our portfolio company mitú, the fastest growing digital video company focused on the Latino market in the US (in English) and globally (in Spanish) has taken a different approach to the taco."}, {"5263": "T.A.C.O. — Take Action, Commit Others"}, {"c314": "mitú wants to mobilize 1 million of them into voting with an emphasis on mobilizing Millennials. Sometimes in the US presidential electoral system it can feel like your personal vote doesn’t matter enough. Perhaps you live in a state that seems likely to vote in one direction or the other and you know the battleground will be elsewhere since we operate on an electoral college and not a popular vote."}, {"e685": "mitú has a way that you can help wherever you live — as long as you are willing to help spread the word. T.A.C.O. Take action, commit others. Help spread to word to encourage more Latinos to register and make their voices heard in every state and stop the hatred and xenophobia spread by those who try to divide us as a nation."}, {"15a3": "So join the chorus of voices that include Magic Johnson, Russell Simmons and thousands of others in spreading the word for Latinos to mobilize."}, {"628e": "Please Tweet"}, {"3ad6": "“I’m joining the @wearemitu #TACOchallenge to help register 1 million Latinos to vote. RT to join me! http://bit.ly/mituTACO” or similar to help spread the word."}, {"7fda": "The link takes readers to an event tomorrow — May 7th — in Los Angeles to take the t.a.c.o challenge that will be opened by Mayor Garcetti, encouraging young Latinos to vote."}, {"926b": "Will you join me in a T.A.C.O?"}, {"c0d3": "You can read more about the Taco Challenge here."}, {"fd40": "Besos y abrazos, Beatriz, for taking up this initiative. You’re an inspiration."}], "author": "Mark Suster", "name": "2419", "parent": ""}