{"timestamp": "Apr 30, 2016", "child": "2420_1\t2420_2\t2420_3\t2420_4\t2420_5\t2420_6\t2420_7\t2420_8\t2420_9\t2420_10\t2420_11\t2420_12\t2420_13\t2420_14\t2420_15\t2420_16\t2420_17\t2420_18\t2420_19\t2420_20\t2420_21\t2420_22\t2420_23\t2420_24\t2420_252420_1\t2420_2\t2420_3\t2420_4\t2420_5\t2420_6\t2420_7\t2420_8\t2420_9\t2420_10\t2420_11\t2420_12\t2420_13\t2420_14\t2420_15\t2420_16\t2420_17\t2420_18\t2420_19\t2420_20\t2420_21\t2420_22\t2420_23\t2420_24\t2420_25", "title": "Why on Earth Would Anybody Post Business Videos on Snapchat?", "content": "Why on Earth Would Anybody Post Business Videos on Snapchat? By now if you follow me on Twitter you probably know that I do near daily “Snapstorms” or a collection of short videos (usually < 5 mins in total) with entrepreneur advice on Snapchat. Here’s a recent one I did on Fund Raising in tough markets. You can follow me on Snapchat at msuster. Suster Doing a Snapstorm Honestly, it kind of drives people nuts that I do these on Snapchat and it makes me laugh a bit simply because it drives people bonkers. Nope! Every platform has its unique strengths. YouTube is great for longer-form for me and could be a great repository. Snapchat has an enormous audience of mobile-first consumers tuning in every day looking for content to consume in a way that YouTube doesn’t. Of course YouTube has huge traffic, but it’s different. Ah, but I’m doing both! Snapchat for my “original run” and I’ll also store each video to be watched later. Immediacy. People tune in every day. I know some people have anxiety over Snapchat. Once you learn it it’s pretty straightforward. Here’s a Snapchat 101 Guide I wrote for people if you haven’t yet grokked it. So here’s the thing overall you need to understand: ", "sentences": [{"9ccd": "Why on Earth Would Anybody Post Business Videos on Snapchat?"}, {"ed9e": "By now if you follow me on Twitter you probably know that I do near daily “Snapstorms” or a collection of short videos (usually < 5 mins in total) with entrepreneur advice on Snapchat. Here’s a recent one I did on Fund Raising in tough markets. You can follow me on Snapchat at msuster."}, {"b76e": "Suster Doing a Snapstorm"}, {"95e2": "Honestly, it kind of drives people nuts that I do these on Snapchat and it makes me laugh a bit simply because it drives people bonkers."}, {"b349": "Nope! Every platform has its unique strengths. YouTube is great for longer-form for me and could be a great repository. Snapchat has an enormous audience of mobile-first consumers tuning in every day looking for content to consume in a way that YouTube doesn’t. Of course YouTube has huge traffic, but it’s different."}, {"fd22": "Ah, but I’m doing both! Snapchat for my “original run” and I’ll also store each video to be watched later."}, {"1955": "Immediacy. People tune in every day."}, {"a064": "I know some people have anxiety over Snapchat. Once you learn it it’s pretty straightforward. Here’s a Snapchat 101 Guide I wrote for people if you haven’t yet grokked it."}, {"55ad": "So here’s the thing overall you need to understand:"}], "author": "Mark Suster", "name": "2420", "parent": ""}