{"timestamp": "May 19, 2016", "child": "2424_1\t2424_2\t2424_3\t2424_4\t2424_5\t2424_6\t2424_7\t2424_8\t2424_9\t2424_10\t2424_11\t2424_12\t2424_13\t2424_14\t2424_15\t2424_16\t2424_17\t2424_18\t2424_19", "title": "Why Solving Big Food & Healthcare Problems Will Yield Spectacular Companies", "content": "Why Solving Big Food & Healthcare Problems Will Yield Spectacular Companies I’ve spoken before about our desire at Upfront Ventures to fund really big ideas that solve hard problems, are science led and if successful will both have a positive effect on people’s lives as well as make great financial returns. We’re not Pollyannaish about this. We believe that it is incrementally harder to differentiate on simple Internet products or mobile apps and while great companies are built doing this, our goal as a fund is to try and fund things that can be 100x returns if they work. In short, we’re after venture returns. We know to do this we need to fund projects that are more difficult in scope, more ambitious in industry transformation, less obvious in market adoption and a higher probability of not working. We know that to be successful we need to fund truly transformational entrepreneurs grounded in unique academic skills and with the self confidence and ambition to try and achieve results in which the market will naturally be skeptical. We have have been funding agriculture technologies, water conservation, wireless electricity, aquaponics and so forth in addition to our standard investment themes in software, data, video and retail innovation. One of the companies we’ve been proudest to watch its evolution is Nima, a company that is solving the problem of food allergies for people with severe problems such as Celiac disease and also addressing the much broader market of people with gluten intolerance. They have plans to go after they peanut allergies and move on to a host of other food-related illnesses and problems including dairy. This may sound straightforward but to test for conditions with extreme accuracy and speed requires designing a small hardware device that is capable of creating a chemical reaction with food, interpreting the results in real time and doing so for a cost that is acceptable for consumers. When we met Shireen (CEO) and Scott (Co-founder & CTO) in late 2014 they had been inspired to create Nima to address their own personal food issues and empower other people to live their healthiest lives. We are predisposed to backing founders who solve problems in which they have personal knowledge that is authentic. Shireen had been studying for her masters in business at MIT and thinking about her own food allergies and Scott was a graduate of the mechanical engineering school at MIT with an emphasis in product design. We were inspired by their vision and determination so we led their first large funding round (co-investors SoftTech, SK Ventures, Lemnos Labs and others) and we participated heavily in their most recent $9 million funding led by our good friends at Foundry Group that was just announced today. They have raised $14 million to date. It seems that many others were impressed as well. Since our initial funding round the company went on to win the TechCrunch Startup Battleground in a head-to-head competition with some very impressive startups. Since their seed, the team has been working hard to test and roll out an effective, trustworthy product, Nima, which detects the presence of gluten in food products. It’s still in pre-sale, but reception from beta testers, previews and the industry (tech and consumer) has been enthusiastic. I’ve seen firsthand how food can impact your well-being, in my case with helping me keep my ADD in check. I also have an aunt with Celiac Disease and a nephew who carries an EpiPen to deal with his severe peanut allergies. So it immediately resonated after Kevin Zhang and Yves Sisteron brought the deal into our firm (Yves is on the board) after a visit to see our friends at Lemnos Labs. As a market, food allergies are unfortunately on the rise — estimated to affect 15M Americans, food allergies have grown 50% in past 20 years — and food intolerance to gluten, soy, dairy is growing. As healthcare costs have risen dramatically in the past few decades we believe that the market will shift to more preventative approaches led by science, data and devices and billion-dollar companies will be created. We have been so encouraged by the progress of Nima and couldn’t think of a better board member, mentor and co-investor than Brad Feld at Foundry Group. We can’t wait to see what the next few years bring. ", "sentences": [{"a2aa": "Why Solving Big Food & Healthcare Problems Will Yield Spectacular Companies"}, {"838d": "I’ve spoken before about our desire at Upfront Ventures to fund really big ideas that solve hard problems, are science led and if successful will both have a positive effect on people’s lives as well as make great financial returns."}, {"4db5": "We’re not Pollyannaish about this. We believe that it is incrementally harder to differentiate on simple Internet products or mobile apps and while great companies are built doing this, our goal as a fund is to try and fund things that can be 100x returns if they work. In short, we’re after venture returns."}, {"d120": "We know to do this we need to fund projects that are more difficult in scope, more ambitious in industry transformation, less obvious in market adoption and a higher probability of not working. We know that to be successful we need to fund truly transformational entrepreneurs grounded in unique academic skills and with the self confidence and ambition to try and achieve results in which the market will naturally be skeptical."}, {"4049": "We have have been funding agriculture technologies, water conservation, wireless electricity, aquaponics and so forth in addition to our standard investment themes in software, data, video and retail innovation."}, {"30a9": "One of the companies we’ve been proudest to watch its evolution is Nima, a company that is solving the problem of food allergies for people with severe problems such as Celiac disease and also addressing the much broader market of people with gluten intolerance. They have plans to go after they peanut allergies and move on to a host of other food-related illnesses and problems including dairy."}, {"fe30": "This may sound straightforward but to test for conditions with extreme accuracy and speed requires designing a small hardware device that is capable of creating a chemical reaction with food, interpreting the results in real time and doing so for a cost that is acceptable for consumers."}, {"a1eb": "When we met Shireen (CEO) and Scott (Co-founder & CTO) in late 2014 they had been inspired to create Nima to address their own personal food issues and empower other people to live their healthiest lives. We are predisposed to backing founders who solve problems in which they have personal knowledge that is authentic. Shireen had been studying for her masters in business at MIT and thinking about her own food allergies and Scott was a graduate of the mechanical engineering school at MIT with an emphasis in product design."}, {"2263": "We were inspired by their vision and determination so we led their first large funding round (co-investors SoftTech, SK Ventures, Lemnos Labs and others) and we participated heavily in their most recent $9 million funding led by our good friends at Foundry Group that was just announced today. They have raised $14 million to date."}, {"a63f": "It seems that many others were impressed as well. Since our initial funding round the company went on to win the TechCrunch Startup Battleground in a head-to-head competition with some very impressive startups."}, {"8ca9": "Since their seed, the team has been working hard to test and roll out an effective, trustworthy product, Nima, which detects the presence of gluten in food products. It’s still in pre-sale, but reception from beta testers, previews and the industry (tech and consumer) has been enthusiastic."}, {"1324": "I’ve seen firsthand how food can impact your well-being, in my case with helping me keep my ADD in check. I also have an aunt with Celiac Disease and a nephew who carries an EpiPen to deal with his severe peanut allergies. So it immediately resonated after Kevin Zhang and Yves Sisteron brought the deal into our firm (Yves is on the board) after a visit to see our friends at Lemnos Labs."}, {"f586": "As a market, food allergies are unfortunately on the rise — estimated to affect 15M Americans, food allergies have grown 50% in past 20 years — and food intolerance to gluten, soy, dairy is growing."}, {"b2bb": "As healthcare costs have risen dramatically in the past few decades we believe that the market will shift to more preventative approaches led by science, data and devices and billion-dollar companies will be created."}, {"efc1": "We have been so encouraged by the progress of Nima and couldn’t think of a better board member, mentor and co-investor than Brad Feld at Foundry Group."}, {"6173": "We can’t wait to see what the next few years bring."}], "author": "Mark Suster", "name": "2424", "parent": ""}