{"timestamp": "Jul 6, 2016", "child": "2430_1\t2430_2\t2430_3\t2430_4\t2430_5\t2430_6\t2430_7\t2430_8\t2430_9\t2430_10\t2430_11\t2430_12\t2430_13\t2430_14\t2430_15\t2430_16\t2430_17\t2430_18\t2430_19\t2430_202430_1\t2430_2\t2430_3\t2430_4\t2430_5\t2430_6\t2430_7\t2430_8\t2430_9\t2430_10\t2430_11\t2430_12\t2430_13\t2430_14\t2430_15\t2430_16\t2430_17\t2430_18\t2430_19\t2430_20", "title": "Why Acceptance of Failure is Critical to Startup Success", "content": "Why Acceptance of Failure is Critical to Startup Success I talk about failure a lot because I think it can be tremendously instructive and I think that success without failure often masks underlying lessons. I even prefer to fund entrepreneurs who have experience some level of set-backs in their careers or startups because I think it brings a humility to decision-making that I find healthy. I have experienced many first-time entrepreneurs with too much hubris if fund-raising came easily and press was fawning and employees joined in droves and customer adoption has been rapid. When I hear the realism that comes from founders with setback it elicits an understanding of what it takes to be successful at a startup that frankly can’t exist unless you’ve walked in those shoes before. It is these stories that helps me bond more with the team because I’ve personally experienced just about every kind of setback at my first startup: I could write my blog alone on the mistakes I made. But even more important than personal lessons of failure, I believe acceptance of failure at a societal level is one of the key ingredients that allows the technology startup industry in the US to flourish. I say this as somebody who has lived in 6 countries and worked in 9 — having lived abroad for 11 years of my work life. In my experience the US loves the narrative of the come back. We champion a storyline about an underdog who failed many times but through grit and determination have risen above the odds. One of our greatest presidents — Abraham Lincoln — lived a lifetimes of failure and setbacks before being elected as president (1). One of our greatest technology leaders (Steve Jobs) had humiliating business failure before coming back to build the most successful tech come-back of our times. Silicon Valley itself was built on the sciences with a foundation of trial-and-error and then improving the model and trying again. I believe this scientific method and trial-and-error approach is one of Silicon Valley’s most valuable strengths. This came to mind a couple of years ago when I had the chance to sit down with the president of South Korea and she asked a small gathering of 19 tech & business leaders for opinions about how to make the Korean economy more “creative.” The backdrop explained was that it was viewed that Korea has been tremendously successful at copying and perfecting other people’s technologies but in order to compete more effective in the future had to be more creative. Of course as a non-Korean I can only generalize but when it was my turn I told her my experience of living in Europe and Japan where failure seemed less tolerated than my experience of living in California and working in the tech sector. In London when founders failed they were ostracized in the press and culturally I believe it became harder to raise capital. Perhaps that’s changed in the decade since I left but that was my experience when I lived there. In France in some ways it was worse because if you failed as a startup founder you shouldered personal liabilities that don’t exist in the US under our bankruptcy laws. You also ran the risk that if you hired employees quickly and then demand wasn’t as strong as expected it was incredibility hard to fire people. So founders took fewer risks and at the societal level with fewer companies taking fewer expansion risks job creation is weaker. Labor-force inflexibility and personal liabilities are bound dampen the entrepreneurial risk taking and a society that shuns failure is likely to kill the entrepreneurial spirit. In my discussions with Korean friends they tell me that there is big pressure in Korea to work for large companies like Samsung over startups (this is similar to what I experienced in Japan) and that the more educated and hard working ones family was the more pressure to join a prestigious firm rather than starting a company or joining a startup. Many are no doubt trying to change this culture. People of Korean descent in Los Angeles are amongst the most entrepreneurial people I know — in technology but also in garments, fashion, food and so forth. So I wondered out loud with the president if the government wanted to encourage more entrepreneurship — was there a way to help promote more of a culture accepting of failure? After all, if people feel more of a safety net for trying and not succeeding more people are bound to try in the first place and more innovation is almost inevitable. Could government establish laws the encourage more risk-taking knowing that the consequence of 98 failures but 2 massive successes were enough to transform industries and society and lead to both job and wealth creation? Could leaders of society try to change the culture in ways that encourage acceptance of failure? Could Korea’s largest companies increase their funding of startups and provide them with initial business development deals as so often happens in Silicon Valley? Could big business accept its own creative destruction? I’m not sure I know how societies can change to become more tolerant of failure but at a minimum an acknowledgement of a problem has got to be the starting point for making change. I feel strongly that lowering the bar for risk-taking in all of its forms: liabilities, work-force flexibility and de-stigmatizing of businesses that don’t succeed would inevitably lead to more innovation and more job creation. I was interviewed recently by Inc Magazine and they have been publishing snippets of this interview online. I was asked about this topic of failure and you can see my views in the short, one-minute interview below. (2) Appendix (1) — A list of Abraham Lincoln’s failures. (2) — My 1-minute video with Inc Magazine talking about failure (3) — I also did an interview some time ago with TechCrunch for “Fail Week” Note: Because Medium doesn’t allow me to have links open new tabs I’m going to start linking at the end of posts. It’s not ideal and I’m hoping they’ll change their link policy. I find it distracting that when you click on a link you’re taken away from the main blog and need to hit the back button to remember to finish the article. That’s why I have links open new tabs. If you go off on a side reading expedition you can at least be reminded that you didn’t finish the original post because you see the tab. ", "sentences": [{"8c48": "Why Acceptance of Failure is Critical to Startup Success"}, {"53a6": "I talk about failure a lot because I think it can be tremendously instructive and I think that success without failure often masks underlying lessons."}, {"5ebe": "I even prefer to fund entrepreneurs who have experience some level of set-backs in their careers or startups because I think it brings a humility to decision-making that I find healthy. I have experienced many first-time entrepreneurs with too much hubris if fund-raising came easily and press was fawning and employees joined in droves and customer adoption has been rapid."}, {"8a71": "When I hear the realism that comes from founders with setback it elicits an understanding of what it takes to be successful at a startup that frankly can’t exist unless you’ve walked in those shoes before. It is these stories that helps me bond more with the team because I’ve personally experienced just about every kind of setback at my first startup:"}, {"8578": "I could write my blog alone on the mistakes I made."}, {"2e8b": "But even more important than personal lessons of failure, I believe acceptance of failure at a societal level is one of the key ingredients that allows the technology startup industry in the US to flourish. I say this as somebody who has lived in 6 countries and worked in 9 — having lived abroad for 11 years of my work life."}, {"72ce": "In my experience the US loves the narrative of the come back. We champion a storyline about an underdog who failed many times but through grit and determination have risen above the odds. One of our greatest presidents — Abraham Lincoln — lived a lifetimes of failure and setbacks before being elected as president (1). One of our greatest technology leaders (Steve Jobs) had humiliating business failure before coming back to build the most successful tech come-back of our times."}, {"d4d1": "Silicon Valley itself was built on the sciences with a foundation of trial-and-error and then improving the model and trying again. I believe this scientific method and trial-and-error approach is one of Silicon Valley’s most valuable strengths."}, {"504c": "This came to mind a couple of years ago when I had the chance to sit down with the president of South Korea and she asked a small gathering of 19 tech & business leaders for opinions about how to make the Korean economy more “creative.” The backdrop explained was that it was viewed that Korea has been tremendously successful at copying and perfecting other people’s technologies but in order to compete more effective in the future had to be more creative."}, {"d3c0": "Of course as a non-Korean I can only generalize but when it was my turn I told her my experience of living in Europe and Japan where failure seemed less tolerated than my experience of living in California and working in the tech sector. In London when founders failed they were ostracized in the press and culturally I believe it became harder to raise capital. Perhaps that’s changed in the decade since I left but that was my experience when I lived there."}, {"7c23": "In France in some ways it was worse because if you failed as a startup founder you shouldered personal liabilities that don’t exist in the US under our bankruptcy laws. You also ran the risk that if you hired employees quickly and then demand wasn’t as strong as expected it was incredibility hard to fire people. So founders took fewer risks and at the societal level with fewer companies taking fewer expansion risks job creation is weaker."}, {"31dc": "Labor-force inflexibility and personal liabilities are bound dampen the entrepreneurial risk taking and a society that shuns failure is likely to kill the entrepreneurial spirit."}, {"74c6": "In my discussions with Korean friends they tell me that there is big pressure in Korea to work for large companies like Samsung over startups (this is similar to what I experienced in Japan) and that the more educated and hard working ones family was the more pressure to join a prestigious firm rather than starting a company or joining a startup. Many are no doubt trying to change this culture."}, {"e985": "People of Korean descent in Los Angeles are amongst the most entrepreneurial people I know — in technology but also in garments, fashion, food and so forth."}, {"b6e8": "So I wondered out loud with the president if the government wanted to encourage more entrepreneurship — was there a way to help promote more of a culture accepting of failure? After all, if people feel more of a safety net for trying and not succeeding more people are bound to try in the first place and more innovation is almost inevitable."}, {"9081": "Could government establish laws the encourage more risk-taking knowing that the consequence of 98 failures but 2 massive successes were enough to transform industries and society and lead to both job and wealth creation?"}, {"91cc": "Could leaders of society try to change the culture in ways that encourage acceptance of failure? Could Korea’s largest companies increase their funding of startups and provide them with initial business development deals as so often happens in Silicon Valley? Could big business accept its own creative destruction?"}, {"66d2": "I’m not sure I know how societies can change to become more tolerant of failure but at a minimum an acknowledgement of a problem has got to be the starting point for making change."}, {"2947": "I feel strongly that lowering the bar for risk-taking in all of its forms: liabilities, work-force flexibility and de-stigmatizing of businesses that don’t succeed would inevitably lead to more innovation and more job creation."}, {"6dba": "I was interviewed recently by Inc Magazine and they have been publishing snippets of this interview online. I was asked about this topic of failure and you can see my views in the short, one-minute interview below. (2)"}, {"c9ba": "Appendix"}, {"e91b": "(1) — A list of Abraham Lincoln’s failures."}, {"f570": "(2) — My 1-minute video with Inc Magazine talking about failure"}, {"25cf": "(3) — I also did an interview some time ago with TechCrunch for “Fail Week”"}, {"e444": "Note: Because Medium doesn’t allow me to have links open new tabs I’m going to start linking at the end of posts. It’s not ideal and I’m hoping they’ll change their link policy. I find it distracting that when you click on a link you’re taken away from the main blog and need to hit the back button to remember to finish the article. That’s why I have links open new tabs. If you go off on a side reading expedition you can at least be reminded that you didn’t finish the original post because you see the tab."}], "author": "Mark Suster", "name": "2430", "parent": ""}