{"timestamp": "Jun 30, 2016", "child": "2432_1\t2432_2\t2432_3\t2432_4\t2432_5\t2432_6\t2432_7\t2432_8\t2432_9\t2432_10\t2432_11\t2432_12\t2432_13\t2432_14\t2432_15\t2432_16\t2432_17\t2432_18\t2432_19\t2432_20\t2432_21\t2432_22\t2432_23\t2432_24\t2432_25", "title": "Why Raising Too Much Money Can Harm Your Startup", "content": "Why Raising Too Much Money Can Harm Your Startup Amongst the most often asked questions I get from founders is, “How much money should I raise?” Reflexively founders want to raise as much money as they can because they figure it will give them more resources, better chances of competing and a longer runways before they have to do the often painful job of asking, yet again, for money. Every time you ask for money you’re faced with the possible of feeling literally and figuratively like a failure. I understand this instinct for more capital and I have two very different personal experiences: In my first company we raised an A-round of $16.5 million and in my second company we raised only $500,000 by choice. I have this “How much should I raise?” conversation literally every week with startups. While there is no science to it, here is how I think through the issues with founders: 1. You will spend what you raise in the same timeframes whether you raise $1.5 million or $4 million. It is a truism that with more capital you will hire people more quickly and spend more liberally whether it’s on external contractors, PR firms, attending events, doing legal work (trademarks, patents) or whatever. You will build out features or expend to platforms — often before you have enough market feedback to warrant it. I was reminded of this yesterday watching my friend Justin Kan on Snapchat with this 10-second reminder, “No matter how much you raise at your company you’ll end up spending it in 12–24 months” I would probably amend it to say 12–18 months. People do what people do. You have money, you spend it. And there are consequences for spending too much money. I was always fond of saying about fund raising, “When the hor d’oeuvres tray is passed take two and put one in your pocket for later. Just don’t take the whole tray.” My analogy was that there are markets where it’s relatively easier to raise capital and therefore you should take a little bit more but you should create a budget where you only spend 70% of what you raise on a pace of 18 months. But people never do. Justin is right. 2. How much you raise determines valuation I know it sounds crazy but at the earliest stages of a company your valuation often is determined by how much money you raise. There is a general guideline of how much investors want to own in order to invest in your company and the norm is 15–30% with the most common range 20–25% per early stage round. So the temptation would be to ask for $5 million because that implies a $20 million pre-money valuation if you’re able to only give away 20% or a $15 million pre-money valuation of investors require 25%. A $15–20 million valuation sounds better than an $8 million valuation, doesn’t it? It seems almost silly to argue that it’s better to have an $8 million valuation. But it’s actually not that silly. For starters if you raise at an $8 million pre-money valuation you’re much more likely to raise $2–3 million and not $5 million. It’s infinitely easier to raise $2–3m than $5m so you have a higher hit-rate. 3. The larger the round, the higher the price, the harder the next hurdle is to hit But the bigger point I want to make is what happens when the coffers are depleted and you need more money? That is where over-raising can be corrosive. What felt great when you raised it $5 million on $20 million now feels like a noose around your neck because raising at an up-round of $8–10 million at a $40–50 million pre-money valuation is stratospherically harder than raising at a $20 million valuation. Why? Because investors need to imagine making a minimum of 10x their invested capital and early-stage investors are shooting for even higher multiples. The data suggests that the investors have a much easier time hitting a $100–200 million outcome than a $400–500 million outcome so it’s easier to commit at lower prices. And if you raise the “5 on 20” and don’t grow into your next-round valuation you’re stuck because venture investors HATE doing down rounds. They’re corrosive in your relationship with the early VCs, the management teams will take them if they must but they end up feeling demotivated and in a venture world where great new deals are always coming around — why commit to somebody else’s problem child? 4. Constraints can spark creativity Of course it never feels this way when you’re the founder, but constraints can actually force creativity. Each person is the company has to personally do more vs. lead others doing work. Each person in the company has very short timeframes for making progress because you know proof-points are critical in fund raising. And importantly — having limited resources forces you to make hard choices about what you’re build and what you won’t. It forces harder decisions about whom you’ll hire and whom you’ll delay. It forces you to negotiate harder on your office lease and take more frugal space. It forces you to keep salaries reasonable in a market where wage inflation has been the norm for years. I like talking about it as “holding one’s feet to the fire” because it’s an idiomatic way of reminding yourself of the obligation to constantly show progress. The two biggest measures for me of early-stage company capabilities are: Mo’ money, less fire. 5. Some people can skip first base My partner Greg Bettinelli has a sports metaphor that I’ve become fond of which is “skipping first base.” Internally at Upfront it’s an entrepreneur who has enough of a proven track record that they can raise a $5–10 million A-round based on their prior experiences. I like the skip first base metaphor because for some entrepreneurs they really deserve to start on second base. Maybe they worked much of their career running a startup in a sector and years later they want to go after that market again and they know from day 1 what they want to build, why and why it would work or fail. Second-base entrepreneurs often know a large number of talented technology professionals and other executives who would gladly come back and work for him or her so team assembly is both quick and impactful. Second-base entrepreneurs often have the credibility to raise follow-on capital due to their historic track records and/or their venture relationships so clearing the valuation bar on a subsequent round becomes easier. When we think about second-base entrepreneurs we think in terms of being able to get to market without having to pitch 20 VCs and thus have all of your plans in the public market because we all know that word travels fast and we think in terms of being able to pull in a relatively senior team quickly. Often second-time entrepreneurs don’t want to leave the option of a safe exit at a smallish valuation on the table. They’ve made a bit of money, they’ve had a bit of success and they really want to go big or die trying. Out of 30–35 investments per fund we like to fund 5–6 second-base entrepreneurs but mostly we believe in capital constraints as a positive force for both investor and founder. 6. Choose wisely The obvious consideration for you when you think about how much money to raise is also from whom you will raise the money. Some funds are geared towards a wide aperture of first checks but aren’t big on following on to deals that don’t attract follow-ons. These funds have a view that “the market will speak” and if they don’t support you then something must be wrong. There are some great funds that operate this way and I see some merits. Other funds have the view that they can form conviction of whether this still represents a great investment or now irrespective of what the market says. These types of firms may see your follow-on financing as a chance to “buy up ownership.” Most firms are somewhere in the middle. Knowing the style of the partnership will tell you something about what to expect if your cash starts to deplete and you’re not yet ready for the next round. Importantly, within each firm different partners also have different styles and different levels of street cred in their respective firms to get deals done where the external market isn’t yet ready to validate things. Knowing the style and reputation of the firm and of the partner may guide you towards the right number. If a firm is known for being supportive of initiatives that take longer, you may be willing to raise a little bit less up front. The “feet to the fire” mentality still holds even if the partnership is supportive. You’re always better off if you can take the next round to market because it will create price pressure that helps you get a fair valuation internally if that’s the route you take. If you don’t have external interest you may still get an internal round done but probably at a lower price than you otherwise may have. So there’s a healthy balance between investor needs and founder needs if you keep the pressure on yourself as though you don’t have a supportive internal investor. Summary There’s no right answer, only trade offs. Most people opt for the “more money equals faster progress and less time fund raising” mentality. Often this is a mistake and one that isn’t realized for 18 months until you next need to be in market. Fund raising isn’t fun. But it’s an important process. It’s truly a marketplace where the validity of your idea is challenged and where your progress since your last time in market is measured. Marketplaces often provide the right incentives for people to perform. Having one’s feet to the fire can be painful, it also can provide inspiration and creativity. And while having more money makes today easier, having a lower valuation makes tomorrow easier. So just consider the trade-offs as you plot your journey. ", "sentences": [{"7ed2": "Why Raising Too Much Money Can Harm Your Startup"}, {"98b4": "Amongst the most often asked questions I get from founders is, “How much money should I raise?”"}, {"88b2": "Reflexively founders want to raise as much money as they can because they figure it will give them more resources, better chances of competing and a longer runways before they have to do the often painful job of asking, yet again, for money. Every time you ask for money you’re faced with the possible of feeling literally and figuratively like a failure."}, {"29d5": "I understand this instinct for more capital and I have two very different personal experiences: In my first company we raised an A-round of $16.5 million and in my second company we raised only $500,000 by choice."}, {"45ab": "I have this “How much should I raise?” conversation literally every week with startups. While there is no science to it, here is how I think through the issues with founders:"}, {"e8a5": "1. You will spend what you raise in the same timeframes whether you raise $1.5 million or $4 million."}, {"6af8": "It is a truism that with more capital you will hire people more quickly and spend more liberally whether it’s on external contractors, PR firms, attending events, doing legal work (trademarks, patents) or whatever. You will build out features or expend to platforms — often before you have enough market feedback to warrant it."}, {"7b37": "I was reminded of this yesterday watching my friend Justin Kan on Snapchat with this 10-second reminder, “No matter how much you raise at your company you’ll end up spending it in 12–24 months”"}, {"d07d": "I would probably amend it to say 12–18 months. People do what people do. You have money, you spend it. And there are consequences for spending too much money."}, {"89a0": "I was always fond of saying about fund raising, “When the hor d’oeuvres tray is passed take two and put one in your pocket for later. Just don’t take the whole tray.” My analogy was that there are markets where it’s relatively easier to raise capital and therefore you should take a little bit more but you should create a budget where you only spend 70% of what you raise on a pace of 18 months."}, {"0e23": "But people never do. Justin is right."}, {"ab99": "2. How much you raise determines valuation"}, {"b33d": "I know it sounds crazy but at the earliest stages of a company your valuation often is determined by how much money you raise. There is a general guideline of how much investors want to own in order to invest in your company and the norm is 15–30% with the most common range 20–25% per early stage round."}, {"56cd": "So the temptation would be to ask for $5 million because that implies a $20 million pre-money valuation if you’re able to only give away 20% or a $15 million pre-money valuation of investors require 25%."}, {"8279": "A $15–20 million valuation sounds better than an $8 million valuation, doesn’t it? It seems almost silly to argue that it’s better to have an $8 million valuation. But it’s actually not that silly."}, {"82a4": "For starters if you raise at an $8 million pre-money valuation you’re much more likely to raise $2–3 million and not $5 million. It’s infinitely easier to raise $2–3m than $5m so you have a higher hit-rate."}, {"8cc6": "3. The larger the round, the higher the price, the harder the next hurdle is to hit"}, {"d9cd": "But the bigger point I want to make is what happens when the coffers are depleted and you need more money? That is where over-raising can be corrosive. What felt great when you raised it $5 million on $20 million now feels like a noose around your neck because raising at an up-round of $8–10 million at a $40–50 million pre-money valuation is stratospherically harder than raising at a $20 million valuation."}, {"8acc": "Why?"}, {"e4bf": "Because investors need to imagine making a minimum of 10x their invested capital and early-stage investors are shooting for even higher multiples. The data suggests that the investors have a much easier time hitting a $100–200 million outcome than a $400–500 million outcome so it’s easier to commit at lower prices."}, {"3b89": "And if you raise the “5 on 20” and don’t grow into your next-round valuation you’re stuck because venture investors HATE doing down rounds. They’re corrosive in your relationship with the early VCs, the management teams will take them if they must but they end up feeling demotivated and in a venture world where great new deals are always coming around — why commit to somebody else’s problem child?"}, {"e8b3": "4. Constraints can spark creativity"}, {"e332": "Of course it never feels this way when you’re the founder, but constraints can actually force creativity. Each person is the company has to personally do more vs. lead others doing work. Each person in the company has very short timeframes for making progress because you know proof-points are critical in fund raising."}, {"9833": "And importantly — having limited resources forces you to make hard choices about what you’re build and what you won’t. It forces harder decisions about whom you’ll hire and whom you’ll delay. It forces you to negotiate harder on your office lease and take more frugal space. It forces you to keep salaries reasonable in a market where wage inflation has been the norm for years."}, {"daf0": "I like talking about it as “holding one’s feet to the fire” because it’s an idiomatic way of reminding yourself of the obligation to constantly show progress."}, {"aa71": "The two biggest measures for me of early-stage company capabilities are:"}, {"3a70": "Mo’ money, less fire."}, {"1737": "5. Some people can skip first base"}, {"42ed": "My partner Greg Bettinelli has a sports metaphor that I’ve become fond of which is “skipping first base.” Internally at Upfront it’s an entrepreneur who has enough of a proven track record that they can raise a $5–10 million A-round based on their prior experiences."}, {"a445": "I like the skip first base metaphor because for some entrepreneurs they really deserve to start on second base."}, {"c243": "Maybe they worked much of their career running a startup in a sector and years later they want to go after that market again and they know from day 1 what they want to build, why and why it would work or fail."}, {"b1d5": "Second-base entrepreneurs often know a large number of talented technology professionals and other executives who would gladly come back and work for him or her so team assembly is both quick and impactful."}, {"1774": "Second-base entrepreneurs often have the credibility to raise follow-on capital due to their historic track records and/or their venture relationships so clearing the valuation bar on a subsequent round becomes easier."}, {"a5a9": "When we think about second-base entrepreneurs we think in terms of being able to get to market without having to pitch 20 VCs and thus have all of your plans in the public market because we all know that word travels fast and we think in terms of being able to pull in a relatively senior team quickly."}, {"6732": "Often second-time entrepreneurs don’t want to leave the option of a safe exit at a smallish valuation on the table. They’ve made a bit of money, they’ve had a bit of success and they really want to go big or die trying."}, {"b85b": "Out of 30–35 investments per fund we like to fund 5–6 second-base entrepreneurs but mostly we believe in capital constraints as a positive force for both investor and founder."}, {"df7b": "6. Choose wisely"}, {"67fc": "The obvious consideration for you when you think about how much money to raise is also from whom you will raise the money."}, {"8c25": "Some funds are geared towards a wide aperture of first checks but aren’t big on following on to deals that don’t attract follow-ons. These funds have a view that “the market will speak” and if they don’t support you then something must be wrong. There are some great funds that operate this way and I see some merits."}, {"83ad": "Other funds have the view that they can form conviction of whether this still represents a great investment or now irrespective of what the market says. These types of firms may see your follow-on financing as a chance to “buy up ownership.”"}, {"d916": "Most firms are somewhere in the middle. Knowing the style of the partnership will tell you something about what to expect if your cash starts to deplete and you’re not yet ready for the next round. Importantly, within each firm different partners also have different styles and different levels of street cred in their respective firms to get deals done where the external market isn’t yet ready to validate things."}, {"3138": "Knowing the style and reputation of the firm and of the partner may guide you towards the right number. If a firm is known for being supportive of initiatives that take longer, you may be willing to raise a little bit less up front."}, {"285d": "The “feet to the fire” mentality still holds even if the partnership is supportive. You’re always better off if you can take the next round to market because it will create price pressure that helps you get a fair valuation internally if that’s the route you take. If you don’t have external interest you may still get an internal round done but probably at a lower price than you otherwise may have. So there’s a healthy balance between investor needs and founder needs if you keep the pressure on yourself as though you don’t have a supportive internal investor."}, {"e4f0": "Summary"}, {"e106": "There’s no right answer, only trade offs. Most people opt for the “more money equals faster progress and less time fund raising” mentality. Often this is a mistake and one that isn’t realized for 18 months until you next need to be in market."}, {"6fd6": "Fund raising isn’t fun. But it’s an important process. It’s truly a marketplace where the validity of your idea is challenged and where your progress since your last time in market is measured. Marketplaces often provide the right incentives for people to perform. Having one’s feet to the fire can be painful, it also can provide inspiration and creativity."}, {"af88": "And while having more money makes today easier, having a lower valuation makes tomorrow easier. So just consider the trade-offs as you plot your journey."}], "author": "Mark Suster", "name": "2432", "parent": ""}