{"title": "9 Legit Master’s Degrees You Can Now Earn Completely Online", "name": "2436", "content": "9 Legit Master’s Degrees You Can Now Earn Completely Online If you’ve been thinking of going back to school to get a master’s degree — but are too busy with work or family — you might want to consider an online master’s. But how do you find legit masters degree programs in a sea of mediocre programs and outright scams? By going straight to some of the best universities on the planet. These online master’s degrees can be much less expensive than in-person masters, and offer considerable flexibility — you don’t have to report to a campus, and you can watch the lectures and do the assignments at your convenience. Top universities have collaborated with Massive Open Online Course (MOOC) providers to launch their online master’s degree. The first MOOC-based degree was announced back in 2013. It took two years for the next one to be announced in 2015. But in the last year or so, MOOC providers have announced seven more completely-online master’s degrees. In fact, Coursera plans to offer 20 such degrees by the end of 2019. The advantage of MOOC-based master’s degrees is that many courses that are part of the degree are completely free to take. So you can preview a part of the content before committing to anything. Also, all of these degrees are based on the pay-as-you-go model. You only pay for the courses that you’re currently taking. Some also have the option to earn partial academic credits. One thing to be aware is that each degree has its own application process (and deadlines), as well as minimum requirements like a bachelor’s degree or minimum work experience. Many require you to submit different standardized test scores, like the GRE, GMAT, or TOEFL. If you’re not interested in a formal credential and just want to learn, check out Class Central for over 7,000 MOOCs taught by 700+ universities around the world. Without further delay, here are nine completely online master’s degrees that have been announced so far. 1. Georgia Tech and Udacity: Online Master of Science in Computer Science (OMSCS) Announced Back in 2013, Udacity and Georgia Tech’s completely online Masters in Computer Science was the first degree announced by a MOOC provider. The entire degree was going to cost less than $7,000. The tuition fee has since then increased from $402 per three-credit hour to $510. Zvi Galil, Dean of Georgia Tech’s College of Computing, speaking to OMSCS students at an event (which I got to attend) organized by Udacity at SXSWedu. Things were really slow at the beginning. It took two years before the first batch of eighteen students graduated in December 2015. A year later, in December 2016, around 200 students had graduated. But the OMSCS is gaining momentum. There are now over 4,500 students enrolled in the spring 2017 semester. You can find more details here: https://www.omscs.gatech.edu/ 2. Georgia Tech and edX: Online Master of Science in Analytics Building on the success of its OMSCS program, Georgia Tech has announced a second, similar program: Online Masters of Science In Analytics (OMS Analytics). According to Georgia Tech, the OMS Analytics will cost less than $10,000 and will be offered in August this year. Three of Georgia Tech’s OMS Analytics foundational courses will form the Analytics: Essential Tools and Methods MicroMasters credential program on edx.org. It consists of three free online courses: Introduction to Analytics Modeling, Computing for Data Analysis, and Data Analytics in Business. The first of these courses starts on May 14 2017. The tuition fee will be $825 per three-credit hour course, and an additional $301 per academic term of enrollment. The first cohort will start in August 2017 and will be limited to 250 students. Applications opened on January 12, 2017. You can find more details here. 3. University of Illinois and Coursera: Master of Business Administration (iMBA) University of Illinois at Urbana–Champaign became Coursera’s first partner to announce a fully-fledged business degree with them. Announced back in 2015, the iMBA (as it’s called) costs around $22,000 and is designed to “help you achieve deep mastery of business strategy and leadership.” Coursera’s degrees are built on top of Specializations, which are sequences of courses that amount to micro-credentials. These Specializations are open to anyone in the world, and as far I can tell the individual courses of these Specializations are free to audit. According to Coursera, the iMBA program is heavily interactive, with live global classrooms, team projects, and personal contact with top professors. You can find more details here: https://www.coursera.org/university-programs/imba 4. University of Illinois and Coursera: Master of Computer Science in Data Science (MCS-DS) According to U.S. News & World Report, the University of Illinois is in the top five schools for Computer Science. So it’s a good thing that they launched a MS CS in Data Science. MCS-DS costs less than $20k. Here is what the information page says about the program: The MCS-DS builds expertise in four core areas of computer science: data visualization, machine learning, data mining and cloud computing, in addition to building valuable skill sets in statistics and information science with courses taught in collaboration with the University’s Statistics Department and iSchool (ranked #1 among Library and Information Studies Schools.) Similar to iMBA, the MCS-DS consists of Specializations that are available for anyone to signup for everyone. Two of these Specializations, those on Data Visualization and Cloud Computing, are already available. You can find more details about this program here: https://www.coursera.org/university-programs/masters-in-computer-data-science 5. University of Illinois and Coursera: Master of Science in Accounting (iMSA) According to U.S. News & World Report, the University of Illinois’s on-campus accounting program (both undergrad and master’s degrees) is a top three program. The cost of the online program is an estimated $27.2k, making it the most expensive master’s degree offered by the University of Illinois on Coursera. This iMSA was announced just last month, and applications for the first cohort are open now. You can find more details here: https://www.coursera.org/university-programs/imsa 6. HEC Paris and Coursera: Master’s in Innovation and Entrepreneurship (OMIE) https://www.youtube.com/watch?v=J_vlfDCqv-c&feature=youtu.be HEC Paris became the second university to offer a masters program on Coursera. HEC Paris is one of Europe’s highest ranked business schools (#2 on the Financial Times’ rankings). The online Master’s in Innovation and Entrepreneurship (OMIE), announced last month, costs €20,000. OMIE also includes a certificate program, which costs €5,000. The Certificate in Innovation Management and Entrepreneurship does not have an application process and is open to everyone. Once completed, it can be applied towards the full degree. You can find more details here: https://www.coursera.org/university-programs/masters-innovation-entrepreneurship 7. Deakin University and FutureLearn: Cyber Security FutureLearn is a UK-based MOOC provider backed by The Open University. Last year FutureLearn announced that it will launch six post-graduate degrees in partnership with Australia’s Deakin University. The certifications awarded by FutureLearn and Deakin University are: a graduate certificate, a graduate diploma, and a master’s degree. Of the five announced so far, three of them are available as a master’s degree. Each degree will consist of up to sixteen FutureLearn Programs, which are similar to a Coursera Specialization or a Udacity Nanodegree. Most of the courses that are part of these degrees will have a fee attached, but there will be a few “taster courses” for each degree that are free. The Cyber Security master’s degree will cost around £24k. Students will “gain knowledge from system security and digital forensics to analytics and organisational security.” You can find more details here: https://www.futurelearn.com/degrees/deakin-university/cyber-security 8. Deakin University and FutureLearn: Professional Practice: Information Technology Here is a description of the degree on FutureLearn: “This degree recognises the discipline-based knowledge and skills developed by professionals in the workplace. This is coupled with employability skills that are validated and endorsed through a final holistic assessment. Upon the completion of this degree, graduates will possess advanced skills and complex knowledge in the discipline areas they have selected.” FutureLearn’s degrees haven’t launched yet, and complete details are still lacking. The pricing for this degree will probably be around £24k. You can find more details here: https://www.futurelearn.com/degrees/deakin-university/information-technology-professional-practice 9. Deakin University and FutureLearn: Development and Humanitarian Action This master’s degree has been developed in association with Save the Children. Here is a description of the degree on FutureLearn: “These degrees — developed in association with Save the Children — build a unique, global platform where development & humanitarian practitioners and academics can share knowledge and experience, with a focus on improving leadership, preparedness and response capacities to national and international emergencies and developmental issues.” This master’s degree consists of sixteen programs and costs around £24k. You can find more details here: https://www.futurelearn.com/degrees/deakin-university/development-and-humanitarian-action If you found this helpful, check out some my other explorations of Class Central’s online course datasets: Here are 250 Ivy League courses you can take online right now for free250 MOOCs from Brown, Columbia, Cornell, Dartmouth, Harvard, Penn, Princeton, and Yale.medium.freecodecamp.com The 50 best free online university courses according to dataWhen I launched Class Central back in November 2011, there were around 18 or so free online courses, and almost all of…medium.freecodecamp.com ", "author": "Dhawal Shah", "sentences": [{"3517": "9 Legit Master’s Degrees You Can Now Earn Completely Online"}, {"0689": "If you’ve been thinking of going back to school to get a master’s degree — but are too busy with work or family — you might want to consider an online master’s."}, {"ff06": "But how do you find legit masters degree programs in a sea of mediocre programs and outright scams? By going straight to some of the best universities on the planet."}, {"0523": "These online master’s degrees can be much less expensive than in-person masters, and offer considerable flexibility — you don’t have to report to a campus, and you can watch the lectures and do the assignments at your convenience."}, {"1d0b": "Top universities have collaborated with Massive Open Online Course (MOOC) providers to launch their online master’s degree. The first MOOC-based degree was announced back in 2013. It took two years for the next one to be announced in 2015. But in the last year or so, MOOC providers have announced seven more completely-online master’s degrees. In fact, Coursera plans to offer 20 such degrees by the end of 2019."}, {"1843": "The advantage of MOOC-based master’s degrees is that many courses that are part of the degree are completely free to take. So you can preview a part of the content before committing to anything."}, {"3026": "Also, all of these degrees are based on the pay-as-you-go model. You only pay for the courses that you’re currently taking. Some also have the option to earn partial academic credits."}, {"3200": "One thing to be aware is that each degree has its own application process (and deadlines), as well as minimum requirements like a bachelor’s degree or minimum work experience. Many require you to submit different standardized test scores, like the GRE, GMAT, or TOEFL."}, {"e60a": "If you’re not interested in a formal credential and just want to learn, check out Class Central for over 7,000 MOOCs taught by 700+ universities around the world."}, {"c685": "Without further delay, here are nine completely online master’s degrees that have been announced so far."}, {"3274": "1. Georgia Tech and Udacity: Online Master of Science in Computer Science (OMSCS)"}, {"88a7": "Announced Back in 2013, Udacity and Georgia Tech’s completely online Masters in Computer Science was the first degree announced by a MOOC provider. The entire degree was going to cost less than $7,000."}, {"3734": "The tuition fee has since then increased from $402 per three-credit hour to $510."}, {"6687": "Zvi Galil, Dean of Georgia Tech’s College of Computing, speaking to OMSCS students at an event (which I got to attend) organized by Udacity at SXSWedu."}, {"5c6e": "Things were really slow at the beginning. It took two years before the first batch of eighteen students graduated in December 2015. A year later, in December 2016, around 200 students had graduated."}, {"b93d": "But the OMSCS is gaining momentum. There are now over 4,500 students enrolled in the spring 2017 semester."}, {"cdec": "You can find more details here: https://www.omscs.gatech.edu/"}, {"bb78": "2. Georgia Tech and edX: Online Master of Science in Analytics"}, {"be5e": "Building on the success of its OMSCS program, Georgia Tech has announced a second, similar program: Online Masters of Science In Analytics (OMS Analytics). According to Georgia Tech, the OMS Analytics will cost less than $10,000 and will be offered in August this year."}, {"66cb": "Three of Georgia Tech’s OMS Analytics foundational courses will form the Analytics: Essential Tools and Methods MicroMasters credential program on edx.org. It consists of three free online courses: Introduction to Analytics Modeling, Computing for Data Analysis, and Data Analytics in Business. The first of these courses starts on May 14 2017."}, {"0029": "The tuition fee will be $825 per three-credit hour course, and an additional $301 per academic term of enrollment. The first cohort will start in August 2017 and will be limited to 250 students. Applications opened on January 12, 2017."}, {"8db8": "You can find more details here."}, {"1e20": "3. University of Illinois and Coursera: Master of Business Administration (iMBA)"}, {"719d": "University of Illinois at Urbana–Champaign became Coursera’s first partner to announce a fully-fledged business degree with them. Announced back in 2015, the iMBA (as it’s called) costs around $22,000 and is designed to “help you achieve deep mastery of business strategy and leadership.”"}, {"07be": "Coursera’s degrees are built on top of Specializations, which are sequences of courses that amount to micro-credentials. These Specializations are open to anyone in the world, and as far I can tell the individual courses of these Specializations are free to audit."}, {"91b9": "According to Coursera, the iMBA program is heavily interactive, with live global classrooms, team projects, and personal contact with top professors."}, {"9379": "You can find more details here: https://www.coursera.org/university-programs/imba"}, {"711d": "4. University of Illinois and Coursera: Master of Computer Science in Data Science (MCS-DS)"}, {"a922": "According to U.S. News & World Report, the University of Illinois is in the top five schools for Computer Science. So it’s a good thing that they launched a MS CS in Data Science."}, {"1079": "MCS-DS costs less than $20k. Here is what the information page says about the program:"}, {"4a6c": "The MCS-DS builds expertise in four core areas of computer science: data visualization, machine learning, data mining and cloud computing, in addition to building valuable skill sets in statistics and information science with courses taught in collaboration with the University’s Statistics Department and iSchool (ranked #1 among Library and Information Studies Schools.)"}, {"9731": "Similar to iMBA, the MCS-DS consists of Specializations that are available for anyone to signup for everyone. Two of these Specializations, those on Data Visualization and Cloud Computing, are already available."}, {"3c42": "You can find more details about this program here: https://www.coursera.org/university-programs/masters-in-computer-data-science"}, {"4041": "5. University of Illinois and Coursera: Master of Science in Accounting (iMSA)"}, {"24df": "According to U.S. News & World Report, the University of Illinois’s on-campus accounting program (both undergrad and master’s degrees) is a top three program. The cost of the online program is an estimated $27.2k, making it the most expensive master’s degree offered by the University of Illinois on Coursera."}, {"f0f7": "This iMSA was announced just last month, and applications for the first cohort are open now."}, {"d286": "You can find more details here: https://www.coursera.org/university-programs/imsa"}, {"5259": "6. HEC Paris and Coursera: Master’s in Innovation and Entrepreneurship (OMIE)"}, {"c9bc": "https://www.youtube.com/watch?v=J_vlfDCqv-c&feature=youtu.be"}, {"df4f": "HEC Paris became the second university to offer a masters program on Coursera. HEC Paris is one of Europe’s highest ranked business schools (#2 on the Financial Times’ rankings)."}, {"3d2a": "The online Master’s in Innovation and Entrepreneurship (OMIE), announced last month, costs €20,000. OMIE also includes a certificate program, which costs €5,000. The Certificate in Innovation Management and Entrepreneurship does not have an application process and is open to everyone. Once completed, it can be applied towards the full degree."}, {"eb20": "You can find more details here: https://www.coursera.org/university-programs/masters-innovation-entrepreneurship"}, {"d28f": "7. Deakin University and FutureLearn: Cyber Security"}, {"f645": "FutureLearn is a UK-based MOOC provider backed by The Open University. Last year FutureLearn announced that it will launch six post-graduate degrees in partnership with Australia’s Deakin University."}, {"f780": "The certifications awarded by FutureLearn and Deakin University are: a graduate certificate, a graduate diploma, and a master’s degree. Of the five announced so far, three of them are available as a master’s degree."}, {"b0e5": "Each degree will consist of up to sixteen FutureLearn Programs, which are similar to a Coursera Specialization or a Udacity Nanodegree. Most of the courses that are part of these degrees will have a fee attached, but there will be a few “taster courses” for each degree that are free."}, {"3552": "The Cyber Security master’s degree will cost around £24k. Students will “gain knowledge from system security and digital forensics to analytics and organisational security.”"}, {"8718": "You can find more details here: https://www.futurelearn.com/degrees/deakin-university/cyber-security"}, {"b9c3": "8. Deakin University and FutureLearn: Professional Practice: Information Technology"}, {"8d2f": "Here is a description of the degree on FutureLearn:"}, {"bd5d": "“This degree recognises the discipline-based knowledge and skills developed by professionals in the workplace. This is coupled with employability skills that are validated and endorsed through a final holistic assessment. Upon the completion of this degree, graduates will possess advanced skills and complex knowledge in the discipline areas they have selected.”"}, {"a39a": "FutureLearn’s degrees haven’t launched yet, and complete details are still lacking. The pricing for this degree will probably be around £24k."}, {"431c": "You can find more details here: https://www.futurelearn.com/degrees/deakin-university/information-technology-professional-practice"}, {"b543": "9. Deakin University and FutureLearn: Development and Humanitarian Action"}, {"6994": "This master’s degree has been developed in association with Save the Children. Here is a description of the degree on FutureLearn:"}, {"88ae": "“These degrees — developed in association with Save the Children — build a unique, global platform where development & humanitarian practitioners and academics can share knowledge and experience, with a focus on improving leadership, preparedness and response capacities to national and international emergencies and developmental issues.”"}, {"19a0": "This master’s degree consists of sixteen programs and costs around £24k."}, {"4f4f": "You can find more details here: https://www.futurelearn.com/degrees/deakin-university/development-and-humanitarian-action"}, {"98fa": "If you found this helpful, check out some my other explorations of Class Central’s online course datasets:"}, {"46e7": "Here are 250 Ivy League courses you can take online right now for free250 MOOCs from Brown, Columbia, Cornell, Dartmouth, Harvard, Penn, Princeton, and Yale.medium.freecodecamp.com"}, {"602c": "The 50 best free online university courses according to dataWhen I launched Class Central back in November 2011, there were around 18 or so free online courses, and almost all of…medium.freecodecamp.com"}], "timestamp": "Apr 17", "parent": "", "child": "2436_1\t2436_2\t2436_3\t2436_4\t2436_5\t2436_6\t2436_7\t2436_8\t2436_9\t2436_10\t2436_11\t2436_122436_1\t2436_2\t2436_3\t2436_4\t2436_5\t2436_6\t2436_7\t2436_8\t2436_9\t2436_10\t2436_11\t2436_12"}