{"title": "Be Someone Who Thinks Differently", "name": "2437", "content": "Be Someone Who Thinks Differently “Here’s to the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes. The ones who see things differently. They’re not fond of rules. And they have no respect for the status quo. You can quote them, disagree with them, glorify or vilify them. About the only thing you can’t do is ignore them. Because they change things. They push the human race forward. And while some may see them as the crazy ones, we see genius. Because the people who are crazy enough to think they can change the world, are the ones who do.” This is taken from a famous Apple ad. It helped put the company back on track after Steve Jobs returned to revive them from near-bankruptcy in 1997. It’s touching, inspiring, and empowering. It’s how marketing should be done. But why is it relevant to the rest of us? Not all of us can, will, or want to change the world. There’s an easy answer. Because you’re not always at the center of a bell-curve, and that’s who the status quo caters to. You live a unique life, and it demands a unique outlook. A Few Things the Status Quo Says.. Is it good advice? For some people, yes. But there is also more to the story. Let’s Talk About the Other Side “Success is achieved by people who deeply understand reality and know how to use it to get what they want.” — Ray Dalio The status quo is unapologetically biased towards average in EVERY situation. Sometimes, in certain instances, sure, you’ll fall close to the middle of the bell-curve, and that’s fine. But much of the time, you’ll be navigating the corners, and that’s when you’ll be punished. Societial rules don’t cater there. We live in a complex world, and we have complex lives based on a personal combination of memories and emotions. They don’t fit a predefined mold. It’s critical to understand the existing conventions, structures, and systems. They provide a reference point, and more often than not, they are useful. But it’s far more critical to know that they also aren’t set in stone. Outside of the law and the boundaries of modern science, much of reality is flexible. Almost everything around us that we presume to be fixed and static was produced and labeled by other people. There is no law in the universe that invents ideas and implements them. Powerful brains, like yours, do that. The world — if understood well — can be reshaped with the right tools. What Are These Tools? “You’ve got to have [mental] models in your head… and the models have to come from multiple disciplines because all the wisdom of the world is not to be found in one little academic department.” — Charlie Munger You need to understand the world from as many diverse angles as you can. Mental models are a way to do that. They provide a fundamental framework for deciphering complexity so that you can optimize your decision-making. A common example is Pareto’s Principle (80/20 Rule), which tells us that in any domain about 80 percent of results come from 20 percent of the causes. In businesses, about 80 percent of sales come from 20 percent of customers. In software, 20 percent of the code accounts for about 80 percent of errors. Another is Cost-benefit Analysis. It’s a systematic approach to evaluating the different avenues ahead and weighting their positives and their negatives. Each of them, in their own way, help us make sense of the noise around us. They either explain a generally observed trend, or they give us a method for breaking down and ordering information in a way that’s a little more useful. A Few Models I Find Valuable The world is messy. It can’t be viewed through a single lens. It needs to be simplified and approached from a multi-dimensional viewpoint, and a well-diversified collection of mental models are the best way to do that. They allow room for flexible evaluation, and they accurately assess how reality interacts with the different components of your own personal life. A good combination of mental models are a far better tool to make life decisions than blindly accepting the status quo because you’re supposed to. Explore different disciplines and create your own personal toolkit of models. A Better Approach to Life “Everything around you that you call life was made up by people that were no smarter than you. And you can change it, you can influence it. Once you learn that, you’ll never be the same again.” — Steve Jobs If you ask good questions, strive to always learn, and develop a strong mental framework for evaluating the divergence between where you are and where you want to be, you’ll be able to navigate the world far more successfully. To do that, however, you have to think for yourself. You need the courage to walk away from the majority, and you need the audacity to follow through. You’re not just a passenger hoping to observe reality but leave it untouched. You’re a participant, and your job is to challenge it and carve your own way. Know the rules. But more importantly, know when to break them. Worth reading? Please press the💚 and share it with friends. It helps more people see it. Want more? Join me at Design Luck. It’s where I share unique insights on how to live a better life by dissecting science, art, and business. I think you’d like it. ", "author": "Zat Rana", "sentences": [{"4630": "Be Someone Who Thinks Differently"}, {"df91": "“Here’s to the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes. The ones who see things differently. They’re not fond of rules. And they have no respect for the status quo. You can quote them, disagree with them, glorify or vilify them. About the only thing you can’t do is ignore them. Because they change things. They push the human race forward. And while some may see them as the crazy ones, we see genius. Because the people who are crazy enough to think they can change the world, are the ones who do.”"}, {"1f1a": "This is taken from a famous Apple ad. It helped put the company back on track after Steve Jobs returned to revive them from near-bankruptcy in 1997."}, {"edde": "It’s touching, inspiring, and empowering. It’s how marketing should be done."}, {"0535": "But why is it relevant to the rest of us?"}, {"3791": "Not all of us can, will, or want to change the world."}, {"03f1": "There’s an easy answer."}, {"7fc1": "Because you’re not always at the center of a bell-curve, and that’s who the status quo caters to. You live a unique life, and it demands a unique outlook."}, {"42b2": "A Few Things the Status Quo Says.."}, {"62ec": "Is it good advice? For some people, yes. But there is also more to the story."}, {"493b": "Let’s Talk About the Other Side"}, {"a616": "“Success is achieved by people who deeply understand reality and know how to use it to get what they want.” — Ray Dalio"}, {"1a78": "The status quo is unapologetically biased towards average in EVERY situation."}, {"b729": "Sometimes, in certain instances, sure, you’ll fall close to the middle of the bell-curve, and that’s fine. But much of the time, you’ll be navigating the corners, and that’s when you’ll be punished. Societial rules don’t cater there."}, {"772d": "We live in a complex world, and we have complex lives based on a personal combination of memories and emotions. They don’t fit a predefined mold."}, {"6452": "It’s critical to understand the existing conventions, structures, and systems. They provide a reference point, and more often than not, they are useful."}, {"860e": "But it’s far more critical to know that they also aren’t set in stone. Outside of the law and the boundaries of modern science, much of reality is flexible."}, {"cbd2": "Almost everything around us that we presume to be fixed and static was produced and labeled by other people. There is no law in the universe that invents ideas and implements them. Powerful brains, like yours, do that."}, {"77f3": "The world — if understood well — can be reshaped with the right tools."}, {"23f9": "What Are These Tools?"}, {"c662": "“You’ve got to have [mental] models in your head… and the models have to come from multiple disciplines because all the wisdom of the world is not to be found in one little academic department.” — Charlie Munger"}, {"bf42": "You need to understand the world from as many diverse angles as you can."}, {"762a": "Mental models are a way to do that. They provide a fundamental framework for deciphering complexity so that you can optimize your decision-making."}, {"f782": "A common example is Pareto’s Principle (80/20 Rule), which tells us that in any domain about 80 percent of results come from 20 percent of the causes."}, {"aab8": "In businesses, about 80 percent of sales come from 20 percent of customers. In software, 20 percent of the code accounts for about 80 percent of errors."}, {"7fa4": "Another is Cost-benefit Analysis. It’s a systematic approach to evaluating the different avenues ahead and weighting their positives and their negatives."}, {"2fae": "Each of them, in their own way, help us make sense of the noise around us."}, {"c2ba": "They either explain a generally observed trend, or they give us a method for breaking down and ordering information in a way that’s a little more useful."}, {"a7d4": "A Few Models I Find Valuable"}, {"9da9": "The world is messy. It can’t be viewed through a single lens. It needs to be simplified and approached from a multi-dimensional viewpoint, and a well-diversified collection of mental models are the best way to do that."}, {"881d": "They allow room for flexible evaluation, and they accurately assess how reality interacts with the different components of your own personal life."}, {"bd4b": "A good combination of mental models are a far better tool to make life decisions than blindly accepting the status quo because you’re supposed to."}, {"7045": "Explore different disciplines and create your own personal toolkit of models."}, {"1370": "A Better Approach to Life"}, {"c686": "“Everything around you that you call life was made up by people that were no smarter than you. And you can change it, you can influence it. Once you learn that, you’ll never be the same again.” — Steve Jobs"}, {"97d5": "If you ask good questions, strive to always learn, and develop a strong mental framework for evaluating the divergence between where you are and where you want to be, you’ll be able to navigate the world far more successfully."}, {"8479": "To do that, however, you have to think for yourself. You need the courage to walk away from the majority, and you need the audacity to follow through."}, {"8f3c": "You’re not just a passenger hoping to observe reality but leave it untouched. You’re a participant, and your job is to challenge it and carve your own way."}, {"4a70": "Know the rules. But more importantly, know when to break them."}, {"e1f8": "Worth reading?"}, {"e78e": "Please press the💚 and share it with friends. It helps more people see it."}, {"0b72": "Want more?"}, {"65e8": "Join me at Design Luck. It’s where I share unique insights on how to live a better life by dissecting science, art, and business. I think you’d like it."}], "timestamp": "Apr 17", "parent": "", "child": "2437_1\t2437_2\t2437_3\t2437_4\t2437_5\t2437_6\t2437_7\t2437_8\t2437_9\t2437_102437_1\t2437_2\t2437_3\t2437_4\t2437_5\t2437_6\t2437_7\t2437_8\t2437_9\t2437_102437_1\t2437_2\t2437_3\t2437_4\t2437_5\t2437_6\t2437_7\t2437_8\t2437_9\t2437_102437_1\t2437_2\t2437_3\t2437_4\t2437_5\t2437_6\t2437_7\t2437_8\t2437_9\t2437_10"}