{"title": "7 Things You Need to Stop Doing to Be More Productive, Backed by Science", "name": "2442", "content": "7 Things You Need to Stop Doing to Be More Productive, Backed by Science BY CAMMI PHAM — First appeared on my personal blog When I was 17 years old, I used to work and study for about 20 hours a day. I went to school, did my homework during breaks and managed a not-for-profit organization at night. At that time, working hard landed me countless national campaigns, opportunities to work with A-list organizations and a successful career. As I got older, I started thinking differently. I realized that working harder is not always the right path to success. Sometimes, working less can actually produce better results. Consider a small business owner, who works non-stop. However, working hard won’t help him compete with his multi-million competitors. Time is a limited commodity. An entrepreneur can work 24 hours a day and 7 days a week (the most amount of time anyone can work, really). His or her competitor can always spend more money, build a bigger team and spend a lot more time on the same project. Then why have small startups accomplished things that larger corporations couldn’t? Facebook bought Instagram, a 13-employee company for a billion dollars. Snapchat, a young startup with 30 employees is turning down offers from tech giants Facebook and Google. Part of their successes were based on luck — the rest is based on efficiency. The key to success is not hard working but smart working. There’s a notable distinction between being busy and being productive. Being busy doesn’t necessarily mean you’re being productive. Being productive is less about time management and more on managing your energy. It is the business of life. We need to learn how to spend the least amount of energy to get the most benefits. I am so lucky to work with an amazing team here at Filemobile. Everyone always challenges me and helps me sort my priorities to become more productive. I learned to reduce my work week from 80 hours to 40 hours, and get a lot more work done in the process. In other words, less is more. Here are 7 I things I stopped doing to become more productive. 1. Stop working overtime and increase your productivity Have you ever wondered where the 40-hour work week came from? In 1926, Henry Ford, American industrialist and founder of Ford Motor Company, conducted experiments with interesting results: when you decrease your daily working hours from 10 to 8, and shorten the work week from 6 days to 5, your productivity increases. Source: Calculating Loss of Productivity Due to Overtime Using Published Charts — Fact or Fiction The more you work, the less effective and productive you are going to become over both short and long term. “Scheduled Overtime Effect on Construction Projects”, a report issued by The Business Roundtable in 1980 states. “Where a work schedule of 60 or more hours per week is continued longer than about two months, the cumulative effect of decreased productivity will cause a delay in the completion date beyond that which could have been realized with the same crew size on a 40-hour week.” Source: Calculating Loss of Productivity Due to Overtime Using Published Charts — Fact or Fiction In an article for AlterNet, editor Sara Robinson referenced research conducted by the US military that revealed that “losing one hour of sleep per night for a week will cause a level of cognitive degradation equivalent to a .10 blood alcohol level.” You can get fired for coming to work drunk, but it is deemed acceptable to pull an all-nighter. Irrespective of how well you were able to get on with your day after that most recent night without sleep, it is unlikely that you felt especially upbeat and joyous about the world. Your more-negative-than-usual perspective will have resulted from a generalized low mood, which is a normal consequence of being overtired. More important than just the mood, this mind-set is often accompanied by decreases in willingness to think and act proactively, control impulses, feel positive about yourself, empathize with others, and generally use emotional intelligence. Source: The Secret World of Sleep: The Surprising Science of the Mind at Rest It’s important for us not to overwork ourselves and get enough sleep to maintain a high level of productivity. Next time you’re wondering why you may not be working productively, the reason may be simple as you being one of 70% of people who doesn’t get enough sleep. Did you know? Leonardo da Vinci took multiple naps a day and slept less at night. The French Emperor Napoleon was not shy about taking naps. He indulged daily. Though Thomas Edison was embarrassed about his napping habit, he also practiced his ritual daily. Eleanor Roosevelt, the wife of President Franklin D. Roosevelt, used to boost her energy by napping before speaking engagements. Gene Autry, “the Singing Cowboy,” routinely took naps in his dressing room between performances. President John F. Kennedy ate his lunch in bed and then settled in for a nap—every day! Oil industrialist and philanthropist John D. Rockefeller napped every afternoon in his office. Winston Churchill’s afternoon nap was a non-negotiable. He believed it helped him get twice as much done each day. President Lyndon B. Johnson took a nap every afternoon at 3:30 p.m. in order to break his day up into “two shifts.” Though criticized for it, President Ronald Reagan famously took naps as well. Source: 5 Reasons Why You Should Take a Nap Every Day — Michael Hyatt On a personal note, since I started getting at least 7 to 8 hours of sleep a day, I’ve noticed a change: I became a lot more productive and got a lot more work done than when I worked 16 hours a day. Who knew sleeping was such a great tool for marketers? 2. Don’t say “yes” too often According to the Pareto Principle, 20% of the effort produces 80% of the results; however, 20% of the results consumes 80% of the effort. Instead of working harder, we should focus primarily on those efforts that produce 80% of the results and forgo the rest. We will have more time to focus on the most important tasks. We should stop saying “yes” to tasks that bring low or almost no result. “The difference between successful people and very successful people is that very successful people say “no” to almost everything.” — Warren Buffet. This begs a question: what should you say “yes” and what should you say “no” to? If you can’t figure if something is going to be worth your time, consider running a simple split test. Track everything you do and optimize if it is possible. Most of us say yes more often than we should because it is so much easier than saying no. Nobody wants to be the bad guy. In a 2012 study published in the Journal of Consumer Research, researchers split 120 students in 2 groups. One group was trained to use “I can’t”, while the other was trained to use “I don’t”. The results were interesting: The students who told themselves “I can’t eat X” chose to eat the chocolate candy bar 61% of the time. Meanwhile, the students who told themselves “I don’t eat X” chose to eat the chocolate candy bars only 36% of the time. This simple change in terminology significantly improved the odds that each person would make a more healthy food choice. Next time you need to avoid saying yes, say “I don’t”. Another great trick to avoid activities that don’t add enough value into your life is the 20-second rule: give yourself 20 seconds longer for activities you shouldn’t be doing. Lower the activation energy for habits you want to adopt and raise it for habits you want to avoid. The more we can lower or even eliminate the activation energy for our desired actions, the more we enhance our ability to jump-start positive change. Source: The Happiness Advantage: The Seven Principles of Positive Psychology That Fuel Success and Performance at Work 3. Stop doing everything yourself and start letting people help you At some point in my career, I was managing a very large community and couldn’t handle it. I tried to do everything myself. I burnt out, but the community ended up taking over and managing itself. Surprisingly, members did a better job than I have ever done. I learned the power of community and why brands need user-generated content. Consumers understand what they want and how they want it better than any marketer. Did you know that, according to Octoly, user-generated videos are viewed 10 times more than brand-generated videos on YouTube? When seeking information about a particular brand,over half (51%) of Americans trust user-generated content more than the content on the brand website (16%) or media coverage on the brand (14%). It’s important for marketers to open up and seek help from the brand’s community. Source: Earned Media Rankings on YouTube — Octoly Being a great content marketer is not about creating the best content, but building a great community that will generate high-quality content for you. It’s important for us to realize we can seek help when needed. We cannot do everything ourselves. It is better for you to let someone who can do a better job taking over some of your tasks. It will give you more time to focus on your most important tasks. Instead of wasting your time trying to figure something out yourself, let the experts help you. A lot of time, even if your friends can’t help you, having them around can help you become more productive. Just having friends nearby can push you toward productivity. “There’s a concept in ADHD treatment called the ‘body double,’ ” says David Nowell, Ph.D., a clinical neuropsychologist from Worcester, Massachusetts. “Distractable people get more done when there is someone else there, even if he isn’t coaching or assisting them.” If you’re facing a task that is dull or difficult, such as cleaning out your closets or pulling together your receipts for tax time, get a friend to be your body double. Source: Friendfluence: The Surprising Ways Friends Make Us Who We Are 4. Stop being a perfectionist “We found that perfectionism trips up professors on the way to research productivity. The more perfectionistic the professor, the less productive they are,” Dr. Simon Sherry, a Dalhousie University Psychology Professor who conducted a study on perfectionism and productivity, tells University Affairs magazine. Dr. Sherry found a robust correlation between increased perfectionism and decreased productivity. Here are some problems associated with being a perfectionist: Marketers often wait for the perfect moment. In doing so, they end up missing it. The perfect moment is NOW. 5. Stop doing repetitive tasks and start automating it. According to a research study conducted by Tethys Solutions, A team of 5 people who spent 3%, 20%, 25%, 30% and 70% of their time on repetitive tasks respectively reduced this time to 3%, 10%, 15%, 15% and 10% after 2 months of enhancing their productivity. Source: Using Automation Software To Increase Business Productivity & Competitiveness -Tethys Solutions A week ago, I spent 15 minutes writing a basic Python program. The idea was to generate content from the data, which I pulled from Twitter API using a Ruby bot, and use Hootsuite to bulk schedule them. While it used to take me an entire day to accomplish, it now takes me less than 5 minutes. Nowadays, whenever I do something repetitively (more than 5 times), I would ask myself if I can find a program to do it for me. You don’t have to be a coder to able to automate your repetitive tasks. It’s nice to have the skills or the resources, but it’s not a requirement. If you cannot build it, buy it. People often forget that time is money. People usually do things manually because it’s easy and requires almost no research. It is manageable to moderate 30 images on Instagram for your user-generated campaign. But if you have to manage 30 000 photos and videos from 5 different platforms, you need a good digital asset management software. At Filemobile, we help people to solve that problem generate even more user-generated content. Just like managing rich media, you can easily purchase a software to solve almost all of your problem on the internet. If you still can’t find a solution, you can hire an expert to help you. Keep in mind that you need to spend money to make money and that time is your most valuable commodity. Tips for marketers: check out GitHub or Google app script library. Often times, you’ll find free ready-to-use open source code that requires very little programming knowledge. 6. Stop guessing and start backing up your decisions with data If you can optimize websites for search engines, you can optimize your lives to grow and reach your maximum potential. There are so many research studies out there that can provide answers in a range of areas. For instance, did you know that most people are more easily distracted from noon to 4PM? This random statistic comes from recent research led by Robert Matchock, an associate professor of psychology at Pennsylvania State University. Even if you can’t find the data you need, it doesn’t take a lot of time to run a split test. For instance, last week we did a few tests to figure out the best way to optimize images for Twitter in-stream preview. Keep asking yourself how you’re going to measure and optimize everything you do. 7. Stop working, and have do-nothing time Most people don’t realize that we’re essentially locking ourselves in a box when we are too focused on something. It’s important to walk away from our work once in a while and have some alone time. Alone time is good for the brain and spirit, according to The power of lonely , an article in The Boston Globe. One ongoing Harvard study indicates that people form more lasting and accurate memories if they believe they’re experiencing something alone. Another indicates that a certain amount of solitude can make a person more capable of empathy towards others. And while no one would dispute that too much isolation early in life can be unhealthy, a certain amount of solitude has been shown to help teenagers improve their moods and earn good grades in school. Source: The power of lonely It‘s important for us to take time for reflection. We often find the solutions when we’re not searching for them. We don’t become more productive overnight. Like everything in life, it requires efforts. Change doesn’t happen if you just sit there and wait for it. It’s important for all of us to learn more about our body and find ways to optimize our energy for a more successful and happy life. This post was originally published on the Filemobile Blog Disclosure: Filemobile (acquired by NewZulu) is a former client of my agency, ThinkRenegade. P.S. Thanks for reading this far! If you found value in this, I’d really appreciate it if you recommend this post (by clicking the ❤ button) so other people can see it! If you enjoyed my article, don’t forget to join my mailing list to receive free business and life hacks. You might also like Here Is Why Your Life Still Sucks I Love a Girl Who Swears, Backed by Science 1 Simple Trick to Deal with Pain That Nobody Tells You You Will Always Suck at What You Do, Until You Do This How A Smile Changed My Life Don’t Date A Man Who Reads Why I Stopped Helping People And You Should Too - ", "author": "CamMi Pham", "sentences": [{"2296": "7 Things You Need to Stop Doing to Be More Productive, Backed by Science"}, {"9b47": "BY CAMMI PHAM — First appeared on my personal blog"}, {"coverCaption": "When I was 17 years old, I used to work and study for about 20 hours a day. I went to school, did my homework during breaks and managed a not-for-profit organization at night. At that time, working hard landed me countless national campaigns, opportunities to work with A-list organizations and a successful career. As I got older, I started thinking differently. I realized that working harder is not always the right path to success. Sometimes, working less can actually produce better results."}, {"26e0": "Consider a small business owner, who works non-stop. However, working hard won’t help him compete with his multi-million competitors. Time is a limited commodity. An entrepreneur can work 24 hours a day and 7 days a week (the most amount of time anyone can work, really). His or her competitor can always spend more money, build a bigger team and spend a lot more time on the same project. Then why have small startups accomplished things that larger corporations couldn’t? Facebook bought Instagram, a 13-employee company for a billion dollars. Snapchat, a young startup with 30 employees is turning down offers from tech giants Facebook and Google. Part of their successes were based on luck — the rest is based on efficiency."}, {"06f5": "The key to success is not hard working but smart working."}, {"971c": "There’s a notable distinction between being busy and being productive. Being busy doesn’t necessarily mean you’re being productive. Being productive is less about time management and more on managing your energy. It is the business of life. We need to learn how to spend the least amount of energy to get the most benefits. I am so lucky to work with an amazing team here at Filemobile. Everyone always challenges me and helps me sort my priorities to become more productive. I learned to reduce my work week from 80 hours to 40 hours, and get a lot more work done in the process. In other words, less is more."}, {"3268": "Here are 7 I things I stopped doing to become more productive."}, {"1b8b": "1. Stop working overtime and increase your productivity"}, {"c358": "Have you ever wondered where the 40-hour work week came from? In 1926, Henry Ford, American industrialist and founder of Ford Motor Company, conducted experiments with interesting results: when you decrease your daily working hours from 10 to 8, and shorten the work week from 6 days to 5, your productivity increases."}, {"8f5c": "Source: Calculating Loss of Productivity Due to Overtime Using Published Charts — Fact or Fiction"}, {"f635": "The more you work, the less effective and productive you are going to become over both short and long term. “Scheduled Overtime Effect on Construction Projects”, a report issued by The Business Roundtable in 1980 states."}, {"250d": "“Where a work schedule of 60 or more hours per week is continued longer than about two months, the cumulative effect of decreased productivity will cause a delay in the completion date beyond that which could have been realized with the same crew size on a 40-hour week.”"}, {"5007": "Source: Calculating Loss of Productivity Due to Overtime Using Published Charts — Fact or Fiction"}, {"33f9": "In an article for AlterNet, editor Sara Robinson referenced research conducted by the US military that revealed that “losing one hour of sleep per night for a week will cause a level of cognitive degradation equivalent to a .10 blood alcohol level.” You can get fired for coming to work drunk, but it is deemed acceptable to pull an all-nighter."}, {"96b7": "Irrespective of how well you were able to get on with your day after that most recent night without sleep, it is unlikely that you felt especially upbeat and joyous about the world. Your more-negative-than-usual perspective will have resulted from a generalized low mood, which is a normal consequence of being overtired. More important than just the mood, this mind-set is often accompanied by decreases in willingness to think and act proactively, control impulses, feel positive about yourself, empathize with others, and generally use emotional intelligence."}, {"015d": "Source: The Secret World of Sleep: The Surprising Science of the Mind at Rest"}, {"9503": "It’s important for us not to overwork ourselves and get enough sleep to maintain a high level of productivity. Next time you’re wondering why you may not be working productively, the reason may be simple as you being one of 70% of people who doesn’t get enough sleep."}, {"590b": "Did you know?"}, {"f3b7": "Leonardo da Vinci took multiple naps a day and slept less at night."}, {"209d": "The French Emperor Napoleon was not shy about taking naps. He indulged daily."}, {"8c34": "Though Thomas Edison was embarrassed about his napping habit, he also practiced his ritual daily."}, {"1167": "Eleanor Roosevelt, the wife of President Franklin D. Roosevelt, used to boost her energy by napping before speaking engagements."}, {"8773": "Gene Autry, “the Singing Cowboy,” routinely took naps in his dressing room between performances."}, {"24eb": "President John F. Kennedy ate his lunch in bed and then settled in for a nap—every day!"}, {"3735": "Oil industrialist and philanthropist John D. Rockefeller napped every afternoon in his office."}, {"050e": "Winston Churchill’s afternoon nap was a non-negotiable. He believed it helped him get twice as much done each day."}, {"4ba8": "President Lyndon B. Johnson took a nap every afternoon at 3:30 p.m. in order to break his day up into “two shifts.”"}, {"2391": "Though criticized for it, President Ronald Reagan famously took naps as well."}, {"e635": "Source: 5 Reasons Why You Should Take a Nap Every Day — Michael Hyatt"}, {"6820": "On a personal note, since I started getting at least 7 to 8 hours of sleep a day, I’ve noticed a change: I became a lot more productive and got a lot more work done than when I worked 16 hours a day. Who knew sleeping was such a great tool for marketers?"}, {"99fd": "2. Don’t say “yes” too often"}, {"a0e5": "According to the Pareto Principle, 20% of the effort produces 80% of the results; however, 20% of the results consumes 80% of the effort. Instead of working harder, we should focus primarily on those efforts that produce 80% of the results and forgo the rest. We will have more time to focus on the most important tasks. We should stop saying “yes” to tasks that bring low or almost no result."}, {"a4b4": "“The difference between successful people and very successful people is that very successful people say “no” to almost everything.” — Warren Buffet."}, {"84fc": "This begs a question: what should you say “yes” and what should you say “no” to? If you can’t figure if something is going to be worth your time, consider running a simple split test. Track everything you do and optimize if it is possible."}, {"c91a": "Most of us say yes more often than we should because it is so much easier than saying no. Nobody wants to be the bad guy."}, {"9fa2": "In a 2012 study published in the Journal of Consumer Research, researchers split 120 students in 2 groups. One group was trained to use “I can’t”, while the other was trained to use “I don’t”. The results were interesting:"}, {"a274": "The students who told themselves “I can’t eat X” chose to eat the chocolate candy bar 61% of the time. Meanwhile, the students who told themselves “I don’t eat X” chose to eat the chocolate candy bars only 36% of the time. This simple change in terminology significantly improved the odds that each person would make a more healthy food choice."}, {"3a01": "Next time you need to avoid saying yes, say “I don’t”."}, {"81a3": "Another great trick to avoid activities that don’t add enough value into your life is the 20-second rule: give yourself 20 seconds longer for activities you shouldn’t be doing."}, {"63ef": "Lower the activation energy for habits you want to adopt and raise it for habits you want to avoid. The more we can lower or even eliminate the activation energy for our desired actions, the more we enhance our ability to jump-start positive change."}, {"4ab5": "Source: The Happiness Advantage: The Seven Principles of Positive Psychology That Fuel Success and Performance at Work"}, {"bd24": "3. Stop doing everything yourself and start letting people help you"}, {"c3b6": "At some point in my career, I was managing a very large community and couldn’t handle it. I tried to do everything myself. I burnt out, but the community ended up taking over and managing itself. Surprisingly, members did a better job than I have ever done. I learned the power of community and why brands need user-generated content."}, {"d6b1": "Consumers understand what they want and how they want it better than any marketer. Did you know that, according to Octoly, user-generated videos are viewed 10 times more than brand-generated videos on YouTube? When seeking information about a particular brand,over half (51%) of Americans trust user-generated content more than the content on the brand website (16%) or media coverage on the brand (14%). It’s important for marketers to open up and seek help from the brand’s community."}, {"4000": "Source: Earned Media Rankings on YouTube — Octoly"}, {"3afc": "Being a great content marketer is not about creating the best content, but building a great community that will generate high-quality content for you."}, {"4f54": "It’s important for us to realize we can seek help when needed. We cannot do everything ourselves. It is better for you to let someone who can do a better job taking over some of your tasks. It will give you more time to focus on your most important tasks. Instead of wasting your time trying to figure something out yourself, let the experts help you."}, {"6b46": "A lot of time, even if your friends can’t help you, having them around can help you become more productive."}, {"25a4": "Just having friends nearby can push you toward productivity. “There’s a concept in ADHD treatment called the ‘body double,’ ” says David Nowell, Ph.D., a clinical neuropsychologist from Worcester, Massachusetts. “Distractable people get more done when there is someone else there, even if he isn’t coaching or assisting them.” If you’re facing a task that is dull or difficult, such as cleaning out your closets or pulling together your receipts for tax time, get a friend to be your body double."}, {"dd0d": "Source: Friendfluence: The Surprising Ways Friends Make Us Who We Are"}, {"1a2d": "4. Stop being a perfectionist"}, {"82e3": "“We found that perfectionism trips up professors on the way to research productivity. The more perfectionistic the professor, the less productive they are,” Dr. Simon Sherry, a Dalhousie University Psychology Professor who conducted a study on perfectionism and productivity, tells University Affairs magazine. Dr. Sherry found a robust correlation between increased perfectionism and decreased productivity."}, {"944f": "Here are some problems associated with being a perfectionist:"}, {"c671": "Marketers often wait for the perfect moment. In doing so, they end up missing it."}, {"12f1": "The perfect moment is NOW."}, {"f445": "5. Stop doing repetitive tasks and start automating it."}, {"b66c": "According to a research study conducted by Tethys Solutions, A team of 5 people who spent 3%, 20%, 25%, 30% and 70% of their time on repetitive tasks respectively reduced this time to 3%, 10%, 15%, 15% and 10% after 2 months of enhancing their productivity."}, {"1d85": "Source: Using Automation Software To Increase Business Productivity & Competitiveness -Tethys Solutions"}, {"e347": "A week ago, I spent 15 minutes writing a basic Python program. The idea was to generate content from the data, which I pulled from Twitter API using a Ruby bot, and use Hootsuite to bulk schedule them. While it used to take me an entire day to accomplish, it now takes me less than 5 minutes. Nowadays, whenever I do something repetitively (more than 5 times), I would ask myself if I can find a program to do it for me."}, {"1e82": "You don’t have to be a coder to able to automate your repetitive tasks. It’s nice to have the skills or the resources, but it’s not a requirement. If you cannot build it, buy it."}, {"dca1": "People often forget that time is money. People usually do things manually because it’s easy and requires almost no research. It is manageable to moderate 30 images on Instagram for your user-generated campaign. But if you have to manage 30 000 photos and videos from 5 different platforms, you need a good digital asset management software. At Filemobile, we help people to solve that problem generate even more user-generated content. Just like managing rich media, you can easily purchase a software to solve almost all of your problem on the internet."}, {"4882": "If you still can’t find a solution, you can hire an expert to help you. Keep in mind that you need to spend money to make money and that time is your most valuable commodity."}, {"c4c6": "Tips for marketers: check out GitHub or Google app script library. Often times, you’ll find free ready-to-use open source code that requires very little programming knowledge."}, {"a5fa": "6. Stop guessing and start backing up your decisions with data"}, {"611b": "If you can optimize websites for search engines, you can optimize your lives to grow and reach your maximum potential."}, {"7682": "There are so many research studies out there that can provide answers in a range of areas. For instance, did you know that most people are more easily distracted from noon to 4PM? This random statistic comes from recent research led by Robert Matchock, an associate professor of psychology at Pennsylvania State University. Even if you can’t find the data you need, it doesn’t take a lot of time to run a split test."}, {"1056": "For instance, last week we did a few tests to figure out the best way to optimize images for Twitter in-stream preview."}, {"e43f": "Keep asking yourself how you’re going to measure and optimize everything you do."}, {"40cd": "7. Stop working, and have do-nothing time"}, {"a851": "Most people don’t realize that we’re essentially locking ourselves in a box when we are too focused on something. It’s important to walk away from our work once in a while and have some alone time. Alone time is good for the brain and spirit, according to The power of lonely , an article in The Boston Globe."}, {"4fc3": "One ongoing Harvard study indicates that people form more lasting and accurate memories if they believe they’re experiencing something alone. Another indicates that a certain amount of solitude can make a person more capable of empathy towards others. And while no one would dispute that too much isolation early in life can be unhealthy, a certain amount of solitude has been shown to help teenagers improve their moods and earn good grades in school."}, {"3570": "Source: The power of lonely"}, {"9073": "It‘s important for us to take time for reflection. We often find the solutions when we’re not searching for them."}, {"bcec": "We don’t become more productive overnight. Like everything in life, it requires efforts. Change doesn’t happen if you just sit there and wait for it. It’s important for all of us to learn more about our body and find ways to optimize our energy for a more successful and happy life."}, {"671f": "This post was originally published on the Filemobile Blog"}, {"b99a": "Disclosure: Filemobile (acquired by NewZulu) is a former client of my agency, ThinkRenegade."}, {"2111": "P.S. Thanks for reading this far! If you found value in this, I’d really appreciate it if you recommend this post (by clicking the ❤ button) so other people can see it!"}, {"27a4": "If you enjoyed my article, don’t forget to join my mailing list to receive free business and life hacks."}, {"08a1": "You might also like"}, {"4ff9": "Here Is Why Your Life Still Sucks"}, {"3180": "I Love a Girl Who Swears, Backed by Science"}, {"d465": "1 Simple Trick to Deal with Pain That Nobody Tells You"}, {"bfa7": "You Will Always Suck at What You Do, Until You Do This"}, {"07c4": "How A Smile Changed My Life"}, {"3058": "Don’t Date A Man Who Reads"}, {"1343": "Why I Stopped Helping People And You Should Too"}, {"16b4": "-"}], "timestamp": "Apr 29, 2014", "parent": "", "child": "2442_1\t2442_2\t2442_3\t2442_4\t2442_5\t2442_6\t2442_7\t2442_8\t2442_9\t2442_10\t2442_11\t2442_12\t2442_13\t2442_14\t2442_15\t2442_16\t2442_17\t2442_18\t2442_19\t2442_20\t2442_21\t2442_22\t2442_23\t2442_24\t2442_252442_1\t2442_2\t2442_3\t2442_4\t2442_5\t2442_6\t2442_7\t2442_8\t2442_9\t2442_10\t2442_11\t2442_12\t2442_13\t2442_14\t2442_15\t2442_16\t2442_17\t2442_18\t2442_19\t2442_20\t2442_21\t2442_22\t2442_23\t2442_24\t2442_252442_1\t2442_2\t2442_3\t2442_4\t2442_5\t2442_6\t2442_7\t2442_8\t2442_9\t2442_10\t2442_11\t2442_12\t2442_13\t2442_14\t2442_15\t2442_16\t2442_17\t2442_18\t2442_19\t2442_20\t2442_21\t2442_22\t2442_23\t2442_24\t2442_252442_1\t2442_2\t2442_3\t2442_4\t2442_5\t2442_6\t2442_7\t2442_8\t2442_9\t2442_10\t2442_11\t2442_12\t2442_13\t2442_14\t2442_15\t2442_16\t2442_17\t2442_18\t2442_19\t2442_20\t2442_21\t2442_22\t2442_23\t2442_24\t2442_252442_1\t2442_2\t2442_3\t2442_4\t2442_5\t2442_6\t2442_7\t2442_8\t2442_9\t2442_10\t2442_11\t2442_12\t2442_13\t2442_14\t2442_15\t2442_16\t2442_17\t2442_18\t2442_19\t2442_20\t2442_21\t2442_22\t2442_23\t2442_24\t2442_252442_1\t2442_2\t2442_3\t2442_4\t2442_5\t2442_6\t2442_7\t2442_8\t2442_9\t2442_10\t2442_11\t2442_12\t2442_13\t2442_14\t2442_15\t2442_16\t2442_17\t2442_18\t2442_19\t2442_20\t2442_21\t2442_22\t2442_23\t2442_24\t2442_252442_1\t2442_2\t2442_3\t2442_4\t2442_5\t2442_6\t2442_7\t2442_8\t2442_9\t2442_10\t2442_11\t2442_12\t2442_13\t2442_14\t2442_15\t2442_16\t2442_17\t2442_18\t2442_19\t2442_20\t2442_21\t2442_22\t2442_23\t2442_24\t2442_25"}