{"title": "11 Things I Wish I Knew When I Started My Business", "name": "2446", "content": "11 Things I Wish I Knew When I Started My Business Working. Or maybe ordering wine off the internet. “A lot of people like to fool you and say that you’re not smart if you never went to college, but common sense rules over everything.That’s what I learned from selling crack.”-Snoop Dogg My name is Stephanie St.Claire, and I am an unfunded entrepreneur. I’ve been in business for 7 years, after engaging in my own personal and tenuous renaissance (uh…divorce) and rediscovering my Divine Core Purpose. In other words, I grew a pair of ladyballs, launched a business, and started figuring out how to coalesce my efforts into profit. But there was a LOT to learn, and some of those things weren’t covered in Who Moved My Cheese. Throw these 4 rockstars into a blender, and you’ll have a composite sketch of me in the first three months of my business: Glitter was literally shooting out of my eye sockets as I quit my PR firm job and started my own business. Full of optimism, living in New York City, and surrounded by a tribe of friends who were also launching businesses, art, and gigs, I felt it was the perfect time to make the bold move to entrepreneurship. I was now officially Living My Dream and Working For Myself which meant that I was In Charge of My Financial Destiny and Captain of My Promising Future. Luckily my initial hyper-optimism buoyed me whilst, oscillating between euphoria and despair, I was slowly but systematically forced off The Magic School Bus and onto the S.S. Battleship Long Haul. I was a quick and eager learner, but despite the hours of webinar watching, countless Friday nights pumping out site copy, and teaching myself everything I could about HTML, there were just some things I didn’t get. I had to fall on my ass to procure the “masters degree in life survival” every entrepreneur has to earn on their “journey.” Yes, those are bitterly gesticulated air quotes. Here are 11 things I wish I knew when I started my business. I hope they will save you some time, but at the very least, some anguish because — experience is a good teacher here — the sodium from your tears acts as a corrosive melting agent on all brands of premium ice cream, but otherwise, makes a superb saline for your dirty martini. Cry over a cup, oh fathomless bird of preneurial gumption! ONE. Running the business is your first priority. Your success (and financial stability) will come from expertly running your business — not writing copy, rebranding your client’s website, teaching yoga, podcasting, or making jewelry. In other words, you will spend 15% of the time doing what you love (your gift..in my case coaching and writing) and 85% of the time marketing, administrating, selling, strategizing your business, and answering a shitload of email. Survival will totally hinge on how quickly you adopt this role of Business Owner first, creator of pretty things, second. This sucked for me because I wanted nothing to do with running a business. I just wanted to be a writer and a life coach who wrote and coached all day. I didn’t get it. TWO. Ready to meet your soul mate? It’s you. Entrepreneurship is the most life changing relationship (like marriage or parenthood) that a person can have. You will be confronted overandoverandover with your fears, your insecurities, your crappy excuses, your limitations, your justifications, your shitty integrity, and your inefficient time management. The standard you held yourself to in the work-a-day world was good enough then, but it won’t be good enough to run your own business. And you will learn to accept yourself through all this because in order to get up every day and create a profit, you have to. Somehow through that process of acceptance, while you’re busy putting yourself out there in spite of your flaws, your weaknesses will transform and you will fall in love with yourself. Not in the over-hyped “SELF LOVE 2012” way, but in a quiet way that sneaks up on you after witnessing a thousand splinter-sized moments of transcending the baser aspects of yourself. THREE. Your trajectory for success will take as long as everyone else’s, even though you’re special and brilliant. I heard the “two-year rule” when I started my biz, but I was confident I could do it in 6 months. I believed with every fiber of my glittery, go-gettin’ heart that my work ethic (15-hour days/7 days a week), along with my talent, skills, and personal magic, I could rip a path to accelerated success because also, this was A Leap of Faith and I was Living in My Divine Authenticity and that was worth some express lane juju points from Heaven. Jesus had other plans. See #4. FOUR. Running out of money is a common part of the journey. You won’t expect it, because you prepared for the long haul. You secured a business loan, or got some investors, or sold your house (cough, cough), or have one year’s worth of savings and you have planned accordingly. But then all of the sudden, midst the puffy clouds and blue skies, your little twin engine Entreprenairplane will sputter, the needle on the gas gauge unexpectedly plummeting to zero, and you will have only one choice… land your plane on the wild, abandoned air strip called Bank Balance: Fourteen Dollars. And this will be the LAST PLACE you ever thought you’d crash land, because didn’t you pass this test on No More Sephora Island? Well. The good news is this is a rite of passage that will launch you into the League of Business Badassery in which, once you are out of the money hellhole, you will be unstoppable. You’ve been to the baddest prison there is, you looked down the barrel of your worst fear, and you stood your ground. You didn’t quit. You got up the next day, and you wrote your next post, created your next offering, and answered the email with zero dollars in your bank account. There is nothing more beautiful than running out of money and realizing that you are doing your work because you’ve got the guts to stand above proof, and push through your worst fears when there is no evidence of security. You really, truly love what you do, and you’d do it for free if you had to. Irony is a sassy bitch, isn’t she? FIVE. Build a hybrid stream of income. Take a second job if it will give you peace of mind. Please don’t be a jackass like I was and make it mean that you’re failing at your business. I was so resistant to “dividing my focus” or taking any action which I interpreted as undermining my commitment to being a successful writer and coach. Do you see the hellish mousetrap that was? I really thought that by making a Plan B I was telling the Universe I wasn’t 100% serious about my success. Don’t even get me started with my crazy aversion to Plan B’s. I created a worse problem by allowing financial stress to gut me of my sanity. If having a steady stream of part-time income would be in service to your peace of mind, do it. I finally came to terms with the fact that I was being obnoxiously naïve about how money, peace, survival, and timing all work together and I got a second job. By doing this, I supernaturalized my own path to freedom and self-sustainability. And since I wasn’t freaking out about money anymore, I liberated more creative real estate in my brain to apply toward my business. SIX. Read Steven Pressfield’s Do the Work. The biggest challenge you will deal with in running a business is your own resistance. Period, end of story. Before you study anything about marketing, social media, money, or time management, read this book. You’ll be treated to gems like this: Our enemy is not lack of preparation; it’s not the difficulty of the project, or the state of the marketplace, or the emptiness of our bank account. The enemy is resistance. The enemy is our chattering brain, which, if we give it so much as a nanosecond, will start producing excuses, alibis, transparent self-justifications, and a million reasons why he can’t/shouldn’t/won’t do what we know we need to do. A professional distances herself from her instrument. The pro stands at one remove from her instrument — meaning her person, her body, her voice, her talent; the physical, mental, emotional, and psychological being she uses in her work. She does not identify with this instrument. It is simply what God gave her, what she has to work with. She assesses it coolly, impersonally, objectively. Does Madonna walk around the house in cone bras and come-f*k-me bustiers? She’s too busy planning D-Day. Madonna does not identify with “Madonna.” Madonna employs “Madonna.” SEVEN. Spend less time researching, more time doing. Researching/studying/ reading other people’s blogs is a form of resistance. In order to get clarity, you must act. Clarity does not come by learning more, it comes by jumping in with your instincts and putting yourself out there, even if you don’t know exactly what you’re doing. Block out the distractions (turn off the phone, social media, and email notifications) and take inspired action that feels tangible and measurable. Set a timer for 25 minutes and go to town on a task. Do not look up. Do not go to the bathroom. Do not cruise the fridge for cheese sticks. Get something done, despite the fact that at times you will feel like you are pissing into the wind. Piss into the wind 4 times a day, and you’ll make a difference in your bottom line. EIGHT. Only say yes to clients/collaborative projects that are HELL YESES. Scrutinize any joint project carefully and qualify the person you are doing the project with (even if they are your friend and have more page likes than you). Get everything in writing before you embark on the project, with a clear division of labor and deadline dates. You will most likely be splitting the profits, so have two numbers in your head: The $ number you NEED to make in order to pay for your time, and the $ number would LIKE to make. Set the first financial deadline early to make your NEED number so that you both have the freedom to walk away if the project isn’t going to be profitable. Have a transition strategy in mind so in case that happens and one of you wants to continue on with the project, there is a way to pass the baton gracefully. Summed up: COMMUNICATE ABOUT EVERYTHING, even though you’re friends, even though you love each other, even though you trust each other, even though you’ve worked together at XYZ Company, because projects have a way of going sideways and making everyone a little custodial and overreactive. NINE. You must devote time to becoming a brilliant marketer. MUST. I know you just want to spend all your days making hipster sarsaparilla-scented mustache wax, or needle pointing edgy throw pillows for Etsy, or writing your YA zombie novel, or life coaching entrepreneurs to stratospheric success, but if you don’t spend time marketing you will not make money. This was my biggest weakness when I started because I thought marketing = slimy sales letters with big arrows and opt-in boxes and I couldn’t! I wouldn’t! So I put my head in magical fairyland sand, stubbornly insisting that my customers would be tractor-beamed into my budding practice by the pulsating, heavenly light that radiated from my vision boards and 4 blog posts. And then I ate canned food and spaghetti for a long, long time. But this rescued me — knowing what marketing personality I embody. There are three main types: The Guru (Brendan Buchard, Danielle LaPorte, Gary Vaynerchuck, Marie Forleo, Tony Robbins), whose marketing boldly states, “Listen to me. I have the answers.” Then there’s the Wisdom Advisor (Brene Brown, Chris Guillebeau, Marianne Williamson, Dave Ramsey), whose marketing feels like, “This is what I’ve found to work best. Let’s brainstorm together, and I’ll help you find out what’ll work for you.” And finally, The Connector (Oprah, Jonathan Fields, Mark Zuckerberg) who connect people with other people/resources. Once you have figured out your marketing personality, selling to your customers will be a thousand times easier because you will be working within your natural vibe. Learn what way you like to market and stick to that and do it consistently and often. Even if you hire a pro, you will be doing some marketing yourself. Keeping your website fresh and current is essential in your marketing, so learn how to work WordPress and learn some HTML code. You will be in the guts of your website A LOT. TEN. Email will be your new best frenemy. Your inbox will explode. You care about everyone, but you can’t help everyone. Read: Not everyone is your customer. Your inbox will be a jumble of people who want to say thank you, people who want free stuff, and people who want your services. Your job is to quickly discern who’s who and respond in the most appropriate way. Shorten the email back-and-forth as quickly as possible with people that are your potential clients. If your business is a consultancy where you are selling your time, I recommend having two form letters on hand that you can customize to the occasion: one for your potential customer and the other for your not potential customer. Your Customer: Acknowledge their situation, request, or problem and invite them to a 20-minute call. Include your available dates, times, and a phone number you can be reached. Not Your Customer: Acknowledge their situation, request, problem and direct them to other resources, practitioners, blogs, or articles that would be a splendid fit for them. I love personally connecting with my clients. In this area of business, I am 1997 all the way, and I pick up the phone and talk to them live. I set up all the calls on one day or schedule them after my regular client sessions. I have found this to save a colossal amount of time. In a 20 minute phone call, I accomplish the following: Do you know how long that would take back-and-forth by email?5 days to a month. Do not screw your own time economy. ELEVEN. Number eleven is a hodge-podge: Do not work your business 7 days a week. Cover your legal ass from day one. From time to time, forget everything you know about the “right way” to run a business and run it like a neighborhood lemonade stand. Do not price your offerings around your personal ability to pay for it — you are not your ideal customer. Work out perplexing issues in your business and it will resolve problems in other areas of your life. Connect with other entrepreneurs and set up a skype brainstorming session (with wine). Take a walk around the block every day at lunch. If you want to be smarter in business, read everything these two people write: Regina Anaejionu and Ash Ambirge. Are you a woman who is thinking about starting an online consulting business? I made something for you. There are 10,756 other beautiful people living to a wild rock-and-roll beat with a FREE subscription to The Weekly Note Card. Wanna join them? SIGN UP HERE. …Join me onFacebook.| Instagram. ", "author": "Stephanie St.Claire", "sentences": [{"1a63": "11 Things I Wish I Knew When I Started My Business"}, {"618c": "Working. Or maybe ordering wine off the internet."}, {"subtitle": "“A lot of people like to fool you and say that you’re not smart if you never went to college, but common sense rules over everything.That’s what I learned from selling crack.”-Snoop Dogg"}, {"d8a4": "My name is Stephanie St.Claire, and I am an unfunded entrepreneur. I’ve been in business for 7 years, after engaging in my own personal and tenuous renaissance (uh…divorce) and rediscovering my Divine Core Purpose. In other words, I grew a pair of ladyballs, launched a business, and started figuring out how to coalesce my efforts into profit."}, {"6b4c": "But there was a LOT to learn, and some of those things weren’t covered in Who Moved My Cheese."}, {"edb7": "Throw these 4 rockstars into a blender, and you’ll have a composite sketch of me in the first three months of my business:"}, {"ecb6": "Glitter was literally shooting out of my eye sockets as I quit my PR firm job and started my own business. Full of optimism, living in New York City, and surrounded by a tribe of friends who were also launching businesses, art, and gigs, I felt it was the perfect time to make the bold move to entrepreneurship. I was now officially Living My Dream and Working For Myself which meant that I was In Charge of My Financial Destiny and Captain of My Promising Future."}, {"b272": "Luckily my initial hyper-optimism buoyed me whilst, oscillating between euphoria and despair, I was slowly but systematically forced off The Magic School Bus and onto the S.S. Battleship Long Haul."}, {"2e0e": "I was a quick and eager learner, but despite the hours of webinar watching, countless Friday nights pumping out site copy, and teaching myself everything I could about HTML, there were just some things I didn’t get. I had to fall on my ass to procure the “masters degree in life survival” every entrepreneur has to earn on their “journey.”"}, {"b0ed": "Yes, those are bitterly gesticulated air quotes."}, {"e693": "Here are 11 things I wish I knew when I started my business. I hope they will save you some time, but at the very least, some anguish because — experience is a good teacher here — the sodium from your tears acts as a corrosive melting agent on all brands of premium ice cream, but otherwise, makes a superb saline for your dirty martini. Cry over a cup, oh fathomless bird of preneurial gumption!"}, {"28f9": "ONE."}, {"4762": "Running the business is your first priority. Your success (and financial stability) will come from expertly running your business — not writing copy, rebranding your client’s website, teaching yoga, podcasting, or making jewelry. In other words, you will spend 15% of the time doing what you love (your gift..in my case coaching and writing) and 85% of the time marketing, administrating, selling, strategizing your business, and answering a shitload of email. Survival will totally hinge on how quickly you adopt this role of Business Owner first, creator of pretty things, second."}, {"b820": "This sucked for me because I wanted nothing to do with running a business. I just wanted to be a writer and a life coach who wrote and coached all day. I didn’t get it."}, {"d655": "TWO."}, {"461f": "Ready to meet your soul mate? It’s you. Entrepreneurship is the most life changing relationship (like marriage or parenthood) that a person can have. You will be confronted overandoverandover with your fears, your insecurities, your crappy excuses, your limitations, your justifications, your shitty integrity, and your inefficient time management. The standard you held yourself to in the work-a-day world was good enough then, but it won’t be good enough to run your own business. And you will learn to accept yourself through all this because in order to get up every day and create a profit, you have to. Somehow through that process of acceptance, while you’re busy putting yourself out there in spite of your flaws, your weaknesses will transform and you will fall in love with yourself. Not in the over-hyped “SELF LOVE 2012” way, but in a quiet way that sneaks up on you after witnessing a thousand splinter-sized moments of transcending the baser aspects of yourself."}, {"477d": "THREE."}, {"43c7": "Your trajectory for success will take as long as everyone else’s, even though you’re special and brilliant. I heard the “two-year rule” when I started my biz, but I was confident I could do it in 6 months. I believed with every fiber of my glittery, go-gettin’ heart that my work ethic (15-hour days/7 days a week), along with my talent, skills, and personal magic, I could rip a path to accelerated success because also, this was A Leap of Faith and I was Living in My Divine Authenticity and that was worth some express lane juju points from Heaven."}, {"c0cc": "Jesus had other plans."}, {"22c0": "See #4."}, {"94d7": "FOUR."}, {"9d1e": "Running out of money is a common part of the journey. You won’t expect it, because you prepared for the long haul. You secured a business loan, or got some investors, or sold your house (cough, cough), or have one year’s worth of savings and you have planned accordingly."}, {"0165": "But then all of the sudden, midst the puffy clouds and blue skies, your little twin engine Entreprenairplane will sputter, the needle on the gas gauge unexpectedly plummeting to zero, and you will have only one choice… land your plane on the wild, abandoned air strip called Bank Balance: Fourteen Dollars. And this will be the LAST PLACE you ever thought you’d crash land, because didn’t you pass this test on No More Sephora Island?"}, {"6c65": "Well."}, {"6a99": "The good news is this is a rite of passage that will launch you into the League of Business Badassery in which, once you are out of the money hellhole, you will be unstoppable. You’ve been to the baddest prison there is, you looked down the barrel of your worst fear, and you stood your ground. You didn’t quit. You got up the next day, and you wrote your next post, created your next offering, and answered the email with zero dollars in your bank account."}, {"febe": "There is nothing more beautiful than running out of money and realizing that you are doing your work because you’ve got the guts to stand above proof, and push through your worst fears when there is no evidence of security. You really, truly love what you do, and you’d do it for free if you had to."}, {"cb3f": "Irony is a sassy bitch, isn’t she?"}, {"bb88": "FIVE."}, {"6d33": "Build a hybrid stream of income. Take a second job if it will give you peace of mind. Please don’t be a jackass like I was and make it mean that you’re failing at your business. I was so resistant to “dividing my focus” or taking any action which I interpreted as undermining my commitment to being a successful writer and coach. Do you see the hellish mousetrap that was? I really thought that by making a Plan B I was telling the Universe I wasn’t 100% serious about my success. Don’t even get me started with my crazy aversion to Plan B’s. I created a worse problem by allowing financial stress to gut me of my sanity."}, {"973a": "If having a steady stream of part-time income would be in service to your peace of mind, do it."}, {"64d3": "I finally came to terms with the fact that I was being obnoxiously naïve about how money, peace, survival, and timing all work together and I got a second job. By doing this, I supernaturalized my own path to freedom and self-sustainability. And since I wasn’t freaking out about money anymore, I liberated more creative real estate in my brain to apply toward my business."}, {"ccfd": "SIX."}, {"9c04": "Read Steven Pressfield’s Do the Work. The biggest challenge you will deal with in running a business is your own resistance. Period, end of story. Before you study anything about marketing, social media, money, or time management, read this book. You’ll be treated to gems like this:"}, {"3926": "Our enemy is not lack of preparation; it’s not the difficulty of the project, or the state of the marketplace, or the emptiness of our bank account. The enemy is resistance. The enemy is our chattering brain, which, if we give it so much as a nanosecond, will start producing excuses, alibis, transparent self-justifications, and a million reasons why he can’t/shouldn’t/won’t do what we know we need to do."}, {"1154": "A professional distances herself from her instrument. The pro stands at one remove from her instrument — meaning her person, her body, her voice, her talent; the physical, mental, emotional, and psychological being she uses in her work. She does not identify with this instrument. It is simply what God gave her, what she has to work with. She assesses it coolly, impersonally, objectively."}, {"c913": "Does Madonna walk around the house in cone bras and come-f*k-me bustiers? She’s too busy planning D-Day. Madonna does not identify with “Madonna.” Madonna employs “Madonna.”"}, {"9659": "SEVEN."}, {"d1bc": "Spend less time researching, more time doing. Researching/studying/ reading other people’s blogs is a form of resistance. In order to get clarity, you must act. Clarity does not come by learning more, it comes by jumping in with your instincts and putting yourself out there, even if you don’t know exactly what you’re doing."}, {"ac57": "Block out the distractions (turn off the phone, social media, and email notifications) and take inspired action that feels tangible and measurable. Set a timer for 25 minutes and go to town on a task. Do not look up. Do not go to the bathroom. Do not cruise the fridge for cheese sticks. Get something done, despite the fact that at times you will feel like you are pissing into the wind. Piss into the wind 4 times a day, and you’ll make a difference in your bottom line."}, {"e25c": "EIGHT."}, {"0042": "Only say yes to clients/collaborative projects that are HELL YESES. Scrutinize any joint project carefully and qualify the person you are doing the project with (even if they are your friend and have more page likes than you). Get everything in writing before you embark on the project, with a clear division of labor and deadline dates. You will most likely be splitting the profits, so have two numbers in your head: The $ number you NEED to make in order to pay for your time, and the $ number would LIKE to make. Set the first financial deadline early to make your NEED number so that you both have the freedom to walk away if the project isn’t going to be profitable. Have a transition strategy in mind so in case that happens and one of you wants to continue on with the project, there is a way to pass the baton gracefully."}, {"d0ee": "Summed up: COMMUNICATE ABOUT EVERYTHING, even though you’re friends, even though you love each other, even though you trust each other, even though you’ve worked together at XYZ Company, because projects have a way of going sideways and making everyone a little custodial and overreactive."}, {"75c3": "NINE."}, {"daba": "You must devote time to becoming a brilliant marketer. MUST. I know you just want to spend all your days making hipster sarsaparilla-scented mustache wax, or needle pointing edgy throw pillows for Etsy, or writing your YA zombie novel, or life coaching entrepreneurs to stratospheric success, but if you don’t spend time marketing you will not make money."}, {"1f62": "This was my biggest weakness when I started because I thought marketing = slimy sales letters with big arrows and opt-in boxes and I couldn’t! I wouldn’t! So I put my head in magical fairyland sand, stubbornly insisting that my customers would be tractor-beamed into my budding practice by the pulsating, heavenly light that radiated from my vision boards and 4 blog posts."}, {"2122": "And then I ate canned food and spaghetti for a long, long time."}, {"2e82": "But this rescued me — knowing what marketing personality I embody. There are three main types: The Guru (Brendan Buchard, Danielle LaPorte, Gary Vaynerchuck, Marie Forleo, Tony Robbins), whose marketing boldly states, “Listen to me. I have the answers.” Then there’s the Wisdom Advisor (Brene Brown, Chris Guillebeau, Marianne Williamson, Dave Ramsey), whose marketing feels like, “This is what I’ve found to work best. Let’s brainstorm together, and I’ll help you find out what’ll work for you.” And finally, The Connector (Oprah, Jonathan Fields, Mark Zuckerberg) who connect people with other people/resources. Once you have figured out your marketing personality, selling to your customers will be a thousand times easier because you will be working within your natural vibe."}, {"e05a": "Learn what way you like to market and stick to that and do it consistently and often. Even if you hire a pro, you will be doing some marketing yourself. Keeping your website fresh and current is essential in your marketing, so learn how to work WordPress and learn some HTML code. You will be in the guts of your website A LOT."}, {"8c73": "TEN."}, {"3eb0": "Email will be your new best frenemy. Your inbox will explode. You care about everyone, but you can’t help everyone. Read: Not everyone is your customer. Your inbox will be a jumble of people who want to say thank you, people who want free stuff, and people who want your services. Your job is to quickly discern who’s who and respond in the most appropriate way."}, {"4c62": "Shorten the email back-and-forth as quickly as possible with people that are your potential clients. If your business is a consultancy where you are selling your time, I recommend having two form letters on hand that you can customize to the occasion: one for your potential customer and the other for your not potential customer."}, {"1e50": "Your Customer: Acknowledge their situation, request, or problem and invite them to a 20-minute call. Include your available dates, times, and a phone number you can be reached."}, {"8c14": "Not Your Customer: Acknowledge their situation, request, problem and direct them to other resources, practitioners, blogs, or articles that would be a splendid fit for them."}, {"bcf7": "I love personally connecting with my clients. In this area of business, I am 1997 all the way, and I pick up the phone and talk to them live. I set up all the calls on one day or schedule them after my regular client sessions. I have found this to save a colossal amount of time. In a 20 minute phone call, I accomplish the following:"}, {"e03a": "Do you know how long that would take back-and-forth by email?5 days to a month. Do not screw your own time economy."}, {"acff": "ELEVEN."}, {"e482": "Number eleven is a hodge-podge: Do not work your business 7 days a week. Cover your legal ass from day one. From time to time, forget everything you know about the “right way” to run a business and run it like a neighborhood lemonade stand. Do not price your offerings around your personal ability to pay for it — you are not your ideal customer. Work out perplexing issues in your business and it will resolve problems in other areas of your life. Connect with other entrepreneurs and set up a skype brainstorming session (with wine). Take a walk around the block every day at lunch. If you want to be smarter in business, read everything these two people write: Regina Anaejionu and Ash Ambirge."}, {"ce9d": "Are you a woman who is thinking about starting an online consulting business? I made something for you."}, {"fd97": "There are 10,756 other beautiful people living to a wild rock-and-roll beat with a FREE subscription to The Weekly Note Card. Wanna join them? SIGN UP HERE."}, {"ac9d": "…Join me onFacebook.| Instagram."}], "timestamp": "Oct 10, 2013", "parent": "", "child": "2446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_252446_1\t2446_2\t2446_3\t2446_4\t2446_5\t2446_6\t2446_7\t2446_8\t2446_9\t2446_10\t2446_11\t2446_12\t2446_13\t2446_14\t2446_15\t2446_16\t2446_17\t2446_18\t2446_19\t2446_20\t2446_21\t2446_22\t2446_23\t2446_24\t2446_25"}