{"title": "Men Won’t Take You Seriously If", "name": "2447", "content": "Men Won’t Take You Seriously If Fuck yal. Lately, all I have been seeing is men giving advice to women and writing articles directed at women. All of which keep taking the form of lectures to women about how we dress, how scantily clad we are allowed to be, how we should feel about ourselves, how to be women, what makes us worthy of male attention, who we have sex with, how many people we have sex with, how men feel about how many people we have had sex with and what it means for our chances of locking down one of these eligible clowns. Here’s the first thing everyone needs to understand before we proceed: Women are individuals, not male accessories. We do not exist solely to gain male approval or some man to call our own. Never-mind the fact that many women don’t even care about getting a man, but even for those of us who may want a man, it is not our life’s essence or main priority. We are multi-faceted (and even when we aren’t, the point is that we can be). That being said, it makes absolutely no sense that all advice for women seems to be strictly about what we should do to get a man, or about what men think about us and the moves we make, thus, our lives need to be dictated by them. Women have the right to do what we want simply because we want to. Moreover, why is advice about how to be a woman being written by men? How you gonna tell me how to be a woman or what it means to be a woman, Jacob? How, Sway? Like all individuals, women are complex and not one-dimensional. I don’t need to be a virgin or modest to be respected. I can be intelligent and I can still be a hoe. And by hoe, I mean a woman that has had sex with more than one man or has sex for a purpose other than safeguarding a man or procreating with a husband, since that seems to be how men use that label these days. So, I am going to address the different kind of male-written critiques of women I have been seeing everywhere. 1. “No no no no, I love women, I just want women to love themselves and I know they’re only dressing half-naked and taking risque pictures because they have low self-esteem.” Logic seems to fly out the window when it comes to recycling antiquated stereotypes about women and this is my favorite trope passed down from man to man and conservative-judgy-reserved-ass-women. Who thought this made sense?: I don’t like my body, therefore, I am going to show it to you? Listen people, let’s start with something easy: When someone is having a bad hair day, what do they do? Put on a hat. Why is that? Because they do not like their hair that day, so they cover it the fuck up. When you feel fat or bloated, what do you do? Wear bigger clothes than usual, cover up more, whatever. Not get ass-naked and buss it wide open on the gram. Why on God’s green earth would I be ass-naked if I had low self-esteem or didn’t like my body? Keep in mind, this foolishness is said by the EXACT same men that spin around and say things like “ I swipe left on girls on Tinder who only have pictures of their face because they’re usually fat girls hiding their bodies.” So Henry, you do know this low self-esteem tied to revealing clothes/photos thing makes no sense. Which is it, Paul? Are we naked because we hate our bodies and need your approval, or are we hiding our bodies because we hate our bodies and don’t want you to see it? These are two contradictory struggles and the only thing they seem to have in common is that in both scenarios, you seem confident that whatever decision a woman makes about her body is dictated by how a man will perceive it. But when Danny decides to live in the gym, walk around talking about “gym is life,” take shirtless selfies all day, and send unsolicited dick pictures to poor, unsuspecting women all day long, nobody accuses Danny of having low self-esteem and desperately trying to gain women’s approval. But if a woman wears fitted clothes, has any kind of cleavage, posts a sexy picture, all of a sudden all these self-proclaimed women-loving-Drake-stans come out of the woods trying to save her like “babygirl, you don’t have to do this.” Leave her alone. Stop assuming you have some deep understanding of a woman you don’t even know, merely by looking at her. You don’t. You don’t know her, you don’t know what you’re talking about, you don’t know anything. All you know are gendered stereotypes. 2. You need to bring more to the table than just looks, a man isn’t going to stay with you or take you seriously just for your looks. Oh, word? Why is it that we pat men on the back for doing things they either should be doing or we could do in our sleep, but as women we are expected to be pornstar-astronaut-activist-mother-rideordie-chef-homie-lover-friend and then some, in order to be worthy of any old man? Women are the most educated group in society. Women make up the majority of the workforce. Majority of single-parent households? Led by women. I could keep going or really shake this up by dropping some Black girl magic about my women of color specifically, but you get the picture. Nevertheless, we’re being lectured by men about what more we need to bring to the table. Not only do women bring more to the table than looks, not only do we bring the lion’s share to the table, have you ever noticed that when a man is called an eligible bachelor or a “catch” it’s always because he at most knows how to read, write, has any kind of income, and he’s cute? That’s it. Nothing else is required of him. He doesn’t have to be faithful, share your political views, give a damn about you, make sure you have something to eat, be nice to your dog, support you through your emotional demons, help elevate you, forgive you for your indiscretions, cradle your head when you fuck up, nothing. But a woman could have three degrees, a six figure income, her own place, speak two different languages, be emotionally supportive, do your laundry, pay your college tuition, and be cool as shit, but damn that bitch to hell if she puts up a sexy selfie. All of a sudden Henry the clown tells her she needs to be more than just her looks because no man can take her seriously if she doesn’t put on some clothes and respect herself. I can’t. Why aren’t women being evaluated by all their qualities? Can you please imagine a man that fit the bill of the woman I just described and the level of worship society would expect us to bestow on him. No one would give a goddamn if sexy, bilingual, laundry-doing Mark took sexy pictures or never wore a shirt. Men can and often do bring the absolute bare minimum to the table, then turn around and tell the women who carry them that they have to be more, be more than just good looking, simply because they choose to see women for nothing but their aesthetic value and overlook every other quality women have because they view women as aesthetic accessories rather than individuals. AND, even if all a woman brought to the table was her looks, how often do we see critiques about men not bringing enough? When am I going to hear “Fellas, fellas, women aren’t going to take you seriously if — “ WHEN? 3. Nobody’s going to turn a hoe into a housewife First, let’s be clear: Don’t nobody want to be your housewife. And if I did, why can’t I be both? Why do we keep pushing this virgin/whore dichotomy? I can be both, I can be neither, I can be whatever. Women are individuals with autonomy and we don’t need to have men turn us into anything or bestow some kind of label or blessing on us by claiming us as their women. We make our own decisions as to what and who we are. We are not your chattel or property. Moreover, stop asking women what their “body-counts” are or giving a damn about it altogether. Women are not stock. A woman’s stock value does not fluctuate on the market based on how many men she has slept with or is going to sleep with. Her worth has not decreased, she has not lost a portion of herself, she is no less whole or a woman. Men can sleep with 982 women and they would be floored, bewildered, flabbergasted, if so much as one of we women ever dreamed of not accepting their love or refused to view them as “boyfriend material” in light of their long list of conquests because it doesn’t matter. The same should be true of women. Men are not the only people allowed to have sex simply because they want to. Stop encouraging women to pretend not to be sexual beings and to instead lord sex over you and use it as a tool for some kind of commitment like a manipulative, emotional succubus. Moreover, if you’re going to encourage women to pretend not to be sexual beings and continuously call women who don’t go along with this charade, hoes, I don’t want to hear you complaining when your woman won’t have sex with you until she’s been committed to, or denies you sex when you upset her, or holds out altogether, because you have facilitated this use of sex as an emotional tool. I am over this tired, lazy, gendered idea that women can only have sex for some kind of emotional reason, that we can never separate feelings and sex. Men, I’m saying this for you. This hurts you more than it hurts me. Stop walking through life thinking this. You’re only causing yourself so much more pain because you’re going to be hurt when babygirl doesn’t call you back after you lay down your tired performance for the first and last time because you wrongly assumed feelings would be there in spite of all the pipe you didn’t lay. Lastly, stop calling women hoes for having a body-count more than two. Stop calling women hoes because they don’t dress like your idea of a saint. Stop calling women hoes. Even if a woman has slept with 42 men, do you have any idea how many men she has rejected? Can you possibly fathom? If women have sex being thrown at them by miscellaneous men all day everyday, whether it be walking the street, riding the subway, going to school, going to work, checking her DMS, being stopped in traffic, can you really begin to understand how many hundreds of men she has turned down for every one guy she has slept with?How many women have you turned down sex from? Hmm? One, two, never turned down any woman in your life because you take it as it comes? Yea, thought so. So if you both have a body-count of 42, while you probably chased down and thirsted your way to each of those 42 people on your list, the woman you’re calling a hoe for sleeping with 42 men has easily turned down several thousand men and left a few hundred unsolicited dick pictures in her DM’s on “seen.” But she’s the hoe? I can’t and I won’t. Overall, women don’t need a man’s two cents on how to be a woman. How to be a woman and being a woman has nothing to do with getting a man or what men think about women so keep your opinions to yourself and elevate your way of thinking. ", "author": "Olayemi Olurin", "sentences": [{"506a": "Men Won’t Take You Seriously If"}, {"0c38": "Fuck yal."}, {"587e": "Lately, all I have been seeing is men giving advice to women and writing articles directed at women. All of which keep taking the form of lectures to women about how we dress, how scantily clad we are allowed to be, how we should feel about ourselves, how to be women, what makes us worthy of male attention, who we have sex with, how many people we have sex with, how men feel about how many people we have had sex with and what it means for our chances of locking down one of these eligible clowns."}, {"8e4d": "Here’s the first thing everyone needs to understand before we proceed: Women are individuals, not male accessories. We do not exist solely to gain male approval or some man to call our own."}, {"b20d": "Never-mind the fact that many women don’t even care about getting a man, but even for those of us who may want a man, it is not our life’s essence or main priority. We are multi-faceted (and even when we aren’t, the point is that we can be)."}, {"479e": "That being said, it makes absolutely no sense that all advice for women seems to be strictly about what we should do to get a man, or about what men think about us and the moves we make, thus, our lives need to be dictated by them."}, {"aa14": "Women have the right to do what we want simply because we want to."}, {"01bd": "Moreover, why is advice about how to be a woman being written by men? How you gonna tell me how to be a woman or what it means to be a woman, Jacob? How, Sway?"}, {"c404": "Like all individuals, women are complex and not one-dimensional. I don’t need to be a virgin or modest to be respected. I can be intelligent and I can still be a hoe. And by hoe, I mean a woman that has had sex with more than one man or has sex for a purpose other than safeguarding a man or procreating with a husband, since that seems to be how men use that label these days."}, {"13d4": "So, I am going to address the different kind of male-written critiques of women I have been seeing everywhere."}, {"fd06": "1. “No no no no, I love women, I just want women to love themselves and I know they’re only dressing half-naked and taking risque pictures because they have low self-esteem.”"}, {"3931": "Logic seems to fly out the window when it comes to recycling antiquated stereotypes about women and this is my favorite trope passed down from man to man and conservative-judgy-reserved-ass-women."}, {"f4aa": "Who thought this made sense?: I don’t like my body, therefore, I am going to show it to you?"}, {"1bf1": "Listen people, let’s start with something easy:"}, {"3f84": "When someone is having a bad hair day, what do they do? Put on a hat. Why is that? Because they do not like their hair that day, so they cover it the fuck up."}, {"1142": "When you feel fat or bloated, what do you do? Wear bigger clothes than usual, cover up more, whatever. Not get ass-naked and buss it wide open on the gram."}, {"f976": "Why on God’s green earth would I be ass-naked if I had low self-esteem or didn’t like my body?"}, {"1187": "Keep in mind, this foolishness is said by the EXACT same men that spin around and say things like “ I swipe left on girls on Tinder who only have pictures of their face because they’re usually fat girls hiding their bodies.” So Henry, you do know this low self-esteem tied to revealing clothes/photos thing makes no sense."}, {"a405": "Which is it, Paul? Are we naked because we hate our bodies and need your approval, or are we hiding our bodies because we hate our bodies and don’t want you to see it?"}, {"a6f6": "These are two contradictory struggles and the only thing they seem to have in common is that in both scenarios, you seem confident that whatever decision a woman makes about her body is dictated by how a man will perceive it."}, {"e460": "But when Danny decides to live in the gym, walk around talking about “gym is life,” take shirtless selfies all day, and send unsolicited dick pictures to poor, unsuspecting women all day long, nobody accuses Danny of having low self-esteem and desperately trying to gain women’s approval. But if a woman wears fitted clothes, has any kind of cleavage, posts a sexy picture, all of a sudden all these self-proclaimed women-loving-Drake-stans come out of the woods trying to save her like “babygirl, you don’t have to do this.”"}, {"e407": "Leave her alone."}, {"5f98": "Stop assuming you have some deep understanding of a woman you don’t even know, merely by looking at her. You don’t. You don’t know her, you don’t know what you’re talking about, you don’t know anything. All you know are gendered stereotypes."}, {"09c6": "2. You need to bring more to the table than just looks, a man isn’t going to stay with you or take you seriously just for your looks."}, {"b324": "Oh, word?"}, {"a1da": "Why is it that we pat men on the back for doing things they either should be doing or we could do in our sleep, but as women we are expected to be pornstar-astronaut-activist-mother-rideordie-chef-homie-lover-friend and then some, in order to be worthy of any old man?"}, {"6820": "Women are the most educated group in society. Women make up the majority of the workforce. Majority of single-parent households? Led by women. I could keep going or really shake this up by dropping some Black girl magic about my women of color specifically, but you get the picture. Nevertheless, we’re being lectured by men about what more we need to bring to the table."}, {"d381": "Not only do women bring more to the table than looks, not only do we bring the lion’s share to the table, have you ever noticed that when a man is called an eligible bachelor or a “catch” it’s always because he at most knows how to read, write, has any kind of income, and he’s cute? That’s it. Nothing else is required of him. He doesn’t have to be faithful, share your political views, give a damn about you, make sure you have something to eat, be nice to your dog, support you through your emotional demons, help elevate you, forgive you for your indiscretions, cradle your head when you fuck up, nothing."}, {"b240": "But a woman could have three degrees, a six figure income, her own place, speak two different languages, be emotionally supportive, do your laundry, pay your college tuition, and be cool as shit, but damn that bitch to hell if she puts up a sexy selfie. All of a sudden Henry the clown tells her she needs to be more than just her looks because no man can take her seriously if she doesn’t put on some clothes and respect herself."}, {"0c40": "I can’t."}, {"6f51": "Why aren’t women being evaluated by all their qualities? Can you please imagine a man that fit the bill of the woman I just described and the level of worship society would expect us to bestow on him. No one would give a goddamn if sexy, bilingual, laundry-doing Mark took sexy pictures or never wore a shirt."}, {"9b33": "Men can and often do bring the absolute bare minimum to the table, then turn around and tell the women who carry them that they have to be more, be more than just good looking, simply because they choose to see women for nothing but their aesthetic value and overlook every other quality women have because they view women as aesthetic accessories rather than individuals."}, {"1a42": "AND, even if all a woman brought to the table was her looks, how often do we see critiques about men not bringing enough? When am I going to hear “Fellas, fellas, women aren’t going to take you seriously if — “ WHEN?"}, {"7096": "3. Nobody’s going to turn a hoe into a housewife"}, {"a679": "First, let’s be clear: Don’t nobody want to be your housewife."}, {"a069": "And if I did, why can’t I be both? Why do we keep pushing this virgin/whore dichotomy? I can be both, I can be neither, I can be whatever. Women are individuals with autonomy and we don’t need to have men turn us into anything or bestow some kind of label or blessing on us by claiming us as their women. We make our own decisions as to what and who we are. We are not your chattel or property."}, {"2102": "Moreover, stop asking women what their “body-counts” are or giving a damn about it altogether."}, {"b882": "Women are not stock. A woman’s stock value does not fluctuate on the market based on how many men she has slept with or is going to sleep with. Her worth has not decreased, she has not lost a portion of herself, she is no less whole or a woman."}, {"d0b8": "Men can sleep with 982 women and they would be floored, bewildered, flabbergasted, if so much as one of we women ever dreamed of not accepting their love or refused to view them as “boyfriend material” in light of their long list of conquests because it doesn’t matter. The same should be true of women."}, {"8460": "Men are not the only people allowed to have sex simply because they want to."}, {"fc80": "Stop encouraging women to pretend not to be sexual beings and to instead lord sex over you and use it as a tool for some kind of commitment like a manipulative, emotional succubus."}, {"f376": "Moreover, if you’re going to encourage women to pretend not to be sexual beings and continuously call women who don’t go along with this charade, hoes, I don’t want to hear you complaining when your woman won’t have sex with you until she’s been committed to, or denies you sex when you upset her, or holds out altogether, because you have facilitated this use of sex as an emotional tool."}, {"ed2c": "I am over this tired, lazy, gendered idea that women can only have sex for some kind of emotional reason, that we can never separate feelings and sex. Men, I’m saying this for you. This hurts you more than it hurts me. Stop walking through life thinking this. You’re only causing yourself so much more pain because you’re going to be hurt when babygirl doesn’t call you back after you lay down your tired performance for the first and last time because you wrongly assumed feelings would be there in spite of all the pipe you didn’t lay."}, {"5766": "Lastly, stop calling women hoes for having a body-count more than two. Stop calling women hoes because they don’t dress like your idea of a saint. Stop calling women hoes."}, {"327c": "Even if a woman has slept with 42 men, do you have any idea how many men she has rejected? Can you possibly fathom?"}, {"74cd": "If women have sex being thrown at them by miscellaneous men all day everyday, whether it be walking the street, riding the subway, going to school, going to work, checking her DMS, being stopped in traffic, can you really begin to understand how many hundreds of men she has turned down for every one guy she has slept with?How many women have you turned down sex from? Hmm? One, two, never turned down any woman in your life because you take it as it comes? Yea, thought so."}, {"a57a": "So if you both have a body-count of 42, while you probably chased down and thirsted your way to each of those 42 people on your list, the woman you’re calling a hoe for sleeping with 42 men has easily turned down several thousand men and left a few hundred unsolicited dick pictures in her DM’s on “seen.” But she’s the hoe?"}, {"588e": "I can’t and I won’t."}, {"0b55": "Overall, women don’t need a man’s two cents on how to be a woman. How to be a woman and being a woman has nothing to do with getting a man or what men think about women so keep your opinions to yourself and elevate your way of thinking."}], "timestamp": "Apr 6", "parent": "", "child": "2447_1\t2447_2\t2447_3\t2447_4\t2447_5\t2447_6\t2447_72447_1\t2447_2\t2447_3\t2447_4\t2447_5\t2447_6\t2447_72447_1\t2447_2\t2447_3\t2447_4\t2447_5\t2447_6\t2447_72447_1\t2447_2\t2447_3\t2447_4\t2447_5\t2447_6\t2447_72447_1\t2447_2\t2447_3\t2447_4\t2447_5\t2447_6\t2447_72447_1\t2447_2\t2447_3\t2447_4\t2447_5\t2447_6\t2447_7"}