{"title": "A Heineken with the Enemy", "name": "2448", "content": "A Heineken with the Enemy Last night, on a dance floor in Amsterdam, I watched a young, handsome man with a dashing swoop of blonde hair pinch my friends’ ass. She was hugging another friend at the time and he reached across her back, pinching the far cheek, in order to disguise his angle of approach. My ass had been pinched earlier, by one of the ten men standing behind me, but it was impossible by design to determine which of them did it. I’m so done with this shit. I went after him primitively, like a cavewoman would attack a barbarian threating her children. I threw him against a wall and screamed. His friend laughed at me. I slapped his friend in the face. I was pulled off of them by a well-groomed Italian, a man who seemed familiar with the choreography of bar fights. Once we all calmed down I asked the blondie if he wanted to talk about it. He did. We went into a dark alcove by the bathrooms, lit by the white light of the exit sign, and talked for thirty minutes. It makes me feel unsafe when my friends are grabbed, I said. He said: I overreacted, I have “issues,” there is “something wrong with you.” I am ignorant of Dutch culture, weird, too serious, not funny, have no sense of humor. I need help and therapy. I was jealous, and by the way, he didn’t like my ass. My reaction is valid, I said. It makes me feel unsafe. Why doesn’t my reaction matter to you? I am obviously not crazy. Yes, you are, he said. You slapped my friend. I apologized for that. It was wrong. But what’s the difference between me slapping your friend and you grabbing my friend on the ass? I asked. He closed his eyes and leaned against the wall, as though my irrationality was so exhausting he needed to take a momentary break from the sense of sight. How would you feel if someone grabbed your sister like that? Your mother? I asked. I saw his indignation collapse for a fraction of a second. He was hurt, picturing this. My mother could hold her own, he said. Like me? I asked. He never apologized. I asked him if he would continue to grab women and he said he would. We left each other on less hostile grounds than you would think. It was as though we had a friendly disagreement. I bought him a Heineken and we joked a little, about our lives and what had just happened. Maybe he’s out there this morning pinching ladies in line for coffee. But I don’t think so. I like to think he lost his appetite for it, at least for today. I do believe that if every time he grabbed a woman he was thrown against a wall and lectured for thirty minutes, he would eventually stop. I think he, like anyone else, is capable of learning. So. Talk more. Don’t endanger yourself. Don’t hit anyone. Stay safe. Stand up for yourself. Defend your people. Speak up. Refuse to accept a man telling you that your feelings are invalid. Stand your ground. You know what you saw and you know what you felt. Tell men what makes you feel unsafe. Don’t try to change the world all on your own; know when to give up and go for beers. Plant seeds of self-doubt in their minds and carry on. When I first I threw him against the wall and held him there, with my hand in a fist and my forearm across his collarbones, I was inches from his eyes. I saw his paralytic confusion and disbelief, his disorientation in discovering his body in a place he didn’t wish for it to be. If nothing else, now he knows what it feels like. Now he knows what he’s done. ", "author": "Kate Imbach", "sentences": [{"0bdd": "A Heineken with the Enemy"}, {"bbf5": "Last night, on a dance floor in Amsterdam, I watched a young, handsome man with a dashing swoop of blonde hair pinch my friends’ ass. She was hugging another friend at the time and he reached across her back, pinching the far cheek, in order to disguise his angle of approach. My ass had been pinched earlier, by one of the ten men standing behind me, but it was impossible by design to determine which of them did it."}, {"ae24": "I’m so done with this shit. I went after him primitively, like a cavewoman would attack a barbarian threating her children. I threw him against a wall and screamed. His friend laughed at me. I slapped his friend in the face. I was pulled off of them by a well-groomed Italian, a man who seemed familiar with the choreography of bar fights."}, {"c4e2": "Once we all calmed down I asked the blondie if he wanted to talk about it. He did. We went into a dark alcove by the bathrooms, lit by the white light of the exit sign, and talked for thirty minutes."}, {"1315": "It makes me feel unsafe when my friends are grabbed, I said."}, {"a76d": "He said: I overreacted, I have “issues,” there is “something wrong with you.” I am ignorant of Dutch culture, weird, too serious, not funny, have no sense of humor. I need help and therapy. I was jealous, and by the way, he didn’t like my ass."}, {"d62f": "My reaction is valid, I said. It makes me feel unsafe. Why doesn’t my reaction matter to you? I am obviously not crazy."}, {"f42b": "Yes, you are, he said. You slapped my friend."}, {"6764": "I apologized for that. It was wrong."}, {"47ae": "But what’s the difference between me slapping your friend and you grabbing my friend on the ass? I asked."}, {"b641": "He closed his eyes and leaned against the wall, as though my irrationality was so exhausting he needed to take a momentary break from the sense of sight."}, {"8520": "How would you feel if someone grabbed your sister like that? Your mother? I asked."}, {"76af": "I saw his indignation collapse for a fraction of a second. He was hurt, picturing this."}, {"cd95": "My mother could hold her own, he said."}, {"173d": "Like me? I asked."}, {"4af9": "He never apologized. I asked him if he would continue to grab women and he said he would."}, {"187f": "We left each other on less hostile grounds than you would think. It was as though we had a friendly disagreement. I bought him a Heineken and we joked a little, about our lives and what had just happened."}, {"dc7f": "Maybe he’s out there this morning pinching ladies in line for coffee. But I don’t think so. I like to think he lost his appetite for it, at least for today."}, {"15f9": "I do believe that if every time he grabbed a woman he was thrown against a wall and lectured for thirty minutes, he would eventually stop. I think he, like anyone else, is capable of learning."}, {"5917": "So. Talk more. Don’t endanger yourself. Don’t hit anyone. Stay safe. Stand up for yourself. Defend your people. Speak up. Refuse to accept a man telling you that your feelings are invalid. Stand your ground. You know what you saw and you know what you felt."}, {"871f": "Tell men what makes you feel unsafe. Don’t try to change the world all on your own; know when to give up and go for beers. Plant seeds of self-doubt in their minds and carry on."}, {"9661": "When I first I threw him against the wall and held him there, with my hand in a fist and my forearm across his collarbones, I was inches from his eyes. I saw his paralytic confusion and disbelief, his disorientation in discovering his body in a place he didn’t wish for it to be."}, {"33fe": "If nothing else, now he knows what it feels like. Now he knows what he’s done."}], "timestamp": "Feb 4", "parent": "", "child": "2448_1\t2448_2\t2448_3\t2448_4\t2448_5\t2448_6\t2448_7\t2448_8\t2448_9\t2448_10\t2448_11\t2448_12\t2448_13\t2448_14"}