{"title": "Feminism: An Excuse to Exploit Women?", "name": "2450", "content": "Feminism: An Excuse to Exploit Women? Complaint exposes the ugly consequences of ‘social justice’ On her LinkedIn profile, Chelsea Leibow calls herself a “Patriarchy-Smashing PR Priestess.” In a complaint filed last month with New York’s Human Rights Commission, however, Ms. Leibow calls herself a victim of sexual harassment. According to Ms. Leibow, while she was employed by the Manhattan-based firm Thinx, her boss “groped female underlings’ breasts, pranced around the office naked, and video-chatted workers from the toilet.” The alleged perpetrator of these offenses was not the “patriarchy,” but rather Thinx CEO Miki Agrawal, a self-declared feminist whose company specialized in marketing blood-absorbing underwear for menstruating women. Ms. Agrawal was celebrated as an entrepreneurial example for young feminists when she published her book Do Cool Sh*t: Quit Your Day Job, Start Your Own Business, and Live Happily Ever After. As recently as February 2016, Ms. Agrawal declared that she had “built a business that is centered around my beliefs in gender equality” and that “feminism is an integral part of our brand strategy.” So what was it like to work for this feminist company? According to a complaint filed [by Ms. Leibow] (and echoed in interviews with multiple current and former employees), [Ms. Agrawal talked about] the size and shape of her employees’ breasts, an employee’s nipple piercings, her own sexual exploits, her desire to experiment with polyamory, her interest in entering a sexual relationship with one of her employees, and the exact means by which she was brought to female ejaculation. . . . Agrawal also touched an employee’s breasts and asked her to expose them, routinely changed clothes in front of employees, and conducted meetings via videoconference while in bed, apparently unclothed. (She also is said in the filing to have shared nude photos of herself and others — “including but not limited to her fiancé” — with staff.) At least once, she supposedly FaceTimed into a meeting from the toilet.The complaint . . . also describes a culture of fear and a pattern of ageism, in which members of the mostly female, mostly 20-something staff were routinely referred to as “children,” with the few employees in their 30s tagged “nannies.” . . . [D]espite the company’s feminist branding and mission, the women who worked there felt exploited by low pay and substandard benefits. The complaint notes that the only two employees who had evidently successfully negotiated higher salaries were men. We could take this as an opportunity to ask whether rude, crude and discourteous behavior in the workplace is necessarily “sexual harassment.” As Professor Daphne Patai explained in her book Heterophobia, the concept of “sexual harassment” as a form of illegal discrimination against women originally concerned only the demand for sex as quid pro quo, where male superiors used their authority to extort sexual favors from female workers as a requirement of their employment, with rewards for compliance and the threat of dismissal for non-compliance. During the 1980s and ’90s, however, court decisions expanded the concept of illegal harassment to include so-called “hostile environment” discrimination. In effect, this meant that merely making an off-color joke or commenting on a co-worker’s appearance could be claimed as evidence of harassment or discrimination. This shift in the meaning of “sexual harassment” was highlighted during the 1991 confirmation hearings for Supreme Court Justice Clarence Thomas. Nothing alleged by Anita Hill amounted to “sexual harassment” as most people understood that term. Whether or not Ms. Hill’s accusations against Thomas were true, she did not claim that he made a quid pro quo demand for sexual favors in exchange for favorable treatment, nor was there evidence that Thomas engaged in retaliatory punishment (toward her or anyone else) for a refusal to provide such favors. Yet the allegations of “unwelcome sexual comments” were used to attack Thomas as unfit to serve as a federal judge, an attack he famously called a “high-tech lynching.” What do Chelsea Leibow’s allegations against Miki Agrawal tell us? Perhaps that feminism involves a double-standard in which women believe they can behave in ways that they would find offensive if a man did the same thing. Feminism often seems to be interpreted as carte blanche for women to engage in abusive or selfish behavior as “empowerment.” How else to explain why a woman who made “gender equality” such a focus of her business would have (allegedly) operated a workplace governed by a “culture of fear” where female employees “felt exploited by low pay and substandard benefits”? What this double-standard conceals is that the feminist commitment to “gender equality” does not benefit all women equally. Ms. Agrawal is the child of prosperous immigrant parents who sent her and her sisters to Ivy League universities. As a graduate of Cornell, Ms. Agrawal is “privileged” in a way that transcends race and gender and, indeed, being a minority woman could be a big career-booster, thanks to government policies aimed at helping allegedly disadvantaged people in the name of “social justice.” Women like Miki Agrawal may become so accustomed to favorable treatment from schools, businesses and other institutions committed to goals of “racial diversity” and “gender equality” that they succumb to hubris. The complaints against Ms. Agrawal remind us of the timeless lesson taught by George Orwell’s Animal Farm, when the revolution ends with the amended slogan: “All animals are equal, but some animals are more equal than others.” Those who urge us to join them in a revolution to achieve “equality” either haven’t learned that lesson, or else they figure that the rest of us don’t remember how revolutions always have a way of eating their own. Chelsea Leibow may still wants to smash the patriarchy, but it wasn’t the patriarchy that led her to hire on with Miki Agrawal’s feminist company, and if she hasn’t learned her lesson yet, she probably never will. FOLLOW The Patriarch Tree on Twitter ", "author": "Robert Stacy McCain", "sentences": [{"2d5a": "Feminism: An Excuse to Exploit Women?"}, {"fcf2": "Complaint exposes the ugly consequences of ‘social justice’"}, {"54a0": "On her LinkedIn profile, Chelsea Leibow calls herself a “Patriarchy-Smashing PR Priestess.” In a complaint filed last month with New York’s Human Rights Commission, however, Ms. Leibow calls herself a victim of sexual harassment. According to Ms. Leibow, while she was employed by the Manhattan-based firm Thinx, her boss “groped female underlings’ breasts, pranced around the office naked, and video-chatted workers from the toilet.”"}, {"4acd": "The alleged perpetrator of these offenses was not the “patriarchy,” but rather Thinx CEO Miki Agrawal, a self-declared feminist whose company specialized in marketing blood-absorbing underwear for menstruating women."}, {"57a8": "Ms. Agrawal was celebrated as an entrepreneurial example for young feminists when she published her book Do Cool Sh*t: Quit Your Day Job, Start Your Own Business, and Live Happily Ever After. As recently as February 2016, Ms. Agrawal declared that she had “built a business that is centered around my beliefs in gender equality” and that “feminism is an integral part of our brand strategy.” So what was it like to work for this feminist company?"}, {"47b8": "According to a complaint filed [by Ms. Leibow] (and echoed in interviews with multiple current and former employees), [Ms. Agrawal talked about] the size and shape of her employees’ breasts, an employee’s nipple piercings, her own sexual exploits, her desire to experiment with polyamory, her interest in entering a sexual relationship with one of her employees, and the exact means by which she was brought to female ejaculation. . . . Agrawal also touched an employee’s breasts and asked her to expose them, routinely changed clothes in front of employees, and conducted meetings via videoconference while in bed, apparently unclothed. (She also is said in the filing to have shared nude photos of herself and others — “including but not limited to her fiancé” — with staff.) At least once, she supposedly FaceTimed into a meeting from the toilet.The complaint . . . also describes a culture of fear and a pattern of ageism, in which members of the mostly female, mostly 20-something staff were routinely referred to as “children,” with the few employees in their 30s tagged “nannies.” . . . [D]espite the company’s feminist branding and mission, the women who worked there felt exploited by low pay and substandard benefits. The complaint notes that the only two employees who had evidently successfully negotiated higher salaries were men."}, {"cd4d": "We could take this as an opportunity to ask whether rude, crude and discourteous behavior in the workplace is necessarily “sexual harassment.” As Professor Daphne Patai explained in her book Heterophobia, the concept of “sexual harassment” as a form of illegal discrimination against women originally concerned only the demand for sex as quid pro quo, where male superiors used their authority to extort sexual favors from female workers as a requirement of their employment, with rewards for compliance and the threat of dismissal for non-compliance. During the 1980s and ’90s, however, court decisions expanded the concept of illegal harassment to include so-called “hostile environment” discrimination. In effect, this meant that merely making an off-color joke or commenting on a co-worker’s appearance could be claimed as evidence of harassment or discrimination."}, {"3cb3": "This shift in the meaning of “sexual harassment” was highlighted during the 1991 confirmation hearings for Supreme Court Justice Clarence Thomas. Nothing alleged by Anita Hill amounted to “sexual harassment” as most people understood that term. Whether or not Ms. Hill’s accusations against Thomas were true, she did not claim that he made a quid pro quo demand for sexual favors in exchange for favorable treatment, nor was there evidence that Thomas engaged in retaliatory punishment (toward her or anyone else) for a refusal to provide such favors. Yet the allegations of “unwelcome sexual comments” were used to attack Thomas as unfit to serve as a federal judge, an attack he famously called a “high-tech lynching.”"}, {"242e": "What do Chelsea Leibow’s allegations against Miki Agrawal tell us? Perhaps that feminism involves a double-standard in which women believe they can behave in ways that they would find offensive if a man did the same thing. Feminism often seems to be interpreted as carte blanche for women to engage in abusive or selfish behavior as “empowerment.” How else to explain why a woman who made “gender equality” such a focus of her business would have (allegedly) operated a workplace governed by a “culture of fear” where female employees “felt exploited by low pay and substandard benefits”?"}, {"d474": "What this double-standard conceals is that the feminist commitment to “gender equality” does not benefit all women equally. Ms. Agrawal is the child of prosperous immigrant parents who sent her and her sisters to Ivy League universities. As a graduate of Cornell, Ms. Agrawal is “privileged” in a way that transcends race and gender and, indeed, being a minority woman could be a big career-booster, thanks to government policies aimed at helping allegedly disadvantaged people in the name of “social justice.” Women like Miki Agrawal may become so accustomed to favorable treatment from schools, businesses and other institutions committed to goals of “racial diversity” and “gender equality” that they succumb to hubris. The complaints against Ms. Agrawal remind us of the timeless lesson taught by George Orwell’s Animal Farm, when the revolution ends with the amended slogan: “All animals are equal, but some animals are more equal than others.”"}, {"bf32": "Those who urge us to join them in a revolution to achieve “equality” either haven’t learned that lesson, or else they figure that the rest of us don’t remember how revolutions always have a way of eating their own."}, {"6ad1": "Chelsea Leibow may still wants to smash the patriarchy, but it wasn’t the patriarchy that led her to hire on with Miki Agrawal’s feminist company, and if she hasn’t learned her lesson yet, she probably never will."}, {"f443": "FOLLOW The Patriarch Tree on Twitter"}], "timestamp": "Apr 16", "parent": "", "child": "2450_1\t2450_2\t2450_3\t2450_4"}