{"title": "When Millennial Women Earn More Than Their Male Partners", "name": "2451", "content": "When Millennial Women Earn More Than Their Male Partners Nobody was expecting this to happen. If you haven’t yet read Ashley C. Ford’s in-depth look at Millennial women who out-earn their male partners, add it to your must-read list: Millennial Women Conflicted About Being BreadwinnersThe year I was born, 1987, women earned more money than their husbands in less than a quarter of American heterosexual…www.refinery29.com There’s a lot of fascinating detail in this piece, from the acknowledgement that women who earn more (and who often work longer or more stressful hours than their partners) still come home to the majority of both the emotional and household labor, to a discussion of the “stay-at-home wife” as status symbol (and the “stay-at-home husband” as… anti-status symbol). However, Ford notes that the conflict in this case isn’t necessarily about money: Like most relationships, the real problems are expectations and communication. The women most frustrated by their breadwinner status never considered it could happen, didn’t expect it to last, or can’t find a way to do things differently even when they want to. One woman describes her household situation—and her assumptions about her partner’s feelings—in a way that practically screams what she cannot say: When asked how he felt about her out-earning him, she admitted that it bothers him, “but not enough to go out and take a full time job he thinks is beneath him.” But this isn’t just a story about women who might resent their underemployed partners. Ford also profiles couples who are comfortable with their financial situation, despite the income disparity—including her own relationship. The piece also includes actual income numbers, for those of us who are curious whether earning “enough” solves at least some of the resentment, no matter who earns it. So give it a read, if you haven’t already, and let us know what you think. ", "author": "Nicole Dieker", "sentences": [{"d01e": "When Millennial Women Earn More Than Their Male Partners"}, {"078a": "Nobody was expecting this to happen."}, {"6ff4": "If you haven’t yet read Ashley C. Ford’s in-depth look at Millennial women who out-earn their male partners, add it to your must-read list:"}, {"4015": "Millennial Women Conflicted About Being BreadwinnersThe year I was born, 1987, women earned more money than their husbands in less than a quarter of American heterosexual…www.refinery29.com"}, {"571f": "There’s a lot of fascinating detail in this piece, from the acknowledgement that women who earn more (and who often work longer or more stressful hours than their partners) still come home to the majority of both the emotional and household labor, to a discussion of the “stay-at-home wife” as status symbol (and the “stay-at-home husband” as… anti-status symbol)."}, {"058e": "However, Ford notes that the conflict in this case isn’t necessarily about money:"}, {"3e0d": "Like most relationships, the real problems are expectations and communication. The women most frustrated by their breadwinner status never considered it could happen, didn’t expect it to last, or can’t find a way to do things differently even when they want to."}, {"b842": "One woman describes her household situation—and her assumptions about her partner’s feelings—in a way that practically screams what she cannot say:"}, {"4322": "When asked how he felt about her out-earning him, she admitted that it bothers him, “but not enough to go out and take a full time job he thinks is beneath him.”"}, {"1cbc": "But this isn’t just a story about women who might resent their underemployed partners. Ford also profiles couples who are comfortable with their financial situation, despite the income disparity—including her own relationship."}, {"dcd7": "The piece also includes actual income numbers, for those of us who are curious whether earning “enough” solves at least some of the resentment, no matter who earns it."}, {"36a4": "So give it a read, if you haven’t already, and let us know what you think."}], "timestamp": "Apr 17", "parent": "", "child": "2451_1\t2451_2\t2451_3\t2451_4\t2451_5\t2451_6\t2451_7\t2451_8\t2451_9\t2451_10\t2451_11\t2451_12\t2451_13"}