{"sentences": [{"17f5": "What Would an Apple MacPad Pro Look Like?"}, {"7226": "Apple has created many near-magical devices that enrich our lives. Their products exude ultra premium design, with a multitude of useful features, and constructed of refined materials. They get thinner. They get lighter. (But those prices never get smaller.) And we love them for it."}, {"d59a": "But there’s still one holy grail of technology: a device that can successfully merge the experience of using a laptop with the experience of using a tablet."}, {"6d3c": "Today, I will take you on a journey to conjecture the design and specifications of a theoretical MacPad Pro."}, {"9555": "MacBook Pro + iPad Pro = MacPad Pro"}, {"741f": "“We feel strongly that customers are not really looking for a converged Mac and iPad, …You’d begin to compromise in different ways.” — Apple CEO Tim Cook in 2015"}, {"63f3": "Well, back in 2010 Steve Jobs said no one’s going to buy a big iPhone."}, {"b291": "Look how that turned out. The latest iPhone 7 Plus was sold out globally for months after launch."}, {"8dea": "No matter the line being told to us, all the clues as to where Apple is headed are right in front of us in their current product line."}, {"c804": "Why Hasn’t MacPad Pro Been Released?"}, {"e527": "One possible reason: because of product cannibalization. If Apple were to release MacPad Pro, it would devour sales of MacBook Pro and iPad Pro."}, {"bbaf": "These products are two revenue streams that would now become one."}, {"ab93": "Apple is likely biding their time with a product launch — because they can. Why release a hybrid to eat into sales of two product categories when they can get away with releasing those product lines for a few more years? It’s smart business."}, {"1d7f": "But as the man himself once said:"}, {"3180": "“If you don’t cannibalize yourself, someone else will.” — Steve Jobs"}, {"2dc1": "Cannibalization is an inevitability in business. Apple can do it on their terms. Or they can let competitors — like Microsoft Surface — eat into the market share of this new and growing product category."}, {"a551": "A second possible reason why MacPad Pro hasn’t been released yet is because it just isn’t ready. From what history has shown us with iPhone and iPad, Apple releases new products when they are ready. Not too soon, not too late, but always precisely on time. It’s not a matter of if they decide to cannibalize, but when."}, {"167c": "Let’s talk about what major hurdles exist that is preventing this product’s release."}, {"d19a": "A Merging Of User Experiences And User Interfaces"}, {"71ff": "The first major hurdle of actually making MacPad Pro is figuring out how to merge the User Interface (the UI, — how it looks), with the User Experience (the UX ,— how you feel using it), of two different platforms in a way that is intuitive and natural to use."}, {"7c0b": "User Interface"}, {"699b": "If you examine the operating systems of MacOS and iOS over the years, you’ll see an osmosis of interfaces already happening. iOS started with putting elements of a computer in your pocket via the iPhone, and macOS has incorporated more of the iPhone into laptops."}, {"5266": "Example 1: iMessage on iPhone looks and works like iMessage on iPad/Mac:"}, {"ff83": "Example 2: Email on iPhone/iPad/Mac are now near-identical to each other. Can you tell which is which anymore?"}, {"5223": "When your devices start looking the same, and become nearly identical in size and functionality, you have to ask: “why do I have a laptop and a tablet that do the same things? Why aren’t they combined?”"}, {"6c76": "Merging UIs"}, {"e707": "So apps look similar across devices. How do we now visually distinguish between using a computer and using a tablet?"}, {"68d3": "Let’s see what the competition is doing. Microsoft Surface Pro, is a laptop computer with tablet abilities. This is the Windows 10 operating system:"}, {"5abf": "The UIs are distinct. The left looks like a normal computer desktop when you want to do computer things. The right consists of app squares when you want to do tablet things. You can switch between them with a button embedded in the hardware, or click a Windows icon in the software. This is good UX."}, {"83c7": "Microsoft’s system is decent, and I say “decent” because there aren’t enough apps being developed to make full use of their tablet mode. You’re getting a laptop with tablet features."}, {"d3aa": "Let’s look at Apple’s macOS:"}, {"2344": "Wait a minute, macOS already has distinct interfaces that are similar to Windows — except MacBook doesn’t sell itself as a tablet."}, {"0647": "And this is where Apple has an undisputed advantage. They have a great computer operating system and a fantastic tablet experience with millions of apps. macOS already has a way to switch between “laptop mode” and “tablet mode”, with a five-finger gesture. Just combine them."}, {"6c46": "Hurdle 1: Combine OS interfaces. Solved."}, {"9729": "UX"}, {"960f": "UX is the whole experience with a product. From seeing a product display in-store, to the packaging you carry home, to the delight of using and interacting with it. Every step of this experience can be broken down into smaller UX areas: ie. product display, packaging construction."}, {"696a": "User interface design is a subset of UX."}, {"a374": "How do you merge the experience of interacting on a tablet — with your finger; and interacting on a laptop — with your trackpad/mouse? They are inherently two different systems."}, {"3b38": "Let’s look at one product on two platforms so you know what I mean."}, {"3821": "Example: Microsoft Word on macOS and iOS"}, {"4289": "Having two different versions of the same software in one device is bad UX. The reason we can put more buttons on a laptop is because a mouse can click them, but you need bigger buttons on a tablet for fingers."}, {"2a50": "This is probably the biggest “compromise” that Tim Cook talks about."}, {"981a": "MacPad Pro is supposed to combine two different devices. As a consumer and user, I want to be able to use software I paid for from both devices. I also want one device instead of two."}, {"8723": "Well, not all apps have two versions. The main ones are the Apple and Microsoft Office Suites. For other apps, it’s one version or the other."}, {"df94": "The likely solution is to keep all apps as is. Make it like the Surface: offer one OS, with the apps of both systems."}, {"95a5": "Hurdle 2: Keep all current app software as-is."}, {"b1bc": "User Inputs"}, {"2fda": "We now move on to how a user interacts with the product. On a tablet we use our fingers, on a laptop we use a trackpad. While it would be great to have some all-in-one input solution, we all use our devices differently. Thus, the solution is having options to interact differently."}, {"11d0": "Apple Pencil can be used by artists that draw, Magic Mouse can be used by people who prefer a mouse. You also have a trackpad, and you have your finger. One device, different ways to use it."}, {"5fa0": "Hurdle 3: Multiple inputs for user preferences."}, {"5ac8": "Specifications"}, {"823e": "Now the fun part. Let’s examine the technical specifications MacPad Pro is likely to have:"}, {"5e0f": "Display"}, {"045b": "The most popular MacBook Pro is the 13\" model. iPad Pro’s initial display size was 12.9\". Logic dictates the first generation screen MacPad Pro is likely to have a diagonal label of 13\". It’s a size that would meet expectations from professional users."}, {"88b0": "What about resolution? Current specs are:"}, {"8850": "iPad’s aspect ratio has remained consistent no matter the size of the iPad. Laptop aspect ratios constantly change. My best guess here is MacPad Pro will keep the iPad ratio and resolution, as macOS is adaptable to screen ratios."}, {"d109": "A Retina (high pixel density) display is to be expected from a Pro label."}, {"3ac0": "Processor"}, {"286c": "Current MacBook Pros have a dual-core Intel Core i5/i7, which runs on x86 architecture (with 64-bit abilities). The current iPad Pro has an Apple A9X chip, which runs on ARM architecture (with 64-bit abilities). What does that mean? To put simply: you can’t just combine them; a ton of coding is required to have one run on the other. However, the A9X runs ARM and 64-bit programs, while Intel cannot."}, {"c133": "Let’s talk about the thin MacBook, which has an Intel Core M processor. Anandtech did a comparison of the iPad Pro’s A9X and the Intel Core M, and they have basically converged as equals for processing power. Unfortunately, the Core M chip isn’t sufficient enough for a Pro label."}, {"d633": "Apple makes their own processors for iPad, but relies on Intel for their laptops. Should Apple launch MacPad Pro anytime soon, it would have to be an Intel processor."}, {"dec2": "If I were Apple, I would want to use my own chip. This is the last hurdle: the processor is a compromise. They are waiting for their A chip to catch up or completely surpass the Intel Core i5/i7 in terms of processing power. Also, Apple pays a licensing fee to use Intel’s chips. Severing this relationship at some point will reduce this extra cost."}, {"bb87": "The endgame is Apple wants their own A-label processor."}, {"7208": "Hurdle 4: Processor technology has to catch up."}, {"6125": "Storage"}, {"29c5": "This is a Pro model, so a minimum amount of storage is necessary. Space will be required for installing laptop applications and mobile apps, along with photos and videos, and the operating system itself."}, {"48f6": "256GB would likely be the base model, with options for 512GB and 1TB."}, {"d902": "Memory"}, {"9484": "8GB of memory is the standard on MacBook Pro, and is enough for most consumers. 8GB meets the memory requirements for current laptop applications, and surpasses the memory capacity of iPad Pro. There will likely be an option to upgrade to 16GB."}, {"323c": "Graphics"}, {"c945": "Charging and Expansion"}, {"d9e5": "How will it be charged? One Thunderbolt 3 (USB-C) port, which can be used for charging, outputting to a display, or for USB 3.1 expansion."}, {"ab79": "Audio"}, {"2acd": "There will likely be a Lightning port for headphones, and charging. No 3.5mm jack. Sorry. To keep a thin device profile, the 3.5mm jack has to be removed from all future devices. A 3.5mm to Lightning adapter will be included (like the iPhone 7/7 Plus)."}, {"3579": "Speakers"}, {"74bb": "Stereo sound is expected. Two audio grills will be located on the left and right side (in landscape position)."}, {"e560": "Touch ID"}, {"1bf9": "Touch ID will be a big factor in determining the form factor. We have two likely scenarios:"}, {"bb9b": "Smart Keyboard"}, {"ebc7": "Ever since Microsoft released their Touch/Type Covers for the Surface Pro, it was clear the future of portable keyboards would be a thin keyboard that doubles as a protective screen cover."}, {"ebfb": "The Apple Smart Keyboard for the iPad Pro follows a similar design to the Microsoft Touch Keyboard, but implements a kickstand into the keyboard. Because of this, when viewed from the side, there is this uneven gap. With the addition of a trackpad, the Smart Keyboard can be stretched, and the gap fixes itself without further modification:"}, {"df03": "As for the keys, backlighting is already available on second generation Microsoft Type Covers, so it’s not a stretch to expect backlit keys. Darker keys could also be implemented to indicate the Pro nature of the keyboard and to visually differentiate from a regular Smart Keyboard."}, {"ec37": "What about implementing Force Touch in the trackpad? Depends on how flat that can be flattened down."}, {"d595": "Other Features"}, {"9dda": "I don’t want to touch on every other feature, so expect typical Wi-Fi (802.11a/b/g/n/ac) specs with Cellular options and Nano-SIM support, a 12-megapixel camera, 4K video recording, dual-microphones, 720p Facetime HD camera, a possibly snarkier Siri, and a battery life in line with current products."}, {"a657": "Pricing"}, {"0c16": "Pricing for base model, with storage and wireless options."}, {"03dc": "What will MacPad Pro be priced at? A lot. Yes, there will be a regular MacPad for the masses, but MacPad Pro will be for the Professional Supreme. And Professional Supremes will have the money for it."}, {"9b66": "Take into consideration you are getting what used to be two devices, but now uses one hardware set; you can’t exactly add the prices of both. I’m no analyst, so my best guess begins at $1,799, plus extra for additional features."}, {"54f6": "Pricing could start at $1,799."}, {"bf37": "An iPhone 7 Plus is $899 and people didn’t bat an eye (only winced). $1,799–$2,399 is a nice range and is reasonable for a true Apple laptop/tablet, but even this is a conservative estimate. The pricing is also a premium over similar competitor models because of the Apple Tax."}, {"715c": "Accessories include Apple Pencil ($99), Magic Mouse ($79), and Smart Keyboard ($169)."}, {"fea6": "Summary"}, {"7924": "Do you know what would happen if Apple released MacPad Pro, this year? (It’s not going to happen.) Apple’s stock would initially drop because of fears of cannibalization, and eventually go back up once sales numbers are normalized. There would likely be a mass unloading of iPads and MacBooks on auction sites (I would sell my MacBook Pro, iPad mini, and Surface Pro). It will be the new IT product. It will be sold out for months. You know, the usual."}, {"b560": "The hybrid computing industry would finally have decent competition. Consumers would have a device made for media consumption and full-on productivity! In one lightweight piece of magical hardware!"}, {"28a8": "Snap out of it. Don’t expect the MacPad Pro for at least 2–3 more years. The technology required has to catch up with Apple’s vision. But my money’s ready if it comes out sooner."}, {"01bd": "What do you think? Do you see this product happening anytime soon and why? What would you want in your MacPad Pro? Let me hear your comments below."}, {"75bb": "Please heart, share, and follow!"}, {"25cf": "If you liked this, you may enjoy:"}], "content": "What Would an Apple MacPad Pro Look Like? Apple has created many near-magical devices that enrich our lives. Their products exude ultra premium design, with a multitude of useful features, and constructed of refined materials. They get thinner. They get lighter. (But those prices never get smaller.) And we love them for it. But there’s still one holy grail of technology: a device that can successfully merge the experience of using a laptop with the experience of using a tablet. Today, I will take you on a journey to conjecture the design and specifications of a theoretical MacPad Pro. MacBook Pro + iPad Pro = MacPad Pro “We feel strongly that customers are not really looking for a converged Mac and iPad, …You’d begin to compromise in different ways.” — Apple CEO Tim Cook in 2015 Well, back in 2010 Steve Jobs said no one’s going to buy a big iPhone. Look how that turned out. The latest iPhone 7 Plus was sold out globally for months after launch. No matter the line being told to us, all the clues as to where Apple is headed are right in front of us in their current product line. Why Hasn’t MacPad Pro Been Released? One possible reason: because of product cannibalization. If Apple were to release MacPad Pro, it would devour sales of MacBook Pro and iPad Pro. These products are two revenue streams that would now become one. Apple is likely biding their time with a product launch — because they can. Why release a hybrid to eat into sales of two product categories when they can get away with releasing those product lines for a few more years? It’s smart business. But as the man himself once said: “If you don’t cannibalize yourself, someone else will.” — Steve Jobs Cannibalization is an inevitability in business. Apple can do it on their terms. Or they can let competitors — like Microsoft Surface — eat into the market share of this new and growing product category. A second possible reason why MacPad Pro hasn’t been released yet is because it just isn’t ready. From what history has shown us with iPhone and iPad, Apple releases new products when they are ready. Not too soon, not too late, but always precisely on time. It’s not a matter of if they decide to cannibalize, but when. Let’s talk about what major hurdles exist that is preventing this product’s release. A Merging Of User Experiences And User Interfaces The first major hurdle of actually making MacPad Pro is figuring out how to merge the User Interface (the UI, — how it looks), with the User Experience (the UX ,— how you feel using it), of two different platforms in a way that is intuitive and natural to use. User Interface If you examine the operating systems of MacOS and iOS over the years, you’ll see an osmosis of interfaces already happening. iOS started with putting elements of a computer in your pocket via the iPhone, and macOS has incorporated more of the iPhone into laptops. Example 1: iMessage on iPhone looks and works like iMessage on iPad/Mac: Example 2: Email on iPhone/iPad/Mac are now near-identical to each other. Can you tell which is which anymore? When your devices start looking the same, and become nearly identical in size and functionality, you have to ask: “why do I have a laptop and a tablet that do the same things? Why aren’t they combined?” Merging UIs So apps look similar across devices. How do we now visually distinguish between using a computer and using a tablet? Let’s see what the competition is doing. Microsoft Surface Pro, is a laptop computer with tablet abilities. This is the Windows 10 operating system: The UIs are distinct. The left looks like a normal computer desktop when you want to do computer things. The right consists of app squares when you want to do tablet things. You can switch between them with a button embedded in the hardware, or click a Windows icon in the software. This is good UX. Microsoft’s system is decent, and I say “decent” because there aren’t enough apps being developed to make full use of their tablet mode. You’re getting a laptop with tablet features. Let’s look at Apple’s macOS: Wait a minute, macOS already has distinct interfaces that are similar to Windows — except MacBook doesn’t sell itself as a tablet. And this is where Apple has an undisputed advantage. They have a great computer operating system and a fantastic tablet experience with millions of apps. macOS already has a way to switch between “laptop mode” and “tablet mode”, with a five-finger gesture. Just combine them. Hurdle 1: Combine OS interfaces. Solved. UX UX is the whole experience with a product. From seeing a product display in-store, to the packaging you carry home, to the delight of using and interacting with it. Every step of this experience can be broken down into smaller UX areas: ie. product display, packaging construction. User interface design is a subset of UX. How do you merge the experience of interacting on a tablet — with your finger; and interacting on a laptop — with your trackpad/mouse? They are inherently two different systems. Let’s look at one product on two platforms so you know what I mean. Example: Microsoft Word on macOS and iOS Having two different versions of the same software in one device is bad UX. The reason we can put more buttons on a laptop is because a mouse can click them, but you need bigger buttons on a tablet for fingers. This is probably the biggest “compromise” that Tim Cook talks about. MacPad Pro is supposed to combine two different devices. As a consumer and user, I want to be able to use software I paid for from both devices. I also want one device instead of two. Well, not all apps have two versions. The main ones are the Apple and Microsoft Office Suites. For other apps, it’s one version or the other. The likely solution is to keep all apps as is. Make it like the Surface: offer one OS, with the apps of both systems. Hurdle 2: Keep all current app software as-is. User Inputs We now move on to how a user interacts with the product. On a tablet we use our fingers, on a laptop we use a trackpad. While it would be great to have some all-in-one input solution, we all use our devices differently. Thus, the solution is having options to interact differently. Apple Pencil can be used by artists that draw, Magic Mouse can be used by people who prefer a mouse. You also have a trackpad, and you have your finger. One device, different ways to use it. Hurdle 3: Multiple inputs for user preferences. Specifications Now the fun part. Let’s examine the technical specifications MacPad Pro is likely to have: Display The most popular MacBook Pro is the 13\" model. iPad Pro’s initial display size was 12.9\". Logic dictates the first generation screen MacPad Pro is likely to have a diagonal label of 13\". It’s a size that would meet expectations from professional users. What about resolution? Current specs are: iPad’s aspect ratio has remained consistent no matter the size of the iPad. Laptop aspect ratios constantly change. My best guess here is MacPad Pro will keep the iPad ratio and resolution, as macOS is adaptable to screen ratios. A Retina (high pixel density) display is to be expected from a Pro label. Processor Current MacBook Pros have a dual-core Intel Core i5/i7, which runs on x86 architecture (with 64-bit abilities). The current iPad Pro has an Apple A9X chip, which runs on ARM architecture (with 64-bit abilities). What does that mean? To put simply: you can’t just combine them; a ton of coding is required to have one run on the other. However, the A9X runs ARM and 64-bit programs, while Intel cannot. Let’s talk about the thin MacBook, which has an Intel Core M processor. Anandtech did a comparison of the iPad Pro’s A9X and the Intel Core M, and they have basically converged as equals for processing power. Unfortunately, the Core M chip isn’t sufficient enough for a Pro label. Apple makes their own processors for iPad, but relies on Intel for their laptops. Should Apple launch MacPad Pro anytime soon, it would have to be an Intel processor. If I were Apple, I would want to use my own chip. This is the last hurdle: the processor is a compromise. They are waiting for their A chip to catch up or completely surpass the Intel Core i5/i7 in terms of processing power. Also, Apple pays a licensing fee to use Intel’s chips. Severing this relationship at some point will reduce this extra cost. The endgame is Apple wants their own A-label processor. Hurdle 4: Processor technology has to catch up. Storage This is a Pro model, so a minimum amount of storage is necessary. Space will be required for installing laptop applications and mobile apps, along with photos and videos, and the operating system itself. 256GB would likely be the base model, with options for 512GB and 1TB. Memory 8GB of memory is the standard on MacBook Pro, and is enough for most consumers. 8GB meets the memory requirements for current laptop applications, and surpasses the memory capacity of iPad Pro. There will likely be an option to upgrade to 16GB. Graphics Charging and Expansion How will it be charged? One Thunderbolt 3 (USB-C) port, which can be used for charging, outputting to a display, or for USB 3.1 expansion. Audio There will likely be a Lightning port for headphones, and charging. No 3.5mm jack. Sorry. To keep a thin device profile, the 3.5mm jack has to be removed from all future devices. A 3.5mm to Lightning adapter will be included (like the iPhone 7/7 Plus). Speakers Stereo sound is expected. Two audio grills will be located on the left and right side (in landscape position). Touch ID Touch ID will be a big factor in determining the form factor. We have two likely scenarios: Smart Keyboard Ever since Microsoft released their Touch/Type Covers for the Surface Pro, it was clear the future of portable keyboards would be a thin keyboard that doubles as a protective screen cover. The Apple Smart Keyboard for the iPad Pro follows a similar design to the Microsoft Touch Keyboard, but implements a kickstand into the keyboard. Because of this, when viewed from the side, there is this uneven gap. With the addition of a trackpad, the Smart Keyboard can be stretched, and the gap fixes itself without further modification: As for the keys, backlighting is already available on second generation Microsoft Type Covers, so it’s not a stretch to expect backlit keys. Darker keys could also be implemented to indicate the Pro nature of the keyboard and to visually differentiate from a regular Smart Keyboard. What about implementing Force Touch in the trackpad? Depends on how flat that can be flattened down. Other Features I don’t want to touch on every other feature, so expect typical Wi-Fi (802.11a/b/g/n/ac) specs with Cellular options and Nano-SIM support, a 12-megapixel camera, 4K video recording, dual-microphones, 720p Facetime HD camera, a possibly snarkier Siri, and a battery life in line with current products. Pricing Pricing for base model, with storage and wireless options. What will MacPad Pro be priced at? A lot. Yes, there will be a regular MacPad for the masses, but MacPad Pro will be for the Professional Supreme. And Professional Supremes will have the money for it. Take into consideration you are getting what used to be two devices, but now uses one hardware set; you can’t exactly add the prices of both. I’m no analyst, so my best guess begins at $1,799, plus extra for additional features. Pricing could start at $1,799. An iPhone 7 Plus is $899 and people didn’t bat an eye (only winced). $1,799–$2,399 is a nice range and is reasonable for a true Apple laptop/tablet, but even this is a conservative estimate. The pricing is also a premium over similar competitor models because of the Apple Tax. Accessories include Apple Pencil ($99), Magic Mouse ($79), and Smart Keyboard ($169). Summary Do you know what would happen if Apple released MacPad Pro, this year? (It’s not going to happen.) Apple’s stock would initially drop because of fears of cannibalization, and eventually go back up once sales numbers are normalized. There would likely be a mass unloading of iPads and MacBooks on auction sites (I would sell my MacBook Pro, iPad mini, and Surface Pro). It will be the new IT product. It will be sold out for months. You know, the usual. The hybrid computing industry would finally have decent competition. Consumers would have a device made for media consumption and full-on productivity! In one lightweight piece of magical hardware! Snap out of it. Don’t expect the MacPad Pro for at least 2–3 more years. The technology required has to catch up with Apple’s vision. But my money’s ready if it comes out sooner. What do you think? Do you see this product happening anytime soon and why? What would you want in your MacPad Pro? Let me hear your comments below. Please heart, share, and follow! If you liked this, you may enjoy: ", "title": "What Would an Apple MacPad Pro Look Like?", "parent": "", "name": "2458", "timestamp": "Apr 12", "author": "benjamin bannister", "child": "2458_1\t2458_2\t2458_3\t2458_4\t2458_5\t2458_6\t2458_7\t2458_82458_1\t2458_2\t2458_3\t2458_4\t2458_5\t2458_6\t2458_7\t2458_82458_1\t2458_2\t2458_3\t2458_4\t2458_5\t2458_6\t2458_7\t2458_82458_1\t2458_2\t2458_3\t2458_4\t2458_5\t2458_6\t2458_7\t2458_82458_1\t2458_2\t2458_3\t2458_4\t2458_5\t2458_6\t2458_7\t2458_82458_1\t2458_2\t2458_3\t2458_4\t2458_5\t2458_6\t2458_7\t2458_82458_1\t2458_2\t2458_3\t2458_4\t2458_5\t2458_6\t2458_7\t2458_8"}