{"sentences": [{"3ead": "10 Years Ago, My Friend Died At Virginia Tech"}, {"1aef": "When I heard there was a shooting, I texted Henh. He didn’t reply."}, {"7a43": "My friend. | Henh Ly"}, {"b606": "When I found out my friend died, I was holding a cheeseburger, fries and a plastic ramekin of mayonnaise. I was a college freshman, walking through a big white tent on my way back to the dorm. A grounds crew had assembled the tent for a charity fashion show, during which attractive people would raise money for kids with cleft palates. For now, the tent was empty and silent. It was raining, just like in the movies. My mom called my cell phone, and I sat on the edge of a wooden plank."}, {"4751": "She said two words: “Henh’s dead.”"}, {"5f14": "The William Fleming High School International Baccalaureate Class of 2006 was a tight-knit group. Separated from the other students since 6th grade, we had the same schedule and the same teachers for seven years."}, {"2f90": "We ate lunch together in a classroom with our history teacher, a short, sharp-tongued veteran whose lectures felt like military briefings. Over lunch, we had historical debates and watched “Chappelle’s Show” on a TV that was rolled in and out of the classrooms. Except for the divisive choice between Spanish or French in 7th grade, we spent all our school hours together."}, {"26c7": "As graduation approached, the IB students began to think about what school would look like without each other. We also began to pay closer attention to our rank. The valedictorian and the salutatorian would both speak at graduation: I was #1 and Henh was #2."}, {"057c": "I loved the stage. A drama nerd with starring roles as Reverend Shaw (“Footloose”) and Don Quixote (“Man of La Mancha”) under his belt, I wasn’t scared of the graduation-day crowd. Henh, though, was nervous about his speech. Shy at first, but with a sharp sense of humor (he made sure I was aware of my post-pubescent, fluctuating weight), Henh excelled in small groups, not large auditoriums. To boot, English wasn’t his first language. His family immigrated to the US when he was a baby."}, {"d2b5": "With a graduation rate that teeters around 50%, Fleming commencement ceremonies are true celebrations. Mothers cheer, aunts and uncles scream and all are discouraged from bringing airhorns or noisemaking devices into the Roanoke Civic Center. After some stock advice from an overpaid inspirational speaker, harmonies from the school choir and rehearsed remarks from the new principal, Henh was invited to the stage to give his speech."}, {"2d4a": "Audiences can tell when someone is nervous. They either turn on the speaker or rally behind him. Henh, through his charm, wit and sincerity, scored the latter."}, {"da68": "He told his story: immigrating to the US, working hard in school and at a part-time job at Sears, studying to become a US citizen — a badge he couldn’t have been more proud of. He ended with a Ralph Waldo Emerson quote, from a poem we had read together in English class:"}, {"1f0d": "“To finish the moment, to find the journey’s end in every step of the road, to live the greatest number of good hours, is wisdom.”"}, {"c002": "The audience stood and applauded."}, {"38ae": "I cried. I cried and cried. I met with a school administrator to find a way to get home. Once the travel was arranged, I took a walk around the dim campus and found myself at the chapel. I don’t know if I was searching for a quiet space, or searching for a place where something would speak to me. The stained-glass windows were dull; no light shone through them. There were no voices, no music, no profound revelations. The chapel was as silent as an empty classroom."}, {"5b77": "After our speeches (mine went well, though it could have used more jokes) and photos in blue robes with black diplomas, Henh invited us to his house for a barbecue. My family had a reservation at the Olive Garden, our go-to celebration headquarters, but after that, I drove to an address I had never been to. Henh had always been quiet about his family, perhaps reluctant to accentuate anything that would keep him from fitting in."}, {"fc06": "When we arrived, there was a feast laid out on a picnic table in Henh’s backyard. In the center stood a melon sculpture: A watermelon had been carved into a basket filled with small spheres of honeydew and pineapple. Henh’s brother was barbecuing some sort of bird. We asked Henh what bird it was."}, {"a607": "He replied, “Bird.”"}, {"00d7": "We laughed."}, {"52b6": "I took the window seat on a metal bird heading from Philadelphia to Roanoke. It was my first time flying. I had asked a friend how carry-ons worked. My school had hired a driver to take me from campus to the Philadelphia airport. He talked at me for the 90-minute drive, oblivious to my yearning not to talk to anyone. When we landed in Roanoke, the pilot made an announcement:"}, {"3e3c": "“Ladies and gentlemen, please remain seated. We’ve got a pair of parents of a student at Virginia Tech on board. Out of respect for their loss, we’re going to ask to let them disembark first.”"}, {"a4b3": "I remained in my seat as the couple got off the plane. Part of me wanted to stand up and scream, “My friend died, too!” “My friend died at Virginia Tech!”"}, {"2123": "But I didn’t. It felt like bragging about something no one should ever boast about."}, {"0833": "My mom and dad picked me up at the airport and we rode home in silence. When we got home, I went straight to the bed in my brother’s room. My family had turned my old room into an office, one of the more sobering corollaries of my being in college now."}, {"928d": "I laid in my brother’s bed and wept. The door stayed shut. My family didn’t bother me. I wanted silence. On Day 2, my mom brought me one of my dad’s Xanax. I said no. The next day, she tried to console me, telling me Henh was in a better place. I asked for quiet. I didn’t want to neutralize or contextualize what I was feeling; the pain was real, and to diminish that would be to dishonor his memory."}, {"6972": "On Day 3, our high-school drama teacher, a balding Catholic man who looked like how you imagine Shakespeare looked, let Henh’s former classmates hole up in a rehearsal room to cry and remember. Grief comes in waves. Overwhelming weeping and shallow breaths give way to slightly deeper, restorative breathing. We alternated within the group — grievers playing comforters, and comforters taking turns grieving."}, {"3b5c": "Our French teacher, Madame Fassie, made us all copies of one of Henh’s final French exams. He was in French class at Virginia Tech when Seung-Hui Cho shot through the door, murdering Henh, his teacher and 30 other people. The police said that based on where his body was found, it appeared he was helping to barricade the door when he was shot."}, {"2512": "In the back of Madame Fassie’s voice, it sounded like she was blaming herself."}, {"81a1": "Our tight-knit group began to unravel as we headed off to college. Freshman years at Virginia Commonwealth University, UVA, Virginia Tech, Princeton, The Ohio State. When Thanksgiving approached, we met at Applebee’s, our neighborhood bar and grill, for dinner. We chatted about our college classes, possible majors, living away from home, making new friends. We rehashed old inside jokes and memories."}, {"9847": "When dinner ended, it was still early, so Henh and I decided to ride around in my mom’s red truck. It was our first time alone. Top 40 hits played on the radio and Roanoke wind blew through the cracked windows as we did laps around Target (where I had worked) and Sears (where he had worked). I don’t remember what we talked about — something mundane? Something profound? Memory makes choices as haphazardly as fate does."}, {"17c9": "Henh and I were certainly close in classes — all the “smart kids” were. But when I arrived at the funeral home, I found myself upgraded to “Henh’s best friend.” That’s how his family described me."}, {"12d1": "I’d be seeing him for the first time after his death. So would his family. Not a “first” I ever wanted to experience. His family sobbed. I cried. They handed me a video camera to document the moment. I felt disgusted."}, {"1616": "The funeral home let us know the bullet had pierced through his neck and exited the back of his head, which was lucky, since his face was unmarred and the casket could remain open during the wake."}, {"cbf8": "When I saw Henh’s body, I was overcome by an urge to cross myself. I had been raised Southern Baptist, and Baptists don’t cross themselves. Yet my body compulsively wanted to do something. I craved some set of prescribed actions, steps I could carry out, something to carve some sense out of this senseless event. “This,” I thought, “is why religion exists.”"}, {"b28f": "I Googled “how to write a eulogy” the night before Henh’s memorial service. I knew how to write a speech — mix storytelling and humor, add some emotional twists and turns — but trying to write a good speech to give a good performance for a eulogy felt fake, insincere."}, {"7ea3": "The more I thought and wrote, the more I realized how words themselves felt fake. To label feelings was to reduce them. Maybe silence was the only true thing. I Googled that phrase, and the Buddha appeared in the search results. I decided to incorporate some of his sayings into the eulogy."}, {"2e8f": "The memorial service was held in the high school theatre where I had played Don Quixote. They showed a video of Henh’s salutatorian address, which was so full of potential and promise, but now served as his crowning achievement. What should have been the first of many important speeches or talks or moments for him was now his only one."}, {"b318": "In the video, Henh welcomes me to the podium to give my valedictorian address. The past clashed violently with the present. Now we weren’t celebrating; we were mourning. Henh’s recorded self welcomed me to a different podium to give a speech I dreaded to give."}, {"f45b": "In the silence following the burial, during which we threw Chinese currency into the grave and burned incense, our tight-knit group went out to lunch. We went to Famous Anthony’s, where a friend had been a server. Our history teacher, in a rare moment of intimacy, joined us. We cut jokes and ordered extra fries. An air of normalcy and resilience started to form. The next day, we’d each return to our separate schools after an unplanned reunion that diminished our numbers."}, {"8644": "In the fall of my freshman year of college, when I signed up for spring classes, I decided to take “The Biblical King David,” a historical and political critical reading of the person/character in the Bible. During my Thanksgiving at home with friends, I discussed the Bible with my dad. Being away from home, and then abruptly back in the place that built me, made me start to think critically about my upbringing."}, {"731a": "On April 16, 2007, in a class in the Judaic Studies building, I opened my laptop to take notes and check my email."}, {"40af": "A news story popped up."}, {"0cd0": "There’d been a school shooting."}, {"2817": "I texted Henh, but didn’t hear back from him."}, {"1b9c": "“Ladies and gentlemen, please remain seated. We’ve got a pair of parents of a student at Virginia Tech on board. Out of respect for their loss, we’re going to ask to let them disembark first.”"}, {"ccef": "“This,” I thought, “is why religion exists.”"}, {"7cdc": "I headed to the campus center to get lunch. A hamburger, French fries and a plastic ramekin of mayonnaise."}, {"4041": "The paramedics commented on how many cell phones were ringing in the empty classroom."}, {"cef4": "“How to write a eulogy.”"}, {"c024": "“Henh’s dead.”"}, {"3c7b": "“How to write a good eulogy.”"}, {"b750": "“Bird.”"}, {"6b1d": "“How to not have to write a eulogy.”"}, {"0d6c": "“To finish the moment, to find the journey’s end in every step of the road, to live the greatest number of good hours, is wisdom.”"}, {"0a65": "“Bird.”"}], "content": "10 Years Ago, My Friend Died At Virginia Tech When I heard there was a shooting, I texted Henh. He didn’t reply. My friend. | Henh Ly When I found out my friend died, I was holding a cheeseburger, fries and a plastic ramekin of mayonnaise. I was a college freshman, walking through a big white tent on my way back to the dorm. A grounds crew had assembled the tent for a charity fashion show, during which attractive people would raise money for kids with cleft palates. For now, the tent was empty and silent. It was raining, just like in the movies. My mom called my cell phone, and I sat on the edge of a wooden plank. She said two words: “Henh’s dead.” The William Fleming High School International Baccalaureate Class of 2006 was a tight-knit group. Separated from the other students since 6th grade, we had the same schedule and the same teachers for seven years. We ate lunch together in a classroom with our history teacher, a short, sharp-tongued veteran whose lectures felt like military briefings. Over lunch, we had historical debates and watched “Chappelle’s Show” on a TV that was rolled in and out of the classrooms. Except for the divisive choice between Spanish or French in 7th grade, we spent all our school hours together. As graduation approached, the IB students began to think about what school would look like without each other. We also began to pay closer attention to our rank. The valedictorian and the salutatorian would both speak at graduation: I was #1 and Henh was #2. I loved the stage. A drama nerd with starring roles as Reverend Shaw (“Footloose”) and Don Quixote (“Man of La Mancha”) under his belt, I wasn’t scared of the graduation-day crowd. Henh, though, was nervous about his speech. Shy at first, but with a sharp sense of humor (he made sure I was aware of my post-pubescent, fluctuating weight), Henh excelled in small groups, not large auditoriums. To boot, English wasn’t his first language. His family immigrated to the US when he was a baby. With a graduation rate that teeters around 50%, Fleming commencement ceremonies are true celebrations. Mothers cheer, aunts and uncles scream and all are discouraged from bringing airhorns or noisemaking devices into the Roanoke Civic Center. After some stock advice from an overpaid inspirational speaker, harmonies from the school choir and rehearsed remarks from the new principal, Henh was invited to the stage to give his speech. Audiences can tell when someone is nervous. They either turn on the speaker or rally behind him. Henh, through his charm, wit and sincerity, scored the latter. He told his story: immigrating to the US, working hard in school and at a part-time job at Sears, studying to become a US citizen — a badge he couldn’t have been more proud of. He ended with a Ralph Waldo Emerson quote, from a poem we had read together in English class: “To finish the moment, to find the journey’s end in every step of the road, to live the greatest number of good hours, is wisdom.” The audience stood and applauded. I cried. I cried and cried. I met with a school administrator to find a way to get home. Once the travel was arranged, I took a walk around the dim campus and found myself at the chapel. I don’t know if I was searching for a quiet space, or searching for a place where something would speak to me. The stained-glass windows were dull; no light shone through them. There were no voices, no music, no profound revelations. The chapel was as silent as an empty classroom. After our speeches (mine went well, though it could have used more jokes) and photos in blue robes with black diplomas, Henh invited us to his house for a barbecue. My family had a reservation at the Olive Garden, our go-to celebration headquarters, but after that, I drove to an address I had never been to. Henh had always been quiet about his family, perhaps reluctant to accentuate anything that would keep him from fitting in. When we arrived, there was a feast laid out on a picnic table in Henh’s backyard. In the center stood a melon sculpture: A watermelon had been carved into a basket filled with small spheres of honeydew and pineapple. Henh’s brother was barbecuing some sort of bird. We asked Henh what bird it was. He replied, “Bird.” We laughed. I took the window seat on a metal bird heading from Philadelphia to Roanoke. It was my first time flying. I had asked a friend how carry-ons worked. My school had hired a driver to take me from campus to the Philadelphia airport. He talked at me for the 90-minute drive, oblivious to my yearning not to talk to anyone. When we landed in Roanoke, the pilot made an announcement: “Ladies and gentlemen, please remain seated. We’ve got a pair of parents of a student at Virginia Tech on board. Out of respect for their loss, we’re going to ask to let them disembark first.” I remained in my seat as the couple got off the plane. Part of me wanted to stand up and scream, “My friend died, too!” “My friend died at Virginia Tech!” But I didn’t. It felt like bragging about something no one should ever boast about. My mom and dad picked me up at the airport and we rode home in silence. When we got home, I went straight to the bed in my brother’s room. My family had turned my old room into an office, one of the more sobering corollaries of my being in college now. I laid in my brother’s bed and wept. The door stayed shut. My family didn’t bother me. I wanted silence. On Day 2, my mom brought me one of my dad’s Xanax. I said no. The next day, she tried to console me, telling me Henh was in a better place. I asked for quiet. I didn’t want to neutralize or contextualize what I was feeling; the pain was real, and to diminish that would be to dishonor his memory. On Day 3, our high-school drama teacher, a balding Catholic man who looked like how you imagine Shakespeare looked, let Henh’s former classmates hole up in a rehearsal room to cry and remember. Grief comes in waves. Overwhelming weeping and shallow breaths give way to slightly deeper, restorative breathing. We alternated within the group — grievers playing comforters, and comforters taking turns grieving. Our French teacher, Madame Fassie, made us all copies of one of Henh’s final French exams. He was in French class at Virginia Tech when Seung-Hui Cho shot through the door, murdering Henh, his teacher and 30 other people. The police said that based on where his body was found, it appeared he was helping to barricade the door when he was shot. In the back of Madame Fassie’s voice, it sounded like she was blaming herself. Our tight-knit group began to unravel as we headed off to college. Freshman years at Virginia Commonwealth University, UVA, Virginia Tech, Princeton, The Ohio State. When Thanksgiving approached, we met at Applebee’s, our neighborhood bar and grill, for dinner. We chatted about our college classes, possible majors, living away from home, making new friends. We rehashed old inside jokes and memories. When dinner ended, it was still early, so Henh and I decided to ride around in my mom’s red truck. It was our first time alone. Top 40 hits played on the radio and Roanoke wind blew through the cracked windows as we did laps around Target (where I had worked) and Sears (where he had worked). I don’t remember what we talked about — something mundane? Something profound? Memory makes choices as haphazardly as fate does. Henh and I were certainly close in classes — all the “smart kids” were. But when I arrived at the funeral home, I found myself upgraded to “Henh’s best friend.” That’s how his family described me. I’d be seeing him for the first time after his death. So would his family. Not a “first” I ever wanted to experience. His family sobbed. I cried. They handed me a video camera to document the moment. I felt disgusted. The funeral home let us know the bullet had pierced through his neck and exited the back of his head, which was lucky, since his face was unmarred and the casket could remain open during the wake. When I saw Henh’s body, I was overcome by an urge to cross myself. I had been raised Southern Baptist, and Baptists don’t cross themselves. Yet my body compulsively wanted to do something. I craved some set of prescribed actions, steps I could carry out, something to carve some sense out of this senseless event. “This,” I thought, “is why religion exists.” I Googled “how to write a eulogy” the night before Henh’s memorial service. I knew how to write a speech — mix storytelling and humor, add some emotional twists and turns — but trying to write a good speech to give a good performance for a eulogy felt fake, insincere. The more I thought and wrote, the more I realized how words themselves felt fake. To label feelings was to reduce them. Maybe silence was the only true thing. I Googled that phrase, and the Buddha appeared in the search results. I decided to incorporate some of his sayings into the eulogy. The memorial service was held in the high school theatre where I had played Don Quixote. They showed a video of Henh’s salutatorian address, which was so full of potential and promise, but now served as his crowning achievement. What should have been the first of many important speeches or talks or moments for him was now his only one. In the video, Henh welcomes me to the podium to give my valedictorian address. The past clashed violently with the present. Now we weren’t celebrating; we were mourning. Henh’s recorded self welcomed me to a different podium to give a speech I dreaded to give. In the silence following the burial, during which we threw Chinese currency into the grave and burned incense, our tight-knit group went out to lunch. We went to Famous Anthony’s, where a friend had been a server. Our history teacher, in a rare moment of intimacy, joined us. We cut jokes and ordered extra fries. An air of normalcy and resilience started to form. The next day, we’d each return to our separate schools after an unplanned reunion that diminished our numbers. In the fall of my freshman year of college, when I signed up for spring classes, I decided to take “The Biblical King David,” a historical and political critical reading of the person/character in the Bible. During my Thanksgiving at home with friends, I discussed the Bible with my dad. Being away from home, and then abruptly back in the place that built me, made me start to think critically about my upbringing. On April 16, 2007, in a class in the Judaic Studies building, I opened my laptop to take notes and check my email. A news story popped up. There’d been a school shooting. I texted Henh, but didn’t hear back from him. “Ladies and gentlemen, please remain seated. We’ve got a pair of parents of a student at Virginia Tech on board. Out of respect for their loss, we’re going to ask to let them disembark first.” “This,” I thought, “is why religion exists.” I headed to the campus center to get lunch. A hamburger, French fries and a plastic ramekin of mayonnaise. The paramedics commented on how many cell phones were ringing in the empty classroom. “How to write a eulogy.” “Henh’s dead.” “How to write a good eulogy.” “Bird.” “How to not have to write a eulogy.” “To finish the moment, to find the journey’s end in every step of the road, to live the greatest number of good hours, is wisdom.” “Bird.” ", "title": "10 Years Ago, My Friend Died At Virginia Tech", "parent": "", "name": "2461", "timestamp": "Apr 16", "author": "Zach Zimmerman", "child": "2461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_232461_1\t2461_2\t2461_3\t2461_4\t2461_5\t2461_6\t2461_7\t2461_8\t2461_9\t2461_10\t2461_11\t2461_12\t2461_13\t2461_14\t2461_15\t2461_16\t2461_17\t2461_18\t2461_19\t2461_20\t2461_21\t2461_22\t2461_23"}