{"sentences": [{"bf03": "Opinion"}, {"7449": "Here’s Why Students Need Many Maps to Understand the World"}, {"74f9": "In an effort to “decolonize” the curriculum and show the true size of Africa and Latin America, Boston is using another flawed map."}, {"74e3": "Recently, administrators at Boston Public Schools announced they would switch to using the Gall-Peters map in their classrooms, and move away from the more common and much older Mercator map. Billed as an effort to “decolonize” the curriculum, the school district, with a school population that’s largely black and Latino, is phasing out Mercator in the first step of a three-year restructuring plan."}, {"cdd8": "This is an unprecedented and strange move — after all, no map projection is a truly accurate depiction of a three-dimensional surface, and all maps cause some kind of distortion. Sure, it’s true that some distort more than others. In fact, the Gall-Peters map distorts shape so extremely at the equator and at the poles that its most frequent use is not for navigation or land-area study, but as a sharp contrast to the maps that we are used to seeing. While I strongly believe that there is no real reason to use a Gall-Peters map extensively, its use could be valuable if it’s compared and contrasted to other projections."}, {"dd89": "A map projection is a transfer of the earth’s latitudes and longitudes from a sphere to a plane — or, put more simply, the flattening of a globe to display the earth on a two-dimensional surface. Because this is not easy to do, all projections suffer from some sort of distortion. (Imagine peeling an orange so that the skin will lay completely flat. It’s not possible, there will be tears and bumps along the surface.) Cartographers have created thousands of map projections, and the versions have various uses. Some projections prioritize shape over area, and these “conformal” maps are good for navigation. Some projections prioritize area over shape, and these “equal-area” maps are good for showing things like wildlife populations or deforestation. Others balance the two, in an effort to preserve area and shape as best as possible."}, {"4286": "Gall-Peters Projection"}, {"afce": "Cartographers have been debating the usefulness of certain projections for centuries. The Gall-Peters map, in particular, has an interesting history. It was originally presented at a scientific convention in 1855 by John Gall, an English astronomer. Despite a lackluster reception at the convention, Gall published a paper on the map 30 years later, in 1885. It did not gain much support from scientists, navigators or cartographers at the time, because when maps were primarily used for navigation there was no need for such a distorted map. Over 100 years later, in the 1970s, German activist and historian Arno Peters brought it back to life. Peters believed he had created a completely new way to look at the world, but cartographers recognized it as incredibly similar to the Gall map. The projection was given both names — Gall-Peters — and began to draw criticism from geographers around the world."}, {"c5fe": "Peters was a brilliant marketer, however, so he was not discouraged."}, {"3e33": "Instead of taking his map to scientists and cartographers, he recognized that it could be valuable to aid organizations that focused on equatorial areas. These aid organizations had long struggled with finding maps to use that did not further hurt their cause. After all, in the Mercator projection the poles and equator are distorted so that equatorial areas appear much smaller than they are in real life, and the poles are presented as much bigger. This is because the Mercator map was created for navigation, and by preserving shape over area, travel routes could be planned easily and accurately from thousands of miles away. However, as a consequence of the distortion, Africa and South America are displayed much, much smaller than they really are, and the mid-latitudes (Europe, America) are hardly distorted at all."}, {"89e6": "When administrators at Boston Public Schools talk about decolonizing their curriculum, they’re referring to the fact that the Mercator map, though originally used for navigation and created more than 400 years ago, has taken on a larger meaning that has led people to assume that Africa and South America are small, weak continents, while Europe and the North America are large, powerful land masses."}, {"d1cc": "Aid organizations saw a map that projected the world in a vastly different way, with Africa and South America displayed true to size, and they knew this would help their cause and could become an excellent marketing tool. Peters was thrilled."}, {"636e": "The Gall-Peters map is still used by some organizations, including the Vatican (and its African missions) and UNESCO. However, it has largely fallen into obscurity. Many map publishers do not print the map as part of their standard offerings, and most geographical organizations prefer projections such as the Winkel Tripel (National Geographic) or the Robinson (Rand McNally) for their balance of area and shape distortion. The Winkel Tripel is a very common projection, where both shape and scale are considered and adjusted to produce a reasonable map. The Robinson is a little older, and was designed so that the lines on the map created an aesthetically pleasing image with minimal and well-balanced distortion. Of course, the Mercator is still incredibly common. It’s the map we see most frequently. Google Maps uses it in their cell phone and web apps, and there’s a good reason for it: There is no other navigational map that is as accurate on a global scale as Mercator. While it’s easy to criticize, the truth is that the “Age of Discovery” could have easily been the “Age of Sunken Ships” if it weren’t for Mercator."}, {"3e7d": "If the administrators of Boston Public Schools are interested in portraying the world accurately in their geography curriculum, favoring a Gall-Peters map does not help."}, {"d744": "It is a great tool to get the discussion of projections going, and to make students think about the maps they’ve gotten used to seeing — in fact, it was famously shown on the West Wing for this exact reason."}, {"fdab": "While the West Wing clip, featuring the fictional “Organization of Cartographers for Social Equality,” has driven actual cartographers crazy for years, it brought the issue of projections and distortion, as well as the idea that maps have messages and meaning, to the public eye. It almost seems as if the Boston public school district made this decision by consulting fictional cartography societies rather than speaking to actual cartographers or geographers about the best way to approach revising a geography curriculum. I believe that if they had actually asked experts in the field, the experts would have responded with a question: Why are you choosing to focus on one just projection? Why not combine it with a globe and other maps that are readily available online?"}, {"a096": "Not to say that maps aren’t useful — you can’t fold up a globe and carry it in your pocket. Back when large-scale maps had to be printed and hung in every classroom, it made sense for publishers to pick one or two projections, bundle them together, and sell them. Typically, this resulted in printing the very common Mercator for the world and Robinson for the United States, which was the well-balanced projection that Rand McNally chose to print."}, {"c129": "In the age of technology, though, there is no reason to endorse one projection over another in the classroom."}, {"a31b": "Mercator Projection"}, {"a106": "Instead, geography lessons should include multiple maps and discussions about what story each map is presenting, what it would be most useful for and what are the flaws and strengths of each projection. Hundreds of projections are easy to pull up online. In fact, I recently advised a local New Jersey school on expanding their geography curriculum, and we found that the Jason Davies’ map projection transition slider helped the students understand the challenges of projecting a 3-D sphere onto a 2-D surface far better than looking at flat maps on paper. The first day with the Davies’ map projection slider had students talking about conformal, equal area, and azimuthal map projections with more excitement than the teachers had seen in years."}, {"569a": "Winkel Tripel Projection"}, {"d1ef": "While the Boston public school system is right to move away from focusing solely on the Mercator projection, that’s because schools should be moving away from focusing on single projections entirely. Geographers joke that “map projections are liars” because it’s true — each one has distortions, each one has flaws. While some are inherently more useful than others, and some are more balanced than others, none tells the whole truth of both area and shape."}, {"4215": "If Boston Public Schools want to talk about maps, the best way to approach the subject is to present multiple maps, explain their strengths and weaknesses and compare them to accurate globes to truly understand the sizes and shapes of the world’s land masses. Choosing just one map does nothing but short the students of an entire world waiting to be discussed."}, {"a1b0": "Bright is made possible by funding from the Bill & Melinda Gates Foundation. Bright retains editorial independence. If you’d like to reproduce this on your site for noncommercial purposes, please contact us. Follow us on Facebook and Twitter."}], "content": "Opinion Here’s Why Students Need Many Maps to Understand the World In an effort to “decolonize” the curriculum and show the true size of Africa and Latin America, Boston is using another flawed map. Recently, administrators at Boston Public Schools announced they would switch to using the Gall-Peters map in their classrooms, and move away from the more common and much older Mercator map. Billed as an effort to “decolonize” the curriculum, the school district, with a school population that’s largely black and Latino, is phasing out Mercator in the first step of a three-year restructuring plan. This is an unprecedented and strange move — after all, no map projection is a truly accurate depiction of a three-dimensional surface, and all maps cause some kind of distortion. Sure, it’s true that some distort more than others. In fact, the Gall-Peters map distorts shape so extremely at the equator and at the poles that its most frequent use is not for navigation or land-area study, but as a sharp contrast to the maps that we are used to seeing. While I strongly believe that there is no real reason to use a Gall-Peters map extensively, its use could be valuable if it’s compared and contrasted to other projections. A map projection is a transfer of the earth’s latitudes and longitudes from a sphere to a plane — or, put more simply, the flattening of a globe to display the earth on a two-dimensional surface. Because this is not easy to do, all projections suffer from some sort of distortion. (Imagine peeling an orange so that the skin will lay completely flat. It’s not possible, there will be tears and bumps along the surface.) Cartographers have created thousands of map projections, and the versions have various uses. Some projections prioritize shape over area, and these “conformal” maps are good for navigation. Some projections prioritize area over shape, and these “equal-area” maps are good for showing things like wildlife populations or deforestation. Others balance the two, in an effort to preserve area and shape as best as possible. Gall-Peters Projection Cartographers have been debating the usefulness of certain projections for centuries. The Gall-Peters map, in particular, has an interesting history. It was originally presented at a scientific convention in 1855 by John Gall, an English astronomer. Despite a lackluster reception at the convention, Gall published a paper on the map 30 years later, in 1885. It did not gain much support from scientists, navigators or cartographers at the time, because when maps were primarily used for navigation there was no need for such a distorted map. Over 100 years later, in the 1970s, German activist and historian Arno Peters brought it back to life. Peters believed he had created a completely new way to look at the world, but cartographers recognized it as incredibly similar to the Gall map. The projection was given both names — Gall-Peters — and began to draw criticism from geographers around the world. Peters was a brilliant marketer, however, so he was not discouraged. Instead of taking his map to scientists and cartographers, he recognized that it could be valuable to aid organizations that focused on equatorial areas. These aid organizations had long struggled with finding maps to use that did not further hurt their cause. After all, in the Mercator projection the poles and equator are distorted so that equatorial areas appear much smaller than they are in real life, and the poles are presented as much bigger. This is because the Mercator map was created for navigation, and by preserving shape over area, travel routes could be planned easily and accurately from thousands of miles away. However, as a consequence of the distortion, Africa and South America are displayed much, much smaller than they really are, and the mid-latitudes (Europe, America) are hardly distorted at all. When administrators at Boston Public Schools talk about decolonizing their curriculum, they’re referring to the fact that the Mercator map, though originally used for navigation and created more than 400 years ago, has taken on a larger meaning that has led people to assume that Africa and South America are small, weak continents, while Europe and the North America are large, powerful land masses. Aid organizations saw a map that projected the world in a vastly different way, with Africa and South America displayed true to size, and they knew this would help their cause and could become an excellent marketing tool. Peters was thrilled. The Gall-Peters map is still used by some organizations, including the Vatican (and its African missions) and UNESCO. However, it has largely fallen into obscurity. Many map publishers do not print the map as part of their standard offerings, and most geographical organizations prefer projections such as the Winkel Tripel (National Geographic) or the Robinson (Rand McNally) for their balance of area and shape distortion. The Winkel Tripel is a very common projection, where both shape and scale are considered and adjusted to produce a reasonable map. The Robinson is a little older, and was designed so that the lines on the map created an aesthetically pleasing image with minimal and well-balanced distortion. Of course, the Mercator is still incredibly common. It’s the map we see most frequently. Google Maps uses it in their cell phone and web apps, and there’s a good reason for it: There is no other navigational map that is as accurate on a global scale as Mercator. While it’s easy to criticize, the truth is that the “Age of Discovery” could have easily been the “Age of Sunken Ships” if it weren’t for Mercator. If the administrators of Boston Public Schools are interested in portraying the world accurately in their geography curriculum, favoring a Gall-Peters map does not help. It is a great tool to get the discussion of projections going, and to make students think about the maps they’ve gotten used to seeing — in fact, it was famously shown on the West Wing for this exact reason. While the West Wing clip, featuring the fictional “Organization of Cartographers for Social Equality,” has driven actual cartographers crazy for years, it brought the issue of projections and distortion, as well as the idea that maps have messages and meaning, to the public eye. It almost seems as if the Boston public school district made this decision by consulting fictional cartography societies rather than speaking to actual cartographers or geographers about the best way to approach revising a geography curriculum. I believe that if they had actually asked experts in the field, the experts would have responded with a question: Why are you choosing to focus on one just projection? Why not combine it with a globe and other maps that are readily available online? Not to say that maps aren’t useful — you can’t fold up a globe and carry it in your pocket. Back when large-scale maps had to be printed and hung in every classroom, it made sense for publishers to pick one or two projections, bundle them together, and sell them. Typically, this resulted in printing the very common Mercator for the world and Robinson for the United States, which was the well-balanced projection that Rand McNally chose to print. In the age of technology, though, there is no reason to endorse one projection over another in the classroom. Mercator Projection Instead, geography lessons should include multiple maps and discussions about what story each map is presenting, what it would be most useful for and what are the flaws and strengths of each projection. Hundreds of projections are easy to pull up online. In fact, I recently advised a local New Jersey school on expanding their geography curriculum, and we found that the Jason Davies’ map projection transition slider helped the students understand the challenges of projecting a 3-D sphere onto a 2-D surface far better than looking at flat maps on paper. The first day with the Davies’ map projection slider had students talking about conformal, equal area, and azimuthal map projections with more excitement than the teachers had seen in years. Winkel Tripel Projection While the Boston public school system is right to move away from focusing solely on the Mercator projection, that’s because schools should be moving away from focusing on single projections entirely. Geographers joke that “map projections are liars” because it’s true — each one has distortions, each one has flaws. While some are inherently more useful than others, and some are more balanced than others, none tells the whole truth of both area and shape. If Boston Public Schools want to talk about maps, the best way to approach the subject is to present multiple maps, explain their strengths and weaknesses and compare them to accurate globes to truly understand the sizes and shapes of the world’s land masses. Choosing just one map does nothing but short the students of an entire world waiting to be discussed. Bright is made possible by funding from the Bill & Melinda Gates Foundation. Bright retains editorial independence. If you’d like to reproduce this on your site for noncommercial purposes, please contact us. Follow us on Facebook and Twitter. ", "title": "Here’s Why Students Need Many Maps to Understand the World", "parent": "", "name": "2462", "timestamp": "Apr 12", "author": "Kim Magaraci", "child": "2462_1\t2462_2\t2462_3\t2462_4\t2462_5\t2462_6\t2462_7\t2462_8\t2462_9\t2462_10\t2462_11\t2462_12\t2462_13\t2462_14\t2462_15\t2462_16\t2462_17\t2462_18\t2462_19\t2462_20\t2462_21\t2462_22\t2462_23\t2462_24\t2462_252462_1\t2462_2\t2462_3\t2462_4\t2462_5\t2462_6\t2462_7\t2462_8\t2462_9\t2462_10\t2462_11\t2462_12\t2462_13\t2462_14\t2462_15\t2462_16\t2462_17\t2462_18\t2462_19\t2462_20\t2462_21\t2462_22\t2462_23\t2462_24\t2462_252462_1\t2462_2\t2462_3\t2462_4\t2462_5\t2462_6\t2462_7\t2462_8\t2462_9\t2462_10\t2462_11\t2462_12\t2462_13\t2462_14\t2462_15\t2462_16\t2462_17\t2462_18\t2462_19\t2462_20\t2462_21\t2462_22\t2462_23\t2462_24\t2462_25"}