{"sentences": [{"ce86": "An illustration of the full suite of planets discovered by Kepler. (Image credit: NASA /W. Stenzel)"}, {"cb19": "There’s no such thing as a ‘habitable Super-Earth’"}, {"870f": "Earth is pretty much the limit of how large you can get and still be rocky. Anything much larger, and you’re a gas giant."}, {"0492": "“How vast those Orbs must be, and how inconsiderable this Earth, the Theatre upon which all our mighty Designs, all our Navigations, and all our Wars are transacted, is when compared to them.” -Christiaan Huygens"}, {"6fe9": "For a long time, we thought our Solar System was the template for the planets we’d find in the Universe. Inner, rocky worlds dominate the hottest part of the Solar System, with large, gaseous planets orbiting much farther out. The largest rocky planet was Earth; the smallest gas giant was Uranus; the mass difference between the two was a factor of 17, with Uranus having four times Earth’s radius. So it was quite a surprise when exoplanet discoveries started rolling in. Not only can planets of various sizes and masses appear anywhere in a solar system’s orbit, but of all the mass-and-size combinations out there, the most common type of planet is one we don’t have at all: a Super-Earth."}, {"02dd": "The most common “sized” world in the galaxy is a super-Earth, between 2 and 10 Earth masses, like Kepler 452b, right. Where is ours? (Image credit: NASA/Ames/JPL-Caltech/T. Pyle)"}, {"c57b": "Categorized as being between two and 10 times the mass of Earth (and with an appropriately scaled-up radius), Super-Earths outnumber any other class of planet, including the Neptune-like worlds, the Jupiter-like worlds, Earth-like worlds (and smaller) and anything else we’ve been able to detect. A large number of possibilities abounded at this discovery, but even more questions ensued. Such as:"}, {"c892": "The numbers of planets discovered by Kepler sorted by their size distribution, as of May 2016, when the largest haul of new exoplanets was released. Super-Earth/mini-Neptune worlds are by far the most common. (Image credit: NASA Ames / W. Stenzel)"}, {"9079": "Recent reports would have you believe that the answer to that last question is “yes,” and that these worlds might be home to the realizations of our extraterrestrial dreams. But a cold, hard look at the scientific facts — and at the physics behind planetary science — puts the kibosh on that in no uncertain terms. In fact, the most up-to-date science tells us that the very idea that there is such a thing as a “Super-Earth” is a failing on our part."}, {"23c5": "The assumption that worlds just a little bit larger/more massive than Earth would be rocky may be erroneous, and may cause us to eliminate a large fraction of what were previously classified as potentially habitable worlds. (Image credit: PHL at University of Puerto Rico Arecibo (phl.upr.edu))"}, {"f0af": "The planets that we’re searching for, ostensibly, are the ones that are the most Earth-like: with similar compositions, atmospheres, masses, temperatures and other conditions to our world. But until we actually find life on another world — or learn a whole lot more about these planets we’re only beginning to discover — we can’t be sure which conditions are mandatory for intelligent life and which ones are mere happenstance. When we classify worlds as Earth-like, we look to their radius and how much energy they receive from their star."}, {"9721": "Although many of the Earth-like candidates from Kepler are close to Earth in physical size, they may be more like Neptune than Earth if they have a thick H/He envelope around them. (Image credit: NASA Ames / N. Batalha and W. Stenzel)"}, {"efa0": "In the past, we’ve typically said that if these worlds are approximately the size of Earth and receiving approximately as much energy-per-square-meter as Earth, these are likely Earth-like worlds. But this was an assumption that we made prior to having enough data to draw a conclusion. While NASA’s Kepler mission brought us lots of information about a planet’s radius and orbital parameters, it’s impossible to tell whether a world is gassy like Uranus (or Neptune) or rocky like Earth without also measuring its mass. But thanks to follow-up observations of their pull on their parent star, we’ve obtained the mass for hundreds of these worlds. And the conclusion they point to is damning."}, {"f29e": "The classification scheme of planets as either rocky, Neptune-like, Jupiter-like or stellar-like. (Image credit: Chen and Kipping, 2016, via https://arxiv.org/pdf/1603.08614v2.pdf)"}, {"d45b": "What they find is that the transition from “rocky” world to “gaseous” world occurs at just twice the Earth’s mass. If you’re more that twice the mass of Earth and you receive the same amount of energy from your star, you’ll be able to hold onto a substantial hydrogen-and-helium envelope of gas, creating an atmospheric pressure that’s hundreds or even thousands of times as great as what we have on Earth’s surface. The hope that Super-Earth worlds would be Earth-like is shattered, and we can safely put Super-Earths, Mini-Neptunes and Neptune-like worlds into the same overall category."}, {"6e94": "While a visual inspection shows a large gap between Earth-size and Neptune-size worlds, the reality is you can only be about 25% larger than Earth and still be rocky. Anything larger, and you’re more of a gas giant. (Image credit: Lunar and Planetary Institute)"}, {"0ebb": "We can, however, have rocky worlds that are substantially larger than Earth. It’s even fair to call them “rocky Super-Earths” if you like, but they’re even more certain to be inhospitable. You see, if you had a Neptune-like world that was too close to its parent star, the intense radiation would boil off not only the hydrogen and helium, but the majority (or even all) of the atmosphere on the world entirely. You’d be left with a dense, rocky world like Mercury, except one that was larger and more massive than Earth. In fact, if you were to put Jupiter very close to the Sun, its entire gas envelope would boil away, leaving a rocky Super-Earth behind."}, {"fff5": "A cutaway of Jupiter’s interior. If all the atmospheric layers were stripped away, the core would appear to be a rocky Super-Earth. (Image credit: Wikimedia Commons user Kelvinsong)"}, {"277f": "No matter how you slice it, however, these Super-Earth worlds are destined to be nothing like Earth at all. If you’re far enough from your Sun to have Earth-like temperatures, you’ll be buried under a thick layer of atmosphere. If you’re close enough to boil away the thick atmosphere, you’ll have to be close enough to roast your world."}, {"ebcc": "An artist’s illustration of a hot Jupiter world. If you’re hot enough to boil off the atmosphere, you can wind up with a rocky Super-Earth, but the temperatures will be so high that you’ll roast your planet. (Image credit: ATG medialab, ESA)"}, {"0de1": "The most common-massed planet in the Universe might not be represented among our Solar System, but it’s important to remember that even calling a world a “Super-Earth” is evidence of our bias. As scientists Jingjing Chen and David Kipping remind us:"}, {"bde5": "The large number of 2–10 [Earth mass] planets discovered is often cited as evidence that Super-Earths are very common and thus Solar System’s makeup is unusual… However, if the boundary between Terran and Neptunian worlds is shifted down to 2 [Earth masses], the Solar System is no longer unusual. Indeed, by our definition three of the eight Solar System planets are Neptunian worlds, which are the most common type of planet around other Sun-like stars."}, {"26ec": "But if you insist on calling these worlds Super-Earths, the conclusion is inescapable: whether gaseous or rocky, a Super-Earth is no place for a human."}], "content": "An illustration of the full suite of planets discovered by Kepler. (Image credit: NASA /W. Stenzel) There’s no such thing as a ‘habitable Super-Earth’ Earth is pretty much the limit of how large you can get and still be rocky. Anything much larger, and you’re a gas giant. “How vast those Orbs must be, and how inconsiderable this Earth, the Theatre upon which all our mighty Designs, all our Navigations, and all our Wars are transacted, is when compared to them.” -Christiaan Huygens For a long time, we thought our Solar System was the template for the planets we’d find in the Universe. Inner, rocky worlds dominate the hottest part of the Solar System, with large, gaseous planets orbiting much farther out. The largest rocky planet was Earth; the smallest gas giant was Uranus; the mass difference between the two was a factor of 17, with Uranus having four times Earth’s radius. So it was quite a surprise when exoplanet discoveries started rolling in. Not only can planets of various sizes and masses appear anywhere in a solar system’s orbit, but of all the mass-and-size combinations out there, the most common type of planet is one we don’t have at all: a Super-Earth. The most common “sized” world in the galaxy is a super-Earth, between 2 and 10 Earth masses, like Kepler 452b, right. Where is ours? (Image credit: NASA/Ames/JPL-Caltech/T. Pyle) Categorized as being between two and 10 times the mass of Earth (and with an appropriately scaled-up radius), Super-Earths outnumber any other class of planet, including the Neptune-like worlds, the Jupiter-like worlds, Earth-like worlds (and smaller) and anything else we’ve been able to detect. A large number of possibilities abounded at this discovery, but even more questions ensued. Such as: The numbers of planets discovered by Kepler sorted by their size distribution, as of May 2016, when the largest haul of new exoplanets was released. Super-Earth/mini-Neptune worlds are by far the most common. (Image credit: NASA Ames / W. Stenzel) Recent reports would have you believe that the answer to that last question is “yes,” and that these worlds might be home to the realizations of our extraterrestrial dreams. But a cold, hard look at the scientific facts — and at the physics behind planetary science — puts the kibosh on that in no uncertain terms. In fact, the most up-to-date science tells us that the very idea that there is such a thing as a “Super-Earth” is a failing on our part. The assumption that worlds just a little bit larger/more massive than Earth would be rocky may be erroneous, and may cause us to eliminate a large fraction of what were previously classified as potentially habitable worlds. (Image credit: PHL at University of Puerto Rico Arecibo (phl.upr.edu)) The planets that we’re searching for, ostensibly, are the ones that are the most Earth-like: with similar compositions, atmospheres, masses, temperatures and other conditions to our world. But until we actually find life on another world — or learn a whole lot more about these planets we’re only beginning to discover — we can’t be sure which conditions are mandatory for intelligent life and which ones are mere happenstance. When we classify worlds as Earth-like, we look to their radius and how much energy they receive from their star. Although many of the Earth-like candidates from Kepler are close to Earth in physical size, they may be more like Neptune than Earth if they have a thick H/He envelope around them. (Image credit: NASA Ames / N. Batalha and W. Stenzel) In the past, we’ve typically said that if these worlds are approximately the size of Earth and receiving approximately as much energy-per-square-meter as Earth, these are likely Earth-like worlds. But this was an assumption that we made prior to having enough data to draw a conclusion. While NASA’s Kepler mission brought us lots of information about a planet’s radius and orbital parameters, it’s impossible to tell whether a world is gassy like Uranus (or Neptune) or rocky like Earth without also measuring its mass. But thanks to follow-up observations of their pull on their parent star, we’ve obtained the mass for hundreds of these worlds. And the conclusion they point to is damning. The classification scheme of planets as either rocky, Neptune-like, Jupiter-like or stellar-like. (Image credit: Chen and Kipping, 2016, via https://arxiv.org/pdf/1603.08614v2.pdf) What they find is that the transition from “rocky” world to “gaseous” world occurs at just twice the Earth’s mass. If you’re more that twice the mass of Earth and you receive the same amount of energy from your star, you’ll be able to hold onto a substantial hydrogen-and-helium envelope of gas, creating an atmospheric pressure that’s hundreds or even thousands of times as great as what we have on Earth’s surface. The hope that Super-Earth worlds would be Earth-like is shattered, and we can safely put Super-Earths, Mini-Neptunes and Neptune-like worlds into the same overall category. While a visual inspection shows a large gap between Earth-size and Neptune-size worlds, the reality is you can only be about 25% larger than Earth and still be rocky. Anything larger, and you’re more of a gas giant. (Image credit: Lunar and Planetary Institute) We can, however, have rocky worlds that are substantially larger than Earth. It’s even fair to call them “rocky Super-Earths” if you like, but they’re even more certain to be inhospitable. You see, if you had a Neptune-like world that was too close to its parent star, the intense radiation would boil off not only the hydrogen and helium, but the majority (or even all) of the atmosphere on the world entirely. You’d be left with a dense, rocky world like Mercury, except one that was larger and more massive than Earth. In fact, if you were to put Jupiter very close to the Sun, its entire gas envelope would boil away, leaving a rocky Super-Earth behind. A cutaway of Jupiter’s interior. If all the atmospheric layers were stripped away, the core would appear to be a rocky Super-Earth. (Image credit: Wikimedia Commons user Kelvinsong) No matter how you slice it, however, these Super-Earth worlds are destined to be nothing like Earth at all. If you’re far enough from your Sun to have Earth-like temperatures, you’ll be buried under a thick layer of atmosphere. If you’re close enough to boil away the thick atmosphere, you’ll have to be close enough to roast your world. An artist’s illustration of a hot Jupiter world. If you’re hot enough to boil off the atmosphere, you can wind up with a rocky Super-Earth, but the temperatures will be so high that you’ll roast your planet. (Image credit: ATG medialab, ESA) The most common-massed planet in the Universe might not be represented among our Solar System, but it’s important to remember that even calling a world a “Super-Earth” is evidence of our bias. As scientists Jingjing Chen and David Kipping remind us: The large number of 2–10 [Earth mass] planets discovered is often cited as evidence that Super-Earths are very common and thus Solar System’s makeup is unusual… However, if the boundary between Terran and Neptunian worlds is shifted down to 2 [Earth masses], the Solar System is no longer unusual. Indeed, by our definition three of the eight Solar System planets are Neptunian worlds, which are the most common type of planet around other Sun-like stars. But if you insist on calling these worlds Super-Earths, the conclusion is inescapable: whether gaseous or rocky, a Super-Earth is no place for a human. ", "title": "There’s no such thing as a ‘habitable Super-Earth’", "parent": "", "name": "2476", "timestamp": "Feb 23", "author": "Ethan Siegel", "child": "2476_1\t2476_2\t2476_3\t2476_4\t2476_5\t2476_6\t2476_7\t2476_8\t2476_9\t2476_10\t2476_112476_1\t2476_2\t2476_3\t2476_4\t2476_5\t2476_6\t2476_7\t2476_8\t2476_9\t2476_10\t2476_11"}