{"sentences": [{"ff23": "What percentage of Earth’s landmass is in agricultural use?"}, {"e0c9": "According to an article on Seattle PI quoting a 2005 National Geographic study, 40% of Earth’s landmass is agricultural land."}, {"d546": "How Much of the Earth's Land Mass Is Devoted to Agriculture?Use of the Earth's land for agricultural purposes, which includes areas permanently used for crops or pastures for…education.seattlepi.com"}, {"23c1": "40% of the total 29% landmass equals 11.6%… which roughly fits with an article on Farm Futures saying that 12% of the Earth’s surface is crop land:"}, {"7363": "Global Data Finds 12% of Earth's Surface in CroplandFood and Agriculture Organization database aggregates land cover data; finds more bare soils than cropland globally…farmfutures.com"}, {"3d62": "See also: FAO Global Land Cover Network (database):"}, {"1723": "GLCN: databasesGlobal Land Cover Network (GLCN): The global alliance for standard multi-purpose land cover data productionwww.glcn.org"}], "content": "What percentage of Earth’s landmass is in agricultural use? According to an article on Seattle PI quoting a 2005 National Geographic study, 40% of Earth’s landmass is agricultural land. How Much of the Earth's Land Mass Is Devoted to Agriculture?Use of the Earth's land for agricultural purposes, which includes areas permanently used for crops or pastures for…education.seattlepi.com 40% of the total 29% landmass equals 11.6%… which roughly fits with an article on Farm Futures saying that 12% of the Earth’s surface is crop land: Global Data Finds 12% of Earth's Surface in CroplandFood and Agriculture Organization database aggregates land cover data; finds more bare soils than cropland globally…farmfutures.com See also: FAO Global Land Cover Network (database): GLCN: databasesGlobal Land Cover Network (GLCN): The global alliance for standard multi-purpose land cover data productionwww.glcn.org ", "title": "What percentage of Earth’s landmass is in agricultural use?", "parent": "", "name": "2478", "timestamp": "Sep 18, 2016", "author": "Tim Boucher", "child": "2478_1\t2478_2\t2478_3\t2478_4\t2478_5\t2478_6\t2478_7\t2478_8"}