{"sentences": [{"61a6": "7,000 massive methane gas bubbles under the Russian permafrost could explode anytime"}, {"35e3": "Scorching March brings Arctic temperatures up to 20°F warmer than normal."}, {"b3b4": "Crater formed from underground methane explosion in Siberia. CREDIT: Siberia Times"}, {"c72a": "Russian scientists have recently discovered some 7,000 underground methane bubbles in Siberia that could explode anytime."}, {"4e2d": "‘Their appearance at such high latitudes is most likely linked to thawing permafrost,” explained a Russian Academy of Science spokesperson, “which is in turn linked to overall rise of temperature on the north of Eurasia during last several decades.”"}, {"fcab": "Video of one of Russia’s methane bubbles, which have been called ‘trembling tundra’."}, {"1148": "This discovery is especially worrisome for three reasons. First, methane traps 86 times as much heat as CO2 over a 20-year period. Thawing permafrost creates both CO2 and methane (CH4), but most models of thawing permafrost assume only CO2 is created. If, as it appears, a lot of methane is being generated, then we’ll see even more extra warming than scientists have projected."}, {"781a": "Second, a recent study found global warming will defrost much more permafrost than we thought."}, {"ce38": "Earth’s melting permafrost threatens to unleash a dangerous climate feedback loopNew permafrost study underscores the critical importance of ambitious climate targets, like the Paris agreement.thinkprogress.org"}, {"7165": "Third, the permafrost has already been warming at an alarming rate. In general, the Arctic warms twice as fast as the planet as a whole."}, {"997e": "Last summer saw “an abnormally warm summer in 2016 on the Yamal peninsula” of Siberia where many of these bubbles have been found, noted the Russian Academy."}, {"435e": "But in March, Siberia again saw stunning temperatures, according to NASA’s latest monthly report. Globally, it was the second hottest March on record, losing out only to March 2016. Parts of Siberia and the Arctic were as much as 12.1°C (22°F) above the 1951–1980 average."}, {"1651": "NASA’s land and ocean temperature index (deviation from 1951–1980 average) for March. CREDIT: NASA"}, {"6c2c": "Finally, you may be wondering if the United States has any of these methane land mines, what are called “exploding” or “alternative” pingos. (A regular pingo is “mound of earth-covered ice,” so they don’t generally explode.)"}, {"d0b1": "Vladimir E. Romanovsky, a permafrost decay expert at the University of Alaska in Fairbanks, told the Washington Post that the methane-filled alternate pingos are “definitely related to warming,” and could appear in Canada or Alaska."}, {"392a": "“It is just a matter of time when some of those craters appear in North America as well,” Romanovsky said. Already, several pingos have emerged “right under the Alaskan pipeline,” the scientist said. If one of those bulges turned out to be an alternative pingo, that’s not good news, either."}], "content": "7,000 massive methane gas bubbles under the Russian permafrost could explode anytime Scorching March brings Arctic temperatures up to 20°F warmer than normal. Crater formed from underground methane explosion in Siberia. CREDIT: Siberia Times Russian scientists have recently discovered some 7,000 underground methane bubbles in Siberia that could explode anytime. ‘Their appearance at such high latitudes is most likely linked to thawing permafrost,” explained a Russian Academy of Science spokesperson, “which is in turn linked to overall rise of temperature on the north of Eurasia during last several decades.” Video of one of Russia’s methane bubbles, which have been called ‘trembling tundra’. This discovery is especially worrisome for three reasons. First, methane traps 86 times as much heat as CO2 over a 20-year period. Thawing permafrost creates both CO2 and methane (CH4), but most models of thawing permafrost assume only CO2 is created. If, as it appears, a lot of methane is being generated, then we’ll see even more extra warming than scientists have projected. Second, a recent study found global warming will defrost much more permafrost than we thought. Earth’s melting permafrost threatens to unleash a dangerous climate feedback loopNew permafrost study underscores the critical importance of ambitious climate targets, like the Paris agreement.thinkprogress.org Third, the permafrost has already been warming at an alarming rate. In general, the Arctic warms twice as fast as the planet as a whole. Last summer saw “an abnormally warm summer in 2016 on the Yamal peninsula” of Siberia where many of these bubbles have been found, noted the Russian Academy. But in March, Siberia again saw stunning temperatures, according to NASA’s latest monthly report. Globally, it was the second hottest March on record, losing out only to March 2016. Parts of Siberia and the Arctic were as much as 12.1°C (22°F) above the 1951–1980 average. NASA’s land and ocean temperature index (deviation from 1951–1980 average) for March. CREDIT: NASA Finally, you may be wondering if the United States has any of these methane land mines, what are called “exploding” or “alternative” pingos. (A regular pingo is “mound of earth-covered ice,” so they don’t generally explode.) Vladimir E. Romanovsky, a permafrost decay expert at the University of Alaska in Fairbanks, told the Washington Post that the methane-filled alternate pingos are “definitely related to warming,” and could appear in Canada or Alaska. “It is just a matter of time when some of those craters appear in North America as well,” Romanovsky said. Already, several pingos have emerged “right under the Alaskan pipeline,” the scientist said. If one of those bulges turned out to be an alternative pingo, that’s not good news, either. ", "title": "7,000 massive methane gas bubbles under the Russian permafrost could explode anytime", "parent": "", "name": "2480", "timestamp": "Apr 17", "author": "Joe Romm", "child": "2480_1\t2480_2\t2480_3\t2480_4\t2480_5\t2480_6\t2480_7\t2480_8\t2480_9\t2480_10\t2480_11"}