{"sentences": [{"6eea": "Kentucky coal company announces plans to build the state’s largest solar farm"}, {"59dd": "The company says the farm will give jobs to displaced coal miners."}, {"82a2": "A dump truck moves dirt and rock from a mountaintop removal coal mine in Kentucky. CREDIT: AP Photo/Roger Alford"}, {"e3f0": "A Kentucky coal company announced Tuesday that it is planning to build a solar farm on a reclaimed mountaintop removal coal mine and that the project would bring both jobs and energy to the area."}, {"b599": "Berkeley Energy Group, the coal company behind the project, billed it as the first large-scale solar farm in the Appalachian region, which has been hit hard by the decades-long decline in the U.S. coal industry. The company, in partnership with EDF Renewable Energy, is currently conducting feasibility studies for the project on two reclaimed strip mines, both located in the eastern part of the state. Berkeley Energy Group estimates that the solar farm could produce as much as 50 or 100 megawatts of electricity, which would be five to ten times the size of Kentucky’s largest solar farm."}, {"914c": "Berkeley Energy Group’s project development executive told the Louisville Courier-Journal that the company did not intend to replace its coal production with the solar farm, but instead viewed the project as a chance to reclaim used land while creating job growth in the area."}, {"f528": "“I grew up with coal,” said Ryan Johns, BEG project development executive. “Our company has been in the coal business for 30 years. We are not looking at this as trying to replace coal, but we have already extracted the coal from this area.”"}, {"e5c1": "Energy experts give Trump the hard truth: You can’t bring coal backCoal wasn’t killed by a political “war” — cheap renewables and fracked gas were the culprits.thinkprogress.org"}, {"040d": "Coal, which for decades has been the primary source of electricity production in the United States, has suffered from competition with cheaper sources of energy like natural gas, as well as solar and wind. Increased automation and stronger environmental regulations have also pushed the industry into decline. According to the Louisville Courier-Journal, coal extraction in Eastern Kentucky fell from 23 million tons in 2008 to about 5 million tons last year. Over the same period of time, mining employment dropped from 14,373 to 3,833."}, {"e1a7": "As a candidate, President Trump seized on the high unemployment among coal miners in Appalachia, promising that he would bring coal mining back if elected president. In office, he has signed a handful of orders and laws that he argues will help bolster the declining industry — though energy experts, coal executives, and even Republican politicians contend that the market for coal looks bleak and that Trump’s orders will do little to change that."}, {"41c1": "At the same time, renewable energy employment has been increasing across the country. According to a Sierra Club analysis published earlier this year, clean energy employs more people that fossil fuel jobs by more than 2.5 to one — and renewable energy jobs exceed fossil fuel jobs in almost every state. In recent years, solar and wind jobs have grown at a rate 12 times faster than the rest of the U.S. economy."}, {"992c": "Clean energy employs more people than fossil fuels in nearly every U.S. stateTrump’s upcoming executive order meant to boost fossil fuel jobs may end up harming an even bigger job creator …thinkprogress.org"}, {"ef9b": "Former Kentucky Auditor Adam Edelen, who is involved in the solar farm project, told the Louisville Courier-Journal that interest in the project has so far been high, citing the compelling narrative of bringing in new jobs for unemployed coal workers and the partnership between renewable energy and coal. And many companies based in Kentucky are looking to renewable energy as a way to lessen their carbon footprint, pushing the state to embrace forms of energy other than coal. Kentucky, unlike many states in the nation, does not have a renewable portfolio standard — and the state’s supply of cheap of coal makes it hard for renewables to compete there."}, {"e726": "Still, if the Berkeley Energy Group’s solar farm is completed, Kentucky would hardly be the first deep-red state to embrace large-scale renewable energy. Texas, Iowa, and Oklahoma are the top three states in the country when it comes to installed wind capacity, with Kansas coming in fifth (behind California). And when it comes to solar, North Carolina, Arizona, and Nevada are the second, third, and fourth states in the nation with regards to installed solar capacity."}], "content": "Kentucky coal company announces plans to build the state’s largest solar farm The company says the farm will give jobs to displaced coal miners. A dump truck moves dirt and rock from a mountaintop removal coal mine in Kentucky. CREDIT: AP Photo/Roger Alford A Kentucky coal company announced Tuesday that it is planning to build a solar farm on a reclaimed mountaintop removal coal mine and that the project would bring both jobs and energy to the area. Berkeley Energy Group, the coal company behind the project, billed it as the first large-scale solar farm in the Appalachian region, which has been hit hard by the decades-long decline in the U.S. coal industry. The company, in partnership with EDF Renewable Energy, is currently conducting feasibility studies for the project on two reclaimed strip mines, both located in the eastern part of the state. Berkeley Energy Group estimates that the solar farm could produce as much as 50 or 100 megawatts of electricity, which would be five to ten times the size of Kentucky’s largest solar farm. Berkeley Energy Group’s project development executive told the Louisville Courier-Journal that the company did not intend to replace its coal production with the solar farm, but instead viewed the project as a chance to reclaim used land while creating job growth in the area. “I grew up with coal,” said Ryan Johns, BEG project development executive. “Our company has been in the coal business for 30 years. We are not looking at this as trying to replace coal, but we have already extracted the coal from this area.” Energy experts give Trump the hard truth: You can’t bring coal backCoal wasn’t killed by a political “war” — cheap renewables and fracked gas were the culprits.thinkprogress.org Coal, which for decades has been the primary source of electricity production in the United States, has suffered from competition with cheaper sources of energy like natural gas, as well as solar and wind. Increased automation and stronger environmental regulations have also pushed the industry into decline. According to the Louisville Courier-Journal, coal extraction in Eastern Kentucky fell from 23 million tons in 2008 to about 5 million tons last year. Over the same period of time, mining employment dropped from 14,373 to 3,833. As a candidate, President Trump seized on the high unemployment among coal miners in Appalachia, promising that he would bring coal mining back if elected president. In office, he has signed a handful of orders and laws that he argues will help bolster the declining industry — though energy experts, coal executives, and even Republican politicians contend that the market for coal looks bleak and that Trump’s orders will do little to change that. At the same time, renewable energy employment has been increasing across the country. According to a Sierra Club analysis published earlier this year, clean energy employs more people that fossil fuel jobs by more than 2.5 to one — and renewable energy jobs exceed fossil fuel jobs in almost every state. In recent years, solar and wind jobs have grown at a rate 12 times faster than the rest of the U.S. economy. Clean energy employs more people than fossil fuels in nearly every U.S. stateTrump’s upcoming executive order meant to boost fossil fuel jobs may end up harming an even bigger job creator …thinkprogress.org Former Kentucky Auditor Adam Edelen, who is involved in the solar farm project, told the Louisville Courier-Journal that interest in the project has so far been high, citing the compelling narrative of bringing in new jobs for unemployed coal workers and the partnership between renewable energy and coal. And many companies based in Kentucky are looking to renewable energy as a way to lessen their carbon footprint, pushing the state to embrace forms of energy other than coal. Kentucky, unlike many states in the nation, does not have a renewable portfolio standard — and the state’s supply of cheap of coal makes it hard for renewables to compete there. Still, if the Berkeley Energy Group’s solar farm is completed, Kentucky would hardly be the first deep-red state to embrace large-scale renewable energy. Texas, Iowa, and Oklahoma are the top three states in the country when it comes to installed wind capacity, with Kansas coming in fifth (behind California). And when it comes to solar, North Carolina, Arizona, and Nevada are the second, third, and fourth states in the nation with regards to installed solar capacity. ", "title": "Kentucky coal company announces plans to build the state’s largest solar farm", "parent": "", "name": "2483", "timestamp": "Apr 19", "author": "Natasha Geiling", "child": "2483_1\t2483_2\t2483_3\t2483_4\t2483_5"}