{"sentences": [{"b68b": "Leaked Trump administration plan to close Chicago EPA office puts 1,000 jobs at risk"}, {"deb0": "Great Lakes threatened by reported move to close regional office."}, {"83a4": "In this Aug. 3, 2014, photo, an algae bloom covers a portion of Lake Erie near a Toledo, Ohio, water intake crib. CREDIT: AP Photo/Haraz N. Ghanbari"}, {"0424": "President Donald Trump’s proposed cutbacks to the Environmental Protection Agency may include the closure of the agency’s regional office in Chicago, a move that could undermine the agency’s ability to monitor pollution in the Great Lakes and curtail its ability to implement enforcement actions against coal-fired power plant owners in the six-state region."}, {"fbfe": "The workforce for the Chicago Region 5 office would be consolidated with the EPA office in Kansas, the Chicago Sun-Times reported, citing anonymous sources. Trump’s budget chief Mick Mulvaney singled out the EPA as a target for budget cuts and the agency, under the leadership of former Oklahoma attorney general Scott Pruitt, was tasked with choosing two regional office for closure by June 15. The identity of the other regional office has yet to be disclosed."}, {"673e": "“This decision doesn’t make sense from an efficiency standpoint. Instead, this decision makes sense from an ideological standpoint,” Nicole Cantello, the head of the union representing agency employees in the region, told ThinkProgress. She received leaked information about the possible closure of the regional office and believes it accurately represents the intentions of the Trump administration."}, {"a16e": "Cantello, who also works as a lawyer in the EPA Region 5 office, added: “If you wanted to drive a stake through the heart of EPA enforcement and EPA’s ability to protect the country, this would be one way of doing it.”"}, {"7e20": "“This decision doesn’t make sense from an efficiency standpoint.”"}, {"6dab": "News about the Trump administration’s plans to close the Chicago EPA office leaked the same week the agency discovered a potentially carcinogenic chemical had spilled from a U.S. Steel facility in Indiana into a tributary of Lake Michigan. U.S. Steel reported last Tuesday that it leaked an unknown amount of wastewater containing hexavalent chromium into a waterway in Portage, Indiana, within 100 yards of the lake."}, {"571e": "The Region 5 office oversees environmental protection in six states surrounding the Great Lakes: Illinois, Indiana, Michigan, Minnesota, Ohio and Wisconsin. “It would be devastating to environmental protection in Region 5, the office that is the steward of the Great Lakes,” Cantello insisted."}, {"ca1d": "A bipartisan group of lawmakers from the region are pushing back against the Trump administration’s proposal to eliminate the Great Lakes Restoration Initiative. In a March 30 letter to House appropriations committee leaders, the members of Congress explained the initiative “is showing real and measurable results, but there is still a great deal of work to do.”"}, {"4bf3": "EPA employees and environmental activists gather in Chicago on Feb. 6, 2017, to protest Scott Pruitt’s nomination as EPA administrator. CREDIT: AP Photo/Carla K. Johnson"}, {"cf2d": "Consolidating the two regions would make EPA Region 7, located in Kansas City, Kansas, the largest regional office in the nation, covering 10 states. Region 5 has expertise in dealing with the states in the upper Midwest and a deep knowledge of Great Lakes protection. “That expertise would be completely lost,” Cantello said."}, {"0101": "Region 5 has only 500 employees, while Region 7 employs 1,000 staffers. “You could imagine how 500 people would be able to handle all the issues going on in 10 states,” she said. “It would be virtually impossible. Therefore, it would put people’s lives at stake. For the people who live in the six states, there won’t be an environmental cop on the beat.”"}, {"5f62": "Under the administration’s plan, 3,000 EPA employees nationwide would lose their jobs. Closing the Chicago office, and eliminating its 1,000 positions, would help accomplish that goal. Whether any employees would be transferred to the Kansas office is unknown. But the EPA regional office in Kansas does not have adequate space to accommodate hundreds of new employees, Cantello said."}, {"bb38": "Rep. Dan Kildee (D-MI), whose congressional district includes the city of Flint, called reports of the proposed closure of EPA’s Chicago a “misguided” move that would jeopardize federal resources to help Flint recover from its water crisis."}, {"a023": "“If true, the closure of the EPA’s Region 5 office —which serves Michigan and other states in the Great Lakes region — is very concerning,” Kildee said in an emailed statement. “EPA efforts to protect the Great Lakes through the successful Great Lakes Restoration Initiative are also critical to reduce pollution run-off and combat the threat of invasive species like Asian carp.”"}, {"9ca9": "EPA employees rallied in early February against the impending confirmation Pruitt as EPA Administrator, in what was the first protest by federal workers against the Trump administration. Roughly 300 people — a third of whom work for the agency — took to the street outside the agency’s Chicago regional office."}, {"e4f1": "With the latest leaked information about the possible closure of the Region 5 office, Cantello said her union plans to work with members of Congress from the six states to fight back against the closure of the Chicago office."}, {"b584": "“For the people who live in the six states, there won’t be an environmental cop on the beat.”"}, {"b5c1": "The Trump administration plans to focus on regional offices for job cuts, not the EPA’s headquarters in Washington, D.C. Along with Chicago, employees housed in other regional offices are fighting back against the administration’s plans to gut the agency. In the EPA Region 3 office, the mood “is fear, dread,” Marie Owens Powell, an EPA enforcement officer and a local union leader, told National Public Radio’s Morning Edition."}, {"69d5": "The Philadelphia office employees hope they can persuade their representatives to save the EPA and convince friends and family to speak out in defense of the agency’s work, the union leader said. A recent poll by Quinnipiac University showed a large majority of U.S. voters oppose cutting EPA’s budget."}, {"2291": "The proposed budget cuts are like nothing Cantello has seen in her 27-year career at the EPA. “I’ve been through many presidential transitions and have never seen this type of animosity toward our staff and animosity toward our mission,” she said. “George W. Bush, even though there were some things around the edges he wanted to do that were from a conservative bent, generally supported our mission.”"}, {"ad61": "Scott Pruitt says massive EPA cuts are okay because states have plenty of money to do the jobTrump’s EPA administrator is just fine with a 31-percent cut to his own agency’s budget.thinkprogress.org"}, {"ba91": "The Trump administration wants to let the states take over many of the duties of the EPA. “This idea that the states do the same work of the folks in the region is a fallacy supported by some Republicans but is not something that is a reality on the ground,” Cantello said. “The notion that there is duplication between what we do and what the states do is not reflected in reality. All the enforcement we do is requested by the states because they can’t do the work we do.”"}, {"9534": "In the six-state Midwest region, where coal-fired power plant capacity retains a sizable share of the electric power generating mix, the EPA Region 5 office has pending cases against coal plants for violations. “We don’t know if we will be allowed to follow through with those cases,” she explained. “We already have some cases on the docket against coal-fired power plants. We may not be able to get the cuts in environmental pollution that we would get under a regular course of business.”"}, {"f878": "This piece has been updated to include a statement by Rep. Dan Kildee (D-MI)."}], "content": "Leaked Trump administration plan to close Chicago EPA office puts 1,000 jobs at risk Great Lakes threatened by reported move to close regional office. In this Aug. 3, 2014, photo, an algae bloom covers a portion of Lake Erie near a Toledo, Ohio, water intake crib. CREDIT: AP Photo/Haraz N. Ghanbari President Donald Trump’s proposed cutbacks to the Environmental Protection Agency may include the closure of the agency’s regional office in Chicago, a move that could undermine the agency’s ability to monitor pollution in the Great Lakes and curtail its ability to implement enforcement actions against coal-fired power plant owners in the six-state region. The workforce for the Chicago Region 5 office would be consolidated with the EPA office in Kansas, the Chicago Sun-Times reported, citing anonymous sources. Trump’s budget chief Mick Mulvaney singled out the EPA as a target for budget cuts and the agency, under the leadership of former Oklahoma attorney general Scott Pruitt, was tasked with choosing two regional office for closure by June 15. The identity of the other regional office has yet to be disclosed. “This decision doesn’t make sense from an efficiency standpoint. Instead, this decision makes sense from an ideological standpoint,” Nicole Cantello, the head of the union representing agency employees in the region, told ThinkProgress. She received leaked information about the possible closure of the regional office and believes it accurately represents the intentions of the Trump administration. Cantello, who also works as a lawyer in the EPA Region 5 office, added: “If you wanted to drive a stake through the heart of EPA enforcement and EPA’s ability to protect the country, this would be one way of doing it.” “This decision doesn’t make sense from an efficiency standpoint.” News about the Trump administration’s plans to close the Chicago EPA office leaked the same week the agency discovered a potentially carcinogenic chemical had spilled from a U.S. Steel facility in Indiana into a tributary of Lake Michigan. U.S. Steel reported last Tuesday that it leaked an unknown amount of wastewater containing hexavalent chromium into a waterway in Portage, Indiana, within 100 yards of the lake. The Region 5 office oversees environmental protection in six states surrounding the Great Lakes: Illinois, Indiana, Michigan, Minnesota, Ohio and Wisconsin. “It would be devastating to environmental protection in Region 5, the office that is the steward of the Great Lakes,” Cantello insisted. A bipartisan group of lawmakers from the region are pushing back against the Trump administration’s proposal to eliminate the Great Lakes Restoration Initiative. In a March 30 letter to House appropriations committee leaders, the members of Congress explained the initiative “is showing real and measurable results, but there is still a great deal of work to do.” EPA employees and environmental activists gather in Chicago on Feb. 6, 2017, to protest Scott Pruitt’s nomination as EPA administrator. CREDIT: AP Photo/Carla K. Johnson Consolidating the two regions would make EPA Region 7, located in Kansas City, Kansas, the largest regional office in the nation, covering 10 states. Region 5 has expertise in dealing with the states in the upper Midwest and a deep knowledge of Great Lakes protection. “That expertise would be completely lost,” Cantello said. Region 5 has only 500 employees, while Region 7 employs 1,000 staffers. “You could imagine how 500 people would be able to handle all the issues going on in 10 states,” she said. “It would be virtually impossible. Therefore, it would put people’s lives at stake. For the people who live in the six states, there won’t be an environmental cop on the beat.” Under the administration’s plan, 3,000 EPA employees nationwide would lose their jobs. Closing the Chicago office, and eliminating its 1,000 positions, would help accomplish that goal. Whether any employees would be transferred to the Kansas office is unknown. But the EPA regional office in Kansas does not have adequate space to accommodate hundreds of new employees, Cantello said. Rep. Dan Kildee (D-MI), whose congressional district includes the city of Flint, called reports of the proposed closure of EPA’s Chicago a “misguided” move that would jeopardize federal resources to help Flint recover from its water crisis. “If true, the closure of the EPA’s Region 5 office —which serves Michigan and other states in the Great Lakes region — is very concerning,” Kildee said in an emailed statement. “EPA efforts to protect the Great Lakes through the successful Great Lakes Restoration Initiative are also critical to reduce pollution run-off and combat the threat of invasive species like Asian carp.” EPA employees rallied in early February against the impending confirmation Pruitt as EPA Administrator, in what was the first protest by federal workers against the Trump administration. Roughly 300 people — a third of whom work for the agency — took to the street outside the agency’s Chicago regional office. With the latest leaked information about the possible closure of the Region 5 office, Cantello said her union plans to work with members of Congress from the six states to fight back against the closure of the Chicago office. “For the people who live in the six states, there won’t be an environmental cop on the beat.” The Trump administration plans to focus on regional offices for job cuts, not the EPA’s headquarters in Washington, D.C. Along with Chicago, employees housed in other regional offices are fighting back against the administration’s plans to gut the agency. In the EPA Region 3 office, the mood “is fear, dread,” Marie Owens Powell, an EPA enforcement officer and a local union leader, told National Public Radio’s Morning Edition. The Philadelphia office employees hope they can persuade their representatives to save the EPA and convince friends and family to speak out in defense of the agency’s work, the union leader said. A recent poll by Quinnipiac University showed a large majority of U.S. voters oppose cutting EPA’s budget. The proposed budget cuts are like nothing Cantello has seen in her 27-year career at the EPA. “I’ve been through many presidential transitions and have never seen this type of animosity toward our staff and animosity toward our mission,” she said. “George W. Bush, even though there were some things around the edges he wanted to do that were from a conservative bent, generally supported our mission.” Scott Pruitt says massive EPA cuts are okay because states have plenty of money to do the jobTrump’s EPA administrator is just fine with a 31-percent cut to his own agency’s budget.thinkprogress.org The Trump administration wants to let the states take over many of the duties of the EPA. “This idea that the states do the same work of the folks in the region is a fallacy supported by some Republicans but is not something that is a reality on the ground,” Cantello said. “The notion that there is duplication between what we do and what the states do is not reflected in reality. All the enforcement we do is requested by the states because they can’t do the work we do.” In the six-state Midwest region, where coal-fired power plant capacity retains a sizable share of the electric power generating mix, the EPA Region 5 office has pending cases against coal plants for violations. “We don’t know if we will be allowed to follow through with those cases,” she explained. “We already have some cases on the docket against coal-fired power plants. We may not be able to get the cuts in environmental pollution that we would get under a regular course of business.” This piece has been updated to include a statement by Rep. Dan Kildee (D-MI). ", "title": "Leaked Trump administration plan to close Chicago EPA office puts 1,000 jobs at risk", "parent": "", "name": "2487", "timestamp": "Apr 17", "author": "Mark Hand", "child": "2487_1\t2487_2\t2487_3\t2487_4\t2487_5\t2487_6\t2487_7\t2487_8\t2487_92487_1\t2487_2\t2487_3\t2487_4\t2487_5\t2487_6\t2487_7\t2487_8\t2487_9"}