{"sentences": [{"dd96": "I’m not worried about Bitcoin scalability, but I am losing sleep over Ethereum"}, {"2c8e": "With the recent surge in the Ethereum price (ETH reaching 30% of Bitcoin’s market cap at nearly $5 billion), I find myself reassessing a number of my conclusions, to the point where I’m wondering whether it could overtake Bitcoin as the dominant cryptocurrency at some point in the future."}, {"be95": "Because of various network effects, I hold a cryptocurrency maximalist position, believing that one protocol will eventually win +80% of the market."}, {"3f32": "With that as a given, I currently have a binary view on the ecosystem: either Bitcoin will win, or Ethereum."}, {"b8fd": "Here are my assumptions about the Ethereum (ETH) blockchain, compared to Bitcoin’s:"}, {"dd05": "Based on these assumptions, I had until recently projected a path forward where Bitcoin continues to dominate the cryptocurrency market."}, {"e643": "However, the following observations give me pause:"}, {"ca0b": "I am still skeptical about the long term merit of the Ethereum blockchain as a store of value (and with that, of its long term staying power), but nonetheless I am seriously considering the following questions:"}, {"a2d1": "In short, what if Ethereum manages to become a good enough cryptocurrency and thereby wins this protocol war?"}, {"4df6": "At the risk of making an all-too-simplistic comparison, Betamax had better picture quality than VHS. But VHS had a better marketing strategy (rental market), and had tapes that ran the length of a feature film, which was more in line with what the market wanted."}, {"2d00": "On the flip side, I see the following:"}, {"6c57": "Bitcoin also has a few aces up its sleeve:"}, {"f3b4": "If it is true that over time one cryptocurrency will overwhelmingly dominate as the basis for an ‘internet of property’, then a lot of capital is at stake when considering the question who is winning this protocol war, Bitcoin or Ethereum?"}, {"31f4": "In that regard, here are some questions I’m hoping to find answers for:"}, {"6fbd": "Thanks for reading, I’m eager to hear your thoughts and discuss."}, {"7a19": "I own BTC, I don’t own ETH (for the time being)."}], "content": "I’m not worried about Bitcoin scalability, but I am losing sleep over Ethereum With the recent surge in the Ethereum price (ETH reaching 30% of Bitcoin’s market cap at nearly $5 billion), I find myself reassessing a number of my conclusions, to the point where I’m wondering whether it could overtake Bitcoin as the dominant cryptocurrency at some point in the future. Because of various network effects, I hold a cryptocurrency maximalist position, believing that one protocol will eventually win +80% of the market. With that as a given, I currently have a binary view on the ecosystem: either Bitcoin will win, or Ethereum. Here are my assumptions about the Ethereum (ETH) blockchain, compared to Bitcoin’s: Based on these assumptions, I had until recently projected a path forward where Bitcoin continues to dominate the cryptocurrency market. However, the following observations give me pause: I am still skeptical about the long term merit of the Ethereum blockchain as a store of value (and with that, of its long term staying power), but nonetheless I am seriously considering the following questions: In short, what if Ethereum manages to become a good enough cryptocurrency and thereby wins this protocol war? At the risk of making an all-too-simplistic comparison, Betamax had better picture quality than VHS. But VHS had a better marketing strategy (rental market), and had tapes that ran the length of a feature film, which was more in line with what the market wanted. On the flip side, I see the following: Bitcoin also has a few aces up its sleeve: If it is true that over time one cryptocurrency will overwhelmingly dominate as the basis for an ‘internet of property’, then a lot of capital is at stake when considering the question who is winning this protocol war, Bitcoin or Ethereum? In that regard, here are some questions I’m hoping to find answers for: Thanks for reading, I’m eager to hear your thoughts and discuss. I own BTC, I don’t own ETH (for the time being). ", "title": "I’m not worried about Bitcoin scalability, but I am losing sleep over Ethereum", "parent": "", "name": "2508", "timestamp": "Apr 4", "author": "Tuur Demeester", "child": "2508_1\t2508_2\t2508_3\t2508_4\t2508_5\t2508_6\t2508_7\t2508_8\t2508_9\t2508_10\t2508_11\t2508_12\t2508_13\t2508_14\t2508_15\t2508_16\t2508_17\t2508_18\t2508_19\t2508_20\t2508_21\t2508_22\t2508_23\t2508_24\t2508_25"}