{"sentences": [{"5fc9": "The Bitcoin Dominance Indicator Fallacy"}, {"f44a": "People are often using the Bitcoin Dominance chart to make a point about Bitcoin’s relevance and popularity. I believe in most cases where people tend to use it, they’re using it wrong."}, {"6416": "The Data"}, {"05b4": "There is a lot more money coming in crypto and blockchain startups."}, {"0397": "As more big companies invest in blockchain related startups you’ll see more speculators jumping on this new “Wild West” market where there are no rules."}, {"3400": "When we look at the total marketcap of all cryptocurrencies together:"}, {"5571": "When we look at the Bitcoin chart we see the following:"}, {"1648": "It is important to note that without MtGox Bitcoin would’ve never gone that high back in 2013–2014."}, {"e87a": "The Analysis"}, {"efce": "Every investor, trader and speculator is looking for the “new Bitcoin”. Bitcoin had incredible returns and now that it reached a (relatively) “large” marketcap the odds that it’ll go x10 from here in a year are quite small. That’s why new money is, partially, investing in altcoins and diversifying: they don’t want to miss out again. The chances of an altcoin going x10 in a very short period of time is a lot higher. Just take Dash as an example:"}, {"f7cc": "Lets start with the basics: when a coin has a marketcap of $1 billion, that doesn’t mean that $1 billion was actually invested in it. How much money is needed to pump a coin a certain amount depends on a lot of different things:"}, {"3dcc": "Lets try with an example:"}, {"eff2": "Marketcap: $44 mil, daily volume: $2.3 mil, up: 30.87%. That means the day before the marketcap was $33.66 mil. Even assuming there are no sells and they are all buys with $2.3 mil volume they increased the marketcap with $11 mil."}, {"eee2": "If the market is older, bigger and more mature, like Bitcoin, it becomes a lot more difficult to simply pump the price. This makes it more stable (read: boring for speculators)."}, {"f61a": "Lets take a look again at the Bitcoin numbers:"}, {"ece1": "1st of December:"}, {"3a26": "14th of April:"}, {"bf9e": "Given the following facts:"}, {"c5c2": "I really don’t see any issue for Bitcoin."}, {"8366": "Conclusion:"}, {"18a2": "While people don’t like the uncertainty created by Bitmain and Roger Ver, which may have resulted in some people hedging positions in alts, I don’t really see any reason to panic. The “flippening” might be a cool word but it’s a very unlikely scenario."}, {"0ab0": "Altcoin bubbles happen roughly once per year. The fact that the Bitcoin Dominance percentage is getting lower, is a natural phenomenon thanks to the growth of the industry, the money invested in it, the attention it gets from the media and the potential opportunities for speculators."}, {"dbf3": "When you consider the numbers I mentioned above: both Bitcoin and all altcoins combined grew by almost $7 billion in 4.5 months and that in the middle of an altcoin bubble."}, {"382e": "Bitcoin is still growing at a very fast rate. It is still the most popular coin, it has the most money invested in it and it’s the most secure one."}, {"dd73": "Don’t let people use this as an indicator to instill fear while it’s actually an indicator that shows that the industry is growing at a very fast rate."}, {"584a": "PS: If you enjoyed reading this feel free to donate something at 1FMy1kpeCY7BESwUaVcM5XAy1bmaWJaXKv. With the previous donations my wife was able to buy toys for 7 children in an orphanage for Christmas. Everything is greatly appreciated, but I don’t do it for the money. Sometimes I get asked by people how they can donate :)."}], "content": "The Bitcoin Dominance Indicator Fallacy People are often using the Bitcoin Dominance chart to make a point about Bitcoin’s relevance and popularity. I believe in most cases where people tend to use it, they’re using it wrong. The Data There is a lot more money coming in crypto and blockchain startups. As more big companies invest in blockchain related startups you’ll see more speculators jumping on this new “Wild West” market where there are no rules. When we look at the total marketcap of all cryptocurrencies together: When we look at the Bitcoin chart we see the following: It is important to note that without MtGox Bitcoin would’ve never gone that high back in 2013–2014. The Analysis Every investor, trader and speculator is looking for the “new Bitcoin”. Bitcoin had incredible returns and now that it reached a (relatively) “large” marketcap the odds that it’ll go x10 from here in a year are quite small. That’s why new money is, partially, investing in altcoins and diversifying: they don’t want to miss out again. The chances of an altcoin going x10 in a very short period of time is a lot higher. Just take Dash as an example: Lets start with the basics: when a coin has a marketcap of $1 billion, that doesn’t mean that $1 billion was actually invested in it. How much money is needed to pump a coin a certain amount depends on a lot of different things: Lets try with an example: Marketcap: $44 mil, daily volume: $2.3 mil, up: 30.87%. That means the day before the marketcap was $33.66 mil. Even assuming there are no sells and they are all buys with $2.3 mil volume they increased the marketcap with $11 mil. If the market is older, bigger and more mature, like Bitcoin, it becomes a lot more difficult to simply pump the price. This makes it more stable (read: boring for speculators). Lets take a look again at the Bitcoin numbers: 1st of December: 14th of April: Given the following facts: I really don’t see any issue for Bitcoin. Conclusion: While people don’t like the uncertainty created by Bitmain and Roger Ver, which may have resulted in some people hedging positions in alts, I don’t really see any reason to panic. The “flippening” might be a cool word but it’s a very unlikely scenario. Altcoin bubbles happen roughly once per year. The fact that the Bitcoin Dominance percentage is getting lower, is a natural phenomenon thanks to the growth of the industry, the money invested in it, the attention it gets from the media and the potential opportunities for speculators. When you consider the numbers I mentioned above: both Bitcoin and all altcoins combined grew by almost $7 billion in 4.5 months and that in the middle of an altcoin bubble. Bitcoin is still growing at a very fast rate. It is still the most popular coin, it has the most money invested in it and it’s the most secure one. Don’t let people use this as an indicator to instill fear while it’s actually an indicator that shows that the industry is growing at a very fast rate. PS: If you enjoyed reading this feel free to donate something at 1FMy1kpeCY7BESwUaVcM5XAy1bmaWJaXKv. With the previous donations my wife was able to buy toys for 7 children in an orphanage for Christmas. Everything is greatly appreciated, but I don’t do it for the money. Sometimes I get asked by people how they can donate :). ", "title": "The Bitcoin Dominance Indicator Fallacy", "parent": "", "name": "2527", "timestamp": "Apr 18", "author": "WhalePanda", "child": "2527_1\t2527_2\t2527_3\t2527_4\t2527_5\t2527_6\t2527_7"}