{"sentences": [{"c376": "Can Chatbots Help Us Do Time Sheets?"}, {"1203": "“Have you done your timesheets?” If you’ve ever worked in a service company, the question is sure to send shivers down your spine. Timesheets are the known evil of most companies. This time-consuming, annoying routine can take different shapes, but let’s reduce it to a typical scenario. Say team members have a monthly deadline for their timesheets. Ideally they would log work in their timesheet system everyday and have everything ready by deadline. But it never happens like this."}, {"0076": "What usually happens is this: on the day before deadline, HR, PM or alike check everyone’s timesheets and see that 90% of them are empty. They track down those who didn’t report their work — call them, text them, or even go to their desk just to remind them about the looming deadline and point out the bitter emptiness of their timesheets. Depending on the size of a company, it can take at least half of the work day to act as a walking reminder. Employees, in their turn, don’t have the foggiest idea what they were doing on a given day 3 weeks ago. They fill in their timesheets in a “broad, inaccurate stroke,” and thus time reporting turns into a practice of short form fiction writing."}, {"c041": "The plot thickens once the timesheets are filled out. Timesheet data is used either to bill clients directly, to keep an eye on projects and budgets, or to assess the estimations on project cost and duration. No matter how evil timesheets are, they are indispensable. And still, we don’t use them even to the half of their potential as most of the data in them is inaccurate."}, {"881b": "The way we currently do time reports is broken. In addition to the unsexy nature of the task itself, employees face all kinds of obstacles on the way to timesheet completion — the software is usually clunky, the interaction is hostile, the time is always inconvenient. The endeavour is doomed to failure from the start."}, {"4536": "Chatbot Power"}, {"e97d": "Chatbot functionality combined with artificial intelligence and machine learning can change the way we track our work. First off, chatbots can be built on top of any communication platform that teams already use. Familiar environment and conversational interface save valuable time employees spend on learning and getting used to a new tool. The whole reporting experience becomes less intrusive since employees can submit reports almost without interrupting their workflow."}, {"99d7": "Bots can turn one-way information input into a real-time dialogue. Interaction, even if only with a bot, makes the task feel less tedious and boring. Forty percent of managers who use timesheets at their workplace reported that their biggest pain point with time reporting is to make their colleagues track their time, on time. Though many reporting tools have reminder features, the reminder would typically arrive by email, directing users to a dedicated online timesheet system for which they don’t remember neither login nor password since the last time they used it was a month ago. No surprise there is no enthusiasm left by the time you reach a timesheet. If you ever do."}, {"d679": "You can’t hate a bot. In companies, it’s always someone’s responsibility to chase people for their timesheets. Everyone hates timesheets — the person who has to chase others hates them, employees hate them — which leads to unnecessary conflicts in the team. When a bot chases you, you can hate it back — just as you hate your car when it doesn’t start or your toaster when it burns your toasts. But it won’t hate you in return and thus, will keep your team friendly and happy."}, {"9785": "This is an example of a conversation that Nikabot, a Slack-bot that keeps track of timesheets, has with thousands of users every day. Nikabot reaches to everyone on the team asking “What did you work on yesterday?”. After she gathers all the info, she adds that information into timesheets. She also builds comprehensive reports and Gantt charts that team managers can use for billing and tracking their team’s progress."}, {"f0a1": "What captures everyone about Nikabot is its simplicity and convenience. She pings you in Slack, when you are on Slack. No need to jump windows, shuffle tabs or switch contexts. No need to remember about logging hours, since Nikabot owns the process and comes to you herself. No need to do timesheets, since Nikabot does them for you."}, {"fa72": "Nikabot launched in September 2015, and since then almost 5000 teams have used it to track their work. Managers reported that their timesheets have become more accurate and regular. A lot of teams dumped Excel timesheets and abandoned clunky services they used for reporting. And in every team there is a person who became a bit happier as they now have some extra time to work on more creative problems."}, {"1494": "Changing work reporting within companies is still quite a challenge. There is a lot of legacy in the way we track our work, and there are still companies who prefer to stick to old user-adverse software, just because they’ve been doing so for years, and their clients got used to it anyway. But once you try to run that routine as a simple conversation, you can never go back."}, {"1640": "What’s Next"}, {"e3f4": "Chatbots will definitely change our workplace. A lot of things that we do as part of our work are just low-level repetitive tasks that can be given away to bots, freeing humans to put effort into more complex problems. We already see bots that schedule meetings, help HR departments with their annual performance reviews or run online standups. Eventually we might see chatbots turn into full-fledged office managers and assistants."}, {"6226": "As for timesheets and project tracking — there is already a big value offered by bots and conversational interface. Power it with machine learning — and soon Nikabot will be able to learn each employee’s preferences, pre-fill their reports based on their previous routine, flag problems, budget projects, and finally learn to talk without adhering to a certain syntax or commands. The possibilities are endless."}, {"00b0": "If you’re interested to try Nikabot with your team, get your 30-day free trial at www.nikabot.com"}], "content": "Can Chatbots Help Us Do Time Sheets? “Have you done your timesheets?” If you’ve ever worked in a service company, the question is sure to send shivers down your spine. Timesheets are the known evil of most companies. This time-consuming, annoying routine can take different shapes, but let’s reduce it to a typical scenario. Say team members have a monthly deadline for their timesheets. Ideally they would log work in their timesheet system everyday and have everything ready by deadline. But it never happens like this. What usually happens is this: on the day before deadline, HR, PM or alike check everyone’s timesheets and see that 90% of them are empty. They track down those who didn’t report their work — call them, text them, or even go to their desk just to remind them about the looming deadline and point out the bitter emptiness of their timesheets. Depending on the size of a company, it can take at least half of the work day to act as a walking reminder. Employees, in their turn, don’t have the foggiest idea what they were doing on a given day 3 weeks ago. They fill in their timesheets in a “broad, inaccurate stroke,” and thus time reporting turns into a practice of short form fiction writing. The plot thickens once the timesheets are filled out. Timesheet data is used either to bill clients directly, to keep an eye on projects and budgets, or to assess the estimations on project cost and duration. No matter how evil timesheets are, they are indispensable. And still, we don’t use them even to the half of their potential as most of the data in them is inaccurate. The way we currently do time reports is broken. In addition to the unsexy nature of the task itself, employees face all kinds of obstacles on the way to timesheet completion — the software is usually clunky, the interaction is hostile, the time is always inconvenient. The endeavour is doomed to failure from the start. Chatbot Power Chatbot functionality combined with artificial intelligence and machine learning can change the way we track our work. First off, chatbots can be built on top of any communication platform that teams already use. Familiar environment and conversational interface save valuable time employees spend on learning and getting used to a new tool. The whole reporting experience becomes less intrusive since employees can submit reports almost without interrupting their workflow. Bots can turn one-way information input into a real-time dialogue. Interaction, even if only with a bot, makes the task feel less tedious and boring. Forty percent of managers who use timesheets at their workplace reported that their biggest pain point with time reporting is to make their colleagues track their time, on time. Though many reporting tools have reminder features, the reminder would typically arrive by email, directing users to a dedicated online timesheet system for which they don’t remember neither login nor password since the last time they used it was a month ago. No surprise there is no enthusiasm left by the time you reach a timesheet. If you ever do. You can’t hate a bot. In companies, it’s always someone’s responsibility to chase people for their timesheets. Everyone hates timesheets — the person who has to chase others hates them, employees hate them — which leads to unnecessary conflicts in the team. When a bot chases you, you can hate it back — just as you hate your car when it doesn’t start or your toaster when it burns your toasts. But it won’t hate you in return and thus, will keep your team friendly and happy. This is an example of a conversation that Nikabot, a Slack-bot that keeps track of timesheets, has with thousands of users every day. Nikabot reaches to everyone on the team asking “What did you work on yesterday?”. After she gathers all the info, she adds that information into timesheets. She also builds comprehensive reports and Gantt charts that team managers can use for billing and tracking their team’s progress. What captures everyone about Nikabot is its simplicity and convenience. She pings you in Slack, when you are on Slack. No need to jump windows, shuffle tabs or switch contexts. No need to remember about logging hours, since Nikabot owns the process and comes to you herself. No need to do timesheets, since Nikabot does them for you. Nikabot launched in September 2015, and since then almost 5000 teams have used it to track their work. Managers reported that their timesheets have become more accurate and regular. A lot of teams dumped Excel timesheets and abandoned clunky services they used for reporting. And in every team there is a person who became a bit happier as they now have some extra time to work on more creative problems. Changing work reporting within companies is still quite a challenge. There is a lot of legacy in the way we track our work, and there are still companies who prefer to stick to old user-adverse software, just because they’ve been doing so for years, and their clients got used to it anyway. But once you try to run that routine as a simple conversation, you can never go back. What’s Next Chatbots will definitely change our workplace. A lot of things that we do as part of our work are just low-level repetitive tasks that can be given away to bots, freeing humans to put effort into more complex problems. We already see bots that schedule meetings, help HR departments with their annual performance reviews or run online standups. Eventually we might see chatbots turn into full-fledged office managers and assistants. As for timesheets and project tracking — there is already a big value offered by bots and conversational interface. Power it with machine learning — and soon Nikabot will be able to learn each employee’s preferences, pre-fill their reports based on their previous routine, flag problems, budget projects, and finally learn to talk without adhering to a certain syntax or commands. The possibilities are endless. If you’re interested to try Nikabot with your team, get your 30-day free trial at www.nikabot.com ", "title": "Can Chatbots Help Us Do Time Sheets?", "parent": "", "name": "2539", "timestamp": "Mar 20", "author": "Impossible Labs", "child": "2539_1"}