{"content": "black on White design trendAn interpretation of Dess’s Black and White Design Wolf; A king of beasts empowered by a technology that has excruciating death dealing capabilities, the chain saw. For this art to be done in color it would take away the rawness of this tyrannical combination. Set in a modern day era, the lion is basking away in his modern suburban palace. Pool side drinks to cleanse the body from the toils of daily ferocious duties of a blood thirsty machine. The duties of a king. To ease his tyrannical demeanor, he has earned the rite to have been urbanized by symbolically wearing his battle won power, a high compression top fuel nitros oxide chain saw of anarchy. Supreme dominance has not changed all that much since the beginning of time, but we try. Angelqua; A full ripe rose. You know its red with razor thorns. Black on white imbues the rose with innocence ready to pluck. with a firmness to set the loins of a warrior on fire. Here razor thorns will protect her well. The firm beauty and well hidden instruments of vengeance will help keep her robust against the cruel world whom will suckle her nectar until she has withered to seed. Then the cycle starts over again to feed the insatiable need for nectar. Mue; A dance chorus of slender stocking legs, twined to keep the beautiful shapely legs from unraveling from the hardship of pleasures. There were many pleasures during that jazz and dance era that consumed many. Pray the twined stocking legs stay firm. Frayed stocking symbolizes the toughness of the time. Soulfakers; When God made women it was very good. Life can be very hard, like getting kicked out of the garden. Wine, women and dance were the order of the day. Sundays are meant for God to replenish the soul. Some will receive the gift so easily given and some will look a gift horse in the mouth and reject it. Rejection of that magnitude may well cost a very high toll. When you no longer live in the garden, what is left but soulfaking. 2222; 2 legs 2 arms, a union to make life, to drink, to be merry and procreate. Until the 2’s start wearing away. Sometimes there is luck. A hard old 2 will do, invested at the right time can ease the weary of overburdened 2’s. Giving our hardened cracked 2’s a chance for replenishment. So that we may be merry in life pleasures. Lezineld; A supreme genetic battle mount of years gone by. To achieve mastery, to become a great warrior, the youth needs to be nurtured and fit. So that future terrors of war can be won. Lezineld was the best that ever was. The years he endured and triumpted on the battle feild were commemerated by the warrior ritual of tattooing the skull upon death. Giving the warrior the memories to come back to life and continue the terrors as a zombie demon horse. The cycle of life and death with reward…the good old days. Ca roule ma poule; A story with a long time of age. A would cutter who couldn’t stand splinters but basked in the crucible steel heat. Mastering and becoming the smartest black smith in the land. He became consumed poured his life jucies night and day for the perfect steel. But mostly at night. All that toiling and the perfect crucible of steel was made. Black Boy was forged when megagigic lightening electrofied the sky and super charged the crucible of electrified cobalt molton steel. The lightning breathed life into his body and carbourized his steel structure with a perfect hue of cobalt. The boy toiled for many years but alas there were no cobalt babes left because of the great cobalt sword war. With a dwindling charge in his belly he was drawn to the carboronized electricity sourse that embued him with to life. The great magnetic field had unrelenting pull. With a dwindling charge in his belly, the great magnetic field called with a sirons back to the elixir of life. After a couple of accidents he got fried to many times. So sad, died with a sparkless heart. ", "child": "", "name": "1025_3", "parent": "1025", "title": ""}