{"content": "A Broken Record… During the times of US history when it was “ok” to own slaves, their treatment guidelines were exactly those expressed in the posted Wall Street tweet. All behavior was okay, as long as the profits kept coming. Stack enough slaves in a rickety old cart (read economy class) and get them out to the fields to pick whatever crop (usually cotton) the plantation harvested and sold to the world. If some fell off, oh well. Feed them enough (minimal calories) to get a 12 hours day of work out of them. And treat them with little or no dignity. Rape them (grab them by the pussy; sound familiar?), beat them, chain them, but do not cause the crop’s value to be diminished by any slave owner action. Now, the same attitude is slightly less visible than during the antebellum times, but it smacks of the same treatment. Corporations are not held accountable for much anymore when it comes to punishments. General Motors killed multiple motorists by refusing to fix a defect until they were outed. What happened? Not much. A slap on the wrist and a minimalist fine were meted out, but did anyone go to jail? No. An industrial version of the Roundup pesticide is sprayed on cotton to quickly and cheaply assure the crop’s survival against weevils. The cotton is then used in feminine hygiene products. The incidence of cervical cancers rises. But does anyone do anything about it? No. High fructose corn syrup and trans-fats are introduced in food processing . Obesity soars. But do the rich eat Eggo(s)? Not a chance. They know better. Wells Fargo, scams its depositors. A small fine ensues, but no jail time. So what to do? First, we need to examine what has worked or is still working throughout recent history. Letter writing doesn’t work. If it did, our legislative representatives would act on our behalf and not bend over for lobbyist’s dollars. Street protests don’t work. If they did, then the movement to reform the financial industry would have succeeded after the “Occupy Wall Street” movement ended. The news won’t help. The major media outlets only respond, they never investigate transgressions any more. Why would they? Too many ad dollars are at stake. There is only one group activity that has worked and can still work to effect change. Boycott! I have a very small following being a novice to posting on the web and on Medium in particular. But I have previously posted the same suggestion over and over. That is to build a mass participation (at least 10M people) boycott against Walt Disney Company, Wells Fargo, and WalMart, three hugely successful companies. Through a prolonged mass boycott, the above mentioned company stock prices will drop. And nothing scares business more than a trend against their perceived value in the market place. If the boycott is large enough, and lasts long enough, the CEOs and Board Members of these (and probably many more) entities will be on the phone to their representatives so fast, our heads will spin. This is the only effective (and safe — think Kent State and Tienanmen Square) way to express our outrage. And it’s simple. Don’t buy products at WalMart. Take all your business out of Wells Fargo and put it in a Federal Credit Union. And don’t buy product or watch any broadcasts from Disney. That’s it. It is a form of siege. In warfare, siege is the least costly and safest tactic to use against the enemy. But the one difficulty with it is; It takes time to work. I know, if you’ve read any of my previous posts, I sound like a broken record. But I’d rather you think of my idea as the canary in the coalmine sounding a warning. That warning is against behavior that won’t work. Commit to a financial siege over the long haul and things will change. Bitch and write letters and they won’t. It’s your move citizen. ", "child": "", "name": "1060_9", "parent": "1060", "title": ""}