{"content": "I’d rather be rich than be running low on money. I’m running low on money at this moment, and I won’t be able to afford a new computer for years. This really sucks. I need a powerful computer to do some work, and my machine’s processing power is “severely” limited. I need to make investments into my work, and my career is growing very slowly due to lack of money. There’s a real possibility that I might end up killing my career and becoming a janitor due to lack of money. I argue that your life becomes far more complex when you are poor than when you are rich. I literally have to balance freedom and buying a pair of new headphones. This is ridiculous. I literally wasted days on researching headphones only to conclude that I didn’t have enough money to buy new headphones and not worry about food tomorrow. If I had money, I wouldn’t have wasted days on this. I’d have just spent $700 on a good pair of headphones, a USB DAC, and an amp. It’d have taken a few hours at maximum instead of days. When you’re poor, you waste a lot of time on balancing budget. When you’re poor, controlling budget microscopically becomes really important, and controlling budget microscopically takes a lot of time and comes with a lot of complexity. Consider yourself lucky. The fact that you don’t have to control your budget microscopically itself eliminates whole classes of complexity from your life. I suggest that you enjoy life and stop thinking about growing your net worth as fast or much as possible. If you really had 5 million dollars, it probably wouldn’t take hardcore efforts to increase your net worth at a moderate speed safely. Also, you complained about lack of options for investing into small or mid-sized companies. I surmise you meant mid-risk mid-growth companies. This segment of investment really is empty but important because economic growth depends on this segment. Banks only invest into businesses that have very little risk of loss in fundamental such as a parking lot. Silicon valley only invests into businesses that have to grow 7% a week or fail horribly. Currently, on this planet, there seems to be no investment vehicle that focuses on mid-growth mid-risk companies. Perhaps, you could create a funding system that allows average people to invest into a fleet of 500~2000 mid-risk mid-growth companies. Call it a startup fund or whatever you like. As far as I know, the market for mid-growth business investment at a significant scale is almost empty. If I didn’t have to worry about making my ends meet, I probably could have set up a business in that investment segment instead of pursuing another career that I’m pursuing at this moment. ", "child": "", "name": "1120_25", "parent": "1120", "title": ""}