{"content": "… (My back story where I tell you I too have money. You don’t actually need to know)… I say this because I feel like I can relate to what you are saying a bit. Generally I agree with you, but at the same time, some of what you say sounds so asinine. “I have a very strong impression that what defines how much money or income anyone has is almost completely defined by their limiting beliefs.” Or you know, life circumstances… The idea that we are the only limiting factor in how much money we have is flawed. There’s also societies view of how much money we should have. I’m not sure what % role this plays, but it plays a role. Or there’s this statement “It’s really challenging being wealthy. Approach with caution.” Being wealthy isn’t the especially challenging. Staying wealthy is. Especially if you have no experience with it. This has little to do with some intrinsic quality of money. There are lots of things in life which are difficult when you lack experience. People do act weirdly about money, that’s true.. cause it’s tied to a lot of power. Your article fails to address the power of money. Like Spider man tells us, with great power comes great responsibility. Grappling with the responsibility of this power is what makes it difficult. If you don’t spend all your time distracting yourself with the luxuries of money, you might just pause to wonder why you, over a lot of other really smart people in the world have all this money and power. You can go a lot of places while answering this question. The base is polarity between feeling like you deserve it or like you don’t. As with most polarities, zen or happiness is found somewhere in the middle. You are smart, and you do work hard, but also, there’s a ton of other forces working in the world that led you to where you are financially. You didn’t will your way to the top… Sometimes realizing the unfair reasons why some folks have money and others don’t, can lead to depression and guilt. But it’s important not to drop this reality of the world, while not letting the guilt drive you to depression or other “money issues” ", "child": "", "name": "1120_19", "parent": "1120", "title": ""}