{"content": "This hits home for me. I am a few years into my second marriage; my first spouse had a lot in common with yours, but I was fortunate enough to escape mostly unscathed. My current spouse is good with money, I trust him, and I don’t anticipate us breaking up — but I keep a lot of things separate just in case. But it’s not a secret, which is key. It took some uncomfortable talks, but basically we’ve come to a good place where we have some joint stuff (including a house… that was a big step) and some separate stuff, but at least a few times a year we check in and talk honestly about how all our finances are doing, including the separate stuff. We don’t tell each other how to manage the separate stuff, but we do report back to each other on it and talk about our goals. Not every person would be willing to work with my fears on this — but then again, not every person would be a good partner for me. I’ve been thinking more about the separate stuff lately as my parents approach retirement. My mom is well-paid and smart with money, and has accumulated assets that will allow her to retire comfortably. She and her spouse have a similar arrangement to me and my spouse — a few joint things but most savings, etc., are separate, including retirement. Her spouse is also well-paid and not bad with money, but he hasn’t saved as much as she has (in part due to his past divorce and having more kids, I am sure — no judgment here) and the math for his retirement is a little less certain. He’s not unable to retire, but he has the possibility of outliving his savings, which my mom really doesn’t (barring something incredibly unexpected), even though he’s a decade older. His timeline and savings plans for retirement affect hers, even though they’ve kept the money separate —their ability to pay for future joint expenses obviously hinges upon them both having money for the rest of their lives. I don’t try to manage my spouse’s savings because he does a perfectly fine job of handling the day-to-day and always seems to be putting something away, but because he doesn’t earn as much as I do, he doesn’t put as much into retirement, either. I wonder if we might end up in a similar situation, where my best-laid plans don’t align with his despite the arrangement working well on a day-to-day basis while we’re working. ", "child": "", "name": "1138_18", "parent": "1138", "title": ""}