{"content": "Hey Mr. Leon, a couple of thoughts for you, from a white guy who’s starting to realize he’s too old to be hired for his next gig in tech. First, no way I can imagine what you’ve experienced. I volunteered two summers (well, got paid a bit for the second) at a historically black college in Alabama a long time ago (church connection), and was the only white person in the dorm. Problem was, I was accepted and treated like an equal, so never experienced what you do. Second, the vast majority of entitled white folks you encounter are fearful people who are just bluffing. No kidding. If you simply maintain your self confidence, even if you choose in a particular situation to be quiet or deferential to avoid a pack of fearful people turning on you, you will have been the most adult person in the encounter. Lastly, there are a very small number of people who exhibit great force of will, such as my grandfather who rose to CEO of a publicly traded company back in the 1960s. I still remember a situation from my childhood when my grandparents had flown across the country to visit us, were staying at a larger hotel, and had booked a reservation for the Easter brunch. The hotel people had lost it, and when we arrived at the appointed hour they told us reservations weren’t being honored and to get in the (very long) line. With my arthritic grandmother in ill health, and four small children, and no backup plan, this was going to be a problem. My grandfather took a step toward the headwaiter, the back of his neck turned bright purple, and he started talking in a voice I could not understand, taking another step, and another, and another in an assertive but not menacing way until they were talking 20 feet away. A man of great principle, I am absolutely confident he neither bribed nor bullied, but rather insisted forcefully that the hotel honor its commitment to him, and probably stated consequences he would impose on the hotel if the commitment were not met. 30 seconds later we were on our way to a table. Neither I, nor my mother, ever found out what he said. There are people of every color with that force of will. ", "child": "", "name": "11_24", "parent": "11", "title": ""}