{"content": "“White people are not afraid to ask for more” Neither are black people. Working in the restaurant industry, it’s usually black people who seem to be the ones expecting the most service. “She was exercising her right not just as a human, but as an American, white woman human” So you’ve never seen a black woman ask for more peppers? Or does a black woman asking for more not fit your narrative? “This idea of the fear of “the ask”, this harkens back to a time when asking for more hog, or more time alone with your partner on the other plantation, was a whooping, a beating, a punishment, a hanging” Literally no one except you is buying into this, but okay. “Privilege, its essence, is ending police brutality with a Pepsi can” No, that’s called corporate America. It’s capitalized on every movement, every social issue. Clearly you think yours is untouchable. “My mother gave me lessons, but no tools” May surprise you to learn that millions of white people have that exact same story “here will be the lot who will ask “why so many children” spouting whatever catchy phrase Rush Limbaugh spews, always tied with a ribbon of racism at its fringes; to them I see, would you ask if she not Black?” Yes I would. Though I don’t think 3 kids is “so many”, I often question large families where the children clearly aren’t being taken care of. White or black. Maybe if you didn’t view everything through a racial lens, you could see that. “ without the tools, without the learnings and know-how for integrating the rhetoric of “you can do it” into your life, without knowing how to properly convert tutelage to manifestation, without having someone show you how to fish, a fishing rod is just a stick to be admired” Once again, not a racial issue, this is a class issue. Though I think we both know you don’t care much about poor whites. “I said luck, to this room of white faces, because it is easier to downplay my accomplishments than acknowledge the work needed to get to where I am, presently” Shit, I must be black as the night, cause whenever I get asked why I have so many Instagram followers, I either say ‘I just got lucky’ or ‘Idk, maybe I’m cute or something’. I don’t tell them I’ve actually worked to build my social media profiles into something I’m personally proud of. I hide my time and energy and just make it seem like it’s something that happened out of the blue. Once again, not a racial issue. Maybe you’ll catch on to that eventually. ", "child": "", "name": "11_23", "parent": "11", "title": ""}