{"content": "Suggestions for Medium’s membership program I think Mike brought up great points about Medium’s current status quo with the membership program. I personally didn’t join the membership for several reasons and none of them have to do with the fact that I have to pay for it. I would have gladly paid for it if it had the benefits that I wanted. But just like Mike said, Medium’s current membership doesn’t really provide any “premium” benefits. I have a couple of suggestions, although this might only apply to me. For “founding members” you can perhaps give them the benefit to put more than 5 tags on posts. Or just anything that is different. (And of course keep the halo but… like…. a halo isn’t enough.)Make sure that the members-only email is different from the Medium Daily Digest. Please personalise and cater those emails, or at least let us filter the ones that we don’t want to read. Because when I come to Medium, I don’t come to get news, to be honest. I come to read people’s insights, thoughts and experiences. I know that Medium has plenty of “news outlets” but honestly I just avoid those, at least on here.(This suggestion isn’t for just membership but) Please make this platform friendly for all creators, not just 1) columnists 2) essayists 3) news. If Medium truly wants to be the “new YouTube for writers” you kind of have to realise that an independent platform like this will not only be out news. I was posting my fictional stories here a while ago but I just deleted them because they weren’t a) getting any views compared to my other content b) it just seemed a bit… awkward to be posting that content on here. And that shouldn’t be the case. Anyways that’s it for now I really like this platform and honestly I only believe that it is going to get better since (unlike YouTube) Ev Williams actually seems to listen to the creators on here and reads what they think. Please keep it that way. ", "child": "", "name": "1209_4", "parent": "1209", "title": ""}