{"content": "I have read no complaints from non-members saying that their user experience has been degraded. This may well be because there is not much further down that it could go. The text-editing is mediocre at best, the audience access and networking capabilities are — wait, do these exist at all? The actions of blocking and of requesting fewer stories of a given type or from specific authors seem to result in even more of the same being pushed at me on a daily basis, and the inability to block an entire publication, such as the laughably and gratingly left-wing “ThinkProgress”, is essentially an insult. The obvious world view being aggressively propagated by Medium, is that the President of the United States is by default a fascist monster, that everyone on earth either lives or ought to live in circumstances of urbane and tech-saturated insularity, that the earth is doomed due to climate change and that everything bad which ever happened like, ever, is because of heterosexual white men. The main reason I stay on this platform at all, aside from the very few and very selectively-chosen individuals I find worth engaging with and do so regularly, is otherwise a spiteful one: I really am that sick of the SJW mindset, that exhausted by the real-world consequences of a lifetime of feminist ascendancy and male capitulation to it, that skeptical to the level of seeing as an impending apocalypse set in motion by hyper-dependency on total connectivity of experimental and unreliable technology in every realm of human life. Medium gives me a recreational opportunity, such as by means of blocking as many as dozens of people a day, to send a message however insignificant, that I am not falling for this idiotic project of making the world a better place for the latte-swilling, propaganda-believing, urban/suburban, gimmick-addicted, debt-riddled, over-educated and under-wised-up, self-congratulating middle class, and its absolute self-assurance that it in itself is not the cause of most human suffering out of pure stupid greed. Other than that, just about anything offered by way of improvement, such as somehow offering an ability to reach audiences of more than half a dozen readers at best most of the time, would be a welcome one. ", "child": "", "name": "1209_14", "parent": "1209", "title": ""}