{"content": "K.E. Kimball, When I’m critiquing, I like to keep a few things in mind: The most important thing for poets to understand is how their poems made me feel. It’s the best clue I can give them as to whether they’re achieving what they set out to achieve. So I include my reader reactions: “This part slowed me down; I stumbled over the words.” Or “I’m racing through these words and my heart is racing, too.” Or “This is where I started sobbing.”I acknowledge that I’m working with a draft, not an assessment piece. It may have had many, many revisions already, but it’s not the finished work. I assume the poet wants a helpful critique, and wants the piece to reach its potential.I don’t actually know what poets are trying to achieve unless they tell me. So I never assume that they were trying to do one thing or another. I ask. “I’m not sure if you were trying to give this a noir feel, but I certainly got a sense of it. If you’d like to develop that aspect further, you could look at adding some darker language into lines 3–5.”Even when they’ve told me what they’re trying to do, I never assume I know the details of it. Poets play with form, with words, with punctuation, and it’s just as likely to be a deliberate choice as a typo. Or maybe I’ve missed the metaphor or deliberate homonym. Who knows. So their alphabet is out of order in their abecedarian? They might have done it on purpose. “The alphabet goes X, Y, Z but you’ve used Z, Y, X. I found this amusing, but I wasn’t sure it worked well given the serious nature of the rest of your poem.”If something is unclear, I ask. Maybe their writing is perfectly clear, and it’s my reading that’s flawed. “I wasn’t sure whether to read this as a promise, or a threat. Perhaps you intended to leave it ambiguous — I liked that effect. But if you wanted to take it more one way or the other, consider preceding it with slightly more positive/negative language.”I thank the poet for the knowledge and awareness I take away from the experience of critiquing their work, and I share my discoveries with them.I acknowledge where my past experiences have probably affected my reaction to the piece. For example, I have a personal history of abusive relationships, and I would explain that as a reason why I feel frustrated when abuse is depicted in a way that doesn’t seem authentic.I share opportunities with no expectation the poet will want to take me up on it. “Around here, I desperately wanted to hear more about this man, and I was disappointed when you moved on. That said, I also kept reading to see if there was more further down. So it could go either way.”I always point out the magical moments, the a-ha! moments, the unusual images, the little turns of phrase that take my breath away. I don’t want poets to kill those darlings under any circumstances. If they don’t belong in the poem, I want them to nurture those words elsewhere and grow a fresh poem around them. Pretty much all of these ideas are centred on the idea that I am not an expert in “all forms of poetry including this very specific poem this other poet was trying to create today”. I say that as someone who has studied poetry extensively, holds a masters degree in writing, and works as a professional editor, so I think it would take a fairly big ego to respond by saying “I am an expert.” But the truth is, it doesn’t matter whether you or I are experts or not. My goal is not to show my authority. My goal is to help each poet see their poem’s potential, and feel confident they’ve got the skill to take it there, and feel excited about that journey. If I manage that, I’ve succeeded in giving you a good critique. Many thanks to my recent critique partners, Dewi and Kathy Jacobs, for giving me an opportunity to think about these things. ", "child": "", "name": "1237_5", "parent": "1237", "title": ""}