{"content": "Take a Stand… Though you say the current disparaging of art and science doesn’t matter whether the reader is a D or an R, or some other designation, I’d like to agree, but it does matter. This does not mean I’m suggesting advocacy for one group or the other. It matters in ways most citizens (of any constituency) never consider; from a cost/benefit standpoint. Every art and science related policy denial or delay of service costs every one of us, and pushes a healthy physical and emotional environment farther and farther into the future. So how can media help as most media, never focuses on true costs? And is there a place for sound and pixels or should we stay focused on words and numbers only? True reportage use to be viewed simply. An inclusion of the who, what, where, when, and how, was the rule of the page. If WHY was included, it became an editorial piece. But what should have been included was the HOW MUCH element which impacts groups and individuals alike. Here are two examples. Many expenditures authorized by Congress for unnecessary or outdated military hardware, waste taxpayer’s money. These wasted funds could go to repair infrastructure, or provide needed goods and services for those who have difficulty affording them, such as seniors on fixed incomes. Also, the exorbitant costs of medical procedures and medicines in the U. S. is of concern to everyone impacted by the loss of income or assets when said assets/income are directed to help maintain, or return an individual or a family member to good health. These costs are bankrupting America. The two examples I’ve chosen does not mean they are at the top of the list when it comes to the threats we face going forward. I know climate concerns should be number 1, and the threat of nuclear war should be number 2 in the hierarchy of concerns, but these are more difficult to depict with sound and pixels without resorting to a simplistic view of earth from space as it burns or explodes. Everyone understands that cost. But policy emphasis, and wasted taxpayer dollars, are a bit more difficult to convey. So, if you buy into this premise (and most Congressional representatives acknowledge waste), how can you use sound and pixels to convey the personal cost of the waste to a broad, cross section of voters who will then be more likely to pick up the phone or write a letter expressing concern? I suggest a ML service similar to Reuters or AP but geared to providing animations for newsreaders to use or not. Some will avoid using simple animated depictions because it goes against their corporate agenda. Others however, will adopt them post haste, as it will increase eyeballs to their own media venue. Imagine a headline and story that depicts a multi-racial group of people which then morphs into a pie chart. Now, apply the effects of policy to the chart and show (for example) the costs diminishing the influence of one group against another which benefits more from a real or hypothetical policy’s implementation. It’s not numbers on a spreadsheet, which most folks fall asleep trying to decipher. It’s a movie. And animation depicts reality in a way everyone understands. Now those who present their news bias that would better say what they have to say by including the animation in their broadcast will do so. Those that argue against, or would surely lose ground if the “truth” were out, won’t use the service. This applies to all degrees of the political spectrum. But, as the service grows through blogging, youtube newscasts (and editorials), the popularity of a sound and pixels presentation will grow, and soon the underlying economics of consequential policy will be better understood by more voters, and educated voters eventually will stop voting against their own interests, especially when it impacts their individual financial situation. Providing the niftyfifty.org service makes it easier for concerned citizens to express their worries to Congress Persons. By providing economically based animations that depict the effects of policy on our wallets, will give the callers a more reasoned argument to present when they call. Thank you for all you do at the lab… ", "child": "", "name": "1253_1", "parent": "1253", "title": ""}