{"content": "A Revised Planck Scale? In the early 1900s it was not entirely clear what the Planck scale parameters corresponded to in nature since there was nothing observed at these conventional values of M, R and T, and at that point no unambiguous theoretical interpretation was available. Since that time, a better theoretical understanding of the Planck scale has emerged: the Planck scale parameters define the scale at which gravitation must be included in the dynamic modeling of the microcosm, i.e., the scale at which General Relativity and Quantum Electrodynamics both play major roles in the dynamics of the microcosm. When Discrete Scale Relativity’s value that applies within atomic scale systems (G-1) is substituted for G in the Planck Scale equations, as mandated by the discrete fractal paradigm, a radically different set of M, R and T values is generated. These revised Planck scale results are given below. M = 1.20 x 10^–24 g ~ proton mass R = 2.93 x 10^–14 cm ~ proton radius T = 9.81 x 10^–25 sec ~ proton radius/c Whereas the conventional set of Planck scale values constitutes a seemingly random collection of numbers that do not appear to correspond to anything observed in nature, the revised set of Planck scale values derived from the discrete fractal paradigm are self-consistent and are firmly linked to the scale of nature’s most fundamental baryon: the proton. The value of the revised Planck mass is ≈ 0.72 times the mass of the proton, the revised Planck length is ≈ 0.4 times radius of the proton, and the revised Planck time is ≈ 0.4 times the proton radius divided by the velocity of light. With Discrete Scale Relativity our understanding of nature is radically altered. It is in all senses of the scientific term it is a new and highly unifying cosmological paradigm. Fractal CosmologyRobert Oldershaw's Fractal Cosmology Site: Cosmology, Fractals, Self-similarity, Hierarchical, Dark Matter…www3.amherst.edu ", "child": "", "name": "1256_2", "parent": "1256", "title": ""}