{"content": "I couldn’t presume to concur as I am not qualified. I agree, however. Moreover, I presume…to offer this. Thank you very much for the analysis. — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — - -KEPLER- The First Lesson Of ∞ Infinity ∞ “The “first lesson” of Infinity is that every part of everything is not only possible but…is: again and again. There is no “second lesson”. -Timothy Brown Were Infinity to exist, and there is no scientific disproof, Time would be superfluous. As would be: numbers. ∞ Kepler -Past- ∞ Johannes Kepler was a German mathematician, astronomer, and astrologer. A key figure in the 17th century scientific revolution, he is best known for his laws of planetary motion. According to accepted sources, Kepler, influenced by giants such as Galileo; was a significant inspiration for Sir Isaac Newton in his own creation of the seminal work on Universal Gravitation. ∞ Kepler -Present- ∞ “The fault, dear Brutus, is not in our stars, But in ourselves…” -Wm. Shakespeare Julius Caesar ∞ Four and a half centuries after the birth of the great scientist Johannes Kepler and with the help of modern technology as well as the energy of a cadre of contemporary scientists and technicians, Kepler took on an added dimension. According to media sources, “Kepler” is a space observatory launched by NASA to discover Earth-size planets orbiting other stars. The spacecraft is named after the Renaissance astronomer. The Kepler spacecraft was launched on March 7, 2009, into an Earth-trailing heliocentric orbit. As an observatory, Kepler is in essence a telescope. A very, very powerful scientific instrument, which is the distant, descendent of the apparatus first used to explore astronomical occurrences by none other than one of Kepler’s prime professional influences: Galileo Galilei. According to Internet sources: “Kepler’s sole science instrument is a photometer that continually monitors the brightness of over 145,000 main sequence stars in a fixed field of view. This data is transmitted to Earth, then analysed to detect periodic dimming caused by exoplanets whose mass interferes with the light of their host star. As of January 2015, Kepler and its follow-up observations had found 1,013 confirmed exoplanets in about 440 stellar systems, along with a further 3,199 unconfirmed planet candidates. Four planets have been confirmed through Kepler’s K2 mission. In November 2013, astronomers estimated, based on Kepler space mission data, that there could be as many as 40 billion rocky, Earth-size exoplanets orbiting in the habitable zones of Sun-like stars and red dwarfs within the Milky Way. It is estimated that 11 billion of these planets may be orbiting Sun-like stars. The nearest such planet may be 3.7 parsecs (12 light years) away, according to the scientists. On January 6, 2015, NASA announced the 1,000th confirmed exoplanet discovered by the Kepler Space Telescope. Four of the newly confirmed exoplanets were found to orbit within habitable zones of their related stars: three of the four, Kepler-438b, Kepler-442b and Kepler 452b are almost Earth-size and likely rocky; the fourth, Kepler-440b, is a super-Earth. On May 10, 2016, NASA verified 1,284 new exoplanets found by Kepler, the single largest finding of planets to date. Kepler-438b (also known by its Kepler Object of Interest designation KOI-3284.01) is a confirmed near-Earth-sized exoplanet, in the constellation Lyra. The planet was discovered by NASA’s Kepler spacecraft using the transit method, in which the dimming effect that a planet causes as it crosses in front of its star is measured. NASA announced the confirmation of the exoplanet on 6 January 2015. Although it is not habitable, as of June 2015, it has the highest index on the Earth Similarity Index, with a rating of 0.88. Since 1988, over 3,000 exoplanets have been confirmed by all detection methods, including the Kepler mission, (more specifically, 3,443 planets in 2,571 planetary systems, including 586 multiple planetary systems, have been confirmed, as of July 2, 2016). About 1 in 5 Sun-like stars have an “Earth-sized planet in the habitable zone, with the nearest expected to be within 12 light-years distance from Earth. Assuming 200 billion stars in the Milky Way, that would be 11 billion potentially habitable Earth-sized planets in the Milky Way, rising to 40 billion if planets orbiting the numerous red dwarfs are included… “ Kepler-438b is approximately 470 light years from Earth, so traveling there is presently impossible within a human lifetime. The German-designed Helios probes, notable for having set the current speed record among spacecraft at 252,792 km/h, would take some two million years to travel to Kepler-438b.” (Emphasis added) ∞ Kepler -Future- ∞ It is firmly believed that the Universe has neither beginning nor end. Were this so, it is a concept that is perfectly, humanly, impossible to contemplate. Infinity. There is a great likelihood that with Infinity: anything is possible. Even the “outlandish” prospect that: Physics, as we know it might have little or no application itself as a science. That some imponderable application for the measurement and description of any event would apply. Instead of the strict formulaic physics/science that have governed all life, as we know it on this speck of existence that is but a brief blink in the eye of…Infinity… ∞ Introducing the INFINIVERSE ∞ Infinity exists. It can thus be surmised that notwithstanding the magnificent and daunting discoveries of present-day Kepler, its namesake and; all of the great astronomical minds of centuries past and centuries yet to be measured by Man: the exercise in search of Earth-like life in the cosmos is both redundant and misinformative. Space-time measurement, Man’s only, consistent present method for explanation of the Universe seems inordinately dependant upon “time” as its essential component. Time, of course, is an invention of Man. Created in order to explain the otherwise inexplicable. The circle is vicious. ∞ With the promise of Infinity there is also the promise that there is not only the prospect that there is another “Earth” out there. Why not the certainty that there is another “Earth” out there? There must be… A planet that not only exists, but exists exactly like the one currently inhabited in a certain quadrant of the so-called Milky Way Galaxy? Called by its inhabitants: Earth. Moreover, why therefore mustn’t there be -without question- the very severe prospect that there is, in fact, an infinite existence of “Earth” planets exactly identical to “our” Earth? Infinity. If Infinity exists then infinite opportunity for everything exists. There therefore is likely to be an infinite number of planets “Earth”. Infinity…Period. ∞ Posted 12th July 2016 by DILULIUS, King of Troy My blogs DILULIUS, King of Troy About me GenderMALEIntroductionDILULIUS DiLuglio, KING OF TROY The writer is in fact DILUGLIO. Two earlier DILUGLIO’s occupied history serving as kings of Troy. The later being 93 generations removed from the writer today, reigning about 725 B.C. The present day DILUGLIO, who presents this blog, is a former defense lawyer and prosecutor as well as attorney having a practice representing various domestic and international clients and a law professor. He also served as a four term state Senator. The writer was educated domestically and in Europe and presently resides in the northeastern United States. ", "child": "", "name": "1258_10", "parent": "1258", "title": ""}