{"content": "The multiverse speculations are quite interesting, but are they really just an effort to avoid the uncomfortable fact (for some) that the universe we experience is uniquely specified? Consider an alternative to the multiverse — that there is some process which we do not yet understand that has selected the fine-tuning constants of this physical universe and moved it along its unique trajectory. Is this any less rational than the speculation that we are simply lucky enough to be located on this one among a myriad of possible trajectories? The specified universe speculation is actually much simpler than the multiverse, even if it seems a bit more mysterious. Moreover, the specified universe is consistent with the view that conscious choices of freely willing agents have efficacy — something which the multiverse calls into question. Under the multiverse speculation, if a conscious agent makes a choice, would that not then split reality into alternatives — one for each of the possibilities inherent in that choice? Since we all live our lives and make choices with the belief that they actually matter, it would appear that a belief in the specified universe would be more rational, and more consistent with human behavior, than a belief in the multiverse. The underbelly of the multiverse speculation is that it strips meaning from our understanding of the world. If everything possible is real, somewhere, then the reality of here is inconsequential. We may as well be wisps, floating in the infinite ocean of possibilities, and nothing that we do or think really matters. In addition to being irrational, that seems foolish. Should we not live life as if we mean it? Let’s give the specified universe speculation a chance — and see where it takes us. For some further thoughts, see the FQXi essay The How and The Why of Emergence and Intention. http://swedenborgcenterconcord.org/?p=1229 ", "child": "", "name": "1258_15", "parent": "1258", "title": ""}