{"content": " Aaahhh, so really, you mean “free content” magical thinking? Blunt headline, I’m sorry, but if this article was not biased, the introduction would have been more meaningful. But the sway towards the lucrative problems and issues of distributing content nullified the start. With all the problems of this world, these guys are spending billions on going to Mars and living to 200. WTF? If we’re honest about it, we will not be very sad if they make it, and have a way of delaying our death for about 100 years. Also considering the political shit storm which Earth has going on for far longer than Jupiter has had its atmospheric anticyclonic storm, going to Mars for a change doesn’t sound like such a bad idea either. It is very unfair to tease us with a discussion about unleashing a Rottweiler in the room filled with the smartest cats and then, instead, unleash Garfield who makes smart remarks about the smartest cats. I, random Joe of the Internets, believe “The problem” is obviously not Google’s, nor YouTube’s. What do you suggest they should do? Other than quoting Apple, who is seriously invested in being the holy saviour of the content producers. Apple wants to become the exclusive carrier of quality content period. Should the content producers give them that? Should the content producers stop producing? Should we start throwing milk away? Again? But I wonder, while Free Basics failed, governments ban corporate attempts to extend connectivity even further, without any notable action to do it without corporate interest involved, is there a content starvation in other parts of the world? All the people (artist management, bulk copyright owners) who have already spent decades upon decades fighting the transformation by technology of an antiqued industry, I’m sure they never ever felt like the smartest cats in the room. No way, sir. But in doing so, how come with all the money involved, all the content empires didn’t do one thing other than becoming even bigger content empires? Don’t you think it’s a bit unfair to mislabel so easily the silicon valley types, while the others have proven how relentless they will be throwing money at fixing the leaks in their money wells, but sparing no change on solving any of: All the problems of the world. I mean, seriously, Disney? We need an army of angry mobs to stop brainwashing whole generations with weird stereotypes, only to have them start over with different stereotypes. That’s the best they could do for the world’s problems. With 400 dramatic series produced, we get how many addressing real issues? How many dramatising any of “all the problems of the world”, and how many creating fantasy land mind numbing sitcoms? When I asked in the Q & A about YouTube he said, “YouTube represents 40% of the streaming volume of the music business and 4% of the revenue. It’s a ripoff, but Google doesn’t care.” I wonder what Ruth Porat, the new CFO of Google, sitting in the audience thought of that? @Ruth Porat thought: Behold, I am the LORD, the God of all flesh; is anything too difficult for Me? Would that make any difference? As for advertising and eyeballs, perhaps the problem is different. Maybe new generations are so underwhelmed by over saturation by: brand valuesbrand social valuesbrand social responsibilitybranded sportsbranded eventsbranded contentsponsored newsadvertorialsI could make this list so long that it’d fill up the maximum document size in Medium’s noSQL database Today, brands, and companies advertising for brands, would throw money at anything that could shed some hope on the crumbling efforts of bringing back former glory. How can you possibly frame that *Heineken Beer story like it is the problem of Google or Yahoo or who else was algorithmically spending their money? Is that not showing the crass lack of expertise of whoever entrusted that money to be spent like that? This is real time business, you can stop the flow of cash the minute you realise it makes no sense. But, ahem, how awesome is that $6 for $1 that the trapped TV consumer was tricked to supply! Ok, rant over, Jonathan Taplin. Oh one more thing… Ending with a Threat But unless the tech guys start looking at media with a little humility we are going to be in trouble. Is 100% not a good way to encourage dialog between the tech people and the media people. You’re only going to make those average smart cats behave more like felines and show some claws. Just my 2 cents. ", "child": "", "name": "1345_3", "parent": "1345", "title": ""}