{"content": "Smartest Guys in the Room, huh? Looks like it’s time for a bigger room. It’s technology, not magic. Terraforming Mars is simply out of the question, maybe forever. What a nuclear weapon on Mars might look like. Yes, as irresponsible as a nuclear weapon on Earth… I am a lover of science. I think if there was a contest to see which series of human perspectives have made the world a better place, science vs religion (verboten comparison, I know), I would willingly choose science every time. Science questions, religion accepts. I like to question, even though if you follow my name across the Internet you will find I am mostly associated with presenting answers to questions. I am looking at some of the “visionaries” of our modern time, such as the luminaries of Elon Musk, Steve Jobs, and Ray Kurzweil and asking: “Is this the best future we can imagine? Mr. Musk, is supposed to be a visionary genius whose interests span far and wide and his major triumph of his company Tesla cannot be understated. However, it does not mean he should be allowed to skate during interviews when he says patently false and ignorant things. Some facts, sir: At our current level of technology, we have no more chance of terraforming Mars than we do at fixing our own current environmental problems here on Earth. And just like on Earth, dropping nukes on Mars, won’t do anything to make the planet more habitable. Mars has no atmosphere and will likely never have one due to its tiny size, relatively low gravity and lack of a magentosphere which prevents the solar wind (radiation particles from the sun) from stealing tiny bits of atmosphere every time the sun hits the planet. Even if we were creatively able to develop an atmosphere for the planet, without the protection of a magnetosphere like we enjoy on Earth, Mars’ atmosphere is destined to be blown away. Your magnetosphere at work. Protecting our atmosphere for 4 billion years and counting. Commonly called the Aurora Borealis (or Aurora Australis if you live in the southern hemisphere) as seen from the International Space Station. And before you tell me we’ll just make one, let me save you and say, the magnetosphere is a byproduct of having a planet whose molten core is made of iron, still fluid and dynamic. Mars has none of those things. Mars is a cool, dull and lifeless sphere whose possibilities are very limited, by what we can create here at home. Mars, sir, will have underground facilities because without them, the radiation from the sun, unbuffered by the magnetosphere Mars does not have, would be dangerous to anyone living there. We will live under the surface, perhaps conduct experiments there, do mining and other things but Mars will never be a serious base of operations, not until we can do a few things closer to home. We need a Moon Base. Everything science wants to do on Mars, they need to do on the moon first. Why? Because environmentally its just as hostile but a whole lot closer. If we want to experiment with how to build on Mars, we need to build what technology we are going to use on Earth, find a way to move it economically into orbit, and then find a way to move it to the Moon. Did I mention putting it back together once you get it there? Moonbase. Say it with me. Moonbase; where we experiment with ideas BEFORE we send them to MARS, an order of magnitude more difficult and distant. At its closest, Mars is 33 million miles from the Earth. The moon at its apogee (farthest point from Earth) is a mere 251,968 miles. How does it even sound to tell people they should travel 130 times farther to create a project they have never even tested far closer to home, with less difficulty to arrange, far less expensive to produce and far more likely to be successful due to its proximity? My point is this, Mr. Musk: When you aren’t sure of the answer, when you haven’t done the research for the answer, when you aren’t even remotely certain you should answer the question, just say — I don’t know. It’s hard. Because people are watching you and you want to make a good impression. But you must understand, the world doesn’t need any more false visions, expensive utopias or pie in the sky projects which look like something in the distance but up close are just what they appear to be, nothing. It’s damaging for your image to say “I don’t know” but it’s more damaging to promote the irresponsible considerations which make people question your credibility as a so-called genius, assuming they can still think for themselves in the first place. And don’t get me started on Ray, uploading our brains to computers, living to be a thousand years old… Really Ray? How about we work on a few things before we start trying to live forever. Say, a viable form of population management, a form of birth control that is safe, easy to use, reversible and permanent until people decide they want to change their status, works for men and women and doesn’t have deleterious side effects. If you really want to save the world, you really want to help humanity become all it can be, then fix the real problems rather than just making up something which convinces venture capitalists with too much money and not enough real problems to invest in, to spend money on your stupid idea for decades before we come to the realization: “Just because you CAN do a thing, doesn’t always mean that you SHOULD.” Physical immortality before reliable safe population management means our already overpopulated planet becomes filled with a group of immortal selfish assholes who believe since they live forever, they don’t have to worry about the mayflies who don’t. Don’t we already have enough of that kind of thinking? (Substitute cash for immortality and the answer is: absolutely.) Let’s fix something that needs fixing, smartest guys in the room. Earn that title or get out of the way of people who actually give a damn. Go back to doing whatever it was that made you well known, keep doing that thing, and stay out of fields you have not considered longer than the ten seconds it takes for you to say something incredible stupid on national television. The future needs people dedicated to solving problems not just investors looking for their next big payoff for software that doesn’t actually improve society. We have too much of that already. Faceless minions of capitalism hoping for another payoff before someone realizes they aren’t selling anything useful. Pick the wrong future, select the wrong technology, back the wrong smart guy and we can conceivably damage civilization as we know it. Come to think of it: Our current version of civilization with all of its current “benefits” and problems is the result of choosing the smartest white guy in the room, more often than not. Perhaps a shuffling of our species priorities are in order as well. Maybe we should change that just a bit, too. Put some color and some feminine energy in the mix. God knows all of our societies could do with a little less war, and a little more love.  Thaddeus Howze is a California-based technologist and author who has worked with computer technology since the 1980’s doing graphic design, computer science, programming, network administration and IT leadership. His non-fiction work has appeared in numerous online magazines: Huffington Post, Gizmodo, Black Enterprise, the Good Men Project, Examiner.com, The Enemy, Panel & Frame, Science X, Loud Journal, ComicsBeat.com, Coffeelicious and Astronaut.com. He maintains a diverse collection of non-fiction at his blog, A Matter of Scale. Thaddeus is a popular and well-read writer on the Q&A site Quora.com in over fifty various subjects. He is also a moderator and contributor to the Science Fiction and Fantasy Stack Exchange with over fourteen hundred articles in a four year period. He is an author and contributor at Scifiideas.com. His speculative fiction has appeared online at Medium.com, ScifiIdeas.com, and the Au Courant Press Journal. He has a wide collection of his work on his website, Hub City Blues. His recently published works can be found here. He also maintains a wide collection of his writing and editing work on Medium. ", "child": "", "name": "1345_6", "parent": "1345", "title": ""}