{"content": "In many “learner-centered” schools, the approach to disciplines (math, writing, reading, science, social studies) is different. Rather than standards for each discipline, the curriculum is built around themes (see the IB curriculum for an example.) All activities begin with a large question, which then branches off into questions each learner wants to explore. Because these are “real” problems (not those made up by a textbook publisher), they are cross-disciplinary. Here’s a clip from an article based on what happens in these schools. Separate disciplines rarely, if ever, exist in the real world. When learners are encouraged to identify and explore questions and solutions related to real world problems, they may find that they need to understand math (statistics), science (environmental issues), history (social constructs), informational text (language arts) and other “academic” content. Instead of being “given” facts that they may or may not need ahead of time, they are intrinsically motivated to learn a multitude of concepts they do need to solve the problem. Will they all learn the same facts by the time they graduate? No! They will have learned something that is arguably much more essential — how to find whatever information they want or need as they move through life. They also develop the confidence to take on any challenge, even if it is outside a given “field.” In short, they become accomplished and confident lifelong learners. Note: Essential math skills are “taught” at appropriate levels…and if/when learners find that they need them. At that point, they are motivated to learn the skills so that they can continue their work on the problems that interest them. Even though these schools don’t TEACH standards, they sometimes give their students the standardized tests “just for fun.” The students typically score 2–3 GRADE LEVELS ahead of their public school peers because they have a much deeper understanding of content. Why, when these methods are so effective (these are the schools where the wealthy send their own children!), do policy makers double down on mandates that make it nearly impossible to implement them in public schools. As long as public education remains under the yoke of one-size-fits-all standards and standardized testing, teaching in this way will be difficult if not impossible. So how do we get rid of the yoke? ", "child": "", "name": "1348_13", "parent": "1348", "title": ""}