{"content": "Anastasia, thanks so much for this post! As a single mother, having raised 7 children on my own, I can totally relate to your writing! And, as a single mother, I have ALWAYS worked: the work to simply survive in addition to the work of raising fine human beings. In 30 yrs of work, I have only had two jobs that paid me a living wage. Both were outsourced to the Philippines. I did not finish college, but have five certifications: Certified Nurse Assistant, Home Health Aid, Medical Unit Clerk and most recently, Certified Medical Assistant and Certified Phlebotomy Tech. However, I am STILL not earning enough to buy housing for myself and my youngest two children. We’ve been homeless since last year and living with a fine, gracious friend. I have always taken issue with the prevailing attitude our nation has towards the poor: something akin to it being some type of character flaw, and the assumption that poor means “lazy”. I have had to rely upon some form of assistance for years. Since the father of my children persists in ignoring his child support obligations, I do not feel guilty relying on this assistance to help, even in a small way, with helping my children survive. I am FAR from “lazy”, however; I worked 70 hours last week, both night and day shifts. But, since my company can get away with it, my check is split between two franchise offices, and my overtime hours will not be compensated as overtime. What I find harsh is this attitude towards our poorest citizens, especially during elections years, seems to turn to vitriol, as our media feeds conservative Americans propaganda to sway a vote. No one wants to fully examine the spending habits of the ultra rich, like why ANYONE ought to spend thousands of dollars for a dinner to give contributions to an already corrupted politician! Or, what that person spent on their outfit, shoes, purse and transportation to said dinner, while they walked past a hungry, homeless person on the street outside the venue. They ignore the clear character flaws of the rich, making excuses for their bad behavior and in the same breath criticize a poor person’s choice to buy something considered a “luxury” with food stamps! The support a corrupted, crass candidate who is openly racist and misogynistic and brags about evading his tax obligations. While they talk negatively about the poor relying on government support to simply breath! I remember the scripture about removing the plank from your own eye before helping your brother get a splinter out of his. It is as though we are more comfortable being critical and analytical of our poor, rather than insist that everyone, including government, address the source of this problem: the corporate mentality that pays CEOS billions and the labor that keeps companies functional, pennies. I certainly hope that more Americans will wake up, and get out to vote and work to make changes to help every citizen! ", "child": "", "name": "1361_18", "parent": "1361", "title": ""}