{"content": "A Guide for Conservatives who seem to lack perspective: Social Welfare Programs do not Promote Single Parenthood. Prior to Ronald Reagan it was true that many states did not allow assistance for intact Families- leading to migration to states that did. Reagan ended that practice in 1985- because California never had it-though there may be that prejudice still in some areas. The fact that it allows the escape from Abusive Relationships is a net good.Few if any Minimum Wage jobs are anywhere near Full time. Many only have 20-24 hours/week. In my City where the cheapest 2bdrm Apt rents for $775 & the average wage is $11($10.06 after Tax)- a parent would have to work 77 Hours/month just to pay it. Then there is the cost of Utilities. While your rent usually gets you Water, Trash & a Parking Space you are still on the hook for Gas/Electric, Mobile phone(Cheaper than Landline)& vehicle.The last 2 absolute requirements if you are going to have any chance at employment.That basically uses up the remainder of the 100 monthly hours of employment that your job provides. This means that Government paid Food Stamps & Medical Care are essential to make ends meet. Since most workers are employed in the retail/service sector that means Society @large is subsidizing employer profits. WalMart the low price leader comes to mind but most operations pay a bit more & have every bit as low prices. Safeway because its unionized is better- while wages aren’t much better — if you work 21 hrs/week you at least get benefits like Health Care.Your chance as a parent f getting a job is complicated because you are competing against other Adults w/o dependents. Employers prefer these people because they have less conflict in their lives due to lack of dependents. These people need less,they can stay at home with parents or share housing with others to lower overhead thereby surviving on their wages. They never have a sick child or lack of child care or other parent issues & if they aren’t worth it you can flat out let them go if they come in Hungover. That my Conservative friends is the state of play ", "child": "", "name": "1361_13", "parent": "1361", "title": ""}