{"content": "I’m a good person if I vote your way? I grew up eating ketchup sandwiches. I recall many childhood dinners consisting of a slice of white bread with a scoop of pinto beans poured over it with a slice of onion. On a good day, there was a chunk of salt pork in the beans so it at least tasted like meat. My dad spent years in an orphanage and never graduated high school. My mom suffered years of childhood abuse she never really recovered from. My brother is legally blind. I’ve suffered business failures, evictions, foreclosure, bankruptcy, layoffs, disability. I had an uncle that spent decades in and out of prison. I have five kids adopted from foster care. When we cared for foster infants, I even had a WIC card and a Medicaid card. Have you ever been up all night caring for a newborn suffering cocaine withdrawal? Oh, BTW, I’m still a conservative, but since I don’t vote your way, I’m not a “good” person? Are poor people who want immigration restrictions because high immigration rates lower their own wages and increases their unemployment “bad” people? Are the working poor who pay higher rent seeking a marginally better school for their kids and get mad because 40% of the kids in the school speak English as a second language “bad” people because they resent it? How about the working poor who don’t like trade deals that export their jobs or even the white collar tech workers training their own replacements by the tens of thousands? The people in nice suburbs who buy new nikes for their kids aren’t the ones barking in checkout lines, it’s working people who resent aid they don’t get. DO you think dirt poor coal miners who Obama decided were better off in the unemployment line are “bad” people for hating him? As for your comments about charity, why is it that self righteous progressives love to point at “evil” conservatives who supposedly want children to starve, when study after study has shown that conservatives donate far more time, material, and money to charity than any other group? The assertion that conservatives as a group are nothing but a bunch of racist self absorbed compassionless twits would be laughable if millions of progressives hadn’t convinced themselves it were true. ", "child": "", "name": "1361_11", "parent": "1361", "title": ""}