{"content": "Unless you are comfortable being a hypocrite, never complain about someone who uses stereotypes or expresses bigotry because you do it in spades. You seem exceedingly comfortable lumping “Conservatives” as a class of unfeeling, undeserving, “privileged” people, who had every advantage handed to them. Sure, you can always come up with an example of someone who succeeded that had it better than you growing up. That’s always going to be true, regardless of your starting point. But there is also going to be someone who had it worse than you and nevertheless succeeded. I grew up in a working poor family. I can’t even count the times my father came home early to tell my mother that he’d been laid off again, and then taking whatever dirty (and dangerous) job he could get in the meantime. I didn’t own a pair of pants that weren’t someone else’s before until I was fourteen and bought a pair with money I earned working as a substitute paperboy. We went without boots in winter (Michigan) and my glove had two mismatched fingers because my mother had run out of that color yarn and mine was the last pair she made out of five. We ate macaroni cooked with canned tomatoes three times a week and lunch was a single slice of bologna with ketchup except on Friday (tuna day). I hated them then and I hate them now. And although we qualified for welfare, my parents wouldn’t take it. After I left home I worked menial jobs and went to school nights (full time) for seven years, living on next to nothing, regularly working late into the night and weekends, all the while watching my “peers” get union jobs, take vacations, relax and start families. But “my” hard work paid off. With advanced degrees in a marketable area I managed to achieve a level of success that allowed me to provide better for my family and better than my “peers” who had opted for the quick cash provided by unskilled union jobs. And while I am exceedingly liberal on some issues I am also fiscally conservative. Perhaps that comes from having had to scrimp and work for so long to achieve what I have, which I believe puts me in your “Conservative” stereotype. So perhaps you can understand why I take a certain degree of umbrage at your bold declaration that my success was handed to me on a silver platter of privilege and not the product of my own personal sacrifice, hard work, careful choices, and, to a degree, innate talent, because it takes more than just hard work to be successful. Working hard at a job the buyer does not value much is not going to net much in the way of success. Could you find someone who had it worse than me? Sure. But you can just as easily find someone who had it better. So what? That’s true of everyone that enters this world. We are all simultaneously advantaged and disadvantaged by the circumstantial baggage existing when we came into this world depending on who you compare yourself to. But you can either lament the “privilege” of those that had it better, or focus on what you need to do to make yourself worth more to a customer/employer. I am very skeptical of anyone who is able-bodied who says there simply was no opportunity for them to succeed, regardless of where they started. ", "child": "", "name": "1361_3", "parent": "1361", "title": ""}