{"content": "Come on fellow Conservatives! Haven’t you gotten it yet? Birds fly because that’s their nature. Lions kill because that’s their nature. Progressives hate because that’s their nature. They lie, and steal, and cheat, and subjugate, demean, debase, and demonize. They are like ISIS who places land mines in the way of freedom. They used to wear masks, now they appear nakedly arrogant. Their only policy issues are chaos, destruction and loss of freedom. Their only gods are Alinsky, Obama and Satan. They blame others for the things they’re guilty of. Heck, but I’m real proud of them. They’ve come out from behind the facade of pretending to love, embrace and tolerate. At least they’re not even trying to hide it anymore. Gotta give them credit for at least that much. The only way they have left to prove any relevance is to hate, hate, hate. They’ve gotten real good at it too. Right up there with Hitler, Stalin and Mao. That’s where the Progressive ideology will take us if we let them. But our voices were louder than theirs. Their chihuahua barking into a megaphone attempt to seem more numerous isn’t working on us. The voices of freedom will always be heard the loudest wherever there are people who want to be free; free to choose, free to worship, free to truly love, free to decide our own best course free to reject the hate. The voices of freedom will always be strongest where it has been taken away, or is being taken away. May yours always be heard! And even as they refused to have God in their knowledge, God gave them up unto a reprobate mind, to do those things which are not fitting; being filled with all unrighteousness, wickedness, covetousness, maliciousness; full of envy, murder, strife, deceit, malignity; whisperers, backbiters, hateful to God, insolent, haughty, boastful, inventors of evil things, disobedient to parents, without understanding, covenant-breakers, without natural affection, unmerciful: who, knowing the ordinance of God, that they that practice such things are worthy of death, not only do the same, but also consent with them that practice them. Romans 1:28–32 ", "child": "", "name": "136_5", "parent": "136", "title": ""}