{"content": "What this article fails to mention is just how avaricious Google’s actions were with regard to declaring works “orphaned”. Google declared many works out of print that were in print, including editions of Harry Potter books by JK Rowling. Somebody in Google-land didn’t seem to get the idea that an edition that is out of print isn’t the same thing as an orphaned work. Many of my colleagues had their works declared “orphaned” by Google and found most of their back catalogue on the site even though new editions of those books were commercially available. Google decided that “not commercially available” meant “orphaned” and appeared to have no guidelines for how to deal with either. The settlement Google was trying to push included a publishing rights agreement: anyone who did not actively opt out of this agreement was considered by Google to have accepted it. That means any author who had not heard of the matter was to be swept along with it, no matter who that author was, no matter where in the world they lived. The agreement gave Google publishing rights to the works in perpetuity. Google’s plan was to be a publisher, not just a library. The agreement included percentages paid for sales of digital books and a plan to install print on demand kiosks. The payments arrangements were some of the worst I have ever seen (define “net”,) and,as I recall, included a $250 processing fee to be taken off the top by Google for cost of doing business inclusion in their database. So aside from the fact that Google was going to impose this contract on anyone who did not sign it, your book was in the hole $250 per book from Day One. An author with, say, forty books in their catalogue would have to earn out $10,000 just to see a penny in royalties from Google. The royalty arrangement would make it impossible for most authors to ever see anything from this agreement and it would be directly competitive with preexisting publishing rights agreements. It’s a nice narrative that Google was trying to give the world a great gift. However, Google was also trying to force a nasty digital publishing arrangement on authors, and a lot of us weren’t having it. ", "child": "", "name": "1406_13", "parent": "1406", "title": ""}