{"content": "I’m easily confused … in this case about the section “Let’s Test.” GenericProtocol requires a static (type-level) func named introduce()->Void. (Let me call it sIntroduce(). I’m easily confused.) Calling sIntroduce() on SomeStruct and SomeClass will compile because an extension on GenericProtocol gives them a default conforming implementation to fall back on. Additionally, if the associated type MyType is String (I need type names to be capitalized. I’m easily confused, remember.), another extension provides a convenience instance func, iIntroduce()->Void. (Still easily confused, the prefix will help me keep it straight in my mind, and may help you explain where I’m going wrong.) SomeStruct’s MyType is String, so the convenience-defined func iIntroduce() exists, can be called, and would cause “I’m Bob the String-ish instance” (“the String-ish instance” added because I’ve transcended easy confusion and arrived at prone-to-bafflement) to appear in the console. Also — but it’s not relevant here — both types (not instances, the types) would accept sIntroduce()->Void and print “I’m Bob the static” (because I’m not just easily-baffled but -confounded). First confusion SomeClass().iIntroduce() may be defined, but iIntroduce is defined as ()->Void. You shouldn’t be able to initialize anything with the (lack of) result. Am I right? Second confusion The next line is “let someStructInstance = SomeStruct()”. How is this an error? Providing a convenience func for GenericProtocol where MyType is String doesn’t add any uninitialized vars or lets to SomeStruct (if it did, the compiler would reject SomeStruct’s definition as nonconforming). Shouldn’t the instantiation should be correct, and valid to initialize a var? Did you mean SomeClass.sIntroduce() // compiles SomeClass().iIntroduce() // compiles SomeStruct.sIntroduce() // compiles SomeStruct().iIntroduce() // doesn’t ? Also, is the constraint “Self == SomeClass” just a simplified example, or is there a substantive difference from omitting that extension and simply defining sIntroduce() in SomeClass? If the latter, it’d illuminate something I hadn’t known. If the former, I might have said something like “… and by now the extension is so narrow we might as well have extended SomeClass directly. We’ve taken the technique so far it’s come full circle.” That would be an interesting perspective many readers would find helpful. The part about defaulting associated types is an eye-opener. Thanks! (Sorry for the code fragments in Roman type, I can’t find that style in the iPad Medium app.) ", "child": "", "name": "1483_7", "parent": "1483", "title": ""}