{"content": "To make everybody feel better, the dude who ran the National Groundwater Association back in the day, now works for Heartland Institute. He’s an expert on groundwater remediation and now anything from climate change to nuclear power. So there’s that for future water drinkers. And there’s that for folks selling home water treatment kits. Or bottled water. Nobody likes pesky environmental regulation in this gogo tech crazed age. Groundwater protection went from robust to nuanced over the years. For instance, there are different standards based on sectors of the economy: residential, commercial, agriculture and industrial. And there are standards based on functions within business sectors, i.e. downstream oil and gas may follow different standards than upstream. This would be refineries and gas station versus well fields and well field disposal. And there are standards based on groundwater quality as a source for potential water supply ranging from potable to industrial use and irrigation. Finally, there are standards for where the groundwater is at with respect to depth, hydrogeological characteristics and proximity to user(s). It gets even more complicated from there. That’s why hydrogeologist go into expert consulting instead of remediation contracting. The original goal for groundwater protection and remediation was to achieve as close as possible to drinking water standards for supply protection purposes and at impacted site boundary for remediation needs. Then for some reason it became all the rage to apply risk based corrective action (RBCA) for about ever thing involving groundwater. RBCA methods would allow dilution (along with other transport mechanisms like biodegradation and adsorption) to be considered as a solution to pollution. Assuming there was access and deed restrictions. And the quality was fine by the time the groundwater moved into the influence of a user’s well. Don’t worry kids, all those pesky job killing environmental regs will be a thing of the past. Make America Great Again. More importantly, you’ll have environmental nonprofits funding more and more studies to tell you how bad it is — but no nonprofits or responsible parties doing any groundwater remediation. But with lower taxes, our wealthy elite will have more money to help fund more nonprofits to study more groundwater sites. ", "child": "", "name": "1548_7", "parent": "1548", "title": ""}