{"content": "What’s wrong with the NFL today The Levi’s Stadium example  The debacle of Levi’s Stadium is a prime example of why the NFL is in a death spiral. The Hit Job wrote about this in early October: Who can afford to go to an NFL game anymore? I’ll tell you someone who can’t: me. Is it because I’m poor? In the eyes of the NFL, I guess I am. In actuality, between my wife and I we gross about a quarter of a million dollars a year. Do you know what is at the top of our list of things we cannot afford? NFL game tickets. And I’m not some casual fan. It’s not just as simple as the cost/benefit analysis we and millions of other football followers make. The NFL, through its escalating costs, has irreversibly altered the core of its fans that can attend its games. Ask the Bay Area 49ers fans who used to be able to afford the occasional ticket to Candlestick, but now can only watch their (currently hapless) team on TV. The new stadium in Santa Clara is very nice. It’s also mostly populated by the rich Silicon Valley tech winners … and fans of opposing teams. That’s right. The astronomical expense of season tickets plus personal seat licenses for your NFL team’s home games demand that you resell some, if not most, of your tickets to recoup your outlay. To do that, you’re going to sell to the highest bidder. Often, that’s fans of visiting teams. It’s not just in San Francisco, either. Ask the New York Giants & Jets fans how they afford their tickets to Metlife Stadium. Ditto for Cowboys fans at AT&T Stadium. And soon to be shaking down Los Angeles area fans for Stan Kroenke’s new stadium palace. Go to a Seattle Seahawks game at CenturyLink Field. If you can afford it. When I lived in the Seattle area, I attended several (years ago). One time, I went to a game courtesy of a friend’s season tickets. He barely cares about the Seahawks. Or team sports in general. But he’s got season tickets because he’s a partner in a local law firm. They buy the tix to treat important clients or occasionally reward employees. Those are your fans, NFL. The die-hards are dying off, because your hand is on their back pushing them out the door. But the looky-loos will show up, when gifted. So there you have it. Today’s NFL stadium attendee mix is made up mostly of the wealthy (who probably do not live & die by their team’s fortunes) and the die-hard followers of your opponents. Loyalty, schmoyalty. The NFL traded it for filthy lucre. For now. Google “Levi’s stadium half empty” and you’ll see a list of articles detailing the lack of attendance at most of the 49ers’ home games since the debut of the venue in 2014. How long can the 49ers and the NFL keep that up? Is the NFL in a death spiral?Once thought unkillable, has the NFL passed its expiration date?medium.com ", "child": "", "name": "1644_20", "parent": "1644", "title": ""}