{"content": "I do believe a lot of people might share articles, forward them or retweet/republish and simply don’t know how to (or that they should) credit the original author. Or they don’t know who the original author is. They may even suppose you were posting an article you found too. A lot of uncles and moms on Facebook are prone to that. But it’s sad when those who know better reproduce it as their own. It is criminal when someone goes so far as to create fake dates on their own website. You’re right, its not ‘clever’ so much as a byproduct of a lazy lack of morals. I don’t know this Vestil fella but it seems to me this is one of Thailand’s “Digital Nomads”. This is a loose collection of usually younger folks who would-be a kind of Amway/Scientology cult if they had the discipline. The idea is they become online entrepreneurs and live holiday lifestyles in Thailand where their earnings can afford more due to exchange rates. Usually they create these ‘Startup Success’ Brands about themselves and their life-beating keys to success, how they made it to a luxury lifestyles and a 4-hour work week. (they seem inspired by Timothy Ferris’ books though I don’t believe any relationship exists beyond that). Like some multi-level marketing schemes — the 2nd best idea is to have lots of hits, views and subscribers who may buy a book or bottle of vitamins through a link. But the main idea (like so much MLM) is to be the guy at the top of the pyramid. He wants as many fans becoming converts to emulate his lifestyle, show up in Thailand with their laptops asking how they can do it too. He has a seminar and so on. Well, again, I don’t know if Mikey Vestil is actually part of that world but all to say that the ‘digital nomads’ are easily tempted into copy-pasting and attributing it to themselves for as long as it works. I suspect most people wouldn’t even bother doing the work you did. They sorta count on that. ", "child": "", "name": "166_7", "parent": "166", "title": ""}