{"content": "I think your provocative article requires a provocative answer. While it is true that design is important, it looks like you have forgot about the other 95% of employees working in the company, who are not designers. In my opinion your article talks about how the world looks like from a DEPOV only! DESIGNER EGO POINT OF VIEW = DEPOV — Everything is related to design, — Everybody must participate, — Everybody must contribute, — Everybody must take responsibility. Yes that is true from a designers point of view. But what is with all the other roles, equally important in a company. If that is true for design, then it must be true for all other roles in the company as well! We are all managers, we are all responsible for HR, we are all responsible for accounting, we are all responsible for marketing, we are all responsible for customer support, we are all responsible for sale activities we are all responsible for everything! This looks like a company where everybody is responsible for everything! — — Isn’t everybody also involved in all other fields as well? Is design more important than all those other disciplines? I don’t believe designers are more important than any other group of employees in a company. I don’t believe they deserve extra treatment because they think they are exceptionally talented and gifted. CEO’s, HR-Managers, project managers, programmers, maintenance staff and all other employees must also be extremely creative to solve all their daily problems, the only difference is they have no canvas to paint on, and not beautiful layout to show around and brag about. In addition my experience is, that companies where everybody thinks he is in the driver seat, are companies that are not very efficient. The reality is: a plane has one cockpit and there are only one or two seats for a pilot not everybody can be leading the way! To sum it up: I find it disturbing, that many designers think of them self to be extra creative and everybody shall recognize their exceptional contribution to a successful product. Yes it is true, designers contribute, but designers without programmers, managers, accountants, sales employees can do nothing, except nice designs nobody needs because they are applied to nothing. My guess is, your design decisions equally influence all other areas of the company like profits market position, efficiency, success etc., but I doubt you have deep knowledge of each of them! And I also doubt you are equally emphatic to all other roles and their needs in a company. Product development is first and foremost TEAMWORK. And yes, designers have an important responsibility, but they definitely are not more important, then all the other team members! ", "child": "", "name": "16_9", "parent": "16", "title": ""}