{"content": "Minimal Exercise Works, and Works Best source: Ana Gabriel via unsplash Gretchen Reynolds of the NY Times recently wrote about the work of Dr. Hiroshi Nose, a researcher in Japan, and his colleagues on a regime of walking exercise: They knew that walking was physically the easiest (and also the most practical) exercise for those in middle age and older, but the researchers suspected that people might need to push themselves to achieve the greatest health benefits. So they created a regimen consisting of three minutes of fast walking at a pace that Nose says approximates a 6 or 7 on a scale of exertion from 1 to 10. Each “somewhat-hard” three-minute spell was followed by three minutes of gentle strolling. In their original experiment, the results of which were published in 2007, walkers between the ages of 44 and 78 completed five sets of intervals, for a total of 30 minutes of walking at least three times a week. A separate group of older volunteers walked at a continuous, moderate pace, equivalent to about a 4 on the same exertion scale. After five months, the fitness and health of the older, moderate group had barely improved. The interval walkers, however, significantly improved aerobic fitness, leg strength and blood-pressure readings. This is not some aggressive triathlete training, and only requires 90 minutes of walking per week to have a significant impact on fitness. Nose points out that this can be spread out or compressed, if necessary: “Perform the training for 10 minutes in the morning, 10 minutes in the afternoon and 10 minutes in the evening,” Masuki suggests. Three days of exercise per week is best, but if that’s too challenging, she says, “do it on the weekend” and cram the workouts into two days. Other recent research suggests that overtraining can be detrimental. Danish researchers looked into jogging, and found that joggers outlived those that did not exercise. However, they turned up the odd fact that slower joggers tended to outlive faster runners: […] when the researchers closely parsed the data about how much and how intensely people jogged, some surprises emerged. The ideal amount of jogging for prolonged life, this nuanced analysis showed, was between 1 hour and 2.4 hours each week. And the ideal pace was slow. (The researchers did not specify exact paces in their study, using instead the broad categories of slow, average and fast, based on the volunteers’ self-reported usual pace.) Plodding joggers tended to live longer than those who ran faster. In fact, the people who jogged most often and at the fastest pace — who were, in effect, runners rather than joggers — did not enjoy much benefit in terms of mortality. In fact, their lifespans tended to be about the same as those who did not exercise at all. [emphasis mine.] So, it appears that exercise in modest amounts can have big effects, and if you over-exercise those gains may be wiped out. ", "child": "", "name": "1710_3", "parent": "1710", "title": ""}