{"content": "“ In fact, apparently, just weighing yourself daily can be enough to get you to lose weight, and is associated with being able to keep weight off in the long term.” For the record, NOTHING is really associated with being able to keep weight off in the long term, most definitely nothing that can be labeled or perceived to be a ‘diet’, and certainly not checking your weight daily. Only people pushing diets are going to tell you that, because it serves their agenda. Regularly looking at the scale is an impediment to maintaining a healthy lifestyle beyond shaming and worrying about minor fluctuations, because you become so focused on numbers which don’t really mean anything, instead of actually healthy behavior. Talking about 2 lbs unto itself is strangely useless to your goals, because your weight can be 2lbs different at the end of the day than it was at the beginning of the day. The number on that scale isn’t what makes you healthy or unhealthy, or what makes you fat or not fat. Dwayne Johnson’s BMI says he’s morbidly obese. Even factoring in your own personal height, frame, and ‘normal’ weight doesn’t make the number of pounds you weigh useful information. If you want to maintain weight loss, the only way to do it is to not only limit your carb and/or calorie count and increase your activity, but to CONTINUE that exact same behavior indefinitely. If you are a person who puts on weight whenever you’re actively trying not to, nothing you do will ever change that. That people can work to the point where they can maintain their weight without as much active effort is one of the biggest myths of the diet and exercise industry. But if the way you do that is by looking at the scale regularly you’re not being chill about it, you’re basically continuing to goad/guilt yourself into it. If you REALLY intend to be chill about fluctuations, I would never look at a scale more often than once a week. In fact once a month would probably be a lot more chill. And yeah, you might not realize you’re putting on a little weight, the instant you’ve put it on , and be able to instantly do something about it — but if you do realize it, and you’re constantly course correcting to control your weight, you’re shaming yourself into a set of behavior anyway and there’s nothing healthy about that. ", "child": "", "name": "1717_14", "parent": "1717", "title": ""}