{"content": "Been there, done that.To be honest, yours sounded a lot like a self-motivating piece of writing (which is absolutely fine, by the way). My journey has been pretty much a sudden event as one year ago, I wasn’t even trying to lose weight. I was fine with my overweight body, then I moved abroad and unconsciously realized that I was tired of eating pasta everyday (being Italian can be both a curse and a blessing when it comes to food), which led me to eating a lot healthier without even realizing. When I came back to Italy, everyone would point out how much weight I’d lost, exaggerating the comments more often than not — I believe envy had a lot to do with that, even if they might not even have realized that at the time. From then on, I kind of started, er… enjoying my new body? I could wear clothes I hadn’t been able to fit in in a long time. Oh, the happiness! That was also the time when I read ‘Eat to Live’, which is a great book, by the way. But it depicts an approach to food that you can’t commit yourself to, I’m afraid — unless you live by yourself, that is. Right now, I’m at that point where I’ve lost most of the weight I wanted to lose but gained a few pounds back, what with the Christmas holidays, Easter and the delicious pizza I can’t absolutely give up. I do agree when you write that if you don’t like your current situation, you’d better act now rather than later, when it might be much, much harder to shed those unwanted, chubby pounds. The way I see it, society has a distorted idea of what a healthy body actually is. On those rare occasions I’m watching TV, I still get shocked when I’m having lunch and being presented with snack ads immediately being followed by diet pill commercials for women (always for women).And why should I be shocked? The society that “nourishes” us with food that gives us zero nutrition and hundreds of unnecessary calories is the same society that profits on our body image issues.As a consequence, I think, people have picked up today’s society standards, that is — everybody striving to be perfect like (fake) models but still having no idea what a healthy lifestyle is. Hence the “overweight is not the end of the world”. This is not about body shaming. I was overweight myself and I liked my body well enough. This is about acknowledging the fact that the food industry — and the fashion industry — really fucked our standards up. “I blame capitalism”. Alas, me too. So, definitely. Better act now than later.(On a side note, I didn’t want this to end up turning into a long rant, but it did. Sorry.) ", "child": "", "name": "1717_4", "parent": "1717", "title": ""}