{"content": "A fascinating insight into your personal drivers and how they have affected you. I am though surprised by one of the statements within the article, ‘So it’s no surprise that the military — which has much more at stake in performance — has discovered the power of sleep, too.’ This infers that the military has only recently discovered that service personnel perform better for having regular sleep whereas from my experience of 22 years in the military, this is something that they have always known and enforced. I was in the British Army though, not the American Army and so maybe this is new to the American military although I would not believe they were so different as we shared so many basic values. I served in NATO alongside my US brothers in arms and we all understood the value of ‘an army marches on its stomach and performs best after rest’. An adage that has served the British Military extremely well over the years from the days of Sir Francis Drake, through Nelson and Montgomery to today in places such as Iraq and Afghanistan. Personally I have followed this old military adage through my civilian career taking rest whenever I can and ensuring that I have adequate time off from work that is ‘true’ time off with no interruptions from work. As I work in many time zones at the same time with frequent travel an aspect of my life, I have also learned the value of technology for conference calls, sleeping whilst on a plane, train or in a car, delegating lower value decisions to free time to prepare for other higher value items etc. The military prepared me well and I would have thought that the American military would have prepared their ex-service personnel just as well and that in fact many so called ‘life lessons’ could be taught by the military to their civilian counterparts. Sleep and rest (two different things) are equally as important to ensuring optimum performance whilst at work, something I am sure the American military has always advocated. ", "child": "", "name": "1721_21", "parent": "1721", "title": ""}