{"content": "Here is my deal, Shaunta. I joined your mailing list — I am probably one of that first batch of 13,279 — because of what I have said many times before: I love to write, yet I do not want to be a writer. Along with a lot of other documents of all kinds, I read pretty much everything you write online; some of it fits nicely in the ‘I Need That’ cabinet and some goes in the ‘Not So Much’ drawer. I admire your “prolificity.” How you do all the things you do and write as much as you do makes me wonder if you ever take time to, oh, I don’t know…sleep? I have two blogs. One of them is specific to my own relatively new pasttime of genealogy. In it, I describe what I find, the brick walls I have encountered, and other things related to my family tree. (http://www.wilkinsongenealogy.info) The other, https://denalidad.blogspot.com, is a blog I started just to write down those random thoughts I sometime think should be written down. I increase its size sporadically and often start things I do not finish. I started writing something longer than a blog post a year or so ago, but I have no idea what to do with it, so it stays in draft form, unpublished and visible only to me. And that is my issue. Since I am not motivated to “become a writer,” neither of my blogs is monetized nor will I seek to make money from them. Mostly, I write for me, though I hope the information in my genealogy blog is useful/helpful to other novice genealogists. My lack of reason — if that is what it is — seems to have been more of a “perchance to succeed” process than anything else. I am retired and stay busy doing all kinds of things; blogging, working on growing my own family tree and beta testing online commercial genealogy sites, and so on. It is why I read your words. I seek those tidbits of information that can grow into knowledge that will become action for me. I feel the need for direction, though I do not know what that means for me. I want “to do something” and have no real clear path on how to get there. I am not sure I even see the path. So, I am happy to be one of the 100,000 to meet your own goal and appreciate you writing for whatever reason you write. One day, I might finish that “thing” in my mind and will publish it somewhere, perhaps Medium. Or not. The tidbits are there; I will keep looking. Thank you. ", "child": "", "name": "172_8", "parent": "172", "title": ""}