{"content": "Merci Quentin pour ton article. CAE Quid des CAE (Coopérative d’activité et d’emploi) ? Tu n’en parles pas dans ton article. Le gros avantage de la CAE c’est qu’elle t’accompagne dans ta connaissances des règles de gestion d’une entreprise afin de te rendre autonome. C’est pour moi un bon pied à l’étrier pour celui qui souhaite se lancer. Auto-entrepreneur Le régime auto-entrepreneur à été prévue pour avoir un activité complémentaire en PLUS d’une activité salarié. C’est un régime qui n’est pas adapté pour une activité temps plein. En effet il y a moins de charge en auto-entrepreneur, tout simplement car tu ne cotise pas aux mêmes choses. Avec moins d’obligations tu as donc fatalement moins de droits : couverture social, chômage, retraite… Je trouve donc dommage que tu incites les freelances qui se lancent à passer en auto-entrepreneur. Pour moi quand tu te lances tu choisis le portage salariale ou la CAE et ensuite quand tu fait suffisamment de CA (+70k€ / an) et que tu te sent prêt à gérer toi même ton entreprise avec les enjeux légaux, fiscaux, comptable et de gestion qu’il y a derrière alors tu peux te poser la questions d’avoir une structure type SA, SASU, EI, EURL ou autre. Je rajoute à cela le fait que certains statuts sont assujettis au RSI. Les relations avec le RSI sont difficile car c’est un organisme opaque avec des règles qui évoluent, peu simple à comprendre. De nombreux entrepreneurs vivent très mal la relation avec le RSI, ce qui peux dégouter celui qui souhaite entreprendre en plus du coût. En France créé une société ne coûte plus grand chose, par contre devoir la clore coute plusieurs milliers d’euros (au minimum 3000€). Peux-tu m’éclairer sur ce conseil pour le statut auto-entrepreneur ? Au plaisir d’échanger à ce sujet,Pierre ", "child": "", "name": "179_20", "parent": "179", "title": ""}