{"content": "Hey… There is something to being naive and an ‘uncarved block’ in The Way of Pu Bear… Innocence (relative un-jaded worldly-ness) is underrated. Resonating your light-bearing-ness is as it goes… Those that can benefit will eventually find you… without manipulations. Not that that is wrong, it’s just another way. I often feel there must be a sheer ocean of numbers of contributors here, that I haven’t even scratched the surface of discovering. I lament a bit to not having the time (as seems do others have), even to keep up with all those I do admire and have interacted with from time to time. Make no mistake, it all comes around…* I am not even here as much as I am inspired to be, but that just makes the times that I am all the more precious. There was a time on Medium, where there were complaints of the quality of writing. Perhaps that is/was true. Perhaps I number as one of them. (Not fishing for compliments…) I thought this was rather presumptuous because one can follow and recommend whomever they choose… simple. Those posts seem to get crowds of agreement… Was it because they were ‘well-written’ or because they were written by friends, or because the content — the subject itself was so titillating? Does it matter? I say ‘do your thing’ and get on with it… Keep it movin’…* The other thing is, what is often called click bait, can include the topics of the day… especially those subjects concerning our heated political issues… they are important to be aware of, but the over lingering hyper-focus of the (usual?) negative perspectives is overwhelming. It would be helpful if there were more instructive suggestions for constructive solutions. It would be helpful to see insights to positive alternative perspectives in general. The energy building behind the negative(s) makes much more of it… BHD, keep doing what you do, as you do that so well, somehow I found you out of the sheer ocean of numbers, and that counts to me.* ", "child": "", "name": "1861_1", "parent": "1861", "title": ""}