{"content": "52-Week Writing Challenge Accepted! I’m Writing Letters to Everything. I’m excited to start of the year with a writing challenge of fairly reasonably sized proportions! As a part of the 52-Week Writing Challenge, proposed by The Writing Cooperative, I’ll be publishing one letter each week. My commitment for this challenge is to publish one personal letter from me (or not?) to something or someone each week. Sometimes I’ll choose the recipient of the letter. Other times I’ll let you and/or the members of The Writing Cooperative choose (you can join here if you haven’t already). For a quick example of the type of letter I’ll be writing check out my last letter to my all-time favorite sweet treat: Dear Haribo Gold BearsWhen this all started, I didn’t want to admit that your flashy packaging was even mildly enticing.medium.com I’ll publish these each week with the tag “52 Week Writing Challenge” and you can also find it in the ReplyAll publication: ReplyAllWe write letters to anyone and everything across all of time and space. Nothing is off limits except limits themselves…medium.com Since we are already in week 1 of the challenge, you can expect my first letter soon! You still have time to jump into the challenge or contact me if you just want to write a letter to something yourself. We’ve had a few great contributions already this year and I would love to see what all of our lovely brains can come up with.  ReplyAll needs more writers! Do you want to write letters to your favorite or least favorite things? To someone you never met and really want to? To someone you see everyday and wish you didn’t? To yourself in the past or the future? To your dream vacation destination? To Platapi, echidnas, or three-toed sloths? Well, you can and you should. To be added as a writer for the ReplyAll publication, send a letter draft to: replyallmedium@gmail.com Everyone loves a letter! ", "child": "", "name": "1869_13", "parent": "1869", "title": ""}