{"content": "Hey Jeff, thank you for this story. I was diagnosed with inoperable prostate cancer two months ago. I am being treated at MSKCC with a hormone blockade. My first scans showed the cancer had spread into my bones and lymph nodes. Before I was ever diagnosed I had watched with interest documentaries about fighting disease with nutrition (Forks Over Knives; The Gerson Miracle; Food Matters; Fat, Sick and Nearly Dead, etc.), just because I have always had a healthy skepticism about western medicine. So, when I got the entirely shocking news from the Dr. that I had stage 4 metastatic disease, I immediately changed my lifestyle. I went vegan/no flour/no refined sugar. Besides eating a lot of leafy greens, legumes, grains, nuts, etc., I’ve also incorporated many things into my diet that have cancer-fighting properties. For example, my morning smoothie includes a low-glycemic fruit, a handful of leafy greens, a root vegetable and usually a bell pepper and then iodine, turmeric, acai, cacao, spirulina, wheatgrass, cinnamon, flaxseed oil, essential oils (frankincense), hemp seeds. I also give myself daily coffee enemas and have one weekly colonic, as the relationship between intestinal health and one’s immune system being clean is well-established. I’ve also been treated at The Center for Innovative Medicine (CIM) in NYC, which offers a number of therapies which are also found at Paracelsus Klinic (though not hyperthermic treatments). Overall the effort at the CIM has been to de-tox my body and power up my immune system. I have rid my body of a lot of toxic metals, and parasites such as lyme, candida, fish tapeworm and roundworm. Since I started all of this two months ago, my PSA is down to 1.7, there is no more cancer in my bones. But the western docs are still saying that they want to operate sometime in the early part of next year. They aren’t sure whether my results are due to the hormone-blocking drug or not. So I am researching going to a clinic where I can make more progress, to the point where I do not need surgery. My first question is: what about Gerson in Mexico? Did you consider that one for your wife’s disease? ", "child": "", "name": "1885_11", "parent": "1885", "title": ""}