{"content": "I enjoy Justin Jackson’s writing, but this post is a tad over the top. This pattern is evident with all employers, but let’s use startups as an example. Using sweeping statements like this (all is a fairly encompassing categorization) lead to trouble. I appreciate Justin’s point, but it was delivered to give employment an unfair light. First, we live in pretty good times. Workers of our day (re: most of us) enjoy far greater working conditions than most of mankind, historically speaking. Even the unglamorous jobs of 2016 offer benefits that most of our ancestors would appreciate (let alone people from less prosperous countries in our own time). Considering that Justin is widely referring to people in the tech industry, the oppressive tone of the article is misplaced. We’re not talking about coal miners here! Second, the mantra of “make your own stuff” can become an idol, an obsession. His answer for the worker being taking advantage of by his/her employer? When you get home from work, do some more work … but for yourself. I know, I know, creating your own stuff is fantastic. It truly is. But it has to be kept in the right perspective, and communicated in the right way by those with some success. If by “make your own stuff”, we’re including things like making pottery with your kids, canning some hot pepper jelly, or recording music no one but you will ever hear, then great. But if we’re encouraging people that their job, which allows them to provide for their family, is not enough and you need to hustle, you need to do your own thing … well, we might be setting people up for failure and disappointment. Working for yourself is great, don’t get me wrong. But I’d suggest working for someone else can be great as well. Justin makes the case that companies are now using familial language to talk about employees and how that’s a problem. Truth. But if the only alternative is for everyone to go home and short shrift their families in order to “make stuff”, is that any better? Knowing Justin, he feels the same as I do, but the article could leave one with a different impression. Vocation is a part of who we are … but it’s just a part. ", "child": "", "name": "188_24", "parent": "188", "title": ""}