{"content": "pcynyc, the CBB pod punditry has been talking for a bunch of weeks now about what’s unusual with THIS season is the two-fold coincidence of, OTOH, there being a record number of school teams (10 to 20, depending on who assert it and when), any of which could credibly make the Final Four, and any one of them capable of being a credible national championship winner; and, on the other, there being a nearly palpable, data-supported gap or No Teams’ Zone between that platoon of credible potential winners and the rest of CBB. The corollary to that is, if that view is accurate, then the said“rest” would, logically, be made up of the largest contingent of March Madness fodder we’ve ever seen. That, in turn, would seem to provide pretty much a complete explanation for why what you call “boring” is actually an illusion, produced like a noxious smelling by-product from the co-existence of those two characteristics. Alternatively, or in addition, I don’t know any true aficionado of CBB who thinks of it that way. But March Madness, AOT, particularly when it happens to fall within a year when two thirds of the country fears we just entered the Dark Ages & the demise of the American experiment, features (this year being the only one I know of since basketball’s invention), somewhat along the lines of the nearly immediate exponential expansion of spacetime that brought about this universe in the first place, a rapid & unfathomably large expansion in the numbers of those paying close attention to CBB. IMO it’s analogous to what happens when an ancient MLB franchise that hasn’t won a World Series in over a century emerges as the game’s best team: a lot of folks who normally don’t watch MLB much if at all (because it’s “too long” and “boring”) suddenly start watching with what they imagine as studious intensity (I mean, decades ago they used to play the game in Little League and at a few office beer socials, so it’s not like they’re ignorant of the finer points & the modern game’s essential rhythms or anything.), only to emerge with, ‘Happy for the Cubs, and all, but jeez, baseball takes way too long — and talk about bbbbbooorrrrriiiinnngggg!’. Looked at for what it is, not what some think it should be, this is setting up for being an historically great March Madness — just starting TODAY, at the 32s level (just not at the 64s level, where that one thing some vaguely remember happening in the imagined past somehow came to embody 50 years of ‘typical’ March Madness). ", "child": "", "name": "1986_3", "parent": "1986", "title": ""}