{"content": "Maybe, just maybe… Virginia Tech will be too. The team has multiple playmakers and finally, a scheme that serves the talent well. As long at they don’t make plays for the other team they can score as explosively as the 2010 Tyrod Taylor unit, and the 2005 Marcus Vick led squad. A common thread perhaps though would be that those teams also lost it’s two most high-profile contests. Can the DNA have changed slightly with the regime shift? If you’re familiar with the program in Blacksburg, you’d know that things moved at a tectonic pace. As long as Beamer was in charge, things would be predictable. Ultimately things grew as stale as the exhausted rhetoric surrounding our mystical Special Teams acumen. Truth be told Beamerball had become far more costly at it’s depths, than it had ever been profitable at it’s peak. Particularly in big contests; ST had begun to fail us on the big stage as early as 1999 in the Sugar Bowl when Peter Warrick and blocked kicks and missed FGs (along with a goal-line fumble that prevented VT from scoring in the first few plays, it woulda been a Blitzkrieg, Ice Bear’s convinced). But this year, the ST has been a boon. Huge return game from Stroman, blocked kicks that lead to points, pin shutouts on teams. Aside from self-inflicted wounds at the gratuitous NASCAR affair, this team has the ingredients to compete for an ACC title. Whether that’s enough to enter them back into playoff talk is way premature. I still believe they have a loss in front of them. But a 7–1 record in the Coastal with the right set of criteria gets them in the title game vs front-runner Clemson. Next week on the road vs Carolina, who will have to be emotionally flat after the tremendous effort yesterday, will be critical to any VT delusions of grandeur. After several teams in the 16–25 range lost, the Hokies might find themselves ranked next week. We know the Heels will be. Let’s just remember there are 8 games + a title game left. The Coastal has a little more life than usual this year. ", "child": "", "name": "2006_1", "parent": "2006", "title": ""}