{"content": "Thank you for your story. I also lost a significant amount of weight (200 #). While that number astounds some people, it was’t difficult at all to gain that couple pounds a year (medications exacerbated and exponentially escalated the increase; nearly dying from a misdiagnosed reaction to antibiotics with muscle wasting spurred the loss). It was hell getting the rest off. I literally disappeared. I do not recognize myself (neither does anyone else and THAT freedom was astonishing). Kept it off for two years now and completely changed daily habits will keep it off. For one, I no longer “eat my feelings”. I learned an astute lesson: Starving your feelings is so much better! You don’t confuse your mind nor your body when you stop “rewarding” bad feelings with bad “food” choices that compound everything. But I wrote you to say this. I made the error of writing deeply personal items in an attempt to purge demons. What a shock to see that hundreds had read what I posted. Then the very real world intruded on my word/head space as I realized I’d published my no longer private nightmares to a place where people associated with my husband’s job could read. Panic!! What did I post in anger? Oy jeez. Having been so comfy in my “nobody gives a shit” cocoon was startling painful as my chrysalis split and my new realization emerged. But I could do nothing but wait to see if my writings were deleted, hidden, dried up. I was paralyzed with fright of judgement by people that could make life changing decisions that would change our lives. NOT a good head space to be in after the catastrophe of surviving the passing of other family members of whom I’d rhapsodized. Dead men may tell no tales but their relatives will! Anyway. I now face another conundrum. I’ve a new writing, literally hundreds of pages. Yet, I cannot show it as it directly impacts real live people in the world today as it is the too true story of my life and the events thrust on me by players I didn’t even know existed until unfortunate discoveries were made. Unethical methods used to discover unethical betrayals. What to do? I keep writing. One day, real events will lead me to the final ending and edit. Thank you for your article. ", "child": "", "name": "202_17", "parent": "202", "title": ""}