{"content": "Darius: I wonder what possesses us human beings to have the urge to elevate one thing or person by means of putting down something else or someone else. That’s quite a self-limiting approach when in reality there’s plenty space for everything and everybody in this world. Mr. Paulo Coelho is a writer of writers. I’m sure any of us would love to write the way he does (superbly). One of his most famous book, The Alchemist, isn’t meant to be a self-help book. It, however, has become such because readers have turned it into one. The life of Mr. Coelho, especially his youth, deserves respect and admiration for fighting back to become the writer he — without a doubt — has become. Writers come and go, but some standout for life, and there’s a reason for that to be the case. Some of that has a lot to do with the evocative congruency of the author’s work. The going to places where others didn’t or haven’t, the way of taking care of the reader without spoon-feeding every word, every thought. To live in a world totally full of Either Or is way too limited. There’s plenty of room for all sorts of authors. Each of them brings a nice offering (book) to a very intimate gathering (the author and the reader). Your comparison — Way better than — made me think of Gabriel García Márquez (aka Gabo). I can’t imagine myself (or anyone as a matter of FACT) giving a higher rank to another author by saying this or that writer is better than Gabo’s One Hundred Years of Solitude. That’s exactly, as in identically, you comparing another writer with Mr. Coelho — who hasn’t become a writer without personal struggles. Mr. Coelho has mastered his craft beautifully and professionally. We would be lucky to achieve the great success and respect he has earned — emphasis on earned!‼️ Enough said! Thanks for the pondering I had to do with your article. Much appreciated!📝 ", "child": "", "name": "209_6", "parent": "209", "title": ""}