{"content": "Being an old veteran of the film industry which I equally love and hate, I have been predicting the demise of the industry for a long time. But I think my observation is too harsh. Films are not going away. They are a classic part of our artistic culture over the past 100 years. But the film watching experience is definitely going to change. The era of the 1970s (Studios giving directors creative control) and the 90s (Independent film distributors finding the next generation talent that still makes the best films in our present day) are long over. Hollywood has been terrified of turning itself into the music industry (Where the large corporations have killed the value of music through price reduction and bad financial payouts for “listens’ or “views” online). But a reckoning is going to come. Independent film companies are likely done except for studios that fulfill a certain niche (Streaming sites like SHUDDER fit into this category also). Movie theaters are going to become multi-sensory experiences (Think VR, AR, Chefs cooking you dinner during the show, etc.) only used for big budget blockbusters. The small independent theater is also going to become a remnant of our past. I think Netflix and Amazon are the future homes of mid sized and independent film whether we want to believe it or not. But I do see one positive thing that can occur from all this turmoil. Once Netflix and Amazon started creating really good television shows on their service, the cable channels really stepped up the quality of their programming. We are definitely in the golden age of television series. If Netflix and Amazon can have the same effect on the independent film scene, maybe we will have another film revolution like we had in the 70s and 90s. Because the last decade and a half of Hollywood movies has been a slow, putrid decline (An industry which is addicted to the comic book movies which pay all the bills) while taking very few chances on new properties. So I look forward to seeing what the final effect of the digital streaming revolution is going to bring us. Maybe all of the problems facing the industry will go away. ", "child": "", "name": "2232_22", "parent": "2232", "title": ""}