{"content": "It’s the “Premium Content” model that could prevail. Offer a free service with added perks for those who’re willing to pay. A Netflix of Writing would be great too! But we still have a world with the perception that everything should be free, and there’s those who don’t appreciate the work that people like you and I do on the web. Just look at the hundreds of millions of people on Youtube who state things like, “You don’t work that hard”, “hope you end up broke and homeless”, “get a real job”, kill yourself.” This is the thanks that Youtube creators get for working 80+ hours a week. These people aren’t gong to pay for anything, they have nothing but hatred for humanity, and the last thing they would ever do is willingly support the web. Google insists that if the web adopts an acceptable ads policy, that people will magically stop blocking ads. Just goes to show how out of touch with reality Google executives truly are. People are going to block ads regardless, because they don’t care about anyone but themselves. America especially has turned into the land of the self-centered and self-righteous. I’ve had 4 years to analyze the online behaviors of millions of people who made use of my media, and sadly, I’ve learned that people in general are not good, and have zero good intentions of any kind. When there’s a system of accountability in place, people will act and behave a certain way because they’re scared of being reprimanded. Take that accountability away, and they will barf all over each other. A comparison of Google+ vs. Youtube would be a good example of this phenomenon. As for the want and need of publishers to “find another way”, the fact of the matter is that the traditional advertising model isn’t failing for everyone. Just look at Facebook, Google, and others who continue to rake in record profits year after year, and its all from traditional ads. Even if the world of web publishers managed to prevail and make subscription based models work, Google would just find a way to suck all the money right out from under them (paywalls, internet road blocks, dragging publishers through years of ongoing litigation, etc). Companies like Google and Facebook aren’t happy with having some of the money, they want all of it, and so far they’ve prevailed in getting all of it. So, its not that the traditional ad models the web are used too are dead, its that we have a few power players who’s greed knows no end. I think the biggest problem we’re facing in terms of the future of the web isn’t finding new revenue models, but rather finding ways to break past our society’s state of moral decay. As long as the John D. Rockefellers of the web remain in power (Facebook, Google, and others), those who work so hard to contribute to the web will never be rewarded for the work they do. ", "child": "", "name": "232_3", "parent": "232", "title": ""}