{"content": " How to Be Sold Nothing (Unless It Makes Sense) Basics of self-defense against the emotional sophistry of sales “people” By MARTIN REZNY I’m generally the kind of person who is exceptionally difficult to trigger, but I guess there are some statements the only logical response to which is anger. In the interest of avoiding the improper use of pathos in my argumentation and thus defeating my own point, let me convert most of my anger to logic and explain thoroughly all the levels on which the above article is wrong. But let’s start with a little bit of ethos and context first, as there’s nothing wrong with facts that are true in a non-misrepresented way. The fact is I’ve been a debater for about fifteen years now, and if you’re the sort of person who cares about winning (which I’m not), know that I have won many debates and a number of awards. I have been a judge of speakers at competitions for about a decade of that time, and a host of international debating tournaments and exchanges for the last six. I also have a formal education in philosophy, which I seriously doubt Charles has. Why, you may ask? A question — how well do you know the work of Aristotle, and specifically the Rhetoric that Charles references? Don’t worry, you don’t need to know it at all, since a five second google search would lead you to a one page book preview of Alan Brinton’s Pathos and “Appeal to Emotion”: An Aristotelian Analysis, where he on that singular page immediately quotes Aristotle and his opinion of the use of pathos directly from the Rhetoric: In the first chapter of Bk. I of the Rhetoric, Aristotle complains that current rhetorical treatises place too much emphasis on influencing the emotions of hearers (“judges”). “The arousing of prejudice, pity, anger, and similar pathe has nothing to do with the essential facts, but is merely a personal appeal to the man who is judging the case. (…) It is not right to pervert the judge by moving him to anger or envy or pity — one might as well warp a carpenter’s rule before using it.” Nothing new under the sun indeed, it seems that such rhetorical treatises have remained current for over two thousand years. In case you’ve never heard of the eternal clash among the great speakers, there are two basic camps — the sophists, the salesmen and politicians interested only in winning, and the philosophers (“lovers of wisdom”), represented notably precisely by Aristotle. Now you may begin to see what irks me so much about Charles’s article — what he did was twist Aristotle’s words to serve the purposes of the sophists, his sworn enemies. Let’s break down some of the exact Charles’s words: You don’t need logic to make people take action. Sure. You can just yell at them very loudly. Or shoot every tenth person until they comply. Or stage an impromptu puppet show to confuse them. The possibilities are endless! Let me offer a counterproposal — maybe you do need logic at least sometimes to have people NOT take certain actions that are not in their own, or anyone’s, best interest. And if it currently is so that people can be compelled into action by some sort of illogic, maybe it’s not right that it is so, and doesn’t have to, as well as shouldn’t, remain so. In the interest of not mincing words, when someone tries to circumvent one’s free will and better judgement by some sort of cheap and dirty argumentation trick, it’s not persuasion, it’s called deception or coercion. But let’s read on: Logos is seasoning on the steak. It makes it taste better, but it’s not a necessity. You know what, let me just quote Aristotle through Brinton again: “Such appeals (to emotion), he says, are mere “accessories” and not an essential part of rhetorical proof.” Well, you don’t get more spin that 180 degrees. I’m beginning to think that Charles may actually be pulling a masterful prank. If he’s serious, on the other hand, it is a sign that sometimes logos and the essential facts that come with it would better be involved in the making of one’s argument in order to prevent having to consume a black bird that rhymes with “Jon Snow”. Persuasion and salesmanship get a bad reputation. We associate it with liars, cheats and the ugly side of capitalism. The point being…? But this isn’t always the case. Oh, so there was no point. Not exactly a way to put people at ease by admitting there are significant harms in all but (presumably) few instances. But it’s an honest and true statement, so, points for that, I guess. Persuasion is a tool, and tools are amoral. A childish side of me would like to say “…as is the author of this statement”, and so it does. I suppose that on some fundamental level, one can use anything for anything — knife to butter a toast, iron maiden to make lots of melon juice, or a nuke as a paperweight. Unfortunately, tools tend to be designed for a purpose and purposes can be all kinds of immoral, as is a mindset that sees language or humans as things to subvert and exploit. But there’s no point in beating a dead horse any further. You may have noticed that my reasoning is not devoid of pathos, namely sarcasm, but it is logos first. You’re not supposed to agree with me because I was made angry by an objectively infuriating set of statements, or because I may have been funny in my retorts. You’re only supposed to agree with logic, and only the kind of logic that is able to stand against equally logical criticism. That is, if you care about the truth or wisdom, like the philosophers in the line of Aristotle. It is possible that my logic has not persuaded you, but if you can defend your disbelief with logic, you have all of my respect. If I have failed to persuade you on the grounds of logic, or if you agree with me based on anger or humor alone, it is not I who has a problem, and a problem you do have. Fortunately, it’s a fixable problem, for the most part. But of course, the salesmen don’t want to fix it, that would get in the way of exploiting it. Just like the world of computing has black hats, the world of the world has asshats, and step one in being able to defend one’s own mind from appeals to emotion is to become aware of the fact that there are many people out there who are only interested in you doing what they want you to. Or you could have no emotions, but that would be a bit of an overkill. Let’s stick to plan A. It’s not so much that you should be paranoid, since it’s not a secret at all — the leading political and economic philosophy advises everyone to always act in their self-interest. Love of truth is not compatible with being self-interested. One interested in truth has to accept that they may be proven wrong and fail in persuasion. A person who is self-interested, like someone who aims to get rich, famous, or powerful, sees value in truth only when it moves him or her closer to those goals, and would do anything not to fail or be proven wrong. Therefore, the only situation in which a salesperson or a politician can and will actually help you is in a win-win situation where your interests align. The mutually beneficial nature of that situation should make itself completely explainable by logic. Typically, smart salesmen will use truth and logic when it serves their purposes, because why not — it doesn’t make their arguments any weaker. Which means that you need to be very skeptical precisely in a situation when emotional appeals and credentials are all that the salesmen are using. In all likelihood, that would happen when there’s nothing else they can use, if they wish to avoid outright lying. There are of course much more complicated problems that would require treatises of their own and perhaps some training as well, like how to spot outright lies and half-truths, how to navigate personal biases, or how to deal with the constant pressure of advertisement. But the first step is simple — change your default reaction from “trust everything everyone says” to “try to keep calm and skeptical while others are pushing things on you”. You may fail, everyone does at times, but it is the default unquestioning naivety of most people that makes appeals to emotion such a safe bet. Imagine the difference between a kid who hasn’t been told that Santa doesn’t actually exist, and a somewhat older kid that figured it out. The realization that you’re likely being played, the un-suspension of disbelief, is literally half the battle, whatever your level of intelligence, education, or experience might be. In fact, don’t just believe me right now. I’m not interested in effective persuasion for its own sake. After all, I’m not made any more right by the increasing number of people who might agree with me. Just don’t believe people who’d really, really, really want you to believe them, until they earn it with logos. Hello, I’m Martin Rezny.Did you like this piece? Wanna read more of my stuff? Here’s something more recent.powered.by.rabbut.com If you enjoy my writing, give me a tip via PayPal, and don’t forget to subscribe to my publication, recommend, and follow! ", "child": "", "name": "2354_10", "parent": "2354", "title": ""}