{"content": "Good reasoning, updated from the one I have heard from time to time over the last 30 years. 20 years ago some of us thought silicon valley housing would become a bad investment because organizations and in particular software development could easily be distributed…before Google, Facebook, and Apple decided to use the one-central-campus model for their businesses. Boy were we wrong. Observation: I telecommuted (15 minutes drive from my nominal workplace) for the last 15 years, in part as a quiet and practical accommodation for my (controversial in medical circles) chemical sensitivity disability. When 1 in 6 (or thereabouts) of your people are having their ability to do knowledge work impacted by the traces of formaldehyde coming off the modular work surface you standardized, or by the solvents in nearby people’s fragrances, with ventilation-to-dilute minimized because the building people are measured on energy costs, telecommuting starts to have “hidden” advantages. A few thoughts: I worked in geographically diverse organizations starting in the mid 1980s. We had video conferencing that, while expensive and planned/scheduled because it took satellite time, worked reasonably well even back then. We went through a period of cost reduction where the video quality became terrible but was carried by telcos instead of satellites — once you know people, a Webex style audio-and-presentation session is better than that video — but now the Internet is usually fast enough to move decent video. I wouldn’t give Hangouts credit for the internet getting fast and reliable enough for live video, although there is at least one very popular videoconferencing app which is incorrectly architected and wrecks everyone’s experience if any one participant in an n-way call is on a bottlenecked Internet connection. (The engineer in me assumes an algorithm at the server which head of line blocks if the input from any of n sources is late.) How is sales done — how does Intel call on Google to present their processor roadmap, take input on features, and stave off the threat of ARM powered data centers if there’s no Google building to call on? Similarly, how is the theater of “bringing the customer in” to sit in a boardroom like conference room, see the reality of a new or small or mid size company, to talk to the right series of experts and get the confidence in that vendor which allows the sale to proceed? Oh, and there’s a lot of geographic shaking up that happens as people go off to college, and then after college surf the national job market. If telecommuting truly wins, does that mean everyone will end up living where they grew up? Or near where they went to college? Or will some other force start driving the cultural shaking up? ", "child": "", "name": "238_7", "parent": "238", "title": ""}