{"content": "Humanities degree…LMAO College degree jobs are the new middle class opportunities. Programing is the new trade school. All these, or even the best case scenario, will only make you a wage slave, an amazingly rich wage slave, but still a slave. You can be a drop in a flooded market, or use the massive supply of degrees and become an employer that pays pennies for hours of specialised work, that someone paid tens of thousands of dollars and spent thousands to learn. You can be a sheep or a farmer. __ Do this checklist multiple times a day until you learn to think like this: What do you want as a consumer? (what do you pay for…) What is the best way to fill that need currently? What does it lack? What does it cost to clone them and improve on what they do? And how can I get it done for cheaper? (google it, don’t assume and let your outsider ignorance cast doubt) Do it.(find a specialist, find a dude that owes you shit, get a rolling beta ASAP for pennies, sometimes literally and start giving value to someone, dont’t promote, give…that’s where the rubber meets the road, was your hunch right? )Get paid for it.(don’t beg or ask…95% of people don’t pay for shit, use them for promotional avenues. Keep your value proposition clean and simple: you pay for A. I give you B or A 2.0 and it’s 20% cheaper) __ It’s that simple. And that’s the problem. Dreamers do it badly and pragmatics look at the dreamers and tell themselfs well if that guy failed… Do not be a cretin that dreams big. For a million idiots with big dreams there is ONE success story, and it’s usually a consequence of statistics and luck rather than individual effort alone. And even then, they usually get pushed aside by venture sharks the minute they turn a profit. Think locally, think small insignificant improvement and 0 or pennies in start up costs. Don’t DREAM of changing the world someday, DO make a quick buck for almost nothing as often as possible. If you can pay for something to be done, do it. This is especially true in marketing, advertising and these “soft sciences” that everyone thinks they know how to do it. You can’t and you are right, it’s something anyone can do. But here you don’t pay for effort, you pay for the insider info, a specialist a insider here is a shortcut. Be crystal clear in your demands and expectations and ask for proof of results, not promises, degrees and shit. Tell them that you want the same exact shit, copy/paste is preferable and make it as easy as possible for them to take your money. Remember, you want their solution and insider knowledge not their labor. Something now is better than perfection down the line. There is something to be said for the unicorn that is the pragmatical perfectionist. But please bitch about that lagging code after you hit 50 000 users. Profit over ego, always. Your business is your life, but your life is not your business. Failure is not acceptable or possible…it is inevitable. Change is what creates opportunity and failure. always steer into the slide(google it). Never fight it, be gratefull for yesterday, but never let yourself fall in love with it. Go with the change and never do patch work. The issue with a leaking boat isn’t the size of the bucket you use, it’s the fact that you don’t have another boat. And never forget that life is about making money so you can survive, live and enjoy the rest of your life. A job isn’t about purpose, meaning or any other HR bulshit they use to bait your existential issues and make you work 60 hours a week. Because just like the poor guy working at Mcdonalds, just like the cyber security worker at the NSA, the entrepreneur is also plagued by filling up the lack of meaning in his life with work. You owe yourself a life, not a ego bait. And when in doubt do like the chinese, copy/paste.. ", "child": "", "name": "2436_4", "parent": "2436", "title": ""}