{"content": "I have patentable ideas but no money or access to credit; I will be happy with a small slice of the pie but decently more than zero. How can I protect them from those who want everything without at least preliminary patents? I have been there before and it sucks. I posted details of my project and received on LinkedIn from a well known scientist (name withheld) this message: I am very experienced in meditation, guided imagery, biofeedback, and progressive relaxation. If I can be a resource to your new endeavors, please feel free to contact me. I am always happy to help fellow clinicians. I replied: Thanks for joining my LinkedIn network and adding me to yours; this is indeed timely. I believe that you would look really well in the startup I am preparing to launch. Please see: Acquater Ballastics (TM) Hydrokinetic Therapy Handbook: https://docs.google.com/document/d/1LWkmcVXgM8yhNTAbtWPbY3zmHHPhY8OOgUECq2ASOKA/edit?hl=en# and: https://www.researchgate.net/project/Intensive-Cannabis-assisted-VR-Chatbot-driven-Physical-Rehabilitation-Protocol After a serious fall in which I broke my 5C vertebra I rehabilitated myself with my prototype devices, visible on pages 7 to 13 of the handbook, using cannabis to enhance proprioception with excellent results. Virtual Reality can be used to create a meditative state in which one identifies, and synchronizes movement, with an imaginary self, an animated transparent version of the body showing muscles and their action, which also visualizes (and transmits to the clinician as well) performance data and actual, planned and comparative parameters, such as heart rate, oxygen absorption, brain activity, localized pain, etc… Besides the business part my main activity, now scaled down for lack of resources, is running AMEN, Association to Empower the Needy: https://docs.google.com/viewer?a=v&pid=explorer&chrome=true&srcid=0B678n9B0TTqPZThjNmRlOTYtMGE0ZS00OGJhLTlkZTktMGY1YmVlY2EyODRj whose purpose is prevention of suicides and divorces caused by financial emargination through reinsertion of the endangered individual and family into productive society; I was already doing this prior to my aliya at Reb Shlomo Carlebach זצ”ל’s House of Love and Prayer in S. Francisco, dealing then with children from disfunctional homes who were having bad acid trips… I am not a trained or licensed psychologist but the subject has always been of my highest interest, since I attended ate age seventeen the lectures of Dr. Ola Raknes, Wilhelm Reich’s assistant, who escaped arrest in USA and opened the Reichian Academy in my native Napoli, Italy; real LSD was sent by Dr. Hoffman זצ”ל and experimented with by students, but not as part of a formal curriculum. I do believe in the healing potential of entheogens, and after decades of obscurantism it is finally being revealed to science; I am following closely the developments in this field. He answered: _____________________________________________________________________________________________ Thank you for your detailed message and considering me for your proposed Start-Up. I think what you are proposing (i.e. The Acquater Ballastics (TM) Hydrokinetic Therapy Handbook, and the Project on Intensive Cannabis assisted VR Chatbot driven Physical-Rehabilitation Protocol) to be not only very novel and innovative but cutting-edge and very relevant in today’s world. I have had some experience with VR work in clinical and psychiatric treatment, and if you want the real expert who is a colleague of mine in that field I suggest you contact … I would be very interested in being a part of your Start-Up and perhaps can act as your chief Scientific Officer since I have extensive academic and clinical experience in the fields you are dealing with and am sure I could be (B”H) an asset to your efforts. I am also currently involved in clinical research on cannabis, LSD and related substances and am a proponent for the beneficial uses and effects of cannabis, LSD and psychedelics in a variety of areas. I will include a few of my recent publications on the subject as attachment files. It is very interesting you received and worked with LSD sent by the great Albert Hoffman. I love his work and book LSD My Problem Child regarding his discovery while working on pharmaceuticals from the ergot fungus _____________________________________________________________________________________________ I am a self-educated financially handicapped inventor, and I have been already taken advantage of twice with ideas which now are worth billions; How can I put together a team based not just on equity but with a bootstrap investment into due diligence and a basic lab? I have prototypes of prior equipment which cost me 40K Euro to produce, but no money at all, and I am willing to be an employee with a salary and stock option. I am seeking CSO, CAO, CFO, CTO on an EQUITY ONLY basis and/or partner/investor(s) for Lightwave Wellness and Rehab R&D Mevo Modiin Israel (I cannot travel abroad but the best way is to create the company in US/CDN with a facility in Israel and for me to be an employee of it with salary and stock options. Eliahu Gal-Or pizzarebbe@gmail.com +972586272388 ", "child": "", "name": "2437_8", "parent": "2437", "title": ""}