{"content": "Dear Snap commentariat: Design is not a sustainable competitive advantage Your focus on the atom is missing Snapchat’s nucleus You hear entrepreneurs cite “design” as their value proposition all the time, but design is not defensible differentiation, because anybody can copy design. That’s exactly what’s happened here with Snap. Design is merely the ante in the app world; you better have a better value proposition than that. I understand your point here, Taylor, that copycats have users who use their apps for different purposes than Snap’s — users who are trained for different means to different ends. Yes, Instagram and Facebook have users who create content for “one to many” communication. Yet, both WhatsApp and Messenger are “facilitating deeper communication between a smaller group of friends… a communication platform, not a broadcast platform” (as you’ve described Snap users’ raison d’être). I completely agree that Snap built a better mousetrap for communications too. (e.g. Snapchat was the quickest transmission mechanism for getting a message to a friend/friends.) But, that’s been easily replicated as well. Your attribution is where I think you misfired, Taylor: you misdiagnosed the value in Snap’s product — the nucleus that insulates Snap’s competitive moat. What truly differentiated Snap was the privacy niche. It’s where people went when they wanted to communicate “behind closed doors,” “off the record,” etc. Facebook and its app constellation fundamentally cannot compete on that turf, because it’s kryptonite for FB’s revenue model. I wrote more about this here: Snap to Store: The Great AssimilationHow Snapchat compromised its core valuemedium.com That’s an important distinction if you want to deduce Snap’s health or prescribe strategic remedies for its competitive throes. They’re in a precarious state right now, and even though it’s not to late for Snap to figure this out – and I’m sure they will – saying ‘Snap will be fine because design’ would make you right for the wrong reason. Analysis is only worth something if it’s wrought from a repeatable process: in other words, our methods are more important than their outcomes, because methods are the scalable constant we can control; outcomes are subject to variables we can’t control. That’s the importance of being right for the right reasons. Today’s media doesn’t meet consumers’ wants and needs, so here’s a better way to listen, watch, and read: Annotote ", "child": "", "name": "2456_8", "parent": "2456", "title": ""}