{"content": "You may not enjoy David Foster Wallace but that by no means he is a white man’s author. Your quote “It feels bad to read a book by a straight cis man about misogyny. It feels bad when this book contains some relatively graphic depictions of sexual assault. This is par for the course, when the course is reading books and the par is the Western canon,” overlooks authors such as Hemingway, Fitzgerald, Faulkner, Nabokov, Vonnegut and a host of other canon authors whose writing changed literature. I am guessing you do not enjoy those authors either. Your piece does not review DFW as much as it eviscerates him and the men that read him. You have had negative, even brutal relationships with men and by sharing them you hoped to engage sympathy, instead you insult women that do enjoy DFW as well as the educated and intelligence men who have done the same. A critique is an evaluation or analysis of a piece of literature. It discusses stylistic points, or language, it focuses on the images of modernism or postmodernism or other literary tropes. It does not discuss “why it enrages me so much when men exploit women’s sexual suffering for Art.” If you read, DFW with an open and intellectual mind you would observe the wit, sarcasm, pain and sadness behind his writing. You would see not his advocating for a man of this nature or merely saying they are shits, you would see the human suffering people go through in terms of existence. If you read DFW with an open heart and did not automatically assume he was shit because a crappy ex-boyfriend read him or recommended him then you would notice the way relationships stumble in his characters, you would see the extreme detail he uses to describe a drug addicts harrowing trip towards recovery. You would see that humans, including DFW, are not infallible and that he wants his readers to know this. If you actually read his work with a goal in mind you would note that he is extremely, highly intelligent and interweaves texts from more than just the Western canon into his highly prolific, highly sensitive, and highly intellectual writings. But DFW did not write for you. Not because you are a women but because you cannot see beyond your solipsistic hermeneutic crux to actually appreciate the humanity and breakdown in communication that DFW was oft trying to relate to his readers. You are extremely lucky to receive wages to write this article because as David Foster Wallace said in a Charlie Rose Interview: David Foster Wallace: “Feminists are always saying this. Feminists are saying white males say, “Okay, I’m going to sitdown and write this enormous book and impose my phallus on the consciousness of the world.” Charlie Rose: “And you say?” David Foster Wallace: “I, I, if that was going on, it was going on on a level of awareness I do not want to have access to.” To put it bluntly, you have completely missed the point of his writing and that’s a shame because this review could have been really good and it’s not, it’s just not. Heh heh heh… ", "child": "", "name": "2459_16", "parent": "2459", "title": ""}