{"content": "“Most common” is subject to detection bias. We are not yet very good at detecting planets much smaller than Earth. Object populations in our solar system are inversely related to mass. There’s only two full-size planets (Earth and Venus, 1.0 and 0.82) and two small-size planets (Mars and Mercury, 0.11 and 0.055), but there are seven bodies from .02 to .008 (mostly large moons), over a dozen down to 0.0001 (smaller moons and larger asteroids), tens of thousands of moderately large asteroids and hundreds of millions of smaller rocks and iceballs. This scale relationship is well-supported by models of solar system formation involving planetesimals. If other star systems formed similarly to ours then there should be a lot of small, rocky and icy bodies to detect. Given that Mars is only about a tenth of Earth’s mass yet still reasonably habitable, it seems likely that future telescope projects will discover more and more smaller bodies that could conceivably be habitable. (Note that this isn’t the common perception of ‘habitable’, it just means that the temperature and the gravity probably won’t immediately kill you. Mars would be barely habitable using every trick in our technological toolbox, yet it’s probably a better candidate than any exoplanet found so far.) Habitability depends on more than gravity and solar energy; an atmosphere and a magnetic field are pretty important too, and there is some evidence to suggest that a high-mass gas giant in the same system may help reduce asteroid strikes. A well-behaved star is also important. One example here might be Titan (0.0225): far too small to be caught by exoplanet experiments running today, yet with a thick atmosphere and a clear orbit thanks to its parent planet. Similar-sized or larger moons of gas giants in the habitable zone are likely candidates for good conditions. Consider that all of the gas giants in our system have extensive moon systems. That gives some weight to the idea that the abundance of gas giant-sized bodies found to date may have habitable moons. ", "child": "", "name": "2476_3", "parent": "2476", "title": ""}