{"content": "Excellent article. The argument is that a Super Earth will have such a high surface gravity that it will trap an excess of hydrogen. Indeed, a planet with twice the radius of Earth will have eight times the mass of Earth. However this multiplication by 8 of its mass m is true if, and only if, the Super Earth has the same density as Earth. Earth has density 5.5, due to a heavy iron core with density 10. Silicate rocks have only density 3. If a Super Earth had the same exact composition as Earth, doubling the radius r would change the surface gravity, which is proportional to: m/rr. If m is multiplied by 8 and r by 2, one sees that the surface gravity is multiplied by 2. However, if the Super Earth is mostly made of Silicates, its mass will just be multiplied by 5, not 8. Thus its surface gravity will only augment by 25%. If now one considers a super Earth with radius three times Earth, one sees it’s volume will be 27 times greater, but, if made mostly of silicates, its mass will be no more than 15 times greater. Meanwhile 1/rr is roughly 1/10. So the surface gravity, would be only 50% greater. Thus one sees that Super Earths with surface areas roughly ten times Earth are imaginable, with surface conditions which should not be too different from Earth. One could argue that a huge metallic iron core is necessary to create a large magnetic field protecting against radiation, in particular solar storms which may strip the atmosphere (as happened on Mars). And thus one could insist that the preceding is unrealistic that way. But we are sitting next to a mighty yellow star. The most frequent type of stars is Red Dwarves. Red Dwarves, although subject to spectacular flares, thus capable of ejecting massive radiation, may, overall, be less corrosive than Sol (as their energy output is relatively tiny, in the fullness of time). Hence a magnetic field weaker than Earth’s maybe just as protective. The best way to make sure that we cannot have habitable Super Earths is to construct huge telescopes… Patrice Ayme ", "child": "", "name": "2476_5", "parent": "2476", "title": ""}