{"content": "Our Culture cannot evolve An incisive appraisal of our situation, much in line with my own. This article, while examining our future prospects at some gloomy depth, does not appear to address fundamental problems. Though much is suggested that we ‘’must’’ change our ways, but in the context of the infrastructure that we have created for ourselves, this can be seen as wish-politics, wish-economics, and wish-science. I would dearly like “cultural evolution” to become reality, but consider what you are asking: Humankind has evolved over about 500k generations and thrived on the fundamental inclination to kill each other in pursuit of resources. (that is the driving force of all warfare) We have maybe 1 generation left before collapse for the reasons stated above. “Cultural evolution” in basic terms, means changing a million years of homicidal intent in the course of a single generation. Can anyone seriously believe that to be possible, in some voluntary manner? Those of us lucky enough to be cossetted by western-style civilisation regard our “now” as infinite. Which is why we choose to believe, with perhaps very minor doubts, that our existence and current democratic system can only continue as it is forever. We are prepared to kill to confirm that. So we vote for the leaders offering promises of prosperity and infinite growth. Who wouldn’t? But democracy, in the sense that we understand it, has only existed for a century or two. (allowing for different definitions of it). Before that, since the inception of the most rudimentary form of civilization 10000 years ago, our normality of living has been under some form of dictatorship. Some benign, but mostly brutal. Systems that demanded a fight for survival at a very basic level. So that throws up the next question: why did democracy appear in this time period, and in no other? (The Athenian version was a slave supported male dominated society, so doesn’t qualify.) The answer is very simple: cheap and abundant energy; in particular coal oil and gas. It was the steam engine that allowed us to shake off the bonds of dictatorship, not the magnanimity of the ruling classes. Steam power and oil allowed the building of factories, and demanded workers to fill them. Had it not been for hydrocarbon fuelled industry, the United States would have gone the way of Europe, into numerous disparate nations. Industry allowed worker mobility, accelerated prosperity and created the base for democracy because aspiring politicians needed the support of the people. This has worked fine until our own time. As long as hydrocarbon fuels were available in cheap excess, everyone was prosperous, A gallon of gasoline delivers the same work output as 50 men working a 10 hour day; that meant we all had an army of personal slaves so we could enjoy our democracy. Now energy resources are no longer cheap or so abundant, and as a result, living standards are falling, and everyone can see they are falling without knowing why. We can no longer afford our ‘gasoline slaves’, despite promises of hundreds of years worth of coal and oil being available. This is the big lie. Without hydrocarbons, we have no future prosperity. There are no “alternatives”. Cultural evolution is impossible without the liesure to carry it out. Technology is not going to deliver an amazing new energy resource. Without abundant energy availability, the nations of the American landmass cannot hold together as a single entity. Nor can any of the other ‘economic systems’ of the world. They too are destined to break apart. So much for “cultural evolution”. Think more “fighting for survival”. No time for culture when you have to worry where your next meal is coming from. Without oil, transport, food and water supplies cease to function. (In addition to everything else that makes civilization work). Remove prosperity and democracy becomes an orphan that is certain to starve to death. This is the truth that has to be faced, and provides the backdrop for the rise of fascism happening now, even though we might deny it. Fascism cannot co-exist with any form of cultural evolution. Fascism grabs what it can for its priveleged elite. (Check US politics right now) When (not if) the breakup comes, societal collapse is certain, and conflict will result, and global politics will destabilize completely. This book maybe explains it in more depth : The End Of More: Infinite demand on finite resources is making humankind unsustainableBecause the economy of the developed world has locked itself into the delusion of infinite growth, we have no option…www.amazon.co.uk I’d like to think there was an answer to the mess weve created for ourselves, but basically 7.5 Bn people don’t fit on a planet intended to accomodate 2bn at most. I fear we have outstayed our welcome by violating the terms of our tenancy agreement ", "child": "", "name": "2481_7", "parent": "2481", "title": ""}