{"content": "I disagree with almost everything you said but I like the way you said it. I believe there is room for many blockchains and ideas like polkadot will connect these blockchains together into a sort of Internet of Blockchains. Bitcoin has 3 primary potential uses: decentralized money, anonymity / privacy and store of value. It has failed at all three of these for the time being. Transaction fees are high, the blockchain is slow, people don’t want decentralized money or irreversible transactions and Bitcoin actually isn’t that private anyway — as for a store of value it’s too volatile. Further one could argue that it is not decentralized enough — the miners, developers, and exchanges are places where power concentrates. Bitcoin’s vision of money free of government control was a great test, but Bitcoin is not totally free of regulation and I don’t believe it will ever reach mainstream adoption. Will Bitcoin die? I don’t think so — enough people still want it and more people will continue to want it especially as the value rises. Ethereum is totally different than Bitcoin. The only thing they have in common is that both have coins that represent money. Ethereum is not just a distributed ledger, It’s a decentralized world computer or more accurately, an operating system — where anyone can run an app that controls value — maybe that’s setting up a decentralized company, maybe it’s trading oil and gas futures, maybe it’s a prediction market or distributed super computing — there is no killer app for Ethereum, just a sprouting ecosystem of applications all designed to need Ethereum to operate. This creates a second avenue of demand besides just speculators trading it. Not only are these apps useful and creating entirely new markets, they also allow us to collateralize digital tokens with real world assets and now makes it possible to trade value in things never tradable before. You got a vault full of gold? Great,create a token backed by that gold and sell it. What about a development built on 1000 acres of prairie? Tokenize it. A wine or art collection? TOKENIZE IT. People don’t understand where the market growth will come from — the answer is 1) by reallocating under utilized hard assets (computer processors, graphics cards, broadband modems, and hard drive space) and 2) by creating new markets of otherwise untradable assets which can now be broken down into fractions and sold one token at a time. People will use Ethereum in the future and never even have to know how it works, just like you can connect to the internet and not have any idea of how the underlying protocols actually work. Banks and trading platforms will be able to build on an open network with drag and drop tools — want to sell a fund of crypto assets? Melonport will make that as simple as dragging and dropping a few modules and writing a few smart contracts. Selling stocks, derivatives, insurance contracts will all be much more transparent, auditable, and will require fewer in house developers, auditors, lawyers, and physical space. This means that financial services companies will greatly reduce overhead and liability. It also means that just like Bitcoin allows anyone to be their own bank, Ethereum let’s anyone become a bank for other people, but a bank regulated by code rather than law. I dumped all of my BTC until they resolve Segwit and Bitcoin Unlimited — but I’m deep into Ethereum. Sure some other platform could launch and win the race for this sort of thing but I really don’t think that’s going to happen. While there is room for a lot of specialized blockchains — we don’t have room for more than one Ethereum. Bitcoin will always exist as a way to send large amounts and a way to hedge against exposure to Ethereum — Ethereum is far more useful. Ethereum goes beyond simple money transfer and allows people to not just transfer assets but control them; issue, destroy, sell, trade on open exchanges, etc. the total potential market cap for economy of Ethereum based apps is into the trillions of dollars in the next two years. If you’d like to talk about this more — I’m on http://twitter.com/itsrichspicer ", "child": "", "name": "2508_24", "parent": "2508", "title": ""}