{"content": "Hi Tuur, From an Austrian economics perspective, your assertion that (absent govt coercion) there will have to be one very dominant currency is absolutely correct. I would, however, not worry too much about ETH. Most people are under the assumption, that ETH has solved the problem of decentralized decision-making. The truth is, that they merely pushed the problem into a different domain. In order to take a decision, you need rules AND data. The execution of rules is indeed decentralized in ETH. But, the provision of relevant data to the rule-algorithms depends on the surrounding environment, aka the real world, which is not controlled by ETH. If you look at any ETH app on the ETH website, they are either using no external data at all (lotteries) or must rely on subjective consensus rules or reputation systems. Now, in the real world, it was never a serious problem to apply rules anywas. For example, if you have proof that your wife cheated on you, you can file for a divorce and get part of her assets. But who do you trust to provide the information that she cheated in the first place, and what constitutes cheating? This is usually where things become expensive and subjective, and this problem is not solved in any way by ETH. Geeks who spent their lives in algorithmic worlds would be blind to this issue, hence there is some support for ETH. I can elaborate further, if you wish. Back in the real world, competition might arise from something like LTC or XMR. They aren’t quite there yet in terms of market-cap and community, but the longer BTC puts off implementing Lightning Networks, the more at risk it becomes of being overtaken. My solution to this would actually be very simple. Core finally steps down from the ivory tower and grows a pair of balls. Then, it hardforks together with the 30% of miners who are signalling Segwit. 95% of the user community would move to CoreBTC, leaving BU and the “undecided” fraction without community and without massive developer power. Hence, the “undecided” miners would quickly switch to CoreBTC, …and who cares about BU. However, the window for such a ballsy move is closing with every passing day. Alternatively, purse.io’s Extension Blocks might gain traction. In any case, I give BTC another 12 months to establish a lightning network of some sort, otherwise its over. Let me know your thoughts Arne ", "child": "", "name": "2508_17", "parent": "2508", "title": ""}