{"content": "“On November 8, we learned a lot of Americans aren’t ready to sail into the progressive horizon.” Wrong. Stop acting like Trump won because of some groundswell of racism and sexism. Conservative extremists were always going to vote for him. He won because Hillary Clinton was an awful candidate with an awful campaign and an awful message that said nothing other than it was her turn, and the “blue wall” in the Rust Belt felt zero enthusiasm for her. She thought she could run up the score instead of defending whatever lead she had (sports analogy time: the Falcons threw the ball instead of eating clock with the run). The inspiring slogans of ‘America is already great!’ and ‘America is great because it is good!’ mean absolutely nothing when their towns dying as all the young people flee to the cities for any kind of work, or they are squeezed by health care costs with insanely high deductibles, or communities are decaying because of heroin. ‘Build the wall to stop the drugs’ sounds great when you have pictures of parents overdosing in front of their children going viral. Not because it sounds like an insane rarity, but because of it’s a depressingly common event in ‘flyover country’. Knibbs and McNear are better than the rest. But too many Ringer articles read with the presumption that the audience is already sympathetic to the writer’s point of view. But there’s very little investigation into why people would support Trump. I’m still an optimist that thinks that people can be swayed by a good argument if you give people something to believe in, not just oppose. Clinton made the election a referendum on Trump, and she deserved to lose (doesn’t mean he deserved to win). This article is fine as an ideological snack just for informing on why sportswriters are speaking up now, but I’d say most people are starving for something more filling as to why such people would hold such beliefs. The Ringer has an audience that it can reach if you tried. As for the conservative readers and their expectations, it’s time to get real. I see this in every article’s comments. Bill Simmons is a Masshole and now lives in Los Angeles. What kind of politics were you expecting? ", "child": "", "name": "265_4", "parent": "265", "title": ""}