{"content": "Any time you try to split politics into a single axis, you’re left with some hamfisted and messy attempts to fit everything into a broad category. Even a 2 axis plot will be ugly, but it works better. What this article sorely misses is that second axis — authoritarian vs freedom. An NCAA player should be free to negotiate contracts outside of the one he has with this university, and he should be free to negotiate a contract with his university. The NCAA was a government idea back in the 1800s, and while it’s technically not a government organization, it essentially acts as one, and has a complete monopoly on college athletics. This is not a conservative or liberal issue, this is an issue of authority and liberty. Communism is a bunk theory that can’t figure out who should be bourgeois or proletariat, as evidenced by your cited example. Is a physician fresh out of residency proletariat because he has $350,000 in student debt and only making $150,000 a year? What about 20 years later, when his debt is paid off and he’s making $350,000? Is he then bourgeois even if he has lived consistently throughout that time? At what point does the switch happen? Was he bourgeois the whole time because of his advanced profession? Who cares? Communism is an abomination and was responsible for more death in the 20th century than anything else. We’ve co-opted “conservative” and “liberal” into right- and left-political ideas, but you can be a right-leaning liberal and a left-leaning conservative. For every left-leaning sportswriter, there’s an elected Democrat who thinks the NCAA is a good thing. How progressive was Obama, really? He deported more people than any president before him. Do you only recognize the draconian actions of politicians and public figures if they are identifiably a Republican? A Republican like Ron Paul beat you all to the punch in seeing many of the atrocities George W committed, let alone Obama, but Obama’s well-spoken and handsome and has a nice family and a calm demeanor, so his numerous crimes are ignored as he is lauded and appreciated. Sure, Trump will likely depart more people than Obama, but what do you say to that? A president who was at war for all 8 years of his presidency? Bryan, you’re still adhering to teams and not to principles, as are most journalists. You might have ideals, but you’re weak in your ethics. Liberal, outside of politics, should be about letting people live as they please — expressing themselves and living their lives without authorities of various stripes forcing them into specific behaviors or contracts or professions. Conservatism outside of politics is about making the world into a way you see fit, and expecting others to live within those bounds. It comes in a lot of different flavors, but essentially, that’s what it is. American Liberals and American Conservatives are essentially all authoritarians who want to make others live the way they think is right. They’re not actually about true freedom of expression. Hell, most of the American left is about censorship and closing out anyone who doesn’t fit the consensus. I’m right-leaning in an economic sense, but extremely liberal in a social sense. But what does that even mean? Does me being against redistribution of capital put me on the same scale as someone who supports the military? I find the mix of military and sports repugnant. I’m happy sportswriters and journalists are finding their voice now that there’s a Republican in office, but y’all should have found it 8 years ago. Obama doesn’t have moral superiority, and neither does Hillary, someone who approved the sale of billions in arms to the reprehensive hellhole Saudi Arabia. Stop playing for your political team and develop incontrovertible ethics. Your ideals will suffer until then. ", "child": "", "name": "265_23", "parent": "265", "title": ""}