{"content": "What this article proves is that: “You can prove anything if you make up your data.” -Jerry Pournelle See that “End-Mar Volume” graph? Well, let’s take a closer look: Note the fine print: “PIOMAS data.” Guess what? PIOMAS data isn’t measurement data, it is computer model output. There’s actually no real sea ice volume measurement data until 2003 (IceSat), and the data was spotty until 2010 (CryoSat-2). Here’s a reference:http://bora.uib.no/handle/1956/8035Note the starting date: 1979. Why do you suppose they started with 1979? After all, satellite measurement of ice coverage/extent began in 1973, and satellite measurement data of ice volume didn’t begin until 2003. So why do they start their graph with 1979?A: here’s a clue, from the IPCC’s First Assessment Report (I added the red circles). I don’t know of any way to embed a graph in one of these comments, but you can view it here:http://sealevel.info/ipcc_far_pp224-225_sea_ice2_1979circled_widthpadded.png Now, do you know what the one and only important effect of declining sea-ice is?A: Increased evaporation. Decreased polar ice cover increases water evaporation, cooling the ocean by evaporative heat loss (an important negative/stabilizing climate feedback). The additional evaporation (due to more open water) also apparently causes additional cloud cover, increasing albedo at altitude, and probably further cooling the surface. (I say “probably” because the effects of clouds are very complex, and not well understood.) It also increases “lake-effect/ocean-effect” snowfall downwind. Some of that snow falls on the ice sheets and glaciers, increasing ice accumulation, and offsetting meltwater losses. Other snow falls on other land, increasing albedo and snowpack, decreasing land temperatures, and prolonging winter. Note that snow accumulation has a large effect on grounded ice mass, which in turn affects sea-level. The magnitude of ice accretion from snowfall on ice sheets was illustrated by the team which salvaged Glacier Girl from under 268 feet(!) of accumulated ice, 50 years after she landed on the Greenland ice sheet. That is an incredible number. 268 feet of ice in 50 years is 5.4 feet of ice per year, which is equivalent to more than 80 feet of annual snowfall. That snow is mostly from evaporated ocean water. http://p38assn.org/glacier-girl-recovery.htm http://www.airspacemag.com/history-of-flight/glacier-girl-the-back-story-19218360/?all ", "child": "", "name": "408_11", "parent": "408", "title": ""}