{"content": "GOODBYE & GOOD RIDDANCE TO YOU! What a hopeless crock of bogus hyperbole. This is an utterly emotional narrative of self-victimizing woe, disconnected from any honest assessment of empirical reality. I’m afraid you’ve been consuming too much fake news: their innumerate pseudo-academic narratives are beginning to warp your mind. The Constitutional democratic state which you cheer is long since dead! Dead at the heads of the administrative state leviathan, the fearsome ascent of which you undoubtedly cheered on, presided over as it was by your beloved Obama. The “pen and a phone” president magnified all of the worst excesses of the Clinton & Bush II years, shattering whatever remained of the checks and balances ostensibly controlling our Federal government. Only now that this terrifying apparatus is in the hands of an American patriot do you tremble at its might! You would have us all live under tyranny as long as it is once which is amenable to you. Wherever you land, you are likely to find much worse than you left behind. America is far from perfect but is still the greatest example to date of a free, liberal, pluralistic society open to all. Our culture is amongst the least parochial, racist, sexist, and unfair you’ll find anywhere, and our national culture is the sole shining example of a global syncretic fusion of disparate beliefs, creeds, and ways of being. Stop attributing every human failing you come across to some sort of national conspiracy of hate. The endless repetition of the false narrative of a “white supremacist” America is part of a disingenuous effort to delegitimize ideas: ideas which are not immoral but merely politically unappealing to you and your ilk. There are many many areas on which we will undoubtedly disagree. However, the climate change issue is one in which you are severely mistaken; the hyperbole that Trump is “mortgaging” everyone’s future is ludicrous. (Also, this is a claim being made prospectively for something Obama literally did; look at the surging Federal debt under his watch.) You cannot be an open-borders globalist and remain an environmentalist focused on sustainable growth. Economic nationalism is the first step to any rational climate policy. Obama strangled American industry with needlessly costly environmental regulation while maintaining and expanding a globalist regime of open-borders crony capitalism; global carbon emissions rose ever higher, and production flowed ever more quickly to countries lacking our concern for environmental niceties. You cannot claim Trump is destroying the planet when the pillaging of the the Earth for endless, no value-added ‘horizontal’ growth in 3rd world autocracies reached new heights under “green” Obama. The globalist “Washington Consensus” created de-facto Euclidean zoning for the world economy through the incentives offered by open borders in a world with starkly different political-economic regimes — and in doing so insured that we move as much pollution-intensive and labor-intensive production as possible to countries with abysmal track-records on the environment and human rights. It has destroyed our ability to have any control of environmental policy outside of farcical and unenforceable multi-lateral climate deals, and conscripted our working class in a global race to the bottom. We didn’t start outsourcing to China because they had the lowest wages in the world, but because they had created what is likely the most fearsome authoritarian apparatus in human history. We moved production to China because you can build massive industrial works without concern for costly environmental compliance or labor troubles. On-shoring production from pollution-intensive, rights-abusing jurisdictions is the best first-step towards smarter, more sustainable growth. And so, goodbye and good luck to you! May you find peace and happiness wherever it is that you end up. ", "child": "", "name": "413_9", "parent": "413", "title": ""}