{"content": "Thanks Mark Hand. It’s important that people understand, and keep up with, just how incredibly deceptive & morally corrupt Pruitt, the President and their Congressional counterparts are willing to be to satisfy the oil, gas & coal industries and protect their own financial interests. These are facts. But it’s equally important to ask in the same breath if any remedy, any strategy is indicated from these facts. And if so, where should we be looking? I hope this is taken as friendly/constructive criticism: It’s not in anyone’s interest any more for progressive journalists to merely imply, by choice of facts, that wrong is being done. The case has to be made, at the very least, that the greatest harm in history is being done by nameable individuals who are betraying their oaths to the public good. Beyond that, isn’t it absolutely paramount to discuss strategies that can counter the devastating anti-science, anti-climate policies being put in place? What PR moves can the climate community make to improve the status of climate change as a concern of mainstream media? What sort of organization would that require? What would it cost? What philanthropic groups and individuals are there to talk to about upping the climate communication game? Communication with the public (IMO) IS the game, IS the key to eventual influence. But the climate movement, (not being a coherent & well regulated militia), is not yet organized for the task of delivering the whole truth to the public. It lacks the ability to act with strategic unity in terms of communication with the public. Personally, I suggest two strategies for improving the situation. One is that a first summit of climate scientists, climate leaders & advocates from all walks, journalists, issue experts, et al, be convened to plot political, social and business strategies to save the climate. The second, a corollary, is to arrange for Earth systems scientists to address the nation on primetime TV to defend the scientific evidence and declare an existential emergency for civilization and the biosphere. The boost to climate awareness, climate voting & media & govt. attention to climate would be enormous. There is chronicling the situation and there is.. can’t say it enough.. strategy. I hope Climate Progress (Judd Legum?) will in future focus much more on strategy. It’s important and being neglected. ", "child": "", "name": "414_4", "parent": "414", "title": ""}