{"content": "The Paris accord does not mean that it is only Europeans that signed on. It is an agreement of 170 nations, worldwide, to reduce so called “greenhouse gases”, most notably carbon dioxide and methane. Those are the causes of global warming. Mr. Trump has the ability, through his appointments and actions, to bring on the end of the human race and many other species by his withdrawal from the Paris Accord. It is amazing how efficient the Koch Brothers and others who make their fortunes in the fossil-fuel industry have done such a great job in marketing their falsehoods against the hundred thousand real scientists who have come to an agreement about how we will eradicate ourselves unless we change our ways and ween ourselves from fossil fuels. But the facts are there, in the real scientific community, not in some political action committee sponsored advertising group, supported by those who stand to gain from ignoring this problem. If the energy companies had decided, when they first learned of this in the 1980’s, to move towards developing alternative energy sources such as solar and wind and geothermal, then they could have continued to be successful companies well into the future, but they got lazy and greedy. Just like companies like Kodak and Polaroid, who thought digital photography was a passing fad, they missed the boat, so now, they are trying, with billions in advertising and super-pac money, to change public opinion. If they win, we all die. If they lose, then the human race has a chance to survive. It is as simple as that. No matter that most states are beginning to formulate plans to deal with rising sea levels. No matter that the United States Military is taking action to deal with different climate patterns and rising sea levels. No matter that the majority of nations around the globe are taking action. As the number one contributor to greenhouse gas emissions on the planet, if we do not do our job to curtail greenhouse gas levels in our atmosphere, all of humanity dies, period. Do you want to guess wrong on this issue? Are you that sure that you are 100% right? If you are wrong, we die. If the world’s scientists are wrong, then we end up with new technologies that create energy from never-ending sources and we end up with cleaner air to breathe. To me, there is no argument. If we go to new technologies and we are wrong, we still end up with a better planet. If we do nothing and we are wrong, we die off as a species. To me, it is a no-brainer. I go with the side that will not harm us even if we are wrong. ", "child": "", "name": "417_3", "parent": "417", "title": ""}