{"content": "This is about respect. respect other people and their views. “ grabbing the nearest American they could find to explain what had happened overnight.” What happened was called an election. If you were ignoring a potential Trump victory, whose fault is that? I predicted the polls were wrong and would be closer than what they said. I am no brilliant person, but I knew I would be right because I understand our social constraints. “The [Trump victory] is like the spread of the same virus. Hate, bigotry, violence, only this time I have a glimpse of what the future of the U.S. may look like.” Liberal elites have taken a molehill, made a mountain of deplorables and then put the diabolic Trump on top. That is your own construct and it has nothing to do with reality. Basic analysis can support your views, but in depth analysis does not. “ If Donald Trump believes climate change is a Chinese hoax,” He does not think this, but he does have a sense of humour. Sticking to the literal reading of twitter for complex ideas is easy because it supports your view. Understanding the message though does not support your view. “It’s clear that Donald Trump is about to be one of the most powerful people in the world…but even he does not have the power to change the laws of physics, to stop the impact of climate change, to stop the rising sea levels.” I quite agree, but neither did Obama either. The shout-down of science that did not support alarmism will stop. Climate science will investigate natural sources of climate change now and science will lead us to the correct answer. If you think about what I have just said, you will notice an overriding theme. One side has closed their minds to the other, the result has been a narrowing of some views and ignoring other views completely. Respect others and respect their views, that is all that we need. Everybody should do this and then we can face the future with strength and humility. ", "child": "", "name": "418_5", "parent": "418", "title": ""}