{"content": "I do not have the same familiarity with HB-1 that you and TheLizard display. (My apologies to The Lizard for omitting him from my list of good Conservative reads.) Truthfully, I know very little about our immigration process. I will try to do some homework on that. The objection I raised, however, similar to most Trump supporters is not to say “No more immigration”. The cry to “Protect Our Borders” is a demand to curtail the seemingly ceaseless flow of illegal aliens. If someone is here and has been naturalized, great. Welcome! If people are here on Visa or with a green card, awesome. If they are aliens who slipped through the borders and bypassed those steps, whitewashing them through amnesty as promoted by GWB and McCain much to the hurrahs of the Left, is a betrayal of American trust and grossly unfair to millions of potential immigrants who patiently abided by our naturalization laws. The Left has painted a huge swastika over people who say “Protect Our Borders”. That is political rhetoric. Few Democrats promoting the DREAM Act give a damn about the welfare of illegal aliens. They just see a massive blue voting bloc. America has admitted more immigrants in the past 200 years than probably any 3 countries in history combined. They come with the promise of freedom and an opportunity for growth the surpasses what anybody in history has ever had. It is a privilege and few seem to respect that privilege with the reverence of first generation Americans. That reverence is lost and that privilege is watered down to meaninglessness if our leaders say “Don’t break our laws to get in, or we will make you an American”. By the way, the Yiddish was really good. “Bubbe” or “bubby” means grandmother and adding “la” or “le” in Yiddish adds the term “little”. I’ve often heard the term “bubbele” and knew it was being used to say “little dear one”, but never realized it was a euphemism. Now, I need to figure out the etymology of its synonym, “shaifela”. ", "child": "", "name": "441_3", "parent": "441", "title": ""}