{"content": "College really indoctrinates I’ll presume to interject here, since this is an adjunct to an ongoing exchange anyway. Since you bring up higher education, and an apparent trending fear therein having something to do with fascism, etc, I just wanted to point you to some resources, and you can make of them what you will. But they have something to do, in my opinion, with why I don’t think either immigrants nor college girls have anything to worry about, in terms of who might be the ones targeted for systematic repression by some kind of regime. And maybe in some small part, why the urgency of not allowing a Democratic regime to retain the White House and the executive branch was so severe, that even a person like Trump became an obvious alternative: USA: Where does VAWA grant money GO? - antimisandry.comtemp_3854_1468110637296_457 It's not an easy question to answer, as the United States Department of Justice (DOJ) doesn…www.antimisandry.com VAWA Fraud: Portrait in CATASTROPHIC FAILUREAs some readers may know, I have been monitoring the Justice Department’s audit reports on recipients of Violence…medium.com Meet Jane Crow: VAWA is SEGREGATIONPublished on Jim Crow, meet Jane Crow. You'd be proud of her: For generations women, and the men who have endorsed…www.linkedin.com CAMPUS SECESSIONISM: letter to Bloomberghttp://www.bloomberg.com/news/2014-08-24/hook-up-culture-at-harvard-stanford-ebbs-amid-assault-alarm-1-.html (new…www.linkedin.com \"Violence Against Women\", and the Triangle of FeminismPublished on The reason I place the first of these terms in quotes is neither to mock women nor to trivialize harms…www.linkedin.com Today's Title IX: anti-Constitutional federal insurrection, and campus secessionPublished on In the history of the United States, the term \"secession\" is a more provocative idea than non-Americans…www.linkedin.com VAWA, Title IX, and the Tenth AmendmentPublished on The United States: feminist policy as federal insurrection I write primarily about issues in my own…www.linkedin.com The Triangle of FeminismDid you experience Discriminative Practices at Work or Spotted Clear Sexism, Misandry at play in Social Settings? The…www.antimisandry.com There have been those who accused (!) me of being some “expert” on some of this subject matter. I say, take it with as much salt as you need to (and yes, I am the author of all of it but not of all the linked materials within the items), and draw your own conclusions. And by all means, look deeper and further than I have thus far, especially given your concerns over your daughter in college. My conclusion, which I drew from the process of putting all this together over 4–5 years’ time, is that the Obama presidency was a running anti-Constitutional coup d’etat directly targeting the Bill of Rights in order to destroy it by abusing it, by means of nationalizing both the education and domestic violence intervention sectors; and in the longer term, by means of Title IX/Dear Colleague, merging the two, and creating a new Democrat-targeted class of untermenschen: Men. Whether we are on some slippery slope toward some new holocaust now, I contend that by means of a comprehensive defeat across hundreds of elections which displaced the Democratic Party for the immediate future, we may well have just stopped one in its tracks, with its cattle cars already partly loaded and outbound for the camps. ", "child": "", "name": "442_5", "parent": "442", "title": ""}