{"content": "#My first thought was… Not another one. I am so sick and tired of the BS especially from people who are NOT experts. But fortunately, this article was more well thought out than others. First let me state. I have a background in military intelligence. I have a different take on this. Most people think of Trump as an egomaniac. If that is true, then his real goal is to humiliate Obama and Clinton. Why? Because this all started when the humiliated him at that dinner so many years ago. Trump isn’t here to develop a fascist regime. He is here to prove the@ nay sayer’s wrong. Those who said he wouldn’t be a good President. He wanted to come in strong and fulfill his promises. He started before he took office. He was doing what the rest of the Presidents didn’t do. He was being Presidential. Not with words. God not with words, but with actions. Trumps plan is to #1 simply do what he said. He thinks of the greatest generation. He thinks of the Reagan era. He thinks of Winston Churchill. All this fascist shit is just that, shit. Most of the people saying that have a Che’ Guerra t-shirt. Ridiculous. Trump has a chip on his shoulder. He is literally going to bust his ass until he sees his vision come true. Why? Because he does actually love America. But a little part of him want’s to smear Obama and HRC’s face in it. He want’s to be as successful at this as he can be, and to look them in the eye and say “I told you so.” That is what drives him. I don’t understand how this isn’t completely obvious to you people. As far as the DOJ. That was the same DOJ that completely fucked up the HRC classified email scandal. The same DOJ that was a very liberal DOJ. While Trump could have either waited to replace them until after the is stay of immigration or he could have done it first, he didn’t. Trump is a bit over zealous and enthusiastic. He will make a few mistakes, he is new at this. It will take a few weeks and a few people to reign him in. The real issue is the Russian Oil sale. 15% going to unknown sources when it was intimated that Trump maybe one way before he took office. We can’t loose are mind’s every time Trump does something. You are going to burn us people out. Please stop the faux outrage. It wasn’t there when Obama abused the Constitution and it wasn’t there when HRC destroyed classified evidence or lied under oath over 80 times. It wasn’t there when AG Lynch refused to do her job and answer questions to Congress by pleading the 5th about HRC. Never under estimate a man’s ego when Obama did what he did to him at that dinner. That is the driving force. You all want to find some evil in the man that really isn’t there. Stupid tweets and comments aside. ", "child": "", "name": "448_6", "parent": "448", "title": ""}