{"content": "Well surprise, surprise. I some how do not think most of us needed to be told that tRump was still dipping his fingers in both pots, the businesses and the government job. He violates the Constitution he swore to uphold and we are supposed to be surprised? I just want to know how long will the republicans let this go on before they do something. Because if he were a Democrat it would have been over before started. I say we as a people sue him for malpractice. He is not doing his job, the job he said he wanted. He is divisive, bombastic, he lies, he is corrupt, he is a con-man, and he spends more time playing golf and jetting around on our tax dollar than he does actually doing a job. He sends missiles into Syria and then moves on to golf course management 101. Anyone see the insanity in that? What’s not to like about him? Simply put absolutely nothing to like here. He is a shyster that will spend loads of our money, destroy our institutions and walk over the mess and out the door while he blames others. The idea that he and the republicans are fiscally conservative has been blown to smithereens in the first two months of his tenure. They are allowing the leaching money at an alarming rate and there is no end in sight. They just do not want any of the money they spend to go to the American people for care and support. It can only go to corporations and businesses they approve of. Corporate Welfare I believe we call it. Then the corps get rich and we pay more and more to them. What a great system! PLEASE some one kill the trickle down business support crap. I will tell any republican I see or hear that they are a liar and not fiscally conservative. If they were Donnie would not be flying to Florida every chance he gets. They all need to go. This is simply put government by corporation. Crooked, corrupt, money hungry, uncaring corporations. Meanwhile folks are struggling to pay bills, get health care, pay taxes. I support taking healthcare away from the Senate and the Congress. Sorry for the screed but I am angry and fed up with these liars who are going to run us into the ground. ", "child": "", "name": "457_5", "parent": "457", "title": ""}