{"content": "A Rebuke to Modern Self Seeking Politicians from a children’s book, Written a decade ago. The Trump power grab reminds me of of a fantasy Young Adult novella I published in 2008 called “Mihte’s Quest: Kids in the Underworld”. It tells the story of a faerie boy born on the winter solstice hidden in the human world as a changeling because Balor his Titan grandfather wants to kill him and enslave the Faerie-world to prevent spring. He with his human sibblings are abducted and taken into the Underworld by Balor without the titan knowing who the hero is. They escape slavery and are set on a quest to show which of the three is to stay and become the Faerie-world’s saviour. On their journey they become entangled in fairy tricks, solve riddles and are asked to lead the resistance against Balor. Upon the arrival in Seeliemeet the capital of the Seelie Elves, Elphin their Elf guide tells looks for his family and then announces the first minister is coming and gives an explanation to Jamie the eldest: *** Quote *** ‘Elphin shouted loudly to the assembly, “Everyone! The first Minister’s coming!” staying on his horse, hoping to use the advantage of his elevation to look for his family in the crush. He thought they may have seen him and might come to him. Sadly, he needed to step upon the trampled field, without the success of a family reunion. As he stood beside his towering horse the crowds parted to make way for the leader of Seelieland. Elphin said to his fellows as the reception party approached. “You’re greatly honoured that His Humbleness the first Minister has come to greet us.” “Is he a king?” Jamie turned with a frown. “No! Goodness gracious me!” Elphin looked shocked. “We’re democrats, unlike the Unseelie. To be a member of parliament you must show humility to everyone and not draw a salary greater than the poorest in the land. It’s a great trial and only exceptional people seek election.” “Oh!” “Sometimes an MP will resign for breaking his oath of humility or poverty. Hush! Here they come.” Jamie marvelled at how different Seelie politicians were from human ones. Humans always claimed they knew best, changing for change’s sake, having the answer to everything and never admitting fault. Could Seelieland be a real place where virtue, selflessness and sacrifice are everything?’ *** End of quote *** This story could be considered prophetic concerning Donald Trump’s rise to power and the imposition of an American Oligarchy. Trump is neither humble, nor self-effacing as the custom of the people of Seeliemeet. As a believer in eugenics and the superiority of the successful, Trump has no idea as to how ordinary citizens live. Born to privilege, he cannot conceive the numerous glass ceilings others might face in just getting an education of sorts. We can only deduce Trump believes trickle down economics will suffice to satisfy the plebeians. At the same time, he feels along with many Republicans the represent the founding fathers of America, nothing is further from the truth. The are becoming more like the exploitative religious zealots and squires who happily bought white slaves from Britain at 40 shillings a head and used them to claim land grants in exchange for stolen Americo-Indian land. ", "child": "", "name": "462_12", "parent": "462", "title": ""}