{"content": "This isn’t just Paul Smith running a lone crusade. I’ve written to Congressman McClintock and phoned his office, leaving a message about the Republican-proposed attempt to destroy affordable healthcare for many in our district. I did not receive a response to either message. Tom McClintock claims to represent us, but his votes have been reprehensible, and his attitude towards constituents is equally bad. We are not a wealthy district; there are not many high-tech jobs. Many residents are older. I pointed out in my messages that the Republican proposal would make healthcare unaffordable for myself, and many other constituents in the 50–64 age range. Instead of listening and considering alternative (and fact-based) opinions, McClintock is locked into party-line voting. He falsely accuses his own constituents of being some sort of out-of-district agitators. All he has to do is actually *listen* and consider what people in the Central Valley want and need, then vote accordingly. But I guess it’s easier to lie about us, and vote for policies that will destroy lives in our district. The obscene proposals for which Tom McClintock has been voting party-line also include removing controls on pollution that is destroying our air and water, and causing temperatures to rise around the world. Defunding women’s health services. Removing regulation on financial companies that were responsible for the 2008–2009 collapse. Remove any semblance of privacy on the Internet. Drive the deficit and National Debt into the stratosphere by increasing military spending that is already by far the highest in the world. Build an unnecessary wall at taxpayer expense. Hunt down Americans who have lived here 30 years and deport them because they didn’t get the right paperwork back then. It almost seems as though McClintock and his fellow Republicans go to work each day with a checklist of “how can I destroy people’s lives?” Each bill they propose is one more slap in the face of Americans. Enough is enough! Vote these people out of office before they wipe out every trace of the American Dream. ", "child": "", "name": "483_2", "parent": "483", "title": ""}