{"content": "Please stop promoting and normalizing the sexual harassment of female staffers and stop normalizing a culture of sexual assault and sexual harassment. Sadly I have to agree with Mike Pence. I worked for the Canadian parliament and women were sexually harassed all the time in the Liberal Party and New Democrat Party. Many men think being an unaccompanied female staffer trying to network means you are hitting on a married man your father’s age and is a license to try to grab your boobs. Pence is right. I was wondering why girls in the Conservative Party of Canada stayed, and the turnover for women in other parties was sky high. Maybe it’s better for the Economist to send a man. You talk talk about the ugly side of sexual harassment in politics, where alcohol is served, and when girls complain, they are fired from their job. You are privileged and don’t see it from the perspective of a female staffer. Marriage for me was a relief. I go alone to large events, leave after men finish the first glass of alcohol & don’t drink with men at work- just Pepsi for me. One to one meetings with a man, I drag my husband. Ever since then, I was no longer sexually harassed. It’s human biology. A lot of modern western feminist thought was based on fighting the Social Biology school of thought, based on marxist ideas that man can conquer nature … very much like the invention of chemicals that we later found harm our kids and environment and are slowly returning to more organic farming and was of life. Mike Pence is right. He saves young women from being raped and you are promoting that as a priveldged female journalist. No politician is going to rape you because no politician wants that story in the press — you are a powerful woman, unlike female staffers and interns. Think of female staffers and interns before you pounce on people for having religion … because how well did atheism and secularism work out for the world? US had Obama and Trump, two atheist presidents, so Bashar Assad kills 500,000 people with impunity when it’s easy to arm the Syrian FSA rebels to remove him — so spare us your anti-theism, wrapped up as pseudo-feminism ", "child": "", "name": "486_5", "parent": "486", "title": ""}