{"content": "Mike Pence: A Christian Fascist Who’s a Heartbeat Away from the U.S. Presidency November 21, 2016 | Revolution Newspaper | revcom.us The United States will now have a vice president who wants to ban all abortions, overturn laws barring discrimination against LGBT people, fully unleash the police to stop and frisk Black and other oppressed people, and carry out other extreme steps that will lead to horrible new leaps in repression. Mike Pence cites Bible verses to back up such ugly policy stands. He is a Christian fascist who will be #2 in the White House. One of Trump’s sons reportedly said before the election that his father’s vice president will be “the most powerful vice president in history,” in charge of domestic and foreign policy while Trump concentrates on “making America great.” Trump’s people denied the report — but, in any case, Pence will wield enormous sway. He is already playing a major role, including choosing cabinet and other officials. He met top Republicans in the House of Representatives and told them to “buckle up” to move quickly, making clear he’ll play a leading role in pushing fascist laws through Congress. As writer Jeremy Scahill put it (in an article at TheIntercept.com), “Mike Pence will be the most powerful Christian supremacist in U.S. history.” Pence is part of a Christian fascist movement that aims to impose on society a government, laws, and dominant morality based on strict interpretations of the Bible. According to a Slate.com article, when Pence was a congressman from Indiana, “Aides and other politicians often saw him reading his Bible, and Pence would cite specific verses to justify policy arguments. ‘These have stood the test of time,’ he told one staffer. ‘They have eternal value.’” He made an anti-evolution speech on the floor of the House saying he believes in “intelligent design” (an unscientific claim that life is too complex to have evolved and must be the work of God) and arguing that it be taught in schools. Bob Avakian (BA) pointed out in his work The Truth About Right-Wing Conspiracy… And Why Clinton and the Democrats Are No Answer that these Christian fascists are “political leaders and forces who insist that ‘traditional morality,’ as embodied in the patriarchal family as well as ‘right or wrong’ patriotism — and rationalized in terms of fundamentalist Christianity — must be the basis for maintaining the cohesion and solidity of American capitalist society and the dominant position of imperial America in the world arena.” As BA noted, “These people are deadly serious — and they are very powerful.” (This article came out at the time of Bill Clinton’s impeachment, but it remains very relevant to what is going on today.) As BA also pointed out, these Christian fascists do not, today, insist on fully carrying out “biblical truths” — for example, that gay people, adulterers, rebellious children, witches, and so on must be put to death. BA dug into what’s behind this: Once again, the leading Christian fascists do not insist on applying these and many other biblical laws and commandments because, under present circumstances, it would not be politically expedient for them to do so — it would be seen as barbarous by the great majority of people, even in bourgeois society, and it would actually undercut their political objectives. … What they do is to set themselves up as the authorities, the “interpreters” and the “arbiters” of “biblical truth,” who can and should decide, not only for themselves but for society as a whole, what in “God’s absolute laws and commandments” and “absolute moral principles” can and must be applied and what must be ignored or explained away at any given time. This is why it is correct and necessary to identify them as theocrats: they do, in fact, seek a form of rule which is based on religious, and more specifically Christian, authority — as represented by people like themselves — in the service of the American capitalist-imperialist system. It is not necessary to be atheists, as we revolutionary communists are, in order to recognize the atrociously reactionary nature of such a political program and the need to vigorously oppose it. These theocrats are deadly serious about imposing their will on society. And now, a leading theocrat is a heartbeat away from the presidency, in a powerful place to push forward the overall Christian fascist agenda. Targeting the Right to Abortion The forceful assertion of “traditional family values” is central to what the Christian fascists are aiming for. And attempts to cut away at, and even eliminate, the right to abortion are at the spearhead of this. They want to overturn the Roe v. Wade Supreme Court decision legalizing abortion. Find out more about the revolution Find out about BA, the leader of the revolution Up to this point, a key part of the strategy of the anti-abortion movement has been to put increasingly severe restrictions on abortion state by state. As Indiana governor, Pence has been among those at the forefront of this. Earlier this year, Pence signed a law stuffed with all kinds of restrictions and requirements designed to make it even more difficult for women to get an abortion and for abortion providers to function. Under the cynical justification of protecting women’s safety, the Indiana law, like similar ones in other states, required abortion doctors to have admitting privileges at a local hospital — a medically unnecessary rule that is impossible for providers to meet. The law prohibited women to have an abortion for various reasons, including when tests show that the fetus will be born with Down’s syndrome or other disabilities. It required that clinics bury or cremate aborted fetuses — in other words, to treat fetuses legally as actual persons, which they are not. These abortion restrictions are not about the health of women, “to protect life,” or any other falsehoods used as justification. The real objective is to tighten patriarchal control over women — to turn women into nothing more than incubators and sexual playthings for men. That’s why these anti-abortionists are also against access to birth control. Pence himself has been active in the efforts to defund Planned Parenthood, a major provider of birth control for women, especially poor women. The anti-abortion law Pence signed was stopped from going into effect by a federal judge. But now, Pence will be in place to charge ahead with the threat he made during the presidential campaign: “We’ll see Roe v. Wade consigned to the ash heap of history where it belongs.” Targeting LGBT People Another major aspect of the Christian fascist push for “traditional family values” is attacks on LGBT people. While in Congress, Pence voted against employment nondiscrimination protections for LGBT people, opposed same-sex marriage, and tried to block federal funding of HIV treatments to organizations that are supportive of gay people and require that it go only to organizations that “provide assistance to those seeking to change their sexual behavior.” As Indiana governor, Pence signed the so-called “Religious Freedom Restoration Act” (RFRA). The RFRA was intended, despite the transparent claims that it was about “religious freedom,” to shore up bigotry and prejudice against LGBT people and all kinds of oppression rooted in fundamentalist Christianity. The RFRA banned cities and towns from enacting laws that provide protection for LGBT people against discrimination. Pence and others were forced to step back a bit and amend the RFRA in the face of righteous protests. But the Christian fascists have hardly given up on their crusade against LGBT people as part of their overall ultra-reactionary program. More Reactionary Shit from Pence Jeremy Scahill outlines other policies pushed by Pence that will mean even more murders by police and leaps in overall repression against Black and other oppressed people: “He has advocated greater militarization of the so-called war on drugs, including escalated military patrols. Pence denounced activists and others protesting recent police killings of unarmed African-Americans, charging they ‘seize upon tragedy in the wake of police action shootings.’… Pence is a strong supporter of stop-and-frisk programs, which in New York were used overwhelmingly against people of color. ‘It’s on a constitutional footing,’ said Pence.” Scahill also lists some of Pence’s positions on unleashing the overall repressive machinery of the U.S.: * He supported making the Patriot Act permanent and wants to ban the burning of the U.S. flag. * Pence does not believe federal law enforcement agencies should have to get a FISA (Foreign Intelligence Service Act) warrant to conduct domestic surveillance and voted against requiring any warrant for domestic wiretapping. Unlike Trump, Pence has not openly promoted torture. But when asked on CBS Face the Nation on November 20 whether he agreed with Republican Senator McCain’s opposition to torture, Pence refused to rule it out, saying: “We’re going to have a president who will never say what we’ll never do.” Trump and Pence Together Pence is often portrayed in the mainstream media as more “stable” than Trump and a “bridge to the establishment.” Pence does have longstanding ties to the more “establishment” Republicans, including major financial backers like the Koch brothers and Erik Prince, founder of the Blackwater security firm, which has close ties to the U.S. military. What does it say about the illegitimacy of the entire political structure of the U.S. that a Christian fascist monster like this is considered an “established” figure? Pence and Trump may seem like an odd pairing — a religious fundamentalist and a crude, leering reactionary sleazebag. What ties them together is their fascist program, their view that this is what is needed to keep things together for the capitalist-imperialists and “make America great again.” Major powerful sections among the rulers of this society have, for decades, either built up or enabled the fascist forces that Trump and Pence represent. And now, these fascist forces are poised to take command of the state in the USA. ", "child": "", "name": "486_7", "parent": "486", "title": ""}