{"content": "You realize that the behaviors you are ascribing to Christians are not exclusively Christian but rather — what many religions and spiritual teachings say makes a good human being? The problem with Christianity being irrelevant isn’t solely because those who most vigorously claim the label are the most anti-Christian in their daily practice, it’s because Christianity literally is the religion that teaches that Jesus is the son of God and the savior of humanity. Yes, Jesus taught us to live a life that was compassionate and loving towards others but he’s not the first nor only religious figure to preach these things. However, you cannot call yourself a Christian just because you are a good, loving person towards others. I can be a good, loving person towards others and call myself an atheist. The Bible is more than 2,000 years old and so are the outdated ideas about how families and slaves and kings should conduct their lives. Christianity needs to update their textbook to meet the modern era if they want to become relevant. It’s the inability to modernize and engage with people about stories from today instead of thousands of years ago that is going to lead to Christianity’s ultimate demise. People and communities change, the Christian religion has not changed for thousands of years. And also, Revelations is part of the Christian faith — a book that literally promises heaven and everlasting life *only* to Christians and *only* after the total destruction of all of humanity in a brutal series of wars. The entire religion of Christianity has a conclusion that their oh so loving God will destroy all of life, all of humanity, and only a few who followed a strict and outdated set of rules will be “saved”. You can’t pick and choose what you like about your faith and then say you’re a Christian. I really enjoyed reading the article, but I do think you’ve become enamored with your faith and a little blind to what it really says in that book of yours. ", "child": "", "name": "526_17", "parent": "526", "title": ""}