{"content": "Have You Ever Wondered Whence The Notion Of God And Religion Come? I mean, for as far back as we can tell, every society has had a God impulse running through it. Often it was not a single god (monotheism) but rather many gods (polytheism). Early man likely favored multiple gods because looking at the various talents of individuals among them would likely cause them to assume that life was far too complex for either one man or one god to master. So there were Gods representing objects in the sky and features of the earth and moods of thought — moon and sun, sea and mountains, love and hate. But where and why has humanity latched onto the idea of some all-powerful supernatural force or set of forces. Well for me it all goes back to the way I envision how the human mind is structured. Yes, this is my personal theory so you can take it with a grain of salt. But bear with me for a moment. For me the primitive base mind is pure ego, where all the nascent emotions of fear and joy, love and hate reside. The primary function of this base ego mind is survival of the individual and the species. Embedded with this survival mechanism is the notion of god and religion. This is because the survival impulse is so powerful that it insists that an individual survive even beyond one’s mortal physical being. For this to be possible, it would of course have to depend on the good graces of some super external power, and so was born the notion of God and religion — mankind’s last refuge for everlasting hope. So why is that while many folks are bent to react to their primitive religious impulse, others feel little or no pull at all? The short answer is developed intellect. By itself base ego is very crude and very conservative. It abhors change. Folks of this nature are referred to as being self-centered and narrow-minded. On the other hand those with curious, exploratory, highly developed intellects, those able to rise above their primitive base ego and see life and the world in much broader terms are labeled as understanding and broad-minded. The more open-minded a person may be the less chance that the notion of God and religion will have much appeal for them. Thus there is always a natural tension between curious persons of logic and science and those doctrinarians of religion. Pure ego cares not a wit about the welfare of others. It is from developed intellect that compassion and empathy flow. Thus it is possible that there can be folks with high IQ (mechanical smarts), yet being devoid of a broad viewing intellect end up as a ruthless Adolf Hitler or Donald Trump type personality. Moreover as the religious impulse is so tightly entwined with the egos survival mandate, those of different religions pose at the very least a psychological threat to one another. For instance Jewish minorities living among Christians, especially in Europe in past decades, have always faced a potential existential threat. This is because when it comes to religion any belief that does not reinforce one’s own belief is seen as a threat to one’s feeling of survival. Thus if Jesus is a Jew and the Jews have rejected Jesus as God’s redeeming stratagem, then simply by their existence among Christians Jews are seen as calling Christianity a fraud, and thus a psychological threat to a Christian’s existence. Thus at the most primitive level it was more acceptable for Christians to see Jews dragged from their homes by the Nazi Gestapo than to see such things happening to other Christians. The bottom line is that for those of limited intellect religion can be a double-edged sword. It can inspire hope when there is no reason for hope and it can inspire hatred of others, especial those of other religious belief systems, and of course it can inspire hatred and fear toward non-believers as well. ", "child": "", "name": "526_16", "parent": "526", "title": ""}