{"content": "Would it be asking too much for everyone to use the words “racism” and “racist” correctly? “Racism” is the belief that one’s own race is superior to other races. Hitler was racist. The KKK is racist. White supremacist groups are racist. I believe that Hortman is white (if her picture is any indication), and she was talking about other whites. Unless Hortman is of some race other than that of the white males she was speaking of, and she believed that her race was superior, she wasn’t being racist. I believe that Peppin meant “bigoted”. Anyone can be a bigot — that just means a person who is intolerant toward those holding different opinions, or one who applies stereotypes unnecessarily. But let’s look at what really went on. A woman of color was speaking, and a number of lawmakers decided she wasn’t worth listening to, so they left to go play cards in the retiring room. Curiously, this group consisted only of white males. Of course, it also consisted only of Republicans. Now, this could have been racism at work, if these men believed that this woman of color was inferior to them because of her race. Or it could have been sexism, if these men believed that this woman was inferior to them because of her sex. Or it could have been that she was a Democrat, and these men believed she was inferior or not worth listening to for that reason. That’s neither being racist or sexist — that’s just being assholes. Whatever their reasons, Hortman called them out on it, based not only on this incident, but apparently a track record of disrespect toward women of color. If Peppin wanted to criticize Hortman for that, she should do so using correct vocabulary. Using the word “racist” to describe Hortman is completely inaccurate. Hortman is the same race as the men she was talking about. It would be impossible for her to be racist in that situation. I think Peppin needs to drop the word “racist” and try again. However, she might have a stronger argument against Hortman if the entire group relaxing in the retiring room weren’t ALL white males. Apparently, we’re supposed to believe that’s just coincidence. ", "child": "", "name": "532_16", "parent": "532", "title": ""}