{"content": "“None of us are entirely open-minded.” Maybe you should try speaking for yourself and do not be so arrogant as to presume you can claim to know the mind-set of everybody else, based entirely on your own prejudices and whatever new-age politically correct mumbo-jumbo you were force fed in college. “It’s like when people say, “I don’t see colour” or “I don’t have a racist bone in my body.” Not possible.” Yes it is quite possible. Maybe you have just never lived amongst a muti-ethnic population. The only thing I know about you is that you have the arrogance to think you understand what is or is not possible for other people. Here is a clue. Just because something is not possible for you, doesn’t mean it’s not possible for people who may be a little more grown up than you. You have the right to keep turning people into walking caricatures in your own mind if you want to. But stop assuming that everyone else has such a narrow view of the world. “People only say that if they don’t know how racism and bigotry work.” Do they really? And I suppose racism is defined as whatever pompous virtue-signalling “educators” like you decide it must be. Here is the pretty much universally accepted definition of racism. It is what the vast majority of people understand racism to be and most people know full well exactly what it is and how it works. Racism: A belief that race is the primary determinant of human traits and capacities and that racial differences produce an inherent superiority of one race over another. “We have all been raised to judge people based on race” If you were raised like that then you have my sympathy. Most people I know were raised in completely the opposite view. “We are creating a reinforcing cycle; the more we cling to the belief that we are free of bias, the more defensive, blind, and deaf we are to our biases.” This is classic ideological brainwashing which has been used to demonise a particular group for thousands of years. The major religions used in the form of the concept of “original sin.” We are all inherently guilty even if we have never done anything wrong. The only way to be forgiven our sins is to confess, over and over again. Self-flagellating is the only path to salvation. The Inquisition were masters of it. The Marxists were too. The great purges included festivals of innocent people, confessing their guilt in order to be seen as “good communists” after all. Most of all refusing to agree that you are guilty (because you aren’t) is all the proof needed that you are indeed guilty. Kind of like a witch trial really. That seems to be the concept you’re running with. Shame on you and your ilk for infecting the education system with it: This garbage is not education. It is indoctrination and young students of all colours deserve better than this bigoted nonsense. “I’m sure it’s annoying for him to experience people making negative assumptions about him because he is a white male. But it’s also time for him to grow up.” Oh my: You have been drinking this cool-aid for so long you would even poison your own son with it! Time for him to grow up you say? He should just turn the other cheek because black people have to deal with it too. That was another feature of communist doctrine: They would agree with your suggestion that two wrongs do make a right. “For example, black women put up with people’s negative assumptions about them on a regular basis.” I am sure they do. Black men do too. So do white men; as evidenced by your little screed. Then again at least there don’t seem to be many people actually making a living from making negative assumptions about black people. But I can assure you that absolutely everybody has to put up with people making negative assumptions about them, as your son has. But you dismiss it when it happens to him, and cast it as a serious offence when it happens to someone else. I am pretty sure that is not how you do mothering and I am positive that is not how you do education. But I am confused again over your constant portrayal of white boys as the perpetrators of racism and black girls as the victims. Have you been drinking the feminist cool-aid too? Did you just get the whole package deal on bigotry? Are white girls not included and do black boys also not suffer from racism? White boys obviously do too, as your son has made clear. “It’s exhausting choosing which battles to fight and how to fight them — without being stereotyped as an “angry black woman.” How would you know that Rosalind? You look pretty white to me. Lots of things are exhausting to lots of people. How about the far more widely cast refrain of “angry white men” or “white privilege” or “fearful white men?” How many disparaging stereotypes can you apply to a particular group of people in one page Rosalind? Because I think you just won that competition. And if you read your own article carefully you will find that it is your position that two wrongs make a right? “I’ve had several teen boys say recently that they just wished people would stop talking about race and that if we did, it would stop racism from happening.” Some unusual wisdom from teen boys: I heard the same point being made very eloquently by American actor Morgan Freeman too. “It’s an illogical argument :” No it isn’t. It is a very sensible argument. Racism dissipates when people stop looking for excuses to see it everywhere. First it becomes a joke and then it simply evaporates. That is why toddlers are not racist. Because they don’t even know what it is: “The people who experience racism and discrimination have no choice but to think about it and talk about it because it’s part of their everyday experience. It’s only people who are not discriminated against that believe this argument makes sense because they can convince themselves that the problem doesn’t exist.” The people who are discriminated and routinely castigated in America today are primarily white males. Just so you know. It is also illegal to discriminate against anybody in the US except for white males under certain circumstances. Just so you know. Example: You have repeatedly blanket-insulted “white-boys” in this article while raging against racism without a hint of irony. Try insulting “black boys” as a group and see how long it takes you to get banned. “But their response is motivated by fear — fear of not knowing how to be with people who have a different life experience” No it isn’t. It is motivated by boredom; by irritation; by a simple desire not to want to be around toxic judgemental people who feel the need to make everything about race. “Yes, I’m male and white but I’m also a lot of other things.” Oh Mea culpa, mea culpa, mea maxima culpa: Should the “white boy” throw himself at the feet of the noble “POC” while rolling out his self-esteem and dignity to be stamped on? “He also need to challenge himself.” No he doesn’t. He is not “privileged” (whatever you think that means) he actually has less societal privilege in many ways than minorities and he certainly has far less societal privilege than his female peers. If you didn’t know that then drop me a note and I will be happy to educate you on the subject. He doesn’t owe anybody else anything. What he really should do is find himself a better school; one that is not full of “educators” like you. He deserves better than to be surrounded by nasty little bigots constantly judging him as somehow inherently dysfunctional because of his sex and his skin colour. Have you looked up “bigotry” yet because it is obvious you don’t know what it means? But I suspect that you do know what it means but you do it anyway. You do it because racism, like sexism; is a billion dollar industry and there are too many foundations and think-tanks and “charitable” organisations from the grass-roots to the highest levels of governments that depend on it being an epidemic, even when it clearly isn’t; and there is all that lovely funding to be had. So let’s get busy and find racism under every stone, in every tree and in every misunderstood sentence. And if we have to poison the minds of our young students and divide them like they haven’t been divided in decades, then so be it: It is our bread and butter after all. It is in our interests to manufacture as much of what we claim to be fighting as possible so we can continue to fight it, while feeling terribly morally superior of course. We will damage the futures of white kids by teaching them that they need to be constantly diagnosing themselves as problematic. We will damage the futures of black kids by teaching them that they perpetual victims, destined to be held back by a systemically racist system. We will indoctrinate them with these self-fulfilling prophecies because well — racism is our bread and butter. You are damaging the self-esteem of white kids and dis-empowering black kids. You want to stop racism and do some good for both black kids and white kids — stop telling white boys that they have some duty to “shoulder the white man’s burden” and stop telling black kids that the world owes them something. ", "child": "", "name": "534_14", "parent": "534", "title": ""}