{"content": "It’s a difficult question for most people, isn’t it? A lot of people have written from a stance of politics, or religious ideology (which I could have easily done more of), but instead I felt it was important to tell a story from a human perspective with some people from my church mixed in doing the right thing. I didn’t want to end up in endless debates about my personal views. Anyone can read an op-ed piece, but what they remember is how an article made you feel. For me personally, on the StrengthsFinder test, one of my top strengths is context. So looking at the current situation from a historical context, I remember that we barred fleeing Jews from Nazi Germany from entering the U.S. during WWII because they could have potentially been spies for the German government. Universally, that’s now been condemned. But echoes of it seem to be happening now with Syrian refugees. So is our security more important when the U.S. has a responsibility to it’s citizens first? But then that begs the question, does nationality and safety trump our humanness? Quite the pickle. From my own religious viewpoint, my founder tells me to slay my security, love my enemies, and welcome the foreigner. The church I attend takes no political stances as our congregation is split (nor would we), but we take serious the command to help refugees and the immigrant and currently help with 600 Syrian refugees in Austin, TX along with a few other churches that have partnered (if you want to see all we’re doing, go here). As someone who fought overseas in Iraq and Afghanistan, I’ve seen the gravity and horror of war. There’s this memory that always sticks with me and hurts when I think of it. This family was fleeing Iraq to get to Jordan because where I was the fighting was intense. They ended up getting lit up by a 50 caliber machine gun when they ran a checkpoint. The mom had her arm blown completely off. Luckily a Special Forces medic saved her life. We made sure to pay them a lot in reparations, but it was so hard standing there handing over a wad of american dollars to someone who was just trying to flee for their life and their families. I always think about that story and simply wonder, “What if it was my family?” ", "child": "", "name": "562_4", "parent": "562", "title": ""}