{"content": "Far be it from this little Muslim girl to offer a contrary view……but, I was raised Christian, so what the heck. :-) You seem to be abusing analogies, in my view. In Christian theology, the death of Christ is a substitutionary atonement. Here’s how it works: Adam was created (or imbued with humanity) and at that time was a perfect being, free not just from sin, but from guile.Well, Adam and his girlfriend made a little mistake. :-(Because of that mistake, humanity lost their claim to spiritual perfection.Enter Moses. God gave Moses a scheme by which man could reclaim spiritual perfection. Unfortunately, it involved 650-odd commandments (mitzvahs, if you’re Jewish) and a once-yearly blood sacrifice of a perfect animal. So, you do all that, and you’re spiritually perfect again……until you stub your toe coming out of the temple five minutes after your sacrifice, yell out “Goddamit” (penalty flag —4th commandment violation) and then you have to wait for next year to be spiritually perfect again. So, it’s kind of an imperfect process.So, God says “Ok, I guess I’ll have to do it myself” (this is where Christians diverge from Jews and Muslims) and through an interesting miracle, takes a part of Himself and gets that part born into the world that He Himself created as a mortal.(This is where the account gets very interesting, and has been dramatized by more authors and filmmakers than one can count over two millenia. JRR Tolkien did it, CS Lewis did it, even JK Rowling did it, all using fascinating symbolism. And of course Mel Gibson did it too, without the symbolism. But one of my favorite dramatic accounts of this part of the story is this):  So, now you have a perfect human, which then can become the perfect sacrifice, and substitutes himself for that lamb, dies a horrible death nailed to a cross after a brutal beating, and like all dead humans, goes down to hell, where Shaitan is especially glad to see him, because he knew that Jesus was Someone Special. (But he didn’t know HOW Special.)However, he wasn’t glad for long. Because the created cannot hold the uncreated, and the presence of God in Hades blows the doors off the place. Same movie, fabulous dramatic interpretation of the event:  And, from there, Hell can’t hold any soul if that soul consciously concurs with and accepts the substitution sacrifice of Jesus. (Short segue for those not big Matrix fans. Neo’s real name is Thomas A. Anderson. “Thomas” is “twin” in Greek. “Anderson” is “andros” (man) and “son” (here we use English. So, “Thomas Anderson” roughly translates to “twin of the son of man”). His online name is “Neo”, which is “New”. So, his online name translates to “new son of man.” And, the girl who loves him is named “Trinity”, so in the resurrection scene, he is resurrected by the “Love of the Trinity.”) That’s just a short primer. The Matrix Trilogy is a symbol-rich environment. :-) Regardless, enjoy your feast day. ", "child": "", "name": "569_12", "parent": "569", "title": ""}