{"content": "Hey Matt. I was very touched by your honest depiction of true Christianity as opposed to the feel-good religiosity of those merely applying that label to themselves. The world at large is not aware it was man who cut the cord which tethered us to God, it was man who tossed the bridge over the divide into the chasm making it impossible for us to cross over. That’s where the problem lies with man’s version of goodness; thinking we can do, say, or be something which will earn us admission into eternal life. Psalms 11:3 says “If the foundations be destroyed, what can the righteous do?” All too often today, we see many professing Christians making more and more concessions that maybe the Universe IS billions of years old, or maybe the Earth IS 10’s of thousands of years old, too willing to adapt and adopt what the secular world manifests, instead of taking God at His word: That not only dilutes the truth of God’s word, it puts mankind on a path of revelatory delusion, thinking all is well when in reality the flames are licking at their feet. “ As it is written, There is none righteous, no, not one: There is none that understandeth, there is none that seeketh after God. They are all gone out of the way, they are together become unprofitable. There is none that doeth good, no, not one. Their throat is an open sepulchre; with their tongues they have used deceit; the poison of asps is under their lips. Whose mouth is full of cursing and bitterness. Their feet are swift to shed blood. Destruction and misery are in their ways and the way of peace have they not known:” Romans 3: 10–17 KJV I have been saved for almost 40 years, and yet it is only within the last year or so that I have truly begun to understand the concept and reality of grace. The fact that there is/was NOTHING I could ever do to ingratiate myself with God, nothing that would make Him open the door for me and bid me welcome. The fact that God loved me so much that he would take human form and sacrifice Himself, and in so doing, not only opened that way for me but for anyone who chooses to humble themselves, repent, and believe on the name of Jesus. It is a humbling experience, and I am thankful He chose me before the foundations of the world. Grace and Peace to you, and may God continue to bless your discipleship. “The Lord is not slow in keeping his promise, as some understand slowness. Instead he is patient with you, not wanting anyone to perish, but everyone to come to repentance.” 2 Peter 3:9 NIV ", "child": "", "name": "570_3", "parent": "570", "title": ""}