{"content": "Your story is a clear reminder that its truly an interdependent world we live in, where our abilities to succeed often depend on the approval of others. I know first hand what its like to be rejected in my work, and I agree, it seems we’re all at the mercy of those gatekeepers. The rejection itself happens for a number of reasons, often its because people over value their work more highly than they should be, and its simply because humans aren’t always the best judges of themselves or their capabilities. In other cases people are rejected simply because those gatekeepers are skeptical for some reason, and they’ve decided not to give you an initial chance to begin with. Such was the case when I first entered the IT field after leaving college. I was rejected by by countless employers, and the repeated rejection was honestly too much to bare. Why wouldn’t anyone just give me a chance? It was a question I had to ask myself over and over again. Here I had the credentials, I had the knowledge, and yet I was thrown under the bus by every employer I engaged with. Every job interview was the same, “How do we know you can do what you say you can do?” or, “Sorry, I just don’t think you’re a good fit for this position.” Maybe I overvalued my own capabilities? Or maybe it was just that those gatekeepers refused to give me a chance? Or maybe it was both? But I learned something from all of this. I took my shear anger and frustration and turned into something great. I decided I was going to prove the world wrong, and despite already having my technical certifications, a college education, and some good experience, I took it to the next level by studying 75+ hours a week for an entire year. Suddenly, I knew I was the master of my craft, but the rejections continued. Then I realized something I hadn’t before, I needed to sell myself to these employers, and I wasn’t showing the level of confidence I needed in order to be accepted. I also realized that just maybe I was trying to jump into the game too fast, and needed to start small. I began fixing computers for local consumers through ads on craigslist, then over time small businesses piled on as well. Next thing I knew, I landed work running the entire IT infrastructure for a veterinary company, and believe it or not, there was never a single job interview involved. In fact, I was a private contractor, I had complete control. It was the slow approval process that got me where I wanted to be. The approval of those local consumers who’s computers I fixed opened the doors to small businesses, and then over time the bigger ones. Here I went from begging employers for a job, to businesses begging for my help. The phone would ring at 1am on a Friday night, “We need your help, and we need you here right now!” An honestly good feeling to say the least. Here I went from begging for a job, to the world begging for my help. But things changed over time. After the economic collapse of 2008, things just got worse year by year, and by 2012 all my hundreds of IT clients were gone, their businesses either closed or scaled down to nothing. I lost my business after 7 years, and it was devastating. Ironically, I was back looking for a job again, and once again I was rejected over and over again, lol. I can only help but laugh now. The lesson here, you have to display confidence in yourself when seeking the approval of others. Often people don’t want to put confidence in those who aren’t confident themselves. It’s likely you didn’t display a strong enough level of confidence to those publishers to make them want to take a longer and harder look at the work you do. And, just as I started small by repairing computers of locals, you likely didn’t start small yourself and engage with those in your field in order to build a reputation that would get you the approval you were seeking. Also, rejection is partially the result of our reliance on others. In my case, I found ways to ditch that reliance and venture out on my own. No approval of employers? Fine, I’ll just get creative and create my own business. ", "child": "", "name": "599_1", "parent": "599", "title": ""}