{"content": "How (and Why) to Write Realistic Aliens and Magic The difference between asking “what if” and writing what audience knows By MARTIN REZNY First of all, I have to admit, I do like realistic worldbuilding in fantasy and science fiction. A lot. I have in fact spent the last couple of years building a sci-fi world using all the science and history that my brain can absorb, for a game where the world itself is the story, for the most part. At the same time, I’m bored to death with literary realism. Immediately, it should become obvious that some definitions are in order before I can even begin to try to explain why I believe that Michel’s dissing of realistic worldbuilding is a bit unfair. So, what is realism in writing? As far as I can tell, there are at least two very different ways of writing, and particularly worldbuilding, that can be considered realistic: Realism as in trying to create an appearance of reality from the perspective of contemporary human readers, which is at the core of the classical literary genre of realism. In fantasy or especially science fiction, this shows in the aliens or magical beings being humans in disguise in a society that is a reflection of some current or historical human society.PROS: This can create safe distance that allows human peoples to see that some things they may consider normal and fine are actually wrong, like racism or fascism. Arguably, works of this genre have done a lot to advance the cause of secular humanism.CONS: This approach is prone to clichés and stereotypes and can be actively damaging to human creative freedom and imagination, especially when used in a manipulative way to reinforce the normalcy of immoral acts and unjust social orders — for examples, research “socialist realism”, or which classical authors actually were racists or fascists.Realism as in asking and attempting to answer a “what if “ question using logic and/or science, typically along the lines of “what if some aspect of reality was different in a very specific way”. Unlike writing human aliens or criticizing existing social orders, this approach attempts to predict events or technologies or generally open up new possibilities or prevent threats by creating self-fulfilling or self-preventing prophecies.PROS: A number of technologies that benefit mankind have been invented specifically after being proposed in fiction, while the explorations of new utopias and dystopias may have inspired real political progress.CONS: Essentially the same, just in cases when it didn’t exactly work out for the better — think scientology. Also, this is very hard to do well and may easily not turn out to be actually in line with reality, not even in the future or on the other side of the universe, or in any actual time or universe. To address Michel’s concerns, yes, magical creatures as far as we know do not exist, since any that would exist would be considered physical by definition, and we haven’t discovered any actual aliens yet. But “what if they did exist” is a valid question to ask. Many things, creatures, events, and social orders haven’t existed yet, but they might, and if they don’t, anyone’s life may become richer or more fulfilling because someone has thought of them. What Michel favors instead of realistic worldbuilding is surrealistic world conjuring, and that’s completely fine, of course. I personally love magical realism just as much as hard sci-fi, to a point where I legitimately don’t understand how the term can be understood as a slight somehow. The problem here is that surrealism and collaborative conjuring between the author and the reader have very different strengths and uses. Can I has all the answers? Michel argues that it is wrong to expect the author to provide all the answers, and that’s fair in a sense that it is indeed impossible for an author to provide all the answers in any scenario. But the act of providing most answers, or at least trying to, is the whole point of certain literary subgenres. It doesn’t automatically amount to good writing, sure, it’s a bit of parallel skill to writing, but if it truly doesn’t matter, then why does the ending of Lost feel so damn lazy and disappointing? On the most basic level, not worldbuilding in a fictional world with some element of asking questions or solving mysteries is like telling a riddle, making people guess what the answer is the whole time, and then showing that the author never thought of any answer, or could only think of a really underwhelming one. That doesn’t mean the author has to spell out the whole answer explicitly, but there’s a difference between it not being divulged, and it never having existed in the first place. Like a murder mystery where anyone could be the killer randomly, or where the first and most obvious person accused ends up being the killer. Don’t misunderstand me though, there are many types of stories that don’t need this kind of answers at all, exactly like the whole of surrealism where the trick is precisely in the multitude of interpretations that the reading allows. Then there are genres that can go either way equally fine, like horror. Horror can easily follow vague and fluid dream logic, activate base human subconscious fears, or draw from not knowing who the killer is while knowing there is one. One can get just as scared in a nightmare chased by Freddy Krueger, dreading bodily violation by the Alien, or guessing logically which of the scientists is The Thing in a fleshy disguise. At any rate, you can’t simply say it’s wrong for readers to speculate while reading works of speculative fiction, even if it does get out of hand sometimes on the internet. Also, what’s so wrong with wanting the author to actually have some answers, to have thought things through? It’s true that good writing doesn’t need worldbuilding beyond a basic setting, especially when the focus is exploration of characters or the human mind in general, or in a, say, lyrical poem. But the surrealist method has its own negative extreme when it becomes artsiness for the sake of artsiness, entirely devoid of answers in the sense of not having anything to say of its own about reality. Art that only says things about art may be artful, but what does it actually do beyond the aesthetic or immediate emotional effect? Having answers in a work of fiction doesn’t automatically make them good ones, but it is one of the main ways to advance real world philosophy with real impact not only on individual human beings, but also institutions like politics, science, or religion. Do you know what’s the first speculative utopia on record? Plato’s The Republic. Saying things often matters, artistry not nearly as much. Ultimately though, these are just the two main approaches to writing, and all art, that exist, equal and opposite — form against essence. Which is still a false dichotomy in this case, because both surrealism and realism can focus on answers and worldbuilding, differing only in how they’re communicating their answers or what logic they’re using to build the world. Look at something like Psychonauts where secret agents physically enter surrealistic mindscapes of villains and inhabitants of insane asylums, or the Dragon Age series with its Fade where thoughts manifest as spirits and warped landscapes, separated from a realistic fantasy world by a (techno)magical veil. Unreal worlds can still be perfectly explicit and logically consistent. In the face of aliens, magical creatures, and all sorts of unreality, one can simply follow any flights of fancy to amuse, awe, or mystify like Tolkien did in The Hobbit, or one can try to explain how everything came to be exactly, like Tolkien did later in The Lord of the Rings. As long as either approach has a point to it in how it’s executed, either aesthetic or philosophical, it’s valid literature. The only thing that’s universally damnable are literary works that try to fake artistry and answers in order to sell more copies by resembling famous bestsellers on a purely superficial level. Exploring the logic of unreality With all that said, how does one build realistic worlds with aliens and magic in them? The key word here is logic. While unreal things can theoretically work in any way, some ways are logically consistent and others inconsistent, and it is the consistency of rules that makes something realistic. It doesn’t matter how crazy any individual made up rule in a fictional world seems when compared to our reality, it only needs to stay consistent in its own reality to feel (and potentially be) real. By this logic, it’s okay to have non-corporeal ghosts exist and not fall through the floor, but only as long as they always not fall through the floor, unless exceptions have a logically consistent explanation as well. The easy example from sci-fi of getting this simple concept wrong is teleportation in Star Trek. If you’re a fan of any of its incarnations, answer me this — does teleportation in that universe work through the shields, or not? The answer is there’s no consistent answer. It’s fine for a technology to appear magical, but it cannot be the whimsical kind of magic that does whatever it wants whenever it feels like (unless our inability to comprehend it is the point). It’s okay to say that one can teleport through the shields if you manage to match their frequency or something, but not to not a have a definite rule about it. Well, as long as you care about realism. To be clear, the problem is not with some literary worlds being inconsistent, it arises when the fact of inconsistency only subtracts from the meaning of that world. There’s simply nothing added to Star Trek by it having not figured out how its teleportation works. It makes the technology less plausible and the plots relying on it confusing, and therefore it’s not okay. Then again, it’s completely fine to not have everything figured out even in a realistic world, but the things that are left open shouldn’t actively disrupt or outright contradict the rules that have been explicitly laid out, especially those that are central to the plot. Some mysteries may even be more effective when left unexplained, in the same way that it was better not to show too much of the shark in Jaws. I personally hope that I never get full explicit answers to things like what actually happened during the Doom of Valyria in George R. R. Martin’s The Song of Ice and Fire saga. In the Mass Effect series, the Reapers turned out to be much less interesting after they were explained, just like the Borg in Star Trek. Not knowing almost anything for sure about these menaces allowed for quite thrilling flights of imagination, compared to which any author-given explanation must have been a letdown. In such cases, there’s no harm in the author not having all the answers, if she’s able to pose tantalizing questions. The trouble with inhuman aliens and other fantastic creatures While logical consistency alone allows magic to become realistic, as a technology that’s simply not fully understood or which obeys different laws of physics in a different universe, creation of beings has to go beyond logic alone. Firstly in a sense that real beings have all kinds of irrationality to them, which definitely includes human audiences, but there are also scientific concerns that a realistic author should consider. Tolkien perfectly represents one of the sciences that apply very directly to race and character creation — linguistics. The creation of whole languages may seem like an overkill, but only if one looks at the languages as something that has nothing to do with the story or character. In Tolkien’s case, he initially wanted to just create some artificial languages, but he realized that they cannot be genuine in any way if they are formed without a particular history, culture, and storytelling tradition in mind. In other words, he came to realize that languages are not separable from the nature of the beings that speak them. By creating languages, you are inevitably creating intelligent beings and cultures that use them, and vice versa. I’d say it’s not an accident that his races became the fantasy default, when they make so much sense and are so distinct and defined, including their styles of thought and speech. To me, few things are more immersion breaking than obviously made up fantasy words without any rhyme or reason (I’m looking at you, D&D). The next two major relevant sciences, sadly quite underused at the moment, are evolutionary biology and psychology. To put it simply, the continuous interaction between your creatures and their living environment should be taken into account. In principle, it’s not complicated — only things that can survive in an environment can live there, which means they should be adapted to it physically and mentally. Even though this wasn’t Tolkien’s primary concern, his races still make a lot of sense from this point of view — an underground race should not be one of tall people, harsher environment should produce harsher creatures, the tiniest race is the best at sneaking, etc. There can of course be all kinds of magic or genetic engineering that interfere with the basic evolutionary idea in the story, but as long as they’re used logically and consistently in the story, they present an opportunity to explore some important themes, like the opposition of the natural and the artificial, or nature and god. You can also flip the evolutionary mechanics around and start from a creature for which you then reverse-engineer a habitat where it would fit. Of special concern should be the basic questions of how the creature gets food, whether it’s prey or predator, what is its lifespan, and how it reproduces, which should play significantly into its culture and normal range of personalities. If you introduce magic into the environment, it changes surprisingly little. If the magic is logical and therefore realistic, you just have to think about how the creatures would use magic to fulfill their basic needs and how they would avoid being killed by it. If magic is a kind of energy, some creatures should be able to use magic as a form of sustenance, defense, or weapon. Magic as energy can also have mutagenic properties, justifying some increased rate of mutation, similar to real world radiation (but perhaps less destructive). Does magic affect lifespan? Can magic play into reproduction, in the way a love potion or a miraculous conception would? If you think the magic through, you only need to have your creatures adapt to it as they would to anything else in their environment. Especially if they’re intelligent tool users. Finally, the last two major sciences that make sense to consider while worldbuilding for the purposes of storytelling are anthropology and sociology. They of course involve both linguistics and evolutionary psychology, but they go beyond them in their own way. There are some attributes of human cultures that cannot really be explained by language or biology directly, and anthropology and sociology are there to map and test all these unique ideas and customs. With the help of archaeology, one can even learn something about cultures that are long extinct. You can use this knowledge to make your aliens or magical creatures realistic as humans in disguise, still exploring the human heart in conflict with itself. Which can be great. On the other hand, you can also attempt an alien version of anthropology, a xenology if you will, where you start from a different biology and perhaps a fundamentally different idea of language and then try to extrapolate the differences that would produce. Understanding fine details of real human cultures, especially the weirder ones, should serve as a decent background for such guessing about the different routes evolution of culture or society could have taken. The ideal goal is coming up with a culture or society that doesn’t have (and perhaps cannot have) a human equivalent, but is consistent. After all, it’s entirely biologically possible (though not necessary) that other intelligent forms of life will have a fundamentally different type of reproduction (eating the mate after sex, different number of genders, having huge numbers of offspring of which few survive, etc.), different attitude toward death (imagine a race of intelligent butterflies, or those immortal jellyfish that periodically de-age), or a very different preferred habitat. Even basic things like physically not being a bilateral vertebrate can have dramatic psychological implications. Since we don’t actually know for sure what other species exist out there, if any, and what culture they might have, instead of egocentrically assuming that other aliens must be like us, or nihilistically assuming they must be horrors beyond our comprehension, we can use their speculative creation as an opportunity to explore the place of humanity in the grand scheme of all possible intelligence. Not just in the sense of brain’s capacity for memory or computation, but in the sense of the limits of human heart, and whether we could evolve into some other kind of being in the future, for good or ill. Hello, I’m Martin Rezny.Did you like this piece? Wanna read more of my stuff? Here’s something more recent.powered.by.rabbut.com If you enjoy my writing, sponsor me via PayPal, and don’t forget to subscribe to my publication, recommend, and follow! ", "child": "", "name": "692_12", "parent": "692", "title": ""}