{"content": "Gente, só eu sei o quanto tava precisando desse texto. Eu detestei esse episódio, mas antes de qualquer coisa, queria dizer que amei sua leitura. Achei incrível essa distinção entre romances de informação e os de clima, e todo trajeto do seu texto me fez lembrar porque eu simplesmente amo Girls. A série conversou intimamente comigo, soltando verdades duras sobre as quais ninguém queria falar sobre. Recebo muitos olhares tortos quanto digo que absolutamente amo a série, mas seu texto explica lindamente porque eu me acabei de chorar quando vi a Hannah sozinha no sofá do depósito dela. Se trata da solidão nua crua, algo que só se constrói com tamanho alcance a partir dessa ideia de clima. Uma narrativa, pra além dos atos, tem os sentimentos como chamada principal. Agora, SPOILERS!! Eu entendi o reconforto no retorno do Adam, mas me incomodou absurdamente que isso quebra com todas as merdas que eles engoliram um do outro, em especial as merdas que Hannah foi obrigada a aceitar — a Jessa e o filme, por exemplo. Acho que quebrou muito com tudo que ela desenvolveu após o relacionamento deles e isso me desapontou demais. Além disso, por mais que compreenda a questão do comforto, achei uma ousadia ele acordar um dia e querer fazer parte da vida do bebê dela. Ele não pode invadir esse espaço que ela cuida e mantém com muita dificuldade, ainda mais levando em conta que ele sumiu em diversos momentos muito importantes. Minha mãe me teve com 21 e eu, com 22, penso diversas vezes que não estaria pronto pra passar por tudo que ela enfrentou. Por isso, esse plot twist da Hannah tava sendo muito especial pra mim, e eu tava adorando observar o desenvolvimento dela como personagem nesse sentido. Como você bem colocou, o Adam foi um porto seguro, aparecendo pra ela num momento impossivelmente fragilizado. Compreendo o envolvimento dela, mas não deixo de pensar no quão abrupto e invasivo ele foi. Quero ele no paredão. ", "child": "", "name": "713_6", "parent": "713", "title": ""}