{"content": " Algorithms matter. False news is a symptom. Real news, Jefferson’s bulwark against demagoguery, is on life-support. Newspapers have been disappearing for 60 years, but consolidation kept journalism treading water. The web undermined this. Since 2005, newsroom staff have dwindled by 40%, so that today there are 54,000 correspondents, reporters, editors, and news staffers. That’s compared to 550,000 PR and marketing types. The fourth estate used to be considered as vital as a branch of government. If that’s true, the current situation is like having half the courts disappear. Techies don’t like to hear Jefferson’s take on government vs. newspapers, because the press suffers creative destruction, a “natural” process. Many of the same Silicone Valley people don’t want to hear that Google’s algorithm has weaknesses, retained because of its monopoly. On U.S. college campuses it’s common to hear students complain that Google results produce poor quality hits, a red flag. Google’s monopoly is two-fold. Part is an old-fashioned fixed cost barrier; massive server farm infrastructures bar start-up competition. Part is its algorithm, which attempts to remain transparent. Google never wants to look like it’s thumb is on the scales, which lets too much bad stuff get in. Google search imitates life, in that the algorithm promotes sites that have lots of incoming links. In our extroverted culture, people who rise in corporations and politics also have lots of links. Networks and net worth parallel. Google points to its founding metaphor, article citations, to show how value and links join. But scholar articles have quality control — peer review. There’s little quality control in link-based algorithms. Models of disease transmission make a better metaphor.` A false news monsoon, a real news drought, search and news feed algorithms built around popularity, not quality … it’s enough to make one depressed. But the internet, especially search engines, play a key role in all of this. And the internet is barely out of infancy. Google’s monopoly, for example, is contingent on technology that will radically change, and on assumptions that are far from perfect. Search algorithms should change. Here’s a small taste of how. In all manner of things, for all walks of life, there are organizations that group people. Trout fishermen have Trout Unlimited, an association with a web site. Experimental plane flyers have their own group and website. So do people who identify with the Democrat or Republican parties. These all group people with certain common beliefs and interests, and their websites discuss political issues. People who value guns a lot pay attention to the NRA’s site. Most of us want to belong with others in something significant, and some of us find it in institutional frameworks like these. Institutions that people belong to have some common attributes. Not opinions or issues, but features like members and membership. They usually have headquarters, often substantial or valuable property, and dedicated headquarters staff, with advanced degrees. Their sites express codes, of ethics, standards, behavior. In the U.S. they’re mostly non-profit, which means they’ve been defined in the NAICS database. Such institutions display these attributes on their websites. FAQ pages can be very revealing. The details can be cross-checked, in the NAICS, on LinkedIn and Facebook groups. Their headquarter footprints appear on maps; the influence of their codes can be assessed by the quantity of other sites that include them word for word. Suppose someone only wants to obtain content that’s got their perspective, as a Democrat or Republican. They could go to the DNC or RNC websites, where news and issues are slanted and explained in the way their group likes. A search engine or news feed algorithm could be tweaked to filter for sites with institutional attributes. The Democrat who searches for “Clinton emails” gets results that include both Democrat and Republican party national sites, and other political institutions (think tanks, large unions and churches, and larger associations.) This doesn’t promote one correct truth; there may still be false facts; but institutional attributes correlate with more reliable sources. The user can choose the opinions they like. Graphs of internet connectivity show central nodes of great influence, then hubs at lower tiers. Those core emitters number in the low hundreds. That’s a small enough number to permit human vetting, even in open committees with formal procedures. RT, the Russian news agency that specializes in “faux news,” would have a hard time passing a legitimacy review. Without approved status, their links could be down-graded. Internet users would not have to filter results for institutional reliability; if they want, users could turn down that feature. They could even request the opposite, results that do not include any institutional sites. Those who choose to do so might believe in grand conspiracies; they don’t believe in real news. Though their numbers might be large, as a percent of users they’re very likely small. Most people want results that are reliable, although they want their opinions confirmed. The internet, if search engines are built appropriately, can provide results that contain genuine facts. These facts can be interpreted differently by each group, rather than each group having its own facts. In Jefferson’s day, newspapers didn’t have the high status of the NY Times. Most were highly opinionated. They may have played loose with facts, but their readers expected accuracy. It was a cacophony of views, not facts. The argument that resulted in the 3/5 compromise was over taxes and representation, not different census estimates. Numbers, key to political facts, weren’t organized into statistics until the 1820s and 1830s. They provided such a robust and bracing view, the idea of faking them seems not widely considered. Now that major issues are numerical, such as the quantity of immigrants, debt, private emails, or bankruptcies, numbers are meaningless without definition. It takes time to define, and the devil’s in the details. Republicans and Democrats may differ about trusted sources, but not so much about their attributes. They’re staffed by competent people, who don’t filter things because of bias, who present facts and figures that matter. Republicans believe that many mainstream news organizations do filter things, presenting too many victims of some kinds, too few of others. But instead of fake news filling the void, they can turn to the Wall St. Journal, Ashbrook Center for Public Affairs, the Tax Foundation, and others. Many of these are robust institutions, precisely the kind easily detected by an algorithm. For example, the Capital Research Center is a conservative institution with a poor reliability record, while the Hudson Institute is also conservative but known for higher quality. CRC is 32 years old; it’s HQ is a 3-story residential D.C. brownstone with 12 staffers. A search spider would find only one PhD. Hudson has floors in a D.C. skyscraper, close to the White House. Founded 55 years ago, it has 70+ staffers; a partial review of a dozen finds 5 PhDs. These and other attributes define institutional authority. Therefore a search oriented to institutional robustness would return Hudson’s pages and feeds before CRC’s, even to a conservative. The discussion above is, in fact, me spilling the beans about a patent I’ve filed, for a search engine that lets users preferentially filter for results along different dimensions. One is formal institutionalism, or not. There are several others. Although they don’t require vast analytical tools, it’s an “aspirational” patent. No small firm can begin to compete with a Google, because of aforementioned fixed costs. Although a Google, Bing, or even Yahoo could innovate, as oligopolists they have little motivation. Change isn’t really good for a monopolist. Anyway, algorithms do matter. ", "child": "", "name": "737_25", "parent": "737", "title": ""}