{"content": "Great article. I have many agreements and couple of fundamentally different ideas. But you lay out your case nicely and provide much good background for the issues. Here’s my response: Properly understood, by execs and boards of directors and even small entrepreneurs, the driving force of entrepreneurism is return on invested capital. This is different from mere profit. Especially in today’s age of government favor, failure of legislation and enforcement, influence (a polite term for bribery), total unreality in interest rates and senior level of corporations colluding in reporting fake profits for bonuses and perks. The major source of moral hazard, I propose, is that the political system is not looking after basic morality. They create the conditions which have it make sense to take risks and have others bear the cost. Entrepreneurism is the exact opposite. Entrepreneurs take the risks and get the rewards or reap the penalties of failure. Still happens. But not at the level of large corporations and conglomerates. Were the execs and businesses acting “rationally”? Certainly on some scale they were. Just shows how slippery the term rational is. Early uses of the term entrepreneurship used something like, “to coordinate productive elements to produce more value for resources used that others in the marketplace.” I can work with this. Because, with free market prices as the measure of using resources better I can trust what happens if the rules of the game are as they should be. Like morally or, better, constitutionally. You quote Baumol, “persons are ingenious and creative in finding ways that add to their own wealth, power and prestige”. Within a market place bounded by moral law, this is what I’d expect. Remember, I use return on invested capital, not just profit or income as my standard. What are you going to do with you capital? I am not an apologist for entrepreneurs. And I’m pretty much resigned and disappointed about government involvement in all this. I do like the “bad entrepreneurship” phrase. My economics teacher in high school (50+ years ago) referred to this as “the production of ilth” as opposed to the production of wealth. Not bad for a beginning education in economics as a teenager! A very subjective assessment standard — but a wonderful introduction to value economics. The rules of the game should be set produce growth of the whole, but not favor any particular entrepreneur or participant in the market place. But now we’re deep into the mess. The rules of the game are horribly slanted in favor of some over others. But it’s much worse than that. The rules and enforcers can be bought. Many corruption indexes of countries count bribery highly. But somehow, all the stuff that goes on in America and other “democracies” and “free” countries doesn’t register on the bribery scales. Maybe the result of bribery? A major area of concentration of wealth, of the ability to buy shares without needing to add value to what was bought, and to fake profits is that our money has no integrity left. I won’t go into why, at least here, but I’ll give you a tip off that it’s so. It is nothing creative use of language to has “negative interest rates”. They haven’t existed in the history of the world. I’m not talking about negative real rates which are those which are lower than the rate of inflation. I’m talking absolute rates. Notice that these negative rates don’t apply to you and I. The rates that I see are near the highest they’ve been. I’ve saved the best for last as, fortunately, Mr. Allworth did as well. I think his introduction of “democratic ideals” points at the key place. But not in the way that he seems to be presenting it. He says that the heart of the problem is prioritize democracy. This needs to be delved into more deeply than I can do here, but I’ll try to make a different case with enough traction to provide an interest in pursuing it further. The problem can be said to be the prioritization of democracy. The smaller the social organization, the more applicable is democracy. The larger the social organization, the worse democracy gets. The more complex things are they worse democracy gets. The main problem in this article, I think, is that democracy is implied to equate with “the people”. Pure democracy has been characterized as the situation where two wolves and one sheep vote on what to have for dinner. My ideal for social systems, which I’m pretty sure are similar to Mr. Allworth and most Americans, is a system that provides the greatest long term benefits to the greatest number of people. People that is there is opportunity for all and the great majority of people benefit over time. Not equally as that isn’t in nature, but to a significant degree for the vast majority. How shall this occur? Through a constitution and/or laws that are designed to protect the whole from violation of their rights the thought, speaking and actions that do not harm others. The best part of this article was the picture worth a thousand words of the United Airlines fiasco. Actually the most telling part of corporate America was the response of the CEO of UA. Who start with “who?Us?”, to a pathetic “I’m sorry” to increasingly greater responsible statement because the previous on. This was the kind of apology a violent criminal makes at sentencing time. You know. “I’m so sorry.” Of course they’re sorry (and the CEO UA the same). They are sorry that they were caught and that they’re going to pay. If that CEO isn’t fired, we know absolutely that it reflects the corporate culture. Real profit, measured by return on invested capital, is incredibly important to any company. But the interests of the company and the interests of the executives and financiers are miles apart. Many will have their millions in bonuses collected and manage to leave the company before facing the music. ", "child": "", "name": "783_15", "parent": "783", "title": ""}