{"content": "Gracias por el artículo, me gustó muchísimo, realmente lo he disfrutado. Es fácil de leer, claro conciso y contundente. Espero que escribas más cosas como estas en el futuro. Creo que pones el dedo en la llaga de una realidad en el mundo de la publicidad en Latinoamérica, y también creo que está plagado de supuestos generalizados; es decir: que sólo se podría aplicar a algunas agencias muy grandes en Latam, no la mayoría y no creo que a todas, sobre todo las que tienen ADN digital, que su CEO, CTO (tienen un CTO), Director creativo es ingeniero, programador, diseñador digital, etc. Es decir, que sabe de lo que habla, que viene de abajo. Me gustó el tono directo, hiriente, sarcástico y puntilloso del artículo, creo que está muy bien escrito y haciendo honor a ese tono te puedo decir que el mensaje ulterior es bastante pretensioso. Constantemente sigo hablando con gente de la industria de la publicidad (A la cual, desde hace más de un año ya no pertenezco) y todos me dicen algo similar. Es curioso, cuando mencionas que en las agencias de la pasan hablando mal de sus competidores y colegas y luego termino de leer el artículo y pienso, suena a lo mismo, a lo mismo que me dicen los que están o van saliendo del medio, que ellos lo harán mejor, que ellos si se preocupan por el cliente, que ellos sí se preocupan por la calidad, que ellos sí saben de UX, tecnología, desarrollo, analíticas; que ellos sí son creativos. Al final me pareció lo mismo, un publicista que le tira mierda a otros publicistas desde la postura de un esclavo se su propio ego y su propio orgullo. He visto nacer y morir a muchos que dicen que harán las cosas diferentes, lo peor es que he visto a muchos terminar haciéndolas iguales; Yo terminé haciendo esas cosas y terminé abriendo “mi agencia” y terminé cerrándola y terminé regresando a nuevas agencias que prometían hacer las cosas diferentes para terminar haciendo las mismas de siempre. Al final determiné que lo mejor es salir de la publicidad… Hoy extraño el show, extraño tener un cliente, hoy mis clientes son el usuario final, el que compra, el que no sabe de marketing ni ux ni tecnología, la gente común; y desde esta postura me atrevo a decirte una frase que alguna vez me dijeron y me ofendió mucho pero hoy la creo verdad: 9 de cada 10 cree ser 1 de cada 100. ", "child": "", "name": "790_1", "parent": "790", "title": ""}