{"content": "So, the thing is, in tech, the odds are currently pretty stacked against women, and even moreso against women of color. We learn this at a fairly young age, and it’s reinforced throughout our lives through a number of different avenues (like this one, and these ones). We have to be better than our male counterparts in order to be considered/perceived even close to equal to them, and we frequently don’t get the same kind of encouragement to pursue “male” subjects (the response that uses a golf analogy is pretty spot-on). Then, you get the girl who’s not only good at programming, but finds it comes pretty easy to her. Her challenge comes from pushing the boundaries of what’s taught in the core of the class. Since there’s that ingrained “STEM is hard for girls,” she then thinks that because it’s easy for her, it must be easy for everyone, which is then reinforced by the fact that the guys were building robots (an arguably more nerdy and “geeky cool” thing than HTML/CSS) when she was tinkering with HTML, which also has historically had the stigma of “not real programming,” since it’s a declarative language. While, individually, most of these things should be easy to brush off, in aggregate, they add up and erode a girl’s confidence in their ability and their potential, and they’re often left to their own devices to muscle through it. Some of us love the craft so much that we simply don’t care what other people think (though the spectre of imposter syndrome is still there, and I’m not sure the fear of not being good enough to keep one’s job ever really goes away, but it’s definitely more easily pushed aside for some of us than others) — this is what we live for. We’d be pretty lost if we couldn’t, and we can’t fathom doing anything else (unless, or sometimes even if, civilization collapsed entirely). However, we don’t all have that luxury, and the imposter syndrome overwhelms us, because there is no countering force to tell us “that imposter syndrome is bullshit, you’re an awesome coder, keep going!” ", "child": "", "name": "850_14", "parent": "850", "title": ""}