{"content": "you explain this concept and what it can do very clearly as others have commented. This is a great concept for companies gathering information on potential employees, developing person specific or “unique group” specific marketing plans for customers, checking out suppliers, subcontractors and a whole gamut of information gathering that once was very time intensive and likely a less accurate process. Resumes read or people interviewed when a reviewer was rested and alert tended to skew the data in favor of those. So, I see a great potential for this. Being a thinker, a big red flag was that immediately came to mind was the ethical use of this technology and the invasion of personal privacy that it could so easily be used for. Many people I know do not comprehend how much data is gathered through social media. They believe their lives are “more private”now (especially people in my age group)then when they grew up in a small community where almost everyone knew them. They believe the privacy of accessing information and their social circles are very private on the internet. They do not comprehend that not only what they write, but also their photos, voice and video clips are sources of information that are methodically gathered. Face and voice recognition, along with endless lists of information on the items they purchased, websites they visited, movies and TV shows they watched along with their social and family connections are part of the information database that defines them and displays the add for the blue underwear they like on Tuesday evenings at 8 PM when they are watching YouTube. All that information is readily available to anyone (may require a$8 payment) but has no restrictions. The ethical question started when I mentioned that most people are unaware (yes, they could have, but they did not read the lengthy agreements and disclosures that are included with every piece of software and every social media site, they just signed them) that, somewhere along the way, they signed their life away in service to Bill Gates!! Yes, I am exaggerating, but not by much. I personally do not give away accurate personal information on the internet. I do not get ads on my computer and every piece of tracking software I could find is deleted or blocked. Yet, I can go to a data site and find information on myself than I did not even know existed. I am aware of information being collected and block what I can. I am not a computer Guru, but I use technology as a tool to accomplish tasks, to communicate with others, to gather information I need. I have avoided the ethical question, but it should be obvious by now. With the ever increasing complexity of computers, information technology, data mining and Neural network technology, there is a huge threat to not only my privacy, but the security of any electronic information IE: bank accounts, work history, personal integrity that can be gathered from the internet and interpreted by neural networks. Most of that information at some level can be manipulated, even if it is “depersonalized information” and easily linked back to me, since it was gathered that way in the first place. Depersonalized information can be accessed easily and has very little security on it. Someone with only minimal digital data experience has the ability to change an depersonalized “no” in a database dealing with felony convictions to a “yes” and potentially destroy someones career, ability to get a loan, or other. So, Is there a “specific ethical question or consideration” that applies to the use of this technology. The validity of each of the hundreds of data sources being processed through a neural network is part of the ethical question. As a final note: I make a farce of social media and any site I interact with. Will having graduated college 10 years before I was born put up a red flag, having 16 different birth dates, being female or male, having over 100 addresses, numerous different first and last names, from single to married with 10 children and hundreds of other other fictitious data entries be processed in a neural network? ", "child": "", "name": "859_19", "parent": "859", "title": ""}