{"content": "Dear Rachel, Ahoy from another good bipolar sailing on the same boat with you. Just as you, myself, I am also trying to learn as much as I can about bipolar disorder and how its affects my behaviors as well as my body and soul. I absolutely agree that our lives require meticulous “high maintenance” at all times despite the unpredictable tides of the disorder that continuously swing by our existences. I know very well that the journey is exhausting and excruciating quite often. But it can be enriching and empowering as well, despite all that feeling of nonsense along this troublesome path.  Since my last (very harsh) period of mania (just 7 years ago now), I started to learn and research about my bipolar condition. Just as yourself. And I still keep doing it. These last 7 years of my life have not been full of candies and rainbows for sure. There have been many times I cried myself to sleep, wished I had a “delete” button on me, felt totally dysfunctional, extremely lonely, cruelly helpless, hopelessly clueless and even cursed. However, I always sticked to my treatment, watched my moods and tried hard to never let myself down (a promise I have given myself after the last “manic horror movie” I starred in). Even though at this point in my life I do not have any remarkably promising aspects to it, I fight hard to find meanings and stick to them. I still believe that no creature was put on this earth without a reason. And that’s why I choose to stay here. So should you. Keep exploring and loving yourself, breathe deeply when feeling lost, get enough sunshine, cry hard if you feel like, keep writing, try to be truly kind to yourself… And, last but not least, watch closely your physical health as the medications have significant impacts on it. All of these above seemed to be efficient in helping me so far while I was trying to cope with my own demons. You are a “bipolarly beautiful” mind, in a beautiful world that itself has “two poles”. That is why you belong “here” and to your loved ones. Cheers shipmate. ", "child": "", "name": "876_1", "parent": "876", "title": ""}