{"content": "I shouted several “YES’s” reading your response. It’s quite amazing how much personal strength you can find inside yourself after connecting with others over a shared experience and the illumination others can bring to your own situation. What you wrote in your response relates exactly to something I’m going through right now and in fact, you provided me with answers and insights to most of the questions that kept me awake all of last night. I think when you’re an empath and a feeler and in my case, always on the self-improvement path, always reaching for more, there’s a tendency to put yourself into other people’s hands. I don’t mean handing over your power, but I do mean perhaps sometimes allowing others to worm into your thoughts and make you question your authenticity. At least, that has been the case for me. You have given me lots to think about — my shadow side is still a part of me. And I think to deny threatens to limit my ability to keep learning about my whole Self. This piece in particular relates to a choice I made to be physically intimate with someone at a time when I was reeling from a deeply painful loss. The person I became vulnerable in front of was someone I see eight hours a day, five out of seven days a week. It’s someone I’ve known for years and someone I confided in about my loss and pain. This person watched me struggling and I would hope, recognized that I wasn’t acting like myself. And yet, this person moved right in to the physical pursuit, and when that left me feeling so much worse about myself and so much emptier, and lonelier, this person, it seems, has become hateful. Nothing has been said about the situation or the after math, and it’s so hard to explain, but it’s a feeling. It’s as if now, I walk around with a scarlet letter, it’s as if I used this other person. And that, the idea that I would purposefully ever dishonestly use another person, is so far removed from the person I am. Thank you for shining a new light in the cobwebby corners of my heart and mind. ", "child": "", "name": "889_10", "parent": "889", "title": ""}