{"content": "I haven’t been able to read every single word Allison Washington has written, or even close to as large of a percentage as I would LOVE to be able to. Meaning that honestly, I’ve read only about half a dozen of her writings, but I instantly fell in love with her. Her writing, honesty, openness, vulnerability, sincerity, emotional maturity, sincere desire for benevolence, and essentially her purity of character. Whenever I come across somebody who shines and resonates such warmth and goodness yet at the same time shows a strength merely for being able to speak and hold out their hands for others to help them in their own journey, I want to reach out my own arms. I want to wrap my arms around them in a huge bear hug to show many of the things which are overflowing inside my own heart. I want the hug to offer a sincere expression of just how incredible and amazing I can see that they are. I want it to show that I stand behind and beside them in complete support of them as a person. I want it to give comfort and offer an expression of genuine caring and concern for their emotional wellbeing. Furthermore, I want the act of my arms wrapping around somebody to say, “Thank you!”. Thank you for being such a wonderful person. Thank you for standing strong in a world which is full of adversity and for being a role model for others especially when we need all of the examples we can get. Thank you for continuing to show everyone that there are people who care, and that there are people who will continue to live and behave virtuously. Being around these people is infectious; the more of them there are and the more they are noticed, the more their qualities will spread infectiously and help make the world a better place for all. I had a point when I first decided that I wanted to respond to Allison Washington. But it flew out the window faster than a hummingbird beats its wings as soon as I began typing. I know was thinking about her comment regaring “not normal”. When I was a child I used to have a button which I wore on my backpack that said, “Weird is Normal”. My interpretation of the button was that there is no such thing as “normal” effectively. We are all different from one another in some way. Anyone who proclaims to be normal would have to be able to define what constitutes normal. As I indicated above, I haven’t had the pleasure of being able to read nearly enough of Allison’s stories, so I haven’t yet read her piece in which she referenced normalcy. However, I have faith that I would be in complete agreement with every statement and sentiment. So I hope that it can be understood that while I proclaim that I prefer to be “weird” and therefore “not normal”, I also don’t mean to denounce normalcy provided that the condition is recognized to include everyone in totality. ", "child": "", "name": "897_4", "parent": "897", "title": ""}