{"content": "Lets look at these arguments, which honestly all are fairly weak when you actually break them down. argument 1, Harden is on a team that won more so he should win. If this is the main argument, than we should only be considering players on the best teams, and Kawhi makes a far stronger argument than Harden. But your catch is that Harden led a team that wasn't supposed to be this good, with a weak supporting cast. While Vegas put the line for this years Rockets at 41, that was largely because of disastrous 2015–2016 season which saw the Rockets plummet from a high 50 win team the year prior, to a 41–41 team. The low Vegas estimate was seen in the fact Harden and the Rockets significantly underachieved the year before. This underachievement is why them actually playing up to their past potential is deemed as remarkable. Further, while Harden may not have all-star teammates on this team, this team was created to build off of harden’s strengths and to run an extremely efficient offense. The offensive efficiency that Harden boasts, in largely the product of the system, than it is of Harden’s fantastic play. One can realize this when you look at his on/off numbers.Argument 2 the award is not an individual award: This is absurd, given that it is given to an individual. The championship is not an individual award, but nearly every single award given to an individual, is in fact an individaul award. What matters within this individual award may be team success, but that does not take away from the fact that it is an individual award.Argument 3: Hardens numbers aren't that different from Westbrooks: This is simply not true. While looking at per game statistics Harden is fairly close in a lot of the categories, but when you use per-36 minute numbers, Westbrook improves compared to Harden, given that Harden plays 36minutes per game compared to Westbrooks 34. Using per-36 min. numbers. Westbrook averages 32.9pts to Hardens 28.8pts, 10.8 assists, to Harden’s 11.1, 11.1 rebounds to Hardens 8.1. While steals, blocks, and turnovers are relatively the same (though Westbrook, is better by .1 in all of them). So using these numbers Westbrook averages 4 more points per game, 3 more rebounds, while averaging .3 less assists. That is not a small difference.Argument 4: Harden’s numbers lead to team success: Yes, Harden’s team has more wins. Yes, Harden has more win shares than Westbrook. However, Harden’s on/off splits are significantly worse than that of Westbrook. On/off splits measure how well a team does with the player on the court and off the court. The higher the + the higher the value of the player. Harden currently has a +3, which isn't bad, at least compared to Kawhi Leonard, but Westbrook has a +12, while Lebron has a +16. These are HUGE differences and show that Westbrook and Lebron add significantly more to their teams success when they play than both Harden and Leonard. This is partly due to the fact that Harden and Leonard and their team’s success is based on superior systems. Further, while the author brings up Win Shares, he forgets to mentions WINS (ESPN stat) and VORP, in these statistical categories Westbrook and Lebron beat out Harden.Argument: Listing of arbitrary/random stats by Daryl Morey: Any of the MVP candidates can throw out random stats to prove their greatness. Westbrook throws out the triple double argument, which while highly impressive historically is somehow undermined by other newly created arbitrary stats like the 2,400 pt and 900 assist club. For example has anyone been part of the 2500pt, 840 assist, and 850 rebound club? Probably not. Honestly, the argument for Harden is one of the weakest compared to Westbrook, Lebron, and even Leonard. Leonard has wins, and is obviously a much better two way player than Westbrook and Harden, even if his stats dont necessarily show it this year. LeBron is actually the far more efficient player, while showing his value through on/off splits. Westbrook on the other hand has on/off numbers and traditional stats, not to mention many other advanced stats. Though he is a less efficient scorer than Harden, he is more efficient in other parts of his game (assist rate, turnover rate, rebounding rate). ", "child": "", "name": "90_3", "parent": "90", "title": ""}