{"content": "There are many experiences that one has, which can only be identified as a journey into some universe where the willing suspension of disbelief creates the foundations of that experience. The title of this article was interesting, as it hit the nail on the head of the problems with the Western Civilization and the corresponding results. Yes, those of the Political environment of Western Nations in rejecting the reason, the knowledge, and logic of the Western Canon established over a time span longer than the literacy of mankind. The words shared the total idolatry of irrational incomprehensible social construct of total despotism, currently advanced. ‘The answers are very simple, aren’t they? Copy what successful societies have done. GIVE people public healthcare, education, transport, finance.’ The communist claptrap of the idolatry of Marx, accepted by so many, still requires a willing suspension of disbelief, as one is accepting not some ideology — for the idolatry of Marx is not some visionary theory — that is evil magnified beyond reasoning of society. That magic word, GIVE, if any concept, that is more bizarre than the concept that ‘government’ which produces or makes nothing, creating nothing, has some magic power to give from this nothing to others is ridiculous. How can that which requires the effort to others, such as healthcare, be given by government? How can that which requires effort such as education, which requires the effort of others, be given by government? How can that which requires the effort of others, such as the transportation industry, the vehicles, the roads, the fuel, the effort of so many, be given by government? As for fiancé, the government is already giving to the society of America as much as they can. The government is debauching the currency, destroying the wealth, indebting future generations to astute poverty by destroying out monetary foundations, oh yes, government is already doing all there is to destroy this nation’s economy, our society, and our wealth. The idolatry of this author implies that in America is ‘overthinking it!’ Could there be anything farther from the truth? The problem of the society of today is we not only do not overthink, we do not think — or apply reason — to what we as this nation, have establish as political, or socially, direction. If there is one word that describes the absolute irrational and incomprehensible path of this nation’s journey, it would be ‘REASON!’ We, as a society, do not apply, or even consider reason as the direction of what we accept, or reject. The perfect example is this statement; social science, social problems, social understanding, are not used in the analysis of our thinking of what our actions of government do. Really, let’s see, this nation was founded on a social construct, of Protestant Christianity. Outside of government, and protected by the legislation of our laws, by our government, to stay out of the genre of religion, preventing a theocracy. In that social construct lies all of the social concepts that are exclusive of the government, where society must in that society deal with those concepts and outside the realm of centralized planning, and totalitarian sovereignty of government, dealt with. Reason is simple, knowledge through the lens of logic. America lacks the knowledge of knowing America. This is not speculation. This is fact. How many do you know who can tell you the why this nation began, why it exists, and then identify the errors created by not knowing who we are, why we are, and the idealism of what made this nation the wonder it once was. Yes this nation has problems. Every problem this nation has faced and experienced is always the problem that our government veers from out design, and applies some other concepts. The example, this nation applied sharia law because of a man declaring himself the follow of mohammad’s idolatry, that led to a social construct that was wrong then, and is still destroying our nation. What was it, slavery. Slavery in the colonial laws, as in English law, was illegal. Yet by applying the sharia law of mohammd’s idolatry, this nation through civil rights of government, authorized slavery. One would think that would be enough of an example to reject this idea that not preserving the wonder of our great experiment, this nation’s design. If we overthink in this nation, then its proof positive this nation has lost the ability to think. ", "child": "", "name": "913_17", "parent": "913", "title": ""}