{"content": "I enjoyed this article b/c it reminded me of some keys in sports training that I learned a long time ago, which I’ve held onto in my professional career as it’s offered me some interesting insights in the workplace as well: intent → decision → execution. For example, when I work with my son on soccer, I always make sure he understands where my coaching is being aimed. And I can assure you that I focus far more time helping him learn and embrace patterns of successful intent, so he can improve the quality and speed of the decisions he makes on the field. I believe that will be far more valuable to him in the long run than focusing on any incremental improvements we can find in his execution. Having been in several start-ups that have had exits, I can’t agree with you more on the criticality “intent”, whose ownership is shared at all levels. Unlike larger companies, where intent is typically owned and disseminated by upper execs via mission statements, core values, lessons learned, etc. — intent is more broadly owned in successful start-ups. And that’s a great thing! As you work your way down the stovepipe of a large organization, the next order of ownership is typically held by leadership on the “decisions” people make in their roles, whereby a lot of IC-level folks are content to focus on execution by specializing in specific skills/tasks. Sadly, organizational hierarchy tends to reinforce this effect once some B-players sneak in and ply their territorial / defensive approaches re: the decisions they own, in an effort to relegate everyone else to execution-only mode. Outside of the above behaviors, they also make sure their process is opaque enough that they can use the reporting they own to use data in ways to justify their decisions / behaviors, etc. (and fool more senior leadership). I mention this b/c I’ve found that this to be the biggest reason there are disconnects with upper leadership’s intent and why others in the org either stay execution-focused (b/c it’s safe/easy) and those who get frustrated and leave (b/c they refused to turn their back on intent and got stuck too many time on the decisions of those they disagreed with at an intent level). When I’m a Dad, I focus my efforts directly on intent and decisions with my son. But in my role as a recruiter, that’s not something I can as easily accomplish. So, I tend to focus on the behaviors of those I interact with in the workplace as I’ve found that to be a more pragmatic and portable function for me. If I’m working in a smaller company, once I’m aligned with the intent of the organization, I can then help shape the behaviors of the people around me. And I can usually do it rather directly, as I roll up to the senior-most leadership in the organization and have a strong voice in what it takes to build successful teams — and I own a lot of the core decisions in recruiting. If I’m in a larger company, however, I try to align myself with the highest levels of leadership I can get consistent access to, so I can keep close to the core intent of the organization. Even though I’m not going to own as many big decisions in my role, I still won’t drive my behaviors toward execution alone. I still focus on intent and decisions over execution and I do my best to help shape the behaviors of the people I work with toward this line of thinking as well. And if I see B-player behaviors in the org (i.e., those would would purposely kill off intent-based work in others)? I document it and bring executive attention to it immediately. Just because a company is big doesn’t mean it should forget the core principals of what makes a great start-up. Again, great article and thank you for taking the time to share some of your wisdom with us =) ", "child": "", "name": "915_18", "parent": "915", "title": ""}