{"content": "Great article Andrew. I’m with you 100% about the value of shoshin, which I understand from my personal experience of martial arts practice as well as starting new jobs as an executive. I started my martial arts journey some 30 years ago (OMG). My master of four years now is Shi Yan Min, a 34th generation Shaolin Warrior Monk from China’s Shaolin Temple. As you know, Shaolin is founded on Chan (Zen in Japanese) Buddhism beliefs. As an instructor at the UK Shaolin Temple in Sanshou – which is Chinese boxing, one of many disciplines within the Shaolin system – I recently had a coffee with Shifu – which means teacher, or master - to deepen my understanding of the mastery process. Shifu opened the enquiry with a statement about the nature of the mastery journey: “Your master can give you 15% of the art, but the rest is up to you” As we drank our coffees, whilst discussing the process of discovery, my mind flashed back to an experience that I had had a few weeks earlier. Shifu had taught a group of us a new form in an advanced class. As he was demonstrating a subtle detail of a transition between two techniques and stances, he made the remark “When you practice, don’t practice the whole form. Take a small segment, or even a single move, and just keep practising it over and over again.” At the time, I was reminded to bring myself back to the present and double my efforts to deepen my attention. When you learn a new form, there is a lot going on. You are trying to copy your master’s moves, whilst usually feeling frustrated that you can’t! But you have to suppress the ego, and move your attention to your body and its energy and self-awareness, using your mind. You move your attention around your body as you repeat a move, looking for that difference that makes the difference. Physically this could be a slight shift in body weight, or a different use of your muscles that makes a move ‘feel right’. Or you notice your waist is not synchronised with your feet and arms as you move to a new stance, or that you were holding your breath. Drinking coffee with Shifu, and reflecting on that moment, I re-discovered and deepened my understanding of Shifu’s mastery process. The very essence of shoshin is discovery. Discovery means shedding your pride and just focusing on ‘what is’ in that moment. It requires a broad, wide view type of mental attention that is the opposite of an expert’s natural tendency to use his experience and apply a narrow, focused attention based on what he already ‘knows’. As Iain McGilchrist, an Oxford neuroscientist, says the left hemisphere of our divided brain has the capability to exploit our maps of the world that have been crafted from experience. As he says: “What you need is a simplified version of reality. It’s no good, if fighting a campaign (a reference to a battlefield example), having all the details of plant species that grow in the terrain. What you need is to know the specifics of certain things that matter to you. It’s not reality, but it works better” It ‘works better’ that is, if the situation is familiar and thus your previous experience will reliably predict what will happen. Our mental maps are a prediction tool, a way to navigate the world. Shoshin is an antidote to these habitual ways of thinking that experts use to ‘perform’. Returning to the idea of practice, the psychologist K. Anders Ericsson coined the term ‘deliberate practice’ from his research about the nature of practice amongst elite performers. He says: “People believe that because expert performance is qualitatively different from a normal performance the expert performer must be endowed with characteristics qualitatively different from those of normal adults. […] We agree that expert performance is qualitatively different from normal performance and even that expert performers have characteristics and abilities that are qualitatively different from or at least outside the range of those of normal adults. However, we deny that these differences are immutable, that is, due to innate talent. Only a few exceptions, most notably height, are genetically prescribed. Instead, we argue that the differences between expert performers and normal adults reflect a life-long period of deliberate effort to improve performance in a specific domain.” The remaining 85% of the mastery journey that my Shifu referred to is all practice. What masters learn is that they have to adopt the beginners mind in order to continue advancing their mastery. Without it, they plateau. If you’re interested to explore the mastery process further, I recently wrote a Quora article about it here. ", "child": "", "name": "922_2", "parent": "922", "title": ""}