{"content": "A few observations. The article/section titles are rife with inaccurate conclusions which makes me take the “data driven” conclusions with a grain of salt. (maybe you sensationalized because it = better click bait?) In any case, you have equated ‘speaks less’ with “better listener” as a presupposed conclusion. mistake #1 IMO. We all know that the “better” listener is someone that actually listens with empathy, clarifying intent along the way, responding with relevant content/additional context as the conversation progresses (ie. interruptions/clarifying questions). Time spent is just one KPI of a “good listener”. (I know that you get to this later and perhaps you structured it this way because you wanted to position this as your big aHa moment of the piece, but it feels a bit contrived.) Proper analysis of the data is awesome in it’s own right. I don’t think the false conclusion/sensationalism adds much. Next, I think that the assumption you make that the one doing the selling should speak 50% of the time is ill concluded. I would have anticipated something closer to a 60% sales / 40% prospect ratio would be closer aligned to a higher rate of close. Also, I think it’s not as useful to look at aggregate sales call speaking ratios across all stages as opposed to looking at % across key stages. I would expect that that the ideal ratio would vary significantly depending on:1) they type of sale you are in (services vs. software vs. product) 2) the phase of the deal (stage)3) how many people were on the call (ie conf call or 1:1)4) the level of familiarity the prospect has with your solution5) the Sales person’s grasp of SME content For example, I would expect varying ratios across stages. (qualifying the opportunity (45 sales / 55 prospect ?) vs. presenting a proposed approach (65 sales / 35 prospect?). And I would anticipate that the time the salesperson speaks might increase the more people you get on the phone (because they have to act as the call quarterback in order to make sure things move along smoothly and all the relevant people have an opportunity to speak) I’d love to know how/if the data supports these hypotheses. Some considerations: The Sales rep is very likely the subject matter expert on a thing the prospect wants to buy, which means the prospect is looking to extract the relevant information out of the sales person, as quickly as possible. In every successful sales meeting I have been a part of (delivering or receiving), a “good” salesperson will front-load the conversation with having the prospect speak more (extracting their key goals upfront) so that the subsequent time can be recalibrated in real time for the sales person to systematically address how their solution meets the key goals that were stated by the prospect in their own language. (ie client sets the “content agenda” and the “vernacular” for the call). To this end, I would be interested to dig into the call data deeper and see if there is evidence that most successful sales reps get their prospects to speak for a longer stint upfront (about goals) and then move into a period of addressing the concerns, with punctuation/space for feedback/commentary. In conclusion: the idea to do the analysis is super interesting, the current analysis and derived conclusions are less so at present. My key takeaway from this is article so far is only: Women have an 11% higher close rate. If we want to get into the reasons why and actionable ways to enhance our own practices, we should take another cut at the data. Thanks for posting! ", "child": "", "name": "926_16", "parent": "926", "title": ""}