{"content": "Good points as always, but I think you should’ve titled this column “Discrediting Steve Nash’s Career as Many Ways as I Can,” or “How to Make a Case for MVPs by Only Looking at Points, Rebounds, Assists, and (Sometimes) Team Wins.” You do a disservice to your readers by not even attempting to present an argument or reasoning to explain “wrong” recipients. Things are never so simple as to be self-evident or explained simply by box scores and wins. Not fully explaining context or taking other factors besides slash-lines and team wins, while also describing this column as a lesson in NBA “history,” is blatantly misleading and disingenuous. While I don’t necessarily think Nash should’ve won in ’05 or ’06, (but there’s a damn good argument that he should’ve won in ’07), I can acknowledge that there’s at least an argument to be had. If someone in high school read this column they’d come away thinking Nash must’ve peddled in sexual favors to secure his two wins. You claim Nash’s candidacy is encapsulated in these two things: 15.5/3.3/11.5 and 62 wins. How about adding something like: he also shot 43% from deep on 3 attempts a game and led the Suns to league-best record and league-best offense. He also orchestrated the 13th best offense of all time (the Suns had an Ortg of fucking 120 with Nash on the floor and 103 with him off). Instead you chalk Nash’s awards up to collective voter “idiocy” like they were huffing paint or something instead of watching games. Same with ’06: Yes, Nash “only” averaged 18.8/4.2/10.5 and the Suns “only” had the fourth-best record in the league. But how about mentioning that Amar’e Stoudemire, the second-best player on the team, who averaged 26 points per game the season before played only three games? Or that Joe Johnson, a 17 points per game scorer, bolted in the offseason? Nash also shot 44% from three on more than four shots a game. Holy shit! But since it doesn’t fit your narrative it’s not worth mentioning right? It seems that you think your answers to the “real” MVPs are so self-evident that using real reasoning to justify their cases (or even admitting that another player at least has a justifiable reason for being in the conversation) would be a waste of time. “CP3 finished second but should’ve won if you think the Nash MVPs are valid.” Why would anyone think they’re valid? Nash only averaged 15.5 points! Stupid voters! “Nash had won two MVPs followed by Dirk, and we were sick of our MVPs choking in the playoffs.” Yeah, Dirk choked in ’07, but Nash’s Suns made it to round two that year and that was the series where Diaw and Stoudemire were suspended, remember? And Nash went to the WCF in both ’05 and ’06 years dude! What! “Instead voters turned to Chris “Karl Malone as a point guard” Paul, whose 21/4/12 was far better than anything Nash ever did.” While I’ll concede that CP3 is better than Nash, saying shit like this is straight-up disrespect and blatant distortion of history. Without getting into playoff heroics (or lack thereof in CP’s case), 3 of the top 20 offenses of ALL TIME (nos. 5, 13, 20) were conducted by Nash. Did Steve Nash steal your girl or something? But really, your reasoning is simplistic and your “history” is slanted. You’re better than this dude. ", "child": "", "name": "96_5", "parent": "96", "title": ""}