{"sentences": [{"0199": "I Work, I Swear"}, {"308d": "My employees told me I was too foul-mouthed. Here’s what I said to them."}, {"eeb8": "“This ain’t for no fuck niggasIf you a real nigga then fuck with me.”— Trinidad James, “All Gold Everything”"}, {"b9a5": "One day in a staff meeting in the Loudcloud/Opsware days, someone brought up an issue that had been bothering him for some time. “This place is entirely too profane. It’s making many of the employees uncomfortable.” Others chimed in: “It makes the environment unprofessional. We need to put a stop to it.” Although the complaints were abstract, they were clearly directed at me since I was the biggest abuser of profanity in the company and perhaps in the industry. In those days, I directed the team with such urgency that it was rare for me to say more than a few sentences without an expletive injected somewhere."}, {"5943": "Part of it was intentional. I only had so much time with each employee and it was critically important that I be crystal clear in those moments. Nothing makes things clear like a few choice curse words. “That is not the priority” is radically weaker than “That is not the fucking priority.” When the CEO drops the F-bomb, it gets repeated. And that’s good if you want your message to spread throughout the company. (On the other hand, it’s extremely bad if you don’t want your employees talking like a bunch of gangsta rappers.) But part of it was also unintentional. At this point, I could barely control myself."}, {"dfe4": "This was not an easy company to run, and I’d developed CEOTourette’s syndrome — the profanity was involuntary."}, {"9b26": "Since the complaints seemed broad and deep, I had to take them seriously. I thought hard about it that night and considered the following."}, {"6c49": "In the technology business, some employees would be comfortable with profanity while others would not."}, {"71eb": "If we outlawed profanity, then some employees who used it would not come to work for us or quit once they got there because we would seem old-fashioned and prudish."}, {"753c": "If we kept profanity, some people might leave."}, {"2f80": "My judgment was biased, because I was the main offender."}, {"1cad": "After much consideration, I realized that the best technology companies of the day, Intel and Microsoft, were known to be highly profane places, so we’d be off culture with them and the rest of the modern industry if we stopped profanity. Obviously, that didn’t mean that we had to encourage it, but prohibiting it seemed both unrealistic and counterproductive."}, {"c888": "Attracting the very best engineers meant recruiting from highly profane environments. The choice was between optimizing for top talent or clean culture. Easy decision."}, {"f150": "I decided to keep the cursing, but I also needed to make a statement. People had complained and had run this issue all the way up the organization, and they deserved an explanation. Explaining things would be tricky, because profanity did not work in all contexts. We certainly could not tolerate profanity used to intimidate or sexually harass employees, so I needed to make the distinction clear. Approving profanity only in certain contexts was a tricky message to craft."}, {"a74d": "That night I watched a disturbing movie from the late 1970s called Short Eyes, which told the graphic story of a child molester who went to prison and confronted the one clear prison ethic: Child molesters must die. One of the characters in the movie was a young man referred to by the other inmates as “Cupcakes.”"}, {"49d6": "Hard to believe, but watching that movie, I found my solution."}, {"82bc": "The next day, I gave the following speech at the all-company meeting:"}, {"c1d1": "“It has come to my attention that many people are uncomfortable with the amount of profanity that we use. Being the number-one abuser, these complaints have caused me to reflect on my own behavior as well as the company as a whole. As I see it, we have two choices: (a) we can ban profanity or (b) we can accept profanity. Anything in between is very unlikely to work. ‘Minimal profanity’ cannot be enforced. I’ve said before that we cannot win unless we attract the very best people in the world. In the technology industry, almost everybody comes from a culture that allows profanity. Therefore, banning profanity will likely limit our talent pool more than accepting profanity. As a result, we will allow profanity. However, this does not mean that you can use profanity to intimidate, sexually harass people, or do other bad things. In this way, profanity is no different from other language. For example, consider the word ‘cupcakes.’ It’s fine for me to say to Shannon, ‘Those cupcakes you baked look delicious.’ But it is not okay for me to say to Anthony, ‘Hey, Cupcakes, you look mighty fine in them jeans.’ ”"}, {"d305": "And that was all I said about that."}, {"5f9a": "From The Hard Thing About Hard Things. Copyright © 2014 by Ben Horowitz. Reprinted courtesy of HarperBusiness, an imprint of HarperCollins Publishers."}, {"0ff1": "Available for purchase through Amazon, HarperCollins, and IndieBound."}, {"f4fc": "Follow Backchannel: Twitter | Facebook"}], "tag": ["Tech", "Management", "War Stories"], "child": "0_1\t0_2\t0_3\t0_4\t0_5\t0_6", "content": "I Work, I Swear My employees told me I was too foul-mouthed. Here’s what I said to them. “This ain’t for no fuck niggasIf you a real nigga then fuck with me.”— Trinidad James, “All Gold Everything” One day in a staff meeting in the Loudcloud/Opsware days, someone brought up an issue that had been bothering him for some time. “This place is entirely too profane. It’s making many of the employees uncomfortable.” Others chimed in: “It makes the environment unprofessional. We need to put a stop to it.” Although the complaints were abstract, they were clearly directed at me since I was the biggest abuser of profanity in the company and perhaps in the industry. In those days, I directed the team with such urgency that it was rare for me to say more than a few sentences without an expletive injected somewhere. Part of it was intentional. I only had so much time with each employee and it was critically important that I be crystal clear in those moments. Nothing makes things clear like a few choice curse words. “That is not the priority” is radically weaker than “That is not the fucking priority.” When the CEO drops the F-bomb, it gets repeated. And that’s good if you want your message to spread throughout the company. (On the other hand, it’s extremely bad if you don’t want your employees talking like a bunch of gangsta rappers.) But part of it was also unintentional. At this point, I could barely control myself. This was not an easy company to run, and I’d developed CEOTourette’s syndrome — the profanity was involuntary. Since the complaints seemed broad and deep, I had to take them seriously. I thought hard about it that night and considered the following. In the technology business, some employees would be comfortable with profanity while others would not. If we outlawed profanity, then some employees who used it would not come to work for us or quit once they got there because we would seem old-fashioned and prudish. If we kept profanity, some people might leave. My judgment was biased, because I was the main offender. After much consideration, I realized that the best technology companies of the day, Intel and Microsoft, were known to be highly profane places, so we’d be off culture with them and the rest of the modern industry if we stopped profanity. Obviously, that didn’t mean that we had to encourage it, but prohibiting it seemed both unrealistic and counterproductive. Attracting the very best engineers meant recruiting from highly profane environments. The choice was between optimizing for top talent or clean culture. Easy decision. I decided to keep the cursing, but I also needed to make a statement. People had complained and had run this issue all the way up the organization, and they deserved an explanation. Explaining things would be tricky, because profanity did not work in all contexts. We certainly could not tolerate profanity used to intimidate or sexually harass employees, so I needed to make the distinction clear. Approving profanity only in certain contexts was a tricky message to craft. That night I watched a disturbing movie from the late 1970s called Short Eyes, which told the graphic story of a child molester who went to prison and confronted the one clear prison ethic: Child molesters must die. One of the characters in the movie was a young man referred to by the other inmates as “Cupcakes.” Hard to believe, but watching that movie, I found my solution. The next day, I gave the following speech at the all-company meeting: “It has come to my attention that many people are uncomfortable with the amount of profanity that we use. Being the number-one abuser, these complaints have caused me to reflect on my own behavior as well as the company as a whole. As I see it, we have two choices: (a) we can ban profanity or (b) we can accept profanity. Anything in between is very unlikely to work. ‘Minimal profanity’ cannot be enforced. I’ve said before that we cannot win unless we attract the very best people in the world. In the technology industry, almost everybody comes from a culture that allows profanity. Therefore, banning profanity will likely limit our talent pool more than accepting profanity. As a result, we will allow profanity. However, this does not mean that you can use profanity to intimidate, sexually harass people, or do other bad things. In this way, profanity is no different from other language. For example, consider the word ‘cupcakes.’ It’s fine for me to say to Shannon, ‘Those cupcakes you baked look delicious.’ But it is not okay for me to say to Anthony, ‘Hey, Cupcakes, you look mighty fine in them jeans.’ ” And that was all I said about that. From The Hard Thing About Hard Things. Copyright © 2014 by Ben Horowitz. Reprinted courtesy of HarperBusiness, an imprint of HarperCollins Publishers. Available for purchase through Amazon, HarperCollins, and IndieBound. Follow Backchannel: Twitter | Facebook ", "title": "I Work, I Swear", "author": "Ben Horowitz", "timestamp": "Dec 23, 2014", "parent": "", "name": "0"}