{"name": "1021", "parent": "", "title": "User Experience — it’s a love, hate thing…", "sentences": [{"540a": "User Experience — it’s a love, hate thing…"}, {"3b11": "I’m really beginning to dislike the term User Experience (UX) in relation to digital design, it’s overuse and mis-interpretation is not only alarming, but just plain annoying. Don’t get me wrong, it’s important and as the title of this post suggests, I am not against it. In fact I often use it to explain what I do or more importantly what my designs do, but that right there is my point. Good design is good user experience."}, {"3dd2": "The love"}, {"e42b": "Creating something that a user likes and finds an enjoyable experience is part of the joy of being a designer. It’s the joy for all creatives, it’s why designers design and developers code. Generally I work on user experience everyday, whether it be a website or a brochure, the aim is always to create a good user experience. Designing user interfaces and systems that solve problems for users and make it simple and easy to use is a major part of the appeal for me."}, {"d5b0": "Equally I enjoy the different events, talks and blogs that are available, especially around the North East of England where I am based. User experience in particular seems to be the hot topic within this sort of thing and I certainly find them interesting. They often give great insight into how other people approach the problems faced in certain projects and personally help inspire me to push myself further."}, {"b4a5": "I am even writing a blog post about it, so there is definitely some love in here somewhere."}, {"63c9": "The hate"}, {"c21a": "At times it feels like we are slowly allowing user experience to dictate design rather than letting the design dictate the user experience. Some of the best websites out there push the boundaries of the web and that is the way it should always be, after all that is how we are where we are. The hamburger navigation had to start somewhere, right?"}, {"41fd": "As designers we can’t let this constant desire for a good user experience stifle the creativity and innovation that is needed in web design. We can still apply the principles of good user experience design to this, it just doesn’t need to impede as much as I worry it does. I have been guilty of it in the past, spending time on research, sitemaps and wireframes because I thought that is what you have to do. So much so that there is no time to do the best bit… create."}, {"06cf": "I am not saying sitemaps or wireframes don’t have a place as they most certainly do. One of my latest projects was a system for purchasing tickets and we wireframed the whole ordering process page by page, but only after we had a design direction that we loved. Wireframes, personas, user testing all add to understanding the experience you are creating but they alone aren’t user experience design. They are just part of a logical design process. Equally I am not suggesting that user experience design is only about a beautifully presented set of wireframes but this is exactly what I mean by mis-interpretation."}, {"9627": "Some people are trying to convert something as free as an experience into a tangible object."}, {"36e8": "Because of this too many websites are beginning to look the same purely because we think that’s what a website with a good user experience looks like, and for me that is the wrong approach. In fact in my opinion the very essence of doing that can actually create a bad user experience."}, {"cbe7": "We are beginning to see a lot more designated User Experience teams and roles, which in my opinion doesn’t always make a great deal of sense. I understand the need to quantify it however user experience is an approach, it’s a mindset that everyone on the project should have. Of course you can have a specialist, someone who’s job it is to have the knowledge and make the final call but essentially we are all user experience designers."}, {"6573": "We have to treat every experience in relation to the project not in relation to the web. The good designs and the good experiences all have one thing in common, they focus on the project itself, it’s goals and it’s aspirations. The good experience simply flows from the good design. And let’s not assume that an experience starts and stops solely for the duration of a user being in the browser — after all you can have the best contact form in the world but if the user never gets a response then what’s the point?"}, {"30c0": "The struggle"}, {"3fbd": "User experience exists, it’s real and to that end we need a term that represents it. We have created so many buzzwords and descriptions for our craft that they all often overlap with one another. Has user experience just been the term that has stuck? Maybe."}, {"049a": "I totally see it’s benefit to a project, especially with the increase in e-commerce and apps. Understanding what users like and dislike about your product is crucial, of course it is. However I just feel we are blurring the lines of what user experience is and what it needs to be. It feels like it has been put on a pedestal and personally a majority of the time I don’t see anything that is being done that is any different to what good designers do daily on every project."}, {"32bd": "I suppose this post is written out of frustration that more and more people are perceiving designers to be the ones who just paint pretty pictures. As if the decisions made when we craft a user interface are purely “what we thought looked nice.” If you’re a designer, developer or even a more trendy ‘website architect’ (who knows what they do!) and you aren’t designing with your users experience in mind, then I’d question what you are doing."}, {"8c6a": "See the original post on my blog."}], "content": "User Experience — it’s a love, hate thing… I’m really beginning to dislike the term User Experience (UX) in relation to digital design, it’s overuse and mis-interpretation is not only alarming, but just plain annoying. Don’t get me wrong, it’s important and as the title of this post suggests, I am not against it. In fact I often use it to explain what I do or more importantly what my designs do, but that right there is my point. Good design is good user experience. The love Creating something that a user likes and finds an enjoyable experience is part of the joy of being a designer. It’s the joy for all creatives, it’s why designers design and developers code. Generally I work on user experience everyday, whether it be a website or a brochure, the aim is always to create a good user experience. Designing user interfaces and systems that solve problems for users and make it simple and easy to use is a major part of the appeal for me. Equally I enjoy the different events, talks and blogs that are available, especially around the North East of England where I am based. User experience in particular seems to be the hot topic within this sort of thing and I certainly find them interesting. They often give great insight into how other people approach the problems faced in certain projects and personally help inspire me to push myself further. I am even writing a blog post about it, so there is definitely some love in here somewhere. The hate At times it feels like we are slowly allowing user experience to dictate design rather than letting the design dictate the user experience. Some of the best websites out there push the boundaries of the web and that is the way it should always be, after all that is how we are where we are. The hamburger navigation had to start somewhere, right? As designers we can’t let this constant desire for a good user experience stifle the creativity and innovation that is needed in web design. We can still apply the principles of good user experience design to this, it just doesn’t need to impede as much as I worry it does. I have been guilty of it in the past, spending time on research, sitemaps and wireframes because I thought that is what you have to do. So much so that there is no time to do the best bit… create. I am not saying sitemaps or wireframes don’t have a place as they most certainly do. One of my latest projects was a system for purchasing tickets and we wireframed the whole ordering process page by page, but only after we had a design direction that we loved. Wireframes, personas, user testing all add to understanding the experience you are creating but they alone aren’t user experience design. They are just part of a logical design process. Equally I am not suggesting that user experience design is only about a beautifully presented set of wireframes but this is exactly what I mean by mis-interpretation. Some people are trying to convert something as free as an experience into a tangible object. Because of this too many websites are beginning to look the same purely because we think that’s what a website with a good user experience looks like, and for me that is the wrong approach. In fact in my opinion the very essence of doing that can actually create a bad user experience. We are beginning to see a lot more designated User Experience teams and roles, which in my opinion doesn’t always make a great deal of sense. I understand the need to quantify it however user experience is an approach, it’s a mindset that everyone on the project should have. Of course you can have a specialist, someone who’s job it is to have the knowledge and make the final call but essentially we are all user experience designers. We have to treat every experience in relation to the project not in relation to the web. The good designs and the good experiences all have one thing in common, they focus on the project itself, it’s goals and it’s aspirations. The good experience simply flows from the good design. And let’s not assume that an experience starts and stops solely for the duration of a user being in the browser — after all you can have the best contact form in the world but if the user never gets a response then what’s the point? The struggle User experience exists, it’s real and to that end we need a term that represents it. We have created so many buzzwords and descriptions for our craft that they all often overlap with one another. Has user experience just been the term that has stuck? Maybe. I totally see it’s benefit to a project, especially with the increase in e-commerce and apps. Understanding what users like and dislike about your product is crucial, of course it is. However I just feel we are blurring the lines of what user experience is and what it needs to be. It feels like it has been put on a pedestal and personally a majority of the time I don’t see anything that is being done that is any different to what good designers do daily on every project. I suppose this post is written out of frustration that more and more people are perceiving designers to be the ones who just paint pretty pictures. As if the decisions made when we craft a user interface are purely “what we thought looked nice.” If you’re a designer, developer or even a more trendy ‘website architect’ (who knows what they do!) and you aren’t designing with your users experience in mind, then I’d question what you are doing. See the original post on my blog. ", "child": "1021_1\t1021_2\t1021_3\t1021_4\t1021_5\t1021_6\t1021_7\t1021_8\t1021_9\t1021_10\t1021_11\t1021_12\t1021_13\t1021_14\t1021_15\t1021_16\t1021_17\t1021_18\t1021_19\t1021_20\t1021_21\t1021_22\t1021_23\t1021_24\t1021_251021_1\t1021_2\t1021_3\t1021_4\t1021_5\t1021_6\t1021_7\t1021_8\t1021_9\t1021_10\t1021_11\t1021_12\t1021_13\t1021_14\t1021_15\t1021_16\t1021_17\t1021_18\t1021_19\t1021_20\t1021_21\t1021_22\t1021_23\t1021_24\t1021_25"}