{"name": "1027", "parent": "", "title": "How We Write Proposals in My Design Studio", "sentences": [{"e6a5": "How We Write Proposals in My Design Studio"}, {"1406": "AS THE HEAD of a newish design studio, I spend a fair amount of time writing proposals. And here’s how I like to do it."}, {"58a3": "I do it like a conversation, and that’s how we start: with phone calls and emails to one or two key decision makers, followed by a research period of about two to three weeks. And when I say research, what I’m really talking about — besides the usual competitive analysis, analytics, and testing — is even more conversations, but this time with a wider net of stakeholders and customers."}, {"74ce": "Some studios do this for free, and other studios only do it if the client has signed off on a huge project and paid the first big deposit. But we do this research for a fee. A small, reasonable, consulting fee. If the client then hires us to do the job, we deduct the research fee from the project cost. If they don’t, they’ve gained a lot of great information at a fair cost. (So far, they’ve never not hired us to go on and do the project.)"}, {"aec2": "FROM INTAKE TO IDEAS"}, {"1bd5": "About two and half weeks into the research project, we have a strong idea of what matters most to the business and its customers, and we begin to have visions of solutions and innovations, large and small. We can’t help it. We’re interaction designers and it’s how our minds work."}, {"1338": "After soaking in a potential client’s world for two-plus weeks, we can’t help beginning to invent designs that solve some of their big and small problems, and that enhance what’s already great about the client and their product. This happens in our heads whether we want it to or not."}, {"f108": "At first, we are merely neutral listeners, forcing ourselves not to solve, not to imagine, but only to truly hear and understand. But within about fifteen days, we can’t help but begin imagining little modules and big sections, huge themes and tiny, innovative enhancements, which might please and help our client, their customers, or their staff. And so long as those ideas come from the product, come from what the client and their customers have told us, we feel free to begin sharing them."}, {"4df5": "THE FIRST DESIGN IS WRITTEN"}, {"00c0": "We do that by writing a report where we share with the client what we’ve begun learning and thinking about their business. Although this report is structured like a business document, we think of it as the first part of design — the first written rough draft of articulating what the client’s business needs to do, and how design might help."}, {"6053": "Because it’s a business document, and because we’re workers, not magical pixies, we share facts and data and things stakeholders and customers have said that ring true and that harmonize with other things other stakeholders and customers have said. But all that mustering of facts and data is in the service of a shared creative awakening to the design’s possibilities."}, {"8b7a": "START UGLY TO STAY HONEST"}, {"7223": "Now let me tell you how we present our findings: we present them in a Google Doc that the client can access, share, and comment on. We know that many design studios spend much energy visually tarting up even their most basic client communications. Thus, even a humble invoice comes dressed for the prom."}, {"9f6f": "But we don’t do that. We save aesthetics and beauty for the site design. We keep communications open and plain, like an Amish shirt. And we keep communications editable, because this is collaboration, this is conversation, this is not a dead artifact, a take-it-or-leave-it. And Google Docs is the perfect vehicle for it. Just as the traditionally formatted typewritten screenplay is the perfect, neutral vehicle for a writer to share with a director."}, {"f15b": "This initial research report, this poem of business, this first, rough, written design, presented to the client via the homey simplicity of Google Docs, elicits more client/designer conversation, more emails, more Basecamp posts, more internal discussions in the studio."}, {"b9f2": "And then, after about a week, we present the client with our proposal. Which is clearly the product of all our conversations, and particularly of all the important agreements we reached during that research period. By the time our clients receive the proposal, they are already nodding, as if they always knew what it contained. Because, in a way, they did. Because, if we did our research right, we’ve merely externalized and articulated what they already felt but had not expressed."}, {"d62b": "And even now, when we’re asking for serious money to do a serious job, we submit our proposal via Google Docs — because prettified, overly branded proposals are about the studio that produces them, whereas our work is about the client and their product. Because even the most painstakingly researched and written proposal, if it is too pretty and too studio-branded, feels like boilerplate, whereas an ugly Google Doc is clearly just work, to be modified or agreed to or argued about."}, {"5b04": "This is just what we do at our studio. You can try it or not. Personally, I like this approach and I’ve never had a client complain. I’ve always felt a little dirty when presenting a pitch that was too visually polished, and I’ve never won a single gig with boilerplate. Every job has to be earned by studying and understanding and knowing how to share what you’ve understood. At least, that’s how we do it."}, {"6713": "I’m Jeffrey. Follow me @zeldman. I publish A List Apart Magazine and A Book Apart “for people who make websites,” and co-founded An Event Apart: three days of design, code, and content for web & interaction designers. Most recently, I opened the NYC design studio.zeldman. Let’s work together!"}], "content": "How We Write Proposals in My Design Studio AS THE HEAD of a newish design studio, I spend a fair amount of time writing proposals. And here’s how I like to do it. I do it like a conversation, and that’s how we start: with phone calls and emails to one or two key decision makers, followed by a research period of about two to three weeks. And when I say research, what I’m really talking about — besides the usual competitive analysis, analytics, and testing — is even more conversations, but this time with a wider net of stakeholders and customers. Some studios do this for free, and other studios only do it if the client has signed off on a huge project and paid the first big deposit. But we do this research for a fee. A small, reasonable, consulting fee. If the client then hires us to do the job, we deduct the research fee from the project cost. If they don’t, they’ve gained a lot of great information at a fair cost. (So far, they’ve never not hired us to go on and do the project.) FROM INTAKE TO IDEAS About two and half weeks into the research project, we have a strong idea of what matters most to the business and its customers, and we begin to have visions of solutions and innovations, large and small. We can’t help it. We’re interaction designers and it’s how our minds work. After soaking in a potential client’s world for two-plus weeks, we can’t help beginning to invent designs that solve some of their big and small problems, and that enhance what’s already great about the client and their product. This happens in our heads whether we want it to or not. At first, we are merely neutral listeners, forcing ourselves not to solve, not to imagine, but only to truly hear and understand. But within about fifteen days, we can’t help but begin imagining little modules and big sections, huge themes and tiny, innovative enhancements, which might please and help our client, their customers, or their staff. And so long as those ideas come from the product, come from what the client and their customers have told us, we feel free to begin sharing them. THE FIRST DESIGN IS WRITTEN We do that by writing a report where we share with the client what we’ve begun learning and thinking about their business. Although this report is structured like a business document, we think of it as the first part of design — the first written rough draft of articulating what the client’s business needs to do, and how design might help. Because it’s a business document, and because we’re workers, not magical pixies, we share facts and data and things stakeholders and customers have said that ring true and that harmonize with other things other stakeholders and customers have said. But all that mustering of facts and data is in the service of a shared creative awakening to the design’s possibilities. START UGLY TO STAY HONEST Now let me tell you how we present our findings: we present them in a Google Doc that the client can access, share, and comment on. We know that many design studios spend much energy visually tarting up even their most basic client communications. Thus, even a humble invoice comes dressed for the prom. But we don’t do that. We save aesthetics and beauty for the site design. We keep communications open and plain, like an Amish shirt. And we keep communications editable, because this is collaboration, this is conversation, this is not a dead artifact, a take-it-or-leave-it. And Google Docs is the perfect vehicle for it. Just as the traditionally formatted typewritten screenplay is the perfect, neutral vehicle for a writer to share with a director. This initial research report, this poem of business, this first, rough, written design, presented to the client via the homey simplicity of Google Docs, elicits more client/designer conversation, more emails, more Basecamp posts, more internal discussions in the studio. And then, after about a week, we present the client with our proposal. Which is clearly the product of all our conversations, and particularly of all the important agreements we reached during that research period. By the time our clients receive the proposal, they are already nodding, as if they always knew what it contained. Because, in a way, they did. Because, if we did our research right, we’ve merely externalized and articulated what they already felt but had not expressed. And even now, when we’re asking for serious money to do a serious job, we submit our proposal via Google Docs — because prettified, overly branded proposals are about the studio that produces them, whereas our work is about the client and their product. Because even the most painstakingly researched and written proposal, if it is too pretty and too studio-branded, feels like boilerplate, whereas an ugly Google Doc is clearly just work, to be modified or agreed to or argued about. This is just what we do at our studio. You can try it or not. Personally, I like this approach and I’ve never had a client complain. I’ve always felt a little dirty when presenting a pitch that was too visually polished, and I’ve never won a single gig with boilerplate. Every job has to be earned by studying and understanding and knowing how to share what you’ve understood. At least, that’s how we do it. I’m Jeffrey. Follow me @zeldman. I publish A List Apart Magazine and A Book Apart “for people who make websites,” and co-founded An Event Apart: three days of design, code, and content for web & interaction designers. Most recently, I opened the NYC design studio.zeldman. Let’s work together! ", "child": "1027_1\t1027_2\t1027_3\t1027_4\t1027_5\t1027_6\t1027_7\t1027_8\t1027_9"}