{"name": "1030", "parent": "", "title": "Why we removed the most visited advice page on our website", "sentences": [{"0225": "Why we removed the most visited advice page on our website"}, {"a6b9": "Using data to investigate how people use content can challenge our assumptions in surprising ways."}, {"5c56": "We’ve recently decided to remove Basic rights at work, the most visited advice page on our website."}, {"a9dd": "It gets 70,000 visits a month and is in the top results for lots of queries about work problems on Google. But we’ve looked at the feedback and tested how people are using the page, and it’s clear we need to find a better way to help them solve their problems."}, {"e5fd": "The data told us:"}, {"dfa2": "No one’s looking for it"}, {"b446": "Most searches that bring users to the page are about specific problems. For example, ‘boss doesn’t give me breaks at work’ or ‘how much a week do I get if I go on the sick at work’."}, {"20e7": "The basic rights page is more of an overview — it doesn’t solve these specific problems. In most cases we do that better on other pages."}, {"f3d3": "No one’s reading it"}, {"2c12": "Lots of people are leaving the page as soon as they open it, or leaving the site completely. The exit and bounce rates are both significantly higher than our average, at 63.05% and 72.82% respectively."}, {"b46d": "The heat maps also show us people aren’t reading the page. The closer to white the colour gets, the more people are looking at that part of the page. This one shows us a lot of people look at the information at the top, which is just a table of contents."}, {"7364": "But the further down the page you go, the colder it gets, showing people aren’t reading down."}, {"98f7": "Of course, this could mean people find the answer to their question as soon as they land on the page, so don’t need to stay. But this isn’t that sort of page. It has brief information about a lot of subjects, but the user has to click on links to other pages for the problem-solving content. They’re not clicking on those links, meaning we can be sure we’re not solving their problems. This page just gets in the way of people finding what they need."}, {"b475": "For example, the health and safety section gives a long list of regulations employers must follow."}, {"01fa": "This doesn’t help anyone who wants to know what they can do about their employer breaking the rule. The pattern is replicated throughout the page — lots of information, no real problem solving."}, {"c9f9": "People don’t know what it’s for"}, {"accd": "For those users who do make it to the bottom of the page, there’s a link to give feedback. Over the last year the feedback is mostly from people who can’t find what they’re looking for:"}, {"5b61": "“There appears to be no information about giving notice to your employer.”"}, {"3335": "“The paragraph doesn’t tell the client much about what action they can take over bullying.”"}, {"1991": "When we tested a new version of the page with the public, they were all clear it didn’t meet their specific needs:"}, {"0c41": "“It’s all statutory rights — I just want to know about my maternity.”"}, {"7e1e": "“It’s just information.”"}, {"c1f7": "What we’re going to do"}, {"ae77": "All our content should be designed to meet the needs of real users. This page doesn’t meet any user needs because it doesn’t solve anyone’s problems. As the tester said, it’s just information."}, {"10cf": "We can’t make a case for keeping the page, however hard we try. So we’re going to remove it."}, {"0a7b": "Of course, where this will leave gaps (for example, around resignation and bullying), we’ll review whether and how to fill them. We’ve added a new page on getting references when you leave a job, for example."}, {"fb94": "And we’ll continue to monitor usage and feedback. If removing the page is causing problems, we’ll review our decision."}], "content": "Why we removed the most visited advice page on our website Using data to investigate how people use content can challenge our assumptions in surprising ways. We’ve recently decided to remove Basic rights at work, the most visited advice page on our website. It gets 70,000 visits a month and is in the top results for lots of queries about work problems on Google. But we’ve looked at the feedback and tested how people are using the page, and it’s clear we need to find a better way to help them solve their problems. The data told us: No one’s looking for it Most searches that bring users to the page are about specific problems. For example, ‘boss doesn’t give me breaks at work’ or ‘how much a week do I get if I go on the sick at work’. The basic rights page is more of an overview — it doesn’t solve these specific problems. In most cases we do that better on other pages. No one’s reading it Lots of people are leaving the page as soon as they open it, or leaving the site completely. The exit and bounce rates are both significantly higher than our average, at 63.05% and 72.82% respectively. The heat maps also show us people aren’t reading the page. The closer to white the colour gets, the more people are looking at that part of the page. This one shows us a lot of people look at the information at the top, which is just a table of contents. But the further down the page you go, the colder it gets, showing people aren’t reading down. Of course, this could mean people find the answer to their question as soon as they land on the page, so don’t need to stay. But this isn’t that sort of page. It has brief information about a lot of subjects, but the user has to click on links to other pages for the problem-solving content. They’re not clicking on those links, meaning we can be sure we’re not solving their problems. This page just gets in the way of people finding what they need. For example, the health and safety section gives a long list of regulations employers must follow. This doesn’t help anyone who wants to know what they can do about their employer breaking the rule. The pattern is replicated throughout the page — lots of information, no real problem solving. People don’t know what it’s for For those users who do make it to the bottom of the page, there’s a link to give feedback. Over the last year the feedback is mostly from people who can’t find what they’re looking for: “There appears to be no information about giving notice to your employer.” “The paragraph doesn’t tell the client much about what action they can take over bullying.” When we tested a new version of the page with the public, they were all clear it didn’t meet their specific needs: “It’s all statutory rights — I just want to know about my maternity.” “It’s just information.” What we’re going to do All our content should be designed to meet the needs of real users. This page doesn’t meet any user needs because it doesn’t solve anyone’s problems. As the tester said, it’s just information. We can’t make a case for keeping the page, however hard we try. So we’re going to remove it. Of course, where this will leave gaps (for example, around resignation and bullying), we’ll review whether and how to fill them. We’ve added a new page on getting references when you leave a job, for example. And we’ll continue to monitor usage and feedback. If removing the page is causing problems, we’ll review our decision. ", "child": "1030_1\t1030_2"}