{"name": "1046", "parent": "", "title": "Favorite Movie Trailers of All Time", "sentences": [{"7075": "Favorite Movie Trailers of All Time"}, {"a32c": "Just in time for some hot new trailers to drop, CineNation contributors get together to talk some of the GOATs."}, {"c714": "When movie trailers are done well, they are great stories. They don’t reveal too much about the film, but they give you enough to pique your interest. In some cases, the trailers are better than the movies. Within the past few weeks, we have seen numerous trailers drop that have taken the world by storm. From the trailer of IT scaring its way to becoming the most watched trailer in its first twenty-four hours to the trailer of Thor: Ragnarok teasing us with the new comedic approach Taiki Waititi is bringing to the Thor series. Then today, arguably the most anticipated trailer of the year dropped…Stars Wars: The Last Jedi. In honor of these recent trailer releases, some of the writers at CineNation reveal their all time favorite movie trailers."}, {"9866": "Where the Wild Things Are"}, {"3152": "By Thomas Horton"}, {"9b42": "The trailers that get me most excited are ones that function on their own. They can tell a little story, they can create a good scare, they just have to stand as something independent of the film to really make me keep coming back. It’s no surprise, with his background in music videos, that the trailer for Spike Jonze’s Where The Wild Things Are plays like a music video in itself. Set to Arcade Fire’s “Wake Up,” the trailer is cut perfectly to pair Spike’s gorgeous visuals with the raw energy of the song. Add in the unique font and the inspiring messages written throughout the video, and you have something entirely its own."}, {"2bbd": "Where The Wild Things Are was probably my favorite book as a child, and when Spike Jonze was attached to direct it, I was intrigued. It is, after all, a very simple story. How was Spike going to get a feature-length film out of it? But when this trailer came out, it put many of my concerns to rest. This was the first look at the character designs and the atmosphere of the film, and it all feels perfect. It ended up being nice that I loved the film as well, but I think this trailer would stay near to my heart on its own merits no matter what."}, {"b758": "True Grit"}, {"d62e": "By Brandon Sparks"}, {"b224": "Logan might have perfected the use of Johnny Cash music in movie trailers, and Pirates of the Caribbean: Dead Men Tell No Tales might have jumped the shark with it, but the trailer for the remake of True Grit originated it."}, {"4387": "This will easily be one of the least viewed trailers, if not the least viewed trailer, on this list, but it sure as hell shouldn’t be. The film was released in 2010, back when online trailers were not as big as they are today. True Grit was one of those films where I really noticed just what great marketing could for a film. Westerns are a hard sell for movie audiences nowadays, and they were even harder ten years ago. But, this trailer is textbook marketing for a film."}, {"9e49": "From both the opening line and opening shot, we are introduced to our main character, Rooster Cogburn (Jeff Bridges). We then establish our other main characters Mattie Ross (Hailee Stenfeld) and LaBoeuf (Matt Damon) and the major conflict of the story. Once the team is together and on their way, we get the turn of the trailer and the new conflict. This is when the true character of Rooster Cogburn is unleashed, until finally we end the trailer in a similar fashion as the beginning. This time, however, Cogburn is not a man motivated by money or his profession, but a man motivated by vengeance and justice. Like Thomas said earlier, great trailers can serve as mini-stories and this trailer does that. Put a great Johnny Cash song behind it, showcase the great cinematography of Roger Deakins, slap “From Joel and Ethan Coen” on it, and you have yourself the hit marketing campaign to one of the highest grossing Westerns of all time."}, {"9fa6": "Seriously, every time I see Jeff Bridges riding toward a gang of men and firing his pistols while Johnny Cash sings the verse “Sooner or later God will cut you down”, I want to travel back in time and become a gunslinger of the old West. Thankfully Westworld has become a thing, so sooner or later this will happen."}, {"adbe": "Watchmen"}, {"fbdf": "By Sean Randall"}, {"3d67": "Way back in the day, before he was being wrongly blamed for everything bad about the DC Film Universe (I blame David S. Goyer for at least 40%), a young director named Zack Snyder, fresh off his breakout sophomore turn 300, decided to tackle the most impossible-to-film comic book/graphic novel of all time: Watchmen by Alan Moore. At that point, I had not seen 300. My only knowledge was slo-mo, “This Is Sparta!” memes, and this sadly disqualified fan-made PG version of a 300 trailer. I had also never read the graphic novel. So I had literally no idea what to expect from this director or this source material."}, {"ae1f": "This trailer was the first one I ever downloaded for my own personal offline viewing. Which I did. Many times. The film, released in 2009, was coming in before the Marvel “Bright and Fun Comic Book Movies” reign, just one year after one of the greatest comic book films of all time, The Dark Knight. It promised a similar harsh darkness, but from characters I didn’t know. The music was perfectly chosen, an almost sarcastic moodiness that marches you forward from violent act to violent act with a steady beat. Imagery of fire, violence, war, death, and men being ripped apart in flashes of blue told audiences how intense it would be. And the fact that only two lines of dialogue were spoken — “God help us all” and “The world will look up and shout, ‘Save us.’ And I will whisper, ‘No.’” — made me focus more on the gorgeous visuals shown while intriguing me to ponder their context just enough."}, {"8add": "Ultimately, the trailer promised an intense voyage with some unique characters, and I wanted to dive in and learn about this dark, dystopian, and oddly beautiful world. And whether or not you hate the film (which, full disclosure, I don’t at all), this trailer did what a trailer should do: Get you interested in a movie and excited enough to shell out the money to see it in theaters."}, {"e56c": "Miller’s Crossing and The Shawshank Redemption"}, {"3868": "By Alex Bauer"}, {"9e4b": "So, I’m going to cheat. Though movie trailers are, usually, overhyped, two stick out as favorites: 1990’s Miller’s Crossing and 1994’s The Shawshank Redemption. One is about Irish gangsters, and the other tells the tale of a man’s time at a prison. Their trailers are connected by the piece of music that is infectious and beautiful: Carter Burwell’s score to Miller’s Crossing. Both trailers use the score, and the effect is magnificent. The piece of music fits both movie’s aesthetic. Burwell’s Miller’s Crossing score is a gorgeous piece of music; the score is underrated in the pantheon of film scores."}, {"24cb": "Both trailers brilliantly give a sneak peak into the world of the specific film. You see a whole range of characters, which is important because both films have a colorful cast. They both have their bits of humor, but remain serious enough to warrant attention. Along with the characters, you get a sense of the time period (thanks to the score used) and setting of each film. With Shawshank, quick excerpts of prison life make it through the trailer. It leaves me wanting to watch to get a fuller picture. For the Miller’s Crossing trailer, the autumn leaves in the forest and the prohibition setting is the perfect feel for a neo-noir gangster film. Plus, it’s the Coen Brothers."}, {"f4d5": "I cannot decide between the two. I have watched both over and over again, and it still feels magical. I love both films, and they are must watches. But, make sure you watch the trailers first."}, {"b843": "Suicide Squad"}, {"99b1": "By Alaina Boukedes"}, {"e7db": "Say what you will about the movie itself, but the trailers for Suicide Squad were epic. First off, Bohemian Rhapsody conducted the entire first trailer. Every turn, fight scene and dark broody cutaway was perfectly soundtracked by Queen. It gets you amped within the first 20 seconds, then you get my girl Viola Davis laying down the law. Every shot from then on showcased action, character and humor. Will Smith cocked his gun to the beat for Christsakes. It was perfectly executed. After that, one of the best moments was the silence before the guitar drop, where we see a character crack a beer behind a burning car. What continues is a hilariously self-aware collection of explosions, guns and scenes of the city being run amok by this gang of baddies. The trailer showcased DC’s understanding that most of this movie was going to be sarcastic and devious. Which, for the most part, it was. If you aren’t satisfied by the first trailer, I highly recommend watching the second, which includes the musical stylings of “The Ballroom Blitz”. Same hilarity and badassery, different wonderful song."}, {"dbfe": "Harry Potter and the Half-Blood Prince"}, {"923d": "By Dan LeVine"}, {"575a": "This trailer has 1,470,341 views on YouTube and I’m probably responsible for at least 20% of that number. Even though the movie came out in 2009, I still get chills every time I watch it. I dare you to view these 2 minutes and 27 seconds without getting goosebumps. It is the perfect trailer in every way."}, {"9d9e": "The music is incredible. It evokes the recognizable Harry Potter score composed by the brilliant John Williams, and perfectly captures everything you want in a Potter film — action, adventure, fantasy, romance, comedy, mystery, thrills and magic. The Half Blood Prince, in my opinion, was a return to excellence after the somewhat disappointing Order of the Phoenix. The trailer assures us that with film six, Warner Brothers isn’t holding back."}, {"6f66": "The trailer showcases an impressive display of stunning images — from the opening image of Dumbledore and Harry surrounded by crashing breakers, to the Millennium Bridge in London getting destroyed by Death Eaters, to the Tom Riddle flashback, to Dumbledore whipping up a kickass fire spell. There are the images that readers of the novel will recognize — Ron snogging Lavender Brown, Draco and the Vanishing Cabinet, students paying their last respects to a beloved character. Glimpses of new faces like Slughorn and Fenrir Greyback, an epic battle between Harry and Draco, Ginny leaning in for the big smoocheroo…"}, {"cce7": "The film marks the franchise’s descent into its darkest movies. We see the signs in the trailer — the once-colorful poles of the Quidditch stadium, now barren and sad; the Dark Mark appearing over Hogwarts; the Weasley home destroyed; Diagon Alley terrorized by Death Eaters; the horrifying image of Katie Bell hanging limp in the sky, possessed. It’s the beginning of the end."}, {"203e": "And finally, the best part: Severus Snape, cold and unfeeling, having just murdered Harry’s hero and mentor in cold blood, uttering, in monotone, “It’s over.” A final montage of epic images, each more exciting than the last until…the familiar font and the familiar tune over the familiar dark clouds…"}, {"eb5a": "AAHHHH! Okay bye I’m going to watch it again…"}, {"38c6": "Want more from CineNation?"}, {"2278": "Subscribe, Like, and Follow us on iTunes, Facebook, Twitter, and Flipboard"}], "content": "Favorite Movie Trailers of All Time Just in time for some hot new trailers to drop, CineNation contributors get together to talk some of the GOATs. When movie trailers are done well, they are great stories. They don’t reveal too much about the film, but they give you enough to pique your interest. In some cases, the trailers are better than the movies. Within the past few weeks, we have seen numerous trailers drop that have taken the world by storm. From the trailer of IT scaring its way to becoming the most watched trailer in its first twenty-four hours to the trailer of Thor: Ragnarok teasing us with the new comedic approach Taiki Waititi is bringing to the Thor series. Then today, arguably the most anticipated trailer of the year dropped…Stars Wars: The Last Jedi. In honor of these recent trailer releases, some of the writers at CineNation reveal their all time favorite movie trailers. Where the Wild Things Are By Thomas Horton The trailers that get me most excited are ones that function on their own. They can tell a little story, they can create a good scare, they just have to stand as something independent of the film to really make me keep coming back. It’s no surprise, with his background in music videos, that the trailer for Spike Jonze’s Where The Wild Things Are plays like a music video in itself. Set to Arcade Fire’s “Wake Up,” the trailer is cut perfectly to pair Spike’s gorgeous visuals with the raw energy of the song. Add in the unique font and the inspiring messages written throughout the video, and you have something entirely its own. Where The Wild Things Are was probably my favorite book as a child, and when Spike Jonze was attached to direct it, I was intrigued. It is, after all, a very simple story. How was Spike going to get a feature-length film out of it? But when this trailer came out, it put many of my concerns to rest. This was the first look at the character designs and the atmosphere of the film, and it all feels perfect. It ended up being nice that I loved the film as well, but I think this trailer would stay near to my heart on its own merits no matter what. True Grit By Brandon Sparks Logan might have perfected the use of Johnny Cash music in movie trailers, and Pirates of the Caribbean: Dead Men Tell No Tales might have jumped the shark with it, but the trailer for the remake of True Grit originated it. This will easily be one of the least viewed trailers, if not the least viewed trailer, on this list, but it sure as hell shouldn’t be. The film was released in 2010, back when online trailers were not as big as they are today. True Grit was one of those films where I really noticed just what great marketing could for a film. Westerns are a hard sell for movie audiences nowadays, and they were even harder ten years ago. But, this trailer is textbook marketing for a film. From both the opening line and opening shot, we are introduced to our main character, Rooster Cogburn (Jeff Bridges). We then establish our other main characters Mattie Ross (Hailee Stenfeld) and LaBoeuf (Matt Damon) and the major conflict of the story. Once the team is together and on their way, we get the turn of the trailer and the new conflict. This is when the true character of Rooster Cogburn is unleashed, until finally we end the trailer in a similar fashion as the beginning. This time, however, Cogburn is not a man motivated by money or his profession, but a man motivated by vengeance and justice. Like Thomas said earlier, great trailers can serve as mini-stories and this trailer does that. Put a great Johnny Cash song behind it, showcase the great cinematography of Roger Deakins, slap “From Joel and Ethan Coen” on it, and you have yourself the hit marketing campaign to one of the highest grossing Westerns of all time. Seriously, every time I see Jeff Bridges riding toward a gang of men and firing his pistols while Johnny Cash sings the verse “Sooner or later God will cut you down”, I want to travel back in time and become a gunslinger of the old West. Thankfully Westworld has become a thing, so sooner or later this will happen. Watchmen By Sean Randall Way back in the day, before he was being wrongly blamed for everything bad about the DC Film Universe (I blame David S. Goyer for at least 40%), a young director named Zack Snyder, fresh off his breakout sophomore turn 300, decided to tackle the most impossible-to-film comic book/graphic novel of all time: Watchmen by Alan Moore. At that point, I had not seen 300. My only knowledge was slo-mo, “This Is Sparta!” memes, and this sadly disqualified fan-made PG version of a 300 trailer. I had also never read the graphic novel. So I had literally no idea what to expect from this director or this source material. This trailer was the first one I ever downloaded for my own personal offline viewing. Which I did. Many times. The film, released in 2009, was coming in before the Marvel “Bright and Fun Comic Book Movies” reign, just one year after one of the greatest comic book films of all time, The Dark Knight. It promised a similar harsh darkness, but from characters I didn’t know. The music was perfectly chosen, an almost sarcastic moodiness that marches you forward from violent act to violent act with a steady beat. Imagery of fire, violence, war, death, and men being ripped apart in flashes of blue told audiences how intense it would be. And the fact that only two lines of dialogue were spoken — “God help us all” and “The world will look up and shout, ‘Save us.’ And I will whisper, ‘No.’” — made me focus more on the gorgeous visuals shown while intriguing me to ponder their context just enough. Ultimately, the trailer promised an intense voyage with some unique characters, and I wanted to dive in and learn about this dark, dystopian, and oddly beautiful world. And whether or not you hate the film (which, full disclosure, I don’t at all), this trailer did what a trailer should do: Get you interested in a movie and excited enough to shell out the money to see it in theaters. Miller’s Crossing and The Shawshank Redemption By Alex Bauer So, I’m going to cheat. Though movie trailers are, usually, overhyped, two stick out as favorites: 1990’s Miller’s Crossing and 1994’s The Shawshank Redemption. One is about Irish gangsters, and the other tells the tale of a man’s time at a prison. Their trailers are connected by the piece of music that is infectious and beautiful: Carter Burwell’s score to Miller’s Crossing. Both trailers use the score, and the effect is magnificent. The piece of music fits both movie’s aesthetic. Burwell’s Miller’s Crossing score is a gorgeous piece of music; the score is underrated in the pantheon of film scores. Both trailers brilliantly give a sneak peak into the world of the specific film. You see a whole range of characters, which is important because both films have a colorful cast. They both have their bits of humor, but remain serious enough to warrant attention. Along with the characters, you get a sense of the time period (thanks to the score used) and setting of each film. With Shawshank, quick excerpts of prison life make it through the trailer. It leaves me wanting to watch to get a fuller picture. For the Miller’s Crossing trailer, the autumn leaves in the forest and the prohibition setting is the perfect feel for a neo-noir gangster film. Plus, it’s the Coen Brothers. I cannot decide between the two. I have watched both over and over again, and it still feels magical. I love both films, and they are must watches. But, make sure you watch the trailers first. Suicide Squad By Alaina Boukedes Say what you will about the movie itself, but the trailers for Suicide Squad were epic. First off, Bohemian Rhapsody conducted the entire first trailer. Every turn, fight scene and dark broody cutaway was perfectly soundtracked by Queen. It gets you amped within the first 20 seconds, then you get my girl Viola Davis laying down the law. Every shot from then on showcased action, character and humor. Will Smith cocked his gun to the beat for Christsakes. It was perfectly executed. After that, one of the best moments was the silence before the guitar drop, where we see a character crack a beer behind a burning car. What continues is a hilariously self-aware collection of explosions, guns and scenes of the city being run amok by this gang of baddies. The trailer showcased DC’s understanding that most of this movie was going to be sarcastic and devious. Which, for the most part, it was. If you aren’t satisfied by the first trailer, I highly recommend watching the second, which includes the musical stylings of “The Ballroom Blitz”. Same hilarity and badassery, different wonderful song. Harry Potter and the Half-Blood Prince By Dan LeVine This trailer has 1,470,341 views on YouTube and I’m probably responsible for at least 20% of that number. Even though the movie came out in 2009, I still get chills every time I watch it. I dare you to view these 2 minutes and 27 seconds without getting goosebumps. It is the perfect trailer in every way. The music is incredible. It evokes the recognizable Harry Potter score composed by the brilliant John Williams, and perfectly captures everything you want in a Potter film — action, adventure, fantasy, romance, comedy, mystery, thrills and magic. The Half Blood Prince, in my opinion, was a return to excellence after the somewhat disappointing Order of the Phoenix. The trailer assures us that with film six, Warner Brothers isn’t holding back. The trailer showcases an impressive display of stunning images — from the opening image of Dumbledore and Harry surrounded by crashing breakers, to the Millennium Bridge in London getting destroyed by Death Eaters, to the Tom Riddle flashback, to Dumbledore whipping up a kickass fire spell. There are the images that readers of the novel will recognize — Ron snogging Lavender Brown, Draco and the Vanishing Cabinet, students paying their last respects to a beloved character. Glimpses of new faces like Slughorn and Fenrir Greyback, an epic battle between Harry and Draco, Ginny leaning in for the big smoocheroo… The film marks the franchise’s descent into its darkest movies. We see the signs in the trailer — the once-colorful poles of the Quidditch stadium, now barren and sad; the Dark Mark appearing over Hogwarts; the Weasley home destroyed; Diagon Alley terrorized by Death Eaters; the horrifying image of Katie Bell hanging limp in the sky, possessed. It’s the beginning of the end. And finally, the best part: Severus Snape, cold and unfeeling, having just murdered Harry’s hero and mentor in cold blood, uttering, in monotone, “It’s over.” A final montage of epic images, each more exciting than the last until…the familiar font and the familiar tune over the familiar dark clouds… AAHHHH! Okay bye I’m going to watch it again… Want more from CineNation? Subscribe, Like, and Follow us on iTunes, Facebook, Twitter, and Flipboard ", "child": "1046_1\t1046_2\t1046_31046_1\t1046_2\t1046_3"}