{"name": "105", "parent": "", "title": "The Celtics Beat the Warriors at Their Own Game", "sentences": [{"8910": "NBA Shootaround"}, {"9d13": "The Celtics Beat the Warriors at Their Own Game"}, {"8613": "Boston looks fearsome, the Rockets miss from deep in Utah, Greg Monroe emerges, and Pop’s long game pays off"}, {"932a": "Welcome to the NBA Shootaround, the Ringer staff’s weekly run through the league, told in riffs and GIFs."}, {"55b2": "The Celtics Are Officially Terrifying"}, {"9443": "Danny Chau: There were rotation issues in the Celtics’ bout against the Warriors on Wednesday night, but I have a feeling Isaiah Thomas didn’t mind much this time around. In the fourth quarter of Boston’s 99–86 win over Golden State, it was Steve Kerr who resorted to oddball lineups in hopes that fresh legs would make up for the sinkhole in talent he’d created by placing James Michael McAdoo and Ian Clark out on the floor together. It’d be easy to pin the Warriors’ loss on faulty strategy — especially since the game had been close nearly the entire time before the Celtics took advantage of Kerr’s experimentation — but really, the Celtics played rabid and the Warriors just didn’t seem up to task down the stretch."}, {"4b8d": "The Celtics are now the only team to have beaten the Warriors at home in both of the past two seasons. After two straight embarrassing losses to Pacific Division opponents in Phoenix and Los Angeles, the Celtics regrouped and pulled off one of their more notable wins of the season. Lord of Crunch Time Isaiah Thomas had 25 points on the game, but this one wasn’t about him. It was about hellhounds Avery Bradley and Marcus Smart freezing out the Splash Brothers; it was about Boston having a 12-point advantage on 3-pointers in the game; it was about the Celtics outdoing the best passing team in the league, assisting on over 75 percent of their field goals."}, {"9bce": "And they were led by this guy:"}, {"bbe1": "The Celtics bested the Warriors by out-Warriorsing the Warriors. It took an inspired effort from the entire rotation, but Boston proved that it has the weapons to disrupt the Warriors’ modern game plan. Add this game to the memo on how to beat the Warriors: play smart and so fucking hard that you scare Kerr into making weird decisions in the name of conserving his stars. Beat the Warriors by daring them to beat themselves."}, {"ab8e": "Do They Teach That at UCB, Blake?"}, {"1056": "This, Though? This Is Funny"}, {"2660": "Pop Literally Could Not Care Less"}, {"988f": "Jason Concepcion: Gregg Popovich does not care. Not about Kawhi Leonard’s burgeoning case for MVP. Or about running down the Warriors for the top seed in the West. Or about what anyone — fans, coaches, the commissioner — thinks when he rests players. He just doesn’t care. And if that means disrespecting the lowly Sacramento Kings, so be it. For Pop, the postseason is where the action is. And the action is the juice."}, {"5454": "Pop sat Kawhi Leonard and LaMarcus Aldridge for Wednesday night’s game against the Kings. Jonathon Simmons and David Lee started in their places. This was something of a surprise, despite being completely on brand. Kawhi’s claw heroics against the Rockets on Monday night — 39 points, a dagger 3, pinning James Harden’s late layup attempt to the backboard like a rare butterfly — had been the talk of the league for the past 48 hours. Any other coach would have played Leonard. Not Pop. The Spurs had played four straight to-the-wire games coming into the matchup against the Kings, including two that went to overtime. Dudes needed rest. And the Kings, losers of five straight, provided the perfect opportunity for a nap."}, {"3e53": "Or so it seemed! The first half of the game was the basketball version of Freaky Friday. The Spurs’ cyclonic ball movement was there, but the shots didn’t drop. Meanwhile, every piece of trash the Kings tossed up there settled softly into the net like birds returning to the nest. Tyreke Evans had 13 points on 4-of-6 shooting in the first half; Kosta Koufos (!!!) went for 12 on a series of putbacks and fuck-outta-here hook shots. When Kyle “Slowtime” Anderson scored early in the second quarter, he became the first Spur in the game to have two field goals. The Kings led 63–48 at the half and it seemed that Pop had erred."}, {"3815": "Nope! San Antonio’s shots fell like summer rain in second half. David Lee got loose inside, putting San Antonio up four with a whirling layup, and then Anderson blocked Buddy Hield’s wild layup attempt, the kind of shot that Sacramento lived off of in the first half. Patty Mills hit back-to-back jumpers (a 3, then a 2-pointer plus the foul). Then it was Danny Green’s turn to hurl consecutive daggers. The 114–104 win was San Antonio’s 50th of the season, making this the 18th consecutive year the Spurs have reached the half-century mark. Gregg Popovich worships Satan."}, {"b95e": "Maybe Robin Lopez Mistook Elfrid Payton for a Mascot"}, {"8c15": "What Happens When the Rockets’ Best Defense — Which Is Offense — Is Terrible?"}, {"462d": "Haley O’Shaughnessy: During one of Houston’s most abhorrent first-half defensive efforts all season, the Rockets saw the future. Sans George Hill and Derrick Favors, the Jazz toppled Houston, 115–108, and NASA’s favorite team discovered just how much it wants no part of Utah in the postseason. The Jazz now sit only three games behind the Rockets for the 3-seed. Prior to the game, the series between the two teams was tied, 1–1. Now the Jazz own the tiebreaker — Rodney Hood, line and sinker — and they know how to take advantage of a Rockets team that plays defense like it’s taking NyQuil to ward off spring allergies."}, {"ffd7": "The Jazz allow the third-fewest points per game in the league, with 100.5, and are a decimal point away from having the third-lowest defensive rating. But that’s essentially where Houston excels: The Rockets have beaten top stoppers San Antonio, Utah, and Golden State this season. Their strategy? Take shots, many shots, a record-breaking amount of shots, and then more shots. By far, the Rockets fire the most 3-pointers of any team, with 40.4 per game; they make the most, and they’re second place in points per game, trailing Golden State."}, {"70b4": "It didn’t work Wednesday, when the Rockets collectively shot 25 percent from deep. The matchup highlighted Houston’s flaws Gordon Ramsay–Twitter-feed-style: explicitly and outright. Eric Gordon didn’t hit a 3 until less than five minutes remained in the third; Patrick Beverley took until nearly halfway through the fourth to make his first. And James Harden, though he finished with an admirable 35, went 0-for-8 from behind the arc. Support inside from Clint Capela (19 points) and Montrezl Harrell (12 points) kept the Rockets relevant late, but a lack of necessary stops prevented any traction. Surrounded by the Warriors, Spurs, and Jazz, an off shooting night can cut no other team in title contention as deeply, and that’s haunting for Houston. Time to start hiding the NyQuil, D’Antoni."}, {"17ba": "Patrick Beverley, King of Perspective"}, {"9f12": "It’s an Old-Fashioned Sweatshirt Fight"}, {"8b67": "Sam Schube: There’s a dirty secret underlying the NBA’s post-dress-code style renaissance, and it’s this: Behind every aggressively dressed player is a stylist trying to make a mark. This, presumably, is how Isaiah Thomas and Draymond Green wound up wearing the same goofy hoodie to the Celtics-Warriors game Wednesday:"}, {"c726": "The garment in question is a black hooded sweatshirt, printed with competing images of a map of the United States, Martin Luther King, and a starred-and-striped lightning bolt. It comes from Milan-based designer Neil Barrett and retails for $569. (Import taxes included.) Normally I’d be all the way in on NBA players wearing Barrett, who’s been a certified king of this kind of bold leisurewear for more than a decade. And while I appreciate the sentiment of wearing an ultra-patriotic hoodie at this contested moment in American politics, it must be said: This sweatshirt is trash. MLK? A hero. America? 6/10, would patriate again. And lightning bolts? Reliably great. But throw them together, and you get a hoodie that’s trying too hard, worn by two players doing the same. (If you really want to signal “I am wealthy and will wear literally anything, but I have good taste,” try this one. Way better.) So: Who wore it best? No one. No one did."}, {"c64e": "Fred Jones Sighting!"}, {"4d77": "No Days Off for Miami"}, {"90ed": "Chris Ryan: March is the NBA’s own spring break. Bottom-feeders are getting into their tanks and treading toward the lottery, while the top teams just want to hit the playoffs with a healthy roster. It is a time of street clothes, when it’s not surprising for a player to make an MVP stump speech one night and then sit the next game, just for the sake of rest and relaxation. (Cancel Christmas while you’re at it, Pop.) Leave it to the team from the home of spring break to make March mean something. From the AP’s Hornets-Heat gamer:"}, {"0f8c": "“Our games matter right now,” Heat coach Erik Spoelstra said. “Let’s just rewind this to three months ago. They mattered to us then, but now we’re in a playoff chase, a hunt. As a competitor you want your team to feel all these emotions. So is there any more pressure? I don’t know. Bring it on. We want that.”"}, {"f360": "This was Spo, following a 108–101 victory over the Heat’s Southeast Division foes from North Carolina. Over the past 24 games, THE MIAMI HEAT ARE THE BEST TEAM IN THE LEAGUE. They look like a pickup team from a dystopian YMCA, stocked with Nobody Believed In Us All-Stars. James “Bloodsport” Johnson, Dion “Kobe Wade” Waiters, Hassan “Big Sean so underrated smh” Whiteside, Luke “Luke” Babbitt, and Tyler “My Contract Made Me Barf” Johnson."}, {"0813": "Over his Miami career, Spo has shown himself able to adapt to the personnel he has on hand. Usually, that personnel has been … really good. Now he’s got these spare parts playing a thoroughly modern game. The Heat are basically going shooters-with-Whiteside, and it’s working. The Heat hit 17 3s against the Hornets, with huge nights from my favorite backcourt in the league: Goran Dragic and Waiters."}, {"71aa": "Goran has regained his All-Star-level form, scoring 22 points and adding 10 assists and six boards on Wednesday night. He’s also sounding more and more like a team leader (a tough role for him when Miami was strictly Wade County):"}, {"b7af": "Miami is a game out of the playoffs, chasing D-Wade’s new team in Chicago. Let everyone else rest. The Heat are losing weight."}, {"5c2c": "From the Department of Very Unfair Things"}, {"9dbf": "The KAT and Ricky Show"}, {"1ac4": "Katie Baker: There may have been some empty seats at the Target Center on Wednesday as the Timberwolves, 11th in the West, defeated the L.A. Clippers 107–91. But the people who did show up made sure to represent Minnesota with deep authenticity. This guy has definitely burned the roof of his mouth on a Juicy Lucy and gotten kicked out of a beer league hockey game in his day."}, {"0788": "The Karl-Anthony Towns dunk he was cheering came courtesy of Lance Stephenson’s good-fundamentals bounce pass and resulted in two of Towns’s 29 points in the win over the Clippers, whose odds of home court in the playoffs grow longer by the day. The near-unicorn Towns added 14 rebounds for his 100th career double-double and generally looked like a giant, freakishly coordinated child destroying his playdates on a minihoop."}, {"863a": "Towns joined teammate Ricky Rubio (15 points, 12 assists) in finishing with a double-double; it was Rubio’s 15th on the season, though the far more interesting stat is that he hit his 42nd straight technical free throw. Rubio, whose playmaking lately has been among the league’s best, celebrated these various feats by looking at Tyus Jones the way your boo better treat you, I swear. … It also happens to be the inverse of the way Timberwolves coach Tom Thibodeau interacted with the officials all night. (I’m not certain Thibs knows that his team won.)"}, {"eb19": "Ouchie"}, {"1681": "The Wizards Can’t Ease up Just Yet"}, {"5ea4": "Schube: After a Wizards loss early this season, our own Katie Baker reported on Wednesday, coach Scotty Brooks singled out John Wall’s lackluster defensive performance. And, yes, the Wizards will need to be better than the middle-of-the-pack team they currently are on D if they want to make noise in the playoffs. But forget all that for a moment. Because Wall and the Wiz can blow the bloody doors off any arena on the offensive side of the ball, and that’s exactly what they did Wednesday against the Nuggets in a 123–113 victory. Wall had 30 points and 10 assists, and gave me reason to keep doubting that he’s actually right-handed:"}, {"4f06": "Bradley Beal added 23, Otto Porter Jr. chipped in with 22, and Bojan Bogdanovic nailed one gorgeous bank shot out of Tim Duncan’s Olde Tyme Book of Basket Ball Fundamentals. Of course, it helped that the Wiz played the Nuggets, who on this night were basically the C-plot on an episode of The Knick:"}, {"acfb": "It was ugly: lots of Jameer Nelson, who is still in the NBA, running in circles and taking contested layups, and plenty of effort from Some Plumlee Brother. The Denver Tubercular Ward made it a game in the second half, though. Jamal Murray was extremely warm, Gary Harris got straight hot, and Markieff Morris got himself tossed for tagging Mason Plumlee right in the … plumlees."}, {"ece0": "Washington fended the assault off with some useful D and plenty of ball movement, but the uneven second half served as a good reminder of Brooks’s message. The Wizards can score with anybody. How they defend, though? As the season careens toward the playoffs, that’s the thing worth watching."}, {"3d13": "Rumble, Young Man, Rumble"}, {"f078": "Witness the Greg Monroeissaince"}, {"f1fd": "Jonathan Tjarks: Giannis Antetokounmpo had another headline-making night on Wednesday, with an absurd 32 points, 13 rebounds, seven assists, four steals, and two blocks in a 104–93 victory over the Knicks. Yet, somehow, he had a lower plus-minus (plus-10) than Greg Monroe (plus-15), who has quietly turned his career around in his second season in Milwaukee. The guy the Bucks couldn’t give away at the start of the year has become one of their most valuable players: They have a net rating of plus-5.9 when he’s on the floor. Giannis checks in at plus-2.5; the now-injured Jabari Parker is all the way down at minus-2.5."}, {"a25c": "Monroe has been rejuvenated by a move to the bench, where he has been given the freedom to anchor the second-unit offense and not do as much on defense. Last season, the Bucks tried to integrate the lumbering Monroe into an aggressive scheme that asked their big men to hedge and recover on screens past the 3-point line. They weren’t forcing a square peg through a round hole so much as through a hole that didn’t even exist. But Monroe is playing closer to the basket this year, and the Bucks are funneling penetration to him rather than asking him to move his feet in space."}, {"0733": "Wednesday was another typical night for Monroe 2.0: 17 points, eight rebounds, and three assists in 29 minutes. He used his sheer mass (6-foot-11 and 265 pounds) to attack a smaller backup center (Kyle O’Quinn) in the post, an area where he’s much more efficient this season — in part because he’s not going up against starting-level centers as often. He also did a great job of rolling hard to the basket and creating passing lanes for Bucks players, as well as crashing the offensive boards and getting easy putbacks. Monroe has always been an offensive machine, and it’s much easier to see that in his new role."}, {"60d6": "The role of sixth man typically goes to shot-happy guards who struggle to defend: think Jamal Crawford, or new Houston teammates Eric Gordon and Lou Williams. Monroe, along with Zach Randolph and Enes Kanter, is blazing a trail for big men whose back-to-the-basket offensive games and inability to defend on the perimeter have turned them into anachronisms on a starting unit. Giannis has made the Leap this season, but the Bucks wouldn’t be making a playoff push if not for the reinvention of Greg Monroe."}], "content": "NBA Shootaround The Celtics Beat the Warriors at Their Own Game Boston looks fearsome, the Rockets miss from deep in Utah, Greg Monroe emerges, and Pop’s long game pays off Welcome to the NBA Shootaround, the Ringer staff’s weekly run through the league, told in riffs and GIFs. The Celtics Are Officially Terrifying Danny Chau: There were rotation issues in the Celtics’ bout against the Warriors on Wednesday night, but I have a feeling Isaiah Thomas didn’t mind much this time around. In the fourth quarter of Boston’s 99–86 win over Golden State, it was Steve Kerr who resorted to oddball lineups in hopes that fresh legs would make up for the sinkhole in talent he’d created by placing James Michael McAdoo and Ian Clark out on the floor together. It’d be easy to pin the Warriors’ loss on faulty strategy — especially since the game had been close nearly the entire time before the Celtics took advantage of Kerr’s experimentation — but really, the Celtics played rabid and the Warriors just didn’t seem up to task down the stretch. The Celtics are now the only team to have beaten the Warriors at home in both of the past two seasons. After two straight embarrassing losses to Pacific Division opponents in Phoenix and Los Angeles, the Celtics regrouped and pulled off one of their more notable wins of the season. Lord of Crunch Time Isaiah Thomas had 25 points on the game, but this one wasn’t about him. It was about hellhounds Avery Bradley and Marcus Smart freezing out the Splash Brothers; it was about Boston having a 12-point advantage on 3-pointers in the game; it was about the Celtics outdoing the best passing team in the league, assisting on over 75 percent of their field goals. And they were led by this guy: The Celtics bested the Warriors by out-Warriorsing the Warriors. It took an inspired effort from the entire rotation, but Boston proved that it has the weapons to disrupt the Warriors’ modern game plan. Add this game to the memo on how to beat the Warriors: play smart and so fucking hard that you scare Kerr into making weird decisions in the name of conserving his stars. Beat the Warriors by daring them to beat themselves. Do They Teach That at UCB, Blake? This, Though? This Is Funny Pop Literally Could Not Care Less Jason Concepcion: Gregg Popovich does not care. Not about Kawhi Leonard’s burgeoning case for MVP. Or about running down the Warriors for the top seed in the West. Or about what anyone — fans, coaches, the commissioner — thinks when he rests players. He just doesn’t care. And if that means disrespecting the lowly Sacramento Kings, so be it. For Pop, the postseason is where the action is. And the action is the juice. Pop sat Kawhi Leonard and LaMarcus Aldridge for Wednesday night’s game against the Kings. Jonathon Simmons and David Lee started in their places. This was something of a surprise, despite being completely on brand. Kawhi’s claw heroics against the Rockets on Monday night — 39 points, a dagger 3, pinning James Harden’s late layup attempt to the backboard like a rare butterfly — had been the talk of the league for the past 48 hours. Any other coach would have played Leonard. Not Pop. The Spurs had played four straight to-the-wire games coming into the matchup against the Kings, including two that went to overtime. Dudes needed rest. And the Kings, losers of five straight, provided the perfect opportunity for a nap. Or so it seemed! The first half of the game was the basketball version of Freaky Friday. The Spurs’ cyclonic ball movement was there, but the shots didn’t drop. Meanwhile, every piece of trash the Kings tossed up there settled softly into the net like birds returning to the nest. Tyreke Evans had 13 points on 4-of-6 shooting in the first half; Kosta Koufos (!!!) went for 12 on a series of putbacks and fuck-outta-here hook shots. When Kyle “Slowtime” Anderson scored early in the second quarter, he became the first Spur in the game to have two field goals. The Kings led 63–48 at the half and it seemed that Pop had erred. Nope! San Antonio’s shots fell like summer rain in second half. David Lee got loose inside, putting San Antonio up four with a whirling layup, and then Anderson blocked Buddy Hield’s wild layup attempt, the kind of shot that Sacramento lived off of in the first half. Patty Mills hit back-to-back jumpers (a 3, then a 2-pointer plus the foul). Then it was Danny Green’s turn to hurl consecutive daggers. The 114–104 win was San Antonio’s 50th of the season, making this the 18th consecutive year the Spurs have reached the half-century mark. Gregg Popovich worships Satan. Maybe Robin Lopez Mistook Elfrid Payton for a Mascot What Happens When the Rockets’ Best Defense — Which Is Offense — Is Terrible? Haley O’Shaughnessy: During one of Houston’s most abhorrent first-half defensive efforts all season, the Rockets saw the future. Sans George Hill and Derrick Favors, the Jazz toppled Houston, 115–108, and NASA’s favorite team discovered just how much it wants no part of Utah in the postseason. The Jazz now sit only three games behind the Rockets for the 3-seed. Prior to the game, the series between the two teams was tied, 1–1. Now the Jazz own the tiebreaker — Rodney Hood, line and sinker — and they know how to take advantage of a Rockets team that plays defense like it’s taking NyQuil to ward off spring allergies. The Jazz allow the third-fewest points per game in the league, with 100.5, and are a decimal point away from having the third-lowest defensive rating. But that’s essentially where Houston excels: The Rockets have beaten top stoppers San Antonio, Utah, and Golden State this season. Their strategy? Take shots, many shots, a record-breaking amount of shots, and then more shots. By far, the Rockets fire the most 3-pointers of any team, with 40.4 per game; they make the most, and they’re second place in points per game, trailing Golden State. It didn’t work Wednesday, when the Rockets collectively shot 25 percent from deep. The matchup highlighted Houston’s flaws Gordon Ramsay–Twitter-feed-style: explicitly and outright. Eric Gordon didn’t hit a 3 until less than five minutes remained in the third; Patrick Beverley took until nearly halfway through the fourth to make his first. And James Harden, though he finished with an admirable 35, went 0-for-8 from behind the arc. Support inside from Clint Capela (19 points) and Montrezl Harrell (12 points) kept the Rockets relevant late, but a lack of necessary stops prevented any traction. Surrounded by the Warriors, Spurs, and Jazz, an off shooting night can cut no other team in title contention as deeply, and that’s haunting for Houston. Time to start hiding the NyQuil, D’Antoni. Patrick Beverley, King of Perspective It’s an Old-Fashioned Sweatshirt Fight Sam Schube: There’s a dirty secret underlying the NBA’s post-dress-code style renaissance, and it’s this: Behind every aggressively dressed player is a stylist trying to make a mark. This, presumably, is how Isaiah Thomas and Draymond Green wound up wearing the same goofy hoodie to the Celtics-Warriors game Wednesday: The garment in question is a black hooded sweatshirt, printed with competing images of a map of the United States, Martin Luther King, and a starred-and-striped lightning bolt. It comes from Milan-based designer Neil Barrett and retails for $569. (Import taxes included.) Normally I’d be all the way in on NBA players wearing Barrett, who’s been a certified king of this kind of bold leisurewear for more than a decade. And while I appreciate the sentiment of wearing an ultra-patriotic hoodie at this contested moment in American politics, it must be said: This sweatshirt is trash. MLK? A hero. America? 6/10, would patriate again. And lightning bolts? Reliably great. But throw them together, and you get a hoodie that’s trying too hard, worn by two players doing the same. (If you really want to signal “I am wealthy and will wear literally anything, but I have good taste,” try this one. Way better.) So: Who wore it best? No one. No one did. Fred Jones Sighting! No Days Off for Miami Chris Ryan: March is the NBA’s own spring break. Bottom-feeders are getting into their tanks and treading toward the lottery, while the top teams just want to hit the playoffs with a healthy roster. It is a time of street clothes, when it’s not surprising for a player to make an MVP stump speech one night and then sit the next game, just for the sake of rest and relaxation. (Cancel Christmas while you’re at it, Pop.) Leave it to the team from the home of spring break to make March mean something. From the AP’s Hornets-Heat gamer: “Our games matter right now,” Heat coach Erik Spoelstra said. “Let’s just rewind this to three months ago. They mattered to us then, but now we’re in a playoff chase, a hunt. As a competitor you want your team to feel all these emotions. So is there any more pressure? I don’t know. Bring it on. We want that.” This was Spo, following a 108–101 victory over the Heat’s Southeast Division foes from North Carolina. Over the past 24 games, THE MIAMI HEAT ARE THE BEST TEAM IN THE LEAGUE. They look like a pickup team from a dystopian YMCA, stocked with Nobody Believed In Us All-Stars. James “Bloodsport” Johnson, Dion “Kobe Wade” Waiters, Hassan “Big Sean so underrated smh” Whiteside, Luke “Luke” Babbitt, and Tyler “My Contract Made Me Barf” Johnson. Over his Miami career, Spo has shown himself able to adapt to the personnel he has on hand. Usually, that personnel has been … really good. Now he’s got these spare parts playing a thoroughly modern game. The Heat are basically going shooters-with-Whiteside, and it’s working. The Heat hit 17 3s against the Hornets, with huge nights from my favorite backcourt in the league: Goran Dragic and Waiters. Goran has regained his All-Star-level form, scoring 22 points and adding 10 assists and six boards on Wednesday night. He’s also sounding more and more like a team leader (a tough role for him when Miami was strictly Wade County): Miami is a game out of the playoffs, chasing D-Wade’s new team in Chicago. Let everyone else rest. The Heat are losing weight. From the Department of Very Unfair Things The KAT and Ricky Show Katie Baker: There may have been some empty seats at the Target Center on Wednesday as the Timberwolves, 11th in the West, defeated the L.A. Clippers 107–91. But the people who did show up made sure to represent Minnesota with deep authenticity. This guy has definitely burned the roof of his mouth on a Juicy Lucy and gotten kicked out of a beer league hockey game in his day. The Karl-Anthony Towns dunk he was cheering came courtesy of Lance Stephenson’s good-fundamentals bounce pass and resulted in two of Towns’s 29 points in the win over the Clippers, whose odds of home court in the playoffs grow longer by the day. The near-unicorn Towns added 14 rebounds for his 100th career double-double and generally looked like a giant, freakishly coordinated child destroying his playdates on a minihoop. Towns joined teammate Ricky Rubio (15 points, 12 assists) in finishing with a double-double; it was Rubio’s 15th on the season, though the far more interesting stat is that he hit his 42nd straight technical free throw. Rubio, whose playmaking lately has been among the league’s best, celebrated these various feats by looking at Tyus Jones the way your boo better treat you, I swear. … It also happens to be the inverse of the way Timberwolves coach Tom Thibodeau interacted with the officials all night. (I’m not certain Thibs knows that his team won.) Ouchie The Wizards Can’t Ease up Just Yet Schube: After a Wizards loss early this season, our own Katie Baker reported on Wednesday, coach Scotty Brooks singled out John Wall’s lackluster defensive performance. And, yes, the Wizards will need to be better than the middle-of-the-pack team they currently are on D if they want to make noise in the playoffs. But forget all that for a moment. Because Wall and the Wiz can blow the bloody doors off any arena on the offensive side of the ball, and that’s exactly what they did Wednesday against the Nuggets in a 123–113 victory. Wall had 30 points and 10 assists, and gave me reason to keep doubting that he’s actually right-handed: Bradley Beal added 23, Otto Porter Jr. chipped in with 22, and Bojan Bogdanovic nailed one gorgeous bank shot out of Tim Duncan’s Olde Tyme Book of Basket Ball Fundamentals. Of course, it helped that the Wiz played the Nuggets, who on this night were basically the C-plot on an episode of The Knick: It was ugly: lots of Jameer Nelson, who is still in the NBA, running in circles and taking contested layups, and plenty of effort from Some Plumlee Brother. The Denver Tubercular Ward made it a game in the second half, though. Jamal Murray was extremely warm, Gary Harris got straight hot, and Markieff Morris got himself tossed for tagging Mason Plumlee right in the … plumlees. Washington fended the assault off with some useful D and plenty of ball movement, but the uneven second half served as a good reminder of Brooks’s message. The Wizards can score with anybody. How they defend, though? As the season careens toward the playoffs, that’s the thing worth watching. Rumble, Young Man, Rumble Witness the Greg Monroeissaince Jonathan Tjarks: Giannis Antetokounmpo had another headline-making night on Wednesday, with an absurd 32 points, 13 rebounds, seven assists, four steals, and two blocks in a 104–93 victory over the Knicks. Yet, somehow, he had a lower plus-minus (plus-10) than Greg Monroe (plus-15), who has quietly turned his career around in his second season in Milwaukee. The guy the Bucks couldn’t give away at the start of the year has become one of their most valuable players: They have a net rating of plus-5.9 when he’s on the floor. Giannis checks in at plus-2.5; the now-injured Jabari Parker is all the way down at minus-2.5. Monroe has been rejuvenated by a move to the bench, where he has been given the freedom to anchor the second-unit offense and not do as much on defense. Last season, the Bucks tried to integrate the lumbering Monroe into an aggressive scheme that asked their big men to hedge and recover on screens past the 3-point line. They weren’t forcing a square peg through a round hole so much as through a hole that didn’t even exist. But Monroe is playing closer to the basket this year, and the Bucks are funneling penetration to him rather than asking him to move his feet in space. Wednesday was another typical night for Monroe 2.0: 17 points, eight rebounds, and three assists in 29 minutes. He used his sheer mass (6-foot-11 and 265 pounds) to attack a smaller backup center (Kyle O’Quinn) in the post, an area where he’s much more efficient this season — in part because he’s not going up against starting-level centers as often. He also did a great job of rolling hard to the basket and creating passing lanes for Bucks players, as well as crashing the offensive boards and getting easy putbacks. Monroe has always been an offensive machine, and it’s much easier to see that in his new role. The role of sixth man typically goes to shot-happy guards who struggle to defend: think Jamal Crawford, or new Houston teammates Eric Gordon and Lou Williams. Monroe, along with Zach Randolph and Enes Kanter, is blazing a trail for big men whose back-to-the-basket offensive games and inability to defend on the perimeter have turned them into anachronisms on a starting unit. Giannis has made the Leap this season, but the Bucks wouldn’t be making a playoff push if not for the reinvention of Greg Monroe. ", "child": "105_1\t105_2\t105_3\t105_4\t105_5\t105_6\t105_7\t105_8\t105_9\t105_10\t105_11\t105_12\t105_13\t105_14\t105_15\t105_16\t105_17\t105_18\t105_19\t105_20\t105_21\t105_22\t105_23\t105_24"}