{"name": "1060", "parent": "", "title": "The United Story Isn’t About Customer Service. It’s About Class Warfare.", "sentences": [{"59a4": "The United Story Isn’t About Customer Service. It’s About Class Warfare."}, {"db04": "When corporations can openly beat their customers and deny them service, why would they even bother trying to be nice?"}, {"6a64": "Fly the horrific skies"}, {"ea17": "You’ve probably by now seen the video of the doctor who was physically beaten and removed from a United flight because United wanted the seat for its employees. If you haven’t, here it is. Be warned: it’s an incredibly disturbing video:"}, {"f8c2": "And here’s the story, from Lucas Aulbach at the Courier-Journal:"}, {"77ac": "Bridges said the man became “very upset” and said that he was a doctor who needed to see patients at a hospital in the morning. The manager told him that security would be called if he did not leave willingly, Bridges said, and the man said he was calling his lawyer. One security official came and spoke with him, and then another security officer came when he still refused. Then, she said, a third security official came on the plane and threw the passenger against the armrest before dragging him out of the plane. The man was able to get back on the plane after initially being taken off — his face was bloody and he seemed disoriented, Bridges said, and he ran to the back of the plane. Passengers asked to get off the plane as a medical crew came on to deal with the passenger, she said, and passengers were then told to go back to the gate so that officials could “tidy up” the plane before taking off."}, {"f053": "This is a horrifying story, and it’s still unfolding on social media. I’ve noticed something about the reaction to United. People have been making jokes about the incident on Twitter. Which is okay! Jokes are part of the news cycle. They’re how we process things as a culture. And particularly in this case, the jokes are very telling. This one is a perfect example of the tone and tenor of the comedy I’ve been seeing:"}, {"2fad": "Then there’s the business world’s response to the news, which is the exact opposite of everyone else’s response to the news:"}, {"a5e4": "And then the content mines immediately chimed in with their hot-take-clickbait. The most horrifying example of the form is this Yahoo Finance story by Ethan Wolff-Mann, headlined “How to reduce the chances of getting dragged off your United flight.” An excerpt:"}, {"500b": "In plain language under Rule 25 — on page 35 if you print it out — the agreement says exactly what happens if the flight is oversold. “If there are not enough volunteers, other Passengers may be denied boarding involuntarily,” the language reads. (Of course, the deplaned man was not denied boarding, he was already boarded.) The language continues however, shining light on how these “other Passengers” are chosen. It’s not random, it’s “in accordance with UA’s boarding priority.” That means that if you have a higher fare class, have a complex itinerary, have status (e.g. gold or platinum), have checked in early, or are a frequent flier, you are less likely to be asked to take the next flight. Even if it’s just a frequent flier card that you never use, it might save you from being forcibly dragged off a plane."}, {"d6d6": "Any kind of priority is better than no priority, when it comes to not getting forcibly removed from a plane."}, {"5447": "So we’ve got the jokes about air travel being a hellish dystopia for anyone not in first class. We’ve got Wall Street cashing in on the metrics while ignoring the human horror of the story. And we’ve got “helpful” news stories explaining that in order to not have this happen to you, it’s wise to exercise some sort of privilege. It should be clear to anyone who’s paying attention that this story is not about customer service. It’s about income inequality. Helaine Olen posted a very good thread on Twitter about this:"}, {"92b4": "When you get down to it, like everything else in America today, this is about the haves and the have-nots. If you’re in first class, you don’t need to worry about shock troops coming and beating you until you get out of the seat that you bought. If you’re not in first class, you’re on your own. If you’re in the top one percent on Wall Street, you turn a tidy profit off the whole ordeal. This is what class warfare looks like."}, {"686d": "I wrote about this topic last month. Visit any department store in America and you’ll see that the corporatization of America has led to a ghastly pursuit for profits over all else. Big Box retailers aren’t interested in providing customer service anymore, they’re interested in profits. This is why shopping at corporate chains has become an awful experience where you have to answer six obnoxious questions about email lists and company credit cards every time you try to check out. You won’t be arrested for refusing to sign up for a Macy’s card, but you will be treated like garbage. Only people who can afford to shop at high-end stores — or people lucky enough to live in quality economies like Seattle that support independent retailers — get to enjoy real customer service anymore."}, {"b030": "The situation is heightened on airlines for a couple of reasons. The first, obviously, is the security state that ballooned in size after 9/11. But the other reason is deregulation. Phillip Longman and Lina Khan wrote a great piece for Washington Monthly in 2012 about what trickle-down policies like deregulation have done to the airline experience for non-wealthy passengers:"}, {"f504": "But now we find ourselves at a moment when nearly all the promises of the airline deregulators have clearly proved false. If you’re a member of the creative class who rarely does business in the nation’s industrial heartland or visits relatives there, you might not notice the magnitude of economic disruption being caused by lost airline service and skyrocketing fares. But if you are in the business of making and trading stuff beyond derivatives and concepts, you probably have to go to places like Cincinnati, Pittsburgh, Memphis, St. Louis, or Minneapolis, and you know firsthand how hard it has become to do business these days in such major heartland cities, which are increasingly cut off from each other and from the global economy."}, {"8559": "And it’s about to get worse. Despite a wave of mergers that is fast concentrating control in the hands of three giant carriers, the industry remains essentially insolvent. Absent any coherent outcry, the directors of these private corporations remain free to respond to the crisis in the manner of an electrical utility company that, when it runs short of money, simply cuts off power to the neighborhoods of its own choosing."}, {"371d": "The video that made its way across the internet today is what “getting worse” looks like. Here’s the thing: when you support trickle-down economic policies that put profits before people, this is what you get. Low-wage jobs, deregulation, and tax cuts for huge corporations result in a culture in which businesses enjoy a tremendous amount of power over ordinary citizens."}, {"ec69": "So what can we do about this? I wish I had easy answers for you, but it’s pretty obvious that an online petition isn’t going to resolve the United situation — especially since Wall Street views it as a net win and is rewarding United for its overbooking situation. No, it’s going to take a lot of work to put the power back in the hands of the people."}, {"4939": "We must support middle-out policies like higher wages for everyone, higher taxes for corporations and the wealthy, and sensible regulations on business. If every American feels like they have a hand in America’s success, we’ll see less tolerance for intolerable actions like what happened on that United flight. Then, when we’ve moved the balance more toward something resembling equity, we can talk about commonsense ideas like breaking up monopolies and penalizing malicious businesses like United for harming Americans who do everything right and play by the rules."}, {"5fb7": "Maybe the worst thing about that video is how completely believable it was for anyone who’s flown over the last few years. We’ve all experienced the awfulness of flying, and we recognize it as maybe the most literal manifestation of America’s current class situation: the few sit up front in comfort while the many experience more and more discomfort in the back of the plane. We lose inches of legroom, we’re charged more and more for our carry-ons, and we’re offered less and less in return. This situation isn’t going to get any better until we stand up and demand that things change. This isn’t about one airline — hell, it’s not even about air travel. It’s about class in America, and it’s time to demand our fair share."}, {"fa57": "Comments"}, {"401a": "comments"}, {"e682": "Originally published at civicskunkworks.com on April 10, 2017."}], "content": "The United Story Isn’t About Customer Service. It’s About Class Warfare. When corporations can openly beat their customers and deny them service, why would they even bother trying to be nice? Fly the horrific skies You’ve probably by now seen the video of the doctor who was physically beaten and removed from a United flight because United wanted the seat for its employees. If you haven’t, here it is. Be warned: it’s an incredibly disturbing video: And here’s the story, from Lucas Aulbach at the Courier-Journal: Bridges said the man became “very upset” and said that he was a doctor who needed to see patients at a hospital in the morning. The manager told him that security would be called if he did not leave willingly, Bridges said, and the man said he was calling his lawyer. One security official came and spoke with him, and then another security officer came when he still refused. Then, she said, a third security official came on the plane and threw the passenger against the armrest before dragging him out of the plane. The man was able to get back on the plane after initially being taken off — his face was bloody and he seemed disoriented, Bridges said, and he ran to the back of the plane. Passengers asked to get off the plane as a medical crew came on to deal with the passenger, she said, and passengers were then told to go back to the gate so that officials could “tidy up” the plane before taking off. This is a horrifying story, and it’s still unfolding on social media. I’ve noticed something about the reaction to United. People have been making jokes about the incident on Twitter. Which is okay! Jokes are part of the news cycle. They’re how we process things as a culture. And particularly in this case, the jokes are very telling. This one is a perfect example of the tone and tenor of the comedy I’ve been seeing: Then there’s the business world’s response to the news, which is the exact opposite of everyone else’s response to the news: And then the content mines immediately chimed in with their hot-take-clickbait. The most horrifying example of the form is this Yahoo Finance story by Ethan Wolff-Mann, headlined “How to reduce the chances of getting dragged off your United flight.” An excerpt: In plain language under Rule 25 — on page 35 if you print it out — the agreement says exactly what happens if the flight is oversold. “If there are not enough volunteers, other Passengers may be denied boarding involuntarily,” the language reads. (Of course, the deplaned man was not denied boarding, he was already boarded.) The language continues however, shining light on how these “other Passengers” are chosen. It’s not random, it’s “in accordance with UA’s boarding priority.” That means that if you have a higher fare class, have a complex itinerary, have status (e.g. gold or platinum), have checked in early, or are a frequent flier, you are less likely to be asked to take the next flight. Even if it’s just a frequent flier card that you never use, it might save you from being forcibly dragged off a plane. Any kind of priority is better than no priority, when it comes to not getting forcibly removed from a plane. So we’ve got the jokes about air travel being a hellish dystopia for anyone not in first class. We’ve got Wall Street cashing in on the metrics while ignoring the human horror of the story. And we’ve got “helpful” news stories explaining that in order to not have this happen to you, it’s wise to exercise some sort of privilege. It should be clear to anyone who’s paying attention that this story is not about customer service. It’s about income inequality. Helaine Olen posted a very good thread on Twitter about this: When you get down to it, like everything else in America today, this is about the haves and the have-nots. If you’re in first class, you don’t need to worry about shock troops coming and beating you until you get out of the seat that you bought. If you’re not in first class, you’re on your own. If you’re in the top one percent on Wall Street, you turn a tidy profit off the whole ordeal. This is what class warfare looks like. I wrote about this topic last month. Visit any department store in America and you’ll see that the corporatization of America has led to a ghastly pursuit for profits over all else. Big Box retailers aren’t interested in providing customer service anymore, they’re interested in profits. This is why shopping at corporate chains has become an awful experience where you have to answer six obnoxious questions about email lists and company credit cards every time you try to check out. You won’t be arrested for refusing to sign up for a Macy’s card, but you will be treated like garbage. Only people who can afford to shop at high-end stores — or people lucky enough to live in quality economies like Seattle that support independent retailers — get to enjoy real customer service anymore. The situation is heightened on airlines for a couple of reasons. The first, obviously, is the security state that ballooned in size after 9/11. But the other reason is deregulation. Phillip Longman and Lina Khan wrote a great piece for Washington Monthly in 2012 about what trickle-down policies like deregulation have done to the airline experience for non-wealthy passengers: But now we find ourselves at a moment when nearly all the promises of the airline deregulators have clearly proved false. If you’re a member of the creative class who rarely does business in the nation’s industrial heartland or visits relatives there, you might not notice the magnitude of economic disruption being caused by lost airline service and skyrocketing fares. But if you are in the business of making and trading stuff beyond derivatives and concepts, you probably have to go to places like Cincinnati, Pittsburgh, Memphis, St. Louis, or Minneapolis, and you know firsthand how hard it has become to do business these days in such major heartland cities, which are increasingly cut off from each other and from the global economy. And it’s about to get worse. Despite a wave of mergers that is fast concentrating control in the hands of three giant carriers, the industry remains essentially insolvent. Absent any coherent outcry, the directors of these private corporations remain free to respond to the crisis in the manner of an electrical utility company that, when it runs short of money, simply cuts off power to the neighborhoods of its own choosing. The video that made its way across the internet today is what “getting worse” looks like. Here’s the thing: when you support trickle-down economic policies that put profits before people, this is what you get. Low-wage jobs, deregulation, and tax cuts for huge corporations result in a culture in which businesses enjoy a tremendous amount of power over ordinary citizens. So what can we do about this? I wish I had easy answers for you, but it’s pretty obvious that an online petition isn’t going to resolve the United situation — especially since Wall Street views it as a net win and is rewarding United for its overbooking situation. No, it’s going to take a lot of work to put the power back in the hands of the people. We must support middle-out policies like higher wages for everyone, higher taxes for corporations and the wealthy, and sensible regulations on business. If every American feels like they have a hand in America’s success, we’ll see less tolerance for intolerable actions like what happened on that United flight. Then, when we’ve moved the balance more toward something resembling equity, we can talk about commonsense ideas like breaking up monopolies and penalizing malicious businesses like United for harming Americans who do everything right and play by the rules. Maybe the worst thing about that video is how completely believable it was for anyone who’s flown over the last few years. We’ve all experienced the awfulness of flying, and we recognize it as maybe the most literal manifestation of America’s current class situation: the few sit up front in comfort while the many experience more and more discomfort in the back of the plane. We lose inches of legroom, we’re charged more and more for our carry-ons, and we’re offered less and less in return. This situation isn’t going to get any better until we stand up and demand that things change. This isn’t about one airline — hell, it’s not even about air travel. It’s about class in America, and it’s time to demand our fair share. Comments comments Originally published at civicskunkworks.com on April 10, 2017. ", "child": "1060_1\t1060_2\t1060_3\t1060_4\t1060_5\t1060_6\t1060_7\t1060_8\t1060_9\t1060_10\t1060_11\t1060_12\t1060_13\t1060_14\t1060_15\t1060_16\t1060_17\t1060_18\t1060_19\t1060_20\t1060_21\t1060_22\t1060_23\t1060_24\t1060_251060_1\t1060_2\t1060_3\t1060_4\t1060_5\t1060_6\t1060_7\t1060_8\t1060_9\t1060_10\t1060_11\t1060_12\t1060_13\t1060_14\t1060_15\t1060_16\t1060_17\t1060_18\t1060_19\t1060_20\t1060_21\t1060_22\t1060_23\t1060_24\t1060_25"}