{"name": "1061", "parent": "", "title": "House Republican lashes out at constituent for saying his salary was paid by taxpayers", "sentences": [{"6aca": "House Republican lashes out at constituent for saying his salary was paid by taxpayers"}, {"7390": "‘Bullcrap, I pay for myself.’"}, {"7482": "As a U.S. representative, Markwayne Mullin (R-OK) earns a salary of $174,000 per year. He seems to be confused about where that money comes from, however."}, {"83fb": "During a town hall event earlier this week, the third term congressman said the notion taxpayers pay his salary is “bullcrap.”"}, {"1088": "“You said you pay for me to do this — bullcrap, I pay for myself,” Mullin, who reportedly owns multiple companies under the umbrella of Mullin Plumbing, said. “I pay enough taxes where before I ever got there, and continue to for my company and pay my own salary.”"}, {"444f": "As the town hall attendees began to express outrage, Mullin continued: “This is a service. No one pays me to go. I do it as an honor, as a service.”"}, {"9604": "Mullin, who served on the Trump campaign’s Native American Coalition, later posted a video on Twitter where he seemed to obliquely address the controversy his remarks created."}, {"8ca0": "“It is an honor to be a true citizen legislator, just like our founders set it up,” he said. “So when I’m making decisions, it’s not based on any type of political career. It’s based upon what’s best for the generations coming up behind us.”"}, {"1145": "Despite the lip service he paid to future generations, Mullin is an outspoken critic of the Environmental Protection Agency. During a town hall last month, he said, “Without question, I’m not a fan of the EPA. The EPA has overstepped their boundaries each and every day. They get into areas they shouldn’t be involved in….the states have the right to regulate themselves if they have the ability to do so — and we do because we have the Department of Environmental Quality.”"}, {"c3fa": "“I would have never run for office, if it wasn’t for the fact that my biggest threat to my company was the federal government and the overreach of the EPA. They’ve gone too far and it’s time for them to be pulled back in,” he added."}, {"1a11": "Mullin has also advocated for the outright elimination of aid programs for poor Americans. In 2013, he argued that food stamp fraud is rife because he once saw a physically fit couple using an EBT card at a grocery store."}, {"fa2a": "Mullin isn’t the first House Republican to recently express confusion about the fact he’s paid by and serves taxpayers. Discussing House Intelligence Chair Devin Nunes’ clumsy attempt to validate Trump’s wiretap accusation during an MSNBC appearance last month, Rep. Ted Yoho (R-FL) said, “You’ve got to keep in mind who he works for. He works for the president, and he answers to the president.”"}], "content": "House Republican lashes out at constituent for saying his salary was paid by taxpayers ‘Bullcrap, I pay for myself.’ As a U.S. representative, Markwayne Mullin (R-OK) earns a salary of $174,000 per year. He seems to be confused about where that money comes from, however. During a town hall event earlier this week, the third term congressman said the notion taxpayers pay his salary is “bullcrap.” “You said you pay for me to do this — bullcrap, I pay for myself,” Mullin, who reportedly owns multiple companies under the umbrella of Mullin Plumbing, said. “I pay enough taxes where before I ever got there, and continue to for my company and pay my own salary.” As the town hall attendees began to express outrage, Mullin continued: “This is a service. No one pays me to go. I do it as an honor, as a service.” Mullin, who served on the Trump campaign’s Native American Coalition, later posted a video on Twitter where he seemed to obliquely address the controversy his remarks created. “It is an honor to be a true citizen legislator, just like our founders set it up,” he said. “So when I’m making decisions, it’s not based on any type of political career. It’s based upon what’s best for the generations coming up behind us.” Despite the lip service he paid to future generations, Mullin is an outspoken critic of the Environmental Protection Agency. During a town hall last month, he said, “Without question, I’m not a fan of the EPA. The EPA has overstepped their boundaries each and every day. They get into areas they shouldn’t be involved in….the states have the right to regulate themselves if they have the ability to do so — and we do because we have the Department of Environmental Quality.” “I would have never run for office, if it wasn’t for the fact that my biggest threat to my company was the federal government and the overreach of the EPA. They’ve gone too far and it’s time for them to be pulled back in,” he added. Mullin has also advocated for the outright elimination of aid programs for poor Americans. In 2013, he argued that food stamp fraud is rife because he once saw a physically fit couple using an EBT card at a grocery store. Mullin isn’t the first House Republican to recently express confusion about the fact he’s paid by and serves taxpayers. Discussing House Intelligence Chair Devin Nunes’ clumsy attempt to validate Trump’s wiretap accusation during an MSNBC appearance last month, Rep. Ted Yoho (R-FL) said, “You’ve got to keep in mind who he works for. He works for the president, and he answers to the president.” ", "child": "1061_1\t1061_2\t1061_3\t1061_4\t1061_5\t1061_6\t1061_7\t1061_8\t1061_9\t1061_10\t1061_11\t1061_12\t1061_13\t1061_14\t1061_15\t1061_16\t1061_17\t1061_18\t1061_19\t1061_20\t1061_21\t1061_22\t1061_23"}