{"name": "1066", "parent": "", "title": "Immigrants to Republicans: Meet us before you deport us", "sentences": [{"45f4": "Immigrants to Republicans: Meet us before you deport us"}, {"35d3": "But GOP lawmakers are nowhere to be found."}, {"7012": "Bnyad Sharef. CREDIT: Tennessee Immigrant and Refugee Rights Coalition"}, {"356d": "As President Donald Trump continues to crack down on immigration policy, immigrants and refugees affected by Trump’s recent executive orders are using this week’s congressional recess to call on Republican lawmakers to “be a check on President Trump.”"}, {"9737": "Organizers took part in a “We Are All America” national day of action to confront lawmakers about harmful immigration legislation that will result in discriminatory policies they consider to be unjust."}, {"eeeb": "Protesters took to state capitols and congressional offices this week, holding signs and chanting the “No Ban, No Wall, No Raids” slogan to express their disapproval of the travel ban that bars entry to people from seven Muslim-majority countries and the nationwide raids that have put nearly 700 immigrants in deportation proceedings, according to U.S. immigration officials."}, {"796f": "Bnyad Sharef. CREDIT: Tennessee Immigrant and Refugee Rights Coalition"}, {"bccb": "Twenty-year-old Bnyad Sharef, whose family is from Iraq and now lives in Tennessee, was one of at least 750 people on airplanes headed for the United States when Trump’s executive order barring travel from people from seven countries went into effect."}, {"349a": "“During our transit in Cairo, we were not allowed off our flight to JFK and we were deported back to Iraq,” Sharef told ThinkProgress."}, {"452d": "He and his family were allowed to come back into the United States only after the Muslim ban was temporarily lifted and also thanks to intense media attention and advocacy pressure."}, {"2c13": "Sharef’s father worked for the U.S. government between 2003 and 2004 and was eligible to relocate to the United States as a result."}, {"fb2e": "Sharef, a budding computer engineer, visited Sen. Bob Corker’s (R-TN) office this week in the hopes of talking to him about how his family was affected by this policy, which Corker supported. Corker, chairman of the Senate Foreign Relations Committee, has criticized Trump for the poor implementation of the Muslim ban, but did not oppose the order itself."}, {"51cb": "“It helped that they see a living example of the destructive policies that’s happening.”"}, {"c1e2": "Sharef and other organizers with the advocacy group Tennessee Immigrant and Refugee Rights Coalition (TIRRC) brought 100 posters to Corker’s office, but were unsuccessful in meeting the senator, who — like many other Republican lawmakers — has not held town halls during the congressional recess to meet with his constituents. Instead, Sharef met with a staffer."}, {"d9c6": "“I wanted to voice my opinion and take my story to them,” Sharef said. “They were surprised that there was someone affected directly by this executive order that is right now in Nashville. It helped that they see a living example of the destructive policies that’s happening. I think it was great that I got out there to voice my opinion.”"}, {"0e3a": "Sharef added that Corker’s staff had been “respectful,” but did not give him an answer when he asked whether the senator would oppose the White House’s new Muslim ban that’s due to come out next week."}, {"dcf3": "“I don’t feel good about this, obviously,” Sharef said. “I feel like they weren’t ready to face the outcomes of their policies, to face the results that the policies will produce.”"}, {"04c8": "I feel like they weren’t ready to face the outcomes of their policies."}, {"6589": "Across state lines in Georgia, other advocates and immigrants took to the state capitol building to show how harsh state policies could cause as much harm as the recent executive orders."}, {"97d7": "Asma Elhuni, a legislative intern for State Rep. Brenda Lopez, led a group of 12 immigrant students hoping to convince state representatives to remove their support from a litany of anti-immigrant bills."}, {"73ba": "Those pieces of legislation include marking up driver’s licenses with a “non-citizen” symbol; stripping federal funding from colleges that declare themselves as “sanctuary spaces” to protect undocumented immigrants living in fear of deportation; and releasing student records that could reveal immigration status."}, {"133d": "Before entering the capitol building, Elhuni encouraged the students by telling them they each belong in the United States, regardless of their immigration status."}, {"2739": "“We should not base people’s humanity off of papers.”"}, {"3755": "“I wanted them to know that they are taxpayers and that the Capitol building was their building and that they have every right to be there,” Elhuni told ThinkProgress. “Despite the fact that they cannot vote, they are still supposed to be represented by these people.”"}, {"9906": "The group met with four Republican legislators, one of whom they were able to convince to vote against marking up the driver’s license bill. Elhuni said that the other three Republicans “seemed like they were sympathetic,” but still ultimately voted along partisan lines."}, {"5e93": "Although the visit was more or less unsuccessful in changing minds, Elhuni believes that exposure to immigrants made lawmakers more aware of the impact of their policies."}, {"adcc": "“We should not base people’s humanity off of papers,” Elhuni said."}, {"7179": "In other states, immigrants and refugees affected by Trump’s executive order also failed to elicit much sympathy from Republican lawmakers. Zalmay Niazy, an Afghan who once worked as a translator for the U.S. military, confronted Sen. Chuck Grassley (R-IA) this week, but did not receive very clear guidance as to whether Grassley would defend the revised travel ban."}, {"1518": "Across the country, many Republican lawmakers have not attended town halls to answer for Trump’s extreme agenda. Republicans who do meet with constituents have been unable to answer questions from children who would rather see federal funding support PBS shows instead of a border wall and people who would die without health care. Some lawmakers have gone so far as to say they weren’t holding town halls because of security threats without providing evidence. Meanwhile, constituents have resorted to showing up at town halls with cardboard cutouts of their lawmakers."}], "content": "Immigrants to Republicans: Meet us before you deport us But GOP lawmakers are nowhere to be found. Bnyad Sharef. CREDIT: Tennessee Immigrant and Refugee Rights Coalition As President Donald Trump continues to crack down on immigration policy, immigrants and refugees affected by Trump’s recent executive orders are using this week’s congressional recess to call on Republican lawmakers to “be a check on President Trump.” Organizers took part in a “We Are All America” national day of action to confront lawmakers about harmful immigration legislation that will result in discriminatory policies they consider to be unjust. Protesters took to state capitols and congressional offices this week, holding signs and chanting the “No Ban, No Wall, No Raids” slogan to express their disapproval of the travel ban that bars entry to people from seven Muslim-majority countries and the nationwide raids that have put nearly 700 immigrants in deportation proceedings, according to U.S. immigration officials. Bnyad Sharef. CREDIT: Tennessee Immigrant and Refugee Rights Coalition Twenty-year-old Bnyad Sharef, whose family is from Iraq and now lives in Tennessee, was one of at least 750 people on airplanes headed for the United States when Trump’s executive order barring travel from people from seven countries went into effect. “During our transit in Cairo, we were not allowed off our flight to JFK and we were deported back to Iraq,” Sharef told ThinkProgress. He and his family were allowed to come back into the United States only after the Muslim ban was temporarily lifted and also thanks to intense media attention and advocacy pressure. Sharef’s father worked for the U.S. government between 2003 and 2004 and was eligible to relocate to the United States as a result. Sharef, a budding computer engineer, visited Sen. Bob Corker’s (R-TN) office this week in the hopes of talking to him about how his family was affected by this policy, which Corker supported. Corker, chairman of the Senate Foreign Relations Committee, has criticized Trump for the poor implementation of the Muslim ban, but did not oppose the order itself. “It helped that they see a living example of the destructive policies that’s happening.” Sharef and other organizers with the advocacy group Tennessee Immigrant and Refugee Rights Coalition (TIRRC) brought 100 posters to Corker’s office, but were unsuccessful in meeting the senator, who — like many other Republican lawmakers — has not held town halls during the congressional recess to meet with his constituents. Instead, Sharef met with a staffer. “I wanted to voice my opinion and take my story to them,” Sharef said. “They were surprised that there was someone affected directly by this executive order that is right now in Nashville. It helped that they see a living example of the destructive policies that’s happening. I think it was great that I got out there to voice my opinion.” Sharef added that Corker’s staff had been “respectful,” but did not give him an answer when he asked whether the senator would oppose the White House’s new Muslim ban that’s due to come out next week. “I don’t feel good about this, obviously,” Sharef said. “I feel like they weren’t ready to face the outcomes of their policies, to face the results that the policies will produce.” I feel like they weren’t ready to face the outcomes of their policies. Across state lines in Georgia, other advocates and immigrants took to the state capitol building to show how harsh state policies could cause as much harm as the recent executive orders. Asma Elhuni, a legislative intern for State Rep. Brenda Lopez, led a group of 12 immigrant students hoping to convince state representatives to remove their support from a litany of anti-immigrant bills. Those pieces of legislation include marking up driver’s licenses with a “non-citizen” symbol; stripping federal funding from colleges that declare themselves as “sanctuary spaces” to protect undocumented immigrants living in fear of deportation; and releasing student records that could reveal immigration status. Before entering the capitol building, Elhuni encouraged the students by telling them they each belong in the United States, regardless of their immigration status. “We should not base people’s humanity off of papers.” “I wanted them to know that they are taxpayers and that the Capitol building was their building and that they have every right to be there,” Elhuni told ThinkProgress. “Despite the fact that they cannot vote, they are still supposed to be represented by these people.” The group met with four Republican legislators, one of whom they were able to convince to vote against marking up the driver’s license bill. Elhuni said that the other three Republicans “seemed like they were sympathetic,” but still ultimately voted along partisan lines. Although the visit was more or less unsuccessful in changing minds, Elhuni believes that exposure to immigrants made lawmakers more aware of the impact of their policies. “We should not base people’s humanity off of papers,” Elhuni said. In other states, immigrants and refugees affected by Trump’s executive order also failed to elicit much sympathy from Republican lawmakers. Zalmay Niazy, an Afghan who once worked as a translator for the U.S. military, confronted Sen. Chuck Grassley (R-IA) this week, but did not receive very clear guidance as to whether Grassley would defend the revised travel ban. Across the country, many Republican lawmakers have not attended town halls to answer for Trump’s extreme agenda. Republicans who do meet with constituents have been unable to answer questions from children who would rather see federal funding support PBS shows instead of a border wall and people who would die without health care. Some lawmakers have gone so far as to say they weren’t holding town halls because of security threats without providing evidence. Meanwhile, constituents have resorted to showing up at town halls with cardboard cutouts of their lawmakers. ", "child": "1066_1\t1066_2\t1066_3\t1066_4"}