{"name": "1069", "parent": "", "title": "Louisiana senator’s town hall goes completely off the rails", "sentences": [{"fd41": "Louisiana senator’s town hall goes completely off the rails"}, {"19c3": "Bill Cassidy’s plans for a quiet presentation were quickly foiled by hundreds of angry constituents."}, {"f17a": "METAIRIE, LOUISIANA — “It was fun,” Republican Senator Bill Cassidy told reporters as he emerged from a town hall in which hundreds of angry constituents heckled and booed him for the better part of an hour."}, {"15ce": "Cassidy had intended to present a PowerPoint on his proposed legislation to replace the Affordable Care Act (ACA) and respond to written questions selected from index cards. That didn’t happen."}, {"2959": "Instead, the senator was greeted with shouts of “shame” and exited an hour later to chants of “do your job.”"}, {"cbd0": "Protesters shouted the senator down when he attempted to refer to his PowerPoint slides. “We’ve already read it, we want to ask questions!” audience members yelled."}, {"6047": "Dozens of people stood up and turned their backs to him until he agreed to take questions from the audience."}, {"5eca": "Cassidy later told reporters this was the first time he had seen more than a hundred people at a town hall. The first-term senator, like many of his colleagues in Congress, is facing protests over his support of President Donald Trump’s cabinet nominees and his party’s agenda — in particular their plan to roll back health care reform, potentially leaving millions of Americans suddenly uninsured."}, {"0c6e": "Republicans’ town halls all over the country have erupted in anger. Some lawmakers are avoiding their constituents entirely. One Congressman even sneaked away from his own event when faced with questions about the Affordable Care Act."}, {"8d22": "Hundreds of protesters waited for hours outside the East Jefferson Parish Library, but only 200 could get in. CREDIT: Aviva Shen"}, {"44cd": "Cassidy came close to ducking the same level of attention. The meeting was scheduled on a weekday afternoon, when most people are at work or picking up their children from school. It also coincided with the beginning of a major Mardi Gras parade in nearby New Orleans, which drew thousands of onlookers and bogged down traffic for miles."}, {"cbed": "Kenny Francis, a pre-kindergarten teacher at Schaumburg Elementary in New Orleans, didn’t think this planning was an accident. He had been fruitlessly calling Cassidy’s office every day for weeks demanding he oppose the nomination of Education Secretary Betsy DeVos. Then his friend texted him a picture of a mailer advertising Cassidy’s town hall."}, {"7614": "“It took me about a week and a half to get anyone in any of Cassidy’s offices to confirm it was actually happening,” he told ThinkProgress. Once he did, he created a Facebook event for the town hall that quickly took off. By Tuesday, thousands of people had said they would attend."}, {"1f05": "Francis’ primary goal was to hold Cassidy accountable for voting to confirm DeVos, but as a teacher, he’s worried about other repercussions the Republican agenda will have on his students."}, {"cd96": "“I know I have students whose families are not legal,” he said. “I know I have parents who are very concerned about what’s going to happen to them and their kids.”"}, {"e84f": "Francis’ school was also devastated by the tornadoes that unexpectedly swept through the region earlier this month."}, {"ea30": "“A lot of students lost their homes, a lot of parents lost their jobs, their transportation. There’s a lot of hardship happening right now,” he said."}, {"cb47": "Cassidy, who denies the human role in climate change, has been touring tornado damage around southern Louisiana as he holds town halls. Francis said he found Cassidy’s professed concern about tornado victims “offensive.”"}, {"c1d0": "“He had the nerve to talk about how he wants to help with the tornado recovery,” Francis said. “It is offensive to me to hear him talk about how he wants to help those families when you want to take away their health care that literally allows them to be able to make sure their kids stay healthy.”"}, {"3854": "CREDIT: Aviva Shen"}, {"b04a": "“The majority of our students qualify for free or reduced lunch. The majority of those families also have coverage for their children through Medicaid,” he said. “So what is going to happen to the literally thousands of kids that have coverage through Medicaid when they repeal the ACA? We’re just going to leave them without health care?”"}, {"0b37": "Throughout the town hall, Cassidy repeatedly attempted to pitch his ACA replacement, which would allow states to maintain the ACA if they wanted it, adopt a watered down version, or opt out entirely, creating a patchwork of health care access varying by geography. It would also likely make insurance premiums rise, as the bill would maintain some of the ACA’s popular consumer protections while removing the individual mandate and tax credits that make them affordable."}, {"24a8": "It also isn’t clear if Republican support will coalesce around his bill — or if they will wait to repeal the ACA until they are ready to implement a replacement."}, {"ccd2": "“Will you vote to repeal Obamacare with or without this in place?” one attendee, Sean Marx, demanded to know at one point. A chorus of people chanted “Yes or no?” as Cassidy stayed silent and waited for the man to be escorted from the room by sheriff’s deputies."}, {"4362": "As he was led out of the room, Marx yelled, “2020 — you’re done!”"}, {"a1cf": "Aviva Shen, a former ThinkProgress editor, is now a freelance writer in New Orleans focused on criminal justice."}], "content": "Louisiana senator’s town hall goes completely off the rails Bill Cassidy’s plans for a quiet presentation were quickly foiled by hundreds of angry constituents. METAIRIE, LOUISIANA — “It was fun,” Republican Senator Bill Cassidy told reporters as he emerged from a town hall in which hundreds of angry constituents heckled and booed him for the better part of an hour. Cassidy had intended to present a PowerPoint on his proposed legislation to replace the Affordable Care Act (ACA) and respond to written questions selected from index cards. That didn’t happen. Instead, the senator was greeted with shouts of “shame” and exited an hour later to chants of “do your job.” Protesters shouted the senator down when he attempted to refer to his PowerPoint slides. “We’ve already read it, we want to ask questions!” audience members yelled. Dozens of people stood up and turned their backs to him until he agreed to take questions from the audience. Cassidy later told reporters this was the first time he had seen more than a hundred people at a town hall. The first-term senator, like many of his colleagues in Congress, is facing protests over his support of President Donald Trump’s cabinet nominees and his party’s agenda — in particular their plan to roll back health care reform, potentially leaving millions of Americans suddenly uninsured. Republicans’ town halls all over the country have erupted in anger. Some lawmakers are avoiding their constituents entirely. One Congressman even sneaked away from his own event when faced with questions about the Affordable Care Act. Hundreds of protesters waited for hours outside the East Jefferson Parish Library, but only 200 could get in. CREDIT: Aviva Shen Cassidy came close to ducking the same level of attention. The meeting was scheduled on a weekday afternoon, when most people are at work or picking up their children from school. It also coincided with the beginning of a major Mardi Gras parade in nearby New Orleans, which drew thousands of onlookers and bogged down traffic for miles. Kenny Francis, a pre-kindergarten teacher at Schaumburg Elementary in New Orleans, didn’t think this planning was an accident. He had been fruitlessly calling Cassidy’s office every day for weeks demanding he oppose the nomination of Education Secretary Betsy DeVos. Then his friend texted him a picture of a mailer advertising Cassidy’s town hall. “It took me about a week and a half to get anyone in any of Cassidy’s offices to confirm it was actually happening,” he told ThinkProgress. Once he did, he created a Facebook event for the town hall that quickly took off. By Tuesday, thousands of people had said they would attend. Francis’ primary goal was to hold Cassidy accountable for voting to confirm DeVos, but as a teacher, he’s worried about other repercussions the Republican agenda will have on his students. “I know I have students whose families are not legal,” he said. “I know I have parents who are very concerned about what’s going to happen to them and their kids.” Francis’ school was also devastated by the tornadoes that unexpectedly swept through the region earlier this month. “A lot of students lost their homes, a lot of parents lost their jobs, their transportation. There’s a lot of hardship happening right now,” he said. Cassidy, who denies the human role in climate change, has been touring tornado damage around southern Louisiana as he holds town halls. Francis said he found Cassidy’s professed concern about tornado victims “offensive.” “He had the nerve to talk about how he wants to help with the tornado recovery,” Francis said. “It is offensive to me to hear him talk about how he wants to help those families when you want to take away their health care that literally allows them to be able to make sure their kids stay healthy.” CREDIT: Aviva Shen “The majority of our students qualify for free or reduced lunch. The majority of those families also have coverage for their children through Medicaid,” he said. “So what is going to happen to the literally thousands of kids that have coverage through Medicaid when they repeal the ACA? We’re just going to leave them without health care?” Throughout the town hall, Cassidy repeatedly attempted to pitch his ACA replacement, which would allow states to maintain the ACA if they wanted it, adopt a watered down version, or opt out entirely, creating a patchwork of health care access varying by geography. It would also likely make insurance premiums rise, as the bill would maintain some of the ACA’s popular consumer protections while removing the individual mandate and tax credits that make them affordable. It also isn’t clear if Republican support will coalesce around his bill — or if they will wait to repeal the ACA until they are ready to implement a replacement. “Will you vote to repeal Obamacare with or without this in place?” one attendee, Sean Marx, demanded to know at one point. A chorus of people chanted “Yes or no?” as Cassidy stayed silent and waited for the man to be escorted from the room by sheriff’s deputies. As he was led out of the room, Marx yelled, “2020 — you’re done!” Aviva Shen, a former ThinkProgress editor, is now a freelance writer in New Orleans focused on criminal justice. ", "child": "1069_1\t1069_2\t1069_3\t1069_4\t1069_5\t1069_6\t1069_7\t1069_8\t1069_9\t1069_10\t1069_111069_1\t1069_2\t1069_3\t1069_4\t1069_5\t1069_6\t1069_7\t1069_8\t1069_9\t1069_10\t1069_11"}