{"name": "1070", "parent": "", "title": "7-year-old Arkansas boy has epic confrontation with Republican senator", "sentences": [{"b81c": "7-year-old Arkansas boy has epic confrontation with Republican senator"}, {"58d9": "“Toby. I am Toby.”"}, {"33a6": "Toby, age 7, asks Sen. Tom Cotton (R-AR) a question CREDIT: Screenshot"}, {"44ac": "Thousands of people attended a town hall on Wednesday night with Arkansas Sen. Tom Cotton. But one stood out: A 7-year-old boy named Toby."}, {"8cfc": "Cotton called on Toby, who was sitting in the balcony, to ask the last question in what had been a raucous event."}, {"3955": "Toby objected to Trump’s rhetoric on Mexico, telling Cotton that there are people in Arkansas who like Mexicans, like “me and my grandma.” The crowd went wild."}, {"8961": "Woman who says Obamacare saved her life confronts GOP senator on repeal“I will die. That is not hyperbole. I will die.”thinkprogress.org"}, {"03c8": "As the crowd stood and cheered, Toby blasted Trump for planning to cut funds for “PBS Kids, just to make a wall.”"}, {"2927": "“He shouldn’t do all that stuff for just a wall,” Toby concluded."}, {"f684": "Cotton responded by telling Toby about the need to protect Americans from Mexican drug cartels, as the crowd booed and heckled him. He never addressed Toby’s concerns about PBS funding."}, {"cf24": "“Ladies and gentlemen, I’m sorry, I have another appointment,” Cotton then told the crowd, ending the event."}, {"0d9d": "Trump’s wall along the Mexican border is expected to cost up to $21.6 billion and will be paid for by taxpayers, not Mexico. PBS, meanwhile, received $445 million in federal funding last year."}, {"5d1b": "That means you could fully funds PBS for more than 40 years for the cost of Trump’s border wall."}, {"d63f": "Trump has not submitted a formal budget proposal, but is reportedly considering “dramatic” cuts to PBS and other public broadcasting outlets."}, {"f6d6": "PBS Kids produces high-quality educational television programs like Daniel Tiger, Super Why, and Sid the Science Kid that are watched by millions of children."}], "content": "7-year-old Arkansas boy has epic confrontation with Republican senator “Toby. I am Toby.” Toby, age 7, asks Sen. Tom Cotton (R-AR) a question CREDIT: Screenshot Thousands of people attended a town hall on Wednesday night with Arkansas Sen. Tom Cotton. But one stood out: A 7-year-old boy named Toby. Cotton called on Toby, who was sitting in the balcony, to ask the last question in what had been a raucous event. Toby objected to Trump’s rhetoric on Mexico, telling Cotton that there are people in Arkansas who like Mexicans, like “me and my grandma.” The crowd went wild. Woman who says Obamacare saved her life confronts GOP senator on repeal“I will die. That is not hyperbole. I will die.”thinkprogress.org As the crowd stood and cheered, Toby blasted Trump for planning to cut funds for “PBS Kids, just to make a wall.” “He shouldn’t do all that stuff for just a wall,” Toby concluded. Cotton responded by telling Toby about the need to protect Americans from Mexican drug cartels, as the crowd booed and heckled him. He never addressed Toby’s concerns about PBS funding. “Ladies and gentlemen, I’m sorry, I have another appointment,” Cotton then told the crowd, ending the event. Trump’s wall along the Mexican border is expected to cost up to $21.6 billion and will be paid for by taxpayers, not Mexico. PBS, meanwhile, received $445 million in federal funding last year. That means you could fully funds PBS for more than 40 years for the cost of Trump’s border wall. Trump has not submitted a formal budget proposal, but is reportedly considering “dramatic” cuts to PBS and other public broadcasting outlets. PBS Kids produces high-quality educational television programs like Daniel Tiger, Super Why, and Sid the Science Kid that are watched by millions of children. ", "child": "1070_1\t1070_2\t1070_3\t1070_4\t1070_5\t1070_6\t1070_7\t1070_8\t1070_9\t1070_10\t1070_11\t1070_12\t1070_13\t1070_14\t1070_15\t1070_16\t1070_17\t1070_18\t1070_19\t1070_20\t1070_21\t1070_22\t1070_23\t1070_24\t1070_25"}