{"name": "1071", "parent": "", "title": "Montana wants to charge abortion doctors with homicide", "sentences": [{"95ed": "Montana wants to charge abortion doctors with homicide"}, {"d79b": "Even in a medical emergency."}, {"7711": "Credit: iStock"}, {"68f1": "An extreme anti-abortion bill in Montana is poised to deal a major blow to abortion rights in the state, should the governor sign it."}, {"b036": "The bill, S.B. 282, defines fetal viability at 24 weeks’ gestation and prevents abortions past that point, even in a medical emergency. A pregnant person whose fetus stands a 50 percent chance of survival outside the womb would be forced to undergo a C-section or induced labor. Additionally, under the proposed law, a doctor who provides an abortion past 24 weeks could face charges of homicide."}, {"1bed": "The bill passed the Montana House on April 6 and enjoyed final passage in the Senate five days later. It will now be sent to Governor Steve Bullock (D)."}, {"789c": "“It is the policy of the state to preserve and protect the lives all human beings and to provide protection for the viable human life,” said Rep. Theresa Manzella (R), who carried the bill on the floor."}, {"f3d2": "Manzella and her conservative colleagues are leveraging S.B. 282 to advocate for questionably viable fetuses at the expense of (undeniably viable) pregnant women. Most people who have later term abortions do so out of necessity, not flippancy. Discounting this reality oversimplifies the complexities of such a situation and infantilizes people by confiscating their bodily autonomy. What’s more, forcing a patient to undergo a major surgical procedure like a C-section out of political ideology — not medical necessity — is dangerous and unethical."}, {"6359": "Not every legislator agrees with Manzella. “I don’t think the legislature should stand in the way of a doctor’s ability to decide what is best for his patient,” Rep. Virginia Court (D) told Montana Public Radio. “This is the right of a woman and her doctor, in the privacy of the doctor’s office. These decisions should be made between the two of them with open, careful, honest, truthful consults. Not by the body of the Legislature.”"}, {"06db": "The majority of America is now pro-choiceHow did that happen?thinkprogress.org"}, {"dc07": "It is unclear whether Governor Bullock, a Democrat, will sign the bill. He has previously gone on record in defense of women’s right to choose, saying, “As governor, I will defend a women’s right to choice. I think these are complicated and difficult decisions, but they shouldn’t be made by the government. They should be made by women and their doctors.”"}, {"159a": "This fetal viability bill is the latest in a string of attempts to curtail abortion in Montana. The state has a rich history of introducing anti-choice measures, from fetal anesthesia bills to restricting performance of abortions to licensed physicians to redefining life at conception."}, {"00f0": "Nevertheless, according to the Guttmacher Institute, Montana “does not have any of the major types of abortion restrictions — such as waiting periods, mandated parental involvement or limitations on publicly funded abortions — often found in other states.” And NARAL Pro-Choice America grades the state as having “strongly protected reproductive rights access.”"}, {"4d88": "In other words, try as they might, Montana legislators haven’t been wildly successful in getting anti-choice laws on the books."}, {"edc5": "Montana’s anti-abortion crusade (albeit an unsuccessful one) isn’t an isolated case; it fits neatly within an alarming national trend. Legislators across the country, emboldened by an anti-choice president and administration, are doing their best to undermine abortion access however they can."}, {"4633": "Dangerous 20-week abortion bans are advancing in several states, including Tennessee, Missouri, Iowa, Ohio, and more. Others are getting more creative with their tactics: Kansas passed a regulation requiring changes to fonts used on abortion information sheets, Arizona will require doctors who perform abortions to try and “revive” fetuses if they show signs of life, and Arkansas will force doctors to investigate abortion patients. Other states, including Florida, Texas, and Oklahoma, have likewise tried to make abortion a felony but failed."}, {"67a8": "Whether Montana will officially join the ranks of hostile states remains to be seen. But if Governor Bullock signs S.B. 282, he will undoubtedly set a dangerous and irresponsible precedent."}], "content": "Montana wants to charge abortion doctors with homicide Even in a medical emergency. Credit: iStock An extreme anti-abortion bill in Montana is poised to deal a major blow to abortion rights in the state, should the governor sign it. The bill, S.B. 282, defines fetal viability at 24 weeks’ gestation and prevents abortions past that point, even in a medical emergency. A pregnant person whose fetus stands a 50 percent chance of survival outside the womb would be forced to undergo a C-section or induced labor. Additionally, under the proposed law, a doctor who provides an abortion past 24 weeks could face charges of homicide. The bill passed the Montana House on April 6 and enjoyed final passage in the Senate five days later. It will now be sent to Governor Steve Bullock (D). “It is the policy of the state to preserve and protect the lives all human beings and to provide protection for the viable human life,” said Rep. Theresa Manzella (R), who carried the bill on the floor. Manzella and her conservative colleagues are leveraging S.B. 282 to advocate for questionably viable fetuses at the expense of (undeniably viable) pregnant women. Most people who have later term abortions do so out of necessity, not flippancy. Discounting this reality oversimplifies the complexities of such a situation and infantilizes people by confiscating their bodily autonomy. What’s more, forcing a patient to undergo a major surgical procedure like a C-section out of political ideology — not medical necessity — is dangerous and unethical. Not every legislator agrees with Manzella. “I don’t think the legislature should stand in the way of a doctor’s ability to decide what is best for his patient,” Rep. Virginia Court (D) told Montana Public Radio. “This is the right of a woman and her doctor, in the privacy of the doctor’s office. These decisions should be made between the two of them with open, careful, honest, truthful consults. Not by the body of the Legislature.” The majority of America is now pro-choiceHow did that happen?thinkprogress.org It is unclear whether Governor Bullock, a Democrat, will sign the bill. He has previously gone on record in defense of women’s right to choose, saying, “As governor, I will defend a women’s right to choice. I think these are complicated and difficult decisions, but they shouldn’t be made by the government. They should be made by women and their doctors.” This fetal viability bill is the latest in a string of attempts to curtail abortion in Montana. The state has a rich history of introducing anti-choice measures, from fetal anesthesia bills to restricting performance of abortions to licensed physicians to redefining life at conception. Nevertheless, according to the Guttmacher Institute, Montana “does not have any of the major types of abortion restrictions — such as waiting periods, mandated parental involvement or limitations on publicly funded abortions — often found in other states.” And NARAL Pro-Choice America grades the state as having “strongly protected reproductive rights access.” In other words, try as they might, Montana legislators haven’t been wildly successful in getting anti-choice laws on the books. Montana’s anti-abortion crusade (albeit an unsuccessful one) isn’t an isolated case; it fits neatly within an alarming national trend. Legislators across the country, emboldened by an anti-choice president and administration, are doing their best to undermine abortion access however they can. Dangerous 20-week abortion bans are advancing in several states, including Tennessee, Missouri, Iowa, Ohio, and more. Others are getting more creative with their tactics: Kansas passed a regulation requiring changes to fonts used on abortion information sheets, Arizona will require doctors who perform abortions to try and “revive” fetuses if they show signs of life, and Arkansas will force doctors to investigate abortion patients. Other states, including Florida, Texas, and Oklahoma, have likewise tried to make abortion a felony but failed. Whether Montana will officially join the ranks of hostile states remains to be seen. But if Governor Bullock signs S.B. 282, he will undoubtedly set a dangerous and irresponsible precedent. ", "child": "1071_1\t1071_2\t1071_3"}