{"name": "1073", "parent": "", "title": "Paid CNN pundit calls Trump ‘the Martin Luther King of health care’", "sentences": [{"712f": "Paid CNN pundit calls Trump ‘the Martin Luther King of health care’"}, {"015f": "Jeffrey Lord strikes again, and CNN keeps paying him."}, {"0524": "CREDIT: CNN/Screenshot"}, {"0f64": "It’s been more than a year since then-candidate Donald Trump personally recommended that CNN hire Jeffrey Lord as a pundit who would defend him. Trump is now president, and Lord continues to offer ridiculous positions while collecting a paycheck for doing so. Thursday morning was no exception."}, {"23ca": "“Think of President Trump of the Martin Luther King of health care,” Lord offered. Lord was defending President Trump’s purported plan to force congressional Democrats to negotiate changes to health care by withholding Obamacare subsidies that help poor people afford medical services. Essentially, Trump would be taking people’s health care hostage to force Democrats to agree to changes that would also be bad for poor people — a fact that Trump has admitted."}, {"9f9c": "In Lord’s mind, this hostage taking would be no different from King’s nonviolence activism. “Dr. King kept putting people in the streets in harm’s way to put the pressure on so the bill would be finally introduced,” he explained. “That’s what finally worked.”"}, {"5021": "Symone Sanders, who appeared with Lord on CNN, wasn’t having it. “You understand that Dr. King was marching for civil rights,” she said, “because people that looked like me were being beaten. Dogs were being sicced on them. Basic human rights were being withheld from these people merely because of the color of the skin. So let’s not equate Dr. Martin Luther King, Jr., a humanitarian and Nobel peace-prize winner, to the vagina-grabbing president, Donald Trump.”"}, {"e87e": "Lord tried to defend his point but Sanders shut him down. “What Donald Trump is doing is he is in over his head. He doesn’t understand health care is a complicated issue. He just arrived here; thank you, most of us have been here. And he doesn’t understand these are people’s lives, so again, I implore the president to take a humane approach.”"}, {"fcfe": "Lord has a long litany of bizarre racial comments. Earlier this week, he compared the United Airlines passenger who was violently dragged off a plane after refusing to relinquish his seat to “Rodney King and that infamous video of his being beaten by L.A. cops,” explaining, “What we didn’t see was what the precipitating incident was.” In February, he compared the Congressional Black Caucus (CBC) to the KKK by imagining David Duke being elected to Congress and forming a congressional white caucus. That was after earlier that same day, he defended Trump telling reporter April Ryan that she, as a black woman, should be the one to set up a meeting with between him and the CBC because they were probably friends of hers. And he did so by attacking CNN for covering it, the very CNN that was paying him to be on CNN to say that!"}, {"0424": "In December, he said, “There are no people of color in this country; there are only Americans.” He November, he tried to distract from Trump’s relationships to white supremacists by repeating the false claim that Hillary Clinton had been endorsed by the Community Party, a fake news story that originated on NewsBusters. That same week, he claimed that racial justice groups like Black Lives Matter and La Raza were actually responsible for propagating the racism they experience by provoking white Neo-Nazi groups into existence."}, {"5866": "And Trump just loves that his hand-picked surrogate is still raking in the cash for his odious remarks. In December, Trump applauded Lord because “he fights so hard.” He called it “so unfair” the way “they stack up seven to one” on CNN. “But he handles it,” Trump said."}, {"2d45": "Lord may, in fact, be doing his job. In a recent profile, CNN head Jeff Zucker described the network’s paid pro-Trump panelists as “characters in a drama,” bragging that people know Lord’s name."}], "content": "Paid CNN pundit calls Trump ‘the Martin Luther King of health care’ Jeffrey Lord strikes again, and CNN keeps paying him. CREDIT: CNN/Screenshot It’s been more than a year since then-candidate Donald Trump personally recommended that CNN hire Jeffrey Lord as a pundit who would defend him. Trump is now president, and Lord continues to offer ridiculous positions while collecting a paycheck for doing so. Thursday morning was no exception. “Think of President Trump of the Martin Luther King of health care,” Lord offered. Lord was defending President Trump’s purported plan to force congressional Democrats to negotiate changes to health care by withholding Obamacare subsidies that help poor people afford medical services. Essentially, Trump would be taking people’s health care hostage to force Democrats to agree to changes that would also be bad for poor people — a fact that Trump has admitted. In Lord’s mind, this hostage taking would be no different from King’s nonviolence activism. “Dr. King kept putting people in the streets in harm’s way to put the pressure on so the bill would be finally introduced,” he explained. “That’s what finally worked.” Symone Sanders, who appeared with Lord on CNN, wasn’t having it. “You understand that Dr. King was marching for civil rights,” she said, “because people that looked like me were being beaten. Dogs were being sicced on them. Basic human rights were being withheld from these people merely because of the color of the skin. So let’s not equate Dr. Martin Luther King, Jr., a humanitarian and Nobel peace-prize winner, to the vagina-grabbing president, Donald Trump.” Lord tried to defend his point but Sanders shut him down. “What Donald Trump is doing is he is in over his head. He doesn’t understand health care is a complicated issue. He just arrived here; thank you, most of us have been here. And he doesn’t understand these are people’s lives, so again, I implore the president to take a humane approach.” Lord has a long litany of bizarre racial comments. Earlier this week, he compared the United Airlines passenger who was violently dragged off a plane after refusing to relinquish his seat to “Rodney King and that infamous video of his being beaten by L.A. cops,” explaining, “What we didn’t see was what the precipitating incident was.” In February, he compared the Congressional Black Caucus (CBC) to the KKK by imagining David Duke being elected to Congress and forming a congressional white caucus. That was after earlier that same day, he defended Trump telling reporter April Ryan that she, as a black woman, should be the one to set up a meeting with between him and the CBC because they were probably friends of hers. And he did so by attacking CNN for covering it, the very CNN that was paying him to be on CNN to say that! In December, he said, “There are no people of color in this country; there are only Americans.” He November, he tried to distract from Trump’s relationships to white supremacists by repeating the false claim that Hillary Clinton had been endorsed by the Community Party, a fake news story that originated on NewsBusters. That same week, he claimed that racial justice groups like Black Lives Matter and La Raza were actually responsible for propagating the racism they experience by provoking white Neo-Nazi groups into existence. And Trump just loves that his hand-picked surrogate is still raking in the cash for his odious remarks. In December, Trump applauded Lord because “he fights so hard.” He called it “so unfair” the way “they stack up seven to one” on CNN. “But he handles it,” Trump said. Lord may, in fact, be doing his job. In a recent profile, CNN head Jeff Zucker described the network’s paid pro-Trump panelists as “characters in a drama,” bragging that people know Lord’s name. ", "child": "1073_1\t1073_2\t1073_3\t1073_4\t1073_5\t1073_6\t1073_7"}