{"name": "1074", "parent": "", "title": "Report: To expand substance abuse treatment, embrace Obamacare", "sentences": [{"acfb": "Report: To expand substance abuse treatment, embrace Obamacare"}, {"5962": "A new report on substance abuse treatment recommends building on the successes of the ACA."}, {"1bb0": "OxyContin pills arranged for a photo at a pharmacy in Montpelier, Vt. With an overdose epidemic worsening, nearly one-third of Medicare beneficiaries received at least one prescription for commonly abused opioids. CREDIT: AP/Toby Talbot"}, {"7526": "A report from the Center on Budget and Policy Priorities released on Tuesday makes the case for why states and the Trump administration should build on the Affordable Care Act’s’s success, rather than tear it down."}, {"7646": "The ACA expanded treatment by requiring that both Medicaid and individual marketplace plans cover basic mental health and addiction services. More than 1 million people receive treatment for mental health and substance abuse disorders under the ACA’s Medicaid expansion, according to a recent estimate from professors at New York University and Harvard Medical School."}, {"0877": "The share of people with substance use or mental health disorders who were hospitalized but uninsured fell from 20 percent to 5 percent from 2013 to mid-2015, according to Health and Human Services data. Medicaid expansion helped many of the states most affected by the opioid epidemic, according to the CBPP report. Kentucky experienced a 700 percent increase in Medicaid beneficiaries using substance abuse treatment services after expanding Medicaid in 2014."}, {"fd17": "Before the ACA required coverage for addiction treatment, it was much more difficult for people with struggling with substance abuse to get the treatment they needed, unless they were economically advantaged or their state had generous mental health and substance abuse treatment programs, said Peggy Bailey, author of the CBPP report and the center’s director of health integration."}, {"627f": "“Treatment providers that targeted low-income populations relied on grants and local dollars to be able exist. It created a really unstable provider base for low-income people, which we are still trying to overcome,” Bailey said. “Providers have to bill to Medicaid and a lot goes into that, but it isn’t about that person, and if that person was lucky enough to have providers in their community where they could get treatment. It catered to people who could pay on their own or had private insurance.”"}, {"0b29": "Trumpcare would ‘cause enormous human suffering’ for people with addictionsPeople who once received treatment for substance abuse will no longer be able to afford it.thinkprogress.org"}, {"474e": "According to a U.S. Surgeon General report released last year, the ACA has expanded access to addiction services. Research shows that greater investment in substance abuse treatment also reduces costs in the criminal justice system and social services. Investments in substance abuse treatment also reduce hospital readmissions, the spread of HIV and hepatitis, and incidents of drug-related overdoses, according to the report."}, {"4d7f": "Trumpcare, which Republican leaders are attempting to revive, would restructure the Medicaid financing system by converting it into a block grant, an effective cut to the program. These cuts would be particularly harmful in states struggling with opioid abuse. West Virginia and New Hampshire, which have the two highest rates of 2015 drug overdose deaths, would have 9.8 percent and 15.1 percent of their total federal and state Medicaid budgets cut, respectively, over 10 years, according to the CBPP report."}, {"46ff": "To expand substance abuse treatment, the CBPP report recommends that the White House press the 19 states that have not adopted Medicaid expansion to reconsider. The administration could also push for Congress to appropriate funds so that new expansion states would get a 100 percent federal match for the first few years of their expansion program."}, {"7d33": "The ACA assumed all states would expand Medicaid in 2014 and planned to move from 100 percent to 90 percent match rates, but the U.S. Supreme Court gave states the OK not to adopt Medicaid expansion in 2012. Thus, there was no way to stop the shift down to 90 percent. States are now at a 95 percent match rate."}, {"13e3": "“You need to make sure insurance stays with people throughout the course of their condition.”"}, {"bd22": "“The Obama administration tried to get additional appropriations so that states that expanded late still got 100 percent match but those never passed Congress,” Bailey said. “Congress and the administration could move something like this forward and it would be a great incentive to states, especially states like Mississippi and Alabama where paying even 5 or 10 percent of the costs would be a burden.”"}, {"2d91": "The report also advises against tying work requirements to Medicaid, an option Republican leaders provided to states as part of Trumpcare. For people who are struggling with substance abuse, getting on the road to recovery is often a full-time job."}, {"952d": "“Unfortunately, substance use disorder is not a linear disease and people sometimes relapse. You need to make sure insurance stays with people throughout the course of their condition,” Bailey said. “If they happen to relapse, that may cause them to lose their job. That job loss may help someone figure out they need to go back into treatment, but if they don’t have health insurance, we’ve created another obstacle for them to get care.”"}], "content": "Report: To expand substance abuse treatment, embrace Obamacare A new report on substance abuse treatment recommends building on the successes of the ACA. OxyContin pills arranged for a photo at a pharmacy in Montpelier, Vt. With an overdose epidemic worsening, nearly one-third of Medicare beneficiaries received at least one prescription for commonly abused opioids. CREDIT: AP/Toby Talbot A report from the Center on Budget and Policy Priorities released on Tuesday makes the case for why states and the Trump administration should build on the Affordable Care Act’s’s success, rather than tear it down. The ACA expanded treatment by requiring that both Medicaid and individual marketplace plans cover basic mental health and addiction services. More than 1 million people receive treatment for mental health and substance abuse disorders under the ACA’s Medicaid expansion, according to a recent estimate from professors at New York University and Harvard Medical School. The share of people with substance use or mental health disorders who were hospitalized but uninsured fell from 20 percent to 5 percent from 2013 to mid-2015, according to Health and Human Services data. Medicaid expansion helped many of the states most affected by the opioid epidemic, according to the CBPP report. Kentucky experienced a 700 percent increase in Medicaid beneficiaries using substance abuse treatment services after expanding Medicaid in 2014. Before the ACA required coverage for addiction treatment, it was much more difficult for people with struggling with substance abuse to get the treatment they needed, unless they were economically advantaged or their state had generous mental health and substance abuse treatment programs, said Peggy Bailey, author of the CBPP report and the center’s director of health integration. “Treatment providers that targeted low-income populations relied on grants and local dollars to be able exist. It created a really unstable provider base for low-income people, which we are still trying to overcome,” Bailey said. “Providers have to bill to Medicaid and a lot goes into that, but it isn’t about that person, and if that person was lucky enough to have providers in their community where they could get treatment. It catered to people who could pay on their own or had private insurance.” Trumpcare would ‘cause enormous human suffering’ for people with addictionsPeople who once received treatment for substance abuse will no longer be able to afford it.thinkprogress.org According to a U.S. Surgeon General report released last year, the ACA has expanded access to addiction services. Research shows that greater investment in substance abuse treatment also reduces costs in the criminal justice system and social services. Investments in substance abuse treatment also reduce hospital readmissions, the spread of HIV and hepatitis, and incidents of drug-related overdoses, according to the report. Trumpcare, which Republican leaders are attempting to revive, would restructure the Medicaid financing system by converting it into a block grant, an effective cut to the program. These cuts would be particularly harmful in states struggling with opioid abuse. West Virginia and New Hampshire, which have the two highest rates of 2015 drug overdose deaths, would have 9.8 percent and 15.1 percent of their total federal and state Medicaid budgets cut, respectively, over 10 years, according to the CBPP report. To expand substance abuse treatment, the CBPP report recommends that the White House press the 19 states that have not adopted Medicaid expansion to reconsider. The administration could also push for Congress to appropriate funds so that new expansion states would get a 100 percent federal match for the first few years of their expansion program. The ACA assumed all states would expand Medicaid in 2014 and planned to move from 100 percent to 90 percent match rates, but the U.S. Supreme Court gave states the OK not to adopt Medicaid expansion in 2012. Thus, there was no way to stop the shift down to 90 percent. States are now at a 95 percent match rate. “You need to make sure insurance stays with people throughout the course of their condition.” “The Obama administration tried to get additional appropriations so that states that expanded late still got 100 percent match but those never passed Congress,” Bailey said. “Congress and the administration could move something like this forward and it would be a great incentive to states, especially states like Mississippi and Alabama where paying even 5 or 10 percent of the costs would be a burden.” The report also advises against tying work requirements to Medicaid, an option Republican leaders provided to states as part of Trumpcare. For people who are struggling with substance abuse, getting on the road to recovery is often a full-time job. “Unfortunately, substance use disorder is not a linear disease and people sometimes relapse. You need to make sure insurance stays with people throughout the course of their condition,” Bailey said. “If they happen to relapse, that may cause them to lose their job. That job loss may help someone figure out they need to go back into treatment, but if they don’t have health insurance, we’ve created another obstacle for them to get care.” ", "child": "1074_1\t1074_2\t1074_3"}