{"name": "1076", "parent": "", "title": "Trumpcare is back and it’s still a total disaster", "sentences": [{"01e0": "Trumpcare is back and it’s still a total disaster"}, {"f818": "“I have to do healthcare first,” Trump told Fox Business Network."}, {"849d": "President Donald Trump speaks during a meeting with business leaders in the State Department Library of the Eisenhower Executive Office Building on the White House complex in Washington. CREDIT: AP/Evan Vucci"}, {"f09c": "Republican leaders’ first attempt to pass Trumpcare was rushed, secretive, and extremely partisan, but the second attempt has been all of these things, multiplied three times."}, {"176d": "Republicans still don’t have revised text for the legislation, and the deal they had last week is still tentative. There also aren’t any signs that moderates and hard-right conservatives are any closer to arriving at a deal than they were weeks ago."}, {"cb48": "Although the hard-right conservative Freedom Caucus has a very specific set of priorities for the legislation, the moderate Republican Tuesday Group is much less cohesive, which makes it difficult for them to negotiate, Vox reported. Still, President Donald Trump has not given up the health care fight. Trump told Fox Business Network’s Maria Bartiromo that he wants to pass a health care bill before moving on to tax reform."}, {"eb08": "“We are going to have a phenomenal tax reform, but I have to do health care first. I want to do it first to really get it right,” Trump said. “I don’t want to put deadlines. Healthcare is going to happen, at some point. Now, if does not happen fast enough, I’ll start the taxes.”"}, {"6386": "Most of the members of the Tuesday Group voted to fully repeal Obamacare in 2015. But now, thanks to a Congressional Budget Office analysis, the group has a much better idea of how economically disastrous a repeal and replace bill would be for many Americans. Some moderates still want to keep the essential health benefits requirement (EHBs) and Medicaid expansion under Obamacare, while the more conservative Freedom Caucus wants to get rid of EHBs and protections for people with pre-existing conditions."}, {"10dc": "To make matters worse for Republicans, the Trump administration struggles to count votes because they don’t understand the dynamics in Congress, Politico reported. The Republicans leading the effort to revive health care — which includes Office of Management and Budget Director Mick Mulvaney, Health and Human Services Secretary Tom Price, and Vice President Mike Pence — lost internal party elections as Congressmen."}, {"bbfe": "Despite occasional statements stressing the urgency of a health care vote, the president hasn’t given any estimates of a timeline. Republicans in leadership positions have been far more vague about the negotiations process. Republicans gave deadlines for passing a health care bill in March but are reluctant to do so now. House Ways and Means Chair Kevin Brady (R-TX) said he didn’t know if there were negotiations and said ideas were “being floated from all directions.” House Speaker Paul Ryan (R-WI) has described the talks as going through “conceptual stages.”"}, {"21c8": "At the pace the health care talks are going, it’s unlikely that Republicans will have time to pass their health care bill, tackle an issue as complex as tax reform, pass the budget, and pass major infrastructure legislation before the August recess. And there are signs that after Republicans’ health care failure, the party is in poor shape to take on other major legislation."}, {"0407": "There is also increased tension between the White House and House Republicans. During a meeting last week, White House Chief of Staff Reince Priebus allegedly told House Speaker Ryan another failure could be “detrimental to Ryan’s speakership.” Several White House officials reportedly pressured Ryan to attempt another vote last week."}, {"edcb": "Communication with Democrats has been nonexistent, unless you count ominous warnings to Democratic leaders that Obamacare will collapse on its own. Unlike the beginning of the process to pass Obamacare, when Democrats made a serious attempt to reach out to Republicans, Republicans have completely shut Democrats out of the development of the healthcare bill. The tone has grown more partisan as Republicans use the possibility of negotiations with Democrats as a threat against other Republicans, rather than consider it a natural part of the legislative process."}, {"bb9f": "It’s clear that many Republicans are aware of how unpopular Trumpcare is. Since members of Congress will leave for Easter recess, Republican lawmakers in swing districts who voted for Trumpcare have a decision to make. They can face their constituents and explain their position on health care or simply avoid their constituents. Most of these lawmakers chose the latter option, according to USA Today’s analysis. Rep. Leonard Lance (R-NJ) and Rep. Ryan Costello (R-PA) are the only Republicans out of 14 Republicans in swing districts who voted for Trumpcare and who plan to attend scheduled town halls."}, {"6051": "When Democrats pushed for Obamacare in 2009, Democrats encountered protests and angry constituents, but then Rep. Chris Van Hollen (D-MD) urged freshman House Democrats to meet with constituents."}, {"eae3": "Van Hollen reportedly said, “It’s really important that your constituents hear directly from you. You shouldn’t let a day go by [that] your constituents don’t hear from you.”"}], "content": "Trumpcare is back and it’s still a total disaster “I have to do healthcare first,” Trump told Fox Business Network. President Donald Trump speaks during a meeting with business leaders in the State Department Library of the Eisenhower Executive Office Building on the White House complex in Washington. CREDIT: AP/Evan Vucci Republican leaders’ first attempt to pass Trumpcare was rushed, secretive, and extremely partisan, but the second attempt has been all of these things, multiplied three times. Republicans still don’t have revised text for the legislation, and the deal they had last week is still tentative. There also aren’t any signs that moderates and hard-right conservatives are any closer to arriving at a deal than they were weeks ago. Although the hard-right conservative Freedom Caucus has a very specific set of priorities for the legislation, the moderate Republican Tuesday Group is much less cohesive, which makes it difficult for them to negotiate, Vox reported. Still, President Donald Trump has not given up the health care fight. Trump told Fox Business Network’s Maria Bartiromo that he wants to pass a health care bill before moving on to tax reform. “We are going to have a phenomenal tax reform, but I have to do health care first. I want to do it first to really get it right,” Trump said. “I don’t want to put deadlines. Healthcare is going to happen, at some point. Now, if does not happen fast enough, I’ll start the taxes.” Most of the members of the Tuesday Group voted to fully repeal Obamacare in 2015. But now, thanks to a Congressional Budget Office analysis, the group has a much better idea of how economically disastrous a repeal and replace bill would be for many Americans. Some moderates still want to keep the essential health benefits requirement (EHBs) and Medicaid expansion under Obamacare, while the more conservative Freedom Caucus wants to get rid of EHBs and protections for people with pre-existing conditions. To make matters worse for Republicans, the Trump administration struggles to count votes because they don’t understand the dynamics in Congress, Politico reported. The Republicans leading the effort to revive health care — which includes Office of Management and Budget Director Mick Mulvaney, Health and Human Services Secretary Tom Price, and Vice President Mike Pence — lost internal party elections as Congressmen. Despite occasional statements stressing the urgency of a health care vote, the president hasn’t given any estimates of a timeline. Republicans in leadership positions have been far more vague about the negotiations process. Republicans gave deadlines for passing a health care bill in March but are reluctant to do so now. House Ways and Means Chair Kevin Brady (R-TX) said he didn’t know if there were negotiations and said ideas were “being floated from all directions.” House Speaker Paul Ryan (R-WI) has described the talks as going through “conceptual stages.” At the pace the health care talks are going, it’s unlikely that Republicans will have time to pass their health care bill, tackle an issue as complex as tax reform, pass the budget, and pass major infrastructure legislation before the August recess. And there are signs that after Republicans’ health care failure, the party is in poor shape to take on other major legislation. There is also increased tension between the White House and House Republicans. During a meeting last week, White House Chief of Staff Reince Priebus allegedly told House Speaker Ryan another failure could be “detrimental to Ryan’s speakership.” Several White House officials reportedly pressured Ryan to attempt another vote last week. Communication with Democrats has been nonexistent, unless you count ominous warnings to Democratic leaders that Obamacare will collapse on its own. Unlike the beginning of the process to pass Obamacare, when Democrats made a serious attempt to reach out to Republicans, Republicans have completely shut Democrats out of the development of the healthcare bill. The tone has grown more partisan as Republicans use the possibility of negotiations with Democrats as a threat against other Republicans, rather than consider it a natural part of the legislative process. It’s clear that many Republicans are aware of how unpopular Trumpcare is. Since members of Congress will leave for Easter recess, Republican lawmakers in swing districts who voted for Trumpcare have a decision to make. They can face their constituents and explain their position on health care or simply avoid their constituents. Most of these lawmakers chose the latter option, according to USA Today’s analysis. Rep. Leonard Lance (R-NJ) and Rep. Ryan Costello (R-PA) are the only Republicans out of 14 Republicans in swing districts who voted for Trumpcare and who plan to attend scheduled town halls. When Democrats pushed for Obamacare in 2009, Democrats encountered protests and angry constituents, but then Rep. Chris Van Hollen (D-MD) urged freshman House Democrats to meet with constituents. Van Hollen reportedly said, “It’s really important that your constituents hear directly from you. You shouldn’t let a day go by [that] your constituents don’t hear from you.” ", "child": "1076_1\t1076_2\t1076_3\t1076_4\t1076_5\t1076_6\t1076_7"}