{"name": "1077", "parent": "", "title": "Maryland will protect Planned Parenthood from Congress’ efforts to defund it", "sentences": [{"5c51": "Maryland will protect Planned Parenthood from Congress’ efforts to defund it"}, {"1998": "It’s the first state to pass a law that will reimburse Planned Parenthood if Congress cuts its federal funding."}, {"033d": "Maryland House Speaker Michael Busch speaks at a news conference in Annapolis, Md., in support of legislation to continue funding for services provided by Planned Parenthood. CREDIT: AP Photo/Brian Witte, File"}, {"c204": "Maryland has become the first state in the country to enact a law that will protect Planned Parenthood from federal cuts by using state dollars to reimburse the organization’s clinics for its services."}, {"5a58": "The new state law, which was enacted on Thursday, does not have the explicit support of Gov. Larry Hogan (R). It was one of 15 bills that the governor allowed to move forward this week without his signature; they became law because he also did not take action to veto them."}, {"955f": "The bill reallocates $2 million from the state’s Medicaid budget and $700,000 from its general fund to help cover the cost of providing family planning services at Planned Parenthood’s nine Maryland clinics. Those funds would kick in if the federal government, in an effort to defund the organization, stops reimbursing Planned Parenthood for those services."}, {"8b0b": "The bill’s supporters say that will help ensure nearly 25,000 Planned Parenthood patients can maintain access to affordable preventative care."}, {"35e3": "“Today, Maryland makes history,” state Sen. Richard S. Madaleno Jr. (D), the legislation’s sponsor, said at a press event. “While I wish our state didn’t need to fight the attacks on comprehensive health care by Congress, we are proud to stand up and protect access in Maryland.”"}, {"00b6": "Women who rely on Planned Parenthood are fighting backA leaked GOP bill would strip its clinics of Medicaid funding.thinkprogress.org"}, {"ae7d": "Republicans in Congress, who have been fighting for years to strip funding from Planned Parenthood, are newly invigorated in this effort thanks to the GOP control of the House, Senate, and White House."}, {"a9a7": "The first version of House Republicans’ Obamacare replacement legislation — which was pulled from the floor last month amid an intra-party disagreement about how to proceed with health care reform — included a provision to defund Planned Parenthood’s family planning services. Even though that bill failed, anti-abortion leaders say they still want to push lawmakers to pass a budget bill that includes Planned Parenthood cuts."}, {"3994": "In response, some state lawmakers are crafting proactive legislation to protect their constituents’ access to reproductive health care."}, {"e782": "In addition to Maryland, legislators in Nevada and Oregon are advancing measures that would make it easier for women to access year-long supplies of birth control and require insurers to cover contraceptives with no co-pay."}], "content": "Maryland will protect Planned Parenthood from Congress’ efforts to defund it It’s the first state to pass a law that will reimburse Planned Parenthood if Congress cuts its federal funding. Maryland House Speaker Michael Busch speaks at a news conference in Annapolis, Md., in support of legislation to continue funding for services provided by Planned Parenthood. CREDIT: AP Photo/Brian Witte, File Maryland has become the first state in the country to enact a law that will protect Planned Parenthood from federal cuts by using state dollars to reimburse the organization’s clinics for its services. The new state law, which was enacted on Thursday, does not have the explicit support of Gov. Larry Hogan (R). It was one of 15 bills that the governor allowed to move forward this week without his signature; they became law because he also did not take action to veto them. The bill reallocates $2 million from the state’s Medicaid budget and $700,000 from its general fund to help cover the cost of providing family planning services at Planned Parenthood’s nine Maryland clinics. Those funds would kick in if the federal government, in an effort to defund the organization, stops reimbursing Planned Parenthood for those services. The bill’s supporters say that will help ensure nearly 25,000 Planned Parenthood patients can maintain access to affordable preventative care. “Today, Maryland makes history,” state Sen. Richard S. Madaleno Jr. (D), the legislation’s sponsor, said at a press event. “While I wish our state didn’t need to fight the attacks on comprehensive health care by Congress, we are proud to stand up and protect access in Maryland.” Women who rely on Planned Parenthood are fighting backA leaked GOP bill would strip its clinics of Medicaid funding.thinkprogress.org Republicans in Congress, who have been fighting for years to strip funding from Planned Parenthood, are newly invigorated in this effort thanks to the GOP control of the House, Senate, and White House. The first version of House Republicans’ Obamacare replacement legislation — which was pulled from the floor last month amid an intra-party disagreement about how to proceed with health care reform — included a provision to defund Planned Parenthood’s family planning services. Even though that bill failed, anti-abortion leaders say they still want to push lawmakers to pass a budget bill that includes Planned Parenthood cuts. In response, some state lawmakers are crafting proactive legislation to protect their constituents’ access to reproductive health care. In addition to Maryland, legislators in Nevada and Oregon are advancing measures that would make it easier for women to access year-long supplies of birth control and require insurers to cover contraceptives with no co-pay. ", "child": "1077_1\t1077_2\t1077_3\t1077_4"}