{"name": "1078", "parent": "", "title": "Trumpcare 2.0 has weaker pre-existing conditions protection than Trumpcare 1.0", "sentences": [{"5e8a": "Trumpcare 2.0 has weaker pre-existing conditions protection than Trumpcare 1.0"}, {"7224": "Experts say that high-risk pools haven’t worked in the past and won’t work in the future."}, {"a99e": "House Speaker Paul Ryan of Wis., and the GOP leadership, meet with reporters on Capitol Hill in Washington, Tuesday, April 4, 2017. CREDIT: AP/J. Scott Applewhite"}, {"81ca": "For their second attempt at passing the American Health Care Act (better known as “Trumpcare”), House Republicans will add an amendment allowing for “high-risk pools,” Speaker Paul Ryan (R-WI) announced on Thursday. But that amendment isn’t likely to allay fears that the legislation will deliver substantially worse health care for vulnerable patients."}, {"5890": "High-risk insurance pools are insurance programs for people with preexisting medical conditions. Premiums for these plans tend to be higher, but state high-risk pools are publicly subsidized. Still, critics of these plans say the costs are difficult to budget for, and that recipients of these plans can be forced to wait long periods of time before receiving care."}, {"667b": "Thirty-five states had high-risk pools before Obamacare passed and mandated that regular marketplace plans cover preexisting conditions. The federal government also had a high-risk pool to assist with the transition to Obamacare."}, {"fe8c": "In place of the ban on screening for preexisting conditions, the Republican amendment would create a federal insurance pool for people with particularly expensive medical conditions. The idea is that through subsidizing coverage for patients with serious preexisting conditions, premiums would fall for healthier patients. House Speaker Paul Ryan said the amendment has “been embraced by a broad spectrum” of the House Republican caucus — presumably including both the relative centrists and far-right Freedom Caucus members whose irreconcilable differences sank Trumpcare the first time around."}, {"462c": "“We have come together in a new amendment that we all believe will lower premiums and provide added protections to those facing real challenges gaining access to affordable care,” Speaker Ryan said."}, {"9b76": "If the bill passes, the federal high-risk program would begin in 2020 and $15 billion would be allocated to it."}, {"2855": "It’s unclear if that funding level would be sufficient. Larry Levitt, senior vice president at the Kaiser Family Foundation says it isn’t nearly enough"}, {"b26a": "Past experience also suggests that a federal high-risk program would have trouble adequately insuring people with preexisting conditions."}, {"79aa": "The ACA created a Pre-existing Condition Insurance Plan (PCIP) that would end when major Obamacare changes phased in in 2014. PCIP had funding challenges almost a year before it was supposed to be eliminated. It was difficult to predict costs, which led to volatility in operations. The program changed its eligibility rules and outreach plans multiple times and had to use regulations to lower prices it paid for services, wrote Jeanne Lambrew, former Deputy Director of the White House Office of Health Reform during the Obama administration and Ellen Montz, a fellow at The Century Foundation."}, {"b465": "Lambrew and Montz explained:"}, {"f26c": "If the separate risk pool were only for new applicants who were previously uninsured, how would it be viable or accomplish the policy goals of the program given that its number of potentially eligible people is even smaller than that of traditional high-risk pools or PCIP? …. Moreover, proposals to replace the ACA should be measured against the baseline of the ACA’s successes and not the dysfunctional market that preceded reform. Against this yardstick, high-risk pools, even with the type of funding suggested for State Innovation Grants, will likely fall far short of covering as many people with pre-existing conditions as affordably."}, {"73c0": "Since the pools became so expensive, some states had to create coverage waiting lists. In 2008, North Carolina’s high-risk pool had a 12-month waiting period before it would cover preexisting conditions for people who were uninsured."}, {"896d": "Julie Rovner, Chief Washington Correspondent, for Kaiser Health News, said, “ … high risk pools are another idea that sounds good, but that’s very hard to make work in the real world of health care.”"}], "content": "Trumpcare 2.0 has weaker pre-existing conditions protection than Trumpcare 1.0 Experts say that high-risk pools haven’t worked in the past and won’t work in the future. House Speaker Paul Ryan of Wis., and the GOP leadership, meet with reporters on Capitol Hill in Washington, Tuesday, April 4, 2017. CREDIT: AP/J. Scott Applewhite For their second attempt at passing the American Health Care Act (better known as “Trumpcare”), House Republicans will add an amendment allowing for “high-risk pools,” Speaker Paul Ryan (R-WI) announced on Thursday. But that amendment isn’t likely to allay fears that the legislation will deliver substantially worse health care for vulnerable patients. High-risk insurance pools are insurance programs for people with preexisting medical conditions. Premiums for these plans tend to be higher, but state high-risk pools are publicly subsidized. Still, critics of these plans say the costs are difficult to budget for, and that recipients of these plans can be forced to wait long periods of time before receiving care. Thirty-five states had high-risk pools before Obamacare passed and mandated that regular marketplace plans cover preexisting conditions. The federal government also had a high-risk pool to assist with the transition to Obamacare. In place of the ban on screening for preexisting conditions, the Republican amendment would create a federal insurance pool for people with particularly expensive medical conditions. The idea is that through subsidizing coverage for patients with serious preexisting conditions, premiums would fall for healthier patients. House Speaker Paul Ryan said the amendment has “been embraced by a broad spectrum” of the House Republican caucus — presumably including both the relative centrists and far-right Freedom Caucus members whose irreconcilable differences sank Trumpcare the first time around. “We have come together in a new amendment that we all believe will lower premiums and provide added protections to those facing real challenges gaining access to affordable care,” Speaker Ryan said. If the bill passes, the federal high-risk program would begin in 2020 and $15 billion would be allocated to it. It’s unclear if that funding level would be sufficient. Larry Levitt, senior vice president at the Kaiser Family Foundation says it isn’t nearly enough Past experience also suggests that a federal high-risk program would have trouble adequately insuring people with preexisting conditions. The ACA created a Pre-existing Condition Insurance Plan (PCIP) that would end when major Obamacare changes phased in in 2014. PCIP had funding challenges almost a year before it was supposed to be eliminated. It was difficult to predict costs, which led to volatility in operations. The program changed its eligibility rules and outreach plans multiple times and had to use regulations to lower prices it paid for services, wrote Jeanne Lambrew, former Deputy Director of the White House Office of Health Reform during the Obama administration and Ellen Montz, a fellow at The Century Foundation. Lambrew and Montz explained: If the separate risk pool were only for new applicants who were previously uninsured, how would it be viable or accomplish the policy goals of the program given that its number of potentially eligible people is even smaller than that of traditional high-risk pools or PCIP? …. Moreover, proposals to replace the ACA should be measured against the baseline of the ACA’s successes and not the dysfunctional market that preceded reform. Against this yardstick, high-risk pools, even with the type of funding suggested for State Innovation Grants, will likely fall far short of covering as many people with pre-existing conditions as affordably. Since the pools became so expensive, some states had to create coverage waiting lists. In 2008, North Carolina’s high-risk pool had a 12-month waiting period before it would cover preexisting conditions for people who were uninsured. Julie Rovner, Chief Washington Correspondent, for Kaiser Health News, said, “ … high risk pools are another idea that sounds good, but that’s very hard to make work in the real world of health care.” ", "child": "1078_1"}