{"name": "1079", "parent": "", "title": "Trump’s attempts to sabotage Obamacare are making insurers nervous", "sentences": [{"b1cf": "Trump’s attempts to sabotage Obamacare are making insurers nervous"}, {"af5e": "Insurers may pull out of the market if they can’t plan for the future."}, {"5edf": "In this Feb. 11, 2011, file photo Rep. Tom Price, R-Ga., speaks at a Conservative Political Action Conference (CPAC) in Washington. CREDIT: AP/Alex Brandon"}, {"186f": "The future of the Affordable Care Act is still in flux. As House Republicans attempt to revive Trumpcare and Health and Human Services Secretary Tom Price hints at an independent effort to weaken Obamacare, insurance companies are facing a cloud of uncertainty — and more of them could leave the individual market as a result."}, {"cce8": "The Trump administration has already taken steps to sabotage the ACA by weakening the individual mandate, shortening the open enrollment period, and doing less advertising and outreach. There is still much more they could do to undermine the ACA."}, {"c282": "At the same time, House Republicans have hinted they intend to resurrect Trumpcare, which got pulled from the House floor without a vote two weeks ago. On Monday, Trump administration officials met with both House moderates and far-right conservatives to strike a deal to reviving the bill. Although sources within the administration told Politico that they plan to work fast to schedule another vote, Speaker Ryan has been far more hesitant to discuss a timeline."}, {"7826": "“Now the legislative uncertainty is front and center again.”"}, {"ea66": "Aviva Aron-Dine, senior fellow and counselor at the Center on Budget and Policy Priorities and former senior counselor to the secretary at the U.S. Department of Health and Human Services, said both the administration’s actions and the possible reintroduction of the Trumpcare have made it difficult for insurers to plan ahead. And they don’t have a lot of time to make up their minds; on June 21, Qualified Health Plan applications are due to the Centers for Medicare & Medicaid Services. Some states set their filing deadlines even earlier, in May."}, {"e518": "“I think the main damage being caused by the conversation is that [insurers] thought they were done with legislative discussion, and so they were primarily focused on the uncertainty created by the administration’s potential actions” Aron-Dine said. “Now the legislative uncertainty is front and center again.”"}, {"4e8b": "Now that Republicans in Congress and the White House are considering a path to pass the AHCA again, insurers are left to wonder whether they should prepare for the smaller market and sicker risk pool they would have under the AHCA or for a larger, lower-cost market under the ACA."}, {"2a5c": "On Monday, Iowa’s dominant insurance company, Wellmark Blue Cross & Blue Shield, announced it would stop selling individual policies in 2018 as a result of the greater climate of uncertainty. In an interview with the Des Moines Register, Wellmark President John Forsyth said the Trump administration’s decision not to enforce the individual mandate played a part in the decision."}, {"5172": "Trumpcare would have eliminated the individual mandate entirely and replaced it with a 30 percent surcharge on premiums for Americans who didn’t have continuous coverage prior to purchasing a plan. Forsyth said that new rule wouldn’t have been enough of an incentive for young Americans to purchase coverage, and that Wellmark may have dropped out of the market under that system as well."}, {"c42b": "Anthem may also pull back from the ACA’s individual markets, Bloomberg reported. Jeffries analysts David Windley and David Styblo said Anthem “is leaning toward exiting a high percentage of the 144 rating regions in which it currently participates” in a research note. In an emailed statement to Bloomberg, Anthem said it is communicating with the Trump administration to “emphasize the importance of regulatory and statutory changes in order to ensure sustainability and affordability of the individual market for consumers.”"}, {"7152": "In February, Humana announced it would stop offering its individual ACA plans in 2018."}, {"bd54": "Trumpcare is back from the dead and it is even worseRepublican leaders are determined to schedule another vote on health care.thinkprogress.org"}, {"b83c": "If the Trump administration wanted to create stability in the individual market, it could tell insurers that they plan to administer the program in good faith, that it would appeal all legal challenges to cost-sharing subsidies, and commit to outreach and advertising."}, {"befa": "Instead, the administration has communicated that it will do the opposite. Price has dodged questions about enforcing the ACA. The Department of Health and Human Services recently introduced a website listing all of the actions the administration to undermine the ACA since Trump took office. And the administration’s “skinny budget” proposes a 17.9 percent cut to HHS, which may hurt the department’s administration of the ACA."}, {"b4f4": "“You’re seeing the compounding effects of uncertainty, from questions about how the administration will administer the marketplaces, will they pay [cost-share reduction subsidies], will they enforce the mandate, [and] will they do outreach and marketing, or will they take other steps to sabotage the market?” Aron-Dine said."}, {"db89": "When insurers consider the possibility that the AHCA could still become law, that complicates their plans even more, Aron-Dine said. Insurers may take Wellmark Blue Cross & Blue Shield’s cue and leave the market until there is greater certainty. Insurers may also submit higher proposed rates based on the higher cost risk pools they would have under the AHCA."}, {"8256": "“As they talk about adding additional changes to the bill, that uncertainty is compounded, but even with the base bill, it’s hard to be an insurer putting together your rate filings right now,” Aron-Dine said. “On one hand, you could be facing current loss, and on the other hand, you’re facing a bill that the CBO is telling you could increase per enrollee cost by 15 to 20 percent for 2018 and shrink your market by a third. How do you price? I’d be worried that in the face of that extreme uncertainty from both sources, insurers say ‘I’m out while this is being resolved.’”"}], "content": "Trump’s attempts to sabotage Obamacare are making insurers nervous Insurers may pull out of the market if they can’t plan for the future. In this Feb. 11, 2011, file photo Rep. Tom Price, R-Ga., speaks at a Conservative Political Action Conference (CPAC) in Washington. CREDIT: AP/Alex Brandon The future of the Affordable Care Act is still in flux. As House Republicans attempt to revive Trumpcare and Health and Human Services Secretary Tom Price hints at an independent effort to weaken Obamacare, insurance companies are facing a cloud of uncertainty — and more of them could leave the individual market as a result. The Trump administration has already taken steps to sabotage the ACA by weakening the individual mandate, shortening the open enrollment period, and doing less advertising and outreach. There is still much more they could do to undermine the ACA. At the same time, House Republicans have hinted they intend to resurrect Trumpcare, which got pulled from the House floor without a vote two weeks ago. On Monday, Trump administration officials met with both House moderates and far-right conservatives to strike a deal to reviving the bill. Although sources within the administration told Politico that they plan to work fast to schedule another vote, Speaker Ryan has been far more hesitant to discuss a timeline. “Now the legislative uncertainty is front and center again.” Aviva Aron-Dine, senior fellow and counselor at the Center on Budget and Policy Priorities and former senior counselor to the secretary at the U.S. Department of Health and Human Services, said both the administration’s actions and the possible reintroduction of the Trumpcare have made it difficult for insurers to plan ahead. And they don’t have a lot of time to make up their minds; on June 21, Qualified Health Plan applications are due to the Centers for Medicare & Medicaid Services. Some states set their filing deadlines even earlier, in May. “I think the main damage being caused by the conversation is that [insurers] thought they were done with legislative discussion, and so they were primarily focused on the uncertainty created by the administration’s potential actions” Aron-Dine said. “Now the legislative uncertainty is front and center again.” Now that Republicans in Congress and the White House are considering a path to pass the AHCA again, insurers are left to wonder whether they should prepare for the smaller market and sicker risk pool they would have under the AHCA or for a larger, lower-cost market under the ACA. On Monday, Iowa’s dominant insurance company, Wellmark Blue Cross & Blue Shield, announced it would stop selling individual policies in 2018 as a result of the greater climate of uncertainty. In an interview with the Des Moines Register, Wellmark President John Forsyth said the Trump administration’s decision not to enforce the individual mandate played a part in the decision. Trumpcare would have eliminated the individual mandate entirely and replaced it with a 30 percent surcharge on premiums for Americans who didn’t have continuous coverage prior to purchasing a plan. Forsyth said that new rule wouldn’t have been enough of an incentive for young Americans to purchase coverage, and that Wellmark may have dropped out of the market under that system as well. Anthem may also pull back from the ACA’s individual markets, Bloomberg reported. Jeffries analysts David Windley and David Styblo said Anthem “is leaning toward exiting a high percentage of the 144 rating regions in which it currently participates” in a research note. In an emailed statement to Bloomberg, Anthem said it is communicating with the Trump administration to “emphasize the importance of regulatory and statutory changes in order to ensure sustainability and affordability of the individual market for consumers.” In February, Humana announced it would stop offering its individual ACA plans in 2018. Trumpcare is back from the dead and it is even worseRepublican leaders are determined to schedule another vote on health care.thinkprogress.org If the Trump administration wanted to create stability in the individual market, it could tell insurers that they plan to administer the program in good faith, that it would appeal all legal challenges to cost-sharing subsidies, and commit to outreach and advertising. Instead, the administration has communicated that it will do the opposite. Price has dodged questions about enforcing the ACA. The Department of Health and Human Services recently introduced a website listing all of the actions the administration to undermine the ACA since Trump took office. And the administration’s “skinny budget” proposes a 17.9 percent cut to HHS, which may hurt the department’s administration of the ACA. “You’re seeing the compounding effects of uncertainty, from questions about how the administration will administer the marketplaces, will they pay [cost-share reduction subsidies], will they enforce the mandate, [and] will they do outreach and marketing, or will they take other steps to sabotage the market?” Aron-Dine said. When insurers consider the possibility that the AHCA could still become law, that complicates their plans even more, Aron-Dine said. Insurers may take Wellmark Blue Cross & Blue Shield’s cue and leave the market until there is greater certainty. Insurers may also submit higher proposed rates based on the higher cost risk pools they would have under the AHCA. “As they talk about adding additional changes to the bill, that uncertainty is compounded, but even with the base bill, it’s hard to be an insurer putting together your rate filings right now,” Aron-Dine said. “On one hand, you could be facing current loss, and on the other hand, you’re facing a bill that the CBO is telling you could increase per enrollee cost by 15 to 20 percent for 2018 and shrink your market by a third. How do you price? I’d be worried that in the face of that extreme uncertainty from both sources, insurers say ‘I’m out while this is being resolved.’” ", "child": "1079_1\t1079_2"}