{"name": "1082", "parent": "", "title": "Trump budget boss: If you want insurance to cover maternity care, lobby your state legislature", "sentences": [{"26dc": "Trump budget boss: If you want insurance to cover maternity care, lobby your state legislature"}, {"e37a": "Trumpcare: Giving you the freedom to purchase health insurance that covers nothing."}, {"7cc3": "CREDIT: CBS screengrab"}, {"4983": "On Thursday, President Trump and the House Freedom Caucus tentatively worked out a deal: Trump would agree to remove mandatory coverage of “essential services” from his health care bill in order to win the far-right caucus’ support for it."}, {"7c7e": "Essential services include maternity and newborn care, pediatric care, emergency services, substance abuse treatment, and prescription drug coverage. Under the Affordable Care Act, every health insurance plan sold in the US must cover them."}, {"9746": "House GOP leaders agree to gut essential health benefits, begin hemorrhaging moderate votesA short-sighted attempt to appease conservatives could easily backfire.thinkprogress.org"}, {"35d9": "But with no women present, the Trump administration and House Republicans decided on a plan that would allow insurers to sell health care policies without maternity care coverage in states that allow it."}, {"55e7": "Vice President Mike Pence tweeted out a photo from the room:"}, {"1b96": "On Friday morning — hours ahead of the expected House vote on the bill — Budget Director Mick Mulvaney went on CBS This Morning to defend a bill he’s played a key role in crafting. While on the program, he offered some advice to people who require essential benefits but live in states that wouldn’t require them under the law: If you don’t like it, just move."}, {"e2c0": "The New York Times reports that on Thursday, Mulvaney issued an ultimatum on Trump’s behalf to “recalcitrant” House Republicans asking them “to fall in line behind a broad health insurance overhaul” on Friday “or see their opportunity to repeal the Affordable Care Act vanish.”"}, {"d0a8": "On CBS, Mulvaney said that “we have made the bill much better over the course of the last weeks.”"}, {"6e55": "“The point of the matter is this — they know they don’t like Obamacare, people back home know they don’t like it,” he continued. “It takes the control of their own health care out of their hands, it takes affordability away from them and they want something better. What’s sitting in the House today is better than that.”"}, {"c6eb": "In response, host Alex Wagner shot back, “Mr. Mulvaney, when you talk about something better, does that include the slashing of essential services, included maternity care, emergency services, and prescription drugs?”"}, {"57b9": "Mulvaney responded by arguing that essential services coverage is really a states’ rights issue."}, {"7950": "“States not only have the ability to require those services, many of them already do,” Mulvaney said. “I talked to some folks from the Northeast and it was like, ‘Yeah, we don’t really mind that much about essential health benefits because our states already require insurance policies sold in those states to have that.’ What we’re doing is taking away the federal control of these systems.”"}, {"6c5e": "Asked “what about a state that doesn’t do that,” Mulvaney advised, “Then you can figure out a way to change the state you live in.”"}, {"a8d8": "While the elimination of essential benefits makes Trumpcare more appealing for some Freedom Caucus members, House Republicans with different priorities argue it has made the bill worse."}, {"d846": "And many medical professionals are appalled. Hal Lawrence, CEO of the American Congress of Obstetricians and Gynecologists, told USA Today that eliminating essential benefits requirements was a “horrible idea.”"}, {"bb82": "“It’s a horrible idea that takes away women’s access to preventive and maternity care,” he said. “What [members of Congress] will do is increase illness, pregnancy complications, cancer and death.”"}], "content": "Trump budget boss: If you want insurance to cover maternity care, lobby your state legislature Trumpcare: Giving you the freedom to purchase health insurance that covers nothing. CREDIT: CBS screengrab On Thursday, President Trump and the House Freedom Caucus tentatively worked out a deal: Trump would agree to remove mandatory coverage of “essential services” from his health care bill in order to win the far-right caucus’ support for it. Essential services include maternity and newborn care, pediatric care, emergency services, substance abuse treatment, and prescription drug coverage. Under the Affordable Care Act, every health insurance plan sold in the US must cover them. House GOP leaders agree to gut essential health benefits, begin hemorrhaging moderate votesA short-sighted attempt to appease conservatives could easily backfire.thinkprogress.org But with no women present, the Trump administration and House Republicans decided on a plan that would allow insurers to sell health care policies without maternity care coverage in states that allow it. Vice President Mike Pence tweeted out a photo from the room: On Friday morning — hours ahead of the expected House vote on the bill — Budget Director Mick Mulvaney went on CBS This Morning to defend a bill he’s played a key role in crafting. While on the program, he offered some advice to people who require essential benefits but live in states that wouldn’t require them under the law: If you don’t like it, just move. The New York Times reports that on Thursday, Mulvaney issued an ultimatum on Trump’s behalf to “recalcitrant” House Republicans asking them “to fall in line behind a broad health insurance overhaul” on Friday “or see their opportunity to repeal the Affordable Care Act vanish.” On CBS, Mulvaney said that “we have made the bill much better over the course of the last weeks.” “The point of the matter is this — they know they don’t like Obamacare, people back home know they don’t like it,” he continued. “It takes the control of their own health care out of their hands, it takes affordability away from them and they want something better. What’s sitting in the House today is better than that.” In response, host Alex Wagner shot back, “Mr. Mulvaney, when you talk about something better, does that include the slashing of essential services, included maternity care, emergency services, and prescription drugs?” Mulvaney responded by arguing that essential services coverage is really a states’ rights issue. “States not only have the ability to require those services, many of them already do,” Mulvaney said. “I talked to some folks from the Northeast and it was like, ‘Yeah, we don’t really mind that much about essential health benefits because our states already require insurance policies sold in those states to have that.’ What we’re doing is taking away the federal control of these systems.” Asked “what about a state that doesn’t do that,” Mulvaney advised, “Then you can figure out a way to change the state you live in.” While the elimination of essential benefits makes Trumpcare more appealing for some Freedom Caucus members, House Republicans with different priorities argue it has made the bill worse. And many medical professionals are appalled. Hal Lawrence, CEO of the American Congress of Obstetricians and Gynecologists, told USA Today that eliminating essential benefits requirements was a “horrible idea.” “It’s a horrible idea that takes away women’s access to preventive and maternity care,” he said. “What [members of Congress] will do is increase illness, pregnancy complications, cancer and death.” ", "child": "1082_1\t1082_2\t1082_3\t1082_4\t1082_5\t1082_6\t1082_7\t1082_8\t1082_9\t1082_10\t1082_11\t1082_12"}