{"name": "1083", "parent": "", "title": "White House says maternity care won’t be more expensive for women —if they’re on a family plan", "sentences": [{"d8b0": "White House says maternity care won’t be more expensive for women —if they’re on a family plan"}, {"b121": "A story of male priorities on women’s health care, in two acts."}, {"31c2": "White House press secretary Sean Spicer speaks to the media during the daily briefing in the Brady Press Briefing Room of the White House in Washington, Wednesday, March 22, 2017. CREDIT: AP Photo/Pablo Martinez Monsivais"}, {"daee": "White House Press Secretary Sean Spicer told reporters on Thursday that women wouldn’t have to worry about paying more for maternity care under Trumpcare, as long as they’re on a family plan."}, {"ffbb": "The exchange came as a reporter pressed Spicer on reports that the GOP is considering repealing Obamacare’s 10 essential health benefits mandate — a requirement that all insurance plans cover services such as hospitalizations, prescriptions, preventative care, and pregnancy, maternity, and newborn care."}, {"902b": "Spicer called the furor over these benefits a “philosophical discussion,” and argued that repealing them was a way to bring premiums down."}, {"6d32": "“It’s about a series of benefits being mandated for everybody, so what has happened is the cost of health care for every individual has gone up and the choice has gone down,” he said."}, {"3ebc": "Premiums would go down, however, because people would be able to buy plans so skimpy as to be meaningless — and meanwhile, the cost for people buying plans that actually cover expenses like maternity care would go up."}, {"82c9": "“Is the president concerned that without having those essential benefits you will have a situation where women are de facto paying higher insurance? Obviously they would be paying for maternity leave,” the reporter asked as a follow up."}, {"8530": "“No, you could have a family plan,” Spicer replied."}, {"9ece": "At best, Spicer’s answer is extraordinarily dismissive of single mothers — the reality is that not every woman who needs maternity care is going to be on a family plan, which are designed for couples and those with children or other dependents. At worst, it’s a tacit endorsement of only married women having access to affordable maternity care."}, {"c536": "Even if they got their insurance through a family plan, that family plan would still cost more if they wanted it to include maternity care. And, not all pregnancies are planned — which is why Obamacare treats it as an unexpected medical expense like any other."}, {"1653": "In reality, health care experts project women paying more for health insurance just because they are women is exactly what would happen if the essential benefits provision is repealed."}, {"d28b": "That’s because it’s integral to how insurance works. If maternity care becomes an add-on option, only people who expect to use it are likely to purchase it. That makes the pool of people buying it both small and expensive for insurers — so the price will skyrocket. At the same time, fewer insurers are likely to offer it. Essentially, segmenting out maternity care starts its own death spiral, with women footing the bill."}, {"a36f": "It’s more than a hypothetical situation. Prior to Obamacare, 62 percent of those on the individual market didn’t have maternity coverage, according to a study by the Center on Budget and Policy Priorities. Only nine states mandated that plans covered maternity care, and in states that didn’t, only six percent of plans offered it, according to a study by the National Women’s Law Center."}, {"67d5": "If women wanted to purchase maternity coverage as a rider, the cost was typically prohibitive. In Kansas, for example, if a woman wanted maternity insurance she’d have to shell out an extra $1,600 a month — on top of her overall coverage plan. Many of these policies had maternity-specific deductibles going up to $10,000."}, {"2541": "This had an effect on women on employee insurance plans too — who typically still paid $10,000 — $20,000 for just childbirth, with the cost depending on state and which type of birth, according to a study by Truven. Prior to Obamacare, women also were commonly charged more than men for exactly the same level of coverage. Overall, the NWLC estimates these disparities cost women on average $1 billion per year."}, {"54ec": "By forcing everyone to purchase coverage for things like maternal care and neonatal care, Obamacare lowered the cost for those who need it."}, {"b6d4": "The fact that men have to purchase health insurance for women’s services, however, has been one of Republicans’ favorite complaints with the law."}, {"0710": "Also on Thursday, Sen. Pat Roberts (R-KS) deadpanned to Talking Points Memo that he wouldn’t want to lose his mammogram coverage if the essential health benefits were repealed (he later apologized via Twitter for the quip)."}, {"43b1": "And during a hearing on the bill on March 10th, Rep. John Shimkus (R-IL) objected to Obamacare requiring men to purchase prenatal care."}, {"b176": "“What about men having to purchase prenatal care?” Shimkus told a colleague who asked what the issue with mandates was. “Is that not correct? And should they?”"}, {"91d0": "GOP congressman says we need to repeal Obamacare so men don’t have to pay for prenatal careIt used to be legal for women to be charged more for the same health insurance as men. Obamacare changed that.thinkprogress.org"}, {"d026": "Originally, Republicans were going to leave the essential health benefits mandate — which requires coverage for maternity and childcare and birth control — intact, in part because they couldn’t make policy changes to the bill without needing Democratic votes in the Senate."}, {"a8c3": "These mandates, however, are deeply unpopular with the House Freedom Caucus, who threatened to sink the bill. Reportedly, the Caucus took their concerns to President Trump, who agreed to negotiate, spawning a flurry of overnight rewrites as leadership reportedly sought to bargain the essential health benefits provision for votes."}, {"9d30": "The House Freedom Caucus doesn’t publish a list of its members. But according to current reports, deductions from its own Twitter account, lists compiled by PEW and others, and photographs of their meeting with Trump on Thursday, the group taking aim at women’s health benefits is currently entirely composed of men."}], "content": "White House says maternity care won’t be more expensive for women —if they’re on a family plan A story of male priorities on women’s health care, in two acts. White House press secretary Sean Spicer speaks to the media during the daily briefing in the Brady Press Briefing Room of the White House in Washington, Wednesday, March 22, 2017. CREDIT: AP Photo/Pablo Martinez Monsivais White House Press Secretary Sean Spicer told reporters on Thursday that women wouldn’t have to worry about paying more for maternity care under Trumpcare, as long as they’re on a family plan. The exchange came as a reporter pressed Spicer on reports that the GOP is considering repealing Obamacare’s 10 essential health benefits mandate — a requirement that all insurance plans cover services such as hospitalizations, prescriptions, preventative care, and pregnancy, maternity, and newborn care. Spicer called the furor over these benefits a “philosophical discussion,” and argued that repealing them was a way to bring premiums down. “It’s about a series of benefits being mandated for everybody, so what has happened is the cost of health care for every individual has gone up and the choice has gone down,” he said. Premiums would go down, however, because people would be able to buy plans so skimpy as to be meaningless — and meanwhile, the cost for people buying plans that actually cover expenses like maternity care would go up. “Is the president concerned that without having those essential benefits you will have a situation where women are de facto paying higher insurance? Obviously they would be paying for maternity leave,” the reporter asked as a follow up. “No, you could have a family plan,” Spicer replied. At best, Spicer’s answer is extraordinarily dismissive of single mothers — the reality is that not every woman who needs maternity care is going to be on a family plan, which are designed for couples and those with children or other dependents. At worst, it’s a tacit endorsement of only married women having access to affordable maternity care. Even if they got their insurance through a family plan, that family plan would still cost more if they wanted it to include maternity care. And, not all pregnancies are planned — which is why Obamacare treats it as an unexpected medical expense like any other. In reality, health care experts project women paying more for health insurance just because they are women is exactly what would happen if the essential benefits provision is repealed. That’s because it’s integral to how insurance works. If maternity care becomes an add-on option, only people who expect to use it are likely to purchase it. That makes the pool of people buying it both small and expensive for insurers — so the price will skyrocket. At the same time, fewer insurers are likely to offer it. Essentially, segmenting out maternity care starts its own death spiral, with women footing the bill. It’s more than a hypothetical situation. Prior to Obamacare, 62 percent of those on the individual market didn’t have maternity coverage, according to a study by the Center on Budget and Policy Priorities. Only nine states mandated that plans covered maternity care, and in states that didn’t, only six percent of plans offered it, according to a study by the National Women’s Law Center. If women wanted to purchase maternity coverage as a rider, the cost was typically prohibitive. In Kansas, for example, if a woman wanted maternity insurance she’d have to shell out an extra $1,600 a month — on top of her overall coverage plan. Many of these policies had maternity-specific deductibles going up to $10,000. This had an effect on women on employee insurance plans too — who typically still paid $10,000 — $20,000 for just childbirth, with the cost depending on state and which type of birth, according to a study by Truven. Prior to Obamacare, women also were commonly charged more than men for exactly the same level of coverage. Overall, the NWLC estimates these disparities cost women on average $1 billion per year. By forcing everyone to purchase coverage for things like maternal care and neonatal care, Obamacare lowered the cost for those who need it. The fact that men have to purchase health insurance for women’s services, however, has been one of Republicans’ favorite complaints with the law. Also on Thursday, Sen. Pat Roberts (R-KS) deadpanned to Talking Points Memo that he wouldn’t want to lose his mammogram coverage if the essential health benefits were repealed (he later apologized via Twitter for the quip). And during a hearing on the bill on March 10th, Rep. John Shimkus (R-IL) objected to Obamacare requiring men to purchase prenatal care. “What about men having to purchase prenatal care?” Shimkus told a colleague who asked what the issue with mandates was. “Is that not correct? And should they?” GOP congressman says we need to repeal Obamacare so men don’t have to pay for prenatal careIt used to be legal for women to be charged more for the same health insurance as men. Obamacare changed that.thinkprogress.org Originally, Republicans were going to leave the essential health benefits mandate — which requires coverage for maternity and childcare and birth control — intact, in part because they couldn’t make policy changes to the bill without needing Democratic votes in the Senate. These mandates, however, are deeply unpopular with the House Freedom Caucus, who threatened to sink the bill. Reportedly, the Caucus took their concerns to President Trump, who agreed to negotiate, spawning a flurry of overnight rewrites as leadership reportedly sought to bargain the essential health benefits provision for votes. The House Freedom Caucus doesn’t publish a list of its members. But according to current reports, deductions from its own Twitter account, lists compiled by PEW and others, and photographs of their meeting with Trump on Thursday, the group taking aim at women’s health benefits is currently entirely composed of men. ", "child": "1083_1\t1083_2\t1083_3\t1083_4\t1083_5\t1083_6\t1083_7\t1083_8\t1083_9\t1083_10\t1083_11\t1083_12\t1083_13\t1083_14\t1083_15\t1083_16\t1083_17\t1083_18\t1083_19\t1083_20\t1083_21"}