{"name": "1087", "parent": "", "title": "Some GOP lawmakers back away from Trumpcare after learning millions will lose insurance", "sentences": [{"f5f3": "Some GOP lawmakers back away from Trumpcare after learning millions will lose insurance"}, {"4321": "Not all Republicans are eager to back a plan that could cost 24 million people their health insurance."}, {"dda7": "Keith Hall is the GOP’s handpicked Congressional Budget Office director. CREDIT: AP Photo/J. Scott Applewhite"}, {"0baa": "On Monday, the Congressional Budget Office released its analysis of House Republicans’ plan to replace the Affordable Care Act with a series of smaller tax incentives for consumers and a massive tax cut for health insurance companies with overpaid CEOs. And its assessment that the legislation would result in 24 million more uninsured Americans over ten years has some congressional Republicans worried."}, {"907b": "Trumpcare could cost 24 million people their insurance, government analysis findsThe Congressional Budget Office just released its much anticipated report. Republicans were right to be scared.thinkprogress.org"}, {"1f78": "To push back on the CBO’s findings, Trump administration and Republican leaders have alternately attempted to cherry-pick favorable pieces of the scoring and to undermine the credibility of the non-partisan budget office (which is run by an economist who was handpicked by the congressional GOP leadership in 2015)."}, {"f7ae": "But a growing number of Republican legislators are indicating that the CBO scoring has given them pause or led them to oppose Trumpcare outright."}, {"fa98": "Sen. Roy Blunt (R-MO): Blunt cheered the money-saving numbers in the CBO score, but conceded reservations about the report as a whole. “In terms of coverage, we need to get a better sense of what Health and Human Services can do,” he observed, adding that the 24 million number was “troublesome” to efforts to pass the bill."}, {"c43c": "Sen. Bill Cassidy (R-LA): A physician himself, Cassidy told Politico, “Can’t sugarcoat it. Doesn’t look good,” adding, “The CBO score was, shall we say, an eye-popper.” He told TPM the score was “awful.” “President Trump says he wants as many people covered as under Obamacare, and in that Washington Post article he said health care should be affordable. So if there’s truly 24 million people [losing coverage], of course it’s a concern.”"}, {"44d6": "Sen. Susan Collins (R-ME): Collins said on Monday: “The CBO estimate that millions of Americans could lose their health insurance coverage if the House bill were to become law is cause for alarm. It should prompt the House to slow down and reconsider certain provisions of the bill.”"}, {"822b": "Sen. Tom Cotton (R-AR): In a radio interview on Tuesday, Cotton opined that while the CBO “is not Moses,” he believes the House should have waited for the scoring before taking up the Trumpcare legislation. “It has a lot of useful information for us to digest,” he said. “I think it’s incumbent upon us to evaluate their evidence and facts [to] help improve the bill.”"}, {"41ba": "Sen. Ted Cruz (R-TX):According to an ABC News reporter, Cruz said Tuesday that the scoring showed that “under the House bill, premiums would continue to rise next year and the year thereafter. That is unacceptable.”"}, {"cfde": "Sen. Steve Daines (R-MT): In a statement in response to the CBO report, Daines said, “We need to do better… I want to see costs and premiums go down to make health care more affordable for Montana families.”"}, {"dc0a": "Sen. Cory Gardner (R-CO): According to Politico, Gardner — who has expressed concerns about the Medicaid rollback provisions in Trumpcare — said, “We’ve got work to do here” in response to the CBO score."}, {"eb73": "Sen. Lindsey Graham (R-SC): Graham told reporters on Monday, “At the end of the day we should pause and try to improve the product in the light of the CBO analysis rather than just rejecting it.” He defended the nonpartisan effort, observing, “We like the CBO when they agree with us. When they don’t, they’re a bunch of losers… If half of what they’re saying is true, then I think we should slow down and see if we address it.”"}, {"a667": "Sen. Orrin Hatch (R-UT): In response to questions about the increase in uninsured estimated by the CBO, the Senate Finance Chairman said, “Naturally, I’m concerned.”"}, {"d8f2": "Sen. John McCain (R-AZ): TPM reported on Monday that McCain said that while the CBO was “wildly wrong on the initial estimates of Obamacare,” he also conceded, “I’m very worried about what the House bill would do to Arizona.”"}, {"c320": "Sen. David Perdue (R-GA): According to the Washington Post, after the CBO report, Perdue told reporters, “I’m not going to tell the House what to do, but it’s important that we slow this down and get this right.”"}, {"32de": "Rep. Mark Amodei (R-NV): In response to the CBO scoring, Amodei told the Associated Press that he was disappointed in the GOP leadership for not getting more testimony before writing the bill and that if he had to vote today, he would likely vote no. He observed, “Quite frankly it looks right now that Nancy Pelosi was much more efficient.”"}, {"50e7": "Rep. Ron DeSantis (R-FL): DeSantis told Fox Business on Tuesday that the “damaging part of that CBO report was they predicted — and I don’t know if this is true but I think there’s an argument that it is — 15 to 20 percent premium increases over the next several years over and above the Obamacare increases. Well, if that happens, then I think it’s gonna be even more difficult for people.”"}, {"c237": "Rep. Mark Walker (R-NC): The chairman of the 170-plus member Republican Study Committee put out a statement noting that the CBO score “does little to alleviate our conservative concerns for this Obamacare replacement bill.”"}, {"7e53": "Rep. Rob Wittman (R-VA): Wittman announced his opposition to the Trumpcare legislation on Monday. “After reviewing this legislation and receiving the Congressional Budget Office score today, it is clear that this bill is not consistent with the repeal and replace principles for which I stand,” he explained, adding that as he does not think the proposal will do “what is necessary for the short and long-term best interests of Virginians.”"}, {"a1fa": "This post will be updated as more members make statements."}], "content": "Some GOP lawmakers back away from Trumpcare after learning millions will lose insurance Not all Republicans are eager to back a plan that could cost 24 million people their health insurance. Keith Hall is the GOP’s handpicked Congressional Budget Office director. CREDIT: AP Photo/J. Scott Applewhite On Monday, the Congressional Budget Office released its analysis of House Republicans’ plan to replace the Affordable Care Act with a series of smaller tax incentives for consumers and a massive tax cut for health insurance companies with overpaid CEOs. And its assessment that the legislation would result in 24 million more uninsured Americans over ten years has some congressional Republicans worried. Trumpcare could cost 24 million people their insurance, government analysis findsThe Congressional Budget Office just released its much anticipated report. Republicans were right to be scared.thinkprogress.org To push back on the CBO’s findings, Trump administration and Republican leaders have alternately attempted to cherry-pick favorable pieces of the scoring and to undermine the credibility of the non-partisan budget office (which is run by an economist who was handpicked by the congressional GOP leadership in 2015). But a growing number of Republican legislators are indicating that the CBO scoring has given them pause or led them to oppose Trumpcare outright. Sen. Roy Blunt (R-MO): Blunt cheered the money-saving numbers in the CBO score, but conceded reservations about the report as a whole. “In terms of coverage, we need to get a better sense of what Health and Human Services can do,” he observed, adding that the 24 million number was “troublesome” to efforts to pass the bill. Sen. Bill Cassidy (R-LA): A physician himself, Cassidy told Politico, “Can’t sugarcoat it. Doesn’t look good,” adding, “The CBO score was, shall we say, an eye-popper.” He told TPM the score was “awful.” “President Trump says he wants as many people covered as under Obamacare, and in that Washington Post article he said health care should be affordable. So if there’s truly 24 million people [losing coverage], of course it’s a concern.” Sen. Susan Collins (R-ME): Collins said on Monday: “The CBO estimate that millions of Americans could lose their health insurance coverage if the House bill were to become law is cause for alarm. It should prompt the House to slow down and reconsider certain provisions of the bill.” Sen. Tom Cotton (R-AR): In a radio interview on Tuesday, Cotton opined that while the CBO “is not Moses,” he believes the House should have waited for the scoring before taking up the Trumpcare legislation. “It has a lot of useful information for us to digest,” he said. “I think it’s incumbent upon us to evaluate their evidence and facts [to] help improve the bill.” Sen. Ted Cruz (R-TX):According to an ABC News reporter, Cruz said Tuesday that the scoring showed that “under the House bill, premiums would continue to rise next year and the year thereafter. That is unacceptable.” Sen. Steve Daines (R-MT): In a statement in response to the CBO report, Daines said, “We need to do better… I want to see costs and premiums go down to make health care more affordable for Montana families.” Sen. Cory Gardner (R-CO): According to Politico, Gardner — who has expressed concerns about the Medicaid rollback provisions in Trumpcare — said, “We’ve got work to do here” in response to the CBO score. Sen. Lindsey Graham (R-SC): Graham told reporters on Monday, “At the end of the day we should pause and try to improve the product in the light of the CBO analysis rather than just rejecting it.” He defended the nonpartisan effort, observing, “We like the CBO when they agree with us. When they don’t, they’re a bunch of losers… If half of what they’re saying is true, then I think we should slow down and see if we address it.” Sen. Orrin Hatch (R-UT): In response to questions about the increase in uninsured estimated by the CBO, the Senate Finance Chairman said, “Naturally, I’m concerned.” Sen. John McCain (R-AZ): TPM reported on Monday that McCain said that while the CBO was “wildly wrong on the initial estimates of Obamacare,” he also conceded, “I’m very worried about what the House bill would do to Arizona.” Sen. David Perdue (R-GA): According to the Washington Post, after the CBO report, Perdue told reporters, “I’m not going to tell the House what to do, but it’s important that we slow this down and get this right.” Rep. Mark Amodei (R-NV): In response to the CBO scoring, Amodei told the Associated Press that he was disappointed in the GOP leadership for not getting more testimony before writing the bill and that if he had to vote today, he would likely vote no. He observed, “Quite frankly it looks right now that Nancy Pelosi was much more efficient.” Rep. Ron DeSantis (R-FL): DeSantis told Fox Business on Tuesday that the “damaging part of that CBO report was they predicted — and I don’t know if this is true but I think there’s an argument that it is — 15 to 20 percent premium increases over the next several years over and above the Obamacare increases. Well, if that happens, then I think it’s gonna be even more difficult for people.” Rep. Mark Walker (R-NC): The chairman of the 170-plus member Republican Study Committee put out a statement noting that the CBO score “does little to alleviate our conservative concerns for this Obamacare replacement bill.” Rep. Rob Wittman (R-VA): Wittman announced his opposition to the Trumpcare legislation on Monday. “After reviewing this legislation and receiving the Congressional Budget Office score today, it is clear that this bill is not consistent with the repeal and replace principles for which I stand,” he explained, adding that as he does not think the proposal will do “what is necessary for the short and long-term best interests of Virginians.” This post will be updated as more members make statements. ", "child": "1087_1\t1087_2\t1087_3\t1087_4\t1087_5"}