{"name": "1088", "parent": "", "title": "Here’s how many people could die if Trumpcare becomes law", "sentences": [{"283f": "Here’s how many people could die if Trumpcare becomes law"}, {"7d44": "If an army did this, we would call it an atrocity."}, {"b7f8": "CREDIT: Jim Lo Scalzo/Pool Image via AP"}, {"1d89": "Approximately 17,000 people could die in 2018 who otherwise would have lived if a House Republican health proposal endorsed by the Trump administration becomes law. By 2026, the number of people killed by Trumpcare could grow to approximately 29,000 in that year alone."}, {"2e6e": "Determining the exact number of deaths that could occur each year due to a lack of access to insurance is not an exact science. But ThinkProgress calculated these estimates by examining two sources."}, {"18e3": "The first is a Congressional Budget Office report released Monday afternoon that details the impact of the House Republican health bill. It estimates that “in 2018, 14 million more people would be uninsured under the legislation than under current law,” and projects this number will rise to “24 million in 2026.”"}, {"45c4": "The most overrated intellect in Washingtonthinkprogress.org"}, {"c7ff": "The second source is a study examining the change in Massachusetts mortality rates after the state enacted health reforms similar to the Affordable Care Act. That study, which looked at adults aged 20 to 64, estimated that “for every 830 adults gaining insurance coverage there was one fewer death per year.”"}, {"819e": "Fourteen million divided by 830 equals 16,867 people potentially sentenced to die by Trumpcare. By 2026, if the CBO’s estimate is correct, that number could rise to 28,916 deaths in one year."}, {"6cac": "Other researchers have found slightly different estimates for deaths resulting from uninsurance. A Harvard study suggests that a little more than 23,000 people will die in 2026 if Trumpcare becomes law."}, {"5031": "Nevertheless, the Massachusetts study was deemed sufficiently reliable by a long list of public health scholars and the American Public Health Association, who used the study’s 1 in 830 estimate in a brief to the Supreme Court of the United States arguing in favor of preserving major elements of Obamacare."}], "content": "Here’s how many people could die if Trumpcare becomes law If an army did this, we would call it an atrocity. CREDIT: Jim Lo Scalzo/Pool Image via AP Approximately 17,000 people could die in 2018 who otherwise would have lived if a House Republican health proposal endorsed by the Trump administration becomes law. By 2026, the number of people killed by Trumpcare could grow to approximately 29,000 in that year alone. Determining the exact number of deaths that could occur each year due to a lack of access to insurance is not an exact science. But ThinkProgress calculated these estimates by examining two sources. The first is a Congressional Budget Office report released Monday afternoon that details the impact of the House Republican health bill. It estimates that “in 2018, 14 million more people would be uninsured under the legislation than under current law,” and projects this number will rise to “24 million in 2026.” The most overrated intellect in Washingtonthinkprogress.org The second source is a study examining the change in Massachusetts mortality rates after the state enacted health reforms similar to the Affordable Care Act. That study, which looked at adults aged 20 to 64, estimated that “for every 830 adults gaining insurance coverage there was one fewer death per year.” Fourteen million divided by 830 equals 16,867 people potentially sentenced to die by Trumpcare. By 2026, if the CBO’s estimate is correct, that number could rise to 28,916 deaths in one year. Other researchers have found slightly different estimates for deaths resulting from uninsurance. A Harvard study suggests that a little more than 23,000 people will die in 2026 if Trumpcare becomes law. Nevertheless, the Massachusetts study was deemed sufficiently reliable by a long list of public health scholars and the American Public Health Association, who used the study’s 1 in 830 estimate in a brief to the Supreme Court of the United States arguing in favor of preserving major elements of Obamacare. ", "child": "1088_1\t1088_2\t1088_3\t1088_4\t1088_5\t1088_6\t1088_7\t1088_8\t1088_9\t1088_10\t1088_11\t1088_12\t1088_13\t1088_14\t1088_15\t1088_16\t1088_17\t1088_18\t1088_19\t1088_20\t1088_21"}