{"name": "1089", "parent": "", "title": "Paul Ryan won’t say how many people will lose insurance under Trumpcare", "sentences": [{"8b72": "Paul Ryan won’t say how many people will lose insurance under Trumpcare"}, {"3ee1": "“It’s up to people.”"}, {"3c14": "CREDIT: AP Photo/J. Scott Applewhite"}, {"8dcb": "On Sunday, Trumpcare architect-in-chief Speaker Paul Ryan (R-WI) said he didn’t know how many people would lose their insurance under his Obamacare replacement plan."}, {"f8d7": "In a revealing exchange with CBS News, he suggested that it was “up to people” how far the uninsured rate would climb."}, {"e790": "“Here’s the premise of your question: Are you going to stop mandating people buy health insurance?” he said. “People are going to do what they want to do with their lives, because we believe in individual freedom in this country. So the question is, are we providing a system where people have access to health care insurance if they choose to do so?”"}, {"c645": "In a sense, Ryan is correct that it would be “up to people” how much health coverage would shrink. Trumpcare provides more “freedom” than Obamacare by scrapping the individual mandate — the provision of the Affordable Care Act which penalizes individuals who choose to go without health insurance — and replacing it with a new system that punishes anyone who tries to leave the insurance pool and then come back later on."}, {"c11b": "The individual mandate exists to prevent what health policy experts call a “death spiral,” where insurance premiums climb asymptotically as the cost of insuring people becomes more and more expensive. Here’s how it works: Without the mandate, healthier people have less incentive to buy insurance, so it’s likelier that more of them would drop out of the insurance market. But that makes the risk pool riskier, since it would now be disproportionately comprised of people who are sicker, and therefore costlier to insure. That would force insurance companies to raise their premiums, which in turn would push more individuals to drop their insurance, leaving behind an even higher-risk pool and causing premiums to shoot up even more. And so on."}, {"8fc6": "Paul Ryan admitted he has no idea how health insurance worksLadies and gentlemen, meet the conservative movement’s Great Wonk.thinkprogress.org"}, {"fb19": "In his CBS interview, Ryan suggested that the insured rate would drop because, without the mandate, people would be more free to choose life without health insurance. But those who make that choice will disproportionately be the young and healthy, and by leaving the insurance market they would end up driving premiums sky high for those who remain. It’s likely that health insurance would then become far too expensive even for many of those who do want it."}, {"4950": "That’s a strange kind of liberty: A world where everyone has, in theory, the abstract freedom to buy health insurance, but only a select few can actually afford it."}, {"1783": "For those who love that particular kind of freedom, the Trumpcare bill includes even more good news: Because it reduces subsidies for low-income people to buy insurance, health care would start getting more expensive under the law even before the death spiral kicked in."}], "content": "Paul Ryan won’t say how many people will lose insurance under Trumpcare “It’s up to people.” CREDIT: AP Photo/J. Scott Applewhite On Sunday, Trumpcare architect-in-chief Speaker Paul Ryan (R-WI) said he didn’t know how many people would lose their insurance under his Obamacare replacement plan. In a revealing exchange with CBS News, he suggested that it was “up to people” how far the uninsured rate would climb. “Here’s the premise of your question: Are you going to stop mandating people buy health insurance?” he said. “People are going to do what they want to do with their lives, because we believe in individual freedom in this country. So the question is, are we providing a system where people have access to health care insurance if they choose to do so?” In a sense, Ryan is correct that it would be “up to people” how much health coverage would shrink. Trumpcare provides more “freedom” than Obamacare by scrapping the individual mandate — the provision of the Affordable Care Act which penalizes individuals who choose to go without health insurance — and replacing it with a new system that punishes anyone who tries to leave the insurance pool and then come back later on. The individual mandate exists to prevent what health policy experts call a “death spiral,” where insurance premiums climb asymptotically as the cost of insuring people becomes more and more expensive. Here’s how it works: Without the mandate, healthier people have less incentive to buy insurance, so it’s likelier that more of them would drop out of the insurance market. But that makes the risk pool riskier, since it would now be disproportionately comprised of people who are sicker, and therefore costlier to insure. That would force insurance companies to raise their premiums, which in turn would push more individuals to drop their insurance, leaving behind an even higher-risk pool and causing premiums to shoot up even more. And so on. Paul Ryan admitted he has no idea how health insurance worksLadies and gentlemen, meet the conservative movement’s Great Wonk.thinkprogress.org In his CBS interview, Ryan suggested that the insured rate would drop because, without the mandate, people would be more free to choose life without health insurance. But those who make that choice will disproportionately be the young and healthy, and by leaving the insurance market they would end up driving premiums sky high for those who remain. It’s likely that health insurance would then become far too expensive even for many of those who do want it. That’s a strange kind of liberty: A world where everyone has, in theory, the abstract freedom to buy health insurance, but only a select few can actually afford it. For those who love that particular kind of freedom, the Trumpcare bill includes even more good news: Because it reduces subsidies for low-income people to buy insurance, health care would start getting more expensive under the law even before the death spiral kicked in. ", "child": "1089_1\t1089_2\t1089_3\t1089_4"}