{"name": "109", "parent": "", "title": "The Cleveland Cavaliers Are Forced To Lie In The Bed They Made Themselves", "sentences": [{"1a77": "The Cleveland Cavaliers Are Forced To Lie In The Bed They Made Themselves"}, {"153b": "(Wikipedia Commons)"}, {"6c1b": "The Cleveland Cavaliers have been pretty blatant with their intentions throughout the season. Time and time again, the Cavaliers have stressed the importance of having players rested and healthy for the playoffs. The Cavaliers’ lackadaisical approach, however, has finally caught up with them, likely netting them the second seed in the Eastern Conference Playoffs. The Cavaliers have only themselves to blame."}, {"3ea4": "It is hard to buy that the Cavaliers simply didn’t care about the first seed in the playoffs, given how they played last Wednesday night in Boston (on the second night of a back-to-back, no less) and even through three quarters Sunday in Atlanta. Truthfully, the second seed may, in fact, prove the easier path to the Finals. Still, the Cavaliers have a chance to lock up the top spot with a win Wednesday coupled with a Celtics loss, but that’s just not the point."}, {"2297": "To insinuate that the Cavaliers are light-years away from being a championship team just isn’t fair. After all, while the Cavaliers were struggling, so were the Celtics who only trailed the Cavs by two-and-a-half games at the All-Star break. The Cavs have shown their ceiling as recently as the past week — that ceiling is high. Where the Cavs struggle is maintaining the effort for 48 minutes in games that, to them, don’t matter."}, {"bc66": "The Warriors Are Fun AgainThe Warriors have re-discovered the joy that helps make them special. Can they retain it with Kevin Durant back in the…16winsaring.com"}, {"92c2": "It’s not like the Cavaliers have a new array of troubles that they didn’t have last year, either. Last season, the Cavaliers were poor at defending the pick and roll, they struggled playing with big leads, they lost to teams they had no business losing to, and they pretty well coasted into the playoffs."}, {"a938": "All of that is well and good. For the Cavs, unfortunately, all of that is the good news."}, {"65a1": "Here’s the bad news: Cavaliers players took multiple games for rest throughout the season in hopes that the rest would allow for healing would result in eventual peak performance. Here lies the problem: Sitting players implies that when those players are on the floor, they are going to exert maximum effort, at least for a high percentage of the time. That has not been the case for the Cavaliers."}, {"d179": "Instead of using rest days to prevent lackluster performances, the Cavaliers have mixed resting players and conceding games along with lackluster performances, many of which have come against bad teams. Whether or not this ultra-conservation of energy will pay off remains to be seen, but one thing is for sure: The product hasn’t looked good as of late."}, {"8c07": "The Palace’s Finale Marks End Of An EraAs the Pistons close their home schedule against the Washington Wizards on Monday, they will play their final game at…16winsaring.com"}, {"f21d": "When the Cavs’ brass assessed the team’s season at the All-Star break, months before the conclusion of the season, they likely pegged late-season back-to-backs as automatic rest days. No one anticipated that late-season games in Atlanta and Miami would have any bearing on playoff seeding."}, {"283e": "Even with the late-season struggles, the Cavaliers still have the belief that they will be playing into late June. Though the end game has been hard to visualize lately, there still is one in mind. The Cavaliers will continue to work to achieve it."}], "content": "The Cleveland Cavaliers Are Forced To Lie In The Bed They Made Themselves (Wikipedia Commons) The Cleveland Cavaliers have been pretty blatant with their intentions throughout the season. Time and time again, the Cavaliers have stressed the importance of having players rested and healthy for the playoffs. The Cavaliers’ lackadaisical approach, however, has finally caught up with them, likely netting them the second seed in the Eastern Conference Playoffs. The Cavaliers have only themselves to blame. It is hard to buy that the Cavaliers simply didn’t care about the first seed in the playoffs, given how they played last Wednesday night in Boston (on the second night of a back-to-back, no less) and even through three quarters Sunday in Atlanta. Truthfully, the second seed may, in fact, prove the easier path to the Finals. Still, the Cavaliers have a chance to lock up the top spot with a win Wednesday coupled with a Celtics loss, but that’s just not the point. To insinuate that the Cavaliers are light-years away from being a championship team just isn’t fair. After all, while the Cavaliers were struggling, so were the Celtics who only trailed the Cavs by two-and-a-half games at the All-Star break. The Cavs have shown their ceiling as recently as the past week — that ceiling is high. Where the Cavs struggle is maintaining the effort for 48 minutes in games that, to them, don’t matter. The Warriors Are Fun AgainThe Warriors have re-discovered the joy that helps make them special. Can they retain it with Kevin Durant back in the…16winsaring.com It’s not like the Cavaliers have a new array of troubles that they didn’t have last year, either. Last season, the Cavaliers were poor at defending the pick and roll, they struggled playing with big leads, they lost to teams they had no business losing to, and they pretty well coasted into the playoffs. All of that is well and good. For the Cavs, unfortunately, all of that is the good news. Here’s the bad news: Cavaliers players took multiple games for rest throughout the season in hopes that the rest would allow for healing would result in eventual peak performance. Here lies the problem: Sitting players implies that when those players are on the floor, they are going to exert maximum effort, at least for a high percentage of the time. That has not been the case for the Cavaliers. Instead of using rest days to prevent lackluster performances, the Cavaliers have mixed resting players and conceding games along with lackluster performances, many of which have come against bad teams. Whether or not this ultra-conservation of energy will pay off remains to be seen, but one thing is for sure: The product hasn’t looked good as of late. The Palace’s Finale Marks End Of An EraAs the Pistons close their home schedule against the Washington Wizards on Monday, they will play their final game at…16winsaring.com When the Cavs’ brass assessed the team’s season at the All-Star break, months before the conclusion of the season, they likely pegged late-season back-to-backs as automatic rest days. No one anticipated that late-season games in Atlanta and Miami would have any bearing on playoff seeding. Even with the late-season struggles, the Cavaliers still have the belief that they will be playing into late June. Though the end game has been hard to visualize lately, there still is one in mind. The Cavaliers will continue to work to achieve it. ", "child": "109_1"}