{"name": "1092", "parent": "", "title": "Desperate to pass Trumpcare, Ryan and Trump agree to punish poor people even more", "sentences": [{"259f": "Desperate to pass Trumpcare, Ryan and Trump agree to punish poor people even more"}, {"d8ba": "Ryan, Trump woo fringe by making cruel bill crueler."}, {"d255": "President Donald Trump and Speaker Paul Ryan (R-WI). CREDIT: AP Photo/Evan Vucci"}, {"377a": "In a sane world, the problem with the House’s Trumpcare bill would be that it kicks 14 million people off of their health insurance in year one and uses the savings to give rich people a big tax cut."}, {"e8a4": "In our world, though, the problem for Speaker Paul Ryan (R-WI) was that scores of his own members didn’t think the bill was harsh enough. With only a couple dozen votes to spare in the House, and party leaders rushing toward a vote to minimize public scrutiny, the initial revolt was enough to force tweaks."}, {"8afd": "Those changes landed Monday night in the form of a “manager’s amendment” to the Trumpcare proposal. The amendment makes Medicaid cuts even deeper, frees up governors to raid the program to plug other budget holes, and ends Medicaid expansion under Obamacare much sooner than Ryan’s original bill."}, {"e2f6": "Trumpcare could cost 24 million people their insurance, government analysis findsThe Congressional Budget Office just released its much anticipated report. Republicans were right to be scared.thinkprogress.org"}, {"f794": "States could choose to get their federal Medicaid reimbursement funding in the form of a block grant under the amended bill. The bill imposes an artificial funding scarcity for Medicaid whether governors opt for the block-grant option or not. But many would likely jump at the opportunity to treat the huge sums involved in federal Medicaid payments as general revenue not explicitly linked to health care spending."}, {"8363": "The previous version’s “per-capita cap” would have slowly starved Medicaid beginning in about 2020, ending the common-sense tradition of reimbursing states based on how much they actually spend to cover health care costs for enrollees."}, {"e2f0": "The new version accelerates that process of shoving poor, disabled, and elderly people off a health care cliff. Medicaid expansion would freeze immediately rather than in two years. While the 11 million slightly-less-poor-than-the-poverty-line Americans who today receive health insurance thanks to Obamacare’s expansion of Medicaid would technically be grandfathered in, there’s a false bottom to their recently-gained financial and medical security."}, {"0e21": "Anyone whose coverage lapses, or who takes a seasonal job that bumps their income up too high to be covered, would not be able to re-enroll in Medicaid after that blip. At the same time, the topline reductions in federal Medicaid spending would create fiscal attrition, effectively forcing states to throw Medicaid expansion patients back into the uninsured gutter a bit more quickly than the first version of Trumpcare."}, {"493c": "The amendment also adds a cash incentive for states to impose work requirements for non-pregnant, non-disabled, non-elderly Medicaid recipients. Work requirements in anti-poverty programs are a longstanding and bipartisan white whale, despite their failure to achieve anything other than higher poverty rates."}, {"5c68": "Medicaid will be no exception, Center on Budget and Policy Priorities health care policy expert Judy Solomon told ThinkProgress. “While most adults on Medicaid already do work, the work requirement would likely prevent other eligible people from enrolling, including, for example, a young adult attending college, a married mother taking care of an infant, or an adult caring for an aging parent,” Solomon said."}, {"b459": "Some GOP lawmakers back away from Trumpcare after learning millions will lose insuranceNot all Republicans are eager to back a plan that could cost 24 million people their health insurance.thinkprogress.org"}, {"75ef": "A few key low-ranking Republicans have already hinted the changes will secure their votes. A dozen members of the hard-right Republican Study Committee summoned to the White House on Friday agreed to embrace Trumpcare if the deeper Medicaid cuts were added, Rep. Mark Walker (R-NC) told the Washington Post."}, {"8504": "Trumpcare 1.0 would have slashed Medicaid by $880 billion over the next decade, according to the Congressional Budget Office. There is no score yet for Trumpcare 2.0, which Ryan is likely to bring to the floor before the non-partisan bean-counters get a chance to update their findings. But its Medicaid cuts will be at least as large — and probably larger — thanks to the changes Ryan and President Donald Trump made to pacify resistance from their political right."}, {"873c": "The amendments to Trumpcare effectively trade American lives for Republican votes. Like its predecessor, the 2.0 version is a swindle masquerading as technical, wonky reform. It will take medical care away from low-income families, which will mean more people in those families die sooner than they would have if they could still afford insurance coverage."}], "content": "Desperate to pass Trumpcare, Ryan and Trump agree to punish poor people even more Ryan, Trump woo fringe by making cruel bill crueler. President Donald Trump and Speaker Paul Ryan (R-WI). CREDIT: AP Photo/Evan Vucci In a sane world, the problem with the House’s Trumpcare bill would be that it kicks 14 million people off of their health insurance in year one and uses the savings to give rich people a big tax cut. In our world, though, the problem for Speaker Paul Ryan (R-WI) was that scores of his own members didn’t think the bill was harsh enough. With only a couple dozen votes to spare in the House, and party leaders rushing toward a vote to minimize public scrutiny, the initial revolt was enough to force tweaks. Those changes landed Monday night in the form of a “manager’s amendment” to the Trumpcare proposal. The amendment makes Medicaid cuts even deeper, frees up governors to raid the program to plug other budget holes, and ends Medicaid expansion under Obamacare much sooner than Ryan’s original bill. Trumpcare could cost 24 million people their insurance, government analysis findsThe Congressional Budget Office just released its much anticipated report. Republicans were right to be scared.thinkprogress.org States could choose to get their federal Medicaid reimbursement funding in the form of a block grant under the amended bill. The bill imposes an artificial funding scarcity for Medicaid whether governors opt for the block-grant option or not. But many would likely jump at the opportunity to treat the huge sums involved in federal Medicaid payments as general revenue not explicitly linked to health care spending. The previous version’s “per-capita cap” would have slowly starved Medicaid beginning in about 2020, ending the common-sense tradition of reimbursing states based on how much they actually spend to cover health care costs for enrollees. The new version accelerates that process of shoving poor, disabled, and elderly people off a health care cliff. Medicaid expansion would freeze immediately rather than in two years. While the 11 million slightly-less-poor-than-the-poverty-line Americans who today receive health insurance thanks to Obamacare’s expansion of Medicaid would technically be grandfathered in, there’s a false bottom to their recently-gained financial and medical security. Anyone whose coverage lapses, or who takes a seasonal job that bumps their income up too high to be covered, would not be able to re-enroll in Medicaid after that blip. At the same time, the topline reductions in federal Medicaid spending would create fiscal attrition, effectively forcing states to throw Medicaid expansion patients back into the uninsured gutter a bit more quickly than the first version of Trumpcare. The amendment also adds a cash incentive for states to impose work requirements for non-pregnant, non-disabled, non-elderly Medicaid recipients. Work requirements in anti-poverty programs are a longstanding and bipartisan white whale, despite their failure to achieve anything other than higher poverty rates. Medicaid will be no exception, Center on Budget and Policy Priorities health care policy expert Judy Solomon told ThinkProgress. “While most adults on Medicaid already do work, the work requirement would likely prevent other eligible people from enrolling, including, for example, a young adult attending college, a married mother taking care of an infant, or an adult caring for an aging parent,” Solomon said. Some GOP lawmakers back away from Trumpcare after learning millions will lose insuranceNot all Republicans are eager to back a plan that could cost 24 million people their health insurance.thinkprogress.org A few key low-ranking Republicans have already hinted the changes will secure their votes. A dozen members of the hard-right Republican Study Committee summoned to the White House on Friday agreed to embrace Trumpcare if the deeper Medicaid cuts were added, Rep. Mark Walker (R-NC) told the Washington Post. Trumpcare 1.0 would have slashed Medicaid by $880 billion over the next decade, according to the Congressional Budget Office. There is no score yet for Trumpcare 2.0, which Ryan is likely to bring to the floor before the non-partisan bean-counters get a chance to update their findings. But its Medicaid cuts will be at least as large — and probably larger — thanks to the changes Ryan and President Donald Trump made to pacify resistance from their political right. The amendments to Trumpcare effectively trade American lives for Republican votes. Like its predecessor, the 2.0 version is a swindle masquerading as technical, wonky reform. It will take medical care away from low-income families, which will mean more people in those families die sooner than they would have if they could still afford insurance coverage. ", "child": "1092_1\t1092_2\t1092_3\t1092_4\t1092_5\t1092_6\t1092_7\t1092_8\t1092_9\t1092_10"}