{"name": "1098", "parent": "", "title": "Obamacare v. Trumpcare", "sentences": [{"7505": "Obamacare v. Trumpcare"}, {"45ed": "From Affordable Care (not really) To Utter Chaos"}, {"8e3f": "I don’t really care who you are, or what you are, what your political affiliation is, what your gender identity is, your religion, your socio-economic status, your race, color or creed, your DNA. I don’t care. If you aren’t paying attention to what is going on with healthcare right now, you really don’t value your life — and I hope that you don’t realize that too late. (Like say when you’re the victim of a hit-and-run and realize that the ambulance is not coming and you are bleeding out on the street.) Because if Trumpcare get’s passed in the House today, and in the Senate next week, that’s happening."}, {"14fe": "There will be a lot of people dying in the streets, all thanks to that amazing and wonderful Trumpcare, Trump promised. And a promise is a promise. Trump is keeping his promise!"}, {"9a72": "Don’t we all want Trump to get the full credit he deserves for providing the best healthcare options to date? Oddly enough, Kellyanne doesn’t want that."}, {"42da": "Why doesn’t Trump want his name on the Trumpcare? It’s on everything else! This seems suspect. Maybe, because it’s really this:"}, {"4162": "Trumpcare? Deadcare."}, {"494b": "Trumpcare, now in it’s infancy, is actually a piece of proposed legislation on the table today. Trumpcare, officially called the American Health Care Act (AHCA) is really a tax-cut bill disguised as a health-care reform bill. Clever, clever, clever and tricksy and evil."}, {"bd41": "Not only does Trumpcare NOT provide any additional healthcare coverage, at an affordable rate (as Obamacare attempted to do, albeit badly) it provides a a massive tax giveaway to the wealthy — as much as $1 trillion over 10 years."}, {"5491": "How can this be? How can this possibly be the case when, Trump, and his legion of supporters have been ranting, raving and in some cases foaming at the mouth about how Trump is going to Make America Great Again! (And he will.) Read the fine print, though…(for the incredibly wealthy only.) The rest of us, not quite millionaires, well, we can all just die."}, {"086e": "What was Promised….the Fantasy"}, {"3693": "But Trump made promises! He made so many amazing promises! Especially about healthcare! He couldn’t have been any clearer. Everyone is getting healthcare! Everyone? Yes, everyone! And, it’s going to be cheap! It’s going to be great! It’s going to be ten times better than Obamacare. Just Listen here:"}, {"c088": "Or if you want the serious version here:"}, {"48b4": "The Reality"}, {"1c28": "First of all our health care system, before Trump or Obama, corrupt, corrupt, corrupt. It is a corrupt system that places profit above patients every time. It seeks to get the most profit out of patients (via their insurance) with little regard for what the patient actually needs or what will heal the patient — so there is that. This is without the politicians trying to fix anything."}, {"e217": "I could go on and on and on about the hows and whys, and about all the sins of Big Pharma and Big Med, about the appalling real life true story behind the film Puncture. But I won’t."}, {"ae1b": "As horrible as all of that is, as little as Obamacare did to fix any of it, Trumpcare is worse. It’s a Trojan Horse for the rich. Seriously. You’ll only catch this if you are paying attention, again, to the fine print delivered by The Week. It’s about Wall Street, freaking over Trumpcare. (What the billionaires aren’t getting their tax cuts? Damn!) Also, important to note, you will find the unfakest news on the business sites, because all they are concerned about is the money, and they are going to be factually accurate when it comes down to what’s what with the stocks and the money.)"}, {"ef1f": "Also, check out this interview with Congressman Mark Pocan, going over what is really going on with Trumpcare. (Also the crazy FBI, Russia, “Obama tapped my wires” stuff. And callers. The callers sound a little looney, but the Congressman is on point.)"}, {"bdd3": "Okay, okay the Russia stuff is just nuts! But who can even focus on that? (Seriously, like someone should be focusing on that.) But not me. Because this is about healthcare (or lack thereof in America)."}, {"b657": "Americans were screaming for affordable healthcare, because even before Obamacare, the system was a mess! So we get Obamacare (the Affordable Care Act) and Obamacare is not great…it really isn’t. It’s a pretty crazy and complex piece of legislation, 10,000 pages long, with all kind of weirdo stuff inside of it. It has Cadillac taxes in it. It has penalties for those too poor to afford healthcare. It has ridiculously high premiums and bogus plans that don’t offer a damn thing."}, {"23f2": "But…along comes Trumpcare — not only does it NOT fix Obamacare, it guts everything good about it. (Obamacare was a mixed bag, there was some good with it — forcing insurance companies to cover people on their parent’s plan until age 26, covering maternity benefits, covering pre-existing conditions, covering mental health issues and addiction issues.)"}, {"104e": "Ironically, today, of all days, the Brookings Institute released findings on soaring white working class mortality rates. American whites are dying at an unprecedented rate (yup I spelled that right and I’m not even the president of the United States.) One of the tragedies facing this population (Trump’s loyal base), is a heroine epidemic. They need healthcare and they desperately need it now, and they need for it to treat substance abuse issues clearly; and yet Trumpcare may just gut those services from healthcare coverage."}, {"ecb9": "Ask me about women’s health under Trumpcare. (No don’t.) It’s pretty dire actually. Who needs to have maternity care covered? Not women! Planned Parenthood, which provides all sorts of women health services, is of course endanger of losing all federal funding. And also, some, Pub senators find breast cancer funny. I’ll get to that momentarily."}, {"2dcb": "Most alarming, however is not what Trumpcare doesn’t do, but what it does. Trumpcare sets the stage to allow the Pubs to financially nuke the struggling middle class and obliterate the poor, (first thing we do, is we kill all the poor people) using all these little funky funny technicalities that only politicians know about — budget reconciliation for example."}, {"b3cb": "Trumpcare, which Congress votes on today was supposed to replace Obamacare, with something better. But that is not what it does at all. Trumpcare is actually a vehicle to provide massive tax cuts to the wealthy. And Trump doesn’t even pretend that it is anything different. Check out his response when questioned by Tucker Carlson, on how the legislation on the table, does not benefit Trump’s middle/working class base:"}, {"bc47": "And David Pakman is right. The Trumpsters will actually deny that Trump said, this, this right here, on the video above, and in stereo. I know they will, because, this video has made the rounds and yes the Trumpsters are all: It’s fake news! Trump didn’t say this! (But, ummmm, he just said it. Did you not see the video?) No matter how badly beaten down they will be by this particular legislation, they will insist that the really bad Trumpcare is the fault of radical Islam, or Black Lives Matter activists, or Mexican rapists, stealing all the good Trumpcare. And aliens photoshopped the video, by the way. Absolutely they did. In fact, that’s an alien pretending to be Trump talking. Everyone knows that! Because Fox and Breibart said so. So there you have it. It’s a fact. That’s the real news. (Don’t expect logic or reason, ever, from a Trumpster.)"}, {"8bfc": "What if Trumpcare doesn’t pass though, it might not. Why is this? Is there some sanity in the Pub party? Are their pubs saying, hey…wait a minute, this will cause my constituents, (especially the ones on rural communities with limited access to doctors and hospitals already) to die unnecessarily if you gut Obamacare? Ummmm, very few. It’s mostly the Dems, (whispering, really) hey this is gonna benefit the wealthy few, and murder death kill everyone else."}, {"9002": "Still…it might not pass. Not because of whispering Dems. The irony is that the real threat to Trumpcare is hardline Pubs blocking it because Trumpcare is not draconian enough. It’s like they can’t see the forest (give wealthy people whatever they want) for the trees (Trumpcare still gives to many people too much healthcare.)"}, {"9c8f": "Apparently, the Freedom Caucus prefers a legislation that calls for snatching sick people up, slicing their throats and throwing them into dumpsters and landfills immediately, and especially if they are babies and really, especially if they are babies of color. (I am being facetious…not really, though. Because even though they are not saying this on record, I bet such things have been said, behind closed doors.)"}, {"dc8d": "This is the kind of thing Senator Pat Roberts is saying about mammograms with doors open:"}, {"c5d6": "“I sure don’t want my mammogram benefits taken away,”"}, {"364b": "This was his flippant response when he was asked by Alice Ollstein, Think Progress reporter, about whether he supported getting rid of essential benefits. Really? I mean who does that? Who makes fun of breast cancer? Only a really sick, sick prick. After being put on Twitter blast about it, by Alice Ollstein, he’s says he’s sorry. (He ain’t sorry.)"}, {"db0d": "Read all about that."}, {"a7be": "Now this: The Koch are brothers threatening all the hardcore Pubs and the Freedom Caucus, telling them that they better not back Trumpcare. Because it’s Obamacare lite (it’s not, or I guess it could be, it just depends on what you ultimatley want Trumpcare to look like. If you want Trumpcare to look like Pubs snatching up sick people and slicing their throats and throwing them into dumpsters, well then, yes, the current Trumpcare proposal is Obamacare lite. Because it stops short of that."}, {"5a1e": "And poor, poor, Paul Ryan. Don’t the Kochs see how they are ruining everything! He had a plan! If they would just go along with Trumpcare as it is, wealthy people get all their tax breaks. (And isn’t that the Pub goal always?) If they don’t push this through now, (I’m sure Paul Ryan wants to scream at the Freedom Caucus) the wealthy will have to wait on massive tax cuts. They want those tax cuts now. They want Those tax cuts now. They want those tax cuts NOW."}, {"c039": "But that greed…why settle for trillion dollar tax cuts over ten years, when you can demand them in five? Or two. Or NOW. Freedom Caucus is holding out for more, for the billionaires."}, {"be4b": "So, here’s the latest, Trumpcare did not get put to a vote, today. It was scheduled, but…ah well. It just didn’t work out. Not because anyone in particular is looking out for poor little you, average American who just wants decent healthcare at an affordable price (umm you can forget about that). It’s because the Freedom Caucus has marching orders, and they are to hold out until a real, true, total and complete gut of Obamcare is on the table. This… really might not be entirely possible, as the Freedom Caucus does not control the House or the Senate, but they are loud and they are proud and there are a couple of billionaires who totally have their backs. Totally. No wonder they are so cocky. Do you really think you have a shot at resisting these antsy billionaires who want to be trillionaires?"}, {"8ec9": "What is the House Freedom Caucus?A group of conservative agitators who've irked leadership, held the line against spending bills and rebelled against…www.cnn.com"}, {"c038": "So where do we go from here? We resist. We resist Billionaires telling us to all go die, because that’s kinda important, not dying, and you have to draw the line somewhere. You can’t resist when you are dead."}, {"c04e": "Check out resistbot. It’s super easy to text, your Senators. Also those crazy House people too. Simply text 50409. It’s super easy. They will fax letters to your Congress people, based on your text. Tell them no to Trumpcare and also no to Obamacare provisions that do not work. Truly you life is on the line here, as well as Trump’s integrity. Trump promised affordable healthcare for everyone! (Choke, sputter, laugh). Surely he’s going to come through, (right Trumpsters?) because, a promise is a promise."}, {"55a5": "."}], "content": "Obamacare v. Trumpcare From Affordable Care (not really) To Utter Chaos I don’t really care who you are, or what you are, what your political affiliation is, what your gender identity is, your religion, your socio-economic status, your race, color or creed, your DNA. I don’t care. If you aren’t paying attention to what is going on with healthcare right now, you really don’t value your life — and I hope that you don’t realize that too late. (Like say when you’re the victim of a hit-and-run and realize that the ambulance is not coming and you are bleeding out on the street.) Because if Trumpcare get’s passed in the House today, and in the Senate next week, that’s happening. There will be a lot of people dying in the streets, all thanks to that amazing and wonderful Trumpcare, Trump promised. And a promise is a promise. Trump is keeping his promise! Don’t we all want Trump to get the full credit he deserves for providing the best healthcare options to date? Oddly enough, Kellyanne doesn’t want that. Why doesn’t Trump want his name on the Trumpcare? It’s on everything else! This seems suspect. Maybe, because it’s really this: Trumpcare? Deadcare. Trumpcare, now in it’s infancy, is actually a piece of proposed legislation on the table today. Trumpcare, officially called the American Health Care Act (AHCA) is really a tax-cut bill disguised as a health-care reform bill. Clever, clever, clever and tricksy and evil. Not only does Trumpcare NOT provide any additional healthcare coverage, at an affordable rate (as Obamacare attempted to do, albeit badly) it provides a a massive tax giveaway to the wealthy — as much as $1 trillion over 10 years. How can this be? How can this possibly be the case when, Trump, and his legion of supporters have been ranting, raving and in some cases foaming at the mouth about how Trump is going to Make America Great Again! (And he will.) Read the fine print, though…(for the incredibly wealthy only.) The rest of us, not quite millionaires, well, we can all just die. What was Promised….the Fantasy But Trump made promises! He made so many amazing promises! Especially about healthcare! He couldn’t have been any clearer. Everyone is getting healthcare! Everyone? Yes, everyone! And, it’s going to be cheap! It’s going to be great! It’s going to be ten times better than Obamacare. Just Listen here: Or if you want the serious version here: The Reality First of all our health care system, before Trump or Obama, corrupt, corrupt, corrupt. It is a corrupt system that places profit above patients every time. It seeks to get the most profit out of patients (via their insurance) with little regard for what the patient actually needs or what will heal the patient — so there is that. This is without the politicians trying to fix anything. I could go on and on and on about the hows and whys, and about all the sins of Big Pharma and Big Med, about the appalling real life true story behind the film Puncture. But I won’t. As horrible as all of that is, as little as Obamacare did to fix any of it, Trumpcare is worse. It’s a Trojan Horse for the rich. Seriously. You’ll only catch this if you are paying attention, again, to the fine print delivered by The Week. It’s about Wall Street, freaking over Trumpcare. (What the billionaires aren’t getting their tax cuts? Damn!) Also, important to note, you will find the unfakest news on the business sites, because all they are concerned about is the money, and they are going to be factually accurate when it comes down to what’s what with the stocks and the money.) Also, check out this interview with Congressman Mark Pocan, going over what is really going on with Trumpcare. (Also the crazy FBI, Russia, “Obama tapped my wires” stuff. And callers. The callers sound a little looney, but the Congressman is on point.) Okay, okay the Russia stuff is just nuts! But who can even focus on that? (Seriously, like someone should be focusing on that.) But not me. Because this is about healthcare (or lack thereof in America). Americans were screaming for affordable healthcare, because even before Obamacare, the system was a mess! So we get Obamacare (the Affordable Care Act) and Obamacare is not great…it really isn’t. It’s a pretty crazy and complex piece of legislation, 10,000 pages long, with all kind of weirdo stuff inside of it. It has Cadillac taxes in it. It has penalties for those too poor to afford healthcare. It has ridiculously high premiums and bogus plans that don’t offer a damn thing. But…along comes Trumpcare — not only does it NOT fix Obamacare, it guts everything good about it. (Obamacare was a mixed bag, there was some good with it — forcing insurance companies to cover people on their parent’s plan until age 26, covering maternity benefits, covering pre-existing conditions, covering mental health issues and addiction issues.) Ironically, today, of all days, the Brookings Institute released findings on soaring white working class mortality rates. American whites are dying at an unprecedented rate (yup I spelled that right and I’m not even the president of the United States.) One of the tragedies facing this population (Trump’s loyal base), is a heroine epidemic. They need healthcare and they desperately need it now, and they need for it to treat substance abuse issues clearly; and yet Trumpcare may just gut those services from healthcare coverage. Ask me about women’s health under Trumpcare. (No don’t.) It’s pretty dire actually. Who needs to have maternity care covered? Not women! Planned Parenthood, which provides all sorts of women health services, is of course endanger of losing all federal funding. And also, some, Pub senators find breast cancer funny. I’ll get to that momentarily. Most alarming, however is not what Trumpcare doesn’t do, but what it does. Trumpcare sets the stage to allow the Pubs to financially nuke the struggling middle class and obliterate the poor, (first thing we do, is we kill all the poor people) using all these little funky funny technicalities that only politicians know about — budget reconciliation for example. Trumpcare, which Congress votes on today was supposed to replace Obamacare, with something better. But that is not what it does at all. Trumpcare is actually a vehicle to provide massive tax cuts to the wealthy. And Trump doesn’t even pretend that it is anything different. Check out his response when questioned by Tucker Carlson, on how the legislation on the table, does not benefit Trump’s middle/working class base: And David Pakman is right. The Trumpsters will actually deny that Trump said, this, this right here, on the video above, and in stereo. I know they will, because, this video has made the rounds and yes the Trumpsters are all: It’s fake news! Trump didn’t say this! (But, ummmm, he just said it. Did you not see the video?) No matter how badly beaten down they will be by this particular legislation, they will insist that the really bad Trumpcare is the fault of radical Islam, or Black Lives Matter activists, or Mexican rapists, stealing all the good Trumpcare. And aliens photoshopped the video, by the way. Absolutely they did. In fact, that’s an alien pretending to be Trump talking. Everyone knows that! Because Fox and Breibart said so. So there you have it. It’s a fact. That’s the real news. (Don’t expect logic or reason, ever, from a Trumpster.) What if Trumpcare doesn’t pass though, it might not. Why is this? Is there some sanity in the Pub party? Are their pubs saying, hey…wait a minute, this will cause my constituents, (especially the ones on rural communities with limited access to doctors and hospitals already) to die unnecessarily if you gut Obamacare? Ummmm, very few. It’s mostly the Dems, (whispering, really) hey this is gonna benefit the wealthy few, and murder death kill everyone else. Still…it might not pass. Not because of whispering Dems. The irony is that the real threat to Trumpcare is hardline Pubs blocking it because Trumpcare is not draconian enough. It’s like they can’t see the forest (give wealthy people whatever they want) for the trees (Trumpcare still gives to many people too much healthcare.) Apparently, the Freedom Caucus prefers a legislation that calls for snatching sick people up, slicing their throats and throwing them into dumpsters and landfills immediately, and especially if they are babies and really, especially if they are babies of color. (I am being facetious…not really, though. Because even though they are not saying this on record, I bet such things have been said, behind closed doors.) This is the kind of thing Senator Pat Roberts is saying about mammograms with doors open: “I sure don’t want my mammogram benefits taken away,” This was his flippant response when he was asked by Alice Ollstein, Think Progress reporter, about whether he supported getting rid of essential benefits. Really? I mean who does that? Who makes fun of breast cancer? Only a really sick, sick prick. After being put on Twitter blast about it, by Alice Ollstein, he’s says he’s sorry. (He ain’t sorry.) Read all about that. Now this: The Koch are brothers threatening all the hardcore Pubs and the Freedom Caucus, telling them that they better not back Trumpcare. Because it’s Obamacare lite (it’s not, or I guess it could be, it just depends on what you ultimatley want Trumpcare to look like. If you want Trumpcare to look like Pubs snatching up sick people and slicing their throats and throwing them into dumpsters, well then, yes, the current Trumpcare proposal is Obamacare lite. Because it stops short of that. And poor, poor, Paul Ryan. Don’t the Kochs see how they are ruining everything! He had a plan! If they would just go along with Trumpcare as it is, wealthy people get all their tax breaks. (And isn’t that the Pub goal always?) If they don’t push this through now, (I’m sure Paul Ryan wants to scream at the Freedom Caucus) the wealthy will have to wait on massive tax cuts. They want those tax cuts now. They want Those tax cuts now. They want those tax cuts NOW. But that greed…why settle for trillion dollar tax cuts over ten years, when you can demand them in five? Or two. Or NOW. Freedom Caucus is holding out for more, for the billionaires. So, here’s the latest, Trumpcare did not get put to a vote, today. It was scheduled, but…ah well. It just didn’t work out. Not because anyone in particular is looking out for poor little you, average American who just wants decent healthcare at an affordable price (umm you can forget about that). It’s because the Freedom Caucus has marching orders, and they are to hold out until a real, true, total and complete gut of Obamcare is on the table. This… really might not be entirely possible, as the Freedom Caucus does not control the House or the Senate, but they are loud and they are proud and there are a couple of billionaires who totally have their backs. Totally. No wonder they are so cocky. Do you really think you have a shot at resisting these antsy billionaires who want to be trillionaires? What is the House Freedom Caucus?A group of conservative agitators who've irked leadership, held the line against spending bills and rebelled against…www.cnn.com So where do we go from here? We resist. We resist Billionaires telling us to all go die, because that’s kinda important, not dying, and you have to draw the line somewhere. You can’t resist when you are dead. Check out resistbot. It’s super easy to text, your Senators. Also those crazy House people too. Simply text 50409. It’s super easy. They will fax letters to your Congress people, based on your text. Tell them no to Trumpcare and also no to Obamacare provisions that do not work. Truly you life is on the line here, as well as Trump’s integrity. Trump promised affordable healthcare for everyone! (Choke, sputter, laugh). Surely he’s going to come through, (right Trumpsters?) because, a promise is a promise. . ", "child": "1098_1\t1098_2\t1098_3\t1098_4"}