{"name": "1100", "parent": "", "title": "The art of the repeal", "sentences": [{"66b7": "The art of the repeal"}, {"a38e": "Donald Trump is having a tantrum. (Credit: AP Photo)"}, {"bfc5": "Remember when people voted Donald Trump into the White House on the belief he was a savvy businessman and expert negotiator? In the last 24 hours, his administration has managed to take a bill everybody hates and make it worse, alienating more members of his own party in the process and possibly violating yet another law in a last-ditch effort to save it."}, {"2f89": "Donald Trump is not a total loser, though: he took credit for creating 20,000 new jobs (that were announced 18 months ago) and was described as having “perfect genes” (by somebody he employs). Who cares if his administration doesn’t know how pregnancy works?"}, {"e2e2": "Credit: AP Photo"}, {"9150": "Meanwhile, Rep. Devin Nunes (R-CA) abruptly canceled open hearings into whether or not the Trump campaign colluded with allies in Russia."}, {"6e9c": "Reading List"}, {"01a4": "There’s a great college basketball tournament going on right now. Also, the men are still playing."}, {"dfe8": "Trump approved the Keystone XL pipeline today. But there are still hurdles."}, {"3c7e": "Who better to run the Department of Health and Human Services’ Civil Rights Office than a leading opponent of LGBTQ rights?"}, {"9055": "Soundbite"}, {"acae": "“You can figure out a way to change the state you live in.”  — OMB Director Mick Mulvaney, offering one solution to women who will lose their maternity coverage under Trump’s health care bill"}], "content": "The art of the repeal Donald Trump is having a tantrum. (Credit: AP Photo) Remember when people voted Donald Trump into the White House on the belief he was a savvy businessman and expert negotiator? In the last 24 hours, his administration has managed to take a bill everybody hates and make it worse, alienating more members of his own party in the process and possibly violating yet another law in a last-ditch effort to save it. Donald Trump is not a total loser, though: he took credit for creating 20,000 new jobs (that were announced 18 months ago) and was described as having “perfect genes” (by somebody he employs). Who cares if his administration doesn’t know how pregnancy works? Credit: AP Photo Meanwhile, Rep. Devin Nunes (R-CA) abruptly canceled open hearings into whether or not the Trump campaign colluded with allies in Russia. Reading List There’s a great college basketball tournament going on right now. Also, the men are still playing. Trump approved the Keystone XL pipeline today. But there are still hurdles. Who better to run the Department of Health and Human Services’ Civil Rights Office than a leading opponent of LGBTQ rights? Soundbite “You can figure out a way to change the state you live in.”  — OMB Director Mick Mulvaney, offering one solution to women who will lose their maternity coverage under Trump’s health care bill ", "child": "1100_1\t1100_2"}