{"name": "1103", "parent": "", "title": "The American Health Care Act Is Much Closer to A Full Repeal Than Most People (Including Republican Members of Congress) Realize", "sentences": [{"bdc3": "The American Health Care Act Is Much Closer to A Full Repeal Than Most People (Including Republican Members of Congress) Realize"}, {"2dc7": "Critics both left and right have derided Paul Ryan’s American Health Care Act as “Obamacare Lite” or “Obamacare 2.0” or “Obamacare 0.5.” There’s some truth to this, since the AHCA does include 1) some subsidies for those buying coverage on the exchanges; 2) some penalty for not getting coverage (you have to pay an extra 30% to your insurer for a year after re-enrolling); 3) guaranteed issue and community rating (insurers have to charge the same rate to everyone in a given community, varying the rate only based on age, and can’t deny coverage to anyone). Those are indeed the three legs of the Obamacare stool, albeit with two of them in weakened form."}, {"d8ee": "But suppose the subsidies for getting coverage and the penalty for not getting coverage are weakened enough to send the individual market into a death spiral in many states, which I think is likely. How much of Obamacare is left? How would the resulting situation be different from a full Obamacare repeal?"}, {"7fe4": "This is ostensibly the group that Ryan’s plan is supposed to favor. Under Obamacare, these people pay higher rates than they would otherwise. This is because insurance companies have to charge the same prices and offer the same policies to everyone. Healthy people who would get a discount because of their lower expected health care costs don’t get that discount under Obamacare. Wealthy people don’t get any of the Obamacare subsidies. So if you’re healthy and wealthy, Obamacare drives up the price you have to pay for insurance, doesn’t help you with the cost, and forces you to buy it. These people are made worse off by Obamacare (at least for as long as they stay both healthy and wealthy)."}, {"963a": "But the AHCA does not restore the status quo ex ante for this group because it does not repeal guaranteed issue and community rating and essential benefits (Ryan probably would like to, but can’t under Senate reconciliation rules — doing so would require 60 votes to break a filibuster). The healthy and wealthy group would not be able to buy coverage that’s made cheaper by excluding sick people, as in the pre-ACA days. Nor could they buy the kind of low-premium, high-deductible plans that sick people wouldn’t want, because essential benefits and other remaining Obamacare regulations disallow those plans. Instead, in a death spiral, all plans would cover mostly sick people and therefore be extremely expensive. So the healthy and wealthies would mostly just not buy insurance. Which some of them may prefer to the situation under Obamacare where they must buy expensive insurance. But the AHCA is definitely inferior to a full repeal."}, {"948c": "2. The poor and sick get a *little* bit of help."}, {"8933": "I’m really not sure this even counts — the AHCA includes tax credits to those making under $75,000 a year ranging from $2,000 to $4,000 a year depending on age. But if there is a death spiral, people buying coverage will be paying so much more than this that anyone making less than $75k might just have to spend down assets until they qualify for Medicaid or find a way to get on an employer plan. In either case, they wouldn’t be using the subsidies. This is one reason that the AHCA might score as deficit-neutral, despite taking away all of Obamacare’s tax revenue — the tax credits are so meager that few people would end up using them. But these tax credits are the “entitlement” that the Freedom Caucus is upset about."}, {"adcb": "3. The AHCA keeps the under-26 rule."}, {"bef8": "This rule (which allows people to stay covered under their parents’ plan until the age of 26) is so popular (63 percent approval in a recent poll) that it would be crazy to repeal it. Even if the entire ACA were repealed immediately, the House and Senate could probably pass a separate bill passing just this rule."}, {"cd21": "4. The AHCA keeps the ACA’s cuts to Medicare"}, {"28f7": "The ACA struck a deal with hospitals — we’ll bring you a bunch of new customers through the exchanges and Medicaid if you give us a better deal on Medicare. The AHCA reneges on the government’s side of the deal, leaving hospitals with just the cuts to their Medicare reimbursement rates. What exactly hospitals would do about this remains to be seen. I think in the end they would just swallow the losses, but it’s possible that Medicare patients would find getting care more difficult."}, {"ae59": "There are even a couple of ways in which the AHCA is better than the Obamacare repeal from the point of view of a typical House Freedom Caucus member:"}, {"ec2d": "1. States get more flexibility in using Medicaid money."}, {"3a1e": "The AHCA doesn’t just take away Obamacare’s Medicaid expansion, it also reduces the federal government’s oversight on state Medicaid programs."}, {"0cc6": "2. Planned Parenthood gets defunded"}, {"98e9": "Again, this is a change that goes beyond Obamacare repeal. A straight Obamacare repeal would not defund Planned Parenthood, but the AHCA does."}, {"fd3e": "I think that’s pretty much it. The basic structure of Obamacare is to expand coverage through the Medicaid expansion and the creation of the exchanges for non-group coverage, paid for by taxes on the wealthy and reductions in Medicare payments to hospitals. The AHCA wrecks the exchanges, repeals the Medicaid expansion, eliminates the taxes, and keeps the Medicare cuts. The AHCA rolls back the Medicaid expansion (starting in 2020, although there’s an amendment out there that would start the rollback in 2018), and eventually eliminates all of Obamacare’s taxes except the Cadillac tax on high-value employer plans, which itself is pushed back until 2025, which means it will probably never actually go into place. In the end, the biggest piece of Obamacare left standing is the Medicare cuts."}, {"3d65": "Some states have well-functioning enough exchange markets and committed enough state governments that they might be able to prevent the death spirals and end up with a decently-functioning Obamacare Lite or Obamacare 0.5 system. But these are mostly the Democratic states that have expanded Medicaid, kept risk corridors, and so on. The red states who have members of Congress demanding full repeal will get something pretty close to exactly that."}], "content": "The American Health Care Act Is Much Closer to A Full Repeal Than Most People (Including Republican Members of Congress) Realize Critics both left and right have derided Paul Ryan’s American Health Care Act as “Obamacare Lite” or “Obamacare 2.0” or “Obamacare 0.5.” There’s some truth to this, since the AHCA does include 1) some subsidies for those buying coverage on the exchanges; 2) some penalty for not getting coverage (you have to pay an extra 30% to your insurer for a year after re-enrolling); 3) guaranteed issue and community rating (insurers have to charge the same rate to everyone in a given community, varying the rate only based on age, and can’t deny coverage to anyone). Those are indeed the three legs of the Obamacare stool, albeit with two of them in weakened form. But suppose the subsidies for getting coverage and the penalty for not getting coverage are weakened enough to send the individual market into a death spiral in many states, which I think is likely. How much of Obamacare is left? How would the resulting situation be different from a full Obamacare repeal? This is ostensibly the group that Ryan’s plan is supposed to favor. Under Obamacare, these people pay higher rates than they would otherwise. This is because insurance companies have to charge the same prices and offer the same policies to everyone. Healthy people who would get a discount because of their lower expected health care costs don’t get that discount under Obamacare. Wealthy people don’t get any of the Obamacare subsidies. So if you’re healthy and wealthy, Obamacare drives up the price you have to pay for insurance, doesn’t help you with the cost, and forces you to buy it. These people are made worse off by Obamacare (at least for as long as they stay both healthy and wealthy). But the AHCA does not restore the status quo ex ante for this group because it does not repeal guaranteed issue and community rating and essential benefits (Ryan probably would like to, but can’t under Senate reconciliation rules — doing so would require 60 votes to break a filibuster). The healthy and wealthy group would not be able to buy coverage that’s made cheaper by excluding sick people, as in the pre-ACA days. Nor could they buy the kind of low-premium, high-deductible plans that sick people wouldn’t want, because essential benefits and other remaining Obamacare regulations disallow those plans. Instead, in a death spiral, all plans would cover mostly sick people and therefore be extremely expensive. So the healthy and wealthies would mostly just not buy insurance. Which some of them may prefer to the situation under Obamacare where they must buy expensive insurance. But the AHCA is definitely inferior to a full repeal. 2. The poor and sick get a *little* bit of help. I’m really not sure this even counts — the AHCA includes tax credits to those making under $75,000 a year ranging from $2,000 to $4,000 a year depending on age. But if there is a death spiral, people buying coverage will be paying so much more than this that anyone making less than $75k might just have to spend down assets until they qualify for Medicaid or find a way to get on an employer plan. In either case, they wouldn’t be using the subsidies. This is one reason that the AHCA might score as deficit-neutral, despite taking away all of Obamacare’s tax revenue — the tax credits are so meager that few people would end up using them. But these tax credits are the “entitlement” that the Freedom Caucus is upset about. 3. The AHCA keeps the under-26 rule. This rule (which allows people to stay covered under their parents’ plan until the age of 26) is so popular (63 percent approval in a recent poll) that it would be crazy to repeal it. Even if the entire ACA were repealed immediately, the House and Senate could probably pass a separate bill passing just this rule. 4. The AHCA keeps the ACA’s cuts to Medicare The ACA struck a deal with hospitals — we’ll bring you a bunch of new customers through the exchanges and Medicaid if you give us a better deal on Medicare. The AHCA reneges on the government’s side of the deal, leaving hospitals with just the cuts to their Medicare reimbursement rates. What exactly hospitals would do about this remains to be seen. I think in the end they would just swallow the losses, but it’s possible that Medicare patients would find getting care more difficult. There are even a couple of ways in which the AHCA is better than the Obamacare repeal from the point of view of a typical House Freedom Caucus member: 1. States get more flexibility in using Medicaid money. The AHCA doesn’t just take away Obamacare’s Medicaid expansion, it also reduces the federal government’s oversight on state Medicaid programs. 2. Planned Parenthood gets defunded Again, this is a change that goes beyond Obamacare repeal. A straight Obamacare repeal would not defund Planned Parenthood, but the AHCA does. I think that’s pretty much it. The basic structure of Obamacare is to expand coverage through the Medicaid expansion and the creation of the exchanges for non-group coverage, paid for by taxes on the wealthy and reductions in Medicare payments to hospitals. The AHCA wrecks the exchanges, repeals the Medicaid expansion, eliminates the taxes, and keeps the Medicare cuts. The AHCA rolls back the Medicaid expansion (starting in 2020, although there’s an amendment out there that would start the rollback in 2018), and eventually eliminates all of Obamacare’s taxes except the Cadillac tax on high-value employer plans, which itself is pushed back until 2025, which means it will probably never actually go into place. In the end, the biggest piece of Obamacare left standing is the Medicare cuts. Some states have well-functioning enough exchange markets and committed enough state governments that they might be able to prevent the death spirals and end up with a decently-functioning Obamacare Lite or Obamacare 0.5 system. But these are mostly the Democratic states that have expanded Medicaid, kept risk corridors, and so on. The red states who have members of Congress demanding full repeal will get something pretty close to exactly that. ", "child": "1103_1"}