{"name": "1107", "parent": "", "title": "The Numbers on ACA Replacement Are P", "sentences": [{"da12": "The Numbers on ACA Replacement Are Pretty Grim"}, {"eec0": "For the last week, politicians, pundits, and many Americans have been waiting anxiously for the official estimate from the Congressional Budget Office on the effects of the GOP’s proposed Obamacare replacement. Yesterday afternoon, the CBO released its findings, and the outlook isn’t good."}, {"a9e1": "The CBO estimates that, if the current version of the American Health Care Act were to become law, there will be 14 million more uninsured people in this country in 2018—an effect that’s due largely to the elimination of the penalties associated with the individual mandate. By 2020, there would be 21 million more uninsured people in this country due primarily to changes to the Medicaid program. And by 2026, according to the CBO, “an estimated 52 million people would be uninsured, compared with 28 million who would lack insurance that year under current law.”"}, {"c116": "The CBO also estimates that the AHCA would reduce the deficit by $337 billion over the the next 10 years (due to cuts in Medicaid spending), and predicts an eventual (by 2026) decline in insurance premiums in the individual market, although older Americans will see higher premiums. (The Center on Budget and Policy Priorities, a liberal think tank, points out that most people would nonetheless end up spending more on premiums due to the less generous nature of the AHCA’s premium credits.) Cost-sharing and deductibles would also be higher for individuals in the non-group market, according to CBO predictions."}, {"e2ea": "These numbers are quite a bit higher than the 15 million increase in uninsured people that researchers at the Brookings Institution had suggested earlier last week. And while the Trump administration is busy disputing the CBO’s conclusions, the report is certain to damage the bill’s already precarious position — several moderate Republicans have expressed concerns about the report’s conclusions."}], "content": "The Numbers on ACA Replacement Are Pretty Grim For the last week, politicians, pundits, and many Americans have been waiting anxiously for the official estimate from the Congressional Budget Office on the effects of the GOP’s proposed Obamacare replacement. Yesterday afternoon, the CBO released its findings, and the outlook isn’t good. The CBO estimates that, if the current version of the American Health Care Act were to become law, there will be 14 million more uninsured people in this country in 2018—an effect that’s due largely to the elimination of the penalties associated with the individual mandate. By 2020, there would be 21 million more uninsured people in this country due primarily to changes to the Medicaid program. And by 2026, according to the CBO, “an estimated 52 million people would be uninsured, compared with 28 million who would lack insurance that year under current law.” The CBO also estimates that the AHCA would reduce the deficit by $337 billion over the the next 10 years (due to cuts in Medicaid spending), and predicts an eventual (by 2026) decline in insurance premiums in the individual market, although older Americans will see higher premiums. (The Center on Budget and Policy Priorities, a liberal think tank, points out that most people would nonetheless end up spending more on premiums due to the less generous nature of the AHCA’s premium credits.) Cost-sharing and deductibles would also be higher for individuals in the non-group market, according to CBO predictions. These numbers are quite a bit higher than the 15 million increase in uninsured people that researchers at the Brookings Institution had suggested earlier last week. And while the Trump administration is busy disputing the CBO’s conclusions, the report is certain to damage the bill’s already precarious position — several moderate Republicans have expressed concerns about the report’s conclusions. ", "child": "1107_1"}