{"name": "1113", "parent": "", "title": "An open letter to Speaker Ryan", "sentences": [{"421e": "An open letter to Speaker Ryan"}, {"e2f1": "Speaker Ryan, you have a wonderful opportunity in front of you. You have a chance to end what you’ve described as “the nightmare” that is Obamacare. But not just that, you can implement the best plan that conservatism has to offer."}, {"9f54": "Forget this crap you threw together that people on both sides agree is a terrible plan—one side because it cripples Obamacare, the other because they don’t just want Obamacare crippled, they want it killed. Somehow, they’re both right."}, {"57a4": "Now, while you may never achieve Democratic support on any plan to repeal and replace Obamacare, you might be able to get the Republican party—including the Freedom Caucus—behind you with a principled, conservative plan. You know, one that opens it up to the free market. Construct a plan that actually lets insurers sell across state lines, gets rid of the Medicaid expansion, and does away with tax credits and subsidies. Put in all the solutions that you believe our country needs in order to have the best and cheapest healthcare, where all people have access to coverage. I’m a progressive and you’re a conservative, but surely we can both agree that every American person should at the very least have access to affordable, high-quality health care, right?"}, {"c877": "So seriously, I hope your solutions work. We need a better healthcare system. As a major industrialized nation, it’s shocking that ours is as bad as it is. So rescind “Trumpcare” — don’t worry, Donnie can take the hit for you on this crappy plan—and introduce “Ryancare.” A plan with enough conservative solutions in it to make the baby-faced Paul Ryan who came into the House back in 1999 and Freedom Caucus leader Mark Meadows deliriously happy. Unite your party. Repeal Obamacare. Pass the bill that will give Americans the healthcare system you believe they deserve. And let’s see what happens."}, {"11b8": "I happen to think that a truly conservative healthcare market will lead to a whole host of problems, because, due to the nature of healthcare, free market systems run into trouble. Personally, I think that single-payer uniquely addresses those issues and will provide high-quality healthcare to all people like it does in most developed nations around the globe. But if your system works—and more people have true access to affordable, high quality health care? I don’t give a damn. Because it’s a win for the American people. And if you’re wrong? Well, 2018 isn’t that far away. So roll the dice. Take your shot. Repeal Obamacare and pass what will go down as “Ryancare.”"}, {"a1d9": "Let’s create a better America—one way or another."}], "content": "An open letter to Speaker Ryan Speaker Ryan, you have a wonderful opportunity in front of you. You have a chance to end what you’ve described as “the nightmare” that is Obamacare. But not just that, you can implement the best plan that conservatism has to offer. Forget this crap you threw together that people on both sides agree is a terrible plan—one side because it cripples Obamacare, the other because they don’t just want Obamacare crippled, they want it killed. Somehow, they’re both right. Now, while you may never achieve Democratic support on any plan to repeal and replace Obamacare, you might be able to get the Republican party—including the Freedom Caucus—behind you with a principled, conservative plan. You know, one that opens it up to the free market. Construct a plan that actually lets insurers sell across state lines, gets rid of the Medicaid expansion, and does away with tax credits and subsidies. Put in all the solutions that you believe our country needs in order to have the best and cheapest healthcare, where all people have access to coverage. I’m a progressive and you’re a conservative, but surely we can both agree that every American person should at the very least have access to affordable, high-quality health care, right? So seriously, I hope your solutions work. We need a better healthcare system. As a major industrialized nation, it’s shocking that ours is as bad as it is. So rescind “Trumpcare” — don’t worry, Donnie can take the hit for you on this crappy plan—and introduce “Ryancare.” A plan with enough conservative solutions in it to make the baby-faced Paul Ryan who came into the House back in 1999 and Freedom Caucus leader Mark Meadows deliriously happy. Unite your party. Repeal Obamacare. Pass the bill that will give Americans the healthcare system you believe they deserve. And let’s see what happens. I happen to think that a truly conservative healthcare market will lead to a whole host of problems, because, due to the nature of healthcare, free market systems run into trouble. Personally, I think that single-payer uniquely addresses those issues and will provide high-quality healthcare to all people like it does in most developed nations around the globe. But if your system works—and more people have true access to affordable, high quality health care? I don’t give a damn. Because it’s a win for the American people. And if you’re wrong? Well, 2018 isn’t that far away. So roll the dice. Take your shot. Repeal Obamacare and pass what will go down as “Ryancare.” Let’s create a better America—one way or another. ", "child": "1113_1\t1113_2\t1113_3\t1113_4"}