{"name": "1116", "parent": "", "title": "Paul Ryan is tired of taking the blame for Trumpcare", "sentences": [{"0c44": "Paul Ryan is tired of taking the blame for Trumpcare"}, {"359c": "“This is something we wrote with President Trump,” Ryan told Fox Business."}, {"5cfa": "House Paul Ryan of Wis. faces reporters during a news conference at Republican National Committee Headquarters on Capitol Hill in Washington, Wednesday, March 8, 2017 CREDIT: AP Photo/J. Scott Applewhite"}, {"5082": "Republicans in Congress spent seven years attacking Obamacare as a failed health care law, but now that they have the opportunity to advance their own bill, things aren’t going as smoothly as they hoped. The GOP’s Obamacare replacement bill is already wildly unpopular, and party leadership is passing the blame like a hot potato."}, {"d209": "According to a poll from Public Policy Polling, only 24 percent of voters support the plan, and the GOP caucus itself is split: while the right flank attacks the bill as “Obamacare lite,” moderate Republicans are concerned over the cuts to Medicaid, the projected drop in the overall insured rate, and the proposal to defund Planned Parenthood."}, {"12ea": "Rep. Paul Ryan (R-WI) has long been lauded as the GOP’s signature policy wonk (a reputation he’s failed to live up to), and, as Speaker of the House, he has had a leading role in crafting the bill. So far, an outsized share of the responsibility for the slow-rolling legislative disaster is landing with Ryan."}, {"c2c9": "On Wednesday, he fought back."}, {"25aa": "“Now that we have our score from the CBO, that’s something that we were waiting for, now that we’ve got it we’ve got room to make refinements. Obviously the major components are staying intact, because this is something we wrote with President Trump, this is something we wrote with the Senate committees,” Ryan told Fox Business. “This is the plan we ran on all of last year, this is the plan that we’ve been working — House, Senate, White House — together on.”"}, {"66ae": "Ryan’s insistence that the bill was a collaboration with the president and the Senate is significant in light of the concerted campaign right-wing media has embarked on to separate Trump from the bill and pin any dissatisfaction with it on Ryan alone."}, {"18da": "“This is something we wrote with President Trump, this is something we wrote with the Senate committees”"}, {"c989": "Though the bill is officially known as the American Health Care Act, like Obamacare, it has quickly been branded “Ryancare” by the far-right and by Trump supporters seeking to separate the president from the bill. The legislation reneges on many of Trump’s campaign promises to supporters."}, {"3858": "“Ryan — still the Speaker — has pushed now President Donald Trump to believe his healthcare legislation the American Health Care Act would repeal and replace Obamacare when it does not repeal Obamacare,” Matt Boyle writes on Breitbart in an article addressing “when Paul Ryan Abandoned Donald Trump.”"}, {"f490": "Other recent headlines on the site — which has become the anchor point for the conservative media ecosystem — have included “CBO Releases Score of Paul Ryan’s American Health Care Act” and quotes from conservative Sen. Mike Lee and Sarah Palin lambasting “Ryancare” and supporting Trump."}, {"a81c": "CREDIT: Breitbart"}, {"bbba": "CREDIT: Breitbart"}, {"63f6": "Trump loyalists on other outlets have taken a similar line. On Monday, Sean Hannity told his viewers that Trump “has not really been well-served by the Republican party in the House or Senate,” while back on Fox Business, Lou Dobbs argued “only Paul Ryan would have the effrontery, the arrogance, and the incompetence to put a bill like that in front of the president.”"}, {"7850": "Chris Ruddy, a longtime Trump associate, wrote a column on his conservative media site Newsmax arguing that Trump should “ditch” the current bill, which he calls “Ryan Plan II.”"}, {"5dd1": "The White House itself has focused its messaging not on the replacement bill itself, but on the “disastrous” effects of Obamacare. According to recent polling, Americans like Obamacare more than they like President Trump."}, {"2c0c": "Yet while Trump has remained publicly supportive of the bill, the White House has objected to the bill’s other name — Trumpcare."}, {"df45": "During his campaign, Trump repeatedly promised the he would repeal Obamacare and replace it with something better. He claimed that as president, he would craft a replacement that would be less expensive for Americans, less expensive for the government, would not cut Medicaid, and would provide insurance for everyone."}, {"520a": "According to estimates this week from the nonpartisan Congressional Budget Office, the current plan would result in 24 million fewer Americans having insurance in the next decade. A separate analysis by the White House put the number even higher, at 26 million. The replacement plan relies on provisions that are deeply unpopular with voters, like requirements that people continuously maintain health coverage or else risk a dramatic rise in costs. It would also cut Medicaid and dramatically raise premiums for elderly Americans."}], "content": "Paul Ryan is tired of taking the blame for Trumpcare “This is something we wrote with President Trump,” Ryan told Fox Business. House Paul Ryan of Wis. faces reporters during a news conference at Republican National Committee Headquarters on Capitol Hill in Washington, Wednesday, March 8, 2017 CREDIT: AP Photo/J. Scott Applewhite Republicans in Congress spent seven years attacking Obamacare as a failed health care law, but now that they have the opportunity to advance their own bill, things aren’t going as smoothly as they hoped. The GOP’s Obamacare replacement bill is already wildly unpopular, and party leadership is passing the blame like a hot potato. According to a poll from Public Policy Polling, only 24 percent of voters support the plan, and the GOP caucus itself is split: while the right flank attacks the bill as “Obamacare lite,” moderate Republicans are concerned over the cuts to Medicaid, the projected drop in the overall insured rate, and the proposal to defund Planned Parenthood. Rep. Paul Ryan (R-WI) has long been lauded as the GOP’s signature policy wonk (a reputation he’s failed to live up to), and, as Speaker of the House, he has had a leading role in crafting the bill. So far, an outsized share of the responsibility for the slow-rolling legislative disaster is landing with Ryan. On Wednesday, he fought back. “Now that we have our score from the CBO, that’s something that we were waiting for, now that we’ve got it we’ve got room to make refinements. Obviously the major components are staying intact, because this is something we wrote with President Trump, this is something we wrote with the Senate committees,” Ryan told Fox Business. “This is the plan we ran on all of last year, this is the plan that we’ve been working — House, Senate, White House — together on.” Ryan’s insistence that the bill was a collaboration with the president and the Senate is significant in light of the concerted campaign right-wing media has embarked on to separate Trump from the bill and pin any dissatisfaction with it on Ryan alone. “This is something we wrote with President Trump, this is something we wrote with the Senate committees” Though the bill is officially known as the American Health Care Act, like Obamacare, it has quickly been branded “Ryancare” by the far-right and by Trump supporters seeking to separate the president from the bill. The legislation reneges on many of Trump’s campaign promises to supporters. “Ryan — still the Speaker — has pushed now President Donald Trump to believe his healthcare legislation the American Health Care Act would repeal and replace Obamacare when it does not repeal Obamacare,” Matt Boyle writes on Breitbart in an article addressing “when Paul Ryan Abandoned Donald Trump.” Other recent headlines on the site — which has become the anchor point for the conservative media ecosystem — have included “CBO Releases Score of Paul Ryan’s American Health Care Act” and quotes from conservative Sen. Mike Lee and Sarah Palin lambasting “Ryancare” and supporting Trump. CREDIT: Breitbart CREDIT: Breitbart Trump loyalists on other outlets have taken a similar line. On Monday, Sean Hannity told his viewers that Trump “has not really been well-served by the Republican party in the House or Senate,” while back on Fox Business, Lou Dobbs argued “only Paul Ryan would have the effrontery, the arrogance, and the incompetence to put a bill like that in front of the president.” Chris Ruddy, a longtime Trump associate, wrote a column on his conservative media site Newsmax arguing that Trump should “ditch” the current bill, which he calls “Ryan Plan II.” The White House itself has focused its messaging not on the replacement bill itself, but on the “disastrous” effects of Obamacare. According to recent polling, Americans like Obamacare more than they like President Trump. Yet while Trump has remained publicly supportive of the bill, the White House has objected to the bill’s other name — Trumpcare. During his campaign, Trump repeatedly promised the he would repeal Obamacare and replace it with something better. He claimed that as president, he would craft a replacement that would be less expensive for Americans, less expensive for the government, would not cut Medicaid, and would provide insurance for everyone. According to estimates this week from the nonpartisan Congressional Budget Office, the current plan would result in 24 million fewer Americans having insurance in the next decade. A separate analysis by the White House put the number even higher, at 26 million. The replacement plan relies on provisions that are deeply unpopular with voters, like requirements that people continuously maintain health coverage or else risk a dramatic rise in costs. It would also cut Medicaid and dramatically raise premiums for elderly Americans. ", "child": "1116_1\t1116_2\t1116_3\t1116_4\t1116_5\t1116_6\t1116_7\t1116_8\t1116_9\t1116_10\t1116_11\t1116_12\t1116_13\t1116_14\t1116_15\t1116_16\t1116_17\t1116_18\t1116_19\t1116_20\t1116_21\t1116_22\t1116_23\t1116_24"}