{"name": "1132", "parent": "", "title": "‘The Value of Debt in Building Wealth’ Could Change Your Financial Life", "sentences": [{"3ebd": "‘The Value of Debt in Building Wealth’ Could Change Your Financial Life"}, {"8ce4": "It’s exactly the book I need to be reading right now."}, {"c7e4": "I checked Vicki Robin and Joe Dominguez’ Your Money or Your Life out of the library the summer after I graduated from college, because I wanted to figure out how to get ahead on a telemarketer’s wages."}, {"b631": "It was the best financial book I could have read at the time."}, {"0e9f": "Sure, a lot of it didn’t apply to me—and, thanks to changing interest rates on government bonds, a lot of it doesn’t apply to anyone anymore—but I immediately started tracking everything I earned and spent, and tried to keep the spending number as far below the earning number as possible. (That was the year I would time my bus rides to avoid peak rates, because a quarter saved was a quarter earned.)"}, {"ce1e": "I was planning on checking Thomas J. Anderson’s The Value of Debt in Building Wealth out of the library, but after I mentioned it on The Billfold last week, he sent me a copy with a handwritten note inside:"}, {"e2c1": "I did enjoy it."}, {"3909": "Also, I think it’s the best financial book I could be reading right now."}, {"262f": "Here’s a one-sentence summary of The Value of Debt in Building Wealth:"}, {"e11b": "Put your money where it has the most value."}, {"1fac": "That’s going to be different places for different people, and Anderson takes his time explaining where your cash should go at different stages of your financial life—and at a certain point the Fibonacci sequence gets involved, which was by far my moment of most absolute joy while reading."}, {"a57b": "But yes, sometimes taking on certain types of debt—not credit card debt—is the best way to increase your net worth. That’s why the book is called The Value of Debt in Building Wealth, but it could equally be called The Value of Saving Several Times Your Monthly Income in Cash, Because That Step Comes First."}, {"405c": "Let’s look at the four stages of financial L.I.F.E.:"}, {"4a9d": "Launch: You’re building up your emergency fund and paying down your credit card debt."}, {"4d2f": "Independence: You’re out of credit card debt, you might have other debt like a student loan or a mortgage, you have an emergency fund, and you probably have a small retirement fund. Most importantly, your net worth is “between 50 percent and two times your gross annual pretax income.”"}, {"8f8f": "Freedom: At this point, your net worth is “between two and five times your gross annual pretax income,” possibly by using the strategies Anderson outlines for people in the Independence stage. It’s time to start leveraging your cash and your debt to make your wealth grow."}, {"d1da": "Equilibrium: You’ve got your debt and your cash and your investments in perfect balance. Every dollar is placed where it can get you the highest value, and your net worth is “greater than five times your annual pretax income.”"}, {"ad10": "I’m in the Independence stage right now. I paid off all my debt, I have $9,158.25 in savings, and I have $48,011.65 in my retirement accounts. (Technically I might be at the end of Launch, since I’m supposed to have saved 3X monthly income pretax, but… I’m self-employed. I pay a lot of taxes.)"}, {"e47e": "I’ve been asking—you’ve seen me ask it on The Billfold—what I need to do next."}, {"6a66": "The Value of Debt in Building Wealth gives me an answer. I don’t want to give the whole book away, but I will say that the time for me to start using debt (like a mortgage) to build wealth is still a few years off. The best thing I can do with my cash right now is keep it."}, {"4139": "I will add, from personal experience: and figure out how to earn more."}, {"27ca": "The first thing I did after finishing the book was rework my budget to include a 15 percent savings rate, as per Anderson’s recommendation. I’ve been putting aside 10 percent (pretax) of each freelancing check for two years now, although I technically saved closer to 16 percent last year because I pulled $5,500 out of my checking account in December and stuck it into a Roth IRA. Since I also put 20 percent of my income towards debt repayment, Anderson would say that I saved closer to 36 percent. (The math isn’t quite right on that because I paid off my debt in October, but you get the idea.)"}, {"8249": "Although that last paragraph makes it sound like I have enough money to save 30 percent or more, I’m in a freelance earnings downswing at the moment and saving 15 percent pretax is going to be hard. I did the math for the next two months: adding 5 percent to my savings rate, plus my basic expenses and business expenses, pretty much pulls all the extra money out of my budget. This means I won’t be able to indulge in even the modest items on my Wants List: no new shoes, no new set of sheets, definitely no new sofa. It also means that, if I want to save 15 percent of my income and make it sustainable, I need to earn a little more money every month. (Which I can probably do.)"}, {"6ffa": "The second thing I did after finishing the book was use Anderson’s worksheets—yes, this book has worksheets that I converted into spreadsheets, it’s delightful—to figure out how long it will take me to get from Independence to Freedom, assuming a 15 percent savings rate."}, {"e9c3": "The answer is between 5–7 years, depending on whether you calculate figures like “nine times your monthly income” as pretax or post-tax. (It’s supposed to be pretax, but maybe I can count post-tax as a sub-goal. I pay a lot of taxes.)"}, {"41c2": "Anderson makes it clear that saving this much money takes time, which I very much appreciate. Depending on how much I earn in the next few years—and how many unexpected expenses get thrown my way—I could hit Freedom by 40, which I like for the alliteration as much as anything else."}, {"d350": "And then I could start actually building wealth. Like, long-term-financial-security wealth. Comfortable-retirement wealth. Own-a-home-and-leave-an-inheritance wealth."}, {"3897": "Like I said: this is the best financial book I could be reading right now."}, {"d5fc": "If you’ve read it, what do you think?"}], "content": "‘The Value of Debt in Building Wealth’ Could Change Your Financial Life It’s exactly the book I need to be reading right now. I checked Vicki Robin and Joe Dominguez’ Your Money or Your Life out of the library the summer after I graduated from college, because I wanted to figure out how to get ahead on a telemarketer’s wages. It was the best financial book I could have read at the time. Sure, a lot of it didn’t apply to me—and, thanks to changing interest rates on government bonds, a lot of it doesn’t apply to anyone anymore—but I immediately started tracking everything I earned and spent, and tried to keep the spending number as far below the earning number as possible. (That was the year I would time my bus rides to avoid peak rates, because a quarter saved was a quarter earned.) I was planning on checking Thomas J. Anderson’s The Value of Debt in Building Wealth out of the library, but after I mentioned it on The Billfold last week, he sent me a copy with a handwritten note inside: I did enjoy it. Also, I think it’s the best financial book I could be reading right now. Here’s a one-sentence summary of The Value of Debt in Building Wealth: Put your money where it has the most value. That’s going to be different places for different people, and Anderson takes his time explaining where your cash should go at different stages of your financial life—and at a certain point the Fibonacci sequence gets involved, which was by far my moment of most absolute joy while reading. But yes, sometimes taking on certain types of debt—not credit card debt—is the best way to increase your net worth. That’s why the book is called The Value of Debt in Building Wealth, but it could equally be called The Value of Saving Several Times Your Monthly Income in Cash, Because That Step Comes First. Let’s look at the four stages of financial L.I.F.E.: Launch: You’re building up your emergency fund and paying down your credit card debt. Independence: You’re out of credit card debt, you might have other debt like a student loan or a mortgage, you have an emergency fund, and you probably have a small retirement fund. Most importantly, your net worth is “between 50 percent and two times your gross annual pretax income.” Freedom: At this point, your net worth is “between two and five times your gross annual pretax income,” possibly by using the strategies Anderson outlines for people in the Independence stage. It’s time to start leveraging your cash and your debt to make your wealth grow. Equilibrium: You’ve got your debt and your cash and your investments in perfect balance. Every dollar is placed where it can get you the highest value, and your net worth is “greater than five times your annual pretax income.” I’m in the Independence stage right now. I paid off all my debt, I have $9,158.25 in savings, and I have $48,011.65 in my retirement accounts. (Technically I might be at the end of Launch, since I’m supposed to have saved 3X monthly income pretax, but… I’m self-employed. I pay a lot of taxes.) I’ve been asking—you’ve seen me ask it on The Billfold—what I need to do next. The Value of Debt in Building Wealth gives me an answer. I don’t want to give the whole book away, but I will say that the time for me to start using debt (like a mortgage) to build wealth is still a few years off. The best thing I can do with my cash right now is keep it. I will add, from personal experience: and figure out how to earn more. The first thing I did after finishing the book was rework my budget to include a 15 percent savings rate, as per Anderson’s recommendation. I’ve been putting aside 10 percent (pretax) of each freelancing check for two years now, although I technically saved closer to 16 percent last year because I pulled $5,500 out of my checking account in December and stuck it into a Roth IRA. Since I also put 20 percent of my income towards debt repayment, Anderson would say that I saved closer to 36 percent. (The math isn’t quite right on that because I paid off my debt in October, but you get the idea.) Although that last paragraph makes it sound like I have enough money to save 30 percent or more, I’m in a freelance earnings downswing at the moment and saving 15 percent pretax is going to be hard. I did the math for the next two months: adding 5 percent to my savings rate, plus my basic expenses and business expenses, pretty much pulls all the extra money out of my budget. This means I won’t be able to indulge in even the modest items on my Wants List: no new shoes, no new set of sheets, definitely no new sofa. It also means that, if I want to save 15 percent of my income and make it sustainable, I need to earn a little more money every month. (Which I can probably do.) The second thing I did after finishing the book was use Anderson’s worksheets—yes, this book has worksheets that I converted into spreadsheets, it’s delightful—to figure out how long it will take me to get from Independence to Freedom, assuming a 15 percent savings rate. The answer is between 5–7 years, depending on whether you calculate figures like “nine times your monthly income” as pretax or post-tax. (It’s supposed to be pretax, but maybe I can count post-tax as a sub-goal. I pay a lot of taxes.) Anderson makes it clear that saving this much money takes time, which I very much appreciate. Depending on how much I earn in the next few years—and how many unexpected expenses get thrown my way—I could hit Freedom by 40, which I like for the alliteration as much as anything else. And then I could start actually building wealth. Like, long-term-financial-security wealth. Comfortable-retirement wealth. Own-a-home-and-leave-an-inheritance wealth. Like I said: this is the best financial book I could be reading right now. If you’ve read it, what do you think? ", "child": "1132_1\t1132_2\t1132_3\t1132_4\t1132_5\t1132_6\t1132_7\t1132_8\t1132_9\t1132_10\t1132_11\t1132_12\t1132_13\t1132_14\t1132_15\t1132_16\t1132_17\t1132_18\t1132_19\t1132_20\t1132_21\t1132_22\t1132_231132_1\t1132_2\t1132_3\t1132_4\t1132_5\t1132_6\t1132_7\t1132_8\t1132_9\t1132_10\t1132_11\t1132_12\t1132_13\t1132_14\t1132_15\t1132_16\t1132_17\t1132_18\t1132_19\t1132_20\t1132_21\t1132_22\t1132_231132_1\t1132_2\t1132_3\t1132_4\t1132_5\t1132_6\t1132_7\t1132_8\t1132_9\t1132_10\t1132_11\t1132_12\t1132_13\t1132_14\t1132_15\t1132_16\t1132_17\t1132_18\t1132_19\t1132_20\t1132_21\t1132_22\t1132_23"}