{"name": "1133", "parent": "", "title": "I Guess “Going Into Debt” Is On Trend Now", "sentences": [{"e417": "I Guess “Going Into Debt” Is On Trend Now"}, {"fa60": "Technically, it’s “having liquidity.”"}, {"ae01": "Last week, I shared a Bloomberg Businessweek story about Thomas J. Anderson’s new book The Value of Debt in Building Wealth, which focused on the idea that one builds wealth not by paying off debt as quickly as possible, but by keeping the money you would have put towards those higher debt payments liquid. With liquid cash, you can buy a house when the price is right, invest in the market—or in yourself—to earn more money, etc. etc. etc."}, {"8048": "Are We Putting too Much of Our Income Towards the Wrong Goals?A new book suggests we should be making smaller debt payments and putting less in our retirement accounts.thebillfold.com"}, {"f3c4": "And yes, the obvious counterpoint is that some of us will never have enough money for a down payment, not even if we pay the minimums on our credit cards and loans. It takes a certain amount of money to make this theory work. (I probably don’t yet have this amount of money, although Anderson’s publisher is sending me a copy of The Value of Debt in Building Wealth and I am very excited to read it and see if any of it can be applied to my finances.)"}, {"cabd": "But the same idea—taking on debt to increase liquidity—just showed up in a CNBC article:"}, {"faf1": "Billionaire: This surprising money tip is some of the best advice I ever gotTilman Fertitta's path to success began with a $6,000 loan. Since then, he has built a restaurant and hospitality…www.cnbc.com"}, {"ebd0": "First, borrowing when times are good allows you to have cash on hand when times are tough. Fertitta points out that it is actually most difficult to borrow money when you are struggling. In fact, that’s when you most need reserves in the bank."}, {"d75c": "Second, by accepting interest rates as the price of doing business you gain one vital tool: liquidity."}, {"c8c6": "I actually agree that interest rates are the price of “doing business,” as it were. I’ve written before that debt management is part of being an adult, and that people who fuss over “but you’re paying interest” are missing out on the fact that you, for example, have a car that could get you to your job. (Or new clothes that are appropriate for your job.)"}, {"8755": "Being alive, much less doing business, costs money—and sometimes that means learning how to manage debt responsibly."}, {"2682": "Is Debt Management Just Part of Being an Adult?thebillfold.com"}, {"18e9": "And yes, I also think sometimes about how lucky I am to have multiple lines of credit and a high credit score, because although I do not want to go into credit card debt again, now that I’ve finally gotten myself out of it, I have the ability to do so. I have an emergency fund, but if something happens to deplete that fund, I can put a major expense on a credit card and have enough credit to cover it."}, {"a7c0": "So that’s a smaller-scale version of what Anderson and Fertitta are advocating we do, financially: embrace debt, use it to our advantage, and hang on to as much of our own liquid cash as possible."}, {"bee4": "What I’m really curious about is why I’ve seen this idea of maintaining liquidity twice in three days. It could be good ol’ Baader-Meinhof, or it could hint that we’re going through a financial growth period and that we should hang on to our extra earnings instead of using them to pay down our debt. (This isn’t what I did with my extra earnings—I specifically put 20 percent of my income towards debt repayment until I was debt-free—but it’s what I could have done.)"}, {"7c1c": "Because in the future, when that growth ends, we can follow Fertitta’s advice:"}, {"96da": "For instance, if there is another financial crisis and businesses go under, Fertitta will be able to buy at a discount price because he has cash in hand."}, {"614d": "Or, you know, keep ourselves from going under by paying the minimums on our debt, spending down our emergency funds, and—if necessary—pulling out the credit cards."}], "content": "I Guess “Going Into Debt” Is On Trend Now Technically, it’s “having liquidity.” Last week, I shared a Bloomberg Businessweek story about Thomas J. Anderson’s new book The Value of Debt in Building Wealth, which focused on the idea that one builds wealth not by paying off debt as quickly as possible, but by keeping the money you would have put towards those higher debt payments liquid. With liquid cash, you can buy a house when the price is right, invest in the market—or in yourself—to earn more money, etc. etc. etc. Are We Putting too Much of Our Income Towards the Wrong Goals?A new book suggests we should be making smaller debt payments and putting less in our retirement accounts.thebillfold.com And yes, the obvious counterpoint is that some of us will never have enough money for a down payment, not even if we pay the minimums on our credit cards and loans. It takes a certain amount of money to make this theory work. (I probably don’t yet have this amount of money, although Anderson’s publisher is sending me a copy of The Value of Debt in Building Wealth and I am very excited to read it and see if any of it can be applied to my finances.) But the same idea—taking on debt to increase liquidity—just showed up in a CNBC article: Billionaire: This surprising money tip is some of the best advice I ever gotTilman Fertitta's path to success began with a $6,000 loan. Since then, he has built a restaurant and hospitality…www.cnbc.com First, borrowing when times are good allows you to have cash on hand when times are tough. Fertitta points out that it is actually most difficult to borrow money when you are struggling. In fact, that’s when you most need reserves in the bank. Second, by accepting interest rates as the price of doing business you gain one vital tool: liquidity. I actually agree that interest rates are the price of “doing business,” as it were. I’ve written before that debt management is part of being an adult, and that people who fuss over “but you’re paying interest” are missing out on the fact that you, for example, have a car that could get you to your job. (Or new clothes that are appropriate for your job.) Being alive, much less doing business, costs money—and sometimes that means learning how to manage debt responsibly. Is Debt Management Just Part of Being an Adult?thebillfold.com And yes, I also think sometimes about how lucky I am to have multiple lines of credit and a high credit score, because although I do not want to go into credit card debt again, now that I’ve finally gotten myself out of it, I have the ability to do so. I have an emergency fund, but if something happens to deplete that fund, I can put a major expense on a credit card and have enough credit to cover it. So that’s a smaller-scale version of what Anderson and Fertitta are advocating we do, financially: embrace debt, use it to our advantage, and hang on to as much of our own liquid cash as possible. What I’m really curious about is why I’ve seen this idea of maintaining liquidity twice in three days. It could be good ol’ Baader-Meinhof, or it could hint that we’re going through a financial growth period and that we should hang on to our extra earnings instead of using them to pay down our debt. (This isn’t what I did with my extra earnings—I specifically put 20 percent of my income towards debt repayment until I was debt-free—but it’s what I could have done.) Because in the future, when that growth ends, we can follow Fertitta’s advice: For instance, if there is another financial crisis and businesses go under, Fertitta will be able to buy at a discount price because he has cash in hand. Or, you know, keep ourselves from going under by paying the minimums on our debt, spending down our emergency funds, and—if necessary—pulling out the credit cards. ", "child": "1133_1\t1133_2\t1133_3\t1133_4\t1133_5\t1133_6\t1133_7\t1133_8"}