{"name": "1137", "parent": "", "title": "The Mother-in-law Credit Union", "sentences": [{"cbcd": "The Mother-in-law Credit Union"}, {"0574": "Is being able to pay someone back the same as independence?"}, {"6d37": "When taxes came due my first year of freelancing, I didn’t have money to pay for them. Of course I didn’t. I hadn’t set anything aside in advance, nor did I pay anything ahead of time. Funny how that works."}, {"9e09": "The way my options were laid out, I didn’t have the option to pay my taxes off in increments. I now know that of course you can. It’ll rack up interest like a mofo. But most of the time, you can absolutely pay off back taxes in increments. They just want your money."}, {"c712": "But at the time, I absolutely did not have a spare $1,500 to spend paying taxes. So I turned to the closest person in my life who had it: My boyfriend’s mother."}, {"5324": "At the time, my mother-in-law had a very cushy job in tech. She tolerated her son’s creative freelancer girlfriend because I wasn’t afraid of talking about money. I got my first credit card at nineteen years old and had sustained it. I wasn’t messing around when it came to money."}, {"7a5e": "So against the advice of her friends, she paid off my $1,500 debt. She was my creditor now."}, {"379d": "It took me regular payments (of varying amounts) over thirteen months to pay off that loan. Maybe I would have been better off making those payments to the U.S. Government. But the government doesn’t have the one thing one’s family can always provide: shame."}, {"100a": "It didn’t come from my boyfriend’s mother herself. She was perfectly lovely. But the very prospect of defaulting on a loan to a family member was far more troubling than defaulting to the government. Plus all the whispers about her giving money to her son’s girlfriend, who was a Millennial at that…"}, {"1826": "But I paid it off, and I earned her trust. If anything, I’m glad that I did it just because she now knew I was reliable. Maybe she saw me as more worthy of dating her son specifically because I could follow through on paying off a debt."}, {"dbd9": "I thought it wouldn’t ever happen again."}, {"59b3": "The second time I borrowed money from my boyfriend’s mother, it was to buy a couch. The old couch, a fixture in the house since God knows when, was actively falling apart. It was a rusty springs type of situation."}, {"5214": "My boyfriend wanted a “good sofa,” the kind actual adults buy from a furniture store, a sofa that’s built to last forever. I agreed on the principle. But he knew what he was getting into when I confessed to harvesting a vintage couch off the street in high school and making it a fixture in my room until I left for college."}, {"5249": "Maybe my mother-in-law did it out of love. Maybe she wanted to see me loosen up and buy something nice for myself for once. Maybe she wanted her son to be right and for me to be wrong. But my boyfriend’s mother gave me her furniture store credit card and told me to pick out a couch."}, {"669b": "I told her I would pay her back, and she said she knew I would. But this time, the shame percolated me deeper and sooner than before. I paid off the couch in five months, getting better jobs and working harder at them so I could just get this all out of the way."}, {"33f7": "I should have been happy that I could pay this second debt off quickly. But I wasn’t. Kindness and shame go hand in hand when it comes to money. I knew enough to know that this didn’t come without emotional strings. She says it’s fine, but I know it’s not. It should be “mine”—that is, my responsibility."}, {"7877": "In a different time, I’d be at the mercy of neighborhood moneylenders. They’d have no kindness toward me. They wouldn’t care about my past success at paying things off. Interest would be interest, and I would be driven into the ground by my own lack of a Fuck Off Fund."}, {"6632": "Above everything, this is what motivates me to work toward my savings goals in 2017. My boyfriend’s mother is a good person. But I hate what this says about me as a finance-driven person that I can’t keep enough in the bank to cover big, sudden expenses. I just don’t have enough to do it. I don’t."}, {"6290": "Kindness and shame go hand in hand. I’m working toward kindness being the main interaction in my family. Every nickel in my savings account brings me closer."}, {"c729": "Brit McGinnis is a copywriter and author of several books. Her work has appeared on XOJane, SparkNotes and anywhere fine stories are sold. She lives in Portland, Oregon."}, {"87ad": "This story is part of The Billfold’s “Resolve” series."}], "content": "The Mother-in-law Credit Union Is being able to pay someone back the same as independence? When taxes came due my first year of freelancing, I didn’t have money to pay for them. Of course I didn’t. I hadn’t set anything aside in advance, nor did I pay anything ahead of time. Funny how that works. The way my options were laid out, I didn’t have the option to pay my taxes off in increments. I now know that of course you can. It’ll rack up interest like a mofo. But most of the time, you can absolutely pay off back taxes in increments. They just want your money. But at the time, I absolutely did not have a spare $1,500 to spend paying taxes. So I turned to the closest person in my life who had it: My boyfriend’s mother. At the time, my mother-in-law had a very cushy job in tech. She tolerated her son’s creative freelancer girlfriend because I wasn’t afraid of talking about money. I got my first credit card at nineteen years old and had sustained it. I wasn’t messing around when it came to money. So against the advice of her friends, she paid off my $1,500 debt. She was my creditor now. It took me regular payments (of varying amounts) over thirteen months to pay off that loan. Maybe I would have been better off making those payments to the U.S. Government. But the government doesn’t have the one thing one’s family can always provide: shame. It didn’t come from my boyfriend’s mother herself. She was perfectly lovely. But the very prospect of defaulting on a loan to a family member was far more troubling than defaulting to the government. Plus all the whispers about her giving money to her son’s girlfriend, who was a Millennial at that… But I paid it off, and I earned her trust. If anything, I’m glad that I did it just because she now knew I was reliable. Maybe she saw me as more worthy of dating her son specifically because I could follow through on paying off a debt. I thought it wouldn’t ever happen again. The second time I borrowed money from my boyfriend’s mother, it was to buy a couch. The old couch, a fixture in the house since God knows when, was actively falling apart. It was a rusty springs type of situation. My boyfriend wanted a “good sofa,” the kind actual adults buy from a furniture store, a sofa that’s built to last forever. I agreed on the principle. But he knew what he was getting into when I confessed to harvesting a vintage couch off the street in high school and making it a fixture in my room until I left for college. Maybe my mother-in-law did it out of love. Maybe she wanted to see me loosen up and buy something nice for myself for once. Maybe she wanted her son to be right and for me to be wrong. But my boyfriend’s mother gave me her furniture store credit card and told me to pick out a couch. I told her I would pay her back, and she said she knew I would. But this time, the shame percolated me deeper and sooner than before. I paid off the couch in five months, getting better jobs and working harder at them so I could just get this all out of the way. I should have been happy that I could pay this second debt off quickly. But I wasn’t. Kindness and shame go hand in hand when it comes to money. I knew enough to know that this didn’t come without emotional strings. She says it’s fine, but I know it’s not. It should be “mine”—that is, my responsibility. In a different time, I’d be at the mercy of neighborhood moneylenders. They’d have no kindness toward me. They wouldn’t care about my past success at paying things off. Interest would be interest, and I would be driven into the ground by my own lack of a Fuck Off Fund. Above everything, this is what motivates me to work toward my savings goals in 2017. My boyfriend’s mother is a good person. But I hate what this says about me as a finance-driven person that I can’t keep enough in the bank to cover big, sudden expenses. I just don’t have enough to do it. I don’t. Kindness and shame go hand in hand. I’m working toward kindness being the main interaction in my family. Every nickel in my savings account brings me closer. Brit McGinnis is a copywriter and author of several books. Her work has appeared on XOJane, SparkNotes and anywhere fine stories are sold. She lives in Portland, Oregon. This story is part of The Billfold’s “Resolve” series. ", "child": "1137_1\t1137_2\t1137_3\t1137_4\t1137_5\t1137_6\t1137_71137_1\t1137_2\t1137_3\t1137_4\t1137_5\t1137_6\t1137_71137_1\t1137_2\t1137_3\t1137_4\t1137_5\t1137_6\t1137_7"}