{"name": "1143", "parent": "", "title": "Dementia from a Distance", "sentences": [{"c69f": "Dementia from a Distance"}, {"adf0": "From Bangkok, a son says goodbye to a father who is 10,000 miles away and fading fast."}, {"8d7f": "(A shorter version of this article appeared in the April / May 2017 issue of Wanderlust Magazine.)"}, {"7151": "BANGKOK, Thailand"}, {"3b9a": "It was January 2014. My father, beset with Alzheimer’s Disease for four years, was entering the final 18-month slide to his death. I found myself with an opportunity to live and work in Bangkok, the city where he had taken his young wife, their two little girls and his newly widowed mother in the summer of 1955."}, {"d7f3": "The gate to the author’s family’s house on Soi Prasanmit (now Sukhumvit Soi 23), Bangkok, 1955. (Photo ©1955, Edward Mason Anthony Jr.)"}, {"7a98": "When he left five years later, able to rattle off Thai and converse easily with native speakers, Thailand had changed his life — all of their lives, in fact. I wanted to follow in his footsteps, to bring my wife and young boys to the same place, to expose our children to the world, to turn them into the kind of global citizens that growing up in my family had made me."}, {"de2f": "I went immediately to my 91-year-old father — a giant to me, a pioneering linguist who taught teachers at what is now Srinakharinwirot University and co-authored the first professional English-language textbook for teaching Thai, the man who taught me how to think. I went to this man, now a phantom of what he was, and I asked him how he’d feel if I moved to Bangkok."}, {"df40": "The author’s parents, Edward Mason Anthony Jr. and Ann Terbrueggen Anthony, at a party in Bangkok, early 1956."}, {"89c0": "“Bangkok,” he repeated, his eyes cloudier than usual. He was having a bad Alzheimer’s day. “I’ve been to Bangkok, haven’t I?”"}, {"2ac7": "My stomach fell. How on Earth could I move away? How could I and my family go from living 10 minutes away from my parents to living 10,000 miles away? How could I help him manage his final days if I wasn’t there?"}, {"b4bf": "Five minutes later, I asked him again. It is the strange quality of Alzheimer’s that it fades in and out, stealing a person from loved ones for a time and then abruptly returning him to the front doorstep as if he’d never left."}, {"21fe": "“Bangkok!” he exclaimed, his eyes clearer than usual. I saw that he was smiling. “We lived in Bangkok, and now you will, too. This is what we raised you to do.”"}, {"079c": "The opening page of the Anthony family’s Thailand photo album, 1955. The quote, from Rudyard Kipling, is an embrace of international travel for the purpose of understanding your own country — and yourself. (Photo ©2015, Ted Anthony)"}, {"285d": "You may know the challenge and pain of long-distance relationships, particularly if you are an expatriate. But the pain and challenge of trying to care for a dementia-riddled parent from afar is a unique experience that changed my own life. It is something that, oddly, I both would never wish on anyone and am deeply grateful that I have lived through."}, {"5d0f": "Until July 2015, the answer was that he was always alive, albeit more frail and less cognitively aware each time. My wife and I alternated visits roughly every nine weeks — and maintain that today for my mother, who is also beginning to slip into dementia."}, {"3e23": "Edward Mason Anthony Jr. and two of his grandchildren, Mason and Wyatt Anthony, 18 hours before his death in July 2015. (Photo ©2015, Ted Anthony)"}, {"36df": "Somehow, by someone’s grace, my entire immediate family was there on the summer day that he died. The prior afternoon, we had said goodbye because we were planning to leave town and head back to Bangkok. He smiled at us, his memories almost entirely gone. Improbably, he still recognized my boys, “You’re a good grandson,” he said to the older one, Mason. “I love you, grandson,” he said to the younger one, Wyatt. Eighteen hours later, he was gone."}, {"8f52": "And so we returned to Bangkok, bereft and feeling fresh guilt because my mother, now, would be totally alone."}, {"1d3c": "Today, 18 months later, when I think about my father and our decision to come to Thailand, I picture one scene."}, {"c23d": "It is December 2014, eight months before his death. I stop home for three days en route from London to Bangkok — the long way — and bring him a recent copy of a Thai newspaper. When I was little, whenever he’d travel, which was often, he’d bring me copies of newspapers in the languages of the places he visited."}, {"5d5a": "The author’s father, seven months before his death and disabled by Alzheimer’s Disease, reads a Thai newspaper in December 2014. (Photo ©2014, Ted Anthony)"}, {"b546": "He looks over the newspaper as I chat to my mother. After a few minutes, I notice that he is speaking in a low voice. It sounds not quite right. I try to figure out what he is saying; he is grinning and seems excited about something, and I think that he is simply babbling."}, {"ab37": "But eventually I come to realize: This is not babble at all. It is language."}, {"c137": "At this moment, my father cannot remember anything of his childhood. He cannot remember, really, ever being a professor. He cannot remember anyone but his immediate family, for all practical purposes."}, {"0109": "But my father, the man who carted his children all around the world and showed them all that there was to see — my father the linguist, his mind almost gone, is sitting on a couch in suburban Pittsburgh and reading the news of the day … in Thai. It all comes full circle, doesn’t it."}, {"2c5b": "Read the author’s eulogy to his father here:"}, {"6e8d": "To Think. To Laugh. To Understand.Edward Mason Anthony Jr., Sept. 1, 1922 — July 12, 2015midcenturymodernmag.com"}, {"3180": "Read his obituary here:"}, {"0c08": "Obituary: Edward Mason Anthony Jr. / Founding chair of Pitt's Linguistics department and English…If the University of Pittsburgh's campus sometimes resembles the United Nations, with students and professors strolling…www.post-gazette.com"}, {"725b": "Ted Anthony, a Pittsburgher living in Thailand, is a Baby Boomer by generation and a Gen-Xer by age. He has been dissecting and musing about American culture since Guns N’ Roses was on the charts and “Rain Man” was in the theaters. He is the author of Chasing the Rising Sun: The Journey of an American Song. He tweets here, Instagrams here and collects various fragmentary images and thoughts on Tumblr here."}, {"2f77": "©2017 | Ted Anthony"}, {"48c3": "— 30 —"}], "content": "Dementia from a Distance From Bangkok, a son says goodbye to a father who is 10,000 miles away and fading fast. (A shorter version of this article appeared in the April / May 2017 issue of Wanderlust Magazine.) BANGKOK, Thailand It was January 2014. My father, beset with Alzheimer’s Disease for four years, was entering the final 18-month slide to his death. I found myself with an opportunity to live and work in Bangkok, the city where he had taken his young wife, their two little girls and his newly widowed mother in the summer of 1955. The gate to the author’s family’s house on Soi Prasanmit (now Sukhumvit Soi 23), Bangkok, 1955. (Photo ©1955, Edward Mason Anthony Jr.) When he left five years later, able to rattle off Thai and converse easily with native speakers, Thailand had changed his life — all of their lives, in fact. I wanted to follow in his footsteps, to bring my wife and young boys to the same place, to expose our children to the world, to turn them into the kind of global citizens that growing up in my family had made me. I went immediately to my 91-year-old father — a giant to me, a pioneering linguist who taught teachers at what is now Srinakharinwirot University and co-authored the first professional English-language textbook for teaching Thai, the man who taught me how to think. I went to this man, now a phantom of what he was, and I asked him how he’d feel if I moved to Bangkok. The author’s parents, Edward Mason Anthony Jr. and Ann Terbrueggen Anthony, at a party in Bangkok, early 1956. “Bangkok,” he repeated, his eyes cloudier than usual. He was having a bad Alzheimer’s day. “I’ve been to Bangkok, haven’t I?” My stomach fell. How on Earth could I move away? How could I and my family go from living 10 minutes away from my parents to living 10,000 miles away? How could I help him manage his final days if I wasn’t there? Five minutes later, I asked him again. It is the strange quality of Alzheimer’s that it fades in and out, stealing a person from loved ones for a time and then abruptly returning him to the front doorstep as if he’d never left. “Bangkok!” he exclaimed, his eyes clearer than usual. I saw that he was smiling. “We lived in Bangkok, and now you will, too. This is what we raised you to do.” The opening page of the Anthony family’s Thailand photo album, 1955. The quote, from Rudyard Kipling, is an embrace of international travel for the purpose of understanding your own country — and yourself. (Photo ©2015, Ted Anthony) You may know the challenge and pain of long-distance relationships, particularly if you are an expatriate. But the pain and challenge of trying to care for a dementia-riddled parent from afar is a unique experience that changed my own life. It is something that, oddly, I both would never wish on anyone and am deeply grateful that I have lived through. Until July 2015, the answer was that he was always alive, albeit more frail and less cognitively aware each time. My wife and I alternated visits roughly every nine weeks — and maintain that today for my mother, who is also beginning to slip into dementia. Edward Mason Anthony Jr. and two of his grandchildren, Mason and Wyatt Anthony, 18 hours before his death in July 2015. (Photo ©2015, Ted Anthony) Somehow, by someone’s grace, my entire immediate family was there on the summer day that he died. The prior afternoon, we had said goodbye because we were planning to leave town and head back to Bangkok. He smiled at us, his memories almost entirely gone. Improbably, he still recognized my boys, “You’re a good grandson,” he said to the older one, Mason. “I love you, grandson,” he said to the younger one, Wyatt. Eighteen hours later, he was gone. And so we returned to Bangkok, bereft and feeling fresh guilt because my mother, now, would be totally alone. Today, 18 months later, when I think about my father and our decision to come to Thailand, I picture one scene. It is December 2014, eight months before his death. I stop home for three days en route from London to Bangkok — the long way — and bring him a recent copy of a Thai newspaper. When I was little, whenever he’d travel, which was often, he’d bring me copies of newspapers in the languages of the places he visited. The author’s father, seven months before his death and disabled by Alzheimer’s Disease, reads a Thai newspaper in December 2014. (Photo ©2014, Ted Anthony) He looks over the newspaper as I chat to my mother. After a few minutes, I notice that he is speaking in a low voice. It sounds not quite right. I try to figure out what he is saying; he is grinning and seems excited about something, and I think that he is simply babbling. But eventually I come to realize: This is not babble at all. It is language. At this moment, my father cannot remember anything of his childhood. He cannot remember, really, ever being a professor. He cannot remember anyone but his immediate family, for all practical purposes. But my father, the man who carted his children all around the world and showed them all that there was to see — my father the linguist, his mind almost gone, is sitting on a couch in suburban Pittsburgh and reading the news of the day … in Thai. It all comes full circle, doesn’t it. Read the author’s eulogy to his father here: To Think. To Laugh. To Understand.Edward Mason Anthony Jr., Sept. 1, 1922 — July 12, 2015midcenturymodernmag.com Read his obituary here: Obituary: Edward Mason Anthony Jr. / Founding chair of Pitt's Linguistics department and English…If the University of Pittsburgh's campus sometimes resembles the United Nations, with students and professors strolling…www.post-gazette.com Ted Anthony, a Pittsburgher living in Thailand, is a Baby Boomer by generation and a Gen-Xer by age. He has been dissecting and musing about American culture since Guns N’ Roses was on the charts and “Rain Man” was in the theaters. He is the author of Chasing the Rising Sun: The Journey of an American Song. He tweets here, Instagrams here and collects various fragmentary images and thoughts on Tumblr here. ©2017 | Ted Anthony — 30 — ", "child": "1143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_61143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_61143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_61143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_61143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_61143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6"}