{"name": "1155", "parent": "", "title": "Goodbye Instagram", "sentences": [{"8955": "Goodbye Instagram"}, {"8e29": "We all knew this was coming."}, {"2126": "It looks like I’m leaving Instagram now. This sucks — I REALLY like Instagram. I’m a photographer, and Instagram is where all the action is in photography right now. But I don’t need an algorithm or a bunch of west-coast 20-somethings deciding what photos I should be viewing."}, {"78dc": "While I’m sure the good folks at Instagram want the best for me, I don’t need their help when it comes to deciding what I should see on the internet. It’s funny; I already had an algorithm for curated content that fits my needs perfectly. You see what I do is I click the “follow” button on a person or brand’s feed in their profile. By clicking the “follow” button, I am indicating that I would like to see their content. Guess what happens next? When they post content, I see their content! While deceptively simple, it works great."}, {"5540": "If I wanted someone to spoon-feed me curated content, I’d still be using Facebook."}, {"39dd": "I left Facebook years ago because repeated decisions made by the company showed a complete disregard for their users. They earned my trust; we had fun together, and I let them into the most sensitive parts of my life. Then, like an abusive partner, they broke my trust over and over again. Many people choose to stay in their abusive relationship with Facebook. Not me. I put the cat in the car and left town."}, {"00d7": "When I heard Facebook purchased Instagram, I immediately assumed Mark Zuckerberg would turn Instagram into a mini-Facebook. However, Instagram promised me they wouldn’t change, so I gave them the benefit of the doubt. And besides, they had earned my trust, we had fun together, and I had let them into my life."}, {"cb11": "We came to an agreement: Instagram agreed not to invite Facebook over, and I pretended to ignore that fact that they were idiots for marrying Facebook."}, {"b75c": "Fast-forward to today: Like a newly-elected politician, Instagram is now going back on their word and instituting a very Facebook-like algorithm which will ensure I “see the moments I care about first” — screw that. I just won’t tolerate someone manhandling my social feeds."}, {"f5c1": "I gave Instagram a chance — but history has shown us that we can’t trust Facebook and Instagram have now made the transformation we all knew was coming. Instagram is no more than Facebook in a filter named “Sheep’s Clothing.”"}, {"c9d0": "Good-bye, Instagram. I’ll miss you."}, {"a51c": "You all can find me on Twitter (@giovanni) or some other lame third-tier social network until Facebook buys them."}, {"0ac8": "Don’t worry Mark; I won’t let the door hit me on the way out."}], "content": "Goodbye Instagram We all knew this was coming. It looks like I’m leaving Instagram now. This sucks — I REALLY like Instagram. I’m a photographer, and Instagram is where all the action is in photography right now. But I don’t need an algorithm or a bunch of west-coast 20-somethings deciding what photos I should be viewing. While I’m sure the good folks at Instagram want the best for me, I don’t need their help when it comes to deciding what I should see on the internet. It’s funny; I already had an algorithm for curated content that fits my needs perfectly. You see what I do is I click the “follow” button on a person or brand’s feed in their profile. By clicking the “follow” button, I am indicating that I would like to see their content. Guess what happens next? When they post content, I see their content! While deceptively simple, it works great. If I wanted someone to spoon-feed me curated content, I’d still be using Facebook. I left Facebook years ago because repeated decisions made by the company showed a complete disregard for their users. They earned my trust; we had fun together, and I let them into the most sensitive parts of my life. Then, like an abusive partner, they broke my trust over and over again. Many people choose to stay in their abusive relationship with Facebook. Not me. I put the cat in the car and left town. When I heard Facebook purchased Instagram, I immediately assumed Mark Zuckerberg would turn Instagram into a mini-Facebook. However, Instagram promised me they wouldn’t change, so I gave them the benefit of the doubt. And besides, they had earned my trust, we had fun together, and I had let them into my life. We came to an agreement: Instagram agreed not to invite Facebook over, and I pretended to ignore that fact that they were idiots for marrying Facebook. Fast-forward to today: Like a newly-elected politician, Instagram is now going back on their word and instituting a very Facebook-like algorithm which will ensure I “see the moments I care about first” — screw that. I just won’t tolerate someone manhandling my social feeds. I gave Instagram a chance — but history has shown us that we can’t trust Facebook and Instagram have now made the transformation we all knew was coming. Instagram is no more than Facebook in a filter named “Sheep’s Clothing.” Good-bye, Instagram. I’ll miss you. You all can find me on Twitter (@giovanni) or some other lame third-tier social network until Facebook buys them. Don’t worry Mark; I won’t let the door hit me on the way out. ", "child": "1155_1\t1155_2"}