{"name": "1158", "parent": "", "title": "Flickr: The Internet’s First Digital Photo Album", "sentences": [{"abd0": "Flickr: The Internet’s First Digital Photo Album"}, {"c3eb": "History"}, {"8681": "In 2004, Flickr, an image hosting website, was founded by Ludicorp, a gaming company based in Vancouver, Canada. Originally, Flickr (at the time known as FlickrLive) was primarily a chat site where users could send photos to one another."}, {"524f": "Original Version of Flickr"}, {"e257": "As time progressed, however, Flickr moved away from the chat function due to competition from AOL and focused on its competitive advantage: photo (sharing). This also coincided with the increase in digital photography."}, {"520d": "In 2005, Yahoo bought Ludicorp; hence, Flickr as well. Initially, Flickr users would simply upload photos onto the website, but the website did not support the use of tagging photos. As a result, users had difficulty searching and finding photos that were relevant to them."}, {"a47f": "Old Version of Flickr"}, {"7e0e": "Eventually, Flickr added the tagging (words or phrases describing the picture) feature, which significantly improved the website’s taxonomy and structure. Because of the change, Flickr users could add tags to photos that would allow other users to search for photos that interested them. In addition, Flickr added a geo-tagging feature which allowed photos to be tagged to a specific location on a map, or grouped with other photos in a similar location. Hence, the core data of Flickr is images, which users can name, tag, and add comments too."}, {"9c6e": "This was somewhat similar to my information project on restaurants, where users could find restaurants they were interested in based on a tag that was associated to the restaurant."}, {"f413": "GeoTagging"}, {"226d": "At the time, tagging photos was a relatively new concept which people valued. As a result, Flickr’s user base increased. In fact, “The US Library of Congress was so impressed with Flickr’s work that in 2008 it added unmarked photographs from its archive to Flickr in the hope that the people might identify them.”"}, {"1b09": "Modern Day Flickr"}, {"25da": "With the rise of smartphones and digital photographs, the number of people using Flickr and uploading photos to the site has increased. Currently, Flickr is home to over 13 billion photos, 2 million groups, and 122 million users. Every day people share approximately 1 million photos on Flickr. Additionally, people are accessing the website on different mediums such as tablets, smartphones, and PCS."}, {"37e7": "These changes and user growth, however, brought about new challenges for Flickr in order to stay relevant, create and deliver a strong user experience, and keep its original competitive advantage (allowing users a frictionless experience of searching and finding photos)."}, {"7755": "Initially, Flickr was not able to keep up with the technological and user changes. For instance, the service did not have a mobile application until a few years ago and, even then, the services were designed poorly. The website and the mobile application looked different and, for a photo service, users had to read a lot of text and images were clunky."}, {"004c": "Old Flickr Mobile App"}, {"419c": "In 2012, however, when Marissa Mayer became CEO of Yahoo, she made revamping Flickr, especially on the mobile platform, a top priority and a redesign of the service occurred. The redesign focused on creating a similar user experience across platforms and had the challenge of figuring out how users could tag and search for photos, without reading and seeing a lot of text and words. Hence, the design placed more emphasis on images and photos."}, {"01b4": "Mobile Flickr Redesigned"}, {"8e8c": "While the redesign helped revitalize interest in Flickr, Flickr soon realized it needed to improve its tagging and search abilities in order for users to find exactly the photos they were looking for. In 2015, they added four features…."}, {"75d6": "Search for Photos"}, {"fdbd": "Using the Service"}, {"5f3b": "Using Flickr is relatively easy and intuitive."}, {"85fa": "First time users are asked to sign up and make an account. At first, because of Yahoo’s decline, I was afraid users would have to have (or be forced to make) a Yahoo account, but users are allowed to use another e-mail address."}, {"7012": "In the future, Flickr might consider allowing users to sign-up with one of their social media accounts to streamline the sign-up process."}, {"10a7": "Signing-Up"}, {"2368": "To upload a photo, users can click the cloud/arrow icon (universal symbol for upload) to upload either a single or a group of photos. In this scenario, I uploaded a picture I took when I visited Washington D.C. After the user uploads the photo, they are given various options to tag and categorize the photo. In this case, I titled the photo “DC” and added a description, date taken, and tags. These tags and descriptions ultimately help users organize, search, and find their (and others) photos. Once I clicked ‘save’, Flickr uploaded/stored the photo."}, {"2def": "Uploading and Tagging a Photo"}, {"076a": "The way a users’ photos organized/displayed depends on the user’s preferences. They are typically organized by the date taken, as well as the album or photos they are grouped in. Users, however, can change this based on their needs."}, {"308d": "Searching for photos is simple too. Users simply use the search bar and icon at the top of the screen and use various search terms. Flickr then returns results in order of relevance from the user’s photos, people they follow, and everyone’s photos."}, {"333a": "Cherry Blossom Search"}, {"d9c7": "If that search wasn’t enough, users can perform an advanced search using color filters, gradients, and other tools."}, {"97fc": "Advanced Cherry Blossom Search"}, {"673a": "The uploading and searching flow is similar across platforms."}, {"bf9d": "Furthermore, for existing Flickr users, except for signing up, the flow is similar as well. That being said, when existing users sign-in to the website, they are greeted by a home page similar to Instagram where they see other people’s photos and can “favorite” them. I would recommend changing the home page to the user page because most people use Flickr to upload and organize their photos."}, {"7777": "Future"}, {"0e31": "In the future, Flickr is exploring tagging opportunities related to virtual reality and 360 degree photos. This is a smart move for Flickr due to the increase in virtual reality products (i.e. Oculus) that are starting to hit the marketplace."}, {"2a47": "Flickr VR"}, {"2687": "Sources:"}, {"1ac5": "Flickr - WikipediaFlickr (pronounced \"flicker\") is an image hosting and video hosting website and web services suite that was created by…en.wikipedia.org"}, {"7c0a": "http://appft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PG01&p=1&u=/netahtml/PTO/srchnum.html&r=1&f=G&l=50&s1=%2220060242139%22.PGNR.&OS=DN/20060242139&RS=DN/20060242139"}, {"0579": "Flickr: the world's photo albumBack online, Flickrites were consummate Web 2.0 users, not just consuming what they saw, but contributing to…www.telegraph.co.uk"}, {"b92e": "It's Time To Take Flickr Seriously AgainYesterday, Yahoo pushed out the biggest update to Flickr, maybe ever. An update two years in the making, Flickr 4.0 is…www.fastcodesign.com"}, {"2ff1": "14 Interesting flickr StatsFor photographers, bloggers and just about anyone with a camera, flickr has been a reliable, helpful photo-sharing…expandedramblings.com"}, {"e55d": "Yahoo to Release New Flickr App and Web Design, Replacing Previous New OneNo, not the old new one. The new new one!www.recode.net"}], "content": "Flickr: The Internet’s First Digital Photo Album History In 2004, Flickr, an image hosting website, was founded by Ludicorp, a gaming company based in Vancouver, Canada. Originally, Flickr (at the time known as FlickrLive) was primarily a chat site where users could send photos to one another. Original Version of Flickr As time progressed, however, Flickr moved away from the chat function due to competition from AOL and focused on its competitive advantage: photo (sharing). This also coincided with the increase in digital photography. In 2005, Yahoo bought Ludicorp; hence, Flickr as well. Initially, Flickr users would simply upload photos onto the website, but the website did not support the use of tagging photos. As a result, users had difficulty searching and finding photos that were relevant to them. Old Version of Flickr Eventually, Flickr added the tagging (words or phrases describing the picture) feature, which significantly improved the website’s taxonomy and structure. Because of the change, Flickr users could add tags to photos that would allow other users to search for photos that interested them. In addition, Flickr added a geo-tagging feature which allowed photos to be tagged to a specific location on a map, or grouped with other photos in a similar location. Hence, the core data of Flickr is images, which users can name, tag, and add comments too. This was somewhat similar to my information project on restaurants, where users could find restaurants they were interested in based on a tag that was associated to the restaurant. GeoTagging At the time, tagging photos was a relatively new concept which people valued. As a result, Flickr’s user base increased. In fact, “The US Library of Congress was so impressed with Flickr’s work that in 2008 it added unmarked photographs from its archive to Flickr in the hope that the people might identify them.” Modern Day Flickr With the rise of smartphones and digital photographs, the number of people using Flickr and uploading photos to the site has increased. Currently, Flickr is home to over 13 billion photos, 2 million groups, and 122 million users. Every day people share approximately 1 million photos on Flickr. Additionally, people are accessing the website on different mediums such as tablets, smartphones, and PCS. These changes and user growth, however, brought about new challenges for Flickr in order to stay relevant, create and deliver a strong user experience, and keep its original competitive advantage (allowing users a frictionless experience of searching and finding photos). Initially, Flickr was not able to keep up with the technological and user changes. For instance, the service did not have a mobile application until a few years ago and, even then, the services were designed poorly. The website and the mobile application looked different and, for a photo service, users had to read a lot of text and images were clunky. Old Flickr Mobile App In 2012, however, when Marissa Mayer became CEO of Yahoo, she made revamping Flickr, especially on the mobile platform, a top priority and a redesign of the service occurred. The redesign focused on creating a similar user experience across platforms and had the challenge of figuring out how users could tag and search for photos, without reading and seeing a lot of text and words. Hence, the design placed more emphasis on images and photos. Mobile Flickr Redesigned While the redesign helped revitalize interest in Flickr, Flickr soon realized it needed to improve its tagging and search abilities in order for users to find exactly the photos they were looking for. In 2015, they added four features…. Search for Photos Using the Service Using Flickr is relatively easy and intuitive. First time users are asked to sign up and make an account. At first, because of Yahoo’s decline, I was afraid users would have to have (or be forced to make) a Yahoo account, but users are allowed to use another e-mail address. In the future, Flickr might consider allowing users to sign-up with one of their social media accounts to streamline the sign-up process. Signing-Up To upload a photo, users can click the cloud/arrow icon (universal symbol for upload) to upload either a single or a group of photos. In this scenario, I uploaded a picture I took when I visited Washington D.C. After the user uploads the photo, they are given various options to tag and categorize the photo. In this case, I titled the photo “DC” and added a description, date taken, and tags. These tags and descriptions ultimately help users organize, search, and find their (and others) photos. Once I clicked ‘save’, Flickr uploaded/stored the photo. Uploading and Tagging a Photo The way a users’ photos organized/displayed depends on the user’s preferences. They are typically organized by the date taken, as well as the album or photos they are grouped in. Users, however, can change this based on their needs. Searching for photos is simple too. Users simply use the search bar and icon at the top of the screen and use various search terms. Flickr then returns results in order of relevance from the user’s photos, people they follow, and everyone’s photos. Cherry Blossom Search If that search wasn’t enough, users can perform an advanced search using color filters, gradients, and other tools. Advanced Cherry Blossom Search The uploading and searching flow is similar across platforms. Furthermore, for existing Flickr users, except for signing up, the flow is similar as well. That being said, when existing users sign-in to the website, they are greeted by a home page similar to Instagram where they see other people’s photos and can “favorite” them. I would recommend changing the home page to the user page because most people use Flickr to upload and organize their photos. Future In the future, Flickr is exploring tagging opportunities related to virtual reality and 360 degree photos. This is a smart move for Flickr due to the increase in virtual reality products (i.e. Oculus) that are starting to hit the marketplace. Flickr VR Sources: Flickr - WikipediaFlickr (pronounced \"flicker\") is an image hosting and video hosting website and web services suite that was created by…en.wikipedia.org http://appft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PG01&p=1&u=/netahtml/PTO/srchnum.html&r=1&f=G&l=50&s1=%2220060242139%22.PGNR.&OS=DN/20060242139&RS=DN/20060242139 Flickr: the world's photo albumBack online, Flickrites were consummate Web 2.0 users, not just consuming what they saw, but contributing to…www.telegraph.co.uk It's Time To Take Flickr Seriously AgainYesterday, Yahoo pushed out the biggest update to Flickr, maybe ever. An update two years in the making, Flickr 4.0 is…www.fastcodesign.com 14 Interesting flickr StatsFor photographers, bloggers and just about anyone with a camera, flickr has been a reliable, helpful photo-sharing…expandedramblings.com Yahoo to Release New Flickr App and Web Design, Replacing Previous New OneNo, not the old new one. The new new one!www.recode.net ", "child": "1158_1\t1158_2\t1158_3\t1158_4\t1158_5\t1158_6\t1158_7\t1158_8\t1158_9"}