{"name": "1189", "parent": "", "title": "Going Home", "sentences": [{"9709": "Going Home"}, {"f30d": "by Sarah Goldsmith"}, {"d10a": "Source"}, {"5e69": "The young man lay on his back looking up at the inky sky. Dots of milky white stars glittered here and there and the young man stared at them, trying to remember the names of the constellations his dad had taught him. Sleep threatened to overwhelm him and he felt his eyelids grow heavy. He blinked his eyes furiously, determined to stay awake and watch the sky. But it wasn’t just the stars he was interested in and he didn’t want to miss the spectacle above him."}, {"b506": "Every so often, the night sky would burst into life as a multitude of fireworks exploded, sending streams of glorious colours shooting across the darkness. He’d never seen anything so wondrous before. The colours were like something from a picture book. Vibrant pinks, vivid reds, and luscious purples whizzed across the sky in every direction, dazzling him into stunned silence. Gold and silver droplets rained down with such intensity that he was sure he would feel them on his face. It was incredible."}, {"6757": "The young man had always loved fireworks. He’d been fascinated by how they worked, how the colours were produced and how the different bangs and squeals were made. He loved the rockets best of all, waiting in anticipation as they soared high into the atmosphere before exploding with a shower of blinding colour and glimmering sparks."}, {"1a09": "He lay in the silence, waiting for the next round of fireworks. It was chilly on the ground, but he didn’t feel like moving, not just yet. Surely there’d be more to see. He soon became aware of someone at his side and he turned his head to see who was there. His brow furrowed in confusion as he tried to put a name to the friendly face hovering above his. And then he grinned as he remembered."}, {"d5d8": "“Hello, sarge,” he said, confused as to why his voice sounded strange. He tried to clear his throat, but succeeded only in hurting his stomach with the movement."}, {"2a06": "“Stay still, lad,” the sergeant said."}, {"c2e2": "“Pretty ain’t they?” the young man said."}, {"6d6b": "“What’s that, son?”"}, {"b635": "The young man chuckled. “The fireworks of course! Look at ’em. I’ve never seen nothing like it.”"}, {"3762": "The sergeant watched the young man as he gazed at the sky with complete fascination."}, {"a5bc": "“Aye, son, they’re beautiful.”"}, {"c544": "The young man smiled as the heavens erupted again. He heard other voices behind him and tried to get up to see who was there, but he felt rooted to the ground. There was something heavy on his lap."}, {"d4b4": "“Is something on my legs, sarge?”"}, {"4ddb": "“Just a blanket, lad. It’s a cold night.”"}, {"cc6c": "The young man nodded and smiled his thanks. He wasn’t used to the sergeant being so kind, but guessed the gorgeous fireworks must have inspired some feeling of warmth in him. He lay still, listening to the voices behind him. He couldn’t quite make out what they said but he liked the sound of their gently whispered words. It reminded him of home and the lazy days he’d spent by the river trying to catch a trout or two for his mum, listening to the wind as it rustled through the bulrushes."}, {"e5ca": "Thinking of home made him remember when his mum and dad had taken him to see the fireworks on bonfire nights. They were such happy times."}, {"901f": "“I love fireworks, don’t you sarge? Never thought we’d get them out here, though. I’ll have to tell my mum in my letter home. She’ll never believe me when I tell her.”"}, {"f5e2": "“That’s a good idea, lad. Your mother will be pleased.”"}, {"82ba": "“We used to go to the park every bonfire night. The fireworks were ever so good, but nothing as grand as these. Cor! Look at that one!” he said, his face breaking into a glorious grin as he tried to raise himself up in his elbows."}, {"3731": "The young man suddenly felt very cold and a peculiar spasm of pain made its way through his body."}, {"506b": "“Sarge? I feel a bit funny,” he said, turning his pale face to the older man."}, {"ec5d": "“Stay still, lad. Just look at the fireworks. Pretty things, aren’t they?”"}, {"b8ab": "The young man’s face relaxed as he turned back to the sky."}, {"ddcd": "“I can’t wait to go home, sarge. Do you think it’ll be much longer? It feels like ages since we’ve been here.”"}, {"6d21": "“Nay, lad. It won’t be long now. You’ll soon be home.”"}, {"2dcb": "“Good. Oh, don’t get me wrong, sarge. I’m glad to be doing my bit, but I don’t half miss my mum.”"}, {"54b8": "The sergeant swallowed his tears as he saw the young man’s face contort in pain again. He took the young man’s hand in his and held it very tightly."}, {"013f": "“It won’t be long now, son.”"}, {"2e75": "The young man’s eyes raked the air around him, squinting in confusion, before settling on a spot just in front of him."}, {"b1be": "“Mum? What are you doing here? Have you come to see the fireworks?” the young man said, as his face broke into a beautiful smile."}, {"5540": "The sergeant looked behind him to the men huddled together as they prayed for their fallen comrade."}, {"8ee2": "“Look, mum. Look at the colours,” the young man said, as his eyes closed for the final time."}, {"6dc8": "The sergeant stared up at the sky. The flares and flashes from the guns and artillery bathed the night sky in an eerie red glow."}, {"f763": "Tears fell down the sergeant’s face as he looked down at the young man who still wore a happy smile upon his face. They’d tried to move the young soldier back to their trenches after he’d been hit by the shrapnel from an exploded shell, but the pain was too great. His pals refused to leave him to die alone and so they’d stayed there with him out on No Man’s Land. His war was over now."}, {"d9e7": "“That’s right, son. You’re home now.”"}], "content": "Going Home by Sarah Goldsmith Source The young man lay on his back looking up at the inky sky. Dots of milky white stars glittered here and there and the young man stared at them, trying to remember the names of the constellations his dad had taught him. Sleep threatened to overwhelm him and he felt his eyelids grow heavy. He blinked his eyes furiously, determined to stay awake and watch the sky. But it wasn’t just the stars he was interested in and he didn’t want to miss the spectacle above him. Every so often, the night sky would burst into life as a multitude of fireworks exploded, sending streams of glorious colours shooting across the darkness. He’d never seen anything so wondrous before. The colours were like something from a picture book. Vibrant pinks, vivid reds, and luscious purples whizzed across the sky in every direction, dazzling him into stunned silence. Gold and silver droplets rained down with such intensity that he was sure he would feel them on his face. It was incredible. The young man had always loved fireworks. He’d been fascinated by how they worked, how the colours were produced and how the different bangs and squeals were made. He loved the rockets best of all, waiting in anticipation as they soared high into the atmosphere before exploding with a shower of blinding colour and glimmering sparks. He lay in the silence, waiting for the next round of fireworks. It was chilly on the ground, but he didn’t feel like moving, not just yet. Surely there’d be more to see. He soon became aware of someone at his side and he turned his head to see who was there. His brow furrowed in confusion as he tried to put a name to the friendly face hovering above his. And then he grinned as he remembered. “Hello, sarge,” he said, confused as to why his voice sounded strange. He tried to clear his throat, but succeeded only in hurting his stomach with the movement. “Stay still, lad,” the sergeant said. “Pretty ain’t they?” the young man said. “What’s that, son?” The young man chuckled. “The fireworks of course! Look at ’em. I’ve never seen nothing like it.” The sergeant watched the young man as he gazed at the sky with complete fascination. “Aye, son, they’re beautiful.” The young man smiled as the heavens erupted again. He heard other voices behind him and tried to get up to see who was there, but he felt rooted to the ground. There was something heavy on his lap. “Is something on my legs, sarge?” “Just a blanket, lad. It’s a cold night.” The young man nodded and smiled his thanks. He wasn’t used to the sergeant being so kind, but guessed the gorgeous fireworks must have inspired some feeling of warmth in him. He lay still, listening to the voices behind him. He couldn’t quite make out what they said but he liked the sound of their gently whispered words. It reminded him of home and the lazy days he’d spent by the river trying to catch a trout or two for his mum, listening to the wind as it rustled through the bulrushes. Thinking of home made him remember when his mum and dad had taken him to see the fireworks on bonfire nights. They were such happy times. “I love fireworks, don’t you sarge? Never thought we’d get them out here, though. I’ll have to tell my mum in my letter home. She’ll never believe me when I tell her.” “That’s a good idea, lad. Your mother will be pleased.” “We used to go to the park every bonfire night. The fireworks were ever so good, but nothing as grand as these. Cor! Look at that one!” he said, his face breaking into a glorious grin as he tried to raise himself up in his elbows. The young man suddenly felt very cold and a peculiar spasm of pain made its way through his body. “Sarge? I feel a bit funny,” he said, turning his pale face to the older man. “Stay still, lad. Just look at the fireworks. Pretty things, aren’t they?” The young man’s face relaxed as he turned back to the sky. “I can’t wait to go home, sarge. Do you think it’ll be much longer? It feels like ages since we’ve been here.” “Nay, lad. It won’t be long now. You’ll soon be home.” “Good. Oh, don’t get me wrong, sarge. I’m glad to be doing my bit, but I don’t half miss my mum.” The sergeant swallowed his tears as he saw the young man’s face contort in pain again. He took the young man’s hand in his and held it very tightly. “It won’t be long now, son.” The young man’s eyes raked the air around him, squinting in confusion, before settling on a spot just in front of him. “Mum? What are you doing here? Have you come to see the fireworks?” the young man said, as his face broke into a beautiful smile. The sergeant looked behind him to the men huddled together as they prayed for their fallen comrade. “Look, mum. Look at the colours,” the young man said, as his eyes closed for the final time. The sergeant stared up at the sky. The flares and flashes from the guns and artillery bathed the night sky in an eerie red glow. Tears fell down the sergeant’s face as he looked down at the young man who still wore a happy smile upon his face. They’d tried to move the young soldier back to their trenches after he’d been hit by the shrapnel from an exploded shell, but the pain was too great. His pals refused to leave him to die alone and so they’d stayed there with him out on No Man’s Land. His war was over now. “That’s right, son. You’re home now.” ", "child": "1189_1\t1189_2\t1189_3\t1189_4\t1189_5\t1189_6"}