{"name": "1194", "parent": "", "title": "Till the Fireworks Last", "sentences": [{"b946": "Till the Fireworks Last"}, {"1955": "Pia looked at the screen again and then looked down at her boarding pass. “AI-245”, she hummed, scrolling the screen flashing the flight numbers with her eyes. She was getting edgy unable to find the flight number on the list. She had long stopped relaxing in the passenger lounge. She had been standing right under the screen for last 20 minutes, every now and then darting her eyes at the Air India kiosk."}, {"0266": "Such careless attitude, not an iota of professionalism, her heart snapped and sank. Should have listened to Rini and booked United, a thought loomed in her mind. It receded, even before it could linger. Well, better late than getting boarded and then dragged out, she heard her mind chuckle. She liked that — it had been long since it had expressed anything but grief."}, {"ddcc": "“Hello, Pia.”"}, {"6892": "Pia turned around and went completely deadpan. “Om? What are you doing here?”"}, {"361f": "Om looked down at his shoe, scratching at the floor. Pia had her questioning eyes fixated at him. “Will you please come with me for a moment Pia,” he finally replied."}, {"8e4d": "What games is fate playing with me now? Pia pondered. She crossed her arms and quipped, “Now? Where? You do know that I have a flight to catch, right? And anyway we met, what, like an hour back. You people gave me a send-off. Remember?”"}, {"dd9a": "“Yes, we did,” Om was still looking at his shoe. He finally kicked the floor as if dusting it of some invisible mud and stepped ahead. “But there is something really important I need to talk to you about.”"}, {"a378": "Pia kept looking at him, crossing her arms tighter across her chest. She wanted to scream at him, but words had suddenly deserted her. She finally gave up on her struggle to conjure them, took her luggage and walked outside with him. They walked, and then walked some more. Neither of them wanted to break the tension that the silence had woven between them."}, {"2f72": "Once they reached a quiet hillock, Pia looked back at Om, her eyes searching for answers on his face."}, {"b579": "“There is a burden on my heart Pia,” Om muttered, “which I need to offload. Else I would be crushed beneath it.”"}, {"b2cd": "Her eyes grew wide with her fists closing tighter. Then they narrowed, watery, across her slanted face, as if questioning Why are you doing this, Om?"}, {"904c": "“Please don’t go, Pia.”"}, {"0110": "Simple words, but they carried a baggage that made them loaded enough to take Pia aback. She looked around, dazed, and then somehow managed to stutter her first words since minutes that felt like an eternity, “No, don’t.”"}, {"53c4": "No words followed post that. Om blanked out. Pia, nonplussed."}, {"22a0": "Both were startled back to reality by a firework that brushed a multi-coloured spider across the sky. “Looks like a multi-shot cake firework”, Om simpered, a smile donning across his face. “Hear me out till the fireworks last Pia. Then you can leave.”"}, {"4fdd": "All Pia could do was nod. Her eyes, her fists, her arms had returned to normal. But as a whole, her body had gone wooden."}, {"a3b7": "“I have always been in awe of you, of your personality, of your nature. I still remember the day when I first met you at Rini’s home, the day that ended in a night out with “Jerry Maguire” show. I have been your friend since then, and I have never felt emptier than the last 6 months when you were away.”"}, {"61bd": "Another firework lit the sky. Om tried to read Pia’s face, but it was still as a calm sea — there was some movement, but he could not gather what was to come."}, {"7af8": "“You are the one person I need to have around me for life, else my life would be a total mess. With you not around, everything was amiss. Well, I may not be the most handsome guy out there. I may not be one of the richest, the smartest guys out there. But..”"}, {"cf9b": "The sound from another firework muffled Om’s next words. He cursed the timing, he did not want his last words to linger around any longer. So he attempted to override the effect the firework had."}, {"ad37": "“But I am confident that I will be the one person that will care for you more than anyone has ever cared for someone else.”"}, {"948f": "Om paused to let the words sink, to see if they had any effect on Pia. She stayed unmoved. He continued, dejection apparent in his voice, “Last 6 months have, professionally, been the most fruitful ones for me, but I wasn’t happy. Because I could not share the joy with you. I had the world to cheer me Pia, but I was crying inside.”"}, {"f675": "Firework lit the skies again — this time, Om appreciated the timing. Pia had been looking at her toes for quite some time, digging the dirt out. As the firework was dying down, Om felt he saw a shimmer of a drop leave Pia’s eye and collapse."}, {"48c7": "“And as I stand here on the verge of sending you off to another country, another world, I can’t imagine what my life would be without you around, ever.”"}, {"f7c0": "Om could hear Pia whimper, but he persisted, “It would be empty, and I have seen my empty heart bleed. If you leave today, you will leave my life empty, hollow. You have always been my Dorothy since that first night out. You complete me, Pia. And..”"}, {"ce1b": "“Yes,” emerged a sound amidst the sobs."}, {"8f6f": "The word that he thought he heard leave Pia’s mouth left Om perplexed. “What? I don’t ..”"}, {"11f8": "“Shut up you fool. Here’s your Dorothy saying You had me at ‘hello’.”"}, {"9f8d": "Many fireworks engulfed the stars in the night sky. The only thing left gleaming were the tears rolling down Pia’s cheeks as she collapsed in Om’s arms."}], "content": "Till the Fireworks Last Pia looked at the screen again and then looked down at her boarding pass. “AI-245”, she hummed, scrolling the screen flashing the flight numbers with her eyes. She was getting edgy unable to find the flight number on the list. She had long stopped relaxing in the passenger lounge. She had been standing right under the screen for last 20 minutes, every now and then darting her eyes at the Air India kiosk. Such careless attitude, not an iota of professionalism, her heart snapped and sank. Should have listened to Rini and booked United, a thought loomed in her mind. It receded, even before it could linger. Well, better late than getting boarded and then dragged out, she heard her mind chuckle. She liked that — it had been long since it had expressed anything but grief. “Hello, Pia.” Pia turned around and went completely deadpan. “Om? What are you doing here?” Om looked down at his shoe, scratching at the floor. Pia had her questioning eyes fixated at him. “Will you please come with me for a moment Pia,” he finally replied. What games is fate playing with me now? Pia pondered. She crossed her arms and quipped, “Now? Where? You do know that I have a flight to catch, right? And anyway we met, what, like an hour back. You people gave me a send-off. Remember?” “Yes, we did,” Om was still looking at his shoe. He finally kicked the floor as if dusting it of some invisible mud and stepped ahead. “But there is something really important I need to talk to you about.” Pia kept looking at him, crossing her arms tighter across her chest. She wanted to scream at him, but words had suddenly deserted her. She finally gave up on her struggle to conjure them, took her luggage and walked outside with him. They walked, and then walked some more. Neither of them wanted to break the tension that the silence had woven between them. Once they reached a quiet hillock, Pia looked back at Om, her eyes searching for answers on his face. “There is a burden on my heart Pia,” Om muttered, “which I need to offload. Else I would be crushed beneath it.” Her eyes grew wide with her fists closing tighter. Then they narrowed, watery, across her slanted face, as if questioning Why are you doing this, Om? “Please don’t go, Pia.” Simple words, but they carried a baggage that made them loaded enough to take Pia aback. She looked around, dazed, and then somehow managed to stutter her first words since minutes that felt like an eternity, “No, don’t.” No words followed post that. Om blanked out. Pia, nonplussed. Both were startled back to reality by a firework that brushed a multi-coloured spider across the sky. “Looks like a multi-shot cake firework”, Om simpered, a smile donning across his face. “Hear me out till the fireworks last Pia. Then you can leave.” All Pia could do was nod. Her eyes, her fists, her arms had returned to normal. But as a whole, her body had gone wooden. “I have always been in awe of you, of your personality, of your nature. I still remember the day when I first met you at Rini’s home, the day that ended in a night out with “Jerry Maguire” show. I have been your friend since then, and I have never felt emptier than the last 6 months when you were away.” Another firework lit the sky. Om tried to read Pia’s face, but it was still as a calm sea — there was some movement, but he could not gather what was to come. “You are the one person I need to have around me for life, else my life would be a total mess. With you not around, everything was amiss. Well, I may not be the most handsome guy out there. I may not be one of the richest, the smartest guys out there. But..” The sound from another firework muffled Om’s next words. He cursed the timing, he did not want his last words to linger around any longer. So he attempted to override the effect the firework had. “But I am confident that I will be the one person that will care for you more than anyone has ever cared for someone else.” Om paused to let the words sink, to see if they had any effect on Pia. She stayed unmoved. He continued, dejection apparent in his voice, “Last 6 months have, professionally, been the most fruitful ones for me, but I wasn’t happy. Because I could not share the joy with you. I had the world to cheer me Pia, but I was crying inside.” Firework lit the skies again — this time, Om appreciated the timing. Pia had been looking at her toes for quite some time, digging the dirt out. As the firework was dying down, Om felt he saw a shimmer of a drop leave Pia’s eye and collapse. “And as I stand here on the verge of sending you off to another country, another world, I can’t imagine what my life would be without you around, ever.” Om could hear Pia whimper, but he persisted, “It would be empty, and I have seen my empty heart bleed. If you leave today, you will leave my life empty, hollow. You have always been my Dorothy since that first night out. You complete me, Pia. And..” “Yes,” emerged a sound amidst the sobs. The word that he thought he heard leave Pia’s mouth left Om perplexed. “What? I don’t ..” “Shut up you fool. Here’s your Dorothy saying You had me at ‘hello’.” Many fireworks engulfed the stars in the night sky. The only thing left gleaming were the tears rolling down Pia’s cheeks as she collapsed in Om’s arms. ", "child": "1194_1\t1194_2"}