{"name": "1205", "parent": "", "title": "“I shouldn’t be here.”", "sentences": [{"13a2": "“I shouldn’t be here.”"}, {"70b8": "I was in my little shop. We rented it for a short while, just to get a little exposure for my photography. This guy had come in after I had been open for a couple of months. He had seemed nervous when he first came in, made a quick glance around at prints. One seemed to draw his eyes back."}, {"4fa9": "“Good,” I thought to myself."}, {"f94f": "But, that is not why he was here."}, {"e5f3": "A few more seconds go by. He took a deep breath, then asked me if my wife was a teacher. I told him, yes she was. He then asked me if she teaches at XXXXXXXX School? I confirmed he was correct."}, {"1ef3": "“Look, I do not have very long, I shouldn’t even be here. But my brother told me who you are. And I can see you here from my window and I had to come tell you something."}, {"2bd8": "You have to tell her she changed my life."}, {"954f": "I would not be alive today without her. I have made a lot of mistakes. Hell, my life is one big mistake. But, she showed me someone cares. She showed all of us respect. I have had a lot of time to think in jail. I have had a lot of time to think, stuck over in that house. That is about all I have TO do. I think about a lot of things, some of them are not good. You tell her, because of her, no matter how bleak things seem, or the things I think about, she taught me that someone does care. So, I am still here.”"}, {"01e5": "About a week later, I heard they came and arrested him again, for breaking house arrest. But, at least his breaking out was to tell someone he cares about Randomly Me."}], "content": "“I shouldn’t be here.” I was in my little shop. We rented it for a short while, just to get a little exposure for my photography. This guy had come in after I had been open for a couple of months. He had seemed nervous when he first came in, made a quick glance around at prints. One seemed to draw his eyes back. “Good,” I thought to myself. But, that is not why he was here. A few more seconds go by. He took a deep breath, then asked me if my wife was a teacher. I told him, yes she was. He then asked me if she teaches at XXXXXXXX School? I confirmed he was correct. “Look, I do not have very long, I shouldn’t even be here. But my brother told me who you are. And I can see you here from my window and I had to come tell you something. You have to tell her she changed my life. I would not be alive today without her. I have made a lot of mistakes. Hell, my life is one big mistake. But, she showed me someone cares. She showed all of us respect. I have had a lot of time to think in jail. I have had a lot of time to think, stuck over in that house. That is about all I have TO do. I think about a lot of things, some of them are not good. You tell her, because of her, no matter how bleak things seem, or the things I think about, she taught me that someone does care. So, I am still here.” About a week later, I heard they came and arrested him again, for breaking house arrest. But, at least his breaking out was to tell someone he cares about Randomly Me. ", "child": "1205_1\t1205_2\t1205_3\t1205_4\t1205_5"}