{"name": "1207", "parent": "", "title": "(335) Humanity", "sentences": [{"dbbc": "(335) Humanity"}, {"36aa": "My dog can smell sadness, like she smells a laugh I haven’t uttered or a phrase I’m about to play. She sits with my intent realized in her eyes, huffles and whimpers bubbling from her lips while she leans her head against my chest. The day I’ve had and the distance of the pain that has wrought weight in my afternoon do not lessen the tang of her inhales against the thick rhythm of my breath. She will not barter with context or nuance; my sadness is all there is."}, {"9cf2": "My dog doesn’t care if my sadness is warranted and she doesn’t think about the bone she’d rather chew. She isn’t embarrassed when her tail curls because she thinks my shame is hers. She isn’t worried her reaction will make my state worse, because her reaction is consuming. My sadness is all there is."}, {"4b03": "She must sit close, she must breathe with me, must shake with me, endure. She must listen to my heart and the words I haven’t said and the ache I have buried, encompassed. She must navigate my riptide until the salt washes from my sigh, because until it does, my sadness is all there is."}, {"03c9": "She will forget herself waiting, lose even her hunger and her play as her eyes blink slow with my sticky pulse. She will let her sighs stretch as my heft heels, her inhale searching, surrounding the tendrils of the rift that glared. She will wait till it’s prairie, for until then, my sadness is all there is."}, {"0ffa": "My dog won’t resent the pain that I’ve caused her as she drowned in my angst. She won’t shy from the time I have stolen or the lonely I have thrown, while she waited with her head on my chest. She will be elated, thorough and surprised, when she sniffs no grief, because for her, my sadness is all there was."}, {"245b": "And when it is not, all that is left is joy."}], "content": "(335) Humanity My dog can smell sadness, like she smells a laugh I haven’t uttered or a phrase I’m about to play. She sits with my intent realized in her eyes, huffles and whimpers bubbling from her lips while she leans her head against my chest. The day I’ve had and the distance of the pain that has wrought weight in my afternoon do not lessen the tang of her inhales against the thick rhythm of my breath. She will not barter with context or nuance; my sadness is all there is. My dog doesn’t care if my sadness is warranted and she doesn’t think about the bone she’d rather chew. She isn’t embarrassed when her tail curls because she thinks my shame is hers. She isn’t worried her reaction will make my state worse, because her reaction is consuming. My sadness is all there is. She must sit close, she must breathe with me, must shake with me, endure. She must listen to my heart and the words I haven’t said and the ache I have buried, encompassed. She must navigate my riptide until the salt washes from my sigh, because until it does, my sadness is all there is. She will forget herself waiting, lose even her hunger and her play as her eyes blink slow with my sticky pulse. She will let her sighs stretch as my heft heels, her inhale searching, surrounding the tendrils of the rift that glared. She will wait till it’s prairie, for until then, my sadness is all there is. My dog won’t resent the pain that I’ve caused her as she drowned in my angst. She won’t shy from the time I have stolen or the lonely I have thrown, while she waited with her head on my chest. She will be elated, thorough and surprised, when she sniffs no grief, because for her, my sadness is all there was. And when it is not, all that is left is joy. ", "child": "1207_1\t1207_2\t1207_3\t1207_4\t1207_5\t1207_6\t1207_7\t1207_8\t1207_9\t1207_10\t1207_11\t1207_12\t1207_13\t1207_14\t1207_15\t1207_16\t1207_17\t1207_18\t1207_19\t1207_20\t1207_21\t1207_22\t1207_23\t1207_24\t1207_25"}