{"name": "1213", "parent": "", "title": "What its like to be Gen X in 2017.", "sentences": [{"5b9c": "What its like to be Gen X in 2017."}, {"449f": "At least at my house."}, {"e9a7": "I was on a phone call this morning when a perfect storm of certain elements of my life collided."}, {"cfe8": "The elements."}, {"f7f7": "A) My father-in-law, George, has dementia and lives in my basement apartment with my mother-in-law,who also has dementia."}, {"42b7": "B) My 23-year-old son, Nick, has autism, and lives in the room that used to be my office."}, {"6fb1": "C) I work from home."}, {"1cb0": "D) I am technologically stupid and couldn’t figure out how to turn the speaker phone off on my iPhone after I’d navigated away from the keyboard screen."}, {"b5a2": "What happened."}, {"fe9f": "So, I’m in my bedroom, which is the only room in my house (that isn’t a bathroom) that has a door I can shut. I’m on speaker phone so I can take notes during this semi-important phone call, when George shows up."}, {"8815": "He knocks, but didn’t take the hint when I ignored him in favor of my call. It doesn’t work. He comes on in."}, {"ebb7": "Record scratch."}, {"5685": "Let’s stop here for just a second. I want to make sure you appreciate this point: My father-in-law burst into my bedroom. My life, you guys."}, {"8f03": "Onward."}, {"355d": "Because I couldn’t figure out how to turn off my speaker phone, especially in a moment of quasi panic, here’s the earful my caller was subjected to:"}, {"a92c": "George: I don’t want Nick in our apartment anymore. And we want a lock with a key."}, {"5a80": "Me: Okay, George, I’m on a call, I’ll come down in a minute."}, {"72b6": "George: (All caps do, in fact, indicate yelling.) HE ATE OUR CANDY."}, {"a2c1": "Caller: Shaunta?"}, {"6a1d": "Me: Nick came into your apartment when you weren’t home?"}, {"5277": "George: Yes. AND HE ATE ALL OUR CANDY."}, {"4152": "Me: Wow. Okay. Let me finish this call and I’ll talk to him."}, {"03d3": "George: I don’t want to be an SOB, but I don’t want him knocking on our door when he forgets his key either. He can just wait outside."}, {"7564": "Me: Okay."}, {"4eea": "George: I don’t want to be a SOB."}, {"dac8": "Me: Okay. Thanks."}, {"a054": "What really happened."}, {"1231": "Nick knocked on their door early in the morning because, as he often does, he forgot his key. Their door is a sliding glass door leading out of our open air basement. It was pitch dark, of course, because it was 4:30 in the freaking morning."}, {"74e6": "George got out of bed and let Nick in. On his way through their living room to the stairs that would take him upstairs, Nick took candy out of their bowl."}, {"d5ba": "Because he has autism and struggles with both boundaries and social skills, it didn’t occur to my son that showing up at 4:30 in the morning was a bad idea. He needed in and that was the path he barreled down."}, {"af23": "It also didn’t occur to him that a bowl of candy didn’t mean that they were there for visitors to take. Especially at 4:30 in the morning, when a cranky old man has just jerked out of sleep by you banging on his door."}, {"06eb": "Mystery solved, by the way: George and his wife ate their own candy."}, {"beeb": "My life with autism and dementia."}, {"2e44": "If anyone in this house needs a lock on their door, it’s me."}, {"62cf": "I have eight younger brothers and sisters. When I was a teenager our dad was in prison and my step-mother was an alcoholic. And I was a married mother when I was twenty-one. It’s not like I’ve had a whole lot of experience with peace and tranquility."}, {"232d": "In fact, I usually thrive on chaos."}, {"ff69": "Most of the time I’m grateful that we’re in a position to take care of both my husband’s parents and our son."}, {"fc3e": "But holy hell, every now and there there’s a moment when I fantasize about those five minutes in the early 1990s when I had my very own apartment."}, {"8fa7": "If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤"}, {"76f0": ">>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"194b": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "content": "What its like to be Gen X in 2017. At least at my house. I was on a phone call this morning when a perfect storm of certain elements of my life collided. The elements. A) My father-in-law, George, has dementia and lives in my basement apartment with my mother-in-law,who also has dementia. B) My 23-year-old son, Nick, has autism, and lives in the room that used to be my office. C) I work from home. D) I am technologically stupid and couldn’t figure out how to turn the speaker phone off on my iPhone after I’d navigated away from the keyboard screen. What happened. So, I’m in my bedroom, which is the only room in my house (that isn’t a bathroom) that has a door I can shut. I’m on speaker phone so I can take notes during this semi-important phone call, when George shows up. He knocks, but didn’t take the hint when I ignored him in favor of my call. It doesn’t work. He comes on in. Record scratch. Let’s stop here for just a second. I want to make sure you appreciate this point: My father-in-law burst into my bedroom. My life, you guys. Onward. Because I couldn’t figure out how to turn off my speaker phone, especially in a moment of quasi panic, here’s the earful my caller was subjected to: George: I don’t want Nick in our apartment anymore. And we want a lock with a key. Me: Okay, George, I’m on a call, I’ll come down in a minute. George: (All caps do, in fact, indicate yelling.) HE ATE OUR CANDY. Caller: Shaunta? Me: Nick came into your apartment when you weren’t home? George: Yes. AND HE ATE ALL OUR CANDY. Me: Wow. Okay. Let me finish this call and I’ll talk to him. George: I don’t want to be an SOB, but I don’t want him knocking on our door when he forgets his key either. He can just wait outside. Me: Okay. George: I don’t want to be a SOB. Me: Okay. Thanks. What really happened. Nick knocked on their door early in the morning because, as he often does, he forgot his key. Their door is a sliding glass door leading out of our open air basement. It was pitch dark, of course, because it was 4:30 in the freaking morning. George got out of bed and let Nick in. On his way through their living room to the stairs that would take him upstairs, Nick took candy out of their bowl. Because he has autism and struggles with both boundaries and social skills, it didn’t occur to my son that showing up at 4:30 in the morning was a bad idea. He needed in and that was the path he barreled down. It also didn’t occur to him that a bowl of candy didn’t mean that they were there for visitors to take. Especially at 4:30 in the morning, when a cranky old man has just jerked out of sleep by you banging on his door. Mystery solved, by the way: George and his wife ate their own candy. My life with autism and dementia. If anyone in this house needs a lock on their door, it’s me. I have eight younger brothers and sisters. When I was a teenager our dad was in prison and my step-mother was an alcoholic. And I was a married mother when I was twenty-one. It’s not like I’ve had a whole lot of experience with peace and tranquility. In fact, I usually thrive on chaos. Most of the time I’m grateful that we’re in a position to take care of both my husband’s parents and our son. But holy hell, every now and there there’s a moment when I fantasize about those five minutes in the early 1990s when I had my very own apartment. If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ >>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "child": "1213_1\t1213_21213_1\t1213_2"}