{"name": "1217", "parent": "", "title": "Day (1) Joy", "sentences": [{"6cc0": "Day (1) Joy"}, {"f8b8": "Author’s Photo: Table Rock Lake, Missouri, Tall Tree Cottage"}, {"f3f1": "I awoke before the sun, but not before the birds. I could hear their morning songs through closed doors and windows. New, but familiar, too."}, {"5e31": "I do not speak bird, but I’m pretty sure they were singing, “Join us!”"}, {"ad8c": "From the loft above, I could hear my young man’s heavy footsteps. The lake and bass must have been calling to him, just as the birds called to me."}, {"a8aa": "I made coffee."}, {"694c": "He headed down the short path to the lake."}, {"2313": "For those who live in climates that experience nature’s long winter sleep, you will understand the feelings of joy and lightness I felt. I slipped on a pair of shorts, walked down to the lake and welcomed the kiss of sun’s the rays on my skin."}, {"aaa4": "The weather app, television meteorologist and radio deejays forecast a magnificent day, followed by two days of rain, thunder, lightening and hail."}, {"f902": "For that reason, I am finished with my story for today, with one exception."}, {"80e9": "I just might need to take a picture or two — or ninety-nine. They will help me to tell the stories to come,"}], "content": "Day (1) Joy Author’s Photo: Table Rock Lake, Missouri, Tall Tree Cottage I awoke before the sun, but not before the birds. I could hear their morning songs through closed doors and windows. New, but familiar, too. I do not speak bird, but I’m pretty sure they were singing, “Join us!” From the loft above, I could hear my young man’s heavy footsteps. The lake and bass must have been calling to him, just as the birds called to me. I made coffee. He headed down the short path to the lake. For those who live in climates that experience nature’s long winter sleep, you will understand the feelings of joy and lightness I felt. I slipped on a pair of shorts, walked down to the lake and welcomed the kiss of sun’s the rays on my skin. The weather app, television meteorologist and radio deejays forecast a magnificent day, followed by two days of rain, thunder, lightening and hail. For that reason, I am finished with my story for today, with one exception. I just might need to take a picture or two — or ninety-nine. They will help me to tell the stories to come, ", "child": "1217_1\t1217_2"}