{"name": "1247", "parent": "", "title": "Styleguides + Design Languages", "sentences": [{"b0f2": "Styleguides + Design Languages"}, {"4538": "Ones I like"}, {"29ab": "Material design - Google design guidelinesWe challenged ourselves to create a visual language for our users that synthesizes the classic principles of good…www.google.com"}, {"fc6b": "IBM Design LanguageUse the IBM Design Language to create beautifully crafted products and enlightening user experiences.www.ibm.com"}, {"3cf8": "Designing for iOSiOS embodies the following themes: Deference. The UI helps people understand and interact with the content, but never…developer.apple.com"}, {"497f": "UIKit CatalogViews are the building blocks for constructing your user interface. Rather than using one view to present your content…developer.apple.com"}, {"f3a0": "Huge Inc StyleguideA tool for easily creating and maintaining styleguideshugeinc.github.io"}, {"d448": "Ubuntu DesignUbuntu brand, app and web guidelines that help you create professional materials, software, sites, apps that build the…design.ubuntu.com"}, {"8008": "Design Universal Windows Platform (UWP) app - Windows app developmentDesign basics, guidelines and templates for developers and designers to invent, plan, and build UWP apps.dev.windows.com"}, {"995f": "Introducing:U.S. Web Design StandardsBy Mollie Ruskin,United States Digital Servicemedium.com"}, {"206d": "CFPB Design ManualA set of design principles and standards for the Consumer Financial Protection Bureau.cfpb.github.io"}, {"1de8": "USPTO UI Design LibraryWe have a lot of web projects at the USPTO. These design guidelines and resources aim to create a unified experience…uspto.github.io"}, {"750d": "Healthcare.gov StyleguideThe HealthCare.gov Styleguide provides an overview of styles, page layouts, assets, & editorial guidelines for…styleguide.healthcare.gov"}, {"3915": "Lightning Design SystemUtilize our detailed guidelines to confidently design excellent apps that fit right into the Salesforce ecosystem. With…www.lightningdesignsystem.com"}, {"55ac": "ID | VSCONotes from VSCO Design 🌭🍔🍕🍟🍗🍦vsco.co"}, {"d425": "Medium Brand Development"}, {"8ef0": "Buffer Style GuideBuffer makes it super easy to share any page you're reading. Keep your Buffer topped up and we automagically share them…buffer.com"}, {"2165": "Lonely Planet Design ElementsStyle Guide Documentation Performance Monitoring About Rizzorizzo.lonelyplanet.com"}, {"7161": "Mapbox styleguide | MapboxWelcome to Base - an internal guide & code repository for designing and coding at Mapbox. If you're new here, have a…www.mapbox.com"}, {"297e": "MailChimp UXOur grid system is composed of 8 flexible columns with a gutter between columns of 30px. We apply border-box so that…ux.mailchimp.com"}, {"4d3b": "Mozilla Style GuideOur mission - to promote openness, innovation and opportunity on the Internet - extends through everything we do. This…www.mozilla.org"}, {"cb56": "Homify Living Style GuideAvoid cascading where possible Only use classes, no IDs or tag names For each module/component in app/assets…www.homify.de"}, {"e725": "FontShop StyleguideFontShop.com - Discover the world's best fontswww.fontshop.com"}, {"43f5": "Github StyleguideGitHub is where people build software. More than 11 million people use GitHub to discover, fork, and contribute to over…github.com"}, {"c1a7": "BBC - GEL (Global Experience Language)BBC GEL BBC (Global Experience Language) guidelineswww.bbc.co.uk"}, {"b199": "Designing Hack@BrownI wanted to touch on a few of our design decisions, and the role the design team played in organizing the hackathon.medium.com"}, {"ac52": "Semantic UISemantic empowers designers and developers by creating a shared vocabulary for UI.semantic-ui.com"}, {"7159": "HH Design is a community around design in the context of technology."}, {"7233": "contribute"}], "content": "Styleguides + Design Languages Ones I like Material design - Google design guidelinesWe challenged ourselves to create a visual language for our users that synthesizes the classic principles of good…www.google.com IBM Design LanguageUse the IBM Design Language to create beautifully crafted products and enlightening user experiences.www.ibm.com Designing for iOSiOS embodies the following themes: Deference. The UI helps people understand and interact with the content, but never…developer.apple.com UIKit CatalogViews are the building blocks for constructing your user interface. Rather than using one view to present your content…developer.apple.com Huge Inc StyleguideA tool for easily creating and maintaining styleguideshugeinc.github.io Ubuntu DesignUbuntu brand, app and web guidelines that help you create professional materials, software, sites, apps that build the…design.ubuntu.com Design Universal Windows Platform (UWP) app - Windows app developmentDesign basics, guidelines and templates for developers and designers to invent, plan, and build UWP apps.dev.windows.com Introducing:U.S. Web Design StandardsBy Mollie Ruskin,United States Digital Servicemedium.com CFPB Design ManualA set of design principles and standards for the Consumer Financial Protection Bureau.cfpb.github.io USPTO UI Design LibraryWe have a lot of web projects at the USPTO. These design guidelines and resources aim to create a unified experience…uspto.github.io Healthcare.gov StyleguideThe HealthCare.gov Styleguide provides an overview of styles, page layouts, assets, & editorial guidelines for…styleguide.healthcare.gov Lightning Design SystemUtilize our detailed guidelines to confidently design excellent apps that fit right into the Salesforce ecosystem. With…www.lightningdesignsystem.com ID | VSCONotes from VSCO Design 🌭🍔🍕🍟🍗🍦vsco.co Medium Brand Development Buffer Style GuideBuffer makes it super easy to share any page you're reading. Keep your Buffer topped up and we automagically share them…buffer.com Lonely Planet Design ElementsStyle Guide Documentation Performance Monitoring About Rizzorizzo.lonelyplanet.com Mapbox styleguide | MapboxWelcome to Base - an internal guide & code repository for designing and coding at Mapbox. If you're new here, have a…www.mapbox.com MailChimp UXOur grid system is composed of 8 flexible columns with a gutter between columns of 30px. We apply border-box so that…ux.mailchimp.com Mozilla Style GuideOur mission - to promote openness, innovation and opportunity on the Internet - extends through everything we do. This…www.mozilla.org Homify Living Style GuideAvoid cascading where possible Only use classes, no IDs or tag names For each module/component in app/assets…www.homify.de FontShop StyleguideFontShop.com - Discover the world's best fontswww.fontshop.com Github StyleguideGitHub is where people build software. More than 11 million people use GitHub to discover, fork, and contribute to over…github.com BBC - GEL (Global Experience Language)BBC GEL BBC (Global Experience Language) guidelineswww.bbc.co.uk Designing Hack@BrownI wanted to touch on a few of our design decisions, and the role the design team played in organizing the hackathon.medium.com Semantic UISemantic empowers designers and developers by creating a shared vocabulary for UI.semantic-ui.com HH Design is a community around design in the context of technology. contribute ", "child": "1247_1\t1247_21247_1\t1247_2"}