{"name": "1248", "parent": "", "title": "Human", "sentences": [{"3492": "Human"}, {"9773": "Flaws--Too many to countToo difficult to name."}, {"61df": "They greet me in the morning;Say, \"Hi. How are you today?How can we become Them?\"Them always have it together. They're related to They.They know everythingAnd if you're not withThey, you're against Them."}, {"2bea": "Human is the creatureWho does not rememberThere was a time when\"Outside\" was \"Outside\"And not some digital imageConcocted on a canvas madeOf lies."}, {"452f": "It yearns for sustenanceBuried deep inSoiled forests butWill not take the timeTo harvest. Woe to theCreature who is lookingFor approval inSweaty bed linenAnd overpriced vehicles,She will become her shadow."}, {"25bf": "Gifted tongues ululateAt crescent moons, surelyTheir voices will be heard."}, {"5a59": "Human is the creatureWho smiles in your faceAnd sharpens a knifeBehind your back.It is unprepared forDanger and never has a plan. I bow, this species so thickOn my skin, Washing it off wouldBe suicide."}, {"b319": "Photo Credit: Art Wolfe, The Human Canvas"}], "content": "Human Flaws--Too many to countToo difficult to name. They greet me in the morning;Say, \"Hi. How are you today?How can we become Them?\"Them always have it together. They're related to They.They know everythingAnd if you're not withThey, you're against Them. Human is the creatureWho does not rememberThere was a time when\"Outside\" was \"Outside\"And not some digital imageConcocted on a canvas madeOf lies. It yearns for sustenanceBuried deep inSoiled forests butWill not take the timeTo harvest. Woe to theCreature who is lookingFor approval inSweaty bed linenAnd overpriced vehicles,She will become her shadow. Gifted tongues ululateAt crescent moons, surelyTheir voices will be heard. Human is the creatureWho smiles in your faceAnd sharpens a knifeBehind your back.It is unprepared forDanger and never has a plan. I bow, this species so thickOn my skin, Washing it off wouldBe suicide. Photo Credit: Art Wolfe, The Human Canvas ", "child": "1248_1\t1248_2\t1248_3\t1248_4\t1248_5\t1248_6\t1248_7\t1248_8\t1248_9\t1248_10\t1248_11\t1248_12\t1248_13\t1248_14\t1248_15\t1248_16\t1248_17\t1248_18\t1248_19\t1248_20\t1248_21\t1248_22\t1248_23\t1248_24\t1248_251248_1\t1248_2\t1248_3\t1248_4\t1248_5\t1248_6\t1248_7\t1248_8\t1248_9\t1248_10\t1248_11\t1248_12\t1248_13\t1248_14\t1248_15\t1248_16\t1248_17\t1248_18\t1248_19\t1248_20\t1248_21\t1248_22\t1248_23\t1248_24\t1248_25"}