{"name": "1253", "parent": "", "title": "Art, Science, and the Media Lab", "sentences": [{"b8a5": "Art, Science, and the Media Lab"}, {"a076": "By Andy Lippman"}, {"8cbd": "The following are Andy Lippman’s opening remarks from the recent Media Lab spring member event."}, {"1a2b": "I never thought I would give an MIT talk that addressed politics, but the events of the last seven months have forced the issue. This is not a partisan statement: I don’t much care where you are on the political spectrum, but as you know as well as I, recent events have taken a very disturbing turn for those of us who value knowledge and open thought. Without even touching on economics and society in all of its dimensions, what scares me now is that we are facing a reversal of public thought about what the Media Lab has stood for throughout its existence: the primacy of science and art in our lives. This is a political statement because public politics is driving this change. But science and art are not just options or political choices, they are the warp and weft of society, the difference between us and mice."}, {"ea01": "“The Media Lab has stood throughout its existence for the primacy of science and art in our lives.”"}, {"be36": "We at MIT have always believed that the ideas from science and the arts made for a better world. That’s why many of us spent our lives building ways to engage everyone in those fields. Starting in the 1970s we built personal computers that could work with sound and image and text to help people learn, express themselves, and be artful if not artists. Nicholas Negroponte called the early Architecture Machine a “salon de refusé” for electrical engineers who could not reconcile their love of the arts with a traditional engineering career. By the time I directed that group in 1982, we were an eclectic crowd: We liked pictures and pixels, sounds and signals, music and metadata. Our work democratized access to media of all sorts: If the press was too expensive, we built it into a machine you could afford; if editorial vision was narrow, we let you become the editor. Don’t read it, write it; don’t follow the press, be the press."}, {"0e1c": "Our work always connected expression with technology. It was never about the bits; it was always about the people. In 1986, during the first iteration of what we did to invent electronic news, well before the Internet or the PC were the human right they are today, Judith Donath wrote a thesis on the subcarriers of information associated with printed newspapers such as the type size, the page position, the masthead — all the things that conveyed data about the data and allowed a reader to place it in context. Later, when the web came along, Hakon Lie responded to the fact that the early browsers were literally anti-design — little control over typeface, a layout determined as much by the browser as the content. He built CSS, cascading style sheets that make the web look like what it is today."}, {"9eae": "“Science and art are not just options or political choices, they are the warp and weft of society, the difference between us and mice.”"}, {"9d98": "We were optimistic, perhaps naive. Our remedy for bad speech was more speech, to paraphrase Brandeis. Some people now back off from that. They worry about the dangers of the Internet. I worry too, no friction applies as much to the information terrorists and propagandists as to the disenfranchised. But going backwards is neither laudable nor possible nor new; Brandeis understood this one hundred years ago. Pandora’s box will not be shut. We built this world, and we will continue to thrive in it."}, {"6131": "But this is the Media Lab. We don’t get mad, we get even. Look at how the Lab has evolved. You will see an expansion of Brandeis’ vision beyond the literal. And an expansion of our work beyond the formative tripod of learning, expression, and art. To these we now add a fourth leg, society. From Kevin Esvelt’s work on engaging the public in science and research, to Iyad Rahwan’s four million people who test drive an autonomous vehicle to see whether it would do what they would do in a morally conflicted situation, to Cesar Hidalgo’s analytical fluency, to Civic Media’s public engagement, to Sandy Pentland’s and Deb Roy’s social analytics, to Viral Communications’ activist fiftynifty.org networking, to the emerging AI and ethics work. This is research imbued with responsibility. We take the needs of society as seriously today as we have always taken our mission. But now we do more than shine a light down the road, now we lead the way there. And as we progress, we will take back science and art from the political sphere and re-place it where it belongs: In the hearts and minds of all."}, {"cdb6": "Andy Lippman is associate director of the Media Lab and head of the Viral Communications research group. This post was published originally on the Media Lab website."}, {"29df": "Related: The FiftyNifty ChallengeSociety-in-the-Loop‘Daisy drives’ will let communities alter wild organisms in local ecosystems"}], "content": "Art, Science, and the Media Lab By Andy Lippman The following are Andy Lippman’s opening remarks from the recent Media Lab spring member event. I never thought I would give an MIT talk that addressed politics, but the events of the last seven months have forced the issue. This is not a partisan statement: I don’t much care where you are on the political spectrum, but as you know as well as I, recent events have taken a very disturbing turn for those of us who value knowledge and open thought. Without even touching on economics and society in all of its dimensions, what scares me now is that we are facing a reversal of public thought about what the Media Lab has stood for throughout its existence: the primacy of science and art in our lives. This is a political statement because public politics is driving this change. But science and art are not just options or political choices, they are the warp and weft of society, the difference between us and mice. “The Media Lab has stood throughout its existence for the primacy of science and art in our lives.” We at MIT have always believed that the ideas from science and the arts made for a better world. That’s why many of us spent our lives building ways to engage everyone in those fields. Starting in the 1970s we built personal computers that could work with sound and image and text to help people learn, express themselves, and be artful if not artists. Nicholas Negroponte called the early Architecture Machine a “salon de refusé” for electrical engineers who could not reconcile their love of the arts with a traditional engineering career. By the time I directed that group in 1982, we were an eclectic crowd: We liked pictures and pixels, sounds and signals, music and metadata. Our work democratized access to media of all sorts: If the press was too expensive, we built it into a machine you could afford; if editorial vision was narrow, we let you become the editor. Don’t read it, write it; don’t follow the press, be the press. Our work always connected expression with technology. It was never about the bits; it was always about the people. In 1986, during the first iteration of what we did to invent electronic news, well before the Internet or the PC were the human right they are today, Judith Donath wrote a thesis on the subcarriers of information associated with printed newspapers such as the type size, the page position, the masthead — all the things that conveyed data about the data and allowed a reader to place it in context. Later, when the web came along, Hakon Lie responded to the fact that the early browsers were literally anti-design — little control over typeface, a layout determined as much by the browser as the content. He built CSS, cascading style sheets that make the web look like what it is today. “Science and art are not just options or political choices, they are the warp and weft of society, the difference between us and mice.” We were optimistic, perhaps naive. Our remedy for bad speech was more speech, to paraphrase Brandeis. Some people now back off from that. They worry about the dangers of the Internet. I worry too, no friction applies as much to the information terrorists and propagandists as to the disenfranchised. But going backwards is neither laudable nor possible nor new; Brandeis understood this one hundred years ago. Pandora’s box will not be shut. We built this world, and we will continue to thrive in it. But this is the Media Lab. We don’t get mad, we get even. Look at how the Lab has evolved. You will see an expansion of Brandeis’ vision beyond the literal. And an expansion of our work beyond the formative tripod of learning, expression, and art. To these we now add a fourth leg, society. From Kevin Esvelt’s work on engaging the public in science and research, to Iyad Rahwan’s four million people who test drive an autonomous vehicle to see whether it would do what they would do in a morally conflicted situation, to Cesar Hidalgo’s analytical fluency, to Civic Media’s public engagement, to Sandy Pentland’s and Deb Roy’s social analytics, to Viral Communications’ activist fiftynifty.org networking, to the emerging AI and ethics work. This is research imbued with responsibility. We take the needs of society as seriously today as we have always taken our mission. But now we do more than shine a light down the road, now we lead the way there. And as we progress, we will take back science and art from the political sphere and re-place it where it belongs: In the hearts and minds of all. Andy Lippman is associate director of the Media Lab and head of the Viral Communications research group. This post was published originally on the Media Lab website. Related: The FiftyNifty ChallengeSociety-in-the-Loop‘Daisy drives’ will let communities alter wild organisms in local ecosystems ", "child": "1253_11253_1"}