{"name": "126", "parent": "", "title": "Masai Ujiri should be Executive of the Year", "sentences": [{"73ec": "Masai Ujiri should be Executive of the Year"}, {"a0ba": "Masai Ujiri is widely accepted as one of the best Executives of his generation, but he isn’t getting enough attention in the Executive of the Year race. He has worked under tough constraints, and should be recognized for it."}, {"3942": "(Wikipedia Commons)"}, {"7bac": "Since 2012, the Toronto Raptors have gradually improved on a yearly basis and they now find themselves as serious contenders in the Eastern Conference. Whilst men such as Dwane Casey and Kyle Lowry are quite obviously pivotal in the Raptors resurgence in the last couple of years, the man who deserves the most credit is Masai Ujiri."}, {"8a5d": "Ujiri isn’t a man who ever finds himself in the headlines, and he is in some sense a man of mystery. No one knows an awful lot about his personal life, and he isn’t a GM who is ever in the public eye talking about his players, or potential future strategy. He quietly goes about his business, and the Raptors have been long-term beneficiaries of his genius."}, {"35c0": "At this point in the NBA Season- there is a lot of debate surrounding the end of season awards, as articles making a case for certain people generate clicks, and discussion on social media. Executive of the Year is an award that doesn’t always garner enough attention, but it probably should, as the League is currently in a golden-age of talented executives. When you consider just eight years ago, the likes of James Dolan and David Kahn were executives, it puts into perspective just how incredible the majority of the current General Managers are."}, {"9c87": "As of now, Masai Ujiri isn’t someone who is garnering a lot of attention in the Executive of the Year race, and this seems baffling. Ujiri has re-tooled the Raptors roster, and he has signed players that essentially counteract the good teams in the Eastern Conference. Ujiri is currently victim of what many writers have coined ‘The Gregg Popovich Curse’, he has been consistently excellent for such a long time, that people disregard his work in the present tense."}, {"9188": "16 Wins A Ring All-Star: Kyle LowryUnlike the fans, the people here at 16 Wins A Ring got this one right and voted my man Kyle “Bubble Butt” Lowry into…16winsaring.com"}, {"1991": "Generally speaking, the Executive of the Year award always goes to a General Manager who is in charge of a contending team. This makes sense on paper, but it can cause Executives who do good jobs on middling teams to be overlooked, and that is what is happening this year. Ujiri absolutely deserves to be in the conversation, as he has managed to turn water into wine in terms of acquiring certain assets."}, {"0d69": "Ujiri’s executive of the year case began with his draft picks and with his roster re-tooling, as he has brought in players who can counter act the rest of the East. The Cavaliers, the Wizards and the Celtics are the other serious contenders in the Eastern Conference, and they all have high powered back courts. Ujiri’s response to this was to provide Dwane Casey with excellent perimeter defending point guards. Fred VanVleet joined the team after a successful spell with the Wichita State Shockers. VanVleet has proved to be an excellent defender, ranking fourth in defensive real-plus minus amongst point guards. The player above him is last years first round pick Delon Wright, so the direction that Ujiri is trying to take Toronto in is quite clear."}, {"1b96": "VanVleet is a player that went undrafted, but Ujiri wasn’t afraid to take a chance on him, and he could be a vital role player in the playoffs as he is someone who would be able to cope defensively against the likes of Isaiah Thomas and Kyrie Irving. The former Wichita State star also shoots 39% from three and 85% from the line, so he is someone who can contribute on both ends of the floor. Teams are always looking for ‘Three-and-D’ type players, and Ujiri managed to acquire one for nothing on a measly contract."}, {"68f8": "Toronto are in win-now mode, so acquiring role players was their main priority, and Ujiri did an impressive job finding a player somewhere where other teams did not look."}, {"7991": "When Bismack Biyombo left the team this summer, many people thought this was the end of Toronto’s impressive bench unit. But, Ujiri once again managed to re-tool the roster without having to pay Biyombo the extortionate $72 million over four years that the Orlando Magic gave him. Jakob Poeltl has been frustrating at times, but he looks like another solid draft due to his defensive ability. The Raptors are three points better off, per 100 possessions when he is in, which shows Ujiri values a rim protector."}, {"609c": "Ujiri also deserves credit for keeping Brazilian Lucas ‘Bebe’ Nogueira on the roster, as he gave the Raptors reliable minutes earlier in the year. Whilst he was eventually re-assigned to the D-League, the Brazilian managed to somewhat shake off his draft-bust reputation, as he ranks 7th in defensive real-plus minus amongst centers which is above the likes of Hassan Whiteside and Dwight Howard. Ujiri kept faith with his guy, and this meant that the Raptors didn’t suffer a post-Bismack Biyombo era hangover."}, {"f210": "The Raptors bench unit on the whole has been excellent despite the loss of Biyombo as they are third in overall net rating and seventh in defensive rating. Ujiri has simply worked wonders to rebuild a unit that lost key performers in the summer, and this is one of a couple of reasons that he belongs in the executive of the year talk."}, {"590e": "Not only did Ujiri build a bench unit out of very little, but he strengthened his case with his trade deadline performance. The Raptors were desperate for two multi-positional defensive presences, and Ujiri delivered these pieces without having to mortgage the Raptors future."}, {"5ac8": "Ujiri has reportedly targeted Serge Ibaka since his time at the Denver Nuggets, and he managed to get him for a pretty small price. The Magic gave up a kings ransom that included Victor Oladipo, Domantas Sabonis and Ersan Ilyasova to acquire Serge Ibaka in the summer, but all they got in return for him was Terrence Ross. The Magic were desperate for three point shooting, but there is no way that Ross is anywhere near as effective on a basketball court as Serge Ibaka. This is testament to the absolute genius of Masai Ujiri."}, {"995a": "The Ibaka trade isn’t necessarily a win-now type trade either, as the Raptors inherited his bird rights, which could be pivotal in contract negotiations this summer. When you consider that the Raptors will have to also look at Kyle Lowry and Patrick Patterson’s contracts too, then it makes the move for Ibaka seem even more genius, as it will be slightly easier to keep him in town."}, {"382e": "It must also be noted, that the pick that was sent to the Magic, came from the trade with the Bucks for Greivis Vasquez back in 2015. Vasquez isn’t even in the NBA anymore, and the Raptors also received Norman Powell in that trade, who could become an outstanding player. This further shows that Ujiri seems to be getting everything right at the moment. Essentially, he turned Greivis Vasquez into Norman Powell and Serge Ibaka, which is quite incredible."}, {"367c": "Serge Ibaka, The Next Great Toronto Raptors Power Forward Is HereAnother set of Trade Grades are here, as Serge Ibaka is on the move across the border and Terrence Ross heads for…16winsaring.com"}, {"b0fb": "PJ Tucker also arrived in Toronto, for a price that was essentially just two second round picks as Jared Sullinger was only thrown in for salary cap considerations. Tucker is one of a select group of defenders that is capable of matching up against the best wings in the League, and actually doing a good job on them. To acquire a perimeter defender for such a small price, might be the achievement of the year from any NBA Executive."}, {"1b77": "In essence- the Raptors got an all-star level power forward and a lockdown three and D player for two second round picks, and one rotational guy in Terrence Ross. When you compare that to how much the Magic gave up to get Ibaka in the first place, it shows that Ujiri is amongst the very best executives, and deserves an award for what he has done this year."}, {"5890": "Tucker was needed because he can defend multiple positions, and this means that the Raptors can play DeMarre Carroll at the four position without sacrificing a lot of defensive solidity. Having a hybrid type forward who can switch onto bigs will be very important against the Cleveland Cavaliers if the teams meet in the playoffs, as Kevin Love and LeBron James obviously require a lot of defensive attention."}, {"37c1": "Clearing out Terrence Ross was also a good thing, because whilst he provided a spark at times, Norman Powell needed more minutes. Ujiri essentially manoeuvred his roster in such a way that a young player could get more minutes, and therefore develop into a better player."}, {"2d17": "The Trade so far has paid off, as the Raptors are fourth in defensive rating since they acquired Tucker and Ibaka. They are also second in defensive field goal percentage, 11th in defensive three-point percentage, and third in points per game allowed, which is a great improvement on previous numbers."}, {"e778": "P.J. Tucker Deal Caps Off A Brilliant Trade Deadline For RaptorsTo follow up on landing Serge Ibaka, the Raptors have bolstered their wing play and defense even more with a trade for…16winsaring.com"}, {"9653": "While Dwane Casey obviously deserves some credit, the real genius at work here is Masai Ujiri. Executives such as David Griffin get a lot of love, but he has a much easier job than someone like Masai Ujiri does, for a couple of reasons. The first is that he has the attraction of LeBron James, but the second is that he has an owner who is willing to go deep into the luxury tax threshold. To put this difference into perspective- the Raptors payroll last year totalled $71 million, the Cleveland Cavaliers paid $54 million in luxury tax alone which was 76% of the Raptors 2015–16 total salary."}, {"0f38": "Ujiri isn’t working for a stingy owner, but he isn’t given an open cheque book to go and win a championship. Instead, he has to work within his constraints, but he still delivers every single year. Ujiri won the award in 12–13 for his work building a great Nuggets roster, but this year is arguably his best job."}, {"b916": "No move Ujiri makes is random, he has stocked the roster with defensive point guards to counteract the nature of the Modern NBA offense, and he has added players who can defend multiple positions so the Raptors can play small without getting torn apart."}, {"64e6": "Because of his excellent work, the Raptors are in prime position to finally make the NBA finals this year. The Cavaliers are there for the taking, and the Raptors will like their chances going up against LeBron James."}, {"fc94": "If I had an Executive of the Year vote- It would go to Masai Ujiri."}], "content": "Masai Ujiri should be Executive of the Year Masai Ujiri is widely accepted as one of the best Executives of his generation, but he isn’t getting enough attention in the Executive of the Year race. He has worked under tough constraints, and should be recognized for it. (Wikipedia Commons) Since 2012, the Toronto Raptors have gradually improved on a yearly basis and they now find themselves as serious contenders in the Eastern Conference. Whilst men such as Dwane Casey and Kyle Lowry are quite obviously pivotal in the Raptors resurgence in the last couple of years, the man who deserves the most credit is Masai Ujiri. Ujiri isn’t a man who ever finds himself in the headlines, and he is in some sense a man of mystery. No one knows an awful lot about his personal life, and he isn’t a GM who is ever in the public eye talking about his players, or potential future strategy. He quietly goes about his business, and the Raptors have been long-term beneficiaries of his genius. At this point in the NBA Season- there is a lot of debate surrounding the end of season awards, as articles making a case for certain people generate clicks, and discussion on social media. Executive of the Year is an award that doesn’t always garner enough attention, but it probably should, as the League is currently in a golden-age of talented executives. When you consider just eight years ago, the likes of James Dolan and David Kahn were executives, it puts into perspective just how incredible the majority of the current General Managers are. As of now, Masai Ujiri isn’t someone who is garnering a lot of attention in the Executive of the Year race, and this seems baffling. Ujiri has re-tooled the Raptors roster, and he has signed players that essentially counteract the good teams in the Eastern Conference. Ujiri is currently victim of what many writers have coined ‘The Gregg Popovich Curse’, he has been consistently excellent for such a long time, that people disregard his work in the present tense. 16 Wins A Ring All-Star: Kyle LowryUnlike the fans, the people here at 16 Wins A Ring got this one right and voted my man Kyle “Bubble Butt” Lowry into…16winsaring.com Generally speaking, the Executive of the Year award always goes to a General Manager who is in charge of a contending team. This makes sense on paper, but it can cause Executives who do good jobs on middling teams to be overlooked, and that is what is happening this year. Ujiri absolutely deserves to be in the conversation, as he has managed to turn water into wine in terms of acquiring certain assets. Ujiri’s executive of the year case began with his draft picks and with his roster re-tooling, as he has brought in players who can counter act the rest of the East. The Cavaliers, the Wizards and the Celtics are the other serious contenders in the Eastern Conference, and they all have high powered back courts. Ujiri’s response to this was to provide Dwane Casey with excellent perimeter defending point guards. Fred VanVleet joined the team after a successful spell with the Wichita State Shockers. VanVleet has proved to be an excellent defender, ranking fourth in defensive real-plus minus amongst point guards. The player above him is last years first round pick Delon Wright, so the direction that Ujiri is trying to take Toronto in is quite clear. VanVleet is a player that went undrafted, but Ujiri wasn’t afraid to take a chance on him, and he could be a vital role player in the playoffs as he is someone who would be able to cope defensively against the likes of Isaiah Thomas and Kyrie Irving. The former Wichita State star also shoots 39% from three and 85% from the line, so he is someone who can contribute on both ends of the floor. Teams are always looking for ‘Three-and-D’ type players, and Ujiri managed to acquire one for nothing on a measly contract. Toronto are in win-now mode, so acquiring role players was their main priority, and Ujiri did an impressive job finding a player somewhere where other teams did not look. When Bismack Biyombo left the team this summer, many people thought this was the end of Toronto’s impressive bench unit. But, Ujiri once again managed to re-tool the roster without having to pay Biyombo the extortionate $72 million over four years that the Orlando Magic gave him. Jakob Poeltl has been frustrating at times, but he looks like another solid draft due to his defensive ability. The Raptors are three points better off, per 100 possessions when he is in, which shows Ujiri values a rim protector. Ujiri also deserves credit for keeping Brazilian Lucas ‘Bebe’ Nogueira on the roster, as he gave the Raptors reliable minutes earlier in the year. Whilst he was eventually re-assigned to the D-League, the Brazilian managed to somewhat shake off his draft-bust reputation, as he ranks 7th in defensive real-plus minus amongst centers which is above the likes of Hassan Whiteside and Dwight Howard. Ujiri kept faith with his guy, and this meant that the Raptors didn’t suffer a post-Bismack Biyombo era hangover. The Raptors bench unit on the whole has been excellent despite the loss of Biyombo as they are third in overall net rating and seventh in defensive rating. Ujiri has simply worked wonders to rebuild a unit that lost key performers in the summer, and this is one of a couple of reasons that he belongs in the executive of the year talk. Not only did Ujiri build a bench unit out of very little, but he strengthened his case with his trade deadline performance. The Raptors were desperate for two multi-positional defensive presences, and Ujiri delivered these pieces without having to mortgage the Raptors future. Ujiri has reportedly targeted Serge Ibaka since his time at the Denver Nuggets, and he managed to get him for a pretty small price. The Magic gave up a kings ransom that included Victor Oladipo, Domantas Sabonis and Ersan Ilyasova to acquire Serge Ibaka in the summer, but all they got in return for him was Terrence Ross. The Magic were desperate for three point shooting, but there is no way that Ross is anywhere near as effective on a basketball court as Serge Ibaka. This is testament to the absolute genius of Masai Ujiri. The Ibaka trade isn’t necessarily a win-now type trade either, as the Raptors inherited his bird rights, which could be pivotal in contract negotiations this summer. When you consider that the Raptors will have to also look at Kyle Lowry and Patrick Patterson’s contracts too, then it makes the move for Ibaka seem even more genius, as it will be slightly easier to keep him in town. It must also be noted, that the pick that was sent to the Magic, came from the trade with the Bucks for Greivis Vasquez back in 2015. Vasquez isn’t even in the NBA anymore, and the Raptors also received Norman Powell in that trade, who could become an outstanding player. This further shows that Ujiri seems to be getting everything right at the moment. Essentially, he turned Greivis Vasquez into Norman Powell and Serge Ibaka, which is quite incredible. Serge Ibaka, The Next Great Toronto Raptors Power Forward Is HereAnother set of Trade Grades are here, as Serge Ibaka is on the move across the border and Terrence Ross heads for…16winsaring.com PJ Tucker also arrived in Toronto, for a price that was essentially just two second round picks as Jared Sullinger was only thrown in for salary cap considerations. Tucker is one of a select group of defenders that is capable of matching up against the best wings in the League, and actually doing a good job on them. To acquire a perimeter defender for such a small price, might be the achievement of the year from any NBA Executive. In essence- the Raptors got an all-star level power forward and a lockdown three and D player for two second round picks, and one rotational guy in Terrence Ross. When you compare that to how much the Magic gave up to get Ibaka in the first place, it shows that Ujiri is amongst the very best executives, and deserves an award for what he has done this year. Tucker was needed because he can defend multiple positions, and this means that the Raptors can play DeMarre Carroll at the four position without sacrificing a lot of defensive solidity. Having a hybrid type forward who can switch onto bigs will be very important against the Cleveland Cavaliers if the teams meet in the playoffs, as Kevin Love and LeBron James obviously require a lot of defensive attention. Clearing out Terrence Ross was also a good thing, because whilst he provided a spark at times, Norman Powell needed more minutes. Ujiri essentially manoeuvred his roster in such a way that a young player could get more minutes, and therefore develop into a better player. The Trade so far has paid off, as the Raptors are fourth in defensive rating since they acquired Tucker and Ibaka. They are also second in defensive field goal percentage, 11th in defensive three-point percentage, and third in points per game allowed, which is a great improvement on previous numbers. P.J. Tucker Deal Caps Off A Brilliant Trade Deadline For RaptorsTo follow up on landing Serge Ibaka, the Raptors have bolstered their wing play and defense even more with a trade for…16winsaring.com While Dwane Casey obviously deserves some credit, the real genius at work here is Masai Ujiri. Executives such as David Griffin get a lot of love, but he has a much easier job than someone like Masai Ujiri does, for a couple of reasons. The first is that he has the attraction of LeBron James, but the second is that he has an owner who is willing to go deep into the luxury tax threshold. To put this difference into perspective- the Raptors payroll last year totalled $71 million, the Cleveland Cavaliers paid $54 million in luxury tax alone which was 76% of the Raptors 2015–16 total salary. Ujiri isn’t working for a stingy owner, but he isn’t given an open cheque book to go and win a championship. Instead, he has to work within his constraints, but he still delivers every single year. Ujiri won the award in 12–13 for his work building a great Nuggets roster, but this year is arguably his best job. No move Ujiri makes is random, he has stocked the roster with defensive point guards to counteract the nature of the Modern NBA offense, and he has added players who can defend multiple positions so the Raptors can play small without getting torn apart. Because of his excellent work, the Raptors are in prime position to finally make the NBA finals this year. The Cavaliers are there for the taking, and the Raptors will like their chances going up against LeBron James. If I had an Executive of the Year vote- It would go to Masai Ujiri. ", "child": "126_1"}