{"name": "1260", "parent": "", "title": "Have citizen scientists discovered advanced alien civilizations?", "sentences": [{"e03d": "Have citizen scientists discovered advanced alien civilizations?"}, {"d931": "A Dyson sphere is a hypothetical megastructure theorized to completely encompass a star and capture its power output."}, {"8003": "Not that long ago, NASA developed very sophisticated computers to search for transits in all the Kepler data, to search for planets beyond our solar system. In an effort to be as thorough as possible, scientists at Yale then wondered if the computers might have missed something in the process. This brought about a citizen science project known as Planet Hunters, allowing people to scan through the data along with the machines."}, {"1977": "This has led to the discovery of very strange objects in our galaxy. The first anomaly was discovered in an inexplicable signal coming from the star KIC 8462852. The preliminary observations occurred in May of 2009. The strange thing is that, dips in the data normally only last for a few hours, but they found one that lasted for almost a week. There was also an asymmetry, indicating that the object was not spherical like a planet. That’s really weird!"}, {"e3ae": "The next incident wasn’t observed until March of 2011, when the star’s light dropped by 15 percent — compared to the 1% decrease caused by a planet-sized object. Then, another in February of 2013, with a drop of 20 percent. The thing to consider is that whatever is blocking the light of KIC 8462852 has an area of over 1,000 times that of our home-world. That’s ridiculously ginormous!!!"}, {"ad33": "The problem is that enormous solar panels around a star would generate lots of thermal radiation, which is not evident in the observations that have been made. So, unless the extraterrestrials are also redirecting that energy as well, then it is unlikely that aliens are harvesting sunlight with advanced megastructure technology. Although, if a society were hundreds or even thousands of years ahead of us then it is highly conceivable that they would have the kinds of resource problems that scientists predict, leading them to invent new more powerful ways of doing things."}, {"b997": "Plus, it does seem likely that not all anthropic civilizations would evolve at exactly the same rate. After all, couldn’t there be life on other worlds that are slightly more advanced than ours? Either way, stars like KIC 8462852 and EPIC 204278916 definitely hold the key to something mysterious. I for one hope that there are advanced beings in the universe. It gives me hope for us."}, {"d225": "Do you appreciate my writing? Would you like to support my work? You can make a contribution here. No donation is too big or too small. Thank you!!!"}], "content": "Have citizen scientists discovered advanced alien civilizations? A Dyson sphere is a hypothetical megastructure theorized to completely encompass a star and capture its power output. Not that long ago, NASA developed very sophisticated computers to search for transits in all the Kepler data, to search for planets beyond our solar system. In an effort to be as thorough as possible, scientists at Yale then wondered if the computers might have missed something in the process. This brought about a citizen science project known as Planet Hunters, allowing people to scan through the data along with the machines. This has led to the discovery of very strange objects in our galaxy. The first anomaly was discovered in an inexplicable signal coming from the star KIC 8462852. The preliminary observations occurred in May of 2009. The strange thing is that, dips in the data normally only last for a few hours, but they found one that lasted for almost a week. There was also an asymmetry, indicating that the object was not spherical like a planet. That’s really weird! The next incident wasn’t observed until March of 2011, when the star’s light dropped by 15 percent — compared to the 1% decrease caused by a planet-sized object. Then, another in February of 2013, with a drop of 20 percent. The thing to consider is that whatever is blocking the light of KIC 8462852 has an area of over 1,000 times that of our home-world. That’s ridiculously ginormous!!! The problem is that enormous solar panels around a star would generate lots of thermal radiation, which is not evident in the observations that have been made. So, unless the extraterrestrials are also redirecting that energy as well, then it is unlikely that aliens are harvesting sunlight with advanced megastructure technology. Although, if a society were hundreds or even thousands of years ahead of us then it is highly conceivable that they would have the kinds of resource problems that scientists predict, leading them to invent new more powerful ways of doing things. Plus, it does seem likely that not all anthropic civilizations would evolve at exactly the same rate. After all, couldn’t there be life on other worlds that are slightly more advanced than ours? Either way, stars like KIC 8462852 and EPIC 204278916 definitely hold the key to something mysterious. I for one hope that there are advanced beings in the universe. It gives me hope for us. Do you appreciate my writing? Would you like to support my work? You can make a contribution here. No donation is too big or too small. Thank you!!! ", "child": "1260_1\t1260_2\t1260_3\t1260_4\t1260_5\t1260_6\t1260_7\t1260_81260_1\t1260_2\t1260_3\t1260_4\t1260_5\t1260_6\t1260_7\t1260_8"}