{"name": "1271", "parent": "", "title": "What is a design concept? How to master it?", "sentences": [{"486f": "What is a design concept? How to master it?"}, {"2cde": "Most of the famous designs globally are famous because of their ‘outstanding concepts’. Many have failed just because of the opposite. Many professionals, students and designers across the world fail to understand the very concept of ‘concept.’ Graphic designers, product designers, architects, planners and artists, the success of their design is mostly governed by their respective concepts."}, {"3791": "But why? Is it really that much difficult to derive a concept for a new design? Or we are just out of ideas?"}, {"aba1": "To begin with one has to understand. What is a ‘design concept’?"}, {"2b5c": "Literally, it means ‘an abstract idea’. But for a designer, it is a broad umbrella of steps of how to ‘ideate a design’. It involves research, analysis and thorough understanding of end user."}, {"ffcc": "So how should one start with it?"}, {"32c4": "The start"}, {"9f3e": "There is no definite way to start or think of a design concept. But one can look in a particular direction to search for it. Some of those being : defining the problem, research on user and product, study the existing branding, requirements and responses, design brief. You can develop a questionnaire for yourself to get the direction to proceed."}, {"0b15": "Eg, What is the company’s goal?"}, {"8e23": "What kind of users it is serving?"}, {"9d90": "What is the product about?"}, {"1ce7": "Answer to each of the above question will get you in direction of ‘thinking process’. After which you can develop what we call a ‘moodboard.’"}, {"25ee": "Moodboard for branding project (Source : pinterest.com)"}, {"d722": "Moodboard"}, {"e4b7": "It is a collection of thoughts that point to the designs which are liked either by users, client or industry. It allows you rule out the possibilities of coming up with designs which are not consistent with what is expected. You will be able to develop a visual vocabulary or a sense of approach with a successful moodboard."}, {"d7ee": "Conceptual Sketch for a building (Source : designingbuildings.co.uk)"}, {"6257": "MagicBox"}, {"eb51": "I have seen, large chunk of designers are stuck after the moodboard step. I was myself a victim of it for a long time."}, {"c567": "Following, a nicely done moodboard,the next step is what I call a ‘MagicBox.’ It is when I pick up keywords or key visuals from moodboard, and start doodling on it. It can be the tagline of company, process, USP or function to start with. As a result, you can have several options to choose from."}, {"3027": "I am quoting few examples for you, result of great thinking process :"}, {"2364": "Source : images.google.com"}, {"b96d": "The concept of Amazon logo is amazing as it depicts Amazon as a place to get A to Z products. Also, the shape of arrow signifies a smile ensuring the motto of keeping customers happy."}, {"c285": "Source : images.google.com"}, {"a471": "The Beijing National Stadium is famous for its abstract concept. As visible, Bird’s Nest allows you to witness the intricacies of a nest, on a larger scale. Similarly structural designers had derived the concept of skyscrapers from a grass leaf, this is termed as Biomimicry."}, {"51fe": "Source : images.google.com"}, {"ffdf": "Most product designers’ concept are born out of functionality. But Coca-Cola got it much appreciated glass bottle from the design contest. Winner of the contest, Glass Root Company, had come with this design from a concept of ‘a cocoa bean that had an elongated shape and distinct ribs.’"}, {"7cb4": "There are numerous such examples of great design derived out of excellent concepts. A sure thing to note is, all good concepts are simple, unique and clear. Still what makes a concept successful design is the effective implementation of design principles."}, {"f18b": "Source : images.google.com"}, {"d9f2": "Review"}, {"cb92": "Now with the bunch of ideas in hand, you can always go to your client or seek a peer review,to know what they think is the best. It is the end user who will finally judge your design. Thus, his review at the very beginning can help you get a head start. Overlap it with your experience, and see the wonders."}, {"7806": "These are few tips for beginners and those who find it difficult to start the design process. ‘Design Concept’ holds the key to the response you get. Though one can go through bulk of literature, but it is the experience and practice which makes you the master. Nothing is impossible."}, {"5a4b": "There is a sea of knowledge yet to be sailed upon. Let’s sail together by clicking the little heart. :)"}], "content": "What is a design concept? How to master it? Most of the famous designs globally are famous because of their ‘outstanding concepts’. Many have failed just because of the opposite. Many professionals, students and designers across the world fail to understand the very concept of ‘concept.’ Graphic designers, product designers, architects, planners and artists, the success of their design is mostly governed by their respective concepts. But why? Is it really that much difficult to derive a concept for a new design? Or we are just out of ideas? To begin with one has to understand. What is a ‘design concept’? Literally, it means ‘an abstract idea’. But for a designer, it is a broad umbrella of steps of how to ‘ideate a design’. It involves research, analysis and thorough understanding of end user. So how should one start with it? The start There is no definite way to start or think of a design concept. But one can look in a particular direction to search for it. Some of those being : defining the problem, research on user and product, study the existing branding, requirements and responses, design brief. You can develop a questionnaire for yourself to get the direction to proceed. Eg, What is the company’s goal? What kind of users it is serving? What is the product about? Answer to each of the above question will get you in direction of ‘thinking process’. After which you can develop what we call a ‘moodboard.’ Moodboard for branding project (Source : pinterest.com) Moodboard It is a collection of thoughts that point to the designs which are liked either by users, client or industry. It allows you rule out the possibilities of coming up with designs which are not consistent with what is expected. You will be able to develop a visual vocabulary or a sense of approach with a successful moodboard. Conceptual Sketch for a building (Source : designingbuildings.co.uk) MagicBox I have seen, large chunk of designers are stuck after the moodboard step. I was myself a victim of it for a long time. Following, a nicely done moodboard,the next step is what I call a ‘MagicBox.’ It is when I pick up keywords or key visuals from moodboard, and start doodling on it. It can be the tagline of company, process, USP or function to start with. As a result, you can have several options to choose from. I am quoting few examples for you, result of great thinking process : Source : images.google.com The concept of Amazon logo is amazing as it depicts Amazon as a place to get A to Z products. Also, the shape of arrow signifies a smile ensuring the motto of keeping customers happy. Source : images.google.com The Beijing National Stadium is famous for its abstract concept. As visible, Bird’s Nest allows you to witness the intricacies of a nest, on a larger scale. Similarly structural designers had derived the concept of skyscrapers from a grass leaf, this is termed as Biomimicry. Source : images.google.com Most product designers’ concept are born out of functionality. But Coca-Cola got it much appreciated glass bottle from the design contest. Winner of the contest, Glass Root Company, had come with this design from a concept of ‘a cocoa bean that had an elongated shape and distinct ribs.’ There are numerous such examples of great design derived out of excellent concepts. A sure thing to note is, all good concepts are simple, unique and clear. Still what makes a concept successful design is the effective implementation of design principles. Source : images.google.com Review Now with the bunch of ideas in hand, you can always go to your client or seek a peer review,to know what they think is the best. It is the end user who will finally judge your design. Thus, his review at the very beginning can help you get a head start. Overlap it with your experience, and see the wonders. These are few tips for beginners and those who find it difficult to start the design process. ‘Design Concept’ holds the key to the response you get. Though one can go through bulk of literature, but it is the experience and practice which makes you the master. Nothing is impossible. There is a sea of knowledge yet to be sailed upon. Let’s sail together by clicking the little heart. :) ", "child": "1271_1\t1271_21271_1\t1271_21271_1\t1271_21271_1\t1271_2"}