{"name": "1272", "parent": "", "title": "Design thinking lessons from our cats", "sentences": [{"3a0c": "Design thinking lessons from our cats"}, {"82ad": "We can all agree that cats spend the vast majority of their time thinking through complex problems in innovative ways. We have so much to learn from them. After years of careful observation I’ve extracted and analyzed a few key methodologies they use so we can leverage them for our own problem solving."}, {"b9fb": "Think inside the box"}, {"0785": "If a cat fits, he sits. It’s as simple as that. Cats know how to scope problems appropriately. During four long years of art school I heard the same mantra over and over: “think outside the box.” It took me several years, many complex problems, and two cats, to realize what bad advice this is. You can’t solve a problem well by just thinking outside the box. You have to understand the box: How big is it? Is it made of cardboard? Fabric? Does it have packing peanuts in it or those plastic air pouches that aren’t fun to play with at all? Design thinking requires understanding constraints."}, {"0d92": "Push boundaries"}, {"5c83": "Thinking inside the box doesn’t mean you have to stay inside it. Cats don’t allow themselves to be limited by the laws of physics when it comes to fitting in boxes. They assume their liquid form and gracefully allow their pillowy sides spill out over the edges. The key to their success is flexibility and prioritization. When given an ambiguous or complex problem such as a seemingly too-small box, a cat will prioritize which parts should go inside the box so that the cat and box can reach a steady state of equilibrium. Cat and box become one. The obvious lesson here is that once you understand the constraints of a problem, you know which ones to push on to achieve your goals."}, {"c4cb": "I’ve never known a cat that didn’t demonstrate a deep understanding of market economics."}, {"6661": "Linus and Cupcake Schoolbus engage in the laziest cat fight I’ve ever seen."}, {"9b9e": "Be lazy"}, {"e45b": "Have you ever tried to get a cat to pull a tiny garden plow? Or harnessed nine cats together and attached them to a sled, and then sat on the sled and then given your cat sled team a command to ‘MUSH’? Well I have*. They did not mush. They sat there and looked at me like I was an idiot. A few of them lay down in the snow. Two or three ignored me while they groomed each other, and the back team started scuffling. Cats don’t like to work hard. They don’t toil for the sake of toil. They evaluate cost, benefits, and impact and make appropriate trade-offs. I’ve never known a cat that didn’t demonstrate a deep understanding of market economics. It goes back to their ancestral roots, where evidence suggests that early cats domesticated themselves when they saw the value in offering fuzzy snuggles in exchange for a steady source of food. When you’re driven by laziness, you’re forced to take a hard look at your resources and make trade offs."}, {"16f0": "Cats aren’t discouraged by the risk of looking dumb and being laughed at as they experiment and explore their environment…"}, {"0181": "Don’t be afraid to fail"}, {"186c": "Cats fail all the time. They embrace failure with an admirable level of vigor and élan. To the naive eye it could appear as though they are careless idiots, incapable of critical thinking. But a more discerning observer would recognize their strategy: prototype and iterate. Cats aren’t discouraged by the risk of looking dumb and being laughed at as they experiment and explore their environment, presumably in pursuit of the optimal sleeping position or a solution for global warming (I assume both are equally viable possibilities). Consequently there are over 300,000** hours of videos on YouTube of cats making fools of themselves. They are so successful at failing that they are at risk of actually failing to truly fail."}, {"80e9": "Linus is not afraid to look dumb."}, {"4d92": "Sit in a circle"}, {"7e3f": "It’s a well-known fact that if you create some sort of circle on the ground, cats will sit in it. I’m not actually sure what this one is about but given everything we’ve discussed so far I’m certain there is a deeper meaning to unlock and it’s just going above our heads right now. Feel free to open up the discussion in the comments. If we put our collective minds together and apply some design thinking, we might figure this one out."}, {"f415": "*I did not actually do this but this is what I imagine would have happened if I had."}, {"d30b": "**Not a real statistic."}, {"7b15": "If you liked this article, be sure to recommend it and help spread good ideas as far and wide as tufts of cat hair caught in a warm summer’s breeze."}], "content": "Design thinking lessons from our cats We can all agree that cats spend the vast majority of their time thinking through complex problems in innovative ways. We have so much to learn from them. After years of careful observation I’ve extracted and analyzed a few key methodologies they use so we can leverage them for our own problem solving. Think inside the box If a cat fits, he sits. It’s as simple as that. Cats know how to scope problems appropriately. During four long years of art school I heard the same mantra over and over: “think outside the box.” It took me several years, many complex problems, and two cats, to realize what bad advice this is. You can’t solve a problem well by just thinking outside the box. You have to understand the box: How big is it? Is it made of cardboard? Fabric? Does it have packing peanuts in it or those plastic air pouches that aren’t fun to play with at all? Design thinking requires understanding constraints. Push boundaries Thinking inside the box doesn’t mean you have to stay inside it. Cats don’t allow themselves to be limited by the laws of physics when it comes to fitting in boxes. They assume their liquid form and gracefully allow their pillowy sides spill out over the edges. The key to their success is flexibility and prioritization. When given an ambiguous or complex problem such as a seemingly too-small box, a cat will prioritize which parts should go inside the box so that the cat and box can reach a steady state of equilibrium. Cat and box become one. The obvious lesson here is that once you understand the constraints of a problem, you know which ones to push on to achieve your goals. I’ve never known a cat that didn’t demonstrate a deep understanding of market economics. Linus and Cupcake Schoolbus engage in the laziest cat fight I’ve ever seen. Be lazy Have you ever tried to get a cat to pull a tiny garden plow? Or harnessed nine cats together and attached them to a sled, and then sat on the sled and then given your cat sled team a command to ‘MUSH’? Well I have*. They did not mush. They sat there and looked at me like I was an idiot. A few of them lay down in the snow. Two or three ignored me while they groomed each other, and the back team started scuffling. Cats don’t like to work hard. They don’t toil for the sake of toil. They evaluate cost, benefits, and impact and make appropriate trade-offs. I’ve never known a cat that didn’t demonstrate a deep understanding of market economics. It goes back to their ancestral roots, where evidence suggests that early cats domesticated themselves when they saw the value in offering fuzzy snuggles in exchange for a steady source of food. When you’re driven by laziness, you’re forced to take a hard look at your resources and make trade offs. Cats aren’t discouraged by the risk of looking dumb and being laughed at as they experiment and explore their environment… Don’t be afraid to fail Cats fail all the time. They embrace failure with an admirable level of vigor and élan. To the naive eye it could appear as though they are careless idiots, incapable of critical thinking. But a more discerning observer would recognize their strategy: prototype and iterate. Cats aren’t discouraged by the risk of looking dumb and being laughed at as they experiment and explore their environment, presumably in pursuit of the optimal sleeping position or a solution for global warming (I assume both are equally viable possibilities). Consequently there are over 300,000** hours of videos on YouTube of cats making fools of themselves. They are so successful at failing that they are at risk of actually failing to truly fail. Linus is not afraid to look dumb. Sit in a circle It’s a well-known fact that if you create some sort of circle on the ground, cats will sit in it. I’m not actually sure what this one is about but given everything we’ve discussed so far I’m certain there is a deeper meaning to unlock and it’s just going above our heads right now. Feel free to open up the discussion in the comments. If we put our collective minds together and apply some design thinking, we might figure this one out. *I did not actually do this but this is what I imagine would have happened if I had. **Not a real statistic. If you liked this article, be sure to recommend it and help spread good ideas as far and wide as tufts of cat hair caught in a warm summer’s breeze. ", "child": "1272_1\t1272_2\t1272_3\t1272_4\t1272_5\t1272_6\t1272_7\t1272_8\t1272_9\t1272_10\t1272_11\t1272_12\t1272_13\t1272_14\t1272_15\t1272_16\t1272_17\t1272_18\t1272_19\t1272_20\t1272_21\t1272_22\t1272_23\t1272_24"}