{"name": "1275", "parent": "", "title": "Themes in Australian media innovation and our Walkleys Incubator longlist", "sentences": [{"c0c7": "Themes in Australian media innovation and our Walkleys Incubator longlist"}, {"e899": "Strap yourselves in — we’ve got 100 or so longlisted projects to introduce and a few emerging themes in Australian media innovation to unpack for you based on the 2017 entries to Australia’s only journalism ventures incubator."}, {"eefd": "Let me start with a bit of context: For the past three years, the Walkley Foundation has ran an innovation grants program, complete with a workshop or two for the finalist projects. Around a hundred projects entered each year, with 25 receiving training and three to eight receiving grant funding."}, {"7c8e": "This year, we extended the program significantly and brought in several of Australia’s best startup mentors to make sure as many projects as possible get access to transformational education to turn their idea into a viable and experimental venture. This year, 162 projects were entered, around 100 will receive training in the incubator program and three to eight will receive grant funding."}, {"6e2a": "This radical step-up in the number of projects selected is because this year we are doubling down on training. We’ve created a three-stage online incubator program (details here) so more media innovators can benefit from our program and build ventures that flourish."}, {"6041": "The full list of longlisted projects entering the incubator program is at the bottom of this post. It’s only project names and teams as there are too many to summarise them all. I’ve explored four projects that speak to the key themes we found running through the applications. This is important context about the projects we selected, but also about the diversity of innovation thinking in the Australian media community."}, {"75be": "In a program that is actively seeking out weird and new ideas, finding similarities that unite the entrants is difficult and could easily become misleading. So please keep in mind reading the below these are surface commonalities only, such as focus or platform."}, {"f0c1": "Even in Australia, people are worried about fake news"}, {"5c84": "Most of the evidence and research into fake news has been focused on the United States, but in this era of global news it’s a concern for all of us."}, {"f132": "Projects seeking to solve or combat elements of fake news were one of the top themes of entries: about 10 projects were tackling it directly (lots of fake-news-finding bots), while its impact featured in another 40 or so projects. We were delighted with the breadth of these approaches — it’s not going to be an easy issue to solve."}, {"a310": "A good example of a longlisted fake news project is Michael Feischl’s. A mathematician by trade, Feischl’s FactoryNews project plans to provide a blockchain-based network that allows anyone to rate news articles in terms of basic journalism ethics and standards."}, {"f9bd": "“In the age of fabricated truth, we need an unbiased authority that rates the quality of news articles,” Feischl wrote."}, {"83c0": "“The blockchain technology ensures that this rating is unbiased in the sense that if the majority of participants give honest ratings, it is impossible for individual parties to significantly modify the rating. The technology additionally allows anyone to verify if an article has been changed after its initial publication. Thus, FactoryNews is also an ideal place to store primary source material.”"}, {"405c": "This is one of the more technical projects in the fake news category. But it is interesting that many of the fake news projects were seeking to harness crowdsourcing to fight fake news. There are of course risks to this that must be addressed in the product design of all of these projects, but it is encouraging given the expensive campaigns and new tools from large media groups do not appear to be working powerfully enough yet."}, {"a97f": "Podcasts were the biggest theme in the applications"}, {"77ab": "By far. Sixteen projects were new podcasts, but many other projects either included online audio products or were focused on this space, such as a podcast recommendation chatbot."}, {"95a0": "I can imagine a lot of people reading this and thinking “But podcasts haven’t been innovative since the early 2010s”. We think it’s important to recognise that innovation often happens at the edges of ideas. This is why 20 to 30 projects in the longlist are more classic plays in the audio space or news and content sites."}, {"de33": "As I outlined in our post about what kind of projects we were looking for, what we want is for the founders who go through the incubator to plunge into experiments that are valuable for the broader industry. If any of our longlisters end up running a handful of genuinely innovative distribution or revenue strategies trials, they are strong candidates for grants."}, {"7901": "One example of a podcast exploring interesting strategies is Bryony Cole’s The Future of Sex, a podcast aimed at young adults, on the intersection of sex and tech. The innovative part is the vision they have for how to enable genuinely helpful engagement about such an intimate topic across multiple platforms."}, {"3c48": "“With technology playing an increasing role in human sexuality (ie. sexting, porn) the cultural conversation about sextech, how it informs the way we fall in love, have relationships and design ethically, needs to be examined and updated.”"}, {"2403": "The Australian media innovation community is growing — and pitching more technologically ambitious projects"}, {"4cbb": "In the first few years of Walkleys innovation grants judging, there were very few applications (if any) that mentioned artificial intelligence, machine learning or blockchain. That changed this year."}, {"1f30": "There were as many tech-driven projects as there were more classic podcast or news site projects."}, {"a17a": "One good example of this is NewsMaven, which uses AI to locate and install relevant videos for news groups and sites."}, {"5abd": "“Publishers find it difficult to add relevant video to their content. This is because video is extremely expensive to produce and curate — but video is what media consumers of today are expecting,” NewsMaven cofounder Shaon wrote."}, {"1008": "The software uses machine learning to analyse text stories and identify videos about the people, places and organisations mentioned. For large sites, this could be videos from wire services such as Bloomberg or Reuters, while smaller sites would be paired with more affordable content such as Storyful or NewsFlare."}, {"a9ce": "NewsMaven is just one of several promising tech startups experimenting in the news space, rather than a news project wading into the startup or tech space."}, {"8764": "Applicants are more diverse than you might think"}, {"66b0": "It’s probably useful to share at this stage that the entries came from a very wide range of individuals and teams, rather than just from entrepreneurs planning a startup or from journalists in newsrooms."}, {"f8b7": "These were fairly common misconceptions I encountered when I was promoting the opportunity. But in fact, most of the entrants in the program were neither. Full-time journalists and entrepreneurs made up less than 35 per cent of entries."}, {"dcb9": "Profession groups of the 160+ entrants"}, {"927c": "This diversity of backgrounds was matched by a decent gender diversity split, with 48 per cent of the entries from women and 52 per cent from men. The age diversity was poorer, with a whopping 70 per cent being aged between 26 to 36 years old. We didn’t track a variety of other diversity metrics but are considering doing so to assess our program next year."}, {"ad4d": "The longlist includes several projects specifically targeting the pretty woeful racial diversity in the media, including two projects by Aboriginal Australians. We also had five projects directly addressing news challenges for the LGBTQI community, many of which made it through to the longlist, as well as a handful exploring access and inclusion more broadly."}, {"93f7": "Purpose still drives media innovators"}, {"cc0c": "The final trend from the entries I wanted to share was the overwhelming “for the greater good” vibes, which appeared in almost every application. The diversity projects are a great example of this."}, {"a298": "Genuine commitment to bettering journalism and through it the country is why the Walkley Foundation offers its programs: to generate vital discussion on the future of our rapidly changing industry and encourages journalism that enriches our communities."}, {"78fd": "Plus for applicants, it makes sense. You’d have to be pretty brave to claim to have a plan to make buckets of cash from a new media venture given what a rough time the news industry (and its previous primary online revenue source) is having. But just like the journalists we know, many of the applicants were motivated by a desire to strengthen democracy and empower audiences with the information."}, {"56b1": "An example is the application from Juliette Elfick, who submitted the longlisted Connecting with Indigenous Voices."}, {"581e": "“Lack of confidence in reporting on Indigenous issues is a key reason why Indigenous stories are underreported. Through this project, the media will have the skills and resources to report confidently and accurately on Indigenous Australia,” Elfick wrote."}, {"5634": "“The Australian public will benefit through access to reporting that truthfully represents our many Indigenous communities. Indigenous Australians will benefit through the wider public having a stronger understanding of Indigenous culture (as New Zealanders do of Maori culture); this will help combat the endemic racism faced by the Indigenous community.”"}, {"7fad": "Below are all the longlisted projects by project name and team. If you would like to be notified when the Walkleys’ 2018 journalism innovation funding program opens, please leave us your email here."}, {"ebdd": "If you entered and your project is not on this list, it was not selected for the longlist. We hope you keep working on your project and apply next year.Many of the projects that applied but were not longlisted were promising but outside of this program’s focus. I understand it sucks to spend ages on an application about a project you really care about and not have it selected. You are welcome to reach out for feedback via rose.powell [at] walkleys.com."}, {"4fb3": "2017 longlist:"}], "content": "Themes in Australian media innovation and our Walkleys Incubator longlist Strap yourselves in — we’ve got 100 or so longlisted projects to introduce and a few emerging themes in Australian media innovation to unpack for you based on the 2017 entries to Australia’s only journalism ventures incubator. Let me start with a bit of context: For the past three years, the Walkley Foundation has ran an innovation grants program, complete with a workshop or two for the finalist projects. Around a hundred projects entered each year, with 25 receiving training and three to eight receiving grant funding. This year, we extended the program significantly and brought in several of Australia’s best startup mentors to make sure as many projects as possible get access to transformational education to turn their idea into a viable and experimental venture. This year, 162 projects were entered, around 100 will receive training in the incubator program and three to eight will receive grant funding. This radical step-up in the number of projects selected is because this year we are doubling down on training. We’ve created a three-stage online incubator program (details here) so more media innovators can benefit from our program and build ventures that flourish. The full list of longlisted projects entering the incubator program is at the bottom of this post. It’s only project names and teams as there are too many to summarise them all. I’ve explored four projects that speak to the key themes we found running through the applications. This is important context about the projects we selected, but also about the diversity of innovation thinking in the Australian media community. In a program that is actively seeking out weird and new ideas, finding similarities that unite the entrants is difficult and could easily become misleading. So please keep in mind reading the below these are surface commonalities only, such as focus or platform. Even in Australia, people are worried about fake news Most of the evidence and research into fake news has been focused on the United States, but in this era of global news it’s a concern for all of us. Projects seeking to solve or combat elements of fake news were one of the top themes of entries: about 10 projects were tackling it directly (lots of fake-news-finding bots), while its impact featured in another 40 or so projects. We were delighted with the breadth of these approaches — it’s not going to be an easy issue to solve. A good example of a longlisted fake news project is Michael Feischl’s. A mathematician by trade, Feischl’s FactoryNews project plans to provide a blockchain-based network that allows anyone to rate news articles in terms of basic journalism ethics and standards. “In the age of fabricated truth, we need an unbiased authority that rates the quality of news articles,” Feischl wrote. “The blockchain technology ensures that this rating is unbiased in the sense that if the majority of participants give honest ratings, it is impossible for individual parties to significantly modify the rating. The technology additionally allows anyone to verify if an article has been changed after its initial publication. Thus, FactoryNews is also an ideal place to store primary source material.” This is one of the more technical projects in the fake news category. But it is interesting that many of the fake news projects were seeking to harness crowdsourcing to fight fake news. There are of course risks to this that must be addressed in the product design of all of these projects, but it is encouraging given the expensive campaigns and new tools from large media groups do not appear to be working powerfully enough yet. Podcasts were the biggest theme in the applications By far. Sixteen projects were new podcasts, but many other projects either included online audio products or were focused on this space, such as a podcast recommendation chatbot. I can imagine a lot of people reading this and thinking “But podcasts haven’t been innovative since the early 2010s”. We think it’s important to recognise that innovation often happens at the edges of ideas. This is why 20 to 30 projects in the longlist are more classic plays in the audio space or news and content sites. As I outlined in our post about what kind of projects we were looking for, what we want is for the founders who go through the incubator to plunge into experiments that are valuable for the broader industry. If any of our longlisters end up running a handful of genuinely innovative distribution or revenue strategies trials, they are strong candidates for grants. One example of a podcast exploring interesting strategies is Bryony Cole’s The Future of Sex, a podcast aimed at young adults, on the intersection of sex and tech. The innovative part is the vision they have for how to enable genuinely helpful engagement about such an intimate topic across multiple platforms. “With technology playing an increasing role in human sexuality (ie. sexting, porn) the cultural conversation about sextech, how it informs the way we fall in love, have relationships and design ethically, needs to be examined and updated.” The Australian media innovation community is growing — and pitching more technologically ambitious projects In the first few years of Walkleys innovation grants judging, there were very few applications (if any) that mentioned artificial intelligence, machine learning or blockchain. That changed this year. There were as many tech-driven projects as there were more classic podcast or news site projects. One good example of this is NewsMaven, which uses AI to locate and install relevant videos for news groups and sites. “Publishers find it difficult to add relevant video to their content. This is because video is extremely expensive to produce and curate — but video is what media consumers of today are expecting,” NewsMaven cofounder Shaon wrote. The software uses machine learning to analyse text stories and identify videos about the people, places and organisations mentioned. For large sites, this could be videos from wire services such as Bloomberg or Reuters, while smaller sites would be paired with more affordable content such as Storyful or NewsFlare. NewsMaven is just one of several promising tech startups experimenting in the news space, rather than a news project wading into the startup or tech space. Applicants are more diverse than you might think It’s probably useful to share at this stage that the entries came from a very wide range of individuals and teams, rather than just from entrepreneurs planning a startup or from journalists in newsrooms. These were fairly common misconceptions I encountered when I was promoting the opportunity. But in fact, most of the entrants in the program were neither. Full-time journalists and entrepreneurs made up less than 35 per cent of entries. Profession groups of the 160+ entrants This diversity of backgrounds was matched by a decent gender diversity split, with 48 per cent of the entries from women and 52 per cent from men. The age diversity was poorer, with a whopping 70 per cent being aged between 26 to 36 years old. We didn’t track a variety of other diversity metrics but are considering doing so to assess our program next year. The longlist includes several projects specifically targeting the pretty woeful racial diversity in the media, including two projects by Aboriginal Australians. We also had five projects directly addressing news challenges for the LGBTQI community, many of which made it through to the longlist, as well as a handful exploring access and inclusion more broadly. Purpose still drives media innovators The final trend from the entries I wanted to share was the overwhelming “for the greater good” vibes, which appeared in almost every application. The diversity projects are a great example of this. Genuine commitment to bettering journalism and through it the country is why the Walkley Foundation offers its programs: to generate vital discussion on the future of our rapidly changing industry and encourages journalism that enriches our communities. Plus for applicants, it makes sense. You’d have to be pretty brave to claim to have a plan to make buckets of cash from a new media venture given what a rough time the news industry (and its previous primary online revenue source) is having. But just like the journalists we know, many of the applicants were motivated by a desire to strengthen democracy and empower audiences with the information. An example is the application from Juliette Elfick, who submitted the longlisted Connecting with Indigenous Voices. “Lack of confidence in reporting on Indigenous issues is a key reason why Indigenous stories are underreported. Through this project, the media will have the skills and resources to report confidently and accurately on Indigenous Australia,” Elfick wrote. “The Australian public will benefit through access to reporting that truthfully represents our many Indigenous communities. Indigenous Australians will benefit through the wider public having a stronger understanding of Indigenous culture (as New Zealanders do of Maori culture); this will help combat the endemic racism faced by the Indigenous community.” Below are all the longlisted projects by project name and team. If you would like to be notified when the Walkleys’ 2018 journalism innovation funding program opens, please leave us your email here. If you entered and your project is not on this list, it was not selected for the longlist. We hope you keep working on your project and apply next year.Many of the projects that applied but were not longlisted were promising but outside of this program’s focus. I understand it sucks to spend ages on an application about a project you really care about and not have it selected. You are welcome to reach out for feedback via rose.powell [at] walkleys.com. 2017 longlist: ", "child": "1275_1\t1275_2"}