{"name": "1294", "parent": "", "title": "This Game In History: System Shock (1994)", "sentences": [{"0cfc": "This Game In History: System Shock (1994)"}, {"7b2e": "“The System Shock series is the benchmark for intelligent first-person gaming […] what System Shock does is to seamlessly integrate brilliant narrative, a complex, interactive world and thoughtful first-person action into a brilliant, atmospheric whole.”"}, {"b569": "— Eurogamer, 2007"}, {"cf30": "HISTORY"}, {"e10e": "Looking Glass Studios had already made a name for themselves in 1992 with their wildly innovative First-Person Role-Playing Game, Ultima Underworld: The Stygian Abyss. With it, Looking Glass (then known as Blue Sky Productions) brought massive advancements to First-Person gaming in regards to both technical prowess and game design."}, {"2582": "After releasing a sequel the following year, the studio was tired of the traditional fantasy setting and wanted to try something a bit different."}, {"4613": "In the meantime, after having seen a preview of Ultima Underworld in 1990, John Carmack of id Software was convinced he could write a faster texture-mapper, resulting in what is widely considered the genesis of the First-Person Shooter genre with Wolfenstein 3D, also in 1992."}, {"5e95": "Between Looking Glass’s positive reputation from Ultima Underworld and their publisher Origin Systems’ prestigious legacy as the creators of the Wing Commander and Ultima franchises, their next project was primed to be a great success."}, {"c3eb": "The concept was to carry on the immersive dungeon-crawler designs from the Underworld games in a sci-fi, cyberpunk horror setting. The initial design documents were drawn up by Doug Church, Warren Spector (Looking Glass’s associate at Origin), Paul Neurath, and Austin Grossman. Together, they created a couple of page-long ‘Minute of Gameplay’ vignettes of sci-fi action and adventure, and much of the game’s mechanics would be derived from what these short stories glimpsed at."}, {"0330": "Doug Church headed development as director, Warren Spector served as producer, and Austin Grossman was the writer. Some other notable project members were Tim Stellmach, a designer; Robb Waters, the concept artist; and Origin employee Harvey Smith, who was among the Quality Assurance team. Boston alt-rock band ‘Tribe’ members Greg LoPiccolo and Terri & Eric Brosius (spouses) were brought on for audio work."}, {"bc27": "However, it seems that fate was not on Looking Glass’s side as id Software’s follow-up to Wolfenstein 3D, DOOM, released in 1993 and quickly became a pop-culture juggernaut."}, {"22c1": "As the term “First-Person Shooter” was not commonplace yet, for the next few years every other FPS was simply described as a ‘DOOM clone’, perfectly encapsulating how monumental DOOM’s significance in gaming culture was in the 1990's."}, {"2393": "System Shock released in 1994 around the same time as DOOM 2: Hell on Earth, and was dramatically overshadowed by id’s mega-hit series."}, {"c38b": "In the end, System Shock only sold enough to break even, though it received some praise from critics such as PC Gamer."}, {"0849": "DESIGN"}, {"9e79": "In the year 2072, you, The Hacker, find yourself on board the powerful TriOptimum Corporation’s Citadel Station, a private space station orbiting Saturn. You were caught hacking into TriOptimum’s secure network and were brought to Citadel, where a slimy executive named Edward Diego offered to make a deal. If you hacked into the station’s A.I. construct known as SHODAN and disabled its ethical constraints, Diego would drop your charges and even give you a state-of-the-art cybernetic neural implant."}, {"809a": "When you awake from the 6-month healing coma after your implant surgery you soon learn that as you slept SHODAN has wreaked havoc upon Citadel Station. The ruthless A.I. has made the maintenance robots murderous and augmented many of the facility’s inhabitants into nightmarish cyborg soldiers, and is hunting down the few remaining humans who are in hiding. Even worse, many of those on board the station have mutated into violent monsters. You explore the space station’s various decks while fighting SHODAN’s minions as you collect keycards, weapons, and character abilities, as well as solving hacking puzzles and occasionally partaking in a Cyberspace mini-game, all in effort to stop the A.I.’s nefarious plans."}, {"e8dc": "The original System Shock is often referred to as an Action RPG despite the game lacking any traditional RPG mechanics (those would come later); instead simply the rich immersion and player freedom drives this sentiment."}, {"af41": "The game also can be described as a Survival Horror title as the player is alone in their struggle of cautiously fighting past all sorts of monstrosities with their only respite being a few precious moments of safety when inside an elevator."}, {"9a69": "And, being an First Person Shooter (though a slow paced one) that includes puzzles and a narrative, System Shock is technically an Action-Adventure title."}, {"f94c": "Ultimately, like many of Looking Glass Studios’ games, System Shock defied genre norms and is best described as an ‘Immersive Sim’. The philosophy of the immersive sim is to offer player agency and use simulation-like game worlds to induce deep player immersion and foster emergent gameplay."}, {"03d3": "Player Freedom"}, {"e0e4": "One of the core tenets of System Shock’s design is giving the player as much agency as possible."}, {"41e4": "This is displayed before the player even enters the 3D game world, as System Shock offers one of the most customizable difficulty menus ever seen:"}, {"fdd2": "Your chosen name is your in-game name, though you are rarely referred to by it."}, {"275c": "Want a DOOM clone? Well, it certainly won’t be DOOM, but you can turn off all puzzles and mission objectives."}, {"8761": "Want a Puzzle game? Setting combat to ‘0’ means enemies don’t attack you until/unless you attack them. Turn puzzles off too and for a ‘Walking Simulator’ feel."}, {"d920": "Want an excruciatingly stressful experience? Max everything out, including ‘Mission’, which adds a 7 hour time limit to beat the game (the game normally takes around 12 hours to complete)."}, {"24ff": "Beyond that, System Shock offered an incredible amount of control over player movement, especially for a game from 1994: jump, crouch, crawl, walk, sprint, and controlled leaning accompany the ability to look up and down."}, {"53f2": "You can freely load and unload weapons."}, {"7c9b": "This freedom also extends to combat: unlike near every other FPS from the 90’s, picking up new weapons is a choice — and there are over a dozen weapons in the game, but the Hacker can hold just seven at a time. Among these are normal firearms, energy-based guns, and a couple of melee weapons. Each of the standard firearms offer two ammo types to use, and the energy guns have a slider to adjust power settings. A few weapons even offer the chance to use a nonlethal approach, with tranquilizer darts and rubber slugs."}, {"127e": "Furthermore, the game world is not especially linear; each deck is a maze of hallways and rooms, but they are not arranged in a linear fashion. For the most part you can explore the station freely, with limiting factors being the need to acquire access cards, key codes, and character equipment, and completing objectives. And many of those weapons and items are not only available in a single instance, so there is not necessarily a ‘correct’ path to take as you can usually find what you need in more than one specific spot."}, {"5825": "Believable World Design"}, {"9fa6": "The simulation-tier level of player control was complemented by the game world itself being akin to a simulation."}, {"d3b2": "The level design of Citadel Station’s various decks was intended to convey the feeling of it being a real space. Granted, sometimes the architecture veers into the nonsensical but the world is largely realistic, with offices, storage closets, transport hangers, and maintenance crawlspaces. Walls are often lined with piping or electronics, to maximize space efficiency."}, {"4cc6": "System Shock complemented the mostly believable level design with advanced engine features for a game of its time, including sloped floors, elevators, ladders, variable gravity and a full-blown physics system."}, {"94f8": "Weapons and other items are not automatically picked up by simply walking over them; the player has to manually pick them up and place them in their inventory. Similarly, throwing grenade-type items is not bound to a hotkey but rather requires manually selecting them in the inventory before throwing. Naturally, the game does not pause while you sort through your inventory or data reader."}, {"a25e": "Even more notably, in System Shock weapons actually use magazines, rather than feeding endlessly from a pool of ammo. And, again, reloading weapons is not done via a hotkey, but instead through manually reaching down and clicking an icon in the player’s HUD. Many guns also have substantial recoil due to the aforementioned physics engine. All these factors combine to support more methodical, slower-paced fighting that is the complete antithesis to DOOM."}, {"95fe": "Subdued Storytelling"}, {"6957": "Less bombastic action is far from the only way System Shock diverged from DOOM’s design, regardless of the ‘DOOM clone’ label it received for releasing after the blockbuster title."}, {"1e67": "While id famously shunned having a narrative with DOOM, with System Shock Looking Glass wanted to find a happy medium. They knew that the long texts of RPGs of the time were intrusive and conversations with NPCs were clumsy, so they opted to deliver the narrative through more passive techniques instead."}, {"5a13": "Aside from short beginning and ending cutscenes to book-end the narrative, the story is told entirely in-game, from the First-Person. As you explore you find audio logs left by the station’s late inhabitants, which flesh out the questions of what Edward Diego was up to and how SHODAN seized control. The game also uses environmental clutter to suggest what events may have transpired throughout the station."}, {"4ee5": "The result is System Shock’s narrative taking somewhat of a backseat, though what is there is actually rather strong — especially the SHODAN character."}, {"ea12": "SHODAN is brutal, methodical, and relentless. Throughout the game, she mocks you and dismisses your efforts as pathetic and nonthreatening. Reinforcing this attitude, she haunts you, her face appearing in displays throughout the station, watching your every move. Voice-acted by Terri Brosius and complemented by superb audio engineering, SHODAN is one of the greatest villains the gaming industry has ever seen, bar none."}, {"0a3e": "Downfalls"}, {"a8de": "With an unforgettable antagonist, a highly advanced game engine, innovative storytelling techniques, and more, it may seem strange that System Shock 1 is not well-known in the gaming community. The ubiquity of DOOM was not the only obstacle the game faced — and that alone was quite a hurdle to overcome."}, {"34fb": "Making matters worse, Origin Systems regrettably pressured Looking Glass to release a floppy disk edition of the game initially. The floppy disk version of System Shock had no voice acting included due to technical limitations, making for a woefully inferior experience. Unfortunately, that experience was what early previews conveyed to the gaming community."}, {"5f27": "The floppy disk release was not the only technical problem the game suffered from at launch. Like Ultima Underworld, System Shock was a bit too technologically advanced for its own good and required beefier hardware than DOOM to run well, further limiting the game’s audience."}, {"6001": "As with Underworld, to improve performance Looking Glass made the HUD quite large to reduce the load of rendering the game world."}, {"4d6c": "On the same note, System Shock’s Achilles’ heel was its cluttered, unorthodox interface, which was largely a continuation of what was in Ultima Underworld."}, {"fafa": "The realism, world interactivity and the extensive movement controls came at a cost. The game uses a plethora of keybindings, even reminiscent of flight simulators. Coincidentally, System Shock’s physics engine was actually borrowed from Looking Glass’s concurrently made flight sim Flight Unlimited."}, {"d8fc": "And as System Shock did not have mouse-look, the awkwardness is even more severe, with aiming completely detached from head movement. To move your view you click and drag in the center of the screen to clumsily pan around."}, {"edcb": "Pretty much everything seen in the HUD is interactive. Keybindings were so quickly swallowed up by movement controls and player equipment that inventory management is done with the mouse."}, {"63db": "The unusual interface actually results in a sense of tension and helplessness that enhances the horror aspect, but it still comes off as intimidating enough to keep many people from even attempting to play."}, {"a821": "Cyberspace is another weakness."}, {"b1b0": "At special terminals scattered throughout the station you use your neural implant to enter a 3D depiction of cyberspace to battle ‘security protocols’, interact with virtual door locks, and grab data files, with limited time before SHODAN finds the intrusion and kicks you out."}, {"c0e5": "Though the concept is creative and the way Looking Glass integrated it into the overall game helps break up monotony, sadly, the execution is far from perfect. The wireframe space is hard to navigate, the controls feel unwieldy with sluggish momentum yet pinpoint turning, and the combat in cyberspace is oddly not accompanied by sound effects. The mini-game is not awful but even the developers themselves wish they had worked more on it."}, {"4a2b": "What this all adds up to is an imperfect game, but far from a bad one. Many of its weakness were only relevant when the game was new: the inferior floppy disk release can be ignored, the then-steep hardware requirements are a joke now, and the ‘DOOM clone’ furor has long since died down."}, {"1ba8": "On the whole, System Shock (1994) is a remarkably excellent game bogged down by just a few idiosyncrasies. There is a reason that Warren Spector posits that “if you updated the graphics, sound, and UI on System Shock you’d have something that competes directly with any game on the market today”."}, {"80e2": "LEGACY"}, {"4426": "System Shock followed in Ultima Underworld’s footsteps, improving upon the Immersive Sim concept and helping to expand the foundation of the FPS genre. While DOOM’s massive success meant that id Software’s fast-paced design would be the trend of the times, System Shock laid the groundwork for other, slower approaches, showing that the genre was not limited to just the frantic, adrenaline-pumping affairs DOOM provided."}, {"71a6": "Realms of the Haunting has an awkward interface similar to System Shock, and it too blends FPS, Adventure, and Survival Horror."}, {"dd59": "Titles such as Bungie’s Marathon in 1994, CyberMage: Darklight Awakening in 1995, Realms of the Haunting and Strife in 1996, and Parkan: The Imperial Chronicles in 1997 echoed System Shock’s innovations and helped further expand the adolescent FPS genre."}, {"1de5": "Strife is regarded by some as a sort of prototype of Deus Ex, offering neutral NPCs, story choices, and stealth."}, {"b9d8": "And in 1998 Valve’s Half-Life brought some of those designs to the attention of the industry as it received enormous praise akin to the glory days of DOOM."}, {"753a": "In an interview prior to the release of Half-Life 2, Valve Software noted that many team members were fans of System Shock and Ultima Underworld."}, {"f575": "Gordon Freeman’s iconic starting weapon, a simple crowbar, is reminiscent of the Hacker’s starting weapon in System Shock: a lead pipe."}, {"11a1": "Like System Shock, Half-Life offered a seamless First-Person experience in a (mostly) believable world with notes of survival horror and a stronger sense of narrative than the likes of DOOM or Quake. Like the Hacker, Gordon Freeman has a special advantage in the form of his H.E.V. suit, and both characters find themselves fighting through a facility ravaged by technology gone wrong. And, while not as talkative as SHODAN, the mysterious ‘G-Man’ stalks the player too, elegantly adding more to the atmosphere and narrative."}, {"7949": "However, with their seminal title Valve otherwise took a more streamlined approach, trading away System Shock’s player freedom to create an accessible, sleek thrill-ride."}, {"3be2": "In 1997, after the release of Looking Glass’s ‘First-Person Sneaker’ Thief: The Dark Project, three Looking Glass employees left to form their own studio. The three, Ken Levine, Jonathan Chey, and Robert Fermier and their studio Irrational Games then worked with Looking Glass to make a new game."}, {"7600": "Initially the project was titled “Junction Point”, intending to continue the cyberpunk action of System Shock while emphasizing the more overtly recognizable role-playing nature of Ultima Underworld."}, {"0d7e": "The game arrived in 1999, as System Shock 2."}, {"0f16": "While it used the same storytelling techniques and a similar gameplay loop to the original, it had even more realistic world design, a more consistent horror atmosphere, but also — most importantly — introduced character skill points."}, {"a146": "Though it used a more orthodox control scheme, the HUD & interface remained quite complex."}, {"fd15": "System Shock 2 was one of the first true FPS-RPGs, offering three different character classes and having a full-fledged skill point system. This resulted in the two System Shock games feeling somewhat different despite the many parallels otherwise. The original is simple and straightforward (interface aside) while in SS2 choosing which skills to upgrade can profoundly affect the experience as the game progresses. SS2 also has weapon degradation, an ever-controversial game mechanic. Those who enjoy one System Shock entry might not love the other and, conversely, not liking one game is not necessarily reason to dismiss the other."}, {"fa31": "Despite System Shock 2 receiving far more critical acclaim than the original, it sold horrendously and contributed to Looking Glass Studios’ closure in 2000. According to Paul Neurath, part of the reasoning for the weak sales was that EA was hesitant to commit to significant marketing for any FPS in the wake of the Columbine massacre. The result was System Shock 2 releasing quietly, and after the lack of initial success EA quickly gave up on the title."}, {"0546": "In the years since however, while System Shock 1 was mostly forgotten to time System Shock 2 has become one of the most beloved cult classic PC games around, standing shoulder-to-shoulder with titles like Planescape: Torment and Grim Fandango."}, {"8273": "Warren Spector went on to head the Austin branch of Ion Storm at the invitation of John Romero, and when Looking Glass Studios went bankrupt Spector helped many former coworkers migrate there as well. Among those was Harvey Smith, who would serve as a key designer for their next project. While the main branch of Ion Storm suffered much controversy revolving around Romero’s Daikatana, the Austin branch avoided that commotion and Spector led the creation of his “dream project”, Deus Ex, which released in 2001."}, {"e761": "I wanted to build on the foundation laid by the Looking Glass guys in games like Underworld and System Shock…— Warren Spector regarding Deus Ex"}, {"ebf5": "PC Gaming Critic John ‘TotalBiscuit’ Bain considers Deus Ex “the epitome of PC gaming” and “thoroughly, without question […] the best game ever made”."}, {"269d": "PC Gamer ranked it as #1 in the 2010 edition of their Top 100 PC Games of All Time list, PC Zone named it the “Best PC Game Ever”, and Gamasutra placed Deus Ex in the #2 spot of their list of the ‘Top Games of the 2000's’. The game is so revered that there is a saying that “Every time you mention it, SOMEONE will reinstall it.”"}, {"773f": "Irrational Games would later create the heavily SS2-inspired game, BioShock, which launched on both PC and consoles in 2007."}, {"baf4": "Aside from a change of setting it has innumerable design similarities to System Shock 2. Irrational even hired Robb Waters to make concept art."}, {"2945": "“This 2007 title is the most haunting, atmospheric experience in gaming history. With its crumbling underwater utopia and unforgettable characters, it provides all who enter with nothing less than rapture.” — G4"}, {"7650": "As it was the first ‘Shock’ game to release on consoles, noticeably streamlined compared to the previous games, and had a healthy marketing push, it was a massive critical and commercial success. In 2012, G4TV placed BioShock as #3 on their list of the ‘Top 100 Games of All Time’."}, {"0029": "PC Gamer UK, September 2006"}, {"b476": "In 2006, rumors correctly claimed that EA had set their ‘EA Redwood Shores’ dev team to work on System Shock 3. In 2008 the studio (which had since re-branded as ‘Visceral Games’) released the game under the title “Dead Space”, as a new IP."}, {"5c93": "The name change was for a few reasons: Visceral really wanted to make a new IP rather than continue existing franchises and they also were concerned about taking over the reigns in Looking Glass’ absence. The tipping point though had been the release of Resident Evil 4. Ultimately, the final design of the project was a fusion of System Shock 2 and RE4, blending the latter’s 3rd Person Action Horror combat and perspective and the story and gameplay arc of the former."}, {"b310": "The hybrid design received serious acclaim, and a sizable portion of the gaming community view Dead Space as one of the greatest horror games ever."}, {"314d": "Another reason for the move to a new IP was that EA simply could not actually make a System Shock game: the deal that they had made with Looking Glass back when System Shock was published was that EA (who served as distributor for the game, and publisher for the sequel) would control the trademark but Looking Glass would retain the development rights for the series. When the studio closed, those development rights fell into the hands of an insurance agency. For whatever reason, EA never acquired those rights and by the time Dead Space released EA had abandoned the System Shock trademark entirely."}, {"de13": "Years later, in 2012, a fledgling indie company known as Night Dive Studios managed to acquire both halves of the System Shock IP. In 2013 they digitally re-released System Shock 2 to great fanfare, and in 2015 they followed it with the release of an “Enhanced Edition” of System Shock 1 (which was largely based on an abandonware community project called ‘System Shock Portable’)."}, {"db7b": "Aside from improving support for modern hardware and modern display resolutions, the Enhanced Edition includes the invaluable addition of toggle-able mouse-look. With it, character movement and combat are vastly smoother and more comfortable, though many of the game’s mechanics require momentarily toggling mouse-look back off such as to reload weapons, use equipment, or browse the data reader. Overall, the feature greatly improves the game’s primary weakness, resulting in an experience that is quirky but not unpleasant."}, {"6464": "After the success of both re-releases, Night Dive decided to proceed with the development of a total modern remake of the original game. It will also bring the System Shock IP to consoles for the first time ever. The official name for the remake will be simply System Shock (2018), though Night Dive initially referred to the project as ‘System Shock Remastered’."}, {"e6aa": "“A modern take on System Shock, a faithful reboot; it’s not Citadel Station as it was, but as you remember it. Many improvements, overhauls and changes are being implemented to capture the spirit of what the original game was trying to convey, and bring it to contemporary gamers.”— Night Dive Studios’ System Shock Kickstarter page"}, {"9b13": "Furthermore, Night Dive met with another indie studio, OtherSide Entertainment — Paul Neurath’s new venture, where several other Looking Glass veterans also now reside. In late 2015, around the same time Night Dive announced the System Shock remake, OtherSide announced System Shock 3, helmed by Warren Spector. Doug Church, who currently works at Valve, will be a consultant, as will Tim Stellmach. The game is planned to pick up the story where System Shock 2 left off, while also bringing back characters from the first game."}, {"cb50": "Meanwhile, the System Shock series’ influence has been evident in quite a few other games new and old, examples including DOOM 3 (2004), Portal (2007) — GLaDOS, Aperture Laboratories’ corrupted female A.I. who runs their ‘Enrichment Center’ facility, certainly seems to take significant inspiration from SHODAN, albeit with a snarkier slant — , Alien: Isolation (2014), SOMA (2015), and P.A.M.E.L.A. (2017)."}, {"7b14": "Prey (2017) is also among System Shock’s progeny, as the developer, Arkane Studios, have pitched the project as “the spiritual successor to System Shock 3” and leaked design documents describe System Shock 2’s design as a “base layer” on which Prey would be built, and even conceptualize the game as being set “a month before the events in System Shock 1”."}, {"1560": "Conclusion"}, {"a17e": "System Shock 2’s fame has grown over the past decade but overall only a minority of the gaming community are aware of it. Worse though, even many of those who know of or have played System Shock 2 still don’t know anything about the original game, and that is quite simply an injustice."}, {"f9d1": "While the mainstream consensus suggests that System Shock aged poorly and is now too “outdated” to be enjoyable or worth playing, this narrative should not deter anyone interested in giving the game a try. Those who have a healthy sense of patience may find the first System Shock (in it’s Enhanced form) holds up as a brilliant, intensely immersive blend of Sci-Fi, survival horror, action, and adventure."}, {"56fc": "Recommended reading/viewing, and the sources of much of my information:"}, {"e627": "This superb video, which sparked my interest in the original System Shock in the first place, as I’d bet is true for many others who watched it."}, {"2dc7": "This guy actually took the time to try the Enhanced Edition before the remake demo, and his time with it is quite representative of most people’s first impression with System Shock these days."}, {"0d29": "Meant to be watched after having played it."}, {"ddf3": "Warren Spector, Paul Neurath, and Tim Stellmach revisit System Shock with Night Dive Studios."}, {"fc9a": "Other original devs revisit System Shock."}, {"8eee": "Trivia:"}, {"636b": "The code “451” was the first key code in the original System Shock, and was brought back in the sequel. Since then it has been included as an Easter Egg (often as “0451”) in many other games, such as Deus Ex, the BioShock series, Dishonored, Gone Home, Fallout 4, and Firewatch."}, {"887a": "451 was the real-world passcode to Looking Glass Studios’ office building, though many have speculated it was also intended as a reference to the famous Ray Bradbury novel ‘Fahrenheit 451’."}, {"6b7c": "As Super Bunnyhop noted in his video, System Shock seems to match the ‘Metroidvania’ format rather closely. Following that line of thinking, perhaps in some respects the most comparable game to System Shock (1994) is Metroid: Prime?"}, {"042e": "Thanks for reading!"}], "content": "This Game In History: System Shock (1994) “The System Shock series is the benchmark for intelligent first-person gaming […] what System Shock does is to seamlessly integrate brilliant narrative, a complex, interactive world and thoughtful first-person action into a brilliant, atmospheric whole.” — Eurogamer, 2007 HISTORY Looking Glass Studios had already made a name for themselves in 1992 with their wildly innovative First-Person Role-Playing Game, Ultima Underworld: The Stygian Abyss. With it, Looking Glass (then known as Blue Sky Productions) brought massive advancements to First-Person gaming in regards to both technical prowess and game design. After releasing a sequel the following year, the studio was tired of the traditional fantasy setting and wanted to try something a bit different. In the meantime, after having seen a preview of Ultima Underworld in 1990, John Carmack of id Software was convinced he could write a faster texture-mapper, resulting in what is widely considered the genesis of the First-Person Shooter genre with Wolfenstein 3D, also in 1992. Between Looking Glass’s positive reputation from Ultima Underworld and their publisher Origin Systems’ prestigious legacy as the creators of the Wing Commander and Ultima franchises, their next project was primed to be a great success. The concept was to carry on the immersive dungeon-crawler designs from the Underworld games in a sci-fi, cyberpunk horror setting. The initial design documents were drawn up by Doug Church, Warren Spector (Looking Glass’s associate at Origin), Paul Neurath, and Austin Grossman. Together, they created a couple of page-long ‘Minute of Gameplay’ vignettes of sci-fi action and adventure, and much of the game’s mechanics would be derived from what these short stories glimpsed at. Doug Church headed development as director, Warren Spector served as producer, and Austin Grossman was the writer. Some other notable project members were Tim Stellmach, a designer; Robb Waters, the concept artist; and Origin employee Harvey Smith, who was among the Quality Assurance team. Boston alt-rock band ‘Tribe’ members Greg LoPiccolo and Terri & Eric Brosius (spouses) were brought on for audio work. However, it seems that fate was not on Looking Glass’s side as id Software’s follow-up to Wolfenstein 3D, DOOM, released in 1993 and quickly became a pop-culture juggernaut. As the term “First-Person Shooter” was not commonplace yet, for the next few years every other FPS was simply described as a ‘DOOM clone’, perfectly encapsulating how monumental DOOM’s significance in gaming culture was in the 1990's. System Shock released in 1994 around the same time as DOOM 2: Hell on Earth, and was dramatically overshadowed by id’s mega-hit series. In the end, System Shock only sold enough to break even, though it received some praise from critics such as PC Gamer. DESIGN In the year 2072, you, The Hacker, find yourself on board the powerful TriOptimum Corporation’s Citadel Station, a private space station orbiting Saturn. You were caught hacking into TriOptimum’s secure network and were brought to Citadel, where a slimy executive named Edward Diego offered to make a deal. If you hacked into the station’s A.I. construct known as SHODAN and disabled its ethical constraints, Diego would drop your charges and even give you a state-of-the-art cybernetic neural implant. When you awake from the 6-month healing coma after your implant surgery you soon learn that as you slept SHODAN has wreaked havoc upon Citadel Station. The ruthless A.I. has made the maintenance robots murderous and augmented many of the facility’s inhabitants into nightmarish cyborg soldiers, and is hunting down the few remaining humans who are in hiding. Even worse, many of those on board the station have mutated into violent monsters. You explore the space station’s various decks while fighting SHODAN’s minions as you collect keycards, weapons, and character abilities, as well as solving hacking puzzles and occasionally partaking in a Cyberspace mini-game, all in effort to stop the A.I.’s nefarious plans. The original System Shock is often referred to as an Action RPG despite the game lacking any traditional RPG mechanics (those would come later); instead simply the rich immersion and player freedom drives this sentiment. The game also can be described as a Survival Horror title as the player is alone in their struggle of cautiously fighting past all sorts of monstrosities with their only respite being a few precious moments of safety when inside an elevator. And, being an First Person Shooter (though a slow paced one) that includes puzzles and a narrative, System Shock is technically an Action-Adventure title. Ultimately, like many of Looking Glass Studios’ games, System Shock defied genre norms and is best described as an ‘Immersive Sim’. The philosophy of the immersive sim is to offer player agency and use simulation-like game worlds to induce deep player immersion and foster emergent gameplay. Player Freedom One of the core tenets of System Shock’s design is giving the player as much agency as possible. This is displayed before the player even enters the 3D game world, as System Shock offers one of the most customizable difficulty menus ever seen: Your chosen name is your in-game name, though you are rarely referred to by it. Want a DOOM clone? Well, it certainly won’t be DOOM, but you can turn off all puzzles and mission objectives. Want a Puzzle game? Setting combat to ‘0’ means enemies don’t attack you until/unless you attack them. Turn puzzles off too and for a ‘Walking Simulator’ feel. Want an excruciatingly stressful experience? Max everything out, including ‘Mission’, which adds a 7 hour time limit to beat the game (the game normally takes around 12 hours to complete). Beyond that, System Shock offered an incredible amount of control over player movement, especially for a game from 1994: jump, crouch, crawl, walk, sprint, and controlled leaning accompany the ability to look up and down. You can freely load and unload weapons. This freedom also extends to combat: unlike near every other FPS from the 90’s, picking up new weapons is a choice — and there are over a dozen weapons in the game, but the Hacker can hold just seven at a time. Among these are normal firearms, energy-based guns, and a couple of melee weapons. Each of the standard firearms offer two ammo types to use, and the energy guns have a slider to adjust power settings. A few weapons even offer the chance to use a nonlethal approach, with tranquilizer darts and rubber slugs. Furthermore, the game world is not especially linear; each deck is a maze of hallways and rooms, but they are not arranged in a linear fashion. For the most part you can explore the station freely, with limiting factors being the need to acquire access cards, key codes, and character equipment, and completing objectives. And many of those weapons and items are not only available in a single instance, so there is not necessarily a ‘correct’ path to take as you can usually find what you need in more than one specific spot. Believable World Design The simulation-tier level of player control was complemented by the game world itself being akin to a simulation. The level design of Citadel Station’s various decks was intended to convey the feeling of it being a real space. Granted, sometimes the architecture veers into the nonsensical but the world is largely realistic, with offices, storage closets, transport hangers, and maintenance crawlspaces. Walls are often lined with piping or electronics, to maximize space efficiency. System Shock complemented the mostly believable level design with advanced engine features for a game of its time, including sloped floors, elevators, ladders, variable gravity and a full-blown physics system. Weapons and other items are not automatically picked up by simply walking over them; the player has to manually pick them up and place them in their inventory. Similarly, throwing grenade-type items is not bound to a hotkey but rather requires manually selecting them in the inventory before throwing. Naturally, the game does not pause while you sort through your inventory or data reader. Even more notably, in System Shock weapons actually use magazines, rather than feeding endlessly from a pool of ammo. And, again, reloading weapons is not done via a hotkey, but instead through manually reaching down and clicking an icon in the player’s HUD. Many guns also have substantial recoil due to the aforementioned physics engine. All these factors combine to support more methodical, slower-paced fighting that is the complete antithesis to DOOM. Subdued Storytelling Less bombastic action is far from the only way System Shock diverged from DOOM’s design, regardless of the ‘DOOM clone’ label it received for releasing after the blockbuster title. While id famously shunned having a narrative with DOOM, with System Shock Looking Glass wanted to find a happy medium. They knew that the long texts of RPGs of the time were intrusive and conversations with NPCs were clumsy, so they opted to deliver the narrative through more passive techniques instead. Aside from short beginning and ending cutscenes to book-end the narrative, the story is told entirely in-game, from the First-Person. As you explore you find audio logs left by the station’s late inhabitants, which flesh out the questions of what Edward Diego was up to and how SHODAN seized control. The game also uses environmental clutter to suggest what events may have transpired throughout the station. The result is System Shock’s narrative taking somewhat of a backseat, though what is there is actually rather strong — especially the SHODAN character. SHODAN is brutal, methodical, and relentless. Throughout the game, she mocks you and dismisses your efforts as pathetic and nonthreatening. Reinforcing this attitude, she haunts you, her face appearing in displays throughout the station, watching your every move. Voice-acted by Terri Brosius and complemented by superb audio engineering, SHODAN is one of the greatest villains the gaming industry has ever seen, bar none. Downfalls With an unforgettable antagonist, a highly advanced game engine, innovative storytelling techniques, and more, it may seem strange that System Shock 1 is not well-known in the gaming community. The ubiquity of DOOM was not the only obstacle the game faced — and that alone was quite a hurdle to overcome. Making matters worse, Origin Systems regrettably pressured Looking Glass to release a floppy disk edition of the game initially. The floppy disk version of System Shock had no voice acting included due to technical limitations, making for a woefully inferior experience. Unfortunately, that experience was what early previews conveyed to the gaming community. The floppy disk release was not the only technical problem the game suffered from at launch. Like Ultima Underworld, System Shock was a bit too technologically advanced for its own good and required beefier hardware than DOOM to run well, further limiting the game’s audience. As with Underworld, to improve performance Looking Glass made the HUD quite large to reduce the load of rendering the game world. On the same note, System Shock’s Achilles’ heel was its cluttered, unorthodox interface, which was largely a continuation of what was in Ultima Underworld. The realism, world interactivity and the extensive movement controls came at a cost. The game uses a plethora of keybindings, even reminiscent of flight simulators. Coincidentally, System Shock’s physics engine was actually borrowed from Looking Glass’s concurrently made flight sim Flight Unlimited. And as System Shock did not have mouse-look, the awkwardness is even more severe, with aiming completely detached from head movement. To move your view you click and drag in the center of the screen to clumsily pan around. Pretty much everything seen in the HUD is interactive. Keybindings were so quickly swallowed up by movement controls and player equipment that inventory management is done with the mouse. The unusual interface actually results in a sense of tension and helplessness that enhances the horror aspect, but it still comes off as intimidating enough to keep many people from even attempting to play. Cyberspace is another weakness. At special terminals scattered throughout the station you use your neural implant to enter a 3D depiction of cyberspace to battle ‘security protocols’, interact with virtual door locks, and grab data files, with limited time before SHODAN finds the intrusion and kicks you out. Though the concept is creative and the way Looking Glass integrated it into the overall game helps break up monotony, sadly, the execution is far from perfect. The wireframe space is hard to navigate, the controls feel unwieldy with sluggish momentum yet pinpoint turning, and the combat in cyberspace is oddly not accompanied by sound effects. The mini-game is not awful but even the developers themselves wish they had worked more on it. What this all adds up to is an imperfect game, but far from a bad one. Many of its weakness were only relevant when the game was new: the inferior floppy disk release can be ignored, the then-steep hardware requirements are a joke now, and the ‘DOOM clone’ furor has long since died down. On the whole, System Shock (1994) is a remarkably excellent game bogged down by just a few idiosyncrasies. There is a reason that Warren Spector posits that “if you updated the graphics, sound, and UI on System Shock you’d have something that competes directly with any game on the market today”. LEGACY System Shock followed in Ultima Underworld’s footsteps, improving upon the Immersive Sim concept and helping to expand the foundation of the FPS genre. While DOOM’s massive success meant that id Software’s fast-paced design would be the trend of the times, System Shock laid the groundwork for other, slower approaches, showing that the genre was not limited to just the frantic, adrenaline-pumping affairs DOOM provided. Realms of the Haunting has an awkward interface similar to System Shock, and it too blends FPS, Adventure, and Survival Horror. Titles such as Bungie’s Marathon in 1994, CyberMage: Darklight Awakening in 1995, Realms of the Haunting and Strife in 1996, and Parkan: The Imperial Chronicles in 1997 echoed System Shock’s innovations and helped further expand the adolescent FPS genre. Strife is regarded by some as a sort of prototype of Deus Ex, offering neutral NPCs, story choices, and stealth. And in 1998 Valve’s Half-Life brought some of those designs to the attention of the industry as it received enormous praise akin to the glory days of DOOM. In an interview prior to the release of Half-Life 2, Valve Software noted that many team members were fans of System Shock and Ultima Underworld. Gordon Freeman’s iconic starting weapon, a simple crowbar, is reminiscent of the Hacker’s starting weapon in System Shock: a lead pipe. Like System Shock, Half-Life offered a seamless First-Person experience in a (mostly) believable world with notes of survival horror and a stronger sense of narrative than the likes of DOOM or Quake. Like the Hacker, Gordon Freeman has a special advantage in the form of his H.E.V. suit, and both characters find themselves fighting through a facility ravaged by technology gone wrong. And, while not as talkative as SHODAN, the mysterious ‘G-Man’ stalks the player too, elegantly adding more to the atmosphere and narrative. However, with their seminal title Valve otherwise took a more streamlined approach, trading away System Shock’s player freedom to create an accessible, sleek thrill-ride. In 1997, after the release of Looking Glass’s ‘First-Person Sneaker’ Thief: The Dark Project, three Looking Glass employees left to form their own studio. The three, Ken Levine, Jonathan Chey, and Robert Fermier and their studio Irrational Games then worked with Looking Glass to make a new game. Initially the project was titled “Junction Point”, intending to continue the cyberpunk action of System Shock while emphasizing the more overtly recognizable role-playing nature of Ultima Underworld. The game arrived in 1999, as System Shock 2. While it used the same storytelling techniques and a similar gameplay loop to the original, it had even more realistic world design, a more consistent horror atmosphere, but also — most importantly — introduced character skill points. Though it used a more orthodox control scheme, the HUD & interface remained quite complex. System Shock 2 was one of the first true FPS-RPGs, offering three different character classes and having a full-fledged skill point system. This resulted in the two System Shock games feeling somewhat different despite the many parallels otherwise. The original is simple and straightforward (interface aside) while in SS2 choosing which skills to upgrade can profoundly affect the experience as the game progresses. SS2 also has weapon degradation, an ever-controversial game mechanic. Those who enjoy one System Shock entry might not love the other and, conversely, not liking one game is not necessarily reason to dismiss the other. Despite System Shock 2 receiving far more critical acclaim than the original, it sold horrendously and contributed to Looking Glass Studios’ closure in 2000. According to Paul Neurath, part of the reasoning for the weak sales was that EA was hesitant to commit to significant marketing for any FPS in the wake of the Columbine massacre. The result was System Shock 2 releasing quietly, and after the lack of initial success EA quickly gave up on the title. In the years since however, while System Shock 1 was mostly forgotten to time System Shock 2 has become one of the most beloved cult classic PC games around, standing shoulder-to-shoulder with titles like Planescape: Torment and Grim Fandango. Warren Spector went on to head the Austin branch of Ion Storm at the invitation of John Romero, and when Looking Glass Studios went bankrupt Spector helped many former coworkers migrate there as well. Among those was Harvey Smith, who would serve as a key designer for their next project. While the main branch of Ion Storm suffered much controversy revolving around Romero’s Daikatana, the Austin branch avoided that commotion and Spector led the creation of his “dream project”, Deus Ex, which released in 2001. I wanted to build on the foundation laid by the Looking Glass guys in games like Underworld and System Shock…— Warren Spector regarding Deus Ex PC Gaming Critic John ‘TotalBiscuit’ Bain considers Deus Ex “the epitome of PC gaming” and “thoroughly, without question […] the best game ever made”. PC Gamer ranked it as #1 in the 2010 edition of their Top 100 PC Games of All Time list, PC Zone named it the “Best PC Game Ever”, and Gamasutra placed Deus Ex in the #2 spot of their list of the ‘Top Games of the 2000's’. The game is so revered that there is a saying that “Every time you mention it, SOMEONE will reinstall it.” Irrational Games would later create the heavily SS2-inspired game, BioShock, which launched on both PC and consoles in 2007. Aside from a change of setting it has innumerable design similarities to System Shock 2. Irrational even hired Robb Waters to make concept art. “This 2007 title is the most haunting, atmospheric experience in gaming history. With its crumbling underwater utopia and unforgettable characters, it provides all who enter with nothing less than rapture.” — G4 As it was the first ‘Shock’ game to release on consoles, noticeably streamlined compared to the previous games, and had a healthy marketing push, it was a massive critical and commercial success. In 2012, G4TV placed BioShock as #3 on their list of the ‘Top 100 Games of All Time’. PC Gamer UK, September 2006 In 2006, rumors correctly claimed that EA had set their ‘EA Redwood Shores’ dev team to work on System Shock 3. In 2008 the studio (which had since re-branded as ‘Visceral Games’) released the game under the title “Dead Space”, as a new IP. The name change was for a few reasons: Visceral really wanted to make a new IP rather than continue existing franchises and they also were concerned about taking over the reigns in Looking Glass’ absence. The tipping point though had been the release of Resident Evil 4. Ultimately, the final design of the project was a fusion of System Shock 2 and RE4, blending the latter’s 3rd Person Action Horror combat and perspective and the story and gameplay arc of the former. The hybrid design received serious acclaim, and a sizable portion of the gaming community view Dead Space as one of the greatest horror games ever. Another reason for the move to a new IP was that EA simply could not actually make a System Shock game: the deal that they had made with Looking Glass back when System Shock was published was that EA (who served as distributor for the game, and publisher for the sequel) would control the trademark but Looking Glass would retain the development rights for the series. When the studio closed, those development rights fell into the hands of an insurance agency. For whatever reason, EA never acquired those rights and by the time Dead Space released EA had abandoned the System Shock trademark entirely. Years later, in 2012, a fledgling indie company known as Night Dive Studios managed to acquire both halves of the System Shock IP. In 2013 they digitally re-released System Shock 2 to great fanfare, and in 2015 they followed it with the release of an “Enhanced Edition” of System Shock 1 (which was largely based on an abandonware community project called ‘System Shock Portable’). Aside from improving support for modern hardware and modern display resolutions, the Enhanced Edition includes the invaluable addition of toggle-able mouse-look. With it, character movement and combat are vastly smoother and more comfortable, though many of the game’s mechanics require momentarily toggling mouse-look back off such as to reload weapons, use equipment, or browse the data reader. Overall, the feature greatly improves the game’s primary weakness, resulting in an experience that is quirky but not unpleasant. After the success of both re-releases, Night Dive decided to proceed with the development of a total modern remake of the original game. It will also bring the System Shock IP to consoles for the first time ever. The official name for the remake will be simply System Shock (2018), though Night Dive initially referred to the project as ‘System Shock Remastered’. “A modern take on System Shock, a faithful reboot; it’s not Citadel Station as it was, but as you remember it. Many improvements, overhauls and changes are being implemented to capture the spirit of what the original game was trying to convey, and bring it to contemporary gamers.”— Night Dive Studios’ System Shock Kickstarter page Furthermore, Night Dive met with another indie studio, OtherSide Entertainment — Paul Neurath’s new venture, where several other Looking Glass veterans also now reside. In late 2015, around the same time Night Dive announced the System Shock remake, OtherSide announced System Shock 3, helmed by Warren Spector. Doug Church, who currently works at Valve, will be a consultant, as will Tim Stellmach. The game is planned to pick up the story where System Shock 2 left off, while also bringing back characters from the first game. Meanwhile, the System Shock series’ influence has been evident in quite a few other games new and old, examples including DOOM 3 (2004), Portal (2007) — GLaDOS, Aperture Laboratories’ corrupted female A.I. who runs their ‘Enrichment Center’ facility, certainly seems to take significant inspiration from SHODAN, albeit with a snarkier slant — , Alien: Isolation (2014), SOMA (2015), and P.A.M.E.L.A. (2017). Prey (2017) is also among System Shock’s progeny, as the developer, Arkane Studios, have pitched the project as “the spiritual successor to System Shock 3” and leaked design documents describe System Shock 2’s design as a “base layer” on which Prey would be built, and even conceptualize the game as being set “a month before the events in System Shock 1”. Conclusion System Shock 2’s fame has grown over the past decade but overall only a minority of the gaming community are aware of it. Worse though, even many of those who know of or have played System Shock 2 still don’t know anything about the original game, and that is quite simply an injustice. While the mainstream consensus suggests that System Shock aged poorly and is now too “outdated” to be enjoyable or worth playing, this narrative should not deter anyone interested in giving the game a try. Those who have a healthy sense of patience may find the first System Shock (in it’s Enhanced form) holds up as a brilliant, intensely immersive blend of Sci-Fi, survival horror, action, and adventure. Recommended reading/viewing, and the sources of much of my information: This superb video, which sparked my interest in the original System Shock in the first place, as I’d bet is true for many others who watched it. This guy actually took the time to try the Enhanced Edition before the remake demo, and his time with it is quite representative of most people’s first impression with System Shock these days. Meant to be watched after having played it. Warren Spector, Paul Neurath, and Tim Stellmach revisit System Shock with Night Dive Studios. Other original devs revisit System Shock. Trivia: The code “451” was the first key code in the original System Shock, and was brought back in the sequel. Since then it has been included as an Easter Egg (often as “0451”) in many other games, such as Deus Ex, the BioShock series, Dishonored, Gone Home, Fallout 4, and Firewatch. 451 was the real-world passcode to Looking Glass Studios’ office building, though many have speculated it was also intended as a reference to the famous Ray Bradbury novel ‘Fahrenheit 451’. As Super Bunnyhop noted in his video, System Shock seems to match the ‘Metroidvania’ format rather closely. Following that line of thinking, perhaps in some respects the most comparable game to System Shock (1994) is Metroid: Prime? Thanks for reading! ", "child": "1294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_11294_1"}