{"name": "1296", "parent": "", "title": "#BasedStickMan", "sentences": [{"fbee": "#BasedStickMan"}, {"b01c": "Viral Optics"}, {"7343": "The other day a masked hockey-stick-wielding Trump supporter beat up Antifa protesters at Berkeley. He immediately became an internet sensation. Meme-makers praised him as a hero of the Alt-Right. Supporters raised money for his legal defense. And #BasedStickMan trended on Twitter."}, {"78f7": "Why did #BasedStickMan go viral? What endeared BSM to the public? After all, he isn’t the first Trumpster to clobber someone on film…"}, {"887a": "Here’s why: his outfit. As I’ve pointed out in previous posts, the mere exposure to an idea can influence the way we think about the subject. It’s why we take people in uniform more seriously (uniforms usually come with actual authority). And why we perceive grey-haired men as more “distinguished” (they’re usually older and more experienced)."}, {"59fa": "In the case of Stick-Man, his mix-and-match outfit reminds us viscerally of lovable pop-culture underdogs. Think pre-Spider-Man Peter Parker. Mystery Men. Kick-Ass. The list goes on…"}, {"8e17": "The flag on his “shield” also contributes to our instinctive impression of him as a benevolent vigilante. Doesn’t it remind you of a shield-bearing superhero whose had incredible exposure over the past few years?"}, {"d323": "His red goggles and undershirt also scream super hero."}, {"7f27": "Every movie/tv show/comic has taught us that the only people who wear all-black are, well, the goons."}, {"c960": "Want more? Follow & 💚"}], "content": "#BasedStickMan Viral Optics The other day a masked hockey-stick-wielding Trump supporter beat up Antifa protesters at Berkeley. He immediately became an internet sensation. Meme-makers praised him as a hero of the Alt-Right. Supporters raised money for his legal defense. And #BasedStickMan trended on Twitter. Why did #BasedStickMan go viral? What endeared BSM to the public? After all, he isn’t the first Trumpster to clobber someone on film… Here’s why: his outfit. As I’ve pointed out in previous posts, the mere exposure to an idea can influence the way we think about the subject. It’s why we take people in uniform more seriously (uniforms usually come with actual authority). And why we perceive grey-haired men as more “distinguished” (they’re usually older and more experienced). In the case of Stick-Man, his mix-and-match outfit reminds us viscerally of lovable pop-culture underdogs. Think pre-Spider-Man Peter Parker. Mystery Men. Kick-Ass. The list goes on… The flag on his “shield” also contributes to our instinctive impression of him as a benevolent vigilante. Doesn’t it remind you of a shield-bearing superhero whose had incredible exposure over the past few years? His red goggles and undershirt also scream super hero. Every movie/tv show/comic has taught us that the only people who wear all-black are, well, the goons. Want more? Follow & 💚 ", "child": "1296_1\t1296_2\t1296_31296_1\t1296_2\t1296_3"}