{"name": "1298", "parent": "", "title": "Virtual Family Fun", "sentences": [{"8592": "Virtual Family Fun"}, {"5b57": "Steve (my daughter — not her real name) standing in front of our Barbie Dream House."}, {"2b80": "“Yes!” I shouted. “Finally!”"}, {"c66c": "“What? What is it?” my husband and daughter asked."}, {"33ab": "“I found an abandoned mine!”"}, {"3448": "They both crowded around my phone to see my Minecraft find. My husband and I have spent the last few nights halfheartedly listening to the TV as we donned iron armor and tentatively explored the pixelated mine. Zombies, Skeleton Archers, and Spiders have attempted to ruin our ore gathering, but we battled them together and dumped buckets of water on each other’s heads when we accidentally fell in lava."}, {"e7b3": "After dinner every night, my daughter and I play in a creative world we made together. We build houses for the million villagers she spawns, create gardens, spell out our names with blocks, and tame ocelots. Sometimes we even watch YouTube tutorials and build fancy houses."}, {"25cd": "I like that we found a game we can all play. Even if it is a little nerdy."}], "content": "Virtual Family Fun Steve (my daughter — not her real name) standing in front of our Barbie Dream House. “Yes!” I shouted. “Finally!” “What? What is it?” my husband and daughter asked. “I found an abandoned mine!” They both crowded around my phone to see my Minecraft find. My husband and I have spent the last few nights halfheartedly listening to the TV as we donned iron armor and tentatively explored the pixelated mine. Zombies, Skeleton Archers, and Spiders have attempted to ruin our ore gathering, but we battled them together and dumped buckets of water on each other’s heads when we accidentally fell in lava. After dinner every night, my daughter and I play in a creative world we made together. We build houses for the million villagers she spawns, create gardens, spell out our names with blocks, and tame ocelots. Sometimes we even watch YouTube tutorials and build fancy houses. I like that we found a game we can all play. Even if it is a little nerdy. ", "child": "1298_1"}