{"name": "1301", "parent": "", "title": "Diário do Uncharted 4 — parte 4: quando seu marido volta para casa?", "sentences": [{"13cb": "Diário do Uncharted 4 — parte 4: quando seu marido volta para casa?"}, {"790c": "Tal qual o amante que não quer que a noite acabe e emulando a única frase que Sam Drake sabe em português, lá fomos nós sabendo que o fim de Uncharted 4 estava próximo. E, como sempre, ele me enganou, empurrando o final para depois de mais algumas horinhas de jogo."}, {"188f": "Mas antes: 1) texto cheio de spoilers e 2) leia as outras partes (também com spoilers):"}, {"7eec": "Vamos lá."}, {"fa85": "Nessas horinhas a mais, teve um monte de tiroteio, um monte de escalada, uma umidade absurda em New Devon, cenários muito lindos que ninguém vai ficar sabendo que existem porque a Elena não levou a câmera dela — essa foi uma questão que me pegou sem querer em vários momentos, fiquei pensando “imagina se fosse no GTA como daria para fazer uma selfie maneira aqui”, virei um monstro."}, {"a0ec": "Falando na Elena, ainda que eu ache ela meio chata, quando ela vira a parceira da vez do Nathan eu me sinto até mal em achar isso. A química dos dois é muito legal, ela é bem badass e o próprio Nathan fala isso em alguns momentos (“vai, deixa uma mulher dessa brava” ou algo assim). Tem dois momentos específicos que são bem marcantes, um quando eles estão num banquete de piratas mortos, bem romântico, e outro quando ela finge que morreu só para dar um susto nele, mas a gente também assusta e talvez eu tenha xingado o game em voz alta nessa hora mas depois também gargalhei em voz alta, então a amizade continua a mesma."}, {"395a": "Também queria fazer uma menção honrosa para o retorno do Sully, sempre com a RPG na hora certa, e para o quanto o Sam é um irmão mais velho chato — o personagem é legal mas meu deus se meu irmão fosse tão manipulador e implicante assim eu acho que, bom, eu também iria atrás dele porque é isso que família faz. Mas que dá raiva, dá."}, {"7264": "O ponto alto é, sem dúvida, o epílogo do final. Você joga Crash Bandicoot de novo e, no meu caso, não bate de novo o recorde da Elena. Mas, quando acabam as vidas, quem está jogando é uma menina loirinha, a cara dela: é a filha do Nathan e da Elena! E eles têm uma casa muitíssimo maneira de frente para o mar! E um cachorro! E viajam o mundo! Realmente, Nathan Drake conseguiu ter tudo no final."}, {"2da1": "E o título, A Thief’s End, que me fez pensar em alguns momentos se significaria algo além do fim das aventuras dele — talvez ele morreria? Talvez o Sam morreria? Talvez alguém morreria? — significa apenas isso. É bem improvável que tenhamos mais um Uncharted em um futuro tão próximo, mais ainda se quiser continuar a mesma história (não digo impossível porque já estamos aí com o 3o Homem-Aranha no cinema em 15 anos). Também não acho que teria tanta graça insistir no DNA com As Aventuras de Samuel Drake ou As Aventuras de Cassie Drake, a.k.a. Tomb Raider."}, {"b1d8": "Então, talvez seja o caso de se conformar e lembrar que é melhor dar um belíssimo final para uma franquia a virar Assassin’s Creed."}, {"3050": "Quando o jogo terminou, eu, me recusando a abandonar o barco, fui dar aquela fuçada nos extras e vi algumas das artes conceituais. Vale fazer o mesmo: aparecem alguns visuais que poderiam ter sido e alguns caminhos que o jogo não seguiu, como um passeio de bote em vez do jipe roubado da Shoreline e a batalha final acontecendo na prancha do navio (não sei como chama, peguei a referência do Tchakabum mesmo) e não no porão, o que seria um enorme clichê mas também seria bem legal."}, {"ac06": "É isso, acabou, não vou me recuperar tão rapidamente (#dramas) mas achei um bom final. E, se for muito difícil, também tem a coleção remasterizada para PS4 para matar a saudade. ❤"}, {"8863": "Bônus: tô gastando muito tempo tentando embedar esse vídeo, então fica o link e a recomendação “assista que é foda”."}, {"46ba": "Quer mais diários de games? To pensando em fazer de Fallout 4 ou de The Division. Conta pra mim, aqui nos comentários ou no Twitter, qual você acha mais maneiro :)"}, {"9687": "Obs: The Division tô instalando agora, no Fallout já matei um casal porque não queria fazer o que eles me mandaram, então fica aí a prévia."}], "content": "Diário do Uncharted 4 — parte 4: quando seu marido volta para casa? Tal qual o amante que não quer que a noite acabe e emulando a única frase que Sam Drake sabe em português, lá fomos nós sabendo que o fim de Uncharted 4 estava próximo. E, como sempre, ele me enganou, empurrando o final para depois de mais algumas horinhas de jogo. Mas antes: 1) texto cheio de spoilers e 2) leia as outras partes (também com spoilers): Vamos lá. Nessas horinhas a mais, teve um monte de tiroteio, um monte de escalada, uma umidade absurda em New Devon, cenários muito lindos que ninguém vai ficar sabendo que existem porque a Elena não levou a câmera dela — essa foi uma questão que me pegou sem querer em vários momentos, fiquei pensando “imagina se fosse no GTA como daria para fazer uma selfie maneira aqui”, virei um monstro. Falando na Elena, ainda que eu ache ela meio chata, quando ela vira a parceira da vez do Nathan eu me sinto até mal em achar isso. A química dos dois é muito legal, ela é bem badass e o próprio Nathan fala isso em alguns momentos (“vai, deixa uma mulher dessa brava” ou algo assim). Tem dois momentos específicos que são bem marcantes, um quando eles estão num banquete de piratas mortos, bem romântico, e outro quando ela finge que morreu só para dar um susto nele, mas a gente também assusta e talvez eu tenha xingado o game em voz alta nessa hora mas depois também gargalhei em voz alta, então a amizade continua a mesma. Também queria fazer uma menção honrosa para o retorno do Sully, sempre com a RPG na hora certa, e para o quanto o Sam é um irmão mais velho chato — o personagem é legal mas meu deus se meu irmão fosse tão manipulador e implicante assim eu acho que, bom, eu também iria atrás dele porque é isso que família faz. Mas que dá raiva, dá. O ponto alto é, sem dúvida, o epílogo do final. Você joga Crash Bandicoot de novo e, no meu caso, não bate de novo o recorde da Elena. Mas, quando acabam as vidas, quem está jogando é uma menina loirinha, a cara dela: é a filha do Nathan e da Elena! E eles têm uma casa muitíssimo maneira de frente para o mar! E um cachorro! E viajam o mundo! Realmente, Nathan Drake conseguiu ter tudo no final. E o título, A Thief’s End, que me fez pensar em alguns momentos se significaria algo além do fim das aventuras dele — talvez ele morreria? Talvez o Sam morreria? Talvez alguém morreria? — significa apenas isso. É bem improvável que tenhamos mais um Uncharted em um futuro tão próximo, mais ainda se quiser continuar a mesma história (não digo impossível porque já estamos aí com o 3o Homem-Aranha no cinema em 15 anos). Também não acho que teria tanta graça insistir no DNA com As Aventuras de Samuel Drake ou As Aventuras de Cassie Drake, a.k.a. Tomb Raider. Então, talvez seja o caso de se conformar e lembrar que é melhor dar um belíssimo final para uma franquia a virar Assassin’s Creed. Quando o jogo terminou, eu, me recusando a abandonar o barco, fui dar aquela fuçada nos extras e vi algumas das artes conceituais. Vale fazer o mesmo: aparecem alguns visuais que poderiam ter sido e alguns caminhos que o jogo não seguiu, como um passeio de bote em vez do jipe roubado da Shoreline e a batalha final acontecendo na prancha do navio (não sei como chama, peguei a referência do Tchakabum mesmo) e não no porão, o que seria um enorme clichê mas também seria bem legal. É isso, acabou, não vou me recuperar tão rapidamente (#dramas) mas achei um bom final. E, se for muito difícil, também tem a coleção remasterizada para PS4 para matar a saudade. ❤ Bônus: tô gastando muito tempo tentando embedar esse vídeo, então fica o link e a recomendação “assista que é foda”. Quer mais diários de games? To pensando em fazer de Fallout 4 ou de The Division. Conta pra mim, aqui nos comentários ou no Twitter, qual você acha mais maneiro :) Obs: The Division tô instalando agora, no Fallout já matei um casal porque não queria fazer o que eles me mandaram, então fica aí a prévia. ", "child": "1301_1\t1301_2\t1301_31301_1\t1301_2\t1301_31301_1\t1301_2\t1301_3"}