{"name": "1317", "parent": "", "title": "E3 2016: The Hottest of Takes", "sentences": [{"0161": "E3 2016: The Hottest of Takes"}, {"6de7": "The Electronic Entertainment Expo is upon us once again, now in it’s twenty-first rendition. As with every other year, we the fans are treated to a week of nonstop gaming-related news, announcements, sneak peeks, delays, and a mountain of promises. While browsing through and writing up about every single game in existence at this show is certainly a possibility, I figured I’d go a much easier route and instead highlight and discuss some of my favorite things shown at this year’s show."}, {"6bb7": "God of War (PS4)"}, {"04be": "Grizzled ol’ Kratos, the man with a Mount Olympus-sized chip on his shoulder, has left his lavish Greek scenery and leapt into the much colder, yet just as mystical, realm of Norse mythology. We don’t get much of a glimpse of the sure-to-be-coming gods of Valhalla or a wild scale-setting cinematic set-piece of our Spartan scaling the branches of Yggdrasil, with the team at Sony Santa Monica instead opting for moments of quiet tranquility and the occasional bit of subtle story-telling in a series that has been mostly known for being huge, bombastic, and almost comically gory."}, {"f507": "We get a look at a new behind-the-shoulder camera that lends itself to what looks like a more nuanced combat system as opposed to the tornadoes of metal and flesh that used to slice through half of the Greek population in prior games. Constant experience point tickers and generally more open areas lead me to believe we’re looking at something more akin to an open world adventure as opposed to our operatic corridors and hallways of games prior."}, {"2583": "But the true focus here is instead on Kratos actin’ either as a father or father figure to a young boy we’re introduced to almost immediately in the gameplay video. Kratos won’t be winning any “Dad of the Year” awards in this game either, treating this new as-of-now unnamed kid quite harshly and seemingly intent on setting this child down a destructive path all too similar to Kratos’ own."}, {"5edd": "It’s interesting to see a character that was the physical manifestation and embodiment of “macho” potentially becoming something far more interesting: a flawed human being. Plucking this god from the heavens and bringing him down to Earth might be one of the smartest things the team at Sony Santa Monica could’ve done with this franchise and character."}, {"e2ba": "We Happy Few (XB1, PC)"}, {"7a3c": "We Happy Few succeeds, in a single trailer, at doing what a majority of games struggle or aspire to within the entirety of their experiences: creating a unique world. We were treated to a gameplay demo where bright and bubbly 70s-influenced decorations litter each room and a general fun and joyful vibe to the visuals is presented throughout. Just beneath the surface though, you can sense something way more sinister going on in this dystopian world."}, {"fe0b": "A drug known only as “Joy” seems to permeate every little part of this world, making it’s inhabitants seem blissfully unaware of their grim surroundings or the hardships and rough pasts anyone may be lugging around with them. The way to oppress that sadness is by instead living like glass-eyed husks that find happiness in any diversions that seem to involve or invoke violence."}, {"9c66": "Those rose-tinted glasses are quickly ripped off the main character when he decides to forgo his daily Joy medication and instead starts to peer behind the curtain at this world’s true ugliness. Just as the protagonist begins to truly learn about the world around him, we do too, and I couldn’t be more excited to see what lies beyond."}, {"4012": "Titanfall 2 (PS4, XB1, PC)"}, {"c924": "How does someone improve their first-person shooter meets mech combat games? Two words: grapple hook."}, {"2aaa": "Plenty of issues were levied at the original Titanfall when it came out two years ago, but everyone seemed to be in universal agreement that the movement and traversal in those games was an absolute blast and definite highlight of that first game. Booster-assisted jumps, wall-running, and clambering all helped to keep mobility high and constant in that game and the grappling hook just serves as another tool to add to that arsenal. The grapple hook can quickly take you to rooftops to get a head-up on enemies or even get you on eye-level with the clambering mechs that proliferate the area. It also serves as a combative tool that you can use to send yourself flying into an airborne opponent to deliver a killing blow."}, {"65cc": "You then look at all the other ways that Respawn is addressing concerns with the initial game: inclusion of a single-player campaign mode, ensuring way more content that is there on day one, or even improving the progression and unlock system so the carrot-on-the-stick stays intact for the duration of your time with the game, and it feels like this sequel is already on its’ way to fulfill the promise and match the potential that the first game set out to achieve."}, {"9375": "The Legend of Zelda: Breath of the Wild (WiiU, NX)"}, {"b19c": "Describing a new Zelda game as a Studio Ghibli film turned game and filtered through the tone and general vibe of a Team Ico title would be enough to put me into a coma and give people a general idea of what Breath of the Wild is like, but it’d also just be a surface-level look at this brand new entry into the historied Legend of Zelda franchise."}, {"8fff": "Nintendo has shifted the focus of the series back onto pure exploration, which some would argue hasn’t been around since the first game released in 1986. This is a huge world that’s entirely open for you to explore, where strong enemies could decimate you in a single blow or you could stumble upon enemy encampments, mysterious old men, or puzzle-filled caves. Link can climb, jump, and glide his way around this new version of Hyrule to his heart’s extent… as long as his heart doesn’t ask for more than his stamina bar does."}, {"9c93": "The beauty is in the details too. If you start venturing into colder territory, you either need to come equipped with warmer clothing, a torch, or a hearty heat-providing soup to be able to survive in those harsh conditions. It’s similar to Zelda games in presenting you with an obstacle, but it’s different in giving you tons of different ways to overcome these trials."}, {"0726": "This new game is filled to the brim with ideas that feel like they would’ve been enough to carry a Zelda game on their own, but instead they’re serving as the building blocks for a radical change via this new entry in the series. The NX, and this game, can not get here soon enough."}], "content": "E3 2016: The Hottest of Takes The Electronic Entertainment Expo is upon us once again, now in it’s twenty-first rendition. As with every other year, we the fans are treated to a week of nonstop gaming-related news, announcements, sneak peeks, delays, and a mountain of promises. While browsing through and writing up about every single game in existence at this show is certainly a possibility, I figured I’d go a much easier route and instead highlight and discuss some of my favorite things shown at this year’s show. God of War (PS4) Grizzled ol’ Kratos, the man with a Mount Olympus-sized chip on his shoulder, has left his lavish Greek scenery and leapt into the much colder, yet just as mystical, realm of Norse mythology. We don’t get much of a glimpse of the sure-to-be-coming gods of Valhalla or a wild scale-setting cinematic set-piece of our Spartan scaling the branches of Yggdrasil, with the team at Sony Santa Monica instead opting for moments of quiet tranquility and the occasional bit of subtle story-telling in a series that has been mostly known for being huge, bombastic, and almost comically gory. We get a look at a new behind-the-shoulder camera that lends itself to what looks like a more nuanced combat system as opposed to the tornadoes of metal and flesh that used to slice through half of the Greek population in prior games. Constant experience point tickers and generally more open areas lead me to believe we’re looking at something more akin to an open world adventure as opposed to our operatic corridors and hallways of games prior. But the true focus here is instead on Kratos actin’ either as a father or father figure to a young boy we’re introduced to almost immediately in the gameplay video. Kratos won’t be winning any “Dad of the Year” awards in this game either, treating this new as-of-now unnamed kid quite harshly and seemingly intent on setting this child down a destructive path all too similar to Kratos’ own. It’s interesting to see a character that was the physical manifestation and embodiment of “macho” potentially becoming something far more interesting: a flawed human being. Plucking this god from the heavens and bringing him down to Earth might be one of the smartest things the team at Sony Santa Monica could’ve done with this franchise and character. We Happy Few (XB1, PC) We Happy Few succeeds, in a single trailer, at doing what a majority of games struggle or aspire to within the entirety of their experiences: creating a unique world. We were treated to a gameplay demo where bright and bubbly 70s-influenced decorations litter each room and a general fun and joyful vibe to the visuals is presented throughout. Just beneath the surface though, you can sense something way more sinister going on in this dystopian world. A drug known only as “Joy” seems to permeate every little part of this world, making it’s inhabitants seem blissfully unaware of their grim surroundings or the hardships and rough pasts anyone may be lugging around with them. The way to oppress that sadness is by instead living like glass-eyed husks that find happiness in any diversions that seem to involve or invoke violence. Those rose-tinted glasses are quickly ripped off the main character when he decides to forgo his daily Joy medication and instead starts to peer behind the curtain at this world’s true ugliness. Just as the protagonist begins to truly learn about the world around him, we do too, and I couldn’t be more excited to see what lies beyond. Titanfall 2 (PS4, XB1, PC) How does someone improve their first-person shooter meets mech combat games? Two words: grapple hook. Plenty of issues were levied at the original Titanfall when it came out two years ago, but everyone seemed to be in universal agreement that the movement and traversal in those games was an absolute blast and definite highlight of that first game. Booster-assisted jumps, wall-running, and clambering all helped to keep mobility high and constant in that game and the grappling hook just serves as another tool to add to that arsenal. The grapple hook can quickly take you to rooftops to get a head-up on enemies or even get you on eye-level with the clambering mechs that proliferate the area. It also serves as a combative tool that you can use to send yourself flying into an airborne opponent to deliver a killing blow. You then look at all the other ways that Respawn is addressing concerns with the initial game: inclusion of a single-player campaign mode, ensuring way more content that is there on day one, or even improving the progression and unlock system so the carrot-on-the-stick stays intact for the duration of your time with the game, and it feels like this sequel is already on its’ way to fulfill the promise and match the potential that the first game set out to achieve. The Legend of Zelda: Breath of the Wild (WiiU, NX) Describing a new Zelda game as a Studio Ghibli film turned game and filtered through the tone and general vibe of a Team Ico title would be enough to put me into a coma and give people a general idea of what Breath of the Wild is like, but it’d also just be a surface-level look at this brand new entry into the historied Legend of Zelda franchise. Nintendo has shifted the focus of the series back onto pure exploration, which some would argue hasn’t been around since the first game released in 1986. This is a huge world that’s entirely open for you to explore, where strong enemies could decimate you in a single blow or you could stumble upon enemy encampments, mysterious old men, or puzzle-filled caves. Link can climb, jump, and glide his way around this new version of Hyrule to his heart’s extent… as long as his heart doesn’t ask for more than his stamina bar does. The beauty is in the details too. If you start venturing into colder territory, you either need to come equipped with warmer clothing, a torch, or a hearty heat-providing soup to be able to survive in those harsh conditions. It’s similar to Zelda games in presenting you with an obstacle, but it’s different in giving you tons of different ways to overcome these trials. This new game is filled to the brim with ideas that feel like they would’ve been enough to carry a Zelda game on their own, but instead they’re serving as the building blocks for a radical change via this new entry in the series. The NX, and this game, can not get here soon enough. ", "child": "1317_1"}