{"name": "1320", "parent": "", "title": "Thoughts on The Legend of Zelda: Breath of the Wild’s User Experience", "sentences": [{"b021": "Thoughts on The Legend of Zelda: Breath of the Wild’s User Experience"}, {"d65b": "As a long time fan of Zelda games, I was excited to dive into Breath of the Wild. It is both the largest game in the series as well as the one that most successfully provides a sense of adventure. It has ushered in a new era of gameplay mechanics focused on making every moment of play engaging and meaningful."}, {"69c0": "Controls"}, {"74e9": "Early Zelda games lacked a third dimension as well as complex controls but still managed to deliver a rich gaming experience. As technology of the Nintendo gaming platforms advanced, so did the complexity of controllers. Instead of embracing that complexity, the series traditionally tried to restrain its controls to the bare minimum set of inputs as to help make the game accessible to more players."}, {"be6e": "BotW abandons this methodology of simple controls and presents a larger set of input options. It addresses the added complexity by starting the player with the simplest set of controls. Incrementally introducing advanced controls as they become necessary during the game."}, {"d3eb": "The controls require more learning than previous games. Even deep into the game you might occasionally find yourself mashing the wrong button in the heat of battle. The complexity of the inputs offer you more control and unlock possibilities not available in previous Zelda games, such as the ability to throw your weapon. The choice to add complexity is a risky one as it will undoubtedly dissuade some players from continuing forth with the game since the gameplay will take longer to master."}, {"5fa4": "One new control worth noting is the ability to quickly change between swords, shields, bows, arrows, and the rune powers of your Sheikah Slate, without accessing the full menu system. This is beneficial to the gameplay by keeping you in the action, since your weapons are prone to break in combat."}, {"6a21": "The left, up, and right arrows of the D-pad are mapped to shield, rune power, and weapon. If you press and hold one of them, the game is suspended and you can choose between other options in your inventory via a horizontal slider menu. However, if you have a bow active as your weapon, the controls are altered. The left button changes your equipped arrows and the right button changes your bow."}, {"1358": "Another novel interaction is the variety of ways in which motion control is used. From aiming your bow, to shooting a photo or solving puzzles, the motion controls take a prominent position in the gameplay."}, {"d774": "The way the motion control is introduced to the player is not always the most obvious. I talked to a friend who was not initially aware they could move the controller to aim the bow and arrow shots. They discovered it later on in gameplay by accident."}, {"a425": "I have occasionally found the motion control to be disturbing when aiming an arrow because it forces me to hold the controller steady. Most of the time when I’m playing I’m not considering the way I am holding the controller. When motion control is activated I am forced to suddenly become aware of my physical reality."}, {"6884": "In general, the stick offers me solid aiming control. I am sometimes unsure of when is a good time to use motion control versus not. The ambiguity between these two controls could be solved by allowing more obviously fine control via the motion input and retaining larger motions exclusively for the stick."}, {"bbe4": "Creating additional differentiation would help distinguish when each type of control should be used. This feature can be turned off for those who don’t wish to use it in the options."}, {"1b38": "Menu System"}, {"8e0d": "At a high level, the menu system accomplishes its goal of providing the player with easy access to a variety of information and actions. There is a top level nav which allows you to access the adventure log, inventory, and system information. Each of these areas have subcategories and individually selectable items within each subcategory."}, {"4afc": "The control used to navigate these sections are the L and R bumpers for the top level nav, the right stick for the sub-categories, and the left stick for individual selections. Overall this works well for making quick selections, but I often use the wrong stick when attempting to choose a subcategory or item."}, {"9200": "This would have been made easier to learn if the left stick was used for subcategories and the right stick for individual selection. This aligns with the physical vertical order of the controls on the Switch. The left stick is placed above the buttons on the left Joy-Con and the right stick is placed below the buttons on the right Joy-Con."}, {"ad55": "BotW was originally developed for the Wii U and it is assumed that the map and inventory controls would have lived persistently on the Wii U controller, accessible via touch. This mapping and menu system was revised to work on the Switch’s single screen. The grid of squares would have provided easy touch targets, but since they did not include touch controls for the inventory, even on the Switch, there is little practical reason why the inventory items need to be laid out in a grid."}, {"7fb4": "If Nintendo was willing to abandon the grid and present the items as a list, as they are in the Adventure Log and System menus, another solution for menu controls could have been to use a single stick to move left and right between subcategories and up and down to move between items."}, {"35c0": "Mapping"}, {"14d2": "Rarely do I find a mapping system in a game to be an effortless experience but BotW comes very close. The map is always present with a single tap of the ‘–’ button. You can place stamps on the map to help you remember important locations. The stamps are themed, so for example, when you find a pot to cook in you can leave a cooking stamp so you can return later."}, {"cde3": "The game automatically adds a red X to the map at the location of where you last died. This allows you to either avoid that spot on your next play or go back to recover your dropped weapons."}, {"740f": "The map also lets you place pins. When pins are outside the boundary of your mini-map, they show up along the edge to give you directional information of where to go for longer travels."}, {"3d94": "You are only allowed to place five pins. The limit can feel arbitrary to the player. It is meant to keep you from placing too many pins which would dilute the effectiveness of the mini-map. If there was some in-game lore or clarity presented to player why you could only place five pins it would make the limit easier to accept when you first encounter it."}, {"557c": "The pin feature is especially useful in converting 3D information to 2D information. You can look through Link’s scope and place a pin on an object you see in the distance. That pin is then reflected on the map and mini-map. This is a quick and coherent way to create directions that relate to your current position instead of having to take the time to reinterpret your position on a map. I hope this feature becomes a staple of mapping systems in all open-world games."}, {"dd78": "Shopping"}, {"822a": "When walking into most shops, the shopkeeper will have a brief conversation with you and then encourage you to look around at the goods. This is a more natural interaction than choosing from a menu of items to purchase because it keeps you involved in the gameplay. You might walk around to view armor from a few angles before deciding if you want to spend your Rupees on it."}, {"e1cb": "The dialog interactions when making a purchase feel more like a conversation instead of a menu item action. This also helps make the shopping experience feel more realistic. A subtle touch, but this gesture really keeps you feeling connected to your character."}, {"c2fa": "In-game Camera"}, {"d815": "One nit I have about the game is that the in-game camera does not save to my system level photo album. Even if it doesn’t happen automatically, there is no affordance from the in-game album to save to my system level album. There is also no way to make the photos in the in-game album full screen to screen capture."}, {"6ff9": "This feels like a shame because I could imagine creating some really awesome shots with the in-game camera. Horizon Zero Dawn is an example of a game with a fantastic in-game camera."}, {"e335": "Horizon Zero Dawn ‘camera’ shot. No UI in the way."}, {"b974": "Typography"}, {"558f": "BotW’s text is presented in a small modal window which takes up less than half the width of the screen. Text is commonly displayed in three lines with about 40 characters per line. Certain lines have emphasis placed on them by presenting the text larger or smaller."}, {"e1ab": "At points in the game you run into longer blocks of text, either from an in-game object or spoken from a character. Since the text box shows so little text at once, there is a lot of paging required to get through longer texts. The game uses this mechanic to create pacing which results in more meaningful dialog. Sometimes a text box will only be filled with ‘…’ to imply a pause in conversation."}, {"68b6": "With the exception of numerals, button icons, map information and large titles almost all typography in the game is italic. I assume the use of italics is to create a sense of motion throughout the game and it works surprisingly well. The typography feels stylized but tasteful and generally readable on a TV from across the room."}, {"55bb": "In general the game’s interface feels more comfortable on a TV screen than in handheld mode. I imagine many people would require reading glasses to see certain tiny text elements like the time display in the HUD on the smaller screen."}, {"a77f": "The title text is absolutely beautiful and gets me excited every time I enter a shrine or new area."}, {"0e78": "New User Experience"}, {"ff82": "I saved this one for last. Some people have said the game doesn’t really have a ‘new user experience’ and drops you into the open world without much help. I would argue the opposite, the game itself is the new user experience."}, {"df5d": "The subtlety in which each new element is introduced over the course of the game is extremely guided, it just doesn’t feel that way. The game wouldn’t be very fun unless you knew how to climb, but you can’t start the game until you climb out of the first cave. Tiny moves like that throughout keep you learning the behaviors necessary to progress."}, {"ebde": "The fact that each of these new behaviors feel like a discovery is what makes the new user experience not feel like one. They come naturally to the player and this is one of the reasons I hold this game in the highest regard."}, {"09ad": "Conclusion"}, {"9107": "Breath of the Wild has pushed the genre of open world gaming forward by focusing on the minutia of the experience. Craft and quality is obvious throughout. The result is an experience that is equally pleasurable whether you are catching chickens, figuring out the puzzles of a shrine, or fighting Bokoblins."}, {"f205": "Nintendo took many risks with this game which have paid off. Those risks would not have been successful without smart interface decisions and concern for the user experience."}], "content": "Thoughts on The Legend of Zelda: Breath of the Wild’s User Experience As a long time fan of Zelda games, I was excited to dive into Breath of the Wild. It is both the largest game in the series as well as the one that most successfully provides a sense of adventure. It has ushered in a new era of gameplay mechanics focused on making every moment of play engaging and meaningful. Controls Early Zelda games lacked a third dimension as well as complex controls but still managed to deliver a rich gaming experience. As technology of the Nintendo gaming platforms advanced, so did the complexity of controllers. Instead of embracing that complexity, the series traditionally tried to restrain its controls to the bare minimum set of inputs as to help make the game accessible to more players. BotW abandons this methodology of simple controls and presents a larger set of input options. It addresses the added complexity by starting the player with the simplest set of controls. Incrementally introducing advanced controls as they become necessary during the game. The controls require more learning than previous games. Even deep into the game you might occasionally find yourself mashing the wrong button in the heat of battle. The complexity of the inputs offer you more control and unlock possibilities not available in previous Zelda games, such as the ability to throw your weapon. The choice to add complexity is a risky one as it will undoubtedly dissuade some players from continuing forth with the game since the gameplay will take longer to master. One new control worth noting is the ability to quickly change between swords, shields, bows, arrows, and the rune powers of your Sheikah Slate, without accessing the full menu system. This is beneficial to the gameplay by keeping you in the action, since your weapons are prone to break in combat. The left, up, and right arrows of the D-pad are mapped to shield, rune power, and weapon. If you press and hold one of them, the game is suspended and you can choose between other options in your inventory via a horizontal slider menu. However, if you have a bow active as your weapon, the controls are altered. The left button changes your equipped arrows and the right button changes your bow. Another novel interaction is the variety of ways in which motion control is used. From aiming your bow, to shooting a photo or solving puzzles, the motion controls take a prominent position in the gameplay. The way the motion control is introduced to the player is not always the most obvious. I talked to a friend who was not initially aware they could move the controller to aim the bow and arrow shots. They discovered it later on in gameplay by accident. I have occasionally found the motion control to be disturbing when aiming an arrow because it forces me to hold the controller steady. Most of the time when I’m playing I’m not considering the way I am holding the controller. When motion control is activated I am forced to suddenly become aware of my physical reality. In general, the stick offers me solid aiming control. I am sometimes unsure of when is a good time to use motion control versus not. The ambiguity between these two controls could be solved by allowing more obviously fine control via the motion input and retaining larger motions exclusively for the stick. Creating additional differentiation would help distinguish when each type of control should be used. This feature can be turned off for those who don’t wish to use it in the options. Menu System At a high level, the menu system accomplishes its goal of providing the player with easy access to a variety of information and actions. There is a top level nav which allows you to access the adventure log, inventory, and system information. Each of these areas have subcategories and individually selectable items within each subcategory. The control used to navigate these sections are the L and R bumpers for the top level nav, the right stick for the sub-categories, and the left stick for individual selections. Overall this works well for making quick selections, but I often use the wrong stick when attempting to choose a subcategory or item. This would have been made easier to learn if the left stick was used for subcategories and the right stick for individual selection. This aligns with the physical vertical order of the controls on the Switch. The left stick is placed above the buttons on the left Joy-Con and the right stick is placed below the buttons on the right Joy-Con. BotW was originally developed for the Wii U and it is assumed that the map and inventory controls would have lived persistently on the Wii U controller, accessible via touch. This mapping and menu system was revised to work on the Switch’s single screen. The grid of squares would have provided easy touch targets, but since they did not include touch controls for the inventory, even on the Switch, there is little practical reason why the inventory items need to be laid out in a grid. If Nintendo was willing to abandon the grid and present the items as a list, as they are in the Adventure Log and System menus, another solution for menu controls could have been to use a single stick to move left and right between subcategories and up and down to move between items. Mapping Rarely do I find a mapping system in a game to be an effortless experience but BotW comes very close. The map is always present with a single tap of the ‘–’ button. You can place stamps on the map to help you remember important locations. The stamps are themed, so for example, when you find a pot to cook in you can leave a cooking stamp so you can return later. The game automatically adds a red X to the map at the location of where you last died. This allows you to either avoid that spot on your next play or go back to recover your dropped weapons. The map also lets you place pins. When pins are outside the boundary of your mini-map, they show up along the edge to give you directional information of where to go for longer travels. You are only allowed to place five pins. The limit can feel arbitrary to the player. It is meant to keep you from placing too many pins which would dilute the effectiveness of the mini-map. If there was some in-game lore or clarity presented to player why you could only place five pins it would make the limit easier to accept when you first encounter it. The pin feature is especially useful in converting 3D information to 2D information. You can look through Link’s scope and place a pin on an object you see in the distance. That pin is then reflected on the map and mini-map. This is a quick and coherent way to create directions that relate to your current position instead of having to take the time to reinterpret your position on a map. I hope this feature becomes a staple of mapping systems in all open-world games. Shopping When walking into most shops, the shopkeeper will have a brief conversation with you and then encourage you to look around at the goods. This is a more natural interaction than choosing from a menu of items to purchase because it keeps you involved in the gameplay. You might walk around to view armor from a few angles before deciding if you want to spend your Rupees on it. The dialog interactions when making a purchase feel more like a conversation instead of a menu item action. This also helps make the shopping experience feel more realistic. A subtle touch, but this gesture really keeps you feeling connected to your character. In-game Camera One nit I have about the game is that the in-game camera does not save to my system level photo album. Even if it doesn’t happen automatically, there is no affordance from the in-game album to save to my system level album. There is also no way to make the photos in the in-game album full screen to screen capture. This feels like a shame because I could imagine creating some really awesome shots with the in-game camera. Horizon Zero Dawn is an example of a game with a fantastic in-game camera. Horizon Zero Dawn ‘camera’ shot. No UI in the way. Typography BotW’s text is presented in a small modal window which takes up less than half the width of the screen. Text is commonly displayed in three lines with about 40 characters per line. Certain lines have emphasis placed on them by presenting the text larger or smaller. At points in the game you run into longer blocks of text, either from an in-game object or spoken from a character. Since the text box shows so little text at once, there is a lot of paging required to get through longer texts. The game uses this mechanic to create pacing which results in more meaningful dialog. Sometimes a text box will only be filled with ‘…’ to imply a pause in conversation. With the exception of numerals, button icons, map information and large titles almost all typography in the game is italic. I assume the use of italics is to create a sense of motion throughout the game and it works surprisingly well. The typography feels stylized but tasteful and generally readable on a TV from across the room. In general the game’s interface feels more comfortable on a TV screen than in handheld mode. I imagine many people would require reading glasses to see certain tiny text elements like the time display in the HUD on the smaller screen. The title text is absolutely beautiful and gets me excited every time I enter a shrine or new area. New User Experience I saved this one for last. Some people have said the game doesn’t really have a ‘new user experience’ and drops you into the open world without much help. I would argue the opposite, the game itself is the new user experience. The subtlety in which each new element is introduced over the course of the game is extremely guided, it just doesn’t feel that way. The game wouldn’t be very fun unless you knew how to climb, but you can’t start the game until you climb out of the first cave. Tiny moves like that throughout keep you learning the behaviors necessary to progress. The fact that each of these new behaviors feel like a discovery is what makes the new user experience not feel like one. They come naturally to the player and this is one of the reasons I hold this game in the highest regard. Conclusion Breath of the Wild has pushed the genre of open world gaming forward by focusing on the minutia of the experience. Craft and quality is obvious throughout. The result is an experience that is equally pleasurable whether you are catching chickens, figuring out the puzzles of a shrine, or fighting Bokoblins. Nintendo took many risks with this game which have paid off. Those risks would not have been successful without smart interface decisions and concern for the user experience. ", "child": "1320_1"}