{"name": "1323", "parent": "", "title": "Text message storytelling: the case for a new consumer platform", "sentences": [{"d3cc": "Text message storytelling: the case for a new consumer platform"}, {"c458": "I’ve been watching with curiosity as several text message storytelling apps have emerged to top the free charts on iOS/Android. Most notably Hooked was #1 across all free apps on the US App Store yesterday and other similar apps such as Yarn have been rising quickly in the rankings and are within spitting distance."}, {"9005": "I think there’s a possibility that a new kind of publishing format and content format could be created that is pretty unique to how content would be consumed on a mobile phone. The text message format of storytelling is magically simple to create and consume yet powerful at engaging readers in a story."}, {"f6e2": "Hooked was the number 1 overall free app in the US App Store on 4/8/2017"}, {"bbb9": "How it works"}, {"0d66": "For those who haven’t tried, the mechanics are simple: you open the app and you’re thrust into a messaging channel where you are a fly-on-the-wall of a messaging conversation taking place between 2 parties. The discussion is extremely exciting and has you immediately asking “what happens next?” from the first few exchanges. You tap, tap, tap to continue reading the content until you digest an “episode”. In order to continue reading you either have to wait a period of time (30 minutes) or subscribe (pay a fee) to continue. This takes the process of reading a story and sets it up with the mechanics and monetization of a virtual good in a mobile game."}, {"f5d1": "The growth is likely due to a single great piece of content that hooks the reader and monetizes directly. This enables companies like Hooked and Yarn to spend lots of money on profitable application installs across Facebook and other CPI channels. Typically, I’m highly skeptical of businesses which get most of their traction through customer acquisition on commodity channels. This is very common in categories such as social/mobile gaming and ecommerce. The channels change, CPI prices rise, other companies compete to provide similar commodity experiences in those same channels, and it’s tough to build long-term value without achieving something proprietary. c.f. Zynga. Sorry, “genius analytics” are not very proprietary:"}, {"1fbc": "As the founder of one of the first social gaming companies (heya, (lil) Green Patch!) I should be skeptical. While we reached 45 million people in the years that we operated, we ultimately sold the business because we couldn’t find a path where I believed we could create a truly defensible content network in the category."}, {"9b23": "This time it’s different… maybe?"}, {"be86": "I think what Hooked is building is really interesting. So far, I’d suggest they’re executing a playbook more similar to the social gaming category than to that of a new content platform. But I think they have the chance to build something more meaningful and durable. I think the following aspects together make the phenomenon different than anything we’ve seen to date:"}, {"46e3": "Defensibility comes from the following:"}, {"fbc4": "If a given creator’s storytelling content “hits” the author could build an audience on these platforms or even get a rev-share of the revenue made by writing a compelling cliffhanger serial. Authors could build audience, build brands and story IP, and could even be dealt into the monetization flow when they produce a hit. A platform for short-form serial content could emerge and the format itself could evolve to include choose-your-own-adventure-style interactive content, too."}, {"0fa3": "I’m excited to see how the empowerment of a potentially new class of writers and story creators could play out."}, {"971d": "What do you think?"}, {"6943": "Thanks to Rohan Seth, Ashvin Kumar, and Jen Yip who contributed feedback on versions of this writing."}], "content": "Text message storytelling: the case for a new consumer platform I’ve been watching with curiosity as several text message storytelling apps have emerged to top the free charts on iOS/Android. Most notably Hooked was #1 across all free apps on the US App Store yesterday and other similar apps such as Yarn have been rising quickly in the rankings and are within spitting distance. I think there’s a possibility that a new kind of publishing format and content format could be created that is pretty unique to how content would be consumed on a mobile phone. The text message format of storytelling is magically simple to create and consume yet powerful at engaging readers in a story. Hooked was the number 1 overall free app in the US App Store on 4/8/2017 How it works For those who haven’t tried, the mechanics are simple: you open the app and you’re thrust into a messaging channel where you are a fly-on-the-wall of a messaging conversation taking place between 2 parties. The discussion is extremely exciting and has you immediately asking “what happens next?” from the first few exchanges. You tap, tap, tap to continue reading the content until you digest an “episode”. In order to continue reading you either have to wait a period of time (30 minutes) or subscribe (pay a fee) to continue. This takes the process of reading a story and sets it up with the mechanics and monetization of a virtual good in a mobile game. The growth is likely due to a single great piece of content that hooks the reader and monetizes directly. This enables companies like Hooked and Yarn to spend lots of money on profitable application installs across Facebook and other CPI channels. Typically, I’m highly skeptical of businesses which get most of their traction through customer acquisition on commodity channels. This is very common in categories such as social/mobile gaming and ecommerce. The channels change, CPI prices rise, other companies compete to provide similar commodity experiences in those same channels, and it’s tough to build long-term value without achieving something proprietary. c.f. Zynga. Sorry, “genius analytics” are not very proprietary: As the founder of one of the first social gaming companies (heya, (lil) Green Patch!) I should be skeptical. While we reached 45 million people in the years that we operated, we ultimately sold the business because we couldn’t find a path where I believed we could create a truly defensible content network in the category. This time it’s different… maybe? I think what Hooked is building is really interesting. So far, I’d suggest they’re executing a playbook more similar to the social gaming category than to that of a new content platform. But I think they have the chance to build something more meaningful and durable. I think the following aspects together make the phenomenon different than anything we’ve seen to date: Defensibility comes from the following: If a given creator’s storytelling content “hits” the author could build an audience on these platforms or even get a rev-share of the revenue made by writing a compelling cliffhanger serial. Authors could build audience, build brands and story IP, and could even be dealt into the monetization flow when they produce a hit. A platform for short-form serial content could emerge and the format itself could evolve to include choose-your-own-adventure-style interactive content, too. I’m excited to see how the empowerment of a potentially new class of writers and story creators could play out. What do you think? Thanks to Rohan Seth, Ashvin Kumar, and Jen Yip who contributed feedback on versions of this writing. ", "child": "1323_1\t1323_2\t1323_3\t1323_4\t1323_51323_1\t1323_2\t1323_3\t1323_4\t1323_51323_1\t1323_2\t1323_3\t1323_4\t1323_5"}