{"name": "1324", "parent": "", "title": "Breaking a sweat in VR, the future of fitness.", "sentences": [{"062a": "Breaking a sweat in VR, the future of fitness."}, {"b410": "Image from Wareable.com — Price is the hurdle for VR fitness"}, {"7b30": "When it comes to gaming and physical fitness, we don’t associate an avid gamer with an athlete in peak physical condition. Quite the opposite in fact. While athletes are out at practice or playing on the field, gamers are at home pressing keys and watching pixels on their screens."}, {"512a": "A social stigma formed over the years of the unhealthy, anti-social, parent’s-basement-dwelling gamer."}, {"e24b": "Not long ago, when seeking an entry level job, having sports team participation on one’s resume could be a real boost in displaying one’s ability to work on a team, withstand grueling practices, and follow constant instruction. On the other hand, telling someone you spent upwards of 40 hours a week running and maintaining a top tier raiding guild and twice a week organized 40 players to tackle challenges lasting multiple hours earned an eye-roll."}, {"1719": "We are seeing a change in the gamer stigma, as the average age of a gamer rises past 31 years. Gamers are appearing at all levels of the corporate structure as a growing number of leaders grew up playing games experiencing their benefits first hand. In an information heavy world, the skills learned from gaming are increasing in value."}, {"fdde": "Video games exercise the mind, but the body is left behind."}, {"834c": "The importance of physical fitness on a person’s well being is a known fact. And in recent years more evidence has been found connecting physical fitness with mental fitness. “Spark” by John Ratey M.D. and Eric Hagerman expands upon this, sharing examples such as a Chicago school whose students run 1 mile every morning and have achieved some of the highest test scores in not only the country, but the world."}, {"851a": "Exercise appears to be a cure, or at least a reliever, of most every ailment. Exercise is a focus enhancing, energy boosting, mood improving wonder drug that doesn’t require any prescriptions or injections. Exercise promotes neurogenesis, the growth and repair of the mind."}, {"aa9c": "With the spread of activities like Crossfit, Yoga, cycling, and running contemporary society is reconnecting itself with the need for physical exercise. The market is becoming all but obsessed with working out, staying in shape, and eating healthy. And yet, our generation may be the first generation with a shorter lifespan than our parents."}, {"6b66": "From sports player to couch layer"}, {"dae9": "Being involved in sports has the benefit of physical conditioning throughout childhood and into college years. During college though, many sports players spend less time playing the sports they love and acclimate themselves for the work world. The more sports players adjust for the work world, the less time they spend physically playing sports."}, {"b2d4": "Given this “weeding out” of sports players,there is a gradual but somewhat inevitable slide towards passive engagement with their chosen sport(s). The middle aged beer gutted NFL fan, who used to play back in college, is an American stereotype. The limited play area available, and limited resources for organizing games and leagues, means the market can only sustain so many professional players."}, {"e91b": "It’s far easier to sit on the couch in front of a 4K screen with beer in hand every Sunday than it is to join an organized league and play every Tuesday night. A few years of this and masses of ex-jocks find themselves overweight, glued to the television, and reminiscing about the good ol’ days. A football field can only fit in so many places, and only so many people can be playing on it at one time."}, {"df18": "Perhaps there is an irony here that most jocks, who may or may not have bullied gaming “nerds” in their younger days, are engaged in a sedentary life centered around the sports that once kept them in peak physical condition."}, {"4024": "Many sports players continue to play in local leagues, coach little leagues, or find new outlets for physical exertion. And there are many gamers who themselves become passive viewers of gaming, spending more time scrolling through /r/gaming and Twitch streams than playing games. Whether or not active gamers receive a cognitive benefit from the games they play, their physical fitness remains sub-par."}, {"1bf5": "Physical gyms and fitness locations are limited."}, {"0a9c": "Whether it’s heading to a gym or a park, those interested in getting or staying in shape must deviate from their work-home life in order to use fitness spaces. And while this isn’t a huge barrier by any means, it is enough to deter people who have never had a reason to use a gym or go for a hike before. Many people aren’t located near any gyms or parks to begin with."}, {"aad5": "Without the structure of a sports team to drive them, people aren’t apt to find reasons to exercise."}, {"7d86": "Virtual reality is a means for all ages to engage in physical fitness on a daily basis."}, {"7de4": "Some virtual reality experiences are developed specifically for encouraging physical fitness. Entire fitness regimes are being created within virtual reality by companies like Black Box VR, founded by the founder of BodyBuilding.com. As virtual reality grows, so do the ways which it can be used to promote fitness."}, {"e1b2": "Virtual reality games are inherently more physical than their 2D predecessors. A gamer cannot help but to burn calories while playing in virtual reality, especially at room-scale. Stories of players losing 50lbs playing in virtual reality, soaking their headsets with sweat , or just plain getting tired have already surfaced."}, {"05fc": "Once prices fall to levels of mass appeal, virtual reality will be an interface for non-gamers to experience engaging fitness programs within the comforts of their own home, unhindered by social stigma, bulky equipment, or physical location."}, {"df5f": "VR isn’t necessarily the ultimate solution to the problems of obesity, sedentary habits, or metabolic disease but it is one of the most compelling tools we’ve yet to invent. And it’s only getting cheaper."}, {"cf09": "I for one am most excited about the future health of gamers. No longer will gamers be known as sedentary people. Now they will be physically exploring virtual worlds each and every time they jack in. Given the immense benefits physical activity has on the human mind and body, one can only imagine the rippling effects physically engaging virtuality could have on society."}, {"877a": "As of this writing, my daily fitness regime takes place partially within VR, using an HTC Vive at room-scale."}], "content": "Breaking a sweat in VR, the future of fitness. Image from Wareable.com — Price is the hurdle for VR fitness When it comes to gaming and physical fitness, we don’t associate an avid gamer with an athlete in peak physical condition. Quite the opposite in fact. While athletes are out at practice or playing on the field, gamers are at home pressing keys and watching pixels on their screens. A social stigma formed over the years of the unhealthy, anti-social, parent’s-basement-dwelling gamer. Not long ago, when seeking an entry level job, having sports team participation on one’s resume could be a real boost in displaying one’s ability to work on a team, withstand grueling practices, and follow constant instruction. On the other hand, telling someone you spent upwards of 40 hours a week running and maintaining a top tier raiding guild and twice a week organized 40 players to tackle challenges lasting multiple hours earned an eye-roll. We are seeing a change in the gamer stigma, as the average age of a gamer rises past 31 years. Gamers are appearing at all levels of the corporate structure as a growing number of leaders grew up playing games experiencing their benefits first hand. In an information heavy world, the skills learned from gaming are increasing in value. Video games exercise the mind, but the body is left behind. The importance of physical fitness on a person’s well being is a known fact. And in recent years more evidence has been found connecting physical fitness with mental fitness. “Spark” by John Ratey M.D. and Eric Hagerman expands upon this, sharing examples such as a Chicago school whose students run 1 mile every morning and have achieved some of the highest test scores in not only the country, but the world. Exercise appears to be a cure, or at least a reliever, of most every ailment. Exercise is a focus enhancing, energy boosting, mood improving wonder drug that doesn’t require any prescriptions or injections. Exercise promotes neurogenesis, the growth and repair of the mind. With the spread of activities like Crossfit, Yoga, cycling, and running contemporary society is reconnecting itself with the need for physical exercise. The market is becoming all but obsessed with working out, staying in shape, and eating healthy. And yet, our generation may be the first generation with a shorter lifespan than our parents. From sports player to couch layer Being involved in sports has the benefit of physical conditioning throughout childhood and into college years. During college though, many sports players spend less time playing the sports they love and acclimate themselves for the work world. The more sports players adjust for the work world, the less time they spend physically playing sports. Given this “weeding out” of sports players,there is a gradual but somewhat inevitable slide towards passive engagement with their chosen sport(s). The middle aged beer gutted NFL fan, who used to play back in college, is an American stereotype. The limited play area available, and limited resources for organizing games and leagues, means the market can only sustain so many professional players. It’s far easier to sit on the couch in front of a 4K screen with beer in hand every Sunday than it is to join an organized league and play every Tuesday night. A few years of this and masses of ex-jocks find themselves overweight, glued to the television, and reminiscing about the good ol’ days. A football field can only fit in so many places, and only so many people can be playing on it at one time. Perhaps there is an irony here that most jocks, who may or may not have bullied gaming “nerds” in their younger days, are engaged in a sedentary life centered around the sports that once kept them in peak physical condition. Many sports players continue to play in local leagues, coach little leagues, or find new outlets for physical exertion. And there are many gamers who themselves become passive viewers of gaming, spending more time scrolling through /r/gaming and Twitch streams than playing games. Whether or not active gamers receive a cognitive benefit from the games they play, their physical fitness remains sub-par. Physical gyms and fitness locations are limited. Whether it’s heading to a gym or a park, those interested in getting or staying in shape must deviate from their work-home life in order to use fitness spaces. And while this isn’t a huge barrier by any means, it is enough to deter people who have never had a reason to use a gym or go for a hike before. Many people aren’t located near any gyms or parks to begin with. Without the structure of a sports team to drive them, people aren’t apt to find reasons to exercise. Virtual reality is a means for all ages to engage in physical fitness on a daily basis. Some virtual reality experiences are developed specifically for encouraging physical fitness. Entire fitness regimes are being created within virtual reality by companies like Black Box VR, founded by the founder of BodyBuilding.com. As virtual reality grows, so do the ways which it can be used to promote fitness. Virtual reality games are inherently more physical than their 2D predecessors. A gamer cannot help but to burn calories while playing in virtual reality, especially at room-scale. Stories of players losing 50lbs playing in virtual reality, soaking their headsets with sweat , or just plain getting tired have already surfaced. Once prices fall to levels of mass appeal, virtual reality will be an interface for non-gamers to experience engaging fitness programs within the comforts of their own home, unhindered by social stigma, bulky equipment, or physical location. VR isn’t necessarily the ultimate solution to the problems of obesity, sedentary habits, or metabolic disease but it is one of the most compelling tools we’ve yet to invent. And it’s only getting cheaper. I for one am most excited about the future health of gamers. No longer will gamers be known as sedentary people. Now they will be physically exploring virtual worlds each and every time they jack in. Given the immense benefits physical activity has on the human mind and body, one can only imagine the rippling effects physically engaging virtuality could have on society. As of this writing, my daily fitness regime takes place partially within VR, using an HTC Vive at room-scale. ", "child": "1324_1"}