{"name": "133", "parent": "", "title": "Draymond Green is his own kind of superstar", "sentences": [{"278e": "Draymond Green is his own kind of superstar"}, {"b9b5": "Superstars in the NBA generally have pretty similar traits to define their status, but what Draymond Green does is unique and invaluable."}, {"c574": "If Draymond Green isn’t the most polarizing player in the NBA, he nears the top of the list. Everything he does is unique. Whether it be his versatility on both ends of the court — or his lack of care for the Man Code that we instead call “a lack of body control” — Green does it different than everybody else. It’s one reason you either love him or hate him — and there’s really no in-between."}, {"e1a0": "The crazy stuff Draymond does — whether it be an on-court incident or an accidental social media flashing — subtracts, in some way, from the incredible things he does on the basketball court."}, {"f7e3": "Defining a superstar in the NBA is a tough task. Some may have 20 players they consider a superstar, some may have three — that’s the lone issue with the vast talent pool the league is blessed with. LeBron James is pretty much the unanimous Best Player In The World, but after that, players can be ordered completely different depending on the person. Is Kevin Durant really better than Stephen Curry? Are James Harden and/or Russell Westbrook better than both of them? What about Kawhi Leonard?"}, {"ff8b": "And even after that group, there’s another group of 10 or so players that could be considered superstars or are at least right there."}, {"9802": "Green probably doesn’t make that list for most people. He doesn’t score like Curry, Durant, Harden or Westbrook. He doesn’t defend and score like Leonard. If he was the number 1 guy, would he be able to carry the defensive load and produce offense like Jimmy Butler and Paul George?"}, {"7a99": "With Green, though, comparison truly is the thief of joy — and the truth. No, Green doesn’t have that stand-out trait that could be recognized by even the most casual basketball fans. He’s the third best player on his team, and it could argued he’s the fourth best. He’s merely a role player, right?"}, {"7f60": "The fact of the matter is, Draymond Green is a superstar — in his own way. Does he stand out like the others? No. Is his calling card to play in a way that is going to grab anyone and everyone’s attention, though? No."}, {"ebf3": "It’s almost like Green was manufactured to win his team basketball games. Green is the “glue guy,” the guy that fills in all the cracks — except the glue was poured heavy enough so those cracks never reappear. If other cracks form, just pour some more Draymond in there and the Warriors are just fine."}, {"6b94": "Scoring is seemingly what we all care about these days. Offenses are purely designed to score more points. And heck, Green’s team does a pretty good job of it themselves. But Draymond has the rare ability to impact a game without needing to score much at all. In a 15-point victory over the Memphis Grizzlies on January 10, Green quietly put up one of the most impressive stat lines we’ve seen this year, and there have been some doozies — 4 points, 12 rebounds, 10 assists, 10 steals and 5 blocks. He was one point from the rarely-reached 5x5 (recording 5 of any 5 different stats) and not too far off the even more rarely-reached quadruple-double."}, {"64e5": "Sure, Draymond can have this impact without scoring because he doesn’t need to with Curry, Durant and Klay Thompson around him. But ever think of it the other way around? Could those three do this without him? In that Grizzlies win, the Curry-Thompson-Durant trio tallied 78 points on 24-for-50 (48 percent) shooting, and 13-for-27 (48 percent) from three. How many of those points came from a great pass Green made, or setting a great screen?"}, {"4057": "Kevin Durant vs the State of Oklahoma, Exploring the Details of HurtKevin Durant returns to his first home on Saturday, where his reception is of much intrigue nationally.16winsaring.com"}, {"9e95": "Draymond is the ever-so-useful point forward for a team with three of the best shooters and overall scorers in the league. They can run around trying to find the best shot, cut to the rim, or chill on the weakside perimeter. Most importantly, the other three don’t have to worry about making plays for each other as much and can even conserve energy on that end for defense. Taking some of the offensive load off of Durant this season may explain why he’s having such a good year defensively, actually."}, {"6f9a": "And, hey, Green is also pretty good on that end, too. In some order, he, Leonard and Rudy Gobert are the best defenders in the league. But considering Green’s ability to essentially guard anyone in the league — and play the center position to unlock the Death Lineup — may make him more valuable than the other two."}, {"7b55": "Not every player has to go through some sort of major struggle — or have t0 carry a team on their back — to be considered a superstar. Draymond puts his team and winning ahead of anything else. He has a pretty good situation, sure. But he’s no system player. He is a fearless leader. He has worked hard just like everyone else, and is a key reason the Warriors are who they are."}, {"e2be": "Draymond Green does it differently, but he does what he does better than anyone else in the league. Take him out of the equation and the Warriors get a lot less scary. Draymond is a superstar. Like or not, that’s just the way it is."}], "content": "Draymond Green is his own kind of superstar Superstars in the NBA generally have pretty similar traits to define their status, but what Draymond Green does is unique and invaluable. If Draymond Green isn’t the most polarizing player in the NBA, he nears the top of the list. Everything he does is unique. Whether it be his versatility on both ends of the court — or his lack of care for the Man Code that we instead call “a lack of body control” — Green does it different than everybody else. It’s one reason you either love him or hate him — and there’s really no in-between. The crazy stuff Draymond does — whether it be an on-court incident or an accidental social media flashing — subtracts, in some way, from the incredible things he does on the basketball court. Defining a superstar in the NBA is a tough task. Some may have 20 players they consider a superstar, some may have three — that’s the lone issue with the vast talent pool the league is blessed with. LeBron James is pretty much the unanimous Best Player In The World, but after that, players can be ordered completely different depending on the person. Is Kevin Durant really better than Stephen Curry? Are James Harden and/or Russell Westbrook better than both of them? What about Kawhi Leonard? And even after that group, there’s another group of 10 or so players that could be considered superstars or are at least right there. Green probably doesn’t make that list for most people. He doesn’t score like Curry, Durant, Harden or Westbrook. He doesn’t defend and score like Leonard. If he was the number 1 guy, would he be able to carry the defensive load and produce offense like Jimmy Butler and Paul George? With Green, though, comparison truly is the thief of joy — and the truth. No, Green doesn’t have that stand-out trait that could be recognized by even the most casual basketball fans. He’s the third best player on his team, and it could argued he’s the fourth best. He’s merely a role player, right? The fact of the matter is, Draymond Green is a superstar — in his own way. Does he stand out like the others? No. Is his calling card to play in a way that is going to grab anyone and everyone’s attention, though? No. It’s almost like Green was manufactured to win his team basketball games. Green is the “glue guy,” the guy that fills in all the cracks — except the glue was poured heavy enough so those cracks never reappear. If other cracks form, just pour some more Draymond in there and the Warriors are just fine. Scoring is seemingly what we all care about these days. Offenses are purely designed to score more points. And heck, Green’s team does a pretty good job of it themselves. But Draymond has the rare ability to impact a game without needing to score much at all. In a 15-point victory over the Memphis Grizzlies on January 10, Green quietly put up one of the most impressive stat lines we’ve seen this year, and there have been some doozies — 4 points, 12 rebounds, 10 assists, 10 steals and 5 blocks. He was one point from the rarely-reached 5x5 (recording 5 of any 5 different stats) and not too far off the even more rarely-reached quadruple-double. Sure, Draymond can have this impact without scoring because he doesn’t need to with Curry, Durant and Klay Thompson around him. But ever think of it the other way around? Could those three do this without him? In that Grizzlies win, the Curry-Thompson-Durant trio tallied 78 points on 24-for-50 (48 percent) shooting, and 13-for-27 (48 percent) from three. How many of those points came from a great pass Green made, or setting a great screen? Kevin Durant vs the State of Oklahoma, Exploring the Details of HurtKevin Durant returns to his first home on Saturday, where his reception is of much intrigue nationally.16winsaring.com Draymond is the ever-so-useful point forward for a team with three of the best shooters and overall scorers in the league. They can run around trying to find the best shot, cut to the rim, or chill on the weakside perimeter. Most importantly, the other three don’t have to worry about making plays for each other as much and can even conserve energy on that end for defense. Taking some of the offensive load off of Durant this season may explain why he’s having such a good year defensively, actually. And, hey, Green is also pretty good on that end, too. In some order, he, Leonard and Rudy Gobert are the best defenders in the league. But considering Green’s ability to essentially guard anyone in the league — and play the center position to unlock the Death Lineup — may make him more valuable than the other two. Not every player has to go through some sort of major struggle — or have t0 carry a team on their back — to be considered a superstar. Draymond puts his team and winning ahead of anything else. He has a pretty good situation, sure. But he’s no system player. He is a fearless leader. He has worked hard just like everyone else, and is a key reason the Warriors are who they are. Draymond Green does it differently, but he does what he does better than anyone else in the league. Take him out of the equation and the Warriors get a lot less scary. Draymond is a superstar. Like or not, that’s just the way it is. ", "child": "133_1"}