{"name": "1331", "parent": "", "title": "Fun and Games: Tech Will Save Us", "sentences": [{"05a8": "Fun and Games: Tech Will Save Us"}, {"b5c1": "Our lucky unicorns got the chance to catch up with this awesome startup making waves in the kids edtech sector."}, {"f500": "Start us off with a simple explanation of what Tech Will Save Us does."}, {"012e": "We create toys that kids build themselves. We believe in the value of learning by doing and we want to inspire kids to become creators instead of just consumers."}, {"ef91": "For example, last year we released the Mover Kit. It’s a wearable that reacts to movement by displaying different light patterns. You build it yourself and then define how it should behave."}, {"6cf6": "Kids use it to make games or invent things (like a bike light or a toothbrush timer). It gives them confidence. And at the same time they learn about electronics and design, how sensors like accelerometers work, coding…"}, {"bb49": "That’s super cool! Working with you must be a lot of fun. Tell us a bit about your company culture."}, {"9799": "We’re a diverse and open team. We’re still a very small company so there are many ways in which people can contribute. We try to involve many different points of view and get everyone involved in talking to customers and testing with users. It helps us put our users at the centre always."}, {"19ba": "We have a professional development fund for everyone which people use to go to conferences or take classes."}, {"76b4": "Our studio is in East London. There’s a giant window which makes it very bright and there are curious people peering into the space all the time. It’s quite nice."}, {"8e1a": "In one sentence outline your ultimate goal."}, {"c5d8": "We want open to up learning in ways that will make the world more interesting and give kids the confidence to tackle new problems."}, {"b940": "You’re hiring on Unicorn Hunt — why?"}, {"cecd": "I used the 3beards job board when I last looked for work. And then bam!, Unicorn Hunt came along. It’s beautiful and is the kind of job site that reflects our values: design-led, thoughtful, playful, customer-focused. I really like the simplicity."}, {"a137": "Gee thanks :)"}, {"11e5": "Do you have some advice for other startups that are hiring?"}, {"708f": "One of the biggest eye openers for me I read in a book by a guy called Lou Adler (“Hire With Your Head” — I used to run a startup in the hiring space and the practice and science behind hiring is really quite fascinating). It’s probably obvious to a lot of people already: he makes a big point of presenting candidates with challenges, not just a list of abilities."}, {"4212": "The idea is to make the job more attractive which helps with one of the most difficult parts of all this — finding people."}, {"2d99": "But you also have to follow through. The challenges need to be real, you must be ready to find someone capable of meeting the challenge and not just check that their CV has the right keywords."}, {"2c7f": "It’s also a great tool to use once the new hire starts: during the onboarding you can talk about the objectives and how they might begin to tackle them."}, {"faee": "Great thanks! What would you say to job seekers applying to Tech Will Save Us?"}, {"2475": "Write a good cover letter! Candidates that apply to startups are writing to people that are extremely passionate about what they do, so they need to convey their own enthusiasm for the endeavour. Generic cover letters or one-liners or even empty messages (really?!) are a big no-no. Those applications are likely going to go straight into the bin."}, {"68ae": "Finally and most seriously, if your company was a tea time treat what would it be and why?"}, {"227b": "It would have to be something you put together yourself, like those little packs with all the ingredients that you combine. But it would have to be healthy! And something that can be shared :)"}, {"fc78": "Well THANK YOU Tech Will Save Us, it’s been a pleasure! ___________________________________________________________________"}, {"86cc": "If you want to work with this amazing company check out their live roles here."}], "content": "Fun and Games: Tech Will Save Us Our lucky unicorns got the chance to catch up with this awesome startup making waves in the kids edtech sector. Start us off with a simple explanation of what Tech Will Save Us does. We create toys that kids build themselves. We believe in the value of learning by doing and we want to inspire kids to become creators instead of just consumers. For example, last year we released the Mover Kit. It’s a wearable that reacts to movement by displaying different light patterns. You build it yourself and then define how it should behave. Kids use it to make games or invent things (like a bike light or a toothbrush timer). It gives them confidence. And at the same time they learn about electronics and design, how sensors like accelerometers work, coding… That’s super cool! Working with you must be a lot of fun. Tell us a bit about your company culture. We’re a diverse and open team. We’re still a very small company so there are many ways in which people can contribute. We try to involve many different points of view and get everyone involved in talking to customers and testing with users. It helps us put our users at the centre always. We have a professional development fund for everyone which people use to go to conferences or take classes. Our studio is in East London. There’s a giant window which makes it very bright and there are curious people peering into the space all the time. It’s quite nice. In one sentence outline your ultimate goal. We want open to up learning in ways that will make the world more interesting and give kids the confidence to tackle new problems. You’re hiring on Unicorn Hunt — why? I used the 3beards job board when I last looked for work. And then bam!, Unicorn Hunt came along. It’s beautiful and is the kind of job site that reflects our values: design-led, thoughtful, playful, customer-focused. I really like the simplicity. Gee thanks :) Do you have some advice for other startups that are hiring? One of the biggest eye openers for me I read in a book by a guy called Lou Adler (“Hire With Your Head” — I used to run a startup in the hiring space and the practice and science behind hiring is really quite fascinating). It’s probably obvious to a lot of people already: he makes a big point of presenting candidates with challenges, not just a list of abilities. The idea is to make the job more attractive which helps with one of the most difficult parts of all this — finding people. But you also have to follow through. The challenges need to be real, you must be ready to find someone capable of meeting the challenge and not just check that their CV has the right keywords. It’s also a great tool to use once the new hire starts: during the onboarding you can talk about the objectives and how they might begin to tackle them. Great thanks! What would you say to job seekers applying to Tech Will Save Us? Write a good cover letter! Candidates that apply to startups are writing to people that are extremely passionate about what they do, so they need to convey their own enthusiasm for the endeavour. Generic cover letters or one-liners or even empty messages (really?!) are a big no-no. Those applications are likely going to go straight into the bin. Finally and most seriously, if your company was a tea time treat what would it be and why? It would have to be something you put together yourself, like those little packs with all the ingredients that you combine. But it would have to be healthy! And something that can be shared :) Well THANK YOU Tech Will Save Us, it’s been a pleasure! ___________________________________________________________________ If you want to work with this amazing company check out their live roles here. ", "child": "1331_1"}