{"name": "1336", "parent": "", "title": "Which Tech CEO Would Make the Best Supervillain?", "sentences": [{"df03": "Which Tech CEO Would Make the Best Supervillain?"}, {"f1e3": "Technology’s greatest minds gone bad"}, {"d56a": "No one is born a supervillain. Harvey Dent was a celebrated district attorney in Gotham City. Dr. Otto Octavius wanted to bring boundless energy to the world via nuclear fusion. Kanye West gave us “Through the Wire.” Who knew, when these men were achieving great things in law, science, and culture, the havoc they would ultimately wreak?"}, {"b528": "It’s a time-tested fact that anyone, if given too much power, will eventually use it to eat the world. What reason is there to think that today’s Silicon Valley plutocrats are any different? Mark Zuckerberg released a manifesto last month arguing that Facebook can become more powerful than any nation-state. Elon Musk thinks that Alphabet CEO Larry Page could be the harbinger of the robot apocalypse — but Musk also wants to implant chips in our brains to turn us into walking supercomputers and may be using Google as a distraction from his actual nefarious plot. Meanwhile, Jeff Bezos is riding around in giant robot mechs and probably laughing maniacally in that way we all assume Jeff Bezos laughs."}, {"e415": "All of these men, as well as their companies, have been ascribed half-jesting supervillain status in articles, talk-show bits, and tweets at some point or another. The notion of the CEO as a cartoonishly extravagant evildoer entered the pop culture consciousness in the 1980s, when Reaganomics and Wall Street turned the wealth gap into a chasm. In Man of Steel, the 1986 comic book reboot of Superman, writer and artist John Byrne transformed Lex Luthor from a mad scientist into a power-hungry corporate executive. The rebranding stuck — in 2016’s Batman vs. Superman, Luthor is a tech billionaire in sneakers played by Jesse Eisenberg."}, {"2e5f": "“Supervillains — like the superheroes against whom they battle — are these larger-than-life characters,” Carol Tilley, a professor at the University of Illinois at Urbana-Champaign and senior vice president of the Comics Studies Society, told me in an email. “Often their goal is to control the world, and they eagerly use their extraordinary wealth or intelligence (or sometimes other traits) to that end. Because of their entrepreneurial vision and success, folks like Jeff Bezos and Mark Zuckerberg seem well positioned to be cast as supervillains. Their entrepreneurial focus is on products that have wide — sometimes worldwide — appeal but also cause us to question social and cultural norms.”"}, {"a92d": "It’s the highly disruptive nature of Silicon Valley’s inventors that makes them easy to perceive as villains. No one is quite sure how these companies’ mysterious algorithms work, or what the world will look like once their plans have been fully realized. “The grandiosity of their vision is one of the things that makes them seem like they’re villainous,” says Peter Coogan, author of Superhero: The Secret Origin of a Genre. “Corporations are a power center now, and people feel they can’t control them. And when you feel you can’t control something, that’s when you go for magic.”"}, {"53b4": "Over the last decade, we’ve collectively bestowed never-before-seen capital, unfettered access to personal data, and remote control over billions of devices to, like, 10 dudes. Since there’s no way to undo this unprecedented consolidation of power and influence (I’m not going back to making phone calls), our only hope as a society is to be more discerning about the information we cede to their powerful platforms and the way they nudge our society to change its priorities and values. The “supervillain” description is obviously reductive, and helps absolve us of our own complicitness in powering the rise of corporations we criticize. As Coogan admits, “You don’t want the Joker’s vision to come true. At some level, I want Amazon’s vision to come true. I want to pick up my phone and have anything in an hour.”"}, {"0a05": "But hand-wringing about the economic and moral implications of our tech overlords is a topic for another day. We’re here to talk supervillains. Which of these entrepreneurs has the right background, demeanor, and tool set to bellow, “I am the one who knocks!” right before they unleash digital Armageddon upon us all? Let’s investigate."}, {"6766": "Mark Zuckerberg — CEO of Facebook"}, {"fe62": "Dark Origin Story: All he wanted to do was drink beer, rate hot chicks, and Poke people. But Facebook users kept pouring in, even when he purposefully misused their data again and again. The day he attained his 1 billionth user was the day he decided he’d connect everyone in the world, whether they wanted to be or not."}, {"cd51": "Villainous Traits: Harvard student; eats toast like an automaton; shameless copycat."}, {"9f4c": "Most Villainous Moment: When he was still at Harvard, Zuckerberg bragged that he had access to pictures, emails, and addresses of thousands of Facebook users who were “dumb fucks” for trusting him."}, {"2421": "Doomsday Device: The News Feed, which has the ability to affect people’s moods (and elections), could be weaponized by Zuckerberg to unleash an unprecedented FOMO outbreak."}, {"e705": "How to Stop Him: Install an ad blocker."}, {"ceb3": "Elon Musk — CEO of Tesla, SpaceX"}, {"05e6": "Dark Origin Story: “As they danced at their wedding reception, Justine later recalled, Musk informed her, ‘I am the alpha in this relationship.’”"}, {"1838": "Villainous Traits: A little too eager to find an escape route off of planet Earth; know-it-all; eventually wants to control the power grid."}, {"37c7": "Most Villainous Moment: Musk called the death of a Tesla driver who crashed using the vehicle’s autopilot mode a “statistical inevitability,” which is a very Agent Smith thing to say."}, {"476a": "Doomsday Device: Neuralink, a nascent startup with an aim to implant electrodes into the human brain to treat mental disorders, download thoughts, and elevate human consciousness with the aid of artificial intelligence."}, {"c609": "How to Stop Him: Send him a paradoxical riddle on Twitter that will confound him for the rest of his days."}, {"a37c": "Travis Kalanick — CEO of Uber"}, {"7bce": "Dark Origin Story: A moderately successful tech entrepreneur decides that he and his friends should be able to “roll around San Francisco like ballers.” He builds a $68 billion corporation and workplace environment around the simple premise: Is this baller?"}, {"b0db": "Villainous Traits: Way too into Ayn Rand; once had an internal Uber feature called “God View.”"}, {"2bd1": "Most Villainous Moment: A secretly recorded video wherein he upbraids an Uber driver asking for more pay because “some people don’t like to take responsibility for their own shit.”"}, {"4346": "Doomsday Device: Once Uber starts earning defense contracts to build self-driving tanks, Kalanick’s evil plot will be set in motion."}, {"9bda": "How to Stop Him: Lyft."}, {"329f": "Jeff Bezos — CEO of Amazon"}, {"a984": "Dark Origin Story: The first book Amazon ever sold was Machiavelli’s The Prince."}, {"27c0": "Villainous Traits: Bald; building an army of flying robots; made his grandma cry."}, {"649b": "Most Villainous Moment: Got to go back to that image of him gleefully controlling a horrifying robot mech."}, {"c251": "Doomsday Device: On next year’s Prime Day, he will offer all products for 50 percent off. After customers irrationally empty their bank accounts in the pursuit of deals, he will fulfill zero orders as he makes off with the entirety of the United States GDP."}, {"fd11": "How to Stop Him: Surmount your crippling need to avoid human interaction in physical stores."}, {"330b": "Larry Page — CEO of Alphabet"}, {"8de7": "Dark Origin Story: As a student at Stanford, he was forced to use the clumsy AltaVista search engine. The experience inspired him to launch Google, but it also filled him with a quiet inner rage at all forms of inefficiency, which he’ll probably instill in his humanity-extinguishing AI at some point or another"}, {"d5c5": "Villainous Traits: He could look up every webpage you’ve ever browsed; he says he would never do that, but you know he could, and that’s what gives him his terrifying power."}, {"0f6c": "Most Villainous Moment: Acquiring Boston Dynamics, a company whose primary function is to make monstrous robots."}, {"7d4e": "Doomsday Device: The “Don’t Be Evil” button he keeps on his keychain at all times."}, {"b27d": "How to Stop Him: Start using Allo en masse so Page stops building killer robots to refocus on his true lifelong dream — creating a popular chat app."}, {"58b5": "Bill Gates — Founder and Former CEO of Microsoft"}, {"6ee3": "Dark Origin Story: He feasted on the corpses of ’90s tech companies (RIP, Netscape), then claimed to have found a new calling as a big-hearted philanthropist. But the taste for the blood of startups never left him …"}, {"ae51": "Villainous Traits: Allowed Windows Vista to happen; had an Igor-like henchman in the form of Steve Ballmer; fought the feds."}, {"1e06": "Most Villainous Moment: Creating a hulking, black video game console to put Nintendo out of business and calling it “Xbox.”"}, {"e7ad": "Doomsday Device: Holding the vast majority of the world’s computers hostage via a never-ending Windows security update."}, {"2974": "How to Stop Him: Pray that Mark Zuckerberg uses his own philanthropy initiative to pull Gates into a war of benevolence."}, {"fdea": "Peter Thiel — Cofounder of Paypal, Palantir"}, {"a2b0": "Dark Origin Story: Formed a Mafia out of an online-payments platform."}, {"dd96": "Villainous Traits: Tried to build an actual lair in the form of a floating island city; deeply wounded by snark; Palantir."}, {"f3c4": "Most Villainous Moment: 2016."}, {"e57c": "Doomsday Device: C’mon, this is a freebie."}, {"aa3a": "How to Stop Him: Trick him with a War of the Worlds–type apocalyptic broadcast so that he retreats into his military-grade bomb shelter for 30 years to avoid nuclear fallout and poor people."}], "content": "Which Tech CEO Would Make the Best Supervillain? Technology’s greatest minds gone bad No one is born a supervillain. Harvey Dent was a celebrated district attorney in Gotham City. Dr. Otto Octavius wanted to bring boundless energy to the world via nuclear fusion. Kanye West gave us “Through the Wire.” Who knew, when these men were achieving great things in law, science, and culture, the havoc they would ultimately wreak? It’s a time-tested fact that anyone, if given too much power, will eventually use it to eat the world. What reason is there to think that today’s Silicon Valley plutocrats are any different? Mark Zuckerberg released a manifesto last month arguing that Facebook can become more powerful than any nation-state. Elon Musk thinks that Alphabet CEO Larry Page could be the harbinger of the robot apocalypse — but Musk also wants to implant chips in our brains to turn us into walking supercomputers and may be using Google as a distraction from his actual nefarious plot. Meanwhile, Jeff Bezos is riding around in giant robot mechs and probably laughing maniacally in that way we all assume Jeff Bezos laughs. All of these men, as well as their companies, have been ascribed half-jesting supervillain status in articles, talk-show bits, and tweets at some point or another. The notion of the CEO as a cartoonishly extravagant evildoer entered the pop culture consciousness in the 1980s, when Reaganomics and Wall Street turned the wealth gap into a chasm. In Man of Steel, the 1986 comic book reboot of Superman, writer and artist John Byrne transformed Lex Luthor from a mad scientist into a power-hungry corporate executive. The rebranding stuck — in 2016’s Batman vs. Superman, Luthor is a tech billionaire in sneakers played by Jesse Eisenberg. “Supervillains — like the superheroes against whom they battle — are these larger-than-life characters,” Carol Tilley, a professor at the University of Illinois at Urbana-Champaign and senior vice president of the Comics Studies Society, told me in an email. “Often their goal is to control the world, and they eagerly use their extraordinary wealth or intelligence (or sometimes other traits) to that end. Because of their entrepreneurial vision and success, folks like Jeff Bezos and Mark Zuckerberg seem well positioned to be cast as supervillains. Their entrepreneurial focus is on products that have wide — sometimes worldwide — appeal but also cause us to question social and cultural norms.” It’s the highly disruptive nature of Silicon Valley’s inventors that makes them easy to perceive as villains. No one is quite sure how these companies’ mysterious algorithms work, or what the world will look like once their plans have been fully realized. “The grandiosity of their vision is one of the things that makes them seem like they’re villainous,” says Peter Coogan, author of Superhero: The Secret Origin of a Genre. “Corporations are a power center now, and people feel they can’t control them. And when you feel you can’t control something, that’s when you go for magic.” Over the last decade, we’ve collectively bestowed never-before-seen capital, unfettered access to personal data, and remote control over billions of devices to, like, 10 dudes. Since there’s no way to undo this unprecedented consolidation of power and influence (I’m not going back to making phone calls), our only hope as a society is to be more discerning about the information we cede to their powerful platforms and the way they nudge our society to change its priorities and values. The “supervillain” description is obviously reductive, and helps absolve us of our own complicitness in powering the rise of corporations we criticize. As Coogan admits, “You don’t want the Joker’s vision to come true. At some level, I want Amazon’s vision to come true. I want to pick up my phone and have anything in an hour.” But hand-wringing about the economic and moral implications of our tech overlords is a topic for another day. We’re here to talk supervillains. Which of these entrepreneurs has the right background, demeanor, and tool set to bellow, “I am the one who knocks!” right before they unleash digital Armageddon upon us all? Let’s investigate. Mark Zuckerberg — CEO of Facebook Dark Origin Story: All he wanted to do was drink beer, rate hot chicks, and Poke people. But Facebook users kept pouring in, even when he purposefully misused their data again and again. The day he attained his 1 billionth user was the day he decided he’d connect everyone in the world, whether they wanted to be or not. Villainous Traits: Harvard student; eats toast like an automaton; shameless copycat. Most Villainous Moment: When he was still at Harvard, Zuckerberg bragged that he had access to pictures, emails, and addresses of thousands of Facebook users who were “dumb fucks” for trusting him. Doomsday Device: The News Feed, which has the ability to affect people’s moods (and elections), could be weaponized by Zuckerberg to unleash an unprecedented FOMO outbreak. How to Stop Him: Install an ad blocker. Elon Musk — CEO of Tesla, SpaceX Dark Origin Story: “As they danced at their wedding reception, Justine later recalled, Musk informed her, ‘I am the alpha in this relationship.’” Villainous Traits: A little too eager to find an escape route off of planet Earth; know-it-all; eventually wants to control the power grid. Most Villainous Moment: Musk called the death of a Tesla driver who crashed using the vehicle’s autopilot mode a “statistical inevitability,” which is a very Agent Smith thing to say. Doomsday Device: Neuralink, a nascent startup with an aim to implant electrodes into the human brain to treat mental disorders, download thoughts, and elevate human consciousness with the aid of artificial intelligence. How to Stop Him: Send him a paradoxical riddle on Twitter that will confound him for the rest of his days. Travis Kalanick — CEO of Uber Dark Origin Story: A moderately successful tech entrepreneur decides that he and his friends should be able to “roll around San Francisco like ballers.” He builds a $68 billion corporation and workplace environment around the simple premise: Is this baller? Villainous Traits: Way too into Ayn Rand; once had an internal Uber feature called “God View.” Most Villainous Moment: A secretly recorded video wherein he upbraids an Uber driver asking for more pay because “some people don’t like to take responsibility for their own shit.” Doomsday Device: Once Uber starts earning defense contracts to build self-driving tanks, Kalanick’s evil plot will be set in motion. How to Stop Him: Lyft. Jeff Bezos — CEO of Amazon Dark Origin Story: The first book Amazon ever sold was Machiavelli’s The Prince. Villainous Traits: Bald; building an army of flying robots; made his grandma cry. Most Villainous Moment: Got to go back to that image of him gleefully controlling a horrifying robot mech. Doomsday Device: On next year’s Prime Day, he will offer all products for 50 percent off. After customers irrationally empty their bank accounts in the pursuit of deals, he will fulfill zero orders as he makes off with the entirety of the United States GDP. How to Stop Him: Surmount your crippling need to avoid human interaction in physical stores. Larry Page — CEO of Alphabet Dark Origin Story: As a student at Stanford, he was forced to use the clumsy AltaVista search engine. The experience inspired him to launch Google, but it also filled him with a quiet inner rage at all forms of inefficiency, which he’ll probably instill in his humanity-extinguishing AI at some point or another Villainous Traits: He could look up every webpage you’ve ever browsed; he says he would never do that, but you know he could, and that’s what gives him his terrifying power. Most Villainous Moment: Acquiring Boston Dynamics, a company whose primary function is to make monstrous robots. Doomsday Device: The “Don’t Be Evil” button he keeps on his keychain at all times. How to Stop Him: Start using Allo en masse so Page stops building killer robots to refocus on his true lifelong dream — creating a popular chat app. Bill Gates — Founder and Former CEO of Microsoft Dark Origin Story: He feasted on the corpses of ’90s tech companies (RIP, Netscape), then claimed to have found a new calling as a big-hearted philanthropist. But the taste for the blood of startups never left him … Villainous Traits: Allowed Windows Vista to happen; had an Igor-like henchman in the form of Steve Ballmer; fought the feds. Most Villainous Moment: Creating a hulking, black video game console to put Nintendo out of business and calling it “Xbox.” Doomsday Device: Holding the vast majority of the world’s computers hostage via a never-ending Windows security update. How to Stop Him: Pray that Mark Zuckerberg uses his own philanthropy initiative to pull Gates into a war of benevolence. Peter Thiel — Cofounder of Paypal, Palantir Dark Origin Story: Formed a Mafia out of an online-payments platform. Villainous Traits: Tried to build an actual lair in the form of a floating island city; deeply wounded by snark; Palantir. Most Villainous Moment: 2016. Doomsday Device: C’mon, this is a freebie. How to Stop Him: Trick him with a War of the Worlds–type apocalyptic broadcast so that he retreats into his military-grade bomb shelter for 30 years to avoid nuclear fallout and poor people. ", "child": "1336_1\t1336_2\t1336_3\t1336_4\t1336_5\t1336_6\t1336_7\t1336_8\t1336_9\t1336_10\t1336_11\t1336_12\t1336_13\t1336_14\t1336_15\t1336_16\t1336_17\t1336_18\t1336_19\t1336_20\t1336_21\t1336_22\t1336_23\t1336_24\t1336_25"}