{"name": "1337", "parent": "", "title": "How Elon Musk Learns Faster And Better Than Everyone Else", "sentences": [{"09d6": "How Elon Musk Learns Faster And Better Than Everyone Else"}, {"9694": "How is it even possible that Elon Musk could build four multibillion companies by his mid-40s — in four separate fields (software, energy, transportation, and aerospace)?"}, {"1b2a": "To explain Musk’s success, others have pointed to his heroic work ethic (he regularly works 85-hour weeks), his ability to set reality-distorting visions for the future, and his incredible resilience."}, {"38b0": "But all of these felt unsatisfactory to me. Plenty of people have these traits. I wanted to know what he did differently."}, {"dadb": "As I kept reading dozens of articles, videos, and books about Musk, I noticed a huge piece of the puzzle was missing. Conventional wisdom says that in order to become world-class, we should only focus on one field. Musk breaks that rule. His expertise ranges from rocket science, engineering, physics, and artificial intelligence to solar power and energy."}, {"cca8": "In a previous article, I call people like Elon Musk “expert-generalists” (a term coined by Orit Gadiesh, chairman of Bain & Company). Expert-generalists study widely in many different fields, understand deeper principles that connect those fields, and then apply the principles to their core specialty."}, {"4bd9": "Based on my review of Musk’s life and the academic literature related to learning and expertise, I’m convinced that we should ALL learn across multiple fields in order to increase our odds of breakthrough success."}, {"4c61": "The jack of all trades myth"}, {"8f85": "If you’re someone who loves learning in different areas, you’re probably familiar with this well-intentioned advice:"}, {"5fa3": "“Grow up. Focus on just one field.”"}, {"8de8": "“Jack of all trades. Master of none.” The implicit assumption is that if you study in multiple areas, you’ll only learn at a surface level, never gain mastery."}, {"3c28": "The success of expert-generalists throughout time shows that this is wrong.Learning across multiple fields provides an information advantage (and therefore an innovation advantage) because most people focus on just one field."}, {"743a": "For example, if you’re in the tech industry and everyone else is just reading tech publications, but you also know a lot about biology, you have the ability to come up with ideas that almost no one else could. Vice-versa. If you’re in biology, but you you also understand artificial intelligence, you have an information advantage over everyone else who stays siloed."}, {"9027": "Despite this basic insight, few people actually learn beyond their industry."}, {"f986": "Each new field we learn that is unfamiliar to others in our field gives us the ability to make combinations that they can’t. This is the expert-generalist advantage."}, {"8958": "One fascinating study echoes this insight. It examined how the top 59 opera composers of the 20th century mastered their craft. Counter to the conventional narrative that success of top performers can solely be explained by deliberate practice and specialization, the researcher Dean Keith Simonton found the exact opposite: “The compositions of the most successful operatic composers tended to represent a mix of genres…composers were able to avoid the inflexibility of too much expertise(overtraining) by cross-training,” summarizes UPENN researcher Scott Barry Kaufman in a Scientific American article."}, {"8cb7": "Musk’s “learning transfer” superpower"}, {"33ee": "Starting from his early teenage years, Musk would read through two books per day in various disciplines according to his brother, Kimbal Musk. To put that context, if you read one book a month, Musk would read 60 times as many books as you."}, {"1068": "At first, Musk’s reading spanned science fiction, philosophy, religion, programming, and biographies of scientists, engineers, and entrepreneurs.As he got older, his reading and career interests spread to physics, engineering, product design, business, technology, and energy. This thirst for knowledge allowed him to get exposed to a variety of subjects he had never necessarily learned about in school."}, {"15c0": "Elon Musk is also good at a very specific type of learning that most others aren’t even aware of — learning transfer."}, {"4aa3": "Learning transfer is taking what we learn in one context and applying it to another. It can be taking a kernel of what we learn in school or in a book and applying it to the “real world.” It can also be taking what we learn in one industry and applying it to another."}, {"fc6b": "This is where Musk shines. Several of his interviews show that he has a unique two-step process for fostering learning transfer."}, {"1d91": "Side note: Want to take your learning routine to the next level? I created a free learning how to learn webinar you might like."}, {"f6aa": "First, he deconstructs knowledge into fundamental principles"}, {"1f75": "Musk’s answer on a Reddit AMA describes how he does that:"}, {"65e1": "It is important to view knowledge as sort of a semantic tree — make sure you understand the fundamental principles, i.e. the trunk and big branches, before you get into the leaves/details or there is nothing for them to hang onto."}, {"0550": "Research suggests that turning your knowledge into deeper, abstract principles facilitates learning transfer. Research also suggests that one technique is particularly powerful for helping people intuit underlying principles. This technique is called, “contrasting cases.”"}, {"f2b1": "Here’s how it works: Let’s say you want to deconstruct the letter “A” and understand the deeper principle of what makes an “A” an A. Let’s further say that you have two approaches you could use to do this:"}, {"1a32": "Which approach do you think would work better?"}, {"d76b": "Approach #1. Each different A in Approach #1 gives more insight into what stays the same and what differs between each A. Each A in Approach #2 gives us no insight."}, {"3648": "By looking at lots of diverse cases when we learn anything, we begin tointuit what is essential and even craft our own unique combinations."}, {"0439": "What does this mean in our day-to-day life? When we’re jumping into a new field, we shouldn’t just take one approach or best practice. We shouldexplore lots of different approaches, deconstruct each one, and thencompare and contrast them. This will help us uncover underlying principles."}, {"07cb": "Next, he reconstructs the fundamental principles in new fields"}, {"be8d": "Step two of Musk’s learning transfer process involves reconstructing the foundational principles he’s learned in artificial intelligence, technology, physics, and engineering into separate fields:"}, {"54d2": "Keith Holyoak, a UCLA professor of psychology and one of the world’s leading thinkers on analogical reasoning, recommends people ask themselves the following two questions in order to hone their skills: “Whatdoes this remind me of?” and “Why does it remind me of it?”"}, {"a68a": "By constantly looking at objects in your environment and material you read and asking yourself these two questions, you build the muscles in your brain that help you make connections across traditional boundaries."}, {"6d35": "Bottom line: It’s not magic. It’s just the right learning process"}, {"df46": "Now, we can begin to understand how Musk has become a world-classexpert-generalist:"}, {"7172": "At the deepest level, what we can learn from Elon Musk’s story is that weshouldn’t accept the dogma that specialization is the best or only path toward career success and impact. Legendary expert-generalist Buckminster Fuller summarizes a shift in thinking we should all consider. He shared it decades ago, but it’s just as relevant today:"}, {"6aa7": "“We are in an age that assumes that the narrowing trends of specialization to be logical, natural, and desirable… In the meantime, humanity has been deprived of comprehensive understanding. Specialization has bred feelings of isolation, futility, and confusion in individuals. It has also resulted in the individual’s leaving responsibility for thinking and social action to others.Specialization breeds biases that ultimately aggregate as international and ideological discord, which in turn leads to war.”"}, {"9d9a": "If we put in the time and learn core concepts across fields and always relate those concepts back to our life and the world, transferring between areas becomes much easier and faster."}, {"369f": "As we build up a reservoir of “first principles” and associate those principles with different fields, we suddenly gain the superpower of being able to go into a new field we’ve never learned before, and quickly make unique contributions."}, {"9dcd": "Understanding Elon’s learning superpowers helps us gain some insight into how he could go into an industry that has been around for more than 100 years and change the whole basis of how the field competes."}, {"02ce": "Elon Musk is one of a kind, but his abilities aren’t magical."}, {"c2d2": "Want to take to learn like Musk? I created a free learning how to learn webinar you might like. It’s based on the learning best practices of the world’s top entrepreneurs."}, {"6229": "– Michael Simmons is a serial entrepreneur and writes at MichaelDSimmons.com, and Ian Chew is a director at Empact."}], "content": "How Elon Musk Learns Faster And Better Than Everyone Else How is it even possible that Elon Musk could build four multibillion companies by his mid-40s — in four separate fields (software, energy, transportation, and aerospace)? To explain Musk’s success, others have pointed to his heroic work ethic (he regularly works 85-hour weeks), his ability to set reality-distorting visions for the future, and his incredible resilience. But all of these felt unsatisfactory to me. Plenty of people have these traits. I wanted to know what he did differently. As I kept reading dozens of articles, videos, and books about Musk, I noticed a huge piece of the puzzle was missing. Conventional wisdom says that in order to become world-class, we should only focus on one field. Musk breaks that rule. His expertise ranges from rocket science, engineering, physics, and artificial intelligence to solar power and energy. In a previous article, I call people like Elon Musk “expert-generalists” (a term coined by Orit Gadiesh, chairman of Bain & Company). Expert-generalists study widely in many different fields, understand deeper principles that connect those fields, and then apply the principles to their core specialty. Based on my review of Musk’s life and the academic literature related to learning and expertise, I’m convinced that we should ALL learn across multiple fields in order to increase our odds of breakthrough success. The jack of all trades myth If you’re someone who loves learning in different areas, you’re probably familiar with this well-intentioned advice: “Grow up. Focus on just one field.” “Jack of all trades. Master of none.” The implicit assumption is that if you study in multiple areas, you’ll only learn at a surface level, never gain mastery. The success of expert-generalists throughout time shows that this is wrong.Learning across multiple fields provides an information advantage (and therefore an innovation advantage) because most people focus on just one field. For example, if you’re in the tech industry and everyone else is just reading tech publications, but you also know a lot about biology, you have the ability to come up with ideas that almost no one else could. Vice-versa. If you’re in biology, but you you also understand artificial intelligence, you have an information advantage over everyone else who stays siloed. Despite this basic insight, few people actually learn beyond their industry. Each new field we learn that is unfamiliar to others in our field gives us the ability to make combinations that they can’t. This is the expert-generalist advantage. One fascinating study echoes this insight. It examined how the top 59 opera composers of the 20th century mastered their craft. Counter to the conventional narrative that success of top performers can solely be explained by deliberate practice and specialization, the researcher Dean Keith Simonton found the exact opposite: “The compositions of the most successful operatic composers tended to represent a mix of genres…composers were able to avoid the inflexibility of too much expertise(overtraining) by cross-training,” summarizes UPENN researcher Scott Barry Kaufman in a Scientific American article. Musk’s “learning transfer” superpower Starting from his early teenage years, Musk would read through two books per day in various disciplines according to his brother, Kimbal Musk. To put that context, if you read one book a month, Musk would read 60 times as many books as you. At first, Musk’s reading spanned science fiction, philosophy, religion, programming, and biographies of scientists, engineers, and entrepreneurs.As he got older, his reading and career interests spread to physics, engineering, product design, business, technology, and energy. This thirst for knowledge allowed him to get exposed to a variety of subjects he had never necessarily learned about in school. Elon Musk is also good at a very specific type of learning that most others aren’t even aware of — learning transfer. Learning transfer is taking what we learn in one context and applying it to another. It can be taking a kernel of what we learn in school or in a book and applying it to the “real world.” It can also be taking what we learn in one industry and applying it to another. This is where Musk shines. Several of his interviews show that he has a unique two-step process for fostering learning transfer. Side note: Want to take your learning routine to the next level? I created a free learning how to learn webinar you might like. First, he deconstructs knowledge into fundamental principles Musk’s answer on a Reddit AMA describes how he does that: It is important to view knowledge as sort of a semantic tree — make sure you understand the fundamental principles, i.e. the trunk and big branches, before you get into the leaves/details or there is nothing for them to hang onto. Research suggests that turning your knowledge into deeper, abstract principles facilitates learning transfer. Research also suggests that one technique is particularly powerful for helping people intuit underlying principles. This technique is called, “contrasting cases.” Here’s how it works: Let’s say you want to deconstruct the letter “A” and understand the deeper principle of what makes an “A” an A. Let’s further say that you have two approaches you could use to do this: Which approach do you think would work better? Approach #1. Each different A in Approach #1 gives more insight into what stays the same and what differs between each A. Each A in Approach #2 gives us no insight. By looking at lots of diverse cases when we learn anything, we begin tointuit what is essential and even craft our own unique combinations. What does this mean in our day-to-day life? When we’re jumping into a new field, we shouldn’t just take one approach or best practice. We shouldexplore lots of different approaches, deconstruct each one, and thencompare and contrast them. This will help us uncover underlying principles. Next, he reconstructs the fundamental principles in new fields Step two of Musk’s learning transfer process involves reconstructing the foundational principles he’s learned in artificial intelligence, technology, physics, and engineering into separate fields: Keith Holyoak, a UCLA professor of psychology and one of the world’s leading thinkers on analogical reasoning, recommends people ask themselves the following two questions in order to hone their skills: “Whatdoes this remind me of?” and “Why does it remind me of it?” By constantly looking at objects in your environment and material you read and asking yourself these two questions, you build the muscles in your brain that help you make connections across traditional boundaries. Bottom line: It’s not magic. It’s just the right learning process Now, we can begin to understand how Musk has become a world-classexpert-generalist: At the deepest level, what we can learn from Elon Musk’s story is that weshouldn’t accept the dogma that specialization is the best or only path toward career success and impact. Legendary expert-generalist Buckminster Fuller summarizes a shift in thinking we should all consider. He shared it decades ago, but it’s just as relevant today: “We are in an age that assumes that the narrowing trends of specialization to be logical, natural, and desirable… In the meantime, humanity has been deprived of comprehensive understanding. Specialization has bred feelings of isolation, futility, and confusion in individuals. It has also resulted in the individual’s leaving responsibility for thinking and social action to others.Specialization breeds biases that ultimately aggregate as international and ideological discord, which in turn leads to war.” If we put in the time and learn core concepts across fields and always relate those concepts back to our life and the world, transferring between areas becomes much easier and faster. As we build up a reservoir of “first principles” and associate those principles with different fields, we suddenly gain the superpower of being able to go into a new field we’ve never learned before, and quickly make unique contributions. Understanding Elon’s learning superpowers helps us gain some insight into how he could go into an industry that has been around for more than 100 years and change the whole basis of how the field competes. Elon Musk is one of a kind, but his abilities aren’t magical. Want to take to learn like Musk? I created a free learning how to learn webinar you might like. It’s based on the learning best practices of the world’s top entrepreneurs. – Michael Simmons is a serial entrepreneur and writes at MichaelDSimmons.com, and Ian Chew is a director at Empact. ", "child": "1337_1\t1337_2\t1337_3"}