{"name": "1347", "parent": "", "title": "You Need to Give Up These Toxic Mental Habits If You Want To Be Exceptionally Successful", "sentences": [{"985f": "You Need to Give Up These Toxic Mental Habits If You Want To Be Exceptionally Successful"}, {"8a69": "More than anything, your thoughts determine your success."}, {"5368": "If Oprah had a negative mindset, her empire would’ve never gotten off the ground, and Steve Jobs would’ve been yet another burnt out and fired Founder if it wasn’t for his determined thinking."}, {"86ea": "Granted, you’re probably not walking around like Eeyore — but who couldn’t use some more success?"}, {"a759": "Making these simple mindset changes can help you achieve the radical success you’re after. Bonus: They’re easier to implement than you may think. Check them out for yourself:"}, {"17e7": "Ditch Impostor Syndrome"}, {"8ba9": "Do you suffer from “impostor syndrome”? According to the Caltech Counseling Institute, it’s “a collection of feelings of inadequacy that persist even in face of information that indicates that the opposite is true.” Some of the symptoms of impostor syndrome include discounting success, such as by attributing it to dumb luck."}, {"ea69": "Even when all signs point towards victory, feelings of doubt can imprison you in a self-imposed illusion of failure. Successful people know how to block these thoughts out and achieve their victories, and know that letting even a bit of impostor syndrome seep in can put into peril everything that they’ve worked so hard to accomplish."}, {"ee0a": "Stop trying to please everyone"}, {"31fd": "The great Tina Fey once said, “Don’t waste your energy trying to change opinions… do your thing, and don’t care if they like it.”"}, {"e53a": "As someone who was called “crazy” for opening my own firm, I wholeheartedly agree. It’s impossible to please everybody, especially when it comes to your own success. Almost every success story involved a lot of scathing criticism, so don’t let it get to your head. The mantra that helps me through criticism, and one you should instill in your head is, “no is just someone’s opinion.”"}, {"9fe9": "Destroy Envy"}, {"a620": "“To change bad habits, we must study the habits of successful role models,” said Jack Canfield, entrepreneur, motivational speaker, and author of The Success Principles."}, {"e49a": "How many times have you done the opposite of this, and found yourself jealous of someone else, maybe without even realizing it?"}, {"465b": "Our natural tendency when we see people who have more success is to envy them. Sometimes this envy can turn into belittling their achievements: “She only got that promotion because she’s related to the CMO.”"}, {"b597": "Successful people, however, refuse to let envy take over. They train themselves to remember that there’s always more to someone’s story than meets the eye, and they use this perspective to feel genuinely happy for others who achieve success. Even better, they find a mentor (or a few) to inspire them to reach higher, and you can too."}, {"a9e7": "Turn gut reactions into level-headed thinking"}, {"1a69": "While many of us face the urge to procrastinate tasks, there’s a contrasting mindset that’s just as easy to fall into: Making rash decisions based on emotions."}, {"bcdc": "But, as the popular saying goes: “Don’t make a permanent decision from your temporary emotion.”"}, {"1cbb": "In my many years in finance, I’ve seen people throw decades of financial planning out the window because of their emotions. And it’s beyond easy to do this in a stressful workplace too."}, {"e5ae": "When successful people find themselves in situations where they’re extremely angry, sad, or frustrated, they let themselves ride out those emotions without acting on them. The simple act of waiting to make a decision until you’ve returned to a levelheaded state can play a huge role in the success you achieve."}, {"d2ff": "Turn defensiveness into curiosity"}, {"7a17": "Raise your hand if you just love getting feedback and critiques."}, {"d0d6": "No one?"}, {"bca2": "Okay, so maybe hearing criticism is a little difficult for all of us. But, in order to become more successful, it’s necessary. And, to become radically successful, you may even need to start asking for feedback."}, {"fdb0": "Forbes found a strong correlation between leaders who asked for feedback and leaders ranked highest for effectiveness. Leaders who were in the lower 10% of people who asked for feedback were only ranked as 17% effective by their peers and employees. Meanwhile, leaders who were in the top 10% of people who asked for feedback received an average effectiveness rating of 83%."}, {"2c02": "Rather than fearing feedback and defending any critiques, try to be curious of how others view your performance. This curiosity and the process of asking for feedback can be difficult, but ultimately it will provide insight that could be the difference between reaching your goals and falling short."}, {"f3a9": "End the Fixed Mindset"}, {"e3c1": "Studies have found that shifting from a fixed mindset to a growth mindset results in radical success. If you aren’t familiar with these terms: A growth mindset is one that believes intelligence and skill can be developed, while a fixed mindset is one that believes intelligence and skill are static."}, {"1617": "A person with a fixed mindset is likely to think, “I’m a naturally talented writer, so it’s likely that I will achieve great things in the writing field.” While, at first, there may seem to be nothing wrong with this mindset, it only applies to one niche. This same person’s fixed mindset will also think, “I’m not naturally talented at public speaking, so it’s unlikely that I will achieve great things in public speaking.”"}, {"acc8": "Having a fixed mindset will convince you that you can’t succeed before you even try, while implementing a growth mindset will encourage you to put in the time and effort to succeed. So start shifting your thinking towards growth today."}, {"0ff5": "Stop Fearing Failure"}, {"58f4": "It doesn’t matter how successful a person becomes — failure will always be a part of their daily life. Why? Successful people try, and sometimes they try without spending weeks weighing every possible failure."}, {"2e1c": "Amelia Earhart simplified the case for simply getting out there and trying: “The most effective way to do it, is to do it.”"}, {"f87d": "Successful people live this quote out every day, taking their ideas and putting them into action. They know full well that they may not get the outcome they’re looking for (this time), but that the mere act of trying will teach them so much more than sitting on the sidelines ever could."}, {"310e": "Just like change and challenges, you need to realize failure is inevitable in life. By making this a daily mental habit, you’ll see your success soar."}, {"95e3": "Call to action"}, {"42fa": "If you liked these tips, check out my website for more, and follow me on Medium."}, {"07ab": "If you have any tips on developing positive mindsets and ditching negative ones, I’d love to hear them!"}], "content": "You Need to Give Up These Toxic Mental Habits If You Want To Be Exceptionally Successful More than anything, your thoughts determine your success. If Oprah had a negative mindset, her empire would’ve never gotten off the ground, and Steve Jobs would’ve been yet another burnt out and fired Founder if it wasn’t for his determined thinking. Granted, you’re probably not walking around like Eeyore — but who couldn’t use some more success? Making these simple mindset changes can help you achieve the radical success you’re after. Bonus: They’re easier to implement than you may think. Check them out for yourself: Ditch Impostor Syndrome Do you suffer from “impostor syndrome”? According to the Caltech Counseling Institute, it’s “a collection of feelings of inadequacy that persist even in face of information that indicates that the opposite is true.” Some of the symptoms of impostor syndrome include discounting success, such as by attributing it to dumb luck. Even when all signs point towards victory, feelings of doubt can imprison you in a self-imposed illusion of failure. Successful people know how to block these thoughts out and achieve their victories, and know that letting even a bit of impostor syndrome seep in can put into peril everything that they’ve worked so hard to accomplish. Stop trying to please everyone The great Tina Fey once said, “Don’t waste your energy trying to change opinions… do your thing, and don’t care if they like it.” As someone who was called “crazy” for opening my own firm, I wholeheartedly agree. It’s impossible to please everybody, especially when it comes to your own success. Almost every success story involved a lot of scathing criticism, so don’t let it get to your head. The mantra that helps me through criticism, and one you should instill in your head is, “no is just someone’s opinion.” Destroy Envy “To change bad habits, we must study the habits of successful role models,” said Jack Canfield, entrepreneur, motivational speaker, and author of The Success Principles. How many times have you done the opposite of this, and found yourself jealous of someone else, maybe without even realizing it? Our natural tendency when we see people who have more success is to envy them. Sometimes this envy can turn into belittling their achievements: “She only got that promotion because she’s related to the CMO.” Successful people, however, refuse to let envy take over. They train themselves to remember that there’s always more to someone’s story than meets the eye, and they use this perspective to feel genuinely happy for others who achieve success. Even better, they find a mentor (or a few) to inspire them to reach higher, and you can too. Turn gut reactions into level-headed thinking While many of us face the urge to procrastinate tasks, there’s a contrasting mindset that’s just as easy to fall into: Making rash decisions based on emotions. But, as the popular saying goes: “Don’t make a permanent decision from your temporary emotion.” In my many years in finance, I’ve seen people throw decades of financial planning out the window because of their emotions. And it’s beyond easy to do this in a stressful workplace too. When successful people find themselves in situations where they’re extremely angry, sad, or frustrated, they let themselves ride out those emotions without acting on them. The simple act of waiting to make a decision until you’ve returned to a levelheaded state can play a huge role in the success you achieve. Turn defensiveness into curiosity Raise your hand if you just love getting feedback and critiques. No one? Okay, so maybe hearing criticism is a little difficult for all of us. But, in order to become more successful, it’s necessary. And, to become radically successful, you may even need to start asking for feedback. Forbes found a strong correlation between leaders who asked for feedback and leaders ranked highest for effectiveness. Leaders who were in the lower 10% of people who asked for feedback were only ranked as 17% effective by their peers and employees. Meanwhile, leaders who were in the top 10% of people who asked for feedback received an average effectiveness rating of 83%. Rather than fearing feedback and defending any critiques, try to be curious of how others view your performance. This curiosity and the process of asking for feedback can be difficult, but ultimately it will provide insight that could be the difference between reaching your goals and falling short. End the Fixed Mindset Studies have found that shifting from a fixed mindset to a growth mindset results in radical success. If you aren’t familiar with these terms: A growth mindset is one that believes intelligence and skill can be developed, while a fixed mindset is one that believes intelligence and skill are static. A person with a fixed mindset is likely to think, “I’m a naturally talented writer, so it’s likely that I will achieve great things in the writing field.” While, at first, there may seem to be nothing wrong with this mindset, it only applies to one niche. This same person’s fixed mindset will also think, “I’m not naturally talented at public speaking, so it’s unlikely that I will achieve great things in public speaking.” Having a fixed mindset will convince you that you can’t succeed before you even try, while implementing a growth mindset will encourage you to put in the time and effort to succeed. So start shifting your thinking towards growth today. Stop Fearing Failure It doesn’t matter how successful a person becomes — failure will always be a part of their daily life. Why? Successful people try, and sometimes they try without spending weeks weighing every possible failure. Amelia Earhart simplified the case for simply getting out there and trying: “The most effective way to do it, is to do it.” Successful people live this quote out every day, taking their ideas and putting them into action. They know full well that they may not get the outcome they’re looking for (this time), but that the mere act of trying will teach them so much more than sitting on the sidelines ever could. Just like change and challenges, you need to realize failure is inevitable in life. By making this a daily mental habit, you’ll see your success soar. Call to action If you liked these tips, check out my website for more, and follow me on Medium. If you have any tips on developing positive mindsets and ditching negative ones, I’d love to hear them! ", "child": "1347_1\t1347_2\t1347_3\t1347_4\t1347_5\t1347_6\t1347_7\t1347_8\t1347_9\t1347_10\t1347_11\t1347_12\t1347_13\t1347_14\t1347_15\t1347_16\t1347_17\t1347_18\t1347_19"}