{"name": "1349", "parent": "", "title": "Betsy DeVos rescinds protections for student loan borrowers", "sentences": [{"aa74": "Betsy DeVos rescinds protections for student loan borrowers"}, {"4ec9": "Student loan servicers have a poor track record of helping borrowers pay back their loans."}, {"4cc1": "Education Secretary Betsy DeVos listens during a meeting between President Donald Trump and business leaders in Washington, Tuesday, April 11, 2017. CREDIT: AP/Evan Vucci"}, {"68ec": "On Tuesday, Education Secretary Betsy DeVos reversed Obama administration directives that were supposed to make it easier for borrowers to pay back their student loans."}, {"aa5a": "The guidance helped to hold student loan servicers accountable. Student loan servicers are companies that have contracts with the federal government to manage loan repayments."}, {"4edf": "Former Obama administration Secretary of Education John King put the guidance in place last June. That’s when he asked James Runcie, the chief operating officer of Federal Student Aid to examine student loan servicers’ past performance before renewing the companies’ contracts."}, {"4d0c": "“Improper or abusive customer service speaks to a disregard for student and debtor…”"}, {"c48e": "“Improper or abusive customer service speaks to a disregard for student and debtor needs that does not meet the standards we have set,” King’s guidance read."}, {"d83b": "Through a memorandum, DeVos withdrew that guidance, as well as a directive from former Education Department undersecretary Ted Mitchell that required servicers meet certain standards for responding to and assisting borrowers. That directive set up a single servicing platform for borrowers and provided economic incentives for servicers to ensure high-quality customer service; servicers, in turn, were expected to respond to borrowers in a timely manner, and track borrowers’ requests for assistance."}, {"fdc1": "DeVos justified rescinding the guidance in part by citing the cost of oversight."}, {"7fe3": "“We must create a student loan servicing environment that provides the highest quality customer service and increases accountability and transparency for all borrowers, while also limiting the cost to taxpayers,” DeVos said."}, {"eb61": "The Companies That Collect Your Student Loan Payments Are Doing A Bad Jobthinkprogress.org"}, {"7be6": "Reports from the Government Accountability Office and the Consumer Financial Protection Bureau (CFPB) show that when left to their own devices, servicers often fail to look out for the best interests of borrowers. A 2015 CFPB report on borrowers’ experiences with servicers found that servicers were responsible for major errors, such as putting students in the wrong repayment plans. Servicers also failed to proactively mention income-based repayment plans when borrowers struggles to make payments."}, {"9a4b": "Often, companies would suggest forbearance or deferment or even insist borrowers make the full payment on their loans. A May 2016 GAO report found that some borrowers had difficulty contacting servicers through call centers and that no performance metrics were in place to hold servicers accountable."}, {"91b4": "One of the biggest student loan servicers in the country, Navient, is being sued by the CFPB and Washington state for their allegedly sloppy management of student loan repayments. In response to the suit, Navient responded that “there is no expectation that the servicer will act in the interest of the consumer.”"}, {"0e81": "One in four federal student loan borrowers has Navient as their servicer, according to the CFPB. Thanks to the reversal of this guidance, it’s more likely that Navient will receive a new contract in 2019."}, {"b7de": "Alexis Goldstein, a senior policy analyst at Americans for Financial Reform, told The Wall Street Journal that DeVos is sending a message to servicers that they won’t be held accountable."}, {"dd7e": "“Undoing these memos is a very concerning indication of how much [Department of Education officials] value protecting borrowers versus how much they want to insulate servicers,” Goldstein said."}, {"9782": "On April 4, The National Council of Higher Education Resources, a higher education finance trade association that includes student loan servicers, sent letters to leaders of the House and Senate appropriations committees that were critical of the Obama administration guidance and raised questions about whether the approach would be too expensive, Bloomberg reported."}], "content": "Betsy DeVos rescinds protections for student loan borrowers Student loan servicers have a poor track record of helping borrowers pay back their loans. Education Secretary Betsy DeVos listens during a meeting between President Donald Trump and business leaders in Washington, Tuesday, April 11, 2017. CREDIT: AP/Evan Vucci On Tuesday, Education Secretary Betsy DeVos reversed Obama administration directives that were supposed to make it easier for borrowers to pay back their student loans. The guidance helped to hold student loan servicers accountable. Student loan servicers are companies that have contracts with the federal government to manage loan repayments. Former Obama administration Secretary of Education John King put the guidance in place last June. That’s when he asked James Runcie, the chief operating officer of Federal Student Aid to examine student loan servicers’ past performance before renewing the companies’ contracts. “Improper or abusive customer service speaks to a disregard for student and debtor…” “Improper or abusive customer service speaks to a disregard for student and debtor needs that does not meet the standards we have set,” King’s guidance read. Through a memorandum, DeVos withdrew that guidance, as well as a directive from former Education Department undersecretary Ted Mitchell that required servicers meet certain standards for responding to and assisting borrowers. That directive set up a single servicing platform for borrowers and provided economic incentives for servicers to ensure high-quality customer service; servicers, in turn, were expected to respond to borrowers in a timely manner, and track borrowers’ requests for assistance. DeVos justified rescinding the guidance in part by citing the cost of oversight. “We must create a student loan servicing environment that provides the highest quality customer service and increases accountability and transparency for all borrowers, while also limiting the cost to taxpayers,” DeVos said. The Companies That Collect Your Student Loan Payments Are Doing A Bad Jobthinkprogress.org Reports from the Government Accountability Office and the Consumer Financial Protection Bureau (CFPB) show that when left to their own devices, servicers often fail to look out for the best interests of borrowers. A 2015 CFPB report on borrowers’ experiences with servicers found that servicers were responsible for major errors, such as putting students in the wrong repayment plans. Servicers also failed to proactively mention income-based repayment plans when borrowers struggles to make payments. Often, companies would suggest forbearance or deferment or even insist borrowers make the full payment on their loans. A May 2016 GAO report found that some borrowers had difficulty contacting servicers through call centers and that no performance metrics were in place to hold servicers accountable. One of the biggest student loan servicers in the country, Navient, is being sued by the CFPB and Washington state for their allegedly sloppy management of student loan repayments. In response to the suit, Navient responded that “there is no expectation that the servicer will act in the interest of the consumer.” One in four federal student loan borrowers has Navient as their servicer, according to the CFPB. Thanks to the reversal of this guidance, it’s more likely that Navient will receive a new contract in 2019. Alexis Goldstein, a senior policy analyst at Americans for Financial Reform, told The Wall Street Journal that DeVos is sending a message to servicers that they won’t be held accountable. “Undoing these memos is a very concerning indication of how much [Department of Education officials] value protecting borrowers versus how much they want to insulate servicers,” Goldstein said. On April 4, The National Council of Higher Education Resources, a higher education finance trade association that includes student loan servicers, sent letters to leaders of the House and Senate appropriations committees that were critical of the Obama administration guidance and raised questions about whether the approach would be too expensive, Bloomberg reported. ", "child": "1349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24"}