{"name": "1350", "parent": "", "title": "Steer Your Focus Through the Power of Questions", "sentences": [{"b000": "Steer Your Focus Through the Power of Questions"}, {"ba9a": "“The quality of our questions determine the quality of our life.” Tony Robbins"}, {"7be8": "As humans, we walk through every day shackled to our thoughts and to our feelings. We overthink the past, glance at the present, and create anxiety about the future. Our inner dialogue is so passive at times that events and others tell us what to feel and experience. When we stop ourselves at any one time throughout the day, we will begin to notice that our thoughts are actually just questions we ask:"}, {"d038": "“Why did I do that?”"}, {"3392": "“Why do I feel like crap?”"}, {"5bad": "“Why don’t I have any energy right now?”"}, {"c1c4": "“How could she do that to me?”"}, {"7eed": "“Why do I have to do this project that doesn’t matter to me?”"}, {"b7fb": "“Why don’t I have enough money for that trip?”"}, {"0091": "“How did I let myself get so fat?”"}, {"9413": "“Where did I go wrong?”"}, {"db04": "We need to realize, that what goes through our mind all day is a recurring dialogue of asking and answering questions. What questions we ask ourselves will determine how we feel, what actions we take, and how we interpret all the events that occur in our lives. It’s time that we create a powerful line of questioning and stop allowing negative questions guide our path."}, {"4e24": "Our Default Line of Questioning"}, {"f9c9": "In terms of our waistlines, if you default to eat what the average American eats, you will become overweight or obese. I think we can all agree, this isn’t the ideal state to exist in. The same can be said with our default line of questioning."}, {"6837": "The ideals and expectations we have for ourselves lead us to cross examine our souls with extreme levels of judgement."}, {"6a08": "We are taught to stay inside picture perfect boxes and conform to the way society has been constructed. Popular marketing has taught us that we need to look a certain way, earn a certain amount of money, or have a certain type of relationship."}, {"c7ce": "We ask ourselves:"}, {"0fc5": "“Why don’t I look like that?”"}, {"b22b": "“How can I drive that kind of car?”"}, {"6b45": "“Why doesn’t my relationship have that kind of passion?”"}, {"055e": "When you ask yourself poor questions, you are bound to get poor answers. Poor answers result in a poor life."}, {"269a": "Our default line of questioning tends to lead us to dig up all the negatives about ourselves and others. When we find these answers too often, they will remain and grab a stronger hold of our identities."}, {"b29d": "We must intentionally create positive questions that we contemplate every day. This makes me think of the Stoics walking around and contemplating the meaning of life:"}, {"ef68": "“We should every night call ourselves to an account;"}, {"e2ab": "What infirmity have I mastered today?"}, {"1a34": "What passions opposed? What temptation resisted? What virtue acquired? Our vices will abort of themselves if they be brought every day to the shrift.”"}, {"76c0": "― Seneca"}, {"3afd": "5 Powerful Questions to Start With"}, {"c7d3": "It is said many times over that you can’t be stressed and grateful at the same time. Use this saying to your advantage and create more gratefulness in your life through the constant asking of this question."}, {"1cef": "2. What am I excited about in my life right now?"}, {"50c8": "There has to be something! What get’s your juices flowing? Your engines revving? You floating on air? Focus on that and feel the positive energy run through you."}, {"e37c": "3. How did I serve today?"}, {"75dc": "We can only be of use in this world if we choose to serve others. Ask this question to hold yourself accountable to serving others every day."}, {"df5d": "4. How can I enjoy the process of this?"}, {"3ec0": "Maybe you’re in the middle of a tough relationship, building a business, or some other extremely hard time; ask this question to help guide yourself through with good energy. There are always actions you can take to make it easier and more fulfilling. Maybe it’s making sure you get a good workout in or connecting with a particular person."}, {"d1d5": "5. What can I learn from this?"}, {"2b6a": "In every situation, there is an opportunity to learn a lesson. We must be willing to open our eyes to the teachers and classrooms we walk through every day. What can you learn from your workout, from your road rage, or being late to dinner?"}, {"07f8": "Don’t Dwell on the Question, Answer Then ACT!"}, {"96b5": "“The best time to plant a tree was 20 years ago. But the second best time is today.” Chinese Proverb"}, {"df93": "There is a point in asking all these beautiful questions that we become paralyzed by the weight of the good things we can do. Some people call this paralysis by analysis."}, {"de3d": "Just build the house…Go DO!"}, {"196f": "At some point, you need to turn this great energy we create and turn it into actions. The sooner we can translate this, the better."}, {"139e": "If, for example, you just got a poor review from your manager and you ask yourself, “What can I learn from this?” You shouldn’t let this question consume your every thought for a week; think about it for awhile, but then take an action to better your standing. Plan your next week of work and grab that accountability partner you’ve been meaning to partner with."}, {"95bf": "You can only plan and analyze so much; The real power lies in the DOING."}, {"ac2e": "“Never has there been a map, however carefully executed to detail and scale, which carried its owner over even one inch of ground.” — Og Mandino"}, {"69db": "One Question Can Change Your Life"}, {"b280": "In his famous commencement speech, Steve Jobs revealed a question that he asked himself every morning for over 30 years:"}, {"d579": "“If today were the last day of my life, would I want to do what I’m about to do today?”"}, {"0374": "He follows with, “Whenever the answer has been ‘no’ for too many days in a row, I know I need to change something.”"}, {"1822": "This question guided the leader of Apple, Pixar, and NeXT for his entire professional and personal life. It gave him context about how short life really is and how trivial it can be in the end if you’re too serious about it."}, {"0dc4": "Our questions determine our thoughts and our thoughts become things."}, {"539b": "We must be intentional about the questions we ask ourselves, what powerful question can you focus on today? Ask and you shall receive. Make sure you’re asking the right questions."}, {"a088": "Bonus Questions:"}, {"e684": "“What’s good about this situation?”"}, {"3bc7": "“How can I use this?”"}, {"0709": "Call To Action"}, {"fb52": "Like this post? Find any value in it? If so, I would appreciate you hitting the GREEN HEART so that more people can take action from asking better questions."}, {"99ff": "Visit Project Avocado to get a FREE report on the #1 habit for healthy transformations. Jerry Seinfeld makes an appearance…"}], "content": "Steer Your Focus Through the Power of Questions “The quality of our questions determine the quality of our life.” Tony Robbins As humans, we walk through every day shackled to our thoughts and to our feelings. We overthink the past, glance at the present, and create anxiety about the future. Our inner dialogue is so passive at times that events and others tell us what to feel and experience. When we stop ourselves at any one time throughout the day, we will begin to notice that our thoughts are actually just questions we ask: “Why did I do that?” “Why do I feel like crap?” “Why don’t I have any energy right now?” “How could she do that to me?” “Why do I have to do this project that doesn’t matter to me?” “Why don’t I have enough money for that trip?” “How did I let myself get so fat?” “Where did I go wrong?” We need to realize, that what goes through our mind all day is a recurring dialogue of asking and answering questions. What questions we ask ourselves will determine how we feel, what actions we take, and how we interpret all the events that occur in our lives. It’s time that we create a powerful line of questioning and stop allowing negative questions guide our path. Our Default Line of Questioning In terms of our waistlines, if you default to eat what the average American eats, you will become overweight or obese. I think we can all agree, this isn’t the ideal state to exist in. The same can be said with our default line of questioning. The ideals and expectations we have for ourselves lead us to cross examine our souls with extreme levels of judgement. We are taught to stay inside picture perfect boxes and conform to the way society has been constructed. Popular marketing has taught us that we need to look a certain way, earn a certain amount of money, or have a certain type of relationship. We ask ourselves: “Why don’t I look like that?” “How can I drive that kind of car?” “Why doesn’t my relationship have that kind of passion?” When you ask yourself poor questions, you are bound to get poor answers. Poor answers result in a poor life. Our default line of questioning tends to lead us to dig up all the negatives about ourselves and others. When we find these answers too often, they will remain and grab a stronger hold of our identities. We must intentionally create positive questions that we contemplate every day. This makes me think of the Stoics walking around and contemplating the meaning of life: “We should every night call ourselves to an account; What infirmity have I mastered today? What passions opposed? What temptation resisted? What virtue acquired? Our vices will abort of themselves if they be brought every day to the shrift.” ― Seneca 5 Powerful Questions to Start With It is said many times over that you can’t be stressed and grateful at the same time. Use this saying to your advantage and create more gratefulness in your life through the constant asking of this question. 2. What am I excited about in my life right now? There has to be something! What get’s your juices flowing? Your engines revving? You floating on air? Focus on that and feel the positive energy run through you. 3. How did I serve today? We can only be of use in this world if we choose to serve others. Ask this question to hold yourself accountable to serving others every day. 4. How can I enjoy the process of this? Maybe you’re in the middle of a tough relationship, building a business, or some other extremely hard time; ask this question to help guide yourself through with good energy. There are always actions you can take to make it easier and more fulfilling. Maybe it’s making sure you get a good workout in or connecting with a particular person. 5. What can I learn from this? In every situation, there is an opportunity to learn a lesson. We must be willing to open our eyes to the teachers and classrooms we walk through every day. What can you learn from your workout, from your road rage, or being late to dinner? Don’t Dwell on the Question, Answer Then ACT! “The best time to plant a tree was 20 years ago. But the second best time is today.” Chinese Proverb There is a point in asking all these beautiful questions that we become paralyzed by the weight of the good things we can do. Some people call this paralysis by analysis. Just build the house…Go DO! At some point, you need to turn this great energy we create and turn it into actions. The sooner we can translate this, the better. If, for example, you just got a poor review from your manager and you ask yourself, “What can I learn from this?” You shouldn’t let this question consume your every thought for a week; think about it for awhile, but then take an action to better your standing. Plan your next week of work and grab that accountability partner you’ve been meaning to partner with. You can only plan and analyze so much; The real power lies in the DOING. “Never has there been a map, however carefully executed to detail and scale, which carried its owner over even one inch of ground.” — Og Mandino One Question Can Change Your Life In his famous commencement speech, Steve Jobs revealed a question that he asked himself every morning for over 30 years: “If today were the last day of my life, would I want to do what I’m about to do today?” He follows with, “Whenever the answer has been ‘no’ for too many days in a row, I know I need to change something.” This question guided the leader of Apple, Pixar, and NeXT for his entire professional and personal life. It gave him context about how short life really is and how trivial it can be in the end if you’re too serious about it. Our questions determine our thoughts and our thoughts become things. We must be intentional about the questions we ask ourselves, what powerful question can you focus on today? Ask and you shall receive. Make sure you’re asking the right questions. Bonus Questions: “What’s good about this situation?” “How can I use this?” Call To Action Like this post? Find any value in it? If so, I would appreciate you hitting the GREEN HEART so that more people can take action from asking better questions. Visit Project Avocado to get a FREE report on the #1 habit for healthy transformations. Jerry Seinfeld makes an appearance… ", "child": "1350_1\t1350_2\t1350_3"}