{"name": "1356", "parent": "", "title": "Under the bridge", "sentences": [{"6bc9": "Under the bridge"}, {"8a21": "Not the Red Hot Chili Peppers song"}, {"a101": "Hello, my dear little friend,lurking under the bridge."}, {"cb72": "It’s nice of you to greet methe way you have greetedso many others, with yourpatronising tone and yourargumentative words andthe apparent intention ofproving false my claims tomy life experiences. It is sokind of you to have takenthe time to understand mylife better than I ever could,and then explain it to me."}, {"1ecc": "I particularly appreciate howyou turn the great machineof scientific inquiry into yourweapon of mass destruction,cherry-picking evidence thatsupports your point. At least,I think you had a point. Yourgreatest talent is surely yourability to turn a debate into apersonal attack, ignoring thewords I’ve written, choosinginstead to focus on who I am.Of course, you are an expertwhen it comes to that topic."}, {"ba60": "Perhaps if you tell me again,again, again, I will listen andbelieve the awful things yousay about me. Gaslighting isan effective strategy for that.Or perhaps I’ll ignore you — it’s easy to do, because you,my dear friend, are a boring, needy little sod who doesn’tseem to notice that you lackcredibility because you don’twrite anything interesting ornew. All you do is strike outat those of differing opinions,before projecting your actiononto them, accusing them ofan inability to cope when you“politely challenge their views”."}, {"c1be": "So thank you, dear sweet troll,for your doting attention, butit’s really not necessary. I likemy real friends much better — now step aside, please, so thegrown-ups can get on with it."}], "content": "Under the bridge Not the Red Hot Chili Peppers song Hello, my dear little friend,lurking under the bridge. It’s nice of you to greet methe way you have greetedso many others, with yourpatronising tone and yourargumentative words andthe apparent intention ofproving false my claims tomy life experiences. It is sokind of you to have takenthe time to understand mylife better than I ever could,and then explain it to me. I particularly appreciate howyou turn the great machineof scientific inquiry into yourweapon of mass destruction,cherry-picking evidence thatsupports your point. At least,I think you had a point. Yourgreatest talent is surely yourability to turn a debate into apersonal attack, ignoring thewords I’ve written, choosinginstead to focus on who I am.Of course, you are an expertwhen it comes to that topic. Perhaps if you tell me again,again, again, I will listen andbelieve the awful things yousay about me. Gaslighting isan effective strategy for that.Or perhaps I’ll ignore you — it’s easy to do, because you,my dear friend, are a boring, needy little sod who doesn’tseem to notice that you lackcredibility because you don’twrite anything interesting ornew. All you do is strike outat those of differing opinions,before projecting your actiononto them, accusing them ofan inability to cope when you“politely challenge their views”. So thank you, dear sweet troll,for your doting attention, butit’s really not necessary. I likemy real friends much better — now step aside, please, so thegrown-ups can get on with it. ", "child": "1356_1"}