{"name": "1357", "parent": "", "title": "Dock It Up: Welcome to The Seventh Wave’s Brand New Blog", "sentences": [{"f5f8": "Dock It Up: Welcome to The Seventh Wave’s Brand New Blog"}, {"027c": "by editor Brett Rawson"}, {"8929": "We are excited to announce the official launch of The Seventh Wave’s blog, The Dock, which targets very specific styles of writing—opinion pieces, personal essays, poetic rants — but in a very specific length: flash, as in, 500 words or less."}, {"aa12": "This space is the perfect medium (pun actually unintended) for the types of messages we are after: conversation starters that thoughtfully encourage conversation, agreement be damned."}, {"870d": "There is a way to disagree, and that is to discuss."}, {"1646": "So long as your commentary, stream of (un)consciousness, or carefully crafted critique encourages a reader to (re)consider your point, it belongs here on The Dock."}, {"3aab": "Unlike the magazine itself, which you can see at www.theseventhwave.co, The Dock welcomes pieces on anything timely, not just the topic for the current issue (for example, Issue 3 currently examines the question, “Who gets to belong?”). In short, we want to keep the conversations we’ve started on Perception Gaps, Labels, etc. open, while finding new ones. There’s a good chance something you write could be the topic we select for an upcoming issue, at which point, we’d love to welcome you into the mix to help us hone that call. This is a collective effort, after all."}, {"a797": "How are we going about submissions and where are we finding these pieces? In short, everywhere. Some of these pieces have been directly submitted to us. But for others, we found them through Facebook, Twitter, personal websites, Instagram, and even Medium. The reason being: when you take a message out of its original context and change the way in which it is read, or accessed, something new happens. And when you do this with two, ten, or twenty pieces that might speak to the same thing, a sort of collective consciousness grows out of the individual viewpoints through which we see the world."}, {"cee6": "Because that is what we are after: collective awareness."}, {"3e8d": "Stay tuned for our first few pieces next week, but don’t wait: get writing, get reading, get engaged, and get in touch (info@seventhwavemag.com). And when those pieces do go up, comment on them, share them around, and send us your own. #ridethewave"}], "content": "Dock It Up: Welcome to The Seventh Wave’s Brand New Blog by editor Brett Rawson We are excited to announce the official launch of The Seventh Wave’s blog, The Dock, which targets very specific styles of writing—opinion pieces, personal essays, poetic rants — but in a very specific length: flash, as in, 500 words or less. This space is the perfect medium (pun actually unintended) for the types of messages we are after: conversation starters that thoughtfully encourage conversation, agreement be damned. There is a way to disagree, and that is to discuss. So long as your commentary, stream of (un)consciousness, or carefully crafted critique encourages a reader to (re)consider your point, it belongs here on The Dock. Unlike the magazine itself, which you can see at www.theseventhwave.co, The Dock welcomes pieces on anything timely, not just the topic for the current issue (for example, Issue 3 currently examines the question, “Who gets to belong?”). In short, we want to keep the conversations we’ve started on Perception Gaps, Labels, etc. open, while finding new ones. There’s a good chance something you write could be the topic we select for an upcoming issue, at which point, we’d love to welcome you into the mix to help us hone that call. This is a collective effort, after all. How are we going about submissions and where are we finding these pieces? In short, everywhere. Some of these pieces have been directly submitted to us. But for others, we found them through Facebook, Twitter, personal websites, Instagram, and even Medium. The reason being: when you take a message out of its original context and change the way in which it is read, or accessed, something new happens. And when you do this with two, ten, or twenty pieces that might speak to the same thing, a sort of collective consciousness grows out of the individual viewpoints through which we see the world. Because that is what we are after: collective awareness. Stay tuned for our first few pieces next week, but don’t wait: get writing, get reading, get engaged, and get in touch (info@seventhwavemag.com). And when those pieces do go up, comment on them, share them around, and send us your own. #ridethewave ", "child": "1357_1\t1357_2"}