{"name": "136", "parent": "", "title": "It’s time to recognize Melania Trump’s agency and hold her accountable too", "sentences": [{"fe3f": "It’s time to recognize Melania Trump’s agency and hold her accountable too"}, {"3b49": "She is not your victim."}, {"fd38": "This was supposed to be the year that the role of the First Lady of the United States was, at long last, truly turned on its head. A role defined by photo ops and hospital visits, menu selection and china patterns, hostessing and fashion seemed destined for the ultimate modern makeover — as a man’s job."}, {"44c4": "But, as we know, things didn’t quite go as expected."}, {"3e75": "As Hillary and Bill Clinton hike in the Chappaqua woods, Melania Trump, a Slovenian immigrant and former model, and the third wife of President Donald Trump, has assumed the position of FLOTUS. And, honestly, most progressives aren’t quite sure what to do with that reality."}, {"13f5": "For months before Inauguration Day, a meme swept through left-of-center corners of the internet. It’s based on a picture of all of the living First Ladies — Michelle Obama, Laura Bush, Hillary Clinton, Barbara Bush, and Rosalyn Carter — at at the dedication of the George W. Bush presidential library on the campus of Southern Methodist University in Dallas in 2013."}, {"f4cf": "Hastily photoshopped on the left of the meme is Melania. But while the other first ladies are dressed in modest pantsuits or dresses, Melania is oily, naked, and, well, grabbing her crotch."}, {"2e5a": "The text on these memes varies, but the meaning is the same: “One of these things is not like the other.” It is classic slut-shaming, signaling that because she was once a professional model and posed for provocative photographs, she is not suited to be a prominent member of American politics. It’s a message that you’d expect to see feminists countering, not perpetuating."}, {"8bd7": "After all, it’s not like Melania showed up on Inauguration Day wearing only oil. On January 20, wearing what the New York Times described as an “powder-blue double-face cashmere dress and coat” designed by Ralph Lauren, the Slovenian-American looked very much her political part."}, {"4140": "And yet she still became meme fodder. Her body language was dissected from every angle. One particular video of Melania’s face turning from a smile to a frown the second her husband took his eyes off of her went viral."}, {"58fa": "Suddenly, another narrative was cemented — one that posits that Melania is trapped in her marriage, a victim calling out for help. A video posted on YouTube that’s garnered over 7 million views says it has proof that Melania is being abused. (Needless to say, it doesn’t.)"}, {"380b": "The following weekend, at Women’s Marches across the country, a popular sign read, “Free Melania.”"}, {"4459": "It’s understandable that people have strong reactions to Melania Trump considering her complicity in the hatred spewed by her husband and his administration, and considering the horrible ways that many figures on the right treated Michelle Obama for the past eight years."}, {"cb04": "But painting Melania as helpless and in need of rescuing without any solid evidence is just as demeaning as labeling her a slut who doesn’t have enough class to live in the White House — it corners her in the Madonna-whore binary that has been used to discredit women for, well, forever."}, {"d3ba": "The truth lies somewhere in the middle, as it always does. It’s time for us to recognize Melania’s agency — and the accountability that comes with it."}, {"bc93": "One of the reasons it’s so easy to stereotype Melania is because we don’t know much about her. According to Kate Anderson Brower, author of First Women: The Grace and Power of America’s Modern First Ladies, that’s partly because she didn’t spend much time on the campaign trail."}, {"c3ca": "“The fact that she wasn’t on the campaign, it was detrimental to her, because every other modern first lady has been on the campaign trail and has had advisers and their own team,” Anderson Brower told ThinkProgress. “Your whole image is molded in the year and a half, two years on the campaign.”"}, {"a516": "Melania often stayed in New York during the campaign, and she hasn’t really sought the spotlight since the inauguration, either. Instead of moving into the White House, she bucked tradition and decided to remain in New York so the couple’s 10-year-old son, Barron, can finish out the school year."}, {"ef0b": "To the public, she remains largely a blank slate — meaning it’s easy to imagine she’s a classy icon or a slutty temptress, an empowered woman or a lady-in-distress, depending on which narrative you need on that particular day."}, {"0a35": "Melania with her future husband in 1999, when he was openly considering running for president as a nominee for the Reform Party. CREDIT: AP Photo/Tony Gutierrez"}, {"efc9": "Most of what we do know about her are tidbits from interviews with magazines and appearances on television shows throughout the years. These items are rather mundane, soft details. She likes Pilates and reading magazines; she speaks six languages; she’s close to her family; her parents live in Trump Tower, and her sister lives a few blocks away; she takes pride in not being a “nagging” wife."}, {"bbee": "On the campaign trail, she was painted as the eye to Trump’s storm."}, {"b585": "“When he is spinning and thinking and blazing forward, she brings this quality of calm and serenity to him,” Pamela Gross, a CNN producer close to the couple, told Harpers Bazaar. “That calming influence is a really important thing about her character. She is not a frantic person.”"}, {"f93c": "But when you dig a bit deeper, it seems that Melania has plenty in common with her bombastic husband."}, {"838f": "She likes to attack the media for its dishonesty. She likes to brag about his crowd sizes. She retweets compliments. She attacks journalists. She’s unintentionally hilarious. She likes to inspire, insult Barack Obama while citing stock market prices, and livetweet debates, and brag when she hears the name “Donald Trump” mentioned."}, {"e00c": "She’s also litigious. She currently has a lawsuit out against Mail Media Inc. for $150 million, after Mail Online referred to her as a former escort, saying that her modeling career was merely a “ruse.” Last month, the lawsuit made waves because it stated that the publication’s escort claim was a blow to her reputation, which would result in financial loss to Melania because she intended to “cash in on her First Lady ‘brand’ to sell ‘apparel, accessories, shoes, jewelry, cosmetics, hair care, skin care and fragrance’” from the White House. That incendiary language has since been removed, however."}, {"0f8e": "Melania Trump’s lawsuits are, according to Anderson Brower in a piece in the Guardian, “an unprecedented act for a sitting first lady.”"}, {"01ef": "And despite Melania’s relatively humble beginnings — in Slovenia, her mother was a patternmaker and her father managed car dealerships — her social media presence suggests she lacks awareness of the opulence she’s highlighting when she shares posts about the day-to-day details about her life."}, {"c3b3": "She also seems to share many of Trump’s talking points — she’s defended Trump’s racist quest to see Barack Obama’s birth certificate and his dangerous rhetoric on immigration — and his seemingly willful cognitive dissonance."}, {"ed6f": "She brags to the press about her independence and about the need for kindness and unity, all while repeating her husband’s hate-filled talking points. She’s told the world that she will devote herself to fighting cyber bullying as the first lady, without ever acknowledging that her husband is one of the biggest cyber bullies of them all. She points to her own immigration story, leaving out the fact that she was able to comply with the stringent regulations because of her wealth and privilege."}, {"ddda": "She says we will never know what she truly thinks of politics and policy — but one way or another, she’s making herself heard."}, {"758e": "The conventional wisdom surrounding Melania Trump is that she didn’t sign up for any of this. She married a mogul, and wound up a politician’s wife — the most prominent politician’s wife in the world, actually. Who can blame her if she’s having a bit of trouble with the adjustment?"}, {"9335": "But the truth is that Trump started flirting with politics very early into their courtship. In 1999, just one year after they met at a party and started dating, Trump announced that he was joining the Reform Party and was considering mounting a run for president."}, {"3bca": "To drum up attention for his bid, Trump called into the Howard Stern show, as he often did. With a nearly nude Melania by his side, Trump and Stern talked about Bill Clinton, Trump’s sex life, and how incredibly hot Melania is."}, {"a9c2": "That radio interview, which was clipped and uploaded by Andrew Kaczynski of CNN, provides some uncomfortable insight into how Trump speaks about Melania — and about women in general."}, {"f353": "Stern and Trump joked that Melania’s accent might get tiresome after a while. Trump noted that his ex-wife Ivana Trump had an accent as well: “It was so cute, and then one day I woke up and it was terrible, I couldn’t stand it,” he said. They gawked at Melania’s beauty throughout the interview. At one point — after Stern praised Melania for not being “too chatty” — Trump said he was “a little concerned, Howard, that she may be too smart.”"}, {"6cc8": "Melania wasn’t a silent bystander during all of this. She got on the phone with Stern, joked with him and invited him out for a night on the town with the couple. When Stern asked her what she was wearing, she said, “not much.” When he asked her about their sex life, she said, “We have a great, great time,” and added that they sometimes have sex multiple times a day."}, {"124e": "She lost interest in the conversation pretty quickly, and after the call finished, Stern’s co-hosts cracked up when he referred to Melania, then only 29, as “the first lady” — it was simply unfathomable to them."}, {"a237": "Fast forward about 15 years, and it’s become reality."}, {"68c6": "At least 18 women have come forward and accused President Donald Trump of sexual harassment or sexual assault, including his ex-wife Ivana Trump, who once accused him of raping her during their marriage before later retracting that claim."}, {"d524": "Many of these accusations came to light while Trump was married to Melania. He was married to Melania when he talked to Billy Bush on the now infamous Access Hollywood tape about not only sexual assault, but also about trying to woo Nancy O’Dell. Melania was pregnant with Barron Trump in December of 2005 when People writer Natasha Stoynoff alleges that Trump assaulted her."}, {"2081": "She’s excused his “grab them by the pussy” comments as “boy talk,” adding that they do not “represent the man I know,” despite the fact that his vulgar comments about women are well-documented thanks to his many call-ins to the Howard Stern show, among other things."}, {"12ed": "“I know those people. They hook him on. They try to get from him some unappropriate [sic] and dirty language,” Melania told Fox News, when asked about Stern and Billy Bush."}, {"a6e7": "“My husband is kind. He’s a gentleman.”"}, {"61f9": "In this context, the concern about Melania as a victim who’s trapped in her marriage to Donald Trump makes some sense. Given Trump’s history with women, it’s not unreasonable to worry about the safety of the women who are close to him. But so far, there have never been any allegations or proof that Trump has actually abused Melania."}, {"3eef": "From what we know, she’s not a victim so much as she is an enabler, or even a co-conspirator."}, {"2b96": "In fact, the one through-line in all of Melania’s stories is ambition and control. When she first met Donald, she didn’t fawn over him. In fact, she refused to give him her number, and instead asked for his. She waited a week to call him. She now says that he might have liked the fact that she wasn’t starstruck."}, {"80c0": "She used her relationship with Donald to push forward her career, with photoshoots for the Sports Illustrated swimsuit edition and GQ following soon after their courtship. She did less modeling as she got older and became a mother, but she still maintained a jewelry and skin-care line, and carefully crafted her image through social media and appearances with her husband. Despite being what many might see as an accessory to Trump’s empire, she wants it to seem like she’s the one calling the shots for herself."}, {"8383": "“Nobody controls me. I travel with my husband when I can,” she told Julia Ioffe of GQ last year."}, {"299a": "She’s maintaining that facade even now, as she stays in New York with Barron while Trump’s presidency gets underway. She is the only first lady since Abigail Adams in 1797 who chose not to immediately move into the White House, according to Anderson Brower. Some see this as a subversive declaration of independence, or a sign that her marriage is not as happy as they might claim. But it could just be her way of signaling that she’s truly not starstruck by anything, even the office of the presidency."}, {"49f3": "It’s going to be interesting to see whether Melania continues to play by her own rules, or whether she grows into the more traditional aspects of the FLOTUS. She’s already starting to become a bit more of a D.C. presence — on Wednesday, as her husband works to dismantle the nation’s health care system, Melania visited the Children’s Hospital and issued a statement extolling the virtues of “nature’s elements into our daily lives.”"}, {"11f3": "One thing is for sure — she’s not a cartoon figure of a victim or a vixen. And projecting these assumptions onto her not only keeps us from recognizing her for the fully formed human being that she is, but also prevents us from holding her fully responsible for her words and actions."}, {"7256": "She’s not the unconventional first lady many of us hoped for, but she’s the one we’ve got. It’s time to hold her accountable for that."}], "content": "It’s time to recognize Melania Trump’s agency and hold her accountable too She is not your victim. This was supposed to be the year that the role of the First Lady of the United States was, at long last, truly turned on its head. A role defined by photo ops and hospital visits, menu selection and china patterns, hostessing and fashion seemed destined for the ultimate modern makeover — as a man’s job. But, as we know, things didn’t quite go as expected. As Hillary and Bill Clinton hike in the Chappaqua woods, Melania Trump, a Slovenian immigrant and former model, and the third wife of President Donald Trump, has assumed the position of FLOTUS. And, honestly, most progressives aren’t quite sure what to do with that reality. For months before Inauguration Day, a meme swept through left-of-center corners of the internet. It’s based on a picture of all of the living First Ladies — Michelle Obama, Laura Bush, Hillary Clinton, Barbara Bush, and Rosalyn Carter — at at the dedication of the George W. Bush presidential library on the campus of Southern Methodist University in Dallas in 2013. Hastily photoshopped on the left of the meme is Melania. But while the other first ladies are dressed in modest pantsuits or dresses, Melania is oily, naked, and, well, grabbing her crotch. The text on these memes varies, but the meaning is the same: “One of these things is not like the other.” It is classic slut-shaming, signaling that because she was once a professional model and posed for provocative photographs, she is not suited to be a prominent member of American politics. It’s a message that you’d expect to see feminists countering, not perpetuating. After all, it’s not like Melania showed up on Inauguration Day wearing only oil. On January 20, wearing what the New York Times described as an “powder-blue double-face cashmere dress and coat” designed by Ralph Lauren, the Slovenian-American looked very much her political part. And yet she still became meme fodder. Her body language was dissected from every angle. One particular video of Melania’s face turning from a smile to a frown the second her husband took his eyes off of her went viral. Suddenly, another narrative was cemented — one that posits that Melania is trapped in her marriage, a victim calling out for help. A video posted on YouTube that’s garnered over 7 million views says it has proof that Melania is being abused. (Needless to say, it doesn’t.) The following weekend, at Women’s Marches across the country, a popular sign read, “Free Melania.” It’s understandable that people have strong reactions to Melania Trump considering her complicity in the hatred spewed by her husband and his administration, and considering the horrible ways that many figures on the right treated Michelle Obama for the past eight years. But painting Melania as helpless and in need of rescuing without any solid evidence is just as demeaning as labeling her a slut who doesn’t have enough class to live in the White House — it corners her in the Madonna-whore binary that has been used to discredit women for, well, forever. The truth lies somewhere in the middle, as it always does. It’s time for us to recognize Melania’s agency — and the accountability that comes with it. One of the reasons it’s so easy to stereotype Melania is because we don’t know much about her. According to Kate Anderson Brower, author of First Women: The Grace and Power of America’s Modern First Ladies, that’s partly because she didn’t spend much time on the campaign trail. “The fact that she wasn’t on the campaign, it was detrimental to her, because every other modern first lady has been on the campaign trail and has had advisers and their own team,” Anderson Brower told ThinkProgress. “Your whole image is molded in the year and a half, two years on the campaign.” Melania often stayed in New York during the campaign, and she hasn’t really sought the spotlight since the inauguration, either. Instead of moving into the White House, she bucked tradition and decided to remain in New York so the couple’s 10-year-old son, Barron, can finish out the school year. To the public, she remains largely a blank slate — meaning it’s easy to imagine she’s a classy icon or a slutty temptress, an empowered woman or a lady-in-distress, depending on which narrative you need on that particular day. Melania with her future husband in 1999, when he was openly considering running for president as a nominee for the Reform Party. CREDIT: AP Photo/Tony Gutierrez Most of what we do know about her are tidbits from interviews with magazines and appearances on television shows throughout the years. These items are rather mundane, soft details. She likes Pilates and reading magazines; she speaks six languages; she’s close to her family; her parents live in Trump Tower, and her sister lives a few blocks away; she takes pride in not being a “nagging” wife. On the campaign trail, she was painted as the eye to Trump’s storm. “When he is spinning and thinking and blazing forward, she brings this quality of calm and serenity to him,” Pamela Gross, a CNN producer close to the couple, told Harpers Bazaar. “That calming influence is a really important thing about her character. She is not a frantic person.” But when you dig a bit deeper, it seems that Melania has plenty in common with her bombastic husband. She likes to attack the media for its dishonesty. She likes to brag about his crowd sizes. She retweets compliments. She attacks journalists. She’s unintentionally hilarious. She likes to inspire, insult Barack Obama while citing stock market prices, and livetweet debates, and brag when she hears the name “Donald Trump” mentioned. She’s also litigious. She currently has a lawsuit out against Mail Media Inc. for $150 million, after Mail Online referred to her as a former escort, saying that her modeling career was merely a “ruse.” Last month, the lawsuit made waves because it stated that the publication’s escort claim was a blow to her reputation, which would result in financial loss to Melania because she intended to “cash in on her First Lady ‘brand’ to sell ‘apparel, accessories, shoes, jewelry, cosmetics, hair care, skin care and fragrance’” from the White House. That incendiary language has since been removed, however. Melania Trump’s lawsuits are, according to Anderson Brower in a piece in the Guardian, “an unprecedented act for a sitting first lady.” And despite Melania’s relatively humble beginnings — in Slovenia, her mother was a patternmaker and her father managed car dealerships — her social media presence suggests she lacks awareness of the opulence she’s highlighting when she shares posts about the day-to-day details about her life. She also seems to share many of Trump’s talking points — she’s defended Trump’s racist quest to see Barack Obama’s birth certificate and his dangerous rhetoric on immigration — and his seemingly willful cognitive dissonance. She brags to the press about her independence and about the need for kindness and unity, all while repeating her husband’s hate-filled talking points. She’s told the world that she will devote herself to fighting cyber bullying as the first lady, without ever acknowledging that her husband is one of the biggest cyber bullies of them all. She points to her own immigration story, leaving out the fact that she was able to comply with the stringent regulations because of her wealth and privilege. She says we will never know what she truly thinks of politics and policy — but one way or another, she’s making herself heard. The conventional wisdom surrounding Melania Trump is that she didn’t sign up for any of this. She married a mogul, and wound up a politician’s wife — the most prominent politician’s wife in the world, actually. Who can blame her if she’s having a bit of trouble with the adjustment? But the truth is that Trump started flirting with politics very early into their courtship. In 1999, just one year after they met at a party and started dating, Trump announced that he was joining the Reform Party and was considering mounting a run for president. To drum up attention for his bid, Trump called into the Howard Stern show, as he often did. With a nearly nude Melania by his side, Trump and Stern talked about Bill Clinton, Trump’s sex life, and how incredibly hot Melania is. That radio interview, which was clipped and uploaded by Andrew Kaczynski of CNN, provides some uncomfortable insight into how Trump speaks about Melania — and about women in general. Stern and Trump joked that Melania’s accent might get tiresome after a while. Trump noted that his ex-wife Ivana Trump had an accent as well: “It was so cute, and then one day I woke up and it was terrible, I couldn’t stand it,” he said. They gawked at Melania’s beauty throughout the interview. At one point — after Stern praised Melania for not being “too chatty” — Trump said he was “a little concerned, Howard, that she may be too smart.” Melania wasn’t a silent bystander during all of this. She got on the phone with Stern, joked with him and invited him out for a night on the town with the couple. When Stern asked her what she was wearing, she said, “not much.” When he asked her about their sex life, she said, “We have a great, great time,” and added that they sometimes have sex multiple times a day. She lost interest in the conversation pretty quickly, and after the call finished, Stern’s co-hosts cracked up when he referred to Melania, then only 29, as “the first lady” — it was simply unfathomable to them. Fast forward about 15 years, and it’s become reality. At least 18 women have come forward and accused President Donald Trump of sexual harassment or sexual assault, including his ex-wife Ivana Trump, who once accused him of raping her during their marriage before later retracting that claim. Many of these accusations came to light while Trump was married to Melania. He was married to Melania when he talked to Billy Bush on the now infamous Access Hollywood tape about not only sexual assault, but also about trying to woo Nancy O’Dell. Melania was pregnant with Barron Trump in December of 2005 when People writer Natasha Stoynoff alleges that Trump assaulted her. She’s excused his “grab them by the pussy” comments as “boy talk,” adding that they do not “represent the man I know,” despite the fact that his vulgar comments about women are well-documented thanks to his many call-ins to the Howard Stern show, among other things. “I know those people. They hook him on. They try to get from him some unappropriate [sic] and dirty language,” Melania told Fox News, when asked about Stern and Billy Bush. “My husband is kind. He’s a gentleman.” In this context, the concern about Melania as a victim who’s trapped in her marriage to Donald Trump makes some sense. Given Trump’s history with women, it’s not unreasonable to worry about the safety of the women who are close to him. But so far, there have never been any allegations or proof that Trump has actually abused Melania. From what we know, she’s not a victim so much as she is an enabler, or even a co-conspirator. In fact, the one through-line in all of Melania’s stories is ambition and control. When she first met Donald, she didn’t fawn over him. In fact, she refused to give him her number, and instead asked for his. She waited a week to call him. She now says that he might have liked the fact that she wasn’t starstruck. She used her relationship with Donald to push forward her career, with photoshoots for the Sports Illustrated swimsuit edition and GQ following soon after their courtship. She did less modeling as she got older and became a mother, but she still maintained a jewelry and skin-care line, and carefully crafted her image through social media and appearances with her husband. Despite being what many might see as an accessory to Trump’s empire, she wants it to seem like she’s the one calling the shots for herself. “Nobody controls me. I travel with my husband when I can,” she told Julia Ioffe of GQ last year. She’s maintaining that facade even now, as she stays in New York with Barron while Trump’s presidency gets underway. She is the only first lady since Abigail Adams in 1797 who chose not to immediately move into the White House, according to Anderson Brower. Some see this as a subversive declaration of independence, or a sign that her marriage is not as happy as they might claim. But it could just be her way of signaling that she’s truly not starstruck by anything, even the office of the presidency. It’s going to be interesting to see whether Melania continues to play by her own rules, or whether she grows into the more traditional aspects of the FLOTUS. She’s already starting to become a bit more of a D.C. presence — on Wednesday, as her husband works to dismantle the nation’s health care system, Melania visited the Children’s Hospital and issued a statement extolling the virtues of “nature’s elements into our daily lives.” One thing is for sure — she’s not a cartoon figure of a victim or a vixen. And projecting these assumptions onto her not only keeps us from recognizing her for the fully formed human being that she is, but also prevents us from holding her fully responsible for her words and actions. She’s not the unconventional first lady many of us hoped for, but she’s the one we’ve got. It’s time to hold her accountable for that. ", "child": "136_1\t136_2\t136_3\t136_4\t136_5\t136_6\t136_7\t136_8\t136_9\t136_10\t136_11\t136_12\t136_13\t136_14\t136_15\t136_16\t136_17\t136_18\t136_19\t136_20\t136_21\t136_22\t136_23\t136_24\t136_25136_1\t136_2\t136_3\t136_4\t136_5\t136_6\t136_7\t136_8\t136_9\t136_10\t136_11\t136_12\t136_13\t136_14\t136_15\t136_16\t136_17\t136_18\t136_19\t136_20\t136_21\t136_22\t136_23\t136_24\t136_25136_1\t136_2\t136_3\t136_4\t136_5\t136_6\t136_7\t136_8\t136_9\t136_10\t136_11\t136_12\t136_13\t136_14\t136_15\t136_16\t136_17\t136_18\t136_19\t136_20\t136_21\t136_22\t136_23\t136_24\t136_25136_1\t136_2\t136_3\t136_4\t136_5\t136_6\t136_7\t136_8\t136_9\t136_10\t136_11\t136_12\t136_13\t136_14\t136_15\t136_16\t136_17\t136_18\t136_19\t136_20\t136_21\t136_22\t136_23\t136_24\t136_25"}