{"name": "1398", "parent": "", "title": "A Little Story About A Rabbit That Will Teach You About Life", "sentences": [{"b3af": "A Little Story About A Rabbit That Will Teach You About Life"}, {"2bff": "Once upon a time, there was a rabbit."}, {"b074": "This rabbit was different. He had a dream to be something special. He was different than everyone else in his village."}, {"3235": "All of the others were okay with living an ordinary provincial rabbit life. Tending the carrot stand, raising a family, and retiring."}, {"a43b": "But this rabbit was not."}, {"de69": "He wanted to live a different life. One were what he did became an expression of who he was."}, {"fab5": "So he left his rabbit home, in search of freedom in the big city. To this little rabbit, freedom meant self-expression and excitement, which had been so missing from his life at home. He always felt “odd” or “different,” but knew he was destined for greatness."}, {"68f7": "However, once the rabbit made it to the city, he no longer felt odd or different. In fact, the rabbit felt lost, alone, and similar."}, {"66de": "He had dreamed his entire life about the day when he would finally break free from the chains of his childhood and burst into a new life. But now that he had accomplished it, he knew not what to do next."}, {"0bee": "Rabbit during an exisential crisis"}, {"cfc0": "In his village, being ambitious had made him stand out. But in the city, he was just one of the many. He was just another cog in the machine, waiting for someone to notice him."}, {"6fac": "No one saw the power he had within his little rabbit heart to do great things, and he began not to see this power either."}, {"2ed4": "For the first time in his whole life, his vision became foggy. He no longer knew what he wanted. He had realized his dream of leaving his home and striking out on his own, but when he got there and achieved this goal, he had nothing more to stake his name on."}, {"2e89": "He had thought that it was his ambition that made him great, and now that everyone had ambition, he was no longer different. It was time for him to join the others and be practical."}, {"54fe": "However, he was different."}, {"628f": "Only he had overlooked his passion and ability out of his need for other rabbits to approve his direction. Nothing had changed within the little rabbit. He was still the same as he had always been. But with new inputs and opinions, he stood confused, unsure of whether his direction was the “right” one."}, {"80c9": "Instead of diving deeply into his confusion to discover what was him and what was other, he chose to leave it at the periphery. Avoiding it. Thinking that it would one day come back if it was truly meant to be."}, {"9883": "It never did."}, {"be11": "The rabbit lived out his days in the city. Listening to the contributions of others. Never once realizing that it was the inputs that changed his purpose, not the purpose itself that had changed."}, {"7dab": "So goes the story of most of our lives. You start off fast and furious, a head full of steam in the direction you know internally is right, only to be slammed down by a feeling that you must be practical."}, {"50cf": "How can you be different than the rabbit?"}, {"dbb9": "You must start choosing what inputs you allow in your life. You must be the curator of your newsfeed. Be strict about what and who you let into your life. Be okay with being selfish. You need to realize your own greatness before you can really help others."}, {"7f09": "You have to become aware of the voice that is you and the voice that is the other."}, {"a204": "You know exactly what it is that will bring you purpose."}, {"c529": "You know exactly the action you need to take to get out of that unhealthy relationship."}, {"cddc": "You know exactly who it is you want to become."}, {"35d4": "It may be extremely hard. But you know."}, {"ad7a": "Your purpose is like a buoy, popping its head up and down throughout life, never truly sinking to the bottom of the lake. It comes and goes, during the various storms of life, but it never changes its appearance. Sometimes we notice it, and sometimes we don’t. But if you try hard to remember, you will see that it has always been there."}, {"e556": "Your purpose is not hard to find. But it is hard to listen to, especially amongst the noise of podcasts, books, webinars, newsletters, parents, friends, bosses, colleagues, neighbors…on and on."}, {"db1b": "However, it’s there. Be patient. It will pop its head up again."}, {"6198": "If you are still lost, ask yourself some version of one of the questions below:"}, {"bb54": "Have you had the same desire to be a [insert interest here] multiple times throughout your life?"}, {"bcb1": "Have you had the same passion for traveling when you were 16, 22, and 25?"}, {"a13d": "Have you always wanted to be a creative person, building something you can be proud of?"}, {"9da0": "Hobbies come and go. Purpose does not."}, {"138d": "I used to love Pokemon, but then I moved on to the next thing. My interest in Pokemon never resurface, therefore it is not my purpose (thank god)."}, {"f6d2": "However, I have consistently be interested in writing and entrepreneurship. Not just once in my life, but countless times. Therefore, I believe it to be my purpose."}, {"396a": "Now, try the same exercise."}, {"83d5": "Personally, I don’t think I’d be proud of living a life of practicality."}, {"bb82": "Do you?"}, {"26fc": "You have a purpose; you just don’t trust it yet. There is no reason to not go all-in on yourself."}, {"839d": "I’m following the voice of my inner rabbit, at least for today, and I’m leaving the city of noise behind. Come with me, won’t you?"}, {"c2bd": "Wake Up"}, {"ef49": "Are you ready to wake up, get more focused, and find more happiness in your life?"}, {"8ab8": "If so, join my 30-Day April Awakening Series. I’ll be sending you an email every day with a short video that makes mindfulness practical."}, {"d714": "Sign up here to get the videos sent straight to your inbox or subscribe to my YouTube channel here."}, {"689f": "One last thing…"}, {"1fec": "If you liked this article, click the💚 below so other people will see it here on Medium."}], "content": "A Little Story About A Rabbit That Will Teach You About Life Once upon a time, there was a rabbit. This rabbit was different. He had a dream to be something special. He was different than everyone else in his village. All of the others were okay with living an ordinary provincial rabbit life. Tending the carrot stand, raising a family, and retiring. But this rabbit was not. He wanted to live a different life. One were what he did became an expression of who he was. So he left his rabbit home, in search of freedom in the big city. To this little rabbit, freedom meant self-expression and excitement, which had been so missing from his life at home. He always felt “odd” or “different,” but knew he was destined for greatness. However, once the rabbit made it to the city, he no longer felt odd or different. In fact, the rabbit felt lost, alone, and similar. He had dreamed his entire life about the day when he would finally break free from the chains of his childhood and burst into a new life. But now that he had accomplished it, he knew not what to do next. Rabbit during an exisential crisis In his village, being ambitious had made him stand out. But in the city, he was just one of the many. He was just another cog in the machine, waiting for someone to notice him. No one saw the power he had within his little rabbit heart to do great things, and he began not to see this power either. For the first time in his whole life, his vision became foggy. He no longer knew what he wanted. He had realized his dream of leaving his home and striking out on his own, but when he got there and achieved this goal, he had nothing more to stake his name on. He had thought that it was his ambition that made him great, and now that everyone had ambition, he was no longer different. It was time for him to join the others and be practical. However, he was different. Only he had overlooked his passion and ability out of his need for other rabbits to approve his direction. Nothing had changed within the little rabbit. He was still the same as he had always been. But with new inputs and opinions, he stood confused, unsure of whether his direction was the “right” one. Instead of diving deeply into his confusion to discover what was him and what was other, he chose to leave it at the periphery. Avoiding it. Thinking that it would one day come back if it was truly meant to be. It never did. The rabbit lived out his days in the city. Listening to the contributions of others. Never once realizing that it was the inputs that changed his purpose, not the purpose itself that had changed. So goes the story of most of our lives. You start off fast and furious, a head full of steam in the direction you know internally is right, only to be slammed down by a feeling that you must be practical. How can you be different than the rabbit? You must start choosing what inputs you allow in your life. You must be the curator of your newsfeed. Be strict about what and who you let into your life. Be okay with being selfish. You need to realize your own greatness before you can really help others. You have to become aware of the voice that is you and the voice that is the other. You know exactly what it is that will bring you purpose. You know exactly the action you need to take to get out of that unhealthy relationship. You know exactly who it is you want to become. It may be extremely hard. But you know. Your purpose is like a buoy, popping its head up and down throughout life, never truly sinking to the bottom of the lake. It comes and goes, during the various storms of life, but it never changes its appearance. Sometimes we notice it, and sometimes we don’t. But if you try hard to remember, you will see that it has always been there. Your purpose is not hard to find. But it is hard to listen to, especially amongst the noise of podcasts, books, webinars, newsletters, parents, friends, bosses, colleagues, neighbors…on and on. However, it’s there. Be patient. It will pop its head up again. If you are still lost, ask yourself some version of one of the questions below: Have you had the same desire to be a [insert interest here] multiple times throughout your life? Have you had the same passion for traveling when you were 16, 22, and 25? Have you always wanted to be a creative person, building something you can be proud of? Hobbies come and go. Purpose does not. I used to love Pokemon, but then I moved on to the next thing. My interest in Pokemon never resurface, therefore it is not my purpose (thank god). However, I have consistently be interested in writing and entrepreneurship. Not just once in my life, but countless times. Therefore, I believe it to be my purpose. Now, try the same exercise. Personally, I don’t think I’d be proud of living a life of practicality. Do you? You have a purpose; you just don’t trust it yet. There is no reason to not go all-in on yourself. I’m following the voice of my inner rabbit, at least for today, and I’m leaving the city of noise behind. Come with me, won’t you? Wake Up Are you ready to wake up, get more focused, and find more happiness in your life? If so, join my 30-Day April Awakening Series. I’ll be sending you an email every day with a short video that makes mindfulness practical. Sign up here to get the videos sent straight to your inbox or subscribe to my YouTube channel here. One last thing… If you liked this article, click the💚 below so other people will see it here on Medium. ", "child": "1398_1\t1398_2\t1398_3\t1398_4\t1398_5\t1398_6\t1398_7\t1398_8\t1398_9\t1398_10\t1398_11\t1398_12\t1398_13\t1398_14\t1398_15\t1398_16"}