{"name": "1399", "parent": "", "title": "A Place I Can Never Visit", "sentences": [{"17a3": "A Place I Can Never Visit"}, {"e425": "As he tipped his glass to get the last sip of the ginger muddled rum he muttered, “I haven’t told you the story yet.”"}, {"198f": "“Not yet”, I replied."}, {"8f20": "“So, um, essentially, I had this really dull but persistent pain in my side, I ignored it because I had lots of clients on my caseload. By the time I paid attention, the pain was the size of two baseballs and spread to my liver and brain. Stage three, the doctors told me.”"}, {"bb0b": "Kevin* was a technology consultant in Soho. He was clever and worked long hours, a clone of nearly every semi-privileged millennial in the New York metropolis. He lived a nice life for a twenty-five year old–pre-cancer of course."}, {"e9f8": "A month before, I received a message from Kevin, my college boyfriend. Messages from exes usually go one of two ways. They either have awful and vindictive things to say that break your heart. Or they have wonderful things to say, which also break your heart. This one was different, but it still broke my heart."}, {"c824": "Donna,"}, {"7e6c": "I know it’s been a while. . . but I have cancer and thought you would want to know. I’m not trying to scare you, I just know that you’d be pissed if you found out through Facebook or something lame like that."}, {"30f4": "Yours,"}, {"dec4": "Kevin."}, {"a523": "I remember reading the message a few times to let the word cancer truly permeate. No. How? No. My thoughts repeated until I grew sober enough to ask him to dinner."}, {"6f7b": "We sat in a basement restaurant that served quail eggs wrapped in bacon pierced by tiny toothpicks. His head was covered with a Yankees cap and his eyes were veiled in thick tortoise shell frames. I didn’t expect him to be bald. I know that is a silly and ridiculous statement; to expect a cancer patient not to be bald, but for some reason I couldn’t stop watching where his forehead and scalp crease formed as he lifted his eyebrows. I tried to remember what he had looked like before all this."}, {"36d1": "He used to have thick strawberry blonde hair that he brushed leftwards, it looked strange now, being so bare and exposed. I should have looked away, but instead I stared, hoping to make sense of it all. His eyelashes and eyebrows were still there, lightly colored and hard to see, but they remained the same. He explained that it was a myth that you lose those early on because they are slow growing hairs, unlike the ones on his head. But more than just hair changes, he had aged. He looked wiser and somehow more qualified to tell me what dying feels like."}, {"06b5": "I tried to process the impending reality while I hid my fear with smiles and long gazes of pity–I was fucking up, but I couldn’t help it. No one trained me for this, nobody handed me the manual on how to act when the guy whom you broke up with is now dying two years later. They forgot to hand out that pamphlet in college."}, {"1d40": "“What kind?” I asked. I didn’t know what else to ask, I sounded dumb worrying about where it had originated."}, {"d440": "“Testicular,” he whispered and looked around, embarrassed. Of course my mind flashed back to a moment of us having sex. I tried to stop it, I tried not to wonder if he had it in his body back then. If somehow we could have known?"}, {"e8ed": "“Kev, I’m so sorry,” I said, exhaling slowly."}, {"6a22": "“Don’t be, it is what it is,” he said solemnly, like he was making peace with the diagnosis."}, {"0fce": "He looked at me from across the table, his hand twirling a toothpick covered in greasy fried chicken skin, “do you know what I realized what being told you have stage three testicular cancer feels like?” he asked, knowing it was rhetorical."}, {"2f3b": "“It’s like turning on the news and watching a terrorist attack or a natural disaster. The world seems as if it might be ending. You’re unsure of what is really happening, yet you know more horrific outcomes are soon to come. On that television screen you look for information and you’re flooded with updates. You get overwhelmed, so you turn it off and you look around. But no one else is there watching because you’re alone in a room watching life deteriorate rapidly. So you go outside, seeking other people who are running around crying, unsure of what they have seen, unsure of what will happen to the world after this tragedy unravels. But all you see is people living their lives; walking their dogs and drinking their coffee. People headed to work stressed over stock prices and marital issues; people just going on as if the world isn’t ending because for them it isn’t. For them, the tragedy hasn’t happened yet, or never will. They live in a world that existed before you turned on the news channel where your name is the only one on the bottom screen ticker.”"}, {"9538": "Kevin told me more than just about the scary parts of cancer, he told me about the parts that no one ever talks about: parts that belong on an episode of HBO’s Girls. And as much as I love Girls, I don’t like to think of my ex “jerking off to save his last viable sperm”. Unaware or uninterested of my opinion on the topic. He told me about the shape of the cup that he was meant to finish in, but couldn’t. He told me about the ways the doctors manipulated him and touched him as if he was just an inanimate object, almost causing the feeling of touch to become mundane and unexciting. He talked to me as if he wanted to unleash the side of cancer most never think about."}, {"a8be": "Somewhere between discussions on chemo and surgery, a bottle of pear flavored sake arrived."}, {"018d": "“I ordered some so we could toast to cancer, why the hell not, am I right?” he asked."}, {"d87c": "“Why the hell not,” I declared as I tried to read his eyes."}, {"7fdf": "We danced around each other’s feelings in awkward moments of poorly timed jokes and forced laughter, much like how we did when we first met. Though, he never knew that it was a complete set up."}, {"2fb9": "During college, my best friend worked at a electronic store with Kevin. She had instructed me to come visit on a day when “the guy who is totally my type” was working. I was desperate for a new phone and slightly desperate in general, so I visited."}, {"482e": "She motioned him over to where her and I stood, “Kevin, can you help my friend out, I need to help an annoying customer”, she lied– winking at me as she walked away."}, {"780a": "“Sure,” he replied, smiling and extending his hand for a handshake. He was far more handsome than she described. He was tall and thin, donned in a flannel shirt, wearing vintage glasses that drew me to his azure pigmented eyes. His beard was reddish, a color darker than his hair. He had a strong jaw and a short beard that nearly masked it. His face was kind, yet almost stoic, like a beautiful painting I wanted to touch."}, {"09da": "I left the store with a new phone and an invitation for a drink with the blue eyed salesman. Though it was unbeknown to me at the time, we began the best relationship I ever had. Kevin would visit me at my brewery job every weekend, waiting in a booth with an IPA and the New York Times in hand. He came to my house when my family lost power during Hurricane Sandy to bring me gluten free snacks and red wine. Another time, after a particularly long shift at work, he showed up just to bring me a leather bound notebook so I could write because he knew how much I loved it. Kevin was the best thing that ever happened to me in ways that I didn’t realize until I had ended things in order to go to graduate school. He was moving to New York and I eventually moved to Washington, DC. It seemed logical, but somehow I never let go of him completely. He was consistently the man I always referenced– the baseline of how I should be treated or how someone should act. He was the benchmark of whom I wanted to share my life with, but I always felt too scared to ever ask if he’d be willing to fulfill such a request."}, {"87cc": "We remained distant and cordial friends through social media and birthday texts, but I always yearned for more. And so two years after my mistake to sever what we had cultivated, I sat across from him haunted by not only my decision, but by the reality of his health. I felt saddened, confused, angry, the feelings incapacitated my heart as I sat swirling my straw and faking smiles at him. I wanted to to tell him what I had hid, the feelings I had suppressed but somehow had bubbled to the surface as the timer seemed to ring . . . I was too late."}, {"cef9": "He asked me as the check arrived, “What are you up to this week?”"}, {"a54b": "“Nothing really, just visiting my parents until I have to head back to DC,” I said, tucking a piece of hair behind my ears, “Why, um, what do you have planned? You’re at work half time, right?”"}, {"a107": "“Yeah, I have Thursday off though to get chemo.”"}, {"44a5": "“Where is it?”"}, {"5946": "“Sloan Kettering on 60th,” he said, as if he was describing a grocery store."}, {"2178": "“Nice, umm, I mean, I could come, I mean if you’re allowed visitors or something, I can bring food or whatever. You get hungry right? Is that a stupid question? Gosh, I’m sorry I don’t know how to handle these things,” I said, fumbling over words, my eyes watering as I said them."}, {"f5e2": "“No, no worries at all. I get it, I somehow feel used to it, but I get it, I do. But, yeah, why don’t you come, we can make a day of it!” he said, almost cheerfully."}, {"4f7c": "“Sounds good.”"}, {"86de": "I promised myself that night as he walked me to the train, that how I felt about him could no longer be what drove my actions. I had to remove my selfish motives and put his health first, put him above me. Whatever time he had left was precious and fleeting."}, {"e216": "We spent Thursday in a sterilized room sprawled out in hospital chairs, his had a hook where they hung the chemo bags. We ate gummy bears and burritos–his favorite combination. I listened to his rants about what he wanted to do after he was finished with treatments. We made a list of places he would ride his motorcycle that he hadn’t yet bought."}, {"7761": "“I used to be scared of dying from an accident, now I almost want the chance,” he explained."}, {"a405": "But then, as the day dragged into the late afternoon, the tone evolved like the liquid pulsing from the bag above him."}, {"61a4": "While ripping open another bag of Haribos, “Maybe I am saying these things because I know they may never happen. If I do make it, can you force me to get a tattoo?” he paused, unsure of how serious the statement sounded. It was as if he wanted to drag our immature conversations back to the reality that we avoided."}, {"8711": "“No, I can’t promise that,” I replied, “because I haven’t heard what kind of tattoo. . . that really changes whether I have a reason to care.” He grasped at his stomach laughing, dropping two gelatin candies onto the laminate covered table, his IV drip dangled behind him like an accessory. I refused to let the circumstance harden him, so I kept going."}, {"af6c": "“I will agree if you promise to get a tramp stamp with a dolphin somewhere in it, then I will pay for it and drive you myself,” I assured him. I felt elated that I could make him laugh, hoping that it would comfort him in some small way."}, {"c09e": "“How about an NSYNC tattoo? The no strings attached album cover might be able to cover these scars pretty nicely,” pointing to his stomach where the surgery would be."}, {"aa2e": "“Now we are making a worthwhile deal,” I chuckled, preventing myself from crying, I sighed after minutes of laughter, “When is the surgery?”"}, {"33ed": "“Once chemo ends. . .about six week or so,” he looked at the nurse and she nodded, as if getting her permission."}, {"d02d": "“Are you scared for the surgery?” almost immediately regretting the question as it left my lips."}, {"f461": "“Yeah, I think I am the most scared for that part. . . that’s how my mom died you know”"}, {"29ab": "“I thought she died from cancer, just like. . .” I trailed, not knowing what I meant to say."}, {"12d3": "“No, well yes, but she died when she went in for her first surgery, she never came out. They said she bled out, I still am unsure why, I never asked my step dad or my dad, I just kind of accepted it in a way.”"}, {"0ab5": "“Kev, I . . .”"}, {"3b99": "“I know, but it happened so long ago, it feels surreal at times, like thinking about how young she was when she died, about eight years older than I am now.”"}, {"ac50": "I stared at him, waiting to think of something to say, anything to say. He looked down as if he knew I was at a loss for words, a loss for the ability to even imagine what he was implying. I ignored the distend of his cheeks and stomach from the medicine and the circles that drooped below his eyes and pretended that none of what I saw was really happening."}, {"66a8": "“I know you and you’re going to be okay. In fact, you’re going to get that damn tattoo if it is the last thing I do and I am totally going to have to pay for it, aren’t I?” I said, trying to hold back the pity behind sarcasm."}, {"5d25": "“Damn straight you will”, he said, almost giving me attitude while smirking."}, {"0212": "I smiled back, unsure of what it was that I was feeling. I felt unsure about everything–the future, his ability to handle what was happening, his chance of living, my inability to figure out a way to support him. . . I was a mess. I needed to figure it out, but I didn’t know where to go in my mind, I couldn’t even put one thought in logical order, it all felt like falling in love with him again–messy and fucking terrifying. It was like throwing my heart back into the ring and knowing it wasn’t coming back unscathed."}, {"b8e4": "Instead, I just observed him, like an art piece, smiling and absorbing all I could with my eyes– I knew I couldn’t touch it, but only look from afar. He was this entity I could admire because everything about him made me happy, just by being close to him. I loved the way he made faces when I talked about annoying people or the way he listened to me without ever interrupting. I loved the freckles that decorated his nose. He was whole and finished, he was a symbol of perfection, but he was dying."}, {"f151": "Everything about the fluorescent lit room reminded me of being home. Not by the decor or the physical state, but a state indescribable by words. It was a state defined by the notion that I wanted nothing more from the world because it felt as if its entirety could fit in the chair across from me."}, {"e242": "In that small room, separated from the others with a rubber curtain, I wanted to not just turn back time, but hold it in place. I wanted to crawl back into a world that had us drinking cheap alcohol on a deck in a suburban sprawl where cancer hasn’t yet arrived. I wanted to crawl into a time would when debating politics would be our most serious conversation. In that hospital room, I remembered that I so hopelessly wanted to crawl back."}, {"16f1": "The last time I saw Kevin, his hair was growing in, even darker than I had remembered it; it was a lackluster shade of fall leaves, orange in hue. He looked young again, grinning proudly as he went to hug me. He looked happy, unfathomably happy. It felt as if the cancer never happened. His wrinkle-less eggshell colored shirt enticed me to finally tell him the truth “So, can we start over? Now that the worst is behind us, we overcame what most will never endure, can we give us one more chance? I still love you.”"}, {"456c": "We sat at a bar in midtown Manhattan, twenty blocks from the place we sat thirteen months before. We stared across at each other waiting for the server. So much had changed: he had chemotherapy, radiation and one intensive surgery. He almost died in the ICU due to complications that occurred, but against everything, he lived. Eventually, he went back to work full time, received a promotion at his job and moved to Brooklyn and started a new relationship. I had went back to school the summer he got the surgery. I kept in touch, sent a five pound package of gummy bears and wrote him often. Over that year, I kept my promise. Kevin didn’t know how I still felt and he never would because he had endured enough. Kevin deserved a life that didn’t involve his past and I was just that; a reminder of all that happened."}, {"b8aa": "“How have you been?” I asked, my secret still hanging in the air."}, {"a013": "“Pretty good, everything has been going really well, I am off to visit my family in block island in a few weeks. Besides that everything is pretty normal. Work is work, it’s still a job.”"}, {"c04a": "He avoided the topic I desperately wanted him to reveal–the girl he was seeing. I found out through social media, a public display that read: she’s mine, and I want people to know."}, {"3e75": "My visceral reaction when I saw the first picture of her was to throw the phone, but instead I just “liked” the picture. I gave an empty gesture to the sunset photo, where the mystery girl looked from a dock onto the water. The juxtaposition was of her and a pier at dusk, masking any details of her face. I kept staring at it, obsessing over every detail I couldn’t see, my mind raced. It felt like a loss I hadn’t prepared."}, {"7264": "I was jealous of her in a way, she got to meet him now, when he was ready, after he had been young, idealistic, broken, then horribly sick. Now he was wise, kind, more patient and well, he was him, but better. It was fucked up to entitle him as a better person, but he was new in ways most people never get."}, {"39a0": "He eventually brought up her name casually as if it had been years, like she had been in his life all along."}, {"9415": "“So what does. . . Jessica do? What’s she like?” I asked."}, {"a582": "“She works on a blog in Brooklyn. She’s nice, a year younger than me. She’s from Long Island,” as if he was reading her bio from the blog itself."}, {"623e": "“Mhmm,” I nodded, “very cool.” I pretended to be okay as I forced my teeth to be seen behind my glossed lips, poorly disguising my resentment."}, {"34d4": "“A fucking blog”, I thought, nearly sputtering the words aloud– I hated her."}, {"f0ea": "Thinking of him and her as a collective noun made my palms grow sweaty. I kept imagining this life where they ride their bikes in tandem to the park on Saturdays after a long brunch with friends. I wanted to scream at him. I wanted to pull his face to mine so I could taste him. I just wanted to feel him one last time. I wanted more time with him than I got."}, {"5edd": "I hated him for moving on and I hated myself for feeling this way. But, what I hated most was that I could never tell him how I felt because I knew that no beautiful string of words mustered together would change what had already occurred–what had already formed our current lives. As if he could feel my discomfort, he assured me that they weren’t serious; he explained that his new fling was merely a consequence of internet convenience and proximity. But, I heard the readiness in his tone. This was the opportunity he wished for in the hospital room, but instead of a motorcycle, he opted for a one speed bike and a normal life in New York."}, {"6698": "I sat on my side of the booth, hands at my side and yearned to tell him things I should have said long ago, but refrained. I was aware of my selfishness, but underneath the aggression was a comfort in knowing I got to be there, even if there was gone. That somehow the time we had was irreplaceable, despite how fickle it all felt in the moment."}, {"2bce": "“I am happy for you, Kev,” I said painfully– feeling my heart ache inside my chest. It dropped low, like it may fall completely."}, {"3048": "“Thank you,” he said in voice that bordered sadness, lined with a guilt."}, {"dd2b": "“I am, I really am, I’ve always wanted this for you, you know me, I always get overly emotional–attached even,” I explained, wanting him to know it was my issue, not his."}, {"5855": "“And you know me, how I am, but know that nothing ever went wrong with us. I’ll always think of us. . . always,” he said like it was a way to preserve a piece of what we were. I felt settled in his words, like they unlocked a part of what I was looking for all this time, a contentment I didn’t think I could find."}, {"a1b9": "As we left the bar, I ran my hands over his tweed blazer while I hugged him goodbye. Long ago was a hospital room and now was a future he never thought he’d have. Our memories were haunting yet gloriously beautiful because in all of them he let me live a small speck of his fear. He held back the curtain into the death that he saw so closely and detailed. As my hands brushed the fabric delicately, I thought about the ten-inch scar that stretches from his rib cage to his groin and the hole in his bicep where they stuck the tube to get chemo into his body. I thought about all the things that hurt him to make him better, and I felt lucky."}, {"f839": "I felt lucky in that moment, to have seen and to have felt him –to have felt a feeling that wasn’t mine to feel. I felt humbled to have been there when he thought he was running out of time and to have been there, when he had come to realize he was going to have much more than he planned. I was comforted as I let go of his torso, my arms unwrapping from his back and my head lifting from his chest. I stood taller on my toes, lifting my heels to kiss his cheek softly, knowing that in a parallel place, in a tiny hospital room somewhere, Kevin and I exist. We exist laughing over tramp stamps and motorcycle trips with smuggled burritos in our hands. We only exist in a place that will never live beyond the fear that bound us to it."}, {"5d93": "*The real name has been altered to protect the person, since this is a true account."}], "content": "A Place I Can Never Visit As he tipped his glass to get the last sip of the ginger muddled rum he muttered, “I haven’t told you the story yet.” “Not yet”, I replied. “So, um, essentially, I had this really dull but persistent pain in my side, I ignored it because I had lots of clients on my caseload. By the time I paid attention, the pain was the size of two baseballs and spread to my liver and brain. Stage three, the doctors told me.” Kevin* was a technology consultant in Soho. He was clever and worked long hours, a clone of nearly every semi-privileged millennial in the New York metropolis. He lived a nice life for a twenty-five year old–pre-cancer of course. A month before, I received a message from Kevin, my college boyfriend. Messages from exes usually go one of two ways. They either have awful and vindictive things to say that break your heart. Or they have wonderful things to say, which also break your heart. This one was different, but it still broke my heart. Donna, I know it’s been a while. . . but I have cancer and thought you would want to know. I’m not trying to scare you, I just know that you’d be pissed if you found out through Facebook or something lame like that. Yours, Kevin. I remember reading the message a few times to let the word cancer truly permeate. No. How? No. My thoughts repeated until I grew sober enough to ask him to dinner. We sat in a basement restaurant that served quail eggs wrapped in bacon pierced by tiny toothpicks. His head was covered with a Yankees cap and his eyes were veiled in thick tortoise shell frames. I didn’t expect him to be bald. I know that is a silly and ridiculous statement; to expect a cancer patient not to be bald, but for some reason I couldn’t stop watching where his forehead and scalp crease formed as he lifted his eyebrows. I tried to remember what he had looked like before all this. He used to have thick strawberry blonde hair that he brushed leftwards, it looked strange now, being so bare and exposed. I should have looked away, but instead I stared, hoping to make sense of it all. His eyelashes and eyebrows were still there, lightly colored and hard to see, but they remained the same. He explained that it was a myth that you lose those early on because they are slow growing hairs, unlike the ones on his head. But more than just hair changes, he had aged. He looked wiser and somehow more qualified to tell me what dying feels like. I tried to process the impending reality while I hid my fear with smiles and long gazes of pity–I was fucking up, but I couldn’t help it. No one trained me for this, nobody handed me the manual on how to act when the guy whom you broke up with is now dying two years later. They forgot to hand out that pamphlet in college. “What kind?” I asked. I didn’t know what else to ask, I sounded dumb worrying about where it had originated. “Testicular,” he whispered and looked around, embarrassed. Of course my mind flashed back to a moment of us having sex. I tried to stop it, I tried not to wonder if he had it in his body back then. If somehow we could have known? “Kev, I’m so sorry,” I said, exhaling slowly. “Don’t be, it is what it is,” he said solemnly, like he was making peace with the diagnosis. He looked at me from across the table, his hand twirling a toothpick covered in greasy fried chicken skin, “do you know what I realized what being told you have stage three testicular cancer feels like?” he asked, knowing it was rhetorical. “It’s like turning on the news and watching a terrorist attack or a natural disaster. The world seems as if it might be ending. You’re unsure of what is really happening, yet you know more horrific outcomes are soon to come. On that television screen you look for information and you’re flooded with updates. You get overwhelmed, so you turn it off and you look around. But no one else is there watching because you’re alone in a room watching life deteriorate rapidly. So you go outside, seeking other people who are running around crying, unsure of what they have seen, unsure of what will happen to the world after this tragedy unravels. But all you see is people living their lives; walking their dogs and drinking their coffee. People headed to work stressed over stock prices and marital issues; people just going on as if the world isn’t ending because for them it isn’t. For them, the tragedy hasn’t happened yet, or never will. They live in a world that existed before you turned on the news channel where your name is the only one on the bottom screen ticker.” Kevin told me more than just about the scary parts of cancer, he told me about the parts that no one ever talks about: parts that belong on an episode of HBO’s Girls. And as much as I love Girls, I don’t like to think of my ex “jerking off to save his last viable sperm”. Unaware or uninterested of my opinion on the topic. He told me about the shape of the cup that he was meant to finish in, but couldn’t. He told me about the ways the doctors manipulated him and touched him as if he was just an inanimate object, almost causing the feeling of touch to become mundane and unexciting. He talked to me as if he wanted to unleash the side of cancer most never think about. Somewhere between discussions on chemo and surgery, a bottle of pear flavored sake arrived. “I ordered some so we could toast to cancer, why the hell not, am I right?” he asked. “Why the hell not,” I declared as I tried to read his eyes. We danced around each other’s feelings in awkward moments of poorly timed jokes and forced laughter, much like how we did when we first met. Though, he never knew that it was a complete set up. During college, my best friend worked at a electronic store with Kevin. She had instructed me to come visit on a day when “the guy who is totally my type” was working. I was desperate for a new phone and slightly desperate in general, so I visited. She motioned him over to where her and I stood, “Kevin, can you help my friend out, I need to help an annoying customer”, she lied– winking at me as she walked away. “Sure,” he replied, smiling and extending his hand for a handshake. He was far more handsome than she described. He was tall and thin, donned in a flannel shirt, wearing vintage glasses that drew me to his azure pigmented eyes. His beard was reddish, a color darker than his hair. He had a strong jaw and a short beard that nearly masked it. His face was kind, yet almost stoic, like a beautiful painting I wanted to touch. I left the store with a new phone and an invitation for a drink with the blue eyed salesman. Though it was unbeknown to me at the time, we began the best relationship I ever had. Kevin would visit me at my brewery job every weekend, waiting in a booth with an IPA and the New York Times in hand. He came to my house when my family lost power during Hurricane Sandy to bring me gluten free snacks and red wine. Another time, after a particularly long shift at work, he showed up just to bring me a leather bound notebook so I could write because he knew how much I loved it. Kevin was the best thing that ever happened to me in ways that I didn’t realize until I had ended things in order to go to graduate school. He was moving to New York and I eventually moved to Washington, DC. It seemed logical, but somehow I never let go of him completely. He was consistently the man I always referenced– the baseline of how I should be treated or how someone should act. He was the benchmark of whom I wanted to share my life with, but I always felt too scared to ever ask if he’d be willing to fulfill such a request. We remained distant and cordial friends through social media and birthday texts, but I always yearned for more. And so two years after my mistake to sever what we had cultivated, I sat across from him haunted by not only my decision, but by the reality of his health. I felt saddened, confused, angry, the feelings incapacitated my heart as I sat swirling my straw and faking smiles at him. I wanted to to tell him what I had hid, the feelings I had suppressed but somehow had bubbled to the surface as the timer seemed to ring . . . I was too late. He asked me as the check arrived, “What are you up to this week?” “Nothing really, just visiting my parents until I have to head back to DC,” I said, tucking a piece of hair behind my ears, “Why, um, what do you have planned? You’re at work half time, right?” “Yeah, I have Thursday off though to get chemo.” “Where is it?” “Sloan Kettering on 60th,” he said, as if he was describing a grocery store. “Nice, umm, I mean, I could come, I mean if you’re allowed visitors or something, I can bring food or whatever. You get hungry right? Is that a stupid question? Gosh, I’m sorry I don’t know how to handle these things,” I said, fumbling over words, my eyes watering as I said them. “No, no worries at all. I get it, I somehow feel used to it, but I get it, I do. But, yeah, why don’t you come, we can make a day of it!” he said, almost cheerfully. “Sounds good.” I promised myself that night as he walked me to the train, that how I felt about him could no longer be what drove my actions. I had to remove my selfish motives and put his health first, put him above me. Whatever time he had left was precious and fleeting. We spent Thursday in a sterilized room sprawled out in hospital chairs, his had a hook where they hung the chemo bags. We ate gummy bears and burritos–his favorite combination. I listened to his rants about what he wanted to do after he was finished with treatments. We made a list of places he would ride his motorcycle that he hadn’t yet bought. “I used to be scared of dying from an accident, now I almost want the chance,” he explained. But then, as the day dragged into the late afternoon, the tone evolved like the liquid pulsing from the bag above him. While ripping open another bag of Haribos, “Maybe I am saying these things because I know they may never happen. If I do make it, can you force me to get a tattoo?” he paused, unsure of how serious the statement sounded. It was as if he wanted to drag our immature conversations back to the reality that we avoided. “No, I can’t promise that,” I replied, “because I haven’t heard what kind of tattoo. . . that really changes whether I have a reason to care.” He grasped at his stomach laughing, dropping two gelatin candies onto the laminate covered table, his IV drip dangled behind him like an accessory. I refused to let the circumstance harden him, so I kept going. “I will agree if you promise to get a tramp stamp with a dolphin somewhere in it, then I will pay for it and drive you myself,” I assured him. I felt elated that I could make him laugh, hoping that it would comfort him in some small way. “How about an NSYNC tattoo? The no strings attached album cover might be able to cover these scars pretty nicely,” pointing to his stomach where the surgery would be. “Now we are making a worthwhile deal,” I chuckled, preventing myself from crying, I sighed after minutes of laughter, “When is the surgery?” “Once chemo ends. . .about six week or so,” he looked at the nurse and she nodded, as if getting her permission. “Are you scared for the surgery?” almost immediately regretting the question as it left my lips. “Yeah, I think I am the most scared for that part. . . that’s how my mom died you know” “I thought she died from cancer, just like. . .” I trailed, not knowing what I meant to say. “No, well yes, but she died when she went in for her first surgery, she never came out. They said she bled out, I still am unsure why, I never asked my step dad or my dad, I just kind of accepted it in a way.” “Kev, I . . .” “I know, but it happened so long ago, it feels surreal at times, like thinking about how young she was when she died, about eight years older than I am now.” I stared at him, waiting to think of something to say, anything to say. He looked down as if he knew I was at a loss for words, a loss for the ability to even imagine what he was implying. I ignored the distend of his cheeks and stomach from the medicine and the circles that drooped below his eyes and pretended that none of what I saw was really happening. “I know you and you’re going to be okay. In fact, you’re going to get that damn tattoo if it is the last thing I do and I am totally going to have to pay for it, aren’t I?” I said, trying to hold back the pity behind sarcasm. “Damn straight you will”, he said, almost giving me attitude while smirking. I smiled back, unsure of what it was that I was feeling. I felt unsure about everything–the future, his ability to handle what was happening, his chance of living, my inability to figure out a way to support him. . . I was a mess. I needed to figure it out, but I didn’t know where to go in my mind, I couldn’t even put one thought in logical order, it all felt like falling in love with him again–messy and fucking terrifying. It was like throwing my heart back into the ring and knowing it wasn’t coming back unscathed. Instead, I just observed him, like an art piece, smiling and absorbing all I could with my eyes– I knew I couldn’t touch it, but only look from afar. He was this entity I could admire because everything about him made me happy, just by being close to him. I loved the way he made faces when I talked about annoying people or the way he listened to me without ever interrupting. I loved the freckles that decorated his nose. He was whole and finished, he was a symbol of perfection, but he was dying. Everything about the fluorescent lit room reminded me of being home. Not by the decor or the physical state, but a state indescribable by words. It was a state defined by the notion that I wanted nothing more from the world because it felt as if its entirety could fit in the chair across from me. In that small room, separated from the others with a rubber curtain, I wanted to not just turn back time, but hold it in place. I wanted to crawl back into a world that had us drinking cheap alcohol on a deck in a suburban sprawl where cancer hasn’t yet arrived. I wanted to crawl into a time would when debating politics would be our most serious conversation. In that hospital room, I remembered that I so hopelessly wanted to crawl back. The last time I saw Kevin, his hair was growing in, even darker than I had remembered it; it was a lackluster shade of fall leaves, orange in hue. He looked young again, grinning proudly as he went to hug me. He looked happy, unfathomably happy. It felt as if the cancer never happened. His wrinkle-less eggshell colored shirt enticed me to finally tell him the truth “So, can we start over? Now that the worst is behind us, we overcame what most will never endure, can we give us one more chance? I still love you.” We sat at a bar in midtown Manhattan, twenty blocks from the place we sat thirteen months before. We stared across at each other waiting for the server. So much had changed: he had chemotherapy, radiation and one intensive surgery. He almost died in the ICU due to complications that occurred, but against everything, he lived. Eventually, he went back to work full time, received a promotion at his job and moved to Brooklyn and started a new relationship. I had went back to school the summer he got the surgery. I kept in touch, sent a five pound package of gummy bears and wrote him often. Over that year, I kept my promise. Kevin didn’t know how I still felt and he never would because he had endured enough. Kevin deserved a life that didn’t involve his past and I was just that; a reminder of all that happened. “How have you been?” I asked, my secret still hanging in the air. “Pretty good, everything has been going really well, I am off to visit my family in block island in a few weeks. Besides that everything is pretty normal. Work is work, it’s still a job.” He avoided the topic I desperately wanted him to reveal–the girl he was seeing. I found out through social media, a public display that read: she’s mine, and I want people to know. My visceral reaction when I saw the first picture of her was to throw the phone, but instead I just “liked” the picture. I gave an empty gesture to the sunset photo, where the mystery girl looked from a dock onto the water. The juxtaposition was of her and a pier at dusk, masking any details of her face. I kept staring at it, obsessing over every detail I couldn’t see, my mind raced. It felt like a loss I hadn’t prepared. I was jealous of her in a way, she got to meet him now, when he was ready, after he had been young, idealistic, broken, then horribly sick. Now he was wise, kind, more patient and well, he was him, but better. It was fucked up to entitle him as a better person, but he was new in ways most people never get. He eventually brought up her name casually as if it had been years, like she had been in his life all along. “So what does. . . Jessica do? What’s she like?” I asked. “She works on a blog in Brooklyn. She’s nice, a year younger than me. She’s from Long Island,” as if he was reading her bio from the blog itself. “Mhmm,” I nodded, “very cool.” I pretended to be okay as I forced my teeth to be seen behind my glossed lips, poorly disguising my resentment. “A fucking blog”, I thought, nearly sputtering the words aloud– I hated her. Thinking of him and her as a collective noun made my palms grow sweaty. I kept imagining this life where they ride their bikes in tandem to the park on Saturdays after a long brunch with friends. I wanted to scream at him. I wanted to pull his face to mine so I could taste him. I just wanted to feel him one last time. I wanted more time with him than I got. I hated him for moving on and I hated myself for feeling this way. But, what I hated most was that I could never tell him how I felt because I knew that no beautiful string of words mustered together would change what had already occurred–what had already formed our current lives. As if he could feel my discomfort, he assured me that they weren’t serious; he explained that his new fling was merely a consequence of internet convenience and proximity. But, I heard the readiness in his tone. This was the opportunity he wished for in the hospital room, but instead of a motorcycle, he opted for a one speed bike and a normal life in New York. I sat on my side of the booth, hands at my side and yearned to tell him things I should have said long ago, but refrained. I was aware of my selfishness, but underneath the aggression was a comfort in knowing I got to be there, even if there was gone. That somehow the time we had was irreplaceable, despite how fickle it all felt in the moment. “I am happy for you, Kev,” I said painfully– feeling my heart ache inside my chest. It dropped low, like it may fall completely. “Thank you,” he said in voice that bordered sadness, lined with a guilt. “I am, I really am, I’ve always wanted this for you, you know me, I always get overly emotional–attached even,” I explained, wanting him to know it was my issue, not his. “And you know me, how I am, but know that nothing ever went wrong with us. I’ll always think of us. . . always,” he said like it was a way to preserve a piece of what we were. I felt settled in his words, like they unlocked a part of what I was looking for all this time, a contentment I didn’t think I could find. As we left the bar, I ran my hands over his tweed blazer while I hugged him goodbye. Long ago was a hospital room and now was a future he never thought he’d have. Our memories were haunting yet gloriously beautiful because in all of them he let me live a small speck of his fear. He held back the curtain into the death that he saw so closely and detailed. As my hands brushed the fabric delicately, I thought about the ten-inch scar that stretches from his rib cage to his groin and the hole in his bicep where they stuck the tube to get chemo into his body. I thought about all the things that hurt him to make him better, and I felt lucky. I felt lucky in that moment, to have seen and to have felt him –to have felt a feeling that wasn’t mine to feel. I felt humbled to have been there when he thought he was running out of time and to have been there, when he had come to realize he was going to have much more than he planned. I was comforted as I let go of his torso, my arms unwrapping from his back and my head lifting from his chest. I stood taller on my toes, lifting my heels to kiss his cheek softly, knowing that in a parallel place, in a tiny hospital room somewhere, Kevin and I exist. We exist laughing over tramp stamps and motorcycle trips with smuggled burritos in our hands. We only exist in a place that will never live beyond the fear that bound us to it. *The real name has been altered to protect the person, since this is a true account. ", "child": "1399_1\t1399_2\t1399_3\t1399_4\t1399_5\t1399_6"}