{"name": "1402", "parent": "", "title": "The Things We do for Love", "sentences": [{"ae4b": "The Things We do for Love"}, {"9159": "4:15 AM:"}, {"8af5": "One of our kittens is fighting with a Nutty Buddy wrapper my husband left on his nightstand. Two of our kittens are chasing each other, running across the bed and crashing into walls. An older cat is meow howling for no reason. Another is punching me in the face."}, {"8f92": "My husband and I can’t sleep through all the ruckus and he has to be up for work in two hours. “I’ll go downstairs so you can sleep,” I say. “They’ll follow me down there.”"}, {"a43c": "I got up, put my robe on and headed downstairs to the main floor of our home, eight cats in tow. Yawn. Stretch. This is ridiculous."}, {"64ef": "One of the kittens was scratching on the back door. It’s pouring rain, I thought. What a freak. Then I thought, why not? They’ll be happy and maybe it will bring me some peace."}, {"048a": "4:30 AM:"}, {"35a6": "I'm now sitting out back in the pouring rain and tornado like wind with a pack of cats."}, {"3a3c": "The things we do for love."}, {"7e3f": "You can contribute to my writing habit by clicking this link."}, {"05c8": "You can follow my absurd life on Facebook and my cats on “The Crazy Cat Lady Photo Blog.”"}], "content": "The Things We do for Love 4:15 AM: One of our kittens is fighting with a Nutty Buddy wrapper my husband left on his nightstand. Two of our kittens are chasing each other, running across the bed and crashing into walls. An older cat is meow howling for no reason. Another is punching me in the face. My husband and I can’t sleep through all the ruckus and he has to be up for work in two hours. “I’ll go downstairs so you can sleep,” I say. “They’ll follow me down there.” I got up, put my robe on and headed downstairs to the main floor of our home, eight cats in tow. Yawn. Stretch. This is ridiculous. One of the kittens was scratching on the back door. It’s pouring rain, I thought. What a freak. Then I thought, why not? They’ll be happy and maybe it will bring me some peace. 4:30 AM: I'm now sitting out back in the pouring rain and tornado like wind with a pack of cats. The things we do for love. You can contribute to my writing habit by clicking this link. You can follow my absurd life on Facebook and my cats on “The Crazy Cat Lady Photo Blog.” ", "child": "1402_1\t1402_2\t1402_3\t1402_4\t1402_5\t1402_6"}