{"name": "1409", "parent": "", "title": "5 gier dla dzieci pomagających w nauce programowania", "sentences": [{"2d2b": "5 gier dla dzieci pomagających w nauce programowania"}, {"801c": "Pamiętacie artykuł, w którym pisałam o tym, dlaczego warto uczyć dzieci programowania? Po lekturze tego tekstu, znajomy zapytał mnie, czy słyszałam o jakichś fajnych aplikacjach edukacyjnych, które mógłby kupić swoim pociechom. Na jego prośbę, stworzyłam listę 5 gier, które łączą w sobie świetną zabawę z nauką logicznego myślenia. Sprawdźcie:"}, {"f756": "1. Scratch"}, {"1dcf": "Źródło: http://news.mit.edu"}, {"7c62": "Grupa wiekowa: 8–16 latPolska wersja językowa: TAK"}, {"7648": "O aplikacji Scratch pisałam już wcześniej, ale wspomnę jeszcze raz, ponieważ uważam, że to jedna z najlepszych pozycji na rynku. Dzięki niej, Twoja pociecha w prosty i przyjemny sposób nauczy się w tworzyć gry, animacje i interaktywne historyjki, którymi będzie mogła się podzielić z innymi graczami. Wystarczy zaledwie kilka godzin, aby Twoje dziecko zrozumiało działanie programu i rozpoczęło samodzielne tworzenie swojego wirtualnego świata."}, {"8b8d": "Jeśli jesteś ciekaw, w jaki sposób działa Scratch, polecam zapoznanie się z jednym z filmików, które pokazują, jak za pomocą tej aplikacji stworzyć prostą grę:"}, {"bc43": "2. Code Monkey"}, {"822c": "Źródło: www.playcodemonkey.com"}, {"66bd": "Grupa wiekowa: 8–12 latPolska wersja językowa: TAK (można ustawić w Menu)"}, {"2bad": "Oto kolejna prosta w obsłudze, a jednocześnie wymagająca kreatywności gra — Code Monkey. Gra rozpoczyna się krótką historyjką małpki, której ukradziono banany. Po chwili rozpaczy, małpka postanawia wyruszyć w podróż, która pomoże jej odzyskać ulubione owoce."}, {"15a2": "Gra podzielona została na kilka poziomów, a w każdym z nich dziecko musi przepisać kod, który umożliwi małpce dotarcie do banana. Wraz z kolejnymi “levelami”, gra staje się coraz bardziej skomplikowana — tzn. wymagane są dłuższe i bardziej rozbudowane polecenia, plansze mają coraz więcej nowych przeszkód, wymagających dłuższych i bardziej rozbudowanych linijek kodu."}, {"6304": "Uwaga! Niepełna (bezpłatna) wersja Code Monkey dostępna jest na stronie i można ją uruchomić bezpośrednio z przeglądarki, bez konieczności instalacji na komputerze. Koniecznie wypróbuj ją wraz ze swoją pociechą! :)"}, {"af75": "3. Photon"}, {"ac22": "Grupa wiekowa: 6–12 latPolska wersja językowa: TAK"}, {"457f": "Czas na dzieło polskich studentów! Photon to mały, interaktywny robot edukacyjny, sterowany za pomocą aplikacji mobilnej, dostępnej na smartfony i tablety. Jak zapewniają producenci — jest to pierwszy na świecie robot, który rozwija się razem z dzieckiem. Mali gracze, pokonując kolejne poziomy, rozbudowują możliwości zabawki, a tym samym nabywają wiedzę z dziedziny programowania. Photon zawiera elementy RPG oraz gry zespołowej, co dodatkowo uatrakcyjnia go w oczach najmłodszych użytkowników."}, {"4365": "Ten wyjątkowy wynalazek białostockich studentów sprawi, że Twoje dziecko w niezwykle łatwy i przyjemny sposób zdobędzie umiejętność logicznego myślenia i szybkiego podejmowania decyzji, a także rozwinie pamięć i zeznajomi się z nowymi technologiami. Nie wierzysz? Sprawdź:"}, {"b554": "4. Scottie Go!"}, {"d16d": "Źródło: scottiego.pl"}, {"5895": "Grupa wiekowa: 6+ Polska wersja językowa: TAK"}, {"f8aa": "Chyba nie mamy już wątpliwości, że Polak potrafi! Kolejny przykład? Gra edukacyjna stworzona przez ekipę z Poznańskiego Centrum Superkomputerowo-Sieciowego o nazwie Scottie Go! Polski wynalazek łączy ze sobą fizyczną grę z aplikacją mobilną. Dziecko ma do dyspozycji kartonowe klocki, służące do pisania programów oraz program, który pozwala je zeskanować i przekształcić na zachowanie Scottiego i innych bohaterów. Na małego gracza czeka wiele zadań o rosnącym poziomie trudności, które powoli wprowadzają go w świat programowania."}, {"a8d4": "Na czym dokładnie polega zabawa? Pozwolę sobie zacytować fragment opisu znalezionego na oficjalnej stronie producenta:"}, {"5723": "(…) Jest rok 2030. Pojazd Scottiego ulega awarii i przymusowo ląduje na naszej planecie. Pomóż Scottiemu zdobyć części zamienne do pojazdu. Zrób to programując jego ruchy. Stań się ekspertem w projektowaniu algorytmów i poznaj podstawy programowania."}, {"4e3f": "5. Code Combat"}, {"3b9c": "Źródło: getbadges.io"}, {"2afd": "Grupa wiekowa: 9+Polska wersja językowa: TAK"}, {"e740": "Na koniec gra RPG przeznaczona zarówno dla dzieci, jak i dorosłych! Jest dostępna z poziomu przeglądarki i uczy programowania w znanych językach, takich jak Python czy JavaStript. Wcielamy się w niej w bohatera, któremu — za pomocą konkretnych komend — wydajemy polecenia, przechodząc kolejne poziomy gry. W każdym z nich dostajemy zadanie, które należy zrealizować wpisując odpowiedni kod. Po jego wykonaniu, otrzymujemy informację, czego się nauczyliśmy."}, {"e9a6": "Code Combat pozwala przede wszystkim zrozumieć podstawy programowania, jednak znajdziemy tu też coś dla bardziej zaawansowanych! Gra wykorzystuje bowiem elementy grywalizacji — dzięki przejściu na tryb multiplayer, można spróbować swoich sił, zmagając się z innymi graczami."}, {"8979": "To by było na tyle — mam nadzieję, że znaleźliście coś, co rzeczywiście przyda się Waszym pociechom. A może znacie lub słyszeliście o jakichś innych, fajnych grach, o których nie wspomniałam? Jeśli tak — koniecznie podzielcie się nimi w komentarzu! :)"}], "content": "5 gier dla dzieci pomagających w nauce programowania Pamiętacie artykuł, w którym pisałam o tym, dlaczego warto uczyć dzieci programowania? Po lekturze tego tekstu, znajomy zapytał mnie, czy słyszałam o jakichś fajnych aplikacjach edukacyjnych, które mógłby kupić swoim pociechom. Na jego prośbę, stworzyłam listę 5 gier, które łączą w sobie świetną zabawę z nauką logicznego myślenia. Sprawdźcie: 1. Scratch Źródło: http://news.mit.edu Grupa wiekowa: 8–16 latPolska wersja językowa: TAK O aplikacji Scratch pisałam już wcześniej, ale wspomnę jeszcze raz, ponieważ uważam, że to jedna z najlepszych pozycji na rynku. Dzięki niej, Twoja pociecha w prosty i przyjemny sposób nauczy się w tworzyć gry, animacje i interaktywne historyjki, którymi będzie mogła się podzielić z innymi graczami. Wystarczy zaledwie kilka godzin, aby Twoje dziecko zrozumiało działanie programu i rozpoczęło samodzielne tworzenie swojego wirtualnego świata. Jeśli jesteś ciekaw, w jaki sposób działa Scratch, polecam zapoznanie się z jednym z filmików, które pokazują, jak za pomocą tej aplikacji stworzyć prostą grę: 2. Code Monkey Źródło: www.playcodemonkey.com Grupa wiekowa: 8–12 latPolska wersja językowa: TAK (można ustawić w Menu) Oto kolejna prosta w obsłudze, a jednocześnie wymagająca kreatywności gra — Code Monkey. Gra rozpoczyna się krótką historyjką małpki, której ukradziono banany. Po chwili rozpaczy, małpka postanawia wyruszyć w podróż, która pomoże jej odzyskać ulubione owoce. Gra podzielona została na kilka poziomów, a w każdym z nich dziecko musi przepisać kod, który umożliwi małpce dotarcie do banana. Wraz z kolejnymi “levelami”, gra staje się coraz bardziej skomplikowana — tzn. wymagane są dłuższe i bardziej rozbudowane polecenia, plansze mają coraz więcej nowych przeszkód, wymagających dłuższych i bardziej rozbudowanych linijek kodu. Uwaga! Niepełna (bezpłatna) wersja Code Monkey dostępna jest na stronie i można ją uruchomić bezpośrednio z przeglądarki, bez konieczności instalacji na komputerze. Koniecznie wypróbuj ją wraz ze swoją pociechą! :) 3. Photon Grupa wiekowa: 6–12 latPolska wersja językowa: TAK Czas na dzieło polskich studentów! Photon to mały, interaktywny robot edukacyjny, sterowany za pomocą aplikacji mobilnej, dostępnej na smartfony i tablety. Jak zapewniają producenci — jest to pierwszy na świecie robot, który rozwija się razem z dzieckiem. Mali gracze, pokonując kolejne poziomy, rozbudowują możliwości zabawki, a tym samym nabywają wiedzę z dziedziny programowania. Photon zawiera elementy RPG oraz gry zespołowej, co dodatkowo uatrakcyjnia go w oczach najmłodszych użytkowników. Ten wyjątkowy wynalazek białostockich studentów sprawi, że Twoje dziecko w niezwykle łatwy i przyjemny sposób zdobędzie umiejętność logicznego myślenia i szybkiego podejmowania decyzji, a także rozwinie pamięć i zeznajomi się z nowymi technologiami. Nie wierzysz? Sprawdź: 4. Scottie Go! Źródło: scottiego.pl Grupa wiekowa: 6+ Polska wersja językowa: TAK Chyba nie mamy już wątpliwości, że Polak potrafi! Kolejny przykład? Gra edukacyjna stworzona przez ekipę z Poznańskiego Centrum Superkomputerowo-Sieciowego o nazwie Scottie Go! Polski wynalazek łączy ze sobą fizyczną grę z aplikacją mobilną. Dziecko ma do dyspozycji kartonowe klocki, służące do pisania programów oraz program, który pozwala je zeskanować i przekształcić na zachowanie Scottiego i innych bohaterów. Na małego gracza czeka wiele zadań o rosnącym poziomie trudności, które powoli wprowadzają go w świat programowania. Na czym dokładnie polega zabawa? Pozwolę sobie zacytować fragment opisu znalezionego na oficjalnej stronie producenta: (…) Jest rok 2030. Pojazd Scottiego ulega awarii i przymusowo ląduje na naszej planecie. Pomóż Scottiemu zdobyć części zamienne do pojazdu. Zrób to programując jego ruchy. Stań się ekspertem w projektowaniu algorytmów i poznaj podstawy programowania. 5. Code Combat Źródło: getbadges.io Grupa wiekowa: 9+Polska wersja językowa: TAK Na koniec gra RPG przeznaczona zarówno dla dzieci, jak i dorosłych! Jest dostępna z poziomu przeglądarki i uczy programowania w znanych językach, takich jak Python czy JavaStript. Wcielamy się w niej w bohatera, któremu — za pomocą konkretnych komend — wydajemy polecenia, przechodząc kolejne poziomy gry. W każdym z nich dostajemy zadanie, które należy zrealizować wpisując odpowiedni kod. Po jego wykonaniu, otrzymujemy informację, czego się nauczyliśmy. Code Combat pozwala przede wszystkim zrozumieć podstawy programowania, jednak znajdziemy tu też coś dla bardziej zaawansowanych! Gra wykorzystuje bowiem elementy grywalizacji — dzięki przejściu na tryb multiplayer, można spróbować swoich sił, zmagając się z innymi graczami. To by było na tyle — mam nadzieję, że znaleźliście coś, co rzeczywiście przyda się Waszym pociechom. A może znacie lub słyszeliście o jakichś innych, fajnych grach, o których nie wspomniałam? Jeśli tak — koniecznie podzielcie się nimi w komentarzu! :) ", "child": "1409_11409_11409_11409_11409_11409_11409_11409_1"}