{"name": "1413", "parent": "", "title": "EVEN CRAZIER!", "sentences": [{"5652": "EVEN CRAZIER!"}, {"7fc5": "I didn’t even bother with the second tattoo for guessing, as I assumed it was obscure enough to not offer much fun in guessing (whereas I thought surely someone would eventually guess Tiger)."}, {"2d97": "However, the potentially psychic Cristina Matteis must have mind melded with Lord Ganesha to reveal that I also have a Hah Taew!"}, {"4cc4": "Therefore they shall both select a song, and I’ll perform both!"}, {"e688": "Clay has offered a list for me to choose from, but I say, why not let you guys vote on it?"}, {"d97b": "Reply to this with your song choice from Clay’s list (re-posted below). I’ll perform the most popular choice!"}, {"f29c": "This is not restricted to those of you I’ve tagged so feel free to share it around. :)"}, {"7b96": "Clay’s Heath Houston Tattoo Karaoke List:"}, {"3c44": "Normal Earthling, Hannah Bobannah, beckyblankenship8, albert l gerber, ePeak, Willow T. Lovelace, Cristina Matteis, BHD, Adam Maldonado, Kathleen Clarke Anderson, Ezinne Ukoha, Kristofer Mac Cormaic, SF Ali, Efe Nakpodia, Anuschka Conoci, Aura Wilming, Emily Roberts, Jack Herlocker, Dewi, Thomas R. Barton, JD, Jack Preston King, Sara Weaver, Lorena Levine, Maverick, Jennifer Marie Killgore, alto, Lizella Prescott, Jason Stelzner, bharati.banerjee, Zac Chapepa, Clay Rivers, marika bianca, Stella J., Jess Kaisk, Dusty Craig, Riel E., adal2com광교오피, Matt Querzoli, TeriJo, Cristian Randieri, Phd, adal2com 구리오피, Louise Jones, Ronnie Heaven, Kitten Holiday, Cami Gram, Ali Aoun, and Daniel Weldon"}, {"e4c8": "If I missed anyone, I’m multi-tasking my ass off right now, so SORRY! I STILL LOVE YOOOOUUUU!!!"}], "content": "EVEN CRAZIER! I didn’t even bother with the second tattoo for guessing, as I assumed it was obscure enough to not offer much fun in guessing (whereas I thought surely someone would eventually guess Tiger). However, the potentially psychic Cristina Matteis must have mind melded with Lord Ganesha to reveal that I also have a Hah Taew! Therefore they shall both select a song, and I’ll perform both! Clay has offered a list for me to choose from, but I say, why not let you guys vote on it? Reply to this with your song choice from Clay’s list (re-posted below). I’ll perform the most popular choice! This is not restricted to those of you I’ve tagged so feel free to share it around. :) Clay’s Heath Houston Tattoo Karaoke List: Normal Earthling, Hannah Bobannah, beckyblankenship8, albert l gerber, ePeak, Willow T. Lovelace, Cristina Matteis, BHD, Adam Maldonado, Kathleen Clarke Anderson, Ezinne Ukoha, Kristofer Mac Cormaic, SF Ali, Efe Nakpodia, Anuschka Conoci, Aura Wilming, Emily Roberts, Jack Herlocker, Dewi, Thomas R. Barton, JD, Jack Preston King, Sara Weaver, Lorena Levine, Maverick, Jennifer Marie Killgore, alto, Lizella Prescott, Jason Stelzner, bharati.banerjee, Zac Chapepa, Clay Rivers, marika bianca, Stella J., Jess Kaisk, Dusty Craig, Riel E., adal2com광교오피, Matt Querzoli, TeriJo, Cristian Randieri, Phd, adal2com 구리오피, Louise Jones, Ronnie Heaven, Kitten Holiday, Cami Gram, Ali Aoun, and Daniel Weldon If I missed anyone, I’m multi-tasking my ass off right now, so SORRY! I STILL LOVE YOOOOUUUU!!! ", "child": "1413_1\t1413_2\t1413_3\t1413_4\t1413_5\t1413_6\t1413_7\t1413_8\t1413_9\t1413_10\t1413_11\t1413_12\t1413_13\t1413_14\t1413_15\t1413_16\t1413_171413_1\t1413_2\t1413_3\t1413_4\t1413_5\t1413_6\t1413_7\t1413_8\t1413_9\t1413_10\t1413_11\t1413_12\t1413_13\t1413_14\t1413_15\t1413_16\t1413_17"}