{"name": "1426", "parent": "", "title": "Fantasy Console Wars: A Guide to The Biggest Players in Retrogaming’s Newest Trend", "sentences": [{"dcdb": "Fantasy Console Wars: A Guide to The Biggest Players in Retrogaming’s Newest Trend"}, {"79bd": "“Happy New Year”, by John King. PICO-8."}, {"5962": "In December 2016, I was looking for a new hobby. Music, in the age of Spotify and Pandora was becoming a less and less “active” affair. New frontiers in computer science were opening up, but I was reluctant to crack open a linear algebra textbook when I was already freaking out over Calculus and Statistics finals."}, {"a52d": "It was quite a welcome thing then, to see the Twitter chatter over the PICO-8 “fantasy console.” The PICO-8, first released in 2014 by Voxatron developer and creator Joseph “zep” White, is for “for making, sharing and playing tiny games and other computer programs.”"}, {"41c4": "First and last step of “A Pico-8 Spaceshooter in 16 GIFs”"}, {"e4c9": "Fantasy consoles can be thought of as being made up of three things:"}, {"ae6f": "“There was something about plotting large colourful pixels and punching in programs on a large clunky keyboard that resonated with my 8-year-old brain[…] it was meant to be just you, the program, and the inky black canvas.” — zep, PICO-8 ZINE #1"}, {"f357": "Eyeboss by Blue Candle Games, playable in browser. PICO-8."}, {"f6a7": "Fantasy consoles are exciting."}, {"0933": "The PICO-8 seeks to emulate the aesthetics and community of 1980s home computing for a modern audience. Folks who grew up with these early home computers, such as the BBC Micro, Commodore 64 & ZX Spectrum, often programmed software for them via a built-in BASIC interpreter, creating games and apps that were shared through cassette tapes and floppy disks."}, {"45f3": "“ACTION”, a ZX Spectrum demo by VAV / Megacode."}, {"e96b": "To this end, the PICO-8 offers a self-contained development environment containing everything you need to make a game for it — a Lua interpreter, a sprite editor, a map editor, and a SFX & Music editor. Each tool is designed and limited in a way that makes it simple and straightforward to get started making your own games and toys. Not quite an artist? The PICO-8’s limited resolution and fixed 16-color palette lets you crank out basic sprites and tiles without shame. Not a natural musician? All you need is bleeps and bloops. And if you’re looking to collaborate with others, the active and sizable PICO-8 BBS has got you covered."}, {"a083": "Cartridge for “Super Fash Bash” by corkreef, playable in browser. PICO-8. This image actually contains the entirety of the game."}, {"a35f": "This design philosophy has resulted in the creation of around 1000 (and climbing) publicly available software files, or “cartridges” for the PICO-8, comprising games, toys, demos and music collections, all of them free and open source. PICO-8 developers tend to be a friendly, welcoming and helpful bunch, which is always a welcome sight in software and technology communities. The community is also supported by its social media presence (Twitter, Reddit, Tumblr) and a digital/print fanzine that serves as an invaluable resource for game development beginners."}, {"3917": "“Ad Astra”, a PICO-8 demo by Ate Bit"}, {"bcc6": "With the success and excitement surrounding the PICO-8 and the fantasy console concept, it might come as no surprise that within the past year at least three new fantasy consoles have been released, all in varying stages of development. These are:"}, {"8b21": "Below, I’ll talk a bit about the ins, the outs, and the current states of each console."}, {"a3d8": "1) The PICO-8, Mighty Yet Small"}, {"b5a6": "“Pico Racer” by kometbomb, playable in browser. PICO-8."}, {"637f": "Cost: $14.99Proprietary?: YesResolution: 128x128Palette: fixed, 16-colorLanguage: LuaExport formats: HTML5/JS (browser), *.p8/*.p8.png cartridges (PICO-8 files). Native standalone binaries planned for 1.0 release (Win/Mac/Linux)Built-in features: Code editor, Sprite Editor, Tile Map Editor, SFX Editor, Music Editor, Screenshot tool, GIF Recorder, and SPLORE (internet connected cartridge browser)Platforms: Windows, MacOS, Linux, Raspberry Pi, PocketC.H.I.P."}, {"2e8a": "For better or worse, the PICO-8 is by far the most popular fantasy console and thus the one to which all others will be compared. So let’s talk about some of the technical details which define the PICO-8."}, {"0dcb": "“Super Mario Bros.” by Sascha217, playable in browser. PICO-8. It is likely impossible to fit the entirely of the original SMB within a PICO-8 cartridge — which could be either a bug or feature depending on your outlook."}, {"8d13": "The PICO-8’s greatest assets are its feature-completeness and its community. The PICO-8 is easily worth $15 for its stable and usable development tools, and for the wealth of creative games, apps and demos put out by its community."}, {"d198": "Out of all the consoles covered in this article, the PICO-8 is likely to have the strongest “identity” in the long run, stemming simply from its numerous and standardized limitations. If you’re new to the fantasy console scene, you can’t go wrong with the PICO-8."}, {"317d": "\"The harsh limitations of PICO-8 are carefully chosen to be fun to work with, encourage small but expressive designs and hopefully to give PICO-8 cartridges their own particular look and  feel.\" — PICO-8 Manual"}, {"b10c": "2) The TIC-80, Flexible & Empowering"}, {"6fdc": "“JET PAC” by trelemar, playable in browser. TIC-80."}, {"9baf": "Cost: Pay what you wantProprietary?: YesResolution: 240x136Palette: Customizable during development, fixed at runtime. 16-colorLanguage: Lua/MoonscriptExport formats: HTML/JS (browser), *.tic cartridges (TIC-80 files). Native binaries (Win/Mac/Linux) (CORRECTION: an earlier version of this article stated that native binary support was not free; it is, in fact free!)Built-in features: Code editor, Sprite Editor, Tile Map Editor, SFX EditorPlatforms: HTML5/JS (browser), Windows (UWP), MacOS, Linux, Android"}, {"7239": "At the time of writing this, the TIC-80 (originally just called “tic” before level27geek at itch.io thankfully thought of the VIC-20 pun) is nearly feature complete, lacking only a music editor. Otherwise, it’s a worthy adversary to the PICO-8 — with a wider, higher resolution display, customizable 16-color palette, 64k code limit and up to 256 8x8 foreground sprites and 256 8x8 background tiles, the TIC-80 is a powerful fantasy console with untapped graphical and artistic potential. The greater range of expressiveness offered by the customizable palette may not offer the aesthetic cohesion of PICO-8 cartridges, but I have no doubt it will draw fans from the community who feel constrained by the PICO-8’s limitations and long for a higher ceiling to innovate around."}, {"8ffc": "“Green Sight” by HomineLudens, playable in browser. TIC-80."}, {"a487": "The TIC-80 does do things a bit differently however, packing an outliner into the Code Editor and sprite-flipping into the Sprite Editor, as well as providing a much more robust SFX editor."}, {"a07b": "SFX Editor. TIC-80."}, {"3462": "While the TIC-80 is exciting, it is still in early development and should not be considered fully stable. However, if you don’t mind reporting a few bugs, the TIC-80 and its very much active developer could use a bit more support and attention right now! After all, it costs nothing to try."}, {"a044": "3) The LIKO-12, Liberated & Free"}, {"7e3d": "“Fire,” a LIKO-12 demo."}, {"64a3": "Cost: FreeProprietary?: No, Open-SourceResolution: 192x128Palette: Fixed at runtime, 16-colorLanguage: LuaExport formats: *.lk12 cartridges (LIKO-12 files)Built-in features: Code editor, Sprite Editor, Tile Map Editor (unfinished), GIF RecorderPlatforms: Windows, Linux, MacOS, Android, iOS & RaspberryPi through LÖVE2D"}, {"1091": "Don’t let the LIKO-12’s aesthetic similarities to the PICO-8 fool you. This open source, PICO-8-inspired console also comes with a wider display, no token limits, more graphic memory and a different API. I plan to talk more about API differences to keep in mind when moving from console to console in a later post, but this is worth mentioning given the surface resemblance to the PICO-8."}, {"1e1d": "“Snake,” a LIKO-12 demo."}, {"021d": "I’m a big believer in open platforms, and the LIKO-12 is one I’m going to watch. It’s being updated weekly by 16-year old Syrian developer RamiLego4Game, and so far has a Code Editor, Sprite Editor and the beginnings of a Map Editor. Full sound & music support is coming soon."}, {"5cd9": "By default, the LIKO-12 occupies a middle ground between the PICO-8’s specs and the TIC-80’s. Developers can, however, choose to change the palette, display resolution and other limitations by modifying the source code."}, {"8b4c": "“Hello World,” a LIKO-12 demo."}, {"5bfa": "4) The Pixel Vision 8, Jack of All Trades"}, {"eeae": "“RPG8,” a PixelVision 8demo."}, {"1978": "Cost: $10 during early access; will have free and pro versions after beta releaseProprietary?: Open-Source API, proprietary official toolsResolution: Various, depending on settings & templates used.Palette: Customizable during development, fixed at runtime Language: LuaExport formats: *.pv* files (Pixel Vision 8 files), other formats coming soonBuilt-in features: System Templates (NES/Famicom, Sega Master System, Game Boy, Sega Game Gear), Graphical File Browser, Display Configuration Tool, Sprite Editor, Tile Map Editor, SFX Editor (with templates!), Music Editor. Platforms: Windows, MacOS, Linux"}, {"8ffb": "The Pixel Vision 8 is one of the most unique projects in the fantasy console space right now. Rather than defining itself as a console with specific, fixed limitations, the Pixel Vision 8 lets developers define the limitations they want to work within."}, {"a726": "The Pixel Vision 8 currently offers a choice of four templates, each based on an existing 8-bit console. However, users aren’t restricted to these templates only; they can change and expand limitations as needed using the built-in development tools."}, {"8bef": "“Pixel Vision Micro Platformer — Simple Platforming Engine in 100 Lines of Code,” by mhughson. PV8."}, {"ed0c": "If you’ve ever wanted to make games in the style of your favorite 8-bit console, this project is definitely worth looking into. The Pixel Vision 8 is still in early development right now however, and can sometimes freeze or seem sluggish. Nonetheless, a lot of love and effort has been put into this project, and I can’t wait to see how it develops further."}, {"c465": "“Sprite Stress Test,” a PV8 demo."}, {"e977": "“Pixel Vision 8’s core philosophy is to teach retro game development with streamlined workflows. It enables designing games around limited resolutions, colors, sprites, sound and memory. It is ideal for game jams, prototyping ideas or having fun.”"}, {"b8a4": "The fantasy console scene is still in its infancy. Nonetheless, exciting new things are happening everyday. With the stripped down, easy-to-use tools and the communities springing up around them, fantasy consoles fulfill more than just a longing for an imagined past — they turn the fantasy of making and sharing one’s own games among a creative, enthusiastic community into a reality for even the most novice game developer."}, {"9179": "“You know what? I have never been very knowledgeable about coding. I messed around with BASIC when I was younger, but since then code has lost most of its appeal to me, it became obfuscated, complicated and not-so-logical. From an outsider’s point of view, code is very similar to magic. It’s an arcane formulae rendering the most amazing interactions and stories. It’s necessarily encrypted, protected and out of reach. It’s the sacred language of an illuminated cast, the developers."}, {"c045": "Pico-8 has broken that feeling. For the first time, I have had this amazing ability to “follow the trail” of code, directly and instantaneously. For example, I am able to look at a piece of code made by a well-known developer and change the way a character jumps.” — Arnaud de Bock, PICO-8 ZINE #2"}, {"f266": "“Alone in Pico” by NuSan, playable in browser. PICO-8."}, {"de6e": "Fantasy consoles are here to stay. While they may never be more than a niche within the broader indie development scene, what they offer is much more than just another game engine or SDK. They offer creative communities with their own styles, aesthetics and design philosophies that grow with each new game, each new demo, each new programming feat. All you need to do make an impact, is jump on in."}, {"3116": "Also there are a ton of free games you can play right now. Who wouldn’t want to be a part of that?"}, {"c5d7": "John King is always on Twitter being angry at the news or something instead of doing positive, meaningful things. You can help him by tweeting him any comments, questions or concerns about this article or gaming in general, because talking about video games and software development is always preferable to worrying about current events."}], "content": "Fantasy Console Wars: A Guide to The Biggest Players in Retrogaming’s Newest Trend “Happy New Year”, by John King. PICO-8. In December 2016, I was looking for a new hobby. Music, in the age of Spotify and Pandora was becoming a less and less “active” affair. New frontiers in computer science were opening up, but I was reluctant to crack open a linear algebra textbook when I was already freaking out over Calculus and Statistics finals. It was quite a welcome thing then, to see the Twitter chatter over the PICO-8 “fantasy console.” The PICO-8, first released in 2014 by Voxatron developer and creator Joseph “zep” White, is for “for making, sharing and playing tiny games and other computer programs.” First and last step of “A Pico-8 Spaceshooter in 16 GIFs” Fantasy consoles can be thought of as being made up of three things: “There was something about plotting large colourful pixels and punching in programs on a large clunky keyboard that resonated with my 8-year-old brain[…] it was meant to be just you, the program, and the inky black canvas.” — zep, PICO-8 ZINE #1 Eyeboss by Blue Candle Games, playable in browser. PICO-8. Fantasy consoles are exciting. The PICO-8 seeks to emulate the aesthetics and community of 1980s home computing for a modern audience. Folks who grew up with these early home computers, such as the BBC Micro, Commodore 64 & ZX Spectrum, often programmed software for them via a built-in BASIC interpreter, creating games and apps that were shared through cassette tapes and floppy disks. “ACTION”, a ZX Spectrum demo by VAV / Megacode. To this end, the PICO-8 offers a self-contained development environment containing everything you need to make a game for it — a Lua interpreter, a sprite editor, a map editor, and a SFX & Music editor. Each tool is designed and limited in a way that makes it simple and straightforward to get started making your own games and toys. Not quite an artist? The PICO-8’s limited resolution and fixed 16-color palette lets you crank out basic sprites and tiles without shame. Not a natural musician? All you need is bleeps and bloops. And if you’re looking to collaborate with others, the active and sizable PICO-8 BBS has got you covered. Cartridge for “Super Fash Bash” by corkreef, playable in browser. PICO-8. This image actually contains the entirety of the game. This design philosophy has resulted in the creation of around 1000 (and climbing) publicly available software files, or “cartridges” for the PICO-8, comprising games, toys, demos and music collections, all of them free and open source. PICO-8 developers tend to be a friendly, welcoming and helpful bunch, which is always a welcome sight in software and technology communities. The community is also supported by its social media presence (Twitter, Reddit, Tumblr) and a digital/print fanzine that serves as an invaluable resource for game development beginners. “Ad Astra”, a PICO-8 demo by Ate Bit With the success and excitement surrounding the PICO-8 and the fantasy console concept, it might come as no surprise that within the past year at least three new fantasy consoles have been released, all in varying stages of development. These are: Below, I’ll talk a bit about the ins, the outs, and the current states of each console. 1) The PICO-8, Mighty Yet Small “Pico Racer” by kometbomb, playable in browser. PICO-8. Cost: $14.99Proprietary?: YesResolution: 128x128Palette: fixed, 16-colorLanguage: LuaExport formats: HTML5/JS (browser), *.p8/*.p8.png cartridges (PICO-8 files). Native standalone binaries planned for 1.0 release (Win/Mac/Linux)Built-in features: Code editor, Sprite Editor, Tile Map Editor, SFX Editor, Music Editor, Screenshot tool, GIF Recorder, and SPLORE (internet connected cartridge browser)Platforms: Windows, MacOS, Linux, Raspberry Pi, PocketC.H.I.P. For better or worse, the PICO-8 is by far the most popular fantasy console and thus the one to which all others will be compared. So let’s talk about some of the technical details which define the PICO-8. “Super Mario Bros.” by Sascha217, playable in browser. PICO-8. It is likely impossible to fit the entirely of the original SMB within a PICO-8 cartridge — which could be either a bug or feature depending on your outlook. The PICO-8’s greatest assets are its feature-completeness and its community. The PICO-8 is easily worth $15 for its stable and usable development tools, and for the wealth of creative games, apps and demos put out by its community. Out of all the consoles covered in this article, the PICO-8 is likely to have the strongest “identity” in the long run, stemming simply from its numerous and standardized limitations. If you’re new to the fantasy console scene, you can’t go wrong with the PICO-8. \"The harsh limitations of PICO-8 are carefully chosen to be fun to work with, encourage small but expressive designs and hopefully to give PICO-8 cartridges their own particular look and  feel.\" — PICO-8 Manual 2) The TIC-80, Flexible & Empowering “JET PAC” by trelemar, playable in browser. TIC-80. Cost: Pay what you wantProprietary?: YesResolution: 240x136Palette: Customizable during development, fixed at runtime. 16-colorLanguage: Lua/MoonscriptExport formats: HTML/JS (browser), *.tic cartridges (TIC-80 files). Native binaries (Win/Mac/Linux) (CORRECTION: an earlier version of this article stated that native binary support was not free; it is, in fact free!)Built-in features: Code editor, Sprite Editor, Tile Map Editor, SFX EditorPlatforms: HTML5/JS (browser), Windows (UWP), MacOS, Linux, Android At the time of writing this, the TIC-80 (originally just called “tic” before level27geek at itch.io thankfully thought of the VIC-20 pun) is nearly feature complete, lacking only a music editor. Otherwise, it’s a worthy adversary to the PICO-8 — with a wider, higher resolution display, customizable 16-color palette, 64k code limit and up to 256 8x8 foreground sprites and 256 8x8 background tiles, the TIC-80 is a powerful fantasy console with untapped graphical and artistic potential. The greater range of expressiveness offered by the customizable palette may not offer the aesthetic cohesion of PICO-8 cartridges, but I have no doubt it will draw fans from the community who feel constrained by the PICO-8’s limitations and long for a higher ceiling to innovate around. “Green Sight” by HomineLudens, playable in browser. TIC-80. The TIC-80 does do things a bit differently however, packing an outliner into the Code Editor and sprite-flipping into the Sprite Editor, as well as providing a much more robust SFX editor. SFX Editor. TIC-80. While the TIC-80 is exciting, it is still in early development and should not be considered fully stable. However, if you don’t mind reporting a few bugs, the TIC-80 and its very much active developer could use a bit more support and attention right now! After all, it costs nothing to try. 3) The LIKO-12, Liberated & Free “Fire,” a LIKO-12 demo. Cost: FreeProprietary?: No, Open-SourceResolution: 192x128Palette: Fixed at runtime, 16-colorLanguage: LuaExport formats: *.lk12 cartridges (LIKO-12 files)Built-in features: Code editor, Sprite Editor, Tile Map Editor (unfinished), GIF RecorderPlatforms: Windows, Linux, MacOS, Android, iOS & RaspberryPi through LÖVE2D Don’t let the LIKO-12’s aesthetic similarities to the PICO-8 fool you. This open source, PICO-8-inspired console also comes with a wider display, no token limits, more graphic memory and a different API. I plan to talk more about API differences to keep in mind when moving from console to console in a later post, but this is worth mentioning given the surface resemblance to the PICO-8. “Snake,” a LIKO-12 demo. I’m a big believer in open platforms, and the LIKO-12 is one I’m going to watch. It’s being updated weekly by 16-year old Syrian developer RamiLego4Game, and so far has a Code Editor, Sprite Editor and the beginnings of a Map Editor. Full sound & music support is coming soon. By default, the LIKO-12 occupies a middle ground between the PICO-8’s specs and the TIC-80’s. Developers can, however, choose to change the palette, display resolution and other limitations by modifying the source code. “Hello World,” a LIKO-12 demo. 4) The Pixel Vision 8, Jack of All Trades “RPG8,” a PixelVision 8demo. Cost: $10 during early access; will have free and pro versions after beta releaseProprietary?: Open-Source API, proprietary official toolsResolution: Various, depending on settings & templates used.Palette: Customizable during development, fixed at runtime Language: LuaExport formats: *.pv* files (Pixel Vision 8 files), other formats coming soonBuilt-in features: System Templates (NES/Famicom, Sega Master System, Game Boy, Sega Game Gear), Graphical File Browser, Display Configuration Tool, Sprite Editor, Tile Map Editor, SFX Editor (with templates!), Music Editor. Platforms: Windows, MacOS, Linux The Pixel Vision 8 is one of the most unique projects in the fantasy console space right now. Rather than defining itself as a console with specific, fixed limitations, the Pixel Vision 8 lets developers define the limitations they want to work within. The Pixel Vision 8 currently offers a choice of four templates, each based on an existing 8-bit console. However, users aren’t restricted to these templates only; they can change and expand limitations as needed using the built-in development tools. “Pixel Vision Micro Platformer — Simple Platforming Engine in 100 Lines of Code,” by mhughson. PV8. If you’ve ever wanted to make games in the style of your favorite 8-bit console, this project is definitely worth looking into. The Pixel Vision 8 is still in early development right now however, and can sometimes freeze or seem sluggish. Nonetheless, a lot of love and effort has been put into this project, and I can’t wait to see how it develops further. “Sprite Stress Test,” a PV8 demo. “Pixel Vision 8’s core philosophy is to teach retro game development with streamlined workflows. It enables designing games around limited resolutions, colors, sprites, sound and memory. It is ideal for game jams, prototyping ideas or having fun.” The fantasy console scene is still in its infancy. Nonetheless, exciting new things are happening everyday. With the stripped down, easy-to-use tools and the communities springing up around them, fantasy consoles fulfill more than just a longing for an imagined past — they turn the fantasy of making and sharing one’s own games among a creative, enthusiastic community into a reality for even the most novice game developer. “You know what? I have never been very knowledgeable about coding. I messed around with BASIC when I was younger, but since then code has lost most of its appeal to me, it became obfuscated, complicated and not-so-logical. From an outsider’s point of view, code is very similar to magic. It’s an arcane formulae rendering the most amazing interactions and stories. It’s necessarily encrypted, protected and out of reach. It’s the sacred language of an illuminated cast, the developers. Pico-8 has broken that feeling. For the first time, I have had this amazing ability to “follow the trail” of code, directly and instantaneously. For example, I am able to look at a piece of code made by a well-known developer and change the way a character jumps.” — Arnaud de Bock, PICO-8 ZINE #2 “Alone in Pico” by NuSan, playable in browser. PICO-8. Fantasy consoles are here to stay. While they may never be more than a niche within the broader indie development scene, what they offer is much more than just another game engine or SDK. They offer creative communities with their own styles, aesthetics and design philosophies that grow with each new game, each new demo, each new programming feat. All you need to do make an impact, is jump on in. Also there are a ton of free games you can play right now. Who wouldn’t want to be a part of that? John King is always on Twitter being angry at the news or something instead of doing positive, meaningful things. You can help him by tweeting him any comments, questions or concerns about this article or gaming in general, because talking about video games and software development is always preferable to worrying about current events. ", "child": "1426_1\t1426_21426_1\t1426_21426_1\t1426_21426_1\t1426_21426_1\t1426_21426_1\t1426_2"}