{"name": "1434", "parent": "", "title": "Por que Pokémon Go é mais importante que o Facebook", "sentences": [{"3004": "Por que Pokémon Go é mais importante que o Facebook"}, {"c370": "E como o Snapchat bateu na trave"}, {"7b41": "Ninguém esperava que a mais recente revolução tecnológica viesse de algo tão 90’s quanto um novo jogo da franquia Pokémon. O game, produzido pela ex-Google Niantic, além de ser um sucesso, tornou mainstream uma tecnologia considerada impopular: a realidade aumentada."}, {"906b": "A grande sacada da Niantic para prosperar em um terreno onde gigantes fracassaram foi ironicamente não inovar. Não criou nenhum novo gadget fadado ao fracasso como a antiga mãe (sejamos sinceros, o Google Glass já nasceu morto. Por que você compraria um óculos de realidade aumentada quando se tem as mesmas informações na tela do seu celular?). Simplesmente usou conceitos já testados como jogos mobile, personagens kawaii (fofinhos), a própria realidade aumentada, um design limpo que lembra o Snapchat e a cool e moderna “ocupação do espaço público”."}, {"e386": "Ao colocar os jogadores para caçar Pokémons no mundo real, a Niantic deu a primeira prova concreta de que a famigerada RA pode ser usada de maneira comercial, popular e eficaz. Não vai demorar muito para que grandes redes de lojas paguem altas somas por um Ginásio ou uma PokeStop em seu espaço, ou que lancem aplicativos de caça ao desconto. Opções como prova virtual de roupas, geolocalização, jornais com páginas estendidas ao virtual são infinitas uma vez que se tem uma receita de sucesso."}, {"fd51": "Confesso que queimei a língua ao afirmar que a Nintendo morreria ao migrar para o mobile. Também me enganei ao achar que o nosso queridinho da comunicação, o Snapchat, daria o próximo passo. O aplicativo ganhou notoriedade ao usar os geofiltros, máscaras animadas e a promover uma nova forma de contato com as marcas (direto, orgânico e divertido) com os filtros patrocinados. Mas ainda perde tempo e dinheiro ao não se posicionar como ferramenta de comunicação rentável. Veículos e empresas estão loucos para se apropriar do aplicativo, mas não fazem pois ele não possibilita uma mensuração eficaz das publicações. Algo simples como a possibilidade de direcionar o público para um fim publicitário desejado, com o uso de hiperlinks, ainda falta ao aplicativo."}, {"7188": "Já a Niantic ao proporcionar uma experiência semi-real de aventura ao jogador que cresceu sonhando em ser um “treinador Pokémon”, já fez mais que o Facebook em seus 12 anos. Mark Zuckerberg ganha rios de dinheiro ao propor a virtualização da vida real em sua plataforma. Mas perde um oceano ao não estender a “Experiência Facebook” ao mundo real. Que interessante seria ao ver alguém na balada, ter acesso ao seu perfil com a realidade aumentada (você se surpreenderia ao saber quantas pessoas usariam isso). Ou entrar em um loja e ser atendido pelo nome. Um milhão de possibilidades."}, {"1328": "Pokémon Go abriu as portas de um futuro onde real e o virtual se fundem para proporcionar uma experiência completa, com acesso à informação necessária para que você possa desfrutá-la da melhor forma possível. Se a realidade aumentada vai finalmente se tornar tão corriqueira quanto os smartphones, isso só depende do timing dos desenvolvedores de aproveitar a tendência, mas o primeiro passo já foi dado pelo Pikachu e sua turma."}], "content": "Por que Pokémon Go é mais importante que o Facebook E como o Snapchat bateu na trave Ninguém esperava que a mais recente revolução tecnológica viesse de algo tão 90’s quanto um novo jogo da franquia Pokémon. O game, produzido pela ex-Google Niantic, além de ser um sucesso, tornou mainstream uma tecnologia considerada impopular: a realidade aumentada. A grande sacada da Niantic para prosperar em um terreno onde gigantes fracassaram foi ironicamente não inovar. Não criou nenhum novo gadget fadado ao fracasso como a antiga mãe (sejamos sinceros, o Google Glass já nasceu morto. Por que você compraria um óculos de realidade aumentada quando se tem as mesmas informações na tela do seu celular?). Simplesmente usou conceitos já testados como jogos mobile, personagens kawaii (fofinhos), a própria realidade aumentada, um design limpo que lembra o Snapchat e a cool e moderna “ocupação do espaço público”. Ao colocar os jogadores para caçar Pokémons no mundo real, a Niantic deu a primeira prova concreta de que a famigerada RA pode ser usada de maneira comercial, popular e eficaz. Não vai demorar muito para que grandes redes de lojas paguem altas somas por um Ginásio ou uma PokeStop em seu espaço, ou que lancem aplicativos de caça ao desconto. Opções como prova virtual de roupas, geolocalização, jornais com páginas estendidas ao virtual são infinitas uma vez que se tem uma receita de sucesso. Confesso que queimei a língua ao afirmar que a Nintendo morreria ao migrar para o mobile. Também me enganei ao achar que o nosso queridinho da comunicação, o Snapchat, daria o próximo passo. O aplicativo ganhou notoriedade ao usar os geofiltros, máscaras animadas e a promover uma nova forma de contato com as marcas (direto, orgânico e divertido) com os filtros patrocinados. Mas ainda perde tempo e dinheiro ao não se posicionar como ferramenta de comunicação rentável. Veículos e empresas estão loucos para se apropriar do aplicativo, mas não fazem pois ele não possibilita uma mensuração eficaz das publicações. Algo simples como a possibilidade de direcionar o público para um fim publicitário desejado, com o uso de hiperlinks, ainda falta ao aplicativo. Já a Niantic ao proporcionar uma experiência semi-real de aventura ao jogador que cresceu sonhando em ser um “treinador Pokémon”, já fez mais que o Facebook em seus 12 anos. Mark Zuckerberg ganha rios de dinheiro ao propor a virtualização da vida real em sua plataforma. Mas perde um oceano ao não estender a “Experiência Facebook” ao mundo real. Que interessante seria ao ver alguém na balada, ter acesso ao seu perfil com a realidade aumentada (você se surpreenderia ao saber quantas pessoas usariam isso). Ou entrar em um loja e ser atendido pelo nome. Um milhão de possibilidades. Pokémon Go abriu as portas de um futuro onde real e o virtual se fundem para proporcionar uma experiência completa, com acesso à informação necessária para que você possa desfrutá-la da melhor forma possível. Se a realidade aumentada vai finalmente se tornar tão corriqueira quanto os smartphones, isso só depende do timing dos desenvolvedores de aproveitar a tendência, mas o primeiro passo já foi dado pelo Pikachu e sua turma. ", "child": "1434_1"}