{"name": "1438", "parent": "", "title": "10 Strategies to Go Viral on Any Platform", "sentences": [{"8909": "10 Strategies to Go Viral on Any Platform"}, {"1fc1": "This may be an uncomfortable truth for you to swallow:"}, {"cb51": "The attention you get online (or lack thereof) is not necessarily a result of how good you are but how many eyeballs find your work."}, {"09f2": "My first viral post reached 62,000 people. That was a total accident."}, {"2e0a": "After that rush, I had to know more. What makes the internet tick? Why do some posts go viral and some disappear into the river of Internet stuff?"}, {"8c5d": "So I jumped on another platform, studying every angle to see if I could replicate my success. Before too long, I’d created another viral post that reached 470,000 people."}, {"bca3": "I made that one on purpose."}, {"f8b9": "My work on Quora has not only gotten me published on world-renowned platforms, it’s been seen over 2 million times."}, {"a1e5": "2 *MILLION*"}, {"cdfd": "I am honored and humbled."}, {"57ce": "Before we go any further, let’s address the elephant in the room:"}, {"5d39": "It is not immoral for you to know how the system works."}, {"4cd5": "I used to be proud of my ignorance. I told myself artists didn’t have to learn how algorithms worked. Looking under the hood felt wrong somehow. Some of the strategies in this post felt like cheating (especially #4)."}, {"6e07": "Now, I know better. Now, I’m tired of guessing and hoping. Now, I’m a student of virality."}, {"2ff9": "Actually, forget about the word “viral” for a moment. What if you could go from mediocre to memorable, even if you don’t break the Internet? What if you could turn your D+ results into a B-? Would 750 views be more valuable to you than 300?"}, {"456c": "This post will also help with that."}, {"faf3": "You spend a lot of time and energy on what you do."}, {"9a4e": "Your work deserves to be seen."}, {"8b1e": "1. Determine what is *unique* about the platform."}, {"e1ff": "Take a look at the main display for an answer in my Quora feed:"}, {"ce16": "At first glance, everything seems pretty normal. Profile picture? Check. Share buttons? Sure. Preview of the content? Seen it before."}, {"8485": "But take a closer look — right up beside the profile name."}, {"f733": "In Quora, that’s called a “credential,” and it gives me a chance to know something about you before I get into your actual work. This is a completely unique function to the site which the top writers use to great effect."}, {"153b": "Check out these examples:"}, {"110d": "A simple tweak, but it works. Can we find something unique about Medium as well? Let’s take a look:"}, {"310d": "At a glance, we see something different from other platforms around the post —publication names. Publications are unique to the Medium platform, and therefore something you must address to get the most out of each post."}, {"db53": "To go viral, you have to think about what the consumer sees, not just you the creator. This leads me to…"}, {"32de": "2. Address the whole viewing area, not just your post"}, {"7fb0": "I’ll use YouTube as an example here since there is a massive amount of visual information to process."}, {"763a": "In your dreams, people come across your video like this:"}, {"baae": "Look at all that screen space! And all my stuff is on the side!"}, {"5e72": "But in reality, you’ll be lucky to get this:"}, {"5399": "Ariana, I love you (apparently)."}, {"2938": "What does that mean? You have to know when and where you’ll pop up, and what little things you can do to make your video stand out."}, {"6c93": "In this case, the custom thumbnail is the X factor of the viewing area. It’s almost not worth posting without one."}, {"1e8b": "Take a look at the example below. The content of the video with the red box is almost identical to the one in the green box. But guess which one I’m more likely to click if I’m impartial?"}, {"d8f3": "I pick red."}, {"e71d": "Looking further, we see 2 other chances to grab attention"}, {"9198": "Put AT LEAST as much thought into these as the content itself."}, {"3551": "Remember, this isn’t just about YouTube. Every platform offers you multiple chances to stand out, but you typically only have a millisecond to hook a new person."}, {"d7c7": "3. ASK for shares"}, {"22da": "This is the easiest way to get traction, but 90% of people don’t do it."}, {"6483": "If you feel shy about asking for shares or recommends (like I did), ask yourself two questions:"}, {"7079": "“Do I believe this is quality work?”"}, {"57b6": "“Do I believe a single other person on the planet could benefit from it?”"}, {"2ab0": "If the answer to both these questions is “yes,” how could you possibly be embarrassed to ask for a share?"}, {"8446": "Be as creative as you want with this ask, just don’t be apologetic. A simple, strong request for shares goes a long way."}, {"719f": "4. Use tested headlines."}, {"0604": "How do you figure out what makes a good headline?"}, {"b70a": "Step 1: Go to the platform in question."}, {"ebf2": "Step 2: Click “top stories” or “trending” or whatever channel highlights the best stuff."}, {"33d0": "Step 3: Copy the crap out of those headlines."}, {"dde8": "I just did this on Medium’s Top Stories and immediately found a pattern:"}, {"0067": "The pattern is quotes."}, {"13f7": "Next time I’m hurting for a headline, I’ll just grab the best quote from the post and use it instead*."}, {"d8c5": "As you learn and experiment with headlines that work, you can also copy your own successes. When something works once, you are allowed to use it again."}, {"f56a": "Like this:"}, {"2a4e": "To be honest, I’m crediting the extra 600+ recommends to the attractive eyes on the first post."}, {"c84b": "(*Note — The last post in the Medium Top Stories example doesn’t purely use the quote tactic, but I included it because it copies other patterns which are successful on Medium:"}, {"ca0a": "5. Try this formula: “Proof -> Preview -> Payout”"}, {"fb60": "Proof"}, {"3061": "Preview"}, {"206d": "Payout"}, {"211f": "(For an example, re-read the top of this post ;)"}, {"654e": "6. Be timely"}, {"a474": "On November 28th, 2016, Lauren Graham released a book called “Talking as Fast as I Can.”"}, {"99a1": "Even though it was her first nonfiction attempt, Graham’s book rocketed to the top of the charts. She’s not just an author now. She’s a bestselling author."}, {"79c2": "If you know who Lauren Graham is, you might already know the secret to her success."}, {"11e6": "Graham played Lorelai in Gilmore Girls, a wildly popular show which launched a Netflix revival on… wait for it… November 25th, 2016. Three days before the book showed up on bookstore shelves."}, {"bc8d": "Something tells me the marketing team knew what they were doing."}, {"6651": "You might not star in a popular television show (if you do, and you’re reading this, hit me up :), but here’s what you can do instead to increase your viral potential through timeliness:"}, {"71dc": "Easy, but effective."}, {"aa66": "7. Be timeLESS"}, {"b890": "Odds are, you don’t remember that many things which were created in 1936."}, {"db90": "But if I said the words “Dale Carnegie,” I’m willing to bet a certain book cover starts to creep into your mind…"}, {"3ada": "The book “How to Win Friends and Influence People” was published over 80 years ago, yet it is still relevant today. Many of the things which happen year by year are timely solutions to timely problems. They are very popular for a while, but then forgotten (not necessarily a bad thing)."}, {"38b2": "Carnegie went above the everyday and came up with a timeless idea, a timeless title, and a timeless book."}, {"4154": "If you address a consistent problem of human nature, you have the ability to stick around a LONG time."}, {"71df": "8. Cultivate curiosity at every turn"}, {"c69a": "Napoleon Hill’s Think and Grow Rich, possibly the most viral book of all time, is still selling copies today is because he cultivates and frustrates deep curiosity right from the start of the book:"}, {"22fb": "“The secret which I refer to has been mentioned no fewer than 100 times throughout this book… those who are ready and searching for it may pick it up.”"}, {"7c26": "In fact, Hill, uses the word “secret” 31 TIMES before chapter one even begins. Watch how you are pulled in:"}, {"69b8": "“Somewhere, as you read, the secret to which I refer will jump from the pages and stand boldly before you.”"}, {"e2e4": "Translation: You have to read the whole book, maybe more than once, before you get what I’m saying to you."}, {"1975": "“You will recognize this secret at least once in every chapter.”"}, {"487d": "Translation: You better read until the end or else you won’t get all the secret has to offer"}, {"88ec": "“Without the secret, [men and women] might go through life as failures.”"}, {"2c4c": "Translation: Do you really want to be a failure? If not, you better figure out this secret."}, {"af26": "Is this kind of thing overtheatrical? You bet."}, {"b31d": "But 100 million copies speak for themselves."}, {"eea3": "9. Quote smart people"}, {"de4e": "Don’t take my word for it, take the word of Medium’s most viral post of all time:"}, {"9e9c": "13 Things You Should Give Up If You Want To Be Successful”Somebody once told me the definition of hell:medium.com"}, {"ebfd": "This post probably would have done just fine on it’s own, but the quotes gave it the edge."}, {"3cb7": "When you include quotes by recognized names, you give your post reputation by association."}, {"caf8": "Stumped for quotes? Try this new thing called “Google.” :)"}, {"f0c8": "Search for “Quotes on [your topic]”"}, {"2093": "10. Be transparent"}, {"4ae2": "Would you like to know a person who has absolutely no business being famous?"}, {"612b": "It’s this man:"}, {"b9db": "This is D.J. Khaled."}, {"d0a8": "He is clumsy. He is awkward. He is bad at most things. He shows a little too much of his belly at all times. If you hung out with him in public, he would be “that guy.” And in this music video, he is clearly saying the wrong words to the camera at several points."}, {"b55b": "But do you know what?"}, {"ad3d": "Hundreds of thousands of people (including me) love Khaled."}, {"9fb8": "Why?"}, {"6c28": "Because every single second of his life, he is undeniably D.J. Khaled. Whether he is drunk on a jet ski trying to find his way home or snapping his son’s birth, Khaled shows people everything."}, {"7dd7": "It is this mindset which is responsible for the resurrection of his career."}, {"af89": "Think You’re Ready to Go Viral?"}, {"569b": "To tell you the truth — anyone can go viral once."}, {"07c3": "Going viral is NOT the hardest thing in the world. The hardest thing in the world is figuring out what to do next."}, {"47ba": "The whiplash from obscurity to unexpected fame and back to obscurity will kill you if you aren’t ready for it."}, {"0db0": "At the end of the day, there is only one choice:"}, {"4dbc": "Keep coming up with ideas."}, {"73ee": "I’ve outlined my process for doing just that in my free book — The Ultimate Guide to Infinite Ideas. The information in here is the reason I’ve been published in Inc. Magazine, Apple News, and ultimately reached the top post in the world on CNBC."}, {"13e9": "This post will help you go viral. The book will make sure you don’t vanish afterward."}, {"39b3": "Download your copy right now."}], "content": "10 Strategies to Go Viral on Any Platform This may be an uncomfortable truth for you to swallow: The attention you get online (or lack thereof) is not necessarily a result of how good you are but how many eyeballs find your work. My first viral post reached 62,000 people. That was a total accident. After that rush, I had to know more. What makes the internet tick? Why do some posts go viral and some disappear into the river of Internet stuff? So I jumped on another platform, studying every angle to see if I could replicate my success. Before too long, I’d created another viral post that reached 470,000 people. I made that one on purpose. My work on Quora has not only gotten me published on world-renowned platforms, it’s been seen over 2 million times. 2 *MILLION* I am honored and humbled. Before we go any further, let’s address the elephant in the room: It is not immoral for you to know how the system works. I used to be proud of my ignorance. I told myself artists didn’t have to learn how algorithms worked. Looking under the hood felt wrong somehow. Some of the strategies in this post felt like cheating (especially #4). Now, I know better. Now, I’m tired of guessing and hoping. Now, I’m a student of virality. Actually, forget about the word “viral” for a moment. What if you could go from mediocre to memorable, even if you don’t break the Internet? What if you could turn your D+ results into a B-? Would 750 views be more valuable to you than 300? This post will also help with that. You spend a lot of time and energy on what you do. Your work deserves to be seen. 1. Determine what is *unique* about the platform. Take a look at the main display for an answer in my Quora feed: At first glance, everything seems pretty normal. Profile picture? Check. Share buttons? Sure. Preview of the content? Seen it before. But take a closer look — right up beside the profile name. In Quora, that’s called a “credential,” and it gives me a chance to know something about you before I get into your actual work. This is a completely unique function to the site which the top writers use to great effect. Check out these examples: A simple tweak, but it works. Can we find something unique about Medium as well? Let’s take a look: At a glance, we see something different from other platforms around the post —publication names. Publications are unique to the Medium platform, and therefore something you must address to get the most out of each post. To go viral, you have to think about what the consumer sees, not just you the creator. This leads me to… 2. Address the whole viewing area, not just your post I’ll use YouTube as an example here since there is a massive amount of visual information to process. In your dreams, people come across your video like this: Look at all that screen space! And all my stuff is on the side! But in reality, you’ll be lucky to get this: Ariana, I love you (apparently). What does that mean? You have to know when and where you’ll pop up, and what little things you can do to make your video stand out. In this case, the custom thumbnail is the X factor of the viewing area. It’s almost not worth posting without one. Take a look at the example below. The content of the video with the red box is almost identical to the one in the green box. But guess which one I’m more likely to click if I’m impartial? I pick red. Looking further, we see 2 other chances to grab attention Put AT LEAST as much thought into these as the content itself. Remember, this isn’t just about YouTube. Every platform offers you multiple chances to stand out, but you typically only have a millisecond to hook a new person. 3. ASK for shares This is the easiest way to get traction, but 90% of people don’t do it. If you feel shy about asking for shares or recommends (like I did), ask yourself two questions: “Do I believe this is quality work?” “Do I believe a single other person on the planet could benefit from it?” If the answer to both these questions is “yes,” how could you possibly be embarrassed to ask for a share? Be as creative as you want with this ask, just don’t be apologetic. A simple, strong request for shares goes a long way. 4. Use tested headlines. How do you figure out what makes a good headline? Step 1: Go to the platform in question. Step 2: Click “top stories” or “trending” or whatever channel highlights the best stuff. Step 3: Copy the crap out of those headlines. I just did this on Medium’s Top Stories and immediately found a pattern: The pattern is quotes. Next time I’m hurting for a headline, I’ll just grab the best quote from the post and use it instead*. As you learn and experiment with headlines that work, you can also copy your own successes. When something works once, you are allowed to use it again. Like this: To be honest, I’m crediting the extra 600+ recommends to the attractive eyes on the first post. (*Note — The last post in the Medium Top Stories example doesn’t purely use the quote tactic, but I included it because it copies other patterns which are successful on Medium: 5. Try this formula: “Proof -> Preview -> Payout” Proof Preview Payout (For an example, re-read the top of this post ;) 6. Be timely On November 28th, 2016, Lauren Graham released a book called “Talking as Fast as I Can.” Even though it was her first nonfiction attempt, Graham’s book rocketed to the top of the charts. She’s not just an author now. She’s a bestselling author. If you know who Lauren Graham is, you might already know the secret to her success. Graham played Lorelai in Gilmore Girls, a wildly popular show which launched a Netflix revival on… wait for it… November 25th, 2016. Three days before the book showed up on bookstore shelves. Something tells me the marketing team knew what they were doing. You might not star in a popular television show (if you do, and you’re reading this, hit me up :), but here’s what you can do instead to increase your viral potential through timeliness: Easy, but effective. 7. Be timeLESS Odds are, you don’t remember that many things which were created in 1936. But if I said the words “Dale Carnegie,” I’m willing to bet a certain book cover starts to creep into your mind… The book “How to Win Friends and Influence People” was published over 80 years ago, yet it is still relevant today. Many of the things which happen year by year are timely solutions to timely problems. They are very popular for a while, but then forgotten (not necessarily a bad thing). Carnegie went above the everyday and came up with a timeless idea, a timeless title, and a timeless book. If you address a consistent problem of human nature, you have the ability to stick around a LONG time. 8. Cultivate curiosity at every turn Napoleon Hill’s Think and Grow Rich, possibly the most viral book of all time, is still selling copies today is because he cultivates and frustrates deep curiosity right from the start of the book: “The secret which I refer to has been mentioned no fewer than 100 times throughout this book… those who are ready and searching for it may pick it up.” In fact, Hill, uses the word “secret” 31 TIMES before chapter one even begins. Watch how you are pulled in: “Somewhere, as you read, the secret to which I refer will jump from the pages and stand boldly before you.” Translation: You have to read the whole book, maybe more than once, before you get what I’m saying to you. “You will recognize this secret at least once in every chapter.” Translation: You better read until the end or else you won’t get all the secret has to offer “Without the secret, [men and women] might go through life as failures.” Translation: Do you really want to be a failure? If not, you better figure out this secret. Is this kind of thing overtheatrical? You bet. But 100 million copies speak for themselves. 9. Quote smart people Don’t take my word for it, take the word of Medium’s most viral post of all time: 13 Things You Should Give Up If You Want To Be Successful”Somebody once told me the definition of hell:medium.com This post probably would have done just fine on it’s own, but the quotes gave it the edge. When you include quotes by recognized names, you give your post reputation by association. Stumped for quotes? Try this new thing called “Google.” :) Search for “Quotes on [your topic]” 10. Be transparent Would you like to know a person who has absolutely no business being famous? It’s this man: This is D.J. Khaled. He is clumsy. He is awkward. He is bad at most things. He shows a little too much of his belly at all times. If you hung out with him in public, he would be “that guy.” And in this music video, he is clearly saying the wrong words to the camera at several points. But do you know what? Hundreds of thousands of people (including me) love Khaled. Why? Because every single second of his life, he is undeniably D.J. Khaled. Whether he is drunk on a jet ski trying to find his way home or snapping his son’s birth, Khaled shows people everything. It is this mindset which is responsible for the resurrection of his career. Think You’re Ready to Go Viral? To tell you the truth — anyone can go viral once. Going viral is NOT the hardest thing in the world. The hardest thing in the world is figuring out what to do next. The whiplash from obscurity to unexpected fame and back to obscurity will kill you if you aren’t ready for it. At the end of the day, there is only one choice: Keep coming up with ideas. I’ve outlined my process for doing just that in my free book — The Ultimate Guide to Infinite Ideas. The information in here is the reason I’ve been published in Inc. Magazine, Apple News, and ultimately reached the top post in the world on CNBC. This post will help you go viral. The book will make sure you don’t vanish afterward. Download your copy right now. ", "child": "1438_1\t1438_2\t1438_3\t1438_4\t1438_5\t1438_6\t1438_7\t1438_8\t1438_9\t1438_10\t1438_11\t1438_12\t1438_13\t1438_14\t1438_15\t1438_16\t1438_17\t1438_18\t1438_19\t1438_20\t1438_21\t1438_22\t1438_23\t1438_24\t1438_251438_1\t1438_2\t1438_3\t1438_4\t1438_5\t1438_6\t1438_7\t1438_8\t1438_9\t1438_10\t1438_11\t1438_12\t1438_13\t1438_14\t1438_15\t1438_16\t1438_17\t1438_18\t1438_19\t1438_20\t1438_21\t1438_22\t1438_23\t1438_24\t1438_251438_1\t1438_2\t1438_3\t1438_4\t1438_5\t1438_6\t1438_7\t1438_8\t1438_9\t1438_10\t1438_11\t1438_12\t1438_13\t1438_14\t1438_15\t1438_16\t1438_17\t1438_18\t1438_19\t1438_20\t1438_21\t1438_22\t1438_23\t1438_24\t1438_251438_1\t1438_2\t1438_3\t1438_4\t1438_5\t1438_6\t1438_7\t1438_8\t1438_9\t1438_10\t1438_11\t1438_12\t1438_13\t1438_14\t1438_15\t1438_16\t1438_17\t1438_18\t1438_19\t1438_20\t1438_21\t1438_22\t1438_23\t1438_24\t1438_25"}