{"name": "1439", "parent": "", "title": "Why I’m Not Leaving Snapchat, and My Friends Aren’t Either", "sentences": [{"b619": "Still king."}, {"770d": "Why I’m Not Leaving Snapchat, and My Friends Aren’t Either"}, {"c1ea": "Side Note: I didn’t write this article to criticize Owen Williams (you can find his article here). In fact, I think his article was extremely well-written, thought-provoking, and presented an interesting argument. Owen, if you’re ever in Oakland and want to nerd out about social media over a beer, I’d be more than happy to."}, {"7575": "What I did want to do is spark a healthy debate around the subject. I tried my best at accomplishing that through a comment on his article, but then realized quickly it would be way too long-winded."}, {"e5ea": "Instead, I beefed up the comment, added some pictures, and submitted it as an article."}, {"07eb": "Here it is…"}, {"662b": "I’ll start with the thesis, then dive into a laundry list of supporting points and reasons why I’m not leaving Snapchat and my friends aren’t either."}, {"4eb1": "Thesis"}, {"8522": "Now, let’s dive into the nitty-gritty…"}, {"637c": "Snapchat as it’s own category/niche"}, {"d2d8": "Snapchat is in a category all its own, with goals which differ widely from Facebook. If Evan Spiegel didn’t have plans different from Mark Zuckerberg, he would’ve taken the $3 billion that was offered to him by Facebook."}, {"855c": "Facebook is not, and never will be, Snapchat because at its very core the former is focused on connectivity and inclusivity while the latter is focused on privacy, intimacy, and exclusivity."}, {"4881": "As I mentioned in a previous article, Snapchat is not a platform to grow your audience, but instead a platform to nurture your already-existing audience."}, {"35b1": "This is exactly why a lot of marketers aren’t happy with Snapchat. This is why people who watch the Gary Vee show to formulate all their opinions about social media are skeptical about the platform."}, {"2a40": "As a marketer myself, I can’t necessarily blame them for thinking this way. But here’s the deal, not everything on this planet we live on is meant to be a marketing tool."}, {"7d57": "That’s why telephones and telecoms can both exist. Some forms of communication are meant to be an A/B conversation as opposed to a speech to a million people."}, {"6f9a": "Begin thinking of Snapchat as an intimate chatroom with your most loyal followers and less like the center-stage at the Super Bowl."}, {"dcec": "The privacy"}, {"f1e2": "Many of the aspects Owen brings up in his article are exactly the features that make Snapchat unique and valuable to users everywhere (no discovery feature, the difficulty of adding a user on Snapchat, etc.). Intimacy, privacy, and borderline-secrecy are exactly what has made the Spiegel squad explode over the years."}, {"e965": "In a world where grandparents, aunts, and uncles have slowly infiltrated our Facebook and Instagram feeds, Snapchat provides a breath of fresh air."}, {"af0f": "A place where we can shamelessly post about a drunk night out with our friends and not be afraid to do so."}, {"d2d7": "Time and time again, Snapchat has made it clear this is their intention, often in spite of brands, advertisers, and influencers. In order to safeguard user experience, they’ve set the bar extremely high for advertisers both monetarily and logistically."}, {"7997": "They don’t provide an influencer discovery tool. Their API is as impenetrable as the Berlin Wall — with only a handful of companies, such as Delmondo and Snaplytics, being able to successfully build a company on top of the platform. Even the culture within their own company is secretive."}, {"2582": "Their brand, product, and platform is all built on the concept and practice of intimacy and privacy. The exact opposite of Facebook (i.e. Instagram & WhatsApp)."}, {"4e79": "Again, Snapchat was not built for everyone. Oftentimes, the best social media platforms are not."}, {"b62e": "Snapchat was built for friends communicating with friends, and it’s terrific at it. Plain and simple."}, {"d4c4": "On Instagram, unless I’m tagging my friends in a funny Daquan post, I’m not communicating at all with my loved ones. Instead, I’m looking at people who I may aspire to be, but am not. At its root, Instagram is a platform to inspire and inform me, while Snapchat is a platform where I don’t have to be anybody but myself."}, {"56ee": "And the reason for it all? Privacy, intimacy, and authenticity."}, {"5644": "Do you think we’ll ever trust the guy who forced us to install the Facebook Messenger app with our privacy? The guy who continually wants to know who we’re texting with our privacy? I can only speak for myself, but my answer is a big fat “fuck no”. And my intuition tells me I’m not alone here."}, {"5c7b": "If Snapchat continues building their brand around the concept of secrecy, their value will only grow stronger as our privacy continues to dwindle over the coming decade."}, {"c971": "Facebook setting an unrealistic standard"}, {"c04a": "One of the biggest issues I have with my industry — social media marketing — is this: we think there is only room for a Biggie Smalls or a Tupac, but NEVER a Biggie Smalls and a Tupac. Never a Biggie Smalls, Tupac, Dr. Dre, Snoop Dogg, Eminem, and Big L."}, {"c97c": "Oftentimes, we forget how we actually act as a consumer. We forget that we check 4–5 different social media platforms every couple hours, and how only having one platform to look at would be hell. We forget this town is ABSOLUTELY big enough for the two of us."}, {"fb85": "The same thing is happening with Twitter at the moment, and I speak about it at length in this article. We are holding all platforms up to the gold standard of Facebook, forgetting that Twitter reeled in $2.2 billion in revenue in 2015 — more than Wendy’s, Taco Bell, and Peet’s Coffee!"}, {"86a9": "We don’t bat an eyelash when Taco Bell brings in just $2 billion in revenue, but since Twitter, in the eyes of investors and the public, is supposed to be the next $30 billion social media giant, $2.2 billion might as well seem like a couple pennies and shiny rock."}, {"a0bb": "The same can be said for Snapchat. We no longer live in a world where the creation of Facebook automatically puts the nail in the coffin for Myspace, and Myspace for Friendster. Social media, and all of its nuances and sub-genres, are here to stay."}, {"f73a": "Social media is slowly, but surely, becoming entertainment and television. Even if the ABCs and NBCs of social media rule the landscape, there is always room for the HBOs and Hulus."}, {"583c": "The ethics of it all"}, {"7b2d": "If you haven’t already, give this article by Quincy Larson a read. It discusses the negative repercussions of Facebook trying day and night to monopolize social media (specifically) and the internet (generally)."}, {"8ecd": "I give Facebook credit where it is due. In addition, I’m platform-agnostic. I’m a social media marketer, and I will always go where the attention of my client’s audience is and leverage platforms best to achieve their goals."}, {"2220": "That being said, what Facebook is doing many things which are extremely problematic. One of those things is the outright cloning in the social media ecosystem."}, {"be23": "Why is it that we go up in arms when Chinese software companies clone American products (Baidu, Alibaba, Renren, etc.), but not when Zuck does the exact same thing?"}, {"14af": "As creators and as decent human beings, we should take pride in creating something new and have shame in stealing other’s work. Why? Because in it’s the equivalent of the white lie of stealing."}, {"c0cf": "This principle is the reason why the Buzzfeed scandal was such a huge deal. It’s the reason why Carlos Mencia’s career took a nose dive after other comedians discovered he was stealing jokes. It’s the reason why I get pissed when people copy/paste my Medium articles onto their own blogs without attribution."}, {"8793": "Precedence is power. Without the absence of shame in cloning other people’s work, we’re fucking ourselves over by setting the stage for it to happen to all of us. We’re setting the stage for the big guy to always win."}, {"b81d": "In all honesty, the cloning that has gone on in the last 6 months at Facebook has me thinking the Winkelvoss twins may have had a case after all…"}, {"539f": "The rise of the Silicon Beach ecosystem"}, {"59c0": "This point is less from the perspective of a user and more from the perspective of a marketer and investor. Snapchat is the gem of one of the fastest growing tech scenes on the planet: the Silicon Beach."}, {"e030": "Social media is becoming media and entertainment."}, {"92ce": "And we all know Los Angeles has a better foothold in that marketplace than the Silicon Valley."}, {"a556": "Being the centerpiece of this movement could be one of the most useful weapons Snapchat has in its arsenal."}, {"f847": "There’s just something about Evan Spiegel…"}, {"99a6": "In much the same way many who invest in Tesla are investing in Elon Musk, there will be many who invest in Snap because of Evan Spiegel."}, {"ffd4": "From a qualitative perspective, there’s just something about him."}, {"a69f": "In addition to the characteristics I’ve listed throughout this article, there are many reasons I’ll be investing in Snap: the strangle-hold the company could have on augmented reality within social media, and the blurring of lines between entertainment and social media, and more. However, the biggest reason of all is because I believe in Evan Spiegel. Plain and simple."}, {"a7a2": "Snapchat understands cool. It just has something other companies do not."}, {"a2d8": "In the same way Apple did over Microsoft — that Jobs had over Gates. To highlight the advantage Spiegel has over his Silicon Valley combatants, I always point to the design of Snapchat Spectacles versus that of Google Glass."}, {"d0cd": "We will see if the company continues down this path in the coming years."}, {"ba33": "The caveat"}, {"79f2": "Snapchat will only retain this niche & value proposition if Evan Spiegel acts more like Jeff Bezos and less like Jack Dorsey."}, {"421a": "What do I mean by this? Well, Snap’s IPO is coming soon. If Evan Spiegel lets the horror that is Wall Street erode Snapchat’s identity by competing directly with Facebook and focusing on quarterly growth, then Owen will be 100% right: we have another Twitter on our hands. Jeff Bezos is on the record for not focusing on quarterly growth, and making this clear to his investors."}, {"56dc": "But, if Snap sticks to their guns, focuses on their unique product and plays to their strengths, then the sky is the limit for the company."}, {"0ed2": "The bottom line"}, {"1c92": "If you get anything from this article, please get this: not every social media platform is conducive to massive growth, influencer partnerships, or brand deals. Sometimes, social media platforms are good just for being social with the people you love — and there will always be a niche for that and a need for that."}, {"ab49": "Will Snapchat ever make as much money as Facebook? Hell no."}, {"4491": "Will Snapchat ever reach an international and/or third world market as large as Facebook will? Hell no. The WhatsApp acquisition makes this feat almost impossible."}, {"dff0": "Despite this, will Snapchat survive and thrive within their own unique niche? I think yes."}, {"e8c2": "Why? Because of this:"}, {"3cda": "For every aunt, uncle, or grandparent who joins Instagram; for every Facebook feature which takes more of our privacy away; for every Snapchat product Zuck and the gang shamelessly clone; for every bullshitty marketer who leaves Snapchat, the true essence of Snapchat grows stronger. Plain and fucking simple. And that’s why I’m not leaving any time soon, and neither are my friends."}, {"6e5e": "For more on the positive aspects of Snap Inc., check out this awesome TechCrunch article on the topic:"}, {"7068": "The bull case for SnapchatBefore I make a product-driven case for Snap Inc. achieving a $100 billion market cap by 2020, I should note that I’ve…techcrunch.com"}, {"dc80": "Final note to Owen: Truly, thanks for writing the article you did. It’s extremely insightful. Plus, it’s great to know more people care about issues like this :)"}, {"a21a": "In the comment section: What do you think about all of this? Are you staying on Snapchat or leaving? Why or why not?"}, {"9b81": "If you want to put yourself in the best position possible to succeed on social media, check out my booklet titled: “The 7 Mindset Shifts for Successful Social Media Marketing”. Click here to get it now!"}, {"9c4b": "In these 12 short pages, you’ll discover the indispensable strategies needed to unlock your full potential on social media for your business, personal brand and more."}], "content": "Still king. Why I’m Not Leaving Snapchat, and My Friends Aren’t Either Side Note: I didn’t write this article to criticize Owen Williams (you can find his article here). In fact, I think his article was extremely well-written, thought-provoking, and presented an interesting argument. Owen, if you’re ever in Oakland and want to nerd out about social media over a beer, I’d be more than happy to. What I did want to do is spark a healthy debate around the subject. I tried my best at accomplishing that through a comment on his article, but then realized quickly it would be way too long-winded. Instead, I beefed up the comment, added some pictures, and submitted it as an article. Here it is… I’ll start with the thesis, then dive into a laundry list of supporting points and reasons why I’m not leaving Snapchat and my friends aren’t either. Thesis Now, let’s dive into the nitty-gritty… Snapchat as it’s own category/niche Snapchat is in a category all its own, with goals which differ widely from Facebook. If Evan Spiegel didn’t have plans different from Mark Zuckerberg, he would’ve taken the $3 billion that was offered to him by Facebook. Facebook is not, and never will be, Snapchat because at its very core the former is focused on connectivity and inclusivity while the latter is focused on privacy, intimacy, and exclusivity. As I mentioned in a previous article, Snapchat is not a platform to grow your audience, but instead a platform to nurture your already-existing audience. This is exactly why a lot of marketers aren’t happy with Snapchat. This is why people who watch the Gary Vee show to formulate all their opinions about social media are skeptical about the platform. As a marketer myself, I can’t necessarily blame them for thinking this way. But here’s the deal, not everything on this planet we live on is meant to be a marketing tool. That’s why telephones and telecoms can both exist. Some forms of communication are meant to be an A/B conversation as opposed to a speech to a million people. Begin thinking of Snapchat as an intimate chatroom with your most loyal followers and less like the center-stage at the Super Bowl. The privacy Many of the aspects Owen brings up in his article are exactly the features that make Snapchat unique and valuable to users everywhere (no discovery feature, the difficulty of adding a user on Snapchat, etc.). Intimacy, privacy, and borderline-secrecy are exactly what has made the Spiegel squad explode over the years. In a world where grandparents, aunts, and uncles have slowly infiltrated our Facebook and Instagram feeds, Snapchat provides a breath of fresh air. A place where we can shamelessly post about a drunk night out with our friends and not be afraid to do so. Time and time again, Snapchat has made it clear this is their intention, often in spite of brands, advertisers, and influencers. In order to safeguard user experience, they’ve set the bar extremely high for advertisers both monetarily and logistically. They don’t provide an influencer discovery tool. Their API is as impenetrable as the Berlin Wall — with only a handful of companies, such as Delmondo and Snaplytics, being able to successfully build a company on top of the platform. Even the culture within their own company is secretive. Their brand, product, and platform is all built on the concept and practice of intimacy and privacy. The exact opposite of Facebook (i.e. Instagram & WhatsApp). Again, Snapchat was not built for everyone. Oftentimes, the best social media platforms are not. Snapchat was built for friends communicating with friends, and it’s terrific at it. Plain and simple. On Instagram, unless I’m tagging my friends in a funny Daquan post, I’m not communicating at all with my loved ones. Instead, I’m looking at people who I may aspire to be, but am not. At its root, Instagram is a platform to inspire and inform me, while Snapchat is a platform where I don’t have to be anybody but myself. And the reason for it all? Privacy, intimacy, and authenticity. Do you think we’ll ever trust the guy who forced us to install the Facebook Messenger app with our privacy? The guy who continually wants to know who we’re texting with our privacy? I can only speak for myself, but my answer is a big fat “fuck no”. And my intuition tells me I’m not alone here. If Snapchat continues building their brand around the concept of secrecy, their value will only grow stronger as our privacy continues to dwindle over the coming decade. Facebook setting an unrealistic standard One of the biggest issues I have with my industry — social media marketing — is this: we think there is only room for a Biggie Smalls or a Tupac, but NEVER a Biggie Smalls and a Tupac. Never a Biggie Smalls, Tupac, Dr. Dre, Snoop Dogg, Eminem, and Big L. Oftentimes, we forget how we actually act as a consumer. We forget that we check 4–5 different social media platforms every couple hours, and how only having one platform to look at would be hell. We forget this town is ABSOLUTELY big enough for the two of us. The same thing is happening with Twitter at the moment, and I speak about it at length in this article. We are holding all platforms up to the gold standard of Facebook, forgetting that Twitter reeled in $2.2 billion in revenue in 2015 — more than Wendy’s, Taco Bell, and Peet’s Coffee! We don’t bat an eyelash when Taco Bell brings in just $2 billion in revenue, but since Twitter, in the eyes of investors and the public, is supposed to be the next $30 billion social media giant, $2.2 billion might as well seem like a couple pennies and shiny rock. The same can be said for Snapchat. We no longer live in a world where the creation of Facebook automatically puts the nail in the coffin for Myspace, and Myspace for Friendster. Social media, and all of its nuances and sub-genres, are here to stay. Social media is slowly, but surely, becoming entertainment and television. Even if the ABCs and NBCs of social media rule the landscape, there is always room for the HBOs and Hulus. The ethics of it all If you haven’t already, give this article by Quincy Larson a read. It discusses the negative repercussions of Facebook trying day and night to monopolize social media (specifically) and the internet (generally). I give Facebook credit where it is due. In addition, I’m platform-agnostic. I’m a social media marketer, and I will always go where the attention of my client’s audience is and leverage platforms best to achieve their goals. That being said, what Facebook is doing many things which are extremely problematic. One of those things is the outright cloning in the social media ecosystem. Why is it that we go up in arms when Chinese software companies clone American products (Baidu, Alibaba, Renren, etc.), but not when Zuck does the exact same thing? As creators and as decent human beings, we should take pride in creating something new and have shame in stealing other’s work. Why? Because in it’s the equivalent of the white lie of stealing. This principle is the reason why the Buzzfeed scandal was such a huge deal. It’s the reason why Carlos Mencia’s career took a nose dive after other comedians discovered he was stealing jokes. It’s the reason why I get pissed when people copy/paste my Medium articles onto their own blogs without attribution. Precedence is power. Without the absence of shame in cloning other people’s work, we’re fucking ourselves over by setting the stage for it to happen to all of us. We’re setting the stage for the big guy to always win. In all honesty, the cloning that has gone on in the last 6 months at Facebook has me thinking the Winkelvoss twins may have had a case after all… The rise of the Silicon Beach ecosystem This point is less from the perspective of a user and more from the perspective of a marketer and investor. Snapchat is the gem of one of the fastest growing tech scenes on the planet: the Silicon Beach. Social media is becoming media and entertainment. And we all know Los Angeles has a better foothold in that marketplace than the Silicon Valley. Being the centerpiece of this movement could be one of the most useful weapons Snapchat has in its arsenal. There’s just something about Evan Spiegel… In much the same way many who invest in Tesla are investing in Elon Musk, there will be many who invest in Snap because of Evan Spiegel. From a qualitative perspective, there’s just something about him. In addition to the characteristics I’ve listed throughout this article, there are many reasons I’ll be investing in Snap: the strangle-hold the company could have on augmented reality within social media, and the blurring of lines between entertainment and social media, and more. However, the biggest reason of all is because I believe in Evan Spiegel. Plain and simple. Snapchat understands cool. It just has something other companies do not. In the same way Apple did over Microsoft — that Jobs had over Gates. To highlight the advantage Spiegel has over his Silicon Valley combatants, I always point to the design of Snapchat Spectacles versus that of Google Glass. We will see if the company continues down this path in the coming years. The caveat Snapchat will only retain this niche & value proposition if Evan Spiegel acts more like Jeff Bezos and less like Jack Dorsey. What do I mean by this? Well, Snap’s IPO is coming soon. If Evan Spiegel lets the horror that is Wall Street erode Snapchat’s identity by competing directly with Facebook and focusing on quarterly growth, then Owen will be 100% right: we have another Twitter on our hands. Jeff Bezos is on the record for not focusing on quarterly growth, and making this clear to his investors. But, if Snap sticks to their guns, focuses on their unique product and plays to their strengths, then the sky is the limit for the company. The bottom line If you get anything from this article, please get this: not every social media platform is conducive to massive growth, influencer partnerships, or brand deals. Sometimes, social media platforms are good just for being social with the people you love — and there will always be a niche for that and a need for that. Will Snapchat ever make as much money as Facebook? Hell no. Will Snapchat ever reach an international and/or third world market as large as Facebook will? Hell no. The WhatsApp acquisition makes this feat almost impossible. Despite this, will Snapchat survive and thrive within their own unique niche? I think yes. Why? Because of this: For every aunt, uncle, or grandparent who joins Instagram; for every Facebook feature which takes more of our privacy away; for every Snapchat product Zuck and the gang shamelessly clone; for every bullshitty marketer who leaves Snapchat, the true essence of Snapchat grows stronger. Plain and fucking simple. And that’s why I’m not leaving any time soon, and neither are my friends. For more on the positive aspects of Snap Inc., check out this awesome TechCrunch article on the topic: The bull case for SnapchatBefore I make a product-driven case for Snap Inc. achieving a $100 billion market cap by 2020, I should note that I’ve…techcrunch.com Final note to Owen: Truly, thanks for writing the article you did. It’s extremely insightful. Plus, it’s great to know more people care about issues like this :) In the comment section: What do you think about all of this? Are you staying on Snapchat or leaving? Why or why not? If you want to put yourself in the best position possible to succeed on social media, check out my booklet titled: “The 7 Mindset Shifts for Successful Social Media Marketing”. Click here to get it now! In these 12 short pages, you’ll discover the indispensable strategies needed to unlock your full potential on social media for your business, personal brand and more. ", "child": "1439_1\t1439_2\t1439_3\t1439_4\t1439_5\t1439_61439_1\t1439_2\t1439_3\t1439_4\t1439_5\t1439_61439_1\t1439_2\t1439_3\t1439_4\t1439_5\t1439_61439_1\t1439_2\t1439_3\t1439_4\t1439_5\t1439_61439_1\t1439_2\t1439_3\t1439_4\t1439_5\t1439_6"}