{"name": "144", "parent": "", "title": "Khabib vs Ferguson: Inevitable and Underrated", "sentences": [{"9af0": "Khabib vs Ferguson: Inevitable and Underrated"}, {"023a": "The Only Fight That Matters"}, {"7a7a": "As UFC 209 fast approaches two fighters have clawed their way to the top of the lightweight division earning a chance to fight for the interim title and and eventual shot at Conor McGregor. To the casual fan the names Tony Ferguson and Khabib Nurmagomedov probably don’t ring any bells. They have both been kept on ice by matchmakers as more brand friendly names have continued to take the spotlight in the Lightweight Division. This and a few injuries have held them back in previous years. Those who have followed the sport know this is one of the best matchups of two contenders in their prime. We must trace this division backwards to truly appreciate their assent."}, {"1cde": "First we must reconcile the fact that the UFC allowed McGregor to jump in line and get the title shot that at the time arguably corresponded to Ferguson. Ferguson had beaten former champ Rafael Dos Anjos in a bloody five round decision in Mexico City for the Finale of the Ultimate Fighter Latin America 3. That fight took place November 7, 2016 and just 5 days later McGregor would fight for the belt against Eddie Alvarez. Alvarez had won the belt from Dos Anjos earlier that July. The rush to get McGregor back in the ring for his third fight out of his weight division illustrates the UFC incentive to ride that wave all the way to the bank."}, {"ec47": "The UFC and Conor McGregor have since had a falling out which creates the Interim Title. While many will consider the winner of this fight the true champion, a Ferguson victory would only get him a title shot which at the very least should happen by the end of this year."}, {"6c44": "Before this Daniel Cerrone fought for the title and lost in Dos Anjos only defense. Since then Cerrone has moved up to the welterweight division where he has found success until being stopped recently by Jorge Masvidal."}, {"bd4b": "Dos Anjos had won the title from Anthony Pettis who has had a losing record in his last 5 fights. This includes his last fight which was a catchweight 148 pound loss to Max Holloway. Pettis failed to make Featherweight, which puts his future in that division uncertain. When compared to Khabib and Ferguson it begs the question how can a guy with a losing record get a title shot in another division while these guys had to clean out their division."}, {"de4a": "Meanwhile former champs Benson Henderson and Frankie Edgar have also left the division. Henderson has left the UFC all together after a string of losses while Edgar has moved down to Featherweight where he recently suffered a loss to Jose Aldo for that title."}, {"4d4c": "This exodus of the top fighters in the division over the last 5 years has opened the door for Khabib and Ferguson. Both have victories over the former champ Dos Anjos. Ironically, Dos Anjos got a title shot after his loss to Khabib in which he displayed his textbook dominant grappling. While Dos Anjos went on to win the title, Khabib was out for two years with nagging knee injuries which grounded the eagles assent."}, {"4f74": "Fighters like Edson Barbosa, Gilbert Melendez and Michael Johnson have all been given a chance and now have the blemishes on their record forcing them aside."}, {"12c5": "Johnson was beaten with a Kimura by Khabib after showing a brutal ground and pound from the top of half guard at UFC 205 last year. He heckled Dana White throughout the fight insisting he was going to take out his boy. After the fight he went on the mic and demanded to fight ‘McChicken.’"}, {"f70d": "Ferguson lost to Johnson in a unanimous decision back in 2012. Johnson was able to push the pace and connect more power shots. Ferguson to his credit rolled with the punches and delivered a few of his own. This was a lesson that affected his development in the octagon. Since then Ferguson has evolved as a mixed martial artist so that he can be the one who controls the pace and volume in a fight. While he continues to take punches he now answers with combinations and body shots that make the opponent pay for landing."}, {"050c": "Other than this they have beaten both beaten Gleison Tibau and Abel Trujillo. The only difference here was that Ferguson took on these two about two years after Khabib had beaten them."}, {"fd7e": "Against Tibau, Khabib was unable to execute his take down and resorted to flurries of overhand punches to score. When the decision was announced in his favor, commentator Joe Rogan was noticeably shocked. Ferguson on the other hand was able to rock Tibau in the first round and finish him with a rear naked choke."}, {"6fa2": "Against Trujillo, Khabib controlled the grappling taking the back standing several times and executing countless takedowns. The masterful display of trips and throws frustrated Trujillo as he weathered punches from the inferior position. Khabib was unable to put him away but ran away with the unanimous decision. To his credit Ferguson took all Trujillo had in terms of stand up punishment in the first round of their fight. In the second round Trujillo faded and Ferguson was able to outpace and strike at will. This was when he was able to finish with a rear naked choke."}, {"ca3c": "The obvious question is why haven’t these two faced each other before. It turns out that they have had two fights canceled because of injury. Last year Ferguson had to pull out because he had fluid in his lungs. While Khabib pulled out in the Fall of 2015 due to a rib injury."}, {"6bf6": "What is clear is that this fight has been a long time coming and it is truly a match up of the divisions best. The current build up to hype the fight aside, fans are in for definite clash of styles."}, {"cda6": "Khabib being a sambo expert several times outclassing wrestlers and jiu jitsu black belts. He fights out of AKA in San Jose, home of current Light Heavyweight Champ Daniel Cormier and Former Champ Cain Velazquez. The gym has proven to sharpen the skills of the fighters that pass through its doors. The grappling skill set is what has given him the ability to ragdoll people and sap their will. The question is if he will be able to do this to Ferguson."}, {"4d2a": "Ferguson meanwhile is what would be considered a lone wolf. Michael Bisbing stated that this could be to his advantage because he can focus completely on himself. His unorthodox style in the stand up is what many consider to be his edge. While the jiu jitsu style of Ferguson has been honed by training with the one and only Eddie Bravo."}, {"3e29": "This fight will inevitably end up on the ground and that is what everyone is looking forward to watching."}], "content": "Khabib vs Ferguson: Inevitable and Underrated The Only Fight That Matters As UFC 209 fast approaches two fighters have clawed their way to the top of the lightweight division earning a chance to fight for the interim title and and eventual shot at Conor McGregor. To the casual fan the names Tony Ferguson and Khabib Nurmagomedov probably don’t ring any bells. They have both been kept on ice by matchmakers as more brand friendly names have continued to take the spotlight in the Lightweight Division. This and a few injuries have held them back in previous years. Those who have followed the sport know this is one of the best matchups of two contenders in their prime. We must trace this division backwards to truly appreciate their assent. First we must reconcile the fact that the UFC allowed McGregor to jump in line and get the title shot that at the time arguably corresponded to Ferguson. Ferguson had beaten former champ Rafael Dos Anjos in a bloody five round decision in Mexico City for the Finale of the Ultimate Fighter Latin America 3. That fight took place November 7, 2016 and just 5 days later McGregor would fight for the belt against Eddie Alvarez. Alvarez had won the belt from Dos Anjos earlier that July. The rush to get McGregor back in the ring for his third fight out of his weight division illustrates the UFC incentive to ride that wave all the way to the bank. The UFC and Conor McGregor have since had a falling out which creates the Interim Title. While many will consider the winner of this fight the true champion, a Ferguson victory would only get him a title shot which at the very least should happen by the end of this year. Before this Daniel Cerrone fought for the title and lost in Dos Anjos only defense. Since then Cerrone has moved up to the welterweight division where he has found success until being stopped recently by Jorge Masvidal. Dos Anjos had won the title from Anthony Pettis who has had a losing record in his last 5 fights. This includes his last fight which was a catchweight 148 pound loss to Max Holloway. Pettis failed to make Featherweight, which puts his future in that division uncertain. When compared to Khabib and Ferguson it begs the question how can a guy with a losing record get a title shot in another division while these guys had to clean out their division. Meanwhile former champs Benson Henderson and Frankie Edgar have also left the division. Henderson has left the UFC all together after a string of losses while Edgar has moved down to Featherweight where he recently suffered a loss to Jose Aldo for that title. This exodus of the top fighters in the division over the last 5 years has opened the door for Khabib and Ferguson. Both have victories over the former champ Dos Anjos. Ironically, Dos Anjos got a title shot after his loss to Khabib in which he displayed his textbook dominant grappling. While Dos Anjos went on to win the title, Khabib was out for two years with nagging knee injuries which grounded the eagles assent. Fighters like Edson Barbosa, Gilbert Melendez and Michael Johnson have all been given a chance and now have the blemishes on their record forcing them aside. Johnson was beaten with a Kimura by Khabib after showing a brutal ground and pound from the top of half guard at UFC 205 last year. He heckled Dana White throughout the fight insisting he was going to take out his boy. After the fight he went on the mic and demanded to fight ‘McChicken.’ Ferguson lost to Johnson in a unanimous decision back in 2012. Johnson was able to push the pace and connect more power shots. Ferguson to his credit rolled with the punches and delivered a few of his own. This was a lesson that affected his development in the octagon. Since then Ferguson has evolved as a mixed martial artist so that he can be the one who controls the pace and volume in a fight. While he continues to take punches he now answers with combinations and body shots that make the opponent pay for landing. Other than this they have beaten both beaten Gleison Tibau and Abel Trujillo. The only difference here was that Ferguson took on these two about two years after Khabib had beaten them. Against Tibau, Khabib was unable to execute his take down and resorted to flurries of overhand punches to score. When the decision was announced in his favor, commentator Joe Rogan was noticeably shocked. Ferguson on the other hand was able to rock Tibau in the first round and finish him with a rear naked choke. Against Trujillo, Khabib controlled the grappling taking the back standing several times and executing countless takedowns. The masterful display of trips and throws frustrated Trujillo as he weathered punches from the inferior position. Khabib was unable to put him away but ran away with the unanimous decision. To his credit Ferguson took all Trujillo had in terms of stand up punishment in the first round of their fight. In the second round Trujillo faded and Ferguson was able to outpace and strike at will. This was when he was able to finish with a rear naked choke. The obvious question is why haven’t these two faced each other before. It turns out that they have had two fights canceled because of injury. Last year Ferguson had to pull out because he had fluid in his lungs. While Khabib pulled out in the Fall of 2015 due to a rib injury. What is clear is that this fight has been a long time coming and it is truly a match up of the divisions best. The current build up to hype the fight aside, fans are in for definite clash of styles. Khabib being a sambo expert several times outclassing wrestlers and jiu jitsu black belts. He fights out of AKA in San Jose, home of current Light Heavyweight Champ Daniel Cormier and Former Champ Cain Velazquez. The gym has proven to sharpen the skills of the fighters that pass through its doors. The grappling skill set is what has given him the ability to ragdoll people and sap their will. The question is if he will be able to do this to Ferguson. Ferguson meanwhile is what would be considered a lone wolf. Michael Bisbing stated that this could be to his advantage because he can focus completely on himself. His unorthodox style in the stand up is what many consider to be his edge. While the jiu jitsu style of Ferguson has been honed by training with the one and only Eddie Bravo. This fight will inevitably end up on the ground and that is what everyone is looking forward to watching. ", "child": "144_1"}