{"name": "1447", "parent": "", "title": "xWeb Trend 2017", "sentences": [{"bb62": "xWeb Trend 2017"}, {"bd85": "ขอแชร์สรุปคร่าวๆที่ได้ฟังมาจากงาน ​ WebPresso จิบกาแฟคนทำเว็บ ในหัวข้อ “Web Trend 2017”"}, {"c6db": "งานนี้จัดขึ้น โดย “สมาคมผู้ดูแลเว็บไทย” พูดคุยกันเกี่ยวกับ แนวโน้ม ทิศทาง และเรื่องที่น่าสนใจ ของเทรนด์ออนไลน์ รวมถึงการเปลี่ยนแปลงที่จะเกิดขึ้นในปี 2017 ทั้งด้าน Developer, Designer, Marketing และ Content"}, {"4f53": "โดยวิทยากรที่มาพูดคุย ถือว่าเป็น ผู้เชี่ยวชาญในวงการดิจิทัลไทย(เรียงจาก ซ้ายไปขวา)"}, {"a699": "คุณศิวัตร เชาวรียวงษ์ (คุณป้อม) — Marketingกรรมการผู้จัดการ บริษัท MInteraction / Advertising agency"}, {"8cb8": "คุณขจร เจียรนัยพานิชย์ (คุณเอ็ม) — Contentบล็อกเกอร์ และผู้ก่อตั้งเว็บ Mango Zero, MacThai"}, {"1cab": "คุณวรัทธน์ วงศ์มณีกิจ (คุณตั้ง) — DeveloperProduct Owner at ThothZocial / Google Developer Expert for Web Technologies"}, {"90d5": "คุณอินทนนท์ ปัญญาโสภา (คุณเบ๊นซ์) — DesignerCo-Founder เว็บ Grappik"}, {"ad8f": "คุณป๋อม เป็นวิทยากร ของงานนี้ค่ะ"}, {"47d5": "หัวข้อคำถามมีดังนี้"}, {"82f0": "ในปี 2016 มีอะไรน่าสนใจบ้าง?"}, {"dd4a": "K.เอ็ม — Content- ทุกคนมุ่ง และ ทุ่ม ไปที่ Facebook - คนไทยเล่น Facebook มากที่สุด - คนใช้ Mobile เป็นหลัก และ หันมาเริ่มใช้ Live / คลิปสั้น- Content มักทำออกมาเพื่อให้คนที่ใช้ Mobile ใช้ได้สะดวกขึ้น เช่น ทำวีดีโอออกมา ในลักษณะ สีเหลี่ยมจัตุรัส- กว่า 80% Content ถูกทำออกมา support บน Mobile เป็นหลัก- Content ต้องจบในตัว - Facebook Live บน iPhone มีคนดูมากกว่า TV- สื่อ Social มียอดรวมของ Stat ที่แน่นอน"}, {"4efa": "K.ตั้ง — Developer- การพัฒนาเว็บ ถือว่าค่อนข้างช้า เช่น เราพูดกันตอนนี้ แต่ อีก 3 ปี มันถึงจะ Boom!- ไทยมีอินเตอร์เน็ตที่เร็ว- ในปี 2016 ทำให้รู้ว่า Mobile Web ได้กระโดดขึ้นมาอีกขั้น- Desktop Web อยู่ตัวแล้ว- Mobile Web ต้องพัฒนา >> Progressive Web App — ทำ MWeb ให้มี ประสิทธิภาพเทียบเท่า App- App ทำยาก- ปี 2016 เป็นปีของการพูด Feature ยังไม่สมบูรณ์- การพัฒนาของปีนี้ 2017 แยก Site Desktop กับ Mobile เพราะ การ ทำ ​ Responsive ทำให้เว็บช้า (Responsive คือการซ่อนโค้ดที่ไม่จำเป็นบน Mobile)  “การแยก Site Desktop กับ Mobile จะทำให้คนอยู่ได้นานขึ้น stat ดีขึ้น”"}, {"6337": "K.เบ๊นซ์ — Designer- Flat Design & Material Design (Apple & Google)- Trend เหมือนเดิม แต่จะถูกพัฒนาเพิ่มขึ้น- 2016 กราฟฟิค element icon รูปแบบการดีไซน์ จะออกมาแบบ เรียบง่าย สีน้อย ลักษณะแบน เคลียๆ สะอาด- มาในปี 2017 Flat จะถูกปรับปรุงขึ้น มีแสงเงา เเละมีสีที่มากขึ้น- มีสื่อวีดีโอเข้ามาเป็นตัวหลัก"}, {"6fed": "K.ป้อม — Marketing- 2014 กลุ่ม New Used คนใช้หน้าใหม่ (ลุง ป้า น้า อา ) เริ่ม ใช้ LINE เพื่อพูดคุย- 2015 เริ่มใช้ Mobile ซื้อของ- 2016 เริ่มใช้ Mobile ทำให้ชีวิตดีขึ้น ชอบทางลัด (YouTube/Joox/LINE TV/LINE/IG/Mobile Backing) — สำหรับคนต่างจังหวัด ถ้ากลุ่มคนเมืองที่เห็นได้ชัดคือ Grab/Map/LINEMAN- มองในด้านบริการ คนไทยมีความพร้อมใช้งานเพื่อให้ชีวิตดีขึ้น- เมื่อก่อน การเริ่มต้นอะไรใหม่เป็นสิ่งที่ผู้ใช้กลัว แต่ตอนนี้ใช้เพื่อปรับตัว"}, {"f1b6": "แนวโน้ม ทิศทางในปี 2017 และปีต่อๆไป?"}, {"28c6": "K.ตั้ง — Developer- Browser จะเป็น Platform จริงๆแล้ว — Look Like App- เริ่มมาจาก คนไม่โหลด App จึงต้องทำ Browser ให้เหมือน App — พื้นที่ในมือถือมีจำกัด- ทำ Web ให้ มีประสิทธิภาพเท่า App- 60fps animation เร็วเท่า App- More User Engagement - Web มี notification - More Hardware Access- ไม่มีเน็ตก็เล่นได้- More Secure- More Accessibility (ARIA 1.1)"}, {"ad0f": "K.เอ็ม — Content- อะไรที่อเมริกาใช้ อีก 2 ปี ไทยจะใช้- Snapchat Story >>Content แนวตั้ง มีภาพเคลื่อนไหว , มี Animation ในตัว- ทำ Content บน story มันดีนะ- Mobile video แนวตั้ง (เปิดตัวอย่างงานใน Facebook เป็นข่าวที่นำเสนอผลงาน ในรูปแบบ video แนวตั้ง และ ใช้การตัดต่อ movement สวยงามเหมาะกับการดูแนวตั้ง … ตัวอย่างของ circuit breaker - Facebook group มี content ขายของ- LINE group ใหม่ที่มี group ย่อยอยู่ด้านใน มี Mod เป็นผู้ดูแล Group นั้นๆสามารถรวมคนได้มากกว่า 1 แสนคน =o=- MOJO (Mobile Journalist) เป็นเทรนทำ Content ออนไลน์ ของนักข่าวบนมือถือ สามารถ ทำ content ตัดต่อข่าว ได้ในมือถือ จบในคนเดียวได้เลย- Video มาชัวร์- Video ควรมี Subtitle !!"}, {"adf7": "K.ป้อม — Marketing- ผลสำรวจเงินโฆษณาของปี 2017 คือ 11,000 ล้าน (ยังไม่รวม SME , Facebook, ซื้อตรง,…)- Magazine เริ่มปิดตัวมากกว่า ครึ่ง (เริ่มเจ๊ง)- เงินโฆษณา ส่วนใหญ่ถูกจ่ายไปให้ Facebook และ Google- การหารายได้หลักจาก Banner เริ่มไม่ดี - แนวคิดของผู้ซื้อ จากการซื้อพื้นที่บนเว็บ หรือ ซื้อเวลาบนสื่อ เริ่มพังแล้ว- โจทย์ของผู้ซื้อ ต้องการให้ลูกค้าของเขาเห็นสื่อของเขา ต้องมีคนกลางที่เป็นคนกรองเว็บให้ว่าอยากลงให้ลูกค้ากลุ่มไหนเห็น (เพศ กลุ่มอายุ …) และเว็บนั้นๆ ต้องมีจำนวนผู้ใช้งานที่มากพอ รวมถึงมีคุณภาพที่ดี- Facebook ad >> banner + content"}, {"f8fa": "K.เบ๊นซ์ — Designer- UX - ปิดการขายได้- นึกถึงผู้ใช้งานเยอะขึ้น มีที่มาที่ไปในการออกแบบ ดีไซน์- จัดเรียงข้อมูลให้กระชับ และสั้นแบบมีประโยชน์ เพื่อ MWeb และ App"}, {"15f2": "เรื่องที่น่ากังวล?"}, {"f8d6": "K.ป้อม — Marketing- Ad block ตอนนี้ไม่ใช้ปัญหาเท่าไหร่ แต่คาดว่าอนาคต มาแน่"}, {"8aa0": "K.เอ็ม — Content- พรบ. ไซเบอร์ ได้เข้ามาช่วยเรื่อง copy content - เว็บข่าวแปล- quote content พวก 7 สิ่งที่ควรรู้… 10 อย่างที่ต้องใช้.. trend มาจาก buzzfeed คนสนใจน้อยลง >> แนะนำเว็บ contentmarketinginstitute.com วิจัยการตลาด-เน้น Original content ให้มากขึ้น ที่นี่มีที่เดียว เขียนแบบ signature ex. New York Time - เน้น content ที่มีแค่เราที่ทำได้"}, {"63b3": "K.ตั้ง — Developer- โปรแกรมเมอร์น้อย- โปรแกรมเมอร์อินเตอร์ มีแค่ 20% (international standard)- โปรแกรมเมอร์ควรพยายามสร้างโปรแกรมเมอร์- โปรแกรมเมอร์ค่าตัวจะสูงขึ้น- คำแนะนำในการหาโปรแกรมเมอร์ คือ รับเด็กฝึกงาน ถ้าชอบก็ offer เงินเดือน เรียนจบแล้วมาทำงานได้เลย"}, {"1c8c": "K.เบ๊นซ์ — Designer- Designer ชอบคิดว่าต้องสวย เอาแต่ใจ- Web ท่ีสมบูรณ์ ต้องแคร์คนรอบข้างด้วย คุยกับทีมอื่นบ้าง Content/Dev/MKT/…"}, {"5574": "Case ที่น่าสนใจ ^^"}, {"8434": "K.ป้อม — Marketing- Chatbot- Chat Platfrom"}, {"0f06": "K.เอ็ม — Content- Web ข่าว อย่างเช่นที่ผ่านมา Matter , Momentum , Mango Zero- การปรับตัวของสื่อสิ่งพิมพ์"}, {"53ae": "K.ตั้ง — Developer- ค่าตัวโปรแกรมเมอร์สูงขึ้น- โปรแกรมเมอร์รวมตัวมากขึ้น- Optimize Mobile ทำ Mobile ให้เร็ว"}, {"ec7e": "K.เบ๊นซ์ — Designer- กล้าพูดมากขึ้น- โจทย์คือ ลูกค้าของลูกค้า- UX Research"}, {"6123": "ทักษะที่ควรมี!"}, {"dfcf": "K.ป้อม — Marketing- การตลาดดิจิตอล มี 2 ประเภท >> Specialist — มีไฟในการหาความรู้ใหม่ / ยอมรับในเรื่องการตลาดที่เปลี่ยนไป >> Generalist — นักการตลาดที่แข็งแกร่ง /รู้จักธุรกิจ/การสื่อสารกับมนุษย์"}, {"6fe7": "K.เอ็ม — Content- จบในตัวเอง- รักในสิ่งที่ทำ และทำอย่างสม่ำเสมอ"}, {"d9bf": "K.ตั้ง — Developer- โปรแกรมเมอร์ที่ควรระวัง > ไม่พัฒนา skill  > ไม่เรียนรู้ ไม่เก่งภาษา > คนที่มีจุดเลิกเขียน เช่น คิดว่า อายุ 35 จะเลิกเขียนโค้ดแล้วนอนอยู่บ้าน"}, {"ab77": "K.เบ๊นซ์ — Designer- อัพเดตเทรนใหม่ๆ tools/content/web- ยอมรับฟังความคิดเห็นของคนอื่น- เปิดใจ อย่าหัวร้อน- UX/Research/Prototype"}, {"ecae": "สรุปคร่าวๆประมาณนี้ค่ะ"}, {"5c55": "ขอบคุณค่ะ"}], "content": "xWeb Trend 2017 ขอแชร์สรุปคร่าวๆที่ได้ฟังมาจากงาน ​ WebPresso จิบกาแฟคนทำเว็บ ในหัวข้อ “Web Trend 2017” งานนี้จัดขึ้น โดย “สมาคมผู้ดูแลเว็บไทย” พูดคุยกันเกี่ยวกับ แนวโน้ม ทิศทาง และเรื่องที่น่าสนใจ ของเทรนด์ออนไลน์ รวมถึงการเปลี่ยนแปลงที่จะเกิดขึ้นในปี 2017 ทั้งด้าน Developer, Designer, Marketing และ Content โดยวิทยากรที่มาพูดคุย ถือว่าเป็น ผู้เชี่ยวชาญในวงการดิจิทัลไทย(เรียงจาก ซ้ายไปขวา) คุณศิวัตร เชาวรียวงษ์ (คุณป้อม) — Marketingกรรมการผู้จัดการ บริษัท MInteraction / Advertising agency คุณขจร เจียรนัยพานิชย์ (คุณเอ็ม) — Contentบล็อกเกอร์ และผู้ก่อตั้งเว็บ Mango Zero, MacThai คุณวรัทธน์ วงศ์มณีกิจ (คุณตั้ง) — DeveloperProduct Owner at ThothZocial / Google Developer Expert for Web Technologies คุณอินทนนท์ ปัญญาโสภา (คุณเบ๊นซ์) — DesignerCo-Founder เว็บ Grappik คุณป๋อม เป็นวิทยากร ของงานนี้ค่ะ หัวข้อคำถามมีดังนี้ ในปี 2016 มีอะไรน่าสนใจบ้าง? K.เอ็ม — Content- ทุกคนมุ่ง และ ทุ่ม ไปที่ Facebook - คนไทยเล่น Facebook มากที่สุด - คนใช้ Mobile เป็นหลัก และ หันมาเริ่มใช้ Live / คลิปสั้น- Content มักทำออกมาเพื่อให้คนที่ใช้ Mobile ใช้ได้สะดวกขึ้น เช่น ทำวีดีโอออกมา ในลักษณะ สีเหลี่ยมจัตุรัส- กว่า 80% Content ถูกทำออกมา support บน Mobile เป็นหลัก- Content ต้องจบในตัว - Facebook Live บน iPhone มีคนดูมากกว่า TV- สื่อ Social มียอดรวมของ Stat ที่แน่นอน K.ตั้ง — Developer- การพัฒนาเว็บ ถือว่าค่อนข้างช้า เช่น เราพูดกันตอนนี้ แต่ อีก 3 ปี มันถึงจะ Boom!- ไทยมีอินเตอร์เน็ตที่เร็ว- ในปี 2016 ทำให้รู้ว่า Mobile Web ได้กระโดดขึ้นมาอีกขั้น- Desktop Web อยู่ตัวแล้ว- Mobile Web ต้องพัฒนา >> Progressive Web App — ทำ MWeb ให้มี ประสิทธิภาพเทียบเท่า App- App ทำยาก- ปี 2016 เป็นปีของการพูด Feature ยังไม่สมบูรณ์- การพัฒนาของปีนี้ 2017 แยก Site Desktop กับ Mobile เพราะ การ ทำ ​ Responsive ทำให้เว็บช้า (Responsive คือการซ่อนโค้ดที่ไม่จำเป็นบน Mobile)  “การแยก Site Desktop กับ Mobile จะทำให้คนอยู่ได้นานขึ้น stat ดีขึ้น” K.เบ๊นซ์ — Designer- Flat Design & Material Design (Apple & Google)- Trend เหมือนเดิม แต่จะถูกพัฒนาเพิ่มขึ้น- 2016 กราฟฟิค element icon รูปแบบการดีไซน์ จะออกมาแบบ เรียบง่าย สีน้อย ลักษณะแบน เคลียๆ สะอาด- มาในปี 2017 Flat จะถูกปรับปรุงขึ้น มีแสงเงา เเละมีสีที่มากขึ้น- มีสื่อวีดีโอเข้ามาเป็นตัวหลัก K.ป้อม — Marketing- 2014 กลุ่ม New Used คนใช้หน้าใหม่ (ลุง ป้า น้า อา ) เริ่ม ใช้ LINE เพื่อพูดคุย- 2015 เริ่มใช้ Mobile ซื้อของ- 2016 เริ่มใช้ Mobile ทำให้ชีวิตดีขึ้น ชอบทางลัด (YouTube/Joox/LINE TV/LINE/IG/Mobile Backing) — สำหรับคนต่างจังหวัด ถ้ากลุ่มคนเมืองที่เห็นได้ชัดคือ Grab/Map/LINEMAN- มองในด้านบริการ คนไทยมีความพร้อมใช้งานเพื่อให้ชีวิตดีขึ้น- เมื่อก่อน การเริ่มต้นอะไรใหม่เป็นสิ่งที่ผู้ใช้กลัว แต่ตอนนี้ใช้เพื่อปรับตัว แนวโน้ม ทิศทางในปี 2017 และปีต่อๆไป? K.ตั้ง — Developer- Browser จะเป็น Platform จริงๆแล้ว — Look Like App- เริ่มมาจาก คนไม่โหลด App จึงต้องทำ Browser ให้เหมือน App — พื้นที่ในมือถือมีจำกัด- ทำ Web ให้ มีประสิทธิภาพเท่า App- 60fps animation เร็วเท่า App- More User Engagement - Web มี notification - More Hardware Access- ไม่มีเน็ตก็เล่นได้- More Secure- More Accessibility (ARIA 1.1) K.เอ็ม — Content- อะไรที่อเมริกาใช้ อีก 2 ปี ไทยจะใช้- Snapchat Story >>Content แนวตั้ง มีภาพเคลื่อนไหว , มี Animation ในตัว- ทำ Content บน story มันดีนะ- Mobile video แนวตั้ง (เปิดตัวอย่างงานใน Facebook เป็นข่าวที่นำเสนอผลงาน ในรูปแบบ video แนวตั้ง และ ใช้การตัดต่อ movement สวยงามเหมาะกับการดูแนวตั้ง … ตัวอย่างของ circuit breaker - Facebook group มี content ขายของ- LINE group ใหม่ที่มี group ย่อยอยู่ด้านใน มี Mod เป็นผู้ดูแล Group นั้นๆสามารถรวมคนได้มากกว่า 1 แสนคน =o=- MOJO (Mobile Journalist) เป็นเทรนทำ Content ออนไลน์ ของนักข่าวบนมือถือ สามารถ ทำ content ตัดต่อข่าว ได้ในมือถือ จบในคนเดียวได้เลย- Video มาชัวร์- Video ควรมี Subtitle !! K.ป้อม — Marketing- ผลสำรวจเงินโฆษณาของปี 2017 คือ 11,000 ล้าน (ยังไม่รวม SME , Facebook, ซื้อตรง,…)- Magazine เริ่มปิดตัวมากกว่า ครึ่ง (เริ่มเจ๊ง)- เงินโฆษณา ส่วนใหญ่ถูกจ่ายไปให้ Facebook และ Google- การหารายได้หลักจาก Banner เริ่มไม่ดี - แนวคิดของผู้ซื้อ จากการซื้อพื้นที่บนเว็บ หรือ ซื้อเวลาบนสื่อ เริ่มพังแล้ว- โจทย์ของผู้ซื้อ ต้องการให้ลูกค้าของเขาเห็นสื่อของเขา ต้องมีคนกลางที่เป็นคนกรองเว็บให้ว่าอยากลงให้ลูกค้ากลุ่มไหนเห็น (เพศ กลุ่มอายุ …) และเว็บนั้นๆ ต้องมีจำนวนผู้ใช้งานที่มากพอ รวมถึงมีคุณภาพที่ดี- Facebook ad >> banner + content K.เบ๊นซ์ — Designer- UX - ปิดการขายได้- นึกถึงผู้ใช้งานเยอะขึ้น มีที่มาที่ไปในการออกแบบ ดีไซน์- จัดเรียงข้อมูลให้กระชับ และสั้นแบบมีประโยชน์ เพื่อ MWeb และ App เรื่องที่น่ากังวล? K.ป้อม — Marketing- Ad block ตอนนี้ไม่ใช้ปัญหาเท่าไหร่ แต่คาดว่าอนาคต มาแน่ K.เอ็ม — Content- พรบ. ไซเบอร์ ได้เข้ามาช่วยเรื่อง copy content - เว็บข่าวแปล- quote content พวก 7 สิ่งที่ควรรู้… 10 อย่างที่ต้องใช้.. trend มาจาก buzzfeed คนสนใจน้อยลง >> แนะนำเว็บ contentmarketinginstitute.com วิจัยการตลาด-เน้น Original content ให้มากขึ้น ที่นี่มีที่เดียว เขียนแบบ signature ex. New York Time - เน้น content ที่มีแค่เราที่ทำได้ K.ตั้ง — Developer- โปรแกรมเมอร์น้อย- โปรแกรมเมอร์อินเตอร์ มีแค่ 20% (international standard)- โปรแกรมเมอร์ควรพยายามสร้างโปรแกรมเมอร์- โปรแกรมเมอร์ค่าตัวจะสูงขึ้น- คำแนะนำในการหาโปรแกรมเมอร์ คือ รับเด็กฝึกงาน ถ้าชอบก็ offer เงินเดือน เรียนจบแล้วมาทำงานได้เลย K.เบ๊นซ์ — Designer- Designer ชอบคิดว่าต้องสวย เอาแต่ใจ- Web ท่ีสมบูรณ์ ต้องแคร์คนรอบข้างด้วย คุยกับทีมอื่นบ้าง Content/Dev/MKT/… Case ที่น่าสนใจ ^^ K.ป้อม — Marketing- Chatbot- Chat Platfrom K.เอ็ม — Content- Web ข่าว อย่างเช่นที่ผ่านมา Matter , Momentum , Mango Zero- การปรับตัวของสื่อสิ่งพิมพ์ K.ตั้ง — Developer- ค่าตัวโปรแกรมเมอร์สูงขึ้น- โปรแกรมเมอร์รวมตัวมากขึ้น- Optimize Mobile ทำ Mobile ให้เร็ว K.เบ๊นซ์ — Designer- กล้าพูดมากขึ้น- โจทย์คือ ลูกค้าของลูกค้า- UX Research ทักษะที่ควรมี! K.ป้อม — Marketing- การตลาดดิจิตอล มี 2 ประเภท >> Specialist — มีไฟในการหาความรู้ใหม่ / ยอมรับในเรื่องการตลาดที่เปลี่ยนไป >> Generalist — นักการตลาดที่แข็งแกร่ง /รู้จักธุรกิจ/การสื่อสารกับมนุษย์ K.เอ็ม — Content- จบในตัวเอง- รักในสิ่งที่ทำ และทำอย่างสม่ำเสมอ K.ตั้ง — Developer- โปรแกรมเมอร์ที่ควรระวัง > ไม่พัฒนา skill  > ไม่เรียนรู้ ไม่เก่งภาษา > คนที่มีจุดเลิกเขียน เช่น คิดว่า อายุ 35 จะเลิกเขียนโค้ดแล้วนอนอยู่บ้าน K.เบ๊นซ์ — Designer- อัพเดตเทรนใหม่ๆ tools/content/web- ยอมรับฟังความคิดเห็นของคนอื่น- เปิดใจ อย่าหัวร้อน- UX/Research/Prototype สรุปคร่าวๆประมาณนี้ค่ะ ขอบคุณค่ะ ", "child": "1447_11447_11447_11447_11447_11447_11447_11447_1"}