{"name": "1448", "parent": "", "title": "Document, Don’t Create: Creating Content That Builds Your Personal Brand", "sentences": [{"dafb": "Document, Don’t Create: Creating Content That Builds Your Personal Brand"}, {"af43": "If you want people to start listening to you, you have to show up. What I mean by this is there are a lot of you out there who aren’t producing enough articles or videos or pieces of content that you should be produced to build your influence. Too many “content creators” think that they only have one at bat — they have to make the one, most beautifully created video or image or rant on Facebook."}, {"e3af": "But what they don’t realize is that their hunger to make the perfect piece of content is what’s actually crippling them."}, {"3cc8": "It’s true that if you want to be seen or heard on social media, you have to put out valuable content on a regular basis. You should be doing a YouTube vlog or podcast or some sort of long-form audio/video series at least once a week. You should be posting on Instagram and/or Snapchat stories at least 6–7 times a day."}, {"09f5": "Now you’re probably thinking: “Whoa, that’s a lot. How do I create 6–7 meaningful things a day?”"}, {"5be5": "I’ll give you the biggest tip when it comes to content creation: Document. Don’t create."}, {"4209": "In very simple terms, “documenting” versus “creating” is what The Real World and the Kardashians is to Star Wars and Friends. And don’t get confused — just because you’re “documenting” doesn’t mean you’re not creating content. It’s just a version of creating that is predicated more on practicality instead of having to think of stories or fantasy — something that’s very hard for most people (including myself)."}, {"61a5": "Think about it: you can ponder about the strategy behind every post and fabricate yourself into this “influential person”… or you can just be yourself."}, {"6431": "Creating this influential persona might seem especially hard if you’re just someone starting to climb the ladder. And I get it — for some of you there’s a lot of pressure in that. You think that some 30 or 40 or 50-year old is going to listen to your rant video with cynicism and think “what does this kid know?”"}, {"12c6": "But, one of the biggest mistakes people make when creating content for their personal brand is trying to oversell themselves because they think that’s what’s going to get people’s attention. Whether you’re a business coach or motivational speaker or artist, I think it’s much more fruitful to talk about your process than about the actual advice you “think” you should be giving them."}, {"3165": "Documenting your journey versus creating an image of yourself is the difference between saying “You should…” versus “my intuition says…”. Get it? It changes everything. I believe that the people who are willing to discuss their journeys instead of trying to front themselves as the “next big thing” are going to win."}, {"fae5": "So, when I say to put out those 6–7 meaningful pieces of content a day, just pick up your smartphone, open Facebook Live, and just start talking about the things most important to you. Because in the end, the creative (or how “beautiful” someone thinks your content is) is going to be subjective. What’s not subjective is the fact that you need to start putting yourself out there and keep swinging."}, {"fa10": "Starting is the most important part and the biggest hurdle that most people are facing. They’re pondering and strategizing instead of making. They’re debating what’s going to happen when they haven’t even looked at what’s in front of them."}, {"f38c": "So do me a favor and start documenting."}, {"bfda": "“Okay, I started Gary. Now what?” you ask? Keep doing it for another five years and then come back to me before you ask again."}, {"8f21": "I’ll give you the biggest tip when it comes to content creation: Document. Don’t create."}, {"5e1c": "Thanks for reading! :) If you enjoyed it, hit that heart button below."}, {"6150": "The idea of “documenting” instead of “creating” is an absolute monster of a concept that I believe will benefit you as it has already started benefiting a lot of people. If you’re looking for more advice, check out this video where I explain it to a young man:"}, {"299f": "FYI: this article originally appeared on my website."}], "content": "Document, Don’t Create: Creating Content That Builds Your Personal Brand If you want people to start listening to you, you have to show up. What I mean by this is there are a lot of you out there who aren’t producing enough articles or videos or pieces of content that you should be produced to build your influence. Too many “content creators” think that they only have one at bat — they have to make the one, most beautifully created video or image or rant on Facebook. But what they don’t realize is that their hunger to make the perfect piece of content is what’s actually crippling them. It’s true that if you want to be seen or heard on social media, you have to put out valuable content on a regular basis. You should be doing a YouTube vlog or podcast or some sort of long-form audio/video series at least once a week. You should be posting on Instagram and/or Snapchat stories at least 6–7 times a day. Now you’re probably thinking: “Whoa, that’s a lot. How do I create 6–7 meaningful things a day?” I’ll give you the biggest tip when it comes to content creation: Document. Don’t create. In very simple terms, “documenting” versus “creating” is what The Real World and the Kardashians is to Star Wars and Friends. And don’t get confused — just because you’re “documenting” doesn’t mean you’re not creating content. It’s just a version of creating that is predicated more on practicality instead of having to think of stories or fantasy — something that’s very hard for most people (including myself). Think about it: you can ponder about the strategy behind every post and fabricate yourself into this “influential person”… or you can just be yourself. Creating this influential persona might seem especially hard if you’re just someone starting to climb the ladder. And I get it — for some of you there’s a lot of pressure in that. You think that some 30 or 40 or 50-year old is going to listen to your rant video with cynicism and think “what does this kid know?” But, one of the biggest mistakes people make when creating content for their personal brand is trying to oversell themselves because they think that’s what’s going to get people’s attention. Whether you’re a business coach or motivational speaker or artist, I think it’s much more fruitful to talk about your process than about the actual advice you “think” you should be giving them. Documenting your journey versus creating an image of yourself is the difference between saying “You should…” versus “my intuition says…”. Get it? It changes everything. I believe that the people who are willing to discuss their journeys instead of trying to front themselves as the “next big thing” are going to win. So, when I say to put out those 6–7 meaningful pieces of content a day, just pick up your smartphone, open Facebook Live, and just start talking about the things most important to you. Because in the end, the creative (or how “beautiful” someone thinks your content is) is going to be subjective. What’s not subjective is the fact that you need to start putting yourself out there and keep swinging. Starting is the most important part and the biggest hurdle that most people are facing. They’re pondering and strategizing instead of making. They’re debating what’s going to happen when they haven’t even looked at what’s in front of them. So do me a favor and start documenting. “Okay, I started Gary. Now what?” you ask? Keep doing it for another five years and then come back to me before you ask again. I’ll give you the biggest tip when it comes to content creation: Document. Don’t create. Thanks for reading! :) If you enjoyed it, hit that heart button below. The idea of “documenting” instead of “creating” is an absolute monster of a concept that I believe will benefit you as it has already started benefiting a lot of people. If you’re looking for more advice, check out this video where I explain it to a young man: FYI: this article originally appeared on my website. ", "child": "1448_1\t1448_2\t1448_3\t1448_4\t1448_5\t1448_6\t1448_7\t1448_8\t1448_9\t1448_10\t1448_11\t1448_12\t1448_13\t1448_14\t1448_15\t1448_16\t1448_17\t1448_18\t1448_19\t1448_20\t1448_21\t1448_22\t1448_23\t1448_24\t1448_25"}