{"name": "1452", "parent": "", "title": "Are the UX articles you’re reading trying to sell you something?", "sentences": [{"9075": "Are the UX articles you’re reading trying to sell you something?"}, {"d514": "A view into the current state of publishing in UX — its importance, its biases — and how to identify when the content you’re reading is implicitly trying to sell you products, services, or ideas."}, {"36aa": "We all read about UX online."}, {"264f": "I do, quite a lot. Big part of what I have learned in UX comes from reading online — sites, blogs, forums, e-books. There’s great content available out there, and once you create the right reading habit, there’s tons you can learn from the experiences other people have to share."}, {"ee91": "The question becomes: why are people sharing their experiences online, for free, for everyone to read?"}, {"2e52": "Almost everything that is published in UX is written by professionals who, at some level, have a skin in the game. They are part of the industry. The big challenge in our discipline is that we don’t have a group of writers who are actively engaged and completely impartial when writing about UX; a group of people who simply cannot (and do not want to) benefit from influencing other people through writing."}, {"76f1": "Take a moment to look back at the UX links you clicked on this week."}, {"f28f": "Now look at the domain where that content is published."}, {"5406": "What does that company do? What does it sell?"}, {"9e5e": "There’s a big chance it is:"}, {"c4e6": "Even when a given article is published under “unbiased” domains (such as Medium.com), take a moment to look at the author’s bio. Where do they work? What do they do for a living? Why did they take the time to write that article, and what can they possibly be trying to sell you?"}, {"ff71": "Don’t get me wrong: there’s a bright side to everything."}, {"11bc": "Knowledge sharing is an intrinsic part of human nature. It’s how we learn from each other, how our discipline evolves, how we get smarter and survive as a tribe. These are also some of the reasons why Caio Braga and myself started uxdesign.cc in the first place: as a way to give back to the community (for free) some of the things we’ve learned from them (for free). You know, paying our debt."}, {"459a": "But as we share knowledge back to the design community, we have to make sure we’re publishing content that is impartial, unbiased, with no secret agendas."}, {"c95a": "The attention and traction that the topic “UX” is getting among businesses and designers is definitely great news for those of us making a living out of that discipline. There isn’t a more effective way to sell UX work than talking and writing about it."}, {"1c25": "Interest in “UX Design” over the last 12 years (Google Trends)"}, {"8789": "The downside? Well, there’s a reason companies are writing about such a specific topic. They want clicks, they want to build relevance in search results, they want to be positioned as thought leaders in UX, prototyping and design."}, {"9eaf": "The result is an increasing number of articles with a high incidence of buzzwords, links to free e-books and click-bait headlines that will help those companies generate traffic to their sites."}, {"402e": "You’ve probably seen these around:"}, {"586a": "And many more here."}, {"4103": "We have done it ourselves. Not very proud of it."}, {"8ce8": "But let’s break down why this happens: what exactly are the writers trying to sell you?"}, {"c051": "They want you to use their prototyping tool"}, {"5c86": "There’s a group of companies fighting really hard to be one of the first results when someone searches for “Best Prototyping Tool” on Google. Or “Best Sketch Plugin”. Or “Best User Testing App”. You name it."}, {"f609": "In addition to working their souls off to actually create a tool that is helpful, efficient, and easy to use (and some of them really are), most of these companies invest a lot of time in corporate blogging."}, {"6391": "Writing and publishing articles about UX, Design and Prototyping will not only position their company as a thought leader in that space, but also help build search relevance — therefore, organic search traffic. And if a small percentage of users who land on that article decide to try out their tool, their whole content marketing strategy quickly becomes a money-making machine."}, {"ea3e": "Next time you land on an article written by the makers of a design or prototyping software, pay attention to the title and intro: are there too many unnecessary keywords? Are they implying you are going to become a more successful designer if you do ____? There’s a chance they want you to believe ____ is more important than it actually is, simply because they are creating a tool that does ____."}, {"02c4": "They (desperately) want your email address"}, {"580d": "Here’s another common scenario: you click on an article that had a pretty interesting title, but land on a page with very little real estate on the screen to actually read it. At the top and bottom of the screen you see a series of pop-up overlays and sticky bars inviting you to download the company’s ebook, by simply entering your email address."}, {"fb6c": "This is called content marketing, and when done right, becomes a pretty effective way of generating leads."}, {"2a2d": "The questions to ask yourself here: why are they trying so hard to get your email address? Are they selling it to third-parties? Are they going to make your life miserable by sending you spam every single day moving forward? Are they selling ad units in the emails they send? Or are they just trying to make new friends?"}, {"aa81": "They want to recruit you"}, {"a144": "There’s another group of companies — mostly design agencies and product design teams — that have started using long-form content as a recruiting technique. There are some great publications from design teams out there, writing and publishing content quite frequently."}, {"840a": "The content coming from this group of companies tend to be incredibly well crafted and relevant to designers who are going through the challenges covered in the article."}, {"1607": "The high quality of the content doesn’t come as a surprise: a number of these companies have dedicated teams (or give designers a dedicated number of hours per week) for writing and sharing their experiences out with the world. They have realized how long-form articles can be a solid way of giving designers a behind-the-scenes view into what it feels like to work for them, and the takeaway usually revolves around:"}, {"c56a": "The advice here is: take everything with a grain of salt. Everything the company is saying/showing/telling through that article has been carefully curated before they hit “Publish”."}, {"82b1": "Not every design process is as seamless as it sounds in retrospective. Not all design deliverables are as clear and concise as the ones shown in the case study."}, {"5f5d": "They want to sell their personal brand"}, {"3717": "In some cases, there isn’t a big corporation behind the words you are reading. The content is hosted on an independent blogging platform, and signed by a person, with a real profile picture — not a logo."}, {"fd1d": "Now look at their bio."}, {"887b": "While articles authored by independent writers aren’t trying to sell you a specific tool or company’s vision, there are definitely other KPIs hiding beneath the surface (i.e. increasing their number of followers, prospective clients or potential hirers)."}, {"14cf": "Fair enough."}, {"492f": "That’s the case of most of our writers here at uxdesign.cc. Personally, it is my case as well. Every week, we receive and publish many articles from independent writers, and we love them: the stories cover super interesting topics, and people are really taking the time to share their experience with other designers — which is great."}, {"e2e9": "Here is one filter we apply to every story we curate: is there a clear takeaway for the reader? Is the author teaching readers something new, in exchange for the visibility that the story can give them?"}, {"d7a7": "But there are designers using online channels as content marketing as well, just like big companies do; people writing about trending topics as a way to position themselves as specialists, without having real experience or expertise in that area."}, {"e395": "It’s hard to draw a line, because “real experience” is really subjective. But there are certainly a few things you can do to fact-check your sources."}, {"5d79": "Questions to ask yourself (yes, a checklist)"}, {"5b91": "Writing as a selling tool is a trend that is not slowing down anytime soon. The more traction a topic gets (in our case, “UX”), the more companies and professionals will jump on it to try to own bits and pieces of it."}, {"2616": "There is something you can do as a reader, though, to make you better prepared next time you land on an article from an unknown source. Like everything in design, it all comes down to asking the right questions, and being a bit more skeptical about what we read and share — before we actually share it."}, {"c004": "Lines are getting more blurred"}, {"4987": "The biggest challenge with content marketing is that it is the most disguised form of advertising."}, {"7be4": "Different than a banner or a pre-roll YouTube ad, with content marketing there are no disclaimers, no clear indication that there are commercial interests behind what you are looking at. But it is definitely a reality in the world we live in, and there’s not a lot we can do other than be aware of it, ask the right questions, and be more skeptical about what we read and share online."}, {"4f06": "So, why do WE write?"}, {"64ad": "We won’t lie: we fall under the group “selling their personal brand” as well. As editors of a website with more than 150k followers worldwide receiving our content every week, we are certainly aware of the visibility that writing and sharing content online can give us — and letting that become a primary driver is quite tempting. But when you do so, content becomes shallow and driven solely by numbers. Every day we force ourselves to remember about our broader mission: giving something valuable back to the community."}, {"85de": "We don’t make any money out of uxdesign.cc and don’t ever plan to. But amongst the hundreds of emails and comments we receive every week, there are often kind words from designers who have decided to take a job in UX because of an article we shared, who have applied a new method on their project, or who are just thankful for the inspiration they get from us every week. That is the best KPI we could aim for."}, {"ecaa": "We feel empowered — but we also feel responsible for shaping the state of online publishing in our industry. We wrote this piece as a reminder for younger designers to always check the facts, and to always question their sources."}, {"9470": "Now if you like this article, please subscribe to our weekly newsletter below, so we can make tons of money from our sponsors (evil laugh)."}, {"fa73": "Just kidding: our newsletter doesn’t have any ads, any sponsors, doesn’t generate any money."}, {"4f95": "But why would you trust me, right? :)"}], "content": "Are the UX articles you’re reading trying to sell you something? A view into the current state of publishing in UX — its importance, its biases — and how to identify when the content you’re reading is implicitly trying to sell you products, services, or ideas. We all read about UX online. I do, quite a lot. Big part of what I have learned in UX comes from reading online — sites, blogs, forums, e-books. There’s great content available out there, and once you create the right reading habit, there’s tons you can learn from the experiences other people have to share. The question becomes: why are people sharing their experiences online, for free, for everyone to read? Almost everything that is published in UX is written by professionals who, at some level, have a skin in the game. They are part of the industry. The big challenge in our discipline is that we don’t have a group of writers who are actively engaged and completely impartial when writing about UX; a group of people who simply cannot (and do not want to) benefit from influencing other people through writing. Take a moment to look back at the UX links you clicked on this week. Now look at the domain where that content is published. What does that company do? What does it sell? There’s a big chance it is: Even when a given article is published under “unbiased” domains (such as Medium.com), take a moment to look at the author’s bio. Where do they work? What do they do for a living? Why did they take the time to write that article, and what can they possibly be trying to sell you? Don’t get me wrong: there’s a bright side to everything. Knowledge sharing is an intrinsic part of human nature. It’s how we learn from each other, how our discipline evolves, how we get smarter and survive as a tribe. These are also some of the reasons why Caio Braga and myself started uxdesign.cc in the first place: as a way to give back to the community (for free) some of the things we’ve learned from them (for free). You know, paying our debt. But as we share knowledge back to the design community, we have to make sure we’re publishing content that is impartial, unbiased, with no secret agendas. The attention and traction that the topic “UX” is getting among businesses and designers is definitely great news for those of us making a living out of that discipline. There isn’t a more effective way to sell UX work than talking and writing about it. Interest in “UX Design” over the last 12 years (Google Trends) The downside? Well, there’s a reason companies are writing about such a specific topic. They want clicks, they want to build relevance in search results, they want to be positioned as thought leaders in UX, prototyping and design. The result is an increasing number of articles with a high incidence of buzzwords, links to free e-books and click-bait headlines that will help those companies generate traffic to their sites. You’ve probably seen these around: And many more here. We have done it ourselves. Not very proud of it. But let’s break down why this happens: what exactly are the writers trying to sell you? They want you to use their prototyping tool There’s a group of companies fighting really hard to be one of the first results when someone searches for “Best Prototyping Tool” on Google. Or “Best Sketch Plugin”. Or “Best User Testing App”. You name it. In addition to working their souls off to actually create a tool that is helpful, efficient, and easy to use (and some of them really are), most of these companies invest a lot of time in corporate blogging. Writing and publishing articles about UX, Design and Prototyping will not only position their company as a thought leader in that space, but also help build search relevance — therefore, organic search traffic. And if a small percentage of users who land on that article decide to try out their tool, their whole content marketing strategy quickly becomes a money-making machine. Next time you land on an article written by the makers of a design or prototyping software, pay attention to the title and intro: are there too many unnecessary keywords? Are they implying you are going to become a more successful designer if you do ____? There’s a chance they want you to believe ____ is more important than it actually is, simply because they are creating a tool that does ____. They (desperately) want your email address Here’s another common scenario: you click on an article that had a pretty interesting title, but land on a page with very little real estate on the screen to actually read it. At the top and bottom of the screen you see a series of pop-up overlays and sticky bars inviting you to download the company’s ebook, by simply entering your email address. This is called content marketing, and when done right, becomes a pretty effective way of generating leads. The questions to ask yourself here: why are they trying so hard to get your email address? Are they selling it to third-parties? Are they going to make your life miserable by sending you spam every single day moving forward? Are they selling ad units in the emails they send? Or are they just trying to make new friends? They want to recruit you There’s another group of companies — mostly design agencies and product design teams — that have started using long-form content as a recruiting technique. There are some great publications from design teams out there, writing and publishing content quite frequently. The content coming from this group of companies tend to be incredibly well crafted and relevant to designers who are going through the challenges covered in the article. The high quality of the content doesn’t come as a surprise: a number of these companies have dedicated teams (or give designers a dedicated number of hours per week) for writing and sharing their experiences out with the world. They have realized how long-form articles can be a solid way of giving designers a behind-the-scenes view into what it feels like to work for them, and the takeaway usually revolves around: The advice here is: take everything with a grain of salt. Everything the company is saying/showing/telling through that article has been carefully curated before they hit “Publish”. Not every design process is as seamless as it sounds in retrospective. Not all design deliverables are as clear and concise as the ones shown in the case study. They want to sell their personal brand In some cases, there isn’t a big corporation behind the words you are reading. The content is hosted on an independent blogging platform, and signed by a person, with a real profile picture — not a logo. Now look at their bio. While articles authored by independent writers aren’t trying to sell you a specific tool or company’s vision, there are definitely other KPIs hiding beneath the surface (i.e. increasing their number of followers, prospective clients or potential hirers). Fair enough. That’s the case of most of our writers here at uxdesign.cc. Personally, it is my case as well. Every week, we receive and publish many articles from independent writers, and we love them: the stories cover super interesting topics, and people are really taking the time to share their experience with other designers — which is great. Here is one filter we apply to every story we curate: is there a clear takeaway for the reader? Is the author teaching readers something new, in exchange for the visibility that the story can give them? But there are designers using online channels as content marketing as well, just like big companies do; people writing about trending topics as a way to position themselves as specialists, without having real experience or expertise in that area. It’s hard to draw a line, because “real experience” is really subjective. But there are certainly a few things you can do to fact-check your sources. Questions to ask yourself (yes, a checklist) Writing as a selling tool is a trend that is not slowing down anytime soon. The more traction a topic gets (in our case, “UX”), the more companies and professionals will jump on it to try to own bits and pieces of it. There is something you can do as a reader, though, to make you better prepared next time you land on an article from an unknown source. Like everything in design, it all comes down to asking the right questions, and being a bit more skeptical about what we read and share — before we actually share it. Lines are getting more blurred The biggest challenge with content marketing is that it is the most disguised form of advertising. Different than a banner or a pre-roll YouTube ad, with content marketing there are no disclaimers, no clear indication that there are commercial interests behind what you are looking at. But it is definitely a reality in the world we live in, and there’s not a lot we can do other than be aware of it, ask the right questions, and be more skeptical about what we read and share online. So, why do WE write? We won’t lie: we fall under the group “selling their personal brand” as well. As editors of a website with more than 150k followers worldwide receiving our content every week, we are certainly aware of the visibility that writing and sharing content online can give us — and letting that become a primary driver is quite tempting. But when you do so, content becomes shallow and driven solely by numbers. Every day we force ourselves to remember about our broader mission: giving something valuable back to the community. We don’t make any money out of uxdesign.cc and don’t ever plan to. But amongst the hundreds of emails and comments we receive every week, there are often kind words from designers who have decided to take a job in UX because of an article we shared, who have applied a new method on their project, or who are just thankful for the inspiration they get from us every week. That is the best KPI we could aim for. We feel empowered — but we also feel responsible for shaping the state of online publishing in our industry. We wrote this piece as a reminder for younger designers to always check the facts, and to always question their sources. Now if you like this article, please subscribe to our weekly newsletter below, so we can make tons of money from our sponsors (evil laugh). Just kidding: our newsletter doesn’t have any ads, any sponsors, doesn’t generate any money. But why would you trust me, right? :) ", "child": "1452_1\t1452_2\t1452_3\t1452_4\t1452_5\t1452_6\t1452_7\t1452_8\t1452_9\t1452_10\t1452_11\t1452_12\t1452_13\t1452_14\t1452_15\t1452_16\t1452_17\t1452_18\t1452_19"}