{"name": "1474", "parent": "", "title": "Best Practices for Modals / Overlays / Dialog Windows", "sentences": [{"18c2": "Best Practices for Modals / Overlays / Dialog Windows"}, {"fdf5": "Modals, Overlays, Dialogs, whatever you call them it’s time to revisit this UI pattern. When they first came on the scene, modal windows were an elegant solution to a UI problem. The first being that it simplifies the UI, the second, it saves screen real estate. Since then designers have readily adopted the modal window and some have taken it to the extreme. Modals have become the today’s version of the dreaded popup window. Users find modals annoying and have been trained to instinctively and automatically dismiss these windows."}, {"dbf6": "Definition:"}, {"50c7": "A modal window is an element that sits on top of an application’s main window. It creates a mode that disables the main window but keeps it visible with the modal window as a child window in front of it. Users must interact with the modal window before they can return to the parent application. — Wikipedia"}, {"a2f6": "Usage"}, {"d0d5": "You may consider using a modal window when you need to:"}, {"a173": "Grab the user’s attention"}, {"55f3": "Use when you want to interrupt a user’s current task to catch the user’s full attention to something more important."}, {"e281": "Need user input"}, {"17d4": "Use when you want to get information from the user. Ex. sign up or login form."}, {"f153": "Show additional information in context."}, {"95ec": "Use when you want to show additional information without losing the context of the parent page. Ex. showing larger images or videos."}, {"6d08": "Show additional information (not in context)"}, {"fdc8": "Use when you want to show information that is not directly related to the parent page or other options that are “independent” from other pages. Ex. notifications."}, {"8b28": "Note: Do not use to show error, success, or warning messages. Keep them on the page."}, {"e9f2": "Anatomy of a Modal Window"}, {"e6bb": "Poorly implemented overlays can hinder task completion. To ensure your modal doesn’t get in the way make sure to include the following:"}, {"8078": "1. Escape Hatch"}, {"10de": "Give users a way to escape by giving them a way to close the modal. This can be achieved in the following ways:"}, {"0dda": "Accessibility Tip: each modal window must have a keyboard accessible control to close that window. Ex. escape key should close the window."}, {"17bc": "2. Descriptive Title"}, {"3d52": "Give context to the user with the modal title. This allows the user to know where he/she is because they haven’t left the original page."}, {"5ed4": "clicked on Tweet button — Modal title: Compose new Tweet. Gives context."}, {"28ef": "Tip: button label (which launches modal) and modal title should match"}, {"1dc5": "3. Button"}, {"4387": "Button labels should have actionable, understandable names. This applies to a button in any instance. For modals, a ‘close’ button should be present in the form of a labeled ‘close’ button or an ‘x’."}, {"630f": "Invision has clearly labeled buttons"}, {"0b50": "Note: Don’t make the button labels confusing. If the user is trying to cancel and a modal appears with ANOTHER cancel button, confusion occurs. “Am I cancelling the cancel? Or continuing my cancel?”"}, {"e2bf": "4. Sizing & Location"}, {"d59e": "A modal window should not be too big or too small, you want it juuuuust right. The goal is to keep context, therefore a modal should not take up the whole screen view. Content should fit the modal. If a scrollbar is needed, you may consider creating a new page instead."}, {"7483": "5. Focus"}, {"bc74": "When you open a modal use a lightbox effect (darken the background). This draws attention to the modal and indicates that the user cannot interact with the parent page."}, {"d74f": "Accessibility Tip: put the keyboard focus on the modal"}, {"7bef": "6. User Initiated"}, {"5d4b": "Don’t surprise users by popping up a modal. Let a user’s action, such as a button click, following a link or selecting an option, trigger the modal. Uninvited modals may surprise the user and result in a quick dismissal of the window."}, {"e00d": "Modal initiated by clicking Log In"}, {"0386": "Modals in Mobile"}, {"a130": "Modals and mobile devices usually don’t play well together. Viewing the content is difficult because modals either are too large, taking up too much screen space or too small. Add in elements like the device keyboard and nested scrollbars; users are left pinching and zooming trying to catch the fields of a modal window. There are better alternatives for modals and shouldn’t be used on mobile devices."}, {"fde5": "modal window done well — facebook"}, {"2007": "Accessibility"}, {"919e": "KEYBOARD"}, {"1d4d": "When creating modals remember to add in keyboard accessibility. Consider the following:"}, {"7c42": "Opening modal — The element which triggers the dialog must be keyboard accessible"}, {"f268": "Moving focus into the Dialog — Once the modal window is open, the keyboard focus needs to be moved to the top of that"}, {"6ed3": "Managing Keyboard Focus — Once the focus is moved into the dialog, it should be “trapped” inside it until the dialog is closed."}, {"df0f": "Closing the Dialog — Each overlay window must have a keyboard accessible control to close that window."}, {"0497": "For more information on the list above check out Nomensa’s blog article"}, {"018b": "ARIA"}, {"ec0c": "Accessible Rich Internet Applications (ARIA) defines ways to make Web content and Web applications more accessible."}, {"6296": "The following ARIA tags can be helpful in creating an accessible modal: Role = “dialog” , aria-hidden, aria-label"}, {"e240": "for more information on ARIA, check out Smashing’s Magazine article"}, {"e735": "Also, remember low-vision users. They may use screen magnifiers on monitors to enlarge the screen content. Once zoomed in the user can only see part of the screen. Here modals will have the same effect as they do in mobile."}, {"f887": "Conclusion"}, {"2119": "If people have been trained to automatically try to close modals, why would you want to use them?"}, {"8a10": "Getting the user’s attention, keeping context and simplifying the UI are great benefits of modals. However, there are downsides as they interrupt the user flow and make it impossible to interact with the parent page by hiding the content behind the modal. Modal may not always be the answer. Consider the following when making your choice:"}, {"52bf": "Checklist"}, {"5e36": "There is an alternative UI component to modals: non-modal or a.ka. toast (term used by Google in Material Design & Microsoft). Check out my next post to learn more."}, {"1ed2": "References:"}, {"9ecc": "Overlays — Patterny"}, {"bfce": "Modal Windows — UI Patterns"}, {"85b2": "Overuse of Overlays — NNgroup"}, {"5824": "10 Guidelines to Consider when using Overlays — UX for the Masses"}, {"75e4": "Making Modal Windows Better For Everyone — Smashing Magazine"}, {"37f6": "How to improve the accessibility of overlay windows — Nomensa"}, {"d5f2": "If you want to learn more about any UI component or UX subject, please follow me and let me know. I’m always looking to provide insightful info :) And please recommend this article if you found it useful."}], "content": "Best Practices for Modals / Overlays / Dialog Windows Modals, Overlays, Dialogs, whatever you call them it’s time to revisit this UI pattern. When they first came on the scene, modal windows were an elegant solution to a UI problem. The first being that it simplifies the UI, the second, it saves screen real estate. Since then designers have readily adopted the modal window and some have taken it to the extreme. Modals have become the today’s version of the dreaded popup window. Users find modals annoying and have been trained to instinctively and automatically dismiss these windows. Definition: A modal window is an element that sits on top of an application’s main window. It creates a mode that disables the main window but keeps it visible with the modal window as a child window in front of it. Users must interact with the modal window before they can return to the parent application. — Wikipedia Usage You may consider using a modal window when you need to: Grab the user’s attention Use when you want to interrupt a user’s current task to catch the user’s full attention to something more important. Need user input Use when you want to get information from the user. Ex. sign up or login form. Show additional information in context. Use when you want to show additional information without losing the context of the parent page. Ex. showing larger images or videos. Show additional information (not in context) Use when you want to show information that is not directly related to the parent page or other options that are “independent” from other pages. Ex. notifications. Note: Do not use to show error, success, or warning messages. Keep them on the page. Anatomy of a Modal Window Poorly implemented overlays can hinder task completion. To ensure your modal doesn’t get in the way make sure to include the following: 1. Escape Hatch Give users a way to escape by giving them a way to close the modal. This can be achieved in the following ways: Accessibility Tip: each modal window must have a keyboard accessible control to close that window. Ex. escape key should close the window. 2. Descriptive Title Give context to the user with the modal title. This allows the user to know where he/she is because they haven’t left the original page. clicked on Tweet button — Modal title: Compose new Tweet. Gives context. Tip: button label (which launches modal) and modal title should match 3. Button Button labels should have actionable, understandable names. This applies to a button in any instance. For modals, a ‘close’ button should be present in the form of a labeled ‘close’ button or an ‘x’. Invision has clearly labeled buttons Note: Don’t make the button labels confusing. If the user is trying to cancel and a modal appears with ANOTHER cancel button, confusion occurs. “Am I cancelling the cancel? Or continuing my cancel?” 4. Sizing & Location A modal window should not be too big or too small, you want it juuuuust right. The goal is to keep context, therefore a modal should not take up the whole screen view. Content should fit the modal. If a scrollbar is needed, you may consider creating a new page instead. 5. Focus When you open a modal use a lightbox effect (darken the background). This draws attention to the modal and indicates that the user cannot interact with the parent page. Accessibility Tip: put the keyboard focus on the modal 6. User Initiated Don’t surprise users by popping up a modal. Let a user’s action, such as a button click, following a link or selecting an option, trigger the modal. Uninvited modals may surprise the user and result in a quick dismissal of the window. Modal initiated by clicking Log In Modals in Mobile Modals and mobile devices usually don’t play well together. Viewing the content is difficult because modals either are too large, taking up too much screen space or too small. Add in elements like the device keyboard and nested scrollbars; users are left pinching and zooming trying to catch the fields of a modal window. There are better alternatives for modals and shouldn’t be used on mobile devices. modal window done well — facebook Accessibility KEYBOARD When creating modals remember to add in keyboard accessibility. Consider the following: Opening modal — The element which triggers the dialog must be keyboard accessible Moving focus into the Dialog — Once the modal window is open, the keyboard focus needs to be moved to the top of that Managing Keyboard Focus — Once the focus is moved into the dialog, it should be “trapped” inside it until the dialog is closed. Closing the Dialog — Each overlay window must have a keyboard accessible control to close that window. For more information on the list above check out Nomensa’s blog article ARIA Accessible Rich Internet Applications (ARIA) defines ways to make Web content and Web applications more accessible. The following ARIA tags can be helpful in creating an accessible modal: Role = “dialog” , aria-hidden, aria-label for more information on ARIA, check out Smashing’s Magazine article Also, remember low-vision users. They may use screen magnifiers on monitors to enlarge the screen content. Once zoomed in the user can only see part of the screen. Here modals will have the same effect as they do in mobile. Conclusion If people have been trained to automatically try to close modals, why would you want to use them? Getting the user’s attention, keeping context and simplifying the UI are great benefits of modals. However, there are downsides as they interrupt the user flow and make it impossible to interact with the parent page by hiding the content behind the modal. Modal may not always be the answer. Consider the following when making your choice: Checklist There is an alternative UI component to modals: non-modal or a.ka. toast (term used by Google in Material Design & Microsoft). Check out my next post to learn more. References: Overlays — Patterny Modal Windows — UI Patterns Overuse of Overlays — NNgroup 10 Guidelines to Consider when using Overlays — UX for the Masses Making Modal Windows Better For Everyone — Smashing Magazine How to improve the accessibility of overlay windows — Nomensa If you want to learn more about any UI component or UX subject, please follow me and let me know. I’m always looking to provide insightful info :) And please recommend this article if you found it useful. ", "child": "1474_1\t1474_2\t1474_3\t1474_4\t1474_5\t1474_6\t1474_7\t1474_8\t1474_9\t1474_10\t1474_11\t1474_12\t1474_13\t1474_14\t1474_15\t1474_16\t1474_17\t1474_18\t1474_19\t1474_20\t1474_21\t1474_22\t1474_23\t1474_24\t1474_251474_1\t1474_2\t1474_3\t1474_4\t1474_5\t1474_6\t1474_7\t1474_8\t1474_9\t1474_10\t1474_11\t1474_12\t1474_13\t1474_14\t1474_15\t1474_16\t1474_17\t1474_18\t1474_19\t1474_20\t1474_21\t1474_22\t1474_23\t1474_24\t1474_251474_1\t1474_2\t1474_3\t1474_4\t1474_5\t1474_6\t1474_7\t1474_8\t1474_9\t1474_10\t1474_11\t1474_12\t1474_13\t1474_14\t1474_15\t1474_16\t1474_17\t1474_18\t1474_19\t1474_20\t1474_21\t1474_22\t1474_23\t1474_24\t1474_25"}