{"name": "1497", "parent": "", "title": "Consumindo API com Redux de forma elegante", "sentences": [{"51be": "Consumindo API com Redux de forma elegante"}, {"a740": "Como você faz para consumir API's com Redux? Na documentação oficial são referenciados Middlewares como redux-thunk e redux-promise, assim como na maioria dos exemplos de tutoriais sobre Redux que a gente encontra espalhados pela internet."}, {"98f9": "Quando falamos em consumir API's, falamos de side-effects. Partindo do princípio que actions e reducers devem ser funções puras, chegamos a conclusão de que o melhor lugar para executar as funções não puras (com side-effects / as que fazem fetch) é dentro de Middlewares."}, {"736d": "Seguindo aquelas sugestões, teremos coisas como:"}, {"f08e": "dispatch({ type: 'FETCHING' })"}, {"d141": "axios.get('https://api.github.com/users/arojunior')  .then(response => dispatch({type:'SUCCESS', payload: res.data })),  .catch(error => dispatch({type:'FAILURE', error: error}))"}, {"0819": "ou…"}, {"4f71": "const apiServer = 'https://api.github.com/users'const fetchData = axios.get(`${apiServer}/arojunior`)"}, {"6fe2": "dispatch({ type: 'FETCHING' })"}, {"323b": "dispatch(fetchData)  .then(response => ({ type: 'SUCCESS', payload: res.data })),  .catch(error => ({ type: 'FAILURE', error: error}))"}, {"338a": "Mas isso não é nada elegante, né? Um tanto quanto confuso. Sem contar que esse código acima teria que ficar em algum local com acesso ao dispatch, no caso, dentro de um componente."}, {"43b3": "Você poderia chamar direto o método que faz fetch na api e apenas retornar quando concluísse, mas dessa forma você estaria ignorando o estado 'fetching' e possíveis erros. Isso também não é nada legal."}, {"c7bc": "O padrão é termos 3 actions para controle de estado: quando a requisição inicia, quando ela conclui com sucesso e outra em caso de erro."}, {"653c": "Diante deste problema, resolvi escrever um Middleware pra deixar as coisas mais organizadas de modo que eu pudesse colocar todo o meu código dentro de um action creator e apenas chamasse este método dentro do componente."}, {"2758": "Apresento-lhes o https://github.com/arojunior/fetch-middleware"}, {"6fc5": "Conforme exemplo da documentação no Github, este seria o formato da action:"}, {"9220": "type é um array com 3 actions creators que devem seguir sempre esta ordem."}, {"3080": "data pertence ao payload e deve ser uma função que retorna uma promise."}, {"7464": "Utilizando o redux-actions, você pode criar essas actions de forma simples e rápida:"}, {"f3c7": "const githubFetching = createAction('GITHUB_FETCHING')const githubError    = createAction('GITHUB_ERROR')const githubSuccess  = createAction('GITHUB_SUCCESS')"}, {"80bc": "Em seu componente, você faria apenas uma chamada:"}, {"d559": "dispatch(getUserFromGithub('arojunior'))"}, {"6a49": "O Middleware chamará a fetching antes de iniciar o processo, success quando concluir ou error caso ocorra algum problema."}, {"66ef": "Com a ajuda do redux-actions, não é preciso especificar o tratamento do payload… Ele passará automaticamente para o reducer quando chamar o método success. Segue exemplo:"}, {"2871": "export default (state = initialState, action) => {  switch (action.type) {    case 'GITHUB_FETCHING':      return {...state,              fetching     : true              }    case 'GITHUB_SUCCESS':      return {...state,              fetching     : false,              user         : action.payload.data              }    case 'GITHUB_ERROR':      return {...state,              fetching       : false            }    default:      return state  }}"}, {"ce02": "Caso você não queira ficar preso a este padrão, você pode utilizar outro Middleware que eu escrevi: https://github.com/arojunior/redux-middleware-injector (este lhe dará liberdade para escrever as actions da forma que você preferir)"}, {"00c0": "Fiquem a vontade para comentar críticas/elogios/sugestões. Lembrando que recomendações aqui e estrelas no Github sempre ajudam a incentivar a comunidade a colaborar. :)"}], "content": "Consumindo API com Redux de forma elegante Como você faz para consumir API's com Redux? Na documentação oficial são referenciados Middlewares como redux-thunk e redux-promise, assim como na maioria dos exemplos de tutoriais sobre Redux que a gente encontra espalhados pela internet. Quando falamos em consumir API's, falamos de side-effects. Partindo do princípio que actions e reducers devem ser funções puras, chegamos a conclusão de que o melhor lugar para executar as funções não puras (com side-effects / as que fazem fetch) é dentro de Middlewares. Seguindo aquelas sugestões, teremos coisas como: dispatch({ type: 'FETCHING' }) axios.get('https://api.github.com/users/arojunior')  .then(response => dispatch({type:'SUCCESS', payload: res.data })),  .catch(error => dispatch({type:'FAILURE', error: error})) ou… const apiServer = 'https://api.github.com/users'const fetchData = axios.get(`${apiServer}/arojunior`) dispatch({ type: 'FETCHING' }) dispatch(fetchData)  .then(response => ({ type: 'SUCCESS', payload: res.data })),  .catch(error => ({ type: 'FAILURE', error: error})) Mas isso não é nada elegante, né? Um tanto quanto confuso. Sem contar que esse código acima teria que ficar em algum local com acesso ao dispatch, no caso, dentro de um componente. Você poderia chamar direto o método que faz fetch na api e apenas retornar quando concluísse, mas dessa forma você estaria ignorando o estado 'fetching' e possíveis erros. Isso também não é nada legal. O padrão é termos 3 actions para controle de estado: quando a requisição inicia, quando ela conclui com sucesso e outra em caso de erro. Diante deste problema, resolvi escrever um Middleware pra deixar as coisas mais organizadas de modo que eu pudesse colocar todo o meu código dentro de um action creator e apenas chamasse este método dentro do componente. Apresento-lhes o https://github.com/arojunior/fetch-middleware Conforme exemplo da documentação no Github, este seria o formato da action: type é um array com 3 actions creators que devem seguir sempre esta ordem. data pertence ao payload e deve ser uma função que retorna uma promise. Utilizando o redux-actions, você pode criar essas actions de forma simples e rápida: const githubFetching = createAction('GITHUB_FETCHING')const githubError    = createAction('GITHUB_ERROR')const githubSuccess  = createAction('GITHUB_SUCCESS') Em seu componente, você faria apenas uma chamada: dispatch(getUserFromGithub('arojunior')) O Middleware chamará a fetching antes de iniciar o processo, success quando concluir ou error caso ocorra algum problema. Com a ajuda do redux-actions, não é preciso especificar o tratamento do payload… Ele passará automaticamente para o reducer quando chamar o método success. Segue exemplo: export default (state = initialState, action) => {  switch (action.type) {    case 'GITHUB_FETCHING':      return {...state,              fetching     : true              }    case 'GITHUB_SUCCESS':      return {...state,              fetching     : false,              user         : action.payload.data              }    case 'GITHUB_ERROR':      return {...state,              fetching       : false            }    default:      return state  }} Caso você não queira ficar preso a este padrão, você pode utilizar outro Middleware que eu escrevi: https://github.com/arojunior/redux-middleware-injector (este lhe dará liberdade para escrever as actions da forma que você preferir) Fiquem a vontade para comentar críticas/elogios/sugestões. Lembrando que recomendações aqui e estrelas no Github sempre ajudam a incentivar a comunidade a colaborar. :) ", "child": "1497_1"}