{"name": "1506", "parent": "", "title": "The Cavs Can’t Just Waltz Into the Finals", "sentences": [{"3332": "The Cavs Can’t Just Waltz Into the Finals"}, {"eb16": "At least, not when they’re playing like that"}, {"a0ad": "What Happened"}, {"f502": "Every year in April, kids get their hearts ripped out by older cousins who, in whispers around the dinner table, ruin the actuality of the Easter Bunny and expose the myth as a fantasy. But this year, it will not hurt at all, because the young’uns discovered something better Saturday, something their parents talked about last summer, something real that should be folklore: Playoff LeBron."}, {"fe5b": "Cleveland managed its first postseason victory, beating the Pacers 109–108 in a down-to-the-last-second contest that, with a slightly different stroke on C.J. Miles’s last shot, would’ve ended in a win for Indiana."}, {"eaeb": "Highlight"}, {"098d": "Lance Stephenson, who couldn’t get a real contract from the Timberwolves and was passed over by the Cavs themselves after trying out for their roster earlier in the season, carried Indiana in the fourth quarter. Paul George finished with 29 points, but only four of those points came in the final quarter, and Stephenson’s scoring kept the Pacers within striking distance. The 3-pointer that George finally did make came far behind the arc with just 40 seconds left to bring the Pacers within a one point."}, {"970d": "Fortunately for the Cavaliers, it was just before George recovered his shot that their season-long defensive drought finally hinted at rain. On a lockdown possession with barely over a minute left, Kyrie Irving picked off Myles Turner. The big man would end up blocking Irving a few seconds later, but still, it was some of the best defense the Cavaliers had played all season — not a high bar for the team with the worst defensive rating of those still standing."}, {"faca": "Lowlight"}, {"0c30": "Politely put, both teams saved their energy for just one end of the floor for the majority the game (rudely put, each defense was “making fun of the shot of a kid who admires you” levels of ugly), resulting in a high-powered offensive game. By the end of the third quarter, the score was already 92–84."}, {"36ef": "But Cleveland had the chance at many more points, each player summoning the ghost of Wilt Chamberlain’s free throw stroke and the team going 14-for-27 from the charity stripe. That 51.9 percent was worse than the team’s overall field goal accuracy (53.8 percent), and though the detriment ended up not being fatal, it did temporarily put a damper on Quicken Loans Arena. Amid “MVP!” chants for LeBron after he used each of his 250 pounds of muscle to drive inside, James bricked a free throw to end the half. James ended with 32 points and 13 assists, going 6-of-9 from the line — 66.6 percent, a team best."}, {"c46e": "What It Means"}, {"09bd": "So Cleveland does have the capability to play defense, as was shown in the final two minutes of the game. Whether or not the Cavs will be able to stay at that level for 48 minutes will not matter as much in this series as it will in the next round, should they get there. Thinking about a Finals rematch against the Warriors is a bit forward after the Cavaliers squeezed out a one-point win in the first game of the first round, but it’s hard to imagine this Cleveland team trying to defend Golden State’s weaponry."}, {"7464": "George, who before the game said he was “tired of losing to this guy,” might watch LeBron and Co. extend that streak pretty soon. The Pacers star’s surrounding cast — Myles Turner, Jeff Teague, Monta Ellis — all finished in double figures, but while facing bad free throw shooting and poor defending, George’s biggest hope might be Cleveland losing to itself."}], "content": "The Cavs Can’t Just Waltz Into the Finals At least, not when they’re playing like that What Happened Every year in April, kids get their hearts ripped out by older cousins who, in whispers around the dinner table, ruin the actuality of the Easter Bunny and expose the myth as a fantasy. But this year, it will not hurt at all, because the young’uns discovered something better Saturday, something their parents talked about last summer, something real that should be folklore: Playoff LeBron. Cleveland managed its first postseason victory, beating the Pacers 109–108 in a down-to-the-last-second contest that, with a slightly different stroke on C.J. Miles’s last shot, would’ve ended in a win for Indiana. Highlight Lance Stephenson, who couldn’t get a real contract from the Timberwolves and was passed over by the Cavs themselves after trying out for their roster earlier in the season, carried Indiana in the fourth quarter. Paul George finished with 29 points, but only four of those points came in the final quarter, and Stephenson’s scoring kept the Pacers within striking distance. The 3-pointer that George finally did make came far behind the arc with just 40 seconds left to bring the Pacers within a one point. Fortunately for the Cavaliers, it was just before George recovered his shot that their season-long defensive drought finally hinted at rain. On a lockdown possession with barely over a minute left, Kyrie Irving picked off Myles Turner. The big man would end up blocking Irving a few seconds later, but still, it was some of the best defense the Cavaliers had played all season — not a high bar for the team with the worst defensive rating of those still standing. Lowlight Politely put, both teams saved their energy for just one end of the floor for the majority the game (rudely put, each defense was “making fun of the shot of a kid who admires you” levels of ugly), resulting in a high-powered offensive game. By the end of the third quarter, the score was already 92–84. But Cleveland had the chance at many more points, each player summoning the ghost of Wilt Chamberlain’s free throw stroke and the team going 14-for-27 from the charity stripe. That 51.9 percent was worse than the team’s overall field goal accuracy (53.8 percent), and though the detriment ended up not being fatal, it did temporarily put a damper on Quicken Loans Arena. Amid “MVP!” chants for LeBron after he used each of his 250 pounds of muscle to drive inside, James bricked a free throw to end the half. James ended with 32 points and 13 assists, going 6-of-9 from the line — 66.6 percent, a team best. What It Means So Cleveland does have the capability to play defense, as was shown in the final two minutes of the game. Whether or not the Cavs will be able to stay at that level for 48 minutes will not matter as much in this series as it will in the next round, should they get there. Thinking about a Finals rematch against the Warriors is a bit forward after the Cavaliers squeezed out a one-point win in the first game of the first round, but it’s hard to imagine this Cleveland team trying to defend Golden State’s weaponry. George, who before the game said he was “tired of losing to this guy,” might watch LeBron and Co. extend that streak pretty soon. The Pacers star’s surrounding cast — Myles Turner, Jeff Teague, Monta Ellis — all finished in double figures, but while facing bad free throw shooting and poor defending, George’s biggest hope might be Cleveland losing to itself. ", "child": "1506_1\t1506_2\t1506_3\t1506_4\t1506_5\t1506_6"}