{"name": "1507", "parent": "", "title": "Paulo Dybala Isn’t Messi, but He Was Better for One Night", "sentences": [{"a224": "Paulo Dybala Isn’t Messi, but He Was Better for One Night"}, {"1eb0": "Thanks to the 23-year-old’s two goals, Juventus takes a 3–0 lead into the second leg of their Champions League quarterfinal matchup with Barcelona"}, {"56a3": "A lot has changed since Barcelona wrung out a 3–1 victory over Juventus in the 2015 Champions League final. Arturo Vidal, who sailed a late, would-be equalizer over the crossbar is cannonballing around the middle third for Bayern Munich now. Real Madrid reclaimed Álvaro Morata, who headed home the Old Lady’s only goal in that final. Paul Pogba lost the relaxer and went back to Manchester to help them finish somewhere in the vicinity of sixth place. And Paulo Dybala, Pogba’s former bestie who transferred to Juve the summer after the loss to Barça, now has a power level over 9,000 and has started to pop up in those droning discussions over who is and isn’t “world class.”"}, {"d099": "On Tuesday, Juventus beat Barcelona 3–0 in the first leg of the Champions League quarterfinals. That was thanks in part to Giorgio Chiellini being taller and stronger than Javier Mascherano, but mostly, it came down to Dybala, who is really good at soccer, you guys. He might even be world class at it."}, {"545c": "You could be tempted to say that Juan Cuadrado did most of the work on the first goal, but Dybala’s share was arguably more difficult — or at least would’ve been, if either one of Gerard Piqué and Andrés Iniesta would’ve bothered to close him down. With just two touches, he rearranged his body just so and whipped an opener past the outstretched hand of Barça keeper Marc-André ter Stegen."}, {"6aa8": "By dint of being small, shifty, and Argentine, the 23-year-old has drawn comparisons to Lionel Messi. They’re comparisons that Dybala consequently rejects, but can’t possibly hope to avoid. With a second goal (this one a beautifully curled one-timer from just inside the 18-yard box), Dybala capped a brace and upstaged his OG. Still, Messi rules by divine right."}, {"554e": "There were other, better defining moments in this game, but the most emblematic was an attacking move in the first half that led to nothing. A probing ball trickled through the Juventus defense, just beyond Chiellini’s reach, and found its way to Messi in the 6-yard box. Normally, the outcome would be cut-and-dried — Messi scores because he’s Messi — but target-man turned wing-defender Mario Mandzukic somehow manhandled the Argentine all evening. This time, he strapped Messi into his proverbial booster seat while shepherding the ball over the inline. The better player lost due to a lack of size, conviction, or some combination of both."}, {"9405": "And so, Barcelona heads back to Camp Nou in frustration for the second leg, facing a towering obstacle to the next round. Where have I heard this one before?"}], "content": "Paulo Dybala Isn’t Messi, but He Was Better for One Night Thanks to the 23-year-old’s two goals, Juventus takes a 3–0 lead into the second leg of their Champions League quarterfinal matchup with Barcelona A lot has changed since Barcelona wrung out a 3–1 victory over Juventus in the 2015 Champions League final. Arturo Vidal, who sailed a late, would-be equalizer over the crossbar is cannonballing around the middle third for Bayern Munich now. Real Madrid reclaimed Álvaro Morata, who headed home the Old Lady’s only goal in that final. Paul Pogba lost the relaxer and went back to Manchester to help them finish somewhere in the vicinity of sixth place. And Paulo Dybala, Pogba’s former bestie who transferred to Juve the summer after the loss to Barça, now has a power level over 9,000 and has started to pop up in those droning discussions over who is and isn’t “world class.” On Tuesday, Juventus beat Barcelona 3–0 in the first leg of the Champions League quarterfinals. That was thanks in part to Giorgio Chiellini being taller and stronger than Javier Mascherano, but mostly, it came down to Dybala, who is really good at soccer, you guys. He might even be world class at it. You could be tempted to say that Juan Cuadrado did most of the work on the first goal, but Dybala’s share was arguably more difficult — or at least would’ve been, if either one of Gerard Piqué and Andrés Iniesta would’ve bothered to close him down. With just two touches, he rearranged his body just so and whipped an opener past the outstretched hand of Barça keeper Marc-André ter Stegen. By dint of being small, shifty, and Argentine, the 23-year-old has drawn comparisons to Lionel Messi. They’re comparisons that Dybala consequently rejects, but can’t possibly hope to avoid. With a second goal (this one a beautifully curled one-timer from just inside the 18-yard box), Dybala capped a brace and upstaged his OG. Still, Messi rules by divine right. There were other, better defining moments in this game, but the most emblematic was an attacking move in the first half that led to nothing. A probing ball trickled through the Juventus defense, just beyond Chiellini’s reach, and found its way to Messi in the 6-yard box. Normally, the outcome would be cut-and-dried — Messi scores because he’s Messi — but target-man turned wing-defender Mario Mandzukic somehow manhandled the Argentine all evening. This time, he strapped Messi into his proverbial booster seat while shepherding the ball over the inline. The better player lost due to a lack of size, conviction, or some combination of both. And so, Barcelona heads back to Camp Nou in frustration for the second leg, facing a towering obstacle to the next round. Where have I heard this one before? ", "child": "1507_1\t1507_2\t1507_3\t1507_4\t1507_5"}