{"name": "1508", "parent": "", "title": "Wow, Tony Romo Looks Weird in a Mavs Uniform", "sentences": [{"e13e": "Wow, Tony Romo Looks Weird in a Mavs Uniform"}, {"5f22": "And yet this is all really fun"}, {"a20f": "Tony Romo might kinda be a Dallas Maverick right now. I’m not quite sure."}, {"c8a5": "What we know is that the Mavs are giving Romo, the recently retired longtime Dallas Cowboys quarterback, a fun send-off at the team’s home finale Tuesday night. Here he is in his new uniform:"}, {"3639": "Romo is an elite athlete. But in an NBA jersey, he looks like a short, doofy dad with tiny arms. Never, ever, ever take pictures of me in a basketball uniform."}, {"fb20": "He played in practice:"}, {"9b06": "Nice jumper! The week has brought about a rash of recollections of Romo’s brief career as a young basketball player. He loved the sport more than football as a kid — “You didn’t need anybody else,” he wistfully told an interviewer while recalling three-hour driveway hoop sessions — and was a high school star. He averaged 24.3 points per game as a senior at Burlington High in Wisconsin and was named all-county alongside future NBA forward Caron Butler. He reportedly drew interest from mid-major colleges during his breakout senior year, but had already decided to play football. It was a risky decision considering he had zero FBS-level scholarships, but I think we can agree it worked out."}, {"b7ab": "He’ll sit on the Dallas bench during tonight’s game, with all parties seemingly in agreement that he won’t play. It was initially reported that the Mavs were going to sign Romo to a “one-day deal.” After all, the Mavs have an open roster spot and are well out of playoff contention. Owner Mark Cuban has joked about using the spot on a “pass-first point guard” (get it? Quarterbacks pass!), although, if we’re being honest, Romo the basketball player seems more like a way-undersized power forward."}, {"f1e5": "If Romo signed a contract with the Mavs, he would be eligible to sneak into the game during garbage time, but it doesn’t appear any sort of document has been tendered. Romo doesn’t come up in the transactions page on the NBA’s website, he’s not listed on the Mavs’ roster, and it seems like the team might not be allowed to mention him as a player — their website awkwardly urges fans to “Come watch #9 take on the Denver Nuggets.”"}, {"be9f": "I believe that’s actually a picture of Nicolas Brussino, the 23-year-old Argentine rookie who actually wears no. 9 for the Mavs. He’s probably going to play about 25 minutes as the Mavs continue to test whether he’s really an NBA player. The surest sign that Romo is not signed to a contract is that he will wear a no. 9 jersey, and so will Brussino, and the referee will not come over and assess the Mavs a technical foul for having two players wearing the number 9."}, {"0cde": "On the one hand, this is all kinda cool. Romo is clearly thrilled by the whole process. He’s long been a fervent, vocal Mavs fan — and also a Duke basketball fan, but we’ll overlook that."}, {"37e4": "But it does feel rather awkward. The end of Romo’s career is tinged by the fact that he’s almost definitely still good enough to be an NFL starting quarterback. His injury-sparked usurpation by Dak Prescott was supposed to be temporary — and then Prescott turned out to be excellent. Romo was a Pro Bowler the last time he was healthy, in 2014, and many urged the Cowboys to start him over Prescott at the end of this season. There were certainly teams interested in him this offseason."}, {"0784": "It’s odd that Romo asked for his release upon retirement — indicating that if he changes his mind someday, he’d like to be free from contractual ties to the Cowboys. (Marshawn Lynch’s reported attempts to return from retirement are complicated by his existing contract with the Seahawks.) It’s also odd — and perhaps related — that Romo’s public farewell to his city isn’t coming with the team he played for. He just gave the closest thing he’s given to a press conference at the Mavs’ facility. It’s possible the Cowboys have a big send-off planned for September, but to date, this is the goodbye Dallas is getting."}, {"e30d": "Romo’s career is a strange one. He was an undrafted free agent and retires as one of the most effective quarterbacks in NFL history. (Fourth all time in career passer rating!) He had a slew of fourth-quarter comebacks and incredible “clutch” stats, but is considered by some to be a choker for high-profile postseason failures. He was an excellent quarterback for the Dallas Cowboys; it appears his last professional sports appearance will be participating in layup lines as the second-most-important no. 9 on the Dallas Mavericks."}], "content": "Wow, Tony Romo Looks Weird in a Mavs Uniform And yet this is all really fun Tony Romo might kinda be a Dallas Maverick right now. I’m not quite sure. What we know is that the Mavs are giving Romo, the recently retired longtime Dallas Cowboys quarterback, a fun send-off at the team’s home finale Tuesday night. Here he is in his new uniform: Romo is an elite athlete. But in an NBA jersey, he looks like a short, doofy dad with tiny arms. Never, ever, ever take pictures of me in a basketball uniform. He played in practice: Nice jumper! The week has brought about a rash of recollections of Romo’s brief career as a young basketball player. He loved the sport more than football as a kid — “You didn’t need anybody else,” he wistfully told an interviewer while recalling three-hour driveway hoop sessions — and was a high school star. He averaged 24.3 points per game as a senior at Burlington High in Wisconsin and was named all-county alongside future NBA forward Caron Butler. He reportedly drew interest from mid-major colleges during his breakout senior year, but had already decided to play football. It was a risky decision considering he had zero FBS-level scholarships, but I think we can agree it worked out. He’ll sit on the Dallas bench during tonight’s game, with all parties seemingly in agreement that he won’t play. It was initially reported that the Mavs were going to sign Romo to a “one-day deal.” After all, the Mavs have an open roster spot and are well out of playoff contention. Owner Mark Cuban has joked about using the spot on a “pass-first point guard” (get it? Quarterbacks pass!), although, if we’re being honest, Romo the basketball player seems more like a way-undersized power forward. If Romo signed a contract with the Mavs, he would be eligible to sneak into the game during garbage time, but it doesn’t appear any sort of document has been tendered. Romo doesn’t come up in the transactions page on the NBA’s website, he’s not listed on the Mavs’ roster, and it seems like the team might not be allowed to mention him as a player — their website awkwardly urges fans to “Come watch #9 take on the Denver Nuggets.” I believe that’s actually a picture of Nicolas Brussino, the 23-year-old Argentine rookie who actually wears no. 9 for the Mavs. He’s probably going to play about 25 minutes as the Mavs continue to test whether he’s really an NBA player. The surest sign that Romo is not signed to a contract is that he will wear a no. 9 jersey, and so will Brussino, and the referee will not come over and assess the Mavs a technical foul for having two players wearing the number 9. On the one hand, this is all kinda cool. Romo is clearly thrilled by the whole process. He’s long been a fervent, vocal Mavs fan — and also a Duke basketball fan, but we’ll overlook that. But it does feel rather awkward. The end of Romo’s career is tinged by the fact that he’s almost definitely still good enough to be an NFL starting quarterback. His injury-sparked usurpation by Dak Prescott was supposed to be temporary — and then Prescott turned out to be excellent. Romo was a Pro Bowler the last time he was healthy, in 2014, and many urged the Cowboys to start him over Prescott at the end of this season. There were certainly teams interested in him this offseason. It’s odd that Romo asked for his release upon retirement — indicating that if he changes his mind someday, he’d like to be free from contractual ties to the Cowboys. (Marshawn Lynch’s reported attempts to return from retirement are complicated by his existing contract with the Seahawks.) It’s also odd — and perhaps related — that Romo’s public farewell to his city isn’t coming with the team he played for. He just gave the closest thing he’s given to a press conference at the Mavs’ facility. It’s possible the Cowboys have a big send-off planned for September, but to date, this is the goodbye Dallas is getting. Romo’s career is a strange one. He was an undrafted free agent and retires as one of the most effective quarterbacks in NFL history. (Fourth all time in career passer rating!) He had a slew of fourth-quarter comebacks and incredible “clutch” stats, but is considered by some to be a choker for high-profile postseason failures. He was an excellent quarterback for the Dallas Cowboys; it appears his last professional sports appearance will be participating in layup lines as the second-most-important no. 9 on the Dallas Mavericks. ", "child": "1508_1\t1508_2\t1508_3\t1508_4\t1508_5\t1508_6\t1508_7"}