{"name": "1545", "parent": "", "title": "Judge rules Dakota Access pipeline company can keep spill risks secret from the public", "sentences": [{"5485": "Judge rules Dakota Access pipeline company can keep spill risks secret from the public"}, {"6ed6": "A federal judge ruled that Energy Transfer Partners can keep some information about the pipeline secret."}, {"96c4": "CREDIT: AP Photo/Nati Harnik, File"}, {"fee3": "Despite concerns that the controversial Dakota Access Pipeline could threaten the primary source of drinking water for the Standing Rock Sioux, a federal judge ruled that the pipeline’s developer can keep some information about spill risks secret from the public."}, {"bd55": "The ruling — which would permit Energy Transfer Partners, the developer of the pipeline, to keep information about spill risks at certain points along the pipeline shielded from the public — comes after unknown protesters used a torch to burn holes in empty above-ground segments of the pipeline. The Standing Rock Sioux and Cheyenne River Sioux tribes had argued that information about spill risks could potentially strengthen their case for more environmental review of the project."}, {"2c52": "U.S. District Judge James Boasberg rejected that argument, saying that shielding the information from public view would prevent vandalism of the pipeline."}, {"99f0": "“The asserted interest in limiting intentionally inflicted harm outweighs the tribes’ generalized interests in public disclosure and scrutiny,” Boasberg said in his ruling."}, {"8d79": "Other information, however, will be available to the public, such as how Energy Transfer Partners plans to handle potential spills."}, {"d004": "‘We haven’t lost…we have awakened’: Indigenous nations march on the White HouseDespite recent setbacks at Standing Rock, Native communities are energized about the future.thinkprogress.org"}, {"e751": "The pipeline’s construction has sparked intense public protest from indigenous, environmental, and social justice groups. Last year, protest camps near the Standing Rock Sioux reservation brought tens of thousands of protesters, including military veterans and activists from other countries. At times, the protests turned violent, with police using non-lethal bullets, dogs, teargas, and water cannons against protesters. As of February, there had been 750 arrests of anti-pipeline protesters, according to the Associated Press."}, {"b98b": "The Obama administration had temporarily halted construction of the pipeline in December, ordering the Army Corps of Engineers to conduct a more thorough environmental study of the risks associated with the pipeline. Of primary concern was the fact that the route of the pipeline was set to cross directly beneath the Missouri River, near the Standing Rock reservation’s primary source of drinking water. Any spill, the tribe argued, could threaten their access to clean water."}, {"4445": "The environmental movement grapples with social justice in the age of TrumpThis year, big environmental stories also had big social justice components. What happens now?thinkprogress.org"}, {"3981": "President Trump swiftly reversed the Obama administration’s pause on the pipeline’s construction, using executive action to demand that the Army Corps of Engineers review and approve the pipeline “in an expedited manner.”"}, {"bf7c": "The Standing Rock Sioux and Cheyenne River Sioux tribes are still currently engaged in litigation against the pipeline, arguing that the Army Corps failed to conduct a thorough enough environmental study of the pipeline. They also argue that the government failed to take tribal concerns into account when approving the pipeline."}, {"9d51": "Pipeline spills in North Dakota are not uncommon — according to analysis from the Center for Biological Diversity, North Dakota has averaged four pipeline spills a year since 1996, costing more than $40 million in property damage."}, {"be8d": "Under the Trump administration’s proposed budget, the Environmental Protection Agency would face sharp cuts in its enforcement programs, limiting its ability to enforce and penalize companies that violate environmental laws. When pipeline operators, for instance, violate laws like the Clean Water Act by spilling pollutants into waterways, the EPA is normally the agency that imposes fines on those operators. Last week, for instance, the EPA and the Department of Justice issued a fine against a pipeline operator in Ohio that violated the Clean Water Act by discharging approximately 1,950 barrels of gasoline from a pipeline into nearby waterways."}], "content": "Judge rules Dakota Access pipeline company can keep spill risks secret from the public A federal judge ruled that Energy Transfer Partners can keep some information about the pipeline secret. CREDIT: AP Photo/Nati Harnik, File Despite concerns that the controversial Dakota Access Pipeline could threaten the primary source of drinking water for the Standing Rock Sioux, a federal judge ruled that the pipeline’s developer can keep some information about spill risks secret from the public. The ruling — which would permit Energy Transfer Partners, the developer of the pipeline, to keep information about spill risks at certain points along the pipeline shielded from the public — comes after unknown protesters used a torch to burn holes in empty above-ground segments of the pipeline. The Standing Rock Sioux and Cheyenne River Sioux tribes had argued that information about spill risks could potentially strengthen their case for more environmental review of the project. U.S. District Judge James Boasberg rejected that argument, saying that shielding the information from public view would prevent vandalism of the pipeline. “The asserted interest in limiting intentionally inflicted harm outweighs the tribes’ generalized interests in public disclosure and scrutiny,” Boasberg said in his ruling. Other information, however, will be available to the public, such as how Energy Transfer Partners plans to handle potential spills. ‘We haven’t lost…we have awakened’: Indigenous nations march on the White HouseDespite recent setbacks at Standing Rock, Native communities are energized about the future.thinkprogress.org The pipeline’s construction has sparked intense public protest from indigenous, environmental, and social justice groups. Last year, protest camps near the Standing Rock Sioux reservation brought tens of thousands of protesters, including military veterans and activists from other countries. At times, the protests turned violent, with police using non-lethal bullets, dogs, teargas, and water cannons against protesters. As of February, there had been 750 arrests of anti-pipeline protesters, according to the Associated Press. The Obama administration had temporarily halted construction of the pipeline in December, ordering the Army Corps of Engineers to conduct a more thorough environmental study of the risks associated with the pipeline. Of primary concern was the fact that the route of the pipeline was set to cross directly beneath the Missouri River, near the Standing Rock reservation’s primary source of drinking water. Any spill, the tribe argued, could threaten their access to clean water. The environmental movement grapples with social justice in the age of TrumpThis year, big environmental stories also had big social justice components. What happens now?thinkprogress.org President Trump swiftly reversed the Obama administration’s pause on the pipeline’s construction, using executive action to demand that the Army Corps of Engineers review and approve the pipeline “in an expedited manner.” The Standing Rock Sioux and Cheyenne River Sioux tribes are still currently engaged in litigation against the pipeline, arguing that the Army Corps failed to conduct a thorough enough environmental study of the pipeline. They also argue that the government failed to take tribal concerns into account when approving the pipeline. Pipeline spills in North Dakota are not uncommon — according to analysis from the Center for Biological Diversity, North Dakota has averaged four pipeline spills a year since 1996, costing more than $40 million in property damage. Under the Trump administration’s proposed budget, the Environmental Protection Agency would face sharp cuts in its enforcement programs, limiting its ability to enforce and penalize companies that violate environmental laws. When pipeline operators, for instance, violate laws like the Clean Water Act by spilling pollutants into waterways, the EPA is normally the agency that imposes fines on those operators. Last week, for instance, the EPA and the Department of Justice issued a fine against a pipeline operator in Ohio that violated the Clean Water Act by discharging approximately 1,950 barrels of gasoline from a pipeline into nearby waterways. ", "child": "1545_1\t1545_2\t1545_3"}