{"name": "1548", "parent": "", "title": "Oklahoma’s drinking water is at risk from fracking, new report finds", "sentences": [{"8087": "Oklahoma’s drinking water is at risk from fracking, new report finds"}, {"41ad": "Several reports have found problems in state implementation of EPA rules to protect water."}, {"1adc": "Jars of brine from Fairmont Brine Processing are on display at the state Capitol in Oklahoma City. CREDIT: AP Photo/Sue Ogrocki"}, {"3aee": "In some parts of the country, people are urged to pray for rain. In Oklahoma, the governor once told people to pray for oil prices."}, {"acd0": "But as oil and gas fracking continue to spread throughout the state, Oklahomans’ concern might be more about the industry’s impact on water supplies and less about the industry’s profits."}, {"3b88": "A report, commissioned by the Clean Water Fund and released Thursday, found there are several oil and gas wastewater wells that could be injecting into drinking water supplies in Oklahoma. In addition, there are private wells whose supply could be overlapping with wastewater disposal wells permitted by the Oklahoma Corporation Commission (OCC)."}, {"e0c6": "“It’s disturbing that the OCC may have permitted oil and gas wells to inject directly into potential drinking water sources, and that the agency can’t accurately point to where the drinking water is located,” John Noël, lead author of the report and national oil and gas campaigns coordinator for Clean Water Action, said in a statement. “That’s fundamental to the OCC’s job — it is the agency that is supposed to protect Oklahomans’ drinking water from the impacts of oil and gas activities. Without proper information, the OCC cannot assure that the state’s many thousands of injection wells have all been permitted safely.”"}, {"2dd0": "In conversation with ThinkProgress, Noël declined to say whether there are specific drinking water reserves that have been contaminated, rather pointing to the fact that OCC’s publicly available data is “wildly flawed,” outdated, and unreliable."}, {"d5b7": "“They are admitting there is flawed data publicly available and that’s what we are basing our analysis on,” Noël said. “How are they able to safely permit oil and gas wells?”"}, {"f216": "The OCC permits wastewater disposal wells for the oil and gas industry under the state’s underground injection control (UIC) program. Oklahoma is one of many states that has taken over UIC administration from the federal Environmental Protection Agency."}, {"e4e5": "An OCC spokesperson denied that there are any wastewater injection wells that are going into drinking water sources."}, {"1a4a": "“The study is based on faulty data that we warned the group about in February when the presented their draft findings and we saw what data they were using,” Matt Skinner told ThinkProgress via email."}, {"def3": "The analysis found that, according to publicly available data, Oklahoma has at least 18 wastewater injection wells that do not go deep enough to avoid known groundwater sources."}, {"6809": "The blue area represents the underground layer of drinking water. Below the red line, the OCC can allow wastewater injection wells. Analysis found that 18 wastewater injection wells are going into the blue region, and thousands of private wells are getting water from within the red area — which is being used for wastewater storage. CREDIT: Clean Water Fund"}, {"01e0": "“We have checked the 18 wells they said were injecting into USDW (underground sources of drinking water),” Skinner told ThinkProgress. “They are not.”"}, {"20a3": "In addition, the analysis found that OCC may be using erroneous data to calculate how deep injection wells need to go to avoid drinking water sources. There are 6,844 domestic water wells and 175 public water supply wells in the state that get their water from below the depth OCC assumes is the cutoff for underground drinking water supplies, the report found."}, {"1b99": "Drinking water wells are not regulated by OCC, they are regulated by the Oklahoma Water Resources Board. A spokesperson for OWRB told ThinkProgress that the agency does not use the same measurements OCC does to regulate domestic water well drilling. He noted that domestic water wells are tested before they are permitted."}, {"2bad": "EPA admits that fracking can contaminate drinking waterGood thing so many people in Trump’s cabinet have ties to the fracking industries.thinkprogress.org"}, {"d4fb": "The report did not look at how close those 6,844 water wells are to wastewater injection wells."}, {"c521": "Noël said that the lack of accurate, publicly available data pointed to a need for OCC to do a comprehensive audit of its injection well program to ensure drinking water is safe."}, {"28c2": "Drinking water is largely protected by the Environmental Protection Agency under the Clean Water Act and the Safe Drinking Water Act, two keystone pieces of environmental legislation. But fracking, a water-intensive oil and gas extraction method, has been exempt from many of the requirements of the two acts. The so-called Halliburton loophole allows fracking companies to keep the chemicals they use — which end up in wastewater disposal wells — secret from the public."}, {"6bc8": "On Thursday, Democratic representatives introduced a suite of bills that would require oil and gas companies to abide by same rules as other industries and to disclose the chemicals they use in fracking, which are known to include benzene, a carcinogen."}, {"b627": "Companies are fracking with harmful chemicals through regulatory loopholethinkprogress.org"}, {"09d9": "Oklahoma is not the only state whose UIC program is under fire."}, {"3d64": "Clean Water Fund issued a similar report for Texas last year, prompting a full review of the UIC program by Texas regulators. Researchers in Texas have already found elevated levels of benzene and arsenic in groundwater near fracking operations."}, {"872c": "Environmental groups in California also found that the state had permitted hundreds of oil and gas extraction or wastewater disposal injection wells in aquifers that should have been protected under the Safe Drinking Water Act. After the permitting mistakes came to light, the state rushed to ask the EPA to issue exemptions for the aquifers."}, {"c1a9": "Under the Trump administration’s proposed budget, the UIC program would be cut by 30 percent."}, {"0e90": "“The declining budget is going to make this problem that much harder to fix,” Noël said."}, {"d8a5": "The science of tracking underground aquifers is still developing. A study out of Stanford University released last summer found that a third of California’s oil and gas wells are drilled in groundwater reservoirs that were previously known. Environmentalists argue that as groundwater resources are increasingly stressed by human consumption and agricultural uses, regulators need to be more vigilant in protecting potential water resources."}, {"5f04": "Frackers spill Olympic pool’s worth of hydrochloric acid in Oklahomathinkprogress.org"}, {"09a0": "Drinking water protection is not the only issue facing the Oklahoma oil and gas industry. In recent years, the state has seen a massive uptick in the frequency and severity of earthquakes, which geologists have confirmed are being triggered by wastewater injections."}, {"5dc5": "Ironically, the day before the report came out, an Oklahoma judge threw out a case against oil and gas developers that was meant to stop the injections. The judge said the OCC was able to adequately oversee the industry."}], "content": "Oklahoma’s drinking water is at risk from fracking, new report finds Several reports have found problems in state implementation of EPA rules to protect water. Jars of brine from Fairmont Brine Processing are on display at the state Capitol in Oklahoma City. CREDIT: AP Photo/Sue Ogrocki In some parts of the country, people are urged to pray for rain. In Oklahoma, the governor once told people to pray for oil prices. But as oil and gas fracking continue to spread throughout the state, Oklahomans’ concern might be more about the industry’s impact on water supplies and less about the industry’s profits. A report, commissioned by the Clean Water Fund and released Thursday, found there are several oil and gas wastewater wells that could be injecting into drinking water supplies in Oklahoma. In addition, there are private wells whose supply could be overlapping with wastewater disposal wells permitted by the Oklahoma Corporation Commission (OCC). “It’s disturbing that the OCC may have permitted oil and gas wells to inject directly into potential drinking water sources, and that the agency can’t accurately point to where the drinking water is located,” John Noël, lead author of the report and national oil and gas campaigns coordinator for Clean Water Action, said in a statement. “That’s fundamental to the OCC’s job — it is the agency that is supposed to protect Oklahomans’ drinking water from the impacts of oil and gas activities. Without proper information, the OCC cannot assure that the state’s many thousands of injection wells have all been permitted safely.” In conversation with ThinkProgress, Noël declined to say whether there are specific drinking water reserves that have been contaminated, rather pointing to the fact that OCC’s publicly available data is “wildly flawed,” outdated, and unreliable. “They are admitting there is flawed data publicly available and that’s what we are basing our analysis on,” Noël said. “How are they able to safely permit oil and gas wells?” The OCC permits wastewater disposal wells for the oil and gas industry under the state’s underground injection control (UIC) program. Oklahoma is one of many states that has taken over UIC administration from the federal Environmental Protection Agency. An OCC spokesperson denied that there are any wastewater injection wells that are going into drinking water sources. “The study is based on faulty data that we warned the group about in February when the presented their draft findings and we saw what data they were using,” Matt Skinner told ThinkProgress via email. The analysis found that, according to publicly available data, Oklahoma has at least 18 wastewater injection wells that do not go deep enough to avoid known groundwater sources. The blue area represents the underground layer of drinking water. Below the red line, the OCC can allow wastewater injection wells. Analysis found that 18 wastewater injection wells are going into the blue region, and thousands of private wells are getting water from within the red area — which is being used for wastewater storage. CREDIT: Clean Water Fund “We have checked the 18 wells they said were injecting into USDW (underground sources of drinking water),” Skinner told ThinkProgress. “They are not.” In addition, the analysis found that OCC may be using erroneous data to calculate how deep injection wells need to go to avoid drinking water sources. There are 6,844 domestic water wells and 175 public water supply wells in the state that get their water from below the depth OCC assumes is the cutoff for underground drinking water supplies, the report found. Drinking water wells are not regulated by OCC, they are regulated by the Oklahoma Water Resources Board. A spokesperson for OWRB told ThinkProgress that the agency does not use the same measurements OCC does to regulate domestic water well drilling. He noted that domestic water wells are tested before they are permitted. EPA admits that fracking can contaminate drinking waterGood thing so many people in Trump’s cabinet have ties to the fracking industries.thinkprogress.org The report did not look at how close those 6,844 water wells are to wastewater injection wells. Noël said that the lack of accurate, publicly available data pointed to a need for OCC to do a comprehensive audit of its injection well program to ensure drinking water is safe. Drinking water is largely protected by the Environmental Protection Agency under the Clean Water Act and the Safe Drinking Water Act, two keystone pieces of environmental legislation. But fracking, a water-intensive oil and gas extraction method, has been exempt from many of the requirements of the two acts. The so-called Halliburton loophole allows fracking companies to keep the chemicals they use — which end up in wastewater disposal wells — secret from the public. On Thursday, Democratic representatives introduced a suite of bills that would require oil and gas companies to abide by same rules as other industries and to disclose the chemicals they use in fracking, which are known to include benzene, a carcinogen. Companies are fracking with harmful chemicals through regulatory loopholethinkprogress.org Oklahoma is not the only state whose UIC program is under fire. Clean Water Fund issued a similar report for Texas last year, prompting a full review of the UIC program by Texas regulators. Researchers in Texas have already found elevated levels of benzene and arsenic in groundwater near fracking operations. Environmental groups in California also found that the state had permitted hundreds of oil and gas extraction or wastewater disposal injection wells in aquifers that should have been protected under the Safe Drinking Water Act. After the permitting mistakes came to light, the state rushed to ask the EPA to issue exemptions for the aquifers. Under the Trump administration’s proposed budget, the UIC program would be cut by 30 percent. “The declining budget is going to make this problem that much harder to fix,” Noël said. The science of tracking underground aquifers is still developing. A study out of Stanford University released last summer found that a third of California’s oil and gas wells are drilled in groundwater reservoirs that were previously known. Environmentalists argue that as groundwater resources are increasingly stressed by human consumption and agricultural uses, regulators need to be more vigilant in protecting potential water resources. Frackers spill Olympic pool’s worth of hydrochloric acid in Oklahomathinkprogress.org Drinking water protection is not the only issue facing the Oklahoma oil and gas industry. In recent years, the state has seen a massive uptick in the frequency and severity of earthquakes, which geologists have confirmed are being triggered by wastewater injections. Ironically, the day before the report came out, an Oklahoma judge threw out a case against oil and gas developers that was meant to stop the injections. The judge said the OCC was able to adequately oversee the industry. ", "child": "1548_1\t1548_2\t1548_3\t1548_4\t1548_5\t1548_6\t1548_7\t1548_8\t1548_9\t1548_10\t1548_11\t1548_12"}