{"name": "1552", "parent": "", "title": "Referandum Sonrası Okunabilecek Bir Referandum Yazısı", "sentences": [{"d670": "Referandum Sonrası Okunabilecek Bir Referandum Yazısı"}, {"c2b0": "Demokrasiyle ilintili kısa kısa düşünceler…"}, {"c13a": "Yalnız İnsanlar"}, {"4b43": "30 saniye. Pasaport kontrolünü geç, zarfı al, damgayı bas, kutuya bırak. Vatandaşlık görevim hepi topu 30 saniyeye sığdı. Belki yılda bir tane de gösteri, bir miting, onlar da “siyasi” isek. Ama TV izlemeye her Allahın günü 4–5 saat harcanıyor. Bu sistemin adına demokrasi değil, televizyonokrasi demek lazımdı."}, {"50f0": "Ve o televizyonlarda, iktidar muhalefete göre tam 10 kat fazla zaman alıyorken , her oyun eşit sayılmasının manasızlığı ortada."}, {"c4e4": "Merkezileşmenin kötü tarafı, demokrasi anlayışını tek bir dev oylamaya indirgemek (yerel sayılan büyükşehir belediye seçimleri bile dev), protestoyu da “anarşi” ile özdeşleştirmek. Hatta anarşi kelimesi bile bozulmuş, normalde bir “yönetim” biçimiyken, “yıkıp dökmek” ile eşanlamlı olmuş."}, {"603b": "Bu iki etken, insanda, kendi hayatı hakkında söz sahibi olduğu sanrısı yaratıyor. Genel seçimler, toplumların gazını almakta savaşlar kadar etkili olabilirler."}, {"ec19": "İdeal sistem nedir bilmiyorum ama ulusal haberlerin gündemimizin hemen hepsini oluşturduğu bir düzen olmasa gerek. Yerelle daha çok haşır neşir olmalı. Tam tersine, etki gücümüz daha fazla olmasına rağmen, bir çok ülkede yerel seçimlere katılım daha düşük. Hele iyice yerelden, mahalle seviyesinden bahsedersek, kimsenin umrunda değil olan biten."}, {"10ac": "Bunları özellikle Türkiye için söylemiyorum. Türkiye’de “yerel” güçsüz. Şimdilerde bu konuda insanların aklına ilk gelen şey Kürt özerkliği oluyor ama o işlerden, HDP’den, BOP’tan, PKK’dan da önce, Türkiye’nin siyasi yapısı aşırı merkeziyetçiydi ve öyle de kaldı."}, {"0606": "Parti başkanı, partinin kongre üyelerini belirleyen, milletvekilleri belirleyen, hükümetin başı olarak bakanları atayan, ihaleleri dağıtan Noel Baba…bunlar hep aynı kişi olabiliyor. AKP’ye kadar tabii. Onlar bu listeye “yargının çoğunun başı” ve “cumhurun başı” maddelerini de ekledi. Referandum geçsin geçmesin."}, {"a842": "Artan tüketimiyle, borçlanmasıyla, sendikasızlaştırmasıyla, bireyi izole eden bir sistem var ve siyasi, idari yapımız bu durumu kötüleştiriyor. Bireyin izolasyonuna çare olacak yereli ondan alıp, ona uzak merkezlerdeki hikayeleri ve liderleri satıyor. Asıl bu yüzden televizyonokrasideyiz."}, {"0112": "Güzel bir yorum üzerine ekleme:"}, {"cc00": "Trump da, Erdoğan da, yerelden nemalandılar bol bol. Trump özelinde bu anti-kürelleşme babındaydı, Erdoğan zaten belediyecilikten gelme. Fakat, bir süre sonra, merkezi bir “üst-hikaye”, her şeyi geride bıraktı: Şanlı bir geçmişin geri gelmesi hikayesi. ABD’de bu “manifest destiny” söylevlerine dönüş olarak gerçekleşti, Türkiye’de ise yeni Osmanlı hayalleri olarak, sürekli büyüyen Türkiye’nin Batı tarafından kıskanılması olarak."}, {"a555": "Soyut Kavramlar ve İlkellik"}, {"461e": "Bence ilkelliğin ölçüsü, kıçına don giymemek veya eski silahlar kullanmak değil, soyut düşünememek olmalı. İlkel bir yaratığın hayatında sadece somut şeyler var: Seks, açlık, hiyerarşi."}, {"93db": "Bunun toplumsal izdüşümü de ekonomi: İlkel bir toplum, ekonomistlerin fazla söz sahibi olduğu bir toplumdur. Her şeyden çok ne yediğinin, ne içtiğinin, ne tükettiğinin hesabıyla ilgilenen, sağlığını GMSH ile ölçen toplumlar bunlar. Elbette ölçmesi kolay olan şeyleri ölçüyoruz, ve onları ölçtükte de sanki onların dışında bir şey yokmuş gibi davranıyoruz. Örneğin neler öğrendiğimizin, doğamızın sağlığının, işe yarama hissimizin hesabını pek tutmuyoruz."}, {"e7ab": "Hemen her toplum ilkel ama bazıları daha ilkel. Özgürlük, demokrasi, adalet gibi kavramları günde 1500 kez duyan ama hayatlarında onları zerre yaşamayan, başkalarında da yaşatmak istemeyen insanlarla dolu toplumlar. Sadece boğazından geçenle ilgilenen, ötesini düşünmeyenler."}, {"f5e8": "Bunları eleştirince, “elit” olmakla, “halden anlamamakla” suçlanmak kaçınılmaz. Halbuki burada ilginç olan şey şu: Bizim Maslow hiyerarşişi de bir garip işliyor!"}, {"b3bb": "Yani ben açlıktan kırılan insanları, bir Thomas Jefferson gibi, bir Voltaire gibi soyut kavramlarla uğraşmadıkları için eleştirmiyorum elbette. Kredi çekip akıllı telefon alan, o telefondan Twitter ile istediğine söverek ifade özgürlüğünü kullanan, Instagram ile istediğinin kıçına bakan, ama telefonu kapatınca sadece kendi boğazından geçen lokmayla ilgilenmeyi seçen o garip insan türünü eleştiriyorum."}, {"e2e3": "İşin komik tarafı, bunları ekonomiye odaklanarak yazarken de değinmiştim, insanlar ceplerini doğrudan etkileyen durumları bile (vergi yükü, işşizlik, hane borçları) görmezden gelebiliyorlar, başta bahsettiğim iyi bir merkezi üst-hikaye uğruna."}, {"a22f": "Bazı Değerleri İçselleştirmenin Bedeli"}, {"1837": "Üstelik, şunu da hep gözardı ederiz: Mülkiyet, söz, seçim, adil yargılanma hakkı gibi, kuvvetler ayrılığı gibi mücadelelere erken giren toplumlar, önce karınlarını doyurup sonra bu meselelere eğilmediler. Bu meselelere eğildikleri için karınlarını doyurabildiler ve onun ötesine geçebildiler."}, {"6c98": "Daha doğrusu, yumurta tavuk misali, ikisi de birbirini besleyen, beraber gelişen şeyler. O toplumlar bu mücadeleleri 200–300 sene boyunca aralıksız verdiler, öyle tek bir devrimle olup biten bir iş değil. İngiltere özelinde mesela, modern anlamıyla demokrasi olmasa da, en azından kuvvetler ayrılığı mücadelesi, 1000 senelik Magna Carta’ya uzanıyor."}, {"24b0": "Biz bu bedelleri ödemedik. Ödedik de, yeterince ödemedik. O değerleri, nesiller boyunca iki ileri bir geri giden bir süreçte içselleştiremedik, Batı’da olduğu gibi. “Onlar bu işi kotardılar, kusursuz yapıyorlar” filan demiyorum elbette, ama düştükleri çelişkilerin bir limiti var, bir asgari zemin var."}, {"4497": "Bu zemine şöyle de bakılabilir: Türkiye’de, kendi cenahına yaradığı sürece, her tülü medya baskısına, yalana, hırsızlığa, vs tolere edebilecek kesim, atıyorum %60'tır, ama başkasında bu kesim %10'dur."}, {"5fb3": "Adaletsiz uygulamaların adalet nidalarıyla, baskıcı uygulamaların özgürlük nidalarıyla destek bulmasına, daha geçen gün referandum sloganları üzerinden değinmiştim. Buradaki tek çelişki, sloganlarla, teklif edilen uygulamalar arasındaki çelişki değil. Referandum sürecinin kendisi de ayrıyeten adaletsiz. “Duble Orwellian” bir durum var ortada."}, {"2ad1": "Bu çelişkilerin varlığı ve Batı’nın kültürel baskınlığı yüzünden herkesin lügatına giren bu soyut kavramları, her ideolojiden siyasetçinin her daim kullanıyor olması, o kavramların toplumda ne kadar karşılıksız kaldıklarına birer işaret bence. Taş çatlasa %10'luk bir kesimin içselleştirdiği, kalanı için içi boş kalıplar."}, {"389d": "Kararsızlık Paradoksu"}, {"68e4": "Zarfı atmadan hemen önce manalı manalı “hayırlı olsun” dedim, sonra da belli belirsiz kasılarak etrafıma bakındım ama fıs. Kimse umursamadı. Beni duyan görevliler de galiba gözlerini devirdiler, ne de olsa aynı sahneyi sabahtan beri elli kere görmüşlerdir. Yaptığımı farkedince bir gülme geldi zaten, o şekilde son dakikada kimi ikna edeceksem artık…"}, {"44d4": "Burada da bu tiyatroya lüzum yok. Zaten bunu okuyanların çoğu hayırcıdır, evetçi azınlığın da yeterince sağlam nedenleri vardır. Ve -bunu Pazar sabahı ekliyorum- bence referandum da geçecek, bunu bilerek oy attım."}, {"2900": "Ama kararsızlar asıl muamma. Hani “bunları düşünecek zamanları yok” denilebilir ama üçte ikisi ev kadını, emekli, öğrenci, işşiz imiş. Benim başka bir teorim var:"}, {"8f8d": "Normalde birbirine benzer iki seçenek arasında kararsız kalınacağını varsayıyoruz. İki güzel renk arasında, fiyatı birbirine yakın iki ürün arasında, vs. Halbuki, seçenekler arasındaki fark aşırı biçimde açıldığı zaman da kararsızlık artıyor. Hele ki esas parametre fiyat yerine güven gibi bir şeyse, bu paradoks daha da bariz: Seçenekler o kadar farklı ki, iddialar o kadar çelişkili ki, birinin yalan söylüyor olması lazım. En son kimi dinlemişsem o daha güvenilir geliyor, deli bir sarkaç gibi sallanıp duruyorum, bu bir kaç kez tekrarlanınca da iyice kararsızlaşıyorum."}, {"bb22": "Şunu unutmamak lazım: İkilemlerimizin büyük kısmı yalancı ikilemler (false dilemma). Birbirlerini kötüleyen iki araba satıcısının da malı kötü olabilir. Aynı derecede kötü veya yalan olmak zorunda değiller elbette (false equivalency), ama üçüncü bir seçenek çoğu zaman vardır."}, {"e5ae": "Referandumda ise bu yok. Zaten en çok da bu yüzden, bu kadar önemli konularda karar vermek için kullanılmamalı (hele ki bizim yaptığımız “torba referandumu” en kötüsü). Fakat bu durumda bile, yukardaki etkiyi farketmek, sarkacın hızını kendiliğinden düşürecektir. Yani güvene bağlı olmayan, kişisel özelliklerden etkilenmeyen, daha objektif kısımlara odaklanarak karar vermek mümkün olur."}, {"359a": "“Teorim bu” dedim ama siz de kararsızsanız ve başka bir nedeni varsa, yorum yapın, aydınlanayım. (Kararsızlıktan bahsediyorum, boykottan değil, bu referandumdan medet ummaktan da değil)"}, {"b970": "Canınız Sıkılsın"}, {"2764": "Geçen gün bir fularsız yoldaş sormuş “niye bunlara kafa yoruyorsun, canın sıkılmıyor mu” diye. Sıkılıyor tabii. Ama o kadarcık da sıkılsın. (Zaten benim “can sıkıntım” da bir şey değil. Kamp alanından yazıyorum. Zorunluluktan değil, zevk için dışarda yatmaktan daha büyük bir lüks var mı?)."}, {"2651": "Hayatın her alanında rahata fazla alışığız. Hem rahat olalım, hem yeterince özgür olalım, hem güvende olalım, hem de bunlar için çok uğraşmayalım, işte en fazla 2–3 siyasi parti takip edip, 2–3 yılda bir oy kullanalım, “sistem” bir şekilde halletsin. Bu lükse çok az toplum sahip, onlar da bu kavgaları önceden çok vermiş olduklarından."}, {"eb76": "Bu kavgalardan birini dinliyorum şimdi, daha önce bahsettiğim Revolutions podcastinde. 1830 Temmuz devrimi. Çok daha kanlı dönemler ve coğrafyalar var elbette, ama Napolyon sonrası tahta geri dönen ve kısa süre içinde hayatı 1789 öncesine çevirmeye çalışan bir hanedan günümüzle daha alakalı. Niye daha alakalı?"}, {"25c8": "Napolyon’un kaybettiği savaşlardan sonra iyice fakirleşmiş bir halk varken, kralın o elde kalan üç kuruşu da, aristokratlara ve kiliseye vermeye çalışması…"}, {"0ae6": "Meclisteki vekil sayısının artması ve yeni gelen vekillerin, garip düzenlemelerle, büyük toprak sahipleri arasından çıkmaları, yani ayrıcalıklı olanların daha da ayrıcalık sahibi olmaları…"}, {"ccc9": "Kralın, yakın giden seçimi kazanmak için, milliyetçi duyguları depreştirmeye çalışmasıyla girişilen Cezayir seferi ve 150 yıllık bir sömürgenin başlangıcı…"}, {"5c5e": "Yine de kaybettiği seçimi kısa bir sürede feshetmesi, liberal vekillere yasaklar getirmesi, basın özgürlüğünü susturması…"}, {"3247": "Ve hemen ertesi gün başlayan, içinde bulunan kimsenin tam boyutunu göremediği bir ayaklanma. Matbaalara kendilerini kilitleyen gazeteciler, yanlış şeyi söylediği için servetlerini kaybedenler, mahallelerini savunmak için barikatlar kuran ve “barikat” kavramını kültürümüze sokanlar…"}, {"714a": "Kanla alınmış hakların, “kralım sen çok yaşa” nidalarıyla geri verilebileceğine, sonra da tekrar kanla alınmaları gerektiğine güzel bir örnek tüm bunlar. Ama daha önemlisi, bu yolda başarılı olmanın garanti olmadığını da gösteriyorlar. Temmuz Devriminin sonunda, bir kral gitti, bir diğeri geldi. Hanedanın ana kolu gitti, yan kolu geldi. 1789'a, yani Terör öncesi yaşanan o kısa süreli idealizme dönmedi Fransa."}, {"dd00": "Tarih öğrenmek, tarihin geriye doğru da işleyebildiğini gösterdiği için önemli. Muhtemelen, birkaç saat içinde bunun uygulamalı bir örneğine de tanık olacağız."}, {"c5b0": "Bu yazının aslı Fularsız Entellik’te."}, {"6344": "Email listesine üye olun, benzer içerikler doğrudan ayağınıza gelsin."}, {"2c1d": "Bağış yapın çok sevdiyseniz. Zira site de, email listesi de ebediyen reklamsız."}], "content": "Referandum Sonrası Okunabilecek Bir Referandum Yazısı Demokrasiyle ilintili kısa kısa düşünceler… Yalnız İnsanlar 30 saniye. Pasaport kontrolünü geç, zarfı al, damgayı bas, kutuya bırak. Vatandaşlık görevim hepi topu 30 saniyeye sığdı. Belki yılda bir tane de gösteri, bir miting, onlar da “siyasi” isek. Ama TV izlemeye her Allahın günü 4–5 saat harcanıyor. Bu sistemin adına demokrasi değil, televizyonokrasi demek lazımdı. Ve o televizyonlarda, iktidar muhalefete göre tam 10 kat fazla zaman alıyorken , her oyun eşit sayılmasının manasızlığı ortada. Merkezileşmenin kötü tarafı, demokrasi anlayışını tek bir dev oylamaya indirgemek (yerel sayılan büyükşehir belediye seçimleri bile dev), protestoyu da “anarşi” ile özdeşleştirmek. Hatta anarşi kelimesi bile bozulmuş, normalde bir “yönetim” biçimiyken, “yıkıp dökmek” ile eşanlamlı olmuş. Bu iki etken, insanda, kendi hayatı hakkında söz sahibi olduğu sanrısı yaratıyor. Genel seçimler, toplumların gazını almakta savaşlar kadar etkili olabilirler. İdeal sistem nedir bilmiyorum ama ulusal haberlerin gündemimizin hemen hepsini oluşturduğu bir düzen olmasa gerek. Yerelle daha çok haşır neşir olmalı. Tam tersine, etki gücümüz daha fazla olmasına rağmen, bir çok ülkede yerel seçimlere katılım daha düşük. Hele iyice yerelden, mahalle seviyesinden bahsedersek, kimsenin umrunda değil olan biten. Bunları özellikle Türkiye için söylemiyorum. Türkiye’de “yerel” güçsüz. Şimdilerde bu konuda insanların aklına ilk gelen şey Kürt özerkliği oluyor ama o işlerden, HDP’den, BOP’tan, PKK’dan da önce, Türkiye’nin siyasi yapısı aşırı merkeziyetçiydi ve öyle de kaldı. Parti başkanı, partinin kongre üyelerini belirleyen, milletvekilleri belirleyen, hükümetin başı olarak bakanları atayan, ihaleleri dağıtan Noel Baba…bunlar hep aynı kişi olabiliyor. AKP’ye kadar tabii. Onlar bu listeye “yargının çoğunun başı” ve “cumhurun başı” maddelerini de ekledi. Referandum geçsin geçmesin. Artan tüketimiyle, borçlanmasıyla, sendikasızlaştırmasıyla, bireyi izole eden bir sistem var ve siyasi, idari yapımız bu durumu kötüleştiriyor. Bireyin izolasyonuna çare olacak yereli ondan alıp, ona uzak merkezlerdeki hikayeleri ve liderleri satıyor. Asıl bu yüzden televizyonokrasideyiz. Güzel bir yorum üzerine ekleme: Trump da, Erdoğan da, yerelden nemalandılar bol bol. Trump özelinde bu anti-kürelleşme babındaydı, Erdoğan zaten belediyecilikten gelme. Fakat, bir süre sonra, merkezi bir “üst-hikaye”, her şeyi geride bıraktı: Şanlı bir geçmişin geri gelmesi hikayesi. ABD’de bu “manifest destiny” söylevlerine dönüş olarak gerçekleşti, Türkiye’de ise yeni Osmanlı hayalleri olarak, sürekli büyüyen Türkiye’nin Batı tarafından kıskanılması olarak. Soyut Kavramlar ve İlkellik Bence ilkelliğin ölçüsü, kıçına don giymemek veya eski silahlar kullanmak değil, soyut düşünememek olmalı. İlkel bir yaratığın hayatında sadece somut şeyler var: Seks, açlık, hiyerarşi. Bunun toplumsal izdüşümü de ekonomi: İlkel bir toplum, ekonomistlerin fazla söz sahibi olduğu bir toplumdur. Her şeyden çok ne yediğinin, ne içtiğinin, ne tükettiğinin hesabıyla ilgilenen, sağlığını GMSH ile ölçen toplumlar bunlar. Elbette ölçmesi kolay olan şeyleri ölçüyoruz, ve onları ölçtükte de sanki onların dışında bir şey yokmuş gibi davranıyoruz. Örneğin neler öğrendiğimizin, doğamızın sağlığının, işe yarama hissimizin hesabını pek tutmuyoruz. Hemen her toplum ilkel ama bazıları daha ilkel. Özgürlük, demokrasi, adalet gibi kavramları günde 1500 kez duyan ama hayatlarında onları zerre yaşamayan, başkalarında da yaşatmak istemeyen insanlarla dolu toplumlar. Sadece boğazından geçenle ilgilenen, ötesini düşünmeyenler. Bunları eleştirince, “elit” olmakla, “halden anlamamakla” suçlanmak kaçınılmaz. Halbuki burada ilginç olan şey şu: Bizim Maslow hiyerarşişi de bir garip işliyor! Yani ben açlıktan kırılan insanları, bir Thomas Jefferson gibi, bir Voltaire gibi soyut kavramlarla uğraşmadıkları için eleştirmiyorum elbette. Kredi çekip akıllı telefon alan, o telefondan Twitter ile istediğine söverek ifade özgürlüğünü kullanan, Instagram ile istediğinin kıçına bakan, ama telefonu kapatınca sadece kendi boğazından geçen lokmayla ilgilenmeyi seçen o garip insan türünü eleştiriyorum. İşin komik tarafı, bunları ekonomiye odaklanarak yazarken de değinmiştim, insanlar ceplerini doğrudan etkileyen durumları bile (vergi yükü, işşizlik, hane borçları) görmezden gelebiliyorlar, başta bahsettiğim iyi bir merkezi üst-hikaye uğruna. Bazı Değerleri İçselleştirmenin Bedeli Üstelik, şunu da hep gözardı ederiz: Mülkiyet, söz, seçim, adil yargılanma hakkı gibi, kuvvetler ayrılığı gibi mücadelelere erken giren toplumlar, önce karınlarını doyurup sonra bu meselelere eğilmediler. Bu meselelere eğildikleri için karınlarını doyurabildiler ve onun ötesine geçebildiler. Daha doğrusu, yumurta tavuk misali, ikisi de birbirini besleyen, beraber gelişen şeyler. O toplumlar bu mücadeleleri 200–300 sene boyunca aralıksız verdiler, öyle tek bir devrimle olup biten bir iş değil. İngiltere özelinde mesela, modern anlamıyla demokrasi olmasa da, en azından kuvvetler ayrılığı mücadelesi, 1000 senelik Magna Carta’ya uzanıyor. Biz bu bedelleri ödemedik. Ödedik de, yeterince ödemedik. O değerleri, nesiller boyunca iki ileri bir geri giden bir süreçte içselleştiremedik, Batı’da olduğu gibi. “Onlar bu işi kotardılar, kusursuz yapıyorlar” filan demiyorum elbette, ama düştükleri çelişkilerin bir limiti var, bir asgari zemin var. Bu zemine şöyle de bakılabilir: Türkiye’de, kendi cenahına yaradığı sürece, her tülü medya baskısına, yalana, hırsızlığa, vs tolere edebilecek kesim, atıyorum %60'tır, ama başkasında bu kesim %10'dur. Adaletsiz uygulamaların adalet nidalarıyla, baskıcı uygulamaların özgürlük nidalarıyla destek bulmasına, daha geçen gün referandum sloganları üzerinden değinmiştim. Buradaki tek çelişki, sloganlarla, teklif edilen uygulamalar arasındaki çelişki değil. Referandum sürecinin kendisi de ayrıyeten adaletsiz. “Duble Orwellian” bir durum var ortada. Bu çelişkilerin varlığı ve Batı’nın kültürel baskınlığı yüzünden herkesin lügatına giren bu soyut kavramları, her ideolojiden siyasetçinin her daim kullanıyor olması, o kavramların toplumda ne kadar karşılıksız kaldıklarına birer işaret bence. Taş çatlasa %10'luk bir kesimin içselleştirdiği, kalanı için içi boş kalıplar. Kararsızlık Paradoksu Zarfı atmadan hemen önce manalı manalı “hayırlı olsun” dedim, sonra da belli belirsiz kasılarak etrafıma bakındım ama fıs. Kimse umursamadı. Beni duyan görevliler de galiba gözlerini devirdiler, ne de olsa aynı sahneyi sabahtan beri elli kere görmüşlerdir. Yaptığımı farkedince bir gülme geldi zaten, o şekilde son dakikada kimi ikna edeceksem artık… Burada da bu tiyatroya lüzum yok. Zaten bunu okuyanların çoğu hayırcıdır, evetçi azınlığın da yeterince sağlam nedenleri vardır. Ve -bunu Pazar sabahı ekliyorum- bence referandum da geçecek, bunu bilerek oy attım. Ama kararsızlar asıl muamma. Hani “bunları düşünecek zamanları yok” denilebilir ama üçte ikisi ev kadını, emekli, öğrenci, işşiz imiş. Benim başka bir teorim var: Normalde birbirine benzer iki seçenek arasında kararsız kalınacağını varsayıyoruz. İki güzel renk arasında, fiyatı birbirine yakın iki ürün arasında, vs. Halbuki, seçenekler arasındaki fark aşırı biçimde açıldığı zaman da kararsızlık artıyor. Hele ki esas parametre fiyat yerine güven gibi bir şeyse, bu paradoks daha da bariz: Seçenekler o kadar farklı ki, iddialar o kadar çelişkili ki, birinin yalan söylüyor olması lazım. En son kimi dinlemişsem o daha güvenilir geliyor, deli bir sarkaç gibi sallanıp duruyorum, bu bir kaç kez tekrarlanınca da iyice kararsızlaşıyorum. Şunu unutmamak lazım: İkilemlerimizin büyük kısmı yalancı ikilemler (false dilemma). Birbirlerini kötüleyen iki araba satıcısının da malı kötü olabilir. Aynı derecede kötü veya yalan olmak zorunda değiller elbette (false equivalency), ama üçüncü bir seçenek çoğu zaman vardır. Referandumda ise bu yok. Zaten en çok da bu yüzden, bu kadar önemli konularda karar vermek için kullanılmamalı (hele ki bizim yaptığımız “torba referandumu” en kötüsü). Fakat bu durumda bile, yukardaki etkiyi farketmek, sarkacın hızını kendiliğinden düşürecektir. Yani güvene bağlı olmayan, kişisel özelliklerden etkilenmeyen, daha objektif kısımlara odaklanarak karar vermek mümkün olur. “Teorim bu” dedim ama siz de kararsızsanız ve başka bir nedeni varsa, yorum yapın, aydınlanayım. (Kararsızlıktan bahsediyorum, boykottan değil, bu referandumdan medet ummaktan da değil) Canınız Sıkılsın Geçen gün bir fularsız yoldaş sormuş “niye bunlara kafa yoruyorsun, canın sıkılmıyor mu” diye. Sıkılıyor tabii. Ama o kadarcık da sıkılsın. (Zaten benim “can sıkıntım” da bir şey değil. Kamp alanından yazıyorum. Zorunluluktan değil, zevk için dışarda yatmaktan daha büyük bir lüks var mı?). Hayatın her alanında rahata fazla alışığız. Hem rahat olalım, hem yeterince özgür olalım, hem güvende olalım, hem de bunlar için çok uğraşmayalım, işte en fazla 2–3 siyasi parti takip edip, 2–3 yılda bir oy kullanalım, “sistem” bir şekilde halletsin. Bu lükse çok az toplum sahip, onlar da bu kavgaları önceden çok vermiş olduklarından. Bu kavgalardan birini dinliyorum şimdi, daha önce bahsettiğim Revolutions podcastinde. 1830 Temmuz devrimi. Çok daha kanlı dönemler ve coğrafyalar var elbette, ama Napolyon sonrası tahta geri dönen ve kısa süre içinde hayatı 1789 öncesine çevirmeye çalışan bir hanedan günümüzle daha alakalı. Niye daha alakalı? Napolyon’un kaybettiği savaşlardan sonra iyice fakirleşmiş bir halk varken, kralın o elde kalan üç kuruşu da, aristokratlara ve kiliseye vermeye çalışması… Meclisteki vekil sayısının artması ve yeni gelen vekillerin, garip düzenlemelerle, büyük toprak sahipleri arasından çıkmaları, yani ayrıcalıklı olanların daha da ayrıcalık sahibi olmaları… Kralın, yakın giden seçimi kazanmak için, milliyetçi duyguları depreştirmeye çalışmasıyla girişilen Cezayir seferi ve 150 yıllık bir sömürgenin başlangıcı… Yine de kaybettiği seçimi kısa bir sürede feshetmesi, liberal vekillere yasaklar getirmesi, basın özgürlüğünü susturması… Ve hemen ertesi gün başlayan, içinde bulunan kimsenin tam boyutunu göremediği bir ayaklanma. Matbaalara kendilerini kilitleyen gazeteciler, yanlış şeyi söylediği için servetlerini kaybedenler, mahallelerini savunmak için barikatlar kuran ve “barikat” kavramını kültürümüze sokanlar… Kanla alınmış hakların, “kralım sen çok yaşa” nidalarıyla geri verilebileceğine, sonra da tekrar kanla alınmaları gerektiğine güzel bir örnek tüm bunlar. Ama daha önemlisi, bu yolda başarılı olmanın garanti olmadığını da gösteriyorlar. Temmuz Devriminin sonunda, bir kral gitti, bir diğeri geldi. Hanedanın ana kolu gitti, yan kolu geldi. 1789'a, yani Terör öncesi yaşanan o kısa süreli idealizme dönmedi Fransa. Tarih öğrenmek, tarihin geriye doğru da işleyebildiğini gösterdiği için önemli. Muhtemelen, birkaç saat içinde bunun uygulamalı bir örneğine de tanık olacağız. Bu yazının aslı Fularsız Entellik’te. Email listesine üye olun, benzer içerikler doğrudan ayağınıza gelsin. Bağış yapın çok sevdiyseniz. Zira site de, email listesi de ebediyen reklamsız. ", "child": "1552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_21552_1\t1552_2"}