{"name": "1557", "parent": "", "title": "If Turkeys Could Talk", "sentences": [{"34bc": "If Turkeys Could Talk"}, {"a351": "If turkeys could talk, what do you imagine they’d say? “Have you ever had deep fried pigeon?” they might ask, suggestively."}, {"0ac5": "Or maybe they’d explain the finer points of surviving in the wild as a turkey and ask, why, as a species, we’re so damn aesthetically biased being more likely to eat the less attractive animals (but not too ugly, mind you) before the cute ones."}, {"aca7": "I’m certain the scholarly genus Meleagris would enlighten us with the opinion of Benjamin Franklin regarding the respectability of her species as the national bird over that of the Bald Eagle, which Franklin claimed in a letter to his daughter, did not come by its living honestly, but was rather lazy in preferring to steal fish from other more industrious birds. Whereas, the Turkey is a true native of America and besides being a little “vain and silly” he is a bird of courage and industry."}, {"d40e": "She might also tell you of the prize her feathers became to the original people of the Americas, finding their way into the headdresses and regal cloaks of the Catawba, Muscogee Creek, Wampanoag chiefs. And he would remind you he is one of the Navajo Tribe’s sacred birds."}, {"de5f": "She might tell you, in a rather conspiratorial whipser-gobble that when the group of males comes a-courting, she perfers the drummers to the spitters, but typically turkeys are not prone to gossip."}, {"5950": "But most importantly, on holidays like Thanksgiving, I rather think Tom Turkey would wisely keep it simple and say, “Be grateful. It could be worse, you could be a turkey.”"}, {"78df": "S Lynn Knight, 2016"}], "content": "If Turkeys Could Talk If turkeys could talk, what do you imagine they’d say? “Have you ever had deep fried pigeon?” they might ask, suggestively. Or maybe they’d explain the finer points of surviving in the wild as a turkey and ask, why, as a species, we’re so damn aesthetically biased being more likely to eat the less attractive animals (but not too ugly, mind you) before the cute ones. I’m certain the scholarly genus Meleagris would enlighten us with the opinion of Benjamin Franklin regarding the respectability of her species as the national bird over that of the Bald Eagle, which Franklin claimed in a letter to his daughter, did not come by its living honestly, but was rather lazy in preferring to steal fish from other more industrious birds. Whereas, the Turkey is a true native of America and besides being a little “vain and silly” he is a bird of courage and industry. She might also tell you of the prize her feathers became to the original people of the Americas, finding their way into the headdresses and regal cloaks of the Catawba, Muscogee Creek, Wampanoag chiefs. And he would remind you he is one of the Navajo Tribe’s sacred birds. She might tell you, in a rather conspiratorial whipser-gobble that when the group of males comes a-courting, she perfers the drummers to the spitters, but typically turkeys are not prone to gossip. But most importantly, on holidays like Thanksgiving, I rather think Tom Turkey would wisely keep it simple and say, “Be grateful. It could be worse, you could be a turkey.” S Lynn Knight, 2016 ", "child": "1557_1\t1557_2\t1557_3\t1557_4\t1557_5\t1557_6\t1557_7\t1557_8\t1557_9\t1557_10\t1557_11\t1557_12\t1557_131557_1\t1557_2\t1557_3\t1557_4\t1557_5\t1557_6\t1557_7\t1557_8\t1557_9\t1557_10\t1557_11\t1557_12\t1557_13"}