{"name": "1558", "parent": "", "title": "What I Have Learned in Istanbul", "sentences": [{"9e96": "What I Have Learned in Istanbul"}, {"b2fd": "I have learned a lot in Istanbul:"}, {"e73f": "1) If I had any employees in the future, or had someone do a job for me in my home, I would pay them on time. Paying people for work they do two weeks late (even a day late unless pay day falls on a Saturday or Sunday) is unacceptable. I have met many people who have never been paid their last salaries (even one person who still hasn’t been paid for four years). What is the point of this? Consistently doing this, while expecting employees to do their best job is highly inconsiderate."}, {"e976": "2) I would say whatever needs to be said. I may be quiet but when I don’t say anything, it means that I really don’t have anything to say. I don’t hide what must be said unless it isn’t useful. I meet too many people who hide their true feelings while I think things are just fine. I meet too many people who expect me to read their minds when I don’t know them well enough to know what they are thinking and feeling (even when I know a person rather well, I still need the person to tactfully tell me what may be wrong or what may need to be improved or what needs to be done). I tend to be polite about anything I would like to express. I speak in a matter-in-fact tone. There was a joke told to me that Turkish people didn’t communicate, that it just wasn’t something they did. I just think we need to do the best of our ability to straighten anything out whatever it takes and this includes having to say something even when this might defy tradition, cultural practice. Sometimes communicating when it’s not the norm is necessary in order to smooth out relations. We need to use all of our means necessary to make sure everyone understands each other."}, {"f613": "3) I will always make room for people to walk on the sidewalk. I find that people in Istanbul are always so fixated on themselves that they don’t acknowledge that the sidewalk is a public space and that they aren’t the only ones walking on it."}, {"f9dd": "4) After knowing someone for a few weeks (sometimes it takes just a few days), that’s when I am open to trusting the person. I think well of people to begin with. Trust is another thing and I am willing to trust someone after careful examination of what I know of someone’s character. There’s a lack of trust and due to this there’s a lack of willingness to help."}, {"c5c8": "5) I would be more fully aware and more organized. It’s tiring when I ask a question and I get “I don’t know” and I request that I speak to someone who could answer my question and then be told “I have just answered your question. I said ‘I don’t know’. ‘I don’t know’ isn’t an answer to a question regarding where a manager is, what a student wants to learn, whether an appointment is cancelled, when I should come in, when I can expect to get my money, and other business and work-related questions. I have encountered too many people who think ‘I don’t know’ is actually an answer to a question (or maybe they just don’t care or don’t want to answer? But they have actually spoken in a tone which leads me to think that they believe ‘I don’t know’ is a legitimately professional answer.)."}, {"1ec8": "6) I will allow good people to stay in my apartment for as long as they need to. Most of the local people in Istanbul close themselves off from foreigners (including Turkish people they don’t know particularly if they aren’t from where they are). I don’t want to limit myself this way. Hospitality is nearly nonexistent in Istanbul (regardless of what travel guides say about the locals being known for being hospitable). Due to the political atmosphere and people not being happy with life in general, there’s not really an inclination to be hospitable towards anyone foreign (as the government currently increases its hostile attitude towards foreigners). There’s more of an inclination to stay away. It’s a sad situation. It’s not a nice feeling to hold onto that having any contact with a foreigner can somehow lead to danger at the hands of the government. It’s a poor government for exercising an avoidance of foreigners and a poor mentality of the locals to follow what the government preaches out of fear (of course, there are most of those who follow out of loyalty). I like to think that as long as I know that I am doing the right thing then it’s worth accommodating a good person."}, {"9cdc": "7) If I ever have enough resources to give to needy people, then I will be generous. There’s no reason to expect anything back when you have enough to give. This is what I feel is right. I meet too many people who have given me something and complain that I haven’t given enough back. Then why give? I believe in giving with the heart as long as i am not being taken advantage of. I will never tell someone that they haven’t given me enough back when I know the person has lost their job or doesn’t make much."}, {"2d38": "8) I haven’t confronted as many heartless and genuinely bad and broken people anywhere else as I have had in Istanbul. Living in China for two years was hard and while I met the worst people ever in China, I also met some of the best people I have ever met and will always remember. I haven’t met anyone with a purely good heart in Istanbul. While I haven’t met the worst individuals in Istanbul, I haven’t met any of the kindest people I know; to be fair, in all of my three years in Istanbul, the people I can consider kind are rare. What I am saying is, I will never treat anyone the way that virtually almost every Turkish person I have met has treated me."}, {"eeaf": "These instances surely happen everywhere but I only state that I have learned these lessons in Istanbul in particular. Istanbul has made more of an impression of the above than anywhere else I have lived. The influence that Istanbul has on me is strong; it has affected me more than any other place due to how I have been treated. This, I say that I have learned a lot of lessons here, more so than elsewhere."}], "content": "What I Have Learned in Istanbul I have learned a lot in Istanbul: 1) If I had any employees in the future, or had someone do a job for me in my home, I would pay them on time. Paying people for work they do two weeks late (even a day late unless pay day falls on a Saturday or Sunday) is unacceptable. I have met many people who have never been paid their last salaries (even one person who still hasn’t been paid for four years). What is the point of this? Consistently doing this, while expecting employees to do their best job is highly inconsiderate. 2) I would say whatever needs to be said. I may be quiet but when I don’t say anything, it means that I really don’t have anything to say. I don’t hide what must be said unless it isn’t useful. I meet too many people who hide their true feelings while I think things are just fine. I meet too many people who expect me to read their minds when I don’t know them well enough to know what they are thinking and feeling (even when I know a person rather well, I still need the person to tactfully tell me what may be wrong or what may need to be improved or what needs to be done). I tend to be polite about anything I would like to express. I speak in a matter-in-fact tone. There was a joke told to me that Turkish people didn’t communicate, that it just wasn’t something they did. I just think we need to do the best of our ability to straighten anything out whatever it takes and this includes having to say something even when this might defy tradition, cultural practice. Sometimes communicating when it’s not the norm is necessary in order to smooth out relations. We need to use all of our means necessary to make sure everyone understands each other. 3) I will always make room for people to walk on the sidewalk. I find that people in Istanbul are always so fixated on themselves that they don’t acknowledge that the sidewalk is a public space and that they aren’t the only ones walking on it. 4) After knowing someone for a few weeks (sometimes it takes just a few days), that’s when I am open to trusting the person. I think well of people to begin with. Trust is another thing and I am willing to trust someone after careful examination of what I know of someone’s character. There’s a lack of trust and due to this there’s a lack of willingness to help. 5) I would be more fully aware and more organized. It’s tiring when I ask a question and I get “I don’t know” and I request that I speak to someone who could answer my question and then be told “I have just answered your question. I said ‘I don’t know’. ‘I don’t know’ isn’t an answer to a question regarding where a manager is, what a student wants to learn, whether an appointment is cancelled, when I should come in, when I can expect to get my money, and other business and work-related questions. I have encountered too many people who think ‘I don’t know’ is actually an answer to a question (or maybe they just don’t care or don’t want to answer? But they have actually spoken in a tone which leads me to think that they believe ‘I don’t know’ is a legitimately professional answer.). 6) I will allow good people to stay in my apartment for as long as they need to. Most of the local people in Istanbul close themselves off from foreigners (including Turkish people they don’t know particularly if they aren’t from where they are). I don’t want to limit myself this way. Hospitality is nearly nonexistent in Istanbul (regardless of what travel guides say about the locals being known for being hospitable). Due to the political atmosphere and people not being happy with life in general, there’s not really an inclination to be hospitable towards anyone foreign (as the government currently increases its hostile attitude towards foreigners). There’s more of an inclination to stay away. It’s a sad situation. It’s not a nice feeling to hold onto that having any contact with a foreigner can somehow lead to danger at the hands of the government. It’s a poor government for exercising an avoidance of foreigners and a poor mentality of the locals to follow what the government preaches out of fear (of course, there are most of those who follow out of loyalty). I like to think that as long as I know that I am doing the right thing then it’s worth accommodating a good person. 7) If I ever have enough resources to give to needy people, then I will be generous. There’s no reason to expect anything back when you have enough to give. This is what I feel is right. I meet too many people who have given me something and complain that I haven’t given enough back. Then why give? I believe in giving with the heart as long as i am not being taken advantage of. I will never tell someone that they haven’t given me enough back when I know the person has lost their job or doesn’t make much. 8) I haven’t confronted as many heartless and genuinely bad and broken people anywhere else as I have had in Istanbul. Living in China for two years was hard and while I met the worst people ever in China, I also met some of the best people I have ever met and will always remember. I haven’t met anyone with a purely good heart in Istanbul. While I haven’t met the worst individuals in Istanbul, I haven’t met any of the kindest people I know; to be fair, in all of my three years in Istanbul, the people I can consider kind are rare. What I am saying is, I will never treat anyone the way that virtually almost every Turkish person I have met has treated me. These instances surely happen everywhere but I only state that I have learned these lessons in Istanbul in particular. Istanbul has made more of an impression of the above than anywhere else I have lived. The influence that Istanbul has on me is strong; it has affected me more than any other place due to how I have been treated. This, I say that I have learned a lot of lessons here, more so than elsewhere. ", "child": "1558_1\t1558_2"}