{"name": "1568", "parent": "", "title": "10 Coolest Offices in Bangalore", "sentences": [{"df2f": "10 Coolest Offices in Bangalore"}, {"245a": "A look at offices that strive to take employees to the next level."}, {"531c": "1. Intuit"}, {"a21f": "Intuit has consistently made the GPTW (Great Places to Work) list of Top 10 places to work in India for nearly a decade. A look at their office could explain why."}, {"90ed": "2. GE"}, {"d196": "GE calls itself a 124 year old start up, and sure enough the office space lends itself into a contemporary environment that combines the contemporary with the classic. It is imposingly elegant, attractive and imbibes elements of GE’s entrepreneurial culture. The 200,000 sq. ft office space — strategically located at the heart of the busiest tech park in Whitefield promotes agile working style and comes packed with high-tech features, right from an almost wireless office space to an uber cool cafeteria."}, {"3e00": "3. Myntra"}, {"9a8c": "Myntra’s office screams fashion as soon as you set foot in it — not a bad feeling to give your employees if you want to pioneer in the industry. A cool breakout and recreational area add to the vibe."}, {"b8eb": "4. Razorpay"}, {"6c37": "Razorpay’s office is changing the perception that finance is all paperwork and calculation. Apart from comfortable seating that resembles a living room, Razorpay throws in a nap area, a gaming room and a pantry that offers free food to the employees."}, {"914c": "5. Flipkart"}, {"0208": "Flipkart’s office gives a fresh energy on literally every corner, with each of their 11 floors designed after a different theme — literature, sport and science are some of them. This is in addition to recreational spaces like a library and a miniature golf course."}, {"f030": "6. Rakuten India Development Operations Centre"}, {"04db": "Rakuten’s new Indian centre takes Bangalore’s largest business hub, the World Trade Centre, and brings a distinct Japanese energy to it. High ceilings, lots of light and a streamlined floor — trademarks of Japanese industry — are squeezed in between windows that offer a view of Bangalore in all it’s glory."}, {"c090": "7. Headout"}, {"c5b4": "Headout’s office in Bangalore runs its operation in USA — not the easiest of tasks. It is made possible with their office that is rich with youthful decor, brightly designed walls, a gaming centre, and an overall stress-buster floor that is designed for ‘partying while working’."}, {"c9e3": "8. Dentsu"}, {"92f3": "Dentsu’s office slams creativity in your face as soon as you look at it. The graphics are young, contrasting and diverse and the decor enables collaboration, while interspersed patches of minimal design and lounges give it the weight of a massive company."}, {"366d": "9. Linkedin"}, {"3814": "Linkedin’s Bangalore office is a celebration of colour and art. Their vibrant setting is brought to the fore with an Indian-ness to the vibe, while keeping intact Linkedin’s standing with sharp conference rooms, a gym, recreational centres and nap stations with skyline views."}, {"2748": "10. InMobi"}, {"e96f": "InMobi’s office is characterised by a cool reception waiting area, colourful conference rooms, their very own dhaba, and desks that are also whiteboards. They’re also a pet-friendly space."}], "content": "10 Coolest Offices in Bangalore A look at offices that strive to take employees to the next level. 1. Intuit Intuit has consistently made the GPTW (Great Places to Work) list of Top 10 places to work in India for nearly a decade. A look at their office could explain why. 2. GE GE calls itself a 124 year old start up, and sure enough the office space lends itself into a contemporary environment that combines the contemporary with the classic. It is imposingly elegant, attractive and imbibes elements of GE’s entrepreneurial culture. The 200,000 sq. ft office space — strategically located at the heart of the busiest tech park in Whitefield promotes agile working style and comes packed with high-tech features, right from an almost wireless office space to an uber cool cafeteria. 3. Myntra Myntra’s office screams fashion as soon as you set foot in it — not a bad feeling to give your employees if you want to pioneer in the industry. A cool breakout and recreational area add to the vibe. 4. Razorpay Razorpay’s office is changing the perception that finance is all paperwork and calculation. Apart from comfortable seating that resembles a living room, Razorpay throws in a nap area, a gaming room and a pantry that offers free food to the employees. 5. Flipkart Flipkart’s office gives a fresh energy on literally every corner, with each of their 11 floors designed after a different theme — literature, sport and science are some of them. This is in addition to recreational spaces like a library and a miniature golf course. 6. Rakuten India Development Operations Centre Rakuten’s new Indian centre takes Bangalore’s largest business hub, the World Trade Centre, and brings a distinct Japanese energy to it. High ceilings, lots of light and a streamlined floor — trademarks of Japanese industry — are squeezed in between windows that offer a view of Bangalore in all it’s glory. 7. Headout Headout’s office in Bangalore runs its operation in USA — not the easiest of tasks. It is made possible with their office that is rich with youthful decor, brightly designed walls, a gaming centre, and an overall stress-buster floor that is designed for ‘partying while working’. 8. Dentsu Dentsu’s office slams creativity in your face as soon as you look at it. The graphics are young, contrasting and diverse and the decor enables collaboration, while interspersed patches of minimal design and lounges give it the weight of a massive company. 9. Linkedin Linkedin’s Bangalore office is a celebration of colour and art. Their vibrant setting is brought to the fore with an Indian-ness to the vibe, while keeping intact Linkedin’s standing with sharp conference rooms, a gym, recreational centres and nap stations with skyline views. 10. InMobi InMobi’s office is characterised by a cool reception waiting area, colourful conference rooms, their very own dhaba, and desks that are also whiteboards. They’re also a pet-friendly space. ", "child": "1568_1"}