{"name": "1572", "parent": "", "title": "Is using the blazing sun to cool homes viable in India?", "sentences": [{"25b5": "Is using the blazing sun to cool homes viable in India?"}, {"8e43": "India is sweltering in another hot summer, and it’s not yet even peak summer. The city I stay is roasting at around 37℃ (99℉) of dry heat but that’s nothing compared to some other Indian cities. A friend living in Amravati, Maharashtra, reports that people are already getting mild sunstrokes. I found temperatures there are averaging 44℃ (111℉). The problem is the monsoon rains didn’t show up last year, and India is mainly powered by hydro-electric dams (run by the government). So we are faced with a situation of ‘power cuts’ just when we need power to run the electric fans that cool our homes."}, {"69d4": "Sun Everywhere, Solar Nowhere"}, {"f720": "With so much sunlight available, it’s seems a no-brainer to get a solar energy to power homes. The problem is solar energy systems in India are too expensive to justify installing them."}, {"6798": "But that may just be changing. I did a little research while installing a solar energy system on my rooftop last week. Basically there are two types of solar energy systems. A basic one which reduces dependence on the grid (mains), and an advanced one which generates and feeds electricity back into the grid in return for a ‘Zero Bill.’"}, {"236b": "Basic Solar Energy System"}, {"017a": "I installed the basic solar unit at home. It normally uses solar energy to charge the battery. But if the sun is not visible for a couple of days, like during the rainy season, the battery is charged from the grid (mains)."}, {"ff41": "Let me clarify how it works. When the sun rises, the inverter first charges the battery. Once the battery is charged, it disconnects my home from the grid, and runs from the battery. Simultaneously, the solar panel will charge the battery. In effect, the house will be running on solar power."}, {"3ed9": "In the evening when the sun sets, the inverter continues to supply electricity from the battery. This continues till the battery reaches a reserve level, after which my home is connected back to grid. It continues running on the grid, till the next morning when the solar panels again takes over the task of charging the battery. The only time charging from the grid happens, is when the battery goes below its reserve level."}, {"ec9a": "All this ensures I use as less electricity as possible, and keep my bills down."}, {"79fb": "Advanced Solar Energy System"}, {"895f": "The concept for this system is simple. Electricity generated from the solar panels on your rooftop is fed back into the grid. After this, I’m not too clear on the details. But basically if the number of electricity units you feed into the system is more than the units you consumed in the same period, then the your Electricity Board gives you a zero bill. The advantage of this system is that you can run heavy load appliances like ACs (which won’t work on solar energy) as it’s being powered by the mains."}, {"1dd6": "This system only makes financial sense if you have a relatively large bill every month. My bill isn’t that large, at ₹2700 for the last two months. It’s usually much lower as we generally use electric fans. But the extreme heat has forced the use of power hungry ACs for the last month."}, {"3c05": "Costs of the two Solar Energy Systems"}, {"cee3": "The basic solar energy system costs around ₹36000 ($550). It has three solar panels of 100 watts each that charge a 850VA battery via an invertor (30Amp/12V charge controller). It can generate about 1–3 units of electricity a day. The system doesn’t have any major running costs, apart from a battery that has to replaced once every 6–7 years at a cost of around ₹15000 ($230)."}, {"aa1f": "This system generates enough power to run about two fans, two lights, and a computer for around 6–7 hours. It can’t run high power stuff, like ACs, irons, refrigerators, washing machines, electric cookers and water heaters, water pumps, kitchen mixies, etc."}, {"1f25": "The advanced solar energy system that I looked at costs around ₹68000 ($1000), and has a 750 watt solar panel system with three panels of 250W each that power a 1500VA battery."}, {"28a5": "Even this system won’t be able to run high load appliances. However the surplus energy generated is fed into the grid to give you a ‘Zero Bill.’ This way, you can run all those appliances for free, provided there is no power cut."}, {"b09a": "Economics of Solar Energy"}, {"f139": "My electricity bill was ₹2700 for the last two months. The solar unit will only marginally reduce that bill as all my heavy load appliances will still be running on the grid, especially that voracious AC. Besides every 6–7 years, the battery has to be replaced at a cost of ₹15000. In short, it’s seems like it will take forever to recover the ₹36000 I invested."}, {"9bb7": "So why did I install the solar unit?"}, {"b2e3": "UPS as a game changer"}, {"1a27": "Most Indian homes have a UPS (uninterrupted power supply) because of the power cuts which can go up to 4 hours a day. Basically it’s a battery pack (with an inverter) which gets charged when there is electricity. When a power cut happens, the inverter kicks in to run the fans and lights with power ftom the battery."}, {"3823": "The solar unit’s invertor and battery pack that give me uninterrupted power supply"}, {"bca4": "I bought my current UPS around six years ago for ₹17000. It was due for replacement at a cost of ₹16000. Instead I went for the solar energy unit. I will have to replace the solar unit’s battery in 6–7 years but that was anyway an existing expense for my UPS battery."}, {"412f": "So my actual cost of the solar unit was not ₹36000, but only ₹20000."}, {"5019": "The Electric Slab System"}, {"9aaf": "Electricity in India is produced by the government. Though it’s a basic need, there are many in India who can’t afford high priced electricity. So the government has worked out slab systems to make it affordable for the poor. Basically the more electricity you consume, the higher charges you will pay per unit. Anything above 500 units in a bi-monthly cycle will put you into the highest slab. The table below shows the slab system in the state I live in."}, {"c467": "Top level slab: My current bi-monthly bill is ₹2700, which puts me in the top slab. Based on that, I worked out my electricity cost breakup for my bill."}, {"1844": "My actual bi-monthly consumption without the solar unit for the last two months."}, {"aeea": "Effect of Solar: I’m currently consuming 647 units in this bi-monthly cycle. Let’s say my solar unit reduces my electric consumption by 1.5 units a day, or 90 units in two months. My consumption will then drop to 557 units. Let’s calculate how that affects my bi-monthly bill."}, {"ec32": "Projected bi-monthly consumption with the solar unit for the next two months."}, {"bf65": "Savings with Solar"}, {"ed65": "I will save ₹600 every two months. Since the actual cost of the solar unit was ₹20000, it will take around six years to recover that cost."}, {"4632": "However my last bimonthly bill reflected AC use for one month. But my next bi-monthly bill will have two months of AC use. Let’s say I use AC for 8 hours at night. The most energy efficient ACs consume about 1 unit per hour. That’s 8 units a night which adds up 240 units for a month. Or 240 units extra for the next bimonthly bill. Projecting that into my bimonthly bill without and with solar power, I still am saving around ₹600."}, {"b736": "WITHOUT Solar: Bi-monthly consumption with AC for the next two months."}, {"a780": "WITH Solar (less 90 units): Bi-monthly consumption with AC for the next two months."}, {"e198": "AC is the killer: Once the rainy season begins in a couple of months, I will switch back to fans instead of the AC. I believe it’s more healthy to breathe fresh air, and it also reduces electricity consumption saving the environment. A fan will consume a maximum of 1 unit a night. Or 60 units for two months instead of 480 units with the AC. My consumption will go down by 420 units. What will my bill look like with solar, and without solar?"}, {"b190": "WITHOUT Solar: Bi-monthly consumption without AC for the next two months."}, {"c2c0": "WITH Solar: Bi-monthly consumption without AC for the next two months."}, {"e6ed": "Conclusion"}, {"34d2": "In both cases, consumption will be below 500 units so I will drop down to a lower slab and pay less per unit. What’s more, in the ‘no AC’ scenario, the savings from using solar power is barely ₹270 every two months. At this rate, it will take more than 12 years to recover my ₹20000 investment."}, {"b0a4": "In short, solar isn’t financially viable for me as I usually use less than 500 units a month, and come in a lower slab that gets cheaper electricity."}, {"56a6": "But if you are in the top slab with large electricity bills, it does make sense to go for the advanced solar unit that gives a ‘Zero Bill.’ Like if you are getting a bi-monthly bill of ₹6000, you can recover the ₹68000 in less than two years. But you might want to keep in mind that the technology is evolving fast."}, {"6410": "Why did I go for Solar?"}, {"e4ca": "So if it wasn’t to save money, then why did I go for solar?"}, {"ee35": "No more sweaty days: Today there is an all day ‘power cut’ from 9am — 5pm. By 2 o’clock, the UPS batteries in most houses will have run out of power as they last 6 hours at the most. The residents will be sweating it out in the sweltering heat."}, {"985b": "But things are cool at home. My new solar unit is directly running my basic lights and fans with power from the solar panels routed through the inverter. The stored battery power will only be used once the sun sets, which means my fans may keep going all night if the power cut continues."}, {"4103": "My home running directly on solar power during a 10 hour power cut"}, {"2e32": "Environment Friendly: I like the feeling of doing my two bits to save the environment, and have been using an electric scooter for local runs around town for the last five years. Going solar is one more step in that direction."}, {"2231": "Independence from the Grid: In the last floods in Chennai, the only houses with electricity were the ones with solar panels. So if there is a power shortage with extended power cuts in my hometown, I will have electricity."}, {"a407": "Low Outlay: ₹20000 is not an insignificant amount. But I have spent much more on trivial stuff like cell phones. So I don’t mind risking that money if it helps the environment. In any case, I will most likely recover a good bit of my money. In a few years, I will replace my current solar unit with more efficient and less expensive panels that will take care of all my energy needs. I will probably be able to recycle the current unit and use it elsewhere, or sell it and get back the rest of my money. But even if I don’t, I won’t feel too bad about it because my outlay wasn’t too high."}, {"0ee3": "Riding the future wave: With innovative companies like Tesla championing solar and battery power, I believe the technology will improve and costs will drop. I don’t want to be stuck with outdated technology so this ₹2000o investment is an acceptable compromise. Besides by getting in now, I will get to know solar systems better and know what to look out for when I eventually do go in for a ‘Zero Bill’ installation."}, {"c5c8": "One last thing"}, {"1eba": "The bright side of India’s hot climate is an almost unlimited supply of solar energy, and it seems criminal not to take advantage of it."}, {"4961": "Besides, I just love the irony of using the merciless blazing heat of the sun to cool the house."}, {"9115": "In your face, Sun."}], "content": "Is using the blazing sun to cool homes viable in India? India is sweltering in another hot summer, and it’s not yet even peak summer. The city I stay is roasting at around 37℃ (99℉) of dry heat but that’s nothing compared to some other Indian cities. A friend living in Amravati, Maharashtra, reports that people are already getting mild sunstrokes. I found temperatures there are averaging 44℃ (111℉). The problem is the monsoon rains didn’t show up last year, and India is mainly powered by hydro-electric dams (run by the government). So we are faced with a situation of ‘power cuts’ just when we need power to run the electric fans that cool our homes. Sun Everywhere, Solar Nowhere With so much sunlight available, it’s seems a no-brainer to get a solar energy to power homes. The problem is solar energy systems in India are too expensive to justify installing them. But that may just be changing. I did a little research while installing a solar energy system on my rooftop last week. Basically there are two types of solar energy systems. A basic one which reduces dependence on the grid (mains), and an advanced one which generates and feeds electricity back into the grid in return for a ‘Zero Bill.’ Basic Solar Energy System I installed the basic solar unit at home. It normally uses solar energy to charge the battery. But if the sun is not visible for a couple of days, like during the rainy season, the battery is charged from the grid (mains). Let me clarify how it works. When the sun rises, the inverter first charges the battery. Once the battery is charged, it disconnects my home from the grid, and runs from the battery. Simultaneously, the solar panel will charge the battery. In effect, the house will be running on solar power. In the evening when the sun sets, the inverter continues to supply electricity from the battery. This continues till the battery reaches a reserve level, after which my home is connected back to grid. It continues running on the grid, till the next morning when the solar panels again takes over the task of charging the battery. The only time charging from the grid happens, is when the battery goes below its reserve level. All this ensures I use as less electricity as possible, and keep my bills down. Advanced Solar Energy System The concept for this system is simple. Electricity generated from the solar panels on your rooftop is fed back into the grid. After this, I’m not too clear on the details. But basically if the number of electricity units you feed into the system is more than the units you consumed in the same period, then the your Electricity Board gives you a zero bill. The advantage of this system is that you can run heavy load appliances like ACs (which won’t work on solar energy) as it’s being powered by the mains. This system only makes financial sense if you have a relatively large bill every month. My bill isn’t that large, at ₹2700 for the last two months. It’s usually much lower as we generally use electric fans. But the extreme heat has forced the use of power hungry ACs for the last month. Costs of the two Solar Energy Systems The basic solar energy system costs around ₹36000 ($550). It has three solar panels of 100 watts each that charge a 850VA battery via an invertor (30Amp/12V charge controller). It can generate about 1–3 units of electricity a day. The system doesn’t have any major running costs, apart from a battery that has to replaced once every 6–7 years at a cost of around ₹15000 ($230). This system generates enough power to run about two fans, two lights, and a computer for around 6–7 hours. It can’t run high power stuff, like ACs, irons, refrigerators, washing machines, electric cookers and water heaters, water pumps, kitchen mixies, etc. The advanced solar energy system that I looked at costs around ₹68000 ($1000), and has a 750 watt solar panel system with three panels of 250W each that power a 1500VA battery. Even this system won’t be able to run high load appliances. However the surplus energy generated is fed into the grid to give you a ‘Zero Bill.’ This way, you can run all those appliances for free, provided there is no power cut. Economics of Solar Energy My electricity bill was ₹2700 for the last two months. The solar unit will only marginally reduce that bill as all my heavy load appliances will still be running on the grid, especially that voracious AC. Besides every 6–7 years, the battery has to be replaced at a cost of ₹15000. In short, it’s seems like it will take forever to recover the ₹36000 I invested. So why did I install the solar unit? UPS as a game changer Most Indian homes have a UPS (uninterrupted power supply) because of the power cuts which can go up to 4 hours a day. Basically it’s a battery pack (with an inverter) which gets charged when there is electricity. When a power cut happens, the inverter kicks in to run the fans and lights with power ftom the battery. The solar unit’s invertor and battery pack that give me uninterrupted power supply I bought my current UPS around six years ago for ₹17000. It was due for replacement at a cost of ₹16000. Instead I went for the solar energy unit. I will have to replace the solar unit’s battery in 6–7 years but that was anyway an existing expense for my UPS battery. So my actual cost of the solar unit was not ₹36000, but only ₹20000. The Electric Slab System Electricity in India is produced by the government. Though it’s a basic need, there are many in India who can’t afford high priced electricity. So the government has worked out slab systems to make it affordable for the poor. Basically the more electricity you consume, the higher charges you will pay per unit. Anything above 500 units in a bi-monthly cycle will put you into the highest slab. The table below shows the slab system in the state I live in. Top level slab: My current bi-monthly bill is ₹2700, which puts me in the top slab. Based on that, I worked out my electricity cost breakup for my bill. My actual bi-monthly consumption without the solar unit for the last two months. Effect of Solar: I’m currently consuming 647 units in this bi-monthly cycle. Let’s say my solar unit reduces my electric consumption by 1.5 units a day, or 90 units in two months. My consumption will then drop to 557 units. Let’s calculate how that affects my bi-monthly bill. Projected bi-monthly consumption with the solar unit for the next two months. Savings with Solar I will save ₹600 every two months. Since the actual cost of the solar unit was ₹20000, it will take around six years to recover that cost. However my last bimonthly bill reflected AC use for one month. But my next bi-monthly bill will have two months of AC use. Let’s say I use AC for 8 hours at night. The most energy efficient ACs consume about 1 unit per hour. That’s 8 units a night which adds up 240 units for a month. Or 240 units extra for the next bimonthly bill. Projecting that into my bimonthly bill without and with solar power, I still am saving around ₹600. WITHOUT Solar: Bi-monthly consumption with AC for the next two months. WITH Solar (less 90 units): Bi-monthly consumption with AC for the next two months. AC is the killer: Once the rainy season begins in a couple of months, I will switch back to fans instead of the AC. I believe it’s more healthy to breathe fresh air, and it also reduces electricity consumption saving the environment. A fan will consume a maximum of 1 unit a night. Or 60 units for two months instead of 480 units with the AC. My consumption will go down by 420 units. What will my bill look like with solar, and without solar? WITHOUT Solar: Bi-monthly consumption without AC for the next two months. WITH Solar: Bi-monthly consumption without AC for the next two months. Conclusion In both cases, consumption will be below 500 units so I will drop down to a lower slab and pay less per unit. What’s more, in the ‘no AC’ scenario, the savings from using solar power is barely ₹270 every two months. At this rate, it will take more than 12 years to recover my ₹20000 investment. In short, solar isn’t financially viable for me as I usually use less than 500 units a month, and come in a lower slab that gets cheaper electricity. But if you are in the top slab with large electricity bills, it does make sense to go for the advanced solar unit that gives a ‘Zero Bill.’ Like if you are getting a bi-monthly bill of ₹6000, you can recover the ₹68000 in less than two years. But you might want to keep in mind that the technology is evolving fast. Why did I go for Solar? So if it wasn’t to save money, then why did I go for solar? No more sweaty days: Today there is an all day ‘power cut’ from 9am — 5pm. By 2 o’clock, the UPS batteries in most houses will have run out of power as they last 6 hours at the most. The residents will be sweating it out in the sweltering heat. But things are cool at home. My new solar unit is directly running my basic lights and fans with power from the solar panels routed through the inverter. The stored battery power will only be used once the sun sets, which means my fans may keep going all night if the power cut continues. My home running directly on solar power during a 10 hour power cut Environment Friendly: I like the feeling of doing my two bits to save the environment, and have been using an electric scooter for local runs around town for the last five years. Going solar is one more step in that direction. Independence from the Grid: In the last floods in Chennai, the only houses with electricity were the ones with solar panels. So if there is a power shortage with extended power cuts in my hometown, I will have electricity. Low Outlay: ₹20000 is not an insignificant amount. But I have spent much more on trivial stuff like cell phones. So I don’t mind risking that money if it helps the environment. In any case, I will most likely recover a good bit of my money. In a few years, I will replace my current solar unit with more efficient and less expensive panels that will take care of all my energy needs. I will probably be able to recycle the current unit and use it elsewhere, or sell it and get back the rest of my money. But even if I don’t, I won’t feel too bad about it because my outlay wasn’t too high. Riding the future wave: With innovative companies like Tesla championing solar and battery power, I believe the technology will improve and costs will drop. I don’t want to be stuck with outdated technology so this ₹2000o investment is an acceptable compromise. Besides by getting in now, I will get to know solar systems better and know what to look out for when I eventually do go in for a ‘Zero Bill’ installation. One last thing The bright side of India’s hot climate is an almost unlimited supply of solar energy, and it seems criminal not to take advantage of it. Besides, I just love the irony of using the merciless blazing heat of the sun to cool the house. In your face, Sun. ", "child": "1572_1\t1572_2"}