{"name": "1600", "parent": "", "title": "A restoration of Resurrection Sunday", "sentences": [{"25a6": "A restoration of Resurrection Sunday"}, {"6dbe": "If you’re like me, you may have been told the story that Jesus died on the cross for your sins so that you could go to Heaven someday. It’s a lovely message, but from what I’ve recently learned, there’s a lot more to this day than just that…"}, {"5dec": "Maybe when you hear the above story, your nonsense detector goes off (and has been going off since you were 9 years old, but you’ve muted it so as to keep the peace and not ruffle any feathers)."}, {"dda0": "And so for a lot of people, Easter is about a guy dying so that we can go somewhere else after we die."}, {"7128": "Here’s some history…"}, {"88bd": "A little over 2,000 years ago, the Roman Empire — a massive military, economic, social industrial complex bigger than anyone had ever seen — ruled the world all the way from England to India, conquering everyone they could."}, {"fb0e": "This empire was run by a series of Caesars (yep, you’re probably way ahead of me, but I just found out it’s not just one guy). They believed that they were the sons of God who’d been sent to Earth to impart a universal reign of peace and prosperity."}, {"62af": "A catchy tagline they used was this: Caesar is Lord."}, {"df00": "So what they’d do is march into your town, knock on your door, hold a sword to your throat, and say, “Confess that Caesar is Lord.” If you submitted, your town would become part of the empire. You’d begin paying taxes to the Caesar and the Caesar would take those taxes and expand the empire even more."}, {"74b0": "If you said, “No,” they’d introduce you to a specific form of punishment that showed people what happens when the empire was defied. They perfected a way to keep people in the most amount of pain without killing them too soon — in public — in order to bring the point home as profoundly as possible. They had a thing called an ‘execution stake’ that they’d crucify you on (located in the center of town for all to see, of course)."}, {"85cb": "Their message was simple: This is what happens if you don’t submit to Caesar."}, {"cf2d": "What a fail-proof way to grow an empire, right?"}, {"ddbd": "Soon, a movement started in the corner of this massive global empire. A group of people kept insisting that their leader and Rabbi, Jesus from Nazareth, had been crucified by the empire, but had risen from the dead."}, {"10a4": "They made up their own catchy slogan that said the following: Jesus is Lord."}, {"6045": "From a historical context, can you see how punk rock this was? They were taking Roman military propaganda and subverting it for their own purposes."}, {"81a4": "These early ‘Christians’ would have gatherings where they’d provide bread (Caesar gave out bread as a way of showing how he provided for his subjects) and wine (because they were Jewish) and they’d have meals called Agape Feasts (‘love’ feasts) where they’d remember their Jesus."}, {"f031": "Good tax-paying Romans would look at these nutty Christians going, “You guys, Caesar is going to totally crucify you.” (I’m paraphrasing.) But the Christians would respond with their defiantly subversive slogan: Jesus is Lord."}, {"cb11": "These Good Romans would look at them with frustration and ask, “Dude, what has your Jesus done besides getting his ass crucified? Caesar is creating a world of peace and prosperity, man. Get with it.”"}, {"498b": "To that, the Christians would respond, “Hey, man, why don’t you come with me this Thursday night. We’re having an Agape Feast. We’re from all backgrounds — Romans, Greeks, Jews, Gentiles, men, women, etc. We gather around a table. We put some bread and wine out to remember this Jesus whose body was broken and blood poured out. But before we eat, we go around and make sure all the single mothers have their rent paid. We make sure that anyone sick is brought food and care. We make sure everyone’s practical needs are met. And we make sure that those with more than enough feel free to share with those who don’t. We do this because we believe Jesus is Lord. And we believe there’s a whole new way to be human.”"}, {"5d3f": "So, if you were a Christian back then, you’d invite your friend. When you were walking home that night after the Agape Feast, you might ask them, “So, whattdya think? Who do you think is making a better world? Caesar or Jesus?”"}, {"85c3": "Basically, what you’d be asking is this:"}, {"b842": "Is the world made better through coercive military violence? Or is the world made better through sacrificial love?"}, {"8142": "What this is really all about"}, {"a21a": "And so the contrast was made: maybe the question isn’t, “How can I crush my enemy,” but, “How can I serve the most downtrodden among us?”"}, {"7a23": "The resurrection said that all oppressive power and brutal regimes are, in fact, temporary. That there is a power in the world greater than the bully. It was hope for anyone who had the boot of an empire on their throat."}, {"f22f": "Here’s the thing: People who live in wealthy, triumphant empires can easily miss the power of this story. This is why modern Christians living in the western world can’t really relate. They turn it into Jesus forgiving you of your sins, which makes the whole thing about YOU. Our me-first, affluent culture (God bless it) has turned this message into here’s how I can go to heaven someday when I die."}, {"adca": "But for the first followers of Jesus, sure it was about the individual, but it was largely about a whole new kind of world. This world. Here and now. It was about providing economic, societal, visceral help and healing for this very world that desperately needs it."}, {"cf0e": "Resurrection says it’s good to be human."}, {"634e": "And it can all be healed right here, right now. This was about the resurrection of the body. Not the order of the day that said the body was bad and you had to leave it behind and float off to another realm after death."}, {"5f1e": "The resurrection and incarnation is the radical idea that the divine and the human can exist in the same place."}, {"a1e3": "It says it’s okay to be alive and human, here and now. It speaks to the inherent goodness of the material world. It’s about laughter, wine, sunshine, fresh snow, good coffee, great books, sex, more sex, tacos on a summer evening, babies, dogs, big meals with friends, Cubs games, stargazing, hot spring-poaching, and fixing that garage door. It’s an affirmation of the sweat, blood, dirt and all the grittiness that we know of the human experience."}, {"874e": "This tradition starts with the divine who announces: it’s alllll gooood. Resurrection is the climactic announcement that it’s still good. And it’s worth being renewed, restored, and reconciled."}, {"0f6e": "Please don’t let that priest or preacher tell you it’s just about saving your soul after death."}, {"22be": "It’s about your skin, your society, your kids’ school, and all the way you use your sacred spirit to DO something with your life and make the world a better place."}, {"e5ec": "Creation is good and it is to be cared for. Resurrection is about our air, our soil, our food, and our water. It’s about feeding those who are hungry, being trafficked, being marginalized, being exiled, trying to get a small business loan, and helping parents and grandparents in need."}, {"f9ff": "This world. This world is good. It’s good to have a body. It’s a resounding YES to all of this."}, {"06bf": "Do NOT let anyone shrink resurrection down to a nice little selfish doctrine that can fit into your Dolce and Gabbana purse."}, {"c267": "This is about our world being healed, life restored and renewed to the paradise it is at its core."}, {"d919": "What this has to do with us"}, {"18df": "Now… Given all of this, what do we do when someone wrongs us? If you’re like me, everything within you wants to lash back and get revenge. But if we do this, what we’re doing is keeping the violence alive. We’re keeping the aggression in circulation."}, {"a657": "You bomb us? We’ll bomb you. (Or today — you THINK of bombing us? We’ll bomb you.)"}, {"30df": "It happens in marriages, town hall meetings, and national diplomacy and has been for ages."}, {"27b5": "But the story of resurrection is about a Jesus who, when injustice comes his way, when he’s betrayed and crucified, DOES NOT retaliate."}, {"587d": "He does the strongest thing anyone can do, which is, he takes the violence and absorbs it. Not because he’s weak or passive, but because he understands that the greatest strength is that which absorbs all that pain, and when it does, it takes the pain, violence, and evil out of circulation."}, {"67b1": "In that very moment, Jesus showed us the God of life. The God of renewal. The God of resurrection."}, {"7454": "Jesus took the violence out of circulation."}, {"45e9": "Looking around today, it’s too bad he seemed to die in vain. If we would have gotten the message and lived it these last couple thousand years, we might not be staring down the barrel of a nuclear holocaust this Easter weekend. Maybe this world would look a hell of a lot different than it does now."}, {"ef2a": "I’d say it’s not too late. Happy Easter, my good friends."}, {"2e9f": "For more on this, check this outstanding account by Rob Bell from a couple years back."}, {"409d": "Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below."}], "content": "A restoration of Resurrection Sunday If you’re like me, you may have been told the story that Jesus died on the cross for your sins so that you could go to Heaven someday. It’s a lovely message, but from what I’ve recently learned, there’s a lot more to this day than just that… Maybe when you hear the above story, your nonsense detector goes off (and has been going off since you were 9 years old, but you’ve muted it so as to keep the peace and not ruffle any feathers). And so for a lot of people, Easter is about a guy dying so that we can go somewhere else after we die. Here’s some history… A little over 2,000 years ago, the Roman Empire — a massive military, economic, social industrial complex bigger than anyone had ever seen — ruled the world all the way from England to India, conquering everyone they could. This empire was run by a series of Caesars (yep, you’re probably way ahead of me, but I just found out it’s not just one guy). They believed that they were the sons of God who’d been sent to Earth to impart a universal reign of peace and prosperity. A catchy tagline they used was this: Caesar is Lord. So what they’d do is march into your town, knock on your door, hold a sword to your throat, and say, “Confess that Caesar is Lord.” If you submitted, your town would become part of the empire. You’d begin paying taxes to the Caesar and the Caesar would take those taxes and expand the empire even more. If you said, “No,” they’d introduce you to a specific form of punishment that showed people what happens when the empire was defied. They perfected a way to keep people in the most amount of pain without killing them too soon — in public — in order to bring the point home as profoundly as possible. They had a thing called an ‘execution stake’ that they’d crucify you on (located in the center of town for all to see, of course). Their message was simple: This is what happens if you don’t submit to Caesar. What a fail-proof way to grow an empire, right? Soon, a movement started in the corner of this massive global empire. A group of people kept insisting that their leader and Rabbi, Jesus from Nazareth, had been crucified by the empire, but had risen from the dead. They made up their own catchy slogan that said the following: Jesus is Lord. From a historical context, can you see how punk rock this was? They were taking Roman military propaganda and subverting it for their own purposes. These early ‘Christians’ would have gatherings where they’d provide bread (Caesar gave out bread as a way of showing how he provided for his subjects) and wine (because they were Jewish) and they’d have meals called Agape Feasts (‘love’ feasts) where they’d remember their Jesus. Good tax-paying Romans would look at these nutty Christians going, “You guys, Caesar is going to totally crucify you.” (I’m paraphrasing.) But the Christians would respond with their defiantly subversive slogan: Jesus is Lord. These Good Romans would look at them with frustration and ask, “Dude, what has your Jesus done besides getting his ass crucified? Caesar is creating a world of peace and prosperity, man. Get with it.” To that, the Christians would respond, “Hey, man, why don’t you come with me this Thursday night. We’re having an Agape Feast. We’re from all backgrounds — Romans, Greeks, Jews, Gentiles, men, women, etc. We gather around a table. We put some bread and wine out to remember this Jesus whose body was broken and blood poured out. But before we eat, we go around and make sure all the single mothers have their rent paid. We make sure that anyone sick is brought food and care. We make sure everyone’s practical needs are met. And we make sure that those with more than enough feel free to share with those who don’t. We do this because we believe Jesus is Lord. And we believe there’s a whole new way to be human.” So, if you were a Christian back then, you’d invite your friend. When you were walking home that night after the Agape Feast, you might ask them, “So, whattdya think? Who do you think is making a better world? Caesar or Jesus?” Basically, what you’d be asking is this: Is the world made better through coercive military violence? Or is the world made better through sacrificial love? What this is really all about And so the contrast was made: maybe the question isn’t, “How can I crush my enemy,” but, “How can I serve the most downtrodden among us?” The resurrection said that all oppressive power and brutal regimes are, in fact, temporary. That there is a power in the world greater than the bully. It was hope for anyone who had the boot of an empire on their throat. Here’s the thing: People who live in wealthy, triumphant empires can easily miss the power of this story. This is why modern Christians living in the western world can’t really relate. They turn it into Jesus forgiving you of your sins, which makes the whole thing about YOU. Our me-first, affluent culture (God bless it) has turned this message into here’s how I can go to heaven someday when I die. But for the first followers of Jesus, sure it was about the individual, but it was largely about a whole new kind of world. This world. Here and now. It was about providing economic, societal, visceral help and healing for this very world that desperately needs it. Resurrection says it’s good to be human. And it can all be healed right here, right now. This was about the resurrection of the body. Not the order of the day that said the body was bad and you had to leave it behind and float off to another realm after death. The resurrection and incarnation is the radical idea that the divine and the human can exist in the same place. It says it’s okay to be alive and human, here and now. It speaks to the inherent goodness of the material world. It’s about laughter, wine, sunshine, fresh snow, good coffee, great books, sex, more sex, tacos on a summer evening, babies, dogs, big meals with friends, Cubs games, stargazing, hot spring-poaching, and fixing that garage door. It’s an affirmation of the sweat, blood, dirt and all the grittiness that we know of the human experience. This tradition starts with the divine who announces: it’s alllll gooood. Resurrection is the climactic announcement that it’s still good. And it’s worth being renewed, restored, and reconciled. Please don’t let that priest or preacher tell you it’s just about saving your soul after death. It’s about your skin, your society, your kids’ school, and all the way you use your sacred spirit to DO something with your life and make the world a better place. Creation is good and it is to be cared for. Resurrection is about our air, our soil, our food, and our water. It’s about feeding those who are hungry, being trafficked, being marginalized, being exiled, trying to get a small business loan, and helping parents and grandparents in need. This world. This world is good. It’s good to have a body. It’s a resounding YES to all of this. Do NOT let anyone shrink resurrection down to a nice little selfish doctrine that can fit into your Dolce and Gabbana purse. This is about our world being healed, life restored and renewed to the paradise it is at its core. What this has to do with us Now… Given all of this, what do we do when someone wrongs us? If you’re like me, everything within you wants to lash back and get revenge. But if we do this, what we’re doing is keeping the violence alive. We’re keeping the aggression in circulation. You bomb us? We’ll bomb you. (Or today — you THINK of bombing us? We’ll bomb you.) It happens in marriages, town hall meetings, and national diplomacy and has been for ages. But the story of resurrection is about a Jesus who, when injustice comes his way, when he’s betrayed and crucified, DOES NOT retaliate. He does the strongest thing anyone can do, which is, he takes the violence and absorbs it. Not because he’s weak or passive, but because he understands that the greatest strength is that which absorbs all that pain, and when it does, it takes the pain, violence, and evil out of circulation. In that very moment, Jesus showed us the God of life. The God of renewal. The God of resurrection. Jesus took the violence out of circulation. Looking around today, it’s too bad he seemed to die in vain. If we would have gotten the message and lived it these last couple thousand years, we might not be staring down the barrel of a nuclear holocaust this Easter weekend. Maybe this world would look a hell of a lot different than it does now. I’d say it’s not too late. Happy Easter, my good friends. For more on this, check this outstanding account by Rob Bell from a couple years back. Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below. ", "child": "1600_1\t1600_2\t1600_3\t1600_4\t1600_5\t1600_6\t1600_7\t1600_8\t1600_9\t1600_10\t1600_11\t1600_12\t1600_13\t1600_14\t1600_15\t1600_16\t1600_171600_1\t1600_2\t1600_3\t1600_4\t1600_5\t1600_6\t1600_7\t1600_8\t1600_9\t1600_10\t1600_11\t1600_12\t1600_13\t1600_14\t1600_15\t1600_16\t1600_171600_1\t1600_2\t1600_3\t1600_4\t1600_5\t1600_6\t1600_7\t1600_8\t1600_9\t1600_10\t1600_11\t1600_12\t1600_13\t1600_14\t1600_15\t1600_16\t1600_17"}