{"name": "1604", "parent": "", "title": "Healthy boundaries for harmony", "sentences": [{"858b": "Healthy boundaries for harmony"}, {"1ae4": "“One more show, Dad.”"}, {"9de5": "(She’s petitioning pretty hard, but it’s cute, so I’ll let it go.)"}, {"26bf": "“Okay, Rory… Fine.”"}, {"0f7e": "(Show finishes.)"}, {"583e": "“One more show, Dad.”"}, {"35ff": "(Hesitating) “Okay, fine…”"}, {"1df3": "(Show finishes.)"}, {"b58e": "“Just one more show, okay, Dad?”"}, {"0c95": "(Getting really damn frustrated, but there’s JUST enough time if she watches one more show for us not to be late. Hesitating a lot…)"}, {"c782": "“Fine, Rory, but that’s IT, OKAY?”"}, {"bd99": "“Okay…”"}, {"cc30": "(Show finishes.)"}, {"1770": "“Just one…”"}, {"3db7": "(Interrupting her) “No, Rory, that’s it. We have to leave right now.”"}, {"3344": "“But I have to change my dress.”"}, {"cf65": "“Okay, hurry.”"}, {"0060": "“But I have to get my waaaater.”"}, {"86f4": "“Here… Here’s your water. Let’s go.”"}, {"cf79": "“But you said I could have a cookie.”"}, {"115b": "This is what I do. It’s what I’ve always done. I let people slide because I hate confrontation. I let them push the envelope waaaaay over to the other end of the table."}, {"049b": "Then, when things go awry, all of that tension escalates into a huge fireball of anger. Because then, I’m not just mad at the situation. I’m shaming myself for being such a pushover. I’m pissed at them for putting me in the position of having to say yes to their ridiculous demands. And all of the other layers of complexity that have been stacked on top of said situation due to my passivity."}, {"4862": "(If you’re not more self-aware after raising kids, I have to ask where you’ve been the whole time.)"}, {"c1af": "Draw healthy, calm, reasonable boundaries. Yes, with your kids, but also with your boss, your roommate, your mother-in-law, your husband, and yourself."}, {"2bd1": "Notice I didn’t say firm, rigid, unrealistic boundaries. Doing this will set you up for a life of disappointment."}, {"6dbc": "Determine your ‘do not cross’ line in advance. Leave room for some leeway (yes, life happens). And hold to it. If you have to hold the line, you’re better off doing it before the anger builds. You’ll be able to do so in a calm, assertive way."}, {"05ea": "Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below."}], "content": "Healthy boundaries for harmony “One more show, Dad.” (She’s petitioning pretty hard, but it’s cute, so I’ll let it go.) “Okay, Rory… Fine.” (Show finishes.) “One more show, Dad.” (Hesitating) “Okay, fine…” (Show finishes.) “Just one more show, okay, Dad?” (Getting really damn frustrated, but there’s JUST enough time if she watches one more show for us not to be late. Hesitating a lot…) “Fine, Rory, but that’s IT, OKAY?” “Okay…” (Show finishes.) “Just one…” (Interrupting her) “No, Rory, that’s it. We have to leave right now.” “But I have to change my dress.” “Okay, hurry.” “But I have to get my waaaater.” “Here… Here’s your water. Let’s go.” “But you said I could have a cookie.” This is what I do. It’s what I’ve always done. I let people slide because I hate confrontation. I let them push the envelope waaaaay over to the other end of the table. Then, when things go awry, all of that tension escalates into a huge fireball of anger. Because then, I’m not just mad at the situation. I’m shaming myself for being such a pushover. I’m pissed at them for putting me in the position of having to say yes to their ridiculous demands. And all of the other layers of complexity that have been stacked on top of said situation due to my passivity. (If you’re not more self-aware after raising kids, I have to ask where you’ve been the whole time.) Draw healthy, calm, reasonable boundaries. Yes, with your kids, but also with your boss, your roommate, your mother-in-law, your husband, and yourself. Notice I didn’t say firm, rigid, unrealistic boundaries. Doing this will set you up for a life of disappointment. Determine your ‘do not cross’ line in advance. Leave room for some leeway (yes, life happens). And hold to it. If you have to hold the line, you’re better off doing it before the anger builds. You’ll be able to do so in a calm, assertive way. Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below. ", "child": "1604_1\t1604_2\t1604_3\t1604_4\t1604_5\t1604_6\t1604_7\t1604_8\t1604_9\t1604_101604_1\t1604_2\t1604_3\t1604_4\t1604_5\t1604_6\t1604_7\t1604_8\t1604_9\t1604_10"}