{"name": "161", "parent": "", "title": "What does “Minimum Viable Product” actually mean, anyway?", "sentences": [{"64ed": "What does “Minimum Viable Product” actually mean, anyway?"}, {"96ae": "Elon Musk on making sense of a confusing idea"}, {"fadf": "Even the experts are confused by what Minimum Viable Product actually means:"}, {"02c2": "There are two exceptional quotes that helped me understand and apply the often confusing principle of MVP effectively in my startup:"}, {"41d1": "“You’re selling the vision and delivering the minimum feature set to visionaries not everyone.” — Steve Blank"}, {"bad2": "“An MVP is a down payment on a larger vision.” — Johnny Holland"}, {"3c5a": "A Simplified 3-Step MVP Process"}, {"1704": "I’ve taken the complex Lean, Agile and Guerrilla methodologies and distilled the MVP process to 3 steps:"}, {"67c0": "Let’s use the evolution of light to illustrate how this works."}, {"3d7d": "Grand Problem: Humanity needs cheap, effective lighting during darkness"}, {"7af9": "1st MVP: Fire. Humans witnessed how lightning from the skies could ignite forests and create fire. After experimenting by rubbing sticks together, they created their own fire. Problem solved. But fire isn’t particularly portable."}, {"6a46": "2nd MVP: Oil Lamps, Candles & Gas Lights. Now humans could carry light with them as they moved about their business. Problem solved. But candles and gas lights aren’t particularly bright and the slightest breeze blows them out."}, {"01c5": "3rd MVP: Incandescent Light Bulbs. Early light bulbs were battery powered and were more reliable than a flickering candle. Problem solved. But as cities grew in size, the demand for more widespread lighting grew. The national grid had not yet been constructed."}, {"c5ad": "4th MVP: Widely Available Electricity. In order to transmit electricity over long distances, AC and transformers were developed. Thermal power stations were built to meet massive demand. Problem solved. But as the world’s electricity demand increases, alternatives are required."}, {"0572": "5th MVP: Solar Power. Lower wattage light bulbs replace the original incandescent light bulbs while solar panels become more efficient and cheaper to produce. Problem solved. But solar solutions are still relatively expensive and adoption too low to be able to turn off the national grid."}, {"5ec5": "6th MVP: A Planet Powered Solely by the Sun. Highly efficient batteries can be charged solely by cheap and ubiquitous solar panels. At this point it becomes possible to remove our dependence on fossil fuels. We’re not quite there yet."}, {"3730": "As the founder of an early-stage company or product, you have a clear vision of the Grand Problem (MVP6) you are solving. But you’re way ahead of your market (or at least you should be)."}, {"9f40": "To be successful, it is your responsibility to chunk up the journey from where the world is now to where you want us to be. How will you release feature sets that take us from what can be delivered today, while communicating the future truth of your vision?"}, {"51e7": "Elon Musk is an entrepreneur who is exceptional at the 3-step MVP process."}, {"e2a8": "Imagine if Musk had started solving his Grand Problem by building Gigafactory (bypassing Tesla and Solar City). He might have launched with an MVP that produces 1 battery per month. His idea would go nowhere, because he hasn’t taken us the journey from where we are now to where he can see we need to be. His MVP would not be viable."}, {"63e6": "Entrepreneurs very often make the mistake of starting with the Grand Problem. They then deliver an MVP, but the market doesn’t respond because they haven’t taken us on the required journey. The result? An unviable MVP, which often results in a pivot."}, {"093c": "Simplified 3-Step MVP Process in Practice"}, {"099b": "Let’s say that you have launched your product. A handful of customers have signed up for your initial release. Your analytics tell you that there are downloads. But you also notice that engagement sucks. Your financial projections far exceed the usage you anticipated."}, {"dbf4": "Contrary to popular belief, this is usually not a disaster."}, {"99d9": "The good news is that people will sign up based on some portion of your vision. That’s the first step in validating your market. It’s at this point that the product strategist must get out of the office, talk to customers, and understand the situation:"}, {"a4f5": "This is a systematic meaning and sense-making process. It is a scientific process which relies on data and well-defined metrics. But the process is guided by the vision of the artist who imagines a better and more fulfilling future. Not only can the artist see the future, but she can see the path down which we need to travel to get to that future. And she knows which MVP’s to deliver as stepping stones to move us from here to there."}, {"c2a4": "That is my understanding of what makes a Viable Minimum Viable Product."}, {"efa5": "Ravi Vadrevu is the CEO & Founder of Kriya— the messaging platform where you instantly hire product contractors that work by the sprint."}], "content": "What does “Minimum Viable Product” actually mean, anyway? Elon Musk on making sense of a confusing idea Even the experts are confused by what Minimum Viable Product actually means: There are two exceptional quotes that helped me understand and apply the often confusing principle of MVP effectively in my startup: “You’re selling the vision and delivering the minimum feature set to visionaries not everyone.” — Steve Blank “An MVP is a down payment on a larger vision.” — Johnny Holland A Simplified 3-Step MVP Process I’ve taken the complex Lean, Agile and Guerrilla methodologies and distilled the MVP process to 3 steps: Let’s use the evolution of light to illustrate how this works. Grand Problem: Humanity needs cheap, effective lighting during darkness 1st MVP: Fire. Humans witnessed how lightning from the skies could ignite forests and create fire. After experimenting by rubbing sticks together, they created their own fire. Problem solved. But fire isn’t particularly portable. 2nd MVP: Oil Lamps, Candles & Gas Lights. Now humans could carry light with them as they moved about their business. Problem solved. But candles and gas lights aren’t particularly bright and the slightest breeze blows them out. 3rd MVP: Incandescent Light Bulbs. Early light bulbs were battery powered and were more reliable than a flickering candle. Problem solved. But as cities grew in size, the demand for more widespread lighting grew. The national grid had not yet been constructed. 4th MVP: Widely Available Electricity. In order to transmit electricity over long distances, AC and transformers were developed. Thermal power stations were built to meet massive demand. Problem solved. But as the world’s electricity demand increases, alternatives are required. 5th MVP: Solar Power. Lower wattage light bulbs replace the original incandescent light bulbs while solar panels become more efficient and cheaper to produce. Problem solved. But solar solutions are still relatively expensive and adoption too low to be able to turn off the national grid. 6th MVP: A Planet Powered Solely by the Sun. Highly efficient batteries can be charged solely by cheap and ubiquitous solar panels. At this point it becomes possible to remove our dependence on fossil fuels. We’re not quite there yet. As the founder of an early-stage company or product, you have a clear vision of the Grand Problem (MVP6) you are solving. But you’re way ahead of your market (or at least you should be). To be successful, it is your responsibility to chunk up the journey from where the world is now to where you want us to be. How will you release feature sets that take us from what can be delivered today, while communicating the future truth of your vision? Elon Musk is an entrepreneur who is exceptional at the 3-step MVP process. Imagine if Musk had started solving his Grand Problem by building Gigafactory (bypassing Tesla and Solar City). He might have launched with an MVP that produces 1 battery per month. His idea would go nowhere, because he hasn’t taken us the journey from where we are now to where he can see we need to be. His MVP would not be viable. Entrepreneurs very often make the mistake of starting with the Grand Problem. They then deliver an MVP, but the market doesn’t respond because they haven’t taken us on the required journey. The result? An unviable MVP, which often results in a pivot. Simplified 3-Step MVP Process in Practice Let’s say that you have launched your product. A handful of customers have signed up for your initial release. Your analytics tell you that there are downloads. But you also notice that engagement sucks. Your financial projections far exceed the usage you anticipated. Contrary to popular belief, this is usually not a disaster. The good news is that people will sign up based on some portion of your vision. That’s the first step in validating your market. It’s at this point that the product strategist must get out of the office, talk to customers, and understand the situation: This is a systematic meaning and sense-making process. It is a scientific process which relies on data and well-defined metrics. But the process is guided by the vision of the artist who imagines a better and more fulfilling future. Not only can the artist see the future, but she can see the path down which we need to travel to get to that future. And she knows which MVP’s to deliver as stepping stones to move us from here to there. That is my understanding of what makes a Viable Minimum Viable Product. Ravi Vadrevu is the CEO & Founder of Kriya— the messaging platform where you instantly hire product contractors that work by the sprint. ", "child": "161_1\t161_2\t161_3161_1\t161_2\t161_3161_1\t161_2\t161_3161_1\t161_2\t161_3161_1\t161_2\t161_3"}