{"name": "1617", "parent": "", "title": "Multi-Genre Characters in Open Legend", "sentences": [{"ed82": "Multi-Genre Characters in Open Legend"}, {"75e5": "Note: I’m going to be using the HeroMuster Open Legend character sheet for this article, so special thanks to Mario Lurig ( @ucffool )for all his hard work on that!"}, {"1771": "This is going to be a series of articles, and I’ll be writing one article for each genre. If I miss any genres, or you have any ideas for a genre I have not yet included, feel free to add it into the comments below or send me a message, and I’ll be happy to include it in this series!"}, {"5831": "Probably my favorite part of Open Legend is the narrative freedom of the system. Each of the Attribute scores in Open Legend are designed to be extremely open-ended, allowing the user to flavor their use of the Attribute to suit their character concept."}, {"7cc5": "To prove that Open Legend lends itself to every genre (with a little imagination) I’ve decided to make a character in every genre, with a single character sheet. I’m going to write a little backstory and describe their abilities using the exact same selection of Attributes, Feats, Boons, and Banes for every single one."}, {"0d48": "There is also a selection of Perks and Flaws available during character creation, and those are used mostly to explain your character’s personality and motivations. I’ll be switching these up between characters in order to tell more entertaining and enriching stories. The Perks and Flaws are designed to have limited impact on gameplay while enhancing the story you are trying to tell, so you don’t have to worry about them impacting the power level of the characters."}, {"4122": "Here’s the character sheet that I’ll be using. I even gave the character Companion II to show you how cool THAT can be in multi-genre."}, {"6be0": "Main Character Sheet:https://openlegend.heromuster.com/character?s=mainchara388"}, {"4cbd": "Companion Character Sheet:https://openlegend.heromuster.com/character?s=companion759"}, {"6ed6": "I’ll list the links of each genre here at the bottom of the inaugural article as I continue writing for this series. I hope you enjoy, and I appreciate any and all constructive feedback you’d like to send my way. Thanks for joining me!"}, {"0780": "Genres List"}, {"b38d": "— — — — — — — — — — — — — — — — — — — — — — — — — — — — — —"}, {"d3bf": "Anime"}, {"e320": "Contemporary Action/Adventure"}, {"3de3": "Established Universe"}, {"01db": "Lord of the RingsHarry PotterNarutoTwilightSupernaturalInuyashaPokemonBleachDoctor WhoYu-Gi-Oh!Fairy TailSherlockLord of the RingsDragon Ball ZFullmetal AlchemistMarvelDCScooby DooGhostbustersForgotten RealmsEberronElder ScrollsWorld of DarknessLooney TunesAvatar: the Last Airbender"}, {"9102": "Fantasy"}, {"36f7": "Aetherpunk/Arcanepunk Fantasy"}, {"7f59": "Dark/Horror Fantasy"}, {"21d1": "High Fantasy"}, {"46d0": "https://medium.com/@michaelloubier/multi-genre-characters-in-open-legend-high-fantasy-7848815f06a0"}, {"8982": "Historical Fantasy"}, {"8389": "Contemporary FantasyEdo Japan FantasyFuturistic FantasyIndustrial Age FantasyMedieval FantasyModern FantasyRenaissance Europe FantasyStone Age FantasyBronze Age FantasyWild West Fantasy"}, {"4ed8": "Steampunk Fantasy"}, {"aa1f": "Weird West Fantasy"}, {"df4b": "Historical"}, {"06f3": "Bronze AgeContemporaryEdo JapanFuturisticIndustrialMedievalModernPost-ApocalypticRenaissance EuropeStone AgeWild West"}, {"09b8": "Horror"}, {"48ac": "Humor"}, {"5e06": "Noir"}, {"ed0f": "Science Fiction"}, {"375b": "BiopunkCyberpunkSpace WesternSteampunk"}, {"f0ce": "Superhero"}, {"8449": "Of course, I’ve probably missed a few genres or subgenres, and I’m still working on expanding the list, so if you’ve got a good idea for a genre or subgenre that you’d like to see me try to adapt this character to, just let me know in a message or in the comments below. Thanks!"}], "content": "Multi-Genre Characters in Open Legend Note: I’m going to be using the HeroMuster Open Legend character sheet for this article, so special thanks to Mario Lurig ( @ucffool )for all his hard work on that! This is going to be a series of articles, and I’ll be writing one article for each genre. If I miss any genres, or you have any ideas for a genre I have not yet included, feel free to add it into the comments below or send me a message, and I’ll be happy to include it in this series! Probably my favorite part of Open Legend is the narrative freedom of the system. Each of the Attribute scores in Open Legend are designed to be extremely open-ended, allowing the user to flavor their use of the Attribute to suit their character concept. To prove that Open Legend lends itself to every genre (with a little imagination) I’ve decided to make a character in every genre, with a single character sheet. I’m going to write a little backstory and describe their abilities using the exact same selection of Attributes, Feats, Boons, and Banes for every single one. There is also a selection of Perks and Flaws available during character creation, and those are used mostly to explain your character’s personality and motivations. I’ll be switching these up between characters in order to tell more entertaining and enriching stories. The Perks and Flaws are designed to have limited impact on gameplay while enhancing the story you are trying to tell, so you don’t have to worry about them impacting the power level of the characters. Here’s the character sheet that I’ll be using. I even gave the character Companion II to show you how cool THAT can be in multi-genre. Main Character Sheet:https://openlegend.heromuster.com/character?s=mainchara388 Companion Character Sheet:https://openlegend.heromuster.com/character?s=companion759 I’ll list the links of each genre here at the bottom of the inaugural article as I continue writing for this series. I hope you enjoy, and I appreciate any and all constructive feedback you’d like to send my way. Thanks for joining me! Genres List — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — Anime Contemporary Action/Adventure Established Universe Lord of the RingsHarry PotterNarutoTwilightSupernaturalInuyashaPokemonBleachDoctor WhoYu-Gi-Oh!Fairy TailSherlockLord of the RingsDragon Ball ZFullmetal AlchemistMarvelDCScooby DooGhostbustersForgotten RealmsEberronElder ScrollsWorld of DarknessLooney TunesAvatar: the Last Airbender Fantasy Aetherpunk/Arcanepunk Fantasy Dark/Horror Fantasy High Fantasy https://medium.com/@michaelloubier/multi-genre-characters-in-open-legend-high-fantasy-7848815f06a0 Historical Fantasy Contemporary FantasyEdo Japan FantasyFuturistic FantasyIndustrial Age FantasyMedieval FantasyModern FantasyRenaissance Europe FantasyStone Age FantasyBronze Age FantasyWild West Fantasy Steampunk Fantasy Weird West Fantasy Historical Bronze AgeContemporaryEdo JapanFuturisticIndustrialMedievalModernPost-ApocalypticRenaissance EuropeStone AgeWild West Horror Humor Noir Science Fiction BiopunkCyberpunkSpace WesternSteampunk Superhero Of course, I’ve probably missed a few genres or subgenres, and I’m still working on expanding the list, so if you’ve got a good idea for a genre or subgenre that you’d like to see me try to adapt this character to, just let me know in a message or in the comments below. Thanks! ", "child": "1617_11617_1"}