{"name": "1621", "parent": "", "title": "5 Reasons Why Tabletop Gaming Is The Best Mid-Life Crisis You Can Have", "sentences": [{"8fba": "5 Reasons Why Tabletop Gaming Is The Best Mid-Life Crisis You Can Have"}, {"5cb1": "[Originally published by Tabletop Tribe]"}, {"f3a9": "Having discovered motorbikes in my twenties, the passion stayed with me for the next decade and a half until I helped bring a child into the world. At that point I considered that perhaps dangling off the side of a sports bike like a demented monkey and scraping my knee along the road at silly speeds wasn’t the most responsible lifestyle choice any more."}, {"bedd": "However, it does mean that as I approach my 45th year on the planet, I haven’t had any mid-life urge to go out and buy the latest crotch rocket and twist-grip myself into an early grave. At least not yet."}, {"8382": "Instead, the past few years have seen me rediscovering a hobby that has been with me since childhood: tabletop games. And by that I mean rediscovering an (un)healthy obsession with tabletop games, only now I have a bigger budget."}, {"33ba": "Not obsessive at all. Perfectly healthy."}, {"1300": "Whilst my wife may roll her eyes when another delivery person arrives at the door with their knees buckling under the weight of yet more boxes of shrink-wrapped joy for me, she has to admit that as mid-life crises go, things could be a lot worse."}, {"1980": "So what makes rolling dice, flipping cards and shuffling little counters around on a table a viable option for a middle-ager?"}, {"24b9": "1. Better (and cheaper) than the pub"}, {"227c": "Too old for this…"}, {"37ca": "Whilst my tolerance to alcohol seems to diminish with every passing year, there’s no doubt that as I get older I seem to end up down the pub more frequently, where the temptation to binge is always present. A regular games night therefore provides a feasible alternative to a weekly pub quiz excuse for boozing."}, {"d68e": "Of course I’d like to pretend that the average games night is a healthy, teetotal affair, but that would be a complete lie, at least as far as my own gaming group is concerned. So for us at least, this is more about budget than health."}, {"f305": "With the average round of drinks for just four people heading towards the £20 mark, you’re much better off gathering around a table for some gaming at a mate’s house and each bringing a bottle of rather decent wine with you."}, {"7156": "All in all it’s better quality booze, music and company than you can expect down your local, and you’ll be quids in at the end of the night in comparison."}, {"c413": "2. Fairly economic as hobbies go"}, {"73e1": "A standard gamer’s relationship with Kickstarter"}, {"e90d": "Harping back to my motorcycling days again, I recall that it was not cheap, even when I wasn’t crashing the thing. In fact I made a point of telling my bike garage never, ever, under any circumstances to tell me how much I’d spent with them over the years. It would be too traumatic."}, {"0781": "Now many might consider modern board games a pretty penny themselves, especially with some costing almost (or even over) £100. But when you consider the number of hours of entertainment that you can get out of them, they’re really not that expensive, especially when compared to a trip to the cinema or a night out on the tiles."}, {"fc35": "What’s more, if you look on eBay, the resale value of many games is really rather healthy. In fact when games go out of print (or if they were Kickstarter exclusives) you might even find they’re worth more than what you paid for them."}, {"5d71": "So if you can’t afford to start investing in modern art, putting your money into board games isn’t a bad shout, and is much more of a giggle."}, {"d856": "3. Your family won’t be playing the usual games at Christmas"}, {"1780": "At least the games getting flipped by the family will be better"}, {"b2b8": "Chances are that even if you’re not a tabletop gaming fanatic, you’ve played a number of the usual suspects during the festive season, such as Monopoly, Cluedo or Risk. But whatever the games, they usually share one thing in common: they’re crap. What’s more, many of them seem to fuel the kind of family feuds rarely seen outside of Renaissance Italy."}, {"a2de": "That’s not to say you shouldn’t pick your introductory games carefully — Lifeboats is as likely to fuel a table-flipping tantrum as Monopoly — but chances are you’ll have some titles in your collection that will not only bring the family together, but will mean you don’t have to gouge your eyes out with boredom over the usual gaming fodder."}, {"2e96": "What’s more it’s a great way to bring the generations together: it’s heartening to watch grandma playing Ca$h’n’Gun$ and popping a cap in her grandchild."}, {"af0b": "4. A good alternative to the dating game"}, {"0b74": "Harsh, but fair"}, {"818d": "At one time in the not too distant past, tabletop gaming mainly seemed the preserve of white, heterosexual men. Often chronically single to boot. Today the gaming community has a far more welcoming and diverse flavour to it, and that diversity only seems to increase year on year."}, {"c9b7": "As such, if you’re 40+ and single, there’s no better time to ditch the online dating scene and get back to some analogue methods of meeting people, in much the same way as folk are ditching digital gaming in favour of the tabletop."}, {"83f0": "Not only are you likely to find groups of people with at least a modicum of intelligence, but there are no uncomfortable silences to be had either — you’re just thinking about your next move!"}, {"c04b": "5. Keeps your mind sharp"}, {"fffc": "Image: “Geri’s Game” — Pixar/Disney"}, {"f5cf": "I don’t want to make you feel ancient or anything, but none of us are getting any younger, yeah? Whilst creeping senility might be the furthest things from your (ageing) mind at the moment, it’s as important in mid to later life to keep your mind as active as your body."}, {"5f5d": "Now you could achieve that by simply doing a crossword or Sudoku every day, but I’d suggest that a board game or three is a far more enjoyable and infinitely more sociable way of going about it. It’ll offset the alcohol at any rate."}, {"dae5": "Of course it also means that if you keep your gaming group going for the next few decades, you’re unlikely to be lonely as you approach your twilight years either. That’s if they can keep you off the Playstation 9."}, {"e26a": "So if you’ve read this as one of the uninitiated and are feeling the mid-life itch to buy that absurd sports car or embarrass yourself squeezing your paunch into motorcycle leathers, do yourself a favour and peruse this list of gateway games to a whole new world of beer, buddies and board games. You know you want to."}, {"ad41": "[Please check out my other gaming articles on Tabletop Tribe and gimme a SHARE on Twitter, FB and the like. It’d mean the world!]"}], "content": "5 Reasons Why Tabletop Gaming Is The Best Mid-Life Crisis You Can Have [Originally published by Tabletop Tribe] Having discovered motorbikes in my twenties, the passion stayed with me for the next decade and a half until I helped bring a child into the world. At that point I considered that perhaps dangling off the side of a sports bike like a demented monkey and scraping my knee along the road at silly speeds wasn’t the most responsible lifestyle choice any more. However, it does mean that as I approach my 45th year on the planet, I haven’t had any mid-life urge to go out and buy the latest crotch rocket and twist-grip myself into an early grave. At least not yet. Instead, the past few years have seen me rediscovering a hobby that has been with me since childhood: tabletop games. And by that I mean rediscovering an (un)healthy obsession with tabletop games, only now I have a bigger budget. Not obsessive at all. Perfectly healthy. Whilst my wife may roll her eyes when another delivery person arrives at the door with their knees buckling under the weight of yet more boxes of shrink-wrapped joy for me, she has to admit that as mid-life crises go, things could be a lot worse. So what makes rolling dice, flipping cards and shuffling little counters around on a table a viable option for a middle-ager? 1. Better (and cheaper) than the pub Too old for this… Whilst my tolerance to alcohol seems to diminish with every passing year, there’s no doubt that as I get older I seem to end up down the pub more frequently, where the temptation to binge is always present. A regular games night therefore provides a feasible alternative to a weekly pub quiz excuse for boozing. Of course I’d like to pretend that the average games night is a healthy, teetotal affair, but that would be a complete lie, at least as far as my own gaming group is concerned. So for us at least, this is more about budget than health. With the average round of drinks for just four people heading towards the £20 mark, you’re much better off gathering around a table for some gaming at a mate’s house and each bringing a bottle of rather decent wine with you. All in all it’s better quality booze, music and company than you can expect down your local, and you’ll be quids in at the end of the night in comparison. 2. Fairly economic as hobbies go A standard gamer’s relationship with Kickstarter Harping back to my motorcycling days again, I recall that it was not cheap, even when I wasn’t crashing the thing. In fact I made a point of telling my bike garage never, ever, under any circumstances to tell me how much I’d spent with them over the years. It would be too traumatic. Now many might consider modern board games a pretty penny themselves, especially with some costing almost (or even over) £100. But when you consider the number of hours of entertainment that you can get out of them, they’re really not that expensive, especially when compared to a trip to the cinema or a night out on the tiles. What’s more, if you look on eBay, the resale value of many games is really rather healthy. In fact when games go out of print (or if they were Kickstarter exclusives) you might even find they’re worth more than what you paid for them. So if you can’t afford to start investing in modern art, putting your money into board games isn’t a bad shout, and is much more of a giggle. 3. Your family won’t be playing the usual games at Christmas At least the games getting flipped by the family will be better Chances are that even if you’re not a tabletop gaming fanatic, you’ve played a number of the usual suspects during the festive season, such as Monopoly, Cluedo or Risk. But whatever the games, they usually share one thing in common: they’re crap. What’s more, many of them seem to fuel the kind of family feuds rarely seen outside of Renaissance Italy. That’s not to say you shouldn’t pick your introductory games carefully — Lifeboats is as likely to fuel a table-flipping tantrum as Monopoly — but chances are you’ll have some titles in your collection that will not only bring the family together, but will mean you don’t have to gouge your eyes out with boredom over the usual gaming fodder. What’s more it’s a great way to bring the generations together: it’s heartening to watch grandma playing Ca$h’n’Gun$ and popping a cap in her grandchild. 4. A good alternative to the dating game Harsh, but fair At one time in the not too distant past, tabletop gaming mainly seemed the preserve of white, heterosexual men. Often chronically single to boot. Today the gaming community has a far more welcoming and diverse flavour to it, and that diversity only seems to increase year on year. As such, if you’re 40+ and single, there’s no better time to ditch the online dating scene and get back to some analogue methods of meeting people, in much the same way as folk are ditching digital gaming in favour of the tabletop. Not only are you likely to find groups of people with at least a modicum of intelligence, but there are no uncomfortable silences to be had either — you’re just thinking about your next move! 5. Keeps your mind sharp Image: “Geri’s Game” — Pixar/Disney I don’t want to make you feel ancient or anything, but none of us are getting any younger, yeah? Whilst creeping senility might be the furthest things from your (ageing) mind at the moment, it’s as important in mid to later life to keep your mind as active as your body. Now you could achieve that by simply doing a crossword or Sudoku every day, but I’d suggest that a board game or three is a far more enjoyable and infinitely more sociable way of going about it. It’ll offset the alcohol at any rate. Of course it also means that if you keep your gaming group going for the next few decades, you’re unlikely to be lonely as you approach your twilight years either. That’s if they can keep you off the Playstation 9. So if you’ve read this as one of the uninitiated and are feeling the mid-life itch to buy that absurd sports car or embarrass yourself squeezing your paunch into motorcycle leathers, do yourself a favour and peruse this list of gateway games to a whole new world of beer, buddies and board games. You know you want to. [Please check out my other gaming articles on Tabletop Tribe and gimme a SHARE on Twitter, FB and the like. It’d mean the world!] ", "child": "1621_1\t1621_2\t1621_3\t1621_4\t1621_5"}