{"name": "1630", "parent": "", "title": "University president cuts top women’s hockey program, calls it a ‘boutique sport’", "sentences": [{"bf76": "University president cuts top women’s hockey program, calls it a ‘boutique sport’"}, {"8516": "“It felt like getting punched in the gut.”"}, {"c80e": "CREDIT: Twitter"}, {"c257": "On March 30, just over 24 hours after the United States women’s national hockey team (USWNT) secured a historic contract from USA Hockey that promises a bright future for the sport, the University of North Dakota announced abruptly that it was cutting its women’s hockey program."}, {"ffb6": "The announcement was a huge blow to the women’s hockey community. The UND women’s team is one of the top NCAA hockey programs in the country — it was ranked sixth nationally coming into this season. Twelve of its alumni or current players competed at the world championships this year, and seven won medals, including USWNT players and twins, Monique Lamoureux-Morando and Jocelyne Lamoureux-Davidson."}, {"6e03": "Lamoureux-Morando worked as a volunteer assistant coach for the UND women’s team, and Lamoureux-Davidson was the team’s trainer. Both of them found out about the end of the program through social media, right after they’d checked into their hotel at the world championships. No current UND players or staff were notified of the decision before word got out online."}, {"295d": "“It felt like getting punched in the gut,” Lamoureux-Morando told ThinkProgress. “We had such a big victory for women’s hockey, women’s sports, then just for that to happen the next day.”"}, {"e96e": "“It’s a complete lack of respect of female athletes to refer to us as ‘boutique’”"}, {"c04e": "While the Lamoureuxes fought for their country on the ice — eventually winning the world championship gold medal last Friday — they watched from afar as the UND women’s team fought for its future, in part with a #NeverEndTheFight campaign on twitter that mirrored the USWNT’s #BeBoldForChange campaign weeks prior."}, {"7d50": "But unlike the fight for a fair contract, this fight is unlikely to get a Hollywood ending."}, {"3f05": "Earlier this week, UND women’s hockey head coach Brian Idalski met with UND President Mark Kennedy to see what, if anything, could be done to save the program. Rumors quickly spread on the internet that the meeting did not go well."}, {"8a5d": "“It’s definitely over,” a message board comment read, reporting that Kennedy told Idalski, “Women’s hockey is a boutique sport and never should have been at UND.”"}, {"2f24": "That “boutique sport” quote quickly went viral in the women’s hockey community. The Lamoureux twins referenced the “sexist remarks” in a Facebook post on Wednesday."}, {"1e74": "In an attempt to verify this comment, ThinkProgress reached out to Kennedy and UND on Thursday. Kennedy seems to have disconnected his public office number, and the operators for UND’s public switchboard did not pick up, even during business hours. But Peter B. Johnson, UND’s Interim Vice President for University & Public Affairs, responded to our request by email."}, {"5a13": "Johnson suggested the comment has been taken out of context, but did not deny the accuracy of the quote itself."}, {"27d6": "“The quote doesn’t capture the full context of the conversations referenced, which is that there is no good way, given the current fiscal realities, to sustain the nearly $2 million annual deficit in the women’s hockey program,” Johnson wrote in an email to ThinkProgress."}, {"6fb2": "“It’s a complete lack of respect of female athletes to refer to us as ‘boutique,’” Lamoureux-Morando told ThinkProgress. “I don’t think he has any world championships around his neck. It’s 2017, let’s get with the times.”"}, {"362f": "The end of the UND program is a big loss for the worldwide hockey community, as Michael Pfuhl, the Secretary General of the German Hockey Federation noted in a letter to Kennedy and UND Athletic Director Brian Faison."}, {"3ea0": "“Mr. President, your University is a key to global development in women’s sport and women’s opportunities, the thin fabric of women’s hockey would have a darker future with the decision to cut the women’s hockey program,” Pfuhl wrote."}, {"ef4b": "Kate Cimini reported for SI.com that in the fall of 2016, athletics director Brian Faison asked seven “at-risk” teams to present proposals arguing why their programs should be saved. Women’s hockey was not one of these teams."}, {"0092": "Now, because the decision was made so late in the spring, it’s going to be difficult for UND women’s hockey players to find roster spots on other Division I teams, which could mean the end of hockey dreams for many of the women. This decision blindsided everyone in the program, including a recruit who was on campus touring the facilities at the time the news broke, and Coach Idalski."}, {"c5f1": "“I knew options were being discussed and considered but leading up to it there was no indication we were being cut,” Idalski told SI.com. “Obviously, you’re a little concerned [when you know budget cuts are coming] and you’re wondering what direction but everything kept going. I booked all my recruit travel for the month of April, I booked [recruit] visits. I had budget meetings with university officials the day before were were cut; I had a meeting with the AD talking about assistant coach contracts the week before. There really was no inkling that this was coming.”"}, {"8f93": "The university was asked to cut $1.3 million from its budget, but ended up cutting around $3 million by ending the men’s and women’s swimming programs and women’s hockey. Due to federal regulations, $700,000 of that money will have to be reallocated to other scholarships."}, {"1998": "Women’s hockey costs around $1.9 million a year to fund, less than half what UND’s football program does, and the team has a huge impact on the Grand Forks community."}, {"3e09": "Most people point out that football and men’s hockey bring in more revenue than women’s hockey does. But it’s tough to make the direct comparison — after all, the women’s hockey team has only been around since 2002, while the men’s hockey team at UND was established in 1929."}, {"1b57": "Plus, Ian Humsey, a 2016 UND graduate and former UND men’s and women’s hockey student assistant equipment manager, wrote for the Grand Forks Herald that the women’s team never received adequate support from the athletic department."}, {"1a4b": "“When it came to actual attention to growth, the team was treated by the department as, at best, a burden,” Humsey wrote."}, {"84c5": "Lamoureux-Morando and other UND athletes and alumni are sympathetic to the fact that, over the past couple of years, budget constraints have put pressure on UND to tighten up its athletics spending. But they feel very disrespected by the way the decision was handled, and by the fact that Kennedy has essentially disappeared since the announcement."}, {"7187": "“How it happened, the way it happened, it was so unacceptable.”"}, {"9207": "“After he sent out the response, he hasn’t spoken publicly. He’s disconnected his phone and he isn’t taking calls. He’s not owning his decision and he’s trying to pass the buck off to other people, and to me it shows a complete lack of character,” Lamoureux-Morando said."}, {"5e0b": "“How it happened, the way it happened, it was so unacceptable.”"}, {"099b": "The last-gasp hope for the women’s team is a Title IX lawsuit, but its unclear at this time if they will be filing one. Lamoureux-Morando feels that the team is already manipulating rosters so that it can bypass regulations, and the Title IX investigation done by UND attorneys prior to the cuts being made has been deemed confidential, despite a FOIA request."}, {"40c3": "No matter what happens going forward, Lamoureux-Morando is proud of the way both the USWNT and the UND women’s team have fought back against discrimination over the past month."}, {"e105": "“If I have a daughter one day, I want to teach her to stand up for what is right, especially if she sees something unfair. If I don’t do that myself, how can I expect my daughter to?” she said."}, {"f071": "“The unity we had as a team, as women, it’s something people should take note of.”"}], "content": "University president cuts top women’s hockey program, calls it a ‘boutique sport’ “It felt like getting punched in the gut.” CREDIT: Twitter On March 30, just over 24 hours after the United States women’s national hockey team (USWNT) secured a historic contract from USA Hockey that promises a bright future for the sport, the University of North Dakota announced abruptly that it was cutting its women’s hockey program. The announcement was a huge blow to the women’s hockey community. The UND women’s team is one of the top NCAA hockey programs in the country — it was ranked sixth nationally coming into this season. Twelve of its alumni or current players competed at the world championships this year, and seven won medals, including USWNT players and twins, Monique Lamoureux-Morando and Jocelyne Lamoureux-Davidson. Lamoureux-Morando worked as a volunteer assistant coach for the UND women’s team, and Lamoureux-Davidson was the team’s trainer. Both of them found out about the end of the program through social media, right after they’d checked into their hotel at the world championships. No current UND players or staff were notified of the decision before word got out online. “It felt like getting punched in the gut,” Lamoureux-Morando told ThinkProgress. “We had such a big victory for women’s hockey, women’s sports, then just for that to happen the next day.” “It’s a complete lack of respect of female athletes to refer to us as ‘boutique’” While the Lamoureuxes fought for their country on the ice — eventually winning the world championship gold medal last Friday — they watched from afar as the UND women’s team fought for its future, in part with a #NeverEndTheFight campaign on twitter that mirrored the USWNT’s #BeBoldForChange campaign weeks prior. But unlike the fight for a fair contract, this fight is unlikely to get a Hollywood ending. Earlier this week, UND women’s hockey head coach Brian Idalski met with UND President Mark Kennedy to see what, if anything, could be done to save the program. Rumors quickly spread on the internet that the meeting did not go well. “It’s definitely over,” a message board comment read, reporting that Kennedy told Idalski, “Women’s hockey is a boutique sport and never should have been at UND.” That “boutique sport” quote quickly went viral in the women’s hockey community. The Lamoureux twins referenced the “sexist remarks” in a Facebook post on Wednesday. In an attempt to verify this comment, ThinkProgress reached out to Kennedy and UND on Thursday. Kennedy seems to have disconnected his public office number, and the operators for UND’s public switchboard did not pick up, even during business hours. But Peter B. Johnson, UND’s Interim Vice President for University & Public Affairs, responded to our request by email. Johnson suggested the comment has been taken out of context, but did not deny the accuracy of the quote itself. “The quote doesn’t capture the full context of the conversations referenced, which is that there is no good way, given the current fiscal realities, to sustain the nearly $2 million annual deficit in the women’s hockey program,” Johnson wrote in an email to ThinkProgress. “It’s a complete lack of respect of female athletes to refer to us as ‘boutique,’” Lamoureux-Morando told ThinkProgress. “I don’t think he has any world championships around his neck. It’s 2017, let’s get with the times.” The end of the UND program is a big loss for the worldwide hockey community, as Michael Pfuhl, the Secretary General of the German Hockey Federation noted in a letter to Kennedy and UND Athletic Director Brian Faison. “Mr. President, your University is a key to global development in women’s sport and women’s opportunities, the thin fabric of women’s hockey would have a darker future with the decision to cut the women’s hockey program,” Pfuhl wrote. Kate Cimini reported for SI.com that in the fall of 2016, athletics director Brian Faison asked seven “at-risk” teams to present proposals arguing why their programs should be saved. Women’s hockey was not one of these teams. Now, because the decision was made so late in the spring, it’s going to be difficult for UND women’s hockey players to find roster spots on other Division I teams, which could mean the end of hockey dreams for many of the women. This decision blindsided everyone in the program, including a recruit who was on campus touring the facilities at the time the news broke, and Coach Idalski. “I knew options were being discussed and considered but leading up to it there was no indication we were being cut,” Idalski told SI.com. “Obviously, you’re a little concerned [when you know budget cuts are coming] and you’re wondering what direction but everything kept going. I booked all my recruit travel for the month of April, I booked [recruit] visits. I had budget meetings with university officials the day before were were cut; I had a meeting with the AD talking about assistant coach contracts the week before. There really was no inkling that this was coming.” The university was asked to cut $1.3 million from its budget, but ended up cutting around $3 million by ending the men’s and women’s swimming programs and women’s hockey. Due to federal regulations, $700,000 of that money will have to be reallocated to other scholarships. Women’s hockey costs around $1.9 million a year to fund, less than half what UND’s football program does, and the team has a huge impact on the Grand Forks community. Most people point out that football and men’s hockey bring in more revenue than women’s hockey does. But it’s tough to make the direct comparison — after all, the women’s hockey team has only been around since 2002, while the men’s hockey team at UND was established in 1929. Plus, Ian Humsey, a 2016 UND graduate and former UND men’s and women’s hockey student assistant equipment manager, wrote for the Grand Forks Herald that the women’s team never received adequate support from the athletic department. “When it came to actual attention to growth, the team was treated by the department as, at best, a burden,” Humsey wrote. Lamoureux-Morando and other UND athletes and alumni are sympathetic to the fact that, over the past couple of years, budget constraints have put pressure on UND to tighten up its athletics spending. But they feel very disrespected by the way the decision was handled, and by the fact that Kennedy has essentially disappeared since the announcement. “How it happened, the way it happened, it was so unacceptable.” “After he sent out the response, he hasn’t spoken publicly. He’s disconnected his phone and he isn’t taking calls. He’s not owning his decision and he’s trying to pass the buck off to other people, and to me it shows a complete lack of character,” Lamoureux-Morando said. “How it happened, the way it happened, it was so unacceptable.” The last-gasp hope for the women’s team is a Title IX lawsuit, but its unclear at this time if they will be filing one. Lamoureux-Morando feels that the team is already manipulating rosters so that it can bypass regulations, and the Title IX investigation done by UND attorneys prior to the cuts being made has been deemed confidential, despite a FOIA request. No matter what happens going forward, Lamoureux-Morando is proud of the way both the USWNT and the UND women’s team have fought back against discrimination over the past month. “If I have a daughter one day, I want to teach her to stand up for what is right, especially if she sees something unfair. If I don’t do that myself, how can I expect my daughter to?” she said. “The unity we had as a team, as women, it’s something people should take note of.” ", "child": "1630_1\t1630_2\t1630_3"}