{"name": "1633", "parent": "", "title": "A Friday Chat on Olympics and Ads", "sentences": [{"9fc5": "A Friday Chat on Olympics and Ads"}, {"5781": "ESTER: Hello! Isn’t it amazing we get to live in a world alongside Simone Biles?"}, {"952e": "NICOLE: Yes. She is captivating, and so talented. Were you super-obsessed with gymnastics when you were a kid? I used to just stare at the television."}, {"af4a": "ESTER: I think a lot of kids do because the gymnasts seem somehow more kid-like than a lot of other athletes — like what they do should be accessible, but of course it isn’t. In actuality it’s like these kid-shaped people have super powers."}, {"1973": "The Fine Line: What Makes Simone Biles the World's Best GymnastPRODUCED BYRodrigo De Benito Sanz, Alicia DeSantis, Alexandra Garcia, Mika Gröndahl, Evan Grothjan, Taige Jensen…www.nytimes.com"}, {"5ce6": "That makes watching them all the more alluring. I could never even do a cartwheel, myself."}, {"3451": "NICOLE: My dad built my sister and me a “balance beam” in the backyard. It was maybe six inches off the ground. We would do “routines,” and I remember my mom and her friend saying that gymnastics used to be like that, 20–30 years ago (and that would be 20–30 years before the 1990s). So I was a little kid, hearing my mom and her friend talking about how gymnastics used to just be people walking around on balance beams and pointing their toes, not doing flips or anything, and I was all “I could have been an Olympic gymnast.” Probably not, though."}, {"c2bf": "ESTER: Real question: do you think this year will be the tipping point for the idea that losing to a girl is such an insult? Between Simone Biles, who has been anointed the world’s best gymnast, period, and Serena Williams, and Theresa May in the UK and Hillary Clinton here … It seems like maybe it’s time for a very tired idea to cough three times and expire at last."}, {"bd4d": "NICOLE: And Katie Ledecky! I’m trying to find that article where the guy is all “if I swim laps against Ledecky, she’ll win, and that’s awesome.” I swear I saw it on Tumblr a billion times yesterday."}, {"160a": "The Olympics IssueThere is something about the Olympics and time. It's not just that we obsessively measure, right down to the…www.nytimes.com"}, {"9899": "That’s super long, so here’s the quote:"}, {"1a3e": "“She is no easy task to beat in practice, even as a male,” [Conor Dwyer] said. “I didn’t get broken by her, so I’m happy with that.” He added: “I saw her break a lot of guys in practice. … What I mean is if we’re doing a 3K threshold” — 30 all-out 100 frees — “she’ll just start beating you every single hundred, and slowly but surely you get broken like you do in a long race, like a mile. Your morale goes down pretty quickly when you get broken by a female in practice. I saw a couple of guys have to get yanked out of workout because they got beat by her.”"}, {"00bd": "When I asked Ledecky about this, she claimed not to have noticed. “I was probably just concentrating on doing my own work,” she said."}, {"a9ce": "ESTER: Right! I saw that on Twitter and replied with the Jonah Hill’s profile with the Times Magazine last weekend."}, {"363c": "Jonah Hill Is No JokeJonah Hill Is No Joke Richard Burbridge for The New York Times You can tell a lot about a person by watching him lose…mobile.nytimes.com"}, {"c3cf": "Someone tried to tease him about losing to a girl in ping pong and Hill was like, “Who cares?” Apparently he was gracious in defeat, but he won even more points from me for batting away that tenacious, malicious idea, that losing to a female competitor is somehow extra shameful."}, {"44e5": "Jonah Hill (?!) is the FUTURE."}, {"900d": "NICOLE: I hadn’t seen that story yet. So Molly Young interviews Jonah Hill, and he’s all, “We need to do this over an activity, like ping pong?” Can I start suggesting that people who want to interview me do it over mini-golf or something?"}, {"1fd7": "ESTER: I think it’s brilliant. When I was into theater, I remember being told by a teacher that one of the best things you can have your actors do is work together on a project unrelated to the show. Both to build a kind of comfort and rapport that they can carry with them on-stage, and also sometimes on-stage, too, because it will make the scene better and more interesting if it occurs while they’re preoccupied with a completely different task."}, {"b1c6": "NICOLE: Oh, for sure. I guess I didn’t answer your original question though, about whether this might be the year that the concept of “losing to a girl” as an insult goes away FOREVER."}, {"00cb": "ESTER: Or, well, loses a good part of its sting, at least. The year it starts to seem kind of ridiculous."}, {"6366": "NICOLE: I am not quite that optimistic, unfortunately, but I think it could be the start of that. It’s in the universe’s five-year plan!"}, {"9790": "ESTER: What will Donald Trump do when he loses to “a girl”? I can’t wait to find out. (Although the dog whistling he just did to “2nd amendment people” was, perhaps, a terrifying preview.)"}, {"18c9": "But back to more Billfold-y topics: was your Sling trial the first time you’ve tried one of those customizable cable substitutes?"}, {"ecd8": "NICOLE: Yeah, I guess if you don’t count Netflix, Hulu, HBO Now, and Amazon Prime. But none of those are designed to simulate the cable experience; they’re all designed to get rid of the parts of cable that are annoying (like, most of the channels, the commercials — unless you’re Hulu — and so on). So no, I have not tried a true streaming cable substitute until Sling."}, {"98d8": "I Tried Using Sling to Watch the OlympicsIt worked fine for the Olympics. Not super great for anything else.thebillfold.com"}, {"c246": "ESTER: I’ve never tried one, so I was very curious to read about your experience! I laughed at your line about commercials. The weirdest part of watching TV live these days, which I get to do so rarely, is being startled by all the ads. There are so many of them, and they are so loud and bright and painfully mediocre so much of the time. Did you know that the original point of cable was no ads?"}, {"b864": "NICOLE: When did that happen? My experience of cable has always included ads. The only channel with no ads was PBS, and even then they started sneaking ads in between the shows. Plus the telethons."}, {"0d88": "ESTER: I was taught that originally, the point of cable was that consumers would pay for it, and in exchange they wouldn’t get commercials. But then cable companies started realizing they could also get advertisers to pay and customers wouldn’t mind, or at least not too much. So now basically the only channels without ads are super-high-premium ones like HBO."}, {"653d": "Meanwhile here’s a terrifying piece about cable companies speeding up movies and TV shows to cram in yet more commercials."}, {"5789": "Cable TV Shows Are Sped Up to Squeeze in More AdsWhen Stephen Cox was watching \"The Wizard of Oz\" on TBS last November, something didn't sound quite right to him about…www.wsj.com"}, {"3f5f": "NICOLE: I saw that one! It didn’t surprise me. Remember when they used to reformat widescreen movies for our square TVs and every once in a while they’d do this weird pan thing so they could get something on the edge of the widescreen that was important to the story? It’s, like, of course they’d speed things up if they wanted to. Or cut out the parts they find too offensive for prime time."}, {"c896": "They were also doing that for Broadway cast albums, at least in one case: The original cast album of A Little Night Music has one song pitched up, just so they could squeeze everything in there. (They fixed it for the remastered CD version.) But at least they aren’t trying to squeeze in an ad."}, {"b9a0": "Do you think CDs would have started to come with ads, had CDs not died before they got the chance?"}, {"c964": "ESTER: What a crazy thought! Probably."}, {"2830": "NICOLE: They did it for DVDs, and then blocked the ability to go to the menu until the ads were over. But it’s harder to imagine how they could do it for CDs, unless everyone just agreed to listen to an ad before they started listening to their music. We do that for Spotify and Pandora, after all."}, {"daad": "ESTER: And now for podcasts, of course. It’s such a bizarre experience, hearing a voice I like and trust suddenly get all bright and start extolling the virtues of a Casper mattress or a website built with Squarespace. (Squarespace: build it beautiful!)"}, {"d770": "NICOLE: Ester, I am seriously going to buy a new mattress before the summer is over and a little voice in my head keeps saying, “You should try Casper, they’ll take it back if you don’t like it, plus you’ll get a discount code.”"}, {"85ee": "ESTER: You should try Casper! And Blue Apron and Harry’s razors and …"}, {"e37f": "NICOLE: Not MeUndies, though. I’ve heard that those are not as good as the podcasters advertise."}, {"cf2d": "ESTER: What about the weird bathroom spray that traps the smell under the water (?!?) or something? Have you ever met anyone who’s tried that? The hosts are always like, “Try ‘UNoPoo,’ [or whatever it’s called], and yes, it’s for real!”"}, {"6f5c": "NICOLE: You mean Poo-Pourri, the spray that traps smells under the toilet?"}, {"bc16": "Trap-A-CrapNever leave a trail...An odor trapper for any crapper . It's Poo hunting season, and you don't miss. Poo~Pourri Trap-A…www.poopourri.com"}, {"fe5f": "ESTER: I’m laughing pretty hard. Under the water of the toilet, I think? And yes, that’s exactly what I was trying to remember."}, {"7b72": "NICOLE: I already have a device that traps smells in the toilet. It is called a toilet lid."}, {"e64f": "ESTER: ((thumbs up))"}, {"1690": "I’ve never bought anything because it was advertised on a podcast but I do feel a generalized affection for those products and services because they’re making possible the audio I love."}, {"69e6": "NICOLE: I can’t say the same. I am wearing Warby Parker glasses right now."}, {"db7a": "ESTER: Whose discount code did you use to get 10% off your first purchase? Because that’s the other thing! If I actually caved and tried Squarespace or whatever, how would I decide whose code to use? It would be like playing favorites."}, {"56ce": "NICOLE: … I think I remembered the advertising but forgot to use the discount code."}, {"b3a0": "ESTER: ((thumbs up again))"}], "content": "A Friday Chat on Olympics and Ads ESTER: Hello! Isn’t it amazing we get to live in a world alongside Simone Biles? NICOLE: Yes. She is captivating, and so talented. Were you super-obsessed with gymnastics when you were a kid? I used to just stare at the television. ESTER: I think a lot of kids do because the gymnasts seem somehow more kid-like than a lot of other athletes — like what they do should be accessible, but of course it isn’t. In actuality it’s like these kid-shaped people have super powers. The Fine Line: What Makes Simone Biles the World's Best GymnastPRODUCED BYRodrigo De Benito Sanz, Alicia DeSantis, Alexandra Garcia, Mika Gröndahl, Evan Grothjan, Taige Jensen…www.nytimes.com That makes watching them all the more alluring. I could never even do a cartwheel, myself. NICOLE: My dad built my sister and me a “balance beam” in the backyard. It was maybe six inches off the ground. We would do “routines,” and I remember my mom and her friend saying that gymnastics used to be like that, 20–30 years ago (and that would be 20–30 years before the 1990s). So I was a little kid, hearing my mom and her friend talking about how gymnastics used to just be people walking around on balance beams and pointing their toes, not doing flips or anything, and I was all “I could have been an Olympic gymnast.” Probably not, though. ESTER: Real question: do you think this year will be the tipping point for the idea that losing to a girl is such an insult? Between Simone Biles, who has been anointed the world’s best gymnast, period, and Serena Williams, and Theresa May in the UK and Hillary Clinton here … It seems like maybe it’s time for a very tired idea to cough three times and expire at last. NICOLE: And Katie Ledecky! I’m trying to find that article where the guy is all “if I swim laps against Ledecky, she’ll win, and that’s awesome.” I swear I saw it on Tumblr a billion times yesterday. The Olympics IssueThere is something about the Olympics and time. It's not just that we obsessively measure, right down to the…www.nytimes.com That’s super long, so here’s the quote: “She is no easy task to beat in practice, even as a male,” [Conor Dwyer] said. “I didn’t get broken by her, so I’m happy with that.” He added: “I saw her break a lot of guys in practice. … What I mean is if we’re doing a 3K threshold” — 30 all-out 100 frees — “she’ll just start beating you every single hundred, and slowly but surely you get broken like you do in a long race, like a mile. Your morale goes down pretty quickly when you get broken by a female in practice. I saw a couple of guys have to get yanked out of workout because they got beat by her.” When I asked Ledecky about this, she claimed not to have noticed. “I was probably just concentrating on doing my own work,” she said. ESTER: Right! I saw that on Twitter and replied with the Jonah Hill’s profile with the Times Magazine last weekend. Jonah Hill Is No JokeJonah Hill Is No Joke Richard Burbridge for The New York Times You can tell a lot about a person by watching him lose…mobile.nytimes.com Someone tried to tease him about losing to a girl in ping pong and Hill was like, “Who cares?” Apparently he was gracious in defeat, but he won even more points from me for batting away that tenacious, malicious idea, that losing to a female competitor is somehow extra shameful. Jonah Hill (?!) is the FUTURE. NICOLE: I hadn’t seen that story yet. So Molly Young interviews Jonah Hill, and he’s all, “We need to do this over an activity, like ping pong?” Can I start suggesting that people who want to interview me do it over mini-golf or something? ESTER: I think it’s brilliant. When I was into theater, I remember being told by a teacher that one of the best things you can have your actors do is work together on a project unrelated to the show. Both to build a kind of comfort and rapport that they can carry with them on-stage, and also sometimes on-stage, too, because it will make the scene better and more interesting if it occurs while they’re preoccupied with a completely different task. NICOLE: Oh, for sure. I guess I didn’t answer your original question though, about whether this might be the year that the concept of “losing to a girl” as an insult goes away FOREVER. ESTER: Or, well, loses a good part of its sting, at least. The year it starts to seem kind of ridiculous. NICOLE: I am not quite that optimistic, unfortunately, but I think it could be the start of that. It’s in the universe’s five-year plan! ESTER: What will Donald Trump do when he loses to “a girl”? I can’t wait to find out. (Although the dog whistling he just did to “2nd amendment people” was, perhaps, a terrifying preview.) But back to more Billfold-y topics: was your Sling trial the first time you’ve tried one of those customizable cable substitutes? NICOLE: Yeah, I guess if you don’t count Netflix, Hulu, HBO Now, and Amazon Prime. But none of those are designed to simulate the cable experience; they’re all designed to get rid of the parts of cable that are annoying (like, most of the channels, the commercials — unless you’re Hulu — and so on). So no, I have not tried a true streaming cable substitute until Sling. I Tried Using Sling to Watch the OlympicsIt worked fine for the Olympics. Not super great for anything else.thebillfold.com ESTER: I’ve never tried one, so I was very curious to read about your experience! I laughed at your line about commercials. The weirdest part of watching TV live these days, which I get to do so rarely, is being startled by all the ads. There are so many of them, and they are so loud and bright and painfully mediocre so much of the time. Did you know that the original point of cable was no ads? NICOLE: When did that happen? My experience of cable has always included ads. The only channel with no ads was PBS, and even then they started sneaking ads in between the shows. Plus the telethons. ESTER: I was taught that originally, the point of cable was that consumers would pay for it, and in exchange they wouldn’t get commercials. But then cable companies started realizing they could also get advertisers to pay and customers wouldn’t mind, or at least not too much. So now basically the only channels without ads are super-high-premium ones like HBO. Meanwhile here’s a terrifying piece about cable companies speeding up movies and TV shows to cram in yet more commercials. Cable TV Shows Are Sped Up to Squeeze in More AdsWhen Stephen Cox was watching \"The Wizard of Oz\" on TBS last November, something didn't sound quite right to him about…www.wsj.com NICOLE: I saw that one! It didn’t surprise me. Remember when they used to reformat widescreen movies for our square TVs and every once in a while they’d do this weird pan thing so they could get something on the edge of the widescreen that was important to the story? It’s, like, of course they’d speed things up if they wanted to. Or cut out the parts they find too offensive for prime time. They were also doing that for Broadway cast albums, at least in one case: The original cast album of A Little Night Music has one song pitched up, just so they could squeeze everything in there. (They fixed it for the remastered CD version.) But at least they aren’t trying to squeeze in an ad. Do you think CDs would have started to come with ads, had CDs not died before they got the chance? ESTER: What a crazy thought! Probably. NICOLE: They did it for DVDs, and then blocked the ability to go to the menu until the ads were over. But it’s harder to imagine how they could do it for CDs, unless everyone just agreed to listen to an ad before they started listening to their music. We do that for Spotify and Pandora, after all. ESTER: And now for podcasts, of course. It’s such a bizarre experience, hearing a voice I like and trust suddenly get all bright and start extolling the virtues of a Casper mattress or a website built with Squarespace. (Squarespace: build it beautiful!) NICOLE: Ester, I am seriously going to buy a new mattress before the summer is over and a little voice in my head keeps saying, “You should try Casper, they’ll take it back if you don’t like it, plus you’ll get a discount code.” ESTER: You should try Casper! And Blue Apron and Harry’s razors and … NICOLE: Not MeUndies, though. I’ve heard that those are not as good as the podcasters advertise. ESTER: What about the weird bathroom spray that traps the smell under the water (?!?) or something? Have you ever met anyone who’s tried that? The hosts are always like, “Try ‘UNoPoo,’ [or whatever it’s called], and yes, it’s for real!” NICOLE: You mean Poo-Pourri, the spray that traps smells under the toilet? Trap-A-CrapNever leave a trail...An odor trapper for any crapper . It's Poo hunting season, and you don't miss. Poo~Pourri Trap-A…www.poopourri.com ESTER: I’m laughing pretty hard. Under the water of the toilet, I think? And yes, that’s exactly what I was trying to remember. NICOLE: I already have a device that traps smells in the toilet. It is called a toilet lid. ESTER: ((thumbs up)) I’ve never bought anything because it was advertised on a podcast but I do feel a generalized affection for those products and services because they’re making possible the audio I love. NICOLE: I can’t say the same. I am wearing Warby Parker glasses right now. ESTER: Whose discount code did you use to get 10% off your first purchase? Because that’s the other thing! If I actually caved and tried Squarespace or whatever, how would I decide whose code to use? It would be like playing favorites. NICOLE: … I think I remembered the advertising but forgot to use the discount code. ESTER: ((thumbs up again)) ", "child": "1633_1\t1633_2\t1633_3\t1633_4\t1633_5\t1633_6"}