{"name": "1635", "parent": "", "title": "Project 365: Day 104 — A Win for Sindhu, A Win for Women", "sentences": [{"f110": "Project 365: Day 104 — A Win for Sindhu, A Win for Women"}, {"0158": "I had decided to give it skip when it came to P V Sindhu’s win (yes, I’m calling it a win, because even though she didn’t win gold, she’s still a winner in my eyes)."}, {"5fcd": "This a lesson for all the patriarchal naysayers who think having a son is where it all begins and ends. Sakshi Malik of Rohtak (who won a bronze yesterday) belongs to a gender critical state. I wish we could call India the kind of country where women matter. Unfortunately, forget sport, even our crime rates against women are so high. Victims of sexual assault are routinely blamed for being inappropriately dressed, as if to suggest it was the woman who seduced the man into sexually assaulting her. There are right wing organisations (more than one) that suggest a woman’s place is in the kitchen and at the feet of her husband. To people living in urban settings, the idea sounds ridiculous. Yet, there are so many men out there who think they’re “allowing their wives to go out and earn their livelihood”. Why do they think women need permission?"}, {"f462": "Aside from gender skews in almost all states in India, barring perhaps a Kerala, women just aren’t taken seriously as sportspersons. Tell someone the Women’s cricket team is playing a match today and no one seems to care. The only reason people care about a Sania Mirza is because of her multiple Grand Slam wins. The same people had no qualms about dissing her choice of husband in Shoaib Malik, a Pakistani cricketer. I’ll also take a moment to mention how a seasoned journalist recently asked her when she’s planning to “settle down”. A lot of people commented on it, saying why was it taken so seriously when it was an honest question? I want to ask them, when is the last time they heard a married man being asked when he’s planning to settle down? Why does marriage and children and other notions of “settling down” take precedence over any and all that a woman may achieve in her career?"}, {"7488": "I’ve written before about the dismal state of affairs that sports finds itself in here, about the various grass-root level problems athletes face. But I haven’t lost hope. With this win, I hope our governing bodies have the sense to at least back our players and hone them in the next 4 years so that a Dipa Karmakar can become the next Simone Biles or a P V Sindhu can be the next Carolina Marin. Not just women, the training must of course, be all encompassing. But I think these two wins — Malik’s and Sindhu’s send out an important message — women too deserve their place in the sun."}, {"bba1": "Given how deeply our country is rooted in patriarchy, I know these wins are baby steps, but they are steps in the right direction. It’s time we treated women as equals not as second best. Indeed, it’s women who are winning for India this time. Even in saying that, I know that it shouldn’t be about men or women. It should be about the country — in an ideal scenario. And oh, before I forget, congratulations on your silver, Sindhu! You’re a gem."}], "content": "Project 365: Day 104 — A Win for Sindhu, A Win for Women I had decided to give it skip when it came to P V Sindhu’s win (yes, I’m calling it a win, because even though she didn’t win gold, she’s still a winner in my eyes). This a lesson for all the patriarchal naysayers who think having a son is where it all begins and ends. Sakshi Malik of Rohtak (who won a bronze yesterday) belongs to a gender critical state. I wish we could call India the kind of country where women matter. Unfortunately, forget sport, even our crime rates against women are so high. Victims of sexual assault are routinely blamed for being inappropriately dressed, as if to suggest it was the woman who seduced the man into sexually assaulting her. There are right wing organisations (more than one) that suggest a woman’s place is in the kitchen and at the feet of her husband. To people living in urban settings, the idea sounds ridiculous. Yet, there are so many men out there who think they’re “allowing their wives to go out and earn their livelihood”. Why do they think women need permission? Aside from gender skews in almost all states in India, barring perhaps a Kerala, women just aren’t taken seriously as sportspersons. Tell someone the Women’s cricket team is playing a match today and no one seems to care. The only reason people care about a Sania Mirza is because of her multiple Grand Slam wins. The same people had no qualms about dissing her choice of husband in Shoaib Malik, a Pakistani cricketer. I’ll also take a moment to mention how a seasoned journalist recently asked her when she’s planning to “settle down”. A lot of people commented on it, saying why was it taken so seriously when it was an honest question? I want to ask them, when is the last time they heard a married man being asked when he’s planning to settle down? Why does marriage and children and other notions of “settling down” take precedence over any and all that a woman may achieve in her career? I’ve written before about the dismal state of affairs that sports finds itself in here, about the various grass-root level problems athletes face. But I haven’t lost hope. With this win, I hope our governing bodies have the sense to at least back our players and hone them in the next 4 years so that a Dipa Karmakar can become the next Simone Biles or a P V Sindhu can be the next Carolina Marin. Not just women, the training must of course, be all encompassing. But I think these two wins — Malik’s and Sindhu’s send out an important message — women too deserve their place in the sun. Given how deeply our country is rooted in patriarchy, I know these wins are baby steps, but they are steps in the right direction. It’s time we treated women as equals not as second best. Indeed, it’s women who are winning for India this time. Even in saying that, I know that it shouldn’t be about men or women. It should be about the country — in an ideal scenario. And oh, before I forget, congratulations on your silver, Sindhu! You’re a gem. ", "child": "1635_1"}