{"name": "1637", "parent": "", "title": "Team Bahamas (BAH) wins gold metal at Dept Olympics", "sentences": [{"552a": "Team Bahamas (BAH) wins gold metal at Dept Olympics"}, {"1390": "The Bahamas men’s 12 x 100 metre relay team has won the gold metal at the men’s 12 x 100 metre relay race; setting a new Dept Record, World Record and Scandinavian Record. They also broke a Tom Jones record. During the race a couple of team members used the same technique as the women’s 400 metres gold medal winner Shaunae Miller did; they dove towards the finish."}, {"3f83": "Winning this gold metal was quite exceptional, as some team members had never seen or spoken to each other before. How the team qualified for the Dept Olympics in this way is still unclear."}, {"0a10": "Some quotes from the team about their victory:"}, {"39f9": "“It was like, there was no competition”"}, {"221c": "“I wonder how much this gold metal will go for on Ebay”"}, {"fb82": "“Best EPO I’ve had in years”"}, {"0777": "“I thought we we’re going to a dive bar”"}, {"fb70": "“The group dynamics of this team are insane. It’s even better than that one night in Ibiza I can barely remember.”"}, {"118c": "We worked so hard for this, but we never got paid for overtime”"}, {"db5e": "“Who are you?”"}, {"e45b": "According to anonymous sources, after their victory the team immediately went to the centre of a well known park, aiming to avoid the hovering groupies. The team will be celebrating their victory at this location during the next 1,83 days."}, {"1eb4": "Let the games begin."}], "content": "Team Bahamas (BAH) wins gold metal at Dept Olympics The Bahamas men’s 12 x 100 metre relay team has won the gold metal at the men’s 12 x 100 metre relay race; setting a new Dept Record, World Record and Scandinavian Record. They also broke a Tom Jones record. During the race a couple of team members used the same technique as the women’s 400 metres gold medal winner Shaunae Miller did; they dove towards the finish. Winning this gold metal was quite exceptional, as some team members had never seen or spoken to each other before. How the team qualified for the Dept Olympics in this way is still unclear. Some quotes from the team about their victory: “It was like, there was no competition” “I wonder how much this gold metal will go for on Ebay” “Best EPO I’ve had in years” “I thought we we’re going to a dive bar” “The group dynamics of this team are insane. It’s even better than that one night in Ibiza I can barely remember.” We worked so hard for this, but we never got paid for overtime” “Who are you?” According to anonymous sources, after their victory the team immediately went to the centre of a well known park, aiming to avoid the hovering groupies. The team will be celebrating their victory at this location during the next 1,83 days. Let the games begin. ", "child": "1637_11637_11637_11637_1"}