{"name": "1649", "parent": "", "title": "We Want Bama: #USC vs #Alabama Game Preview", "sentences": [{"06fa": "We Want Bama: #USC vs #Alabama Game Preview"}, {"4d6d": "First time coach, offensive coordinator, and quarterback. It’s a good thing we play opponents like Idaho or Fresno State to allow us to warm up before a grueling Pac-12 schedule. Let’s see who we play first this year…"}, {"8dfe": "Well that’s certainly a way to start a season. This week the Trojans face off against the defending national champions and preseason #1, the Alabama Crimson Tide. To be the best, you have to beat the best. We got this?"}, {"63bc": "By the Numbers"}, {"3649": "Technically, the Heisman trophy count is six to two but it’s really hard to talk about cheating and the integrity of the game when you’re talking about a team that employs Nick Saban. Other statistics to compare:"}, {"f249": "Average Alumni Income"}, {"0ada": "USC: A lot"}, {"a3c8": "Alabama: Less"}, {"e566": "Award Winning Films Made About Alumni"}, {"f815": "USC: 1 (O.J.: Made in America)"}, {"ad4c": "Alabama: 0"}, {"393f": "Forrest Gump, a film about a fictional historical figure whose I.Q. is on par with the average Alabama valedictorian, does not count. O.J., unfortunately, is very real."}, {"109f": "Note: I am fully aware of the irony of insulting another fan base’s intelligence when my articles are riddled with spelling and grammatical errors. Blame my editors, they also went to USC."}, {"968d": "Clothes Bought at Goodwill"}, {"1d55": "USC: For costume parties"}, {"3c71": "Alabama: Cousin’s wedding (You’re the groom)"}, {"8a3d": "Tailgate Drink of Choice"}, {"3595": "USC: Fireball"}, {"c254": "Alabama: A ceramic jug with 3 Xs on it"}, {"7b89": "Super Fans"}, {"c974": "USC: Roy Nwaisser aka “USC Psycho”"}, {"b1bd": "Alabama: Phyllis from Mulga"}, {"eb8a": "Students"}, {"98ff": "USC: Having Sex On Top of Buildings"}, {"88c7": "Alabama: Getting Barney Costumes Stuck on Your Head"}, {"6441": "Rally Chant"}, {"2521": "USC: “Fight On”"}, {"6549": "Alabama: “Roll Tide”"}, {"6dc8": "An Interesting History"}, {"92f6": "Is USC responsible for Alabama’s football dynasty? Short answer: Yes."}, {"ca56": "The USC-Alabama “rivalry” began in 1938, but the first modern era matchup, possibly most important, came in 1970. Scheduled by longtime friends Bear Bryant and John McKay, USC and Alabama faced off in a two-game series. The significance of this game was that it was the first time an integrated team outside Alabama came to Birmingham to face the Crimson Tide. At that time, Alabama was still an all-white team and surprisingly wasn’t very good, posting a 6–5 record the previous year."}, {"8855": "USC would go on to win 42–21. Alabama would go on to avenge their loss the next year, beating USC 17–10, this time with a much better (integrated) team. If it takes getting embarrassed on your home turf to force you to enter the 20th century, there is something wrong with your school and your fan base. Happy the Trojans were able to help move things along for the university though! Feel free to thank us in Dallas this weekend."}, {"addd": "The Curious Case of Cam Robinson"}, {"df8c": "Earlier this year, Alabama players Cam Robinson and Lawrence Jones were arrested. Robinson, one of the nation’s best offensive tackles, was charged with a felony for illegal possession of a stolen firearm, misdemeanor possession of a controlled dangerous substance, and misdemeanor illegal carrying of a weapon in the presence of narcotics. Wait, you can’t carry your illegal firearm WITH your illegal drugs? Thanks, Obama."}, {"8bde": "Both Robinson and Jones were indefinitely suspended and incurred team punishments. However, the charges were eventually dropped, citing a lack of evidence."}, {"72b9": "“I want to emphasize once again that the main reason I’m doing this is that I refuse to ruin the lives of two young men who have spent their adolescence and their teenage years, working and sweating, while we were all at home in the air conditioning.” — District Attorney on dismissal of charges"}, {"e646": "Meanwhile, Alabama practices in state of the art indoor facilities."}, {"30be": "The District Attorney’s name? Jerry Jones. The owner of the stadium where Alabama plays their first game? Jerry Jones. Connect the dots people."}, {"c862": "Additionally, offensive guard Alphonse Taylor was arrested for driving under the influence (he had no alcohol in his system which apparently is the only way to get a DUI). Nick Saban has not indicated if he, Robinson or Jones will be suspended, but seeing as we are less than four days away from game time, I wouldn’t be holding your breath for Alabama to do the honorable thing."}, {"d47c": "Totally unrelated: USC cornerback Isiah Langley is suspended for the opener for being arrested after refusing to leave a fraternity party."}, {"2cb7": "I really hate having a coach with a conscience. However, considering the last two regimes resulted in drunken rants and black eyes from mediocre bowl games, maybe it’s a good turn of events for us."}, {"5417": "Update: Coach Helton has suspended backup linebacker Osa Masina for the opener. He is currently being investigated for sexual assault allegations in two states."}, {"8308": "Battle of the Bands: “Tusk” Edition"}, {"b80a": "Tusk, the “unofficial fight song” of the USC Trojan Marching band, is only used by two other schools. One of those schools: Alabama."}, {"36c0": "If USC hasn’t helped Alabama’s football program enough, their band is also stealing our songs. USC’s ties to the song go all the way to its origin. The USC band director, Dr. Arthur C. Bartner, helped create the song with Fleetwood Mac (the latter half of the song is dominated by the Trojan Marching Band)."}, {"0bd1": "Alabama’s ties to the song begin in 2007 when Nick Saban became head coach. The band liked the title’s phonetic similarity to Tuscaloosa (TUSK-caloosa) and to Big Al, their elephant mascot (elephants have tusks). Don’t use too much brainpower picking songs, you will give yourself a headache."}, {"b0f1": "Alabama will not play Tusk in its’ traditional pregame because of time constraints. USC has moved playing the song from their postgame performance to its’ pregame show to beat them to the punch."}, {"192b": "“We want to show them that it is ours, that this is how it should actually be played” — Baxter on ‘Tusk’"}, {"5563": "I wonder if there would be some much fighting if the bands realized that “Tusk” is about Mick Fleetwood’s erect penis."}, {"fbac": "T-Shirt Wars"}, {"4817": "A couple years ago, Oregon students made the grave mistake of making “We Want Bama” shirts. They never got to face off against the Crimson Tide, having their title hopes crushed by the Stanford Cardinal. The lesson was learned; don’t write checks your butt can’t cash."}, {"3b46": "Ignoring this lesson like a student during syllabus week, the USC Bookstore (yes, the actual school bookstore) sold a cardinal-and-gold shirt that read: “Roll Tears Roll”"}, {"cf2f": "It is never a smart idea to further anger your opponent before your match-up, especially one as talented as Alabama. Don’t poke the bear, or in this case, the elephant (they never forget)."}, {"1d9c": "To add insult to injury, the school pulled the shirt hours after releasing it. If you’re going to make shirts like that, you better embrace it when they become national news. The damage was done as Alabama fans caught wind and came up with t-shirts of their own."}, {"b84c": "Completely inappropriate, but definitely the better of the two shirts."}, {"7564": "Nick Satan"}, {"dbdf": "Earlier in this article, I touched on Saban’s inability to discipline any of his troubled players that can contribute on the field, but it really undersells how evil he really is. He basically sold his soul to the devil to win college football games (a soul apparently wasn’t enough to win at the professional level)."}, {"46ce": "There’s the time he blamed the Sugar Bowl loss on NFL Draft Grades being released too early and distracting his players. One of his former players chimed in on this:"}, {"ee3f": "Usually you would like the person speaking out to not be known for shooting himself in the leg, but apparently every Alabama player has an illegal firearm so what’s the difference."}, {"6b19": "And then there is this year, when Alabama cornerback Maurice Smith informed the coach of his intention to transfer. Saban’s response? Deny his transfer, clean out his locker, toss his personal belongings in the trash, and ban him from the athletic facility."}, {"a110": "“These personal items included my family photos, written goals, inspirational and sentimental items memorializing my deceased former friend, roommate and teammate, Altee Tenpenny, and items of personal value from my former teammates.” — Smith on items thrown in the trash"}, {"0553": "Smith was eventually granted his release from the team and has transferred to Georgia, to reunite with his defensive coach, Kirby Smart. The move to allow Smith to leave the team was not to do the right thing, but to get rid of the national spotlight the incident was bringing. Gives Saban fewer questions to get mad at during interviews."}, {"29d6": "Stay In Your Lane"}, {"9866": "And then we have the lovable loser who constantly finds new ways to fail up: Lane Kiffin."}, {"4369": "You may remember Lane from his brief coaching stint at USC, where he offered a 13-year-old a scholarship, may have inspired Deflategate, and called approximately 15,000 bubble screens. I’d say the majority of my hate towards him comes from our game against Washington State where he refused to call any pass play that involved throwing the ball past the line of scrimmage."}, {"ab3c": "His entrance to USC incited a small riot in Knoxville, Tennessee as he left in the middle of a coaches meeting to catch the next plane to Los Angeles. His exit was just as memorable."}, {"9a01": "Somehow stumbling into the Alabama offensive coordinator job, Kiffin is still being left behind."}, {"8cde": "Or being locked out."}, {"3c93": "But for what Lane lacks in respect from his peers (Kiffin was the only assistant coach on Alabama to not be given a raise following the 2014 season), he makes up with in his social media presence."}, {"3663": "His Bitmoji game is “100”:"}, {"ac41": "And he also MAY be using fake twitter accounts and Tinder to hit on college co-eds. And let’s not forget those rumors last year following their loss to Ole Miss. One loss, and Alabama almost falls apart. Imagine what would happen if he lost to one of his former employers?"}, {"7af0": "Game Preview"}, {"d5bb": "Offense"}, {"3cf1": "If you have two quarterbacks, you have none. Alabama is trying to defy this time tested ideology by splitting time between Cooper Bateman and Blake Barnett against USC. I can see why the decision to pick a starter is tough with two extremely quarterback names like that. I’d go with the guy who has the most sorority-themed koozies."}, {"4fc2": "Alabama runs a bell cow offense. Kiffin identifies the best weapons on his offense and gives those guys as many touches as humanly possible. This avoids any over thinking (thinking is not Kiffin’s strong suit). Last year’s bell cow was Derrick Henry, who had a nearly impossible load, carrying the ball 395 times for the Crimson Tide. He went on to win the Heisman which will go well with the yellow jacket he will be wearing alongside Trent Richardson as stadium security attendants after his inevitable short stint in the NFL."}, {"0747": "Now that Henry is gone, who will be this year’s bell cow? There’s Calvin Ridley, one of the nation’s top receivers with 1,059 receiving yards last year. Tight end O.J. Howard, who had 267 yards in two CFP games. And running back Bo Scarbrough, Henry’s back up who showed glimpses of promise near the end of last season. The issues at quarterback suggest the bell will be hanging on Bo’s neck. Moo."}, {"5d93": "Alabama’s offensive line returns three starters but has lost All-American center Ryan Kelly to the NFL. In a high-pressured opener, you want to know the ball isn’t going to be snapped 20 yards over QB’s head on the first play."}, {"52e9": "So how do you stop Alabama on offense?"}, {"a2c7": "Load the box and force Alabama to throw. USC possesses the secondary that can play man to man with no safety net behind. This will allow our defense to outnumber Alabama at the line of scrimmage and force risky throws from whoever is behind center at that point in the game."}, {"c750": "Alabama is a historically conservative team that tends not to make mistakes. In their one loss in 2015, they had a -5 turnover margin against Ole Miss."}, {"2ff1": "Defense"}, {"47b7": "On Saturday, Alabama’s defense has a chance to start 11 5-star recruits (recruitment rankings are a very exact science letting you know they must be the best players). They’ve consistently had a dominant run defense and last year, added one of the nation’s top pass rushes. While they return a lot of their top players, they do lack depth in the defensive line and secondary. Maybe this would be an advantage for the Trojans if they were playing Week 10, but depth isn’t much of an issue in Week 1."}, {"e729": "So how the hell do we score?"}, {"3bed": "The best way to attack Alabama is with a spread rushing attack with a mobile QB as shown in their losses to Ohio State and Auburn. Unfortunately, USC runs a pro-style offense and named human statue Max Browne as its starting quarterback. So what do we do?"}, {"416e": "RUN. THE. BALL. Force Alabama to load the box to allow for quick passes or big play-action plays to our deep threats’ JuJu Smith-Schuster and Steven Mitchell. If our offensive line is as stout as they been heralded this offseason, they should be able to hold up in the trenches against the corn-fed boys from Tuscaloosa."}, {"8de9": "Ronald Jones has shown the ability to win the perimeter and turn up field with speed. If he can do that against an eight man front, this could turn into a barn burner."}, {"e5cd": "Be on the lookout for backup quarterback Sam Darnold to make some appearances in the game. The coaching staff has created special packages to utilize his running ability in short yardage situations, similar to Tim Tebow’s role with the Florida Gators in 2006. If this all works out for Darnold he might have a chance to return to USC in 10 years to workout for MLB scouts."}, {"a927": "Special Teams"}, {"95b6": "Let’s check out some of highlights from Alabama’s kicker, Adam Griffith:"}, {"e582": "You’d think after that, he would have been kicked out of school, lost his mind, underwent a sex change, and tried to steal Snowflake from the Miami Dolphins."}, {"ae5a": "But, Griffith is still kicking for the Crimson Tide, and still kicking badly. In 2015, he missed his first four field goals and two of the next eight. Alabama has more five star recruits than an average fan has teeth and still can’t find a competent kicker to play for them."}, {"b2cf": "It’s been rumored that Griffith is suffering from both a foot and neck injury and his backup can’t make anything past 20 yards and constantly shanking kickoffs. Special teams were bad for Alabama in the beginning of last season; could it get worse?"}, {"da69": "If these issues are true, don’t expect Adoree’ to be able to field any kickoffs or punts. Which could mean he can use that extra energy for offense."}, {"93a0": "What’s The Line? (-10.5)"}, {"5b06": "I’m not a gambling man, but I do know betting on USC is an absolute crap shoot. So here is my advice:"}, {"9547": "If you are going to Dallas to get drunk, reunite with friends, and already have potential plan to leave at halftime, take USC. Winning will be a pleasant surprise."}, {"832c": "If even an ounce of your body thinks the Trojans have a chance, take USC."}, {"bcd6": "If you completely ignore this section and you grabbed a larger line earlier this year, you’re taking USC."}, {"8301": "If this tweet made you second guess yourself, take USC."}, {"d501": "Take USC. You’re taking USC. JUST. TAKE. THEM."}, {"f9fe": "Prediction"}, {"86f3": "Six months ago: I will punch anyone in the face who says USC can beat Alabama."}, {"74e1": "Three months ago: You know, stranger things have happened."}, {"113c": "One month ago: I think we have a pretty good shot."}, {"bb20": "Today: WE ARE ABOUT TO SHOCK THE WORLD! UNDEFEATED!"}, {"2f24": "I’ve tried and I’ve tried to talk myself out of this prediction, but it’s too early in the season to have anything but unreasonable amounts of optimism. We are playing the best team in the nation, the best program in the past decade, and I am ready to sing Sweet Home Alabama while simultaneously getting my ass kicked by five enraged Alabama fans as I walk out of Jerry World in victory."}, {"bcb8": "This has happened before. USC, led by Matt Leinart in his first career start upset №8 ranked Auburn on their way to a 12–1 season. History shows it’s possible."}, {"8559": "When USC has to show up early in the season against a ranked opponent, they have always stepped up to the challenge. Auburn in 2003, Ohio State in 2008, Ohio State (again) in 2009. When USC is ignored and disrespected as an opponent, they find ways to get the last laugh. Oregon in 2011, Stanford in 2013, Utah in 2015 (don’t show me the Vegas odds). It is only when we let our guards down do we get heartbroken (Stanford in 2007, Oregon State in 2008, Boston College in 2014)."}, {"eddb": "We have a plan in place. We’ve named a starting quarterback. We have the weapons and offensive live. We have the right defensive scheme again. We have the secondary to make up for our weaknesses in the front seven. We have RoJo. We have Adoree’. WE HAVE JUJU!"}, {"b1c6": "Alabama is showing us no respect with having a two-man quarterback rotation. Their shakiness at special teams could lead to crucial mistakes. All it takes to swing a game is one or two plays."}, {"ab03": "The Trojans will have to be perfect all four quarters. Because at the end of the day, it’s still Ala-fucking-bama."}, {"635c": "USC 28 Alabama 27"}, {"0d52": "BRING IT BAMA!"}, {"b6a9": "You can follow me on twitter at Sports By Scondi"}, {"03ac": "Special thanks to my numerous “editors”; Tim, James, Christina, Emma, and Jef"}, {"84c4": "Sources: USC Athletics, SBNation, Conquest Chronicles, ESPN, Reign of Troy, Rivals, Scout, Deadspin, Wikipedia, Google, ESPN, and a lot of other places"}], "content": "We Want Bama: #USC vs #Alabama Game Preview First time coach, offensive coordinator, and quarterback. It’s a good thing we play opponents like Idaho or Fresno State to allow us to warm up before a grueling Pac-12 schedule. Let’s see who we play first this year… Well that’s certainly a way to start a season. This week the Trojans face off against the defending national champions and preseason #1, the Alabama Crimson Tide. To be the best, you have to beat the best. We got this? By the Numbers Technically, the Heisman trophy count is six to two but it’s really hard to talk about cheating and the integrity of the game when you’re talking about a team that employs Nick Saban. Other statistics to compare: Average Alumni Income USC: A lot Alabama: Less Award Winning Films Made About Alumni USC: 1 (O.J.: Made in America) Alabama: 0 Forrest Gump, a film about a fictional historical figure whose I.Q. is on par with the average Alabama valedictorian, does not count. O.J., unfortunately, is very real. Note: I am fully aware of the irony of insulting another fan base’s intelligence when my articles are riddled with spelling and grammatical errors. Blame my editors, they also went to USC. Clothes Bought at Goodwill USC: For costume parties Alabama: Cousin’s wedding (You’re the groom) Tailgate Drink of Choice USC: Fireball Alabama: A ceramic jug with 3 Xs on it Super Fans USC: Roy Nwaisser aka “USC Psycho” Alabama: Phyllis from Mulga Students USC: Having Sex On Top of Buildings Alabama: Getting Barney Costumes Stuck on Your Head Rally Chant USC: “Fight On” Alabama: “Roll Tide” An Interesting History Is USC responsible for Alabama’s football dynasty? Short answer: Yes. The USC-Alabama “rivalry” began in 1938, but the first modern era matchup, possibly most important, came in 1970. Scheduled by longtime friends Bear Bryant and John McKay, USC and Alabama faced off in a two-game series. The significance of this game was that it was the first time an integrated team outside Alabama came to Birmingham to face the Crimson Tide. At that time, Alabama was still an all-white team and surprisingly wasn’t very good, posting a 6–5 record the previous year. USC would go on to win 42–21. Alabama would go on to avenge their loss the next year, beating USC 17–10, this time with a much better (integrated) team. If it takes getting embarrassed on your home turf to force you to enter the 20th century, there is something wrong with your school and your fan base. Happy the Trojans were able to help move things along for the university though! Feel free to thank us in Dallas this weekend. The Curious Case of Cam Robinson Earlier this year, Alabama players Cam Robinson and Lawrence Jones were arrested. Robinson, one of the nation’s best offensive tackles, was charged with a felony for illegal possession of a stolen firearm, misdemeanor possession of a controlled dangerous substance, and misdemeanor illegal carrying of a weapon in the presence of narcotics. Wait, you can’t carry your illegal firearm WITH your illegal drugs? Thanks, Obama. Both Robinson and Jones were indefinitely suspended and incurred team punishments. However, the charges were eventually dropped, citing a lack of evidence. “I want to emphasize once again that the main reason I’m doing this is that I refuse to ruin the lives of two young men who have spent their adolescence and their teenage years, working and sweating, while we were all at home in the air conditioning.” — District Attorney on dismissal of charges Meanwhile, Alabama practices in state of the art indoor facilities. The District Attorney’s name? Jerry Jones. The owner of the stadium where Alabama plays their first game? Jerry Jones. Connect the dots people. Additionally, offensive guard Alphonse Taylor was arrested for driving under the influence (he had no alcohol in his system which apparently is the only way to get a DUI). Nick Saban has not indicated if he, Robinson or Jones will be suspended, but seeing as we are less than four days away from game time, I wouldn’t be holding your breath for Alabama to do the honorable thing. Totally unrelated: USC cornerback Isiah Langley is suspended for the opener for being arrested after refusing to leave a fraternity party. I really hate having a coach with a conscience. However, considering the last two regimes resulted in drunken rants and black eyes from mediocre bowl games, maybe it’s a good turn of events for us. Update: Coach Helton has suspended backup linebacker Osa Masina for the opener. He is currently being investigated for sexual assault allegations in two states. Battle of the Bands: “Tusk” Edition Tusk, the “unofficial fight song” of the USC Trojan Marching band, is only used by two other schools. One of those schools: Alabama. If USC hasn’t helped Alabama’s football program enough, their band is also stealing our songs. USC’s ties to the song go all the way to its origin. The USC band director, Dr. Arthur C. Bartner, helped create the song with Fleetwood Mac (the latter half of the song is dominated by the Trojan Marching Band). Alabama’s ties to the song begin in 2007 when Nick Saban became head coach. The band liked the title’s phonetic similarity to Tuscaloosa (TUSK-caloosa) and to Big Al, their elephant mascot (elephants have tusks). Don’t use too much brainpower picking songs, you will give yourself a headache. Alabama will not play Tusk in its’ traditional pregame because of time constraints. USC has moved playing the song from their postgame performance to its’ pregame show to beat them to the punch. “We want to show them that it is ours, that this is how it should actually be played” — Baxter on ‘Tusk’ I wonder if there would be some much fighting if the bands realized that “Tusk” is about Mick Fleetwood’s erect penis. T-Shirt Wars A couple years ago, Oregon students made the grave mistake of making “We Want Bama” shirts. They never got to face off against the Crimson Tide, having their title hopes crushed by the Stanford Cardinal. The lesson was learned; don’t write checks your butt can’t cash. Ignoring this lesson like a student during syllabus week, the USC Bookstore (yes, the actual school bookstore) sold a cardinal-and-gold shirt that read: “Roll Tears Roll” It is never a smart idea to further anger your opponent before your match-up, especially one as talented as Alabama. Don’t poke the bear, or in this case, the elephant (they never forget). To add insult to injury, the school pulled the shirt hours after releasing it. If you’re going to make shirts like that, you better embrace it when they become national news. The damage was done as Alabama fans caught wind and came up with t-shirts of their own. Completely inappropriate, but definitely the better of the two shirts. Nick Satan Earlier in this article, I touched on Saban’s inability to discipline any of his troubled players that can contribute on the field, but it really undersells how evil he really is. He basically sold his soul to the devil to win college football games (a soul apparently wasn’t enough to win at the professional level). There’s the time he blamed the Sugar Bowl loss on NFL Draft Grades being released too early and distracting his players. One of his former players chimed in on this: Usually you would like the person speaking out to not be known for shooting himself in the leg, but apparently every Alabama player has an illegal firearm so what’s the difference. And then there is this year, when Alabama cornerback Maurice Smith informed the coach of his intention to transfer. Saban’s response? Deny his transfer, clean out his locker, toss his personal belongings in the trash, and ban him from the athletic facility. “These personal items included my family photos, written goals, inspirational and sentimental items memorializing my deceased former friend, roommate and teammate, Altee Tenpenny, and items of personal value from my former teammates.” — Smith on items thrown in the trash Smith was eventually granted his release from the team and has transferred to Georgia, to reunite with his defensive coach, Kirby Smart. The move to allow Smith to leave the team was not to do the right thing, but to get rid of the national spotlight the incident was bringing. Gives Saban fewer questions to get mad at during interviews. Stay In Your Lane And then we have the lovable loser who constantly finds new ways to fail up: Lane Kiffin. You may remember Lane from his brief coaching stint at USC, where he offered a 13-year-old a scholarship, may have inspired Deflategate, and called approximately 15,000 bubble screens. I’d say the majority of my hate towards him comes from our game against Washington State where he refused to call any pass play that involved throwing the ball past the line of scrimmage. His entrance to USC incited a small riot in Knoxville, Tennessee as he left in the middle of a coaches meeting to catch the next plane to Los Angeles. His exit was just as memorable. Somehow stumbling into the Alabama offensive coordinator job, Kiffin is still being left behind. Or being locked out. But for what Lane lacks in respect from his peers (Kiffin was the only assistant coach on Alabama to not be given a raise following the 2014 season), he makes up with in his social media presence. His Bitmoji game is “100”: And he also MAY be using fake twitter accounts and Tinder to hit on college co-eds. And let’s not forget those rumors last year following their loss to Ole Miss. One loss, and Alabama almost falls apart. Imagine what would happen if he lost to one of his former employers? Game Preview Offense If you have two quarterbacks, you have none. Alabama is trying to defy this time tested ideology by splitting time between Cooper Bateman and Blake Barnett against USC. I can see why the decision to pick a starter is tough with two extremely quarterback names like that. I’d go with the guy who has the most sorority-themed koozies. Alabama runs a bell cow offense. Kiffin identifies the best weapons on his offense and gives those guys as many touches as humanly possible. This avoids any over thinking (thinking is not Kiffin’s strong suit). Last year’s bell cow was Derrick Henry, who had a nearly impossible load, carrying the ball 395 times for the Crimson Tide. He went on to win the Heisman which will go well with the yellow jacket he will be wearing alongside Trent Richardson as stadium security attendants after his inevitable short stint in the NFL. Now that Henry is gone, who will be this year’s bell cow? There’s Calvin Ridley, one of the nation’s top receivers with 1,059 receiving yards last year. Tight end O.J. Howard, who had 267 yards in two CFP games. And running back Bo Scarbrough, Henry’s back up who showed glimpses of promise near the end of last season. The issues at quarterback suggest the bell will be hanging on Bo’s neck. Moo. Alabama’s offensive line returns three starters but has lost All-American center Ryan Kelly to the NFL. In a high-pressured opener, you want to know the ball isn’t going to be snapped 20 yards over QB’s head on the first play. So how do you stop Alabama on offense? Load the box and force Alabama to throw. USC possesses the secondary that can play man to man with no safety net behind. This will allow our defense to outnumber Alabama at the line of scrimmage and force risky throws from whoever is behind center at that point in the game. Alabama is a historically conservative team that tends not to make mistakes. In their one loss in 2015, they had a -5 turnover margin against Ole Miss. Defense On Saturday, Alabama’s defense has a chance to start 11 5-star recruits (recruitment rankings are a very exact science letting you know they must be the best players). They’ve consistently had a dominant run defense and last year, added one of the nation’s top pass rushes. While they return a lot of their top players, they do lack depth in the defensive line and secondary. Maybe this would be an advantage for the Trojans if they were playing Week 10, but depth isn’t much of an issue in Week 1. So how the hell do we score? The best way to attack Alabama is with a spread rushing attack with a mobile QB as shown in their losses to Ohio State and Auburn. Unfortunately, USC runs a pro-style offense and named human statue Max Browne as its starting quarterback. So what do we do? RUN. THE. BALL. Force Alabama to load the box to allow for quick passes or big play-action plays to our deep threats’ JuJu Smith-Schuster and Steven Mitchell. If our offensive line is as stout as they been heralded this offseason, they should be able to hold up in the trenches against the corn-fed boys from Tuscaloosa. Ronald Jones has shown the ability to win the perimeter and turn up field with speed. If he can do that against an eight man front, this could turn into a barn burner. Be on the lookout for backup quarterback Sam Darnold to make some appearances in the game. The coaching staff has created special packages to utilize his running ability in short yardage situations, similar to Tim Tebow’s role with the Florida Gators in 2006. If this all works out for Darnold he might have a chance to return to USC in 10 years to workout for MLB scouts. Special Teams Let’s check out some of highlights from Alabama’s kicker, Adam Griffith: You’d think after that, he would have been kicked out of school, lost his mind, underwent a sex change, and tried to steal Snowflake from the Miami Dolphins. But, Griffith is still kicking for the Crimson Tide, and still kicking badly. In 2015, he missed his first four field goals and two of the next eight. Alabama has more five star recruits than an average fan has teeth and still can’t find a competent kicker to play for them. It’s been rumored that Griffith is suffering from both a foot and neck injury and his backup can’t make anything past 20 yards and constantly shanking kickoffs. Special teams were bad for Alabama in the beginning of last season; could it get worse? If these issues are true, don’t expect Adoree’ to be able to field any kickoffs or punts. Which could mean he can use that extra energy for offense. What’s The Line? (-10.5) I’m not a gambling man, but I do know betting on USC is an absolute crap shoot. So here is my advice: If you are going to Dallas to get drunk, reunite with friends, and already have potential plan to leave at halftime, take USC. Winning will be a pleasant surprise. If even an ounce of your body thinks the Trojans have a chance, take USC. If you completely ignore this section and you grabbed a larger line earlier this year, you’re taking USC. If this tweet made you second guess yourself, take USC. Take USC. You’re taking USC. JUST. TAKE. THEM. Prediction Six months ago: I will punch anyone in the face who says USC can beat Alabama. Three months ago: You know, stranger things have happened. One month ago: I think we have a pretty good shot. Today: WE ARE ABOUT TO SHOCK THE WORLD! UNDEFEATED! I’ve tried and I’ve tried to talk myself out of this prediction, but it’s too early in the season to have anything but unreasonable amounts of optimism. We are playing the best team in the nation, the best program in the past decade, and I am ready to sing Sweet Home Alabama while simultaneously getting my ass kicked by five enraged Alabama fans as I walk out of Jerry World in victory. This has happened before. USC, led by Matt Leinart in his first career start upset №8 ranked Auburn on their way to a 12–1 season. History shows it’s possible. When USC has to show up early in the season against a ranked opponent, they have always stepped up to the challenge. Auburn in 2003, Ohio State in 2008, Ohio State (again) in 2009. When USC is ignored and disrespected as an opponent, they find ways to get the last laugh. Oregon in 2011, Stanford in 2013, Utah in 2015 (don’t show me the Vegas odds). It is only when we let our guards down do we get heartbroken (Stanford in 2007, Oregon State in 2008, Boston College in 2014). We have a plan in place. We’ve named a starting quarterback. We have the weapons and offensive live. We have the right defensive scheme again. We have the secondary to make up for our weaknesses in the front seven. We have RoJo. We have Adoree’. WE HAVE JUJU! Alabama is showing us no respect with having a two-man quarterback rotation. Their shakiness at special teams could lead to crucial mistakes. All it takes to swing a game is one or two plays. The Trojans will have to be perfect all four quarters. Because at the end of the day, it’s still Ala-fucking-bama. USC 28 Alabama 27 BRING IT BAMA! You can follow me on twitter at Sports By Scondi Special thanks to my numerous “editors”; Tim, James, Christina, Emma, and Jef Sources: USC Athletics, SBNation, Conquest Chronicles, ESPN, Reign of Troy, Rivals, Scout, Deadspin, Wikipedia, Google, ESPN, and a lot of other places ", "child": "1649_1"}