{"name": "1652", "parent": "", "title": "There Are No Winners After Preseason Darling Tennessee’s Last-Minute Escape", "sentences": [{"733b": "There Are No Winners After Preseason Darling Tennessee’s Last-Minute Escape"}, {"0f8c": "AP"}, {"69d7": "It’s the first real night of the 2016 college football season. Exciting times! To commemorate such an occasion, we’d normally devote this space to a “Winners and Losers” roundup. But I just spent the last few hours of my life staring into the depths of the SEC East abyss, so there are no winners right now. (Congrats to Louisville, I guess.) Instead, we only have thoughts on the evening’s losers."}, {"f638": "Loser: Tennessee"}, {"e750": "Here’s a partial list of the occurrences that needed to transpire for no. 9 Tennessee to escape with a 20–13 overtime win in a home game against a team from the Sun Belt:"}, {"e3d0": "The Volunteers’ run defense was porous, their offense anemic, and their roster undisciplined. They were SEC East favorites heading into the season; they left Thursday night rushing the field in celebration after an overtime win over a should-have-been patsy."}, {"a9f7": "Embrace the Overreaction to College Football’s Opening WeekYou’re wrong. But feeling right will be glorious while it lasts.theringer.com"}, {"a750": "Loser: Josh Dobbs’s Heisman Candidacy"}, {"3c10": "The Tennessee quarterback was supposed to do a lot this season: build on a promising junior year, confirm his status as a top dual-threat quarterback, and even mount a dark-horse Heisman candidacy. Then Dobbs threw for 192 yards on a measly 6.6 yards per attempt, hurled — in the “vomited” sense of the word more than the “threw” sense of the word — a terrible interception with his team trailing by two scores, and, as mentioned, fumbled into the end zone in overtime. He also produced negative rushing yards for the game — you, reader, sitting on your couch, had more rushing yards than Josh Dobbs did tonight. Technically, Dobbs’s candidacy didn’t even last until the first Saturday of the season."}, {"8e62": "Christian McCaffrey Doesn’t Want to Talk About the HeismanAnd unfortunately, Heisman voters don’t want to talk about himtheringer.com"}, {"585d": "Loser: Appalachian State"}, {"d1de": "Still best known for its landmark upset of no. 5 Michigan in the Big House in 2007, the Mountaineers squandered an opportunity to pull off a repeat feat against another top-10 team. Appalachian State is a good team that outscored its opponents by nearly 18 points per game last season, and it’s well positioned to compete in the Sun Belt this year, but going from controlling the game against an SEC contender to losing on a lucky fumble play has to hurt regardless."}, {"84a0": "Loser: Miami"}, {"2944": "The Hurricanes travel to Boone, North Carolina, in two weeks to play Appalachian State. Over the last two seasons, Miami is 4–7 in road games, including losses to Cincinnati and Virginia and a win against Duke that shouldn’t have counted. To be safe, let’s just mark Miami down as a preemptive loser."}, {"9775": "The 2016 College Football Weekly Watchability RankingsWe’re all looking forward to Week 1, but is it the best week of the season?theringer.com"}, {"0bfa": "Loser: Fans Without the SEC Network"}, {"17da": "Instead of viewing the thrilling finish in Knoxville, these unfortunate fans were stuck watching the South Carolina–Vanderbilt slog over on ESPN. Speaking of which …"}, {"2208": "Loser: The SEC East"}, {"42e9": "Even though it’s a highly hyped program that nearly lost to — again, because I can’t stress this enough — a team from the Sun Belt Conference, Tennessee actually might have played the best football of any SEC East team on Thursday. The South Carolina and Vandy offenses combined for a 45 percent completion rate, 4.9 yards per pass attempt, and 3.9 yards per carry. I won’t bore you with the gory details, except to give a hearty hurrah to South Carolina, which now sits alone in first place in the division standings and is safe there for at least a full week."}, {"7d5b": "Winner (OK, Fine, We Have Room for One): Us"}, {"7551": "If nothing else, tonight was fun; we missed you, college football. Let’s do this again on Saturday."}], "content": "There Are No Winners After Preseason Darling Tennessee’s Last-Minute Escape AP It’s the first real night of the 2016 college football season. Exciting times! To commemorate such an occasion, we’d normally devote this space to a “Winners and Losers” roundup. But I just spent the last few hours of my life staring into the depths of the SEC East abyss, so there are no winners right now. (Congrats to Louisville, I guess.) Instead, we only have thoughts on the evening’s losers. Loser: Tennessee Here’s a partial list of the occurrences that needed to transpire for no. 9 Tennessee to escape with a 20–13 overtime win in a home game against a team from the Sun Belt: The Volunteers’ run defense was porous, their offense anemic, and their roster undisciplined. They were SEC East favorites heading into the season; they left Thursday night rushing the field in celebration after an overtime win over a should-have-been patsy. Embrace the Overreaction to College Football’s Opening WeekYou’re wrong. But feeling right will be glorious while it lasts.theringer.com Loser: Josh Dobbs’s Heisman Candidacy The Tennessee quarterback was supposed to do a lot this season: build on a promising junior year, confirm his status as a top dual-threat quarterback, and even mount a dark-horse Heisman candidacy. Then Dobbs threw for 192 yards on a measly 6.6 yards per attempt, hurled — in the “vomited” sense of the word more than the “threw” sense of the word — a terrible interception with his team trailing by two scores, and, as mentioned, fumbled into the end zone in overtime. He also produced negative rushing yards for the game — you, reader, sitting on your couch, had more rushing yards than Josh Dobbs did tonight. Technically, Dobbs’s candidacy didn’t even last until the first Saturday of the season. Christian McCaffrey Doesn’t Want to Talk About the HeismanAnd unfortunately, Heisman voters don’t want to talk about himtheringer.com Loser: Appalachian State Still best known for its landmark upset of no. 5 Michigan in the Big House in 2007, the Mountaineers squandered an opportunity to pull off a repeat feat against another top-10 team. Appalachian State is a good team that outscored its opponents by nearly 18 points per game last season, and it’s well positioned to compete in the Sun Belt this year, but going from controlling the game against an SEC contender to losing on a lucky fumble play has to hurt regardless. Loser: Miami The Hurricanes travel to Boone, North Carolina, in two weeks to play Appalachian State. Over the last two seasons, Miami is 4–7 in road games, including losses to Cincinnati and Virginia and a win against Duke that shouldn’t have counted. To be safe, let’s just mark Miami down as a preemptive loser. The 2016 College Football Weekly Watchability RankingsWe’re all looking forward to Week 1, but is it the best week of the season?theringer.com Loser: Fans Without the SEC Network Instead of viewing the thrilling finish in Knoxville, these unfortunate fans were stuck watching the South Carolina–Vanderbilt slog over on ESPN. Speaking of which … Loser: The SEC East Even though it’s a highly hyped program that nearly lost to — again, because I can’t stress this enough — a team from the Sun Belt Conference, Tennessee actually might have played the best football of any SEC East team on Thursday. The South Carolina and Vandy offenses combined for a 45 percent completion rate, 4.9 yards per pass attempt, and 3.9 yards per carry. I won’t bore you with the gory details, except to give a hearty hurrah to South Carolina, which now sits alone in first place in the division standings and is safe there for at least a full week. Winner (OK, Fine, We Have Room for One): Us If nothing else, tonight was fun; we missed you, college football. Let’s do this again on Saturday. ", "child": "1652_1\t1652_2\t1652_3\t1652_4\t1652_5\t1652_6\t1652_7\t1652_8\t1652_9\t1652_10\t1652_11"}