{"name": "1653", "parent": "", "title": "Bama Ain’t Played Nobody", "sentences": [{"817e": "Bama Ain’t Played Nobody"}, {"55a7": "The masses seem to think that Alabama winning the national championship is a foregone conclusion, but a careful look at the Tide’s SEC competition sparks reason for doubt"}, {"9bdd": "Return with me, friends, to a time of Southern celebration. The date: October 28, 2014. The location: inside the College Football Playoff selection committee’s nuclear bunker, on the day of the group’s first rankings release. The matter of import: the SEC’s supremacy."}, {"6d7d": "No image better reflected that era of SEC dominance: A year after snapping its streak of winning seven consecutive national championships, the conference’s depth shone, with its typical middle tier and nontraditional powers looking just as formidable as other conferences’ blue bloods. Here were two Mississippi schools, which had produced just one 10-win season apiece since Bulldogs coach Dan Mullen was born in 1972, sitting atop the college football world."}, {"a549": "Two years and change later, the title of the country’s greatest football conference has migrated north to the Big Ten, as the SEC’s upper crust has crumbled into the nation’s soupy middle. Besides Alabama, sitting high and mighty atop its Tuscaloosa throne, no SEC team enters bowl season with fewer than four losses. Alabama ranks first in the country, but before the second SEC team appears in the AP Top 25 Poll (Auburn at no. 17), there are four teams each from the Big Ten and Pac-12, and three each from the ACC and Big 12. The SEC’s 2016 decline extended beyond the field, too: Verne Lundquist, the past decade’s de facto voice of college football, is retiring at season’s end."}, {"2d0f": "Verne Lundquist Is the Voice That College Football DeservesThe SEC’s play-by-play man has called some of the greatest sports moments ever with a singular, ecstatic joytheringer.com"}, {"dbeb": "The conference’s most exciting game this year might have been an October 1 clash between Tennessee and Georgia. Those two teams both began the season ranked; fittingly, they ended it outside the AP poll, with perfectly mediocre 4–4 records in SEC play."}, {"0fd2": "Alabama didn’t lose a game, of course, as Nick Saban’s squad avoided the seemingly contagious .500 conference mark. But a look at the Tide’s 13 leaguemates reveals a troubling fact: Put in SEC-friendly terms, Bama ain’t played nobody."}, {"873f": "That’s probably not going to be a problem for Alabama as it seeks a repeat national title, because this team might be the best ever, so normal concepts of battle-testedness might not apply. But if we’re looking for reasons the Crimson Tide might be vulnerable in the playoff — and we are, because the alternative is spending the next month planning a coronation — the absence of another top-tier team on their schedule thus far is a place to start."}, {"6b1b": "Sure, eight of the Tide’s 13 opponents were ranked at the time of the meeting, but only four remain in the AP poll, and the USC group Bama beat 52–6 on opening weekend might as well be a different team from the Sam Darnold–led one that’s playing in next month’s Rose Bowl. It might have been big news in October when Bama knocked off Tennessee and previously undefeated Texas A&M, but then Tennessee lost to South Carolina and Vanderbilt, and A&M lost to both Mississippi teams, rendering Alabama’s noteworthy wins mere minor accomplishments."}, {"8956": "There are more easy strikes against Alabama’s top-25 wins: Arkansas lost to Missouri, Ole Miss didn’t even reach a bowl game, and Auburn had fewer passing yards in all of November than Texas Tech quarterback Patrick Mahomes averaged per game this season."}, {"f465": "Don’t point to LSU as a test of equals, either. The Tigers were only a second too late to beat Auburn and a yard too short to beat Florida, and they rank well in the advanced stats, but they also scored fewer than 10 points per game in their four losses this year and haven’t completed a deep pass since JaMarcus Russell was quarterback (citation needed)."}, {"aa04": "What’s the Ideal Size for the College Football Playoff?Six teams? Eight? Sixteen? Literally everyone?theringer.com"}, {"f4e1": "Opposing quarterback play in particular weakened Alabama’s schedule. Competent passers Chad Kelly and Austin Allen helped their teams put up 73 combined points against the Tide, but the other Power Five quarterbacks to start against them this season were Max Browne, Stephen Johnson, Josh Dobbs, Trevor Knight, Danny Etling, Nick Fitzgerald, Jeremy Johnson, and Austin Appleby — none of whom rank in the top 50 nationally in passing yards per game. The only nice thing to say about that group is that Saban still spent valuable recruiting time furiously game-planning against it."}, {"bbc9": "Not that he really needed to. Against LSU, their best opponent by advanced metrics, they faced a Purdue transfer at quarterback; in their conference championship game, they faced another, worse Purdue transfer at quarterback. Even Big Ten teams weren’t lucky enough to face two different Boilermaker starting QBs this year."}, {"e5be": "At the same time that the other SEC teams were bludgeoning each other in a rock-paper-scissors chain — Auburn beats LSU beats A&M beats Auburn — they weren’t beating other good teams. Against non-SEC opponents ranked in the current Top 25, non-Alabama SEC teams went just 2–6, and wins that seemed notable early on — A&M over UCLA, Arkansas over TCU — fizzled as the season progressed. It’s no wonder that none of them could give Alabama a scare — heck, Mississippi State lost to a directional Alabama, which is leagues worse than losing to the actual thing."}, {"0d9e": "The College Football Playoff Committee Got It RightPenn State’s omission raises valid questions, but it wasn’t wrongtheringer.com"}, {"7e1c": "At least those Bulldogs might end their season on a high note, with a comfortable matchup against Miami (Ohio) in the St. Petersburg Bowl approaching; the rest of the conference can’t say as much. According to Vegas Insider, of the 11 non-Bama SEC teams playing in bowl games, only four opened as favorites, and only Mississippi State by more than a field goal; five were underdogs by more than a field goal. Compare that with the ACC, where only two of the 10 non-Clemson bowl teams opened as underdogs — and not one of the four facing SEC foes."}, {"57ba": "Granted, Alabama’s concern is not the fate of those “non-Bama teams” in the TaxSlayer and Belk Bowls. It’s their own upcoming game, for which the Tide are favored by more than two touchdowns. Washington quarterback Jake Browning is no Purdue transfer, though, and both Deshaun Watson and J.T. Barrett in a potential final would pose tougher challenges than Alabama’s relatively vulnerable secondary has had to face in months."}, {"b375": "The Alabama Dynasty Blocker Power RankingsIf you want the Tide to fizzle, root for these contenderstheringer.com"}, {"ec20": "Washington, Clemson, and Ohio State are all better teams than Alabama has played so far, and they all have beaten better teams than Alabama’s opponents have, too. Washington thumped Colorado and Stanford; Clemson came back against Florida State and Louisville; Ohio State rolled Oklahoma and survived Michigan and Wisconsin."}, {"0c8f": "If Alabama is to lose this season, and if the secondary starts surrendering rainbows downfield, it might just be because it hasn’t yet faced the combination of opponent caliber and style that its playoff opponents represent."}, {"1d4b": "But if Bama pummels Washington by three touchdowns and rolls over OSU in the final, feel free to let loose those “S-E-C” chants. Because maybe the same scheduling logic applies to the other playoff teams, too: In college football, nobody’s really played anybody until they’ve tried to beat back the Tide."}], "content": "Bama Ain’t Played Nobody The masses seem to think that Alabama winning the national championship is a foregone conclusion, but a careful look at the Tide’s SEC competition sparks reason for doubt Return with me, friends, to a time of Southern celebration. The date: October 28, 2014. The location: inside the College Football Playoff selection committee’s nuclear bunker, on the day of the group’s first rankings release. The matter of import: the SEC’s supremacy. No image better reflected that era of SEC dominance: A year after snapping its streak of winning seven consecutive national championships, the conference’s depth shone, with its typical middle tier and nontraditional powers looking just as formidable as other conferences’ blue bloods. Here were two Mississippi schools, which had produced just one 10-win season apiece since Bulldogs coach Dan Mullen was born in 1972, sitting atop the college football world. Two years and change later, the title of the country’s greatest football conference has migrated north to the Big Ten, as the SEC’s upper crust has crumbled into the nation’s soupy middle. Besides Alabama, sitting high and mighty atop its Tuscaloosa throne, no SEC team enters bowl season with fewer than four losses. Alabama ranks first in the country, but before the second SEC team appears in the AP Top 25 Poll (Auburn at no. 17), there are four teams each from the Big Ten and Pac-12, and three each from the ACC and Big 12. The SEC’s 2016 decline extended beyond the field, too: Verne Lundquist, the past decade’s de facto voice of college football, is retiring at season’s end. Verne Lundquist Is the Voice That College Football DeservesThe SEC’s play-by-play man has called some of the greatest sports moments ever with a singular, ecstatic joytheringer.com The conference’s most exciting game this year might have been an October 1 clash between Tennessee and Georgia. Those two teams both began the season ranked; fittingly, they ended it outside the AP poll, with perfectly mediocre 4–4 records in SEC play. Alabama didn’t lose a game, of course, as Nick Saban’s squad avoided the seemingly contagious .500 conference mark. But a look at the Tide’s 13 leaguemates reveals a troubling fact: Put in SEC-friendly terms, Bama ain’t played nobody. That’s probably not going to be a problem for Alabama as it seeks a repeat national title, because this team might be the best ever, so normal concepts of battle-testedness might not apply. But if we’re looking for reasons the Crimson Tide might be vulnerable in the playoff — and we are, because the alternative is spending the next month planning a coronation — the absence of another top-tier team on their schedule thus far is a place to start. Sure, eight of the Tide’s 13 opponents were ranked at the time of the meeting, but only four remain in the AP poll, and the USC group Bama beat 52–6 on opening weekend might as well be a different team from the Sam Darnold–led one that’s playing in next month’s Rose Bowl. It might have been big news in October when Bama knocked off Tennessee and previously undefeated Texas A&M, but then Tennessee lost to South Carolina and Vanderbilt, and A&M lost to both Mississippi teams, rendering Alabama’s noteworthy wins mere minor accomplishments. There are more easy strikes against Alabama’s top-25 wins: Arkansas lost to Missouri, Ole Miss didn’t even reach a bowl game, and Auburn had fewer passing yards in all of November than Texas Tech quarterback Patrick Mahomes averaged per game this season. Don’t point to LSU as a test of equals, either. The Tigers were only a second too late to beat Auburn and a yard too short to beat Florida, and they rank well in the advanced stats, but they also scored fewer than 10 points per game in their four losses this year and haven’t completed a deep pass since JaMarcus Russell was quarterback (citation needed). What’s the Ideal Size for the College Football Playoff?Six teams? Eight? Sixteen? Literally everyone?theringer.com Opposing quarterback play in particular weakened Alabama’s schedule. Competent passers Chad Kelly and Austin Allen helped their teams put up 73 combined points against the Tide, but the other Power Five quarterbacks to start against them this season were Max Browne, Stephen Johnson, Josh Dobbs, Trevor Knight, Danny Etling, Nick Fitzgerald, Jeremy Johnson, and Austin Appleby — none of whom rank in the top 50 nationally in passing yards per game. The only nice thing to say about that group is that Saban still spent valuable recruiting time furiously game-planning against it. Not that he really needed to. Against LSU, their best opponent by advanced metrics, they faced a Purdue transfer at quarterback; in their conference championship game, they faced another, worse Purdue transfer at quarterback. Even Big Ten teams weren’t lucky enough to face two different Boilermaker starting QBs this year. At the same time that the other SEC teams were bludgeoning each other in a rock-paper-scissors chain — Auburn beats LSU beats A&M beats Auburn — they weren’t beating other good teams. Against non-SEC opponents ranked in the current Top 25, non-Alabama SEC teams went just 2–6, and wins that seemed notable early on — A&M over UCLA, Arkansas over TCU — fizzled as the season progressed. It’s no wonder that none of them could give Alabama a scare — heck, Mississippi State lost to a directional Alabama, which is leagues worse than losing to the actual thing. The College Football Playoff Committee Got It RightPenn State’s omission raises valid questions, but it wasn’t wrongtheringer.com At least those Bulldogs might end their season on a high note, with a comfortable matchup against Miami (Ohio) in the St. Petersburg Bowl approaching; the rest of the conference can’t say as much. According to Vegas Insider, of the 11 non-Bama SEC teams playing in bowl games, only four opened as favorites, and only Mississippi State by more than a field goal; five were underdogs by more than a field goal. Compare that with the ACC, where only two of the 10 non-Clemson bowl teams opened as underdogs — and not one of the four facing SEC foes. Granted, Alabama’s concern is not the fate of those “non-Bama teams” in the TaxSlayer and Belk Bowls. It’s their own upcoming game, for which the Tide are favored by more than two touchdowns. Washington quarterback Jake Browning is no Purdue transfer, though, and both Deshaun Watson and J.T. Barrett in a potential final would pose tougher challenges than Alabama’s relatively vulnerable secondary has had to face in months. The Alabama Dynasty Blocker Power RankingsIf you want the Tide to fizzle, root for these contenderstheringer.com Washington, Clemson, and Ohio State are all better teams than Alabama has played so far, and they all have beaten better teams than Alabama’s opponents have, too. Washington thumped Colorado and Stanford; Clemson came back against Florida State and Louisville; Ohio State rolled Oklahoma and survived Michigan and Wisconsin. If Alabama is to lose this season, and if the secondary starts surrendering rainbows downfield, it might just be because it hasn’t yet faced the combination of opponent caliber and style that its playoff opponents represent. But if Bama pummels Washington by three touchdowns and rolls over OSU in the final, feel free to let loose those “S-E-C” chants. Because maybe the same scheduling logic applies to the other playoff teams, too: In college football, nobody’s really played anybody until they’ve tried to beat back the Tide. ", "child": "1653_1\t1653_2\t1653_3\t1653_4\t1653_5\t1653_6\t1653_7\t1653_8\t1653_9\t1653_10\t1653_11\t1653_12\t1653_13\t1653_14\t1653_15"}