{"name": "1654", "parent": "", "title": "Alabama Is Obliterating the Competition, and It’s Glorious", "sentences": [{"e63f": "Alabama Is Obliterating the Competition, and It’s Glorious"}, {"6f60": "Being the best team in college football isn’t cool. You know what’s cool? Systematically demolishing every opponent in your path."}, {"fac1": "My favorite college football book is probably George Orwell’s 1984, a novel about a dystopian future, “thoughtcrimes,” and the Alabama Crimson Tide. In it, Orwell writes — and I slightly paraphrase — “if you want a vision of [head coach Nick Saban’s program], imagine a boot stamping on a human face, forever.”"}, {"b229": "Typically, tides ebb and flow, but not the Crimson one. It’s hard to be consistent in college football, seeing as most of the players are teenagers — the world’s least consistent people — and even the good ones have to be replaced every three to five years. But in a sport where ranking in the top 25 signifies that a team is good, Alabama hasn’t finished outside the top 10 in the final AP poll since 2007."}, {"2016": "You can sort the last seven seasons of college football into two distinct categories: the four where Alabama won the national title and the three when it didn’t. In the latter category, a Crimson Tide loss was the most memorable/important game of the year. For me, the 2010 and 2013 Iron Bowls take home this honor pretty easily, and I’d say the same about the Ezekiel Elliott Extravaganza — when he carried 20 times for 230 rushing yards — in Ohio State’s 42–35 win over the Tide in the 2015 Sugar Bowl."}, {"1af2": "Damien Harris (Getty Images)"}, {"ad57": "When a black hole consumes something, the object’s mass adds to the mass of the black hole, making the gravitational force of the black hole even more powerful. Alabama is like this. It isn’t just the no. 1 team on the field; it’s also no. 1 in the recruiting rankings, maintaining the top spot in the 247Sports composite every year since 2011. (The last coach to best Bama here: Urban Meyer. At Florida.) The Tide have already landed three of the top seven prospects in the class of 2017. No other program has more than one. Sure, lots of schools turn on-field success into recruiting success, and vice versa. But Alabama has both the no. 1 chicken and the no. 1 egg in the world."}, {"02c8": "The Crimson Tide are the obvious enemy in college football. Their success is neither novel nor exciting, and comes at the expense of more lovable teams. Their monolithic dominance would seem like a depressing constant."}, {"2ddc": "And yet this year I’ve begun to love them."}, {"0255": "The Fatal Flaws for College Football’s Remaining UnbeatensAlabama, Clemson, Michigan, and Washington aren’t perfecttheringer.com"}, {"ce75": "Even in Alabama’s recent run of success, the Crimson Tide have rarely been perfect. Three of their national titles under Saban have come in seasons tainted by a loss. In 2011, that came in the SOMEBODY CROSSED MIDFIELD game, a 9–6 overtime thriller (sort of) against LSU. In 2012, it was Texas A&M’s Johnny Manziel starting the stopwatch on his three years of fame in a 29–24 result in Tuscaloosa. Last year, the loss came against Ole Miss, 43–37. Even in 2009, when Alabama went 14–0, it had a couple of close calls, including a game against Tennessee saved by multiple Terrence Cody field goal blocks."}, {"e2d0": "I expected Alabama to be like that this year: dominant, but imperfect. It had every reason to take a step back where it was last season. It lost a Heisman Trophy winner (Derrick Henry) and six defensive starters, and had a quarterback situation so weak that Saban, uncharacteristically, opted to start a true freshman in Jalen Hurts. It would have been totally understandable if Bama was merely, say, a top-5 team in the nation."}, {"6b0b": "But so far this fall, the Tide have blown up planets. They’re 8–0, and beat sixth-ranked Texas A&M by 19 points, ninth-ranked Tennessee by 39, and 20th-ranked USC by 46. (I know that was just USC’s preseason ranking, but still: They beat USC by 46!) Bama has allowed just 12 offensive touchdowns, and scored 12 touchdowns on defense and special teams. According to the box scores, the Tide did play in one close game: at Ole Miss on September 17. But they had an 18-point lead in the fourth quarter, and besides, in past years Mississippi mischief has been the only thing capable of toppling Bama."}, {"4b94": "I have grown tired of the Alabama that is merely the best team in college football. Somebody has to be the best. It’s not that impressive."}, {"b64d": "This season, though, Alabama has been better than the best. It’s been unflinching in its complete destruction of everything in its path. It’s taken teams that appeared to be good against non-Alabama competition and reduced them to rubble. The other remaining undefeated teams have all encountered some level of hardship, but not Alabama. It has just marched forward."}, {"5ed7": "I have always rooted against Alabama, and it’s felt natural. The Tide are the evil force in college football, and we’re preconditioned to oppose evil forces. As long as there’s any hope the resistance might succeed, you side with them. Yet with each passing week, Bama stomps out some of that hope. And as the Tide turn a 35-point lead into a 42-point lead, I find myself … enjoying it?"}, {"f073": "I have smiled as Alabama runs up the score on hopeless opponents. I’ve taken pleasure in Bama touchdowns that extend five-possession leads to six-possession leads. I have cackled with joy as coordinator Lane Kiffin’s offense enacted revenge killings on his former employers, USC and Tennessee. I have embraced the Sabanic rituals."}, {"24a4": "Next up is LSU, the 13th-ranked team in the country, and hypothetically this Saturday should bring a test for Alabama. The Tide are only favored by 7.5 points, their lowest point spread of the season, and will face star running back Leonard Fournette, who looked rejuvenated in steamrolling Ole Miss two weeks ago."}, {"6fbf": "This is my message to Alabama: Blow every opponent up. Just do it already. Be an evil altar worth worshipping at. Beat bad teams by 40. Beat good teams by 30. Beat great teams by 20. Be so dominant that everybody knows resistance is futile. Let us learn to cherish your enormous gray elephant hoof, stamping on our face — forever."}, {"00dc": "An earlier version of this story misstated the location of the 2011 regular-season LSU-Alabama game. The game was played at Alabama."}], "content": "Alabama Is Obliterating the Competition, and It’s Glorious Being the best team in college football isn’t cool. You know what’s cool? Systematically demolishing every opponent in your path. My favorite college football book is probably George Orwell’s 1984, a novel about a dystopian future, “thoughtcrimes,” and the Alabama Crimson Tide. In it, Orwell writes — and I slightly paraphrase — “if you want a vision of [head coach Nick Saban’s program], imagine a boot stamping on a human face, forever.” Typically, tides ebb and flow, but not the Crimson one. It’s hard to be consistent in college football, seeing as most of the players are teenagers — the world’s least consistent people — and even the good ones have to be replaced every three to five years. But in a sport where ranking in the top 25 signifies that a team is good, Alabama hasn’t finished outside the top 10 in the final AP poll since 2007. You can sort the last seven seasons of college football into two distinct categories: the four where Alabama won the national title and the three when it didn’t. In the latter category, a Crimson Tide loss was the most memorable/important game of the year. For me, the 2010 and 2013 Iron Bowls take home this honor pretty easily, and I’d say the same about the Ezekiel Elliott Extravaganza — when he carried 20 times for 230 rushing yards — in Ohio State’s 42–35 win over the Tide in the 2015 Sugar Bowl. Damien Harris (Getty Images) When a black hole consumes something, the object’s mass adds to the mass of the black hole, making the gravitational force of the black hole even more powerful. Alabama is like this. It isn’t just the no. 1 team on the field; it’s also no. 1 in the recruiting rankings, maintaining the top spot in the 247Sports composite every year since 2011. (The last coach to best Bama here: Urban Meyer. At Florida.) The Tide have already landed three of the top seven prospects in the class of 2017. No other program has more than one. Sure, lots of schools turn on-field success into recruiting success, and vice versa. But Alabama has both the no. 1 chicken and the no. 1 egg in the world. The Crimson Tide are the obvious enemy in college football. Their success is neither novel nor exciting, and comes at the expense of more lovable teams. Their monolithic dominance would seem like a depressing constant. And yet this year I’ve begun to love them. The Fatal Flaws for College Football’s Remaining UnbeatensAlabama, Clemson, Michigan, and Washington aren’t perfecttheringer.com Even in Alabama’s recent run of success, the Crimson Tide have rarely been perfect. Three of their national titles under Saban have come in seasons tainted by a loss. In 2011, that came in the SOMEBODY CROSSED MIDFIELD game, a 9–6 overtime thriller (sort of) against LSU. In 2012, it was Texas A&M’s Johnny Manziel starting the stopwatch on his three years of fame in a 29–24 result in Tuscaloosa. Last year, the loss came against Ole Miss, 43–37. Even in 2009, when Alabama went 14–0, it had a couple of close calls, including a game against Tennessee saved by multiple Terrence Cody field goal blocks. I expected Alabama to be like that this year: dominant, but imperfect. It had every reason to take a step back where it was last season. It lost a Heisman Trophy winner (Derrick Henry) and six defensive starters, and had a quarterback situation so weak that Saban, uncharacteristically, opted to start a true freshman in Jalen Hurts. It would have been totally understandable if Bama was merely, say, a top-5 team in the nation. But so far this fall, the Tide have blown up planets. They’re 8–0, and beat sixth-ranked Texas A&M by 19 points, ninth-ranked Tennessee by 39, and 20th-ranked USC by 46. (I know that was just USC’s preseason ranking, but still: They beat USC by 46!) Bama has allowed just 12 offensive touchdowns, and scored 12 touchdowns on defense and special teams. According to the box scores, the Tide did play in one close game: at Ole Miss on September 17. But they had an 18-point lead in the fourth quarter, and besides, in past years Mississippi mischief has been the only thing capable of toppling Bama. I have grown tired of the Alabama that is merely the best team in college football. Somebody has to be the best. It’s not that impressive. This season, though, Alabama has been better than the best. It’s been unflinching in its complete destruction of everything in its path. It’s taken teams that appeared to be good against non-Alabama competition and reduced them to rubble. The other remaining undefeated teams have all encountered some level of hardship, but not Alabama. It has just marched forward. I have always rooted against Alabama, and it’s felt natural. The Tide are the evil force in college football, and we’re preconditioned to oppose evil forces. As long as there’s any hope the resistance might succeed, you side with them. Yet with each passing week, Bama stomps out some of that hope. And as the Tide turn a 35-point lead into a 42-point lead, I find myself … enjoying it? I have smiled as Alabama runs up the score on hopeless opponents. I’ve taken pleasure in Bama touchdowns that extend five-possession leads to six-possession leads. I have cackled with joy as coordinator Lane Kiffin’s offense enacted revenge killings on his former employers, USC and Tennessee. I have embraced the Sabanic rituals. Next up is LSU, the 13th-ranked team in the country, and hypothetically this Saturday should bring a test for Alabama. The Tide are only favored by 7.5 points, their lowest point spread of the season, and will face star running back Leonard Fournette, who looked rejuvenated in steamrolling Ole Miss two weeks ago. This is my message to Alabama: Blow every opponent up. Just do it already. Be an evil altar worth worshipping at. Beat bad teams by 40. Beat good teams by 30. Beat great teams by 20. Be so dominant that everybody knows resistance is futile. Let us learn to cherish your enormous gray elephant hoof, stamping on our face — forever. An earlier version of this story misstated the location of the 2011 regular-season LSU-Alabama game. The game was played at Alabama. ", "child": "1654_1\t1654_2\t1654_3\t1654_4\t1654_5\t1654_6"}