{"name": "1656", "parent": "", "title": "Are the SEC’s Days As College Football’s Top Conference Numbered?", "sentences": [{"90dd": "Are the SEC’s Days As College Football’s Top Conference Numbered?"}, {"b63d": "AP Images"}, {"67e8": "Amid the cascade of GIF-worthy imagery from the first weekend of the college football season, I keep coming back to the look on Dan Mullen’s face. I can’t help it. Here was the coach of Mississippi State, an SEC football team, watching his kicker miss a very makeable field goal to seal a loss to the University of South Alabama, and what did Mullen have the audacity to do? He smiled. Seriously, he smiled. Well, first he spit, and then he smiled, but still …"}, {"1b4f": "Never mind that the smile was laced with irony, and never mind that the smile, if viewed with a certain amount of metaphorical detachment, was essentially a serene acknowledgment that this sport repeatedly defies every effort at logic and quantification. How dare our coach smile amid such a crippling moment for both the conference and the program, asked the profane band of philosophers on one Mississippi State message board. This was heart-attack serious; this was not a moment for even feigned levity. Because there are concerns at Mississippi State, but the problems potentially run deeper than those facing that program, or any other. For the first time in years, there may be inherent issues with the SEC itself, which, after the first week of the season, appears to be in at least slight danger of no longer being regarded as the best top-to-bottom conference in America."}, {"914e": "Embrace the Overreaction to College Football’s Opening WeekYou’re wrong. But feeling right will be glorious while it lasts.theringer.com"}, {"39c6": "Even outside of Starkville, some dark events took place for the conference, and most of them involved a disturbing trend: Many of these teams cannot score points. For years, that was not an issue within the confines of the SEC. For years, the consensus was that SEC teams could win by virtue of dominant defense and overarching athleticism, but that may no longer be the case: Eight out of 14 SEC teams scored 21 points or fewer in their openers, a number that won’t cut it in this wild and wooly modern age of college football. Of the 26 teams that scored more than 50 points in the first week of the season, exactly one belonged to the SEC; the team with the highest total yardage in Week 1, Georgia, put up 474 yards, five fewer than Eastern Michigan and still just the 46th highest total in America after Week 1. The conference as a whole went 7–7, notching the most losses among any Power Five league."}, {"daf4": "Now, you may accuse me of trolling here, and you are at least partially correct: This is most likely an overreaction based on a tiny sample size, and this slow start was most likely prompted at least in part by the fact that several SEC teams played top-tier opponents in the first week of the season. You may point to the bright moments amid the disasters; you may claim that, say, Georgia’s victory over then–no. 22 North Carolina negates Kentucky’s loss to Southern Mississippi, or that Texas A&M’s defeat of then–no. 16 UCLA counteracts Tennessee’s near-loss to Appalachian State. You may nod to the fact that Ole Miss put up a solid fight in what was essentially a road game against then–no. 4 Florida State, and that Auburn had a chance to defeat no. 2 Clemson on a Hail Mary, and you may remind me that Tennessee and Florida and Arkansas may have played lackluster games against second-tier opponents, but that they all wound up winning in the end."}, {"9428": "Everyone’s a Loser After Tennessee’s Insane Last-Minute WinCollege football is back, peopletheringer.com"}, {"990d": "And, of course, I have up to now ignored the literal elephant in the room, because it would appear that Alabama is the best team in the country once again by perhaps an even wider margin than Alabama has been the best team in the country in the past. Alabama put up 52 points, more than any other school in the conference, and the Crimson Tide did it against ranked USC on a neutral field, which is kind of hard to argue with. But this might be part of the problem for the SEC: As has been the case for nearly a decade, the Crimson Tide are setting a nearly unapproachable standard, especially during opening games against nonconference opponents. They tend to make everyone else look terrible by comparison."}, {"b2a7": "For instance, let us ask: In a world without Nick Saban, is an LSU loss to Wisconsin in a de facto road game really worth the hand-wringing proclamations it will engender this week? Probably not, but Les Miles already nearly got fired last season thanks to the increasingly lofty expectations brought about during the Era of Saban, and several other coaches in addition to Miles are on the verge of getting fired this year for the same reason. There is only one program in the SEC that can repeatedly intimidate both mid-major and Power Five schools every time it takes the field; for literally everyone else, the sense of invincibility that pervaded college football in the early 2010s is largely gone."}, {"dc7a": "LSU’s Loss Is Shocking — but the Reason Isn’tLes Miles needs to find a quarterbacktheringer.com"}, {"550a": "Does this mean that, say, the Pac-12 or the ACC or even the Big Ten could soon overtake the SEC as the best overarching football conference in the country? I doubt it, because the South still has a monopoly on both talent and fan interest. There are only two SEC teams (Alabama and Georgia) in the top 16 of the AP poll this week, but in a year that suddenly seems wide-open and volatile, a year in which a two-loss team may very likely qualify for the College Football Playoff, that has the potential to change radically by late September. But at least for the moment, the aura that has long surrounded the SEC is no longer there; and it is at least worth asking whether the SEC is in danger of growing top-heavy and hidebound, in the same way the Big Ten had over the course of the past several seasons before Jim Harbaugh began jarring it back to life."}, {"51c1": "Jim Harbaugh Isn’t a Football Coach — He’s an ExperienceWhat’s it like inside this Michigan Man’s brain?theringer.com"}, {"87ef": "Maybe it’s premature to panic, or maybe it’s way more serious than Dan Mullen is willing to let on."}], "content": "Are the SEC’s Days As College Football’s Top Conference Numbered? AP Images Amid the cascade of GIF-worthy imagery from the first weekend of the college football season, I keep coming back to the look on Dan Mullen’s face. I can’t help it. Here was the coach of Mississippi State, an SEC football team, watching his kicker miss a very makeable field goal to seal a loss to the University of South Alabama, and what did Mullen have the audacity to do? He smiled. Seriously, he smiled. Well, first he spit, and then he smiled, but still … Never mind that the smile was laced with irony, and never mind that the smile, if viewed with a certain amount of metaphorical detachment, was essentially a serene acknowledgment that this sport repeatedly defies every effort at logic and quantification. How dare our coach smile amid such a crippling moment for both the conference and the program, asked the profane band of philosophers on one Mississippi State message board. This was heart-attack serious; this was not a moment for even feigned levity. Because there are concerns at Mississippi State, but the problems potentially run deeper than those facing that program, or any other. For the first time in years, there may be inherent issues with the SEC itself, which, after the first week of the season, appears to be in at least slight danger of no longer being regarded as the best top-to-bottom conference in America. Embrace the Overreaction to College Football’s Opening WeekYou’re wrong. But feeling right will be glorious while it lasts.theringer.com Even outside of Starkville, some dark events took place for the conference, and most of them involved a disturbing trend: Many of these teams cannot score points. For years, that was not an issue within the confines of the SEC. For years, the consensus was that SEC teams could win by virtue of dominant defense and overarching athleticism, but that may no longer be the case: Eight out of 14 SEC teams scored 21 points or fewer in their openers, a number that won’t cut it in this wild and wooly modern age of college football. Of the 26 teams that scored more than 50 points in the first week of the season, exactly one belonged to the SEC; the team with the highest total yardage in Week 1, Georgia, put up 474 yards, five fewer than Eastern Michigan and still just the 46th highest total in America after Week 1. The conference as a whole went 7–7, notching the most losses among any Power Five league. Now, you may accuse me of trolling here, and you are at least partially correct: This is most likely an overreaction based on a tiny sample size, and this slow start was most likely prompted at least in part by the fact that several SEC teams played top-tier opponents in the first week of the season. You may point to the bright moments amid the disasters; you may claim that, say, Georgia’s victory over then–no. 22 North Carolina negates Kentucky’s loss to Southern Mississippi, or that Texas A&M’s defeat of then–no. 16 UCLA counteracts Tennessee’s near-loss to Appalachian State. You may nod to the fact that Ole Miss put up a solid fight in what was essentially a road game against then–no. 4 Florida State, and that Auburn had a chance to defeat no. 2 Clemson on a Hail Mary, and you may remind me that Tennessee and Florida and Arkansas may have played lackluster games against second-tier opponents, but that they all wound up winning in the end. Everyone’s a Loser After Tennessee’s Insane Last-Minute WinCollege football is back, peopletheringer.com And, of course, I have up to now ignored the literal elephant in the room, because it would appear that Alabama is the best team in the country once again by perhaps an even wider margin than Alabama has been the best team in the country in the past. Alabama put up 52 points, more than any other school in the conference, and the Crimson Tide did it against ranked USC on a neutral field, which is kind of hard to argue with. But this might be part of the problem for the SEC: As has been the case for nearly a decade, the Crimson Tide are setting a nearly unapproachable standard, especially during opening games against nonconference opponents. They tend to make everyone else look terrible by comparison. For instance, let us ask: In a world without Nick Saban, is an LSU loss to Wisconsin in a de facto road game really worth the hand-wringing proclamations it will engender this week? Probably not, but Les Miles already nearly got fired last season thanks to the increasingly lofty expectations brought about during the Era of Saban, and several other coaches in addition to Miles are on the verge of getting fired this year for the same reason. There is only one program in the SEC that can repeatedly intimidate both mid-major and Power Five schools every time it takes the field; for literally everyone else, the sense of invincibility that pervaded college football in the early 2010s is largely gone. LSU’s Loss Is Shocking — but the Reason Isn’tLes Miles needs to find a quarterbacktheringer.com Does this mean that, say, the Pac-12 or the ACC or even the Big Ten could soon overtake the SEC as the best overarching football conference in the country? I doubt it, because the South still has a monopoly on both talent and fan interest. There are only two SEC teams (Alabama and Georgia) in the top 16 of the AP poll this week, but in a year that suddenly seems wide-open and volatile, a year in which a two-loss team may very likely qualify for the College Football Playoff, that has the potential to change radically by late September. But at least for the moment, the aura that has long surrounded the SEC is no longer there; and it is at least worth asking whether the SEC is in danger of growing top-heavy and hidebound, in the same way the Big Ten had over the course of the past several seasons before Jim Harbaugh began jarring it back to life. Jim Harbaugh Isn’t a Football Coach — He’s an ExperienceWhat’s it like inside this Michigan Man’s brain?theringer.com Maybe it’s premature to panic, or maybe it’s way more serious than Dan Mullen is willing to let on. ", "child": "1656_1\t1656_2\t1656_3\t1656_4\t1656_5\t1656_6\t1656_7\t1656_8\t1656_9"}