{"name": "1659", "parent": "", "title": "Alabama Didn’t Have a Game Plan", "sentences": [{"6ce0": "Alabama Didn’t Have a Game Plan"}, {"a563": "At least not the right one, with these five factors contributing to the end of the Crimson Tide’s 26-game win streak and Clemson’s stunning championship"}, {"bf33": "As part of its collection of thrilling championship games and series, the past year has teased sports fans with plenty of could-have-been heroes: UNC’s Marcus Paige, miracle shot-maker, against Villanova; the dynasty-seeking Warriors, up three games to one, against the Cavs; Cleveland’s Rajai Davis, home run king, against the Cubs."}, {"27f7": "We can now add Alabama, one of the greatest collections of college football talent ever assembled, to the list. The Crimson Tide came literally one second away from a repeat title, in a near shot-for-shot remake of last season’s memorable national championship against Clemson. The Tigers won this time 35–31, with Deshaun Watson playing the best game by a college quarterback since Vince Young’s Rose Bowl. After sticking with Alabama for almost the full 60 minutes a year ago, it’s fitting that it took Clemson until the last second to finally clinch a crown."}, {"807b": "Alabama controlled most of the game, though, and lost for the first time under Nick Saban after leading by double digits entering the fourth quarter. The general outline of how the Tide squandered a 26-game winning streak stems largely from Watson’s MVP effort, but it extends to the Alabama sideline. Here are five key reasons the Tide failed to earn their fifth title in eight seasons:"}, {"a9a0": "1. An Imbalance in Offensive Approach"}, {"6e27": "For most of the second consecutive game, running back Bo Scarbrough was Alabama’s only weapon. The bruising sophomore back picked up 93 yards and two long touchdowns on 16 carries, and he seemed capable of breaking a big gain each time he lowered his head and bullied into the line."}, {"796c": "Bo Scarbrough (Getty Images)"}, {"be26": "Chances are Alabama would have sustained its lead and won the title had Scarbrough not gone down to injury late in the third quarter. Two plays after he limped off the field, tight end O.J. Howard slipped downfield for a 68-yard touchdown, but in their next three drives, the Tide totaled 27 yards on 10 plays. Those failed opportunities all came as they clung to a three-point lead, and each time they ran a few fruitless plays and punted — JK Scott punted a career-high 10 times in the game — they gifted Watson another chance to rewrite the championship narrative."}, {"d872": "But the offense’s sudden overreliance on Scarbrough, who had the fourth-most rushing yards on the team before the playoff semifinal, belied a broader problem with the championship game plan: a misguided emphasis on the passing game. By S&P+, Clemson’s defense ranked fourth nationally against the pass this year and just 26th against the run; Alabama’s offense was nearly the opposite, placing 25th with the pass and second with the run."}, {"8be0": "Deshaun Watson Just Became a College Football LegendClemson’s quarterback outlasted the mythical and swarming Alabama defense to cement his place in college football loretheringer.com"}, {"7742": "That disparity played true to the letter on Monday night. Alabama averaged 6.5 yards per carry; take out quarterback Jalen Hurts’s scrambles and receiver ArDarius Stewart’s 25-yard gain on a reverse, and the team’s running backs still put up 5.8 yards a pop. The passing game, meanwhile, managed a measly 4.8 yards per attempt, a number that fell to 2.1 on throws besides the long touchdown to Howard and the trick pass from Stewart late in the game."}, {"82e6": "In the semifinal against Washington, Hurts attempted just 14 passes to Alabama’s 50 runs. Discounting scrambles, though, Steve Sarkisian called more pass plays than runs against Clemson, an arrangement incompatible with the teams’ relative strengths and weaknesses. Although the program didn’t say as much, the new offensive coordinator likely took over after the Peach Bowl in part due to predecessor Lane Kiffin’s curious insistence on dropping Hurts to pass despite the running game’s clear superiority, but Sarkisian didn’t seem to incorporate that lesson into the plan against Clemson."}, {"2856": "2. A Lack of Passing Creativity"}, {"cd4f": "The limited success Alabama did have throwing the ball on Clemson’s stingy secondary stemmed from strategic wrinkles in the play calling. Howard galloped downfield completely ignored by the Tigers defense (again) because after Hurts had spent the early quarters tossing screen passes to set up that later downfield attempt, three Clemson players broke on the play to nullify a screen that didn’t come. And on their final touchdown drive, the Tide relied on a trick play, with Stewart uncorking a 24-yard throw to Howard after catching a lateral from Hurts."}, {"7028": "The other pass plays were far less imaginative in their design, and they led more frequently to Hurts rolling to his right, eyes scanning downfield for the open receivers who weren’t there, before either tucking the ball for a short gain or lofting a throwaway beyond the sideline."}, {"2fe3": "Seriously: 2.1 yards per attempt on those other throws. That’s what Rutgers quarterbacks averaged against Ohio State’s secondary this season. Alabama’s offense boasts five-star receivers, a talented if raw quarterback, and stud offensive linemen, but the combination of a plodding, uncreative approach and an athletic defensive unit neutralized those advantages."}, {"1214": "3. No Touchdowns Off Turnovers"}, {"18aa": "Although it qualified as a minor surprise that Alabama’s defense didn’t score a touchdown, that relentless group still gave its offensive counterpart chances with a short field, at least in the first three quarters. The Crimson Tide could have — and should have — put the game away early, but they could never boost the lead to more than two scores, meaning Clemson and Watson were always close enough to come back."}, {"219d": "After a botched Clemson snap late in the first quarter, the Tide started a possession at the Tigers’ 35-yard line. They proceeded to retreat 7 yards before punting. Early in the third quarter, a highlight-worthy effort by linebacker Ryan Anderson forced another fumble and gave Alabama the ball at Clemson’s 16. Three plays later, the Tide could manage only a field goal."}, {"830f": "Both of those fizzled drives began with a false start from Cam Robinson, the best left tackle in the country, which both hindered Bama’s scoring chances and brings us to …"}, {"86f3": "4. Too Many Penalties"}, {"c011": "Alabama collected 82 penalty yards on nine infractions, an uncharacteristic amount for a Saban squad: Last year against Clemson, the Tide suffered just two penalties for 21 yards, and entering Monday night’s game, they were tied for 15th nationally in fewest penalty yards per game."}, {"c709": "Clemson, which ranked 90th in that statistic, should have been concerned about penalties after accumulating 101 penalty yards in its loss to Pitt and 84 in its near-loss to Florida State. But Monday night, flags set the Tigers back only 35 yards."}, {"c5e4": "Key Bama mistakes helped Clemson on each of its final two scoring drives, and the pass interference call against corner Anthony Averett with six seconds left set Watson up for the winning touchdown from just 2 yards out."}, {"b4ea": "5. A Tired Defense"}, {"d016": "Even with the above four problems, though, Alabama was still in prime position to win. The Tide owned the turnover battle, for one, and their offensive stagnation undercut a 31-point showing and a coming-of-age drive from the freshman Hurts to regain the lead with two minutes left."}, {"1846": "Clemson’s offensive brilliance won the game, but Alabama’s fourth-quarter defensive hiccup helped the Tigers along the way. They scored touchdowns on three of their last five drives, and leading up to their two scores in the game’s closing minutes, they averaged more than 10 yards per play and traveled 156 yards in just four minutes and one second of game time."}, {"ea11": "The Tide defenders never collapsed, and they kept Watson under constant pressure, registering four sacks, but they also missed tackles late and gave the Tigers quarterback cleaner throwing lanes than he had enjoyed earlier in the game. Maybe they were tired."}, {"d3d9": "Clemson ran 99 plays, Alabama just 66. The broadcasters spoke early in the game about Clemson coach Dabo Swinney’s belief that the Tide’s defensive group had more talent on the top line but less depth than last year’s iteration, and that bit of reconnaissance may have paid dividends. Clemson entered the fourth quarter having run more plays than Alabama managed all game, and it probably isn’t a coincidence that the Tigers more than doubled their scoring output in the final frame."}, {"0427": "Jalen Hurts (Getty Images)"}, {"dfcd": "Taken all together, it’s not as if Clemson exposed a new formula for beating a Saban Alabama squad. It took the same ingredients we’d suspected all along: a mobile, transcendent quarterback playing the game of his life; an active defensive front capable of pressuring Hurts; and some extra moments of fortune created by both skill (see: all of Mike Williams’s sprawling catches) and luck (facing a reduced running game in the fourth quarter)."}, {"3c83": "Even with those factors all working against Alabama, Clemson still needed to score a touchdown with one second left to win. The Tide should be back in the playoff next year, with an offense that averaged 38.8 points per game and will return a more experienced Hurts and a backfield of Scarbrough, Damien Harris, Josh Jacobs, and no. 1 national recruit Najee Harris; a defense that will keep churning out high first-round picks; and the best top-to-bottom coaching staff in the country."}, {"2435": "It’s not often that Alabama even gives an opponent an opportunity to score an upset; it’s less often that such a lucky opponent has the players, plans, and breaks to capitalize. But for the first time in Saban’s coaching career, his team lost in the national championship. The Tide could have crafted a more refined offensive plan and avoided unforced errors — instead, they gave Watson a chance. And he took it."}], "content": "Alabama Didn’t Have a Game Plan At least not the right one, with these five factors contributing to the end of the Crimson Tide’s 26-game win streak and Clemson’s stunning championship As part of its collection of thrilling championship games and series, the past year has teased sports fans with plenty of could-have-been heroes: UNC’s Marcus Paige, miracle shot-maker, against Villanova; the dynasty-seeking Warriors, up three games to one, against the Cavs; Cleveland’s Rajai Davis, home run king, against the Cubs. We can now add Alabama, one of the greatest collections of college football talent ever assembled, to the list. The Crimson Tide came literally one second away from a repeat title, in a near shot-for-shot remake of last season’s memorable national championship against Clemson. The Tigers won this time 35–31, with Deshaun Watson playing the best game by a college quarterback since Vince Young’s Rose Bowl. After sticking with Alabama for almost the full 60 minutes a year ago, it’s fitting that it took Clemson until the last second to finally clinch a crown. Alabama controlled most of the game, though, and lost for the first time under Nick Saban after leading by double digits entering the fourth quarter. The general outline of how the Tide squandered a 26-game winning streak stems largely from Watson’s MVP effort, but it extends to the Alabama sideline. Here are five key reasons the Tide failed to earn their fifth title in eight seasons: 1. An Imbalance in Offensive Approach For most of the second consecutive game, running back Bo Scarbrough was Alabama’s only weapon. The bruising sophomore back picked up 93 yards and two long touchdowns on 16 carries, and he seemed capable of breaking a big gain each time he lowered his head and bullied into the line. Bo Scarbrough (Getty Images) Chances are Alabama would have sustained its lead and won the title had Scarbrough not gone down to injury late in the third quarter. Two plays after he limped off the field, tight end O.J. Howard slipped downfield for a 68-yard touchdown, but in their next three drives, the Tide totaled 27 yards on 10 plays. Those failed opportunities all came as they clung to a three-point lead, and each time they ran a few fruitless plays and punted — JK Scott punted a career-high 10 times in the game — they gifted Watson another chance to rewrite the championship narrative. But the offense’s sudden overreliance on Scarbrough, who had the fourth-most rushing yards on the team before the playoff semifinal, belied a broader problem with the championship game plan: a misguided emphasis on the passing game. By S&P+, Clemson’s defense ranked fourth nationally against the pass this year and just 26th against the run; Alabama’s offense was nearly the opposite, placing 25th with the pass and second with the run. Deshaun Watson Just Became a College Football LegendClemson’s quarterback outlasted the mythical and swarming Alabama defense to cement his place in college football loretheringer.com That disparity played true to the letter on Monday night. Alabama averaged 6.5 yards per carry; take out quarterback Jalen Hurts’s scrambles and receiver ArDarius Stewart’s 25-yard gain on a reverse, and the team’s running backs still put up 5.8 yards a pop. The passing game, meanwhile, managed a measly 4.8 yards per attempt, a number that fell to 2.1 on throws besides the long touchdown to Howard and the trick pass from Stewart late in the game. In the semifinal against Washington, Hurts attempted just 14 passes to Alabama’s 50 runs. Discounting scrambles, though, Steve Sarkisian called more pass plays than runs against Clemson, an arrangement incompatible with the teams’ relative strengths and weaknesses. Although the program didn’t say as much, the new offensive coordinator likely took over after the Peach Bowl in part due to predecessor Lane Kiffin’s curious insistence on dropping Hurts to pass despite the running game’s clear superiority, but Sarkisian didn’t seem to incorporate that lesson into the plan against Clemson. 2. A Lack of Passing Creativity The limited success Alabama did have throwing the ball on Clemson’s stingy secondary stemmed from strategic wrinkles in the play calling. Howard galloped downfield completely ignored by the Tigers defense (again) because after Hurts had spent the early quarters tossing screen passes to set up that later downfield attempt, three Clemson players broke on the play to nullify a screen that didn’t come. And on their final touchdown drive, the Tide relied on a trick play, with Stewart uncorking a 24-yard throw to Howard after catching a lateral from Hurts. The other pass plays were far less imaginative in their design, and they led more frequently to Hurts rolling to his right, eyes scanning downfield for the open receivers who weren’t there, before either tucking the ball for a short gain or lofting a throwaway beyond the sideline. Seriously: 2.1 yards per attempt on those other throws. That’s what Rutgers quarterbacks averaged against Ohio State’s secondary this season. Alabama’s offense boasts five-star receivers, a talented if raw quarterback, and stud offensive linemen, but the combination of a plodding, uncreative approach and an athletic defensive unit neutralized those advantages. 3. No Touchdowns Off Turnovers Although it qualified as a minor surprise that Alabama’s defense didn’t score a touchdown, that relentless group still gave its offensive counterpart chances with a short field, at least in the first three quarters. The Crimson Tide could have — and should have — put the game away early, but they could never boost the lead to more than two scores, meaning Clemson and Watson were always close enough to come back. After a botched Clemson snap late in the first quarter, the Tide started a possession at the Tigers’ 35-yard line. They proceeded to retreat 7 yards before punting. Early in the third quarter, a highlight-worthy effort by linebacker Ryan Anderson forced another fumble and gave Alabama the ball at Clemson’s 16. Three plays later, the Tide could manage only a field goal. Both of those fizzled drives began with a false start from Cam Robinson, the best left tackle in the country, which both hindered Bama’s scoring chances and brings us to … 4. Too Many Penalties Alabama collected 82 penalty yards on nine infractions, an uncharacteristic amount for a Saban squad: Last year against Clemson, the Tide suffered just two penalties for 21 yards, and entering Monday night’s game, they were tied for 15th nationally in fewest penalty yards per game. Clemson, which ranked 90th in that statistic, should have been concerned about penalties after accumulating 101 penalty yards in its loss to Pitt and 84 in its near-loss to Florida State. But Monday night, flags set the Tigers back only 35 yards. Key Bama mistakes helped Clemson on each of its final two scoring drives, and the pass interference call against corner Anthony Averett with six seconds left set Watson up for the winning touchdown from just 2 yards out. 5. A Tired Defense Even with the above four problems, though, Alabama was still in prime position to win. The Tide owned the turnover battle, for one, and their offensive stagnation undercut a 31-point showing and a coming-of-age drive from the freshman Hurts to regain the lead with two minutes left. Clemson’s offensive brilliance won the game, but Alabama’s fourth-quarter defensive hiccup helped the Tigers along the way. They scored touchdowns on three of their last five drives, and leading up to their two scores in the game’s closing minutes, they averaged more than 10 yards per play and traveled 156 yards in just four minutes and one second of game time. The Tide defenders never collapsed, and they kept Watson under constant pressure, registering four sacks, but they also missed tackles late and gave the Tigers quarterback cleaner throwing lanes than he had enjoyed earlier in the game. Maybe they were tired. Clemson ran 99 plays, Alabama just 66. The broadcasters spoke early in the game about Clemson coach Dabo Swinney’s belief that the Tide’s defensive group had more talent on the top line but less depth than last year’s iteration, and that bit of reconnaissance may have paid dividends. Clemson entered the fourth quarter having run more plays than Alabama managed all game, and it probably isn’t a coincidence that the Tigers more than doubled their scoring output in the final frame. Jalen Hurts (Getty Images) Taken all together, it’s not as if Clemson exposed a new formula for beating a Saban Alabama squad. It took the same ingredients we’d suspected all along: a mobile, transcendent quarterback playing the game of his life; an active defensive front capable of pressuring Hurts; and some extra moments of fortune created by both skill (see: all of Mike Williams’s sprawling catches) and luck (facing a reduced running game in the fourth quarter). Even with those factors all working against Alabama, Clemson still needed to score a touchdown with one second left to win. The Tide should be back in the playoff next year, with an offense that averaged 38.8 points per game and will return a more experienced Hurts and a backfield of Scarbrough, Damien Harris, Josh Jacobs, and no. 1 national recruit Najee Harris; a defense that will keep churning out high first-round picks; and the best top-to-bottom coaching staff in the country. It’s not often that Alabama even gives an opponent an opportunity to score an upset; it’s less often that such a lucky opponent has the players, plans, and breaks to capitalize. But for the first time in Saban’s coaching career, his team lost in the national championship. The Tide could have crafted a more refined offensive plan and avoided unforced errors — instead, they gave Watson a chance. And he took it. ", "child": "1659_1\t1659_2\t1659_3\t1659_4\t1659_5\t1659_6\t1659_7"}