{"name": "1664", "parent": "", "title": "No One Can Beat Alabama", "sentences": [{"d113": "No One Can Beat Alabama"}, {"344d": "But if you want to believe otherwise, here’s the order in which you should be rooting for the remaining playoff contenders"}, {"089c": "Conference championship weekend is upon us, and by Sunday, the College Football Playoff field will be set. The on-field results and the selection committee’s subsequent deliberations should answer a number of questions about how the playoff works: How much does winning a conference championship matter? Is playing a demanding nonconference schedule essential? Can a single division place two teams into the four-school bracket?"}, {"e3b8": "One further question, however, will remain unanswered until January’s games: Can any contender possibly take down no. 1 Alabama?"}, {"c344": "Because while this season has delivered an ample supply of upsets, CFB-branded chaos, and interconference posturing, it all might be for naught. Alabama, which is poised to blow out Florida in this weekend’s SEC championship game to cap off an undefeated 2016 calendar year, again appears unbeatable, the unstoppable force and immovable object merged in a single locker room."}, {"fe92": "The Crimson Tide haven’t allowed a touchdown since October 22. By one advanced metric, Alabama boasts the best team since World War II. By another, it’s about to become the best since at least FDR’s first term."}, {"f4f8": "According to FiveThirtyEight’s projections, seven non-Bama teams have at least a 5 percent chance of reaching the playoff. (Sorry about your season-altering officiating troubles, Oklahoma State. I’ve been nagging my editor about your playoff case the past few weeks, but my support doesn’t appear to be enough.) Few of those seven have a realistic path to winning the title; even fewer will gain the opportunity to try. But they’re all that stands between Nick Saban and his fifth national title in Tuscaloosa. So for the observers chiefly interested in obstructing Alabama’s dynasty, root for the contenders, in this order, to reach the playoff."}, {"3477": "7. Wisconsin"}, {"0354": "Wisconsin has an excellent defense. We know this, and we can compliment coach Paul Chryst on it, and we can revel in the Badgers’ October slugfests against Michigan and Ohio State. We can also acknowledge that against Bama, having an excellent defense doesn’t matter all that much. Here are two guidelines, empirically based, that influenced this set of rankings:"}, {"bf3b": "First, to beat Alabama, a team must be able to score points. Since Saban’s second season in Tuscaloosa, the only time his team has lost while allowing fewer than 23 points was the seesawing 9–6 overtime classic against LSU in 2011. In that span, the Crimson Tide are 99–1 when allowing 22 points or fewer but have a losing record when surrendering 23 or more."}, {"70c0": "Second, to score on Alabama, a team has to be able to throw the ball. That’s because planning to run on the Tide is an easy path to a game full of three-and-outs; they haven’t allowed an opponent to average more than 3.06 yards per carry in a game this year, and no individual rusher has gained 100 yards on the ground against Bama since last October. Meanwhile, the opponents that have done some damage to the scoreboard this year (Ole Miss and Arkansas) have relied on passing volume to threaten the defense."}, {"13e9": "So, Wisconsin. The Badgers rank outside the top 100 nationally in passing yardage, and, until they beat up on Illinois and Purdue earlier this month, they had more interceptions than passing touchdowns. The 9-for-25, 88-yard effort against Michigan may have been an anomaly, but it’s not like Saban’s defense is any more forgiving than Jim Harbaugh’s. Were the Badgers to win the Big Ten title and face Alabama in the playoff’s first round, they would likely, and regrettably, resemble the Michigan State team that Saban’s squad crushed 38–0 in last season’s semifinals."}, {"4a6e": "6. Colorado"}, {"79a2": "Two weeks ago, I examined Colorado’s greatest strength: its pass defense, which has stifled opposing quarterbacks all season and recently held Washington State’s Luke Falk below a 50 percent completion rate for the first time in the Air Raid QB’s prolific career. To update a chart I made then:"}, {"2475": "Unfortunately for the Buffaloes, Alabama doesn’t need to excel through the air in order to win games. Four times this year, Alabama defeated a ranked opponent without reaching even 200 passing yards; in none of those games did quarterback Jalen Hurts throw more touchdowns than interceptions. It didn’t matter, though, because Bama also has a dominant defense and reliable running game to support its inconsistent aerial attack."}, {"a873": "One of College Football’s Sleeping Giants Has AwokenHow a defensive revival triggered Colorado’s resurgencetheringer.com"}, {"0883": "Given Colorado’s middling offense (36th nationally in points per game, tied for 68th in yards per play) and rush defense (33rd in yards per game, tied for 38th in yards per carry allowed) the Buffaloes wouldn’t be able to compete in all phases of the game. The team is a great story, maybe the best in college football this year, and deserves all sorts of credit for reaching the Pac-12 title game. Hoping for even a playoff berth, let alone a close game against Alabama, might be too much for the final chapter."}, {"f062": "5. Penn State"}, {"a632": "The Nittany Lions defeated Ohio State, haven’t lost since September, and have won their past five games by an average margin of 30.2 points. They can score (39 points or more in every game since beating the Buckeyes) and defend (11th nationally in defensive S&P+ this year). They had more rushing yards earlier this month against Iowa than the Hawkeyes had allowed in any game since 2000."}, {"bbba": "And yet, Penn State has just about no chance to beat Alabama. Even granting them credit for the upset of Ohio State, which required the fluke of blocking both a kick and a punt in the fourth quarter, the Nittany Lions needed overtime to beat Minnesota and trailed Indiana with four minutes left, in a game in which they were lucky to recover all five of Indiana’s fumbles. At times, they’ve been just good enough to survive, and that’s not enough against Alabama."}, {"8b51": "A key weakness also bodes terribly for Penn State, even if the team beats Wisconsin on Saturday and sneaks into the playoff: Its young offensive line is one of the worst in the FBS (103rd in tackles for loss allowed), while Alabama’s defensive counterpart does things like this:"}, {"3f75": "4. Oklahoma"}, {"2a4d": "The three teams to come in this ranking are all favorites to make the playoff; Oklahoma, like the three already listed, needs some help. To reach the national semifinals, Oklahoma needs to impress against Oklahoma State in the de facto Big 12 title game this weekend while also enjoying losses from several of the teams ranked above it (both here and in the actual committee rankings). If those events somehow transpire, the Sooners would give Alabama a unique challenge due to their all-offense style, which is unlike the ethos of any other team in the discussion."}, {"3c7a": "Oklahoma Won the College Football WeekendThe playoff suddenly doesn’t look too far awaytheringer.com"}, {"b95c": "Oklahoma’s defense has been porous all year — in a record-setting fashion at times — and the Sooners lost both of their nonconference games against ranked teams (Houston and Ohio State) by double digits. So it’s not that Bob Stoops’s chance of upsetting Saban would be good, per se."}, {"2140": "But the chance would be there, thanks to Oklahoma’s offense, which ranks first in the country by S&P+ and a narrow second in points per game. The best quarterback Alabama faced this year was Ole Miss’s Chad Kelly, who torched the Tide for 43 points for the second consecutive season, and Oklahoma’s Baker Mayfield is a better, more polished version of Kelly."}, {"129a": "If Mayfield ended the season with his current mark, he would own the sport’s highest passer rating in at least 60 years (194.7, using the college formula). Toledo’s Logan Woodside has the second-highest mark in the FBS this year, and Mayfield hasn’t delivered a single-game rating below Woodside’s season rating in two months."}, {"9daa": "In other words, Mayfield’s played like the best quarterback in the country every weekend since the start of Big 12 play — which aligns with the full recovery of star receiver Dede Westbrook from injury. Since the start of October, Westbrook has recorded averages of 6.6 catches, 150 yards, and 1.9 touchdowns per game, giving him one of the best receiving stretches in recent memory."}, {"0f87": "Combine the Mayfield-Westbrook connection with the rushing tandem of Samaje Perine and Joe Mixon (against whom part of a civil lawsuit filed after he punched a female student is still working its way through Oklahoma courts), and the Sooners’ skill-position assemblage is the most talented in the country. That might just be enough for a fair fight against a similarly skilled Alabama D."}, {"3348": "3. Clemson"}, {"8043": "Clemson hung 40 points and 550 yards on Alabama in the national title game just 11 months ago, so by virtue of the “been there, done that” principle, the Tigers can’t drop any further down this list. While Clemson has looked plenty beatable this season, it’s survived both Louisville and Florida State in thrillers, and its statistical profile is actually quite similar to last year’s."}, {"9882": "Remember, in last year’s championship, the Tide returned a kickoff for a touchdown and captured a surprise onside kick and still beat Clemson by only five. Quarterback Jake Coker was flawless in his final college game; against an aggressive Clemson rush this year, freshman Jalen Hurts, who threw eight interceptions in as many conference games, might not be. Heisman winner Derrick Henry (158 yards, three TDs against Clemson) is gone, too."}, {"bd1b": "In Clemson’s best possible game, its ceiling is the highest of any team on this list. A disruptive defense — tied for third in the country in sacks and third in havoc rate, which combines tackles for loss, passes defended, and fumbles forced — could give Alabama a taste of its own cough-the-ball-up medicine, and if quarterback Deshaun Watson limited turnovers, the Tigers would stay close for 60 minutes."}, {"5cc6": "The problem is that, even with better play of late, they haven’t displayed the consistency they would need to take down Bama. Syracuse is Clemson’s only FBS opponent not to force at least one turnover; the 54–0 win over Syracuse is also the Tigers’ only time winning the turnover battle in the last half of the season. Giving away possessions cost Clemson last season’s national championship, and there’s no evidence that a rematch would play out any differently."}, {"25dc": "2. Ohio State"}, {"db39": "1. Washington"}, {"59f0": "I’m putting these two together for a reason, so hold off on your Twitter attacks, Buckeyes fans. (You just beat your rival in an all-timer! You should be happy!)"}, {"a324": "Remember that 23-point mark that teams must reach to cause Alabama problems? Ohio State put up 23, 21, and 17 points in regulation against the three best defenses (Wisconsin, Penn State, and Michigan, respectively) it faced this season. Also remember that running the ball isn’t the way to challenge Alabama — even for the Buckeyes, who have the country’s best run-blocking offensive line but haven’t moved the ball well against top defenses, managing only between 4.1 and 4.2 yards per carry in those three games."}, {"a9a6": "Ohio State Marks Its SpotThe Buckeyes’ win over Michigan had it all: great defense, playoff implications, and an officiating controversytheringer.com"}, {"e872": "OSU quarterback J.T. Barrett would be the most important player against Bama. Overall, Barrett’s numbers this season look solid, even downballot-Heisman-worthy: 33 total touchdowns to just five interceptions, while leading the no. 2 team in the country in the nation’s toughest conference. With his mobility, moreover, Barrett fits the profile of the dual-option QB that has given Alabama fits in recent years."}, {"aca2": "Except Johnny Manziel completed 77 percent of his passes and averaged better than 8 yards per attempt when he upset Alabama as a freshman, and Cam Newton complemented his rushing prowess with three passing touchdowns and 10.8 yards per attempt in his Iron Bowl comeback in 2010. Barrett’s performance this year lends little evidence that he’d be able to do the same."}, {"dd3f": "The below chart shows Barrett’s stats from his six best games this year (ordered by the NFL formula for passer rating) and the stats from his six worst. The first grouping includes games against the likes of Rutgers and Bowling Green, the second against the likes of Michigan and Wisconsin."}, {"07ee": "Obviously Barrett’s numbers from his worst six games would be worse than those from his best six games. But compare Barrett’s worst performances to the worst from Washington’s Jake Browning (after splitting his game log the same way). When Barrett was relatively bad, he was really bad; when Browning was relatively bad, he was still a capable, productive QB."}, {"e836": "Barrett’s opposition was tougher, but even when adjusted by factors such as opponent quality, Washington boasts the second-best passing attack in the FBS this year (Ohio State is down at 53rd)."}, {"866a": "More components of a potential playoff matchup work in Washington’s favor as well."}, {"d39d": "The Huskies’ offense is a top-five unit by both efficiency and explosiveness (in the playoff era, only this season’s Louisville team can say the same), and with receivers John Ross (14.9 yards per reception, 16 touchdowns) and Dante Pettis (16.1 and 14, respectively), Browning has the weapons to challenge Bama downfield."}, {"0b81": "Washington’s defense is nearly as stout as Ohio State’s — it’s actually better against the rush, which is the Tide’s offensive anchor — and is the best in the country at creating turnovers. The Huskies also have four kick-return touchdowns this season (Ohio State has none), including a game winner, suggesting they could pull a 2015 Alabama and win a playoff game with special teams points."}, {"1a16": "Ohio State is probably a better team than Washington, but the Huskies match up better against Alabama. Depending on playoff seeding, both could play the Tide in January and put this theory to the test."}], "content": "No One Can Beat Alabama But if you want to believe otherwise, here’s the order in which you should be rooting for the remaining playoff contenders Conference championship weekend is upon us, and by Sunday, the College Football Playoff field will be set. The on-field results and the selection committee’s subsequent deliberations should answer a number of questions about how the playoff works: How much does winning a conference championship matter? Is playing a demanding nonconference schedule essential? Can a single division place two teams into the four-school bracket? One further question, however, will remain unanswered until January’s games: Can any contender possibly take down no. 1 Alabama? Because while this season has delivered an ample supply of upsets, CFB-branded chaos, and interconference posturing, it all might be for naught. Alabama, which is poised to blow out Florida in this weekend’s SEC championship game to cap off an undefeated 2016 calendar year, again appears unbeatable, the unstoppable force and immovable object merged in a single locker room. The Crimson Tide haven’t allowed a touchdown since October 22. By one advanced metric, Alabama boasts the best team since World War II. By another, it’s about to become the best since at least FDR’s first term. According to FiveThirtyEight’s projections, seven non-Bama teams have at least a 5 percent chance of reaching the playoff. (Sorry about your season-altering officiating troubles, Oklahoma State. I’ve been nagging my editor about your playoff case the past few weeks, but my support doesn’t appear to be enough.) Few of those seven have a realistic path to winning the title; even fewer will gain the opportunity to try. But they’re all that stands between Nick Saban and his fifth national title in Tuscaloosa. So for the observers chiefly interested in obstructing Alabama’s dynasty, root for the contenders, in this order, to reach the playoff. 7. Wisconsin Wisconsin has an excellent defense. We know this, and we can compliment coach Paul Chryst on it, and we can revel in the Badgers’ October slugfests against Michigan and Ohio State. We can also acknowledge that against Bama, having an excellent defense doesn’t matter all that much. Here are two guidelines, empirically based, that influenced this set of rankings: First, to beat Alabama, a team must be able to score points. Since Saban’s second season in Tuscaloosa, the only time his team has lost while allowing fewer than 23 points was the seesawing 9–6 overtime classic against LSU in 2011. In that span, the Crimson Tide are 99–1 when allowing 22 points or fewer but have a losing record when surrendering 23 or more. Second, to score on Alabama, a team has to be able to throw the ball. That’s because planning to run on the Tide is an easy path to a game full of three-and-outs; they haven’t allowed an opponent to average more than 3.06 yards per carry in a game this year, and no individual rusher has gained 100 yards on the ground against Bama since last October. Meanwhile, the opponents that have done some damage to the scoreboard this year (Ole Miss and Arkansas) have relied on passing volume to threaten the defense. So, Wisconsin. The Badgers rank outside the top 100 nationally in passing yardage, and, until they beat up on Illinois and Purdue earlier this month, they had more interceptions than passing touchdowns. The 9-for-25, 88-yard effort against Michigan may have been an anomaly, but it’s not like Saban’s defense is any more forgiving than Jim Harbaugh’s. Were the Badgers to win the Big Ten title and face Alabama in the playoff’s first round, they would likely, and regrettably, resemble the Michigan State team that Saban’s squad crushed 38–0 in last season’s semifinals. 6. Colorado Two weeks ago, I examined Colorado’s greatest strength: its pass defense, which has stifled opposing quarterbacks all season and recently held Washington State’s Luke Falk below a 50 percent completion rate for the first time in the Air Raid QB’s prolific career. To update a chart I made then: Unfortunately for the Buffaloes, Alabama doesn’t need to excel through the air in order to win games. Four times this year, Alabama defeated a ranked opponent without reaching even 200 passing yards; in none of those games did quarterback Jalen Hurts throw more touchdowns than interceptions. It didn’t matter, though, because Bama also has a dominant defense and reliable running game to support its inconsistent aerial attack. One of College Football’s Sleeping Giants Has AwokenHow a defensive revival triggered Colorado’s resurgencetheringer.com Given Colorado’s middling offense (36th nationally in points per game, tied for 68th in yards per play) and rush defense (33rd in yards per game, tied for 38th in yards per carry allowed) the Buffaloes wouldn’t be able to compete in all phases of the game. The team is a great story, maybe the best in college football this year, and deserves all sorts of credit for reaching the Pac-12 title game. Hoping for even a playoff berth, let alone a close game against Alabama, might be too much for the final chapter. 5. Penn State The Nittany Lions defeated Ohio State, haven’t lost since September, and have won their past five games by an average margin of 30.2 points. They can score (39 points or more in every game since beating the Buckeyes) and defend (11th nationally in defensive S&P+ this year). They had more rushing yards earlier this month against Iowa than the Hawkeyes had allowed in any game since 2000. And yet, Penn State has just about no chance to beat Alabama. Even granting them credit for the upset of Ohio State, which required the fluke of blocking both a kick and a punt in the fourth quarter, the Nittany Lions needed overtime to beat Minnesota and trailed Indiana with four minutes left, in a game in which they were lucky to recover all five of Indiana’s fumbles. At times, they’ve been just good enough to survive, and that’s not enough against Alabama. A key weakness also bodes terribly for Penn State, even if the team beats Wisconsin on Saturday and sneaks into the playoff: Its young offensive line is one of the worst in the FBS (103rd in tackles for loss allowed), while Alabama’s defensive counterpart does things like this: 4. Oklahoma The three teams to come in this ranking are all favorites to make the playoff; Oklahoma, like the three already listed, needs some help. To reach the national semifinals, Oklahoma needs to impress against Oklahoma State in the de facto Big 12 title game this weekend while also enjoying losses from several of the teams ranked above it (both here and in the actual committee rankings). If those events somehow transpire, the Sooners would give Alabama a unique challenge due to their all-offense style, which is unlike the ethos of any other team in the discussion. Oklahoma Won the College Football WeekendThe playoff suddenly doesn’t look too far awaytheringer.com Oklahoma’s defense has been porous all year — in a record-setting fashion at times — and the Sooners lost both of their nonconference games against ranked teams (Houston and Ohio State) by double digits. So it’s not that Bob Stoops’s chance of upsetting Saban would be good, per se. But the chance would be there, thanks to Oklahoma’s offense, which ranks first in the country by S&P+ and a narrow second in points per game. The best quarterback Alabama faced this year was Ole Miss’s Chad Kelly, who torched the Tide for 43 points for the second consecutive season, and Oklahoma’s Baker Mayfield is a better, more polished version of Kelly. If Mayfield ended the season with his current mark, he would own the sport’s highest passer rating in at least 60 years (194.7, using the college formula). Toledo’s Logan Woodside has the second-highest mark in the FBS this year, and Mayfield hasn’t delivered a single-game rating below Woodside’s season rating in two months. In other words, Mayfield’s played like the best quarterback in the country every weekend since the start of Big 12 play — which aligns with the full recovery of star receiver Dede Westbrook from injury. Since the start of October, Westbrook has recorded averages of 6.6 catches, 150 yards, and 1.9 touchdowns per game, giving him one of the best receiving stretches in recent memory. Combine the Mayfield-Westbrook connection with the rushing tandem of Samaje Perine and Joe Mixon (against whom part of a civil lawsuit filed after he punched a female student is still working its way through Oklahoma courts), and the Sooners’ skill-position assemblage is the most talented in the country. That might just be enough for a fair fight against a similarly skilled Alabama D. 3. Clemson Clemson hung 40 points and 550 yards on Alabama in the national title game just 11 months ago, so by virtue of the “been there, done that” principle, the Tigers can’t drop any further down this list. While Clemson has looked plenty beatable this season, it’s survived both Louisville and Florida State in thrillers, and its statistical profile is actually quite similar to last year’s. Remember, in last year’s championship, the Tide returned a kickoff for a touchdown and captured a surprise onside kick and still beat Clemson by only five. Quarterback Jake Coker was flawless in his final college game; against an aggressive Clemson rush this year, freshman Jalen Hurts, who threw eight interceptions in as many conference games, might not be. Heisman winner Derrick Henry (158 yards, three TDs against Clemson) is gone, too. In Clemson’s best possible game, its ceiling is the highest of any team on this list. A disruptive defense — tied for third in the country in sacks and third in havoc rate, which combines tackles for loss, passes defended, and fumbles forced — could give Alabama a taste of its own cough-the-ball-up medicine, and if quarterback Deshaun Watson limited turnovers, the Tigers would stay close for 60 minutes. The problem is that, even with better play of late, they haven’t displayed the consistency they would need to take down Bama. Syracuse is Clemson’s only FBS opponent not to force at least one turnover; the 54–0 win over Syracuse is also the Tigers’ only time winning the turnover battle in the last half of the season. Giving away possessions cost Clemson last season’s national championship, and there’s no evidence that a rematch would play out any differently. 2. Ohio State 1. Washington I’m putting these two together for a reason, so hold off on your Twitter attacks, Buckeyes fans. (You just beat your rival in an all-timer! You should be happy!) Remember that 23-point mark that teams must reach to cause Alabama problems? Ohio State put up 23, 21, and 17 points in regulation against the three best defenses (Wisconsin, Penn State, and Michigan, respectively) it faced this season. Also remember that running the ball isn’t the way to challenge Alabama — even for the Buckeyes, who have the country’s best run-blocking offensive line but haven’t moved the ball well against top defenses, managing only between 4.1 and 4.2 yards per carry in those three games. Ohio State Marks Its SpotThe Buckeyes’ win over Michigan had it all: great defense, playoff implications, and an officiating controversytheringer.com OSU quarterback J.T. Barrett would be the most important player against Bama. Overall, Barrett’s numbers this season look solid, even downballot-Heisman-worthy: 33 total touchdowns to just five interceptions, while leading the no. 2 team in the country in the nation’s toughest conference. With his mobility, moreover, Barrett fits the profile of the dual-option QB that has given Alabama fits in recent years. Except Johnny Manziel completed 77 percent of his passes and averaged better than 8 yards per attempt when he upset Alabama as a freshman, and Cam Newton complemented his rushing prowess with three passing touchdowns and 10.8 yards per attempt in his Iron Bowl comeback in 2010. Barrett’s performance this year lends little evidence that he’d be able to do the same. The below chart shows Barrett’s stats from his six best games this year (ordered by the NFL formula for passer rating) and the stats from his six worst. The first grouping includes games against the likes of Rutgers and Bowling Green, the second against the likes of Michigan and Wisconsin. Obviously Barrett’s numbers from his worst six games would be worse than those from his best six games. But compare Barrett’s worst performances to the worst from Washington’s Jake Browning (after splitting his game log the same way). When Barrett was relatively bad, he was really bad; when Browning was relatively bad, he was still a capable, productive QB. Barrett’s opposition was tougher, but even when adjusted by factors such as opponent quality, Washington boasts the second-best passing attack in the FBS this year (Ohio State is down at 53rd). More components of a potential playoff matchup work in Washington’s favor as well. The Huskies’ offense is a top-five unit by both efficiency and explosiveness (in the playoff era, only this season’s Louisville team can say the same), and with receivers John Ross (14.9 yards per reception, 16 touchdowns) and Dante Pettis (16.1 and 14, respectively), Browning has the weapons to challenge Bama downfield. Washington’s defense is nearly as stout as Ohio State’s — it’s actually better against the rush, which is the Tide’s offensive anchor — and is the best in the country at creating turnovers. The Huskies also have four kick-return touchdowns this season (Ohio State has none), including a game winner, suggesting they could pull a 2015 Alabama and win a playoff game with special teams points. Ohio State is probably a better team than Washington, but the Huskies match up better against Alabama. Depending on playoff seeding, both could play the Tide in January and put this theory to the test. ", "child": "1664_1\t1664_2\t1664_3\t1664_4\t1664_5"}