{"name": "1666", "parent": "", "title": "Ohio State Marks Its Spot", "sentences": [{"7d83": "Ohio State Marks Its Spot"}, {"5672": "The Buckeyes’ win over Michigan had it all: great defense, playoff implications, and an officiating controversy that will go down in the annals of The Game"}, {"841c": "Ohio State and Michigan fans tell us that their annual matchup is not a game, but The Game. If capitalization is any indication of importance, then we have to call Saturday’s matchup THE GAME. It was the most important contest of the 2016 season, billed as a College Football Playoff play-in game between two of the nation’s best teams. It was also the most exciting game of the year, a 30–27 double-overtime thriller that ended with the no. 2 Buckeyes ruining the third-ranked Wolverines’ championship hopes."}, {"7ac1": "Neither team played flawlessly. Ohio State’s offense looked broken by a hounding Wolverines’ defense that recorded eight sacks, and typically perfect OSU kicker Tyler Durbin missed two field goal tries after converting each of his first 15 non-blocked attempts of the fall. But Michigan let the Buckeyes hang around. Quarterback Wilton Speight, who reportedly broke his collarbone a few weeks ago, threw two interceptions that led to Ohio State touchdowns, and that gave the Buckeyes enough points to be within striking distance when their offense finally showed up."}, {"357e": "Lessons From the Texas Coaching SagaThree thoughts on the end of the Charlie Strong era and the beginning of Tom Herman’s tenuretheringer.com"}, {"8a4a": "The teams were equally imperfect. They were destined to play each other completely evenly through 60 minutes. This was everything we hoped for, a meaningful matchup played in front of a raucous crowd by two incredibly talented teams that hate each other. It was riveting to the end, featured spectacular defense, and even included multiple touchdowns by a fullback. So let’s stop talking about that, and instead focus on controversial referee decisions. Wolverines coach Jim Harbaugh started venting about perceived one-sided officiating during the game and kept going for long afterward. Look at him go!"}, {"a1ab": "We’ve all seen Harbaugh blow a gasket on the sideline, as he’s one of America’s most famously incredulous head coaches. But this instance was special: He tossed his play sheet, smashed his headset, and drew a flag for unsportsmanlike conduct. The resulting 15-yard penalty was more than Ohio State was docked all game."}, {"a96e": "Yes, Ohio State was the more disciplined team, but a freakish combination of luck and human failure also allowed every meaningful referee decision to go in the Buckeyes’ favor. I don’t believe in referee conspiracy theories, but you could make a really compelling YouTube video after Saturday if you do."}, {"0c25": "The most important decision came in double overtime. Ohio State, trailing 27–24, faced a fourth-and-1 from Michigan’s 16-yard line. If the Buckeyes picked it up, they’d get a fresh set of downs. If they didn’t, they would lose."}, {"342e": "Though Ohio State lacked a reliable offensive option all game, J.T. Barrett running a quarterback keeper was the closest thing it had to one, so that’s what it called. He ran toward the first-down marker, smashed into the butt of tight end A.J. Alexander, and fell just short of the line to gain. But Barrett didn’t need to cross the line: He just needed to get the ball across it at some point during his carry. The referees ruled that he did, and Curtis Samuel delivered Ohio State the game-winning touchdown shortly thereafter."}, {"a7bb": "Did Barrett get it? Watch as many times as it takes to make up your mind."}, {"04bd": "Since college football overtime drives begin at the opposing 25-yard line, the line to gain was exactly the 15. Now, ignore the yellow line and focus on that big white one. If, at any point during the play, even part of the ball breaks the plane of that line, Barrett deserves the first down via forward progress. Remember, the camera isn’t stationed on the 15-yard line, so because of its angle, Barrett looks like he goes a little bit further than he actually does. And Barrett’s body obscures our view of the ball, so we’ve got to do guesswork."}, {"560c": "The butt that stopped Barrett’s progress was clearly short of the line to gain. But we don’t need to know about the location of the butt. We need to know about the location of the ball, and that’s hidden by Barrett’s body."}, {"25f8": "(Getty Images)"}, {"2107": "If you’re an Ohio State fan, you know he got that first down. And if you’re a Michigan fan, you know that he didn’t. Don’t try to argue with them: They will never be swayed. Even if I wanted to convince them otherwise, I’m not sure the necessary evidence exists. There is a right answer here: Either the ball reached the line or it didn’t. But with a badly angled camera shot that doesn’t even definitively show where the ball is, we don’t have the material to say which is true. We’ll call it Schrödinger’s Spot."}, {"0307": "In soccer and tennis, there is technology that can tell officials a ball’s exact location to the millimeter in order to ensure the correct call is always made. In football, we have grainy video and sleuthing internet comment sections. We’ll never get the answer."}, {"2075": "Next weekend, the College Football Playoff selection committee will get together and decide which four teams have the opportunity to play for the national championship. After Saturday, the committee members won’t likely consider Michigan. If officials hadn’t given Ohio State the spot, they wouldn’t have considered the Buckeyes. Hypothetically, the committee’s task is to decide which teams are best, but that’s impossible, too. How can they say for sure that 11–1 Ohio State is better than 11–1 Washington? How can they know that two-loss Oklahoma is superior to Colorado?"}, {"2cbc": "Even when teams have played each other, it’s hard to determine which one is better. The committee may have to choose between Ohio State and Penn State, which had a worse record than the Buckeyes but beat them in State College and will play for the Big Ten title. Either choice would make sense, and both would leave one fan base (rightfully) upset."}, {"6245": "After four quarters and more, I still don’t know whether Ohio State is better than Michigan. Both teams could have won this game. I’d love to see them play three dozen times, 11 more in Columbus, 12 in Ann Arbor, and then 12 at a neutral site, with different officials, different levels of health, different weather conditions. No, truly, I’d love this. Saturday’s game was beautiful, a four-hour scramble of emotions and surprises. I would love to live it again."}, {"5cad": "But that can’t happen. If we can’t come to a consensus about something as cut-and-dried as whether the ball crossed the 15-yard line, how could we hope to say which one of these great teams is better than the other? Only one thing matters: On this day, in this stadium, Ohio State scored more points than Michigan did. That is the only fact we have, and it will haunt the Wolverines for 364 days, until the next time they get to do this again."}], "content": "Ohio State Marks Its Spot The Buckeyes’ win over Michigan had it all: great defense, playoff implications, and an officiating controversy that will go down in the annals of The Game Ohio State and Michigan fans tell us that their annual matchup is not a game, but The Game. If capitalization is any indication of importance, then we have to call Saturday’s matchup THE GAME. It was the most important contest of the 2016 season, billed as a College Football Playoff play-in game between two of the nation’s best teams. It was also the most exciting game of the year, a 30–27 double-overtime thriller that ended with the no. 2 Buckeyes ruining the third-ranked Wolverines’ championship hopes. Neither team played flawlessly. Ohio State’s offense looked broken by a hounding Wolverines’ defense that recorded eight sacks, and typically perfect OSU kicker Tyler Durbin missed two field goal tries after converting each of his first 15 non-blocked attempts of the fall. But Michigan let the Buckeyes hang around. Quarterback Wilton Speight, who reportedly broke his collarbone a few weeks ago, threw two interceptions that led to Ohio State touchdowns, and that gave the Buckeyes enough points to be within striking distance when their offense finally showed up. Lessons From the Texas Coaching SagaThree thoughts on the end of the Charlie Strong era and the beginning of Tom Herman’s tenuretheringer.com The teams were equally imperfect. They were destined to play each other completely evenly through 60 minutes. This was everything we hoped for, a meaningful matchup played in front of a raucous crowd by two incredibly talented teams that hate each other. It was riveting to the end, featured spectacular defense, and even included multiple touchdowns by a fullback. So let’s stop talking about that, and instead focus on controversial referee decisions. Wolverines coach Jim Harbaugh started venting about perceived one-sided officiating during the game and kept going for long afterward. Look at him go! We’ve all seen Harbaugh blow a gasket on the sideline, as he’s one of America’s most famously incredulous head coaches. But this instance was special: He tossed his play sheet, smashed his headset, and drew a flag for unsportsmanlike conduct. The resulting 15-yard penalty was more than Ohio State was docked all game. Yes, Ohio State was the more disciplined team, but a freakish combination of luck and human failure also allowed every meaningful referee decision to go in the Buckeyes’ favor. I don’t believe in referee conspiracy theories, but you could make a really compelling YouTube video after Saturday if you do. The most important decision came in double overtime. Ohio State, trailing 27–24, faced a fourth-and-1 from Michigan’s 16-yard line. If the Buckeyes picked it up, they’d get a fresh set of downs. If they didn’t, they would lose. Though Ohio State lacked a reliable offensive option all game, J.T. Barrett running a quarterback keeper was the closest thing it had to one, so that’s what it called. He ran toward the first-down marker, smashed into the butt of tight end A.J. Alexander, and fell just short of the line to gain. But Barrett didn’t need to cross the line: He just needed to get the ball across it at some point during his carry. The referees ruled that he did, and Curtis Samuel delivered Ohio State the game-winning touchdown shortly thereafter. Did Barrett get it? Watch as many times as it takes to make up your mind. Since college football overtime drives begin at the opposing 25-yard line, the line to gain was exactly the 15. Now, ignore the yellow line and focus on that big white one. If, at any point during the play, even part of the ball breaks the plane of that line, Barrett deserves the first down via forward progress. Remember, the camera isn’t stationed on the 15-yard line, so because of its angle, Barrett looks like he goes a little bit further than he actually does. And Barrett’s body obscures our view of the ball, so we’ve got to do guesswork. The butt that stopped Barrett’s progress was clearly short of the line to gain. But we don’t need to know about the location of the butt. We need to know about the location of the ball, and that’s hidden by Barrett’s body. (Getty Images) If you’re an Ohio State fan, you know he got that first down. And if you’re a Michigan fan, you know that he didn’t. Don’t try to argue with them: They will never be swayed. Even if I wanted to convince them otherwise, I’m not sure the necessary evidence exists. There is a right answer here: Either the ball reached the line or it didn’t. But with a badly angled camera shot that doesn’t even definitively show where the ball is, we don’t have the material to say which is true. We’ll call it Schrödinger’s Spot. In soccer and tennis, there is technology that can tell officials a ball’s exact location to the millimeter in order to ensure the correct call is always made. In football, we have grainy video and sleuthing internet comment sections. We’ll never get the answer. Next weekend, the College Football Playoff selection committee will get together and decide which four teams have the opportunity to play for the national championship. After Saturday, the committee members won’t likely consider Michigan. If officials hadn’t given Ohio State the spot, they wouldn’t have considered the Buckeyes. Hypothetically, the committee’s task is to decide which teams are best, but that’s impossible, too. How can they say for sure that 11–1 Ohio State is better than 11–1 Washington? How can they know that two-loss Oklahoma is superior to Colorado? Even when teams have played each other, it’s hard to determine which one is better. The committee may have to choose between Ohio State and Penn State, which had a worse record than the Buckeyes but beat them in State College and will play for the Big Ten title. Either choice would make sense, and both would leave one fan base (rightfully) upset. After four quarters and more, I still don’t know whether Ohio State is better than Michigan. Both teams could have won this game. I’d love to see them play three dozen times, 11 more in Columbus, 12 in Ann Arbor, and then 12 at a neutral site, with different officials, different levels of health, different weather conditions. No, truly, I’d love this. Saturday’s game was beautiful, a four-hour scramble of emotions and surprises. I would love to live it again. But that can’t happen. If we can’t come to a consensus about something as cut-and-dried as whether the ball crossed the 15-yard line, how could we hope to say which one of these great teams is better than the other? Only one thing matters: On this day, in this stadium, Ohio State scored more points than Michigan did. That is the only fact we have, and it will haunt the Wolverines for 364 days, until the next time they get to do this again. ", "child": "1666_1\t1666_2\t1666_3\t1666_4\t1666_5\t1666_6\t1666_7\t1666_8\t1666_9"}