{"name": "1669", "parent": "", "title": "Urban Meyer Wants to Take the Inexperienced Buckeyes to the Edge", "sentences": [{"b039": "Urban Meyer Wants to Take the Inexperienced Buckeyes to the Edge"}, {"1cd5": "But what happens once the young team gets there?"}, {"c5f9": "“It’s not that kind of an edge.”"}, {"eb46": "Tim Kight, founder and president of the leadership consulting firm Focus 3, is talking about the sessions he’s been leading at Ohio State over the past four years. He’s been explaining his “E+R=O” formula — event plus response equals outcome — and how it can be applied to any walk of life."}, {"0bc1": "Kight, a former athlete himself, met Buckeyes coach Urban Meyer at a fundraiser at the coach’s house in 2013. The two fell to talking and Meyer was enthralled by Kight’s philosophy."}, {"e67c": "Though “E+R=O” fits neatly on a wristband, it may not exactly resonate with 18- to 22-year-olds, so Meyer has taken to coining two-word catchphrases to encapsulate the idea. This year, he’s calling it “The Edge,” the latest in a line of mantras almost as long as his résumé entry for the school. In 2014, it was “The Chase.” In 2015, “The Grind.”"}, {"c570": "And while talk of edges can lead to mental images of cliffs — places where you can enjoy the view … but need to watch your footing — in Columbus it means something else."}, {"60ce": "“It’s not the edge and then a precipice,” Kight tells The Ringer. “It’s a barrier.”"}, {"e883": "He explains “The Edge” like this: Picture a chalkboard. On the left side, there’s a circle. On the right side, there’s another circle. Connecting the two is a horizontal line. The circle on the left represents the present. The circle on the right, the future."}, {"b5d2": "The line is the journey you must take from the left circle to the right, from your current skill set to a potential future, improved one. And on that journey, there will be obstacles you must overcome. That’s “The Edge.”"}, {"a93f": "“It’s a barrier. A challenge,” Kight says. “When you get to that spot, you have to make a decision. What am I gonna do?”"}, {"06bf": "A version of that question has been posed to Ohio State for months now. The Buckeyes return fewer starters (six, fewest in the nation) than they lost early to the NFL draft (nine). In fact, you could start a pretty good team with just the 12 OSU players who were drafted (including Joey Bosa, Ezekiel Elliott, Eli Apple, Taylor Decker, and Darron Lee)."}, {"5220": "Meyer’s rebuilding Buckeyes are down 16 starters from the 12–1, no. 4–ranked campaign of 2015. Is this the year they teeter and fall out of championship contention?"}, {"52e9": "Building a championship-caliber college program is a bit like walking a tightrope: Balance is everything."}, {"3f5f": "If you lean too much in one direction — overvaluing the present at the expense of the future — you’re liable to fall. You have to put one foot in front of the other and keep your eyes on the horizon even while every fiber in your body is screaming at you to look down."}, {"292c": "Meyer’s been talking a lot lately about his team being out of balance. “The issue would be if it was a non-talented young team,” he said at Big Ten media days in Chicago in July. “And that’s not the case at all. So it’s a very young team, but talented.”"}, {"a5a8": "The Buckeyes lost more than 70 percent of their offensive yards from last season. They boast only one QB with game experience. And they count a whopping 44 players on the roster who have never played in a college game before."}, {"aa5f": "Faced with that much turnover ahead of a new season, many coaches would be practicing media spin moves to rival those of their new ball carriers, lowering expectations in preparation for a year of rebuilding. The Ohio State doesn’t really afford Meyer that option, though, and he’ll have to make do with the starters he has."}, {"58c2": "It helps OSU’s 2016 chances that three of the six returning starters are stud QB J.T. Barrett (career 45–14 TD-INT ratio and 67 total touchdowns in 23 career games), linebacker Raekwon McMillan (first on the team and fourth in the Big 10 in tackles as a sophomore), and center Pat Elflein (29 career starts and a First-Team All–Big Ten selection the last two years). That gives the team a veteran player at three key positions."}, {"5631": "Meyer and Co. also had another banner year on the recruiting trail, reeling in 17 four-star recruits and one five-star recruit — both leading or tied for the lead in the Big Ten this year. According to 247sports, the Buckeyes landed the no. 4 class in the country. That’s after finishing no. 7 in 2015, no. 3 in 2014, and no. 2 in 2013."}, {"10c4": "The latest haul is highlighted by consensus top-10 recruit Nick Bosa (Joey’s younger brother), linebacker Keandre Jones, receiver Austin Mack, and offensive lineman Michael Jordan. All four are among those expected to contribute as freshmen."}, {"697a": "College Football’s Future Phenoms Have ArrivedTop-ranked recruit Rashan Gary isn’t the only freshman primed to break outtheringer.com"}, {"6f29": "Meyer has said his goal is to play every freshman on the roster, but that is much easier said than done. There’s a lot to cram in the short window before kickoff on the first Saturday in September."}, {"c79c": "“How do you stay healthy yet put them in gamelike situations as much as possible during training camp,” Meyer asked rhetorically at Big Ten media days. “That’s what is keeping me awake a little bit right now. … [How] do you let them experience third-down-and-6 at full speed, full reps and still have a healthy team by the time you get to September 3?”"}, {"d691": "And while Meyer and his staff can devise all sorts of ways to simulate game situations, as the cliché goes there’s really no substitute for the real thing. The only way to know how a young player will react on the big stage is to throw him a costume, shove him into the spotlight, and hope he doesn’t forget his lines."}, {"0beb": "“If we see some guys step up like we did in ’14 [when OSU won the national title] — and last year — then we have a chance to be special,” Meyer said after the first day of fall practice."}, {"f985": "The question left unasked there, of course, is this: What happens if this time no one steps up?"}, {"123a": "Some schools would temper expectations after a talent drain the likes of OSU’s this offseason. The Buckeyes aren’t willing (or able) to go there."}, {"727d": "Barrett, now the unquestioned starter at quarterback after an injury-shortened 2014 and timeshare-marred 2015, dismissed talk of reduced expectations out of hand at Big Ten media days."}, {"08d6": "“There’s a certain standard at Ohio State,” the junior signal-caller told reporters, “and it shouldn’t change for anybody. I don’t care how many people you lost."}, {"f01d": "“You want us to tell the fans, ‘Hey, we lost some guys, so yeah, I don’t know about that Big Ten championship — sorry?’ Buckeye Nation would look at you crazy: ‘What are you talking about? Come on.’”"}, {"5dfb": "The Buckeyes are ranked no. 6 in the preseason AP poll, higher than any other team in the conference, showing that not only are observers unwilling to count Meyer and Co. out, but many still expect them to be title contenders."}, {"dc4b": "“We have a lot of momentum here at Ohio State right now,” Meyer said during camp. “We can’t lose it just because we lost some great players.”"}, {"77a3": "So the Buckeyes will lean heavily on their few veteran players and hope redshirt freshman Mike Weber (the top-ranked recruit out of Michigan in 2015) can follow in Ezekiel Elliott’s footsteps at running back, Nick Bosa can one-up big brother Joey, and Jordan can not only become the second true freshman to start on the O-line under Meyer but also thrive in the role."}, {"c77d": "They’ll find out quickly what they have in Columbus, because after opening with Bowling Green and Tulsa at home, the Buckeyes travel to Oklahoma for a Week 3 matchup with Baker Mayfield’s third-ranked Sooners."}, {"f6cb": "Call that the first real opportunity to encounter “The Edge.”"}, {"cdd0": "“One of the things in this sport, talent is a commodity,” Kight, the leadership consultant, said. “Once you have recruited kids and they come on campus, the differentiating factor isn’t talent — because everyone’s got talent.”"}, {"8200": "The OSU brass believes that what will separate the Buckeyes from the pack is belief in the process they’ve adopted."}, {"ff6e": "“We’ve had a bunch of great players roll through [Columbus], and they had one thing in common: It wasn’t height, weight, vertical jump or 40-yard dash time, it was when it got really hard they got really good,” Meyer said. “There are other guys we had that just didn’t materialize and it wasn’t because of vertical jump and speed and whatever. It was because when it got hard they didn’t like it.”"}, {"ce65": "Last season, just one loss (by three points against Michigan State) was enough to keep Ohio State out of the College Football Playoff. And that was before the talent exodus of 2016. Despite the roster turnover, the goals in Columbus haven’t changed. But no one can say with any certainty that the Buckeyes will be in title contention come Thanksgiving, because no one knows for sure what OSU’s untested players will do when they reach the edge."}, {"119f": "An earlier version of this post misidentified the location of the Buckeyes’ 2015 loss. The game occurred at Ohio State, not Michigan State."}], "content": "Urban Meyer Wants to Take the Inexperienced Buckeyes to the Edge But what happens once the young team gets there? “It’s not that kind of an edge.” Tim Kight, founder and president of the leadership consulting firm Focus 3, is talking about the sessions he’s been leading at Ohio State over the past four years. He’s been explaining his “E+R=O” formula — event plus response equals outcome — and how it can be applied to any walk of life. Kight, a former athlete himself, met Buckeyes coach Urban Meyer at a fundraiser at the coach’s house in 2013. The two fell to talking and Meyer was enthralled by Kight’s philosophy. Though “E+R=O” fits neatly on a wristband, it may not exactly resonate with 18- to 22-year-olds, so Meyer has taken to coining two-word catchphrases to encapsulate the idea. This year, he’s calling it “The Edge,” the latest in a line of mantras almost as long as his résumé entry for the school. In 2014, it was “The Chase.” In 2015, “The Grind.” And while talk of edges can lead to mental images of cliffs — places where you can enjoy the view … but need to watch your footing — in Columbus it means something else. “It’s not the edge and then a precipice,” Kight tells The Ringer. “It’s a barrier.” He explains “The Edge” like this: Picture a chalkboard. On the left side, there’s a circle. On the right side, there’s another circle. Connecting the two is a horizontal line. The circle on the left represents the present. The circle on the right, the future. The line is the journey you must take from the left circle to the right, from your current skill set to a potential future, improved one. And on that journey, there will be obstacles you must overcome. That’s “The Edge.” “It’s a barrier. A challenge,” Kight says. “When you get to that spot, you have to make a decision. What am I gonna do?” A version of that question has been posed to Ohio State for months now. The Buckeyes return fewer starters (six, fewest in the nation) than they lost early to the NFL draft (nine). In fact, you could start a pretty good team with just the 12 OSU players who were drafted (including Joey Bosa, Ezekiel Elliott, Eli Apple, Taylor Decker, and Darron Lee). Meyer’s rebuilding Buckeyes are down 16 starters from the 12–1, no. 4–ranked campaign of 2015. Is this the year they teeter and fall out of championship contention? Building a championship-caliber college program is a bit like walking a tightrope: Balance is everything. If you lean too much in one direction — overvaluing the present at the expense of the future — you’re liable to fall. You have to put one foot in front of the other and keep your eyes on the horizon even while every fiber in your body is screaming at you to look down. Meyer’s been talking a lot lately about his team being out of balance. “The issue would be if it was a non-talented young team,” he said at Big Ten media days in Chicago in July. “And that’s not the case at all. So it’s a very young team, but talented.” The Buckeyes lost more than 70 percent of their offensive yards from last season. They boast only one QB with game experience. And they count a whopping 44 players on the roster who have never played in a college game before. Faced with that much turnover ahead of a new season, many coaches would be practicing media spin moves to rival those of their new ball carriers, lowering expectations in preparation for a year of rebuilding. The Ohio State doesn’t really afford Meyer that option, though, and he’ll have to make do with the starters he has. It helps OSU’s 2016 chances that three of the six returning starters are stud QB J.T. Barrett (career 45–14 TD-INT ratio and 67 total touchdowns in 23 career games), linebacker Raekwon McMillan (first on the team and fourth in the Big 10 in tackles as a sophomore), and center Pat Elflein (29 career starts and a First-Team All–Big Ten selection the last two years). That gives the team a veteran player at three key positions. Meyer and Co. also had another banner year on the recruiting trail, reeling in 17 four-star recruits and one five-star recruit — both leading or tied for the lead in the Big Ten this year. According to 247sports, the Buckeyes landed the no. 4 class in the country. That’s after finishing no. 7 in 2015, no. 3 in 2014, and no. 2 in 2013. The latest haul is highlighted by consensus top-10 recruit Nick Bosa (Joey’s younger brother), linebacker Keandre Jones, receiver Austin Mack, and offensive lineman Michael Jordan. All four are among those expected to contribute as freshmen. College Football’s Future Phenoms Have ArrivedTop-ranked recruit Rashan Gary isn’t the only freshman primed to break outtheringer.com Meyer has said his goal is to play every freshman on the roster, but that is much easier said than done. There’s a lot to cram in the short window before kickoff on the first Saturday in September. “How do you stay healthy yet put them in gamelike situations as much as possible during training camp,” Meyer asked rhetorically at Big Ten media days. “That’s what is keeping me awake a little bit right now. … [How] do you let them experience third-down-and-6 at full speed, full reps and still have a healthy team by the time you get to September 3?” And while Meyer and his staff can devise all sorts of ways to simulate game situations, as the cliché goes there’s really no substitute for the real thing. The only way to know how a young player will react on the big stage is to throw him a costume, shove him into the spotlight, and hope he doesn’t forget his lines. “If we see some guys step up like we did in ’14 [when OSU won the national title] — and last year — then we have a chance to be special,” Meyer said after the first day of fall practice. The question left unasked there, of course, is this: What happens if this time no one steps up? Some schools would temper expectations after a talent drain the likes of OSU’s this offseason. The Buckeyes aren’t willing (or able) to go there. Barrett, now the unquestioned starter at quarterback after an injury-shortened 2014 and timeshare-marred 2015, dismissed talk of reduced expectations out of hand at Big Ten media days. “There’s a certain standard at Ohio State,” the junior signal-caller told reporters, “and it shouldn’t change for anybody. I don’t care how many people you lost. “You want us to tell the fans, ‘Hey, we lost some guys, so yeah, I don’t know about that Big Ten championship — sorry?’ Buckeye Nation would look at you crazy: ‘What are you talking about? Come on.’” The Buckeyes are ranked no. 6 in the preseason AP poll, higher than any other team in the conference, showing that not only are observers unwilling to count Meyer and Co. out, but many still expect them to be title contenders. “We have a lot of momentum here at Ohio State right now,” Meyer said during camp. “We can’t lose it just because we lost some great players.” So the Buckeyes will lean heavily on their few veteran players and hope redshirt freshman Mike Weber (the top-ranked recruit out of Michigan in 2015) can follow in Ezekiel Elliott’s footsteps at running back, Nick Bosa can one-up big brother Joey, and Jordan can not only become the second true freshman to start on the O-line under Meyer but also thrive in the role. They’ll find out quickly what they have in Columbus, because after opening with Bowling Green and Tulsa at home, the Buckeyes travel to Oklahoma for a Week 3 matchup with Baker Mayfield’s third-ranked Sooners. Call that the first real opportunity to encounter “The Edge.” “One of the things in this sport, talent is a commodity,” Kight, the leadership consultant, said. “Once you have recruited kids and they come on campus, the differentiating factor isn’t talent — because everyone’s got talent.” The OSU brass believes that what will separate the Buckeyes from the pack is belief in the process they’ve adopted. “We’ve had a bunch of great players roll through [Columbus], and they had one thing in common: It wasn’t height, weight, vertical jump or 40-yard dash time, it was when it got really hard they got really good,” Meyer said. “There are other guys we had that just didn’t materialize and it wasn’t because of vertical jump and speed and whatever. It was because when it got hard they didn’t like it.” Last season, just one loss (by three points against Michigan State) was enough to keep Ohio State out of the College Football Playoff. And that was before the talent exodus of 2016. Despite the roster turnover, the goals in Columbus haven’t changed. But no one can say with any certainty that the Buckeyes will be in title contention come Thanksgiving, because no one knows for sure what OSU’s untested players will do when they reach the edge. An earlier version of this post misidentified the location of the Buckeyes’ 2015 loss. The game occurred at Ohio State, not Michigan State. ", "child": "1669_1\t1669_2"}