{"name": "1670", "parent": "", "title": "Urban Meyer Has Built Ohio State Into a Beautiful, Unstoppable Football Machine", "sentences": [{"4792": "Urban Meyer Has Built Ohio State Into a Beautiful, Unstoppable Football Machine"}, {"3c6e": "Rooting for the Buckeyes has become sports-fan nirvana"}, {"eab9": "Despite my best efforts, I already know that this is going to come across as insufferable, and I’m sorry for that. I really am. I know the last thing you need in your life is another obnoxious Ohio State fan, so I’m going to do my best to not get too carried away here."}, {"bfe4": "It’s just … I honestly think Urban Meyer might be God."}, {"49a9": "Let me be clear: I know no. 3 Ohio State beating no. 14 Oklahoma 45–24 on Saturday night doesn’t really mean much in the grand scheme. It’s still September, the toughest part of the Buckeyes’ schedule is yet to come, and the Sooners have had a reputation for falling short in big games for so long that even joking about it is played out at this point. But this isn’t about what transpired in Norman in Week 3. This is about the general feeling that comes with supporting the Ohio State football program in recent years. This is about all the pleasure brought on by being an alumnus of a school whose football team is coached by Urban Fucking Meyer. THERE’S JUST SO MUCH PLEASURE."}, {"62d8": "I assumed this would be a down year by Ohio State standards. The Buckeyes fell short of living up to their massive expectations last season, lost the best draft class in modern NFL history, and came into this fall with the single most inexperienced team in college football. Logic and reason told me to be ecstatic with a best-case scenario of 10 wins and a Citrus Bowl trip. Logic and reason also told me that this would finally be the year that Michigan would get over the hump versus Ohio State. But Urban Fucking Meyer told me to grab a wet cloth because this year’s team is going to leave me with quite the mess in the front of my pants."}, {"0446": "It truly is mind-blowing what Meyer has done since he got to Columbus, and I’m not even talking about the wins or the recruiting or the NFL players he’s produced. I just mean what he’s done to the culture of Ohio State. He replaced a national-title-winning coach (and interim coach Luke Fickell) at one of the most storied programs in the sport and had impossible expectations placed on him from the start. Yet somehow, he’s been so good that he’s taken a fan base that demands a championship every season to places we didn’t think were possible."}, {"b7b4": "J.T. Barrett (Getty Images)"}, {"26f2": "I mean, I don’t get even a little nervous for big games anymore. That’s not to say that I think Ohio State is going to win every game. It’s just that I trust Meyer more than I trust anyone else in my life. I go into every game knowing that one of two things will happen: We will win (which is obviously great) or we’ll lose and Meyer will find a way to get us back in the national title hunt by the end of the season anyway (still pretty good!). Until another team is hoisting the national championship trophy, I’ll always think Ohio State has a shot at it, because that’s what having Meyer as your coach means."}, {"ed5b": "Do you have any idea how amazing that is? I swear I’m not saying all of this to gloat. I genuinely wish every sports fan could get a chance to experience this. I wish everyone could know what it’s like to not have to worry about nail-biting, butthole-clenching, cursing at the TV, drinking heavily to numb the pain, and taking long postgame walks to calm down. I wish everyone could know what it’s like to be in a situation where all hope should be lost, yet you find yourself thinking, “We’ve got [player and/or coach], and they don’t. We’ll be fine.” It’s like the exact opposite of rooting for a team coached by Brady Hoke. It’s sports-fan nirvana."}, {"6c18": "Let me pump the brakes here and emphasize that I’m not delusional. Ohio State has just one national title under Meyer, and there’s still a long way to go this season. This isn’t a declaration that the rest of the country should just stop trying because Urb — BECAUSE URBAN GOT THEM BOYS PLAYING PERFECT FOOTBALL WOOOOOO GO BUCKS BEAT MICHIGAN WE WANT BAMA!!! I’m already emotionally preparing for Ohio State’s inevitable loss to Michigan State, and the Wisconsin and Michigan games aren’t exactly going to be walks in the park. And that’s to say nothing of potential Big Ten championship or College Football Playoff games."}, {"d43c": "It’s just that there are times that I wonder why I do this. Why do I devote so much of my life to watching 17- to 22-year-olds run around a field while trying to inflict pain on one another? Why do I park my ass on my couch for 12-plus hours every fall Saturday and get up only to shove beer or smoked meat into my mouth? Why do I spend so much time arguing with Twitter eggs? Why do I get so emotionally invested in this, to the point that I’m angry if my team doesn’t win literally every game by 4,000 points? When you detach yourself from everything and observe sports fandom from a rational remove, it makes no sense why somebody would willingly go through all of it. But now, at long last, I finally understand what I’ve been waiting for: There’s a pot of gold at the end of that rainbow, and that pot of gold’s name is Urban Fucking Meyer."}, {"d56e": "Urban Meyer (Getty Images)"}, {"59cb": "Besides, here’s the great thing about Meyer: Even if Ohio State doesn’t win a national title this year — hell, even if the Buckeyes don’t win the Big Ten East — it’s not going to do a damn thing to slow down the machine he’s built. Never mind what the Oklahoma win means for this season. What has me excited about Saturday night’s performance is that this whole “Ohio State doesn’t rebuild, it reloads” idea isn’t just a cliché for the talking heads to regurgitate. It’s the truth. If Meyer can take a team as inexperienced as Ohio State into the home stadium of a college football blue-blood and beat the hell out of the preseason no. 3 team led by a Heisman Trophy–candidate quarterback, then when exactly are the Buckeyes going to be in rebuilding mode?"}, {"692a": "In less than five years, Meyer has turned Ohio State’s program into a football assembly line where blue-chip recruits become freshmen who redshirt, study film, and play special teams; freshmen become sophomores who are backups and role players; sophomores become juniors who are stars; and junior stars either come back for one more go-round or become NFL draft picks. (And when the assembly line is at its most efficient, national championships are won on the backs of sophomores, like in 2014.) Sure, Meyer is going to lose a game here and there, sometimes even to Virginia Tech. But outside of some sort of scandal or Meyer feeling like he needs to hang up his whistle for good, how does anybody stop this? Any team can beat Ohio State on a given night, but only Nick Saban and Alabama have the infrastructure to regularly win against the Buckeyes. And even then, there are enough resources to go around for Bama to keep doing its thing without slowing Ohio State’s factory."}, {"e92c": "I guess my ultimate point is this: The past eight college football national championships have been won by teams that had at least one of these three people at their disposal: Saban, Meyer, or that season’s Heisman winner. (In what is probably not a coincidence, the top three teams in the current AP poll are Saban’s team, Meyer’s team, and Louisville, which has this season’s Heisman front-runner.) The upsets and unpredictability of college football as a whole make for a fun distraction, but recent history says that winning the ultimate prize requires being led by a transcendent genius, either on the field or on the sidelines. The Buckeyes are one of two programs in America that are guaranteed to have one every single year for the foreseeable future. As an Ohio State alum, I can’t even begin to describe how torqued this makes me."}], "content": "Urban Meyer Has Built Ohio State Into a Beautiful, Unstoppable Football Machine Rooting for the Buckeyes has become sports-fan nirvana Despite my best efforts, I already know that this is going to come across as insufferable, and I’m sorry for that. I really am. I know the last thing you need in your life is another obnoxious Ohio State fan, so I’m going to do my best to not get too carried away here. It’s just … I honestly think Urban Meyer might be God. Let me be clear: I know no. 3 Ohio State beating no. 14 Oklahoma 45–24 on Saturday night doesn’t really mean much in the grand scheme. It’s still September, the toughest part of the Buckeyes’ schedule is yet to come, and the Sooners have had a reputation for falling short in big games for so long that even joking about it is played out at this point. But this isn’t about what transpired in Norman in Week 3. This is about the general feeling that comes with supporting the Ohio State football program in recent years. This is about all the pleasure brought on by being an alumnus of a school whose football team is coached by Urban Fucking Meyer. THERE’S JUST SO MUCH PLEASURE. I assumed this would be a down year by Ohio State standards. The Buckeyes fell short of living up to their massive expectations last season, lost the best draft class in modern NFL history, and came into this fall with the single most inexperienced team in college football. Logic and reason told me to be ecstatic with a best-case scenario of 10 wins and a Citrus Bowl trip. Logic and reason also told me that this would finally be the year that Michigan would get over the hump versus Ohio State. But Urban Fucking Meyer told me to grab a wet cloth because this year’s team is going to leave me with quite the mess in the front of my pants. It truly is mind-blowing what Meyer has done since he got to Columbus, and I’m not even talking about the wins or the recruiting or the NFL players he’s produced. I just mean what he’s done to the culture of Ohio State. He replaced a national-title-winning coach (and interim coach Luke Fickell) at one of the most storied programs in the sport and had impossible expectations placed on him from the start. Yet somehow, he’s been so good that he’s taken a fan base that demands a championship every season to places we didn’t think were possible. J.T. Barrett (Getty Images) I mean, I don’t get even a little nervous for big games anymore. That’s not to say that I think Ohio State is going to win every game. It’s just that I trust Meyer more than I trust anyone else in my life. I go into every game knowing that one of two things will happen: We will win (which is obviously great) or we’ll lose and Meyer will find a way to get us back in the national title hunt by the end of the season anyway (still pretty good!). Until another team is hoisting the national championship trophy, I’ll always think Ohio State has a shot at it, because that’s what having Meyer as your coach means. Do you have any idea how amazing that is? I swear I’m not saying all of this to gloat. I genuinely wish every sports fan could get a chance to experience this. I wish everyone could know what it’s like to not have to worry about nail-biting, butthole-clenching, cursing at the TV, drinking heavily to numb the pain, and taking long postgame walks to calm down. I wish everyone could know what it’s like to be in a situation where all hope should be lost, yet you find yourself thinking, “We’ve got [player and/or coach], and they don’t. We’ll be fine.” It’s like the exact opposite of rooting for a team coached by Brady Hoke. It’s sports-fan nirvana. Let me pump the brakes here and emphasize that I’m not delusional. Ohio State has just one national title under Meyer, and there’s still a long way to go this season. This isn’t a declaration that the rest of the country should just stop trying because Urb — BECAUSE URBAN GOT THEM BOYS PLAYING PERFECT FOOTBALL WOOOOOO GO BUCKS BEAT MICHIGAN WE WANT BAMA!!! I’m already emotionally preparing for Ohio State’s inevitable loss to Michigan State, and the Wisconsin and Michigan games aren’t exactly going to be walks in the park. And that’s to say nothing of potential Big Ten championship or College Football Playoff games. It’s just that there are times that I wonder why I do this. Why do I devote so much of my life to watching 17- to 22-year-olds run around a field while trying to inflict pain on one another? Why do I park my ass on my couch for 12-plus hours every fall Saturday and get up only to shove beer or smoked meat into my mouth? Why do I spend so much time arguing with Twitter eggs? Why do I get so emotionally invested in this, to the point that I’m angry if my team doesn’t win literally every game by 4,000 points? When you detach yourself from everything and observe sports fandom from a rational remove, it makes no sense why somebody would willingly go through all of it. But now, at long last, I finally understand what I’ve been waiting for: There’s a pot of gold at the end of that rainbow, and that pot of gold’s name is Urban Fucking Meyer. Urban Meyer (Getty Images) Besides, here’s the great thing about Meyer: Even if Ohio State doesn’t win a national title this year — hell, even if the Buckeyes don’t win the Big Ten East — it’s not going to do a damn thing to slow down the machine he’s built. Never mind what the Oklahoma win means for this season. What has me excited about Saturday night’s performance is that this whole “Ohio State doesn’t rebuild, it reloads” idea isn’t just a cliché for the talking heads to regurgitate. It’s the truth. If Meyer can take a team as inexperienced as Ohio State into the home stadium of a college football blue-blood and beat the hell out of the preseason no. 3 team led by a Heisman Trophy–candidate quarterback, then when exactly are the Buckeyes going to be in rebuilding mode? In less than five years, Meyer has turned Ohio State’s program into a football assembly line where blue-chip recruits become freshmen who redshirt, study film, and play special teams; freshmen become sophomores who are backups and role players; sophomores become juniors who are stars; and junior stars either come back for one more go-round or become NFL draft picks. (And when the assembly line is at its most efficient, national championships are won on the backs of sophomores, like in 2014.) Sure, Meyer is going to lose a game here and there, sometimes even to Virginia Tech. But outside of some sort of scandal or Meyer feeling like he needs to hang up his whistle for good, how does anybody stop this? Any team can beat Ohio State on a given night, but only Nick Saban and Alabama have the infrastructure to regularly win against the Buckeyes. And even then, there are enough resources to go around for Bama to keep doing its thing without slowing Ohio State’s factory. I guess my ultimate point is this: The past eight college football national championships have been won by teams that had at least one of these three people at their disposal: Saban, Meyer, or that season’s Heisman winner. (In what is probably not a coincidence, the top three teams in the current AP poll are Saban’s team, Meyer’s team, and Louisville, which has this season’s Heisman front-runner.) The upsets and unpredictability of college football as a whole make for a fun distraction, but recent history says that winning the ultimate prize requires being led by a transcendent genius, either on the field or on the sidelines. The Buckeyes are one of two programs in America that are guaranteed to have one every single year for the foreseeable future. As an Ohio State alum, I can’t even begin to describe how torqued this makes me. ", "child": "1670_1\t1670_2\t1670_3\t1670_4\t1670_5\t1670_6\t1670_7\t1670_8\t1670_9\t1670_10"}