{"name": "1672", "parent": "", "title": "Purdue’s Caleb Swanigan Is a Revelation", "sentences": [{"6486": "Purdue’s Caleb Swanigan Is a Revelation"}, {"9e3d": "The sophomore big man is putting up monster numbers and punishing opponents. In the process, he’s changing everything you thought you knew about Boilermakers basketball."}, {"61df": "Purdue’s Caleb Swanigan is the best big man in college basketball by a significant margin, and even if you already knew that, he’s still probably better than you realize. I know that throwing out stat lines with arbitrary cutoff points is one of the dumber things anyone in sports media can do, but I can’t help myself here. There’s just something about him that leaves me desperate to find proof (no matter how insignificant) that a big man who can score, rebound, and pass like Swanigan does is a rarity in college basketball. So yeah, this might feel contrived, and I don’t blame you for rolling your eyes one bit. But it doesn’t change the fact that the 6-foot-9, 250-pound sophomore is averaging 18.3 points, 12.9 rebounds, and 2.7 assists per game, benchmarks no player in college basketball has hit over a full season since Tim Duncan in 1996–97. (Side note: Make sure you have a change of underwear handy before you look at Duncan’s college stats.)"}, {"1f73": "Caleb Swanigan (Getty Images)"}, {"0bd8": "No matter how you feel about contrived cutoff points to make guys fit into exclusive statistical groupings, there’s no denying that Swanigan has been otherworldly this season. He’s posted a double-double in 14 of Purdue’s 17 games (including four 20–20s) and leads the country in total rebounds per game, something no power-conference player has done since Oklahoma’s Blake Griffin in 2008–09. In Swanigan’s worst game of the season, when he fouled out in 22 minutes of action during a 97–64 win over Arizona State on December 6, he still finished with six points, 10 rebounds, and five assists. Swanigan has led the Boilermakers to a 14–3 record and a no. 17 ranking in the AP poll. We’re four games into the Big Ten schedule and he’s all but wrapped up the conference’s player of the year award, a fate that became even more evident after he tallied 18 points (on 7-of-10 shooting) and 13 rebounds in last Sunday’s 66–55 victory against Wisconsin’s frontcourt, which is among the best in the country."}, {"bb2b": "The stats are striking, but to truly appreciate Swanigan, you have to watch him play; words alone can’t do justice to how relentless he is on the court. Just look at this rebound from the Wisconsin game."}, {"6ca0": "I don’t know what’s crazier: That Swanigan jumps to contest a 3-point shot on the wing and still grabs the rebound among a group of players (one of whom is 7-foot-2) on the opposite side of the lane … or that he somehow makes this play look routine. But that’s Swanigan. He regularly does things that most casual observers don’t notice, even though every coach who watches him probably passes out from sheer giddiness."}, {"f5d8": "Here’s a similar play from the same half of the same game."}, {"0af4": "Swanigan is on the wing guarding Nigel Hayes when this shot is put up, yet he busts his ass so hard to grab the board on the opposite block that he knocks over his own teammate. Do you have any idea how rare this is? I mean, all that’s really expected of Swanigan in this scenario is to make sure Hayes doesn’t get the rebound. If Swanigan can get it, great, but no coach would ever expect him to get it or really even come close. But that’s not enough for Swanigan, who I’m pretty sure believes he should grab literally every board, as though he uses them for sustenance or something."}, {"16c5": "Think about the most frustrating player you’ve ever had to endure watching play for your favorite program. If you aren’t picturing an out-of-control and/or shoot-first point guard, there’s a decent chance you’re thinking of a big man whom you’d describe as “soft.” There’s just something about big men in college basketball that makes fans want to pull their hair out as they scream, “JUST DUNK THE FUCKING BALL! WHAT ARE YOU DOING??? ARRRGGGHHHHHH!!!” That’s what makes someone like Swanigan such a sight for sore eyes, especially for Purdue fans who had to deal with lethargic 7-footer A.J. Hammons for the past four seasons. Swanigan is more than just aggressive — he’s positively implacable with his work ethic."}, {"cc77": "This is another sequence from the first half of the Wisconsin game. Even though Swanigan touches the ball for only a little more than one second, keep your eyes on him for the entire possession."}, {"8390": "Just imagine trying to guard that for 40 minutes. Swanigan establishes post position and calls for the ball, flips his hips and keeps sealing his man as the ball reverses court, steps out to threaten a 3-point attempt (he shoots 43.8 percent from deep), and sets a couple of screens (and slips one) all in the span of about 20 seconds. He never stops moving, which puts an absurd amount of stress on Wisconsin’s defense. And best of all, although Purdue’s Dakota Mathias sinks his shot, Swanigan puts himself in perfect position to grab the offensive rebound in case he doesn’t. This is Swanigan every time down the floor of every game. He’s like a living, breathing instruction manual on how young big men should approach the sport."}, {"6775": "It gets better. There’s this sequence from — you guessed it — the first half of the Wisconsin game that perfectly encapsulates everything Swanigan is about. Again, keep your eyes locked on him for the entire clip."}, {"f94d": "(Note: If it weren’t already obvious, I’m purposely including clips from the same half of the same game to give you a sense of how overwhelming Swanigan is. If you’re anything like me, it’s somewhat jarring to realize everything you’ve seen happened in 20 minutes of game time.)"}, {"4134": "I gotta say, it’s total bullshit that Purdue gets a guy like this when no other team in America does. A brutally physical big man who never stops working in the paint and can also hit catch-and-shoot 3s in rhythm like a shooting guard? It’s just not fair. (Also not fair: this sequence from the second half of the Wisconsin game.) Swanigan really rubbed our faces in his skill set when he used this turn-and-face jab step that almost put Ethan Happ on his ass at the end of the first half against the Badgers."}, {"b50b": "Yeah, he missed the shot. But does it really matter? You know he has it in his arsenal to knock that down. And with Swanigan, I could be convinced that he missed on purpose just to prove a point, as if his ultimate pleasure comes from seeing opposing fan bases fall to their knees and say, “Oh thank god. He finally did something that doesn’t make me want to cry.”"}, {"694d": "When I wrote about Purdue a few weeks ago for the most powerful power rankings in college basketball, I touched on how the Boilermakers have undergone a total culture shift this season. Swanigan replacing Hammons as the face of the program is the single biggest reason. His subpar defense and occasional turnover outburst notwithstanding, Swanigan embodies all the virtues that Purdue fans value most. He plays his ass off every second he’s on the court; he takes pride in doing the dirty work; and he’s so business-like in dominating the opposition that it almost feels like he’s trying too hard to pull off the I-care-so-little-about-being-cool-that-it-actually-makes-me-cool shtick."}, {"68b0": "College Basketball Power Rankings: This Duke Season Has It AllThe situation surrounding Coach K, Grayson Allen, and the Blue Devils makes for a perfect college basketball…theringer.com"}, {"d32b": "Whatever the case, Swanigan’s impact on Purdue this season can’t be overstated. College basketball programs almost never reshape their identities so quickly unless there’s been a coaching change or massive roster turnover. And if a shift this seismic does occur, it’s almost always for the worse. That’s what makes Purdue transforming from a boring and methodical underachiever to an exciting and versatile Big Ten contender such a testament to Swanigan’s approach to the game. He sets the tone for his teammates to follow, and even if they can’t step up, he has no problem doing everything himself."}, {"4a8a": "It’s clear that there are doubts about Swanigan’s ability to succeed at the next level, even if I’m not much for projecting NBA potential. He isn’t the greatest athlete, his defense needs serious work, and he doesn’t fit the mold for any position in the league. But here’s the cool part about being a college basketball fan: I don’t have to give a shit about what Swanigan may or may not do in the NBA. I get to enjoy him for what he is now, which is the best player in the Big Ten, the best big man in college basketball, and — this is going to sound sacrilegious to Robbie Hummel disciples, but I’m going to say it anyway because it’s true — the best player to wear a Purdue uniform in more than 20 years."}], "content": "Purdue’s Caleb Swanigan Is a Revelation The sophomore big man is putting up monster numbers and punishing opponents. In the process, he’s changing everything you thought you knew about Boilermakers basketball. Purdue’s Caleb Swanigan is the best big man in college basketball by a significant margin, and even if you already knew that, he’s still probably better than you realize. I know that throwing out stat lines with arbitrary cutoff points is one of the dumber things anyone in sports media can do, but I can’t help myself here. There’s just something about him that leaves me desperate to find proof (no matter how insignificant) that a big man who can score, rebound, and pass like Swanigan does is a rarity in college basketball. So yeah, this might feel contrived, and I don’t blame you for rolling your eyes one bit. But it doesn’t change the fact that the 6-foot-9, 250-pound sophomore is averaging 18.3 points, 12.9 rebounds, and 2.7 assists per game, benchmarks no player in college basketball has hit over a full season since Tim Duncan in 1996–97. (Side note: Make sure you have a change of underwear handy before you look at Duncan’s college stats.) Caleb Swanigan (Getty Images) No matter how you feel about contrived cutoff points to make guys fit into exclusive statistical groupings, there’s no denying that Swanigan has been otherworldly this season. He’s posted a double-double in 14 of Purdue’s 17 games (including four 20–20s) and leads the country in total rebounds per game, something no power-conference player has done since Oklahoma’s Blake Griffin in 2008–09. In Swanigan’s worst game of the season, when he fouled out in 22 minutes of action during a 97–64 win over Arizona State on December 6, he still finished with six points, 10 rebounds, and five assists. Swanigan has led the Boilermakers to a 14–3 record and a no. 17 ranking in the AP poll. We’re four games into the Big Ten schedule and he’s all but wrapped up the conference’s player of the year award, a fate that became even more evident after he tallied 18 points (on 7-of-10 shooting) and 13 rebounds in last Sunday’s 66–55 victory against Wisconsin’s frontcourt, which is among the best in the country. The stats are striking, but to truly appreciate Swanigan, you have to watch him play; words alone can’t do justice to how relentless he is on the court. Just look at this rebound from the Wisconsin game. I don’t know what’s crazier: That Swanigan jumps to contest a 3-point shot on the wing and still grabs the rebound among a group of players (one of whom is 7-foot-2) on the opposite side of the lane … or that he somehow makes this play look routine. But that’s Swanigan. He regularly does things that most casual observers don’t notice, even though every coach who watches him probably passes out from sheer giddiness. Here’s a similar play from the same half of the same game. Swanigan is on the wing guarding Nigel Hayes when this shot is put up, yet he busts his ass so hard to grab the board on the opposite block that he knocks over his own teammate. Do you have any idea how rare this is? I mean, all that’s really expected of Swanigan in this scenario is to make sure Hayes doesn’t get the rebound. If Swanigan can get it, great, but no coach would ever expect him to get it or really even come close. But that’s not enough for Swanigan, who I’m pretty sure believes he should grab literally every board, as though he uses them for sustenance or something. Think about the most frustrating player you’ve ever had to endure watching play for your favorite program. If you aren’t picturing an out-of-control and/or shoot-first point guard, there’s a decent chance you’re thinking of a big man whom you’d describe as “soft.” There’s just something about big men in college basketball that makes fans want to pull their hair out as they scream, “JUST DUNK THE FUCKING BALL! WHAT ARE YOU DOING??? ARRRGGGHHHHHH!!!” That’s what makes someone like Swanigan such a sight for sore eyes, especially for Purdue fans who had to deal with lethargic 7-footer A.J. Hammons for the past four seasons. Swanigan is more than just aggressive — he’s positively implacable with his work ethic. This is another sequence from the first half of the Wisconsin game. Even though Swanigan touches the ball for only a little more than one second, keep your eyes on him for the entire possession. Just imagine trying to guard that for 40 minutes. Swanigan establishes post position and calls for the ball, flips his hips and keeps sealing his man as the ball reverses court, steps out to threaten a 3-point attempt (he shoots 43.8 percent from deep), and sets a couple of screens (and slips one) all in the span of about 20 seconds. He never stops moving, which puts an absurd amount of stress on Wisconsin’s defense. And best of all, although Purdue’s Dakota Mathias sinks his shot, Swanigan puts himself in perfect position to grab the offensive rebound in case he doesn’t. This is Swanigan every time down the floor of every game. He’s like a living, breathing instruction manual on how young big men should approach the sport. It gets better. There’s this sequence from — you guessed it — the first half of the Wisconsin game that perfectly encapsulates everything Swanigan is about. Again, keep your eyes locked on him for the entire clip. (Note: If it weren’t already obvious, I’m purposely including clips from the same half of the same game to give you a sense of how overwhelming Swanigan is. If you’re anything like me, it’s somewhat jarring to realize everything you’ve seen happened in 20 minutes of game time.) I gotta say, it’s total bullshit that Purdue gets a guy like this when no other team in America does. A brutally physical big man who never stops working in the paint and can also hit catch-and-shoot 3s in rhythm like a shooting guard? It’s just not fair. (Also not fair: this sequence from the second half of the Wisconsin game.) Swanigan really rubbed our faces in his skill set when he used this turn-and-face jab step that almost put Ethan Happ on his ass at the end of the first half against the Badgers. Yeah, he missed the shot. But does it really matter? You know he has it in his arsenal to knock that down. And with Swanigan, I could be convinced that he missed on purpose just to prove a point, as if his ultimate pleasure comes from seeing opposing fan bases fall to their knees and say, “Oh thank god. He finally did something that doesn’t make me want to cry.” When I wrote about Purdue a few weeks ago for the most powerful power rankings in college basketball, I touched on how the Boilermakers have undergone a total culture shift this season. Swanigan replacing Hammons as the face of the program is the single biggest reason. His subpar defense and occasional turnover outburst notwithstanding, Swanigan embodies all the virtues that Purdue fans value most. He plays his ass off every second he’s on the court; he takes pride in doing the dirty work; and he’s so business-like in dominating the opposition that it almost feels like he’s trying too hard to pull off the I-care-so-little-about-being-cool-that-it-actually-makes-me-cool shtick. College Basketball Power Rankings: This Duke Season Has It AllThe situation surrounding Coach K, Grayson Allen, and the Blue Devils makes for a perfect college basketball…theringer.com Whatever the case, Swanigan’s impact on Purdue this season can’t be overstated. College basketball programs almost never reshape their identities so quickly unless there’s been a coaching change or massive roster turnover. And if a shift this seismic does occur, it’s almost always for the worse. That’s what makes Purdue transforming from a boring and methodical underachiever to an exciting and versatile Big Ten contender such a testament to Swanigan’s approach to the game. He sets the tone for his teammates to follow, and even if they can’t step up, he has no problem doing everything himself. It’s clear that there are doubts about Swanigan’s ability to succeed at the next level, even if I’m not much for projecting NBA potential. He isn’t the greatest athlete, his defense needs serious work, and he doesn’t fit the mold for any position in the league. But here’s the cool part about being a college basketball fan: I don’t have to give a shit about what Swanigan may or may not do in the NBA. I get to enjoy him for what he is now, which is the best player in the Big Ten, the best big man in college basketball, and — this is going to sound sacrilegious to Robbie Hummel disciples, but I’m going to say it anyway because it’s true — the best player to wear a Purdue uniform in more than 20 years. ", "child": "1672_1\t1672_2\t1672_3\t1672_4\t1672_5\t1672_6\t1672_7\t1672_8\t1672_9\t1672_10\t1672_11"}