{"name": "1711", "parent": "", "title": "10 Apps that Will Help You Get in Shape This Year", "sentences": [{"c96a": "10 Apps that Will Help You Get in Shape This Year"}, {"183f": "Most people have given up on their resolutions at this point in the year. But, if you still want to make 2017 your most healthy year yet, there are a ton of apps to help you set your fitness goals and stay on track every day. Whether you’re an elite runner who’s looking for a playlist that automatically adjusts to your pace, or you’re just beginning a strength training routine and want some expert guidance, you’ll find something on this list just for you. Lace up your sneakers and get ready—this is bound to be your healthiest year yet!"}, {"5030": "Streaks Workout"}, {"e92e": "The personal trainer that you actually want to use."}, {"5757": "Streaks Workout"}, {"ab6c": "Let’s kick this list off with a super simple app: Streaks. You can choose up to six different “tasks” you want to turn into habits — like walking to work, flossing your teeth, or practicing a new language. Then, set how frequently you want to do the task (it could be daily or less frequently)."}, {"57f5": "Every time you complete a scheduled task, the streak continues. The goal is simple: don’t break the streak! It sounds overly simple, but it’s actually a highly effective habit-changing technique. Streaks is a great app to start with if you’re brand new to conscious habit improvement."}, {"74a3": "4-Minute Workout"}, {"25e7": "The fastest full-body workout in just four minutes."}, {"9283": "4-Minute Workout may just be the world’s fastest exercise plan. You’ll work your entire body in just four minutes with this app. It’s based on a popular regimen called “Tabata,” which was originally used by Japanese Olympic athletes. But how effective can a four-minute workout really be? Tabata routines are said to be five times more effective than traditional cardio workouts. You’ll go through 8 different cycles of exercise with 20 seconds of intense bursts, followed by 10 seconds of rest."}, {"ddf6": "This high intensity interval training (HIIT) is designed to kickstart your metabolism, burn more fat, and achieve results faster. For only four minutes a day, there’s not a lot to risk by giving this a try. But, if you’re skeptical and want to start with a longer workout, you can always give the New York Times 7-Minute workout a shot instead."}, {"df73": "Muscle Wiki"}, {"d5e9": "Understand your body, simplify your workouts."}, {"72cc": "Muscle Wiki is an incredible resource for anyone who wants to better understand the various parts of the body—and learn exercises to target key muscle groups. If you want to strengthen your shoulders, for instance, you’d see a handful of exercises like: side lateral raises, seated dumbbell press, and front raises. There’s an entirely separate section just for stretching, too. To stretch your quads, you’ll find four different recommendations (with GIFs!). There are even a bunch of useful health tools, like calorie, macro, and one rep max calculators. This is sure to be a useful, intuitive tool to help you get the most of your workouts."}, {"be63": "Freeletics"}, {"35d2": "High intensity workouts and training plans."}, {"efba": "You can use the Freeletics app to create an individualized training program based on your personal goals. There are over 900 training variations, including: strength training exercises, sprinting, and long-distance running. You also don’t need weights or machines to do any of the programs, so you can get started right away and do your workouts from pretty much anywhere. Getting started is free, but the full program will run you about $3/day. It’s definitely worth giving this one a try if you’re looking for quick, individualized workouts without hiring an expensive personal trainer."}, {"1553": "Fitocracy"}, {"2cf0": "An app that will help you reach your fitness goals."}, {"13c9": "Fitocracy is like carrying your personal trainer around with you on your phone. You’ll do an assessment to create a personalized plan for success—so whether you’re just starting out or are a long-time athlete, you’ll find the right workouts for you. Then, use the app to guide you through actual workouts, one set at a time. You’ll also have access to a personalized nutrition plan built around your health needs. Even better? For a small daily fee, you can pick a coach or join a coaching program to keep you accountable and on track."}, {"9232": "Fitbod"}, {"1dd9": "Find new strength with smart fitness guidance."}, {"d930": "If you’re looking for an app to help you target specific muscle groups and build a custom-fit workout plan, check out fitbod. This tool will study your workout history, adapt to available gym equipments, and understand your strength training abilities. This is a great tool to use if you’re new to the gym and want to try different machines that at first seem daunting. If your goal is strength training, muscle tone, bodybuilding, or even Olympic lifting, this is a great app to help you fine tune your workouts and keep track of your fitness progress."}, {"c688": "Weav Run"}, {"1d10": "Running music that speeds up and slows down to your rhythm."}, {"1ccb": "Runners, great ready—this app is about to make your day. Weav Run will adjust your music experience in real-time based on your level of activity. Whether you’re going for a quiet walk, or sprinting, or doing a training run for your next half marathon, Weav matches the pace using adaptive music tracks. Music ranges from 100 to 240 bpms, so there’s something perfect for you for every workout. You can also opt to lock in a particular tempo if you want to do a pace run and use the music to keep you on target. Use this app to track the progress of your workouts, and try an intro run when you’re first starting out to get comfortable with Weav."}, {"9660": "Human"}, {"a83d": "Move for 30 mins or longer, every day."}, {"8989": "Is one of your goals to workout more this year? Human might be the perfect digital companion for you. This app is a free all-day activity tracker that encourages you to move for at least 30 minutes every day. Each minute you spend walking, running, or biking throughout the day will count toward your daily goal. You can use it to see how much other people in your city move, and compare your activity levels to people like you. You can also see how the whole world is moving—which is fun and motivating. As of the writing of this article, the three most active cities on Human yesterday were: Berlin, Las Vegas (!!!), and Stockholm. Track the number of minutes you move over time, and get healthier as you go."}, {"aabc": "Naked"}, {"47c8": "The world’s first home body scanner for fitness tracking."}, {"c248": "Ummm. This is amazing. Naked is a home body scanner that captures your 3D body model so you can visualize your body’s changes over time. The tool will help you track your body measurements, weight, and volumetric body fat %. It’s not always easy to see how your body is changing over time, but this tool makes it super simple. Use it to track your muscle growth and fat loss, as well as weight and body measurement changes. The built-in heat map on the app will highlight where you’re losing and gaining fat."}, {"8b13": "Sweatcoin"}, {"0038": "The app that pays you to get fit."}, {"4cca": "Sweatcoin wants to incentivize you to move more. How? By paying you to do it. Using your phone’s accelerometers and GPS location, the app tracks your outdoor steps, which are then converted into “Sweatcoin” currency. 1,000 outdoor steps = .95 Sweatcoins. You can get a bunch of goods and services in exchange for Sweatcoins, like an Apple Watch or an experience at an anti-gravity yoga class. You can also donate your Sweatcoins to incredible partner charities to use your movement for the good of your own health and the world. This app is an example of gamification at its best: incentivizing positive behavior in a fun and engaging way."}, {"d4ed": "Working out takes…well, work. It’s not always easy or fun—especially when you’re starting out. But any of us who have worked out consistently know that exercising and maintaining your health ultimately feels great. If you’re looking for more apps and products to make it easier and more fun to reach your fitness goals this year, check out the full collection on Product Hunt:"}], "content": "10 Apps that Will Help You Get in Shape This Year Most people have given up on their resolutions at this point in the year. But, if you still want to make 2017 your most healthy year yet, there are a ton of apps to help you set your fitness goals and stay on track every day. Whether you’re an elite runner who’s looking for a playlist that automatically adjusts to your pace, or you’re just beginning a strength training routine and want some expert guidance, you’ll find something on this list just for you. Lace up your sneakers and get ready—this is bound to be your healthiest year yet! Streaks Workout The personal trainer that you actually want to use. Streaks Workout Let’s kick this list off with a super simple app: Streaks. You can choose up to six different “tasks” you want to turn into habits — like walking to work, flossing your teeth, or practicing a new language. Then, set how frequently you want to do the task (it could be daily or less frequently). Every time you complete a scheduled task, the streak continues. The goal is simple: don’t break the streak! It sounds overly simple, but it’s actually a highly effective habit-changing technique. Streaks is a great app to start with if you’re brand new to conscious habit improvement. 4-Minute Workout The fastest full-body workout in just four minutes. 4-Minute Workout may just be the world’s fastest exercise plan. You’ll work your entire body in just four minutes with this app. It’s based on a popular regimen called “Tabata,” which was originally used by Japanese Olympic athletes. But how effective can a four-minute workout really be? Tabata routines are said to be five times more effective than traditional cardio workouts. You’ll go through 8 different cycles of exercise with 20 seconds of intense bursts, followed by 10 seconds of rest. This high intensity interval training (HIIT) is designed to kickstart your metabolism, burn more fat, and achieve results faster. For only four minutes a day, there’s not a lot to risk by giving this a try. But, if you’re skeptical and want to start with a longer workout, you can always give the New York Times 7-Minute workout a shot instead. Muscle Wiki Understand your body, simplify your workouts. Muscle Wiki is an incredible resource for anyone who wants to better understand the various parts of the body—and learn exercises to target key muscle groups. If you want to strengthen your shoulders, for instance, you’d see a handful of exercises like: side lateral raises, seated dumbbell press, and front raises. There’s an entirely separate section just for stretching, too. To stretch your quads, you’ll find four different recommendations (with GIFs!). There are even a bunch of useful health tools, like calorie, macro, and one rep max calculators. This is sure to be a useful, intuitive tool to help you get the most of your workouts. Freeletics High intensity workouts and training plans. You can use the Freeletics app to create an individualized training program based on your personal goals. There are over 900 training variations, including: strength training exercises, sprinting, and long-distance running. You also don’t need weights or machines to do any of the programs, so you can get started right away and do your workouts from pretty much anywhere. Getting started is free, but the full program will run you about $3/day. It’s definitely worth giving this one a try if you’re looking for quick, individualized workouts without hiring an expensive personal trainer. Fitocracy An app that will help you reach your fitness goals. Fitocracy is like carrying your personal trainer around with you on your phone. You’ll do an assessment to create a personalized plan for success—so whether you’re just starting out or are a long-time athlete, you’ll find the right workouts for you. Then, use the app to guide you through actual workouts, one set at a time. You’ll also have access to a personalized nutrition plan built around your health needs. Even better? For a small daily fee, you can pick a coach or join a coaching program to keep you accountable and on track. Fitbod Find new strength with smart fitness guidance. If you’re looking for an app to help you target specific muscle groups and build a custom-fit workout plan, check out fitbod. This tool will study your workout history, adapt to available gym equipments, and understand your strength training abilities. This is a great tool to use if you’re new to the gym and want to try different machines that at first seem daunting. If your goal is strength training, muscle tone, bodybuilding, or even Olympic lifting, this is a great app to help you fine tune your workouts and keep track of your fitness progress. Weav Run Running music that speeds up and slows down to your rhythm. Runners, great ready—this app is about to make your day. Weav Run will adjust your music experience in real-time based on your level of activity. Whether you’re going for a quiet walk, or sprinting, or doing a training run for your next half marathon, Weav matches the pace using adaptive music tracks. Music ranges from 100 to 240 bpms, so there’s something perfect for you for every workout. You can also opt to lock in a particular tempo if you want to do a pace run and use the music to keep you on target. Use this app to track the progress of your workouts, and try an intro run when you’re first starting out to get comfortable with Weav. Human Move for 30 mins or longer, every day. Is one of your goals to workout more this year? Human might be the perfect digital companion for you. This app is a free all-day activity tracker that encourages you to move for at least 30 minutes every day. Each minute you spend walking, running, or biking throughout the day will count toward your daily goal. You can use it to see how much other people in your city move, and compare your activity levels to people like you. You can also see how the whole world is moving—which is fun and motivating. As of the writing of this article, the three most active cities on Human yesterday were: Berlin, Las Vegas (!!!), and Stockholm. Track the number of minutes you move over time, and get healthier as you go. Naked The world’s first home body scanner for fitness tracking. Ummm. This is amazing. Naked is a home body scanner that captures your 3D body model so you can visualize your body’s changes over time. The tool will help you track your body measurements, weight, and volumetric body fat %. It’s not always easy to see how your body is changing over time, but this tool makes it super simple. Use it to track your muscle growth and fat loss, as well as weight and body measurement changes. The built-in heat map on the app will highlight where you’re losing and gaining fat. Sweatcoin The app that pays you to get fit. Sweatcoin wants to incentivize you to move more. How? By paying you to do it. Using your phone’s accelerometers and GPS location, the app tracks your outdoor steps, which are then converted into “Sweatcoin” currency. 1,000 outdoor steps = .95 Sweatcoins. You can get a bunch of goods and services in exchange for Sweatcoins, like an Apple Watch or an experience at an anti-gravity yoga class. You can also donate your Sweatcoins to incredible partner charities to use your movement for the good of your own health and the world. This app is an example of gamification at its best: incentivizing positive behavior in a fun and engaging way. Working out takes…well, work. It’s not always easy or fun—especially when you’re starting out. But any of us who have worked out consistently know that exercising and maintaining your health ultimately feels great. If you’re looking for more apps and products to make it easier and more fun to reach your fitness goals this year, check out the full collection on Product Hunt: ", "child": "1711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_21711_1\t1711_2"}