{"name": "1713", "parent": "", "title": "The definitive guide to building muscle and strength", "sentences": [{"83e1": "The definitive guide to building muscle and strength"}, {"68a1": "Building muscle can be a touchy topic, everyone and their mum has a view on the best way to do it. Speak to one guy and he’ll swear by high reps, low rest times and going to failure but, speak to another and he’ll tell you heavy weights and low reps is the way to go. Then there are the guys who promote drop sets, negatives and even blood occlusion training as the best way to build muscle."}, {"61db": "How do you know who is right? One of them, some of them, all of them or none of them? It’s no wonder you get stuck in the quicksand that is muscle building, jumping from one programme to another, wondering the whole time whether any of it’s actually working."}, {"08d9": "You ask yourself, “is it worth it?” and of course it is, but even the strongest person has doubts in the face of conflicting ideas and an overwhelming amount of information."}, {"9e87": "All it takes is a quick google search to set your head spinning with information and promises of fast muscle. All the while you end up being no closer to the actual answer you seek."}, {"c980": "These are the questions that this post will look to answer."}, {"dd6d": "Let’s begin."}, {"ea28": "What is a muscle?"}, {"c2d6": "A muscle is essentially a bundle of long fibres contained within a sheath of connective tissue called the Perimysium which functions to produce movement or maintain posture when contracted."}, {"93dc": "Within each muscle there are two types of muscle fibres:"}, {"ca33": "Type I"}, {"cce9": "Commonly known as “slow-twitch”, these fibres are used when you engage in endurance activities such as distance running. They have a low power output but excel in their ability to provide stamina when exercising."}, {"3c42": "Type II"}, {"af04": "Known as “fast-twitch”, these fibres are used to perform powerful bursts of movement such as sprinting or heavy weight lifting and fatigue very quickly."}, {"bad1": "Type II muscle fibres can also be broken down in Type IIa and Type IIb."}, {"a408": "Type IIa & Type IIb"}, {"aefd": "Type IIa are known as intermediate fast-twitch fibres and use aerobic and anaerobic metabolism near equally to produce energy, in this way they are a combination of Type I and II fibres."}, {"4c3f": "Type IIb muscle fibres are your out and out “fast-twitch” muscle fibres, able to produce quick and powerful movements, fire the fastest but fatigue the quickest."}, {"8d01": "How do muscles grow?"}, {"a74e": "It has been proposed that there are two types of muscle growth:"}, {"fe00": "Sarcoplasmic"}, {"73dc": "Sarcoplasmic muscle growth refers to muscle growth through an increase in the volume of the non-contractile muscle cell fluid (sarcoplasm). This means that whilst the size of the muscle increases through training there is no increase in muscular strength due to an increase in the cross-sectional area but decrease in density of muscle fibres."}, {"19c9": "This type of muscle growth is associated with a swelling of the muscles as the amount of fluid increases and is usually described as “bodybuilder” training; higher reps with light to moderate load."}, {"1ce0": "Myofibrillar"}, {"1751": "On the other hand, myofibrillar muscle growth refers to an actual increase in the number and size of muscle fibres. This enlargement of the muscle is caused by an increase in myofibrils which in turn allow the muscle to produce a greater amount of force."}, {"994e": "This muscle growth is associated with a denser looking muscle sported by, for example, gymnasts and other athletes with good aesthetics and a high level of relative strength who train using moderate reps and moderate to high load."}, {"329f": "Are there actually 2 types of muscle growth?"}, {"0f6d": "There is a lot of debate around the validity of sarcoplasmic muscle growth and whether it exists or not."}, {"6e8c": "Sarcoplasmic muscle growth has research on both sides of the fence and appears to have come to the forefront as an explanation for the discrepancy in strength between bodybuilders and weightlifters, i.e. why a 200 something lb bodybuilder can get outlifted by 100 something lb weightlifter."}, {"8de8": "The idea is that bodybuilders have ‘non-functional’ sarcoplasmic muscle growth which allows them to get bigger but not stronger. This leads people to argue that if you want to be strong with dense muscles you should train using moderate reps and high load to create myofibrillar hypertrophy and if you want size irrespective of strength then you should use high reps with a light to moderate load."}, {"f25b": "However, there are other reasons for this difference in strength between bodybuilders and powerlifters. Namely, the skill component of lifting, for instance if you lift very heavy loads when squatting frequently, then you’ll get better at doing exactly that. It’s no secret that bodybuilders lift differently with a focus on volume and not strength which helps to explain this difference in muscle size and relative strength."}, {"db3a": "Either way you look at it there are arguments and research for and against the existent of sarcoplasmic hypertrophy. You can read more here (1, 2, 3, 4, 5) and make up your own mind."}, {"009a": "In the meantime, let’s move on."}, {"3bbe": "How do you build muscle and strength? What the research says."}, {"9a0c": "Research shows that there are three primary drivers of muscle growth:"}, {"f348": "Mechanical tension"}, {"29b4": "Mechanical tension is the term used to described the tension you put your muscles under when you lift weights. This tension then causes your body to react by stimulating muscle growth over time."}, {"ff41": "To make this work long-term you need to apply progressive overload to ensure that you’re continuing to place your muscles under tension even as they adapt and get stronger. This means every time you hit your sets and reps goal you increase the load lifted in the next session working on those same movements."}, {"b2cd": "Muscle damage"}, {"e245": "Muscle damage is as it sounds, damage to the muscle fibres through training either by performing exercises your body is not used to, emphasising the eccentric portion of a lift or training with adequate loads. As with mechanical tension, your muscles will be better able to handle stresses placed upon them over time."}, {"dfc8": "Cellular fatigue"}, {"6e79": "Cellular fatigue, as known as working to failure, is the process of taking a muscle to its metabolic limits through continuous and repeated action. This is best achieved by using a constant lifting tempo with moderate to high reps, forcing the muscle to go to failure."}, {"5fc1": "What’s the best way to build muscle and strength?"}, {"afce": "The following research study took a group of 33 physically active men and put them through an 8-week training programme to measure the differences in muscle mass and strength."}, {"fb07": "The researchers found that high intensity resistance training (moderate reps, heavy load) is superior for building both muscle and strength than moderate intensity resistance training (high reps, moderate load)."}, {"10b2": "Researchers identified two reasons for this:"}, {"a368": "Another study also shows that progressive overload and the increase in muscle tension is the main driver for quality muscle growth. Not only this but using moderate rep intensity (4–11 reps) and high load whilst specifically applying progressive overload is even better."}, {"eb5b": "Research shows that if you couple this with prolonged rest times of 3 mins or more between sets and you’re golden."}, {"31c2": "Two key principles for building muscle — progressive overload and consistency"}, {"ee04": "Progressive overload is the process of continually increasing the workload from workout to workout, in order to force the body to adapt to new a stimulus above and beyond what it previously has."}, {"0796": "The reason why this is so important is because without the necessary stimulus your body will not have a reason to get bigger, stronger, faster or leaner."}, {"a773": "This means if you were to workout using the same weights, sets and reps, nothing would ever happen and you would never change. Applying progressive overload to strength workouts is as straightforward as increasing either your reps, sets or weight lifted in each session."}, {"3bf5": "What you want to do is focus on one factor and aim to increase it each session. To try and increase all 3 would be too difficult and become counterproductive. I recommend focusing on a combination of weight lifted and reps."}, {"c8c3": "Consistency sounds like a simple concept and to be honest it really is, but you’d be surprised by the number of people who fail to apply it. Not only do they fail to apply it but they then wonder why they’re not seeing any progress or at least not the progress they would like."}, {"64bd": "If you’re asking yourself why, it’s for this reason."}, {"a4d5": "If you don’t train consistently, you can’t expect to make regular progress. You have to train as many time as set out by your training programme. It’s that simple. If you can’t do that, then get a new training plan."}, {"e40c": "Jumping from one training plan to another will see you stagnate and make limited progress at best. Equally, missing workouts on a regular basis is a quick-fire way to prevent you from being able to apply progressive overload and will also lead to minimal progress if you’re lucky."}, {"e132": "The point is, whatever your fitness goals are you MUST apply these principles together for optimal results."}, {"a2d8": "It’s not about one or the other. They come as a pair and must be applied together in order to give your body the stimulus it needs to continually adapt."}, {"e331": "Work hard, stay focused and continually apply these 2 principles and you’ll give you self no choice but to succeed. It is this that will make you lose fat, build muscle, gain strength or fulfil any other training goal."}, {"488a": "What about sets, reps and rest times?"}, {"5d96": "When it comes to sets, it will largely depend on who you ask and what your goals are."}, {"ddf5": "Finding definitive research can be tricky because of the number of variables but one study conducted by Goteborg University researchers found that an average overall volume of 40–60 reps per session appeared to show the best results."}, {"befa": "Even knowing this, it can be tricky to give you a solid answer as it begins to become subjective based on the individual you are talking too."}, {"8eb0": "However, based on my experience, the experience of my clients and the research available, I recommended generally working with sets of 3 in the 4–8 rep range for your compound lifts and sets of 3–4 in the 8–15 rep range for your isolation work."}, {"69d7": "As for rest times the general consensus for rest times looks something like this:"}, {"2777": "This is sound advice and something that in my experience works well."}, {"cbd7": "If you are performing moderate to heavy training with low to mid-range reps, then research shows that you definitely want to resting for at least 3 minutes between sets."}, {"7a35": "You are what you eat — the importance of nutrition for building muscle"}, {"5037": "To build muscle you need to be eating in a calorie surplus and to build muscle with minimal possible fat gain you need to balance eating too much and not eating enough."}, {"ea45": "I recommend a calorie surplus of 10–15% as a good starting point with the aim being to gain 0.5–1 lbs of weight per week."}, {"c66c": "I know this may not sound like much but think 1–4 lbs of solid muscle a month adds up to 3–12 lbs every 3 months and this can make an outstanding difference to your physique. Trying to gain muscle any faster than this and you will gain more fat in the process, which will ruin your look. The key to successful weight gain is put on as much muscle as possible whilst keeping fat gain to a minimum."}, {"4cfc": "The quickest way to calculate this is to take your bodyweight in lbs and multiply it by 16."}, {"cd87": "This will give you a good starting point. You can then adjust as you go based on your rate of weight gain and how much exercise you are performing."}, {"15a9": "As for macros my preferred set up is:"}, {"3286": "Meal frequency and timing"}, {"a630": "There are numerous schools of thought when it comes to meal frequency and timing; some people swear by breakfast, others won’t eat until lunch and another group will eat every couple of hours."}, {"1d7a": "None of these methods are inherently better than the other and ultimately what it comes down to do is finding a routine that works for you and fits into your lifestyle, as it’s this that will help you stick to your diet and achieve your goals."}, {"d9de": "To help you when you are deciding what works for you, there are a few things you should keep in mind. You want to:"}, {"716a": "It is also worth noting that you don’t have to eat in the same way every day, sure for the majority of the time it is easier but if your schedule means you need to change from your usual routine, don’t freak out about this. It’s absolutely fine."}, {"75df": "As for meal timing, it is widely accepted in the industry the most important time to eat is after your workout, generally within 30–90 mins and a mix of protein and carbohydrates. This is to aid in refilling your muscle glycogen stores, prevent muscle breakdown and encourage muscle repair and growth."}, {"887c": "However, one study found that the importance of the post workout meal is much more relevant if a pre-workout meal was not eaten and that the importance of post-workout nutrition was diminished when a meal had been eaten prior to training."}, {"723c": "This study also found that unless the individual was training a second time later in the day (and therefore needed to restore glycogen stores more immediately) or had not eaten a pre-workout meal then as long as caloric needs were met across the 24-hour period there would be no particular benefit from having a pre-workout meal."}, {"f06c": "Now, whilst the study certainly shows that post-workout nutrition may not be as important as we once thought they do not show beyond a shadow of a doubt that post-workout meals are unnecessary. Especially if you are training without a pre-workout meal or are training a second time in the same day."}, {"5691": "To sum up, a post-workout meal isn’t bad for you and will probably help a little bit so don’t go abandoning it just yet."}, {"770d": "Besides if you’re anything like me then you’re probably hungry after working and want to keep a meal there anyway. However, if you do not eat a post-workout meal then just aim to meet your daily calories needs in full and you will be okay."}, {"c582": "Other than that, you’re free to do as you please."}, {"0a58": "Whatever works, it really is up to you."}, {"abb6": "How do you put this into action?"}, {"dbd2": "It’s time to pull this all together in a few easy to implement action steps:"}, {"a1e4": "Not sure where to start?"}, {"b55e": "Get the tools you need to build the body you want with my free workout programme and nutrition cheat sheet."}, {"708f": "Thanks for reading! If you liked it please give the little green heart a click."}, {"3b00": "Originally published at www.liftlearngrow.com."}], "content": "The definitive guide to building muscle and strength Building muscle can be a touchy topic, everyone and their mum has a view on the best way to do it. Speak to one guy and he’ll swear by high reps, low rest times and going to failure but, speak to another and he’ll tell you heavy weights and low reps is the way to go. Then there are the guys who promote drop sets, negatives and even blood occlusion training as the best way to build muscle. How do you know who is right? One of them, some of them, all of them or none of them? It’s no wonder you get stuck in the quicksand that is muscle building, jumping from one programme to another, wondering the whole time whether any of it’s actually working. You ask yourself, “is it worth it?” and of course it is, but even the strongest person has doubts in the face of conflicting ideas and an overwhelming amount of information. All it takes is a quick google search to set your head spinning with information and promises of fast muscle. All the while you end up being no closer to the actual answer you seek. These are the questions that this post will look to answer. Let’s begin. What is a muscle? A muscle is essentially a bundle of long fibres contained within a sheath of connective tissue called the Perimysium which functions to produce movement or maintain posture when contracted. Within each muscle there are two types of muscle fibres: Type I Commonly known as “slow-twitch”, these fibres are used when you engage in endurance activities such as distance running. They have a low power output but excel in their ability to provide stamina when exercising. Type II Known as “fast-twitch”, these fibres are used to perform powerful bursts of movement such as sprinting or heavy weight lifting and fatigue very quickly. Type II muscle fibres can also be broken down in Type IIa and Type IIb. Type IIa & Type IIb Type IIa are known as intermediate fast-twitch fibres and use aerobic and anaerobic metabolism near equally to produce energy, in this way they are a combination of Type I and II fibres. Type IIb muscle fibres are your out and out “fast-twitch” muscle fibres, able to produce quick and powerful movements, fire the fastest but fatigue the quickest. How do muscles grow? It has been proposed that there are two types of muscle growth: Sarcoplasmic Sarcoplasmic muscle growth refers to muscle growth through an increase in the volume of the non-contractile muscle cell fluid (sarcoplasm). This means that whilst the size of the muscle increases through training there is no increase in muscular strength due to an increase in the cross-sectional area but decrease in density of muscle fibres. This type of muscle growth is associated with a swelling of the muscles as the amount of fluid increases and is usually described as “bodybuilder” training; higher reps with light to moderate load. Myofibrillar On the other hand, myofibrillar muscle growth refers to an actual increase in the number and size of muscle fibres. This enlargement of the muscle is caused by an increase in myofibrils which in turn allow the muscle to produce a greater amount of force. This muscle growth is associated with a denser looking muscle sported by, for example, gymnasts and other athletes with good aesthetics and a high level of relative strength who train using moderate reps and moderate to high load. Are there actually 2 types of muscle growth? There is a lot of debate around the validity of sarcoplasmic muscle growth and whether it exists or not. Sarcoplasmic muscle growth has research on both sides of the fence and appears to have come to the forefront as an explanation for the discrepancy in strength between bodybuilders and weightlifters, i.e. why a 200 something lb bodybuilder can get outlifted by 100 something lb weightlifter. The idea is that bodybuilders have ‘non-functional’ sarcoplasmic muscle growth which allows them to get bigger but not stronger. This leads people to argue that if you want to be strong with dense muscles you should train using moderate reps and high load to create myofibrillar hypertrophy and if you want size irrespective of strength then you should use high reps with a light to moderate load. However, there are other reasons for this difference in strength between bodybuilders and powerlifters. Namely, the skill component of lifting, for instance if you lift very heavy loads when squatting frequently, then you’ll get better at doing exactly that. It’s no secret that bodybuilders lift differently with a focus on volume and not strength which helps to explain this difference in muscle size and relative strength. Either way you look at it there are arguments and research for and against the existent of sarcoplasmic hypertrophy. You can read more here (1, 2, 3, 4, 5) and make up your own mind. In the meantime, let’s move on. How do you build muscle and strength? What the research says. Research shows that there are three primary drivers of muscle growth: Mechanical tension Mechanical tension is the term used to described the tension you put your muscles under when you lift weights. This tension then causes your body to react by stimulating muscle growth over time. To make this work long-term you need to apply progressive overload to ensure that you’re continuing to place your muscles under tension even as they adapt and get stronger. This means every time you hit your sets and reps goal you increase the load lifted in the next session working on those same movements. Muscle damage Muscle damage is as it sounds, damage to the muscle fibres through training either by performing exercises your body is not used to, emphasising the eccentric portion of a lift or training with adequate loads. As with mechanical tension, your muscles will be better able to handle stresses placed upon them over time. Cellular fatigue Cellular fatigue, as known as working to failure, is the process of taking a muscle to its metabolic limits through continuous and repeated action. This is best achieved by using a constant lifting tempo with moderate to high reps, forcing the muscle to go to failure. What’s the best way to build muscle and strength? The following research study took a group of 33 physically active men and put them through an 8-week training programme to measure the differences in muscle mass and strength. The researchers found that high intensity resistance training (moderate reps, heavy load) is superior for building both muscle and strength than moderate intensity resistance training (high reps, moderate load). Researchers identified two reasons for this: Another study also shows that progressive overload and the increase in muscle tension is the main driver for quality muscle growth. Not only this but using moderate rep intensity (4–11 reps) and high load whilst specifically applying progressive overload is even better. Research shows that if you couple this with prolonged rest times of 3 mins or more between sets and you’re golden. Two key principles for building muscle — progressive overload and consistency Progressive overload is the process of continually increasing the workload from workout to workout, in order to force the body to adapt to new a stimulus above and beyond what it previously has. The reason why this is so important is because without the necessary stimulus your body will not have a reason to get bigger, stronger, faster or leaner. This means if you were to workout using the same weights, sets and reps, nothing would ever happen and you would never change. Applying progressive overload to strength workouts is as straightforward as increasing either your reps, sets or weight lifted in each session. What you want to do is focus on one factor and aim to increase it each session. To try and increase all 3 would be too difficult and become counterproductive. I recommend focusing on a combination of weight lifted and reps. Consistency sounds like a simple concept and to be honest it really is, but you’d be surprised by the number of people who fail to apply it. Not only do they fail to apply it but they then wonder why they’re not seeing any progress or at least not the progress they would like. If you’re asking yourself why, it’s for this reason. If you don’t train consistently, you can’t expect to make regular progress. You have to train as many time as set out by your training programme. It’s that simple. If you can’t do that, then get a new training plan. Jumping from one training plan to another will see you stagnate and make limited progress at best. Equally, missing workouts on a regular basis is a quick-fire way to prevent you from being able to apply progressive overload and will also lead to minimal progress if you’re lucky. The point is, whatever your fitness goals are you MUST apply these principles together for optimal results. It’s not about one or the other. They come as a pair and must be applied together in order to give your body the stimulus it needs to continually adapt. Work hard, stay focused and continually apply these 2 principles and you’ll give you self no choice but to succeed. It is this that will make you lose fat, build muscle, gain strength or fulfil any other training goal. What about sets, reps and rest times? When it comes to sets, it will largely depend on who you ask and what your goals are. Finding definitive research can be tricky because of the number of variables but one study conducted by Goteborg University researchers found that an average overall volume of 40–60 reps per session appeared to show the best results. Even knowing this, it can be tricky to give you a solid answer as it begins to become subjective based on the individual you are talking too. However, based on my experience, the experience of my clients and the research available, I recommended generally working with sets of 3 in the 4–8 rep range for your compound lifts and sets of 3–4 in the 8–15 rep range for your isolation work. As for rest times the general consensus for rest times looks something like this: This is sound advice and something that in my experience works well. If you are performing moderate to heavy training with low to mid-range reps, then research shows that you definitely want to resting for at least 3 minutes between sets. You are what you eat — the importance of nutrition for building muscle To build muscle you need to be eating in a calorie surplus and to build muscle with minimal possible fat gain you need to balance eating too much and not eating enough. I recommend a calorie surplus of 10–15% as a good starting point with the aim being to gain 0.5–1 lbs of weight per week. I know this may not sound like much but think 1–4 lbs of solid muscle a month adds up to 3–12 lbs every 3 months and this can make an outstanding difference to your physique. Trying to gain muscle any faster than this and you will gain more fat in the process, which will ruin your look. The key to successful weight gain is put on as much muscle as possible whilst keeping fat gain to a minimum. The quickest way to calculate this is to take your bodyweight in lbs and multiply it by 16. This will give you a good starting point. You can then adjust as you go based on your rate of weight gain and how much exercise you are performing. As for macros my preferred set up is: Meal frequency and timing There are numerous schools of thought when it comes to meal frequency and timing; some people swear by breakfast, others won’t eat until lunch and another group will eat every couple of hours. None of these methods are inherently better than the other and ultimately what it comes down to do is finding a routine that works for you and fits into your lifestyle, as it’s this that will help you stick to your diet and achieve your goals. To help you when you are deciding what works for you, there are a few things you should keep in mind. You want to: It is also worth noting that you don’t have to eat in the same way every day, sure for the majority of the time it is easier but if your schedule means you need to change from your usual routine, don’t freak out about this. It’s absolutely fine. As for meal timing, it is widely accepted in the industry the most important time to eat is after your workout, generally within 30–90 mins and a mix of protein and carbohydrates. This is to aid in refilling your muscle glycogen stores, prevent muscle breakdown and encourage muscle repair and growth. However, one study found that the importance of the post workout meal is much more relevant if a pre-workout meal was not eaten and that the importance of post-workout nutrition was diminished when a meal had been eaten prior to training. This study also found that unless the individual was training a second time later in the day (and therefore needed to restore glycogen stores more immediately) or had not eaten a pre-workout meal then as long as caloric needs were met across the 24-hour period there would be no particular benefit from having a pre-workout meal. Now, whilst the study certainly shows that post-workout nutrition may not be as important as we once thought they do not show beyond a shadow of a doubt that post-workout meals are unnecessary. Especially if you are training without a pre-workout meal or are training a second time in the same day. To sum up, a post-workout meal isn’t bad for you and will probably help a little bit so don’t go abandoning it just yet. Besides if you’re anything like me then you’re probably hungry after working and want to keep a meal there anyway. However, if you do not eat a post-workout meal then just aim to meet your daily calories needs in full and you will be okay. Other than that, you’re free to do as you please. Whatever works, it really is up to you. How do you put this into action? It’s time to pull this all together in a few easy to implement action steps: Not sure where to start? Get the tools you need to build the body you want with my free workout programme and nutrition cheat sheet. Thanks for reading! If you liked it please give the little green heart a click. Originally published at www.liftlearngrow.com. ", "child": "1713_1\t1713_2\t1713_31713_1\t1713_2\t1713_3"}