{"name": "1717", "parent": "", "title": "The Small Weight Gain Problem", "sentences": [{"f908": "The Small Weight Gain Problem"}, {"5e46": "We act like problems aren’t problems until they’re big problems"}, {"ecd2": "I’m somewhere in the zone of 5–10 lbs heavier than I was when I graduated college. Given that college was about a decade ago, and that I was in pretty good shape during college, you might think that’s the kind of problem that I could basically ignore. In fact, that was my initial approach; I ignored it. My friends told me I wasn’t fat. My family told me I wasn’t fat. My doctor told me I wasn’t fat. And, frankly, *I* don’t think I’m fat. I’m actually pretty ok with how I look right now."}, {"5dea": "Here’s the problem though; although my current weight is fine, my current weight is not stable. Of the, like, 8ish pounds I’ve put on, I put two of them on in the last year. Not to get absolutely too self involved (then again, you’re reading my blog so deal with it) but here’s a graph approximating my weight over the past decade:"}, {"0fc1": "To me, this sort of looks like the beginning of an exponential growth graph, which basically look like this:"}, {"8c6c": "So… it’s not just that I’ve put on some weight, it’s that the rate at which I’m putting on weight is increasing. Even if I’m perfectly happy with my current weight, if I want to still be this weight in 2018, I need to start dieting now. I was chatting with a friend about this, and I was like “yeah, I’m thinking of going on a diet because I put on some weight, but I’m not that fussed about my current weight, so maybe I just won’t bother.” She was like, “yeah, I did that, and then I put on a bit more weight. Then, I decided I was ok with my new weight, but then I put on a bit more weight. And now, I’m like, kind of thinking I need to lose some weight, and wishing I’d started when I first noticed it.”"}, {"98c2": "When we evaluate our weight, we evaluate it like it’s this static thing. But it’s not. If you put on ten pounds, this indicates that the current conditions that your body is being subjected to is causing you to put on weight. If you keep subjecting it to those same conditions, you will probably keep putting on weight. We don’t just need to pay attention to where we’re at now, but how it fits into our overall life pattern. Especially because fixing your life patterns is difficult, and likely to take some trial and error."}, {"f2f2": "I first decided to start dieting, like, 6 months ago. And it worked. I lost 5 pounds within like, 2 months or so — which was my weight loss goal. (For thems that curious, I followed a highly modified and fairly lax version of the diet in this book.) But, after hitting my goal, I got a bit too lax, and my weight went back to where it was before I started. I wasn’t terribly demoralized by (it actually took me longer to put the weight back on than it took for me to lose it) but I definitely had a moment of ah yeah, guess I miscalculated that one."}, {"b697": "One thing that’s difficult about trying to lose only 5 pounds is that so much of American weight loss culture is about trying to LOSE AS MUCH WEIGHT AS POSSIBLE. That book I read (Eat to Live) is sort of designed for highly obese people, and says that losing 20 pounds in the first month is not uncommon. I picked it because it had a very vegetarian friendly diet, but like, I had no desire to lose 20 pounds (I like my tits, thank you very much.) Thing is, there really is no diet for people who just want to lose a little weight, or want to tweak the trajectory of their weight gain to be stable."}, {"fc05": "And, there’s no diet for this demographic because there is no market for this diet. People generally don’t try to lose weight until they need to lose a lot of weight, and we have a lot of cultural barriers in place to keep it this way. If you’re just trying to lose a little weight, you will often encounter a fair amount of resistance from well meaning people who tell you that you’re not fat, and that you just shouldn’t worry about it. I remember getting weighed at the doctor once, and being asked “how is this weight for you?” and I said “it’s a few pounds heavier than I’d ideally like.” My doctor then said “that’s not much. I wouldn’t worry about it.” And I didn’t. But now, here I am a few years later, and I’m few more pounds heavier than I’d really like."}, {"3fef": "This is what I wish she’d said to me: “If you are consistently one or two pounds heavier than you’d like, I’d recommend making some modifications to your diet and exercise plan because avoiding future weight gain is easier than losing weight once you’ve gained it.” Given that the vast majority of people in American culture are continually gaining weight, chances are they’re not going to naturally lose 2 pounds they’ve put on. Yes, we have natural water weight fluctuations, but if you start averaging 2 pounds heavier (or if you start seeing new “highs” on the scale) you might want to change your habits."}, {"d2d5": "And, it’s worth pointing out, at least part of the reason it’s easier to to start dieting earlier is psychological. At, say, 5 lbs heavier than I’d like, looking at the scale is annoying, but it’s not painful or deeply scarring. I know some people who find it horrible to look at their weight, but this avoidance will make their weight management more difficult. That said, for people with serious eating disorders, managing their mental health probably takes priority over managing their weight. But, for people who have ok body image, weighing themselves regularly is likely to be useful."}, {"5773": "I stopped weighing myself after I lost 5 pounds, and basically didn’t figure out I’d rebounded until I put most of it back on. This time, I’m planning on weighing myself every day. In fact, apparently, just weighing yourself daily can be enough to get you to lose weight, and is associated with being able to keep weight off in the long term. I’d always been taught not to weigh myself every day, because it would like, be demoralizing if I had weight fluctuations. But… I could also just opt to be chill about my weight fluctuations."}, {"7667": "Looking back on the whole thing, I’m forced to recognize how much denial has been playing a part in my psychology. At least part of the reason I stopped weighing myself after my weight loss success was I kinda sorta knew my eating habits were reverting to an unsustainable level, but I didn’t want to admit it to myself because I like ice cream. Over the years, I kind of kept telling myself I wasn’t putting on weight because every increment was small enough that it could have been natural fluctuation, but I refused to look at the overall increasing trend. And all this denial was absolutely fostered by many people in my social circle."}, {"27d5": "Normally, when I told people I thought I was putting on weight, they’d deny it. However. Sometimes they confirmed my suspicions. Yet… even though I have like, surprisingly few body issues for a woman in America, it was still really panful when people told me I was chubbier than I used to be. Which, of course, is why many of my friends told me I wasn’t putting on weight. Undoubtedly, a few people thought I had, but opted not to tell me instead of hurting me."}, {"1db5": "So… how the hell are we supposed to tell people when they’re putting on weight? Well, I’d focus on how they are feeling. If someone complains to you, instead of saying “Oh my god! You are so not fat!” be like “Are you not feeling good in your body right now?” Don’t make it about your judgements. In fact, if at all possible, avoid judgement of their body. Don’t even tell them they look good, because while it may temporarily make them feel better, it won’t fix their underlying dissatisfaction. Most of all, if someone thinks they’ve put on weight — even just a little — don’t gaslight them. Say something like “well, most people put on weight over time. If you’re worried about it, why not keep track of it? That way, you can know for sure and decide what to do.”"}, {"2a53": "If someone doesn’t ask, I’d say, usually don’t bring it up. By the time it’s enough for you to notice, they’ve probably already noticed themselves. But, if you really feel like you should, again, I’d start with how they’re feeling. But, keep in mind, some people are happier being fat, and if that’s the case you should just let them be fat. However, if they’re feeling bad about their body and they express this to you, a discussion about how they could feel better is a pretty good place to start. Finding out what someone wants for themself, and seeing how you can support them is better than imposing your values onto them."}, {"a5d2": "Anyway. This was a difficult piece to write, because I don’t really have anything against people being fat and happy. I don’t want to body-shame anyone, and writing a piece on how you should start trying to lose weight if you put on 2 lbs really comes across as fairly body shamey. But, it’s not that any particular weight is bad — it’s that the way we’re thinking about weight is wrong. If you’ve been consistently putting on weight for years, but don’t want to be heavier than you currently are, you’ll need to change your current diet. We refuse to see how our historical weight gaining patterns will likely impact our future patterns. And, while I am all about body positivity, accepting your body as it is now doesn’t preclude wanting to avoid additional weight gain, or slowing down current weight gain."}, {"3c60": "But, all of our cultural baggage around weight makes it really difficult to engage with weight management in a healthy way. End of the day, you’ll probably have to “be a lamp unto yourself” because there exist no culturally available examples of people managing their weight well."}, {"462f": "I blame capitalism."}], "content": "The Small Weight Gain Problem We act like problems aren’t problems until they’re big problems I’m somewhere in the zone of 5–10 lbs heavier than I was when I graduated college. Given that college was about a decade ago, and that I was in pretty good shape during college, you might think that’s the kind of problem that I could basically ignore. In fact, that was my initial approach; I ignored it. My friends told me I wasn’t fat. My family told me I wasn’t fat. My doctor told me I wasn’t fat. And, frankly, *I* don’t think I’m fat. I’m actually pretty ok with how I look right now. Here’s the problem though; although my current weight is fine, my current weight is not stable. Of the, like, 8ish pounds I’ve put on, I put two of them on in the last year. Not to get absolutely too self involved (then again, you’re reading my blog so deal with it) but here’s a graph approximating my weight over the past decade: To me, this sort of looks like the beginning of an exponential growth graph, which basically look like this: So… it’s not just that I’ve put on some weight, it’s that the rate at which I’m putting on weight is increasing. Even if I’m perfectly happy with my current weight, if I want to still be this weight in 2018, I need to start dieting now. I was chatting with a friend about this, and I was like “yeah, I’m thinking of going on a diet because I put on some weight, but I’m not that fussed about my current weight, so maybe I just won’t bother.” She was like, “yeah, I did that, and then I put on a bit more weight. Then, I decided I was ok with my new weight, but then I put on a bit more weight. And now, I’m like, kind of thinking I need to lose some weight, and wishing I’d started when I first noticed it.” When we evaluate our weight, we evaluate it like it’s this static thing. But it’s not. If you put on ten pounds, this indicates that the current conditions that your body is being subjected to is causing you to put on weight. If you keep subjecting it to those same conditions, you will probably keep putting on weight. We don’t just need to pay attention to where we’re at now, but how it fits into our overall life pattern. Especially because fixing your life patterns is difficult, and likely to take some trial and error. I first decided to start dieting, like, 6 months ago. And it worked. I lost 5 pounds within like, 2 months or so — which was my weight loss goal. (For thems that curious, I followed a highly modified and fairly lax version of the diet in this book.) But, after hitting my goal, I got a bit too lax, and my weight went back to where it was before I started. I wasn’t terribly demoralized by (it actually took me longer to put the weight back on than it took for me to lose it) but I definitely had a moment of ah yeah, guess I miscalculated that one. One thing that’s difficult about trying to lose only 5 pounds is that so much of American weight loss culture is about trying to LOSE AS MUCH WEIGHT AS POSSIBLE. That book I read (Eat to Live) is sort of designed for highly obese people, and says that losing 20 pounds in the first month is not uncommon. I picked it because it had a very vegetarian friendly diet, but like, I had no desire to lose 20 pounds (I like my tits, thank you very much.) Thing is, there really is no diet for people who just want to lose a little weight, or want to tweak the trajectory of their weight gain to be stable. And, there’s no diet for this demographic because there is no market for this diet. People generally don’t try to lose weight until they need to lose a lot of weight, and we have a lot of cultural barriers in place to keep it this way. If you’re just trying to lose a little weight, you will often encounter a fair amount of resistance from well meaning people who tell you that you’re not fat, and that you just shouldn’t worry about it. I remember getting weighed at the doctor once, and being asked “how is this weight for you?” and I said “it’s a few pounds heavier than I’d ideally like.” My doctor then said “that’s not much. I wouldn’t worry about it.” And I didn’t. But now, here I am a few years later, and I’m few more pounds heavier than I’d really like. This is what I wish she’d said to me: “If you are consistently one or two pounds heavier than you’d like, I’d recommend making some modifications to your diet and exercise plan because avoiding future weight gain is easier than losing weight once you’ve gained it.” Given that the vast majority of people in American culture are continually gaining weight, chances are they’re not going to naturally lose 2 pounds they’ve put on. Yes, we have natural water weight fluctuations, but if you start averaging 2 pounds heavier (or if you start seeing new “highs” on the scale) you might want to change your habits. And, it’s worth pointing out, at least part of the reason it’s easier to to start dieting earlier is psychological. At, say, 5 lbs heavier than I’d like, looking at the scale is annoying, but it’s not painful or deeply scarring. I know some people who find it horrible to look at their weight, but this avoidance will make their weight management more difficult. That said, for people with serious eating disorders, managing their mental health probably takes priority over managing their weight. But, for people who have ok body image, weighing themselves regularly is likely to be useful. I stopped weighing myself after I lost 5 pounds, and basically didn’t figure out I’d rebounded until I put most of it back on. This time, I’m planning on weighing myself every day. In fact, apparently, just weighing yourself daily can be enough to get you to lose weight, and is associated with being able to keep weight off in the long term. I’d always been taught not to weigh myself every day, because it would like, be demoralizing if I had weight fluctuations. But… I could also just opt to be chill about my weight fluctuations. Looking back on the whole thing, I’m forced to recognize how much denial has been playing a part in my psychology. At least part of the reason I stopped weighing myself after my weight loss success was I kinda sorta knew my eating habits were reverting to an unsustainable level, but I didn’t want to admit it to myself because I like ice cream. Over the years, I kind of kept telling myself I wasn’t putting on weight because every increment was small enough that it could have been natural fluctuation, but I refused to look at the overall increasing trend. And all this denial was absolutely fostered by many people in my social circle. Normally, when I told people I thought I was putting on weight, they’d deny it. However. Sometimes they confirmed my suspicions. Yet… even though I have like, surprisingly few body issues for a woman in America, it was still really panful when people told me I was chubbier than I used to be. Which, of course, is why many of my friends told me I wasn’t putting on weight. Undoubtedly, a few people thought I had, but opted not to tell me instead of hurting me. So… how the hell are we supposed to tell people when they’re putting on weight? Well, I’d focus on how they are feeling. If someone complains to you, instead of saying “Oh my god! You are so not fat!” be like “Are you not feeling good in your body right now?” Don’t make it about your judgements. In fact, if at all possible, avoid judgement of their body. Don’t even tell them they look good, because while it may temporarily make them feel better, it won’t fix their underlying dissatisfaction. Most of all, if someone thinks they’ve put on weight — even just a little — don’t gaslight them. Say something like “well, most people put on weight over time. If you’re worried about it, why not keep track of it? That way, you can know for sure and decide what to do.” If someone doesn’t ask, I’d say, usually don’t bring it up. By the time it’s enough for you to notice, they’ve probably already noticed themselves. But, if you really feel like you should, again, I’d start with how they’re feeling. But, keep in mind, some people are happier being fat, and if that’s the case you should just let them be fat. However, if they’re feeling bad about their body and they express this to you, a discussion about how they could feel better is a pretty good place to start. Finding out what someone wants for themself, and seeing how you can support them is better than imposing your values onto them. Anyway. This was a difficult piece to write, because I don’t really have anything against people being fat and happy. I don’t want to body-shame anyone, and writing a piece on how you should start trying to lose weight if you put on 2 lbs really comes across as fairly body shamey. But, it’s not that any particular weight is bad — it’s that the way we’re thinking about weight is wrong. If you’ve been consistently putting on weight for years, but don’t want to be heavier than you currently are, you’ll need to change your current diet. We refuse to see how our historical weight gaining patterns will likely impact our future patterns. And, while I am all about body positivity, accepting your body as it is now doesn’t preclude wanting to avoid additional weight gain, or slowing down current weight gain. But, all of our cultural baggage around weight makes it really difficult to engage with weight management in a healthy way. End of the day, you’ll probably have to “be a lamp unto yourself” because there exist no culturally available examples of people managing their weight well. I blame capitalism. ", "child": "1717_1\t1717_2\t1717_3\t1717_4\t1717_5\t1717_6\t1717_7\t1717_8\t1717_9\t1717_10\t1717_11\t1717_12\t1717_13\t1717_14\t1717_15"}