{"name": "1723", "parent": "", "title": "The Early History of One Actor Playing A Shit Ton of Roles In A Single Film", "sentences": [{"a3f4": "The Early History of One Actor Playing A Shit Ton of Roles In A Single Film"}, {"37c0": "Containing multitudes is a time-honored cinematic tradition."}, {"18df": "Sure, featuring a single actor as more than one character in your movie smells a bit like a gimmick—but at the end of the day, it’s an efficient and often effective means of showcasing the versatility of a performer. And that can hardly be faulted. We caught a whiff of it with Split this year, though McAvoy might be disqualified for being a Legion of One rather than a cast with a shared face. Personally, I had no idea the trend cast such a wide-reaching historical net — I’d stupidly assumed it was something made possible by the advent of modern makeup and digital tech. Again, stupidly."}, {"acd1": "Be it gimmick or something more nuanced (or both!) — it’s particularly fascinating that it has such a long standing history as a marketing device. Film quality aside, the main draw is often the performative tour-de-force itself. Some things never change. And so, without further ado:"}, {"c815": "Sixty Years a Queen (1913)"}, {"2f79": "In which Rolf Leslie plays 27 different monarchists."}, {"24d1": "via Wiki Commons"}, {"431e": "Based off a 1897 work of nonfiction of the same name, Sixty Years a Queen lavishly depicts the reign of Queen Victoria, the era she lived in, and the intriguing British figureheads she interacted with over the course of her lengthy rule. It took a then unprecedented financial investment on the part of silent film pioneers WG Barker (of Ealing Studios) and GB Samuelson to realize the picture. A worthwhile risk, as by all accounts the film’s optimistic pre-War nationalism proved extremely popular. What makes Sixty Years a Queen so, so much more than your run-of-the-mill big budget historical docudrama is this: for some inscrutable reason, character actor Rolf Leslie plays 27 different roles. There are many questions: who exactly are these unspecified “27 Characters?”; did recycling Leslie serve a narrative purpose?; an economic one? Unfortunately, these questions will have to remain a mystery. Apart from a small fragment and a souvenir book containing production stills, which feature Leslie, the film is lost. All we can say for certain is that fresh out of the gate, way waaaaay way back in 1913, Leslie set the bar unreasonably high for future multiple-role performances."}, {"397e": "The Play House (1921)"}, {"d117": "In which Buster Keaton is literally a one man band"}, {"47f5": "Hey there. I have cropped out some egregious blackface for formatting purposes. You can learn more about the racism of minstrel shows here."}, {"77ca": "Early in The Play House Buster Keaton looks up from a playbill (in which all the credits read: KEATON) and remarks to himself, quite literally: “This fellow Keaton seems to be the whole show.” And he is! The Play House’s opening sequence takes the shape of a variety show, and Keaton plays not only the audience but the band and the vaudeville act. Through pretty striking trick-photography, Keaton is shown snarkily watching himself conduct an orchestra (of Keatons), and later, a Keaton-exclusive minstrel act. This feat was accomplished by cameraman Elgin Lessley through the use of a special matte box, placed in front of the camera, comprised of nine independently mobile shutters. After shooting a sequence, Lessley then rewound the film (by fucking hand), opened the next segment, re-filmed the sequence, and repeated this process. Georges Méliès attempted something similar in The Melomaniac (1903), but it’d never been pulled off so seamlessly. Keaton, as quoted by Rudi Belsh, had this to say on Lessley: “If he were off the slightest fraction, no matter how carefully I timed my movements, the composite action could not have been synchronized. But Elgin was outstanding among all the studios. He was a human metronome.” Keaton wouldn’t divulge Lessley’s methods until decades after the film’s premiere, so perhaps it’s no surprise that the multiplicity of Keatons wasn’t advertised at the time. But had Keaton been anything short of a self-aware class act — I have no doubt that posters would be plastered with a Keaton-Kaleidoscope."}, {"67de": "Seven Faces (1929)"}, {"e9fe": "In which Paul Muni *is* the ‘Night at the Museum’"}, {"92ff": "Fox Film Corporation (later 20th C. Pictures) — also, hi super heinous full-body blackface!"}, {"27a4": "Directed by Berthold Viertel, Seven Faces stars old man Scarface Paul Muni as — don’t hold your breath — seven faces. More specifically, Muni plays six wax figures of historical persons and their elderly caretaker Papa Chibou. While the central premise revolves around the tried and true “lovers have a misunderstanding but it works out” arc (no joke, the original title was “Lover Come Back,”) we’re all really here for Muni. Enacting a kind of one-man Plato’s Symposium, Papa Chibou imagines the various waxwork figures offering their individual diatribes on love and courtship — which by all accounts was a veritable showcase of Muni’s talent. By looking at reviews and adverts, it’s clear that Muni’s performances were the backbone of the film’s media strategy: in one review images of Muni and text that reads “PAUL MUNI WHO PLAYS 7 CHARACTERS” eclipse the other actors’ credits and even the film’s title. Another boasts: “The miracle man of the talkies plays seven roles in this feature! The most unusual picture ever shown!” Unfortunately, like Sixty Years a Queen, Seven Faces is super lost. Check your grandma’s attic. Please."}, {"c239": "Kind Hearts and Coronets (1949)"}, {"91a3": "In which Alec Guinness plays the victim(s)"}, {"5a26": "From ‘Focus On Film’ — Autumn 1972"}, {"8cf1": "In 2014, I had the immense pleasure of seeing A Gentleman’s Guide to Love and Murder, which won the Tony for Best Musical that same year. The show concerns the recently orphaned Monty, who upon learning he’s actually the member of the inordinately aristocratic (and wealthy) D’Ysquith family, resolves to murder everyone ahead of him in the line of succession. It’s phenomenal — least of all because of Jefferson Mays, who, through the dark art of quick-changes, plays the entire D’Ysquith family (imagine my surprise when he popped up in Inherent Vice!). Why am I bringing this up? Because about one minute into Kind Hearts and Coronets I realized it was the same fucking story as that delightful musical I’d been raving about for four years. Turns out both are based off Roy Horniman’s 1907 novel Israel Rank: The Autobiography of a Criminal. In Kind Hearts Dennis Price’s well-mannered and sinister Louis (Monty in the musical), sets about bumping off all of the surviving members of the aristocratic (and wealthy) D’Ascoyne family, each portrayed hilariously by veritable dynamo Alec Guinness. Seeing Guinness slip between genders, ages, and accents is a riot — his portrayal of the dawdling and charming Parson is particularly humorous. As with Seven Faces, the film capitalizes on Guinness’ multiplicitous performance in both the art and language of its marketing — highlighting his presence(s) and talent."}, {"0f5c": "The Mouse That Roared (1959)"}, {"b83b": "Yes. Yes. And YES."}, {"8d69": "It’s a damnable party foul to exclude Peter Sellers from a “1 actor, many characters” list — so I won’t. Based on Leonard Wibberley’s satirical Cold War novel of the same name, Jack Arnold’s The Mouse That Roared tells of the teeny-tiny (and imaginary) European duchy of Grand Fenwick. When Fenwick is bankrupted by an American imitation of their sole export, “Pinot Grand Fenwick,” the duchy attempts to rectify its bankruptcy by declaring war on the United States — and losing. Effectively: The Producers but with international politics. Sellers plays three roles: Fenwick’s aloof and doting monarch the Duchess Gloriana XII; its crafty prime minister Count Rupert Mountjoy; and Tully Bascombe, Fenwick’s overwhelmed and massively endearing field marshal/forest ranger. Naturally, satire-qua-satire, Fenwick defeats the U.S. through a series of hilariously improbable (and nuclear) circumstances. But again, at the crux of the film’s marketing is the versatility and skill of its chimeric lead. The trailer, which is primarily an introduction of each of Sellers’ “many parts,” beings: “a hilarious new personality: Peter Sellars in three gloriously funny roles.” The visual advertisements echo this, featuring Sellers in his three garbs, usually making fun of him being in drag. Proving prophetic of Sellers’ reception in Dr. Strangelove, his mutability and skill are at the foreground."}, {"9a32": "FUN FACT: Sellers took on the role(s) to emulate his hero, the aforementioned Alec Guinness."}, {"675f": "Additional oldie films that fit the bill:"}], "content": "The Early History of One Actor Playing A Shit Ton of Roles In A Single Film Containing multitudes is a time-honored cinematic tradition. Sure, featuring a single actor as more than one character in your movie smells a bit like a gimmick—but at the end of the day, it’s an efficient and often effective means of showcasing the versatility of a performer. And that can hardly be faulted. We caught a whiff of it with Split this year, though McAvoy might be disqualified for being a Legion of One rather than a cast with a shared face. Personally, I had no idea the trend cast such a wide-reaching historical net — I’d stupidly assumed it was something made possible by the advent of modern makeup and digital tech. Again, stupidly. Be it gimmick or something more nuanced (or both!) — it’s particularly fascinating that it has such a long standing history as a marketing device. Film quality aside, the main draw is often the performative tour-de-force itself. Some things never change. And so, without further ado: Sixty Years a Queen (1913) In which Rolf Leslie plays 27 different monarchists. via Wiki Commons Based off a 1897 work of nonfiction of the same name, Sixty Years a Queen lavishly depicts the reign of Queen Victoria, the era she lived in, and the intriguing British figureheads she interacted with over the course of her lengthy rule. It took a then unprecedented financial investment on the part of silent film pioneers WG Barker (of Ealing Studios) and GB Samuelson to realize the picture. A worthwhile risk, as by all accounts the film’s optimistic pre-War nationalism proved extremely popular. What makes Sixty Years a Queen so, so much more than your run-of-the-mill big budget historical docudrama is this: for some inscrutable reason, character actor Rolf Leslie plays 27 different roles. There are many questions: who exactly are these unspecified “27 Characters?”; did recycling Leslie serve a narrative purpose?; an economic one? Unfortunately, these questions will have to remain a mystery. Apart from a small fragment and a souvenir book containing production stills, which feature Leslie, the film is lost. All we can say for certain is that fresh out of the gate, way waaaaay way back in 1913, Leslie set the bar unreasonably high for future multiple-role performances. The Play House (1921) In which Buster Keaton is literally a one man band Hey there. I have cropped out some egregious blackface for formatting purposes. You can learn more about the racism of minstrel shows here. Early in The Play House Buster Keaton looks up from a playbill (in which all the credits read: KEATON) and remarks to himself, quite literally: “This fellow Keaton seems to be the whole show.” And he is! The Play House’s opening sequence takes the shape of a variety show, and Keaton plays not only the audience but the band and the vaudeville act. Through pretty striking trick-photography, Keaton is shown snarkily watching himself conduct an orchestra (of Keatons), and later, a Keaton-exclusive minstrel act. This feat was accomplished by cameraman Elgin Lessley through the use of a special matte box, placed in front of the camera, comprised of nine independently mobile shutters. After shooting a sequence, Lessley then rewound the film (by fucking hand), opened the next segment, re-filmed the sequence, and repeated this process. Georges Méliès attempted something similar in The Melomaniac (1903), but it’d never been pulled off so seamlessly. Keaton, as quoted by Rudi Belsh, had this to say on Lessley: “If he were off the slightest fraction, no matter how carefully I timed my movements, the composite action could not have been synchronized. But Elgin was outstanding among all the studios. He was a human metronome.” Keaton wouldn’t divulge Lessley’s methods until decades after the film’s premiere, so perhaps it’s no surprise that the multiplicity of Keatons wasn’t advertised at the time. But had Keaton been anything short of a self-aware class act — I have no doubt that posters would be plastered with a Keaton-Kaleidoscope. Seven Faces (1929) In which Paul Muni *is* the ‘Night at the Museum’ Fox Film Corporation (later 20th C. Pictures) — also, hi super heinous full-body blackface! Directed by Berthold Viertel, Seven Faces stars old man Scarface Paul Muni as — don’t hold your breath — seven faces. More specifically, Muni plays six wax figures of historical persons and their elderly caretaker Papa Chibou. While the central premise revolves around the tried and true “lovers have a misunderstanding but it works out” arc (no joke, the original title was “Lover Come Back,”) we’re all really here for Muni. Enacting a kind of one-man Plato’s Symposium, Papa Chibou imagines the various waxwork figures offering their individual diatribes on love and courtship — which by all accounts was a veritable showcase of Muni’s talent. By looking at reviews and adverts, it’s clear that Muni’s performances were the backbone of the film’s media strategy: in one review images of Muni and text that reads “PAUL MUNI WHO PLAYS 7 CHARACTERS” eclipse the other actors’ credits and even the film’s title. Another boasts: “The miracle man of the talkies plays seven roles in this feature! The most unusual picture ever shown!” Unfortunately, like Sixty Years a Queen, Seven Faces is super lost. Check your grandma’s attic. Please. Kind Hearts and Coronets (1949) In which Alec Guinness plays the victim(s) From ‘Focus On Film’ — Autumn 1972 In 2014, I had the immense pleasure of seeing A Gentleman’s Guide to Love and Murder, which won the Tony for Best Musical that same year. The show concerns the recently orphaned Monty, who upon learning he’s actually the member of the inordinately aristocratic (and wealthy) D’Ysquith family, resolves to murder everyone ahead of him in the line of succession. It’s phenomenal — least of all because of Jefferson Mays, who, through the dark art of quick-changes, plays the entire D’Ysquith family (imagine my surprise when he popped up in Inherent Vice!). Why am I bringing this up? Because about one minute into Kind Hearts and Coronets I realized it was the same fucking story as that delightful musical I’d been raving about for four years. Turns out both are based off Roy Horniman’s 1907 novel Israel Rank: The Autobiography of a Criminal. In Kind Hearts Dennis Price’s well-mannered and sinister Louis (Monty in the musical), sets about bumping off all of the surviving members of the aristocratic (and wealthy) D’Ascoyne family, each portrayed hilariously by veritable dynamo Alec Guinness. Seeing Guinness slip between genders, ages, and accents is a riot — his portrayal of the dawdling and charming Parson is particularly humorous. As with Seven Faces, the film capitalizes on Guinness’ multiplicitous performance in both the art and language of its marketing — highlighting his presence(s) and talent. The Mouse That Roared (1959) Yes. Yes. And YES. It’s a damnable party foul to exclude Peter Sellers from a “1 actor, many characters” list — so I won’t. Based on Leonard Wibberley’s satirical Cold War novel of the same name, Jack Arnold’s The Mouse That Roared tells of the teeny-tiny (and imaginary) European duchy of Grand Fenwick. When Fenwick is bankrupted by an American imitation of their sole export, “Pinot Grand Fenwick,” the duchy attempts to rectify its bankruptcy by declaring war on the United States — and losing. Effectively: The Producers but with international politics. Sellers plays three roles: Fenwick’s aloof and doting monarch the Duchess Gloriana XII; its crafty prime minister Count Rupert Mountjoy; and Tully Bascombe, Fenwick’s overwhelmed and massively endearing field marshal/forest ranger. Naturally, satire-qua-satire, Fenwick defeats the U.S. through a series of hilariously improbable (and nuclear) circumstances. But again, at the crux of the film’s marketing is the versatility and skill of its chimeric lead. The trailer, which is primarily an introduction of each of Sellers’ “many parts,” beings: “a hilarious new personality: Peter Sellars in three gloriously funny roles.” The visual advertisements echo this, featuring Sellers in his three garbs, usually making fun of him being in drag. Proving prophetic of Sellers’ reception in Dr. Strangelove, his mutability and skill are at the foreground. FUN FACT: Sellers took on the role(s) to emulate his hero, the aforementioned Alec Guinness. Additional oldie films that fit the bill: ", "child": "1723_11723_11723_11723_11723_11723_11723_1"}