{"name": "1724", "parent": "", "title": "Help Me Kill The Kardashians", "sentences": [{"b926": "Die!"}, {"ad67": "Help Me Kill The Kardashians"}, {"c61f": "No, not literally. We just need them to disappear as seamlessly as they appeared. It all seemed innocent enough. A decade ago the Reality TV spell was gaining steam and The Kardashians were needed right away."}, {"99ee": "They answered the call by swooping in on the threads of a sex tape that Kim Kardashian West’s mother helped to shop around in order to solidify the dynasty that has perforated any hope for humanity."}, {"a239": "It was recently revealed that most of you are losing interest in Keeping Up With The Kardashians and this could be due to the fact that they are melting into a puddle of their own desperation."}, {"f447": "There are no more butts to inflate; the lips that glossily poke out have been stretched to the max. Hair tricks can’t be rehashed without boredom setting in, and the rest of the templates seem to dissolve into one page of disorientation."}, {"d961": "Even Kim being held at gunpoint in her Paris penthouse didn’t seem dire enough to get the ratings securely fastened."}, {"b535": "In fact things are so bad we may have another Kardashian baby to help save the day. Yes, the sisters fuck and produce for ratings. They also fuck over the men that fuck them for career and adulation."}, {"510c": "Listen, we need The Kardashians to die hard and tragic."}, {"07ba": "We need them to stop inspiring Instagram and Vogue with visuals that have sent Millennials spiraling out of control as they penetrate their trust funds in an effort to Keep Up with lies that aim to render them years over what they should be inhabiting."}, {"cf0a": "The Kardashians must be laid to rest because they amazingly shifted pop culture in a direction that won’t be thoroughly scrubbed away until the world finally finds a cure for viral narcissism."}, {"a6e1": "Exactly ten years ago — we greeted a family of socialites and a matriarch with a husband who was really a woman in disguise — and we underestimated what our adherence meant each week when we were treated to another mind-numbing exercise of what it means to be rich and poor in spirit."}, {"e32b": "Let’s kill this virus and save as many lives as possible."}, {"dd3e": "Kylie Jenner won’t make it so forget about her! But, there are many that look like her that remarkably still carry the pulse of promise and if the future has anything to offer — it’s the hope that we can resurrect deadened souls back to existence."}, {"ffda": "That’s the only way we can Make America Great Again."}, {"a737": "Reality TV seems like an innocent plunge into the pool of the unfamiliar as we laugh our way through the weeks of offering and convince ourselves that we are not harming anyone or altering the course of things."}, {"7333": "If you believe that — you are so wrong."}, {"0096": "All the Housewives, and your Love for Hip Hop and the digging you do for The Duggars plus the loyalty to The Kardashians is the exact reason why we don’t need a remote to change the channel."}, {"4924": "We just have to sit and blink and the screen transforms from black to chaos."}, {"b839": "We need to be murderers and our victims won’t feel a thing believe them!"}, {"0fed": "They’re not real."}], "content": "Die! Help Me Kill The Kardashians No, not literally. We just need them to disappear as seamlessly as they appeared. It all seemed innocent enough. A decade ago the Reality TV spell was gaining steam and The Kardashians were needed right away. They answered the call by swooping in on the threads of a sex tape that Kim Kardashian West’s mother helped to shop around in order to solidify the dynasty that has perforated any hope for humanity. It was recently revealed that most of you are losing interest in Keeping Up With The Kardashians and this could be due to the fact that they are melting into a puddle of their own desperation. There are no more butts to inflate; the lips that glossily poke out have been stretched to the max. Hair tricks can’t be rehashed without boredom setting in, and the rest of the templates seem to dissolve into one page of disorientation. Even Kim being held at gunpoint in her Paris penthouse didn’t seem dire enough to get the ratings securely fastened. In fact things are so bad we may have another Kardashian baby to help save the day. Yes, the sisters fuck and produce for ratings. They also fuck over the men that fuck them for career and adulation. Listen, we need The Kardashians to die hard and tragic. We need them to stop inspiring Instagram and Vogue with visuals that have sent Millennials spiraling out of control as they penetrate their trust funds in an effort to Keep Up with lies that aim to render them years over what they should be inhabiting. The Kardashians must be laid to rest because they amazingly shifted pop culture in a direction that won’t be thoroughly scrubbed away until the world finally finds a cure for viral narcissism. Exactly ten years ago — we greeted a family of socialites and a matriarch with a husband who was really a woman in disguise — and we underestimated what our adherence meant each week when we were treated to another mind-numbing exercise of what it means to be rich and poor in spirit. Let’s kill this virus and save as many lives as possible. Kylie Jenner won’t make it so forget about her! But, there are many that look like her that remarkably still carry the pulse of promise and if the future has anything to offer — it’s the hope that we can resurrect deadened souls back to existence. That’s the only way we can Make America Great Again. Reality TV seems like an innocent plunge into the pool of the unfamiliar as we laugh our way through the weeks of offering and convince ourselves that we are not harming anyone or altering the course of things. If you believe that — you are so wrong. All the Housewives, and your Love for Hip Hop and the digging you do for The Duggars plus the loyalty to The Kardashians is the exact reason why we don’t need a remote to change the channel. We just have to sit and blink and the screen transforms from black to chaos. We need to be murderers and our victims won’t feel a thing believe them! They’re not real. ", "child": "1724_1\t1724_2\t1724_3\t1724_4\t1724_5\t1724_6\t1724_7\t1724_8\t1724_9\t1724_10\t1724_11\t1724_12\t1724_13\t1724_14\t1724_15\t1724_16\t1724_17\t1724_18\t1724_19\t1724_20\t1724_21\t1724_22\t1724_23\t1724_24\t1724_25"}