{"name": "174", "parent": "", "title": "Things people have said about my startup that keep my fire burning #nohate", "sentences": [{"404a": "Things people have said about my startup that keep my fire burning #nohate"}, {"1ee1": "Background"}, {"4312": "I launched Stockphoto.com in 2013 with money I had saved. You can read more here:"}, {"142a": "How to ask your wife for permission to spend $250,000 on a domain nameaka “How Stockphoto.com started”medium.com"}, {"43de": "Things people have said about my startup that keep my fire burning"}, {"56b9": "Jumping into a 250k ‘investment’ with no knowledge of the industry, and one contributor doesn’t seem very smart to me."}, {"14bd": "It’s stupid and the interview with the guy (oh Shutterstock makes so much money with stockphotos and we already have one contributor it’s a sure invest) just confirms it."}, {"1453": "IMHO, domain names are no longer important and if someone spent $250,000 on this one, I wouldn’t want to be an investor."}, {"b262": "The guy’s an idiot. You’d have to get a full website with email lists, contacts, networks, IP, content, and 25,000 in documented average monthly income from whatever. The whole website and business would be attached to that $250,000 tag…not just a domain name. Guy’s a MORON."}, {"3056": "If I buy a Pizza Parlor, you’re damned right I’m going to want the equipment, knives, ovens, contacts, network, phone numbers, building, name, brand, and everything else that comes with buying an established business. Much more appropriate and relevant comparison. Using this comparison, this idiot who bought this domain, bought an empty building just because it was in a prime location. Who knows what he’s going to try to build here. It’s going to take a lot of work and a lot of money to make back his investment…never mind turn a profit."}, {"86b5": "If the guy is working with getty images and wanted to have his own business then yes, that domain is useful…. Unless you have another hundreds of thousands to develop that domain and have the ability to compete with other big businesses in that certain market, that domain is nothing.."}, {"2547": "Honestly I would have purchased a brandable and short domain for a couple thousands and spent the rest for advertising purposes."}, {"d237": "I still think the guy paid over the odds. Plus he’ll have to pay $$$ building his site before he makes much from sales.You can easily get huge numbers of backlinks and rank for a brand new domain name you can buy for $10 and which is completely unrelated to your niche. Take Sexy Mandarin, which got an absolute ton of free publicity by doing something NEW and INTERESTING in the saturated languages niche."}, {"914e": "My guess is that they have no intention of building a long term business there. A few sales might be nice enough but I’ll bet that this is all about selling the domain on for more money. Hence all the pub."}, {"1dd2": "If having a good URL was all it took, photos.com would be the cream of the crop and it’s a rather stale looking backwater…"}, {"c4fe": "Hi Jon, The name BLEEP doesn’t give you the carte blanche in relationships with contributors…At the moment we work with more than BLEEP distributors, BLEEP of them give us reasonable income. Will Stockphoto give us at least $BLEEP per month with our portfolio of BLEEP images? This will put you on average on the 10th+ place as our distribution partner and this will give us the reasons to start working with you. Hopefully you understand that the microstock photography market is already formed. To take at least 10th place as an agency you need something more than the name BLEEP. There are around BLEEP more agencies that wanted to sell us, but we refused, half of them have already gone from market. Please contact me when you have the valuable reason that we can consider to start working with you. (Response from a photographer that I was trying to recruit.)"}, {"dfcf": "If you’re interested in reading the posts in their entirety, they are available here:"}, {"2f06": "Warrior Forum - The #1 Internet Marketing Forum & MarketplaceApologies if this story has been talked about before. Anyway, I found out from Flippa's blog that stockphoto.com sold…www.warriorforum.com"}, {"53e3": "and"}, {"554b": "http://www.microstockgroup.com/general-stock-discussion/you'll-hear-about-a-new-site-soon-stockphoto-com-domain-story/?all"}, {"0286": "In short…"}, {"4369": "‘You don’t know what you’re doing.’"}, {"a7dc": "Yup."}, {"ff51": "But I think I can make it work."}, {"3e1d": "‘Your website looks like shit’"}, {"2759": "Thank you for your feedback."}, {"b0b7": "‘Sir, the possibility of successfully catching Shutterstock is approximately 3,720 to 1.’"}, {"8dc0": "Never tell me the odds."}, {"201e": "Hey, thanks for reading.Mind helping me by recommending or tweeting this article?"}, {"3561": "Thanks :) That would be AMAZING!"}, {"4ad7": "Crappy website. (>47 million) Amazing stock photos."}], "content": "Things people have said about my startup that keep my fire burning #nohate Background I launched Stockphoto.com in 2013 with money I had saved. You can read more here: How to ask your wife for permission to spend $250,000 on a domain nameaka “How Stockphoto.com started”medium.com Things people have said about my startup that keep my fire burning Jumping into a 250k ‘investment’ with no knowledge of the industry, and one contributor doesn’t seem very smart to me. It’s stupid and the interview with the guy (oh Shutterstock makes so much money with stockphotos and we already have one contributor it’s a sure invest) just confirms it. IMHO, domain names are no longer important and if someone spent $250,000 on this one, I wouldn’t want to be an investor. The guy’s an idiot. You’d have to get a full website with email lists, contacts, networks, IP, content, and 25,000 in documented average monthly income from whatever. The whole website and business would be attached to that $250,000 tag…not just a domain name. Guy’s a MORON. If I buy a Pizza Parlor, you’re damned right I’m going to want the equipment, knives, ovens, contacts, network, phone numbers, building, name, brand, and everything else that comes with buying an established business. Much more appropriate and relevant comparison. Using this comparison, this idiot who bought this domain, bought an empty building just because it was in a prime location. Who knows what he’s going to try to build here. It’s going to take a lot of work and a lot of money to make back his investment…never mind turn a profit. If the guy is working with getty images and wanted to have his own business then yes, that domain is useful…. Unless you have another hundreds of thousands to develop that domain and have the ability to compete with other big businesses in that certain market, that domain is nothing.. Honestly I would have purchased a brandable and short domain for a couple thousands and spent the rest for advertising purposes. I still think the guy paid over the odds. Plus he’ll have to pay $$$ building his site before he makes much from sales.You can easily get huge numbers of backlinks and rank for a brand new domain name you can buy for $10 and which is completely unrelated to your niche. Take Sexy Mandarin, which got an absolute ton of free publicity by doing something NEW and INTERESTING in the saturated languages niche. My guess is that they have no intention of building a long term business there. A few sales might be nice enough but I’ll bet that this is all about selling the domain on for more money. Hence all the pub. If having a good URL was all it took, photos.com would be the cream of the crop and it’s a rather stale looking backwater… Hi Jon, The name BLEEP doesn’t give you the carte blanche in relationships with contributors…At the moment we work with more than BLEEP distributors, BLEEP of them give us reasonable income. Will Stockphoto give us at least $BLEEP per month with our portfolio of BLEEP images? This will put you on average on the 10th+ place as our distribution partner and this will give us the reasons to start working with you. Hopefully you understand that the microstock photography market is already formed. To take at least 10th place as an agency you need something more than the name BLEEP. There are around BLEEP more agencies that wanted to sell us, but we refused, half of them have already gone from market. Please contact me when you have the valuable reason that we can consider to start working with you. (Response from a photographer that I was trying to recruit.) If you’re interested in reading the posts in their entirety, they are available here: Warrior Forum - The #1 Internet Marketing Forum & MarketplaceApologies if this story has been talked about before. Anyway, I found out from Flippa's blog that stockphoto.com sold…www.warriorforum.com and http://www.microstockgroup.com/general-stock-discussion/you'll-hear-about-a-new-site-soon-stockphoto-com-domain-story/?all In short… ‘You don’t know what you’re doing.’ Yup. But I think I can make it work. ‘Your website looks like shit’ Thank you for your feedback. ‘Sir, the possibility of successfully catching Shutterstock is approximately 3,720 to 1.’ Never tell me the odds. Hey, thanks for reading.Mind helping me by recommending or tweeting this article? Thanks :) That would be AMAZING! Crappy website. (>47 million) Amazing stock photos. ", "child": "174_1\t174_2\t174_3\t174_4\t174_5\t174_6\t174_7\t174_8\t174_9\t174_10\t174_11\t174_12\t174_13\t174_14\t174_15\t174_16174_1\t174_2\t174_3\t174_4\t174_5\t174_6\t174_7\t174_8\t174_9\t174_10\t174_11\t174_12\t174_13\t174_14\t174_15\t174_16174_1\t174_2\t174_3\t174_4\t174_5\t174_6\t174_7\t174_8\t174_9\t174_10\t174_11\t174_12\t174_13\t174_14\t174_15\t174_16174_1\t174_2\t174_3\t174_4\t174_5\t174_6\t174_7\t174_8\t174_9\t174_10\t174_11\t174_12\t174_13\t174_14\t174_15\t174_16"}