{"name": "175", "parent": "", "title": "Everything I Paid in Taxes", "sentences": [{"30f6": "Everything I Paid in Taxes"}, {"4f63": "Because why not be transparent about how much tax we’re paying?"}, {"ede7": "On Thursday, I did my 1 Thing and paid my 2016 federal taxes as well as my 2017 first quarter estimated and business taxes. (I’m in Washington, so I don’t pay state taxes.)"}, {"dc79": "Here’s what you need to know about my federal taxes:"}, {"8ac6": "In 2016, my gross income was $88,062—slightly higher than the money that hit my checking account, because it includes items like PayPal and Patreon fees as well as other non-paycheck income—and my business income minus loss was $77,177. My adjusted gross income was $68,836, and my taxable income after deductions and exemptions was $58,486."}, {"5d93": "I owed $10,390 in regular tax (yes, that’s what it’s called) and $10,905 in self-employment tax, totaling $21,295. I’d already paid $19,500 in estimated taxes, so, with the addition of a $29 penalty, I ended up owing $1,824."}, {"5003": "Which is great. Last year I owed $2,589, and the year before that I owed $5,443. I am getting better at figuring out how much money I need to pay in estimated taxes!"}, {"f548": "So yesterday I paid $1,824 in federal taxes, $3,500 in federal estimated taxes, and $14.05 in state business taxes."}, {"7b17": "Megan’s also sharing her tax story later this afternoon, which means it’s “Pay Taxes a Week Early Day” at The Billfold. Have you paid yours?"}, {"4cce": "This article is part of The Billfold’s Tax Series."}], "content": "Everything I Paid in Taxes Because why not be transparent about how much tax we’re paying? On Thursday, I did my 1 Thing and paid my 2016 federal taxes as well as my 2017 first quarter estimated and business taxes. (I’m in Washington, so I don’t pay state taxes.) Here’s what you need to know about my federal taxes: In 2016, my gross income was $88,062—slightly higher than the money that hit my checking account, because it includes items like PayPal and Patreon fees as well as other non-paycheck income—and my business income minus loss was $77,177. My adjusted gross income was $68,836, and my taxable income after deductions and exemptions was $58,486. I owed $10,390 in regular tax (yes, that’s what it’s called) and $10,905 in self-employment tax, totaling $21,295. I’d already paid $19,500 in estimated taxes, so, with the addition of a $29 penalty, I ended up owing $1,824. Which is great. Last year I owed $2,589, and the year before that I owed $5,443. I am getting better at figuring out how much money I need to pay in estimated taxes! So yesterday I paid $1,824 in federal taxes, $3,500 in federal estimated taxes, and $14.05 in state business taxes. Megan’s also sharing her tax story later this afternoon, which means it’s “Pay Taxes a Week Early Day” at The Billfold. Have you paid yours? This article is part of The Billfold’s Tax Series. ", "child": "175_1\t175_2\t175_3\t175_4\t175_5\t175_6\t175_7\t175_8\t175_9\t175_10\t175_11\t175_12\t175_13\t175_14175_1\t175_2\t175_3\t175_4\t175_5\t175_6\t175_7\t175_8\t175_9\t175_10\t175_11\t175_12\t175_13\t175_14"}