{"name": "1758", "parent": "", "title": "Why Brown v. Board of Education was bad for education.", "sentences": [{"dd43": "Why Brown v. Board of Education was bad for education."}, {"be68": "No way!"}, {"98a4": "https://www.britannica.com/event/Brown-v-Board-of-Education-of-Topeka"}, {"648b": "Teaching United States history always includes the landmark 1954 Supreme Court case Brown v. Board of Education of Topeka, Kansas. Usually, the case is framed in the context of Jim Crow Laws, systemic segregation, and the civil rights movement. Often Plessy v. Ferguson is cited alongside the Brown decision. It is clear cut instruction: separate is never equal. Students connect to the message, and names like Rosa Parks, Dr. King, and Ruby Bridges are favorites models of civil disobedience and persistence in the face of hatred."}, {"d75d": "In the 1990s, my alma mater, SUNY-Geneseo, invited Linda Brown to speak about her involvement in the historic Brown decision. I remember sitting in the auditorium with rapt attention. Her message was one of hope and empowerment, but also of a dream deferred. I often mention her talk when teaching about the civil rights movement."}, {"61d1": "It is so comforting to teach about an underdog story. It is heartening to tell students that the United States has come so far. It is nice to point to the Obama legacy as evidence of a post-racial society. Except, none of that is true. We are not post-racial. We are not equal."}, {"17e9": "Although people love to champion Brown vs. Board of Education, one of the biggest negative impacts was the firing of teachers during the merger of white and black schools. Jose Luis Vilson discusses a major impact of Brown when he writes in his article “The Need for More Teachers of Color”, published in the Summer, 2015 edition of American Educator:"}, {"b2ed": "“For instance, when the Supreme Court began to mandate that southern states comply with Brown v. Board of Education, more than 30,000 black teachers and administrators were fired to ensure that white teachers kept their jobs.”"}, {"5ab7": "When teaching preservice teachers as an adjunct at LeMoyne College, students often highlight Vilson’s findings. These future educators express dismay at the exponential ramifications. If 30,000 black educators were fired, that means there were 30,000 fewer role models for black students. There were 30,000 less black teachers to model black leadership to white students. There were 30,000 people who had to find alternative careers, many of whom left a middle-class path. 30,000 multiplied by 63 years equals a shortage of teachers of color."}, {"72b3": "Think about it, if you are white, how many non-white educators have you had? If you are white, how many non-white teachers do you know? If you are non-white, how many non-white role models have you had in your education?"}, {"48c3": "The school choice issue is another layer in America’s racial question. Many urban educators and parents want better educational opportunities due to de facto segregation and the underfunding of predominantly non-white schools. Others, like Secretary of Education DeVos, want parents to have the financial ability to flee “failing” schools — often these “failing” schools are predominantly non-white. Regardless of the reasons or the rhetoric, race continues to plague our schools, and we continue to be both separate and unequal."}, {"fe39": "If you related to this piece, please click on the heart ❤️ icon and consider following Teaching in Trump’s America on Facebook and Twitter."}], "content": "Why Brown v. Board of Education was bad for education. No way! https://www.britannica.com/event/Brown-v-Board-of-Education-of-Topeka Teaching United States history always includes the landmark 1954 Supreme Court case Brown v. Board of Education of Topeka, Kansas. Usually, the case is framed in the context of Jim Crow Laws, systemic segregation, and the civil rights movement. Often Plessy v. Ferguson is cited alongside the Brown decision. It is clear cut instruction: separate is never equal. Students connect to the message, and names like Rosa Parks, Dr. King, and Ruby Bridges are favorites models of civil disobedience and persistence in the face of hatred. In the 1990s, my alma mater, SUNY-Geneseo, invited Linda Brown to speak about her involvement in the historic Brown decision. I remember sitting in the auditorium with rapt attention. Her message was one of hope and empowerment, but also of a dream deferred. I often mention her talk when teaching about the civil rights movement. It is so comforting to teach about an underdog story. It is heartening to tell students that the United States has come so far. It is nice to point to the Obama legacy as evidence of a post-racial society. Except, none of that is true. We are not post-racial. We are not equal. Although people love to champion Brown vs. Board of Education, one of the biggest negative impacts was the firing of teachers during the merger of white and black schools. Jose Luis Vilson discusses a major impact of Brown when he writes in his article “The Need for More Teachers of Color”, published in the Summer, 2015 edition of American Educator: “For instance, when the Supreme Court began to mandate that southern states comply with Brown v. Board of Education, more than 30,000 black teachers and administrators were fired to ensure that white teachers kept their jobs.” When teaching preservice teachers as an adjunct at LeMoyne College, students often highlight Vilson’s findings. These future educators express dismay at the exponential ramifications. If 30,000 black educators were fired, that means there were 30,000 fewer role models for black students. There were 30,000 less black teachers to model black leadership to white students. There were 30,000 people who had to find alternative careers, many of whom left a middle-class path. 30,000 multiplied by 63 years equals a shortage of teachers of color. Think about it, if you are white, how many non-white educators have you had? If you are white, how many non-white teachers do you know? If you are non-white, how many non-white role models have you had in your education? The school choice issue is another layer in America’s racial question. Many urban educators and parents want better educational opportunities due to de facto segregation and the underfunding of predominantly non-white schools. Others, like Secretary of Education DeVos, want parents to have the financial ability to flee “failing” schools — often these “failing” schools are predominantly non-white. Regardless of the reasons or the rhetoric, race continues to plague our schools, and we continue to be both separate and unequal. If you related to this piece, please click on the heart ❤️ icon and consider following Teaching in Trump’s America on Facebook and Twitter. ", "child": "1758_1\t1758_2\t1758_3\t1758_4\t1758_5\t1758_6\t1758_7\t1758_8"}