{"name": "1759", "parent": "", "title": "To My Black Family", "sentences": [{"ccf9": "To My Black Family"}, {"e45e": "[IMAGE DESCRIPTION: Outside, in a crowd, a very large group of black people, seen from behind, holding each other’s hands, which are raised in the air.]"}, {"1615": "If our pro-black activism somehow dehumanizes, erases, excludes, marginalizes, oppresses, or terrorizes black people who are agnostic, atheist, disabled, femme, non-Western, poor, queer, transgender, woman, etc. — like some so-called “pro-black” activism most assuredly does — then we are confusing “pro-black” with “anti-black.”"}, {"ecdd": "If “do no harm to other black people” isn’t the place from which we are starting this, then there really isn’t any point in continuing it, unless we’re just in it to try to create a blacker version of the oppressor’s model."}, {"a44f": "*There may be some black people who we must abandon because of their unwavering dedication to anti-Blackness and white supremacy, and their willingness to do tangible physical or psychological harm to other black people. That determination must be made, however, by means that aren’t cisheteropatriarchal in origin, or fabricated through a lens tainted by white supremacy."}, {"9699": "For example, because they fail profoundly at understanding human behavior, scientific inquiry, and, in particular, the anthropological, cultural, and sociological history of the African continent, some black people think black queer people and same-sex/same-gender desire/love/sex are “white inventions” designed during slavery as a way to “emasculate” black men and destroy the black family; and are, therefore, dangers to Blackness."}, {"cc86": "This is faulty, simplistic, callow, stunted logic that attempts to flatten out the nuances of human existence into consumable pieces that satiate a peculiar kind of hunger for an intentionally narrow quest for power. These kinds of anti-analyses are not the means by which we should come to conclusions about who must be abandoned for the sake of health."}, {"e610": "Rather, we must engage in a rigorous investigation that both holds up to scrutiny and accountability, and is beholden to the idea that within Blackness are a multitude of valid, harmless self-identities that are complementary rather than antithetical to Blackness."}], "content": "To My Black Family [IMAGE DESCRIPTION: Outside, in a crowd, a very large group of black people, seen from behind, holding each other’s hands, which are raised in the air.] If our pro-black activism somehow dehumanizes, erases, excludes, marginalizes, oppresses, or terrorizes black people who are agnostic, atheist, disabled, femme, non-Western, poor, queer, transgender, woman, etc. — like some so-called “pro-black” activism most assuredly does — then we are confusing “pro-black” with “anti-black.” If “do no harm to other black people” isn’t the place from which we are starting this, then there really isn’t any point in continuing it, unless we’re just in it to try to create a blacker version of the oppressor’s model. *There may be some black people who we must abandon because of their unwavering dedication to anti-Blackness and white supremacy, and their willingness to do tangible physical or psychological harm to other black people. That determination must be made, however, by means that aren’t cisheteropatriarchal in origin, or fabricated through a lens tainted by white supremacy. For example, because they fail profoundly at understanding human behavior, scientific inquiry, and, in particular, the anthropological, cultural, and sociological history of the African continent, some black people think black queer people and same-sex/same-gender desire/love/sex are “white inventions” designed during slavery as a way to “emasculate” black men and destroy the black family; and are, therefore, dangers to Blackness. This is faulty, simplistic, callow, stunted logic that attempts to flatten out the nuances of human existence into consumable pieces that satiate a peculiar kind of hunger for an intentionally narrow quest for power. These kinds of anti-analyses are not the means by which we should come to conclusions about who must be abandoned for the sake of health. Rather, we must engage in a rigorous investigation that both holds up to scrutiny and accountability, and is beholden to the idea that within Blackness are a multitude of valid, harmless self-identities that are complementary rather than antithetical to Blackness. ", "child": "1759_1"}