{"name": "176", "parent": "", "title": "Travel for Work Was My Biggest Expense Last Year", "sentences": [{"46e1": "Travel for Work Was My Biggest Expense Last Year"}, {"be69": "Turns out, excuses can cost you."}, {"0849": "I’m a traveler by nature. But don’t mistake me for a nomad or the person in the airport with a bunch of cool patches on my backpack."}, {"82c1": "I make every bit of my travel about work, or at least work-related. That’s what led to it being my biggest expense last year."}, {"795c": "In 2016, I spent $1,194.75 on travel. That includes accommodations, tickets and travel expenses (i.e. Uber). I don’t count food because it’s hard to tease apart Home Food from Abroad Food in the numbers, as much as I would have loved to write that off (blame my crappy recordkeeping and PayPal’s terrible interface). But I didn’t even go abroad—I headed to Orlando, Los Angeles and New York."}, {"3e8b": "$1,194.75 may not be a lot of money to most people, or even most travelers. But for ultra-frugal me, that’s a lot. If I had chosen not to travel, I would have been so much closer to my income goal. All that time lost that I could have spent working. All that prep time that could have been used to solicit more copywriting clients. All that money I could have saved, which would have made my life so much easier."}, {"d62a": "That stays in your head if you’re a freelancer: I was so close."}, {"ae1a": "On paper, every one of those trips was for a reason. Orlando was necessary because one of my books involves people attending Universal Studios’ Halloween Horror Nights and I wanted to speak to their experience. A client’s book launch party was taking place in New York. I had an informational interview in Los Angeles. But the truth? I also wanted to see my HHN friends, visit New York, and attend a friend’s wedding in Los Angeles. I just didn’t have the guts to admit that I wanted to travel for the sake of traveling."}, {"bed7": "The sinister part is that if you lie to yourself about why you want to do something, doing it won’t satisfy you. I probably wouldn’t have tacked on the trip to Orlando if my time in Los Angeles had really satisfied me. If I had valued my own enjoyment, been in the moment… maybe that would have saved me money. Why did it have to be all about work?"}, {"2350": "My defense, of course, was that I wanted to exercise my right as a freelancer and write off the trip for taxes. Fine. But how much better would my work have been if I had rested? Could I have produced better art?"}, {"bb1d": "It would be so easy to blame America’s culture of overworking. I only do something I love when I can write it off for work, so work must be to blame. But it’s not. It’s my own self esteem. I denied myself the real pleasure of travel this year, and I felt incomplete. I strived for more travel to fill the gap. It cost me my income goal."}, {"e01c": "No trips are planned this year, not even for family vacations. I want to see what it’s like to stay close to home. To rest. Then when I’m ready to travel, it’ll be for my own pleasure. Once may finally be enough."}, {"3d82": "Brit McGinnis is a copywriter and author of several books. Her work has appeared on XOJane, SparkNotes and anywhere fine stories are sold. She lives in Portland, Oregon."}, {"e4ed": "This article is part of The Billfold’s Tax Series."}], "content": "Travel for Work Was My Biggest Expense Last Year Turns out, excuses can cost you. I’m a traveler by nature. But don’t mistake me for a nomad or the person in the airport with a bunch of cool patches on my backpack. I make every bit of my travel about work, or at least work-related. That’s what led to it being my biggest expense last year. In 2016, I spent $1,194.75 on travel. That includes accommodations, tickets and travel expenses (i.e. Uber). I don’t count food because it’s hard to tease apart Home Food from Abroad Food in the numbers, as much as I would have loved to write that off (blame my crappy recordkeeping and PayPal’s terrible interface). But I didn’t even go abroad—I headed to Orlando, Los Angeles and New York. $1,194.75 may not be a lot of money to most people, or even most travelers. But for ultra-frugal me, that’s a lot. If I had chosen not to travel, I would have been so much closer to my income goal. All that time lost that I could have spent working. All that prep time that could have been used to solicit more copywriting clients. All that money I could have saved, which would have made my life so much easier. That stays in your head if you’re a freelancer: I was so close. On paper, every one of those trips was for a reason. Orlando was necessary because one of my books involves people attending Universal Studios’ Halloween Horror Nights and I wanted to speak to their experience. A client’s book launch party was taking place in New York. I had an informational interview in Los Angeles. But the truth? I also wanted to see my HHN friends, visit New York, and attend a friend’s wedding in Los Angeles. I just didn’t have the guts to admit that I wanted to travel for the sake of traveling. The sinister part is that if you lie to yourself about why you want to do something, doing it won’t satisfy you. I probably wouldn’t have tacked on the trip to Orlando if my time in Los Angeles had really satisfied me. If I had valued my own enjoyment, been in the moment… maybe that would have saved me money. Why did it have to be all about work? My defense, of course, was that I wanted to exercise my right as a freelancer and write off the trip for taxes. Fine. But how much better would my work have been if I had rested? Could I have produced better art? It would be so easy to blame America’s culture of overworking. I only do something I love when I can write it off for work, so work must be to blame. But it’s not. It’s my own self esteem. I denied myself the real pleasure of travel this year, and I felt incomplete. I strived for more travel to fill the gap. It cost me my income goal. No trips are planned this year, not even for family vacations. I want to see what it’s like to stay close to home. To rest. Then when I’m ready to travel, it’ll be for my own pleasure. Once may finally be enough. Brit McGinnis is a copywriter and author of several books. Her work has appeared on XOJane, SparkNotes and anywhere fine stories are sold. She lives in Portland, Oregon. This article is part of The Billfold’s Tax Series. ", "child": "176_1176_1"}