{"name": "1760", "parent": "", "title": "Racist rants, power and wealth, the Memphis way", "sentences": [{"d089": "Racist rants, power and wealth, the Memphis way"}, {"013a": "UPDATED to correct that the current owners of Memphis Mayor Henry Loeb III are Loeb’s grandnephews, not sons."}, {"22b6": "Some quick context/thoughts about the racist rant recording going around Memphis today, power, property and wealth."}, {"1f84": "Background: A couple who left their phone at a restaurant in Turks and Caicos went on the most batsh*t crazy, racist-a** tirade I’ve heard in a minute. The site that posted the video identified the couple as a Memphis chamber of commerce employee and an executive of a Arkansas tobacco superstore."}, {"1e5f": "“Go back to Africa, nigg*r… where you f*cking belong, nigg*r,” the woman can be heard saying. She actually turns the N-word into a jingle, sing-songing the slur."}, {"0c8d": "“Do you know who you’re talking to?… You f*cked with the wrong people,” the man asks."}, {"8418": "“Thisis actually fun for us, it’s going to be hell for you,” she says. She also threatens to cut the restaurant employee’s throat and calls her a c*nt. (Classy she is.)"}, {"d09c": "I have not independently confirmed that the woman is who Internet sleuths suspect: Lauren Loeb, the granddaughter of former Memphis mayor Henry Loeb III. Lauren is the daughter of Tommy Loeb, one of Henry’s sons. Until last month, Lauren Loeb worked at the Greater Memphis Chamber of Commerce, which issued a “we don’t have nothing to do with not none of this, we promise” statement earlier today."}, {"09af": "An attorney for Lauren Loeb and her husband Joe Marelle said in a statement that the audio is fake. (That Caribbean restaurant employees would go to this length to embarrass this couple seems… Incredible.) H/T WMC-TV Action 5."}, {"27e4": "Loeb Properties said this on Facebook: “Loeb Properties strongly condemns the language and sentiment of the reprehensible recording that has been widely distributed in the press. The individuals involved are in no way associated with Loeb Properties.” Loeb Properties is managed by Bob and Louis Loeb, sons of William Loeb, who is Henry Loeb III’s brother. (Note what the statement doesn’t say: That the audio is fake.)"}, {"3a85": "But I get why observers hear this recording as just the latest example of the racism fueled by unchecked power and wealth — in a majority black city where nearly 50 percent of black children live in poverty compared to 19 percent of white children."}, {"d7e2": "Henry Loeb’s stubborn refusal to negotiate with striking black sanitation workers led Dr. Martin Luther King Jr. to town, where he was assassinated."}, {"6994": "It’s fair to say that if Mayor Loeb, born into a family of millionaires, had negotiated with the sanitation workers, Dr. King would have had no reason to come to Memphis. And that means that nearly 50 years later, Memphis would not labor under the shame of being the city where the dreamer (but not the dream) died."}, {"fa1c": "James Earl Ray fired the bullet, but Loeb gave King a reason to be in Memphis."}, {"c8e1": "The Loeb family businesses"}, {"e360": "The family’s businesses date back to 1887, 24 years after the Emancipation Proclamation."}, {"1a9d": "Mayor Loeb ran laundries (there’s a Loeb Laundry building on Lamar) and his nephews run Loeb Properties. You’ve probably seen their signs all over town. Loeb Properties manages more than 2 million square feet of property in Tennessee and Mississippi."}, {"b1c3": "The Loeb Properties development I’m most familiar with is Overton Square, which has been transformed from a mess into a thriving hub of restaurants and shops. It’s really nice."}, {"285d": "When it reopened, a few businesses, including Bar Louie, put up signs banning people with baggy pants and oversized white T-shirts, which is some racially coded bs. The Square has been aggressive about getting panhandlers out of the area. To my knowledge, only one of the businesses in the Overton Square redevelopment has black ownership. That’s in a city that’s 63 percent black and where black-owned businesses earned less than 1 percent of all business revenue online."}, {"93a6": "Again, I don’t know that Henry Loeb’s granddaughter is the one yelling nigg*r and go back to Africa to some Turks and Caicos restaurant employees."}, {"a15c": "But I do understand why people are drawing straight lines between Mayor Loeb, the family’s wealth (built at least in part underpaid black labor, particularly at their laundries, according to historian Carl Zimring, author of “Clean and White: A History of Environmental Racism in the United States”); the family’s dominance in the only thing that they’re not making any more of (land); real estate developments that, at the least, have a history of being unwelcoming to black people; and the privileged entitlement of whoever this rude-ass, racist woman is on this recording, who may or may not be a Loeb."}, {"8f74": "I’ve offered Bob and Louis Loeb of Loeb Properties (two of Henry Loeb’s grandnephews) an opportunity to add context to this developing story. I’ll update this story if/when they do."}], "content": "Racist rants, power and wealth, the Memphis way UPDATED to correct that the current owners of Memphis Mayor Henry Loeb III are Loeb’s grandnephews, not sons. Some quick context/thoughts about the racist rant recording going around Memphis today, power, property and wealth. Background: A couple who left their phone at a restaurant in Turks and Caicos went on the most batsh*t crazy, racist-a** tirade I’ve heard in a minute. The site that posted the video identified the couple as a Memphis chamber of commerce employee and an executive of a Arkansas tobacco superstore. “Go back to Africa, nigg*r… where you f*cking belong, nigg*r,” the woman can be heard saying. She actually turns the N-word into a jingle, sing-songing the slur. “Do you know who you’re talking to?… You f*cked with the wrong people,” the man asks. “Thisis actually fun for us, it’s going to be hell for you,” she says. She also threatens to cut the restaurant employee’s throat and calls her a c*nt. (Classy she is.) I have not independently confirmed that the woman is who Internet sleuths suspect: Lauren Loeb, the granddaughter of former Memphis mayor Henry Loeb III. Lauren is the daughter of Tommy Loeb, one of Henry’s sons. Until last month, Lauren Loeb worked at the Greater Memphis Chamber of Commerce, which issued a “we don’t have nothing to do with not none of this, we promise” statement earlier today. An attorney for Lauren Loeb and her husband Joe Marelle said in a statement that the audio is fake. (That Caribbean restaurant employees would go to this length to embarrass this couple seems… Incredible.) H/T WMC-TV Action 5. Loeb Properties said this on Facebook: “Loeb Properties strongly condemns the language and sentiment of the reprehensible recording that has been widely distributed in the press. The individuals involved are in no way associated with Loeb Properties.” Loeb Properties is managed by Bob and Louis Loeb, sons of William Loeb, who is Henry Loeb III’s brother. (Note what the statement doesn’t say: That the audio is fake.) But I get why observers hear this recording as just the latest example of the racism fueled by unchecked power and wealth — in a majority black city where nearly 50 percent of black children live in poverty compared to 19 percent of white children. Henry Loeb’s stubborn refusal to negotiate with striking black sanitation workers led Dr. Martin Luther King Jr. to town, where he was assassinated. It’s fair to say that if Mayor Loeb, born into a family of millionaires, had negotiated with the sanitation workers, Dr. King would have had no reason to come to Memphis. And that means that nearly 50 years later, Memphis would not labor under the shame of being the city where the dreamer (but not the dream) died. James Earl Ray fired the bullet, but Loeb gave King a reason to be in Memphis. The Loeb family businesses The family’s businesses date back to 1887, 24 years after the Emancipation Proclamation. Mayor Loeb ran laundries (there’s a Loeb Laundry building on Lamar) and his nephews run Loeb Properties. You’ve probably seen their signs all over town. Loeb Properties manages more than 2 million square feet of property in Tennessee and Mississippi. The Loeb Properties development I’m most familiar with is Overton Square, which has been transformed from a mess into a thriving hub of restaurants and shops. It’s really nice. When it reopened, a few businesses, including Bar Louie, put up signs banning people with baggy pants and oversized white T-shirts, which is some racially coded bs. The Square has been aggressive about getting panhandlers out of the area. To my knowledge, only one of the businesses in the Overton Square redevelopment has black ownership. That’s in a city that’s 63 percent black and where black-owned businesses earned less than 1 percent of all business revenue online. Again, I don’t know that Henry Loeb’s granddaughter is the one yelling nigg*r and go back to Africa to some Turks and Caicos restaurant employees. But I do understand why people are drawing straight lines between Mayor Loeb, the family’s wealth (built at least in part underpaid black labor, particularly at their laundries, according to historian Carl Zimring, author of “Clean and White: A History of Environmental Racism in the United States”); the family’s dominance in the only thing that they’re not making any more of (land); real estate developments that, at the least, have a history of being unwelcoming to black people; and the privileged entitlement of whoever this rude-ass, racist woman is on this recording, who may or may not be a Loeb. I’ve offered Bob and Louis Loeb of Loeb Properties (two of Henry Loeb’s grandnephews) an opportunity to add context to this developing story. I’ll update this story if/when they do. ", "child": "1760_1\t1760_2\t1760_3\t1760_4"}