{"name": "1761", "parent": "", "title": "White shame is the new white pride", "sentences": [{"1c60": "White shame is the new white pride"}, {"d03d": "Penthouse, August 2016"}, {"d20f": "Are you white? Do you have a dick? If your answer to these questions is “Yes”, then you should be checking your privilege."}, {"b29a": "You should be watching what you say. You should be experiencing racial guilt. You should feel responsible for every bad thing that happened in history, because all of it was the fault of folk like you: white dudes."}, {"4300": "White privilege checking is all the rage. In PC circles, you can’t swing a tote bag without hitting 10 white guys checking their privilege and 10 non-white people demanding they do more of it."}, {"7851": "The idea is that if you have white skin and a penis then you won the lottery of life. You’re a lucky bugger, and you must recognise your luckiness, and keep it in check, if you hope to be thought of as a half-way decent person."}, {"f28c": "Some American colleges now pack students off to an annual shindig called “The White Privilege Conference”. Sounds like a riot. Featuring sessions like “Reimagining the Power of our Deepest Knowing in our Racial Justice Work” (you what?), the conference is basically a long weekend of making white blokes feel bad."}, {"c935": "And when it all gets a bit much, conference attendees are offered “safe spaces” in which to “heal and refuel”. Because it’s hard graft taking the mick out of white people."}, {"f50e": "Privilege-checking is creeping off campus and into the mainstream. Macklemore – the pasty-faced rapper from Seattle – has recorded a song called “White Privilege” in which he berates Elvis, Miley and Iggy for stealing black culture. (Dude, you’re a white rapper!)"}, {"84a5": "He raps: “I have an advantage [because] I’m white.” You can picture thousands of pained middle-class white youths, consumed by disgust for the antics of their ancestors, welling up as they sing along to this self-hatin’ ditty."}, {"3a06": "Privilege-checking is basically self-flagellation. Where religious zealots used to wallop their backs with nettles to show God what worthless pieces of crap they were, now white dudes with racial complexes pump out tweets and blogs to show how disgusted they are by whiteness."}, {"95af": "It’s funny, of course. But it’s also nasty. There are three awful things about the fad for privilege-checking."}, {"6e2e": "The first is how it racialises everyday life. In a shocking snub to Martin Luther King – who dreamt of a world where people would be judged by their character, not their skin colour – political correctness demands that we be racially aware all the time."}, {"cfb0": "We’re now meant to measure people’s worth, and the worth of their ideas, by the colour of their skin. You’re white? Then you’re privileged, you’re a problem, and we don’t like what you have to say. It’s an explicit return to the racial politics mankind spent so long trying to escape."}, {"4457": "The second problem is that all the jabber about white privilege is just wrong. It ignores vast class differences. Tell the white blokes who mine coal for a living that they’re privileged."}, {"9d3a": "In the UK, young white men are statistically less likely to go to university than young black men and young white women. There’s something really off when silver-spooned Gender Studies students write off as “privileged” all white blokes – even the ones who unclog their toilets or drive them to conferences about… well, white privilege."}, {"5220": "The third, and worst, thing about white privilege-checking is how it has become a badge of pride worn by PC whites. This is the great irony: white shame is the new white pride."}, {"eb55": "Acknowledging your white privilege, and publicly denouncing it in self-mauling tweets, has become a way of saying “I’m a good white person”. It’s a way of distinguishing yourself from bad whites, from the ignorant, ill-read white blob, which isn’t even aware of the horrors of history and how those horrors helped to make life super-cool for all whites (allegedly)."}, {"830b": "White dudes who check their privilege are really juxtaposing themselves to these Other Whites. It’s a new kind of white nationalism, where good, well-educated whites advertise their superior racial awareness. It’s a modern version of the racial self-distinction of Aryan movements in the past: they were also all about contrasting their decent whiteness with the bad whiteness of the throng, of those stupid whites who had no clue and too many kids."}, {"4151": "And so we have the insanely ironic end result of the PC obsession with whiteness: in making a spectacle of white self-loathing, of good, switched-on, historically aware self-loathing, it has breathed life back into a new and strange white pride. Well done, everyone."}, {"4c9b": "Published in Penthouse in August 2016."}], "content": "White shame is the new white pride Penthouse, August 2016 Are you white? Do you have a dick? If your answer to these questions is “Yes”, then you should be checking your privilege. You should be watching what you say. You should be experiencing racial guilt. You should feel responsible for every bad thing that happened in history, because all of it was the fault of folk like you: white dudes. White privilege checking is all the rage. In PC circles, you can’t swing a tote bag without hitting 10 white guys checking their privilege and 10 non-white people demanding they do more of it. The idea is that if you have white skin and a penis then you won the lottery of life. You’re a lucky bugger, and you must recognise your luckiness, and keep it in check, if you hope to be thought of as a half-way decent person. Some American colleges now pack students off to an annual shindig called “The White Privilege Conference”. Sounds like a riot. Featuring sessions like “Reimagining the Power of our Deepest Knowing in our Racial Justice Work” (you what?), the conference is basically a long weekend of making white blokes feel bad. And when it all gets a bit much, conference attendees are offered “safe spaces” in which to “heal and refuel”. Because it’s hard graft taking the mick out of white people. Privilege-checking is creeping off campus and into the mainstream. Macklemore – the pasty-faced rapper from Seattle – has recorded a song called “White Privilege” in which he berates Elvis, Miley and Iggy for stealing black culture. (Dude, you’re a white rapper!) He raps: “I have an advantage [because] I’m white.” You can picture thousands of pained middle-class white youths, consumed by disgust for the antics of their ancestors, welling up as they sing along to this self-hatin’ ditty. Privilege-checking is basically self-flagellation. Where religious zealots used to wallop their backs with nettles to show God what worthless pieces of crap they were, now white dudes with racial complexes pump out tweets and blogs to show how disgusted they are by whiteness. It’s funny, of course. But it’s also nasty. There are three awful things about the fad for privilege-checking. The first is how it racialises everyday life. In a shocking snub to Martin Luther King – who dreamt of a world where people would be judged by their character, not their skin colour – political correctness demands that we be racially aware all the time. We’re now meant to measure people’s worth, and the worth of their ideas, by the colour of their skin. You’re white? Then you’re privileged, you’re a problem, and we don’t like what you have to say. It’s an explicit return to the racial politics mankind spent so long trying to escape. The second problem is that all the jabber about white privilege is just wrong. It ignores vast class differences. Tell the white blokes who mine coal for a living that they’re privileged. In the UK, young white men are statistically less likely to go to university than young black men and young white women. There’s something really off when silver-spooned Gender Studies students write off as “privileged” all white blokes – even the ones who unclog their toilets or drive them to conferences about… well, white privilege. The third, and worst, thing about white privilege-checking is how it has become a badge of pride worn by PC whites. This is the great irony: white shame is the new white pride. Acknowledging your white privilege, and publicly denouncing it in self-mauling tweets, has become a way of saying “I’m a good white person”. It’s a way of distinguishing yourself from bad whites, from the ignorant, ill-read white blob, which isn’t even aware of the horrors of history and how those horrors helped to make life super-cool for all whites (allegedly). White dudes who check their privilege are really juxtaposing themselves to these Other Whites. It’s a new kind of white nationalism, where good, well-educated whites advertise their superior racial awareness. It’s a modern version of the racial self-distinction of Aryan movements in the past: they were also all about contrasting their decent whiteness with the bad whiteness of the throng, of those stupid whites who had no clue and too many kids. And so we have the insanely ironic end result of the PC obsession with whiteness: in making a spectacle of white self-loathing, of good, switched-on, historically aware self-loathing, it has breathed life back into a new and strange white pride. Well done, everyone. Published in Penthouse in August 2016. ", "child": "1761_1\t1761_2\t1761_3\t1761_4\t1761_5\t1761_6\t1761_7\t1761_8\t1761_9\t1761_10\t1761_11\t1761_12"}