{"name": "1765", "parent": "", "title": "Democrats: Know Which Side You’re On", "sentences": [{"7f3f": "Democrats: Know Which Side You’re On"}, {"46cb": "In light of everything we know about 2016, it’s remarkable the alt-left keeps leveling the charge that “Hillary was a bad candidate.” To be clear, Hillary Clinton did not lose. She lost the election on a Constitutional technicality, but she won the most votes in a landslide. The mandate is unquestionably hers."}, {"7c3e": "She won the nomination by 4 million votes and by every possible measure. She beat Trump by 3 million votes. Hillary got more votes than any presidential candidate in history besides Obama. Sorry but 70,000 white guys in the rust belt don’t negate that."}, {"c96f": "Because that’s what this is really about — making us concede that the white vote counts more than the Obama Coalition, 66 million strong. The alt-left isn’t elevating four random precincts in three swing states out of reverence for the Electoral College. They want to prioritize the preferences of rust belt voters out of a out of a desire to recenter the party on whiteness."}, {"6704": "That’s why they discounts Russian involvement in the election, even in the face of overwhelming evidence. And why they deny the impact of gerrymandering and recently legalized GOP voter suppression tactics."}, {"ef40": "Voter Suppression WorksI’d like to address a cherished, oft-cited talking point: that Democrats lost ~1000 legislative seats over the past…medium.com"}, {"c067": "Thread"}, {"0b9c": "The alt-left must willfully ignore all other factors so they can desperately cling to a narrative that we lost because “Hillary alienated the working class” and clamor for party to refocus away from the Obama Coalition and court Trump voters instead."}, {"c4fd": "They insist a platform of economic populism, universal healthcare, and free college is the only way forward for the Democrats. As I’ve said, this is the wrong takeaway from 2016. (The Right Takeaway from 2016)"}, {"0a90": "The Right Takeaway from 2016As we contemplate the future of the Democratic party, we have to make sure we take the right lessons away from 2016…medium.com"}, {"46b2": "Thread"}, {"1535": "Hillary actually won white rust belt voters driven by the economy. Sadly far more voted out of concerns over immigration and “crime.” And Hillary overperformed far left candidates on the ballot, like Zephyr Teachout and Russ Feingold."}, {"cea4": "Feingold in particular ran a campaign championing progressive issues, economic populism, and campaign finance reform. If Feingold’s message didn’t take hold in lilly white western Wisconsin, it’s hard to imagine it succeeding elsewhere in the midwest."}, {"c8ad": "Single payer healthcare faces a similar challenge. Most already think ACA is socialism — in 2010 a public option was a bridge too far for moderate Democrats. Favorable polling notwithstanding, MfA is going to be a tough sell. Vt’s plan estimated a whopping 9% income tax increase. It didn’t pass."}, {"1593": "Bernie Sanders's Single-Payer Health Care Plan Failed in VermontUTOPIAN FANTASY? When Sen. Bernie Sanders regales his campaign crowds with a portrait of The Way Things Are Going to Be…sallyal.ink"}, {"66b4": "With respect to free college, the questionable talking point “All society benefits when educated people benefit society” (or whatever that dreadfully patronizing line is) probably won’t convince many blue collar workers their taxes should subsidize philosophy degrees for the 1%"}, {"6675": "Now, I personally do not object to these policies. I support them, in the right context. But let’s be honest about who benefits. If we want to push these issues to win over recalcitrant progressives, great. But say that. Don’t argue that moving left will specifically benefit the working class or inspire them to vote Democratic again when it’s unlikely to accomplish either goal."}, {"88ad": "Thread"}, {"ec03": "It’s an inescapable reality of racial justice politics that efforts to advance civil rights are commonly misconstrued as an assault on white culture. White people have long been conditioned to view prosperity as a zero sum game, wherein gains for PoC come at the expense of their own opportunities and economic prospects."}, {"97d3": "It isn’t a pretty sentiment, and well meaning progressives bristle at this characterization, a perceived insult to #NotAllWhitePeople. They scoff indignantly there’s no need to choose, that Democrats can placate rust belt Trump voters and still defend civil rights. Someone with good intentions might assume the goal of dismantling structural racism would be non-controversial."}, {"5692": "But ignoring the data that white people are just as motivated by “identity politics” as other groups is magical thinking. Dismissing the role of racial animus because you pride yourself on believing the best about people only reinforces the status quo and helps the other side prevail. White voters didn’t leave Democratic party bc we refused to give them free college. They left when we stopped centering white people."}, {"4ced": "(As an aside, it has been argued that the alt-left movement is the death throes of the last vestiges of white supremacy in our party.)"}, {"9ef9": "If “all this talk” about race & gender makes white people feel there’s no place for them in the Democratic party, too bad. “Toning it down” is not an option. The choice is not economic populism vs. “identity politics” but whether to keep fighting to advance the rights of minorities, or not."}, {"23bd": "Protecting civil rights is either your guiding philosophy or else it’s just another negotiation point. I have faith Democrats will choose to keep fighting for justice and equality for the party’s female centered, multicultural base."}, {"e7a9": "“Not choosing” is still a decision. Make sure you understand which side you’re on."}, {"d298": "Thread"}, {"751b": "More:"}, {"256b": "Not Choosing is Still a Decision"}, {"7d7e": "The Right Takeaway from 2016"}, {"16ac": "The Question of Unity"}, {"871e": "Voter Suppression Works"}], "content": "Democrats: Know Which Side You’re On In light of everything we know about 2016, it’s remarkable the alt-left keeps leveling the charge that “Hillary was a bad candidate.” To be clear, Hillary Clinton did not lose. She lost the election on a Constitutional technicality, but she won the most votes in a landslide. The mandate is unquestionably hers. She won the nomination by 4 million votes and by every possible measure. She beat Trump by 3 million votes. Hillary got more votes than any presidential candidate in history besides Obama. Sorry but 70,000 white guys in the rust belt don’t negate that. Because that’s what this is really about — making us concede that the white vote counts more than the Obama Coalition, 66 million strong. The alt-left isn’t elevating four random precincts in three swing states out of reverence for the Electoral College. They want to prioritize the preferences of rust belt voters out of a out of a desire to recenter the party on whiteness. That’s why they discounts Russian involvement in the election, even in the face of overwhelming evidence. And why they deny the impact of gerrymandering and recently legalized GOP voter suppression tactics. Voter Suppression WorksI’d like to address a cherished, oft-cited talking point: that Democrats lost ~1000 legislative seats over the past…medium.com Thread The alt-left must willfully ignore all other factors so they can desperately cling to a narrative that we lost because “Hillary alienated the working class” and clamor for party to refocus away from the Obama Coalition and court Trump voters instead. They insist a platform of economic populism, universal healthcare, and free college is the only way forward for the Democrats. As I’ve said, this is the wrong takeaway from 2016. (The Right Takeaway from 2016) The Right Takeaway from 2016As we contemplate the future of the Democratic party, we have to make sure we take the right lessons away from 2016…medium.com Thread Hillary actually won white rust belt voters driven by the economy. Sadly far more voted out of concerns over immigration and “crime.” And Hillary overperformed far left candidates on the ballot, like Zephyr Teachout and Russ Feingold. Feingold in particular ran a campaign championing progressive issues, economic populism, and campaign finance reform. If Feingold’s message didn’t take hold in lilly white western Wisconsin, it’s hard to imagine it succeeding elsewhere in the midwest. Single payer healthcare faces a similar challenge. Most already think ACA is socialism — in 2010 a public option was a bridge too far for moderate Democrats. Favorable polling notwithstanding, MfA is going to be a tough sell. Vt’s plan estimated a whopping 9% income tax increase. It didn’t pass. Bernie Sanders's Single-Payer Health Care Plan Failed in VermontUTOPIAN FANTASY? When Sen. Bernie Sanders regales his campaign crowds with a portrait of The Way Things Are Going to Be…sallyal.ink With respect to free college, the questionable talking point “All society benefits when educated people benefit society” (or whatever that dreadfully patronizing line is) probably won’t convince many blue collar workers their taxes should subsidize philosophy degrees for the 1% Now, I personally do not object to these policies. I support them, in the right context. But let’s be honest about who benefits. If we want to push these issues to win over recalcitrant progressives, great. But say that. Don’t argue that moving left will specifically benefit the working class or inspire them to vote Democratic again when it’s unlikely to accomplish either goal. Thread It’s an inescapable reality of racial justice politics that efforts to advance civil rights are commonly misconstrued as an assault on white culture. White people have long been conditioned to view prosperity as a zero sum game, wherein gains for PoC come at the expense of their own opportunities and economic prospects. It isn’t a pretty sentiment, and well meaning progressives bristle at this characterization, a perceived insult to #NotAllWhitePeople. They scoff indignantly there’s no need to choose, that Democrats can placate rust belt Trump voters and still defend civil rights. Someone with good intentions might assume the goal of dismantling structural racism would be non-controversial. But ignoring the data that white people are just as motivated by “identity politics” as other groups is magical thinking. Dismissing the role of racial animus because you pride yourself on believing the best about people only reinforces the status quo and helps the other side prevail. White voters didn’t leave Democratic party bc we refused to give them free college. They left when we stopped centering white people. (As an aside, it has been argued that the alt-left movement is the death throes of the last vestiges of white supremacy in our party.) If “all this talk” about race & gender makes white people feel there’s no place for them in the Democratic party, too bad. “Toning it down” is not an option. The choice is not economic populism vs. “identity politics” but whether to keep fighting to advance the rights of minorities, or not. Protecting civil rights is either your guiding philosophy or else it’s just another negotiation point. I have faith Democrats will choose to keep fighting for justice and equality for the party’s female centered, multicultural base. “Not choosing” is still a decision. Make sure you understand which side you’re on. Thread More: Not Choosing is Still a Decision The Right Takeaway from 2016 The Question of Unity Voter Suppression Works ", "child": "1765_1\t1765_2\t1765_3\t1765_4\t1765_5\t1765_6\t1765_7\t1765_8\t1765_9\t1765_10\t1765_11"}