{"name": "1770", "parent": "", "title": "Why We Need an Intersectional #Resistance", "sentences": [{"b091": "Why We Need an Intersectional #Resistance"}, {"107d": "Fighting for the rights of groups to which we don’t belong represents a preemptive defense of our own rights."}, {"be88": "Ten days after the election, historian Mark Lilla declared the “end of identity liberalism” in a New York Times op-ed. Trump’s victory, he argued, was due in part to liberals’ “obsession with diversity, [which] has encouraged white, rural, religious Americans to think of themselves as a disadvantaged group whose identity is being threatened or ignored.”"}, {"7bcb": "Lilla wasn’t alone in blaming Hillary Clinton’s loss on identity politics. Two days later, Politico quoted Princeton sociologist Dalton Conley drawing a comparison to “the backlash after the civil rights movement in the form of Nixon.” In a piece titled “Democrats Must Drop Identity Politics,” Froma Harrop asserted that “at a certain point, ‘inclusivity’ takes on the air of exclusivity,” and claimed that “people get confused when ‘Black Lives Matter’ is deemed […] acceptable and ‘All Lives Matter’ […] racist.”"}, {"cd48": "This line of thinking on the left has continued into the Trump presidency. New grassroots groups like the Women’s March and Indivisible haven’t been entirely free from disagreements over the organizations’ relationships to issues like police brutality and trans rights. Some consider these issues tangential and a distraction from the only stated goal that unifies these groups: “resistance.” As one Facebook commenter in a local Indivisible group observed, “The people we need to win back if we ever want to regain the House or the Senate are blue collar whites, and a struggle within the feminist community [that] focuses on racial tensions within that community is not exactly music to their ears.”"}, {"318b": "This view is not only ignorant and offensive; it’s inherently counterproductive to the idea of a successful resistance. The origins of this loosely affiliated movement are fundamentally oppositional — against Trump, against the alt-right, against authoritarianism and the erosion of democracy in America. But a purely oppositional ideology isn’t sustainable in the long run; its existence and ethos depends on the persistence of the very thing it aims to oppose and destroy. This fundamentally reactive stance places adherents on shaky ground. To quote Alexander Hamilton via Lin-Manuel Miranda, “If you stand for nothing, Burr, what’ll you fall for?”"}, {"7b93": "If the most the Resistance is able to achieve is to mitigate the damage of the Trump administration, it will count as a hollow victory. In order to build a truly powerful, influential, and worthwhile movement, we must actively work toward positive change for our country and society, rather than merely reacting and playing defense. Our goal shouldn’t be to return to the status quo ante when Trump leaves office; we should instead find ourselves in a better country with laws, policies, and politicians that more closely resemble a government as we wish it could be."}, {"8ed0": "That ideal government would have the explicit stated goal of providing the highest sustainable quality of life to all of its citizens. In an effort to move closer to this ideal, we must actively resist any and all instances of oppression, inequality, and injustice, whether they take the form of direct attacks from the right, or inaction and spinelessness on the left. We must work to dismantle the systemic racism that allows police to destroy black and brown bodies with impunity. We must stamp out the ingrained sexism that holds back qualified women, perpetuates rape culture, and forgives sexual assault. We must push back against unfettered capitalism, which feeds the tremendous income inequality that continues to be the downfall of whole communities. And that’s just the tip of the iceberg."}, {"c741": "Doubling down on these fights constitutes meaningful and worthwhile resistance against the Trump agenda because the systems that comprise these inequalities and injustices are the same systems that have allowed men like Trump and his ilk to obtain and maintain power. To those who have only ever benefited from these systems (i.e. straight, white, cis men), the idea of equality can feel like oppression — hence the well-meaning but shortsighted pleas of Lilla, Harrop, and the Indivisible Facebook commenter. But human rights are not a zero-sum game, and our efforts would be well spent attempting to compassionately educate more people of this. After all, these fights predate Trump, and even if the Resistance were to eschew so-called identity politics for the next four years, these struggles would remain after his ouster."}, {"2e4c": "What’s more, the Resistance needs the experience and manpower of established groups like Black Lives Matter. The Indivisible movement, to take just one example, is fresh and new and full of energy, but also just a loose association of unaffiliated local groups run by passionate individuals using a common set of resources. It is in the best interest of every local Indivisible chapter to align themselves with the nearest Black Lives Matter group to learn from what their more experienced activist peers have to offer. This mutual support and understanding will help further both groups’ goals — which, as I’ve said, are two sides of the same coin."}, {"c6d4": "Fighting for the rights of groups to which we don’t belong represents a preemptive defense of our own rights. Ultimately, the success or failure of the resistance will depend on how well we are able to fight each others’ battles and unify against the common foe of injustice and oppression — which has the potential to touch every one of us."}, {"70b4": "Right now, that foe has taken the form of Donald Trump, growing white supremacy, and the Republican agenda. But this is a struggle that began long before the 2016 election and will continue long after a new president has moved into the Oval Office. Only a compassionate and intersectional Resistance will survive that long haul."}], "content": "Why We Need an Intersectional #Resistance Fighting for the rights of groups to which we don’t belong represents a preemptive defense of our own rights. Ten days after the election, historian Mark Lilla declared the “end of identity liberalism” in a New York Times op-ed. Trump’s victory, he argued, was due in part to liberals’ “obsession with diversity, [which] has encouraged white, rural, religious Americans to think of themselves as a disadvantaged group whose identity is being threatened or ignored.” Lilla wasn’t alone in blaming Hillary Clinton’s loss on identity politics. Two days later, Politico quoted Princeton sociologist Dalton Conley drawing a comparison to “the backlash after the civil rights movement in the form of Nixon.” In a piece titled “Democrats Must Drop Identity Politics,” Froma Harrop asserted that “at a certain point, ‘inclusivity’ takes on the air of exclusivity,” and claimed that “people get confused when ‘Black Lives Matter’ is deemed […] acceptable and ‘All Lives Matter’ […] racist.” This line of thinking on the left has continued into the Trump presidency. New grassroots groups like the Women’s March and Indivisible haven’t been entirely free from disagreements over the organizations’ relationships to issues like police brutality and trans rights. Some consider these issues tangential and a distraction from the only stated goal that unifies these groups: “resistance.” As one Facebook commenter in a local Indivisible group observed, “The people we need to win back if we ever want to regain the House or the Senate are blue collar whites, and a struggle within the feminist community [that] focuses on racial tensions within that community is not exactly music to their ears.” This view is not only ignorant and offensive; it’s inherently counterproductive to the idea of a successful resistance. The origins of this loosely affiliated movement are fundamentally oppositional — against Trump, against the alt-right, against authoritarianism and the erosion of democracy in America. But a purely oppositional ideology isn’t sustainable in the long run; its existence and ethos depends on the persistence of the very thing it aims to oppose and destroy. This fundamentally reactive stance places adherents on shaky ground. To quote Alexander Hamilton via Lin-Manuel Miranda, “If you stand for nothing, Burr, what’ll you fall for?” If the most the Resistance is able to achieve is to mitigate the damage of the Trump administration, it will count as a hollow victory. In order to build a truly powerful, influential, and worthwhile movement, we must actively work toward positive change for our country and society, rather than merely reacting and playing defense. Our goal shouldn’t be to return to the status quo ante when Trump leaves office; we should instead find ourselves in a better country with laws, policies, and politicians that more closely resemble a government as we wish it could be. That ideal government would have the explicit stated goal of providing the highest sustainable quality of life to all of its citizens. In an effort to move closer to this ideal, we must actively resist any and all instances of oppression, inequality, and injustice, whether they take the form of direct attacks from the right, or inaction and spinelessness on the left. We must work to dismantle the systemic racism that allows police to destroy black and brown bodies with impunity. We must stamp out the ingrained sexism that holds back qualified women, perpetuates rape culture, and forgives sexual assault. We must push back against unfettered capitalism, which feeds the tremendous income inequality that continues to be the downfall of whole communities. And that’s just the tip of the iceberg. Doubling down on these fights constitutes meaningful and worthwhile resistance against the Trump agenda because the systems that comprise these inequalities and injustices are the same systems that have allowed men like Trump and his ilk to obtain and maintain power. To those who have only ever benefited from these systems (i.e. straight, white, cis men), the idea of equality can feel like oppression — hence the well-meaning but shortsighted pleas of Lilla, Harrop, and the Indivisible Facebook commenter. But human rights are not a zero-sum game, and our efforts would be well spent attempting to compassionately educate more people of this. After all, these fights predate Trump, and even if the Resistance were to eschew so-called identity politics for the next four years, these struggles would remain after his ouster. What’s more, the Resistance needs the experience and manpower of established groups like Black Lives Matter. The Indivisible movement, to take just one example, is fresh and new and full of energy, but also just a loose association of unaffiliated local groups run by passionate individuals using a common set of resources. It is in the best interest of every local Indivisible chapter to align themselves with the nearest Black Lives Matter group to learn from what their more experienced activist peers have to offer. This mutual support and understanding will help further both groups’ goals — which, as I’ve said, are two sides of the same coin. Fighting for the rights of groups to which we don’t belong represents a preemptive defense of our own rights. Ultimately, the success or failure of the resistance will depend on how well we are able to fight each others’ battles and unify against the common foe of injustice and oppression — which has the potential to touch every one of us. Right now, that foe has taken the form of Donald Trump, growing white supremacy, and the Republican agenda. But this is a struggle that began long before the 2016 election and will continue long after a new president has moved into the Oval Office. Only a compassionate and intersectional Resistance will survive that long haul. ", "child": "1770_1\t1770_2"}