{"name": "1781", "parent": "", "title": "McInnes Talk Causes Controversy On Campus", "sentences": [{"9e8e": "McInnes Talk Causes Controversy On Campus"}, {"47aa": "In an incendiary move, College Republicans invite writer and actor Gavin McInnes, while across campus College Democrats collect feminine hygiene products for those in need."}, {"b14f": "By Ben Brachfeld, Howard Yeh, Kyla Bills, and Opheli Garcia Lawler"}, {"1753": "Protests, fires, and violence broke out in front of Kimmel Thursday night after NYU College Republicans hosted a talk with Gavin McInnes, founder of the ProudBoy group and co-founder of Vice Media. The night started with a heavy security presence in front of the student center, with at least two cop cars and seven public safety officers patrolling the front of Kimmel and making NYU students show ID cards before entering."}, {"97f5": "Anti-fascist protesters, including NYC Antifa, gathered in Washington Square Park at around 6:30 PM and then moved in front of Kimmel — allegedly, an alt-right group infiltrated the movement throughout Thursday night’s protest."}, {"8091": "The protesters against McInnes, dressed in all black with their faces covered, started chants such as “How do you spell racist? N-Y-P-D.” As the protesters gathered outside of Kimmel at around 6:45 PM, there was a disturbance resulting in multiple arrests. Apparently in response to this, at around 6:50 PM, the cop presence intensified as about ten NYPD vans occupied West 4th Street from Sullivan to LaGuardia."}, {"5494": "As McInnes arrived, his supporters and anti-fascists clashed, as seen in the video below."}, {"0ddd": "Allegedly — and according to McInnes’s Twitter — between his arrival and the beginning of his speech he was, at some point, pepper sprayed by a protester."}, {"30d9": "He started off his speech, which we streamed live on Periscope, with a “joke” about Islam. “I’ve never been pepper sprayed before — it’s a WILD ride!” he said. “Whoa! It’s like getting kicked in the balls, and when I got sprayed, my eyes hurt, …. And then you get the sense of panic like how do I know this isn’t acid, and then you’re like, Oh yeah, this isn’t Islam.”"}, {"89d9": "After McInnes arrived, tensions on the sidewalk were running high. ”McInnes is a fascist, a colonial hegemonist, and an MRA,” said a man named Connor in the crowd. “He’s exactly what’s wrong with this country.” Connor claimed to have been attacked by President Donald Trump and McInnes supporters called ProudBoys, so the protest was especially personal."}, {"a400": "As the speech started upstairs, the front of Kimmel was crowded with anti-fascist protesters and student supporters of the protest. When the crowd blocked the entire sidewalk, the NYPD stepped in. However, the protesters refused to move, resulting in multiple arrests on the sidewalk of Kimmel."}, {"4b2e": "Throughout our coverage of the event, each NYU Local reporter was forcefully handled by the NYPD. This included an elbow to the face, a strong arm to the chest, and a reporter pushed down a block against their will. Don’t worry, we’re all fine. We were also accused of being “them.” We don’t know who “they” are. We just run a blog."}, {"ca46": "Multiple men in Make America Great Again hats attempted to engage protesters and NYU students in “debate.” One of these men, who was agitating a group of protesters on the corner of West 4th and Laguardia, was punched and his hat was stolen. He attempted to take it back and was knocked to the ground. Police entered the crowd and began escorting people off the sidewalk."}, {"ea0d": "After the second wave of arrests outside of Kimmel, the MAGA hat was set on fire. The hat was burning for about thirty seconds before an NYPD officer stomped out the small flame."}, {"6b39": "At this point, police forcibly moved all demonstrators off the sidewalk in front of Kimmel and began a third wave of arrests. Protesters from that point forward were not allowed to congregate in front of Kimmel or on the sidewalk across the street. Several NYPD buses departed containing the arrested protesters."}, {"724b": "ProudBoys gathered outside of the entrance to GCASL complained about the fact that they were barred from the NYU campus despite being on the guest list. The men, who were in their mid-thirties, wore excessive amounts of cologne and thought the anger at a Trump presidency was completely unwarranted. The ProudBoys admitted to knowing the man who attacked Noah Hurowitz, a DNA Info Reporter."}, {"3a83": "The man, who was drunk in the street, yelling “Blue Lives Matter!”and “I am fat!” was identified as Salvatore Cipolla, a ProudBoy. Cipolla aggressively approached Hurowitz and attempted to yank his press credentials off of his body."}, {"540d": "Upstairs, as the interruptions increased, McInnes grew more and more agitated. “You actually come out of this institution stupider,” he said, berating the crowd. “Isn’t that amazing? You’re spending, well your parents are spending, 30K a semester to make you stupider.”"}, {"8cfd": "Also making an appearance at the McInnes speech was Michael Rectenwald, more commonly known as NYU’s “deplorable” professor. Rectenwald is featured on our live video saying “What did you say? Fuck off! You’re a fucking twit!” to a student protester."}, {"a3b3": "After 15 minutes, McInnes confronted NYU spokesperson Marc Wais. “You’re ridiculous, sir,” McInnes said. “You’re a dumb, liberal asshole. You think these people… You don’t want to lose your job so you tell them to sit down… resettle. You know this whole thing is a charade. You fucked up if you think these people are rational human beings… fucking ridiculous.”"}, {"14a0": "Wais did not immediately respond to requests for comment."}, {"5afe": "Jesse Warren, a Trump supporter who attended the event, characterized the protesters as “embarrassments at best and flat out rioters at worst.”"}, {"f448": "“You can’t attack people because they have different opinions,” Warren said. “By that logic, I should be able to punch half of my teachers in the face because they’re socialists. I wouldn’t do that!”"}, {"ab2b": "When asked to defend McInnes’s characterization of actress Jada Pinkett Smith as a monkey, Warren said, “It’s not okay, but he has the right to say it.”"}, {"a05f": "Warren’s interview was cut short when an Antifa protester splashed an unknown liquid in his face. The protester was promptly tackled and zip-tied."}, {"d483": "Meanwhile, on the other side of campus the NYU College Dems collaborated with Voices for Planned Parenthood, a new club on campus, and femmecareny, an initiative by some NYU students, to celebrate female artists, share ideas for activism, and collect feminine hygiene products to be donated to a local women’s homeless shelter."}, {"e7e8": "“It was a great event despite the College Republicans’ ongoing efforts to bring the most toxic individuals they can find onto campus, with no justification other than to stir controversy,” Micheal DeLuca, president of the NYU Dems said in a message Thursday night. “It is their right to bring whatever guests they like if they don’t pose safety concerns, but they ought to justify their choices. Controversy for controversy’s sake is deconstructive, so they should start engaging seriously or explain how guests like McInnes and Milo [Yiannopoulos] reflect their values.”"}, {"8f55": "An earlier version of this article misidentified Salvatore Cipolla as Salvador Cipolla."}], "content": "McInnes Talk Causes Controversy On Campus In an incendiary move, College Republicans invite writer and actor Gavin McInnes, while across campus College Democrats collect feminine hygiene products for those in need. By Ben Brachfeld, Howard Yeh, Kyla Bills, and Opheli Garcia Lawler Protests, fires, and violence broke out in front of Kimmel Thursday night after NYU College Republicans hosted a talk with Gavin McInnes, founder of the ProudBoy group and co-founder of Vice Media. The night started with a heavy security presence in front of the student center, with at least two cop cars and seven public safety officers patrolling the front of Kimmel and making NYU students show ID cards before entering. Anti-fascist protesters, including NYC Antifa, gathered in Washington Square Park at around 6:30 PM and then moved in front of Kimmel — allegedly, an alt-right group infiltrated the movement throughout Thursday night’s protest. The protesters against McInnes, dressed in all black with their faces covered, started chants such as “How do you spell racist? N-Y-P-D.” As the protesters gathered outside of Kimmel at around 6:45 PM, there was a disturbance resulting in multiple arrests. Apparently in response to this, at around 6:50 PM, the cop presence intensified as about ten NYPD vans occupied West 4th Street from Sullivan to LaGuardia. As McInnes arrived, his supporters and anti-fascists clashed, as seen in the video below. Allegedly — and according to McInnes’s Twitter — between his arrival and the beginning of his speech he was, at some point, pepper sprayed by a protester. He started off his speech, which we streamed live on Periscope, with a “joke” about Islam. “I’ve never been pepper sprayed before — it’s a WILD ride!” he said. “Whoa! It’s like getting kicked in the balls, and when I got sprayed, my eyes hurt, …. And then you get the sense of panic like how do I know this isn’t acid, and then you’re like, Oh yeah, this isn’t Islam.” After McInnes arrived, tensions on the sidewalk were running high. ”McInnes is a fascist, a colonial hegemonist, and an MRA,” said a man named Connor in the crowd. “He’s exactly what’s wrong with this country.” Connor claimed to have been attacked by President Donald Trump and McInnes supporters called ProudBoys, so the protest was especially personal. As the speech started upstairs, the front of Kimmel was crowded with anti-fascist protesters and student supporters of the protest. When the crowd blocked the entire sidewalk, the NYPD stepped in. However, the protesters refused to move, resulting in multiple arrests on the sidewalk of Kimmel. Throughout our coverage of the event, each NYU Local reporter was forcefully handled by the NYPD. This included an elbow to the face, a strong arm to the chest, and a reporter pushed down a block against their will. Don’t worry, we’re all fine. We were also accused of being “them.” We don’t know who “they” are. We just run a blog. Multiple men in Make America Great Again hats attempted to engage protesters and NYU students in “debate.” One of these men, who was agitating a group of protesters on the corner of West 4th and Laguardia, was punched and his hat was stolen. He attempted to take it back and was knocked to the ground. Police entered the crowd and began escorting people off the sidewalk. After the second wave of arrests outside of Kimmel, the MAGA hat was set on fire. The hat was burning for about thirty seconds before an NYPD officer stomped out the small flame. At this point, police forcibly moved all demonstrators off the sidewalk in front of Kimmel and began a third wave of arrests. Protesters from that point forward were not allowed to congregate in front of Kimmel or on the sidewalk across the street. Several NYPD buses departed containing the arrested protesters. ProudBoys gathered outside of the entrance to GCASL complained about the fact that they were barred from the NYU campus despite being on the guest list. The men, who were in their mid-thirties, wore excessive amounts of cologne and thought the anger at a Trump presidency was completely unwarranted. The ProudBoys admitted to knowing the man who attacked Noah Hurowitz, a DNA Info Reporter. The man, who was drunk in the street, yelling “Blue Lives Matter!”and “I am fat!” was identified as Salvatore Cipolla, a ProudBoy. Cipolla aggressively approached Hurowitz and attempted to yank his press credentials off of his body. Upstairs, as the interruptions increased, McInnes grew more and more agitated. “You actually come out of this institution stupider,” he said, berating the crowd. “Isn’t that amazing? You’re spending, well your parents are spending, 30K a semester to make you stupider.” Also making an appearance at the McInnes speech was Michael Rectenwald, more commonly known as NYU’s “deplorable” professor. Rectenwald is featured on our live video saying “What did you say? Fuck off! You’re a fucking twit!” to a student protester. After 15 minutes, McInnes confronted NYU spokesperson Marc Wais. “You’re ridiculous, sir,” McInnes said. “You’re a dumb, liberal asshole. You think these people… You don’t want to lose your job so you tell them to sit down… resettle. You know this whole thing is a charade. You fucked up if you think these people are rational human beings… fucking ridiculous.” Wais did not immediately respond to requests for comment. Jesse Warren, a Trump supporter who attended the event, characterized the protesters as “embarrassments at best and flat out rioters at worst.” “You can’t attack people because they have different opinions,” Warren said. “By that logic, I should be able to punch half of my teachers in the face because they’re socialists. I wouldn’t do that!” When asked to defend McInnes’s characterization of actress Jada Pinkett Smith as a monkey, Warren said, “It’s not okay, but he has the right to say it.” Warren’s interview was cut short when an Antifa protester splashed an unknown liquid in his face. The protester was promptly tackled and zip-tied. Meanwhile, on the other side of campus the NYU College Dems collaborated with Voices for Planned Parenthood, a new club on campus, and femmecareny, an initiative by some NYU students, to celebrate female artists, share ideas for activism, and collect feminine hygiene products to be donated to a local women’s homeless shelter. “It was a great event despite the College Republicans’ ongoing efforts to bring the most toxic individuals they can find onto campus, with no justification other than to stir controversy,” Micheal DeLuca, president of the NYU Dems said in a message Thursday night. “It is their right to bring whatever guests they like if they don’t pose safety concerns, but they ought to justify their choices. Controversy for controversy’s sake is deconstructive, so they should start engaging seriously or explain how guests like McInnes and Milo [Yiannopoulos] reflect their values.” An earlier version of this article misidentified Salvatore Cipolla as Salvador Cipolla. ", "child": "1781_1"}