{"name": "1782", "parent": "", "title": "What Is the Antifa Movement And Why Were They At NYU?", "sentences": [{"5ce4": "What Is the Antifa Movement And Why Were They At NYU?"}, {"eb3b": "As NYU students gathered to protest the College Republican’s meeting with Gavin McInnes Thursday night, many were surprised by the appearance of members of the anti-fascist (antifa) movement. The NYU Anti-Fascists, a new NYU group that has since been kicked off Facebook, disrupted the talk from within the Rosenthal Pavilion. Outside, the non-NYU antifas — who were presumably part of NYC Antifa, as they tweeted they were going to disrupt the event — clashed with Trump and McInnes supporters and police officers."}, {"5cfd": "While their appearance at NYU was new, antifa protesters and protests have a long history. The movement was born as fascism spread across Europe in the early 20th century. Although each specific anti-fascist movement is different, a core tenet of each is the refusal to give a platform to fascists."}, {"4799": "In a statement in December about a boycott of the Brooklyn Commons, NYC Antifa wrote, “NYC Antifa has always supported the use of boycotts to make it clear that spaces which host racist, fascist, and bigoted speakers will not be tolerated in our city.”"}, {"a311": "Earlier this year, NYC Antifa described their platform:"}, {"c785": "Antifa combines radical left-wing and anarchist politics, revulsion at racists, sexists, homophobes, anti-Semites, and Islamophobes, with the international anti-fascist culture of taking the streets and physically confronting the brownshirts of white supremacy, whoever they may be."}, {"ce34": "Their opinion is that, as fascism is an inherently violent ideology, it has to be met with physical confrontation, not just with things like petitions and peaceful marches. “We don’t think it’s useful to rehash the same old [violence versus non-violence] arguments,” NYC Antifa wrote in a conversation with The Nation. “If Trump tries to register Muslims and engage in mass deportations, a Change.org petition is not going to stop it.”"}, {"4616": "Along with physical confrontation, antifa groups commonly dox Neo-Nazis and fascists who are granted anonymity on the internet."}, {"697a": "In recent weeks, members of the antifa movement have been in the news for their Inauguration Day disruption — which led to the arrest of more than 200 protesters and quite a few journalists — and their disruption and the subsequent cancellation of the Milo Yiannapolous event at Berkeley."}], "content": "What Is the Antifa Movement And Why Were They At NYU? As NYU students gathered to protest the College Republican’s meeting with Gavin McInnes Thursday night, many were surprised by the appearance of members of the anti-fascist (antifa) movement. The NYU Anti-Fascists, a new NYU group that has since been kicked off Facebook, disrupted the talk from within the Rosenthal Pavilion. Outside, the non-NYU antifas — who were presumably part of NYC Antifa, as they tweeted they were going to disrupt the event — clashed with Trump and McInnes supporters and police officers. While their appearance at NYU was new, antifa protesters and protests have a long history. The movement was born as fascism spread across Europe in the early 20th century. Although each specific anti-fascist movement is different, a core tenet of each is the refusal to give a platform to fascists. In a statement in December about a boycott of the Brooklyn Commons, NYC Antifa wrote, “NYC Antifa has always supported the use of boycotts to make it clear that spaces which host racist, fascist, and bigoted speakers will not be tolerated in our city.” Earlier this year, NYC Antifa described their platform: Antifa combines radical left-wing and anarchist politics, revulsion at racists, sexists, homophobes, anti-Semites, and Islamophobes, with the international anti-fascist culture of taking the streets and physically confronting the brownshirts of white supremacy, whoever they may be. Their opinion is that, as fascism is an inherently violent ideology, it has to be met with physical confrontation, not just with things like petitions and peaceful marches. “We don’t think it’s useful to rehash the same old [violence versus non-violence] arguments,” NYC Antifa wrote in a conversation with The Nation. “If Trump tries to register Muslims and engage in mass deportations, a Change.org petition is not going to stop it.” Along with physical confrontation, antifa groups commonly dox Neo-Nazis and fascists who are granted anonymity on the internet. In recent weeks, members of the antifa movement have been in the news for their Inauguration Day disruption — which led to the arrest of more than 200 protesters and quite a few journalists — and their disruption and the subsequent cancellation of the Milo Yiannapolous event at Berkeley. ", "child": "1782_1\t1782_2\t1782_3\t1782_4"}