{"name": "179", "parent": "", "title": "Devenir freelance, quel statut choisir ?", "sentences": [{"5f4f": "Devenir freelance, quel statut choisir ?"}, {"1673": "En tant que COO de Hopwork, j’ai pu échanger avec de nombreux indépendants et je commence à connaître quelques tuyaux pour se lancer ;) Pour ceux qui ne connaissent pas, Hopwork est la plateforme de référence en France pour les freelances du digital. Elle permet aux entreprises et aux freelances de se rencontrer et de travailler ensemble en toute sécurité, sans se soucier des paiements et de l’administratif."}, {"0670": "Chez Hopwork nous rencontrons tous les jours des freelances (développeurs, graphistes, consultants marketing & communication…), et nous essayons répondre à toutes leurs questions, notamment sur le choix de leur statut juridique. En effet en France (95% des freelances inscrits sur Hopwork.fr sont en France) il est obligatoire d’avoir un statut pour facturer des prestations, et entre EURL, SASU, EIRL, EI, Auto entrepreneur (maintenant micro entrepreneur), on s’y perd un peu."}, {"25fc": "Je me suis donc mis à la place d’un aspirant freelance, me plongeant dans les méandres de l’administration française pour mieux comprendre les spécificités de chaque statut. Ne souffrant pas de phobie administrative je pensais faire le tour de la question assez rapidement…"}, {"c6b4": "Après avoir consulté quelques sites …"}, {"817a": "J’ai eu peur :) Impossible d’avoir les mêmes chiffres d’une source à l’autre, avalanche de termes obscurs (IR/IS, responsabilité limitée, RSI, cotisations sociales, régime micro fiscal, CRG / CRDS). Donc avec Lucie ma brillante stagiaire nous avons décidé de faire une petite synthèse des différentes options qui s’offrent aux freelances. Il y a quelques exemples chiffrés en fin d’article, et nous mettrons prochainement en ligne sur Hopwork une calculatrice de revenu."}, {"53c2": "/!\\ Attention ces conseils s’adressent aux freelances prestataires de service dont l’activité professionnelle principale est une activité de conseil / service qu’ils exercent seuls. Ces informations et taux de cotisations ne seront donc pas valables pour les commerçants, les professions libérales, ou les groupements et coopératives de freelances."}, {"371a": "Au delà de 33K de CA il n’y a pas de choix évident, tout est une question de priorités personnelles :"}, {"6661": "L’arbre de décision de l’équipe Hopwork"}, {"871b": "Pour faire simple, si vous faites moins de 33 100€ de CA par an nous vous conseillons de rester micro entrepreneur (c’est simple et les avantages fiscaux sont imbattables, le plafond vient d’être remonté de 32 900€ à 33 100€). Ensuite, si votre activité se développe, nous vous conseillons de choisir entre la SASU (Société par Actions Simplifiée) ou l’EURL (Société Anonyme a Responsabilité Limitée) en fonction de vos priorités : rester au régime général de la sécurité sociale (c’est notamment le cas des personnes qui ont toujours été inscrites à ce régime et qui prendront leur retraite dans une dizaine d’années) ou bien gagner plus . En effet en tant que dirigeant d’une SASU vous êtes comme un salarié, ce qui signifie que vous n’êtes pas affilié au régime des indépendants (RSI). La contrepartie à cela est un taux de cotisation sociale sur votre salaire plus élevé qu’en EURL comme vous le verrez dans les simulations en fin d’article."}, {"b5fa": "Tout est une question de choix : plus de revenus ou plus de sécurité"}, {"905d": "Et pourquoi pas l’entreprise individuelle classique (EI) ?"}, {"49fd": "Il est vrai que l’entreprise individuelle classique nécessite peu de formalités de gestion, pas de publication des résultats et surtout des coûts de création faibles voire inexistants. Cependant le taux de cotisation sociale est plus élevé qu’en EURL (entre 40% et 45% vs 32% à 38% pour l’EURL). De plus en EI il n’est pas possible de séparer sa rémunération des bénéfices de la société, donc"}, {"0b42": "Avec une société mettez du revenu de côté pour faire un break"}, {"7607": "l’EI est donc recommandée dans trois cas (i) si vous ne savez pas combien de temps vous allez rester freelance (pas de frais de création et de fermeture) ou (ii) si votre situation fiscale est avantageuse (marié ou enfants pour ne pas atteindre les tranches les plus élevées de l’impôt) ou (iii) si vous ne facturez que de la production artistique."}, {"3a17": "[EDIT : plusieurs remarques et questions intéressantes ont été posées concernant l’EIRL et les cas particuliers des artistes (Maison des Artistes, AGESSA)."}, {"4961": "En tant que freelance comme je le mentionne plus haut les investissements sont peu élevés, il y a dont peu de risque de contracter des dettes importantes, donc finalement la différence entre EI et EIRL est nulle. Ce qui va donc distinguer l’EIRL de l’EURL in fine sera un taux de cotisation plus élevé en EIRL, mais des frais de création moins important. Donc si vous comptez rester freelance un moment, préférez l’EURL, vous pourrez en plus optimiser votre fiscalité d’une année sur l’autre. Si c’est temporaire ou “pour tester”, préférez l’EIRL."}, {"bc77": "Concernant la MDA et l’AGESSA, ce ne sont pas des statuts juridiques, ce sont des régimes sociaux, si vous êtes MDA ou AGESSA (et même profession libérale), votre structure est… une Entreprise Individuelle ! En revanche qui dit régime social particulier dit cotisation sociales particulières. C’est environ 15% à 20% de vos bénéfices pour la MDA, ce qui est donc moins élevé que les 32% à 38% de l’EURL. C’est donc moins cher, mais vous ne pourrez pas facturer autre chose que de la production artistique (pas de conseil donc) et vous devrez fonctionner avec le pré compte la première année, un casse tête pour vos clients. Nous écrirons un autre article dédiés aux artistes, c’est un vrai sujet, en attendant vous trouverez des réponses par ici]"}, {"e08d": "Le match SASU vs EURL"}, {"0d28": "Votre activité se développe ? Votre chiffre d’affaires dépasse le seuil des 33 100€ ? Vous voulez avoir l’opportunité d’élargir votre activité à d’autres collaborateurs ? Il s’agit de choisir entre la SASU et l’EURL."}, {"e6bf": "Dans les deux cas vous allez constituer une société, votre Chiffre d’Affaires devra être divisé entre « le coût de votre rémunération » (salaire net + cotisations sociales) et ce que vous allez conserver comme « bénéfices » (et vous verser peut-être en dividendes). L’un et l’autre ne sont pas soumis aux mêmes impôts et cotisations sociales pour chaque statut, il en résulte donc des « stratégies » différentes d’allocation de vos revenus."}, {"8fa9": "Par ailleurs les taxes sur les bénéfices en EURL sont plus élevées que les cotisations sur la rémunération en SASU, elles même plus élevées que les cotisations en EURL, elle même plus élevées que les taxes sur les bénéfices en SASU. Dans l’ordre du moins taxé (1) au plus taxé (4) :"}, {"83c3": "Les taxes sur les bénéfices et dividendes en SASU sont peu élevées"}, {"5281": "Donc si vous voulez maximiser votre revenu, le mieux est de ne pas se verser de salaire et d’être entièrement imposé sur les bénéfices et les dividendes en tant que SASU. Mais cela implique de ne toucher ses revenus qu’au moment de verser des dividendes, soit une fois par an… Ce qui n’est évidemment pas possible si le freelancing est votre activité principale et que vous devez avoir des revenus chaque mois."}, {"fa04": "Vous cherchez à maximiser vos revenus : choisissez l’EURL !"}, {"81c3": "En EURL, vous êtes au RSI, les cotisations sociales sur la rémunération du dirigeant sont moins importantes qu’en SASU. Ainsi, pour maximiser vos revenus mensuels, l’EURL peut être plus intéressante."}, {"60d3": "Et comme TD + IS > CS (les cotisations sociales sont inférieures à l’impôt sur les sociétés et les taxes sur les dividendes) :"}, {"4cad": "en EURL il vaut mieux vous verser un salaire maximum et garder une réserve de bénéfices minimum"}, {"13a3": "La réserve de bénéfice ne doit pas être nulle, elle pourrait servir par exemple pour éviter de passer une tranche supérieure d’imposition sur le revenu, en cas de coup dur, ou tout simplement pour faire un break de quelques mois."}, {"a08b": "Vous souhaitez être assimilé salarié : le choix de la SASU s’impose !"}, {"35d0": "Si vous avez été salarié avant d’être indépendant, la SASU vous permet de rester au régime général de la sécurité sociale et de continuer à cotiser normalement comme un salarié pour votre retraite. En conséquence les cotisations sociales sur votre rémunération de dirigeant seront plus élevées qu’en EURL. Pour la SASU, la relation est inversée CS > TD + IS. Les cotisations sociales sur votre salaire seront toujours supérieures à l’impôt sur les sociétés (en SASU, il n’y a pas de cotisations sociales sur les dividendes !)"}, {"7977": "en SASU vous gagnerez à vous verser un salaire minimum et des dividendes maximum"}, {"a1f6": "Les relations entre les freelances et le RSI ne sont pas toujours au beau fixe"}, {"3b85": "Quelques exemples concrets"}, {"f6de": "Avec Lucie nous avons créé des simulateurs de revenus pour les deux statuts, ils seront bientôt en ligne sur Hopwork ;) Ces simulations sont basiques et nous ne sommes pas un cabinet d’experts comptables. Si vous souhaitez avoir des simulations sur mesure et propres à votre situation, nous travaillons avec le net expert comptable que vous pouvez contacter directement ici."}, {"66f3": "Pour notre exemple nous avons pris un développeur qui facture 400€ par jour et qui travaille 18 jours par mois en moyenne (20 jours de congés, 3 jours de maladie, 12 jours d’inter contrat par an) cela fait 86 400€ facturés dans l’année. Considérons également qu’il y aura environ 6 000€ de frais annuels (moyenne observée auprès des freelances avec qui nous échangeons au quotidien)"}, {"3e18": "En SASU on visera un salaire “minimal” de 2 500€ par mois soit 30 000€ annuel de salaire net. Le taux de cotisation sociale étant de 73% avec ce niveau de revenu, cela fait 22 000€ de cotisations sociales. Le coût du salaire sera donc 52 000€. Avec les 6 000€ de frais il restera donc 28 400€ de bénéfices, qui deviendront 20 400€ de revenus net après impôts sur les sociétés et taxes sur les dividendes."}, {"1559": "Un total donc de 50 400€ de revenus annuels nets, soit 58% du chiffre d’affaires facturé"}, {"b039": "En EURL on visera un salaire “maximum” de 4 800€ par mois soit 57 600€ annuel de salaire. Le taux de cotisation sociale étant de 36% cela fait 20 500€. Le coût du salaire sera donc 78 100€. Avec les 6 000€ de frais il restera donc 2 200€ de bénéfices, qui deviendront 1 200€ de revenu des dividendes après impôts sur les sociétés et taxes sur les dividendes."}, {"0368": "Un total donc de 58 800€ de revenus annuels, soit 68% du chiffre d’affaires facturé"}, {"0bdc": "C’est donc financièrement plus avantageux de rester en EURL, vous gagnez environ 17% de plus (avant impôts sur le revenu)."}, {"cab3": "Notre synthèse"}, {"122c": "Partagez ce tableau de synthèse avec vos amis futurs freelances !"}, {"70ef": "Et le portage salarial dans tout ça ?"}, {"9ddd": "Le portage salarial est une option qui peut apporter un peu plus de sécurité mais qui coûte également plus cher. De plus en portage vous êtes comme un salarié, donc il n’est pas possible de mettre certaines dépenses en frais (une partie de votre loyer, un ordinateur de compétition etc.)"}, {"63e5": "Nous avons fait des simulations. la commission typique d’une société de portage est d’environ 5%, et il faut aussi compter environ 43% de charges patronales et salariales. Cela signifie qu’avec 86 400€ facturés vous touchez 44 600€ en salaire net. A cela vous déduisez environ 3000€ de frais (nous comptons moins de frais ici qu’en EURL ou SASU car vous n’avez par exemple pas besoin d’assurance RC pro ou de comptable…)"}, {"32b1": "Au final cela fait 41 600€ dans votre poche, soit 48% du chiffre d’affaires facturé."}, {"98ac": "Vous gagnez donc 41% de plus en EURL qu’en portage salarial (58 800€ vs 41 600€)"}, {"4086": "C’est beaucoup, mais la protection n’est pas la même, en portage salarial, vous cotisez au chômage ! Vous pouvez donc rompre votre contrat avec votre société de portage en cas de perte prolongée d’activité pour être indemnisé par l’assurance chômage."}, {"97f7": "Pour aller plus loin"}, {"6360": "On espère que cet article à pu éclaircir certains concepts et vous a aidé dans votre choix de statut. Se lancer en freelance est une aventure passionnante alors bravo et bonne chance ;) Si vous avez décidé de sauter le pas c’est par ici pour créer un profil sur Hopwork."}, {"6afb": "N’hésitez pas à partager cet article et à contacter notre équipe (community@hopwork.com) si vous avez des questions ou des suggestions pour l’améliorer. Vous pouvez aussi consulter la liste de nos événements pour retrouver les dates des ateliers compta, juridique, et bien sûr les dates des prochains hopdrinks dans toutes les villes de France."}, {"7cec": "Merci à toutes les personnes qui m’ont aidées dans la rédaction de l’article Lucie, Jean-Baptiste, Loic, Jean Baptiste Jacob, Pierre, Olivier et Johan"}], "content": "Devenir freelance, quel statut choisir ? En tant que COO de Hopwork, j’ai pu échanger avec de nombreux indépendants et je commence à connaître quelques tuyaux pour se lancer ;) Pour ceux qui ne connaissent pas, Hopwork est la plateforme de référence en France pour les freelances du digital. Elle permet aux entreprises et aux freelances de se rencontrer et de travailler ensemble en toute sécurité, sans se soucier des paiements et de l’administratif. Chez Hopwork nous rencontrons tous les jours des freelances (développeurs, graphistes, consultants marketing & communication…), et nous essayons répondre à toutes leurs questions, notamment sur le choix de leur statut juridique. En effet en France (95% des freelances inscrits sur Hopwork.fr sont en France) il est obligatoire d’avoir un statut pour facturer des prestations, et entre EURL, SASU, EIRL, EI, Auto entrepreneur (maintenant micro entrepreneur), on s’y perd un peu. Je me suis donc mis à la place d’un aspirant freelance, me plongeant dans les méandres de l’administration française pour mieux comprendre les spécificités de chaque statut. Ne souffrant pas de phobie administrative je pensais faire le tour de la question assez rapidement… Après avoir consulté quelques sites … J’ai eu peur :) Impossible d’avoir les mêmes chiffres d’une source à l’autre, avalanche de termes obscurs (IR/IS, responsabilité limitée, RSI, cotisations sociales, régime micro fiscal, CRG / CRDS). Donc avec Lucie ma brillante stagiaire nous avons décidé de faire une petite synthèse des différentes options qui s’offrent aux freelances. Il y a quelques exemples chiffrés en fin d’article, et nous mettrons prochainement en ligne sur Hopwork une calculatrice de revenu. /!\\ Attention ces conseils s’adressent aux freelances prestataires de service dont l’activité professionnelle principale est une activité de conseil / service qu’ils exercent seuls. Ces informations et taux de cotisations ne seront donc pas valables pour les commerçants, les professions libérales, ou les groupements et coopératives de freelances. Au delà de 33K de CA il n’y a pas de choix évident, tout est une question de priorités personnelles : L’arbre de décision de l’équipe Hopwork Pour faire simple, si vous faites moins de 33 100€ de CA par an nous vous conseillons de rester micro entrepreneur (c’est simple et les avantages fiscaux sont imbattables, le plafond vient d’être remonté de 32 900€ à 33 100€). Ensuite, si votre activité se développe, nous vous conseillons de choisir entre la SASU (Société par Actions Simplifiée) ou l’EURL (Société Anonyme a Responsabilité Limitée) en fonction de vos priorités : rester au régime général de la sécurité sociale (c’est notamment le cas des personnes qui ont toujours été inscrites à ce régime et qui prendront leur retraite dans une dizaine d’années) ou bien gagner plus . En effet en tant que dirigeant d’une SASU vous êtes comme un salarié, ce qui signifie que vous n’êtes pas affilié au régime des indépendants (RSI). La contrepartie à cela est un taux de cotisation sociale sur votre salaire plus élevé qu’en EURL comme vous le verrez dans les simulations en fin d’article. Tout est une question de choix : plus de revenus ou plus de sécurité Et pourquoi pas l’entreprise individuelle classique (EI) ? Il est vrai que l’entreprise individuelle classique nécessite peu de formalités de gestion, pas de publication des résultats et surtout des coûts de création faibles voire inexistants. Cependant le taux de cotisation sociale est plus élevé qu’en EURL (entre 40% et 45% vs 32% à 38% pour l’EURL). De plus en EI il n’est pas possible de séparer sa rémunération des bénéfices de la société, donc Avec une société mettez du revenu de côté pour faire un break l’EI est donc recommandée dans trois cas (i) si vous ne savez pas combien de temps vous allez rester freelance (pas de frais de création et de fermeture) ou (ii) si votre situation fiscale est avantageuse (marié ou enfants pour ne pas atteindre les tranches les plus élevées de l’impôt) ou (iii) si vous ne facturez que de la production artistique. [EDIT : plusieurs remarques et questions intéressantes ont été posées concernant l’EIRL et les cas particuliers des artistes (Maison des Artistes, AGESSA). En tant que freelance comme je le mentionne plus haut les investissements sont peu élevés, il y a dont peu de risque de contracter des dettes importantes, donc finalement la différence entre EI et EIRL est nulle. Ce qui va donc distinguer l’EIRL de l’EURL in fine sera un taux de cotisation plus élevé en EIRL, mais des frais de création moins important. Donc si vous comptez rester freelance un moment, préférez l’EURL, vous pourrez en plus optimiser votre fiscalité d’une année sur l’autre. Si c’est temporaire ou “pour tester”, préférez l’EIRL. Concernant la MDA et l’AGESSA, ce ne sont pas des statuts juridiques, ce sont des régimes sociaux, si vous êtes MDA ou AGESSA (et même profession libérale), votre structure est… une Entreprise Individuelle ! En revanche qui dit régime social particulier dit cotisation sociales particulières. C’est environ 15% à 20% de vos bénéfices pour la MDA, ce qui est donc moins élevé que les 32% à 38% de l’EURL. C’est donc moins cher, mais vous ne pourrez pas facturer autre chose que de la production artistique (pas de conseil donc) et vous devrez fonctionner avec le pré compte la première année, un casse tête pour vos clients. Nous écrirons un autre article dédiés aux artistes, c’est un vrai sujet, en attendant vous trouverez des réponses par ici] Le match SASU vs EURL Votre activité se développe ? Votre chiffre d’affaires dépasse le seuil des 33 100€ ? Vous voulez avoir l’opportunité d’élargir votre activité à d’autres collaborateurs ? Il s’agit de choisir entre la SASU et l’EURL. Dans les deux cas vous allez constituer une société, votre Chiffre d’Affaires devra être divisé entre « le coût de votre rémunération » (salaire net + cotisations sociales) et ce que vous allez conserver comme « bénéfices » (et vous verser peut-être en dividendes). L’un et l’autre ne sont pas soumis aux mêmes impôts et cotisations sociales pour chaque statut, il en résulte donc des « stratégies » différentes d’allocation de vos revenus. Par ailleurs les taxes sur les bénéfices en EURL sont plus élevées que les cotisations sur la rémunération en SASU, elles même plus élevées que les cotisations en EURL, elle même plus élevées que les taxes sur les bénéfices en SASU. Dans l’ordre du moins taxé (1) au plus taxé (4) : Les taxes sur les bénéfices et dividendes en SASU sont peu élevées Donc si vous voulez maximiser votre revenu, le mieux est de ne pas se verser de salaire et d’être entièrement imposé sur les bénéfices et les dividendes en tant que SASU. Mais cela implique de ne toucher ses revenus qu’au moment de verser des dividendes, soit une fois par an… Ce qui n’est évidemment pas possible si le freelancing est votre activité principale et que vous devez avoir des revenus chaque mois. Vous cherchez à maximiser vos revenus : choisissez l’EURL ! En EURL, vous êtes au RSI, les cotisations sociales sur la rémunération du dirigeant sont moins importantes qu’en SASU. Ainsi, pour maximiser vos revenus mensuels, l’EURL peut être plus intéressante. Et comme TD + IS > CS (les cotisations sociales sont inférieures à l’impôt sur les sociétés et les taxes sur les dividendes) : en EURL il vaut mieux vous verser un salaire maximum et garder une réserve de bénéfices minimum La réserve de bénéfice ne doit pas être nulle, elle pourrait servir par exemple pour éviter de passer une tranche supérieure d’imposition sur le revenu, en cas de coup dur, ou tout simplement pour faire un break de quelques mois. Vous souhaitez être assimilé salarié : le choix de la SASU s’impose ! Si vous avez été salarié avant d’être indépendant, la SASU vous permet de rester au régime général de la sécurité sociale et de continuer à cotiser normalement comme un salarié pour votre retraite. En conséquence les cotisations sociales sur votre rémunération de dirigeant seront plus élevées qu’en EURL. Pour la SASU, la relation est inversée CS > TD + IS. Les cotisations sociales sur votre salaire seront toujours supérieures à l’impôt sur les sociétés (en SASU, il n’y a pas de cotisations sociales sur les dividendes !) en SASU vous gagnerez à vous verser un salaire minimum et des dividendes maximum Les relations entre les freelances et le RSI ne sont pas toujours au beau fixe Quelques exemples concrets Avec Lucie nous avons créé des simulateurs de revenus pour les deux statuts, ils seront bientôt en ligne sur Hopwork ;) Ces simulations sont basiques et nous ne sommes pas un cabinet d’experts comptables. Si vous souhaitez avoir des simulations sur mesure et propres à votre situation, nous travaillons avec le net expert comptable que vous pouvez contacter directement ici. Pour notre exemple nous avons pris un développeur qui facture 400€ par jour et qui travaille 18 jours par mois en moyenne (20 jours de congés, 3 jours de maladie, 12 jours d’inter contrat par an) cela fait 86 400€ facturés dans l’année. Considérons également qu’il y aura environ 6 000€ de frais annuels (moyenne observée auprès des freelances avec qui nous échangeons au quotidien) En SASU on visera un salaire “minimal” de 2 500€ par mois soit 30 000€ annuel de salaire net. Le taux de cotisation sociale étant de 73% avec ce niveau de revenu, cela fait 22 000€ de cotisations sociales. Le coût du salaire sera donc 52 000€. Avec les 6 000€ de frais il restera donc 28 400€ de bénéfices, qui deviendront 20 400€ de revenus net après impôts sur les sociétés et taxes sur les dividendes. Un total donc de 50 400€ de revenus annuels nets, soit 58% du chiffre d’affaires facturé En EURL on visera un salaire “maximum” de 4 800€ par mois soit 57 600€ annuel de salaire. Le taux de cotisation sociale étant de 36% cela fait 20 500€. Le coût du salaire sera donc 78 100€. Avec les 6 000€ de frais il restera donc 2 200€ de bénéfices, qui deviendront 1 200€ de revenu des dividendes après impôts sur les sociétés et taxes sur les dividendes. Un total donc de 58 800€ de revenus annuels, soit 68% du chiffre d’affaires facturé C’est donc financièrement plus avantageux de rester en EURL, vous gagnez environ 17% de plus (avant impôts sur le revenu). Notre synthèse Partagez ce tableau de synthèse avec vos amis futurs freelances ! Et le portage salarial dans tout ça ? Le portage salarial est une option qui peut apporter un peu plus de sécurité mais qui coûte également plus cher. De plus en portage vous êtes comme un salarié, donc il n’est pas possible de mettre certaines dépenses en frais (une partie de votre loyer, un ordinateur de compétition etc.) Nous avons fait des simulations. la commission typique d’une société de portage est d’environ 5%, et il faut aussi compter environ 43% de charges patronales et salariales. Cela signifie qu’avec 86 400€ facturés vous touchez 44 600€ en salaire net. A cela vous déduisez environ 3000€ de frais (nous comptons moins de frais ici qu’en EURL ou SASU car vous n’avez par exemple pas besoin d’assurance RC pro ou de comptable…) Au final cela fait 41 600€ dans votre poche, soit 48% du chiffre d’affaires facturé. Vous gagnez donc 41% de plus en EURL qu’en portage salarial (58 800€ vs 41 600€) C’est beaucoup, mais la protection n’est pas la même, en portage salarial, vous cotisez au chômage ! Vous pouvez donc rompre votre contrat avec votre société de portage en cas de perte prolongée d’activité pour être indemnisé par l’assurance chômage. Pour aller plus loin On espère que cet article à pu éclaircir certains concepts et vous a aidé dans votre choix de statut. Se lancer en freelance est une aventure passionnante alors bravo et bonne chance ;) Si vous avez décidé de sauter le pas c’est par ici pour créer un profil sur Hopwork. N’hésitez pas à partager cet article et à contacter notre équipe (community@hopwork.com) si vous avez des questions ou des suggestions pour l’améliorer. Vous pouvez aussi consulter la liste de nos événements pour retrouver les dates des ateliers compta, juridique, et bien sûr les dates des prochains hopdrinks dans toutes les villes de France. Merci à toutes les personnes qui m’ont aidées dans la rédaction de l’article Lucie, Jean-Baptiste, Loic, Jean Baptiste Jacob, Pierre, Olivier et Johan ", "child": "179_1\t179_2\t179_3\t179_4\t179_5\t179_6\t179_7\t179_8\t179_9\t179_10\t179_11\t179_12\t179_13\t179_14\t179_15\t179_16\t179_17\t179_18\t179_19\t179_20\t179_21\t179_22"}