{"name": "1816", "parent": "", "title": "IN-BETWEEN", "sentences": [{"149a": "IN-BETWEEN"}, {"11e8": "Lately I’ve been thinking a lot about the in-between. I feel like no one talks about the in-between. In-between jobs, relationships, passions, careers. Not the transition, I’m talking even in-between that. That weird lull. The panic, the anticipation of what to anticipate. The what the hell. And the silent pain and the searching. The aimless searching. The searching for what to search for. That in-between."}, {"5cb2": "This is where I am. But here is the problem, I didn’t know I was allowed to have an in-between. I thought you get a rest period and then everything picks back up. But after quitting my last job and resting, I still wasn’t ready to face the world. I was starting my in-between."}, {"4185": "Lost in the confusion. I’ve searched for articles, read self-help books, spoke to friends, and grasp for any notion that I am not loosing my mind. But the truth is I felt (and in some ways still feel) like I’ve lost my mind. Lost who I am. Lost my breath. I constantly find myself feeling like I CAN NOT BREATHE. Questioning why I am here? If I don’t know who I am then why should I be here. If I were to walk out my door and never return would anyone even notice. and do I have the courage to do that?"}, {"89b9": "You see the mind is a beautiful thing but it’s so dangerous when it’s lost. Even though I am still in this phase I feel like I’m at the tail end. I have questioned enough to figure out that what I am going through should be a topic of conversation. Surely I am not the only person that has felt like this! I think I’m special but I’m not that special."}, {"7325": "Yes, this blog post is and not a whoa is me post. But attempting to put how I feel into words is a small inhale. I won’t begin to try and tell anyone how to fix themselves to get through this but I will share what has helped me."}, {"7328": "Here is a list because it’s 2016 and it’s not worth reading if lists aren’t involved."}, {"f331": "I still have bad days. Hell, right before I finished writing this I was feeling so low about my situation. But the good news is; with each breath is an opportunity to start over."}, {"8964": "exhale."}, {"e2d4": "Originally posted on my blog."}], "content": "IN-BETWEEN Lately I’ve been thinking a lot about the in-between. I feel like no one talks about the in-between. In-between jobs, relationships, passions, careers. Not the transition, I’m talking even in-between that. That weird lull. The panic, the anticipation of what to anticipate. The what the hell. And the silent pain and the searching. The aimless searching. The searching for what to search for. That in-between. This is where I am. But here is the problem, I didn’t know I was allowed to have an in-between. I thought you get a rest period and then everything picks back up. But after quitting my last job and resting, I still wasn’t ready to face the world. I was starting my in-between. Lost in the confusion. I’ve searched for articles, read self-help books, spoke to friends, and grasp for any notion that I am not loosing my mind. But the truth is I felt (and in some ways still feel) like I’ve lost my mind. Lost who I am. Lost my breath. I constantly find myself feeling like I CAN NOT BREATHE. Questioning why I am here? If I don’t know who I am then why should I be here. If I were to walk out my door and never return would anyone even notice. and do I have the courage to do that? You see the mind is a beautiful thing but it’s so dangerous when it’s lost. Even though I am still in this phase I feel like I’m at the tail end. I have questioned enough to figure out that what I am going through should be a topic of conversation. Surely I am not the only person that has felt like this! I think I’m special but I’m not that special. Yes, this blog post is and not a whoa is me post. But attempting to put how I feel into words is a small inhale. I won’t begin to try and tell anyone how to fix themselves to get through this but I will share what has helped me. Here is a list because it’s 2016 and it’s not worth reading if lists aren’t involved. I still have bad days. Hell, right before I finished writing this I was feeling so low about my situation. But the good news is; with each breath is an opportunity to start over. exhale. Originally posted on my blog. ", "child": "1816_1"}