{"name": "1818", "parent": "", "title": "Negotiating Who Lives and Dies", "sentences": [{"a53e": "Negotiating Who Lives and Dies"}, {"cd44": "An interview with Asad Rehman about the crisis of our times"}, {"7b87": "Asad Rehman speaks at an ITUC meeting in Marrakesh, 2016. Photo Credit: Friends of the Earth International."}, {"6e30": "Asad Rehman is a climate justice campaigner and one of the most prominent spokespersons of civil society at the UNFCCC negotiations on climate change. Born in Pakistan, he moved to Burnley, England as a young child. A veteran activist of anti-racist, anti-war, human rights and global justice movements, he leads the international climate work of Friends of the Earth EWNI (England, Wales and Northern Ireland) and is a board member of Friends of the Earth International and Global Justice Now!"}, {"3f48": "He sat down with Daniel Voskoboynik to speak about his life story, his experience campaigning for justice, the shattering horizons we’re heading towards, and how we build the power necessary to turn the world."}, {"73f5": "It’s been a little over a year since the Paris Agreement, a few months since the Marrakesh Summit. We’ve just emerged from the hottest year on record, with devastating impacts seen in Central Asia, across the Horn of Africa, in the Pacific. Looking back now, how do you evaluate that landmark agreement?"}, {"7245": "A political outcome is usually a reflection of strength: in that sense, the Paris Agreement is a reflection of the relative weakness of the climate movement, and conversely, the power of elites and the businesses of usual to protect an economic order."}, {"6437": "On one level, having governments recognize the need to keep temperatures below 1.5°C was a huge step forward. It was only achieved through the concerted pressure of climate justice movements. But the widely-praised goals of the Paris Agreement are aspirational: the actual pledges of action countries have made take us somewhere between three and seven degrees Celsius, cataclysmic levels of warming."}, {"a569": "Of course, the dominant political narrative is that the goals of Paris will be met. Because 1.5°C is in the text that must mean we’re on a pathway to that, we’re on the path to decarbonising the world. The reality is we’ve won an ambition for 1.5°C, but it’s not legally binding. There is no enforcement mechanism to make sure countries live up to their promises, and we haven’t won the means to achieve it, at least not in a just way without relying on risky geo-engineering technology, or the massive land grab needed for dangerous negative emissions technology schemes like bio-energy carbon capture and storage. Keeping temperatures below 1.5°C, even 2°C, in a just way requires a transformation of how we produce and consume energy and food — a shift away from business as usual and reshaping of our economies away from neo-liberal capitalism that puts profit before people and planet. Put bluntly, international agreements are not going to save the planet, without powerful movements at national and global level to make symbolic victories real."}, {"50fe": "You’ve spent a good part of the last decade working to exert pressure within the UNFCCC (United Nations Framework on Climate Change). What makes the climate crisis so difficult to solve? Why are most governments so reluctant to respond with reason to the threats we’re facing?"}, {"a7b0": "If you start from a perspective that negotiations on climate change are about the climate, or about the environment, then you don’t really understand what the negotiations are about. The climate talks and the entire debate about climate change is fundamentally about political economy. Ultimately, it’s about maintaining the dominant neo-liberal economic system, the profits of the few, and when push comes to shove, it’s about deciding who lives and who dies. It’s about determining the level of loss of lives and livelihoods in poor countries that rich countries are willing to accommodate."}, {"658d": "The climate talks and the entire debate about climate change is fundamentally about political economy. It’s about determining the level of loss of lives and livelihoods in poor countries that rich countries are willing to accommodate."}, {"091c": "So without understanding those dimensions, it becomes very difficult to comprehend why it’s so difficult to reach an international agreement on climate change, why governments aren’t responding rationally to the science. Ambitious action on climate change is elusive because powerful economic vested interests don’t want to lose their economic power and control, so they ensure governments act in their interest and not in ours."}, {"dc77": "Secretary-General Ban Ki-moonaddresses the Comité de Paris at the UN Climate Change Conference (COP21). Also pictured: François Hollande, President of France; Laurent Fabius, Minister for Foreign Affairs of France and President of COP21; and Christiana Figueres, Executive Secretary of the UNFCCC. Photo Credit: United Nations Photo."}, {"7b46": "Failure to diagnose the problem correctly inevitably means failing to find the correct solution. The most common mistake is to interpret the climate crisis as a problem of advocacy. That governments simply require more briefings, more lobbies, more meetings, more press conferences, to educate them about the severity of the climate crisis. We could fill entire buildings with all the reports and evidence that NGOs have published."}, {"507a": "The real problem is not ignorance of the facts, it’s that we do not have sufficient power to overcome the powerful vested interests that are blocking climate action. Banks, big business and elites who profit from climate inaction are more powerful than we are, and more powerful than poorer developing countries on the frontline of climate impacts. Without understanding that this is about power and politics we can’t understand what climate negotiations are really about or what the climate justice movement needs to do."}, {"e4a0": "But do you think it’s just a problem where the analysis is misguided, or is it also the case that climate change is afforded the patience of advocacy, because many of those who campaign on it are detached from the burning impacts."}, {"d8f1": "The reality is the dominant assumptions and starting points of climate campaigning is shaped by the political interests and physical reality of the Global North."}, {"9a30": "The best example of this is the discussion about temperature targets. Now this might sound very technical — I mean all this talk is exactly the kind of jargon that alienates people from conversations about climate change — but these numbers are really some of the most important in the world. The temperatures we reach determine the kind of world we have."}, {"cf3e": "So, even though Paris gave us the symbolic victory of a 1.5°C target, many organisations continue to fail to take it seriously. To stay below 1.5°C means that we can only continue to pollute at current levels for another 5 years. Every country must do its fair share of effort and begin a drastic transformation of the global economy, starting today. But in the name of “pragmatism” and “realism”, so many in civil society either revert to the target of 2°C, or call for action to stay below 1.5°C at best without making any specific demands or at worst with actual policy demands fall way short of what is required by climate science"}, {"1d0a": "But if someone tells you that 1.5°C is not worth fighting for, they must be asked at what cost in human lives and livelihoods. They have to that you are willing to answer how many people in the Global South they are willing to be sacrificed in the interest of their pragmatism. From the perspective of climate justice, we must not only stand with the most vulnerable communities, with the poorest countries, but ensure that our accountability is to those on the frontline One hundred of the poorest countries, climate scientists, social movements and climate justice organisations called for a temperature ceiling of 1.5°C, because the climate impacts associated with 2°C will be catastrophic. Every additional decimal point, every minimal degree of temperature rise, will exact a heavy price on those least responsible for the climate crisis."}, {"931d": "Two farmers in rural Mozambique break into the earth, dessicated through drought. Photo Credit: Kepa (Flickr)."}, {"31fc": "To make matters worse, when developed countries and the majority of NGOs talk about 2°C, they are in reality calling for only a 50% chance of preventing a breach of the two degree guardrail. The equivalent odds would see 30,000 airplanes crashing each and every single day. Western citizens would never set foot in an airport if those were the odds of their crashing if they flew. But many Western countries, movements and NGOs are happy to accept such devastating probabilities for those facing climate impacts in the Global South. They’re also willing to accept scientific models underpinned by false solutions and fantasy technologies."}, {"b474": "Western citizens would never set foot in an airport if those were the odds of their crashing if they flew. But many Western countries, movements and NGOs are happy to accept such devastating probabilities for those facing climate impacts in the Global South."}, {"a0f9": "If you are willing to advocate a 2°C position, you are willing to advocate that the consumption patterns of citizens and the economic interests of the Global North, are much more important than the lives of billions of people in the poorest countries of the world. It’s the richest 10% of the world, the overwhelming majority in the Global North who are responsible for 50% of global emissions, and the poorest 50% who live in the Global South who are responsible for only 10% of emissions. That’s the reality and I find it unacceptable."}, {"8ee0": "Subconsciously, people in the richest countries know that they have accumulated the resources, from burning fossil fuels and from centuries of exploitation of the Global South to live, to adapt to a 2°C scenario and even higher temperature levels. It’s the poor, the majority of the world that have no choice. An average citizen in the USA has a per capita income of over $55,000 whilst a citizen of Mali has a per capita income of only $700 dollars. Resources give you power, they give you agency, wealth is what insulates you from climate shocks."}, {"ab11": "The two most important metrics to take into account when assessing any climate policy or climate demand are the metrics of science and justice."}, {"2bff": "The same disregard for the realities of the poor and most vulnerable applies to other areas of climate policy. The Global North is not doing its fair share of efforts to tackle the climate crisis. But organisations continue to promote narratives that shift both the blame and the focus of their demands for more action at the feet of countries in the Global South. When you spend more energy talking about developing countries than your own governments continued addiction to dirty energy then you’re accepting that the burden of tackling climate change should fall on the poor, and those struggling to acquire the basic fundamentals in life, rather than the rich. They may not express that directly in words, but they are complicit."}, {"44d9": "The two most important metrics to take into account when assessing any climate policy or climate demand are the metrics of science and justice. So when governments present any policy or target, we have to ask: what does the science say? And what does justice say? And that determines whose side you are in."}, {"66fd": "From a climate justice perspective, what other problematic narratives do you see being put forward by the traditional environmental movement?"}, {"07fc": "There are many. One of these is the idea of global catastrophe, that all of us are all on the proverbial Titanic and it has hit the climate iceberg. In reality we may all be on the Titanic, but it’s the rich, white industrialised countries who are on the top deck, sipping their cocktails, listening to the orchestra and waiting for some technological fix to save them, whilst in the hold of the Titanic are black, brown, indigenous people, poor brown and black people from the Global South, who are already drowning, and when they try and flee, they find that the escape hatch is bolted."}, {"daf5": "A mourning widow grieves next to floodwater and corpses in Bihar, India, 2008. Photo Credit: Balazs Gardi."}, {"340e": "It’s a very similar narrative to the one that calls on people to act to save future generations from the perils of climate change. It makes tackling climate change, something to be achieved in the future, because that’s when it’s about saving our grandchildren, our great-grandchildren. But from a climate justice perspective, this crisis is not about tomorrow, or about our future generations. Talking about future generations marginalises the reality of impacts today. It says that Black Lives Don’t Matter as much as the lives of white European children. Shutting our eyes to the realities of climate impacts today is why the climate movement is able to look the other way when it comes to the broken bodies of men, women and children washing up on the shores of the Mediterranean seeking safe haven. If you look at where many of those people are coming from, they are coming from places where multiple injustices fuse together."}, {"8c10": "In Syria, you have a collision of war, conflict and persecution, but you also have a five-year drought which killed 80% of all livestock and drove up to 2 million people from rural areas toward urban areas, exacerbating existing tensions. You have states that have disintegrated because of wars caused by countries vying for access to oil and other dirty energy fuels."}, {"6585": "Climate scientists are also telling us that because of climate change, by 2020 between 85 million to 250 million of our fellow citizens in Africa will be facing acute water stresses and significant agricultural collapses. We know from the International Red Cross that environmental refugees or environmentally-induced refugees are now beginning to overtake the number of refugees created by conflict. The International Organisation on Migration says that 1 in 30 people around the world will be displaced from their homes by 2050."}, {"a998": "Super-typhoons, forest fires, droughts, and landslides are already bearing down on communities the world over. In Pakistan over the last few years we’ve experienced recurring summer heatwaves, causing the deaths of thousands. Last year, local governments even dug graves in advance, knowing what was coming. So it’s almost offensive to talk about future generations."}, {"1285": "Another weak narrative is this vague idea that we have to push for “climate action”. A lot of people talk about getting our governments to act on climate, as if climate is an abstract issue, an issue that doesn’t have a name, that doesn’t have a face, that doesn’t have addresses, and that can’t be measured. But this isn’t true; the culprits of climate change can be found in financial institutions, dirty energy corporations, and our governments. Simply calling for action without concrete demands is not just an empty demand. At best its an escape hatch for those responsible for climate change to claim they are acting, at worst it undermines the need for movements to hold the real climate criminals to account."}, {"3ff0": "In Pakistan over the last few years we’ve experienced recurring summer heatwaves, causing the deaths of thousands. Last year, local governments even dug graves in advance, knowing what was coming. So it’s almost offensive to talk about future generations."}, {"0faa": "When communities in the South bravely resist dirty energy projects, with many facing violent repression for doing so, including being killed, a question they always ask is: we are resisting, but when are you in the North going to stop simply calling for climate action and actually target your banks, your financial institutions, your corporations, your trade deals and your governments that are in our countries backing these dirty energy projects? That’s what real solidarity is. It’s about taking responsibility for our actions internationally, and being accountable to those in the Global South."}, {"45b3": "I’d love to know more about your experience growing up in the UK and your involvement in anti-racist organising. How did those experiences shape your later work?"}, {"bc1d": "For black people of my generation, second-generation British Asians growing up in the late 1970s and early 80s, our lives were shaped by our experiences of racist violence, and the failure of the state to respond to that violence. These were unprecedented levels of violence. Our homes were attacked and firebombed, we were attacked on the way to school, we were attacked at school. It was a total failure of what you might call “those in power”, from the school to the police to the national state, to take those experiences of violence seriously."}, {"41d5": "For black people of my generation, second-generation British Asians growing up in the late 1970s and early 80s, our lives were shaped by our experiences of racist violence, and the failure of the state to respond to that violence."}, {"9b60": "That’s what lead me into the anti-racist movement, experiencing the firebombing of our family home, suffering pervasive racist violence at school. I gained my early political awareness through trying to understand that violence, both why it was happening but also what we could do about it. And I learnt some very important lessons."}, {"86fc": "Firstly, that the people who are most impacted need to be at the forefront of any struggle for justice. Otherwise the response to injustice is shaped by others considerations and priorities, rather than what is actually needed. We coined a slogan at the time that reflected that idea: “he/she who feels it, leads it”."}, {"cc8a": "We strongly felt that the anti-racist movement had to be led by people of colour, by black people who had direct experiences with racism. We would not accept our struggle being appropriated by others, who saw us as passive foot soldiers whilst they made decisions on our behalf based on their own political self-interests. We realized the importance of black self-organisation, this idea that our movements should be black-led, rooted in our own communities, shaped by our own narratives. Ultimately the fight against racism in the UK, whether against right-wing violence or state violence (deaths in custody, police violence, police neglect), was a fight for justice that we ourselves had to lead."}, {"9100": "We also learnt a lot about the inter-connectedness of our struggles in the UK with the struggles in our countries of origin against colonialism and imperialism. Not only were the power structures we were fighting against in the UK were the same ones that communities in our countries of origin were fighting against, but the same racist ideology was being used to de-humanise us and to legitimise white supremacy. On a practical level, many in our communities were transplanted to the UK because of colonial-economic needs. The reason we are here is because they were over there. People were brought from South Asia to work in the knitting mills in Lancashire and Yorkshire, and people from the Caribbean were brought for the steel industry and the National Health Service in big cities. We were put where our labour was needed, and forced to live in some of the worst housing and most deprived areas because of ‘colour bars’ as to where we could live."}, {"055f": "All these experiences made us realize the issues we were fighting were not just local. Our actions in the UK not only had a material impact on weakening the global forces of racism and colonialism but because we were in the “belly of the beast” we had a unique responsibility to be the voices of our communities abroad. We had to connect our fight against racism with the struggle against apartheid in South Africa and what is now Zimbabwe, the liberation struggles in Angola and Namibia, the struggles in Latin America against military dictatorships, and the struggle of the Palestinian people to end occupation."}, {"4e51": "All these experiences left me with important questions: how do you understand issues of power, privilege & class? Who shapes a movement? And who is that movement accountable to?"}, {"94f2": "All these experiences left me with important questions: how do you understand issues of power, privilege & class? Who shapes a movement? And who is that movement accountable to?"}, {"cb3b": "My journey towards climate justice didn’t follow an environmental route. I started as an activist fighting for social, economic and racial justice, but I’ve come to recognise that climate is an arena where our movements in the South are fighting, and what they’re really fighting for is the right to life, against inequality and injustice and to end the neo-liberal economic system that is responsible. That means as black activists in the UK, we have a responsibility, to be their voice in the North, to act in solidarity with those on the frontline and to be accountable to them in our actions."}, {"8e66": "The climate movement in the Global North, particularly in the UK, has many parallels with the mainstream anti-racist movements in the 1960s and 1970s, largely led by white and middle class people, many with good intentions. But it was they who determined the tactics, the strategy and even when to claim victory. They urged us in the black community to be patient, wanting to declare the fight against fascism won, even whilst our communities were under daily attack by racists. They were able to do so because they weren’t facing the realities of racism as we were. Our view in black led anti-racist movements was why should we have to wait? When you feel the fire of injustice, you can’t afford to be patient."}, {"2413": "What does accountability to the Global South and to communities of colour mean in the context of climate change?"}, {"8d32": "The question black activists are asking now around the world is: do Black Lives Matter? Because if Black Lives Matter, if that’s the metric at which you start, then you are no longer able to say: well we have to be pragmatic, we have to be conscious of national circumstances. When you recognise that people are drowning in the Mediterranean because they’re fleeing war, inequality and climate impacts, it’s not good enough to just say I’m going to react by just marching for refugees. You also have to recognise that there is a system which is creating those refugees, which is one that we are all complicit with in the North."}, {"c431": "If Black Lives Matter, if that’s the metric at which you start, then you are no longer able to say: well we have to be pragmatic, we have to be conscious of national circumstances."}, {"5f14": "So if you spend your time diluting the urgency of climate change, if you spend your time making climate change an apolitical issue, what you’re basically doing is taking away the value of our lives. If you prefer to explain climate change by using images of polar bears, you’re basically colluding in eradicating the realities of our experiences. Climate change is first and foremost about our lives. So whilst nature and polar bears are crucial, and one part of the climate story, by becoming the symbol of the climate movement, it diminished the reality of people of the Global South who are already suffering impacts. On the flip side, when people of the Global South are featured, it’s usually as passive ‘victims’ of climate change, with no agency, looking to be ‘saved’."}, {"ab79": "Climate change is first and foremost about our lives. So whilst nature and polar bears are crucial, and one part of the climate story, by becoming the symbol of the climate movement, it diminished the reality of people of the Global South who are already suffering impacts."}, {"88ff": "Part of this disconnection obviously stems from the fact that the climate movement in much of the Global North is overwhelmingly white and middle class and far removed from the reality of climate change."}, {"4caf": "It uses a language that is exclusionary to most ordinary people, and rests on a dynamic that ensures most people have no agency on this issue. It is based on elite advocacy. It chooses to pursue a power that comes from being part of inner political circles. It’s populated by people who have no meaningful connection with those suffering the devastating impacts. And that distance, that lack of accountability, means that you can celebrate the piecemeal victories, the legislative tweaks, the little amendments of language."}, {"f6d0": "Whereas if you’re accountable to movements in the Global South, you know that you can’t go back to them and say: look I know your food system is being destroyed, I know you’re experiencing super-typhoons that kill thousands and displace millions, but in the UK we can’t afford to be too radical."}, {"b363": "By in large, in the UK the political elite who dominate government bodies, NGOs, and the media, are too often part of the same cosy club, sharing a common class and educational background. They have a comfortable language and a comfortable way of talking to each other. They have become co-opted to such an extent that their biggest fear is not being part of the ‘club’, so no one wants to rock the boat too much. And they end up not telling the truth about climate change and gravitate towards framing climate change as an apolitical, abstract issue."}, {"9aa0": "Climate change is unquestionably political. Being honest about climate change means understanding that maintaining the economic and political status quo is already causing colossal destruction."}, {"96e3": "But in a context dominated by unaccountable politics, it becomes radical to talk what’s needed. It becomes radical to be truthful about climate change. It becomes radical to talk about caring about people impacted. What’s not seen as radical is allowing the climate crisis to continue in way we’ve seen, to give preference to the right of the elite to maintain their dominant position."}, {"43a4": "Climate justice movements are continually framed as being outside legitimate political conversation. This is same language that governments use — they point their finger at radicals and position themselves as the voice of measured reason. NGOs employ the same game — they portray the climate justice movement as radical, depicting themselves as calm, collected and policy-literate."}, {"a140": "What we need is a 180 degree shift among those who for the last forty years have led the traditional climate movement. This strand of civil society, that dominates the political stage, that has the ear of governments and the media, tends to be made up of Northern NGOs. These are organisations who talk about the experiences of people in the Global South, but speak on their behalf. They have led the climate movement in a way that hasn’t really built a diverse and potent movement, that hasn’t given us a deep analysis of climate change, and hasn’t really achieved major successes. Until as a broad movement we are far more truthful about the urgency, until we are far more resolute in denouncing governments and corporations that are blocking change, until affected communities are listened to in the corridors of power, until their voices become anchors of the demands we make, then there will be little change."}, {"2687": "You’ve described yourself a “reluctant environmentalist”. In a way, “reluctant environmentalism” is something that has plagued a lot of the left or progressive community. Often there’s a tense relationship with ecology, sometimes rooted in concerns about jobs, other times rooted in a prioritization of social concerns over environmental concerns."}, {"27ed": "Sure, there’s definitely a number of reasons why “the left” has a strained relationship with environmentalism. For instance, in the Global North, addressing climate change is frequently seen as an environmental issue. But many in the South don’t deconstruct their fights the way we do. They don’t distinguish between environmental, economic or political fights. They see it as a fight for justice, a fight for liberation."}, {"54fd": "There’s also another problem, which is when movements simply state that climate change is such a systemic issue, and there is no solution but revolution. This reminds me of discussions I had in the early 1980s. I was at a meeting of a left party, and I raised the issue of pervasive racist violence in the UK, asking what could do about it. People were sympathetic, agreeing with me that it was a very important issue, but the general response was: “do you know comrade, that the only way to eradicate racism is to overthrow capitalism? Racism will be solved when the revolution comes!”"}, {"0c09": "I said, “that’s not a message I will take back to my community, that we have to wait until the revolution.” I believed that tackling racism would be how we delivered social transformation."}, {"a0e6": "Similarly tackling climate change is how we can realise the transformation needed and be able to have a positive vision for the future. When you change the way we produce and consume energy, the way we produce and consume food, you’re talking about a very different kind of world. You’re talking about displacing some of the most powerful companies on the planet — those that control most of the food supply, those that bankroll the political establishment, those that receive trillions of dollars in public subsidies, those that are responsible for most of global emissions."}, {"faa3": "Asad Rehman, speaking at an event on the expansion Heathrow Airport, 2016. Photo Credit: Campaign Against Airport Expansion."}, {"d395": "If you’re interested in changing our current destructive and unsustainable economic model, we need to give people the opportunity to understand how that model is working, who it benefits and what can be done to make something different. You have to use a language which resonates with people’s ordinary lives, with their local realities. We can ultimately only win through local fights spurred on by a global vision. Climate change is a platform that can allow us to do that. We can braid together local fights to build the strength for genuine transformation across the world."}, {"13f1": "How does that strength get built?"}, {"4608": "First and foremost, the climate justice movement needs to be honest with itself. We have a very challenging carbon budget before us. We have about three to five years left before we extinguish the possibility of staying below 1.5°C. We have maybe another fifteen years before 2°C becomes implausible. We are in Decade Zero: the decisions we take over the next ten years determine the temperature guardrails we breach, the lines of life. That’s our timeline. We need to act now and our victories have to happen in the next five, maximum ten years."}, {"8180": "We are in Decade Zero: the decisions we take over the next ten years determine the temperature guardrails we breach, the lines of life. That’s our timeline. We need to act now and our victories have to happen in the next five, maximum ten years."}, {"6720": "We also have to be honest about our context. The forces of neoliberalism and corporatism are getting stronger. Politics has moved to the right. Progressive movements and governments are on the retreat. Social-democratic forces are failing. When the climate crisis demands internationalism, nationalism is gaining relevance; the narrative of most government is affirming that their central priority is to protect their economy, their citizens."}, {"2f30": "So what is our alternative? We need a compelling way of talking about the climate crisis, the economic crisis, and the political crisis. Not just a critique, not an abstraction, but a real package of solutions, an alternative."}, {"643a": "Seattle kayaktivists take action for renewable energy. Photo Credit: Backbone Campaign."}, {"3404": "Our solutions are the very solutions that create a different world. Dismantling carbon-heavy economies in a just way can be invariably positive, as it allows for people to have healthier, safer, better lives. By shifting away from dirty energy, moving towards democratic clean energy, supporting agro-ecology, establishing better public transport networks, reshaping our cities, delivering land rights, and supporting afforestation, we can allow ourselves to creatively imagine and implement new alternatives."}, {"5d9b": "What is our alternative? We need a compelling way of talking about the climate crisis, the economic crisis, and the political crisis. Not just a critique, not an abstraction, but a real package of solutions, an alternative."}, {"8d30": "That’s not a hard thing for us to put together and say: here’s our story. But we need clarity. The right is phenomenal at clarity. You hear their demagogues and it’s clear: taking back control, giving you jobs, standing up for you, draining the swamp. On the left, we project ambiguity. We rarely give clear answers on economic policy, on immigration. The response is a “it’s a bit complicated”."}, {"72a7": "We also need to think tactically. Which are the transformational fights we need to fight? What are the forces we need? These questions put us face to face with hard realities."}, {"b50f": "We have limited time and resources. We can’t try work on every issue or fight all fires at once. So what are our collective fights? What are the fights that are transformational, that mean that if we win them, they have a potent knock-on effect? Is our movement set up in a way that gives us the best chances of success?"}, {"b5a7": "These are difficult questions, because they involve making decisions about how to allocate resources, where to devote capacity, what to prioritize. But we’re in a war where we’re trying to save the lives of the people and our planet. And we have to decide pretty promptly what tactics we need to use."}, {"77f5": "What do you think are those transformational fights?"}, {"a067": "Well there are many. The world is complex and the manifestations of those fights will be different on a local level. But it’s worth making distinctions: there are fights we should fight, and fights we cannot lose."}, {"f6c6": "When it comes to tackling the climate crisis, that requires tackling three key areas: energy, food, and forests. When you look at energy specifically, we know that we cannot allow the fossil fuel industry to exploit new fossil fuel sources. In the North, that means that we have to stop much more than fracking. We have to fight coal, we have to fight multinational investments in fossil fuels, and we have stop the false “clean” transition from coal into gas, which would be nothing but a farewell tour to 2C."}, {"d1ac": "There is however a fight that we have to fight without choice and that is the migration fight. If we lose the migration fight, we lose the politics of justice."}, {"d1da": "Every second a person is being displaced. One in 30 will be displaced from their homes by 2050. Most people are displaced internally, or into other poorer countries."}, {"cd60": "The voices of neoliberalism are using migration as a way to talk to people who have been failed by the system. We need to speak to those people, and we need to reframe migration with clarity: the issue is not migration, it’s the power of corporations and our governments."}, {"70c0": "Reframing migration can help us put forward an alternative vision that shows what we have in common. The story of migration is a story about people, a story about what drives displacement, a story about the reality of the world. And talking about our response to migration means we talk about our responsibilities to our citizens and fellow human beings. It means changing the way we look at the world."}, {"9016": "The voices of neoliberalism are using migration as a way to talk to people who have been failed by the system. We need to speak to those people, and we need to reframe migration with clarity: the issue is not migration, it’s the power of corporations and our governments."}, {"e960": "Asad Rehman addresses This Changes Everything, 2015. Photo Credit: Ana Parra."}, {"d4ce": "That moral vision is not some wild impossibility. We’ve done it before: we did it with slavery, when people said they would support struggles for emancipation. We’ve done with colonialism and imperialism, when people supported struggles for liberation. And we’ll do it again, supporting struggles to stop the destruction of people’s homes and livelihoods."}, {"00b3": "To get there, we need to broadly agree on a theory of change. Most people recognize that only the power of people — real movement-building — is what can create the kind of power needed to be able to make truly transformational changes."}, {"e6ec": "The environmental movement is increasingly aware that it cannot win on climate change alone — from a practical point of view, they have to build power. Building power means going and organising people, where they are. It means listening to the daily issues people face and working from there. The only solution to our weakness is solidarity. To win what we need to win, we have to do lateral movement-building."}, {"a78b": "The silos that divide us will have to disappear. We’ll have to be able to sit together as organizations and movements and say: these are fights we need to win, and we’re going to collectively prioritise those. It’s a challenge, but everything seems impossible until it starts to get possible. This is what you have to get people to realize."}, {"9472": "Donald Trump has recently been inaugurated as the president of the United States. As a final note, how would you describe the times we find ourselves in. And do you see any hope on the horizon?"}, {"89e5": "Trump’s victory is desperately worrying. The right are certainly ascendant, and we live in troubled times. But we can’t forget that much of the narrative they are using was our narrative: the narrative of the global justice movement. Failed globalization, inequality, the left behind, political elites not caring for you…those were our top line messages!"}, {"2c3f": "We can’t forget that much of the narrative [the right] are using was our narrative: the narrative of the global justice movement. Failed globalization, inequality, the left behind, political elites not caring for you…those were our top line messages!"}, {"7bd5": "So why have so many people been captured by the right? Why aren’t those people with us? What was our mistake? That’s a reflection we need to undertake. Is that because we spent more of our time speaking to each other, rather than going out and speaking to ordinary people? Is our language or our way of organising inaccessible?"}, {"64e2": "Progressive movements have vacated many spaces. There are abandoned estates, towns, and cities where the left used to be, engaging in real solidarity and organising. Today we’ve become over-attached to clicktivism, to our Facebook posts and Twitter threads. These are useful tools but they’re not the answer. If you look at the right everywhere, in Europe and elsewhere, they are going to the spaces where the left used to be."}, {"732d": "Dump Trump Protest, New York City, 2016. Photo Credit: ResistFromDay1 (Flickr)."}, {"855e": "As for hope, whilst it is absolutely clear that Trump is a horrific individual with a horrifying agenda, the one positive thing about his election is that he has forced movements together. Whether you’re black or Muslim or transgender or a climate activist or against poverty — you now have a common enemy. That forces movements to unite and say clearly that an injury to one is an injury to all. I’m hoping that the consequence of his election is that we all start saying, whoever he comes for, we’ll come for him. I’m hoping that the politics of division and persecution will force movements into the politics of solidarity. The unfolding horror of the world needs to be a fuel we use in our favour."}], "content": "Negotiating Who Lives and Dies An interview with Asad Rehman about the crisis of our times Asad Rehman speaks at an ITUC meeting in Marrakesh, 2016. Photo Credit: Friends of the Earth International. Asad Rehman is a climate justice campaigner and one of the most prominent spokespersons of civil society at the UNFCCC negotiations on climate change. Born in Pakistan, he moved to Burnley, England as a young child. A veteran activist of anti-racist, anti-war, human rights and global justice movements, he leads the international climate work of Friends of the Earth EWNI (England, Wales and Northern Ireland) and is a board member of Friends of the Earth International and Global Justice Now! He sat down with Daniel Voskoboynik to speak about his life story, his experience campaigning for justice, the shattering horizons we’re heading towards, and how we build the power necessary to turn the world. It’s been a little over a year since the Paris Agreement, a few months since the Marrakesh Summit. We’ve just emerged from the hottest year on record, with devastating impacts seen in Central Asia, across the Horn of Africa, in the Pacific. Looking back now, how do you evaluate that landmark agreement? A political outcome is usually a reflection of strength: in that sense, the Paris Agreement is a reflection of the relative weakness of the climate movement, and conversely, the power of elites and the businesses of usual to protect an economic order. On one level, having governments recognize the need to keep temperatures below 1.5°C was a huge step forward. It was only achieved through the concerted pressure of climate justice movements. But the widely-praised goals of the Paris Agreement are aspirational: the actual pledges of action countries have made take us somewhere between three and seven degrees Celsius, cataclysmic levels of warming. Of course, the dominant political narrative is that the goals of Paris will be met. Because 1.5°C is in the text that must mean we’re on a pathway to that, we’re on the path to decarbonising the world. The reality is we’ve won an ambition for 1.5°C, but it’s not legally binding. There is no enforcement mechanism to make sure countries live up to their promises, and we haven’t won the means to achieve it, at least not in a just way without relying on risky geo-engineering technology, or the massive land grab needed for dangerous negative emissions technology schemes like bio-energy carbon capture and storage. Keeping temperatures below 1.5°C, even 2°C, in a just way requires a transformation of how we produce and consume energy and food — a shift away from business as usual and reshaping of our economies away from neo-liberal capitalism that puts profit before people and planet. Put bluntly, international agreements are not going to save the planet, without powerful movements at national and global level to make symbolic victories real. You’ve spent a good part of the last decade working to exert pressure within the UNFCCC (United Nations Framework on Climate Change). What makes the climate crisis so difficult to solve? Why are most governments so reluctant to respond with reason to the threats we’re facing? If you start from a perspective that negotiations on climate change are about the climate, or about the environment, then you don’t really understand what the negotiations are about. The climate talks and the entire debate about climate change is fundamentally about political economy. Ultimately, it’s about maintaining the dominant neo-liberal economic system, the profits of the few, and when push comes to shove, it’s about deciding who lives and who dies. It’s about determining the level of loss of lives and livelihoods in poor countries that rich countries are willing to accommodate. The climate talks and the entire debate about climate change is fundamentally about political economy. It’s about determining the level of loss of lives and livelihoods in poor countries that rich countries are willing to accommodate. So without understanding those dimensions, it becomes very difficult to comprehend why it’s so difficult to reach an international agreement on climate change, why governments aren’t responding rationally to the science. Ambitious action on climate change is elusive because powerful economic vested interests don’t want to lose their economic power and control, so they ensure governments act in their interest and not in ours. Secretary-General Ban Ki-moonaddresses the Comité de Paris at the UN Climate Change Conference (COP21). Also pictured: François Hollande, President of France; Laurent Fabius, Minister for Foreign Affairs of France and President of COP21; and Christiana Figueres, Executive Secretary of the UNFCCC. Photo Credit: United Nations Photo. Failure to diagnose the problem correctly inevitably means failing to find the correct solution. The most common mistake is to interpret the climate crisis as a problem of advocacy. That governments simply require more briefings, more lobbies, more meetings, more press conferences, to educate them about the severity of the climate crisis. We could fill entire buildings with all the reports and evidence that NGOs have published. The real problem is not ignorance of the facts, it’s that we do not have sufficient power to overcome the powerful vested interests that are blocking climate action. Banks, big business and elites who profit from climate inaction are more powerful than we are, and more powerful than poorer developing countries on the frontline of climate impacts. Without understanding that this is about power and politics we can’t understand what climate negotiations are really about or what the climate justice movement needs to do. But do you think it’s just a problem where the analysis is misguided, or is it also the case that climate change is afforded the patience of advocacy, because many of those who campaign on it are detached from the burning impacts. The reality is the dominant assumptions and starting points of climate campaigning is shaped by the political interests and physical reality of the Global North. The best example of this is the discussion about temperature targets. Now this might sound very technical — I mean all this talk is exactly the kind of jargon that alienates people from conversations about climate change — but these numbers are really some of the most important in the world. The temperatures we reach determine the kind of world we have. So, even though Paris gave us the symbolic victory of a 1.5°C target, many organisations continue to fail to take it seriously. To stay below 1.5°C means that we can only continue to pollute at current levels for another 5 years. Every country must do its fair share of effort and begin a drastic transformation of the global economy, starting today. But in the name of “pragmatism” and “realism”, so many in civil society either revert to the target of 2°C, or call for action to stay below 1.5°C at best without making any specific demands or at worst with actual policy demands fall way short of what is required by climate science But if someone tells you that 1.5°C is not worth fighting for, they must be asked at what cost in human lives and livelihoods. They have to that you are willing to answer how many people in the Global South they are willing to be sacrificed in the interest of their pragmatism. From the perspective of climate justice, we must not only stand with the most vulnerable communities, with the poorest countries, but ensure that our accountability is to those on the frontline One hundred of the poorest countries, climate scientists, social movements and climate justice organisations called for a temperature ceiling of 1.5°C, because the climate impacts associated with 2°C will be catastrophic. Every additional decimal point, every minimal degree of temperature rise, will exact a heavy price on those least responsible for the climate crisis. Two farmers in rural Mozambique break into the earth, dessicated through drought. Photo Credit: Kepa (Flickr). To make matters worse, when developed countries and the majority of NGOs talk about 2°C, they are in reality calling for only a 50% chance of preventing a breach of the two degree guardrail. The equivalent odds would see 30,000 airplanes crashing each and every single day. Western citizens would never set foot in an airport if those were the odds of their crashing if they flew. But many Western countries, movements and NGOs are happy to accept such devastating probabilities for those facing climate impacts in the Global South. They’re also willing to accept scientific models underpinned by false solutions and fantasy technologies. Western citizens would never set foot in an airport if those were the odds of their crashing if they flew. But many Western countries, movements and NGOs are happy to accept such devastating probabilities for those facing climate impacts in the Global South. If you are willing to advocate a 2°C position, you are willing to advocate that the consumption patterns of citizens and the economic interests of the Global North, are much more important than the lives of billions of people in the poorest countries of the world. It’s the richest 10% of the world, the overwhelming majority in the Global North who are responsible for 50% of global emissions, and the poorest 50% who live in the Global South who are responsible for only 10% of emissions. That’s the reality and I find it unacceptable. Subconsciously, people in the richest countries know that they have accumulated the resources, from burning fossil fuels and from centuries of exploitation of the Global South to live, to adapt to a 2°C scenario and even higher temperature levels. It’s the poor, the majority of the world that have no choice. An average citizen in the USA has a per capita income of over $55,000 whilst a citizen of Mali has a per capita income of only $700 dollars. Resources give you power, they give you agency, wealth is what insulates you from climate shocks. The two most important metrics to take into account when assessing any climate policy or climate demand are the metrics of science and justice. The same disregard for the realities of the poor and most vulnerable applies to other areas of climate policy. The Global North is not doing its fair share of efforts to tackle the climate crisis. But organisations continue to promote narratives that shift both the blame and the focus of their demands for more action at the feet of countries in the Global South. When you spend more energy talking about developing countries than your own governments continued addiction to dirty energy then you’re accepting that the burden of tackling climate change should fall on the poor, and those struggling to acquire the basic fundamentals in life, rather than the rich. They may not express that directly in words, but they are complicit. The two most important metrics to take into account when assessing any climate policy or climate demand are the metrics of science and justice. So when governments present any policy or target, we have to ask: what does the science say? And what does justice say? And that determines whose side you are in. From a climate justice perspective, what other problematic narratives do you see being put forward by the traditional environmental movement? There are many. One of these is the idea of global catastrophe, that all of us are all on the proverbial Titanic and it has hit the climate iceberg. In reality we may all be on the Titanic, but it’s the rich, white industrialised countries who are on the top deck, sipping their cocktails, listening to the orchestra and waiting for some technological fix to save them, whilst in the hold of the Titanic are black, brown, indigenous people, poor brown and black people from the Global South, who are already drowning, and when they try and flee, they find that the escape hatch is bolted. A mourning widow grieves next to floodwater and corpses in Bihar, India, 2008. Photo Credit: Balazs Gardi. It’s a very similar narrative to the one that calls on people to act to save future generations from the perils of climate change. It makes tackling climate change, something to be achieved in the future, because that’s when it’s about saving our grandchildren, our great-grandchildren. But from a climate justice perspective, this crisis is not about tomorrow, or about our future generations. Talking about future generations marginalises the reality of impacts today. It says that Black Lives Don’t Matter as much as the lives of white European children. Shutting our eyes to the realities of climate impacts today is why the climate movement is able to look the other way when it comes to the broken bodies of men, women and children washing up on the shores of the Mediterranean seeking safe haven. If you look at where many of those people are coming from, they are coming from places where multiple injustices fuse together. In Syria, you have a collision of war, conflict and persecution, but you also have a five-year drought which killed 80% of all livestock and drove up to 2 million people from rural areas toward urban areas, exacerbating existing tensions. You have states that have disintegrated because of wars caused by countries vying for access to oil and other dirty energy fuels. Climate scientists are also telling us that because of climate change, by 2020 between 85 million to 250 million of our fellow citizens in Africa will be facing acute water stresses and significant agricultural collapses. We know from the International Red Cross that environmental refugees or environmentally-induced refugees are now beginning to overtake the number of refugees created by conflict. The International Organisation on Migration says that 1 in 30 people around the world will be displaced from their homes by 2050. Super-typhoons, forest fires, droughts, and landslides are already bearing down on communities the world over. In Pakistan over the last few years we’ve experienced recurring summer heatwaves, causing the deaths of thousands. Last year, local governments even dug graves in advance, knowing what was coming. So it’s almost offensive to talk about future generations. Another weak narrative is this vague idea that we have to push for “climate action”. A lot of people talk about getting our governments to act on climate, as if climate is an abstract issue, an issue that doesn’t have a name, that doesn’t have a face, that doesn’t have addresses, and that can’t be measured. But this isn’t true; the culprits of climate change can be found in financial institutions, dirty energy corporations, and our governments. Simply calling for action without concrete demands is not just an empty demand. At best its an escape hatch for those responsible for climate change to claim they are acting, at worst it undermines the need for movements to hold the real climate criminals to account. In Pakistan over the last few years we’ve experienced recurring summer heatwaves, causing the deaths of thousands. Last year, local governments even dug graves in advance, knowing what was coming. So it’s almost offensive to talk about future generations. When communities in the South bravely resist dirty energy projects, with many facing violent repression for doing so, including being killed, a question they always ask is: we are resisting, but when are you in the North going to stop simply calling for climate action and actually target your banks, your financial institutions, your corporations, your trade deals and your governments that are in our countries backing these dirty energy projects? That’s what real solidarity is. It’s about taking responsibility for our actions internationally, and being accountable to those in the Global South. I’d love to know more about your experience growing up in the UK and your involvement in anti-racist organising. How did those experiences shape your later work? For black people of my generation, second-generation British Asians growing up in the late 1970s and early 80s, our lives were shaped by our experiences of racist violence, and the failure of the state to respond to that violence. These were unprecedented levels of violence. Our homes were attacked and firebombed, we were attacked on the way to school, we were attacked at school. It was a total failure of what you might call “those in power”, from the school to the police to the national state, to take those experiences of violence seriously. For black people of my generation, second-generation British Asians growing up in the late 1970s and early 80s, our lives were shaped by our experiences of racist violence, and the failure of the state to respond to that violence. That’s what lead me into the anti-racist movement, experiencing the firebombing of our family home, suffering pervasive racist violence at school. I gained my early political awareness through trying to understand that violence, both why it was happening but also what we could do about it. And I learnt some very important lessons. Firstly, that the people who are most impacted need to be at the forefront of any struggle for justice. Otherwise the response to injustice is shaped by others considerations and priorities, rather than what is actually needed. We coined a slogan at the time that reflected that idea: “he/she who feels it, leads it”. We strongly felt that the anti-racist movement had to be led by people of colour, by black people who had direct experiences with racism. We would not accept our struggle being appropriated by others, who saw us as passive foot soldiers whilst they made decisions on our behalf based on their own political self-interests. We realized the importance of black self-organisation, this idea that our movements should be black-led, rooted in our own communities, shaped by our own narratives. Ultimately the fight against racism in the UK, whether against right-wing violence or state violence (deaths in custody, police violence, police neglect), was a fight for justice that we ourselves had to lead. We also learnt a lot about the inter-connectedness of our struggles in the UK with the struggles in our countries of origin against colonialism and imperialism. Not only were the power structures we were fighting against in the UK were the same ones that communities in our countries of origin were fighting against, but the same racist ideology was being used to de-humanise us and to legitimise white supremacy. On a practical level, many in our communities were transplanted to the UK because of colonial-economic needs. The reason we are here is because they were over there. People were brought from South Asia to work in the knitting mills in Lancashire and Yorkshire, and people from the Caribbean were brought for the steel industry and the National Health Service in big cities. We were put where our labour was needed, and forced to live in some of the worst housing and most deprived areas because of ‘colour bars’ as to where we could live. All these experiences made us realize the issues we were fighting were not just local. Our actions in the UK not only had a material impact on weakening the global forces of racism and colonialism but because we were in the “belly of the beast” we had a unique responsibility to be the voices of our communities abroad. We had to connect our fight against racism with the struggle against apartheid in South Africa and what is now Zimbabwe, the liberation struggles in Angola and Namibia, the struggles in Latin America against military dictatorships, and the struggle of the Palestinian people to end occupation. All these experiences left me with important questions: how do you understand issues of power, privilege & class? Who shapes a movement? And who is that movement accountable to? All these experiences left me with important questions: how do you understand issues of power, privilege & class? Who shapes a movement? And who is that movement accountable to? My journey towards climate justice didn’t follow an environmental route. I started as an activist fighting for social, economic and racial justice, but I’ve come to recognise that climate is an arena where our movements in the South are fighting, and what they’re really fighting for is the right to life, against inequality and injustice and to end the neo-liberal economic system that is responsible. That means as black activists in the UK, we have a responsibility, to be their voice in the North, to act in solidarity with those on the frontline and to be accountable to them in our actions. The climate movement in the Global North, particularly in the UK, has many parallels with the mainstream anti-racist movements in the 1960s and 1970s, largely led by white and middle class people, many with good intentions. But it was they who determined the tactics, the strategy and even when to claim victory. They urged us in the black community to be patient, wanting to declare the fight against fascism won, even whilst our communities were under daily attack by racists. They were able to do so because they weren’t facing the realities of racism as we were. Our view in black led anti-racist movements was why should we have to wait? When you feel the fire of injustice, you can’t afford to be patient. What does accountability to the Global South and to communities of colour mean in the context of climate change? The question black activists are asking now around the world is: do Black Lives Matter? Because if Black Lives Matter, if that’s the metric at which you start, then you are no longer able to say: well we have to be pragmatic, we have to be conscious of national circumstances. When you recognise that people are drowning in the Mediterranean because they’re fleeing war, inequality and climate impacts, it’s not good enough to just say I’m going to react by just marching for refugees. You also have to recognise that there is a system which is creating those refugees, which is one that we are all complicit with in the North. If Black Lives Matter, if that’s the metric at which you start, then you are no longer able to say: well we have to be pragmatic, we have to be conscious of national circumstances. So if you spend your time diluting the urgency of climate change, if you spend your time making climate change an apolitical issue, what you’re basically doing is taking away the value of our lives. If you prefer to explain climate change by using images of polar bears, you’re basically colluding in eradicating the realities of our experiences. Climate change is first and foremost about our lives. So whilst nature and polar bears are crucial, and one part of the climate story, by becoming the symbol of the climate movement, it diminished the reality of people of the Global South who are already suffering impacts. On the flip side, when people of the Global South are featured, it’s usually as passive ‘victims’ of climate change, with no agency, looking to be ‘saved’. Climate change is first and foremost about our lives. So whilst nature and polar bears are crucial, and one part of the climate story, by becoming the symbol of the climate movement, it diminished the reality of people of the Global South who are already suffering impacts. Part of this disconnection obviously stems from the fact that the climate movement in much of the Global North is overwhelmingly white and middle class and far removed from the reality of climate change. It uses a language that is exclusionary to most ordinary people, and rests on a dynamic that ensures most people have no agency on this issue. It is based on elite advocacy. It chooses to pursue a power that comes from being part of inner political circles. It’s populated by people who have no meaningful connection with those suffering the devastating impacts. And that distance, that lack of accountability, means that you can celebrate the piecemeal victories, the legislative tweaks, the little amendments of language. Whereas if you’re accountable to movements in the Global South, you know that you can’t go back to them and say: look I know your food system is being destroyed, I know you’re experiencing super-typhoons that kill thousands and displace millions, but in the UK we can’t afford to be too radical. By in large, in the UK the political elite who dominate government bodies, NGOs, and the media, are too often part of the same cosy club, sharing a common class and educational background. They have a comfortable language and a comfortable way of talking to each other. They have become co-opted to such an extent that their biggest fear is not being part of the ‘club’, so no one wants to rock the boat too much. And they end up not telling the truth about climate change and gravitate towards framing climate change as an apolitical, abstract issue. Climate change is unquestionably political. Being honest about climate change means understanding that maintaining the economic and political status quo is already causing colossal destruction. But in a context dominated by unaccountable politics, it becomes radical to talk what’s needed. It becomes radical to be truthful about climate change. It becomes radical to talk about caring about people impacted. What’s not seen as radical is allowing the climate crisis to continue in way we’ve seen, to give preference to the right of the elite to maintain their dominant position. Climate justice movements are continually framed as being outside legitimate political conversation. This is same language that governments use — they point their finger at radicals and position themselves as the voice of measured reason. NGOs employ the same game — they portray the climate justice movement as radical, depicting themselves as calm, collected and policy-literate. What we need is a 180 degree shift among those who for the last forty years have led the traditional climate movement. This strand of civil society, that dominates the political stage, that has the ear of governments and the media, tends to be made up of Northern NGOs. These are organisations who talk about the experiences of people in the Global South, but speak on their behalf. They have led the climate movement in a way that hasn’t really built a diverse and potent movement, that hasn’t given us a deep analysis of climate change, and hasn’t really achieved major successes. Until as a broad movement we are far more truthful about the urgency, until we are far more resolute in denouncing governments and corporations that are blocking change, until affected communities are listened to in the corridors of power, until their voices become anchors of the demands we make, then there will be little change. You’ve described yourself a “reluctant environmentalist”. In a way, “reluctant environmentalism” is something that has plagued a lot of the left or progressive community. Often there’s a tense relationship with ecology, sometimes rooted in concerns about jobs, other times rooted in a prioritization of social concerns over environmental concerns. Sure, there’s definitely a number of reasons why “the left” has a strained relationship with environmentalism. For instance, in the Global North, addressing climate change is frequently seen as an environmental issue. But many in the South don’t deconstruct their fights the way we do. They don’t distinguish between environmental, economic or political fights. They see it as a fight for justice, a fight for liberation. There’s also another problem, which is when movements simply state that climate change is such a systemic issue, and there is no solution but revolution. This reminds me of discussions I had in the early 1980s. I was at a meeting of a left party, and I raised the issue of pervasive racist violence in the UK, asking what could do about it. People were sympathetic, agreeing with me that it was a very important issue, but the general response was: “do you know comrade, that the only way to eradicate racism is to overthrow capitalism? Racism will be solved when the revolution comes!” I said, “that’s not a message I will take back to my community, that we have to wait until the revolution.” I believed that tackling racism would be how we delivered social transformation. Similarly tackling climate change is how we can realise the transformation needed and be able to have a positive vision for the future. When you change the way we produce and consume energy, the way we produce and consume food, you’re talking about a very different kind of world. You’re talking about displacing some of the most powerful companies on the planet — those that control most of the food supply, those that bankroll the political establishment, those that receive trillions of dollars in public subsidies, those that are responsible for most of global emissions. Asad Rehman, speaking at an event on the expansion Heathrow Airport, 2016. Photo Credit: Campaign Against Airport Expansion. If you’re interested in changing our current destructive and unsustainable economic model, we need to give people the opportunity to understand how that model is working, who it benefits and what can be done to make something different. You have to use a language which resonates with people’s ordinary lives, with their local realities. We can ultimately only win through local fights spurred on by a global vision. Climate change is a platform that can allow us to do that. We can braid together local fights to build the strength for genuine transformation across the world. How does that strength get built? First and foremost, the climate justice movement needs to be honest with itself. We have a very challenging carbon budget before us. We have about three to five years left before we extinguish the possibility of staying below 1.5°C. We have maybe another fifteen years before 2°C becomes implausible. We are in Decade Zero: the decisions we take over the next ten years determine the temperature guardrails we breach, the lines of life. That’s our timeline. We need to act now and our victories have to happen in the next five, maximum ten years. We are in Decade Zero: the decisions we take over the next ten years determine the temperature guardrails we breach, the lines of life. That’s our timeline. We need to act now and our victories have to happen in the next five, maximum ten years. We also have to be honest about our context. The forces of neoliberalism and corporatism are getting stronger. Politics has moved to the right. Progressive movements and governments are on the retreat. Social-democratic forces are failing. When the climate crisis demands internationalism, nationalism is gaining relevance; the narrative of most government is affirming that their central priority is to protect their economy, their citizens. So what is our alternative? We need a compelling way of talking about the climate crisis, the economic crisis, and the political crisis. Not just a critique, not an abstraction, but a real package of solutions, an alternative. Seattle kayaktivists take action for renewable energy. Photo Credit: Backbone Campaign. Our solutions are the very solutions that create a different world. Dismantling carbon-heavy economies in a just way can be invariably positive, as it allows for people to have healthier, safer, better lives. By shifting away from dirty energy, moving towards democratic clean energy, supporting agro-ecology, establishing better public transport networks, reshaping our cities, delivering land rights, and supporting afforestation, we can allow ourselves to creatively imagine and implement new alternatives. What is our alternative? We need a compelling way of talking about the climate crisis, the economic crisis, and the political crisis. Not just a critique, not an abstraction, but a real package of solutions, an alternative. That’s not a hard thing for us to put together and say: here’s our story. But we need clarity. The right is phenomenal at clarity. You hear their demagogues and it’s clear: taking back control, giving you jobs, standing up for you, draining the swamp. On the left, we project ambiguity. We rarely give clear answers on economic policy, on immigration. The response is a “it’s a bit complicated”. We also need to think tactically. Which are the transformational fights we need to fight? What are the forces we need? These questions put us face to face with hard realities. We have limited time and resources. We can’t try work on every issue or fight all fires at once. So what are our collective fights? What are the fights that are transformational, that mean that if we win them, they have a potent knock-on effect? Is our movement set up in a way that gives us the best chances of success? These are difficult questions, because they involve making decisions about how to allocate resources, where to devote capacity, what to prioritize. But we’re in a war where we’re trying to save the lives of the people and our planet. And we have to decide pretty promptly what tactics we need to use. What do you think are those transformational fights? Well there are many. The world is complex and the manifestations of those fights will be different on a local level. But it’s worth making distinctions: there are fights we should fight, and fights we cannot lose. When it comes to tackling the climate crisis, that requires tackling three key areas: energy, food, and forests. When you look at energy specifically, we know that we cannot allow the fossil fuel industry to exploit new fossil fuel sources. In the North, that means that we have to stop much more than fracking. We have to fight coal, we have to fight multinational investments in fossil fuels, and we have stop the false “clean” transition from coal into gas, which would be nothing but a farewell tour to 2C. There is however a fight that we have to fight without choice and that is the migration fight. If we lose the migration fight, we lose the politics of justice. Every second a person is being displaced. One in 30 will be displaced from their homes by 2050. Most people are displaced internally, or into other poorer countries. The voices of neoliberalism are using migration as a way to talk to people who have been failed by the system. We need to speak to those people, and we need to reframe migration with clarity: the issue is not migration, it’s the power of corporations and our governments. Reframing migration can help us put forward an alternative vision that shows what we have in common. The story of migration is a story about people, a story about what drives displacement, a story about the reality of the world. And talking about our response to migration means we talk about our responsibilities to our citizens and fellow human beings. It means changing the way we look at the world. The voices of neoliberalism are using migration as a way to talk to people who have been failed by the system. We need to speak to those people, and we need to reframe migration with clarity: the issue is not migration, it’s the power of corporations and our governments. Asad Rehman addresses This Changes Everything, 2015. Photo Credit: Ana Parra. That moral vision is not some wild impossibility. We’ve done it before: we did it with slavery, when people said they would support struggles for emancipation. We’ve done with colonialism and imperialism, when people supported struggles for liberation. And we’ll do it again, supporting struggles to stop the destruction of people’s homes and livelihoods. To get there, we need to broadly agree on a theory of change. Most people recognize that only the power of people — real movement-building — is what can create the kind of power needed to be able to make truly transformational changes. The environmental movement is increasingly aware that it cannot win on climate change alone — from a practical point of view, they have to build power. Building power means going and organising people, where they are. It means listening to the daily issues people face and working from there. The only solution to our weakness is solidarity. To win what we need to win, we have to do lateral movement-building. The silos that divide us will have to disappear. We’ll have to be able to sit together as organizations and movements and say: these are fights we need to win, and we’re going to collectively prioritise those. It’s a challenge, but everything seems impossible until it starts to get possible. This is what you have to get people to realize. Donald Trump has recently been inaugurated as the president of the United States. As a final note, how would you describe the times we find ourselves in. And do you see any hope on the horizon? Trump’s victory is desperately worrying. The right are certainly ascendant, and we live in troubled times. But we can’t forget that much of the narrative they are using was our narrative: the narrative of the global justice movement. Failed globalization, inequality, the left behind, political elites not caring for you…those were our top line messages! We can’t forget that much of the narrative [the right] are using was our narrative: the narrative of the global justice movement. Failed globalization, inequality, the left behind, political elites not caring for you…those were our top line messages! So why have so many people been captured by the right? Why aren’t those people with us? What was our mistake? That’s a reflection we need to undertake. Is that because we spent more of our time speaking to each other, rather than going out and speaking to ordinary people? Is our language or our way of organising inaccessible? Progressive movements have vacated many spaces. There are abandoned estates, towns, and cities where the left used to be, engaging in real solidarity and organising. Today we’ve become over-attached to clicktivism, to our Facebook posts and Twitter threads. These are useful tools but they’re not the answer. If you look at the right everywhere, in Europe and elsewhere, they are going to the spaces where the left used to be. Dump Trump Protest, New York City, 2016. Photo Credit: ResistFromDay1 (Flickr). As for hope, whilst it is absolutely clear that Trump is a horrific individual with a horrifying agenda, the one positive thing about his election is that he has forced movements together. Whether you’re black or Muslim or transgender or a climate activist or against poverty — you now have a common enemy. That forces movements to unite and say clearly that an injury to one is an injury to all. I’m hoping that the consequence of his election is that we all start saying, whoever he comes for, we’ll come for him. I’m hoping that the politics of division and persecution will force movements into the politics of solidarity. The unfolding horror of the world needs to be a fuel we use in our favour. ", "child": "1818_11818_1"}