{"name": "1841", "parent": "", "title": "The Literature Professor", "sentences": [{"5315": "The Literature Professor"}, {"3dcf": "PROFESSOR HIGGENBOTHOM …and that just about wraps it up today, folks. Don’t forget to read pages 119–146 in “The Idea of Truth is a Lie” and send me your thesis statements by Monday."}, {"3b71": "All of the students in the class leave except for Trevor, an 18 year old freshman. He is a bro, a skater-dude stoner, reminiscent of a young Keanu Reeves."}, {"b5f7": "TREVOR: Professor — I’ve been having some difficulty with my thesis statement for the final paper."}, {"55d6": "PROFESSOR HIGGENBOTHOM: Stop by my office hours later today, Trevor, and we’ll discuss it."}, {"4556": "TREVOR: Ok, but…I stopped by your office yesterday, remember? You were sitting at your desk, but when I walked in, you screamed and told me that you had already stepped out for lunch."}, {"ae5f": "PROFESSOR HIGGENBOTHOM: I had!"}, {"3315": "TREVOR: But you were sitting right there at your desk, professor!"}, {"5060": "PROFESSOR HIGGENBOTHOM: Oh Trevor. Will you frat boys never learn?"}, {"9ae4": "TREVOR: But I’m not in a fra —"}, {"88c1": "PROFESSOR HIGGENBOTHOM (interrupting) I have been trying to instill this in you from day 1. It is not fashionable to talk about “real people existing.” And since there is no truth, you cannot say that I was sitting at my desk, because you do not in fact know that I was sitting at my desk."}, {"0ec0": "TREVOR: Sir, I saw you. With my own eyes. And I see you right now too."}, {"72b0": "PROFESSOR HIGGENBOTHOM (snickering arrogantly) Foolish boy. Everything in the world is subjective. Everybody sees what they want to see. It’s all open to interpretation. To say that there are things called “eyes” — to believe, even, that the “I” in the sentence “I see you” refers to anything is — quite simply — false."}, {"6c1a": "TREVOR: But how could something be false if nothing is true?"}, {"1aee": "PROFESSOR HIGGENBOTHOM I never said that nothing is true, Trevor. To the contrary, I said: “there is no truth.”"}, {"9477": "Trevor’s mouth opens and he fumbles to speak."}, {"bebc": "PROFESSOR HIGGENBOTHOM (CONT’D) You see, Trevor, the diférance between you and I is that I have been thinking about these matters for much longer than you have."}, {"a7d4": "TREVOR: I understand that, professor."}, {"5838": "(Thinking for a moment)"}, {"1018": "TREVOR (CONT’D) Ok, so let me get this straight. If nothing is true —"}, {"84e8": "PROFESSOR HIGGENBOTHOM (interrupting him again) No. Not “nothing is true.” “There is no truth.” The difference between those two sentences is enormous. Gargantuan."}, {"45a2": "TREVOR Don’t you mean “diférance”, not “difference”?"}, {"10b6": "PROFESSOR HIGGENBOTHOM (slightly flustered)No. Of course not. The difference between diférance and difference is also gargantuan. (He pauses)Now, in terms of “truth”, there are two kinds. “Truth” with a capital “T” and “truth” with a lower case “t”. Now those are two very different concepts."}, {"2c25": "TREVOR: Right. (skeptical) On the first day of class, you told us that “Truth” with a capital “T” is bad and truth with a lower case “t” is good."}, {"62d3": "PROFESSOR HIGGENBOTHOM (annoyed) No! You are absolutely wrong there, Trevor. Why? Because there are no such things as “good” and “bad”. Those are two binaries, and you shouldn’t describe things in terms of binaries because it’s too simplistic. Hegemonic. Patriarchal. Logocentric. All that nasty stuff."}, {"765b": "(Pausing dramatically) Every white male on the planet, like yourself, would love to think that things can be either “good” or “bad”. But that’s just naiveté. And racist."}, {"4af6": "TREVOR (looking surprised and hurt) Why is that racist, professor? We weren’t even talking about —"}, {"95c4": "PROFESSOR HIGGENBOTHOM: Nevermind, it doesn’t matter. So do you understand the assignment or don’t you, Trevor?"}, {"9b55": "TREVOR I’m still a bit confused, to be honest."}, {"0253": "(Looking down at his notes) The other day in class, you told us that all art is subjective."}, {"5520": "PROFESSOR HIGGENBOTHOM (jumping in) Just one second, Trevor. Now, that’s not what I said at all. If you had been listening, you would have heard me say that all art is open to interpretation."}, {"b092": "TREVOR: And that everyone’s interpretation of a work of art is just as good as anyone else’s interpretation. Is that right?"}, {"cf51": "PROFESSOR HIGGENBOTHOM: Careful with your usage of the word “good” there, Trevor. Also the word “right”. You’re headed toward dangerous waters when you begin to describe things in binaries."}, {"5da2": "TREVOR: Um, ok. Sorry. (pause) So…I have a question. This is my last one, I promise."}, {"8d4c": "Professor Higgonbothom rolls his eyes."}, {"cfa8": "TREVOR (CONT’D): If there is no such thing as good and bad art, does that mean that my backpack over there could be art? It’s got a bunch of graffiti handwriting all over it."}, {"d3ab": "PROFESSOR HIGGENBOTHOM: No, Trevor. Now, I must be going. Have a good —"}, {"738a": "TREVOR: Is it wrong to murder an innocent child? I mean, since we can’t say that anything is good or bad."}, {"6d9c": "Professor Higgenbothom stops and thinks for a moment."}, {"5143": "PROFESSOR HIGGENBOTHOM: Yes. Of course it is, Trevor. It is wrong to kill innocent children. Alright? And, uh, maybe you could argue that your backpack is a work of art, ok?"}, {"69fb": "TREVOR: Ok, got it. Thanks professor!"}, {"e5e7": "Trevor runs out of the classroom."}, {"243e": "PROFESSOR HIGGENBOTHOM (to himself) My wife was right. These students are no good at Theory with a capital “T”. Some days I just wish I could murder all of them. Ain’t that the truth!"}], "content": "The Literature Professor PROFESSOR HIGGENBOTHOM …and that just about wraps it up today, folks. Don’t forget to read pages 119–146 in “The Idea of Truth is a Lie” and send me your thesis statements by Monday. All of the students in the class leave except for Trevor, an 18 year old freshman. He is a bro, a skater-dude stoner, reminiscent of a young Keanu Reeves. TREVOR: Professor — I’ve been having some difficulty with my thesis statement for the final paper. PROFESSOR HIGGENBOTHOM: Stop by my office hours later today, Trevor, and we’ll discuss it. TREVOR: Ok, but…I stopped by your office yesterday, remember? You were sitting at your desk, but when I walked in, you screamed and told me that you had already stepped out for lunch. PROFESSOR HIGGENBOTHOM: I had! TREVOR: But you were sitting right there at your desk, professor! PROFESSOR HIGGENBOTHOM: Oh Trevor. Will you frat boys never learn? TREVOR: But I’m not in a fra — PROFESSOR HIGGENBOTHOM (interrupting) I have been trying to instill this in you from day 1. It is not fashionable to talk about “real people existing.” And since there is no truth, you cannot say that I was sitting at my desk, because you do not in fact know that I was sitting at my desk. TREVOR: Sir, I saw you. With my own eyes. And I see you right now too. PROFESSOR HIGGENBOTHOM (snickering arrogantly) Foolish boy. Everything in the world is subjective. Everybody sees what they want to see. It’s all open to interpretation. To say that there are things called “eyes” — to believe, even, that the “I” in the sentence “I see you” refers to anything is — quite simply — false. TREVOR: But how could something be false if nothing is true? PROFESSOR HIGGENBOTHOM I never said that nothing is true, Trevor. To the contrary, I said: “there is no truth.” Trevor’s mouth opens and he fumbles to speak. PROFESSOR HIGGENBOTHOM (CONT’D) You see, Trevor, the diférance between you and I is that I have been thinking about these matters for much longer than you have. TREVOR: I understand that, professor. (Thinking for a moment) TREVOR (CONT’D) Ok, so let me get this straight. If nothing is true — PROFESSOR HIGGENBOTHOM (interrupting him again) No. Not “nothing is true.” “There is no truth.” The difference between those two sentences is enormous. Gargantuan. TREVOR Don’t you mean “diférance”, not “difference”? PROFESSOR HIGGENBOTHOM (slightly flustered)No. Of course not. The difference between diférance and difference is also gargantuan. (He pauses)Now, in terms of “truth”, there are two kinds. “Truth” with a capital “T” and “truth” with a lower case “t”. Now those are two very different concepts. TREVOR: Right. (skeptical) On the first day of class, you told us that “Truth” with a capital “T” is bad and truth with a lower case “t” is good. PROFESSOR HIGGENBOTHOM (annoyed) No! You are absolutely wrong there, Trevor. Why? Because there are no such things as “good” and “bad”. Those are two binaries, and you shouldn’t describe things in terms of binaries because it’s too simplistic. Hegemonic. Patriarchal. Logocentric. All that nasty stuff. (Pausing dramatically) Every white male on the planet, like yourself, would love to think that things can be either “good” or “bad”. But that’s just naiveté. And racist. TREVOR (looking surprised and hurt) Why is that racist, professor? We weren’t even talking about — PROFESSOR HIGGENBOTHOM: Nevermind, it doesn’t matter. So do you understand the assignment or don’t you, Trevor? TREVOR I’m still a bit confused, to be honest. (Looking down at his notes) The other day in class, you told us that all art is subjective. PROFESSOR HIGGENBOTHOM (jumping in) Just one second, Trevor. Now, that’s not what I said at all. If you had been listening, you would have heard me say that all art is open to interpretation. TREVOR: And that everyone’s interpretation of a work of art is just as good as anyone else’s interpretation. Is that right? PROFESSOR HIGGENBOTHOM: Careful with your usage of the word “good” there, Trevor. Also the word “right”. You’re headed toward dangerous waters when you begin to describe things in binaries. TREVOR: Um, ok. Sorry. (pause) So…I have a question. This is my last one, I promise. Professor Higgonbothom rolls his eyes. TREVOR (CONT’D): If there is no such thing as good and bad art, does that mean that my backpack over there could be art? It’s got a bunch of graffiti handwriting all over it. PROFESSOR HIGGENBOTHOM: No, Trevor. Now, I must be going. Have a good — TREVOR: Is it wrong to murder an innocent child? I mean, since we can’t say that anything is good or bad. Professor Higgenbothom stops and thinks for a moment. PROFESSOR HIGGENBOTHOM: Yes. Of course it is, Trevor. It is wrong to kill innocent children. Alright? And, uh, maybe you could argue that your backpack is a work of art, ok? TREVOR: Ok, got it. Thanks professor! Trevor runs out of the classroom. PROFESSOR HIGGENBOTHOM (to himself) My wife was right. These students are no good at Theory with a capital “T”. Some days I just wish I could murder all of them. Ain’t that the truth! ", "child": "1841_1"}