{"name": "1844", "parent": "", "title": "We Came Here to be Naked", "sentences": [{"82dd": "We Came Here to be Naked"}, {"4622": "Juniper blue. Oak brush kinked. Strung. Fixing upwards. Rounded. Celestial bound."}, {"d3a7": "We are tied towards the sky in this same way. Fixated. Twisted. Wrung out. Squeezed between the branches. Altitude scorched."}, {"e819": "Heat — on skin, on hand, on breasts, on chapped lips. Arriving by dark. Tricked. A fooling."}, {"5e24": "The vortex between the Sangre de Cristo Range and the Rio Grande Forest is a confusing force."}, {"ffaf": "Blood is on this land. But it isn’t Christ’s. At least I don’t think it is."}, {"dd23": "The engineer cyclist. The inventor. Who had to go further and further away. Found himself here. To be found later — gone."}, {"9692": "I didn’t recite this story. Kept it to myself, the way I keep so many things now. Like secrets. This happens when you give things away. When your nature is to open like the valley, the spring, the range. The single dirt road that spans between and connects."}, {"46fe": "I felt it before I knew it was this territory. The distance. The dirt road. The gravel dust rising. Recognized why he came. How easy it would be to get lost here — forever."}, {"e42f": "Walking into the oak brush forest to reclaim our bodies in thick moss ponds. Starcovered. I can’t remember ever seeing stars this way. Maybe I haven’t looked up in a long time."}, {"755f": "Pressure opening into the essential gushing caverns of hot springs. Filled with small sea shells that somehow arrived in the middle of the continent. One blue marble. Slipping in the textures."}, {"6a89": "Remembering myself before I knew you. Timing is not a choice. Sometimes we just have to respect that."}, {"be7a": "In town, people wear smiles hung like a destiny on their faces. But they haven’t arrived yet."}, {"0446": "Smudging — who belongs."}, {"43e5": "Shunning — who doesn’t."}, {"e891": "Somebody should say what it means to love. How the sunset grows wider into the blue without collapsing. Collapse is what happens when the pyroclastic cloud’s structure succumbs to gravity. Caves in. Even rocks can stoke wildfire. This has value too. In some cases. Not this one."}, {"9aae": "I hear there is blood on this land."}, {"d410": "Being naked requires an unlayering. A stripping of the external. A submission to the sun, water, rocks, moss, oak, waning crescent, forest, dirt road. Each other."}, {"01a6": "We came here to be naked."}], "content": "We Came Here to be Naked Juniper blue. Oak brush kinked. Strung. Fixing upwards. Rounded. Celestial bound. We are tied towards the sky in this same way. Fixated. Twisted. Wrung out. Squeezed between the branches. Altitude scorched. Heat — on skin, on hand, on breasts, on chapped lips. Arriving by dark. Tricked. A fooling. The vortex between the Sangre de Cristo Range and the Rio Grande Forest is a confusing force. Blood is on this land. But it isn’t Christ’s. At least I don’t think it is. The engineer cyclist. The inventor. Who had to go further and further away. Found himself here. To be found later — gone. I didn’t recite this story. Kept it to myself, the way I keep so many things now. Like secrets. This happens when you give things away. When your nature is to open like the valley, the spring, the range. The single dirt road that spans between and connects. I felt it before I knew it was this territory. The distance. The dirt road. The gravel dust rising. Recognized why he came. How easy it would be to get lost here — forever. Walking into the oak brush forest to reclaim our bodies in thick moss ponds. Starcovered. I can’t remember ever seeing stars this way. Maybe I haven’t looked up in a long time. Pressure opening into the essential gushing caverns of hot springs. Filled with small sea shells that somehow arrived in the middle of the continent. One blue marble. Slipping in the textures. Remembering myself before I knew you. Timing is not a choice. Sometimes we just have to respect that. In town, people wear smiles hung like a destiny on their faces. But they haven’t arrived yet. Smudging — who belongs. Shunning — who doesn’t. Somebody should say what it means to love. How the sunset grows wider into the blue without collapsing. Collapse is what happens when the pyroclastic cloud’s structure succumbs to gravity. Caves in. Even rocks can stoke wildfire. This has value too. In some cases. Not this one. I hear there is blood on this land. Being naked requires an unlayering. A stripping of the external. A submission to the sun, water, rocks, moss, oak, waning crescent, forest, dirt road. Each other. We came here to be naked. ", "child": "1844_1\t1844_2"}