{"name": "185", "parent": "", "title": "Why I Turn Down Fulltime Jobs", "sentences": [{"15db": "Why I Turn Down Fulltime Jobs"}, {"d825": "This post originally appeared on my personal site. Follow me there to get notified of all the things I write in other places on the Internet as well."}, {"cf16": "9 months ago, I became a fulltime entrepreneur. Except for that summer where I worked for 6 weeks as a freelance interior and exterior painter (my father told me I should always have a skill like that, so I got one and it supported me through college) and those two weeks back in 2013, I’ve always worked for someone else."}, {"c89e": "When my hand was forced back in September 2015, I decided to work for myself and see what Credo and my consulting could turn into. I’ve been very fortunate to make great headway on both fronts and continue to do both (though increasingly more time and effort goes into Credo), and amazingly the bills are still being paid."}, {"f69d": "It’s been a tough ride at times, though. December through February were really hard psychologically, and I’ll admit that I’m still tempted every couple of weeks to just shut everything down, get rid of my clients, refund subscribers, and go get a fulltime job."}, {"88ca": "But I don’t, and here’s why."}, {"b5b6": "I was offered two Director of Marketing jobs within a few weeks of leaving my last gig last year, and since then been offered 3 more and had multiple companies say they wanted to discuss me working them fulltime and I told them know. And of course, along the way I had calls with a number more companies and recruiters where the company and I were a mutual bad fit. That happens."}, {"4bb3": "But I didn’t take any of the jobs offered me. This is why."}, {"4e6f": "I was messaging with an industry peer who recently left their fulltime job to go freelance. Here’s the advice I gave them:"}, {"325a": "Here’s my best advice — give yourself a timeline for minimum how long you want to do it. When I started, I said I need to work for myself for at least 12 months because I need to prove to myself I can do it. Makes it a lot easier to say no to other things that could distract you because of fear."}, {"fdd1": "I told myself that I needed to work for myself for 12 months. Anything shorter than that would feel like a failure to me."}, {"51ea": "Yours may be different. Maybe you need 24 months to prove that you can survive. Maybe you only have 6 months of runway and so you have a shortened timeline to make it work."}, {"a06a": "Whatever it is, if you decide to try working for yourself, give yourself a minimum amount of time before you head out on your own and enable yourself savings-wise to be able to do that."}, {"3ae7": "You can always go back and get another job. Don’t do it because you are scared or stressed or working for yourself is hard. Do it because you want to work for/with someone else and for no other reason."}], "content": "Why I Turn Down Fulltime Jobs This post originally appeared on my personal site. Follow me there to get notified of all the things I write in other places on the Internet as well. 9 months ago, I became a fulltime entrepreneur. Except for that summer where I worked for 6 weeks as a freelance interior and exterior painter (my father told me I should always have a skill like that, so I got one and it supported me through college) and those two weeks back in 2013, I’ve always worked for someone else. When my hand was forced back in September 2015, I decided to work for myself and see what Credo and my consulting could turn into. I’ve been very fortunate to make great headway on both fronts and continue to do both (though increasingly more time and effort goes into Credo), and amazingly the bills are still being paid. It’s been a tough ride at times, though. December through February were really hard psychologically, and I’ll admit that I’m still tempted every couple of weeks to just shut everything down, get rid of my clients, refund subscribers, and go get a fulltime job. But I don’t, and here’s why. I was offered two Director of Marketing jobs within a few weeks of leaving my last gig last year, and since then been offered 3 more and had multiple companies say they wanted to discuss me working them fulltime and I told them know. And of course, along the way I had calls with a number more companies and recruiters where the company and I were a mutual bad fit. That happens. But I didn’t take any of the jobs offered me. This is why. I was messaging with an industry peer who recently left their fulltime job to go freelance. Here’s the advice I gave them: Here’s my best advice — give yourself a timeline for minimum how long you want to do it. When I started, I said I need to work for myself for at least 12 months because I need to prove to myself I can do it. Makes it a lot easier to say no to other things that could distract you because of fear. I told myself that I needed to work for myself for 12 months. Anything shorter than that would feel like a failure to me. Yours may be different. Maybe you need 24 months to prove that you can survive. Maybe you only have 6 months of runway and so you have a shortened timeline to make it work. Whatever it is, if you decide to try working for yourself, give yourself a minimum amount of time before you head out on your own and enable yourself savings-wise to be able to do that. You can always go back and get another job. Don’t do it because you are scared or stressed or working for yourself is hard. Do it because you want to work for/with someone else and for no other reason. ", "child": "185_1185_1"}