{"name": "1867", "parent": "", "title": "Hope After a Dark Year", "sentences": [{"049a": "Hope After a Dark Year"}, {"299d": "Thoughts on 2015 and the New Year Ahead"}, {"0a9a": "With my birthday and the holidays wrapping up, and the new year rolling in, I think it is important that we reflect on all the things that happened this year, and where they are leaving us."}, {"d053": "There were some moments of hope and optimism, but they might not have the longevity that is needed for meaningful change. For example, following the U.S. Supreme Court ruling in favor of marriage equality, I wrote about the queer and trans movement’s need to find its way after becoming a single-issue movement with enormous financial backing."}, {"848a": "Sadly, this year has been a dark one for America and the rest of the world. Following the chaos of the rise of the Islamic State in Iraq and Syria in the past couple years, a gigantic wave of immigrants and refugees poured into Europe in 2015. This, compounded with several attacks in Paris and one in San Bernadino, led to dangerous xenophobic responses by some leaders and vocal politicians in the closing months of this year, which I wrote about in the Guardian."}, {"15a1": "If there is any indication to be read from this, we are certainly headed in a disturbing direction. Even worse, with the most brutal Presidential primary season in U.S. memory, shifting into an even more uncertain general election, 2016 promises to be even darker. There is no doubt that more awful events are going to happen, and that they are going to be exploited within minutes to achieve cheap political ends by targeting small segments of the population in the most expensive political contest in world history."}, {"23ea": "But, you ask, what can we do about it? Well, instead of waiting and hoping for things to get better, why don’t we work on our New Year’s Resolutions? We can set goals that we can all accomplish — simple goals, big and small, which can work toward a simple and humble, with no less noble objective: Make the world a better place. Do you have any ideas?"}, {"c11a": "Have a Happy New Year everyone."}], "content": "Hope After a Dark Year Thoughts on 2015 and the New Year Ahead With my birthday and the holidays wrapping up, and the new year rolling in, I think it is important that we reflect on all the things that happened this year, and where they are leaving us. There were some moments of hope and optimism, but they might not have the longevity that is needed for meaningful change. For example, following the U.S. Supreme Court ruling in favor of marriage equality, I wrote about the queer and trans movement’s need to find its way after becoming a single-issue movement with enormous financial backing. Sadly, this year has been a dark one for America and the rest of the world. Following the chaos of the rise of the Islamic State in Iraq and Syria in the past couple years, a gigantic wave of immigrants and refugees poured into Europe in 2015. This, compounded with several attacks in Paris and one in San Bernadino, led to dangerous xenophobic responses by some leaders and vocal politicians in the closing months of this year, which I wrote about in the Guardian. If there is any indication to be read from this, we are certainly headed in a disturbing direction. Even worse, with the most brutal Presidential primary season in U.S. memory, shifting into an even more uncertain general election, 2016 promises to be even darker. There is no doubt that more awful events are going to happen, and that they are going to be exploited within minutes to achieve cheap political ends by targeting small segments of the population in the most expensive political contest in world history. But, you ask, what can we do about it? Well, instead of waiting and hoping for things to get better, why don’t we work on our New Year’s Resolutions? We can set goals that we can all accomplish — simple goals, big and small, which can work toward a simple and humble, with no less noble objective: Make the world a better place. Do you have any ideas? Have a Happy New Year everyone. ", "child": "1867_1\t1867_2\t1867_3\t1867_4"}