{"name": "1869", "parent": "", "title": "The 52-Week Writing Challenge", "sentences": [{"4c67": "The 52-Week Writing Challenge"}, {"d632": "Pick a thing (anything!) Commit to it."}, {"66eb": "The Challenge"}, {"4800": "2017 is fast approaching and the beginning of the new year is obviously a ripe time to set goals and resolutions. The Writing Cooperative would like to challenge you to commit to writing on a weekly basis and to offer the support of a community of fellow writers committing to do the same."}, {"1c5a": "Sounds easy, right?"}, {"1de3": "Well, it can be!"}, {"3ac4": "The only rule is this: you commit to writing a thing (anything!) each week."}, {"0d8c": "You can define what that thing is. Everyone has different things they’re working on, different genres, different format preferences — so pick what appeals to you and challenge yourself to do it 52 times in 2017."}, {"2cb1": "Still confused? Here are some ideas you might consider:"}, {"19fa": "The possibilities are endless, and the choice is yours! The real challenge is in making the commitment to write this thing for 52 weeks."}, {"c660": "Set Yourself Up For Success"}, {"9613": "How often have you made a New Year’s Resolution and completely abandoned it by February? Maybe March?"}, {"1029": "Or, maybe you’ve made resolutions in the past and been successful in maintaining them? What makes the difference between success and failure when it comes to these resolutions? Let’s see…"}, {"d7df": "How To Participate"}, {"c497": "Step 1 is: choose your thing! Think about what you want to commit to writing for 52-weeks and tell us your goal as a response to this post! This can be as brief or as long as you’d like. This counts as week one! Have it posted by January 7th so you can be off and running for week 2."}, {"d198": "(Side note: If you’re joining us late, feel free to hop in at any time. Commit to your thing and go! The more, the merrier.)"}, {"28be": "Steps 2–52: write the things! Every week, write whatever it is you committed to producing. Publish it here on Medium, in whichever publication is appropriate for the content (or in no publication at all). Be sure to tag it with “52 Week Writing Challenge” using Medium’s tag feature so it’s easy to find all the stories from participating writers. Share your challenge material on Twitter and tag @WritingCoop or #coop52 so we can help share your stories, too!"}, {"ceec": "Various steps in between: check-in! We’ll periodically ask for check-ins from participants, whether on Medium or some other forum, to share updates on your progress. Is it going well? Are you struggling? Did you hate the topic you picked so you switched to a different one? Tell us. Tell other writers. Hold one another accountable."}, {"0d04": "We hope you’ll join us in committing to write! Here’s to a productive 2017!"}, {"cc64": "— The Writing Cooperative editors, Jessica Jungton, Sand Farnia 👽, Justin Cox 🌮, and Stella J."}], "content": "The 52-Week Writing Challenge Pick a thing (anything!) Commit to it. The Challenge 2017 is fast approaching and the beginning of the new year is obviously a ripe time to set goals and resolutions. The Writing Cooperative would like to challenge you to commit to writing on a weekly basis and to offer the support of a community of fellow writers committing to do the same. Sounds easy, right? Well, it can be! The only rule is this: you commit to writing a thing (anything!) each week. You can define what that thing is. Everyone has different things they’re working on, different genres, different format preferences — so pick what appeals to you and challenge yourself to do it 52 times in 2017. Still confused? Here are some ideas you might consider: The possibilities are endless, and the choice is yours! The real challenge is in making the commitment to write this thing for 52 weeks. Set Yourself Up For Success How often have you made a New Year’s Resolution and completely abandoned it by February? Maybe March? Or, maybe you’ve made resolutions in the past and been successful in maintaining them? What makes the difference between success and failure when it comes to these resolutions? Let’s see… How To Participate Step 1 is: choose your thing! Think about what you want to commit to writing for 52-weeks and tell us your goal as a response to this post! This can be as brief or as long as you’d like. This counts as week one! Have it posted by January 7th so you can be off and running for week 2. (Side note: If you’re joining us late, feel free to hop in at any time. Commit to your thing and go! The more, the merrier.) Steps 2–52: write the things! Every week, write whatever it is you committed to producing. Publish it here on Medium, in whichever publication is appropriate for the content (or in no publication at all). Be sure to tag it with “52 Week Writing Challenge” using Medium’s tag feature so it’s easy to find all the stories from participating writers. Share your challenge material on Twitter and tag @WritingCoop or #coop52 so we can help share your stories, too! Various steps in between: check-in! We’ll periodically ask for check-ins from participants, whether on Medium or some other forum, to share updates on your progress. Is it going well? Are you struggling? Did you hate the topic you picked so you switched to a different one? Tell us. Tell other writers. Hold one another accountable. We hope you’ll join us in committing to write! Here’s to a productive 2017! — The Writing Cooperative editors, Jessica Jungton, Sand Farnia 👽, Justin Cox 🌮, and Stella J. ", "child": "1869_1\t1869_2\t1869_3\t1869_4\t1869_5\t1869_6\t1869_7\t1869_8\t1869_9\t1869_10\t1869_11\t1869_12\t1869_13\t1869_14\t1869_15\t1869_16\t1869_17\t1869_18\t1869_19\t1869_20\t1869_21\t1869_22\t1869_23\t1869_241869_1\t1869_2\t1869_3\t1869_4\t1869_5\t1869_6\t1869_7\t1869_8\t1869_9\t1869_10\t1869_11\t1869_12\t1869_13\t1869_14\t1869_15\t1869_16\t1869_17\t1869_18\t1869_19\t1869_20\t1869_21\t1869_22\t1869_23\t1869_241869_1\t1869_2\t1869_3\t1869_4\t1869_5\t1869_6\t1869_7\t1869_8\t1869_9\t1869_10\t1869_11\t1869_12\t1869_13\t1869_14\t1869_15\t1869_16\t1869_17\t1869_18\t1869_19\t1869_20\t1869_21\t1869_22\t1869_23\t1869_241869_1\t1869_2\t1869_3\t1869_4\t1869_5\t1869_6\t1869_7\t1869_8\t1869_9\t1869_10\t1869_11\t1869_12\t1869_13\t1869_14\t1869_15\t1869_16\t1869_17\t1869_18\t1869_19\t1869_20\t1869_21\t1869_22\t1869_23\t1869_241869_1\t1869_2\t1869_3\t1869_4\t1869_5\t1869_6\t1869_7\t1869_8\t1869_9\t1869_10\t1869_11\t1869_12\t1869_13\t1869_14\t1869_15\t1869_16\t1869_17\t1869_18\t1869_19\t1869_20\t1869_21\t1869_22\t1869_23\t1869_24"}