{"name": "1878", "parent": "", "title": "Book Review: ", "sentences": [{"1f81": "Book Review: Stories by Rudyard Kipling"}, {"2908": "Back in college I had this dream of meeting a girl in a café. Here’s how I imagined it would happen: I’d be sitting there reading some book, and the book would pique her interest enough to make her come say hello."}, {"e5d8": "Certainly, I’m not the only literature major to have entertained this fantasy."}, {"6cfa": "I’ve spent a lot of time wondering what book, if any, could have this power. And I think I may have finally found it: Stories by Rudyard Kipling."}, {"8503": "Behold: Gold foil inlays in a red cover. A wide pink ribbon to keep your place. Illustrations accented with red. Pages edged in gold. Never mind the old adage about books and covers. When I discovered this beauty in my favorite used book store, I simply had to buy it."}, {"6279": "Sometime after the thrill of my purchase had worn off I realized that I knew absolutely nothing about Rudyard Kipling, so I immersed myself in extensive scholarly research. My findings were rather disappointing."}, {"c22d": "Here’s what I learned. Kipling (1865–1936), beloved author of The Jungle Book, was the youngest recipient of the Nobel Prize for Literature. He was also a pro-war propagandist, encouraging the British Empire’s imperialist intentions with his short stories and poems. The most famous of these works was “The White Man’s Burden,” which begins with the following:"}, {"4139": "Take up the White Man’s burden, Send forth the best ye breed"}, {"fc2d": "Go bind your sons to exile, to serve your captives’ need;"}, {"09ce": "To wait in heavy harness, On fluttered folk and wild —"}, {"5414": "Your new-caught, sullen peoples, Half-devil and half-child."}, {"7eea": "He wasn’t paying lip-service, either. Kipling did in fact “send forth the best [he bred]” and helped his son, John, enlist in the British Army despite repeatedly failing the eye exam. (John would later be killed in action at age 18.) I therefore began reading Stories with a rather nasty notion of Kipling: racist, imperialistic, and maybe even a bit heartless."}, {"395f": "But the more I read, the more trouble I had reconciling these short stories with my vision of their author. Kipling’s view of war is repeatedly put into question, beginning with the first story, “In the Matter of a Private.” The eponymous character is Private Simmons, whose platoon is stationed somewhere in India. He and his comrades’ mostly do nothing; their primary mission appears to be surviving the dual threat of boredom and heat exhaustion. Another soldier, Private Losson, whiles away the time by training his pet parrot to call Simmons names like “pig,” and one day Simmons snaps. He grabs his rifle, kills Losson with a bullet to the neck, and starts firing at his other comrades from afar. The narrator explains the episode with the following analogy:"}, {"91c6": "People who have seen say that one of the quaintest spectacles of human frailty is an outbreak of hysterics in a girls’ school. It starts without warning, generally on a hot afternoon, among the elder pupils. A girl giggles till the giggle gets beyond control. Then she throws up her head, and cries, “Honk, honk, honk,” like wild goose, and tears mix with the laughter. […] Now, the Mother Superior of a Convent and the Colonel of a British Infantry Regiment would be justly shocked at any comparison being made between their respective charges. But it is a fact that, under certain circumstances, Thomas in bulk can be worked up into dithering, ripping hysteria."}, {"ac97": "This is not the gleaming portrait of a British soldier I’d expected from Kipling. It’s also not the only negative depiction of a soldier in this story. Simmons’ erratic shooting ends up wounding the Major of Gunners’ shoulder, at which point the Corporal springs into action and disarms Simmons with a swift takedown. This might seem like heroism, but the Corporal later confesses that he only intervened to gain the favor of the Major so that the Major would secure for him some horses for his wedding: “If I ‘adn’t ‘a’ wanted somethng, Sim might ha’ blowed [Major] Jerry Blazes’ boomin’ ‘ead into Hirish stew for aught I’d cared.” After the dust settles, the Corporal gets his horses and Simmons gets hanged."}, {"dc1a": "Some stories are accompanied by an illustration, like this one for “In the Matter of a Private.” All illustrations were done by American artist Howard Rogers."}, {"c0e5": "What can we make of the soldiers in this story? Hardly men of action, they pass the time until they die from drinking too much, cholera, mindless infighting, or their own gallows — and the narrator gives the impression that it doesn’t matter which. This, from the British Empire’s leading propagandist?"}, {"7a54": "I’m not cherry-picking from this story in particular, either. Most of the seventeen stories in this collection are about war and pretty much all of them are this negative. Take “On Greenhow Hill” as another example. The story opens with more senseless violence as an Indian deserter begins firing rounds at “his old comrades,” calling on them to help him fight the British. Trouble is, the deserter has accidentally navigated to the wrong camp and is mistakenly shouting and firing at the British themselves, who regard him as no more dangerous and no less annoying than a housefly. Out of boredom and sport, a trio of soldiers — Ortheris, a sharpshooter, and his buddies Learoyd and Mulvaney— decide to wait for the “bloomin’ deserter” on a hill and try to kill him when he returns."}, {"48cd": "As Ortheris sits with his rifle at the ready, Learoyd entertains him and Mulvaney with the story of his life before enlisting. Back in Yorkshire, Learoyd recounts, he drank too much one night and fell off a wall, breaking his arm and knocking himself out. He awoke in the home of a religious man was nursed back to health by his daughter, ‘Liza. The two began to fall in love, but just as they were about to get together, their relationship was cut off by tragic and unexpected news: ‘Liza was dying. Learoyd would visit her at her deathbed and give her one last hug before going to the army recruiting officer:"}, {"eaf2": "“‘Yo’ve seen your sweetheart?’ says [the recruiting officer]. ‘Yes, I’ve seen her,’ says I. ‘Well, we’ll have a quart now, and you’ll do your best to forget her,’ says he, being one o’ them smart, bustlin’ chaps. ‘Ay sergeant,’ says I. ‘Forget her.’ And I’ve been forgetting her ever since.”"}, {"eddd": "As Learoyd finishes his story, Ortheris spots the deserter in the distance and picks him off. “On Greenhow Hill” ends there, seemingly asking of Learoyd, You left your dying lover for this? The image of war that emerges is not dynamic and impassioned but lazy and aimless, a kind of purgatory where men go once their youth has expired."}, {"2751": "This dour view of war pervades Stories regardless of the setting. In “Mary Postgate,” war comes home to Britain. The title character is an attendant to the wealthy Miss Fowler, whose nephew Wynn recently joined the Flying Corps as a pilot. When Wynn dies in a training accident, Miss Fowler and Mary react stoically:"}, {"4c74": "“I never expected anything else,” said Miss Fowler; “but I’m sorry it happened before he had done anything.” […] “Yes,” [Mary] said. “It’s a great pity he didn’t die in action after he had killed somebody.”"}, {"6aa2": "At the funeral, Mary assuages her disappointment when she learns from one of Wynn’s flying companions that Wynn had fallen from “‘pretty nearly four thousand feet.’” “‘Then that’s all right,’” Mary replies. This measuring of Wynn’s death soon gives way to good-spirited housekeeping as the ladies “pull up the blinds” — a metaphor for the end of the grieving process, which Kipling will reuse in another story — and begin sorting Wynn’s things into three piles: keep, give away, burn. Making excellent use of Miss Fowler’s outdoor furnace, aka “the destructor,” Mary is almost finished destroying Wynn’s books and toys when she’s interrupted by an explosion nearby. She learns that a bomb has fallen from the sky and exploded, killing a nine-year-old girl. Upon returning to the furnace, Mary discovers a wounded bald man sitting below a tree: a German pilot who has crash-landed, presumably the man responsible for dropping the bomb."}, {"5b43": "Badly hurt, the German cries for help. Mary responds, “Stop that, you bloody pagan!” She — or more precisely, the omniscient narrator — further dehumanizes the German by calling him “the thing beneath the oak tree” and stating that Mary would only be satisfied once “It was dead.” Mary initially appears angry and hateful, but soon she grows annoyed at the inconvenience of having to wait for the soldier to die:"}, {"1a2d": "She looked at her wristwatch It was getting on to half-past four, and the rain was coming down in earnest. Tea would be at five. If It did not die before that time, she would be soaked and would have to change."}, {"51be": "Luckily for Mary, the German dies quickly so she has ample time to enjoy “a luxurious bath before tea.” Miss Fowler finds her “lying all relaxed on the sofa, ‘quite handsome!’” How nice for Mary that a trio of deaths has not spoiled her evening!"}, {"2568": "Here’s the point: Kipling is known for portraying the English — and particularly English women — as stoic and strong during wartime, but he carries this depiction so far that his characters hardly seem human. Two proper English women respond to the death of a loved one by sizing up his achievements and moving on as quickly as possible — Miss Fowler doesn’t even attend his funeral. Mary appears totally unfazed by the “ripped and shredded body” of the little girl. Arguably the most human character in the story is the German soldier, who “shed a tear” and “whimpered,” and whose eyes “were alive with expectation” upon seeing Mary and whose mouth “tried to smile” at her. Kipling ostensibly dehumanizes the German by calling him “It” and stripping him of pronouns — his head is “the head,” his mouth is “the mouth” — but actually does the opposite by making him the only character capable of feeling. Everyone else is icily pragmatic."}, {"4193": "“Mary Postgate,” then, is yet another of Kipling’s stories in which the utility of war and the morality of the people involved is put into question. “What waste it all is!” exclaims Mary as she sorts through Wynn’s possessions, and with this story in mind it seems like Kipling might have agreed."}, {"e3e2": "If these three stories reveal a cynical view of war, then they do so by trivializing its actors. A private who snaps after being called names; a selfish colonel; a sniper testing his aim; a pilot who dies on a training flight; an anonymous German soldier. Over and over, Kipling gives the sense that a soldier’s life means nothing."}, {"2800": "“The Gardener” is different. Unlike the stories discussed above, it was written after the death of Kipling’s son, and in fact Kipling began writing it on the same day he visited a war cemetery containing eleven thousand graves. Considered by some to be Kipling’s most evocative work, “The Gardener” tells the story of a woman named Helen Turrell, who took it upon herself to raise “her only brother’s unfortunate child,” Michael. It’s worth noting that “The Gardener” contains a famous twist, one that I’d rather not spoil for those who haven’t read it. The text is available here, and of all the stories in this collection I think this one most deserves a read. If you’d like a second opinion, American critic Edmund Wilson had this to say: “I am not sure that it is not really the best story that Kipling ever wrote.”"}, {"3987": "Anyway, once Michael comes of age he joins the army and eventually goes missing. The reader learns that he was killed by a “shell splinter” but the telegram Helen receives merely states that he is missing. “Missing always means dead,” Helen tells herself repeatedly as she lowers the blinds in her home, and thus the grieving process begins."}, {"70d3": "“The Gardener” is the only story in this collection in which the death of a soldier merits grieving, so it’s our first look at the process through Kipling’s eyes. Here’s how the narrator describes it:"}, {"f491": "Once, on one of Michael’s leaves, he had taken her over a munition factory, where she saw the progress of a shell from blank iron to the all-but-finished article. It struck her at the time that the wretched thing was never left alone for a single second; and “I’m being manufactured into a bereaved next of kin,” she told herself, as she prepared her documents."}, {"0b4e": "Later, when Michael’s body is found and reinterred in a military cemetery, Helen “[finds] herself moved on to another process of the manufacture — to a world full of exultant or broken relatives, now strong in the certainty that there was an altar upon earth where they might lay their love.” The reader follows Helen as she proceeds along the assembly line, journeying via train and boat, spending the night in one of the few hotels conveniently located near the cemetery, now filled to capacity with mourners. When she arrives at the cemetery, she finds it “still in the making” but already at twenty-thousand graves. Helen becomes disoriented in the “merciless sea of black crosses” but eventually finds a gardener who is able to help her locate Michael’s grave."}, {"c5d7": "Helen’s trip through the assembly line ends there, and so does the story. Manufacturing is a central theme, highlighting a universal lack of agency and individuality. Helen, of course, gets made into a generic “bereaved next of kin,” but she’s not alone. Michael “was to have gone up to Oxford” but “the war took him” and his Captain “headed him off and steered him directly to a commission in a Battalion.” His classmates, meanwhile, are grimly reduced to “the first holocaust of public-school boys who threw themselves into the Line.” We’ve seen this kind of mechanical dehumanization before — especially in “Mary Postgate” — but this time we have a believable and emotional character as our protagonist, so we can see things through her point of view. To that end, the language isn’t cynical and distant but vulnerable and intimate:"}, {"e51f": "Michael had died and her world had stood still and she had been one with the full shock of that arrest. Now she was standing still and the world was going forward, but it did not concern her — in no way or relation did it touch her."}, {"de8b": "This woman, whose world ends the day she loses Michael and who feels “agony,” is someone with whom the reader can identify, so “The Gardener” lands with far more force than Kipling’s other war stories. The reader is invited to consider how it feels to be in Helen’s situation, getting pushed through the stages of the bereavement “ritual” that has become customary in her village."}, {"5459": "Somehow the only person in Helen’s life capable of genuine sympathy is the gardener, who “look[s] at her with infinite compassion.” One cannot help but wonder whether this gentle gardener, “bending over his young plants,” is a stand-in for Kipling himself, who certainly could have identified with Helen’s situation, and who in fact joined the Imperial War Graves Commission after his son’s death."}, {"20bc": "These stories, which portray war as senseless, mundane, and heartbreaking, left me with a much different impression of Kipling than I had anticipated: one that’s more contemplative and human. I opened this book expecting to adamantly oppose the mindset central to Kipling’s war stories, but I ended up relating to his cynicism and empathizing with his characterization of loss. Stories is a disorienting read."}, {"e2c5": "Adding to confusion is the fact that today Kipling is best known not for his opinions on war but for his children’s stories, most notably The Jungle Book. There are a few likewise playful stories in this collection, including a fable called “The Cat that Walked by Himself,” and the silly but heartwarming story of a polo tournament told from the horses’ perspective. Occasionally Kipling puts his Romantic side on display, as in this excerpt from “They,” which explores the fleeting nature of youth and reads like Shelley:"}, {"667d": "Yet the late flowers — mallow of the wayside, scabious of the field, and dahlia of the garden — showed gay in the mist, and beyond the sea’s breath there was little sign of decay in the leaf. Yet in the villages the house doors were all open, and barelegged, bareheaded children sat at ease on the damp doorsteps to shout “pip-pip” at the stranger."}, {"eb78": "Stories offers a broad but fleeting glimpse into Kipling’s morals, on which there is much dispute, and his talents, on which there is none. I admit, it’s a little bizarre to be introduced to such an important author so randomly. My first impression of Kipling comes through a posthumously published assortment of short stories, while I expect that most readers will have discovered him through The Jungle Book or perhaps a survey course on imperialism. No matter. I feel lucky to have stumbled upon his work in any form, and I found Stories rewarding and interesting. And to think — I bought this book purely on the hunch that something with a cover this beautiful simply must be worth reading. As for my café hypothesis… well, that remains unproven. If you’d like to do some field testing, feel free to borrow my copy."}], "content": "Book Review: Stories by Rudyard Kipling Back in college I had this dream of meeting a girl in a café. Here’s how I imagined it would happen: I’d be sitting there reading some book, and the book would pique her interest enough to make her come say hello. Certainly, I’m not the only literature major to have entertained this fantasy. I’ve spent a lot of time wondering what book, if any, could have this power. And I think I may have finally found it: Stories by Rudyard Kipling. Behold: Gold foil inlays in a red cover. A wide pink ribbon to keep your place. Illustrations accented with red. Pages edged in gold. Never mind the old adage about books and covers. When I discovered this beauty in my favorite used book store, I simply had to buy it. Sometime after the thrill of my purchase had worn off I realized that I knew absolutely nothing about Rudyard Kipling, so I immersed myself in extensive scholarly research. My findings were rather disappointing. Here’s what I learned. Kipling (1865–1936), beloved author of The Jungle Book, was the youngest recipient of the Nobel Prize for Literature. He was also a pro-war propagandist, encouraging the British Empire’s imperialist intentions with his short stories and poems. The most famous of these works was “The White Man’s Burden,” which begins with the following: Take up the White Man’s burden, Send forth the best ye breed Go bind your sons to exile, to serve your captives’ need; To wait in heavy harness, On fluttered folk and wild — Your new-caught, sullen peoples, Half-devil and half-child. He wasn’t paying lip-service, either. Kipling did in fact “send forth the best [he bred]” and helped his son, John, enlist in the British Army despite repeatedly failing the eye exam. (John would later be killed in action at age 18.) I therefore began reading Stories with a rather nasty notion of Kipling: racist, imperialistic, and maybe even a bit heartless. But the more I read, the more trouble I had reconciling these short stories with my vision of their author. Kipling’s view of war is repeatedly put into question, beginning with the first story, “In the Matter of a Private.” The eponymous character is Private Simmons, whose platoon is stationed somewhere in India. He and his comrades’ mostly do nothing; their primary mission appears to be surviving the dual threat of boredom and heat exhaustion. Another soldier, Private Losson, whiles away the time by training his pet parrot to call Simmons names like “pig,” and one day Simmons snaps. He grabs his rifle, kills Losson with a bullet to the neck, and starts firing at his other comrades from afar. The narrator explains the episode with the following analogy: People who have seen say that one of the quaintest spectacles of human frailty is an outbreak of hysterics in a girls’ school. It starts without warning, generally on a hot afternoon, among the elder pupils. A girl giggles till the giggle gets beyond control. Then she throws up her head, and cries, “Honk, honk, honk,” like wild goose, and tears mix with the laughter. […] Now, the Mother Superior of a Convent and the Colonel of a British Infantry Regiment would be justly shocked at any comparison being made between their respective charges. But it is a fact that, under certain circumstances, Thomas in bulk can be worked up into dithering, ripping hysteria. This is not the gleaming portrait of a British soldier I’d expected from Kipling. It’s also not the only negative depiction of a soldier in this story. Simmons’ erratic shooting ends up wounding the Major of Gunners’ shoulder, at which point the Corporal springs into action and disarms Simmons with a swift takedown. This might seem like heroism, but the Corporal later confesses that he only intervened to gain the favor of the Major so that the Major would secure for him some horses for his wedding: “If I ‘adn’t ‘a’ wanted somethng, Sim might ha’ blowed [Major] Jerry Blazes’ boomin’ ‘ead into Hirish stew for aught I’d cared.” After the dust settles, the Corporal gets his horses and Simmons gets hanged. Some stories are accompanied by an illustration, like this one for “In the Matter of a Private.” All illustrations were done by American artist Howard Rogers. What can we make of the soldiers in this story? Hardly men of action, they pass the time until they die from drinking too much, cholera, mindless infighting, or their own gallows — and the narrator gives the impression that it doesn’t matter which. This, from the British Empire’s leading propagandist? I’m not cherry-picking from this story in particular, either. Most of the seventeen stories in this collection are about war and pretty much all of them are this negative. Take “On Greenhow Hill” as another example. The story opens with more senseless violence as an Indian deserter begins firing rounds at “his old comrades,” calling on them to help him fight the British. Trouble is, the deserter has accidentally navigated to the wrong camp and is mistakenly shouting and firing at the British themselves, who regard him as no more dangerous and no less annoying than a housefly. Out of boredom and sport, a trio of soldiers — Ortheris, a sharpshooter, and his buddies Learoyd and Mulvaney— decide to wait for the “bloomin’ deserter” on a hill and try to kill him when he returns. As Ortheris sits with his rifle at the ready, Learoyd entertains him and Mulvaney with the story of his life before enlisting. Back in Yorkshire, Learoyd recounts, he drank too much one night and fell off a wall, breaking his arm and knocking himself out. He awoke in the home of a religious man was nursed back to health by his daughter, ‘Liza. The two began to fall in love, but just as they were about to get together, their relationship was cut off by tragic and unexpected news: ‘Liza was dying. Learoyd would visit her at her deathbed and give her one last hug before going to the army recruiting officer: “‘Yo’ve seen your sweetheart?’ says [the recruiting officer]. ‘Yes, I’ve seen her,’ says I. ‘Well, we’ll have a quart now, and you’ll do your best to forget her,’ says he, being one o’ them smart, bustlin’ chaps. ‘Ay sergeant,’ says I. ‘Forget her.’ And I’ve been forgetting her ever since.” As Learoyd finishes his story, Ortheris spots the deserter in the distance and picks him off. “On Greenhow Hill” ends there, seemingly asking of Learoyd, You left your dying lover for this? The image of war that emerges is not dynamic and impassioned but lazy and aimless, a kind of purgatory where men go once their youth has expired. This dour view of war pervades Stories regardless of the setting. In “Mary Postgate,” war comes home to Britain. The title character is an attendant to the wealthy Miss Fowler, whose nephew Wynn recently joined the Flying Corps as a pilot. When Wynn dies in a training accident, Miss Fowler and Mary react stoically: “I never expected anything else,” said Miss Fowler; “but I’m sorry it happened before he had done anything.” […] “Yes,” [Mary] said. “It’s a great pity he didn’t die in action after he had killed somebody.” At the funeral, Mary assuages her disappointment when she learns from one of Wynn’s flying companions that Wynn had fallen from “‘pretty nearly four thousand feet.’” “‘Then that’s all right,’” Mary replies. This measuring of Wynn’s death soon gives way to good-spirited housekeeping as the ladies “pull up the blinds” — a metaphor for the end of the grieving process, which Kipling will reuse in another story — and begin sorting Wynn’s things into three piles: keep, give away, burn. Making excellent use of Miss Fowler’s outdoor furnace, aka “the destructor,” Mary is almost finished destroying Wynn’s books and toys when she’s interrupted by an explosion nearby. She learns that a bomb has fallen from the sky and exploded, killing a nine-year-old girl. Upon returning to the furnace, Mary discovers a wounded bald man sitting below a tree: a German pilot who has crash-landed, presumably the man responsible for dropping the bomb. Badly hurt, the German cries for help. Mary responds, “Stop that, you bloody pagan!” She — or more precisely, the omniscient narrator — further dehumanizes the German by calling him “the thing beneath the oak tree” and stating that Mary would only be satisfied once “It was dead.” Mary initially appears angry and hateful, but soon she grows annoyed at the inconvenience of having to wait for the soldier to die: She looked at her wristwatch It was getting on to half-past four, and the rain was coming down in earnest. Tea would be at five. If It did not die before that time, she would be soaked and would have to change. Luckily for Mary, the German dies quickly so she has ample time to enjoy “a luxurious bath before tea.” Miss Fowler finds her “lying all relaxed on the sofa, ‘quite handsome!’” How nice for Mary that a trio of deaths has not spoiled her evening! Here’s the point: Kipling is known for portraying the English — and particularly English women — as stoic and strong during wartime, but he carries this depiction so far that his characters hardly seem human. Two proper English women respond to the death of a loved one by sizing up his achievements and moving on as quickly as possible — Miss Fowler doesn’t even attend his funeral. Mary appears totally unfazed by the “ripped and shredded body” of the little girl. Arguably the most human character in the story is the German soldier, who “shed a tear” and “whimpered,” and whose eyes “were alive with expectation” upon seeing Mary and whose mouth “tried to smile” at her. Kipling ostensibly dehumanizes the German by calling him “It” and stripping him of pronouns — his head is “the head,” his mouth is “the mouth” — but actually does the opposite by making him the only character capable of feeling. Everyone else is icily pragmatic. “Mary Postgate,” then, is yet another of Kipling’s stories in which the utility of war and the morality of the people involved is put into question. “What waste it all is!” exclaims Mary as she sorts through Wynn’s possessions, and with this story in mind it seems like Kipling might have agreed. If these three stories reveal a cynical view of war, then they do so by trivializing its actors. A private who snaps after being called names; a selfish colonel; a sniper testing his aim; a pilot who dies on a training flight; an anonymous German soldier. Over and over, Kipling gives the sense that a soldier’s life means nothing. “The Gardener” is different. Unlike the stories discussed above, it was written after the death of Kipling’s son, and in fact Kipling began writing it on the same day he visited a war cemetery containing eleven thousand graves. Considered by some to be Kipling’s most evocative work, “The Gardener” tells the story of a woman named Helen Turrell, who took it upon herself to raise “her only brother’s unfortunate child,” Michael. It’s worth noting that “The Gardener” contains a famous twist, one that I’d rather not spoil for those who haven’t read it. The text is available here, and of all the stories in this collection I think this one most deserves a read. If you’d like a second opinion, American critic Edmund Wilson had this to say: “I am not sure that it is not really the best story that Kipling ever wrote.” Anyway, once Michael comes of age he joins the army and eventually goes missing. The reader learns that he was killed by a “shell splinter” but the telegram Helen receives merely states that he is missing. “Missing always means dead,” Helen tells herself repeatedly as she lowers the blinds in her home, and thus the grieving process begins. “The Gardener” is the only story in this collection in which the death of a soldier merits grieving, so it’s our first look at the process through Kipling’s eyes. Here’s how the narrator describes it: Once, on one of Michael’s leaves, he had taken her over a munition factory, where she saw the progress of a shell from blank iron to the all-but-finished article. It struck her at the time that the wretched thing was never left alone for a single second; and “I’m being manufactured into a bereaved next of kin,” she told herself, as she prepared her documents. Later, when Michael’s body is found and reinterred in a military cemetery, Helen “[finds] herself moved on to another process of the manufacture — to a world full of exultant or broken relatives, now strong in the certainty that there was an altar upon earth where they might lay their love.” The reader follows Helen as she proceeds along the assembly line, journeying via train and boat, spending the night in one of the few hotels conveniently located near the cemetery, now filled to capacity with mourners. When she arrives at the cemetery, she finds it “still in the making” but already at twenty-thousand graves. Helen becomes disoriented in the “merciless sea of black crosses” but eventually finds a gardener who is able to help her locate Michael’s grave. Helen’s trip through the assembly line ends there, and so does the story. Manufacturing is a central theme, highlighting a universal lack of agency and individuality. Helen, of course, gets made into a generic “bereaved next of kin,” but she’s not alone. Michael “was to have gone up to Oxford” but “the war took him” and his Captain “headed him off and steered him directly to a commission in a Battalion.” His classmates, meanwhile, are grimly reduced to “the first holocaust of public-school boys who threw themselves into the Line.” We’ve seen this kind of mechanical dehumanization before — especially in “Mary Postgate” — but this time we have a believable and emotional character as our protagonist, so we can see things through her point of view. To that end, the language isn’t cynical and distant but vulnerable and intimate: Michael had died and her world had stood still and she had been one with the full shock of that arrest. Now she was standing still and the world was going forward, but it did not concern her — in no way or relation did it touch her. This woman, whose world ends the day she loses Michael and who feels “agony,” is someone with whom the reader can identify, so “The Gardener” lands with far more force than Kipling’s other war stories. The reader is invited to consider how it feels to be in Helen’s situation, getting pushed through the stages of the bereavement “ritual” that has become customary in her village. Somehow the only person in Helen’s life capable of genuine sympathy is the gardener, who “look[s] at her with infinite compassion.” One cannot help but wonder whether this gentle gardener, “bending over his young plants,” is a stand-in for Kipling himself, who certainly could have identified with Helen’s situation, and who in fact joined the Imperial War Graves Commission after his son’s death. These stories, which portray war as senseless, mundane, and heartbreaking, left me with a much different impression of Kipling than I had anticipated: one that’s more contemplative and human. I opened this book expecting to adamantly oppose the mindset central to Kipling’s war stories, but I ended up relating to his cynicism and empathizing with his characterization of loss. Stories is a disorienting read. Adding to confusion is the fact that today Kipling is best known not for his opinions on war but for his children’s stories, most notably The Jungle Book. There are a few likewise playful stories in this collection, including a fable called “The Cat that Walked by Himself,” and the silly but heartwarming story of a polo tournament told from the horses’ perspective. Occasionally Kipling puts his Romantic side on display, as in this excerpt from “They,” which explores the fleeting nature of youth and reads like Shelley: Yet the late flowers — mallow of the wayside, scabious of the field, and dahlia of the garden — showed gay in the mist, and beyond the sea’s breath there was little sign of decay in the leaf. Yet in the villages the house doors were all open, and barelegged, bareheaded children sat at ease on the damp doorsteps to shout “pip-pip” at the stranger. Stories offers a broad but fleeting glimpse into Kipling’s morals, on which there is much dispute, and his talents, on which there is none. I admit, it’s a little bizarre to be introduced to such an important author so randomly. My first impression of Kipling comes through a posthumously published assortment of short stories, while I expect that most readers will have discovered him through The Jungle Book or perhaps a survey course on imperialism. No matter. I feel lucky to have stumbled upon his work in any form, and I found Stories rewarding and interesting. And to think — I bought this book purely on the hunch that something with a cover this beautiful simply must be worth reading. As for my café hypothesis… well, that remains unproven. If you’d like to do some field testing, feel free to borrow my copy. ", "child": "1878_1\t1878_2"}