{"name": "188", "parent": "", "title": "We own you", "sentences": [{"3e73": "We own you"}, {"3f69": "We own your time."}, {"6aa7": "We own your mind."}, {"9975": "We own your network."}, {"576d": "We own your influence."}, {"ff70": "We own your attention."}, {"2dbc": "We own your best ideas."}, {"1fc0": "We own your autonomy."}, {"29ab": "We own your reputation."}, {"ce48": "We own your daylight hours."}, {"e007": "We own your nighttime hours."}, {"24fd": "Your intellect is our property."}, {"f06f": "We’ll consume you."}, {"0d42": "And when you’ve lost your flavor,"}, {"ac51": "we’ll spit you out."}, {"b0b9": "Note: I’ve been lucky to work with great employers my whole life. I’ve never been fired. I’m grateful for these jobs. They’ve been happy with my work."}, {"cc31": "But since starting my professional life 17 years ago, I’ve seen many friends who “gave it all” as employees, only to be spit out when they were no longer needed."}, {"4bcb": "Increasingly, companies are demanding cult-like devotion. Do whatever it takes; sacrifice whatever you’ve got. It’s no longer enough to punch in, put in a solid day’s work, and go home. Now, you’re expected to be on Slack 24/7, use your social network to promote the company, recruit friends to the team, go to events in the evening, and use your personal equipment."}, {"f2c0": "All of this would be fine if employees benefited from their sacrifice in the same way their bosses do. But they don’t."}, {"9ad5": "A lot of of companies are also promoting a dangerous metaphor: “the team is your new family.”"}, {"15f7": "If you use the family metaphor you are implicitly promising employees security in exchange for loyalty."}, {"f902": "Bullshit! A business isn’t a bloodline. A business is a business, and anyone who treats it otherwise will be disappointed."}, {"c470": "Parents don’t “fire” their kids."}, {"ceef": "Ownership is the real metaphor. If you don’t believe me, listen to the way teams talk about their employees:"}, {"4f0d": "“Janice is our best asset.”"}, {"7286": "“Let’s headhunt Alan, he’d be valuable on our team.”"}, {"8d77": "“We keep our employees happy so they don’t leave.”"}, {"fd18": "“Let’s get rid of Betty, she’s not contributing to our bottom line.”"}, {"4e5b": "Why not say, “Janice is a great designer?” If a business is really a “family” then why not keep employees happy because it’s the right thing to do?"}, {"b5c2": "Because, they don’t love you; they want to own you."}, {"7836": "This pattern is evident with all sorts of employers, but let’s use startups as an example."}, {"08dc": "“Startups are like feudal society, and the founders are the lords.” — Ross Williamson (source)"}, {"c93a": "First, there’s a very high chance that the startup “you’re giving everything to” won’t succeed."}, {"4cb0": "If it does succeed, most of the spoils go to the original founder. At IPO, Mark Zuckerberg owned 28.2% of Facebook’s stock. His co-founder Dustin Moskovitz had 7.6%. Superstar COO Sheryl Sandberg? Less than 0.1%."}, {"d799": "Most startups have a similar ownership structure. And most won’t be as successful as Facebook. If your company gets acquired for $30 million (good luck!), your 0.1% is worth $30,000 (at best). Acquired for $1 million? You get $1,000. Crash and burn? 0.1% of zero is zero."}, {"b618": "At least a startup gives you a “lottery’s chance” of being rewarded as an employee."}, {"ed2f": "But a regular company can be worse."}, {"3c1b": "Lots of jobs have no equity, no profit sharing, and no bonuses. Just blind hope: “if I work really hard, maybe they’ll take care of me.” — Anonymous"}, {"9182": "What’s the solution?"}, {"17ce": "I don’t think you should give your best ideas to your employer."}, {"9de9": "Companies have no obligation to compensate you for your best work. Some do, which I applaud. But what’s your best work worth to you?"}, {"9d57": "When you give your best work to a corporation, you never get it back. They own it. It lives (or dies) with them."}, {"188a": "I think it’s fine to work a job. But you should make your own stuff. Don’t give it all at the office, and collapse on the couch sucked dry every night."}, {"3493": "Create a side-project. Do something independently. Carve out a piece of your life, and mold it your way."}, {"6083": "Make your own stuff."}, {"b545": "They own you."}, {"2ffc": "Want more inspiration? Listen to the MegaMaker podcast."}], "content": "We own you We own your time. We own your mind. We own your network. We own your influence. We own your attention. We own your best ideas. We own your autonomy. We own your reputation. We own your daylight hours. We own your nighttime hours. Your intellect is our property. We’ll consume you. And when you’ve lost your flavor, we’ll spit you out. Note: I’ve been lucky to work with great employers my whole life. I’ve never been fired. I’m grateful for these jobs. They’ve been happy with my work. But since starting my professional life 17 years ago, I’ve seen many friends who “gave it all” as employees, only to be spit out when they were no longer needed. Increasingly, companies are demanding cult-like devotion. Do whatever it takes; sacrifice whatever you’ve got. It’s no longer enough to punch in, put in a solid day’s work, and go home. Now, you’re expected to be on Slack 24/7, use your social network to promote the company, recruit friends to the team, go to events in the evening, and use your personal equipment. All of this would be fine if employees benefited from their sacrifice in the same way their bosses do. But they don’t. A lot of of companies are also promoting a dangerous metaphor: “the team is your new family.” If you use the family metaphor you are implicitly promising employees security in exchange for loyalty. Bullshit! A business isn’t a bloodline. A business is a business, and anyone who treats it otherwise will be disappointed. Parents don’t “fire” their kids. Ownership is the real metaphor. If you don’t believe me, listen to the way teams talk about their employees: “Janice is our best asset.” “Let’s headhunt Alan, he’d be valuable on our team.” “We keep our employees happy so they don’t leave.” “Let’s get rid of Betty, she’s not contributing to our bottom line.” Why not say, “Janice is a great designer?” If a business is really a “family” then why not keep employees happy because it’s the right thing to do? Because, they don’t love you; they want to own you. This pattern is evident with all sorts of employers, but let’s use startups as an example. “Startups are like feudal society, and the founders are the lords.” — Ross Williamson (source) First, there’s a very high chance that the startup “you’re giving everything to” won’t succeed. If it does succeed, most of the spoils go to the original founder. At IPO, Mark Zuckerberg owned 28.2% of Facebook’s stock. His co-founder Dustin Moskovitz had 7.6%. Superstar COO Sheryl Sandberg? Less than 0.1%. Most startups have a similar ownership structure. And most won’t be as successful as Facebook. If your company gets acquired for $30 million (good luck!), your 0.1% is worth $30,000 (at best). Acquired for $1 million? You get $1,000. Crash and burn? 0.1% of zero is zero. At least a startup gives you a “lottery’s chance” of being rewarded as an employee. But a regular company can be worse. Lots of jobs have no equity, no profit sharing, and no bonuses. Just blind hope: “if I work really hard, maybe they’ll take care of me.” — Anonymous What’s the solution? I don’t think you should give your best ideas to your employer. Companies have no obligation to compensate you for your best work. Some do, which I applaud. But what’s your best work worth to you? When you give your best work to a corporation, you never get it back. They own it. It lives (or dies) with them. I think it’s fine to work a job. But you should make your own stuff. Don’t give it all at the office, and collapse on the couch sucked dry every night. Create a side-project. Do something independently. Carve out a piece of your life, and mold it your way. Make your own stuff. They own you. Want more inspiration? Listen to the MegaMaker podcast. ", "child": "188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25188_1\t188_2\t188_3\t188_4\t188_5\t188_6\t188_7\t188_8\t188_9\t188_10\t188_11\t188_12\t188_13\t188_14\t188_15\t188_16\t188_17\t188_18\t188_19\t188_20\t188_21\t188_22\t188_23\t188_24\t188_25"}