{"name": "1885", "parent": "", "title": "So . . . It Turns Out Cancer Can Be Killed After All", "sentences": [{"dc54": "So . . . It Turns Out Cancer Can Be Killed After All"}, {"a778": "“Your lives are going to change forever,” the Urologist told us after removing a golf ball sized tumor from my wife’s bladder. “The cancer has spread into the muscle wall and the only course of action is to remove the bladder. We will have to attach a tube to the kidneys that comes out the side of her body and drains into a bag that she will wear for the rest of her life, much like a colostomy bag. The other option would be to create a neo bladder out of intestinal material, but that has more drawbacks.”"}, {"4167": "We went home and digested what we had been told. New levels of shock and fear descended upon us as we tried to cope with the news. My wife is only 53, how is this possible?"}, {"1717": "As we spoke with family, we were reminded that Kerry’s (my wife) sister and nephew had travelled to Germany to treat their cancer naturopathically, both successfully without surgery or chemotherapy; one stage 4 Melanoma and the other stage 3 squamous cell throat cancer. They had been cancer free for 4 and 3 years respectively."}, {"1726": "When we met with our USC Keck Medicine Urologist and asked him about this alternative, he looked us straight in the eye and said, “There is NO way you could deal with this cancer over there. The type of cancer you have is squamous cell and it is FAR to aggressive.”"}, {"440e": "Now came the hard part. We had to research naturopathic cancer treatment . . . what is it? For whom is it successful? Why if it works are so few using it? Are we risking our lives to do it? It had worked for Kerry’s two family members, but what if her cancer was different?"}, {"3992": "First thing we did was contact the treatment facility that was used, Infusio, and asked them if they treated squamous cell bladder cancer . . . they did, and quite successfully! They used heat and oxygen to kill it, and then vitamins, minerals and amino acids to strengthen the immune system, which kills the cancer as well. It turns out cancer cannot survive in certain environments, if you starve it, it has nothing to feed on and killing it becomes relatively easy. Cancer thrives on sugar, so the first thing Kerry did was pursue an aggressive diet heavy in fruits and vegetables with no refined sugar. Second, cancer cannot survive in a temperature exceeding 105 degrees Fahrenheit so Infusio uses a hyperthermia machine to direct the heat to one specific area in the body to fry the cancer cells while preserving all the normal cells around it. Third, blood is drawn out of the body, filled with oxygen and then re-inserted, much like Lance Armstrong did to win the Tour De France thereby creating an oxygen filled environment that cancer hates. Then finally they give daily drips 5 days a week, for a month, to detoxify the body and boost the immune system, things like Dioxychlor, GC-MAF, Vitamin B-17, Selenium, DMSO, and the ground up thymus of an organically fed cow."}, {"6c56": "Hyperthermia Machine doing it’s job"}, {"77f3": "We didn’t look back. We got right on a plane and started our adventure in Frankfurt, Germany. The treatment facility was more like a spa, with nice music, healthy green juice, and a relaxed environment. The cost was $28,000 roughly . . . a bargain considering what we would spend in co-pays for years of chemotherapy, drugs, and surgery, not to mention the treatment of infections."}, {"e202": "But for us the questions persisted: How could we live in a country (the U.S.) that systematically cut, maimed, and killed it’s people with treatment methods that did not work? Why on earth would chemotherapy and drugs be the go to option when chemotherapy destroys everything around it, not just the cancer? Why destroy the immune system with chemotherapy thus leaving the body WEAKER and less able to fight off the second wave of cancer cells?"}, {"fd97": "What we found was that the FDA bans everything in the States that conflicts with chemotherapy and chemo drugs because that’s where the money is . . . well over $125 Billion a year. Go ahead and Google any of the above mentioned naturopathic treatments and you can read about the history of DMSO and Dioxychlor and how they were banned because it was impossible to get patents on them and patents are where the drug industry makes their billions."}, {"dcde": "I stayed with Kerry for the first week in Frankfurt, Germany and then let her finish the month out on her own. When she returned she felt wonderful, no pain associated with a naturopathic treatment. We then selected a new Western Medicine Urologist who was open to naturopathic treatment and had all the tests done including putting a scope in to view the bladder as well as an MRI to analyze all the layers including the muscle wall. What we found was none of the original cancer. Everything was clean. There was a small polyp that could easily be lasered off, but not a single trace of the squamous cell carcinoma!!!"}, {"b949": "Kerry continues to use food as medicine by aggressively pursuing a diet rich with fruits and vegetables, grains and a handful of animal or fish protein a day. Sugar is out save a glass of wine now and then. She will have to cut back on stress by trying to say no to anything pushing her beyond her limits. We know we are not out of the woods; cancer likes to come back."}, {"6aca": "But we have learned something that did change our lives forever: Cancer can be killed! Chemotherapy and radiation are extremely ineffective. All one has to do is Google alternative or naturopathic cancer treatment and they will get a number of treatment facilities in both the United States and abroad. For additional research I highly recommend two websites that were invaluable in our education and confidence . . . Cancertutor.com and Thetruthaboutcancer.com. Both are goldmines for alternative treatment rationale and ideas."}, {"a5fe": "One of the daily drips to detoxify and strengthen the immune system"}], "content": "So . . . It Turns Out Cancer Can Be Killed After All “Your lives are going to change forever,” the Urologist told us after removing a golf ball sized tumor from my wife’s bladder. “The cancer has spread into the muscle wall and the only course of action is to remove the bladder. We will have to attach a tube to the kidneys that comes out the side of her body and drains into a bag that she will wear for the rest of her life, much like a colostomy bag. The other option would be to create a neo bladder out of intestinal material, but that has more drawbacks.” We went home and digested what we had been told. New levels of shock and fear descended upon us as we tried to cope with the news. My wife is only 53, how is this possible? As we spoke with family, we were reminded that Kerry’s (my wife) sister and nephew had travelled to Germany to treat their cancer naturopathically, both successfully without surgery or chemotherapy; one stage 4 Melanoma and the other stage 3 squamous cell throat cancer. They had been cancer free for 4 and 3 years respectively. When we met with our USC Keck Medicine Urologist and asked him about this alternative, he looked us straight in the eye and said, “There is NO way you could deal with this cancer over there. The type of cancer you have is squamous cell and it is FAR to aggressive.” Now came the hard part. We had to research naturopathic cancer treatment . . . what is it? For whom is it successful? Why if it works are so few using it? Are we risking our lives to do it? It had worked for Kerry’s two family members, but what if her cancer was different? First thing we did was contact the treatment facility that was used, Infusio, and asked them if they treated squamous cell bladder cancer . . . they did, and quite successfully! They used heat and oxygen to kill it, and then vitamins, minerals and amino acids to strengthen the immune system, which kills the cancer as well. It turns out cancer cannot survive in certain environments, if you starve it, it has nothing to feed on and killing it becomes relatively easy. Cancer thrives on sugar, so the first thing Kerry did was pursue an aggressive diet heavy in fruits and vegetables with no refined sugar. Second, cancer cannot survive in a temperature exceeding 105 degrees Fahrenheit so Infusio uses a hyperthermia machine to direct the heat to one specific area in the body to fry the cancer cells while preserving all the normal cells around it. Third, blood is drawn out of the body, filled with oxygen and then re-inserted, much like Lance Armstrong did to win the Tour De France thereby creating an oxygen filled environment that cancer hates. Then finally they give daily drips 5 days a week, for a month, to detoxify the body and boost the immune system, things like Dioxychlor, GC-MAF, Vitamin B-17, Selenium, DMSO, and the ground up thymus of an organically fed cow. Hyperthermia Machine doing it’s job We didn’t look back. We got right on a plane and started our adventure in Frankfurt, Germany. The treatment facility was more like a spa, with nice music, healthy green juice, and a relaxed environment. The cost was $28,000 roughly . . . a bargain considering what we would spend in co-pays for years of chemotherapy, drugs, and surgery, not to mention the treatment of infections. But for us the questions persisted: How could we live in a country (the U.S.) that systematically cut, maimed, and killed it’s people with treatment methods that did not work? Why on earth would chemotherapy and drugs be the go to option when chemotherapy destroys everything around it, not just the cancer? Why destroy the immune system with chemotherapy thus leaving the body WEAKER and less able to fight off the second wave of cancer cells? What we found was that the FDA bans everything in the States that conflicts with chemotherapy and chemo drugs because that’s where the money is . . . well over $125 Billion a year. Go ahead and Google any of the above mentioned naturopathic treatments and you can read about the history of DMSO and Dioxychlor and how they were banned because it was impossible to get patents on them and patents are where the drug industry makes their billions. I stayed with Kerry for the first week in Frankfurt, Germany and then let her finish the month out on her own. When she returned she felt wonderful, no pain associated with a naturopathic treatment. We then selected a new Western Medicine Urologist who was open to naturopathic treatment and had all the tests done including putting a scope in to view the bladder as well as an MRI to analyze all the layers including the muscle wall. What we found was none of the original cancer. Everything was clean. There was a small polyp that could easily be lasered off, but not a single trace of the squamous cell carcinoma!!! Kerry continues to use food as medicine by aggressively pursuing a diet rich with fruits and vegetables, grains and a handful of animal or fish protein a day. Sugar is out save a glass of wine now and then. She will have to cut back on stress by trying to say no to anything pushing her beyond her limits. We know we are not out of the woods; cancer likes to come back. But we have learned something that did change our lives forever: Cancer can be killed! Chemotherapy and radiation are extremely ineffective. All one has to do is Google alternative or naturopathic cancer treatment and they will get a number of treatment facilities in both the United States and abroad. For additional research I highly recommend two websites that were invaluable in our education and confidence . . . Cancertutor.com and Thetruthaboutcancer.com. Both are goldmines for alternative treatment rationale and ideas. One of the daily drips to detoxify and strengthen the immune system ", "child": "1885_1\t1885_2\t1885_3\t1885_4\t1885_5\t1885_6\t1885_7\t1885_8\t1885_9\t1885_10\t1885_11\t1885_12\t1885_13\t1885_14\t1885_15\t1885_16\t1885_17\t1885_18\t1885_19\t1885_20\t1885_21\t1885_22\t1885_23\t1885_24\t1885_25"}