{"name": "1893", "parent": "", "title": "My Grandfather’s Funeral", "sentences": [{"0324": "My Grandfather’s Funeral"}, {"2430": "1982:"}, {"3df8": "I looked at the hole in the earth, then up and across to the distant town and river. Everything appeared to be normal. People were going about their lives, unaware of the immense change undergone by the man being buried."}, {"94df": "His eyes, closed, begin their sightless stare into eternity. He is once more lying near his wife. She had been waiting there for the past six years."}, {"7140": "The two, looking from beneath, silently turning, faces upwards. Two people, side by side to turn together forever silently as the earth rotates. Left to spin slowly until the ground reclaims."}, {"aea1": "My thoughts were drifting, I wondered, Where was the mind of this man? Memory repositories beneath the ground, redundant, soon to dissolve, no chance of asking him questions now."}, {"7aff": "I thought, Everyone is saying how beautiful the flowers look. Do they realize that a man has been put from the face of the earth, never to be part of life again? Perhaps they do, maybe I need to understand this."}, {"9275": "My mind was spiraling into itself."}, {"ecd7": "A local man came up to me saying, “It was time.”"}, {"b4a1": "I was startled. I asked him in an exchange of small talk how things were at home, and he said, “Oh quiet, you know, nothing changes.”"}, {"6212": "Odd that he could say that."}, {"2329": "I thought, How could there be no change, do people forget so quickly? Something had changed, and they were witnessing it."}, {"ea04": "Eighty-two years of etching his mark but where was he now? He must have made some impression other than that of fuel for the memory banks of those still living."}, {"2f17": "1956:"}, {"1a08": "“Stand back from the window; you’ll be seen,” said my grandmother."}, {"29fc": "“I want to see too,” I said — all of 6."}, {"e5b1": "“Well, so do I, but there are ways of doing it, just peep through the side of the blind.” said my grandmother in fear of the blinds flapping as the funeral cortege passed."}, {"13da": "“Here is the first car; it will be and Bill and June. She’ll be upset; she thought the world of her mother. And there’s poor little Betty, only sixteen — young to be left without a mother”."}, {"645e": "A mother, my mind flicked to the coffin. So that it could mean something; one could be a father as well then. But if nothing ever changes perhaps this didn’t mean enough. The river in the distance changed all the time, but it was always the river. There must be more."}, {"b488": "1959:"}, {"6304": "“Why do you come up here?” said Pat, scrambling for a foothold."}, {"b993": "“I love the Snowdrops,” I answered. “Look, see they have been planted, there’s been a house, people have lived right here where we are.”"}, {"b88f": "“How do you know?” said Pat."}, {"a402": "“Nana told me, for a start, and besides, I’ve found some pieces of dishes and other things that were broken.”"}, {"563a": "“You mean you dug them up.” said Pat."}, {"b551": "“Yes, I did.” I said."}, {"4324": "“I keep wanting to come back and back. I can feel the people.”"}, {"e427": "“Why would you?” said Pat."}, {"b2cc": "“Pass me the cakes,” she said, “It’s an awful climb, how would they have got up and down?”"}, {"4dc3": "“There’s a track over there; the blackberries almost cover it. Fancy it all; she probably hung her clothes here or perhaps there. Think about them, all the life they lived… and had Christmas dinner… and planned trips to town,” I said, my face glowing with nine-year-old excitement."}, {"9978": "“You do go on,” said Pat."}, {"fb28": "“I can go to the plum tree next time; I like getting to the top.”"}, {"3780": "“I wonder who they were,” I mused."}, {"0755": "“Ask your grandmother,” said Pat."}, {"19fa": "“I did, she doesn’t know for sure — before her time. She wasn’t born here. Look, there’s an old rose over there. I bet whoever lived here liked her garden. I always wonder about people who aren’t here anymore,” I said."}, {"de15": "“You mean dead,” said Pat, beginning to climb back down the hill."}, {"5340": "1982:"}, {"861b": "“Well, I’ll be going now,” said Bill. “It looks like it’s all over.”"}, {"7c7c": "I looked at the man as he walked away."}, {"9734": "All over, I thought, as I looked toward the river. I need to come to terms with ‘all overs ‘ I mused as I walked toward my car, leaving my grandparents to lie quietly. There was enough noise in my head."}], "content": "My Grandfather’s Funeral 1982: I looked at the hole in the earth, then up and across to the distant town and river. Everything appeared to be normal. People were going about their lives, unaware of the immense change undergone by the man being buried. His eyes, closed, begin their sightless stare into eternity. He is once more lying near his wife. She had been waiting there for the past six years. The two, looking from beneath, silently turning, faces upwards. Two people, side by side to turn together forever silently as the earth rotates. Left to spin slowly until the ground reclaims. My thoughts were drifting, I wondered, Where was the mind of this man? Memory repositories beneath the ground, redundant, soon to dissolve, no chance of asking him questions now. I thought, Everyone is saying how beautiful the flowers look. Do they realize that a man has been put from the face of the earth, never to be part of life again? Perhaps they do, maybe I need to understand this. My mind was spiraling into itself. A local man came up to me saying, “It was time.” I was startled. I asked him in an exchange of small talk how things were at home, and he said, “Oh quiet, you know, nothing changes.” Odd that he could say that. I thought, How could there be no change, do people forget so quickly? Something had changed, and they were witnessing it. Eighty-two years of etching his mark but where was he now? He must have made some impression other than that of fuel for the memory banks of those still living. 1956: “Stand back from the window; you’ll be seen,” said my grandmother. “I want to see too,” I said — all of 6. “Well, so do I, but there are ways of doing it, just peep through the side of the blind.” said my grandmother in fear of the blinds flapping as the funeral cortege passed. “Here is the first car; it will be and Bill and June. She’ll be upset; she thought the world of her mother. And there’s poor little Betty, only sixteen — young to be left without a mother”. A mother, my mind flicked to the coffin. So that it could mean something; one could be a father as well then. But if nothing ever changes perhaps this didn’t mean enough. The river in the distance changed all the time, but it was always the river. There must be more. 1959: “Why do you come up here?” said Pat, scrambling for a foothold. “I love the Snowdrops,” I answered. “Look, see they have been planted, there’s been a house, people have lived right here where we are.” “How do you know?” said Pat. “Nana told me, for a start, and besides, I’ve found some pieces of dishes and other things that were broken.” “You mean you dug them up.” said Pat. “Yes, I did.” I said. “I keep wanting to come back and back. I can feel the people.” “Why would you?” said Pat. “Pass me the cakes,” she said, “It’s an awful climb, how would they have got up and down?” “There’s a track over there; the blackberries almost cover it. Fancy it all; she probably hung her clothes here or perhaps there. Think about them, all the life they lived… and had Christmas dinner… and planned trips to town,” I said, my face glowing with nine-year-old excitement. “You do go on,” said Pat. “I can go to the plum tree next time; I like getting to the top.” “I wonder who they were,” I mused. “Ask your grandmother,” said Pat. “I did, she doesn’t know for sure — before her time. She wasn’t born here. Look, there’s an old rose over there. I bet whoever lived here liked her garden. I always wonder about people who aren’t here anymore,” I said. “You mean dead,” said Pat, beginning to climb back down the hill. 1982: “Well, I’ll be going now,” said Bill. “It looks like it’s all over.” I looked at the man as he walked away. All over, I thought, as I looked toward the river. I need to come to terms with ‘all overs ‘ I mused as I walked toward my car, leaving my grandparents to lie quietly. There was enough noise in my head. ", "child": "1893_1\t1893_2\t1893_3"}