{"name": "1927", "parent": "", "title": "NFL Teams Are Split on Deshaun Watson", "sentences": [{"df09": "NFL Teams Are Split on Deshaun Watson"}, {"6ba9": "The NFL Network’s Daniel Jeremiah shares what he’s been hearing"}, {"4e3d": "This year’s crop of quarterbacks entering the NFL draft is more polarizing than any in recent memory, and Deshaun Watson headlines the class. What do NFL GMs think about him? The NFL Network’s Daniel Jeremiah joined Robert Mays on The Ringer NFL Show to share what he’s been hearing."}, {"2b2e": "Listen to the full podcast here. This transcript has been edited and condensed."}, {"96fd": "What Jeremiah Is Hearing From Executives"}, {"95b7": "Daniel Jeremiah: I talked to an executive with a team this last week. He said, “There’s no way Deshaun Watson will get out of the top 10. There’s no way.”"}, {"52ce": "Robert Mays: That feels right, yes."}, {"fa7e": "Jeremiah: Two, three hours later, I talk to another executive with a team. “I don’t know how Deshaun Watson goes in the first round.” How do you balance that? I got no idea."}, {"6484": "This Year’s QB Class Is Weak"}, {"f5ed": "Jeremiah: Watson is my 27th-overall player. The question is, “Are these guys worth top-10 picks?” No. I don’t think they are worth top-10 picks."}, {"4324": "This year is really hard, and especially hard because the draft is so loaded at so many other positions. So, to me, if you’re picking in the top 10 and you take one of these quarterbacks, number one, you’ve elevated them beyond their grade. Number two, you lost the opportunity to take a great player at another position, a great player with very little risk. And number three, you, for all intents and purposes, pulled yourself out of the quarterback market next year, which, if everybody comes out that we expect, is gonna be far superior to this group. So, I mean, that’s like a triple whammy."}, {"84aa": "Mays: No one thought Jared Goff was the best player in the draft last year. No one thought Carson Wentz was the second-best player. But teams, as we get closer, there’s a sense of desperation that creeps in, and it starts to affect decision-making."}, {"591d": "Jeremiah: The only difference I would say, though, Robert, is if you look at last year, like just for me personally, I had Goff and Wentz as [top-10 players]."}, {"8ed2": "The Biggest Draft Need for All 32 NFL TeamsFree agency filled a bunch of holes across the league, but it also created some, too. Just ask Jerry Jones.theringer.com"}, {"636c": "Deshaun Watson’s Historical Comps"}, {"801e": "Mays: When’s the last time we saw a quarterback that was Heisman caliber, national championship game winner, that sort of guy, not go high? It just doesn’t happen very often. I mean, I know with … Cardale Jones, he did it. But Watson has been a staple of college football."}, {"ac93": "Jeremiah: I believe I was in Baltimore when we picked Troy Smith. I remember at some point in time, late in that season, after a big Ohio State win, a prominent college football analyst said, “The Browns have the number-one pick. They need to just take Troy Smith. Don’t let him get away.” And in the scouting world it was like, “Whoa! No, no, no. Let’s not get caught up in the team’s success. This guy is not a first-round pick.” And obviously [he] ended up going fifth, sixth round when it was all said and done."}, {"6455": "Myles Garrett Isn’t Perfect, but He’s the No-Brainer No. 1 NFL Draft PickHis floor is “very good” and his ceiling is “Hall of Famer.” The Cleveland Browns could use either one.theringer.com"}, {"4ee3": "I was in Baltimore the year Brady Quinn came out, and we all kind of thought Brady was going to be a top-five pick. I believe we had [Steve] McNair at the time, but it was getting toward the end [of the first round], and we didn’t think there was any chance that Brady Quinn would be there. I remember once he went on that slide, we were kind of a little bit in scramble mode because we were picking in the 20s. We just didn’t think he would be in the range, and then Cleveland ended up trading back up and taking him. That could be a situation where a team is picking in the 20s this year, and maybe they assume that Watson is going to be long gone and could find themselves doing similar homework."}], "content": "NFL Teams Are Split on Deshaun Watson The NFL Network’s Daniel Jeremiah shares what he’s been hearing This year’s crop of quarterbacks entering the NFL draft is more polarizing than any in recent memory, and Deshaun Watson headlines the class. What do NFL GMs think about him? The NFL Network’s Daniel Jeremiah joined Robert Mays on The Ringer NFL Show to share what he’s been hearing. Listen to the full podcast here. This transcript has been edited and condensed. What Jeremiah Is Hearing From Executives Daniel Jeremiah: I talked to an executive with a team this last week. He said, “There’s no way Deshaun Watson will get out of the top 10. There’s no way.” Robert Mays: That feels right, yes. Jeremiah: Two, three hours later, I talk to another executive with a team. “I don’t know how Deshaun Watson goes in the first round.” How do you balance that? I got no idea. This Year’s QB Class Is Weak Jeremiah: Watson is my 27th-overall player. The question is, “Are these guys worth top-10 picks?” No. I don’t think they are worth top-10 picks. This year is really hard, and especially hard because the draft is so loaded at so many other positions. So, to me, if you’re picking in the top 10 and you take one of these quarterbacks, number one, you’ve elevated them beyond their grade. Number two, you lost the opportunity to take a great player at another position, a great player with very little risk. And number three, you, for all intents and purposes, pulled yourself out of the quarterback market next year, which, if everybody comes out that we expect, is gonna be far superior to this group. So, I mean, that’s like a triple whammy. Mays: No one thought Jared Goff was the best player in the draft last year. No one thought Carson Wentz was the second-best player. But teams, as we get closer, there’s a sense of desperation that creeps in, and it starts to affect decision-making. Jeremiah: The only difference I would say, though, Robert, is if you look at last year, like just for me personally, I had Goff and Wentz as [top-10 players]. The Biggest Draft Need for All 32 NFL TeamsFree agency filled a bunch of holes across the league, but it also created some, too. Just ask Jerry Jones.theringer.com Deshaun Watson’s Historical Comps Mays: When’s the last time we saw a quarterback that was Heisman caliber, national championship game winner, that sort of guy, not go high? It just doesn’t happen very often. I mean, I know with … Cardale Jones, he did it. But Watson has been a staple of college football. Jeremiah: I believe I was in Baltimore when we picked Troy Smith. I remember at some point in time, late in that season, after a big Ohio State win, a prominent college football analyst said, “The Browns have the number-one pick. They need to just take Troy Smith. Don’t let him get away.” And in the scouting world it was like, “Whoa! No, no, no. Let’s not get caught up in the team’s success. This guy is not a first-round pick.” And obviously [he] ended up going fifth, sixth round when it was all said and done. Myles Garrett Isn’t Perfect, but He’s the No-Brainer No. 1 NFL Draft PickHis floor is “very good” and his ceiling is “Hall of Famer.” The Cleveland Browns could use either one.theringer.com I was in Baltimore the year Brady Quinn came out, and we all kind of thought Brady was going to be a top-five pick. I believe we had [Steve] McNair at the time, but it was getting toward the end [of the first round], and we didn’t think there was any chance that Brady Quinn would be there. I remember once he went on that slide, we were kind of a little bit in scramble mode because we were picking in the 20s. We just didn’t think he would be in the range, and then Cleveland ended up trading back up and taking him. That could be a situation where a team is picking in the 20s this year, and maybe they assume that Watson is going to be long gone and could find themselves doing similar homework. ", "child": "1927_1\t1927_2\t1927_3\t1927_4\t1927_5"}