{"name": "1930", "parent": "", "title": "Even When LeBron James Rests, He Still Wins", "sentences": [{"468a": "Even When LeBron James Rests, He Still Wins"}, {"01ac": "On Tuesday, he defeated the media and the controversy over time off"}, {"bf69": "The NBA playoffs are 25 days away. That means LeBron James is about to enter #ZeroDark23 mode — his self-imposed social media blackout to help him maintain singular focus and tune out the noise as he pursues ring no. 4 and presumably think about Kathryn Bigelow’s film. (The hashtag wouldn’t have worked as well when he was wearing no. 6.) With his annual hibernation likely just weeks away, LeBron is giving the media all the quotes we need to stay satiated."}, {"c1ee": "The Cavaliers are currently in Los Angeles, which gives James a bigger audience than the sizable scrum that normally follows him, and he’s making the most of it. First topic: the Ball family. What’s the point of passing through Southern California if not to weigh in on the family of wunderkinds? Father LaVar recently posited that his sons were better set up for success in the NBA than LeBron’s kids, LeBron Jr. and Bryce, both of whom are already quite good at basketball despite being only 12 and 9, respectively. ESPN asked LeBron about LaVar’s comments, and he responded thusly: “Keep my kids’ name out of your mouth, keep my family out of your mouth. … This is dad to dad. It’s a problem now.” Feisty!"}, {"f4e5": "But to simply read James’s quotes is to deprive oneself of entertainment and joy. Here’s a video of him talking about the hot topic of rest."}, {"36e2": "In under two minutes, LeBron — filled with the kind of mirth Edith Wharton dreamed about — laughs off the idea that owners should weigh in on whether players can get the night off and reaffirms his own grasp on the league. The issue of rest is back in the news because Steve Kerr sat his All-Stars on one Saturday night, and Tyronn Lue did it the next. But the second case was a problem because it included James. We’re not talking about rest due to LeBron, but we’re not not talking about rest due to LeBron."}, {"7f45": "It doesn’t really matter. LeBron gets it. He handles microphones thrown in his face with the facility of a politician, and he controls the narrative better than Olivia Pope. This is why he remains the NBA’s greatest superstar, nonsensical hashtags notwithstanding."}], "content": "Even When LeBron James Rests, He Still Wins On Tuesday, he defeated the media and the controversy over time off The NBA playoffs are 25 days away. That means LeBron James is about to enter #ZeroDark23 mode — his self-imposed social media blackout to help him maintain singular focus and tune out the noise as he pursues ring no. 4 and presumably think about Kathryn Bigelow’s film. (The hashtag wouldn’t have worked as well when he was wearing no. 6.) With his annual hibernation likely just weeks away, LeBron is giving the media all the quotes we need to stay satiated. The Cavaliers are currently in Los Angeles, which gives James a bigger audience than the sizable scrum that normally follows him, and he’s making the most of it. First topic: the Ball family. What’s the point of passing through Southern California if not to weigh in on the family of wunderkinds? Father LaVar recently posited that his sons were better set up for success in the NBA than LeBron’s kids, LeBron Jr. and Bryce, both of whom are already quite good at basketball despite being only 12 and 9, respectively. ESPN asked LeBron about LaVar’s comments, and he responded thusly: “Keep my kids’ name out of your mouth, keep my family out of your mouth. … This is dad to dad. It’s a problem now.” Feisty! But to simply read James’s quotes is to deprive oneself of entertainment and joy. Here’s a video of him talking about the hot topic of rest. In under two minutes, LeBron — filled with the kind of mirth Edith Wharton dreamed about — laughs off the idea that owners should weigh in on whether players can get the night off and reaffirms his own grasp on the league. The issue of rest is back in the news because Steve Kerr sat his All-Stars on one Saturday night, and Tyronn Lue did it the next. But the second case was a problem because it included James. We’re not talking about rest due to LeBron, but we’re not not talking about rest due to LeBron. It doesn’t really matter. LeBron gets it. He handles microphones thrown in his face with the facility of a politician, and he controls the narrative better than Olivia Pope. This is why he remains the NBA’s greatest superstar, nonsensical hashtags notwithstanding. ", "child": "1930_1\t1930_2\t1930_3\t1930_4\t1930_5\t1930_6\t1930_7\t1930_8\t1930_9\t1930_10\t1930_11"}