{"name": "1931", "parent": "", "title": "TapeWrite Premium: Create Shows, Collaborate, Enjoy Unlimited Storage", "sentences": [{"aa12": "TapeWrite Premium: Create Shows, Collaborate, Enjoy Unlimited Storage"}, {"947f": "Since the beginning, we are driven by one thought at TapeWrite: how to enable publishers to create in new ways, unleash their potential and leave their listeners at awe of their work and the listening experience. With that in mind we created our signature feature, the visual annotations, but we do not stop there."}, {"713a": "The way the publishing environment is structured and the possibilities it offers and encourages can inhibit or nurture creativity. At TapeWrite we want to reflect that hence here is what we have been focusing on lately:"}, {"ad20": "Over the last months we talked to our loyal user base, held some pretty heated video call brainstorms, our designer made an excellent job, developers did their magic and voilà:"}, {"56a6": "Today, as part of our new premium packages (more about them below), we are very excited to present the “Shows” feature, combining both of the above points."}, {"fce4": "Create Shows on specific topics"}, {"a5f1": "With the new feature you can create a feed separate from your personal profile. We call these feeds “Shows”. Each Show has its own page people can follow, as well as its own RSS feed anyone can subscribe to."}, {"c9c4": "Basically, you can create an existence on its own, with a description, social media links, a URL of your choice and yourself as the Editor. You can think of it as something very similar to ‘Publications’ on Medium (in fact, they were our inspiration!)."}, {"b4b5": "This is how a Show profile looks like. In this example our designer, Gabor, created a Show about the backstage of our company and invited our team to contribute. I did!"}, {"f042": "Add contributors, create together"}, {"85cb": "Once you start a Show you can add any of your existing tapes to its feed. But even more importantly — you can also invite Contributors, who will be notified and can then do the same with their tapes."}, {"636e": "Just as pieces of a puzzle, by adding new creators to your show you can assemble a beautiful picture together, with different voices complementing each other on a given topic."}, {"36fa": "It is also an almost effortless way of growing your audience and letting people discover you and your content in a fun, non-intrusive and hand-picked way. Your and your teammates tapes get exposure to each other’s audiences. It’s a win win."}, {"59e3": "This is what an Editor sees when (s)he goes on the page of the Show. The page is different from what a listener would see, with added admin options to manage all tapes, add/remove contributors and change settings."}, {"b0cf": "Our new advanced statistics are also available for Shows so once you kicked off your new Show, you can observe the audience development and behaviour from the very beginning, optimising the work of your team as you go."}, {"37d8": "The advanced stats work perfectly for Shows."}, {"6233": "Support us and get creative with unlimited storage"}, {"84fd": "The “Shows” feature is part of the new TapeWrite Premium package, meaning that you can enjoy it at a small monthly price along with extended or unlimited hosting storage, depending on which plan fits you best."}, {"a1f7": "If you are publishing with us already, you will receive a promo code with a free upgrade to the Long Play plan as a thank you. Unless you want to support us, of course!:)"}, {"faf4": "This is something new on TapeWrite and we hope for your will to support us in this way. As much as we would like to offer all our features and unlimited storage for free, we are part of the startup market and need to pay our bills. That support will allow us to maintain TapeWrite in the quality you deserve and will enable you to expand the scope of your work in new, fun ways. But do not worry, we will always stay a free tool, offering only selected (and awesome) features as part of the paid packages."}, {"8fa3": "And if you are publishing with us already, we’ve got good news. All our publishers will receive an upgrade to the “Long Play” and will be able to enjoy all our features for free, forever. This is our way to say thank you for being with us from the beginning."}, {"234f": "Oh, and we are officially our of beta!"}, {"f972": "Excited about the new features? Head now to TapeWrite to redeem your promo code or upgrade your plan. We can’t wait to see your Shows and hear what you think!"}, {"42ce": "TapeWrite is a modern audio publishing solution. Get a stunning annotated podcast player and an RSS feed in minutes."}], "content": "TapeWrite Premium: Create Shows, Collaborate, Enjoy Unlimited Storage Since the beginning, we are driven by one thought at TapeWrite: how to enable publishers to create in new ways, unleash their potential and leave their listeners at awe of their work and the listening experience. With that in mind we created our signature feature, the visual annotations, but we do not stop there. The way the publishing environment is structured and the possibilities it offers and encourages can inhibit or nurture creativity. At TapeWrite we want to reflect that hence here is what we have been focusing on lately: Over the last months we talked to our loyal user base, held some pretty heated video call brainstorms, our designer made an excellent job, developers did their magic and voilà: Today, as part of our new premium packages (more about them below), we are very excited to present the “Shows” feature, combining both of the above points. Create Shows on specific topics With the new feature you can create a feed separate from your personal profile. We call these feeds “Shows”. Each Show has its own page people can follow, as well as its own RSS feed anyone can subscribe to. Basically, you can create an existence on its own, with a description, social media links, a URL of your choice and yourself as the Editor. You can think of it as something very similar to ‘Publications’ on Medium (in fact, they were our inspiration!). This is how a Show profile looks like. In this example our designer, Gabor, created a Show about the backstage of our company and invited our team to contribute. I did! Add contributors, create together Once you start a Show you can add any of your existing tapes to its feed. But even more importantly — you can also invite Contributors, who will be notified and can then do the same with their tapes. Just as pieces of a puzzle, by adding new creators to your show you can assemble a beautiful picture together, with different voices complementing each other on a given topic. It is also an almost effortless way of growing your audience and letting people discover you and your content in a fun, non-intrusive and hand-picked way. Your and your teammates tapes get exposure to each other’s audiences. It’s a win win. This is what an Editor sees when (s)he goes on the page of the Show. The page is different from what a listener would see, with added admin options to manage all tapes, add/remove contributors and change settings. Our new advanced statistics are also available for Shows so once you kicked off your new Show, you can observe the audience development and behaviour from the very beginning, optimising the work of your team as you go. The advanced stats work perfectly for Shows. Support us and get creative with unlimited storage The “Shows” feature is part of the new TapeWrite Premium package, meaning that you can enjoy it at a small monthly price along with extended or unlimited hosting storage, depending on which plan fits you best. If you are publishing with us already, you will receive a promo code with a free upgrade to the Long Play plan as a thank you. Unless you want to support us, of course!:) This is something new on TapeWrite and we hope for your will to support us in this way. As much as we would like to offer all our features and unlimited storage for free, we are part of the startup market and need to pay our bills. That support will allow us to maintain TapeWrite in the quality you deserve and will enable you to expand the scope of your work in new, fun ways. But do not worry, we will always stay a free tool, offering only selected (and awesome) features as part of the paid packages. And if you are publishing with us already, we’ve got good news. All our publishers will receive an upgrade to the “Long Play” and will be able to enjoy all our features for free, forever. This is our way to say thank you for being with us from the beginning. Oh, and we are officially our of beta! Excited about the new features? Head now to TapeWrite to redeem your promo code or upgrade your plan. We can’t wait to see your Shows and hear what you think! TapeWrite is a modern audio publishing solution. Get a stunning annotated podcast player and an RSS feed in minutes. ", "child": "1931_1\t1931_2\t1931_31931_1\t1931_2\t1931_3"}