{"name": "1937", "parent": "", "title": "The Perfect Shots of ‘Silence’ and an Interview with Cinematographer Rodrigo Prieto", "sentences": [{"f071": "The Perfect Shots of ‘Silence’ and an Interview with Cinematographer Rodrigo Prieto"}, {"6f94": "On this week’s ‘Shot by Shot’ Podcast."}, {"5789": "For the third episode of Shot by Shot, the official cinematography podcast of One Perfect Shot and Film School Rejects, myself and OPS Founder Geoff Todd talk Martin Scorsese’s latest, Silence, and the Oscar-nominated cinematography of Rodrigo Prieto, who joins the show in the second half to give an exclusive interview about the challenges and triumphs of shooting the film."}, {"a8f4": "If this is your first listen to the show, the format’s simple: each week Geoff and I each pick a few shots from a certain film and discuss their effect and significance. Already we’ve done episodes on 2001: A Space Odyssey and Mad Max: Fury Road, and next week we’re tackling Nicolas Winding Refn’s Drive, so there’s never been a better time to start following, which you can do on Twitter @OnePerfectPod and Facebook at facebook.com/oneperfectshot, and the two of us on Twitter: @TheGeoffTodd and @HPerryHorton. And if you like what you hear — spoiler alert: you’re going to — be sure to subscribe in iTunes, Stitcher, TuneIn, or wherever you get your podcasts so you don’t miss a single episode of us or any of the other shows in our family of OnePerfectPodcasts."}, {"e3fb": "Check out our latest episode at the link below, as well as the shots discussed this week."}, {"7fd4": "Silence is available now on Digital HD, Blu-Ray and DVD. For more information, please visit www.SilenceMovie.com"}], "content": "The Perfect Shots of ‘Silence’ and an Interview with Cinematographer Rodrigo Prieto On this week’s ‘Shot by Shot’ Podcast. For the third episode of Shot by Shot, the official cinematography podcast of One Perfect Shot and Film School Rejects, myself and OPS Founder Geoff Todd talk Martin Scorsese’s latest, Silence, and the Oscar-nominated cinematography of Rodrigo Prieto, who joins the show in the second half to give an exclusive interview about the challenges and triumphs of shooting the film. If this is your first listen to the show, the format’s simple: each week Geoff and I each pick a few shots from a certain film and discuss their effect and significance. Already we’ve done episodes on 2001: A Space Odyssey and Mad Max: Fury Road, and next week we’re tackling Nicolas Winding Refn’s Drive, so there’s never been a better time to start following, which you can do on Twitter @OnePerfectPod and Facebook at facebook.com/oneperfectshot, and the two of us on Twitter: @TheGeoffTodd and @HPerryHorton. And if you like what you hear — spoiler alert: you’re going to — be sure to subscribe in iTunes, Stitcher, TuneIn, or wherever you get your podcasts so you don’t miss a single episode of us or any of the other shows in our family of OnePerfectPodcasts. Check out our latest episode at the link below, as well as the shots discussed this week. Silence is available now on Digital HD, Blu-Ray and DVD. For more information, please visit www.SilenceMovie.com ", "child": "1937_1"}