{"name": "1939", "parent": "", "title": "The Perfect Shots of ‘Mad Max: Fury Road’", "sentences": [{"c0c5": "The Perfect Shots of ‘Mad Max: Fury Road’"}, {"0371": "A companion piece to this week’s Shot by Shot podcast."}, {"160d": "For this week’s episode of Shot by Shot, the official cinematography podcast of One Perfect Shot and Film School Rejects, OPS founder Geoff Todd and myself selected easily one of the most popular films of the last few years, as well as one of the outright greatest action films of all-time: George Miller’s Mad Max: Fury Road, shot by legendary cinematographer John Seale, who came out of retirement just to work on this picture."}, {"3e06": "As usual, both Geoff and I have chosen three shots or types of shots from the film that we use as the basis for an in-depth discussion about the particular brilliance of Fury Road, which is an adrenaline-fueled nightmare from start to finish that simultaneously manages to be a rich drama full of heart and hope. This balance is only one element of the film to which cinematography lends itself, but for more of the good stuff you have to play the link below."}, {"3007": "Once you have, be sure to let us know how were doing by leaving a rating and review over at iTunes (link above), and if there are any films you’d like us to add to the list of potentials for upcoming episodes, sound off in the comments or on Twitter. And don’t forget to check out last week’s show if you haven’t already; we talked 2001."}, {"e65d": "Next week we’ve got an exclusive interview with two-time Oscar-nominee Rodrigo Prieto, cinematographer of Martin Scorsese’s Silence, and the week after that we’re back to our regular format with a look at Nicolas Winding Refn’s Drive."}, {"6c9f": "To wet your whistle, check out the four Fury Road shots and one recurring technique we discuss in this week’s episode:"}, {"6ec0": "[WATCH] FAST AND FURIOUS: THE CAMERA PUSHES OF ‘MAD MAX: FURY ROAD’filmschoolrejects.com"}], "content": "The Perfect Shots of ‘Mad Max: Fury Road’ A companion piece to this week’s Shot by Shot podcast. For this week’s episode of Shot by Shot, the official cinematography podcast of One Perfect Shot and Film School Rejects, OPS founder Geoff Todd and myself selected easily one of the most popular films of the last few years, as well as one of the outright greatest action films of all-time: George Miller’s Mad Max: Fury Road, shot by legendary cinematographer John Seale, who came out of retirement just to work on this picture. As usual, both Geoff and I have chosen three shots or types of shots from the film that we use as the basis for an in-depth discussion about the particular brilliance of Fury Road, which is an adrenaline-fueled nightmare from start to finish that simultaneously manages to be a rich drama full of heart and hope. This balance is only one element of the film to which cinematography lends itself, but for more of the good stuff you have to play the link below. Once you have, be sure to let us know how were doing by leaving a rating and review over at iTunes (link above), and if there are any films you’d like us to add to the list of potentials for upcoming episodes, sound off in the comments or on Twitter. And don’t forget to check out last week’s show if you haven’t already; we talked 2001. Next week we’ve got an exclusive interview with two-time Oscar-nominee Rodrigo Prieto, cinematographer of Martin Scorsese’s Silence, and the week after that we’re back to our regular format with a look at Nicolas Winding Refn’s Drive. To wet your whistle, check out the four Fury Road shots and one recurring technique we discuss in this week’s episode: [WATCH] FAST AND FURIOUS: THE CAMERA PUSHES OF ‘MAD MAX: FURY ROAD’filmschoolrejects.com ", "child": "1939_1"}