{"name": "1947", "parent": "", "title": "Stealing Beauty: A Compilation of the 21st Century’s Best Cinematography", "sentences": [{"80a1": "Stealing Beauty: A Compilation of the 21st Century’s Best Cinematography"}, {"29ad": "Did your favorite film make the cut?"}, {"34c6": "Cinematography has come a long way in the last 100+ years. In the early days of the medium a director of photography was little more than a glorified cameraman or director’s assistant, almost a laborer told to go there, point here, shoot, cut, next."}, {"d0f3": "But as film and filmmakers have evolved, the importance and in fact sheer indispensability of cinematography as a storytelling tool has been realized to the point that today, in the 17th year of the 21st century, cinematography is more valued and respected than ever before. It’s also the best it’s ever been. Shooters like Robert Richardson, Roger Deakins, Ellen Kuras, Rodrigo Prieto, and three(consecutive)-time-Oscar-winner Emmanuel Lubezki have elevated the trade into an artform all of its own by simultaneously acknowledging the work that has come before them and consistently making innovative advancements and improvements."}, {"7850": "The results are more beautiful, richer, and more meaningful films, a truer merging of the visual with the narrative, and a broader range of emotionality captured and projected on screen. Narrative relates the human experience, but cinematography reveals it, it presents it to us with less direction and allows us to make our own connections in addition to the connections we’re being asked to make by the filmmaker."}, {"49bd": "In the following supercut from Art of the Film, the best cinematography of the 21st century to-date has been collected into a staggeringly-gorgeous 12-minute filmic experience that demonstrates everything I said above in much more visceral detail. It’s an ambitious video and one that I think succeeds in showing just how powerful cinematography can be. Not every film can make the cut, of course, there are hundreds released every year, after all, but I think these selections best represent the intention. Sound off in the comments below or on our Twitter if you think there are any other films that should have made the cut, and don’t be afraid to share a perfect shot as proof; we’re kinda into that if you couldn’t tell."}], "content": "Stealing Beauty: A Compilation of the 21st Century’s Best Cinematography Did your favorite film make the cut? Cinematography has come a long way in the last 100+ years. In the early days of the medium a director of photography was little more than a glorified cameraman or director’s assistant, almost a laborer told to go there, point here, shoot, cut, next. But as film and filmmakers have evolved, the importance and in fact sheer indispensability of cinematography as a storytelling tool has been realized to the point that today, in the 17th year of the 21st century, cinematography is more valued and respected than ever before. It’s also the best it’s ever been. Shooters like Robert Richardson, Roger Deakins, Ellen Kuras, Rodrigo Prieto, and three(consecutive)-time-Oscar-winner Emmanuel Lubezki have elevated the trade into an artform all of its own by simultaneously acknowledging the work that has come before them and consistently making innovative advancements and improvements. The results are more beautiful, richer, and more meaningful films, a truer merging of the visual with the narrative, and a broader range of emotionality captured and projected on screen. Narrative relates the human experience, but cinematography reveals it, it presents it to us with less direction and allows us to make our own connections in addition to the connections we’re being asked to make by the filmmaker. In the following supercut from Art of the Film, the best cinematography of the 21st century to-date has been collected into a staggeringly-gorgeous 12-minute filmic experience that demonstrates everything I said above in much more visceral detail. It’s an ambitious video and one that I think succeeds in showing just how powerful cinematography can be. Not every film can make the cut, of course, there are hundreds released every year, after all, but I think these selections best represent the intention. Sound off in the comments below or on our Twitter if you think there are any other films that should have made the cut, and don’t be afraid to share a perfect shot as proof; we’re kinda into that if you couldn’t tell. ", "child": "1947_1\t1947_2\t1947_3"}