{"name": "1957", "parent": "", "title": "Public Sector Drone: Our Investment in Shield AI", "sentences": [{"a9c8": "Public Sector Drone: Our Investment in Shield AI"}, {"146c": "FINALLY, we can talk about this one. a16z just led a $10.5 Series A in Shield AI, with supporting participation from existing investors. We were fortunate to lead Shield’s earlier seed round and it’s been such a pleasure working on behalf of this team. Shield sells autonomous robotics into the public sector, initially the Department of Defense and Department of Homeland Security."}, {"da7f": "You can read more about Shield AI in our blog post about the financing and Fast Company’s great coverage. From FC ->"}, {"009d": "For Homebrew it’s not only an exciting investment but also a blueprint for how we try to follow a technology innovation from fringe to fringe as it gains consensus in its applications. In this case Satya and I have been enthusiastic believers that autonomous robotics and computer vision was going to have a hugely transformative effect in multiple industries over the next decade."}, {"cc52": "Our first investment behind this thesis occurred in 2014 via Cruise Automation, and while we realized a nice return from their rather fast acquisition by GM, along the way it became quite “mainstream” in the venture community to back consumer autonomous vehicle efforts. Which meant funding rounds and valuations increased quickly for credible teams in this space. Not a great set of conditions for a seed investor! But we loved the technologies and set out to figure out where the next fringe would be. We believe we found it with Shield AI, which combined mission-driven DNA with amazing technologists and a huge market opportunity that’s complex for most startups and established companies to address."}, {"88b5": "So now we just need to push to the next fringe for autonomy. We recently made an investment that we *think* might be in the right direction, but that’s blog post for the future 🙂"}, {"1664": "My Blog | Twitter | Snapchat | Medium | LinkedIn | Facebook | Instagram"}], "content": "Public Sector Drone: Our Investment in Shield AI FINALLY, we can talk about this one. a16z just led a $10.5 Series A in Shield AI, with supporting participation from existing investors. We were fortunate to lead Shield’s earlier seed round and it’s been such a pleasure working on behalf of this team. Shield sells autonomous robotics into the public sector, initially the Department of Defense and Department of Homeland Security. You can read more about Shield AI in our blog post about the financing and Fast Company’s great coverage. From FC -> For Homebrew it’s not only an exciting investment but also a blueprint for how we try to follow a technology innovation from fringe to fringe as it gains consensus in its applications. In this case Satya and I have been enthusiastic believers that autonomous robotics and computer vision was going to have a hugely transformative effect in multiple industries over the next decade. Our first investment behind this thesis occurred in 2014 via Cruise Automation, and while we realized a nice return from their rather fast acquisition by GM, along the way it became quite “mainstream” in the venture community to back consumer autonomous vehicle efforts. Which meant funding rounds and valuations increased quickly for credible teams in this space. Not a great set of conditions for a seed investor! But we loved the technologies and set out to figure out where the next fringe would be. We believe we found it with Shield AI, which combined mission-driven DNA with amazing technologists and a huge market opportunity that’s complex for most startups and established companies to address. So now we just need to push to the next fringe for autonomy. We recently made an investment that we *think* might be in the right direction, but that’s blog post for the future 🙂 My Blog | Twitter | Snapchat | Medium | LinkedIn | Facebook | Instagram ", "child": "1957_1"}