{"name": "196", "parent": "", "title": "8 Things Every Person Should Do Before 8 A.M.", "sentences": [{"f691": "8 Things Every Person Should Do Before 8 A.M."}, {"5847": "Life is busy. It can feel impossible to move toward your dreams. If you have a full-time job and kids, it’s even harder."}, {"bd77": "How do you move forward?"}, {"2068": "If you don’t purposefully carve time out every day to progress and improve — without question, your time will get lost in the vacuum of our increasingly crowded lives. Before you know it, you’ll be old and withered — wondering where all that time went."}, {"90d0": "As Professor Harold Hill has said — “You pile up enough tomorrows, and you’ll find you are left with nothing but a lot of empty yesterdays.”"}, {"224a": "Rethinking Your Life and Getting Out of Survival Mode"}, {"1fa3": "This article is intended to challenge you to rethink your entire approach to life. The purpose is to help you simplify and get back to the fundamentals."}, {"3379": "Sadly, most people’s lives are filled to the brim with the nonessential and trivial. They don’t have time to build toward anything meaningful."}, {"3cb2": "They are in survival mode. Are you in survival mode?"}, {"cea4": "Like Bilbo, most of us are like butter scraped over too much bread. Unfortunately, the bread is not even our own, but someone else’s. Very few have taken the time to take their lives into their own hands."}, {"f998": "It was social and cultural to live our lives on other people’s terms just one generation ago. And many millennials are perpetuating this process simply because it’s the only worldview we’ve been taught."}, {"0a61": "Image courtesy of Unsplash"}, {"082a": "However, there is a growing collective-consciousness that with a lot of work and intention — you can live every moment of your life on your own terms."}, {"fc48": "You are the designer of your destiny."}, {"5f9d": "You are responsible."}, {"0270": "You get to decide. You must decide — because if you don’t, someone else will. Indecision is a bad decision."}, {"c66e": "With this short morning routine, your life will quickly change."}, {"57ef": "It may seem like a long list. But in short, it’s really quite simple:"}, {"11a4": "Let’s begin:"}, {"a36e": "1. Get A Healthy 7+ Hours of Sleep"}, {"521e": "Let’s face it — Sleep is just as important as eating and drinking water. Despite this, millions of people do not sleep enough and experience insane problems as a result."}, {"a9da": "The National Sleep Foundation (NSF) conducted surveys revealing that at least 40 million Americans suffer from over 70 different sleep disorders. Not only that, 60 percent of adults, and 69 percent of children, experience one or more sleep problems a few nights or more during a week."}, {"ae43": "In addition, more than 40 percent of adults experience daytime sleepiness severe enough to interfere with their daily activities at least a few days each month — with 20 percent reporting problem sleepiness a few days a week or more."}, {"6184": "On the flipside, getting a healthy amount of sleep is linked to:"}, {"9b42": "The rest of this blog post is worthless if you don’t make sleep a priority. Who cares if you wake up at 5 o’clock A.M. if you went to bed three hours earlier?"}, {"061d": "You won’t last long."}, {"b92c": "You may use stimulants to compensate, but that isn’t sustainable. In the long-run, your health will fall apart. The goal needs to be long-term sustainability."}, {"e104": "2. Prayer and Meditation to Facilitate Clarity and Abundance"}, {"faa9": "After waking from a healthy and restful sleep session, prayer and meditation are crucial for orienting yourself toward the positive. What you focus on expands."}, {"2885": "Prayer and meditation facilitate intense gratitude for all that you have. Gratitude is having an abundance mindset. When you think abundantly, the world is your oyster. There is limitless opportunity and possibility for you."}, {"0c1d": "People are magnets. When you’re grateful for what you have, you will attract more of the positive and good. Gratitude is contagious."}, {"e72e": "Gratitude may be the most important key to success. It has been called the mother of all virtues."}, {"ed18": "If you start every morning putting yourself in a space of gratitude and clarity, you will attract the best the world has to offer, and not get distracted."}, {"afe8": "3. Hard Physical Activity"}, {"8d58": "Despite endless evidence of the need for exercise, only one-third of American men and women between the ages of 25 to 64 years engage in regular physical activity according to the Center for Disease Control’s National Health Interview Survey."}, {"fc35": "If you want to be among the healthy, happy, and productive people in the world, get in the habit of regular exercise. Many people go immediately to the gym to get their body moving. I have lately found that doing yard work in the wee hours of the morning generates an intense inflow of inspiration and clarity."}, {"03a9": "Whatever your preference, get your body moving."}, {"c793": "Exercise has been found to decrease your chance of depression, anxiety, and stress. It is also related to higher success in your career."}, {"f42b": "If you don’t care about your body, every other aspect of your life will suffer. Humans are holistic beings."}, {"e360": "4. Consume 30 Grams of Protein"}, {"7cda": "Donald Layman, professor emeritus of nutrition at the University of Illinois, recommends consuming at least 30 grams of protein for breakfast. Similarly, Tim Ferriss, in his book, The 4-Hour Body, also recommends 30 grams of protein 30 minutes after waking up."}, {"803a": "According to Tim, his father did this and lost 19 pounds in one month."}, {"1745": "Protein-rich foods keep you full longer than other foods because they take longer to leave the stomach. Also, protein keeps blood-sugar levels steady, which prevents spikes in hunger."}, {"00ee": "Eating protein first decreases your white carbohydrate cravings. These are the types of carbs that get you fat. Think bagels, toast, and donuts."}, {"3a3d": "Tim makes four recommendations for getting adequate protein in the morning:"}, {"ef68": "For people who avoid dairy, meat, and eggs, there are several plant-based proteins. Legumes, greens, nuts, and seeds all are rich in protein."}, {"2993": "5. Take A Cold Shower"}, {"072a": "Tony Robbins starts every morning by jumping into a 57-degree Fahrenheit swimming pool."}, {"550e": "Why would he do such a thing?"}, {"61fc": "Cold water immersion radically facilitates physical and mental wellness.When practiced regularly, it provides long-lasting changes to your body’s immune, lymphatic, circulatory and digestive systems that improve the quality of your life. It can also increase weight-loss because it boosts your metabolism."}, {"19af": "A 2007 research study found that taking cold showers routinely can help treat depression symptoms often more effectively than prescription medications. That’s because cold water triggers a wave of mood-boosting neurochemicals which make you feel happy."}, {"b7b9": "There is of course, an initial fear of stepping into a cold shower. Without a doubt, if you’ve tried this before, you have found yourself standing outside the shower dreading the thought of going in."}, {"8e8e": "You may have even talked yourself out of it and said, “Maybe tomorrow.” And turned the hot water handle before getting in."}, {"478f": "Or, maybe you jumped in but quickly turned the hot water on?"}, {"00ab": "What has helped me is thinking about it like a swimming pool. It’s a slow painful death to get into a cold pool slowly. You just need to jump in. After 20 seconds, you’re fine."}, {"d8bc": "It’s the same way with taking a cold shower. You get in, you heart starts beating like crazy. Then, after like 20 seconds, you feel fine."}, {"88f6": "To me, it increases my willpower and boosts my creativity and inspiration. While standing with the cold water hitting my back, I practice slowing my breathing and calming down. After I’ve chilled out, I feel super happy and inspired. Lots of ideas start flowing and I become way motivated to achieve my goals."}, {"f479": "Plus, it’s healthy to do something in the morning that kind of freaks you out! Get’s you feeling alive and sets the tone for living outside your comfort zone!"}, {"5954": "6. Listen to/Read Uplifting Content"}, {"7fc6": "Ordinary people seek entertainment. Extraordinary people seek education and learning. It is common for the world’s most successful people to read at least one book per week. They are constantly learning."}, {"23a7": "I can easily get through one audiobook per week by just listening during my commute to school and while walking on campus."}, {"1ee9": "Taking even 15–30 minutes every morning to read uplifting and instructive information changes you. It puts you in the zone to perform at your highest."}, {"07ed": "Over a long enough period of time, you will have read hundreds of books. You’ll be knowledgeable on several topics. You’ll think and see the world differently. You’ll be able to make more connections between different topics."}, {"3e57": "7. Review Your Life Vision"}, {"9590": "Your goals should be written down — short term and long term. Taking just a few minutes to read your life vision puts your day into perspective."}, {"b505": "If you read your long term goals every day you will think about them every day. If you think about them every day, and spend your days working toward them, they’ll manifest."}, {"95b9": "Achieving goals is a science. There’s no confusion or ambiguity to it. If you follow a simple pattern, you can accomplish all of your goals, no matter how big they are."}, {"1d4b": "A fundamental aspect of that is writing them down and reviewing them every single day."}, {"416b": "8. Do At Least One Thing Towards Long-Term Goals"}, {"6609": "Willpower is like a muscle that depletes when it is exercised. Similarly, our ability to make high quality decisions becomes fatigued over time. The more decisions you make, the lower quality they become — the weaker your willpower."}, {"5fdd": "Consequently, you need to do the hard stuff first thing in the morning. The important stuff."}, {"bb07": "If you don’t, it simply will not get done. By the end of your day, you’ll be exhausted. You’ll be fried. There will be a million reasons to just start tomorrow. And you will start tomorrow — which is never."}, {"a7cf": "So your mantra becomes: The worst comes first. Do that thing you’ve been needing to do. Then do it again tomorrow."}, {"e866": "If you take just one step toward you big goals every day, you’ll realize those goals weren’t really far away."}, {"edfe": "Conclusion"}, {"f712": "After you’ve done this, no matter what you have for the rest of your day, you’ll have done the important stuff first. You’ll have put yourself in a place to succeed. You’ll have inched toward your dreams."}, {"9da3": "Because you’ll have done all these things, you’ll show up better in life. You’ll be better at your job. You’ll be better in your relationships. You’ll be happier. You’ll be more confident. You’ll be more bold and daring. You’ll have more clarity and vision."}, {"9203": "Your life will shortly change."}, {"baa8": "You can’t have mornings like this consistently without waking up to all that is incongruent in your life. Those things you despise will meet their demise. They’ll disappear and never return."}, {"4c5b": "You’ll quickly find you’re doing the work you’re passionate about."}, {"e474": "Your relationships will be passionate, meaningful, deep, and fun!"}, {"f6d9": "You will have freedom and abundance."}, {"a617": "The world, and the universe, will respond to you in beautiful ways."}, {"04ce": "Call To Action"}, {"6da6": "If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist."}, {"6b92": "Click here to get the checklist right now!"}], "content": "8 Things Every Person Should Do Before 8 A.M. Life is busy. It can feel impossible to move toward your dreams. If you have a full-time job and kids, it’s even harder. How do you move forward? If you don’t purposefully carve time out every day to progress and improve — without question, your time will get lost in the vacuum of our increasingly crowded lives. Before you know it, you’ll be old and withered — wondering where all that time went. As Professor Harold Hill has said — “You pile up enough tomorrows, and you’ll find you are left with nothing but a lot of empty yesterdays.” Rethinking Your Life and Getting Out of Survival Mode This article is intended to challenge you to rethink your entire approach to life. The purpose is to help you simplify and get back to the fundamentals. Sadly, most people’s lives are filled to the brim with the nonessential and trivial. They don’t have time to build toward anything meaningful. They are in survival mode. Are you in survival mode? Like Bilbo, most of us are like butter scraped over too much bread. Unfortunately, the bread is not even our own, but someone else’s. Very few have taken the time to take their lives into their own hands. It was social and cultural to live our lives on other people’s terms just one generation ago. And many millennials are perpetuating this process simply because it’s the only worldview we’ve been taught. Image courtesy of Unsplash However, there is a growing collective-consciousness that with a lot of work and intention — you can live every moment of your life on your own terms. You are the designer of your destiny. You are responsible. You get to decide. You must decide — because if you don’t, someone else will. Indecision is a bad decision. With this short morning routine, your life will quickly change. It may seem like a long list. But in short, it’s really quite simple: Let’s begin: 1. Get A Healthy 7+ Hours of Sleep Let’s face it — Sleep is just as important as eating and drinking water. Despite this, millions of people do not sleep enough and experience insane problems as a result. The National Sleep Foundation (NSF) conducted surveys revealing that at least 40 million Americans suffer from over 70 different sleep disorders. Not only that, 60 percent of adults, and 69 percent of children, experience one or more sleep problems a few nights or more during a week. In addition, more than 40 percent of adults experience daytime sleepiness severe enough to interfere with their daily activities at least a few days each month — with 20 percent reporting problem sleepiness a few days a week or more. On the flipside, getting a healthy amount of sleep is linked to: The rest of this blog post is worthless if you don’t make sleep a priority. Who cares if you wake up at 5 o’clock A.M. if you went to bed three hours earlier? You won’t last long. You may use stimulants to compensate, but that isn’t sustainable. In the long-run, your health will fall apart. The goal needs to be long-term sustainability. 2. Prayer and Meditation to Facilitate Clarity and Abundance After waking from a healthy and restful sleep session, prayer and meditation are crucial for orienting yourself toward the positive. What you focus on expands. Prayer and meditation facilitate intense gratitude for all that you have. Gratitude is having an abundance mindset. When you think abundantly, the world is your oyster. There is limitless opportunity and possibility for you. People are magnets. When you’re grateful for what you have, you will attract more of the positive and good. Gratitude is contagious. Gratitude may be the most important key to success. It has been called the mother of all virtues. If you start every morning putting yourself in a space of gratitude and clarity, you will attract the best the world has to offer, and not get distracted. 3. Hard Physical Activity Despite endless evidence of the need for exercise, only one-third of American men and women between the ages of 25 to 64 years engage in regular physical activity according to the Center for Disease Control’s National Health Interview Survey. If you want to be among the healthy, happy, and productive people in the world, get in the habit of regular exercise. Many people go immediately to the gym to get their body moving. I have lately found that doing yard work in the wee hours of the morning generates an intense inflow of inspiration and clarity. Whatever your preference, get your body moving. Exercise has been found to decrease your chance of depression, anxiety, and stress. It is also related to higher success in your career. If you don’t care about your body, every other aspect of your life will suffer. Humans are holistic beings. 4. Consume 30 Grams of Protein Donald Layman, professor emeritus of nutrition at the University of Illinois, recommends consuming at least 30 grams of protein for breakfast. Similarly, Tim Ferriss, in his book, The 4-Hour Body, also recommends 30 grams of protein 30 minutes after waking up. According to Tim, his father did this and lost 19 pounds in one month. Protein-rich foods keep you full longer than other foods because they take longer to leave the stomach. Also, protein keeps blood-sugar levels steady, which prevents spikes in hunger. Eating protein first decreases your white carbohydrate cravings. These are the types of carbs that get you fat. Think bagels, toast, and donuts. Tim makes four recommendations for getting adequate protein in the morning: For people who avoid dairy, meat, and eggs, there are several plant-based proteins. Legumes, greens, nuts, and seeds all are rich in protein. 5. Take A Cold Shower Tony Robbins starts every morning by jumping into a 57-degree Fahrenheit swimming pool. Why would he do such a thing? Cold water immersion radically facilitates physical and mental wellness.When practiced regularly, it provides long-lasting changes to your body’s immune, lymphatic, circulatory and digestive systems that improve the quality of your life. It can also increase weight-loss because it boosts your metabolism. A 2007 research study found that taking cold showers routinely can help treat depression symptoms often more effectively than prescription medications. That’s because cold water triggers a wave of mood-boosting neurochemicals which make you feel happy. There is of course, an initial fear of stepping into a cold shower. Without a doubt, if you’ve tried this before, you have found yourself standing outside the shower dreading the thought of going in. You may have even talked yourself out of it and said, “Maybe tomorrow.” And turned the hot water handle before getting in. Or, maybe you jumped in but quickly turned the hot water on? What has helped me is thinking about it like a swimming pool. It’s a slow painful death to get into a cold pool slowly. You just need to jump in. After 20 seconds, you’re fine. It’s the same way with taking a cold shower. You get in, you heart starts beating like crazy. Then, after like 20 seconds, you feel fine. To me, it increases my willpower and boosts my creativity and inspiration. While standing with the cold water hitting my back, I practice slowing my breathing and calming down. After I’ve chilled out, I feel super happy and inspired. Lots of ideas start flowing and I become way motivated to achieve my goals. Plus, it’s healthy to do something in the morning that kind of freaks you out! Get’s you feeling alive and sets the tone for living outside your comfort zone! 6. Listen to/Read Uplifting Content Ordinary people seek entertainment. Extraordinary people seek education and learning. It is common for the world’s most successful people to read at least one book per week. They are constantly learning. I can easily get through one audiobook per week by just listening during my commute to school and while walking on campus. Taking even 15–30 minutes every morning to read uplifting and instructive information changes you. It puts you in the zone to perform at your highest. Over a long enough period of time, you will have read hundreds of books. You’ll be knowledgeable on several topics. You’ll think and see the world differently. You’ll be able to make more connections between different topics. 7. Review Your Life Vision Your goals should be written down — short term and long term. Taking just a few minutes to read your life vision puts your day into perspective. If you read your long term goals every day you will think about them every day. If you think about them every day, and spend your days working toward them, they’ll manifest. Achieving goals is a science. There’s no confusion or ambiguity to it. If you follow a simple pattern, you can accomplish all of your goals, no matter how big they are. A fundamental aspect of that is writing them down and reviewing them every single day. 8. Do At Least One Thing Towards Long-Term Goals Willpower is like a muscle that depletes when it is exercised. Similarly, our ability to make high quality decisions becomes fatigued over time. The more decisions you make, the lower quality they become — the weaker your willpower. Consequently, you need to do the hard stuff first thing in the morning. The important stuff. If you don’t, it simply will not get done. By the end of your day, you’ll be exhausted. You’ll be fried. There will be a million reasons to just start tomorrow. And you will start tomorrow — which is never. So your mantra becomes: The worst comes first. Do that thing you’ve been needing to do. Then do it again tomorrow. If you take just one step toward you big goals every day, you’ll realize those goals weren’t really far away. Conclusion After you’ve done this, no matter what you have for the rest of your day, you’ll have done the important stuff first. You’ll have put yourself in a place to succeed. You’ll have inched toward your dreams. Because you’ll have done all these things, you’ll show up better in life. You’ll be better at your job. You’ll be better in your relationships. You’ll be happier. You’ll be more confident. You’ll be more bold and daring. You’ll have more clarity and vision. Your life will shortly change. You can’t have mornings like this consistently without waking up to all that is incongruent in your life. Those things you despise will meet their demise. They’ll disappear and never return. You’ll quickly find you’re doing the work you’re passionate about. Your relationships will be passionate, meaningful, deep, and fun! You will have freedom and abundance. The world, and the universe, will respond to you in beautiful ways. Call To Action If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist. Click here to get the checklist right now! ", "child": "196_1\t196_2\t196_3\t196_4\t196_5\t196_6\t196_7\t196_8\t196_9\t196_10\t196_11\t196_12\t196_13\t196_14\t196_15\t196_16\t196_17\t196_18\t196_19\t196_20\t196_21\t196_22\t196_23\t196_24\t196_25"}