{"name": "1976", "parent": "", "title": "Defining your company values in emoji", "sentences": [{"7840": "Defining your company values in emoji"}, {"7f75": "The buried lede: We’re hiring!"}, {"5560": "Company values are defined in the earliest days through the beliefs, words, and actions of the team. As a company matures, its culture and way of doing things becomes less malleable. “You can’t teach an old dog new tricks,” they say."}, {"2df3": "In early 2015, more than year after Product Hunt’s founding, we set out to articulate our values. While already established, we lacked a common definition to communicate to new teammates and the public."}, {"8746": "Our process"}, {"c961": "Inspired by this article on Slack’s company values, our awesome COO, Corley, led the process."}, {"8c8b": "We asked everyone on the team to come up with five words (and an associated image or GIF… because that’s more fun) that represents our culture and way of doing things."}, {"6c49": "Together, each person shared their pick and meaning behind each word. As expected, there was a lot of overlap in suggestions as we grouped common words together. After narrowing down the list, we came to five words with (in true Product Hunt fashion) an associated emoji:"}, {"459f": "💯 Bold — Every day, people launch their new side hustle or startup on Product Hunt. We encourage experimentation and bold ideas, both in the community and our own team."}, {"b5e4": "💕 Empathy — We’re proud of the community we’ve assembled to date; a group of people that demonstrate respect and empathy, because they know how vulnerable makers are when introducing their baby (aka product) to the world."}, {"e98d": "⚡ Curious — Makers often build things out of curiosity. That’s how Product Hunt started. People visit the site with interest, curious to discover things that didn’t exist yesterday."}, {"1e20": "😹 Kittenish — Product Hunt could be so sterile and boring, a acronym-heavy conversation about CAC and TAM. From the beginning, we wanted it to be a place to have fun. The Google Glass-wearing cat wasn’t an accident."}, {"e183": "💎 Authentic — Lastly, authenticity is an important characteristic of the community. Product Hunt is one of the few places on the internet where makers and consumers can directly connect in an unfiltered way. We dissuade off-putting marketing speak and encourage people to talk like they do with a friend."}, {"0334": "The point of it all"}, {"0a5a": "These words are not just hand waving. We use these to help guide:"}, {"5364": "If you haven’t established company values, I’d encourage you to give it a try and let us know how it goes."}, {"b41f": "Psst! We’re hiring."}, {"0873": "If you’d like to be a part of the Product Hunt team, let us know!"}, {"6a8e": "We’re looking for a Full-Stack Engineer and Product Designer to work with us in San Francisco or remotely (we hire talented people, no matter where they’re from 👋🏼)."}, {"5463": "Apply here."}], "content": "Defining your company values in emoji The buried lede: We’re hiring! Company values are defined in the earliest days through the beliefs, words, and actions of the team. As a company matures, its culture and way of doing things becomes less malleable. “You can’t teach an old dog new tricks,” they say. In early 2015, more than year after Product Hunt’s founding, we set out to articulate our values. While already established, we lacked a common definition to communicate to new teammates and the public. Our process Inspired by this article on Slack’s company values, our awesome COO, Corley, led the process. We asked everyone on the team to come up with five words (and an associated image or GIF… because that’s more fun) that represents our culture and way of doing things. Together, each person shared their pick and meaning behind each word. As expected, there was a lot of overlap in suggestions as we grouped common words together. After narrowing down the list, we came to five words with (in true Product Hunt fashion) an associated emoji: 💯 Bold — Every day, people launch their new side hustle or startup on Product Hunt. We encourage experimentation and bold ideas, both in the community and our own team. 💕 Empathy — We’re proud of the community we’ve assembled to date; a group of people that demonstrate respect and empathy, because they know how vulnerable makers are when introducing their baby (aka product) to the world. ⚡ Curious — Makers often build things out of curiosity. That’s how Product Hunt started. People visit the site with interest, curious to discover things that didn’t exist yesterday. 😹 Kittenish — Product Hunt could be so sterile and boring, a acronym-heavy conversation about CAC and TAM. From the beginning, we wanted it to be a place to have fun. The Google Glass-wearing cat wasn’t an accident. 💎 Authentic — Lastly, authenticity is an important characteristic of the community. Product Hunt is one of the few places on the internet where makers and consumers can directly connect in an unfiltered way. We dissuade off-putting marketing speak and encourage people to talk like they do with a friend. The point of it all These words are not just hand waving. We use these to help guide: If you haven’t established company values, I’d encourage you to give it a try and let us know how it goes. Psst! We’re hiring. If you’d like to be a part of the Product Hunt team, let us know! We’re looking for a Full-Stack Engineer and Product Designer to work with us in San Francisco or remotely (we hire talented people, no matter where they’re from 👋🏼). Apply here. ", "child": "1976_1\t1976_2"}