{"name": "1977", "parent": "", "title": "These 17 Smart Home Products Will Make Your Life Better", "sentences": [{"3eef": "These 17 Smart Home Products Will Make Your Life Better"}, {"2c56": "Can you imagine a home where everything utilizes the power of technology to make your life easier and more enjoyable? Imagine having a bed that tracks your sleep, a robotic mopping machine that cleans all of the floors for you, an alarm clock that wakes you up earlier if there’s traffic, and a remote control that you can use to do just about everything—from call an Uber to dim the lights in a room."}, {"da40": "It might sound like a world somewhere in the future, but all of these products—and more—already exist. Check 17 of them out on the list below. You’re sure to find at least a few things that will make your home smarter and your life better. 💯🏠"}, {"455e": "Eight Smart Mattress"}, {"2a54": "Make your bed smart in two minutes."}, {"430d": "Eight Smart Mattress is just about as smart as mattresses get. This 10\" thick mattress uses four different layers of foam to ensure you get the best comfort and quality out of your sleep experience. It comes with a technology cover and “hub” that track sleep trends for up to two people sleeping in the same bed. The cover automatically sets ideal temperatures for each side of the bed, and will also wake you up with a smart alarm so you rise feeling well rested and ready for the day."}, {"2c76": "Nebia Shower"}, {"eea9": "Better shower, 70% less water."}, {"00a7": "Nebia uses special H2MICRO™ technology to atomize water into millions of droplets and create 10x’s more surface area than a regular shower. More water comes in contact with your body leaving your skin feeling clean and hydrated. This shower uses 70% less water, but makes you feel like you just had the most invigorating shower ever. Don’t buy this if there are multiple people sharing a shower in your house because there may be a line to use it in the morning; you’ll never want to get out."}, {"fee3": "eero"}, {"6aed": "Blanket your home in fast and super reliable WiFi."}, {"b086": "Do you know people who are super delighted by their home Internet provider? We don’t, either, but there’s a feeling that’s about to change with the launch of eero WiFi System. This new app/hardware combo will give you everything you could ever want from a (WiFi) relationship: it’s simple, reliable, and always cooperates (i.e. you will never again need to manually reset your router the old school way). Also, no more rummaging around to find that note with the “8c5h3YL21D4g761cZ9” laying around. You can invite guests to join your network straight from the app on your phone."}, {"4d10": "Plume"}, {"d866": "Small pods that bring reliable WiFi to every room."}, {"4ac8": "We’ve all been there: the WiFi connection is strong in one room of your home, but not another. This happens because WiFi doesn’t travel through walls super well. If you feel this pain, you’ll love Plume, which is a self-optimizing network powered by the cloud to ensure that you have reliable WiFi service in every room in your house. This device will improve your WiFi by optimizing the flow of data. Each of the pods plugs into a wall outlet, so you also don’t have to deal with a ton of cable wires everywhere. All you need is one pod for every room in your home."}, {"bc7b": "Braava Jet"}, {"ef16": "Roomba’s first robotic mopping machine."}, {"2c1b": "The Braava Jet is a mopping robot that tackles dirt and stains in hard-to-reach places. All you have to do is attach a cleaning pad and it will automatically select wet mopping, damp sweeping, or dry sweeping. Whether you want to clean stone, tile, or hardwood floors, this little robot has you covered. :-)"}, {"4c17": "August Smart Lock"}, {"f618": "Control who can(‘t) enter from your smartphone/computer."}, {"22b5": "If you want to make sure your house is secure when you aren’t home, check out the August Smart Lock. Your smartphone essentially becomes a smart key to your door, allowing you to grant access to select friends and family remotely, get notified when someone rings your doorbell or locks/unlocks your door, and see and speak to visitors at your front door—even when you’re not home. You can also try August’s Doorbell Cam and Smart Keypad so you can keep a closer eye on your home and create custom entry codes for all of your guests."}, {"0087": "Nest Protect"}, {"7ca1": "A smart smoke alarm and carbon monoxide detector."}, {"4475": "Nest Protect"}, {"b174": "Smoke alarms are one of those things you know you need in your home, but they always seem to go off at the most awkward times (like when you’re hosting a dinner party — the worst). Luckily, Nest created Nest Protect, an industrial-grade smoke sensor. It’s the first home alarm you can silence from your phone without an extra hardware required. It also has a 10-year carbon monoxide sensor, which is amazing since it’s not something you can see or smell if it does become a problem in your home. Finally — a reinvented, much better take on the traditional home alarm."}, {"ba83": "Airmega"}, {"7cdf": "The smart air purifier."}, {"b01f": "The Airmega captures 99.97% of particles in the air, including: pollen, dander, and other allergens. It has an internal pollution sensor that measures the air quality and responds immediately, making your space a more comfortable place to breathe. You can control it via an app on your phone and also leave it on “Smart Mode,” which allows Airmega to adjust fan speeds based on lighting conditions and air quality. We’re breathing better already!"}, {"49c0": "Sevenhugs Smart Remote"}, {"d481": "The first remote for everything in your home."}, {"05e7": "This is straight out of a high-tech dream. Sevenhugs Smart Remote allows you to control everything in your home that is powered by WiFi, Bluetooth, or Infrared technology—from your television and speakers, to the lights and thermostat. All you have to do is point and click at the object you want to control with the remote. You can even point the remote at your door to order an Uber, or point it at the window to get details on the weather."}, {"c349": "Wally"}, {"eece": "A connected device to save your home from water damage."}, {"9fca": "If you’ve ever experienced or heard horror stories about water damage in a home, you know what a pain (and expense) it is to clean up. Especially if you’re a homeowner, look into Wally. This connected device detects water leaks, changes in humidity, and changes in temperature via a wireless sensor network. Use it to keep an eye on various leak-prone areas of your home, like the dishwasher, washing machine, sink, toilet, heater, and air conditioner. You’ll receive immediate alerts on your phone whenever a leak or humidity change is detected, allowing you to act quickly should there be a water emergency."}, {"383e": "Beam"}, {"0b67": "A smart projector that fits in any light socket."}, {"5909": "Beam is a smart light socket projector that can convert any flat surface into a big screen. There are so many unique uses for this, including: watching television in bed, displaying your calendar on the wall, cooking with a recipe (no hands required for a cookbook!), streaming content from your phone, and entertaining guests. This incredible, multi-purpose tool will leave you wondering how you ever lived without it."}, {"b21e": "Roome Mini Plus"}, {"e8ac": "Smart lamp that uses presence detection to light your room."}, {"a1e6": "Roome Mini Plus is a smart LED lamp that uses presence detection to automatically turn on when you enter a dark room. Roome tracks movement, monitors ambient light conditions, and learns how to control your lights for you over time. Put it on a magnetic charging base for constant lighting, or take it with you on the go (with full charge, this light lasts up to 10 hours). You can use it for both indoor and outdoor use."}, {"0f7b": "Bonjour"}, {"ff8d": "Smart alarm clock with artificial intelligence."}, {"40c4": "Now with Bonjour, your alarm clock will double as your personal assistant. This voice-controlled and AI-enhanced alarm clock will adjust your wake-up time based on certain conditions. For example, if you have an early morning meeting or there’s major traffic on your route to work, Bonjour will wake you up earlier so you can get to where you need to be on time. It will also help you call asleep better with a guided relaxation program, which connects to multiple devices like Apple Watch. Finally, use it to control your smart home devices with the sound of your voice, like adjusting the temperature when you wake up or go to bed. So many features packed into one little alarm clock!"}, {"680f": "Caia"}, {"4166": "A smart robot that bends sunlight where you want it."}, {"68e9": "Caia (originally named Lucy) is a portable robot that brings natural night into every corner of your home. Simply place the device in a sunny spot (indoors or outdoors), and point it toward the area you’d like to illuminate. Caia will redirect the light, brightening any space using natural sunshine. This device is powered by solar cells, so it doesn’t need to be charged. This is a great way to boost natural lighting in your home or office without turning on all of the lights, all day long."}, {"5ab8": "My Year Printed"}, {"5ce6": "Your Instagram year printed on a poster."}, {"88cb": "For everyone who reminisces about the days where we actually printed photos and hung them up, you’ll love My Year Printed. Connect your Instagram account to the service, select any photos you’d like to print, pick a poster size, and you’re good to go! Now you can see your whole year—or your favorite photos from multiple years—in one glance on your wall. We love how this simple product uses tech to create something tactile that you can actually hang on your wall."}, {"6dde": "Havenly"}, {"21fd": "Build your beautiful home with the help of an interior designer."}, {"f658": "Havenly is a fun tool to use if you’re moving into a new home or redecorating, and want to give your space a well-designed look without paying an arm and a leg. Select a room you’d like to design, answer a handful of questions about your preferred home style, pick a designer, and start decorating. With over 200 unique vendors, you can order new items directly from Havenly. It’s like Trunk Club for your home."}, {"e581": "IKEA Hackers"}, {"df5f": "A clever site dedicated to repurposing IKEA products."}, {"d336": "If you’re still on that college budget and can’t afford fancy furniture and a home decorator quite yet, check out IKEA Hackers. See how others have taken IKEA furniture and created entirely new products. Some of the best ideas from 2016 included: a bookshelf turned into a secret cubby and reading corner; a hidden tool storage unit; and a rolling lego station."}, {"b7a4": "Ahh, the joy of having a smart home. If you’re impressed by the gadgets on this list and want to explore other products that exist to make your home intelligent and your life better, check out the full collection on Product Hunt:"}], "content": "These 17 Smart Home Products Will Make Your Life Better Can you imagine a home where everything utilizes the power of technology to make your life easier and more enjoyable? Imagine having a bed that tracks your sleep, a robotic mopping machine that cleans all of the floors for you, an alarm clock that wakes you up earlier if there’s traffic, and a remote control that you can use to do just about everything—from call an Uber to dim the lights in a room. It might sound like a world somewhere in the future, but all of these products—and more—already exist. Check 17 of them out on the list below. You’re sure to find at least a few things that will make your home smarter and your life better. 💯🏠 Eight Smart Mattress Make your bed smart in two minutes. Eight Smart Mattress is just about as smart as mattresses get. This 10\" thick mattress uses four different layers of foam to ensure you get the best comfort and quality out of your sleep experience. It comes with a technology cover and “hub” that track sleep trends for up to two people sleeping in the same bed. The cover automatically sets ideal temperatures for each side of the bed, and will also wake you up with a smart alarm so you rise feeling well rested and ready for the day. Nebia Shower Better shower, 70% less water. Nebia uses special H2MICRO™ technology to atomize water into millions of droplets and create 10x’s more surface area than a regular shower. More water comes in contact with your body leaving your skin feeling clean and hydrated. This shower uses 70% less water, but makes you feel like you just had the most invigorating shower ever. Don’t buy this if there are multiple people sharing a shower in your house because there may be a line to use it in the morning; you’ll never want to get out. eero Blanket your home in fast and super reliable WiFi. Do you know people who are super delighted by their home Internet provider? We don’t, either, but there’s a feeling that’s about to change with the launch of eero WiFi System. This new app/hardware combo will give you everything you could ever want from a (WiFi) relationship: it’s simple, reliable, and always cooperates (i.e. you will never again need to manually reset your router the old school way). Also, no more rummaging around to find that note with the “8c5h3YL21D4g761cZ9” laying around. You can invite guests to join your network straight from the app on your phone. Plume Small pods that bring reliable WiFi to every room. We’ve all been there: the WiFi connection is strong in one room of your home, but not another. This happens because WiFi doesn’t travel through walls super well. If you feel this pain, you’ll love Plume, which is a self-optimizing network powered by the cloud to ensure that you have reliable WiFi service in every room in your house. This device will improve your WiFi by optimizing the flow of data. Each of the pods plugs into a wall outlet, so you also don’t have to deal with a ton of cable wires everywhere. All you need is one pod for every room in your home. Braava Jet Roomba’s first robotic mopping machine. The Braava Jet is a mopping robot that tackles dirt and stains in hard-to-reach places. All you have to do is attach a cleaning pad and it will automatically select wet mopping, damp sweeping, or dry sweeping. Whether you want to clean stone, tile, or hardwood floors, this little robot has you covered. :-) August Smart Lock Control who can(‘t) enter from your smartphone/computer. If you want to make sure your house is secure when you aren’t home, check out the August Smart Lock. Your smartphone essentially becomes a smart key to your door, allowing you to grant access to select friends and family remotely, get notified when someone rings your doorbell or locks/unlocks your door, and see and speak to visitors at your front door—even when you’re not home. You can also try August’s Doorbell Cam and Smart Keypad so you can keep a closer eye on your home and create custom entry codes for all of your guests. Nest Protect A smart smoke alarm and carbon monoxide detector. Nest Protect Smoke alarms are one of those things you know you need in your home, but they always seem to go off at the most awkward times (like when you’re hosting a dinner party — the worst). Luckily, Nest created Nest Protect, an industrial-grade smoke sensor. It’s the first home alarm you can silence from your phone without an extra hardware required. It also has a 10-year carbon monoxide sensor, which is amazing since it’s not something you can see or smell if it does become a problem in your home. Finally — a reinvented, much better take on the traditional home alarm. Airmega The smart air purifier. The Airmega captures 99.97% of particles in the air, including: pollen, dander, and other allergens. It has an internal pollution sensor that measures the air quality and responds immediately, making your space a more comfortable place to breathe. You can control it via an app on your phone and also leave it on “Smart Mode,” which allows Airmega to adjust fan speeds based on lighting conditions and air quality. We’re breathing better already! Sevenhugs Smart Remote The first remote for everything in your home. This is straight out of a high-tech dream. Sevenhugs Smart Remote allows you to control everything in your home that is powered by WiFi, Bluetooth, or Infrared technology—from your television and speakers, to the lights and thermostat. All you have to do is point and click at the object you want to control with the remote. You can even point the remote at your door to order an Uber, or point it at the window to get details on the weather. Wally A connected device to save your home from water damage. If you’ve ever experienced or heard horror stories about water damage in a home, you know what a pain (and expense) it is to clean up. Especially if you’re a homeowner, look into Wally. This connected device detects water leaks, changes in humidity, and changes in temperature via a wireless sensor network. Use it to keep an eye on various leak-prone areas of your home, like the dishwasher, washing machine, sink, toilet, heater, and air conditioner. You’ll receive immediate alerts on your phone whenever a leak or humidity change is detected, allowing you to act quickly should there be a water emergency. Beam A smart projector that fits in any light socket. Beam is a smart light socket projector that can convert any flat surface into a big screen. There are so many unique uses for this, including: watching television in bed, displaying your calendar on the wall, cooking with a recipe (no hands required for a cookbook!), streaming content from your phone, and entertaining guests. This incredible, multi-purpose tool will leave you wondering how you ever lived without it. Roome Mini Plus Smart lamp that uses presence detection to light your room. Roome Mini Plus is a smart LED lamp that uses presence detection to automatically turn on when you enter a dark room. Roome tracks movement, monitors ambient light conditions, and learns how to control your lights for you over time. Put it on a magnetic charging base for constant lighting, or take it with you on the go (with full charge, this light lasts up to 10 hours). You can use it for both indoor and outdoor use. Bonjour Smart alarm clock with artificial intelligence. Now with Bonjour, your alarm clock will double as your personal assistant. This voice-controlled and AI-enhanced alarm clock will adjust your wake-up time based on certain conditions. For example, if you have an early morning meeting or there’s major traffic on your route to work, Bonjour will wake you up earlier so you can get to where you need to be on time. It will also help you call asleep better with a guided relaxation program, which connects to multiple devices like Apple Watch. Finally, use it to control your smart home devices with the sound of your voice, like adjusting the temperature when you wake up or go to bed. So many features packed into one little alarm clock! Caia A smart robot that bends sunlight where you want it. Caia (originally named Lucy) is a portable robot that brings natural night into every corner of your home. Simply place the device in a sunny spot (indoors or outdoors), and point it toward the area you’d like to illuminate. Caia will redirect the light, brightening any space using natural sunshine. This device is powered by solar cells, so it doesn’t need to be charged. This is a great way to boost natural lighting in your home or office without turning on all of the lights, all day long. My Year Printed Your Instagram year printed on a poster. For everyone who reminisces about the days where we actually printed photos and hung them up, you’ll love My Year Printed. Connect your Instagram account to the service, select any photos you’d like to print, pick a poster size, and you’re good to go! Now you can see your whole year—or your favorite photos from multiple years—in one glance on your wall. We love how this simple product uses tech to create something tactile that you can actually hang on your wall. Havenly Build your beautiful home with the help of an interior designer. Havenly is a fun tool to use if you’re moving into a new home or redecorating, and want to give your space a well-designed look without paying an arm and a leg. Select a room you’d like to design, answer a handful of questions about your preferred home style, pick a designer, and start decorating. With over 200 unique vendors, you can order new items directly from Havenly. It’s like Trunk Club for your home. IKEA Hackers A clever site dedicated to repurposing IKEA products. If you’re still on that college budget and can’t afford fancy furniture and a home decorator quite yet, check out IKEA Hackers. See how others have taken IKEA furniture and created entirely new products. Some of the best ideas from 2016 included: a bookshelf turned into a secret cubby and reading corner; a hidden tool storage unit; and a rolling lego station. Ahh, the joy of having a smart home. If you’re impressed by the gadgets on this list and want to explore other products that exist to make your home intelligent and your life better, check out the full collection on Product Hunt: ", "child": "1977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_21977_1\t1977_2"}