{"name": "198", "parent": "", "title": "How to know what to write about.", "sentences": [{"44b9": "How to know what to write about."}, {"dba9": "A 4-step plan for starting a daily blogging habit."}, {"0f5b": "How to know what to write about."}, {"31e1": "A 4-step plan for starting a daily blogging habit."}, {"810b": "I’ve already written about how a blogging daily for the last several weeks has made a big impact on my life."}, {"a2b4": "I blogged every day for a month. Here’s what happened.The results of a Quora + Medium experiment.medium.com"}, {"7d46": "And that I don’t think a traditional blog is the way to go."}, {"0e6d": "Blogging is the new Blockbuster Video. Do this instead.Remember 2002?medium.com"}, {"ea3f": "Here’s a question I get asked a lot:"}, {"037b": "Daily blogging sounds like a good idea, but what should I write about?"}, {"e033": "Let’s talk a little about blogging, first. There are really two things you can do: teach something you’re an expert at or learn something you’re not an expert at."}, {"0bf1": "Bryan Harris at VideoFruit calls the second one learning out loud."}, {"ff7d": "When I write about writing fiction, I put on my expert cap. I’ve been a fiction writer for more than 20 years, I’m traditionally published, I’ve studied at a college level."}, {"ebbb": "When I write about writing fiction, I’m teaching readers what I’ve already mastered. I’m a sherpa who already knows the way."}, {"5475": "When I write about my big, fat plan of running an Iron Man three years from now, I’m most definitely learning out loud. I hope no one comes to me (at least not right now) looking for advice about how to be an Iron Man because I am not your girl."}, {"67a5": "When I write about my Iron Man plan, I’m taking readers along with me as I do this thing I’ve never done before. I’m a stumbler, just like you."}, {"2027": "See the difference?"}, {"c362": "So, start here: Take an inventory."}, {"2d4c": "Get out a notebook and make a couple of lists."}, {"86a7": "What are things you’re good at."}, {"0ef9": "My list looks like this:"}, {"8400": "I’m a professional fiction writer. I’m an idea person. I am very right brained. I’m a teacher, by nature. I have an adult child who has autism. My parents in law, who both have dementia, live with me. I’ve been very poor. My father was in prison when I was a teenager. I grew up surrounded by addiction. I’ve lost 120 pounds via weight loss surgery."}, {"ca45": "You can see, I’m not just listing my jobs or things I’ve had some training in. There are parts of my life that I’m confident about speaking into from a place of experience and expertise. I can write about poverty, for instance, because I’ve been there. I can write about being fat and what it’s like to suddenly not recognize your body anymore."}, {"8399": "What are things you aren’t good at, but you want to be?"}, {"6dab": "My list looks like this:"}, {"2f93": "I want to be an athlete again. I want to learn to play the guitar and write songs. I want to travel through Europe with a train pass and a backpack. I want to figure out indie publishing. I want to build an email list of 100,000, so I won’t need a traditional publisher ever again. I want to learn to tame my right-brainedness. I want to learn to sew."}, {"ef5f": "Once I have that list, I can pick any item on it, make a plan for actually doing it. And then write about doing it."}, {"298f": "You can see where I’m doing that at my 60 Months to Iron Man publication. And I write every couple of weeks about my quest to build a mailing list. And I write fairly often about my path toward self-publishing."}, {"8ce5": "I also could decide to go all in one learning to play the guitar and write songs, and share what I’m doing and my progress. I could start planning and saving for a backpacking trip through Europe and share all of that."}, {"cd4a": "What are your most interesting life experiences?"}, {"281a": "My list looks like this:"}, {"838f": "I’ve been traditionally published. I have eight brothers and sisters. Our dad was in prison when I was a teenager. I married young and divorced young. I have been very poor. I’m not poor anymore. I have a son who has autism. My husband’s parents, who both have dementia, live with us. I have had weight loss surgery. I am in recovery from an eating disorder. I started a business last year that let me quit my day job."}, {"6aa9": "You can see there’s some overlap with the first two lists."}, {"ae65": "I write a lot about online business, because it’s what’s happening in my life right now. I write from a place that’s somewhere between expert and learning out loud. Like I’m your big sister who’s a step or two ahead of you."}, {"c724": "I write sometimes about living with autism and dementia at the same time. And about things like body acceptance and weight loss and where those two meet and crash into each other."}, {"d21e": "I could also write a daily “weird shit that happens at my house” post. Or take on body acceptance or poverty more squarely than I already do."}, {"6264": "What are you interested in?"}, {"bc4f": "This is a slightly different question than both of the first two."}, {"975e": "My list looks like this: I’m interested in personal finance, and being debt free in particular. I love books and movies and good television (in other words: stories, however I can get them.) I think a lot about creativity and productivity and where inspiration comes from."}, {"6bba": "Because creativity and productivity and inspiration tie in nicely with writing, which is my main focus, I write about them a lot. I write less about personal finance, but I have. Especially when I think about things like how artists and creatives can earn a living."}, {"2efd": "This is just a list of things you can mine for ideas. Look for intersections. Like: how does creativity fair when you’re part of the sandwich generation? Or why should fiction writers watch a lot of television?"}, {"9579": "Put it all together."}, {"b864": "Take a look at your lists and decide which ones resonate the strongest with you."}, {"39aa": "For me, that’s: writing, starting a business, marketing, creativity, productivity, body positivity, weight loss, my 60 Months to Iron Man plan, poverty, autism, dementia."}, {"fadc": "Now head to Quora."}, {"0084": "Make a profile and then noodle around there. Look at questions that people are asking that pertain to the areas you want to write about. Look for questions that are either asked often or that have had a lot of views."}, {"88cf": "Turn to a new page in your notebook and start listing them."}, {"2ab4": "These are your future blog posts."}, {"c118": "Answer the questions on Quora and repost over here on Medium. Do that everyday for 30 days to start, and see what happens."}, {"ef0d": "If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤"}, {"76f0": ">>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"d565": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "content": "How to know what to write about. A 4-step plan for starting a daily blogging habit. How to know what to write about. A 4-step plan for starting a daily blogging habit. I’ve already written about how a blogging daily for the last several weeks has made a big impact on my life. I blogged every day for a month. Here’s what happened.The results of a Quora + Medium experiment.medium.com And that I don’t think a traditional blog is the way to go. Blogging is the new Blockbuster Video. Do this instead.Remember 2002?medium.com Here’s a question I get asked a lot: Daily blogging sounds like a good idea, but what should I write about? Let’s talk a little about blogging, first. There are really two things you can do: teach something you’re an expert at or learn something you’re not an expert at. Bryan Harris at VideoFruit calls the second one learning out loud. When I write about writing fiction, I put on my expert cap. I’ve been a fiction writer for more than 20 years, I’m traditionally published, I’ve studied at a college level. When I write about writing fiction, I’m teaching readers what I’ve already mastered. I’m a sherpa who already knows the way. When I write about my big, fat plan of running an Iron Man three years from now, I’m most definitely learning out loud. I hope no one comes to me (at least not right now) looking for advice about how to be an Iron Man because I am not your girl. When I write about my Iron Man plan, I’m taking readers along with me as I do this thing I’ve never done before. I’m a stumbler, just like you. See the difference? So, start here: Take an inventory. Get out a notebook and make a couple of lists. What are things you’re good at. My list looks like this: I’m a professional fiction writer. I’m an idea person. I am very right brained. I’m a teacher, by nature. I have an adult child who has autism. My parents in law, who both have dementia, live with me. I’ve been very poor. My father was in prison when I was a teenager. I grew up surrounded by addiction. I’ve lost 120 pounds via weight loss surgery. You can see, I’m not just listing my jobs or things I’ve had some training in. There are parts of my life that I’m confident about speaking into from a place of experience and expertise. I can write about poverty, for instance, because I’ve been there. I can write about being fat and what it’s like to suddenly not recognize your body anymore. What are things you aren’t good at, but you want to be? My list looks like this: I want to be an athlete again. I want to learn to play the guitar and write songs. I want to travel through Europe with a train pass and a backpack. I want to figure out indie publishing. I want to build an email list of 100,000, so I won’t need a traditional publisher ever again. I want to learn to tame my right-brainedness. I want to learn to sew. Once I have that list, I can pick any item on it, make a plan for actually doing it. And then write about doing it. You can see where I’m doing that at my 60 Months to Iron Man publication. And I write every couple of weeks about my quest to build a mailing list. And I write fairly often about my path toward self-publishing. I also could decide to go all in one learning to play the guitar and write songs, and share what I’m doing and my progress. I could start planning and saving for a backpacking trip through Europe and share all of that. What are your most interesting life experiences? My list looks like this: I’ve been traditionally published. I have eight brothers and sisters. Our dad was in prison when I was a teenager. I married young and divorced young. I have been very poor. I’m not poor anymore. I have a son who has autism. My husband’s parents, who both have dementia, live with us. I have had weight loss surgery. I am in recovery from an eating disorder. I started a business last year that let me quit my day job. You can see there’s some overlap with the first two lists. I write a lot about online business, because it’s what’s happening in my life right now. I write from a place that’s somewhere between expert and learning out loud. Like I’m your big sister who’s a step or two ahead of you. I write sometimes about living with autism and dementia at the same time. And about things like body acceptance and weight loss and where those two meet and crash into each other. I could also write a daily “weird shit that happens at my house” post. Or take on body acceptance or poverty more squarely than I already do. What are you interested in? This is a slightly different question than both of the first two. My list looks like this: I’m interested in personal finance, and being debt free in particular. I love books and movies and good television (in other words: stories, however I can get them.) I think a lot about creativity and productivity and where inspiration comes from. Because creativity and productivity and inspiration tie in nicely with writing, which is my main focus, I write about them a lot. I write less about personal finance, but I have. Especially when I think about things like how artists and creatives can earn a living. This is just a list of things you can mine for ideas. Look for intersections. Like: how does creativity fair when you’re part of the sandwich generation? Or why should fiction writers watch a lot of television? Put it all together. Take a look at your lists and decide which ones resonate the strongest with you. For me, that’s: writing, starting a business, marketing, creativity, productivity, body positivity, weight loss, my 60 Months to Iron Man plan, poverty, autism, dementia. Now head to Quora. Make a profile and then noodle around there. Look at questions that people are asking that pertain to the areas you want to write about. Look for questions that are either asked often or that have had a lot of views. Turn to a new page in your notebook and start listing them. These are your future blog posts. Answer the questions on Quora and repost over here on Medium. Do that everyday for 30 days to start, and see what happens. If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ >>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "child": "198_1\t198_2\t198_3\t198_4\t198_5\t198_6\t198_7\t198_8\t198_9\t198_10198_1\t198_2\t198_3\t198_4\t198_5\t198_6\t198_7\t198_8\t198_9\t198_10"}