{"name": "1985", "parent": "", "title": "West Virginia’s Jevon Carter Will Make You Work for Every Bucket", "sentences": [{"268f": "West Virginia’s Jevon Carter Will Make You Work for Every Bucket"}, {"7492": "The junior point guard lives to make life tough for opponents. Now it’s Gonzaga’s turn to try to deal with him."}, {"40f6": "West Virginia’s Jevon Carter wasn’t supposed to be a point guard. He was recruited out of Maywood, Illinois, in 2014 as a shooting guard, and despite his 6-foot-2 frame he largely played off the ball at Proviso East High."}, {"c2e9": "In his first season at West Virginia, he mostly came off the bench for the Mountaineers and played at the 2 while seniors Juwan Staten and Gary Browne handled the ball. If it weren’t for late-season injuries to both, Carter may have never found himself occupying the team’s starting point guard spot, a role he’s held ever since."}, {"834e": "There were some growing pains while adjusting to his new position. Carter had arguably his worst game — and moment — as the starting point guard last season against 10th-ranked Virginia when, with 13 minutes to play in the second half and his Mountaineers leading 40–39, Carter stole the ball from Virginia’s star point guard, London Perrantes, and on the ensuing fast break tried a behind-the-back pass instead of an easy layup. Perrantes stole the ball back and nailed a 3 that was part of a 19–5 run. Perrantes and Virginia ended up winning 70–54."}, {"fe26": "Immediately after the turnover, West Virginia coach Bob Huggins subbed Carter out for the rest of the game. Afterward, he criticized Carter’s decision-making. “I’m not sure he knows when to shoot and when to pass. He’s never played point guard before,” Huggins told West Virginia Illustrated. “We’re going to have to spend a lot of time working with him. He’s going to have to be receptive to coaching.”"}, {"3451": "Since that game, through his intense workout schedule and Huggins’s coaching, Carter has developed into one of the most well-rounded point guards in the Big 12. This season he’s averaging 13.3 points, 3.8 assists, and 4.9 rebounds, all career highs."}, {"1644": "Carter affects the game in myriad ways, whether it be scoring, assisting, rebounding, or defending. Carter is the type of guy you’d hate to play pickup against because not only will he shut you down defensively, he also has the energy to do everything for his own team, too. His versatility especially shined during the Mountaineers’ 85–69 win against Kansas in January, when he posted a near triple-double with nine points, nine assists, and eight rebounds."}, {"8732": "Carter has developed into an all-around guard, but his defensive ability is the best aspect of his game. His team holds an 89.5 defensive rating with him on the floor, which leads the Big 12 and is 10th in the country (both rankings among players who have logged at least 800 minutes). He’s been named to the Big 12’s All-Defensive Team in each of his three seasons at West Virginia, and he won the conference’s Defensive Player of the Year award this season."}, {"e868": "His defensive prowess is even more important at West Virginia, where the Mountaineers offense relies on forced turnovers and fast breaks. The team leads the country in forced turnovers with 724, and Carter is the leader of Press Virginia, averaging a career-high 2.5 steals per game."}, {"5f78": "In a conference of star guards, Carter knew from the moment he set foot in Morgantown that one way to separate himself from the pack would be to practice tenacious defense."}, {"c8dc": "“When I got here I knew it’s college basketball, it’s scorers all around the world, and I feel like not too many people take pride in playing defense. So I knew if I wanted to create that separation between myself and other people I would have to do it on the defensive end,” he said in a West Virginia Sports video."}, {"067e": "Carter is a pest, always finding ways to get under his opponents’ skin. He can take a team’s best guy out of the game. He’s relentless, always within breathing range of his man as the other team brings the ball up the court. “I like to see a guy get rattled. I like to guard a guy who’s used to scoring 20, 25 points,” Carter said in the West Virginia Sports video. “He’s playing us and he’s just frustrated. You got them arguing with their teammates, you got them taking ill-advised shots, not touching the ball, getting cheap fouls, just get into their heads.”"}, {"4206": "Carter shined defensively in games against the Big 12’s two premier point guards, Kansas’s Frank Mason and Iowa State’s Monte Morris. In two regular-season games each against those guards, he held Mason to a combined 9-of-29 shooting and Morris to 9-of-27."}, {"8ac6": "His great play has continued into this year’s tournament with 11 points and seven rebounds against Bucknell and a 24-point performance in an 83–71 win over Notre Dame."}, {"2b77": "To advance to the Elite Eight, the Mountaineers and Carter will have to take down no. 1 seed Gonzaga. Carter will be in charge of containing the Bulldogs backcourt of Jordan Matthews (10.7 points, 39.2 percent from 3 on 5.4 attempts) and Nigel Williams-Goss (16.7 points, 4.7 assists, 5.8 rebounds). But these are the games Carter lives for; he probably started devising ways to get under Williams-Goss’s skin as soon as West Virginia beat Notre Dame."}], "content": "West Virginia’s Jevon Carter Will Make You Work for Every Bucket The junior point guard lives to make life tough for opponents. Now it’s Gonzaga’s turn to try to deal with him. West Virginia’s Jevon Carter wasn’t supposed to be a point guard. He was recruited out of Maywood, Illinois, in 2014 as a shooting guard, and despite his 6-foot-2 frame he largely played off the ball at Proviso East High. In his first season at West Virginia, he mostly came off the bench for the Mountaineers and played at the 2 while seniors Juwan Staten and Gary Browne handled the ball. If it weren’t for late-season injuries to both, Carter may have never found himself occupying the team’s starting point guard spot, a role he’s held ever since. There were some growing pains while adjusting to his new position. Carter had arguably his worst game — and moment — as the starting point guard last season against 10th-ranked Virginia when, with 13 minutes to play in the second half and his Mountaineers leading 40–39, Carter stole the ball from Virginia’s star point guard, London Perrantes, and on the ensuing fast break tried a behind-the-back pass instead of an easy layup. Perrantes stole the ball back and nailed a 3 that was part of a 19–5 run. Perrantes and Virginia ended up winning 70–54. Immediately after the turnover, West Virginia coach Bob Huggins subbed Carter out for the rest of the game. Afterward, he criticized Carter’s decision-making. “I’m not sure he knows when to shoot and when to pass. He’s never played point guard before,” Huggins told West Virginia Illustrated. “We’re going to have to spend a lot of time working with him. He’s going to have to be receptive to coaching.” Since that game, through his intense workout schedule and Huggins’s coaching, Carter has developed into one of the most well-rounded point guards in the Big 12. This season he’s averaging 13.3 points, 3.8 assists, and 4.9 rebounds, all career highs. Carter affects the game in myriad ways, whether it be scoring, assisting, rebounding, or defending. Carter is the type of guy you’d hate to play pickup against because not only will he shut you down defensively, he also has the energy to do everything for his own team, too. His versatility especially shined during the Mountaineers’ 85–69 win against Kansas in January, when he posted a near triple-double with nine points, nine assists, and eight rebounds. Carter has developed into an all-around guard, but his defensive ability is the best aspect of his game. His team holds an 89.5 defensive rating with him on the floor, which leads the Big 12 and is 10th in the country (both rankings among players who have logged at least 800 minutes). He’s been named to the Big 12’s All-Defensive Team in each of his three seasons at West Virginia, and he won the conference’s Defensive Player of the Year award this season. His defensive prowess is even more important at West Virginia, where the Mountaineers offense relies on forced turnovers and fast breaks. The team leads the country in forced turnovers with 724, and Carter is the leader of Press Virginia, averaging a career-high 2.5 steals per game. In a conference of star guards, Carter knew from the moment he set foot in Morgantown that one way to separate himself from the pack would be to practice tenacious defense. “When I got here I knew it’s college basketball, it’s scorers all around the world, and I feel like not too many people take pride in playing defense. So I knew if I wanted to create that separation between myself and other people I would have to do it on the defensive end,” he said in a West Virginia Sports video. Carter is a pest, always finding ways to get under his opponents’ skin. He can take a team’s best guy out of the game. He’s relentless, always within breathing range of his man as the other team brings the ball up the court. “I like to see a guy get rattled. I like to guard a guy who’s used to scoring 20, 25 points,” Carter said in the West Virginia Sports video. “He’s playing us and he’s just frustrated. You got them arguing with their teammates, you got them taking ill-advised shots, not touching the ball, getting cheap fouls, just get into their heads.” Carter shined defensively in games against the Big 12’s two premier point guards, Kansas’s Frank Mason and Iowa State’s Monte Morris. In two regular-season games each against those guards, he held Mason to a combined 9-of-29 shooting and Morris to 9-of-27. His great play has continued into this year’s tournament with 11 points and seven rebounds against Bucknell and a 24-point performance in an 83–71 win over Notre Dame. To advance to the Elite Eight, the Mountaineers and Carter will have to take down no. 1 seed Gonzaga. Carter will be in charge of containing the Bulldogs backcourt of Jordan Matthews (10.7 points, 39.2 percent from 3 on 5.4 attempts) and Nigel Williams-Goss (16.7 points, 4.7 assists, 5.8 rebounds). But these are the games Carter lives for; he probably started devising ways to get under Williams-Goss’s skin as soon as West Virginia beat Notre Dame. ", "child": "1985_1\t1985_2\t1985_3"}