{"name": "1986", "parent": "", "title": "Big Dance Breakdown, Day 2", "sentences": [{"8eac": "NCAA Tournament Daily Recap"}, {"e875": "Big Dance Breakdown, Day 2"}, {"ea8b": "The “trouble” ahead for Duke, Michigan State’s arrival, and why you should be excited for Round 2"}, {"a73d": "The second day of the 2017 NCAA tournament is in the books and I gotta say: I’m not sure where the writers are taking this thing. I mean, I like some of the story lines they’ve come up with — at least seven teams could realistically win the West, Kentucky’s path to a title will be brutal yet entertaining as hell, and the defending champs are looming. But man, can we please just cut to the chase already? I’m all for character and story development, but I’m going to need some explosions/fight scenes/nudity (OK, maybe not nudity) and I’m going to need them STAT."}, {"cfcc": "Until then, here are the 10 things that stood out to me from Friday."}, {"c76e": "1. Michigan vs. Oklahoma State was everything I dreamed it would be."}, {"6bdc": "From the moment the bracket was first revealed, I circled Michigan and Oklahoma State as the one game I was most excited to watch in the first round. Both teams are among the best offenses in college basketball and are led by two of the best point guards in America in Derrick Walton Jr. and Jawun Evans, leading me to believe that this would be a high-scoring, back-and-forth affair that would come down to the wire. And I’ll be damned, that’s exactly what we got. Evans was unbelievable, finishing with 23 points, 12 assists, and seven rebounds. Yet he wasn’t even the player of the game thanks to Walton’s 26 points, 11 assists, and five rebounds while hitting 6 of 9 from the 3-point line. Oh, and speaking of hitting 3s, I should probably mention that the Wolverines went 16-for-29 from deep as a team, including an 11-for-16 second half that honestly felt more like they went 35-for-35. Michigan will have its hands full in the second round against a devastating Louisville defense, and it’s definitely worrisome that they won only by one despite missing, like, four shots the entire game. But if the Wolverines keep bombing 3s at the rate they did on Friday, there isn’t a team on earth that can stop them."}, {"bc47": "2. The ending to Arkansas vs. Seton Hall was bad, and I’m still not sure who I should blame."}, {"1248": "No matter how you feel about the flagrant-1 foul call on Seton Hall’s Desi Rodriguez with 17 seconds left and the Pirates down by one to the Razorbacks, you’re wrong. On the one hand, Rodriguez did shove Arkansas’s Jaylen Barford in the back with two hands with the sole purpose of stopping the clock. The rule book clearly states that pushing a player from behind, fouling to stop the clock without making a play on the ball, and/or using excessive or unnecessary force should be called a flagrant-1, regardless of the severity of the act. All of those criteria apply to this play, which is why I don’t think the official who made the call should be crucified for not “letting the players decide it.”"}, {"5f2c": "Seton Hall Has Both Itself and the Refs to BlameTurnovers and a curious flagrant foul doomed the Pirates against Arkansastheringer.com"}, {"4b1d": "Then again, this is the type of play that happens all the time at the ends of games and goes uncalled, so I’m not sure it’s fair to blame Rodriguez for not making a play on the ball either. Also, so much of what made the play look bad was Barford being inadvertently tripped by Rodriguez, leading many to wonder if the play would still have been considered a flagrant foul had Barford remained upright. I’m not sure what the right answer is. I just know that we were robbed of what may have been an all-time March Madness moment had the referees not assessed the play the way they did, and that truly sucks. I also know that, along with yesterday’s fouling mistake at the end of the Northwestern-Vanderbilt game, this means the two biggest moments of the 2017 NCAA tournament have been fouls. THE MADNESS IS ALMOST TOO MUCH TO HANDLE."}, {"7da0": "3. SMU’s decision to hire Tom Crean as a zone offense consultant proved to be terrible."}, {"0e95": "It apparently didn’t take Crean long to land on his feet after Indiana fired him on Thursday, seeing as how I’m pretty sure SMU coach and Indiana native Tim Jankovich turned to Crean for advice and implemented the exact same zone offense against USC that Crean used against Syracuse in the 2013 Sweet 16. SMU built a 12-point lead over USC with about 7:30 left in the first half, prompting the Trojans to switch to a 2–3 zone that SMU attacked by passing the ball around a few times and crossing their fingers that Semi Ojeleye could bail them out. When Ojeleye could get a clean look, the strategy worked well enough. But when USC kept the ball out of Ojeleye’s hands — Ojeleye took his last shot attempt with 2:31 to play and didn’t even touch the ball in SMU’s final two possessions — it was a less-than-ideal strategy that let the Trojans back into the game and ultimately cost the Mustangs. On their final possession, SMU looked completely lost, with no sense of urgency, and had to settle for a contested drive capped off with a prayer that never had a chance."}, {"7b7c": "(Getty Images)"}, {"7f64": "4. The adversity just keeps coming for Duke."}, {"3f88": "It’s been a season of ups and downs and BACKs and NOT BACKs for the Blue Devils, who have had to endure injuries, suspensions, coaching changes, chemistry issues, the lack of a Plumlee on the roster, conspiracy theories, Luke Kennard’s jealousy of Grayson Allen’s bangs, and everything in between in their pursuit of the program’s sixth national championship. And now, perhaps the worst news of all: Duke will have to play a second-round game against a 10-loss SEC team that will have to travel 140 miles fewer than the Blue Devils do. I mean, can you even imagine? Everything stacked against Duke makes this feel like only one of their McDonald’s All-Americans playing well isn’t going to be enough. If the Blue Devils have any shot at overcoming such insurmountable odds to beat South Carolina, I truly think it’s going to take halfway decent games from their entire roster of All-Americans and/or first-round draft picks."}, {"2d37": "Michigan Is the Hottest Team in March MadnessAgainst Oklahoma State, the Wolverines couldn’t misstheringer.com"}, {"b327": "5. ‘The Price Is Right’ cannot be denied."}, {"22dd": "Like any sensible college basketball fan, I’ve been consuming the first two days of March Madness with a multiple-TV setup so I can pretend to be watching all the games at once as I’m actually just watching one game — simultaneously following three games would make my brain explode from sensory overload. Anyway, watching the games this way means inevitably forgetting to change the channel on a TV once a game is over, which explains how each of the last two days I’ve looked over from my main TV to see Drew Carey fending off old women who think they deserve a hug from him because it’s their 61st birthday and they flew in all the way from Rocky Mount, North Carolina. This bummed me out on Thursday because the idea of CBS prioritizing Plinko over March Madness just didn’t sit right with me. But after Friday, I’ve changed my stance. The Price Is Right unexpectedly popping up on my TV is an important reminder that, as I get sucked into the March Madness vortex by sitting on my ass for four straight days, there’s a world out there going on without me where folks spin wheels and yell out numbers in hopes of winning a blender and a bag of dog food."}, {"ecfa": "6. North Carolina and Kansas looked like no. 1 seeds."}, {"a6e6": "It wouldn’t be fair to say that Villanova and Gonzaga struggled in their first-round matchups against no. 16 seeds on Thursday, as both teams won by 20. But given that Villanova didn’t score in the first six minutes of its game against Mount St. Mary’s and that Gonzaga led by just four points over South Dakota State at halftime, you also wouldn’t say that both teams looked great either. №1 seeds are often in a no-win situation in these first-round games in that losing would obviously be historic and embarrassing, while winning by anything less than a billion is considered underwhelming. So in that regard, Gonzaga and Villanova were fine. But if there is such a thing as a statement win for a no. 1 over a no. 16, North Carolina and Kansas provided it on Friday. The Jayhawks were a little sluggish out of the gate before a 29–7 run to close the first half propelled them to a 100–62 win over UC-Davis. Meanwhile, North Carolina cruised pretty much from the opening tip to crush Texas Southern, 103–64."}, {"3e64": "Rhode Island Is the Cinderella You’ve Been Waiting ForIn their first tourney appearance since 1999, the Rams blow by Creightontheringer.com"}, {"5d6b": "7. Benchwarmers are players, too!"}, {"ba2a": "The routs from the Jayhawks and Tar Heels led to Carolina’s Kanler Coker and Kansas’s Tyler Self getting some playing time for their teams, which is something a proud former benchwarmer like myself always loves to see. The problem, though, is how these guys were treated by their teammates when they scored. Coker made a smooth reverse layup and Self hit a routine 3, both of which prompted the benches of their teams to lose their minds like they’d just seen the greatest magic trick of all time. Now, I know what you’re thinking: They’re just supporting a teammate in what will likely be the biggest moment of his career. But take it from someone who has been on the receiving end of this treatment: It’s bullying and it has to stop, you guys. I’m sick and tired of benchwarmers being treated like circus monkeys who get paraded out there for everyone to laugh at, like it’s some sort of a miracle that a guy who has been playing basketball his entire life can dribble and shoot without tripping over his own feet. It’s discriminatory, it’s flat-out wrong, and it disgusts me to my core. BALL IS LIFE FOR US TOO, GODDAMMIT. We just want to get buckets in peace. IS THAT TOO MUCH TO ASK???"}, {"fcd1": "8. TOM IZZO IS BACK!"}, {"f097": "Don’t look now, folks, but the calendar says March and that means one thing and one thing only: Tom Izzo is here to fuck shit up. Michigan State has been a disappointment all season, but none of that matters now because the NCAA tournament is here and everyone knows that Izzo never — and I mean NEVER — fails to deliver the goods when it matters most (excluding those times he does, of course). Miami found this out the hard way when the Hurricanes had the audacity to take an early lead on the Spartans and pretend that their night was going to end in anything other than crushing defeat. After enough time had passed for the trap to have properly been set, Izzo flipped his magic March switch and Michigan State beat the brakes off Miami en route to a final score of 78–58. Now Izzo, who is a wizard in quick-turnaround NCAA tournament games, gets a second-round matchup with Bill Self, who is whatever the opposite of a wizard is in quick-turnaround NCAA tournament games. Admit it, Kansas fans: You’re nervous."}, {"0014": "9. Gregg Marshall won the Indiana coaching sweepstakes battle, but Archie Miller just might win the war."}, {"b7f6": "Wichita State dominated Dayton on the boards to win the first-round matchup between the two coaches who keep popping up on everyone’s list of potential candidates to take over for Tom Crean at Indiana. The Shockers will now play Kentucky in the second round, which promises to be an amazing game with an even better postgame press conference in which John Calipari will perform his shtick and use the phrase “my guys” 30 times as he tells reporters he can’t believe the selection committee gave a no. 10 seed to a team as good as Wichita State. Heading into that Dayton–Wichita State game, I figured the Hoosiers should just give the job to whichever coach came out on top, but Arnold Rothstein’s quote in Boardwalk Empire quickly became relevant: “Flip a coin. When it’s in the air, you’ll know which side you’re hoping for.”"}, {"33a7": "Indiana’s Contribution to the NCAA Tournament Was Firing Tom CreanThe Hoosiers axed their embattled head coach in a move that showcases the bizarre state of the programtheringer.com"}, {"ca20": "Not long after the ball was tipped, I realized that, win or lose, I think I prefer Miller over Marshall for Indiana. I can’t put my finger on it, but Miller just feels like the better fit, maybe because Marshall looks too much like Crean or something. I don’t know. I just have a hunch that losing in the first round might actually be a good thing for Miller’s chances of ending up in Bloomington. We’ll see."}, {"01c5": "(Full disclosure: Miller was an assistant at Ohio State when I played for the Buckeyes, which would be a simple way of explaining why I like him so much. But he also made me play one-on-one full court for 30 straight minutes during a voluntary summer workout when I was hungover, so my memories of him aren’t as fond as you might think.)"}, {"2b87": "March Can Be a Monotonous Slog for Only So LongThe upsets have to be right around the corner, right?theringer.com"}, {"af0b": "10. We’ll have to wait for the MADNESS to truly start, and that’s OK."}, {"5391": "For the first time since the 2007 tournament, all teams seeded no. 1 through no. 4 survived the first round, leaving casual fans unhappy with the lack of upsets and buzzer-beaters. I’m a diehard fan of the sport and even I’m not going to pretend like these first two days were particularly exciting. There were good games, and three no. 11 seeds advancing is noteworthy, but the truth is that one of the tournament’s most exciting moments came when Jim Nantz, Grant Hill, and Bill Raftery’s microphones went out, forcing a deer-in-the-headlights Tracy Wolfson to momentarily do the play-by-play."}, {"8a8e": "But here’s another way to look at it: The lack of upsets means we’re setting up for one hell of a second round and beyond. And isn’t that what we all really want anyway? Upsets are great and all, but you’re lying to yourself if you say you want to see an Elite Eight with the likes of Florida Gulf Coast, Winthrop, or Iona (unless you’re a fan of one of those teams, of course). Most of us want to have our cake and eat it, too, but it’s impossible to get both the shocking moments of madness and also the matchups we’ve been looking forward to like Villanova-Duke in Madison Square Garden or Gonzaga-Arizona with a trip to the Final Four on the line. So yes, it sucks that Princeton’s shot didn’t go down against Notre Dame or that Jawun Evans’s buzzer-beater against Michigan affected only the spread and not the outcome of the game. But just because the first two days were underwhelming, it doesn’t mean that the March Madness gods no longer love us. We just have to be patient and keep the faith."}], "content": "NCAA Tournament Daily Recap Big Dance Breakdown, Day 2 The “trouble” ahead for Duke, Michigan State’s arrival, and why you should be excited for Round 2 The second day of the 2017 NCAA tournament is in the books and I gotta say: I’m not sure where the writers are taking this thing. I mean, I like some of the story lines they’ve come up with — at least seven teams could realistically win the West, Kentucky’s path to a title will be brutal yet entertaining as hell, and the defending champs are looming. But man, can we please just cut to the chase already? I’m all for character and story development, but I’m going to need some explosions/fight scenes/nudity (OK, maybe not nudity) and I’m going to need them STAT. Until then, here are the 10 things that stood out to me from Friday. 1. Michigan vs. Oklahoma State was everything I dreamed it would be. From the moment the bracket was first revealed, I circled Michigan and Oklahoma State as the one game I was most excited to watch in the first round. Both teams are among the best offenses in college basketball and are led by two of the best point guards in America in Derrick Walton Jr. and Jawun Evans, leading me to believe that this would be a high-scoring, back-and-forth affair that would come down to the wire. And I’ll be damned, that’s exactly what we got. Evans was unbelievable, finishing with 23 points, 12 assists, and seven rebounds. Yet he wasn’t even the player of the game thanks to Walton’s 26 points, 11 assists, and five rebounds while hitting 6 of 9 from the 3-point line. Oh, and speaking of hitting 3s, I should probably mention that the Wolverines went 16-for-29 from deep as a team, including an 11-for-16 second half that honestly felt more like they went 35-for-35. Michigan will have its hands full in the second round against a devastating Louisville defense, and it’s definitely worrisome that they won only by one despite missing, like, four shots the entire game. But if the Wolverines keep bombing 3s at the rate they did on Friday, there isn’t a team on earth that can stop them. 2. The ending to Arkansas vs. Seton Hall was bad, and I’m still not sure who I should blame. No matter how you feel about the flagrant-1 foul call on Seton Hall’s Desi Rodriguez with 17 seconds left and the Pirates down by one to the Razorbacks, you’re wrong. On the one hand, Rodriguez did shove Arkansas’s Jaylen Barford in the back with two hands with the sole purpose of stopping the clock. The rule book clearly states that pushing a player from behind, fouling to stop the clock without making a play on the ball, and/or using excessive or unnecessary force should be called a flagrant-1, regardless of the severity of the act. All of those criteria apply to this play, which is why I don’t think the official who made the call should be crucified for not “letting the players decide it.” Seton Hall Has Both Itself and the Refs to BlameTurnovers and a curious flagrant foul doomed the Pirates against Arkansastheringer.com Then again, this is the type of play that happens all the time at the ends of games and goes uncalled, so I’m not sure it’s fair to blame Rodriguez for not making a play on the ball either. Also, so much of what made the play look bad was Barford being inadvertently tripped by Rodriguez, leading many to wonder if the play would still have been considered a flagrant foul had Barford remained upright. I’m not sure what the right answer is. I just know that we were robbed of what may have been an all-time March Madness moment had the referees not assessed the play the way they did, and that truly sucks. I also know that, along with yesterday’s fouling mistake at the end of the Northwestern-Vanderbilt game, this means the two biggest moments of the 2017 NCAA tournament have been fouls. THE MADNESS IS ALMOST TOO MUCH TO HANDLE. 3. SMU’s decision to hire Tom Crean as a zone offense consultant proved to be terrible. It apparently didn’t take Crean long to land on his feet after Indiana fired him on Thursday, seeing as how I’m pretty sure SMU coach and Indiana native Tim Jankovich turned to Crean for advice and implemented the exact same zone offense against USC that Crean used against Syracuse in the 2013 Sweet 16. SMU built a 12-point lead over USC with about 7:30 left in the first half, prompting the Trojans to switch to a 2–3 zone that SMU attacked by passing the ball around a few times and crossing their fingers that Semi Ojeleye could bail them out. When Ojeleye could get a clean look, the strategy worked well enough. But when USC kept the ball out of Ojeleye’s hands — Ojeleye took his last shot attempt with 2:31 to play and didn’t even touch the ball in SMU’s final two possessions — it was a less-than-ideal strategy that let the Trojans back into the game and ultimately cost the Mustangs. On their final possession, SMU looked completely lost, with no sense of urgency, and had to settle for a contested drive capped off with a prayer that never had a chance. (Getty Images) 4. The adversity just keeps coming for Duke. It’s been a season of ups and downs and BACKs and NOT BACKs for the Blue Devils, who have had to endure injuries, suspensions, coaching changes, chemistry issues, the lack of a Plumlee on the roster, conspiracy theories, Luke Kennard’s jealousy of Grayson Allen’s bangs, and everything in between in their pursuit of the program’s sixth national championship. And now, perhaps the worst news of all: Duke will have to play a second-round game against a 10-loss SEC team that will have to travel 140 miles fewer than the Blue Devils do. I mean, can you even imagine? Everything stacked against Duke makes this feel like only one of their McDonald’s All-Americans playing well isn’t going to be enough. If the Blue Devils have any shot at overcoming such insurmountable odds to beat South Carolina, I truly think it’s going to take halfway decent games from their entire roster of All-Americans and/or first-round draft picks. Michigan Is the Hottest Team in March MadnessAgainst Oklahoma State, the Wolverines couldn’t misstheringer.com 5. ‘The Price Is Right’ cannot be denied. Like any sensible college basketball fan, I’ve been consuming the first two days of March Madness with a multiple-TV setup so I can pretend to be watching all the games at once as I’m actually just watching one game — simultaneously following three games would make my brain explode from sensory overload. Anyway, watching the games this way means inevitably forgetting to change the channel on a TV once a game is over, which explains how each of the last two days I’ve looked over from my main TV to see Drew Carey fending off old women who think they deserve a hug from him because it’s their 61st birthday and they flew in all the way from Rocky Mount, North Carolina. This bummed me out on Thursday because the idea of CBS prioritizing Plinko over March Madness just didn’t sit right with me. But after Friday, I’ve changed my stance. The Price Is Right unexpectedly popping up on my TV is an important reminder that, as I get sucked into the March Madness vortex by sitting on my ass for four straight days, there’s a world out there going on without me where folks spin wheels and yell out numbers in hopes of winning a blender and a bag of dog food. 6. North Carolina and Kansas looked like no. 1 seeds. It wouldn’t be fair to say that Villanova and Gonzaga struggled in their first-round matchups against no. 16 seeds on Thursday, as both teams won by 20. But given that Villanova didn’t score in the first six minutes of its game against Mount St. Mary’s and that Gonzaga led by just four points over South Dakota State at halftime, you also wouldn’t say that both teams looked great either. №1 seeds are often in a no-win situation in these first-round games in that losing would obviously be historic and embarrassing, while winning by anything less than a billion is considered underwhelming. So in that regard, Gonzaga and Villanova were fine. But if there is such a thing as a statement win for a no. 1 over a no. 16, North Carolina and Kansas provided it on Friday. The Jayhawks were a little sluggish out of the gate before a 29–7 run to close the first half propelled them to a 100–62 win over UC-Davis. Meanwhile, North Carolina cruised pretty much from the opening tip to crush Texas Southern, 103–64. Rhode Island Is the Cinderella You’ve Been Waiting ForIn their first tourney appearance since 1999, the Rams blow by Creightontheringer.com 7. Benchwarmers are players, too! The routs from the Jayhawks and Tar Heels led to Carolina’s Kanler Coker and Kansas’s Tyler Self getting some playing time for their teams, which is something a proud former benchwarmer like myself always loves to see. The problem, though, is how these guys were treated by their teammates when they scored. Coker made a smooth reverse layup and Self hit a routine 3, both of which prompted the benches of their teams to lose their minds like they’d just seen the greatest magic trick of all time. Now, I know what you’re thinking: They’re just supporting a teammate in what will likely be the biggest moment of his career. But take it from someone who has been on the receiving end of this treatment: It’s bullying and it has to stop, you guys. I’m sick and tired of benchwarmers being treated like circus monkeys who get paraded out there for everyone to laugh at, like it’s some sort of a miracle that a guy who has been playing basketball his entire life can dribble and shoot without tripping over his own feet. It’s discriminatory, it’s flat-out wrong, and it disgusts me to my core. BALL IS LIFE FOR US TOO, GODDAMMIT. We just want to get buckets in peace. IS THAT TOO MUCH TO ASK??? 8. TOM IZZO IS BACK! Don’t look now, folks, but the calendar says March and that means one thing and one thing only: Tom Izzo is here to fuck shit up. Michigan State has been a disappointment all season, but none of that matters now because the NCAA tournament is here and everyone knows that Izzo never — and I mean NEVER — fails to deliver the goods when it matters most (excluding those times he does, of course). Miami found this out the hard way when the Hurricanes had the audacity to take an early lead on the Spartans and pretend that their night was going to end in anything other than crushing defeat. After enough time had passed for the trap to have properly been set, Izzo flipped his magic March switch and Michigan State beat the brakes off Miami en route to a final score of 78–58. Now Izzo, who is a wizard in quick-turnaround NCAA tournament games, gets a second-round matchup with Bill Self, who is whatever the opposite of a wizard is in quick-turnaround NCAA tournament games. Admit it, Kansas fans: You’re nervous. 9. Gregg Marshall won the Indiana coaching sweepstakes battle, but Archie Miller just might win the war. Wichita State dominated Dayton on the boards to win the first-round matchup between the two coaches who keep popping up on everyone’s list of potential candidates to take over for Tom Crean at Indiana. The Shockers will now play Kentucky in the second round, which promises to be an amazing game with an even better postgame press conference in which John Calipari will perform his shtick and use the phrase “my guys” 30 times as he tells reporters he can’t believe the selection committee gave a no. 10 seed to a team as good as Wichita State. Heading into that Dayton–Wichita State game, I figured the Hoosiers should just give the job to whichever coach came out on top, but Arnold Rothstein’s quote in Boardwalk Empire quickly became relevant: “Flip a coin. When it’s in the air, you’ll know which side you’re hoping for.” Indiana’s Contribution to the NCAA Tournament Was Firing Tom CreanThe Hoosiers axed their embattled head coach in a move that showcases the bizarre state of the programtheringer.com Not long after the ball was tipped, I realized that, win or lose, I think I prefer Miller over Marshall for Indiana. I can’t put my finger on it, but Miller just feels like the better fit, maybe because Marshall looks too much like Crean or something. I don’t know. I just have a hunch that losing in the first round might actually be a good thing for Miller’s chances of ending up in Bloomington. We’ll see. (Full disclosure: Miller was an assistant at Ohio State when I played for the Buckeyes, which would be a simple way of explaining why I like him so much. But he also made me play one-on-one full court for 30 straight minutes during a voluntary summer workout when I was hungover, so my memories of him aren’t as fond as you might think.) March Can Be a Monotonous Slog for Only So LongThe upsets have to be right around the corner, right?theringer.com 10. We’ll have to wait for the MADNESS to truly start, and that’s OK. For the first time since the 2007 tournament, all teams seeded no. 1 through no. 4 survived the first round, leaving casual fans unhappy with the lack of upsets and buzzer-beaters. I’m a diehard fan of the sport and even I’m not going to pretend like these first two days were particularly exciting. There were good games, and three no. 11 seeds advancing is noteworthy, but the truth is that one of the tournament’s most exciting moments came when Jim Nantz, Grant Hill, and Bill Raftery’s microphones went out, forcing a deer-in-the-headlights Tracy Wolfson to momentarily do the play-by-play. But here’s another way to look at it: The lack of upsets means we’re setting up for one hell of a second round and beyond. And isn’t that what we all really want anyway? Upsets are great and all, but you’re lying to yourself if you say you want to see an Elite Eight with the likes of Florida Gulf Coast, Winthrop, or Iona (unless you’re a fan of one of those teams, of course). Most of us want to have our cake and eat it, too, but it’s impossible to get both the shocking moments of madness and also the matchups we’ve been looking forward to like Villanova-Duke in Madison Square Garden or Gonzaga-Arizona with a trip to the Final Four on the line. So yes, it sucks that Princeton’s shot didn’t go down against Notre Dame or that Jawun Evans’s buzzer-beater against Michigan affected only the spread and not the outcome of the game. But just because the first two days were underwhelming, it doesn’t mean that the March Madness gods no longer love us. We just have to be patient and keep the faith. ", "child": "1986_1\t1986_2\t1986_3\t1986_4\t1986_5\t1986_6\t1986_7\t1986_8\t1986_9"}