{"name": "1987", "parent": "", "title": "Down! Goes! UConn!", "sentences": [{"9fd2": "Down! Goes! UConn!"}, {"fb79": "Mississippi State just pulled off an all-time great upset, beating UConn in the Final Four and ending the Huskies’ win streak at an astonishing 111 games"}, {"0d43": "The last college basketball game of March 2017 was the month’s best. For the first time since November 2014, after 111 consecutive wins that marked them as the greatest streaking team in college basketball history, the University of Connecticut women’s basketball team finally lost. Down goes Geno; long live the king."}, {"312c": "Mississippi State junior Morgan William splashed a midrange jumper as the buzzer sounded in overtime Friday night, giving the Bulldogs a 66–64 win and providing a fitting finish to the most thrilling game of the season. The no. 2 seed will play 1-seed South Carolina for the championship on Sunday night, when, for the first time since 2012, UConn won’t be crowned."}, {"3ff4": "The game itself was 45 minutes of disjointed play — of inefficient shooting, slapdash offensive sets, and, in true March fashion, a last-minute officiating controversy that took far too long to disentangle at the replay monitor. (Had Mississippi State lost after finding itself on the wrong end of a questionable flagrant foul call, the conspiracy theories never would have ended.) But the Bulldogs were unshaken, just as the Bulldogs were unshaken despite UConn outshooting them from the field, out-blocking them, and making more 3-pointers and free throws. They stuck to their press, forcing 17 Husky turnovers, and crashed the boards, grabbing 15 offensive rebounds that kept their point total afloat."}, {"5765": "Add in a few doses of late-game magic from William and Victoria Vivians, who sank a fadeaway 3-pointer late in regulation, and that’s how, a year after losing to UConn by 60 points in the Sweet 16, Mississippi State pulled off an all-timer of an upset. This time around, the Huskies scored only 60 points in regulation."}, {"9cb1": "Depth proved problematic for UConn, just as it had when the team struggled (relative to the program’s recent standards) earlier this season — the Huskies won three games by single digits this year after enjoying double-digit wins throughout the rest of the streak. UConn’s bench players combined for a single point with four turnovers on Friday, while bigs Napheesa Collier and Gabby Williams tallied four fouls each and struggled at times to contend with the Bulldogs’ size in the paint. Remarkably, for the sixth consecutive time, Geno Auriemma’s team lost an overtime game."}, {"2d65": "The Huskies weren’t outmatched, though, and spent the evening trading blows with the Bulldogs, most visibly when they followed a 14–0 Mississippi State run in the first half with a 12–0 streak of their own. A necessary component of any sports classic is that both teams must share in the heroics, and UConn played its part in turning a national semifinal into something even greater. Katie Lou Samuelson hit three 3-pointers and scored 15, while Williams tallied a game-high 21 points and added four blocks, including one of a potential William game-winner in the final seconds of regulation. A few minutes later, though, she reached up for a fifth block to find only air, as William’s last shot arced over Williams’s hand en route to the rim, and glory."}, {"6284": "“I’m still in shock right now,” William said in her postgame on-court interview. She and the rest of the college-basketball-watching world; about 40 minutes before the calendar flipped to April, the queens of March were dethroned."}], "content": "Down! Goes! UConn! Mississippi State just pulled off an all-time great upset, beating UConn in the Final Four and ending the Huskies’ win streak at an astonishing 111 games The last college basketball game of March 2017 was the month’s best. For the first time since November 2014, after 111 consecutive wins that marked them as the greatest streaking team in college basketball history, the University of Connecticut women’s basketball team finally lost. Down goes Geno; long live the king. Mississippi State junior Morgan William splashed a midrange jumper as the buzzer sounded in overtime Friday night, giving the Bulldogs a 66–64 win and providing a fitting finish to the most thrilling game of the season. The no. 2 seed will play 1-seed South Carolina for the championship on Sunday night, when, for the first time since 2012, UConn won’t be crowned. The game itself was 45 minutes of disjointed play — of inefficient shooting, slapdash offensive sets, and, in true March fashion, a last-minute officiating controversy that took far too long to disentangle at the replay monitor. (Had Mississippi State lost after finding itself on the wrong end of a questionable flagrant foul call, the conspiracy theories never would have ended.) But the Bulldogs were unshaken, just as the Bulldogs were unshaken despite UConn outshooting them from the field, out-blocking them, and making more 3-pointers and free throws. They stuck to their press, forcing 17 Husky turnovers, and crashed the boards, grabbing 15 offensive rebounds that kept their point total afloat. Add in a few doses of late-game magic from William and Victoria Vivians, who sank a fadeaway 3-pointer late in regulation, and that’s how, a year after losing to UConn by 60 points in the Sweet 16, Mississippi State pulled off an all-timer of an upset. This time around, the Huskies scored only 60 points in regulation. Depth proved problematic for UConn, just as it had when the team struggled (relative to the program’s recent standards) earlier this season — the Huskies won three games by single digits this year after enjoying double-digit wins throughout the rest of the streak. UConn’s bench players combined for a single point with four turnovers on Friday, while bigs Napheesa Collier and Gabby Williams tallied four fouls each and struggled at times to contend with the Bulldogs’ size in the paint. Remarkably, for the sixth consecutive time, Geno Auriemma’s team lost an overtime game. The Huskies weren’t outmatched, though, and spent the evening trading blows with the Bulldogs, most visibly when they followed a 14–0 Mississippi State run in the first half with a 12–0 streak of their own. A necessary component of any sports classic is that both teams must share in the heroics, and UConn played its part in turning a national semifinal into something even greater. Katie Lou Samuelson hit three 3-pointers and scored 15, while Williams tallied a game-high 21 points and added four blocks, including one of a potential William game-winner in the final seconds of regulation. A few minutes later, though, she reached up for a fifth block to find only air, as William’s last shot arced over Williams’s hand en route to the rim, and glory. “I’m still in shock right now,” William said in her postgame on-court interview. She and the rest of the college-basketball-watching world; about 40 minutes before the calendar flipped to April, the queens of March were dethroned. ", "child": "1987_1\t1987_2\t1987_3\t1987_4"}