{"name": "1996", "parent": "", "title": "Wisconsin Has the Tools for a Deep Run", "sentences": [{"3d1f": "Wisconsin Has the Tools for a Deep Run"}, {"7cff": "The Badgers’ upset over Villanova was fueled by mismatches that can continue to serve them well"}, {"b19d": "After an underwhelming first two days of the NCAA tournament, March Madness has finally begun. Defending national champion Villanova was knocked off by Wisconsin in a 65–62 classic that went down to the final possession. Before the game, Villanova coach Jay Wright said he was surprised that Wisconsin was an 8-seed, and the Badgers made his comments seem prophetic on Saturday. They are one of the most experienced teams in the country, and their seniors have played in two Final Fours and made four consecutive Sweet 16s. You can throw out their regular-season record and their tournament seed: Wisconsin is a team with all the pieces to make yet another deep run."}, {"85fb": "The most impressive part about Wisconsin’s win was its ability pull it out despite having two of its best players in foul trouble for much of the game. Sophomore big man Ethan Happ picked up two fouls in the first half, while senior point guard Bronson Koenig got his fourth foul with 13:40 to go in the second. Wisconsin was playing with its hands tied behind their back, and it still managed to knock off the tournament’s no. 1 overall seed. Villanova’s history of being upset early under Jay Wright will be talked about a lot over the next week, but this win was more about what Wisconsin did right."}, {"651f": "The Unclassifiable Big Man Who Could Disrupt the TourneyWisconsin’s Ethan Happ is a flexible beasttheringer.com"}, {"a24d": "The biggest problem for Villanova is it didn’t have two frontcourt players who could guard Happ and senior Nigel Hayes. Not many teams do. Happ, at 6-foot-9 and 230 pounds, is a Swiss army knife who averages 13.8 points, 9.1 rebounds, 2.8 assists, 1.8 steals, and 1.2 blocks a game on 58.3 percent shooting. Hayes, a 6-foot-8, 240-pound senior who seems as if he has been playing at Wisconsin for a decade, is a mismatch nightmare who can take bigger defenders off the dribble and smaller players in the block. They combined for 31 points, 16 rebounds, four assists, and three blocks on 13-of-21 shooting. There was nothing Villanova could do to stop them but send help."}, {"6274": "Villanova normally plays four perimeter players around one big man, knowing that few college power forwards can score over the top of its two NBA-caliber wings, Josh Hart and Mikal Bridges. Wright kept centers Darryl Reynolds and Eric Paschall on Happ, forcing Hart on Hayes, who dribbled into his chest and got to the rim at will. With the game tied at 62 with 11 seconds left, Hayes made Bridges look foolish, faking him out to the middle and then turning baseline for an easy reverse off the glass."}, {"76e7": "The normal plan of attack to slow down talented big men is to prevent them from getting the ball by pressuring their guards in order to force turnovers and get the game going up and down, which Villanova tried throughout. The problem with doing that against Wisconsin is it starts two senior combo guards, Koenig and Zak Showalter, who are normally sure-handed enough to keep the action in the half court. The Badgers completely controlled the tempo of the game, methodically swinging the ball around the perimeter before entering it into the post. Villanova had the better athletes and the more talented players in the backcourt, but it didn’t matter because Wisconsin’s senior guards dictated the pace."}, {"a533": "Everything fits together for Greg Gard’s team. Vitto Brown, the Badgers’ fifth starter, is a 6-foot-8, 237-pound forward who can swing between multiple positions on defense and stretch the floor from the 3-point line. When Villanova doubled the post, Brown killed them from beyond the arc, scoring 10 points on 3-of-6 shooting from deep. When Happ or Hayes needs a rest, Brown can slide to power forward, opening a spot in the lineup for one of Wisconsin’s two reserve guards, sophomore Khalil Iverson and freshman D’Mitrik Trice. Gard has a tight seven-man rotation in which every player has a defined role. While Wisconsin may not have any sure-fire NBA talent, it’s a well-coached team with several great college players and a ton of experience."}, {"3ad4": "Chasing The Shot: Villanova Basketball One Year LaterHow will Kris Jenkins and Villanova try to top last year’s buzzer-beating NCAA title run? By forgetting it ever…theringer.com"}, {"484d": "Wisconsin has the 53rd-rated offense and the 22nd-rated defense — it doesn’t have to be content with just making it to the Sweet 16. Now that the Badgers have knocked off Villanova, there’s no reason to think they can’t beat either Virginia or Florida, the 4- and 5-seeds in the East, in the next round. No matter who they play, they will have the advantage upfront and the personnel to exploit the mismatch. Now the Goliath looming in this region is Duke, the 2-seed, and the dynamic in that game would be similar to what happened on Saturday, with either Jayson Tatum being forced to guard a bigger player in the post or the Blue Devils having to junk their normal lineups in order to play two big men at the same time."}, {"c3fc": "For as great as the game on Saturday was, it was a letdown that it happened in the second round. Wisconsin and Villanova was a battle between two excellent college teams, and there would have been no shame for the Wildcats if they had bowed in the Sweet 16 or the Elite 8. Instead, the favorite was forced to fight for their lives against an underseeded team who can beat anyone in a one-game scenario. (Kentucky might find itself in a similar scenario against 10-seed Wichita State on Sunday.) Over the last four years, whether under Gard or Bo Ryan, the Badgers have been one of the most consistent programs in the country, and its beaten a number of great teams in the tournament. Villanova might not be the last scalp they collect."}], "content": "Wisconsin Has the Tools for a Deep Run The Badgers’ upset over Villanova was fueled by mismatches that can continue to serve them well After an underwhelming first two days of the NCAA tournament, March Madness has finally begun. Defending national champion Villanova was knocked off by Wisconsin in a 65–62 classic that went down to the final possession. Before the game, Villanova coach Jay Wright said he was surprised that Wisconsin was an 8-seed, and the Badgers made his comments seem prophetic on Saturday. They are one of the most experienced teams in the country, and their seniors have played in two Final Fours and made four consecutive Sweet 16s. You can throw out their regular-season record and their tournament seed: Wisconsin is a team with all the pieces to make yet another deep run. The most impressive part about Wisconsin’s win was its ability pull it out despite having two of its best players in foul trouble for much of the game. Sophomore big man Ethan Happ picked up two fouls in the first half, while senior point guard Bronson Koenig got his fourth foul with 13:40 to go in the second. Wisconsin was playing with its hands tied behind their back, and it still managed to knock off the tournament’s no. 1 overall seed. Villanova’s history of being upset early under Jay Wright will be talked about a lot over the next week, but this win was more about what Wisconsin did right. The Unclassifiable Big Man Who Could Disrupt the TourneyWisconsin’s Ethan Happ is a flexible beasttheringer.com The biggest problem for Villanova is it didn’t have two frontcourt players who could guard Happ and senior Nigel Hayes. Not many teams do. Happ, at 6-foot-9 and 230 pounds, is a Swiss army knife who averages 13.8 points, 9.1 rebounds, 2.8 assists, 1.8 steals, and 1.2 blocks a game on 58.3 percent shooting. Hayes, a 6-foot-8, 240-pound senior who seems as if he has been playing at Wisconsin for a decade, is a mismatch nightmare who can take bigger defenders off the dribble and smaller players in the block. They combined for 31 points, 16 rebounds, four assists, and three blocks on 13-of-21 shooting. There was nothing Villanova could do to stop them but send help. Villanova normally plays four perimeter players around one big man, knowing that few college power forwards can score over the top of its two NBA-caliber wings, Josh Hart and Mikal Bridges. Wright kept centers Darryl Reynolds and Eric Paschall on Happ, forcing Hart on Hayes, who dribbled into his chest and got to the rim at will. With the game tied at 62 with 11 seconds left, Hayes made Bridges look foolish, faking him out to the middle and then turning baseline for an easy reverse off the glass. The normal plan of attack to slow down talented big men is to prevent them from getting the ball by pressuring their guards in order to force turnovers and get the game going up and down, which Villanova tried throughout. The problem with doing that against Wisconsin is it starts two senior combo guards, Koenig and Zak Showalter, who are normally sure-handed enough to keep the action in the half court. The Badgers completely controlled the tempo of the game, methodically swinging the ball around the perimeter before entering it into the post. Villanova had the better athletes and the more talented players in the backcourt, but it didn’t matter because Wisconsin’s senior guards dictated the pace. Everything fits together for Greg Gard’s team. Vitto Brown, the Badgers’ fifth starter, is a 6-foot-8, 237-pound forward who can swing between multiple positions on defense and stretch the floor from the 3-point line. When Villanova doubled the post, Brown killed them from beyond the arc, scoring 10 points on 3-of-6 shooting from deep. When Happ or Hayes needs a rest, Brown can slide to power forward, opening a spot in the lineup for one of Wisconsin’s two reserve guards, sophomore Khalil Iverson and freshman D’Mitrik Trice. Gard has a tight seven-man rotation in which every player has a defined role. While Wisconsin may not have any sure-fire NBA talent, it’s a well-coached team with several great college players and a ton of experience. Chasing The Shot: Villanova Basketball One Year LaterHow will Kris Jenkins and Villanova try to top last year’s buzzer-beating NCAA title run? By forgetting it ever…theringer.com Wisconsin has the 53rd-rated offense and the 22nd-rated defense — it doesn’t have to be content with just making it to the Sweet 16. Now that the Badgers have knocked off Villanova, there’s no reason to think they can’t beat either Virginia or Florida, the 4- and 5-seeds in the East, in the next round. No matter who they play, they will have the advantage upfront and the personnel to exploit the mismatch. Now the Goliath looming in this region is Duke, the 2-seed, and the dynamic in that game would be similar to what happened on Saturday, with either Jayson Tatum being forced to guard a bigger player in the post or the Blue Devils having to junk their normal lineups in order to play two big men at the same time. For as great as the game on Saturday was, it was a letdown that it happened in the second round. Wisconsin and Villanova was a battle between two excellent college teams, and there would have been no shame for the Wildcats if they had bowed in the Sweet 16 or the Elite 8. Instead, the favorite was forced to fight for their lives against an underseeded team who can beat anyone in a one-game scenario. (Kentucky might find itself in a similar scenario against 10-seed Wichita State on Sunday.) Over the last four years, whether under Gard or Bo Ryan, the Badgers have been one of the most consistent programs in the country, and its beaten a number of great teams in the tournament. Villanova might not be the last scalp they collect. ", "child": "1996_1\t1996_2"}