{"name": "1997", "parent": "", "title": "A Badger of Many Stripes", "sentences": [{"e0af": "A Badger of Many Stripes"}, {"9046": "Wisconsin sophomore Ethan Happ defies categorization. That unpredictability has made him a player of the year candidate — and it could make underseeded Wisconsin a team to watch in March."}, {"5b33": "Remember that terribly confusing moment in college when you reached for your roommate’s CamelBak hoping for a swig of water, but wound up getting leftover (insert clear liquor of choice) from the previous evening instead? That’s what it’s like to guard Ethan Happ, the Wisconsin sophomore who’s induced spit-take after spit-take by defying expectations and classification all season long."}, {"99eb": "The 25–9 Badgers’ low NCAA tournament seed (no. 8 in the East region) has been one of the sport’s main story lines since Selection Sunday, but Greg Gard’s team has a chance to outperform its draw thanks largely to its unconventional player of the year candidate. The 6-foot-10 Happ was the only player to lead his team in points (13.9), rebounds (nine), steals (two), and assists (2.9) per game throughout the regular season, only ceding his points lead when Wisconsin senior guard Bronson Koenig (14.1) moved ahead of him during the Big Ten Tournament. With the ball-handling ability and court vision of a guard and the fundamentally brilliant footwork of an “old-man” post player, Happ is one of the most amorphous players in this year’s field — and thus potentially one of the most impactful."}, {"83f3": "Exhibit A:"}, {"86de": "More often than not, when a big man ventures that far outside the lane, he’s trying to get rid of the rock as quickly as it came to him, maybe even without glancing at the hoop. That’s probably what Northwestern’s Dererk Pardon expected from Happ, but he learned that the versatile big can burn an opponent like that day-old tequila."}, {"68ba": "March Madness Breakdown: Reasons for Hope, Excitement, and Anger in the 2017 BracketAssessing the road to the Final Four, region by regiontheringer.com"}, {"b9ae": "That’s just one of the myriad moves that someone Happ’s size shouldn’t be able to make. Of course, most guys Happ’s size weren’t initially trained to be point guards. Between eighth and 10th grade in Milan, Illinois, Happ grew from 5-foot-9 to 6-foot-6, a spurt that forced him to move from the perimeter to under the basket. His handles survived the transition, though, and he’s used them to torment Big Ten opponents ever since."}, {"037e": "“It used to surprise me,” former Badger Josh Gasser, who overlapped with Happ during the center’s redshirt freshman season in 2014–15, tells me when discussing their former practice sessions. “He’d get the rebound and just take off. That’s rare. You don’t see it very often. And then at half court, he’d go behind the back, make his move and finish it. It was like, ‘Wow. I was not expecting that at all.’”"}, {"5c97": "Neither was this poor soul:"}, {"1d26": "In February, Big Ten Network analyst Jon Crispin crowned Happ “Mr. Intangible,” labeling him “the best back-to-the-basket post player” he’d seen in years and adding that Happ “does a little bit of everything.”"}, {"546a": "“Everything” includes dishing shiny dimes: Happ has tallied 96 total assists this season, and of the 52 players who average at least 2.8 assists and 1.8 steals per game, he’s the only forward."}, {"0ec1": "Wisconsin turns defense into two electric offensive plays - ESPN VideoEthan Happ gets the steal and goes behind-the-back to set up D'Mitrik Trice's layup, and then Brevin Pritzl gets a…www.espn.com"}, {"b880": "Thanks to his uncommon blend of skills, Happ earned All–Big Ten first-team honors this season, joining Michael Finley as just the second sophomore in Wisconsin history to do so. Happ also garnered all-conference defensive team honors and made the final cut for the Naismith and Wooden player of the year awards."}, {"a89e": "Seemingly the only distinction not bestowed on Happ is … an actual positional distinction. With a frame (and, unfortunately, a jump shot) like Joakim Noah, passing instincts as strong as his point guard teammates, and a post presence like Wisconsin predecessor and mentor Frank Kaminsky, Happ simultaneously fits the mold for all positions and none."}, {"8942": "“I would just consider him a basketball player,” Gasser says. “Not many players can do the stuff that he can do in terms of finishing with his right hand, his left hand, underneath the rim.” Not many can bob, weave, or do this, much less do it all with a high center of gravity."}, {"f545": "March means madness, and atypical players like Happ thrive on being, and doing, the unexpected. Scouting him won’t give the opponent a complete picture. “I don’t even think people have seen some of the stuff he can do,” Gasser says. “Which is crazy because he’s been doing a lot of good things.”"}, {"0436": "In an effort to minimize those good things, Northwestern committed fully to double-teaming Happ during their mid-February meeting. The technique proved effective, as the Wildcats swarmed Happ, pinning him to the baseline and holding him to just nine points in a 66–59 loss that snapped the Badgers’ eight-game win streak."}, {"25d2": "“You can see how important he is when he gets taken away,” Crispin said during that February broadcast. “You start to double-team him, and Wisconsin is just not as effective.”"}, {"2b0c": "Subsequent opponents tried to replicate Northwestern’s success, but Happ adjusted as well, reinforcing that part of what makes unclassifiable players so valuable is the bountiful options they have on each play. His scoring has dipped from 14.5 per game before the Northwestern meeting to 13.1 in games since, but his assists have risen from 2.7 to 2.9. “He’s got a counter to every countermove, so he’s got a lot in his arsenal that makes him hard for defenders to stop,” Gasser says."}, {"6439": "With only a handful of potential opponents remaining, beginning with no. 9 seed Virginia Tech on Thursday night in Buffalo, there aren’t too many more opportunities to even try to stop him. If Wisconsin advances, each matchup will be more difficult than the previous, meaning Happ will have to transform to meet the challenge of the moment. But he’s shapeshifted masterfully to this point, so as long as the Badgers last, kick back with your water bottle and enjoy."}], "content": "A Badger of Many Stripes Wisconsin sophomore Ethan Happ defies categorization. That unpredictability has made him a player of the year candidate — and it could make underseeded Wisconsin a team to watch in March. Remember that terribly confusing moment in college when you reached for your roommate’s CamelBak hoping for a swig of water, but wound up getting leftover (insert clear liquor of choice) from the previous evening instead? That’s what it’s like to guard Ethan Happ, the Wisconsin sophomore who’s induced spit-take after spit-take by defying expectations and classification all season long. The 25–9 Badgers’ low NCAA tournament seed (no. 8 in the East region) has been one of the sport’s main story lines since Selection Sunday, but Greg Gard’s team has a chance to outperform its draw thanks largely to its unconventional player of the year candidate. The 6-foot-10 Happ was the only player to lead his team in points (13.9), rebounds (nine), steals (two), and assists (2.9) per game throughout the regular season, only ceding his points lead when Wisconsin senior guard Bronson Koenig (14.1) moved ahead of him during the Big Ten Tournament. With the ball-handling ability and court vision of a guard and the fundamentally brilliant footwork of an “old-man” post player, Happ is one of the most amorphous players in this year’s field — and thus potentially one of the most impactful. Exhibit A: More often than not, when a big man ventures that far outside the lane, he’s trying to get rid of the rock as quickly as it came to him, maybe even without glancing at the hoop. That’s probably what Northwestern’s Dererk Pardon expected from Happ, but he learned that the versatile big can burn an opponent like that day-old tequila. March Madness Breakdown: Reasons for Hope, Excitement, and Anger in the 2017 BracketAssessing the road to the Final Four, region by regiontheringer.com That’s just one of the myriad moves that someone Happ’s size shouldn’t be able to make. Of course, most guys Happ’s size weren’t initially trained to be point guards. Between eighth and 10th grade in Milan, Illinois, Happ grew from 5-foot-9 to 6-foot-6, a spurt that forced him to move from the perimeter to under the basket. His handles survived the transition, though, and he’s used them to torment Big Ten opponents ever since. “It used to surprise me,” former Badger Josh Gasser, who overlapped with Happ during the center’s redshirt freshman season in 2014–15, tells me when discussing their former practice sessions. “He’d get the rebound and just take off. That’s rare. You don’t see it very often. And then at half court, he’d go behind the back, make his move and finish it. It was like, ‘Wow. I was not expecting that at all.’” Neither was this poor soul: In February, Big Ten Network analyst Jon Crispin crowned Happ “Mr. Intangible,” labeling him “the best back-to-the-basket post player” he’d seen in years and adding that Happ “does a little bit of everything.” “Everything” includes dishing shiny dimes: Happ has tallied 96 total assists this season, and of the 52 players who average at least 2.8 assists and 1.8 steals per game, he’s the only forward. Wisconsin turns defense into two electric offensive plays - ESPN VideoEthan Happ gets the steal and goes behind-the-back to set up D'Mitrik Trice's layup, and then Brevin Pritzl gets a…www.espn.com Thanks to his uncommon blend of skills, Happ earned All–Big Ten first-team honors this season, joining Michael Finley as just the second sophomore in Wisconsin history to do so. Happ also garnered all-conference defensive team honors and made the final cut for the Naismith and Wooden player of the year awards. Seemingly the only distinction not bestowed on Happ is … an actual positional distinction. With a frame (and, unfortunately, a jump shot) like Joakim Noah, passing instincts as strong as his point guard teammates, and a post presence like Wisconsin predecessor and mentor Frank Kaminsky, Happ simultaneously fits the mold for all positions and none. “I would just consider him a basketball player,” Gasser says. “Not many players can do the stuff that he can do in terms of finishing with his right hand, his left hand, underneath the rim.” Not many can bob, weave, or do this, much less do it all with a high center of gravity. March means madness, and atypical players like Happ thrive on being, and doing, the unexpected. Scouting him won’t give the opponent a complete picture. “I don’t even think people have seen some of the stuff he can do,” Gasser says. “Which is crazy because he’s been doing a lot of good things.” In an effort to minimize those good things, Northwestern committed fully to double-teaming Happ during their mid-February meeting. The technique proved effective, as the Wildcats swarmed Happ, pinning him to the baseline and holding him to just nine points in a 66–59 loss that snapped the Badgers’ eight-game win streak. “You can see how important he is when he gets taken away,” Crispin said during that February broadcast. “You start to double-team him, and Wisconsin is just not as effective.” Subsequent opponents tried to replicate Northwestern’s success, but Happ adjusted as well, reinforcing that part of what makes unclassifiable players so valuable is the bountiful options they have on each play. His scoring has dipped from 14.5 per game before the Northwestern meeting to 13.1 in games since, but his assists have risen from 2.7 to 2.9. “He’s got a counter to every countermove, so he’s got a lot in his arsenal that makes him hard for defenders to stop,” Gasser says. With only a handful of potential opponents remaining, beginning with no. 9 seed Virginia Tech on Thursday night in Buffalo, there aren’t too many more opportunities to even try to stop him. If Wisconsin advances, each matchup will be more difficult than the previous, meaning Happ will have to transform to meet the challenge of the moment. But he’s shapeshifted masterfully to this point, so as long as the Badgers last, kick back with your water bottle and enjoy. ", "child": "1997_1\t1997_2\t1997_3\t1997_4"}