{"name": "2004", "parent": "", "title": "Seven Habits for Drafting a Highly Effective QB", "sentences": [{"07f9": "Seven Habits for Drafting a Highly Effective QB"}, {"b0b4": "Don’t get stuck with the next Ryan Leaf. Here is a GM’s guide to finding the best possible signal-caller in the NFL draft."}, {"6688": "With the NFL draft in three weeks, let’s take a break from the ongoing mess in D.C. to discuss another ongoing mess in D.C.: Washington’s ongoing inability to evaluate the quarterback position. This year’s draft features the same philosophical dilemma that’s haunted the Redskins since 1994. Do you value the proven winner who delivered at every level and keeps making doubters look bad (Deshaun Watson), or do you value the high-ceiling guy with potential who hasn’t delivered nearly as much (Mitchell Trubisky)?"}, {"6d0f": "Lately, Watson has been climbing the boards, which makes me wonder if the NFL is finally figuring this stuff out. I believe in seven rules for evaluating a college quarterback; Watson clears all of those rules. (We’ll get to that.) But Washington’s checkered history tells us just as much about the perils of evaluating the position."}, {"83cc": "Come back with me to 1994. Remember the immortal Heath Shuler? The Redskins picked him third overall, then selected a second QB named Gus Frerotte 194 picks later. Shuler flamed out about as fast as any top-three QB not named “Leaf” or “Russell.” Frerotte became famous (and infamous) for concussing himself during a touchdown celebration, somehow holding onto that Washington gig for three rocky years. They replaced him with unknown CFL cast-off Trent Green (who later jumped to St. Louis), then aging Brad Johnson, then the one and only Tony Banks. They spent a first-round pick on Patrick Ramsey in 2002, gave him 24 ugly starts and warmed up the Trade Machine. (Noticing a trend here?) Next up: aging Jacksonville star Mark Brunell, who held the fort until they spent a 2005 first-round pick on Jason Campbell."}, {"a0a5": "The Ringer’s 2017 NFL Mock Draft, Version 2.0What would a first round without Leonard Fournette and Dalvin Cook look like?theringer.com"}, {"3c7c": "At this point, Washington’s draft-trade-draft-trade cycle was starting to resemble something of a strategy — a pointless strategy with no upside whatsoever, but still, a strategy. When Campbell struggled, they dealt for Donovan McNabb and signed Rex Grossman. McNabb was a washed-up star; Grossman couldn’t even say that. At this point, any other American business with this many failures would have outsourced its evaluations of quarterbacks to a group of analysts in Vienna. When Grossman stunk worse than McNabb did, Washington packaged a slew of premium picks for its next Future Franchise QB: Robert Griffin III. Only this time, the Skins finally did something smart: They repeated their 1994 strategy and drafted another quarterback 100 picks later, Michigan State’s Kirk Cousins."}, {"dcef": "Griffin gave them one electric season, injured his knee, never improved or worked on his game, and eventually lost his job — not because the front office lost patience, but because every coach who ever spent time with Griffin ran for the hills (and quickly). Cousins gave Washington something resembling All-Pro numbers; he’s the quarterback of the present (with no guarantee of the future). For two straight springs, Washington has slapped a franchise tag on him without ever fully committing to him. That means, for the 24th straight NFL season, Washington fans can’t say to themselves, “I know that guy is my quarterback.”"}, {"b51e": "Twelve starting QBs in less than a quarter of a century? Is it really THAT hard to evaluate one position?"}, {"83cb": "Actually, yes."}, {"84cd": "The great Bill Walsh said once, “The hardest thing to do in football is to find coaches that can coach the quarterback, and it’s even harder to find ones that can evaluate them.”"}, {"483e": "Even Walsh struggled. In 1986, Joe Montana suffered a back injury and missed two months, with the team worrying that Montana might have to retire. Walsh’s Niners managed to win four games with backups Jeff Kemp and Mike Moroski. Who? Exactly. That might have been Walsh’s most amazing season. As much as Walsh loved Montana, that season taught him that he needed to find Montana’s heir apparent."}, {"ee3a": "Joe Montana, Steve Young, and Bill Walsh (Getty Images)"}, {"2eaa": "Enter Steve Young, a sensational college quarterback who wasted one season in the USFL before landing with the team that drafted him first overall in the supplemental draft in 1984: Tampa Bay, the 1980s version of today’s Browns. After two seasons of watching Young display better running skills than passing skills, the Bucs stupidly decided to move on. Before Walsh traded for Young, he called a staff meeting to assess a relatively cheap trade. Walsh asked his assistants to raise their hands for support of the deal; not a single hand went up. Walsh stormed out and made the deal anyway. He decided few could evaluate the quarterback position — even in his own organization."}, {"2a01": "What did Walsh see in Young that others could not? Why did Walsh have the vision to predict the futures of quarterbacks like Young, Montana, and later Jeff Garcia? Simple: He had a specific cheat sheet."}, {"0184": "I know what you’re thinking: If 305 quarterbacks have been drafted since 1992–61 in the first round — and 80 percent of them flame out, then how could we solve this crisis with something as simple as a cheat sheet? Why have three of the 15 quarterbacks selected first overall failed to produce (David Carr, Tim Couch, JaMarcus Russell), with another (Jared Goff) in danger of becoming the fourth? How can something like “Manning or Leaf?” even be an argument? How can football’s most important position be so poorly scouted?"}, {"e3ed": "Walsh believed in a simple answer: Few teams know what they are looking for in a quarterback."}, {"53e4": "So he flipped the paradigm: Instead of evaluating what a young QB could bring to his team, Walsh evaluated how a quarterback could excel in his West Coast offense. His cheat sheet demanded the following things: a quick-footed passer; a rhythm thrower; athletic movement; toughness; a winning pedigree; and someone who instinctively knew how to play quarterback. He scouted inside out, not outside in."}, {"3c75": "Another Hall of Fame coach created a similar cheat sheet: Bill Parcells. He wanted a three-year starter. He wanted a senior in college, someone who graduated. He wanted a player who started at least 30 games, with 23 or more wins, and at least a 2-to-1 touchdown-to-interception ratio. Finally, he wanted a 60 percent passer."}, {"81a7": "Did you notice that arm strength failed to crack either list? Or that passing mechanics and delivery were absent? In the eyes of Walsh and Parcells, success and productivity override mechanics. And don’t throw Tim Tebow at me. Tebow succeeded in college as a runner, not a thrower. He failed in pro football not due to his mechanics (they certainly didn’t help), but because he had no feel for the passing game, no instincts, and zero willingness to improve. Tebow wanted to run with the ball, not sling it. That can’t work in the pros. We see the same mistakes happen in basketball evaluations. Does it matter that UCLA phenom Lonzo Ball’s shot mechanics look unorthodox when he keeps draining shots? Who cares? What’s the result?"}, {"c835": "The Key to Understanding Lonzo Ball’s Shooting MechanicsWe’ve pored over the tape, and even with his funky motion, there is more than meets the eyetheringer.com"}, {"8a4b": "I believe any franchise quarterback must possess seven essential qualities beyond the ability to throw the ball, move, and make plays. These traits separate the good from the great. Teams must correctly evaluate the players in these areas. And if they fail? Then they’re mired in that hopeless draft-trade-draft-trade-draft cycle Washington’s been in these past 24 years."}, {"78dc": "Trait No. 1: Winning Pedigree"}, {"4b1e": "How many times did he come back and lead the team to a win? How often does he play with the lead? How often does he play from behind?"}, {"61aa": "Vince Lombardi once said, “Winning is a habit. Unfortunately, so is losing.” Why did Parcells want 23-plus wins? That told him if the player was committed to doing the little things it took to win games. Jameis Winston was 26–1 as a starter in college. Marcus Mariota was 36–5. Our boy Kirk Cousins? 27–12. Not bad! Beating good competition demonstrates a player has the tools to take to the next level."}, {"d569": "Deshaun Watson (Getty Images)"}, {"9f06": "On the flip side, North Carolina’s Mitchell Trubisky was a one-year starter; in aggregate, his numbers against top-25 competition were not strong. Trubisky supporters might blame his supporting cast, but his yards per attempt declined from 10.16 to 6.11 against top-25 teams. He also averaged 10.14 yards per attempt in wins and 5.85 in losses. Fairly significant. Meanwhile, Clemson’s Deshaun Watson averaged 7.69 yards per attempt when winning and 9.40 when losing. Watson turns up the heat when he trails. By the way, Watson won 32 games in college; Trubisky won eight."}, {"e205": "Trait No. 2: The Thickest Skin"}, {"597b": "Mental, physical, and emotional toughness. Must demonstrate mental toughness on and off the field. Must be thick-skinned, must handle the pressure of the position, positive and negative."}, {"5714": "Bobby Knight once said, “Mental toughness is to physical as four is to one.” They don’t necessarily go together. You can’t succeed as a QB without either. It takes physical toughness to endure gruesome hits, but it takes true mental toughness to focus and concentrate while you’re in pain. Scouts must determine if the prospect has the discipline to handle the same routine each and every day without ever cutting corners."}, {"dbfa": "I believe scouts must find examples of a prospect overcoming adversity in his life (and not just on the field). As Gregg Popovich says, “The measure of who we are is how we react to something that doesn’t go our way.” Past performance is the best future indicator. Can the prospect bounce back from criticism? Does he allow one bad play to bother him? Can he shake off a lousy series?"}, {"0645": "Trait No. 3: Blood, Sweat, and Tears"}, {"110a": "Is he the hardest-working player on the team, or at least one of the hardest?"}, {"8159": "You would be astounded by how many teams ignore this. Do you think JaMarcus Russell was the hardest worker at LSU? Or Johnny Manziel at Texas A&M? Jeff Van Gundy once said, “Your best player has to set a tone of intolerance for anything that gets in the way of winning.” Being lazy? That gets in the way of winning. Lifting weights and taking care of your body? That’s hard work. Had Washington valued hard work, it never would have acquired McNabb — he coasted on natural talent, and when it waned, he didn’t have a backup plan."}, {"2c4f": "Examine recent busts and show me a truly hard worker who failed. Ryan Leaf showed up 20 pounds overweight for his combine weigh-in; why wasn’t that a bigger red flag? Your franchise QB, if you can find one, should always be a gym rat. First to work, last to leave. He should be constantly working on his craft and constantly trying to improve. He should embrace hard work. And if he doesn’t, you’re screwed."}, {"c665": "Trait No. 4: High Football IQ"}, {"2ef3": "Does he study tape? Alone or with the coach? Which day does he get the game plan? How much time does he need to “know” it? Is he football smart?"}, {"d93e": "Today’s college offenses are simple — every play comes from the sideline. In pro football, you’re on your own and the game moves much faster. That means the appetite for knowledge must be in a quarterback’s mental makeup. You cannot teach obsession; it has to come naturally. Take Drew Brees, who studies tape of opponents constantly. He knows the personnel, the scheme, and any adjustments within the scheme. He’s so obsessed with gaining knowledge that his suggestions and recommendations can annoy his coaches. But all that knowledge helps him play fast, right?"}, {"073d": "Remember, the NFL game moves significantly faster than the college game. How quickly a quarterback processes those 40–50 decisions per game and makes those decisions is critical. It can’t happen without understanding what you studied on tape, then importing it from the classroom to the field. Everyone watches game film; few retain what they learned. Otherwise, those “study” sessions are worthless."}, {"aaef": "Trait No. 5: The Crib Factor"}, {"d425": "Was he born to be a quarterback?"}, {"759e": "There are no quarterback manufacturing plants in the USA. Great ones are born to play quarterback, whether it’s Brady, Manning, Brees … all of them were gifted from the crib with the right temperament, competitiveness, drive, ambition, determination, and natural instincts. You can’t learn those things. All the great ones succeeded in pee-wee football, high school football, and college. All of them. The same goes for Deshaun Watson, who started as a freshman for his high school team and as a freshman for a powerhouse team at Clemson. It’s a clear indication that Watson has the instinctive had-it-since-he-was-in-the-crib gene."}, {"e175": "On the flip side, think about Ryan Tannehill. A terrific athlete? Absolutely. Naturally instinctive for the position? No. The faster the game becomes, the more instincts take over — and that’s when Tannehill gets into trouble. Look at his career numbers on third down: He’s thrown 26 interceptions, averages a half yard less per attempt than his overall average, and completes just 58 percent of his passes. The faster the game, the less you like Tannehill. The opposite is true for Watson. That’s the crib factor."}, {"7918": "The Pros and Cons of the Star Running Backs in This DraftInitial scouting impressions of Leonard Fournette, Dalvin Cook, Christian McCaffrey, and the extremely underrated Alvin…theringer.com"}, {"adb4": "Trait No. 6: Body Language"}, {"230b": "You must attend a live game to get a feel for the body language of the player — and when you do, do you like what you see?"}, {"92d5": "Is body language important? Ask Bears fans! Jay Cutler would still be starting if his sideline body language had been more caring and engaged. There were times last season when he looked as if he’d rather be having a root canal. Cutler’s struggles to protect the ball become compounded with terrible body language after the mistake. It doesn’t seem like he cares. That creates problems inside and outside of the locker room."}, {"077a": "Geno Auriemma is one of our best coaches of the past 25 years; everything he’s built and sustained at UConn, with that much player turnover, is just remarkable. Did you know he benches his best players (even his stars!) if he doesn’t like their body language? Imagine what Geno would have done to Cam Newton when he was flossing his teeth on the sideline or hanging a towel over his head. Football teams feed off their QB, for better and worse."}, {"7525": "Trait No. 7: The Charm Factor"}, {"2b01": "Do his teammates love him? What do his teammates say about him, off the record?"}, {"eb1f": "The star quarterback has to be respected, feared, and loved. His competitive nature must be contagious. Teammates must want to play with him. And he must command the huddle. If you can’t say those four things about your QB, you won’t win. Any team missing a leader at quarterback ends up being rudderless. It’s the law of football."}, {"955a": "Of course, finding the truth on this specific subject is the biggest challenge of all. Colleges are trained to say wonderful things about their prospects. Why? Because planting players on NFL teams helps promote their programs. Teams cannot rely on finding out the right information from any college staff. They have to dig deeper."}, {"f4c9": "Recently a top prospect — I won’t say who — was dinged by his college teammates. They hated him to the degree that they refused to attend any of his private workouts. That’s a huge red flag. An unfortunate NFL team ignored it and drafted him on Day 1. What happened? His new teammates ended up feeling just like his old ones. That’s a surprise? You don’t just suddenly flip from being a bad teammate to a good one."}, {"7739": "A winning pedigree. Thick skin. Work ethic. High football IQ. Instincts. Positive body language. Good teammate."}, {"0c71": "It’s not like these indicators are mind-shattering or revolutionary. But whenever teams begin with the end in mind — scouting outside in — they ignore some of those indicators and get themselves into trouble."}, {"0037": "Teams lie to themselves. They believe they can change habits, that they can neutralize red flags. They can’t. Miracles don’t happen when you draft a QB. You might stumble into a gem because other teams misevaluated him (Derek Carr), or because his college sample size wasn’t quite big enough (Tom Brady), or because everyone else wrote him off for the wrong reason (Drew Brees and his height). Any time an NFL team gets lucky, it’s due to circumstance, not because it took a chance and magically transformed a flawed product. You can’t luck into a Hassan Whiteside in football; not at quarterback."}, {"b825": "Just ask any Washington fan. They watched their favorite team ignore that Heath Shuler struggled to grasp an offense in college. They ignored that Patrick Ramsey wasn’t an instinctive player, that Jason Campbell lacked the ability to process decisions quickly, that Robert Griffin III didn’t check enough of the aforementioned seven boxes. They spent 25 years getting it wrong, other than with Kirk Cousins … and we don’t even know if they got that right."}, {"63da": "Maybe there’s hope. This spring, Watson started climbing the big boards and even vaulted over Trubisky. The Ringer’s Danny Kelly believes Watson could go as high as fourth to Jacksonville. Incredible! Are NFL teams starting to figure out how to scout that position? We won’t know for sure until Washington spends another first-round pick on its next QB of the future. I bet we don’t have to wait too long."}], "content": "Seven Habits for Drafting a Highly Effective QB Don’t get stuck with the next Ryan Leaf. Here is a GM’s guide to finding the best possible signal-caller in the NFL draft. With the NFL draft in three weeks, let’s take a break from the ongoing mess in D.C. to discuss another ongoing mess in D.C.: Washington’s ongoing inability to evaluate the quarterback position. This year’s draft features the same philosophical dilemma that’s haunted the Redskins since 1994. Do you value the proven winner who delivered at every level and keeps making doubters look bad (Deshaun Watson), or do you value the high-ceiling guy with potential who hasn’t delivered nearly as much (Mitchell Trubisky)? Lately, Watson has been climbing the boards, which makes me wonder if the NFL is finally figuring this stuff out. I believe in seven rules for evaluating a college quarterback; Watson clears all of those rules. (We’ll get to that.) But Washington’s checkered history tells us just as much about the perils of evaluating the position. Come back with me to 1994. Remember the immortal Heath Shuler? The Redskins picked him third overall, then selected a second QB named Gus Frerotte 194 picks later. Shuler flamed out about as fast as any top-three QB not named “Leaf” or “Russell.” Frerotte became famous (and infamous) for concussing himself during a touchdown celebration, somehow holding onto that Washington gig for three rocky years. They replaced him with unknown CFL cast-off Trent Green (who later jumped to St. Louis), then aging Brad Johnson, then the one and only Tony Banks. They spent a first-round pick on Patrick Ramsey in 2002, gave him 24 ugly starts and warmed up the Trade Machine. (Noticing a trend here?) Next up: aging Jacksonville star Mark Brunell, who held the fort until they spent a 2005 first-round pick on Jason Campbell. The Ringer’s 2017 NFL Mock Draft, Version 2.0What would a first round without Leonard Fournette and Dalvin Cook look like?theringer.com At this point, Washington’s draft-trade-draft-trade cycle was starting to resemble something of a strategy — a pointless strategy with no upside whatsoever, but still, a strategy. When Campbell struggled, they dealt for Donovan McNabb and signed Rex Grossman. McNabb was a washed-up star; Grossman couldn’t even say that. At this point, any other American business with this many failures would have outsourced its evaluations of quarterbacks to a group of analysts in Vienna. When Grossman stunk worse than McNabb did, Washington packaged a slew of premium picks for its next Future Franchise QB: Robert Griffin III. Only this time, the Skins finally did something smart: They repeated their 1994 strategy and drafted another quarterback 100 picks later, Michigan State’s Kirk Cousins. Griffin gave them one electric season, injured his knee, never improved or worked on his game, and eventually lost his job — not because the front office lost patience, but because every coach who ever spent time with Griffin ran for the hills (and quickly). Cousins gave Washington something resembling All-Pro numbers; he’s the quarterback of the present (with no guarantee of the future). For two straight springs, Washington has slapped a franchise tag on him without ever fully committing to him. That means, for the 24th straight NFL season, Washington fans can’t say to themselves, “I know that guy is my quarterback.” Twelve starting QBs in less than a quarter of a century? Is it really THAT hard to evaluate one position? Actually, yes. The great Bill Walsh said once, “The hardest thing to do in football is to find coaches that can coach the quarterback, and it’s even harder to find ones that can evaluate them.” Even Walsh struggled. In 1986, Joe Montana suffered a back injury and missed two months, with the team worrying that Montana might have to retire. Walsh’s Niners managed to win four games with backups Jeff Kemp and Mike Moroski. Who? Exactly. That might have been Walsh’s most amazing season. As much as Walsh loved Montana, that season taught him that he needed to find Montana’s heir apparent. Joe Montana, Steve Young, and Bill Walsh (Getty Images) Enter Steve Young, a sensational college quarterback who wasted one season in the USFL before landing with the team that drafted him first overall in the supplemental draft in 1984: Tampa Bay, the 1980s version of today’s Browns. After two seasons of watching Young display better running skills than passing skills, the Bucs stupidly decided to move on. Before Walsh traded for Young, he called a staff meeting to assess a relatively cheap trade. Walsh asked his assistants to raise their hands for support of the deal; not a single hand went up. Walsh stormed out and made the deal anyway. He decided few could evaluate the quarterback position — even in his own organization. What did Walsh see in Young that others could not? Why did Walsh have the vision to predict the futures of quarterbacks like Young, Montana, and later Jeff Garcia? Simple: He had a specific cheat sheet. I know what you’re thinking: If 305 quarterbacks have been drafted since 1992–61 in the first round — and 80 percent of them flame out, then how could we solve this crisis with something as simple as a cheat sheet? Why have three of the 15 quarterbacks selected first overall failed to produce (David Carr, Tim Couch, JaMarcus Russell), with another (Jared Goff) in danger of becoming the fourth? How can something like “Manning or Leaf?” even be an argument? How can football’s most important position be so poorly scouted? Walsh believed in a simple answer: Few teams know what they are looking for in a quarterback. So he flipped the paradigm: Instead of evaluating what a young QB could bring to his team, Walsh evaluated how a quarterback could excel in his West Coast offense. His cheat sheet demanded the following things: a quick-footed passer; a rhythm thrower; athletic movement; toughness; a winning pedigree; and someone who instinctively knew how to play quarterback. He scouted inside out, not outside in. Another Hall of Fame coach created a similar cheat sheet: Bill Parcells. He wanted a three-year starter. He wanted a senior in college, someone who graduated. He wanted a player who started at least 30 games, with 23 or more wins, and at least a 2-to-1 touchdown-to-interception ratio. Finally, he wanted a 60 percent passer. Did you notice that arm strength failed to crack either list? Or that passing mechanics and delivery were absent? In the eyes of Walsh and Parcells, success and productivity override mechanics. And don’t throw Tim Tebow at me. Tebow succeeded in college as a runner, not a thrower. He failed in pro football not due to his mechanics (they certainly didn’t help), but because he had no feel for the passing game, no instincts, and zero willingness to improve. Tebow wanted to run with the ball, not sling it. That can’t work in the pros. We see the same mistakes happen in basketball evaluations. Does it matter that UCLA phenom Lonzo Ball’s shot mechanics look unorthodox when he keeps draining shots? Who cares? What’s the result? The Key to Understanding Lonzo Ball’s Shooting MechanicsWe’ve pored over the tape, and even with his funky motion, there is more than meets the eyetheringer.com I believe any franchise quarterback must possess seven essential qualities beyond the ability to throw the ball, move, and make plays. These traits separate the good from the great. Teams must correctly evaluate the players in these areas. And if they fail? Then they’re mired in that hopeless draft-trade-draft-trade-draft cycle Washington’s been in these past 24 years. Trait No. 1: Winning Pedigree How many times did he come back and lead the team to a win? How often does he play with the lead? How often does he play from behind? Vince Lombardi once said, “Winning is a habit. Unfortunately, so is losing.” Why did Parcells want 23-plus wins? That told him if the player was committed to doing the little things it took to win games. Jameis Winston was 26–1 as a starter in college. Marcus Mariota was 36–5. Our boy Kirk Cousins? 27–12. Not bad! Beating good competition demonstrates a player has the tools to take to the next level. Deshaun Watson (Getty Images) On the flip side, North Carolina’s Mitchell Trubisky was a one-year starter; in aggregate, his numbers against top-25 competition were not strong. Trubisky supporters might blame his supporting cast, but his yards per attempt declined from 10.16 to 6.11 against top-25 teams. He also averaged 10.14 yards per attempt in wins and 5.85 in losses. Fairly significant. Meanwhile, Clemson’s Deshaun Watson averaged 7.69 yards per attempt when winning and 9.40 when losing. Watson turns up the heat when he trails. By the way, Watson won 32 games in college; Trubisky won eight. Trait No. 2: The Thickest Skin Mental, physical, and emotional toughness. Must demonstrate mental toughness on and off the field. Must be thick-skinned, must handle the pressure of the position, positive and negative. Bobby Knight once said, “Mental toughness is to physical as four is to one.” They don’t necessarily go together. You can’t succeed as a QB without either. It takes physical toughness to endure gruesome hits, but it takes true mental toughness to focus and concentrate while you’re in pain. Scouts must determine if the prospect has the discipline to handle the same routine each and every day without ever cutting corners. I believe scouts must find examples of a prospect overcoming adversity in his life (and not just on the field). As Gregg Popovich says, “The measure of who we are is how we react to something that doesn’t go our way.” Past performance is the best future indicator. Can the prospect bounce back from criticism? Does he allow one bad play to bother him? Can he shake off a lousy series? Trait No. 3: Blood, Sweat, and Tears Is he the hardest-working player on the team, or at least one of the hardest? You would be astounded by how many teams ignore this. Do you think JaMarcus Russell was the hardest worker at LSU? Or Johnny Manziel at Texas A&M? Jeff Van Gundy once said, “Your best player has to set a tone of intolerance for anything that gets in the way of winning.” Being lazy? That gets in the way of winning. Lifting weights and taking care of your body? That’s hard work. Had Washington valued hard work, it never would have acquired McNabb — he coasted on natural talent, and when it waned, he didn’t have a backup plan. Examine recent busts and show me a truly hard worker who failed. Ryan Leaf showed up 20 pounds overweight for his combine weigh-in; why wasn’t that a bigger red flag? Your franchise QB, if you can find one, should always be a gym rat. First to work, last to leave. He should be constantly working on his craft and constantly trying to improve. He should embrace hard work. And if he doesn’t, you’re screwed. Trait No. 4: High Football IQ Does he study tape? Alone or with the coach? Which day does he get the game plan? How much time does he need to “know” it? Is he football smart? Today’s college offenses are simple — every play comes from the sideline. In pro football, you’re on your own and the game moves much faster. That means the appetite for knowledge must be in a quarterback’s mental makeup. You cannot teach obsession; it has to come naturally. Take Drew Brees, who studies tape of opponents constantly. He knows the personnel, the scheme, and any adjustments within the scheme. He’s so obsessed with gaining knowledge that his suggestions and recommendations can annoy his coaches. But all that knowledge helps him play fast, right? Remember, the NFL game moves significantly faster than the college game. How quickly a quarterback processes those 40–50 decisions per game and makes those decisions is critical. It can’t happen without understanding what you studied on tape, then importing it from the classroom to the field. Everyone watches game film; few retain what they learned. Otherwise, those “study” sessions are worthless. Trait No. 5: The Crib Factor Was he born to be a quarterback? There are no quarterback manufacturing plants in the USA. Great ones are born to play quarterback, whether it’s Brady, Manning, Brees … all of them were gifted from the crib with the right temperament, competitiveness, drive, ambition, determination, and natural instincts. You can’t learn those things. All the great ones succeeded in pee-wee football, high school football, and college. All of them. The same goes for Deshaun Watson, who started as a freshman for his high school team and as a freshman for a powerhouse team at Clemson. It’s a clear indication that Watson has the instinctive had-it-since-he-was-in-the-crib gene. On the flip side, think about Ryan Tannehill. A terrific athlete? Absolutely. Naturally instinctive for the position? No. The faster the game becomes, the more instincts take over — and that’s when Tannehill gets into trouble. Look at his career numbers on third down: He’s thrown 26 interceptions, averages a half yard less per attempt than his overall average, and completes just 58 percent of his passes. The faster the game, the less you like Tannehill. The opposite is true for Watson. That’s the crib factor. The Pros and Cons of the Star Running Backs in This DraftInitial scouting impressions of Leonard Fournette, Dalvin Cook, Christian McCaffrey, and the extremely underrated Alvin…theringer.com Trait No. 6: Body Language You must attend a live game to get a feel for the body language of the player — and when you do, do you like what you see? Is body language important? Ask Bears fans! Jay Cutler would still be starting if his sideline body language had been more caring and engaged. There were times last season when he looked as if he’d rather be having a root canal. Cutler’s struggles to protect the ball become compounded with terrible body language after the mistake. It doesn’t seem like he cares. That creates problems inside and outside of the locker room. Geno Auriemma is one of our best coaches of the past 25 years; everything he’s built and sustained at UConn, with that much player turnover, is just remarkable. Did you know he benches his best players (even his stars!) if he doesn’t like their body language? Imagine what Geno would have done to Cam Newton when he was flossing his teeth on the sideline or hanging a towel over his head. Football teams feed off their QB, for better and worse. Trait No. 7: The Charm Factor Do his teammates love him? What do his teammates say about him, off the record? The star quarterback has to be respected, feared, and loved. His competitive nature must be contagious. Teammates must want to play with him. And he must command the huddle. If you can’t say those four things about your QB, you won’t win. Any team missing a leader at quarterback ends up being rudderless. It’s the law of football. Of course, finding the truth on this specific subject is the biggest challenge of all. Colleges are trained to say wonderful things about their prospects. Why? Because planting players on NFL teams helps promote their programs. Teams cannot rely on finding out the right information from any college staff. They have to dig deeper. Recently a top prospect — I won’t say who — was dinged by his college teammates. They hated him to the degree that they refused to attend any of his private workouts. That’s a huge red flag. An unfortunate NFL team ignored it and drafted him on Day 1. What happened? His new teammates ended up feeling just like his old ones. That’s a surprise? You don’t just suddenly flip from being a bad teammate to a good one. A winning pedigree. Thick skin. Work ethic. High football IQ. Instincts. Positive body language. Good teammate. It’s not like these indicators are mind-shattering or revolutionary. But whenever teams begin with the end in mind — scouting outside in — they ignore some of those indicators and get themselves into trouble. Teams lie to themselves. They believe they can change habits, that they can neutralize red flags. They can’t. Miracles don’t happen when you draft a QB. You might stumble into a gem because other teams misevaluated him (Derek Carr), or because his college sample size wasn’t quite big enough (Tom Brady), or because everyone else wrote him off for the wrong reason (Drew Brees and his height). Any time an NFL team gets lucky, it’s due to circumstance, not because it took a chance and magically transformed a flawed product. You can’t luck into a Hassan Whiteside in football; not at quarterback. Just ask any Washington fan. They watched their favorite team ignore that Heath Shuler struggled to grasp an offense in college. They ignored that Patrick Ramsey wasn’t an instinctive player, that Jason Campbell lacked the ability to process decisions quickly, that Robert Griffin III didn’t check enough of the aforementioned seven boxes. They spent 25 years getting it wrong, other than with Kirk Cousins … and we don’t even know if they got that right. Maybe there’s hope. This spring, Watson started climbing the big boards and even vaulted over Trubisky. The Ringer’s Danny Kelly believes Watson could go as high as fourth to Jacksonville. Incredible! Are NFL teams starting to figure out how to scout that position? We won’t know for sure until Washington spends another first-round pick on its next QB of the future. I bet we don’t have to wait too long. ", "child": "2004_1\t2004_2\t2004_3\t2004_4\t2004_5\t2004_6\t2004_7\t2004_8\t2004_9\t2004_10\t2004_11\t2004_12\t2004_13\t2004_14\t2004_15\t2004_16\t2004_17\t2004_18\t2004_19\t2004_20\t2004_21\t2004_22\t2004_23\t2004_24\t2004_25"}