{"name": "2006", "parent": "", "title": "Lamar Jackson Is an Unstoppable Force", "sentences": [{"0806": "Lamar Jackson Is an Unstoppable Force"}, {"979f": "Can Clemson’s defense be the immovable object?"}, {"b873": "By now, you know about Lamar Jackson. With Louisville’s sophomore quarterback playing like Vince Young for the past month, it would be impossible not to. Jackson performed an Olympic routine en route to the end zone, dropped Florida State in a historic blowout, and propelled Louisville to favored status on the road against a team that’s lost once in 22 months."}, {"eaee": "No. 3 Louisville visits no. 5 Clemson on Saturday night, and though the 2016 campaign is still working through its early-season appetizers, this game could prove to be the year’s most hyped. It’s a matchup between Deshaun Watson, the preseason pick for the nation’s top quarterback, and Jackson, the nation’s, well, actual top quarterback. But in a twist, the battle between the latter and his defensive opposition could be even more fascinating than the QB showdown."}, {"cc15": "By the advanced metric S&P+, which measures a team’s production by looking at individual play-by-play and drive data, Louisville fields the top offense in the country, and Clemson the top defense. This game represents the quintessential battle of strengths."}, {"ca87": "You already know the unstoppable force. It’s time to meet the immovable object."}, {"454a": "College Football’s Newest Phenom Is About to Face His Toughest TestLouisville QB Lamar Jackson is part messiah, part mysterytheringer.com"}, {"0de1": "Clemson’s outlook appeared to be one of the easier ones to forecast heading into the season: If all went well, the Tigers would run up the score against overmatched ACC flotsam, contend with Florida State for a conference title, and return to the playoff to try and avenge themselves against Alabama. With nearly the entire offensive core returning from the unit that scored 40 points in last year’s title game, any questions about Clemson’s ability to follow its seemingly preordained path came on the defensive side of the ball."}, {"9e05": "The Tigers had a wealth of riches on defense last season, and outside the national championship, they played like it. Only three other teams had better overall defenses, and nobody else wreaked more havoc on opposing backfields: Clemson led the country in tackles for loss last year and ranked second in sacks."}, {"5057": "But after the season, those riches trickled upward en masse to the NFL. Seven Clemson defenders were drafted last spring, including four in the first two rounds, and that’s on top of the two first-rounders selected the previous year. No other college — not Alabama, not Florida, not Ohio State — produced as many high picks on defense the last two years. Between Shaq Lawson and Kevin Dodd alone, about half of those sacks left for the pros."}, {"85cf": "“Serious responsibility is certain to fall on inexperienced Clemson defenders next season,” Pro Football Focus wrote in its season preview. “The defense gets gutted, again … Whatever gains made on offense could be countered by defensive regression,” The Big Lead concurred. Fox Sports summed up the common perception: “The Tigers’ defense is the biggest hole in my ‘Why Clemson can win the title’ argument.”"}, {"8ccf": "Yet for all the worry about the defense’s new faces, Clemson’s D has been a near imitation of last year’s version. The Tigers still get after the quarterback (3.3 sacks per game, vs. 3.2 last year), still get into opposing backfields (9.5 tackles for loss per game, vs. 8.4 last year), and still get off the field on third downs (fourth-best in the country both years)."}, {"1acd": "The defensive dominance starts with a line intent on proving itself anew. Clemson’s collection of skill didn’t significantly diminish when Lawson and Dodd left: Six members of the Tigers’ starting front seven were four- or five-star recruits, per 247Sports, and the seventh is a three-star sophomore who now leads the team in total tackles and tackles for loss. The team has depth, too: All four backup linemen on the two-deep are also four-star talents."}, {"f88c": "Christian Wilkins swung outside from defensive tackle to end this year, and he’s joined by Carlos Watkins and no. 2 national recruit Dexter Lawrence up front, giving Clemson three big, mobile bodies on the line. Wilkins, Watkins, and Lawrence tip the scales at an average of 6-foot-4, 318 pounds, and on any given play, they can explode into the pocket like ends or move side to side like linebackers carrying an extra 75 pounds. The base defense’s 4–3 front rounds out with redshirt freshman Clelin Ferrell, a talented player in his own right, but in this unit one who’s overshadowed by the sheer size around him."}, {"6416": "Against Georgia Tech last Thursday night, Clemson held the Yellow Jackets’ triple-option attack to under 100 rush yards, just as it did last year — another instance of near imitation. Defensive coordinator Brent Venables’s group is still the only one to do so even once since 2009, let alone in consecutive seasons."}, {"56ca": "Georgia Tech’s first play from scrimmage set the tone for the night. Wilkins cut between two blockers, sniffed out the option read, and reached quarterback Justin Thomas before he even had time to complete his drop. Wilkins exhibited a rare combination of gap discipline, intuitive smarts, and explosiveness — and then spent the rest of the evening invading the Jackets’ backfield again and again."}, {"1310": "Later in the first quarter, it was Watkins’s turn. He and Lawrence each tallied four tackles from the DT position in the game, and on this play, Watkins overpowered a blocker on third-and-long and prevented Thomas from setting his feet and looking downfield. Again, this is a 300-plus-pound interior lineman looking like he’s running downhill toward the QB. Georgia Tech has built its game plan on controlling the line of scrimmage and giving its plays time to develop, but Clemson’s line stopped most plays before they began."}, {"d64c": "Clemson’s defense succeeds because its scheme builds from the line outward. The Tigers were at their best last week, shutting down an effective option running game while not giving a skilled dual-option quarterback time to think. It’s almost as if they were preparing for something."}, {"5c9f": "It’s one thing to have a top defense against teams without a coherent plan (hello, Auburn) or with a single dimension (sorry, Georgia Tech); it’s another to maintain that level of production against the best offense in the country. After all, Florida State’s defense isn’t short on talent, even with top defender Derwin James hurt, and Louisville just spent an afternoon gashing the Seminoles for 530 yards and 63 points. But if a team can stymie Jackson’s apparent omnipotence, it might be Clemson."}, {"b2af": "Jackson’s arm generates a lot of the ink, but the Cardinals’ offense is actually predicated on its running game, which is the most effective in the country. Among runners with at least 40 carries this season, back Brandon Radcliff and Jackson rank second and fifth, respectively, in average gain per rush. Overall, Louisville averages a whopping 7.8 yards per carry, tops in FBS. Clemson, however, boasts one of the only defensive lines athletic enough to have a chance at plugging those massive scarlet gaps. (One matchup to watch for later in the year: Houston’s FBS-best run defense against Radcliff and Jackson in a showdown that should have many of the same qualities as this contest.)"}, {"a381": "The run game is important both as a weapon in itself and as a means of setting up the deep pass. Louisville’s offensive scheme leverages the constant threat of an option run to open up easy throwing lanes in single coverage downfield, and Jackson — while inconsistent in his deep tosses at times — has generally taken advantage. Adjusting his completion percentage to omit drops, throwaways, and the like, Jackson has been on target on 50 percent of his throws traveling 20-plus yards, good for a top-10 mark nationally."}, {"c29f": "Clemson ranks third in the country in passing yards allowed per game — but with three of its contests so far coming against Auburn’s carousel of QBs, an FCS team, and Georgia Tech’s pass-averse offense, that stat likely misleads. The Tigers are inexperienced in the back and vulnerable deep, player protestations aside; if there’s a nightmare that should trouble Venables’s sleep tonight, it’s the image of receivers streaming with a numbers advantage through his secondary."}, {"b891": "We’re talking about Clemson’s defensive potential, though, and through that lens the Tigers could represent the stingy antithesis to the Cardinals’ dynamism, even with Jackson’s group leading the country in explosive plays (ranking first in plays of 10-plus, 20-plus, and 30-plus yards through four weeks). While the Cardinals offense already has 41 plays of 20 or more yards, the Tigers defense has allowed just seven; while the Cardinals have 25 plays of 30 or more yards, the Tigers have allowed just three."}, {"cb72": "Most importantly, Clemson might be able to disrupt the offense’s rhythm by pressuring the quarterback. Jackson hasn’t had to fend off much pressure thus far — Louisville has allowed just three sacks total this season, but Clemson averages more than that many per game. On the few plays when his pocket has collapsed or a pass rusher has entered his throwing lane, Jackson’s otherworldly efficiency has regressed to mere mortality."}, {"7411": "While Jackson’s stats when not facing pressure translate to a 127.9 NFL QB rating, they fall to an 81.4 mark when he is pressured, and his completion percentage drops nearly 20 points with pressure, per Pro Football Focus data. That 127.9 mark would be higher than Aaron Rodgers’s single-season record, but 81.4 is basically Kyle Orton’s career rating."}, {"7efb": "Individual plays seem to bear out this dichotomy. Facing pressure against Marshall last week, Jackson misfired on a shallow crossing route and forced an ill-advised deep ball into double coverage while being chased. The latter throw yielded an interception, but it’s the former play that’s striking, in light of Clemson’s greatest defensive strength."}, {"afbf": "A single free rusher transformed an otherwise simple pickup into an ugly incompletion, and given Clemson’s speed and versatility up front, it’s likely that Jackson will contend with his fair share of oncoming Tigers on Saturday. Turning, say, a routine second-and-5 into a stressful second-and-10, or a third-and-2 into a third-and-long, could be the difference between Clemson surrendering Louisville’s typical 50-plus points or keeping the score close."}, {"2785": "The best-case scenario for Clemson’s defense is to play like Stanford against Marcus Mariota’s Oregon teams. In those games, space-eating defensive linemen bottled holes and kept the Ducks’ run game in check, and the usual deep shots Oregon generated from an efficient rush attack didn’t materialize."}, {"8b95": "Clemson also features a weapon those Stanford teams lacked: a dynamic quarterback of its own. Against FBS competition, however, Clemson is averaging just 25 points per game — tied for 75th in the country. Deshaun Watson might wake up his unit in prime time, but the oddly inconsistent, turnover-prone Tigers likely won’t win a shootout the way they’ve been playing."}, {"fe88": "It comes down to the defense, then, which needs to slow Louisville’s option game, prevent the deep ball, and pressure Jackson into errors. No opponent yet has shown the ability to accomplish even one of those tasks over a full game, but no opponent yet has had the combination of raw athleticism and disciplined coaching that Clemson brings to the defensive huddle."}, {"aeb2": "It might not be enough — it probably won’t be enough — to dim college football’s shiniest new star. There’s a chance that Clemson won’t let Louisville turn this heralded matchup into a blowout, though, and that’s reason enough to tune in Saturday night. Or maybe Jackson will register another reality-bending performance and wrap up his Heisman win two months in advance. Sounds like a fun watch either way."}], "content": "Lamar Jackson Is an Unstoppable Force Can Clemson’s defense be the immovable object? By now, you know about Lamar Jackson. With Louisville’s sophomore quarterback playing like Vince Young for the past month, it would be impossible not to. Jackson performed an Olympic routine en route to the end zone, dropped Florida State in a historic blowout, and propelled Louisville to favored status on the road against a team that’s lost once in 22 months. No. 3 Louisville visits no. 5 Clemson on Saturday night, and though the 2016 campaign is still working through its early-season appetizers, this game could prove to be the year’s most hyped. It’s a matchup between Deshaun Watson, the preseason pick for the nation’s top quarterback, and Jackson, the nation’s, well, actual top quarterback. But in a twist, the battle between the latter and his defensive opposition could be even more fascinating than the QB showdown. By the advanced metric S&P+, which measures a team’s production by looking at individual play-by-play and drive data, Louisville fields the top offense in the country, and Clemson the top defense. This game represents the quintessential battle of strengths. You already know the unstoppable force. It’s time to meet the immovable object. College Football’s Newest Phenom Is About to Face His Toughest TestLouisville QB Lamar Jackson is part messiah, part mysterytheringer.com Clemson’s outlook appeared to be one of the easier ones to forecast heading into the season: If all went well, the Tigers would run up the score against overmatched ACC flotsam, contend with Florida State for a conference title, and return to the playoff to try and avenge themselves against Alabama. With nearly the entire offensive core returning from the unit that scored 40 points in last year’s title game, any questions about Clemson’s ability to follow its seemingly preordained path came on the defensive side of the ball. The Tigers had a wealth of riches on defense last season, and outside the national championship, they played like it. Only three other teams had better overall defenses, and nobody else wreaked more havoc on opposing backfields: Clemson led the country in tackles for loss last year and ranked second in sacks. But after the season, those riches trickled upward en masse to the NFL. Seven Clemson defenders were drafted last spring, including four in the first two rounds, and that’s on top of the two first-rounders selected the previous year. No other college — not Alabama, not Florida, not Ohio State — produced as many high picks on defense the last two years. Between Shaq Lawson and Kevin Dodd alone, about half of those sacks left for the pros. “Serious responsibility is certain to fall on inexperienced Clemson defenders next season,” Pro Football Focus wrote in its season preview. “The defense gets gutted, again … Whatever gains made on offense could be countered by defensive regression,” The Big Lead concurred. Fox Sports summed up the common perception: “The Tigers’ defense is the biggest hole in my ‘Why Clemson can win the title’ argument.” Yet for all the worry about the defense’s new faces, Clemson’s D has been a near imitation of last year’s version. The Tigers still get after the quarterback (3.3 sacks per game, vs. 3.2 last year), still get into opposing backfields (9.5 tackles for loss per game, vs. 8.4 last year), and still get off the field on third downs (fourth-best in the country both years). The defensive dominance starts with a line intent on proving itself anew. Clemson’s collection of skill didn’t significantly diminish when Lawson and Dodd left: Six members of the Tigers’ starting front seven were four- or five-star recruits, per 247Sports, and the seventh is a three-star sophomore who now leads the team in total tackles and tackles for loss. The team has depth, too: All four backup linemen on the two-deep are also four-star talents. Christian Wilkins swung outside from defensive tackle to end this year, and he’s joined by Carlos Watkins and no. 2 national recruit Dexter Lawrence up front, giving Clemson three big, mobile bodies on the line. Wilkins, Watkins, and Lawrence tip the scales at an average of 6-foot-4, 318 pounds, and on any given play, they can explode into the pocket like ends or move side to side like linebackers carrying an extra 75 pounds. The base defense’s 4–3 front rounds out with redshirt freshman Clelin Ferrell, a talented player in his own right, but in this unit one who’s overshadowed by the sheer size around him. Against Georgia Tech last Thursday night, Clemson held the Yellow Jackets’ triple-option attack to under 100 rush yards, just as it did last year — another instance of near imitation. Defensive coordinator Brent Venables’s group is still the only one to do so even once since 2009, let alone in consecutive seasons. Georgia Tech’s first play from scrimmage set the tone for the night. Wilkins cut between two blockers, sniffed out the option read, and reached quarterback Justin Thomas before he even had time to complete his drop. Wilkins exhibited a rare combination of gap discipline, intuitive smarts, and explosiveness — and then spent the rest of the evening invading the Jackets’ backfield again and again. Later in the first quarter, it was Watkins’s turn. He and Lawrence each tallied four tackles from the DT position in the game, and on this play, Watkins overpowered a blocker on third-and-long and prevented Thomas from setting his feet and looking downfield. Again, this is a 300-plus-pound interior lineman looking like he’s running downhill toward the QB. Georgia Tech has built its game plan on controlling the line of scrimmage and giving its plays time to develop, but Clemson’s line stopped most plays before they began. Clemson’s defense succeeds because its scheme builds from the line outward. The Tigers were at their best last week, shutting down an effective option running game while not giving a skilled dual-option quarterback time to think. It’s almost as if they were preparing for something. It’s one thing to have a top defense against teams without a coherent plan (hello, Auburn) or with a single dimension (sorry, Georgia Tech); it’s another to maintain that level of production against the best offense in the country. After all, Florida State’s defense isn’t short on talent, even with top defender Derwin James hurt, and Louisville just spent an afternoon gashing the Seminoles for 530 yards and 63 points. But if a team can stymie Jackson’s apparent omnipotence, it might be Clemson. Jackson’s arm generates a lot of the ink, but the Cardinals’ offense is actually predicated on its running game, which is the most effective in the country. Among runners with at least 40 carries this season, back Brandon Radcliff and Jackson rank second and fifth, respectively, in average gain per rush. Overall, Louisville averages a whopping 7.8 yards per carry, tops in FBS. Clemson, however, boasts one of the only defensive lines athletic enough to have a chance at plugging those massive scarlet gaps. (One matchup to watch for later in the year: Houston’s FBS-best run defense against Radcliff and Jackson in a showdown that should have many of the same qualities as this contest.) The run game is important both as a weapon in itself and as a means of setting up the deep pass. Louisville’s offensive scheme leverages the constant threat of an option run to open up easy throwing lanes in single coverage downfield, and Jackson — while inconsistent in his deep tosses at times — has generally taken advantage. Adjusting his completion percentage to omit drops, throwaways, and the like, Jackson has been on target on 50 percent of his throws traveling 20-plus yards, good for a top-10 mark nationally. Clemson ranks third in the country in passing yards allowed per game — but with three of its contests so far coming against Auburn’s carousel of QBs, an FCS team, and Georgia Tech’s pass-averse offense, that stat likely misleads. The Tigers are inexperienced in the back and vulnerable deep, player protestations aside; if there’s a nightmare that should trouble Venables’s sleep tonight, it’s the image of receivers streaming with a numbers advantage through his secondary. We’re talking about Clemson’s defensive potential, though, and through that lens the Tigers could represent the stingy antithesis to the Cardinals’ dynamism, even with Jackson’s group leading the country in explosive plays (ranking first in plays of 10-plus, 20-plus, and 30-plus yards through four weeks). While the Cardinals offense already has 41 plays of 20 or more yards, the Tigers defense has allowed just seven; while the Cardinals have 25 plays of 30 or more yards, the Tigers have allowed just three. Most importantly, Clemson might be able to disrupt the offense’s rhythm by pressuring the quarterback. Jackson hasn’t had to fend off much pressure thus far — Louisville has allowed just three sacks total this season, but Clemson averages more than that many per game. On the few plays when his pocket has collapsed or a pass rusher has entered his throwing lane, Jackson’s otherworldly efficiency has regressed to mere mortality. While Jackson’s stats when not facing pressure translate to a 127.9 NFL QB rating, they fall to an 81.4 mark when he is pressured, and his completion percentage drops nearly 20 points with pressure, per Pro Football Focus data. That 127.9 mark would be higher than Aaron Rodgers’s single-season record, but 81.4 is basically Kyle Orton’s career rating. Individual plays seem to bear out this dichotomy. Facing pressure against Marshall last week, Jackson misfired on a shallow crossing route and forced an ill-advised deep ball into double coverage while being chased. The latter throw yielded an interception, but it’s the former play that’s striking, in light of Clemson’s greatest defensive strength. A single free rusher transformed an otherwise simple pickup into an ugly incompletion, and given Clemson’s speed and versatility up front, it’s likely that Jackson will contend with his fair share of oncoming Tigers on Saturday. Turning, say, a routine second-and-5 into a stressful second-and-10, or a third-and-2 into a third-and-long, could be the difference between Clemson surrendering Louisville’s typical 50-plus points or keeping the score close. The best-case scenario for Clemson’s defense is to play like Stanford against Marcus Mariota’s Oregon teams. In those games, space-eating defensive linemen bottled holes and kept the Ducks’ run game in check, and the usual deep shots Oregon generated from an efficient rush attack didn’t materialize. Clemson also features a weapon those Stanford teams lacked: a dynamic quarterback of its own. Against FBS competition, however, Clemson is averaging just 25 points per game — tied for 75th in the country. Deshaun Watson might wake up his unit in prime time, but the oddly inconsistent, turnover-prone Tigers likely won’t win a shootout the way they’ve been playing. It comes down to the defense, then, which needs to slow Louisville’s option game, prevent the deep ball, and pressure Jackson into errors. No opponent yet has shown the ability to accomplish even one of those tasks over a full game, but no opponent yet has had the combination of raw athleticism and disciplined coaching that Clemson brings to the defensive huddle. It might not be enough — it probably won’t be enough — to dim college football’s shiniest new star. There’s a chance that Clemson won’t let Louisville turn this heralded matchup into a blowout, though, and that’s reason enough to tune in Saturday night. Or maybe Jackson will register another reality-bending performance and wrap up his Heisman win two months in advance. Sounds like a fun watch either way. ", "child": "2006_1"}