{"name": "2008", "parent": "", "title": "Saturday Superlatives: The Weird and Wonderful From College Football Week 9", "sentences": [{"864d": "Saturday Superlatives: The Weird and Wonderful From College Football Week 9"}, {"93e7": "Clemson outlasts Florida State, the Big 12’s Playoff hopes disappear, Jake Browning has a Heisman-worthy punt, and more madness"}, {"d621": "College football is glorious, but with 120-plus teams, it’s also impossible to fully track. So throughout the day, we’ll be celebrating the weird and wonderful moments that this silly sport has to offer. Come hang with us, and bring some khakis for our Jim Harbaugh Halloween costumes."}, {"4e37": "Most Important Result"}, {"b9a1": "During Saturday night’s broadcast of Clemson-Florida State, ABC reminded viewers several times that the winner of this game has gone on to win the ACC Good Division for the last seven years, and that the Good Division remains the superior division in the conference. (I know these divisions have names, but I find it easier to call them “Good” and “Bad” instead of figuring out which teams are in the Coastal and Atlantic.) But this year’s matchup took on extra importance, as Louisville is still in the mix, longing for a shot at the ACC title."}, {"4aa2": "Deshaun Watson (Getty Images)"}, {"8d87": "The undefeated Tigers stayed undefeated, though, beating FSU in a 37–34 free-for-all that experienced three lead changes in the final 5:25. The Seminoles seemed primed to end the game with a fourth, but their offensive line must’ve gotten flipped by Clemson counterintelligence, as the group did everything in its power to help the Tigers on the final drive. Florida State’s offensive linemen got called for two false starts and one holding penalty, plus allowed sacks to Clemson’s Christian Wilkins, Dexter Lawrence, and Ben Boulware on the Seminoles’ last plays. Combine the penalties and the sacks, and the unit accounted for –43 yards on a drive that was supposed to go forward."}, {"cb43": "It’s a bit early to begin booking College Football Playoff bids, but Clemson’s toughest work is done. Its remaining schedule is … light. The Tigers have navigated past Lamar Jackson and Dalvin Cook, and they have Syracuse, Pittsburgh, Wake Forest, and South Carolina remaining in the regular season. None of those teams has a losing record! But it’s ’Cuse, Pitt, Wake, and South Carolina. And then Clemson should play the leader of the Bad Division, which has no teams ranked in the top 20 at the moment."}, {"eedc": "We like college football because random explosions happen, and there were plenty of them this Saturday, as four undefeated teams lost on the road to unranked opponents. But for the past two years, Clemson has been better than anybody at dodging stray blasts. Do that for five more games, and it’ll be back in the playoff."}, {"9f82": "B1Ggest Result"}, {"34c9": "Why skydive? Why BASE jump? Why swim in a cage with sharks? For some, the nearness to death provides a high that nothing else can."}, {"5da5": "If you watch Wisconsin football, you’ll understand, although the Badgers’ preferred near-death experience isn’t jumping out of a plane: It’s eating a preposterous amount of cheese and seeing if it causes a heart attack during a tightly contested fourth quarter."}, {"47b7": "The Badgers have played eight games now; six have been decided by one possession. There are rarely many points. There is just the creeping sense of doom, for everyone involved. Wisconsin played basically the same game this fall against LSU, Michigan, Ohio State, and Georgia State — four programs that we have always lumped together."}, {"d6fb": "On Saturday, the Badgers hosted seventh-ranked Nebraska, the last remaining unbeaten team in the Big Ten West. Cornhuskers quarterback Tommy Armstrong had his worst outing of the season, finishing 12-of-31 for 153 yards with two interceptions. Wisconsin’s QBs, Alex Hornibrook and Bart Houston, continued to split playing time and fare poorly. NO MATTER. This game went to overtime, and the Badgers won, 23–17."}, {"ea77": "Somebody will win the Big Ten West. It might be Nebraska. It probably should be Western Michigan, but sadly, the Broncos are in the MAC and are ineligible. It might be Wisconsin, which is now 6–2. But the Badgers will make you doubt it every game — and they’ll still win a whole bunch of them."}, {"4f39": "Worst Day for a Conference"}, {"274b": "Quincy Vasser (AP Images)"}, {"3414": "The Big 12 entered Saturday with two unbeaten teams, West Virginia and Baylor."}, {"71c4": "I really liked West Virginia. With head coach Dana Holgorsen’s freewheeling offense and a surprisingly good defense, the Mountaineers had steadily climbed in the rankings, cracking the top 10 in the AP poll this week. Over their past two games, they crushed Texas Tech and TCU. But the Mountaineers’ dreams of an undefeated season died Saturday in Stillwater, as they lost 37–20 to Oklahoma State."}, {"c398": "I did not really like Baylor. In past seasons, they’d been a fun team to root for, a college football outsider suddenly running up the score on the big boys. But with each week, we seem to learn new details about how the school and former coach Art Briles handled sexual assault allegations against football players. Each win became abhorrent. Of course, most people at Baylor were not responsible for these failings. But there were some people who made the conscious decision to value football success over the safety of women on campus, and I imagine in their warped worlds, the team’s record validated their disgusting decision-making."}, {"81fe": "Baylor fell this weekend, too, losing at Texas, 35–34. It would be hard to explain to somebody 10 years ago our surprise at scrappy underdog Texas pulling an upset over mighty Baylor, but, yeah, that’s what happened. I’m glad Baylor lost, and I’m sure the people who would’ve had to vote an undefeated Baylor into the College Football Playoff are glad Baylor lost, too."}, {"ab07": "By the time the sun set on Big 12 country, the league was out of undefeated teams. Oklahoma is now in the driver’s seat for the conference title, but the Sooners have already lost to Houston and Ohio State. I’m sure there is some scenario in which the Big 12 gets a team into the playoff, but it would require a cataclysm in other leagues."}, {"b21c": "Sexiest Dance"}, {"8c69": "[Grabs largest megaphone I can find]"}, {"569b": "[Grabs obnoxiously loud air horn]"}, {"8594": "GAME-WINNING SAFETY ALERT Y’ALLLLLLLLLLLL"}, {"c751": "Wyoming beat 13th-ranked Boise State 30–28 on Saturday after recording a safety in the final two minutes, and Cowboys defensive end Josiah Hall let loose one of the finest safety dances ever performed (non–Men Without Hats category)."}, {"25a3": "The win had some national implications. The Broncos were previously undefeated and seemed ready to roll through the Mountain West and claim the New Year’s Six bowl spot reserved for a non-power-conference team. With a loss to Boise’s name, another set of Broncos takes over, as 8–0 Western Michigan assumes pole position for that spot."}, {"0b65": "But forget about that, and let’s focus on the happy night in Wyoming. This is a really hard place to win. There aren’t many elite football recruits in Wyoming — there aren’t many people in Wyoming — so Cowboys coaches have to convince talented young athletes to come live in the mountains, away from the people, things, and lifestyles that they love. Yet Craig Bohl, who built North Dakota State into an FCS powerhouse from 2003–13, seems to be finding success. Wyoming is now 6–2, and this was its first win over a ranked opponent since 2002."}, {"bd1f": "So dance, Wyoming. Do the sexy safety dance. Do whatever dance you feel like. Do they have new dances in Wyoming, or are young people in Laramie square dancing in the club? I dunno. If you gotta do the do-si-do, make it the most lit do-si-do of all time."}, {"c0c1": "Best Punt and Punt Return"}, {"8a18": "Sometimes it’s not what you do with the ball. It’s what you do while voluntarily kicking the ball to your opponent."}, {"f677": "Dante Pettis (AP Images)"}, {"18d1": "The no. 4 Washington Huskies have mushed over the rest of the Pac-12 this season and rode undefeated into a game against 17th-ranked Utah on Saturday. A lot of Washington’s success has been due to the play of quarterback Jake Browning, its steady-armed stud under center. He wasn’t at his best in this one — tying a season low of two touchdown passes while tossing his third interception of the year — but he did make a pivotal play in the Huskies’ 31–24 win."}, {"5f44": "With the game tied at 24 and 5:09 remaining in the fourth quarter, Washington faced a fourth-and-8 from the opposing 41-yard line. What do you do? Go for the long eight? Kick a 58-yard field goal? PUNT??!?!?!?!?!!?!?!?!?!?!?!?!"}, {"fbdc": "The Huskies acted like they’d go with the first option, sending the offense onto the field, but Browning pooched the ball. And it was beautiful! It bounded down to the Utah 1-yard line."}, {"54fb": "Did Browning’s punt win Washington the game? No, it was a punt. You can’t win on punts."}, {"77f5": "But the punt put the Utes in a situation where they had to be conservative. They ran three straight ineffective plays, and their drive went only 2 yards. That meant they had to punt from the back of their own end zone, on a shorter snap than a punt would typically require. That meant they had to use extra blockers to prevent a disastrous block, and that meant they had nobody to cover the punt when it traveled really far."}, {"33d9": "It also meant that Washington’s Dante Pettis had plenty of room to return the punt 58 yards for a game-winning touchdown."}, {"4cfb": "Sometimes, punting can be winning."}, {"e3aa": "Best Comedy"}, {"348f": "Until Saturday, I thought Notre Dame was a bad football team. But I realized I’ve been underestimating the Fighting Irish. They’re not bad at football. They’re great at comedy."}, {"35bb": "They’ve got all the elements for a slapstick success: a coach whose face turns bright purple when he’s upset; thousands of haughty fans who act stunned by the slightest hint of failure, leading to hilarious reactions as shovelfuls of failure are heaped upon them week after week; and most importantly, a team that’s willing to commit to the bit. The Irish raced out to a 20–0 lead on Miami in Week 9. Then they blew it, and this muffed punt gave the Hurricanes a 27–20 lead."}, {"5f3c": "Why did punt returner C. J. Sanders think it was a good idea to try to grab a wobbly bouncing ball four yards from his end zone? Comedy, that’s why."}, {"2a07": "But Notre Dame used a 41-yard Josh Adams touchdown to tie things up in the fourth quarter, and shortly after had the ball on the goal line with under two minutes to go. It seemed like nothing could go wrong for the Irish: Either they’d score a go-ahead touchdown, or run down the clock until they could kick a go-ahead field goal."}, {"6d85": "But comedy is about surprise when you least expect it. So tight end Durham Smythe dove toward the end zone, allowing Miami to pop the ball loose and recover."}, {"fed1": "Why did a tight end think it was a good idea to stretch for the goal line, considering a likely first-and-goal at the 1 with under two minutes remaining would have been a great situation? Look, comedies don’t always make sense. Just laugh, okay?"}, {"0409": "Notre Dame won, 30–27. But here’s the punchline: It’s still only 3–5."}, {"3ea7": "Biggest Heisman Moment"}, {"8a86": "Fifth-ranked Louisville had a close call against Virginia, as the Cardinals trailed the Cavaliers 25–24 in the game’s final two minutes. But Heisman Trophy favorite Lamar Jackson came to save the day with this absolutely gorgeous 29-yard touchdown pass to Jaylen Smith:"}, {"0726": "Jackson has had one of the most magnificent seasons a quarterback can muster. He’s been brilliant with his arm, he’s been brilliant as a runner. He’s been great against great teams, he’s been great against good teams, and he’s been great against bad teams. Most weeks, Jackson’s contributed a bushel of touchdowns to give his team a comfortable lead in the closing seconds. I mean, Louisville beat Florida State by 43."}, {"ea67": "Not Saturday. Against Virginia — which not only lost to FCS Richmond in the 2016 opener, but lost by 17 points to FCS Richmond — Jackson and the Cardinals struggled. They only managed seven points in the first half, their lowest output of the year, and Jackson didn’t score a rushing touchdown for the first time all season in the 32–25 win."}, {"31f0": "But this was his Heisman Moment. He showed that he is Clutch, and a Leader, and that he has Grit — and that’s much more important than anything else. Being talented enough to beat a preseason title contender by 40 is good, but being a Clutch Leader against one of the ACC’s worst teams is somehow better."}, {"9f16": "Most Disrespectful Moment"}, {"610d": "Back in September, Kansas won its first game of the season. The Jayhawks finished 0–12 last year, so it was cause for celebration, and the students stormed the field."}, {"a677": "They have not won since. Let’s check in on the team Kansas beat, FCS Rhode Island."}, {"3f35": "JESUS. Unlike Kansas, James Madison’s fans did not storm the field."}, {"8a58": "This game was about as big a mismatch as hypothetically possible. The Rams came into Saturday with only one win on the season, against Brown — an Ivy League team that can’t offer its players scholarships. Meanwhile, James Madison had only one loss, against a pretty good FBS team, North Carolina. The quarterbacks’ stat lines told the story of the afternoon: JMU’s Bryan Schor went 21-of-22 for 309 yards with five touchdowns; Rhode Island’s Jordan Vazzano went 4-of-25 for 12 yards with five interceptions, two of which were returned for touchdowns."}, {"8832": "But whatever, those are just blowout numbers. Alarming, monstrous, blowout numbers, but blowout numbers nonetheless."}, {"1be5": "Here’s what was disrespectful: Up 84–7 with more than nine minutes left in the fourth quarter, James Madison drove the ball to the Rhode Island 2-yard line. The Dukes probably could have scored a 13th touchdown to extend their lead to 91–7, but instead they opted to kneel four times, intentionally taking a turnover on downs rather than trying to get into the end zone."}, {"503d": "Someone tweeted at me that James Madison running back Trai Sharp could have scored a touchdown on his 23-yard carry with 9:33 remaining in regulation, but intentionally slid at the 2-yard line. I know what you’re thinking: Isn’t it nice that the Dukes chose to call off the dogs with the result well in hand?"}, {"f2e1": "Sure, sure, sure, quite sportsmanlike. People looking at the box score will see that James Madison scored only 84 points and not 90, which is a very rare amount of points for a college football team to score. As such, somebody looking at the box score might think that Rhode Island is just a regular amount of awful, not an earth-scorching amount of awful that causes crops to wilt and livestock to die."}, {"0389": "But to people watching the game? They knew. They saw that James Madison made it clear it could score 90, and probably 100, but then yelled “HEY, I KNOW THAT I COULD TOTALLY SCORE RIGHT NOW, BUT I’M NOT GOING TO, BECAUSE YOU’RE SO BAD AT FOOTBALL THAT YOU CAN’T STOP ME FROM SCORING YOURSELF.” There’s a difference between not running up the score and making a show of not scoring."}, {"c621": "If you did this to my team, I’d fight you. I would admit my complete inability to beat you in football, and therefore I would fight you."}, {"ef76": "This is football. Let me try to stop you. I don’t need your mercy."}, {"17bf": "Weirdest Play"}, {"f34c": "We’re going to look at some NCAA Division III football here, specifically a game between the Belhaven Blazers and Hardin-Simmons Cowboys in Jackson, Mississippi. This is just ridiculous nonsense:"}, {"657c": "On a fourth-down play, Belhaven quarterback Hunter McEachern threw a backward pass to fellow QB Clayton Webb, who was supposed to then throw a forward pass. But all of his receivers’ routes were covered, so instead of passing, Webb decided to punt. His punt was pretty awful, barely reaching the first-down sticks, but it bounced off a Hardin-Simmons player and was recovered by Belhaven."}, {"490e": "Plays like this are why football is beautiful: Every part of it went poorly. The design was bad and the execution was worse, and yet it resulted in a massive success."}, {"a81b": "The 1–7 Blazers are coached by Hal Mumme, who is famous in football circles for innovating a lot of the Air Raid offense. As tactically brilliant as Mumme is, even he knows he didn’t draw the play up this way. Mumme hasn’t really succeeded as a head coach anywhere, although he did win at least six games in two seasons at Kentucky, which is as good as winning a national title elsewhere. That’s the standard at Belhaven, too — the Blazers are now 5–24 in three seasons under Mumme, and lost this game, 55–21. At least something went right."}, {"f1f7": "Best Callback Joke"}, {"ee76": "When Jackson threw the game-winning touchdown for Louisville, two Virginia fans did this:"}, {"5778": "It mirrored the sadness of a Virginia fan from last season, when the Hoos lost to Notre Dame on a last-second touchdown pass:"}, {"7ff1": "Perhaps the front row of Scott Stadium is just very conducive to this exact expression of despair, but it seems so convoluted: I’ve been let down by sports millions of times — I’m a Northwestern fan — and I have never slumped my entire upper body and drooped my arms in utter sadness."}, {"0e52": "I like to think these Virginia fans were paying homage. They saw their team lose in tragic fashion, remembered the grief of previous Sad UVA Guy, and knew it was the only way they could properly mourn. I like the idea that Virginia fans go to the games and think: “We’re in the front row. If the Hoos find a devastating way to lose, we gotta do the slump.”"}, {"e9d6": "Almost Best Callback Joke (Almost)"}, {"d801": "This one requires some backstory. Last year, Utah hosted ESPN’s College GameDay and one fan used the opportunity to call former Cal star Marshawn Lynch dumb on a sign. Unfortunately, that sign featured a grammatical error. It was a tremendous failure, the equivalent of telling somebody he’s a bad driver by rolling down your window, sticking your entire upper body out, and yelling at him as your car veers into a ravine. It put a face to the millions of people who write “YOUR A DUMBASS” in online forums."}, {"20fb": "This year, Utah tried to atone for its sign sins:"}, {"fa52": "This is a great sign — self-deprecating, clever, and canonical. Good job, Utes! Unfortunately, it still includes a mistake. This sign is not better than “last year.” It is better than the sign from last year. It should say, “This sign is much better than last year’s!”"}, {"87ac": "If I’m a school hosting GameDay, I’m having an English professor stand at the set entrance to make sure that all the students’ signs are grammatically correct. Can’t be looking bad on national TV."}, {"ae9c": "Worst Callback Joke"}, {"5928": "Last October, Michigan lost to Michigan State on a dropped punt snap that the Spartans returned for a touchdown as the game clock expired. It was a big deal."}, {"096a": "So this year, Michigan State fans came ready to mock their in-state rivals for that memorable finish:"}, {"e822": "Unfortunately, Michigan didn’t punt a lot. The Wolverines scored on their first four drives, had the first half end during their fifth, threw a pick on their sixth, and kicked a field goal on their seventh. Michigan didn’t punt for the first 51 minutes of Saturday’s game."}, {"348c": "Then, with nine minutes left and Michigan winning 30–10, the Wolverines were forced to punt. Spartans fans got to unleash their chant. It kind of backfired. Michigan won, 32–23."}, {"ded7": "Worst Math"}, {"1dd8": "With Michigan State trailing Michigan 30–10 early in the fourth quarter, Spartans head coach Mark Dantonio asked his team to attempt a 34-yard field goal. Kicker Michael Geiger missed it. Dantonio later offered this explanation:"}, {"4067": "If Geiger would have connected, that field goal would have taken a three-possession game and made it a three-possession game. He missed, though, so the contest remained a three-possession game."}, {"3dbe": "Just last week, Iowa’s Kirk Ferentz referred to trailing by eight points as a two-score deficit. Someone should gather the 14 schools in the Big Ten to figure out why the league’s coaches are so confused by numbers."}, {"208b": "Dantonio’s decision wasn’t so bad: The field goal attempt was on fourth-and-goal from the 17-yard line, meaning the Spartans would’ve needed to pick up 17 yards or get zero points. But the math was awful. And, well, last week, Dantonio ran a fake field goal 28 yards from the end zone with one second remaining in the first half, passing up a good chance at three points for virtually zero chance at seven points. Sometimes, Dantonio bets the house; other times, he lets the house collapse around him."}, {"12e9": "Worst Swag"}, {"c0df": "For the past few years, Illinois has worn “Gray Ghost” uniforms on homecoming, a nod to one of the best players in program history, Red Grange. In 1924, Grange stunned defending champion Michigan with a six-touchdown homecoming performance, dealing the Wolverines their first loss in two years and prompting legendary sportswriter The Ringer — errr, sorry — Grantland Rice to describe him as “a streak of fire … a gray ghost thrown into the game.” The uniforms are a really cool way to honor a moment that time might have otherwise forgotten."}, {"92da": "Unfortunately, they’re trash:"}, {"cd61": "I get it “gray,” as in “gray ghost,” but it seems more like Illinois is honoring the last time its football program was successful by making the team look like it’s on black-and-white TV. Maybe go red for Red Grange next time?"}, {"ca23": "Best ‘College GameDay’ Sign"}, {"f099": "You know what? So do I."}], "content": "Saturday Superlatives: The Weird and Wonderful From College Football Week 9 Clemson outlasts Florida State, the Big 12’s Playoff hopes disappear, Jake Browning has a Heisman-worthy punt, and more madness College football is glorious, but with 120-plus teams, it’s also impossible to fully track. So throughout the day, we’ll be celebrating the weird and wonderful moments that this silly sport has to offer. Come hang with us, and bring some khakis for our Jim Harbaugh Halloween costumes. Most Important Result During Saturday night’s broadcast of Clemson-Florida State, ABC reminded viewers several times that the winner of this game has gone on to win the ACC Good Division for the last seven years, and that the Good Division remains the superior division in the conference. (I know these divisions have names, but I find it easier to call them “Good” and “Bad” instead of figuring out which teams are in the Coastal and Atlantic.) But this year’s matchup took on extra importance, as Louisville is still in the mix, longing for a shot at the ACC title. Deshaun Watson (Getty Images) The undefeated Tigers stayed undefeated, though, beating FSU in a 37–34 free-for-all that experienced three lead changes in the final 5:25. The Seminoles seemed primed to end the game with a fourth, but their offensive line must’ve gotten flipped by Clemson counterintelligence, as the group did everything in its power to help the Tigers on the final drive. Florida State’s offensive linemen got called for two false starts and one holding penalty, plus allowed sacks to Clemson’s Christian Wilkins, Dexter Lawrence, and Ben Boulware on the Seminoles’ last plays. Combine the penalties and the sacks, and the unit accounted for –43 yards on a drive that was supposed to go forward. It’s a bit early to begin booking College Football Playoff bids, but Clemson’s toughest work is done. Its remaining schedule is … light. The Tigers have navigated past Lamar Jackson and Dalvin Cook, and they have Syracuse, Pittsburgh, Wake Forest, and South Carolina remaining in the regular season. None of those teams has a losing record! But it’s ’Cuse, Pitt, Wake, and South Carolina. And then Clemson should play the leader of the Bad Division, which has no teams ranked in the top 20 at the moment. We like college football because random explosions happen, and there were plenty of them this Saturday, as four undefeated teams lost on the road to unranked opponents. But for the past two years, Clemson has been better than anybody at dodging stray blasts. Do that for five more games, and it’ll be back in the playoff. B1Ggest Result Why skydive? Why BASE jump? Why swim in a cage with sharks? For some, the nearness to death provides a high that nothing else can. If you watch Wisconsin football, you’ll understand, although the Badgers’ preferred near-death experience isn’t jumping out of a plane: It’s eating a preposterous amount of cheese and seeing if it causes a heart attack during a tightly contested fourth quarter. The Badgers have played eight games now; six have been decided by one possession. There are rarely many points. There is just the creeping sense of doom, for everyone involved. Wisconsin played basically the same game this fall against LSU, Michigan, Ohio State, and Georgia State — four programs that we have always lumped together. On Saturday, the Badgers hosted seventh-ranked Nebraska, the last remaining unbeaten team in the Big Ten West. Cornhuskers quarterback Tommy Armstrong had his worst outing of the season, finishing 12-of-31 for 153 yards with two interceptions. Wisconsin’s QBs, Alex Hornibrook and Bart Houston, continued to split playing time and fare poorly. NO MATTER. This game went to overtime, and the Badgers won, 23–17. Somebody will win the Big Ten West. It might be Nebraska. It probably should be Western Michigan, but sadly, the Broncos are in the MAC and are ineligible. It might be Wisconsin, which is now 6–2. But the Badgers will make you doubt it every game — and they’ll still win a whole bunch of them. Worst Day for a Conference Quincy Vasser (AP Images) The Big 12 entered Saturday with two unbeaten teams, West Virginia and Baylor. I really liked West Virginia. With head coach Dana Holgorsen’s freewheeling offense and a surprisingly good defense, the Mountaineers had steadily climbed in the rankings, cracking the top 10 in the AP poll this week. Over their past two games, they crushed Texas Tech and TCU. But the Mountaineers’ dreams of an undefeated season died Saturday in Stillwater, as they lost 37–20 to Oklahoma State. I did not really like Baylor. In past seasons, they’d been a fun team to root for, a college football outsider suddenly running up the score on the big boys. But with each week, we seem to learn new details about how the school and former coach Art Briles handled sexual assault allegations against football players. Each win became abhorrent. Of course, most people at Baylor were not responsible for these failings. But there were some people who made the conscious decision to value football success over the safety of women on campus, and I imagine in their warped worlds, the team’s record validated their disgusting decision-making. Baylor fell this weekend, too, losing at Texas, 35–34. It would be hard to explain to somebody 10 years ago our surprise at scrappy underdog Texas pulling an upset over mighty Baylor, but, yeah, that’s what happened. I’m glad Baylor lost, and I’m sure the people who would’ve had to vote an undefeated Baylor into the College Football Playoff are glad Baylor lost, too. By the time the sun set on Big 12 country, the league was out of undefeated teams. Oklahoma is now in the driver’s seat for the conference title, but the Sooners have already lost to Houston and Ohio State. I’m sure there is some scenario in which the Big 12 gets a team into the playoff, but it would require a cataclysm in other leagues. Sexiest Dance [Grabs largest megaphone I can find] [Grabs obnoxiously loud air horn] GAME-WINNING SAFETY ALERT Y’ALLLLLLLLLLLL Wyoming beat 13th-ranked Boise State 30–28 on Saturday after recording a safety in the final two minutes, and Cowboys defensive end Josiah Hall let loose one of the finest safety dances ever performed (non–Men Without Hats category). The win had some national implications. The Broncos were previously undefeated and seemed ready to roll through the Mountain West and claim the New Year’s Six bowl spot reserved for a non-power-conference team. With a loss to Boise’s name, another set of Broncos takes over, as 8–0 Western Michigan assumes pole position for that spot. But forget about that, and let’s focus on the happy night in Wyoming. This is a really hard place to win. There aren’t many elite football recruits in Wyoming — there aren’t many people in Wyoming — so Cowboys coaches have to convince talented young athletes to come live in the mountains, away from the people, things, and lifestyles that they love. Yet Craig Bohl, who built North Dakota State into an FCS powerhouse from 2003–13, seems to be finding success. Wyoming is now 6–2, and this was its first win over a ranked opponent since 2002. So dance, Wyoming. Do the sexy safety dance. Do whatever dance you feel like. Do they have new dances in Wyoming, or are young people in Laramie square dancing in the club? I dunno. If you gotta do the do-si-do, make it the most lit do-si-do of all time. Best Punt and Punt Return Sometimes it’s not what you do with the ball. It’s what you do while voluntarily kicking the ball to your opponent. Dante Pettis (AP Images) The no. 4 Washington Huskies have mushed over the rest of the Pac-12 this season and rode undefeated into a game against 17th-ranked Utah on Saturday. A lot of Washington’s success has been due to the play of quarterback Jake Browning, its steady-armed stud under center. He wasn’t at his best in this one — tying a season low of two touchdown passes while tossing his third interception of the year — but he did make a pivotal play in the Huskies’ 31–24 win. With the game tied at 24 and 5:09 remaining in the fourth quarter, Washington faced a fourth-and-8 from the opposing 41-yard line. What do you do? Go for the long eight? Kick a 58-yard field goal? PUNT??!?!?!?!?!!?!?!?!?!?!?!?! The Huskies acted like they’d go with the first option, sending the offense onto the field, but Browning pooched the ball. And it was beautiful! It bounded down to the Utah 1-yard line. Did Browning’s punt win Washington the game? No, it was a punt. You can’t win on punts. But the punt put the Utes in a situation where they had to be conservative. They ran three straight ineffective plays, and their drive went only 2 yards. That meant they had to punt from the back of their own end zone, on a shorter snap than a punt would typically require. That meant they had to use extra blockers to prevent a disastrous block, and that meant they had nobody to cover the punt when it traveled really far. It also meant that Washington’s Dante Pettis had plenty of room to return the punt 58 yards for a game-winning touchdown. Sometimes, punting can be winning. Best Comedy Until Saturday, I thought Notre Dame was a bad football team. But I realized I’ve been underestimating the Fighting Irish. They’re not bad at football. They’re great at comedy. They’ve got all the elements for a slapstick success: a coach whose face turns bright purple when he’s upset; thousands of haughty fans who act stunned by the slightest hint of failure, leading to hilarious reactions as shovelfuls of failure are heaped upon them week after week; and most importantly, a team that’s willing to commit to the bit. The Irish raced out to a 20–0 lead on Miami in Week 9. Then they blew it, and this muffed punt gave the Hurricanes a 27–20 lead. Why did punt returner C. J. Sanders think it was a good idea to try to grab a wobbly bouncing ball four yards from his end zone? Comedy, that’s why. But Notre Dame used a 41-yard Josh Adams touchdown to tie things up in the fourth quarter, and shortly after had the ball on the goal line with under two minutes to go. It seemed like nothing could go wrong for the Irish: Either they’d score a go-ahead touchdown, or run down the clock until they could kick a go-ahead field goal. But comedy is about surprise when you least expect it. So tight end Durham Smythe dove toward the end zone, allowing Miami to pop the ball loose and recover. Why did a tight end think it was a good idea to stretch for the goal line, considering a likely first-and-goal at the 1 with under two minutes remaining would have been a great situation? Look, comedies don’t always make sense. Just laugh, okay? Notre Dame won, 30–27. But here’s the punchline: It’s still only 3–5. Biggest Heisman Moment Fifth-ranked Louisville had a close call against Virginia, as the Cardinals trailed the Cavaliers 25–24 in the game’s final two minutes. But Heisman Trophy favorite Lamar Jackson came to save the day with this absolutely gorgeous 29-yard touchdown pass to Jaylen Smith: Jackson has had one of the most magnificent seasons a quarterback can muster. He’s been brilliant with his arm, he’s been brilliant as a runner. He’s been great against great teams, he’s been great against good teams, and he’s been great against bad teams. Most weeks, Jackson’s contributed a bushel of touchdowns to give his team a comfortable lead in the closing seconds. I mean, Louisville beat Florida State by 43. Not Saturday. Against Virginia — which not only lost to FCS Richmond in the 2016 opener, but lost by 17 points to FCS Richmond — Jackson and the Cardinals struggled. They only managed seven points in the first half, their lowest output of the year, and Jackson didn’t score a rushing touchdown for the first time all season in the 32–25 win. But this was his Heisman Moment. He showed that he is Clutch, and a Leader, and that he has Grit — and that’s much more important than anything else. Being talented enough to beat a preseason title contender by 40 is good, but being a Clutch Leader against one of the ACC’s worst teams is somehow better. Most Disrespectful Moment Back in September, Kansas won its first game of the season. The Jayhawks finished 0–12 last year, so it was cause for celebration, and the students stormed the field. They have not won since. Let’s check in on the team Kansas beat, FCS Rhode Island. JESUS. Unlike Kansas, James Madison’s fans did not storm the field. This game was about as big a mismatch as hypothetically possible. The Rams came into Saturday with only one win on the season, against Brown — an Ivy League team that can’t offer its players scholarships. Meanwhile, James Madison had only one loss, against a pretty good FBS team, North Carolina. The quarterbacks’ stat lines told the story of the afternoon: JMU’s Bryan Schor went 21-of-22 for 309 yards with five touchdowns; Rhode Island’s Jordan Vazzano went 4-of-25 for 12 yards with five interceptions, two of which were returned for touchdowns. But whatever, those are just blowout numbers. Alarming, monstrous, blowout numbers, but blowout numbers nonetheless. Here’s what was disrespectful: Up 84–7 with more than nine minutes left in the fourth quarter, James Madison drove the ball to the Rhode Island 2-yard line. The Dukes probably could have scored a 13th touchdown to extend their lead to 91–7, but instead they opted to kneel four times, intentionally taking a turnover on downs rather than trying to get into the end zone. Someone tweeted at me that James Madison running back Trai Sharp could have scored a touchdown on his 23-yard carry with 9:33 remaining in regulation, but intentionally slid at the 2-yard line. I know what you’re thinking: Isn’t it nice that the Dukes chose to call off the dogs with the result well in hand? Sure, sure, sure, quite sportsmanlike. People looking at the box score will see that James Madison scored only 84 points and not 90, which is a very rare amount of points for a college football team to score. As such, somebody looking at the box score might think that Rhode Island is just a regular amount of awful, not an earth-scorching amount of awful that causes crops to wilt and livestock to die. But to people watching the game? They knew. They saw that James Madison made it clear it could score 90, and probably 100, but then yelled “HEY, I KNOW THAT I COULD TOTALLY SCORE RIGHT NOW, BUT I’M NOT GOING TO, BECAUSE YOU’RE SO BAD AT FOOTBALL THAT YOU CAN’T STOP ME FROM SCORING YOURSELF.” There’s a difference between not running up the score and making a show of not scoring. If you did this to my team, I’d fight you. I would admit my complete inability to beat you in football, and therefore I would fight you. This is football. Let me try to stop you. I don’t need your mercy. Weirdest Play We’re going to look at some NCAA Division III football here, specifically a game between the Belhaven Blazers and Hardin-Simmons Cowboys in Jackson, Mississippi. This is just ridiculous nonsense: On a fourth-down play, Belhaven quarterback Hunter McEachern threw a backward pass to fellow QB Clayton Webb, who was supposed to then throw a forward pass. But all of his receivers’ routes were covered, so instead of passing, Webb decided to punt. His punt was pretty awful, barely reaching the first-down sticks, but it bounced off a Hardin-Simmons player and was recovered by Belhaven. Plays like this are why football is beautiful: Every part of it went poorly. The design was bad and the execution was worse, and yet it resulted in a massive success. The 1–7 Blazers are coached by Hal Mumme, who is famous in football circles for innovating a lot of the Air Raid offense. As tactically brilliant as Mumme is, even he knows he didn’t draw the play up this way. Mumme hasn’t really succeeded as a head coach anywhere, although he did win at least six games in two seasons at Kentucky, which is as good as winning a national title elsewhere. That’s the standard at Belhaven, too — the Blazers are now 5–24 in three seasons under Mumme, and lost this game, 55–21. At least something went right. Best Callback Joke When Jackson threw the game-winning touchdown for Louisville, two Virginia fans did this: It mirrored the sadness of a Virginia fan from last season, when the Hoos lost to Notre Dame on a last-second touchdown pass: Perhaps the front row of Scott Stadium is just very conducive to this exact expression of despair, but it seems so convoluted: I’ve been let down by sports millions of times — I’m a Northwestern fan — and I have never slumped my entire upper body and drooped my arms in utter sadness. I like to think these Virginia fans were paying homage. They saw their team lose in tragic fashion, remembered the grief of previous Sad UVA Guy, and knew it was the only way they could properly mourn. I like the idea that Virginia fans go to the games and think: “We’re in the front row. If the Hoos find a devastating way to lose, we gotta do the slump.” Almost Best Callback Joke (Almost) This one requires some backstory. Last year, Utah hosted ESPN’s College GameDay and one fan used the opportunity to call former Cal star Marshawn Lynch dumb on a sign. Unfortunately, that sign featured a grammatical error. It was a tremendous failure, the equivalent of telling somebody he’s a bad driver by rolling down your window, sticking your entire upper body out, and yelling at him as your car veers into a ravine. It put a face to the millions of people who write “YOUR A DUMBASS” in online forums. This year, Utah tried to atone for its sign sins: This is a great sign — self-deprecating, clever, and canonical. Good job, Utes! Unfortunately, it still includes a mistake. This sign is not better than “last year.” It is better than the sign from last year. It should say, “This sign is much better than last year’s!” If I’m a school hosting GameDay, I’m having an English professor stand at the set entrance to make sure that all the students’ signs are grammatically correct. Can’t be looking bad on national TV. Worst Callback Joke Last October, Michigan lost to Michigan State on a dropped punt snap that the Spartans returned for a touchdown as the game clock expired. It was a big deal. So this year, Michigan State fans came ready to mock their in-state rivals for that memorable finish: Unfortunately, Michigan didn’t punt a lot. The Wolverines scored on their first four drives, had the first half end during their fifth, threw a pick on their sixth, and kicked a field goal on their seventh. Michigan didn’t punt for the first 51 minutes of Saturday’s game. Then, with nine minutes left and Michigan winning 30–10, the Wolverines were forced to punt. Spartans fans got to unleash their chant. It kind of backfired. Michigan won, 32–23. Worst Math With Michigan State trailing Michigan 30–10 early in the fourth quarter, Spartans head coach Mark Dantonio asked his team to attempt a 34-yard field goal. Kicker Michael Geiger missed it. Dantonio later offered this explanation: If Geiger would have connected, that field goal would have taken a three-possession game and made it a three-possession game. He missed, though, so the contest remained a three-possession game. Just last week, Iowa’s Kirk Ferentz referred to trailing by eight points as a two-score deficit. Someone should gather the 14 schools in the Big Ten to figure out why the league’s coaches are so confused by numbers. Dantonio’s decision wasn’t so bad: The field goal attempt was on fourth-and-goal from the 17-yard line, meaning the Spartans would’ve needed to pick up 17 yards or get zero points. But the math was awful. And, well, last week, Dantonio ran a fake field goal 28 yards from the end zone with one second remaining in the first half, passing up a good chance at three points for virtually zero chance at seven points. Sometimes, Dantonio bets the house; other times, he lets the house collapse around him. Worst Swag For the past few years, Illinois has worn “Gray Ghost” uniforms on homecoming, a nod to one of the best players in program history, Red Grange. In 1924, Grange stunned defending champion Michigan with a six-touchdown homecoming performance, dealing the Wolverines their first loss in two years and prompting legendary sportswriter The Ringer — errr, sorry — Grantland Rice to describe him as “a streak of fire … a gray ghost thrown into the game.” The uniforms are a really cool way to honor a moment that time might have otherwise forgotten. Unfortunately, they’re trash: I get it “gray,” as in “gray ghost,” but it seems more like Illinois is honoring the last time its football program was successful by making the team look like it’s on black-and-white TV. Maybe go red for Red Grange next time? Best ‘College GameDay’ Sign You know what? So do I. ", "child": "2008_1\t2008_2\t2008_3\t2008_4"}