{"name": "2009", "parent": "", "title": "Saturday Superlatives: The Weird and Wonderful From College Football Week 8", "sentences": [{"af89": "Saturday Superlatives: The Weird and Wonderful From College Football Week 8"}, {"385c": "Penn State shocks Ohio State, Oklahoma and Texas Tech set the record books on fire, Alabama keeps on being Alabama, and more madness"}, {"c0fb": "College football is glorious, but with 120-plus teams, it’s also impossible to fully track. So throughout the day, we’ll be celebrating the weird and wonderful moments that this silly sport has to offer. Grab an oatmeal creme pie and hang with us, won’t you?"}, {"0f5e": "Most Meaningful Result"}, {"2135": "College football crowds learned how to wear identically colored shirts some time ago, but it still feels different when Penn State does it. The Happy Valley White Out was on this week, and the crowd was so loud that players seemingly couldn’t hear whistles blowing plays dead. Fans had reason to cheer: The hometown Nittany Lions handed the visiting Ohio State Buckeyes, ranked second nationally and in the thick of the national championship race, their first loss on the year, 24–21."}, {"06e9": "The Buckeyes got ahead early, but crumpled after taking a 21–7 lead, ultimately dooming themselves by allowing 10 points off of special teams screwery: On back-to-back fourth-quarter drives, Penn State blocked a punt and a field goal. The first gave the Nittany Lions the ball in field goal range, while the second was returned for a touchdown that wound up being the game winner."}, {"f450": "Ohio State had a chance to drive for a win, but the Buckeyes offense proved capable of little more than checkdowns."}, {"9fb4": "To this point in the season, we seemed destined for an Ohio State–Michigan matchup of infinite importance. I mean, if you ask their fans, EVERY Ohio State–Michigan game is of infinite importance, but this year the two teams actually appeared destined to face off as undefeateds for the right to play in the Big Ten championship game."}, {"3672": "The Game can still have College Football Playoff implications, though, as long as Urban Meyer’s club avoids another stumble. As this upset should remind us, the Wolverines could also lose. But if they don’t, and if both teams win all of their contests between now and November 26, the Buckeyes could topple Michigan and make the conference title game thanks to the head-to-head tiebreaker. And if the Bucks win that game, they’d be 12–1 and a shoo-in for the playoff. After all, Ohio State has lost a weird game and gone on to make and win the playoff before. You might not remember — it was a whole two seasons ago."}, {"fed7": "But after needing overtime to survive Wisconsin in Week 7 and failing to even get that far against Penn State, I wonder if that’s reasonable to expect."}, {"a549": "The passing game was inefficient, with J.T. Barrett netting only 5.7 yards per attempt. The hypertalented receivers couldn’t get open, and the recently studly offensive line couldn’t keep Barrett safe for more than a few seconds, even when Penn State wasn’t blitzing. There was a 74-yard run by Curtis Samuel, but the receiver/RB hybrid got only two carries. Meanwhile, primary back Mike Weber managed just 71 yards on 21 carries."}, {"fb9a": "In an Ohio State fan’s dream world, this was all caused by the white shirts, and the Buckeyes will snap back to being a juggernaut next week. But the problems in Columbus seem to go beyond attire at this point."}, {"13cb": "Least Surprising Thing"}, {"f65c": "Texas A&M–Alabama was THE BIGGEST GAME OF THE DAY: When the undefeated and top-ranked team in the country hosts the undefeated and sixth-ranked team in the country, we pay attention."}, {"e633": "But it was also a blowout, and that seemed normal: The Crimson Tide were 18-point favorites, and ended up winning by 19. Defensive end Jonathan Allen returned a fumble for a touchdown, meaning Alabama has now scored as many touchdowns on defense and special teams combined (12) as it has allowed overall."}, {"944b": "Oh, Allen also did this:"}, {"646d": "AHHHH THAT’S NOT A PERSON THAT’S A TORPEDO. TORPEDOES SHOULDN’T BE ALLOWED TO PLAY FOOTBALL."}, {"1602": "Texas A&M is good! The Aggies entered Saturday 6–0, with three wins over ranked teams and another win over Auburn, which wasn’t ranked when the two played, but is now. That’s good!!!!"}, {"4d3d": "But the Aggies really didn’t look like they belonged on the same field as Alabama. They briefly took a 14–13 lead in the third quarter, but then Bama decided it was time for carnage."}, {"22ef": "The Tide have now played five games against ranked teams, and have won those games by an average of 25.6 points. We’re used to Nick Saban’s squad beating a lot of good teams, but this year Alabama is yawning while crushing the opposition."}, {"7ece": "I’m sure a lot of the buildings that Godzilla destroyed in Tokyo were very nicely built, capable of resisting massive earthquakes and what not. But Godzilla was too busy demolishing them to notice."}, {"4e22": "College Football’s Best Defender Is a PoetTexas A&M star Myles Garrett is so much more than a pass rushertheringer.com"}, {"5f0a": "Most Stuff, Overall"}, {"340e": "Football video games in 2016 are amazing, but sometimes they’re too demanding. I don’t always want to have to think. Sometimes I’m just trying to have fun, and a game forces me to read the defensive end and figure out whether the opposition is lined up in Cover 3. That’s too much work. Sometimes I just want to put up dozens of touchdowns against a virtual opponent, and that’s when I bust out my PS2 and pop in an old classic, Oklahoma vs. Texas Tech."}, {"c6d5": "The Sooners and Red Raiders each put up 854 yards on Saturday night, combining for an NCAA record 1,708 total. That’s 5,124 feet of offense, or .9705 miles. The two teams combined for 17 touchdowns and four punts."}, {"3d49": "Texas Tech’s Patrick Mahomes tied an NCAA record with 734 yards passing. He also led his team in rushing with 85 yards and two touchdowns. It’s one of the greatest statistical single-game performances of all time. Oh, by the way: His team LOST, 66–59. To clarify: This dude set the all-time record for total yards and also scored while running the ball AND IT WASN’T GOOD ENOUGH. Step your game up, Pat!"}, {"8cd4": "Patrick Mahomes Isn’t Another System QuarterbackKliff Kingsbury’s latest muse is a breakout startheringer.com"}, {"54d6": "Is there such a thing as too much offense? Is there a point at which the complete failure of two defenses to do anything meaningful actually ruins our ability to enjoy a game?"}, {"e4f7": "No, no there is not. Go for 900 yards next time, Pat."}, {"4dbc": "Best Performance by Lamar Jackson"}, {"5128": "Getty Images"}, {"2372": "The Louisville quarterback and Heisman Trophy front-runner deserves his own category. At this point, it’s unfair to put anybody else on his level."}, {"ba43": "Jackson obliterated NC State on Saturday, throwing for 304 yards and three touchdowns while running for a fourth in the Cardinals’ 44–0 win. NC State, by the way, is not a bad team, having forced overtime against Clemson last week."}, {"c415": "Ahh, wait: Those were his halftime stats, and that was Louisville’s halftime lead. This isn’t an attempt to cop out of writing about the second half. Remember: It’s not just that Alexander the Great conquered the entire known world; it’s that he did so by the time he was 32."}, {"113a": "The Heisman Race That Wasn’tWhy college football’s most touted backs failed to live up to the hypetheringer.com"}, {"8293": "Some people might be growing tired of hearing about Jackson’s eye-popping numbers. Why should we get excited about another large number of yards and large number of touchdowns after already fawning over his big days against Charlotte, Syracuse, Florida State, Marshall, Clemson, and Duke?"}, {"d310": "If that’s happening to you, I’d recommend actually watching Jackson. My breath still disappears every time I see him launching ludicrous lasers and whistling by would-be tacklers at warp speed."}, {"b2f3": "Best Performance, Non–Lamar Jackson Edition"}, {"d759": "Utah’s Joe Williams torched UCLA, putting up 332 yards and four touchdowns in a 52–45 Utes win. Remember when UCLA was ranked? Yeah, look at this:"}, {"c3f8": "Williams totaled the most rushing yards of any player this season, passing BYU’s Jamaal Williams in some quality Utahn usurpation. He also set the Utah school record and tallied the most rushing yards by any Pac-12 player since 2012."}, {"b89c": "That’s all incredible enough. But it’s even more impressive from Williams, who announced his retirement from football about a month ago, citing injuries and “a loss of desire.” He’d managed only 75 yards in the team’s first two games, and he’d lost two fumbles, and Kyle Whittingham yelled at him very prominently on camera. It seemed he didn’t feel it was worth it."}, {"c6d9": "But the Utes got really dinged up at running back — REALLY dinged up — and came calling for Williams. He ran for 179 yards and a TD last week, and this week, he set a dang school record. It seems safe to say that unretiring was a good idea."}, {"0ecd": "Who do you guys think is going to win the NBA’s MVP award this year? I see a lot of people picking LeBron or Steph, but after Williams’s Saturday, I’m convinced it’s going to be Kobe."}, {"c2f6": "Biggest Humiliation"}, {"748b": "LSU’s Leonard Fournette, who last played on September 24, returned from his ankle injury on Saturday. I’d say he’s healthy."}, {"5094": "Few running backs have brutalized defenders the way Fournette has. And this was one of his finest works."}, {"86d4": "The player Fournette nearly flipped is Deontay Anderson, a true freshman for Ole Miss whom ESPN ranked as the top safety in this past year’s recruiting class. Pretty good! Unfortunately, Fournette, who finished the night with 284 yards and three touchdowns on 16 carries, is one of the top-ranked anythings in the history of everything. College football generally pits players of the same age range and developmental status against each other. But that’s a man trucking a teenager."}, {"43cf": "Worst Week"}, {"e4de": "Ohio State’s loss might seem like the headliner, and in terms of potential playoff impacts, it is; but when it comes to sheer shock value, no. 11 Houston’s blowout 38–16 loss to SMU is actually the worst defeat any ranked team suffered in Week 8."}, {"5e1c": "To understand how big of an upset this was, consider that the Mustangs hadn’t beaten a top-15 opponent since 1986. That year, SMU was in its last throes as a powerhouse thanks to the strategy of openly buying elite players. In 1987, the NCAA hit the program with its now-infamous death penalty, and in the 30 years since, the Mustangs hadn’t bested a club of Houston’s caliber. Congrats to SMU on the win; hopefully it can get another one before 2046."}, {"188c": "Meanwhile, the loss capped a horrendous week for Houston. Just a few days ago, the Cougars had a pretty good chance of earning the Group of Five’s spot in the New Year’s Six bowl games. And more importantly, the program appeared to be on the verge of being announced as a new member of the Big 12, meaning that in future seasons, Tom Herman’s team wouldn’t even have to worry about the difficulties of being relevant in a little league. They’d be made."}, {"b6a9": "But the Big 12 decided not to expand. (Perhaps some Big 12 teams feared adding a very competitive team from the same state that produces the majority of Big 12 recruits.) And suddenly, Houston isn’t even favored to win the league it’s now forced to keep calling home. It really is all bad news: The Cougars’ second loss isn’t going to be damning enough to prevent Herman, their brilliant head coach, from getting poached at year’s end."}, {"6617": "In a week, Houston’s bright future turned into a mediocre present. Please don’t leave, Paul Wall — you’re all that’s left."}, {"9618": "Weakest Coaching Decision"}, {"3c93": "Iowa head coach Kirk Ferentz likely finds toasting bread exotic. Despite this — because of this? — the school recently gave him a massive contract extension that will pay him $4.5 million until 2026. The Hawkeyes did this even though it seems unlikely that a man who probably considers milk hard liquor was itching to leave a school he’s worked at since 1999."}, {"e404": "Against no. 10 Wisconsin on Saturday, Ferentz flexed his ironclad dedication to timidity. In the first quarter, an Iowa receiver was ruled inches short of the first-down marker at the Wisconsin 49. Ferentz INSTANTLY sent his punt team on the field instead of going for it on fourth down, seizing the opportunity to give his opponent the ball."}, {"dd3f": "But his masterpiece came with only five minutes to go. Down 14–6, the Hawkeyes faced a fourth-and-5 at the Wisconsin 20. In a one-possession game, his decision was clear-cut. Go for it! You need a touchdown! You don’t need a field goal! And kicking a field goal gives the opponent the ball with five minutes left!"}, {"2eca": "Ferentz called for a field goal. His kicker missed."}, {"6493": "When asked to explain his decision after the game, Ferentz gave an answer that seemingly implied he doesn’t know that two-point conversions exist."}, {"81de": "You’d think a man with such uncommon job security would feel confident taking risks. Instead, he’s recommitted to making decisions so cautious they actively hurt his football team."}, {"ee91": "Last year, when Iowa went to the Rose Bowl, many Hawkeyes fans claimed that they had witnessed the birth of a “New Kirk,” one who sometimes rolled the dice. Well, midnight has struck, and Ferentz has turned back into a frog whose mating call is the sound of a foot punting a football."}, {"fe89": "Iowans probably want to stop talking about Ferentz’s salary and extension. Don’t worry, guys: We’ll only make fun of it for another 10 years and two months."}, {"32ac": "Best Trick Play"}, {"84b3": "This touchdown for Virginia’s Evan Butts — BUTTS!"}, {"741a": "Butts is a tight end, but after some pre-snap movement, he ended up as the snapper on this play. He lateraled to Matt Johns, who serves as Virginia’s holder but used to be its starting QB. North Carolina’s defense promptly ignored Butts — BUTTS!!!! — and he waltzed into the end zone for the easiest touchdown throw of Johns’s career."}, {"3608": "So, two things here seem weird. First: the snap. Is that legal?"}, {"6dd5": "Yes: There’s no rule saying players have to snap the ball through their legs. In fact, the rulebook says “the snap need not be between the snapper’s legs.” But the snap has to be “a quick and continuous backwards motion.” Butts’s snap fits that description. The reason centers tend to snap the ball between their legs is not because it’s the only legal way, but because they need to be in position to block right after the snap. If Butts — BUTTS! — had been facing a pass rush here after a snap that turned his body perpendicular to the line, he would’ve been in trouble."}, {"368e": "Second: What about the fact that the ball is THROWN TO THE GUY WHO SNAPPED IT? What the hell?"}, {"94c7": "Well, that’s kosher too. It has to do with how the team is lined up:"}, {"bc35": "A team must have seven players on the line of scrimmage for a formation to be legal. Of these seven, the five in the middle are ineligible to catch a pass, and the two on the ends are eligible. In almost every scenario, the guy snapping the ball is one of the five ineligible, since teams normally surround the center with other offensive linemen."}, {"cbba": "Not here! Notice how the two players at the bottom of the screen are about 2 yards behind the line of scrimmage? Butts — BUTTS!!!!!!!! — is actually the rightmost player on the line of scrimmage, which means he’s allowed to catch a pass."}, {"7d10": "Unfortunately, it didn’t matter much, as the Hoos lost 35–14. But still, good play. Congrats to Butts."}, {"cb10": "Worst Trick Play"}, {"b52b": "It actually doesn’t look that bad on video, but I’ll explain why it’s problematic:"}, {"7117": "Michigan State attempted that fake with one second left in the first half. So there was no next play: Either kicker Michael Geiger runs 28 yards to the end zone, or Sparty gets zero points. Kickers are not very fast or good at running, and it is hard for non-kickers to run 28 yards on do-or-die plays. I’d say this was a bad idea."}, {"eddb": "The attempt was a 45-yarder, which is hard to hit. But a slim chance of getting three points is better than an all-but-0 percent chance of getting six points."}, {"a1f2": "Harshest Whuppin’"}, {"2a96": "Last year Arkansas beat Auburn in four overtimes, and that kind of defeat stings. This year’s game was a bit less competitive. The Tigers made some Razorback bacon, cutting and frying Arkansas in a 56–3 beatdown."}, {"0ce7": "Earlier in the year, Gus Malzahn struggled to pick a quarterback, rotating through somewhere between three and 11 options in the season-opening loss to Clemson. Malzahn himself could’ve played QB in Week 8, though, as Auburn ran for 543 yards, a school record in an SEC regular-season game. Meanwhile, Arkansas ran for 25 yards. Twenty-five is less than 543. [Writer’s note: Can we have copy desk check on this? I’m not great at math. Please delete this before we publish. Thanks.]"}, {"ccb8": "Auburn’s a pendulum. In 2013, the Tigers were picked to finish fifth in the SEC West in the media’s preseason poll. Instead, they made the national title game. Last year, that poll said they’d win the league. Instead, they finished last in the SEC West. This year they were picked sixth in the division. They just ground a pretty good Arkansas team into mush."}, {"59de": "They’d have to get past Alabama to make the SEC championship game, though. Maybe somebody should schedule a game between those two. Sometime in November sound good?"}, {"e2e5": "Most Harbaugh Moment"}, {"d280": "It’s gotta be this."}, {"3d8e": "It’s not the first time Harbaugh’s used this 10-man lineup, which he calls “trains” and I plan to continuing calling “The Wolverine Centipede.” But this time it led to a touchdown. The fact that he’s running something so weird repeatedly and effectively is Harbaugh as hell."}, {"ed17": "But wait. Actually, the most Harbaugh moment has to be this."}, {"ddf4": "It didn’t work, and it’s possible it wasn’t even Harbaugh’s call — fake punts are sometimes decided on the field by the players if the opponent is set up in a favorable way — but still. Going for a fake punt up 34–0 is Harbaugh as hell."}, {"c041": "BUT WAIT:"}, {"368b": "NO, THAT’S IT. THAT’S THE MOST HARBAUGH THING TODAY."}, {"9c9a": "Sorry, it’s hard to pick. Jim Harbaugh exists at 100 percent of his potential every second of his life."}, {"6162": "Jim Harbaugh Isn’t a Football Coach — He’s an ExperienceWhat’s it like inside this Michigan Man’s brain?theringer.com"}, {"81bc": "Most “College Football After Dark” Thing"}, {"78eb": "Pac-12 teams play their games after the rest of the world’s bedtime, and these wee-hours contests often provide college football’s weirdest moments. Defense is optional. If you drink for every point, you’ll die."}, {"177a": "Friday night, Oregon took on Cal in a game that had the highest over/under total in recorded history, with Vegas predicting the teams would combine for 89 points. Somehow, the oddsmakers underestimated."}, {"4a57": "I didn’t spend my Friday night watching football. I went to some bars in Williamsburg with my girlfriend. At about 10:45 p.m., we arrived at one that had a TV, and I noticed Oregon-Cal had just started. We left at about 1 a.m., and I noticed it was still going. I got home a little bit before 2, and I looked at my phone to check the score and found that THE GAME WAS STILL GOING. My girlfriend went to sleep, like a normal person. I watched two subpar Pac-12 teams play football for another hour."}, {"96ee": "Cal beat Oregon 52–49 in double overtime at 2:56 ET on Saturday morning, mercifully providing a loophole that allows me to write about this game in an article called “Saturday Superlatives.” The Golden Bears ran 118 plays, an FBS record."}, {"72cf": "You have to be a glutton to enjoy College Football After Dark. There are more than enough hours of football in a week, and yet some of us still skimp on sleep to fulfill a perverse desire to witness disgusting amounts of points. All we can hope is that our friends and family never discover our disturbing habit."}, {"19ef": "Most “You’re Old” Thing"}, {"f07e": "Yes, Jeff George Jr. is Illinois’s starting QB. I think this makes me feel particularly old because Jeff George Sr. kept playing for quite a long time — his last appearance on an NFL roster was in 2006, 16 years after he left Illinois."}, {"09a7": "The younger George is a 20-year-old redshirt freshman. He entered the year as a third-stringer, but starter Wes Lunt got hurt, and so did backup Chayce Crouch, so George Jr. is Illinois’s starter now."}, {"24db": "Following this news, I made an important discovery, finding this on George Jr.’s Illinois bio page:"}, {"839b": "So, either the question was “Who’s your favorite athlete — you know, besides your dad,” or Jeff genuinely prefers Tom Brady to his dad."}, {"ca0b": "I’ve actually uncovered some other results from George’s survey:"}, {"a210": "Favorite former Illini athlete: Juice Williams"}, {"d7cf": "Favorite dad: Peter Griffin from Family Guy"}, {"8354": "Favorite NFL quarterback with two first names: Matt Flynn"}, {"adf0": "Favorite Jeff: Amazon.com founder and CEO Jeff Bezos"}, {"d9d9": "George’s day didn’t go too well: He went 0-for-7 with an interception in the first half and finished just 4-for-15 with a touchdown. The lesson: It’s probably a bad idea to start a freshman against the no. 3 team in the country, even if his dad was once a no. 1 pick. (And even if he likes Tom Brady.)"}, {"5b89": "Least Respectful Moment"}, {"527a": "Some backstory here: After the Big East collapsed, the sad state of UConn football left the Huskies without a conference. They wound up in the AAC, a second-tier league with no other teams anywhere near Connecticut, and they went 3–9 in 2013, their first year in the league. They remained awful in 2014, winning only one conference game, against UCF."}, {"0506": "So in 2015, head coach Bob Diaco announced that UCF was now UConn’s rival. There was no connection between the schools other than the fact that the Huskies had just beaten the Knights. But UConn couldn’t say that about any other AAC foe, so it was their only choice. They even made a trophy and a countdown clock!"}, {"ab12": "One problem: UCF straight-up refused to acknowledge the existence of the rivalry. This was embarrassing for Diaco, who no-commented when asked about the trophy this week. But apparently UConn brought it on the field for today’s game anyway. And when UCF won, the Knights declined to take it."}, {"375f": "It’s one thing to get left at the altar; it’s quite another to send out invitations only to have the supposed bride publicly say, “Uhh, what wedding?” I like rivalry trophies; they’re neat traditions, and it’s cool to see athletes lifting hideous hunks of wood and metal. But I think my favorite is this unrequited one."}, {"e453": "Best Swag"}, {"4e47": "For millennia, waves have inspired fear and wonder. In Japan, Hokusai painted the Great Wave off Kanagawa, beautifully demonstrating the unrelenting power of nature. In The Great American Novel, Moby-Dick, Herman Melville wrote not about America, but about the untamed ocean. And who can forget George Costanza’s simple, but iconic words: “The sea was angry that day, my friends.”"}, {"cf1d": "Presumably with those inspirations in mind, Tulane is wearing these helmets against Tulsa today."}, {"242f": "That’s the Angry Wave an old mascot from the 1960s. He does not have a proper name. He is just Angry Wave."}, {"0f60": "What I love about this mascot is that the sea is genuinely terrifying — tsunamis are no. 1 on my list of most frightening natural disasters — but someone decided a wave could not be scary unless it had some eyes, a growly mouth, and a little arm."}, {"3e02": "I hope Tulane wears these constantly. Its current mascot is a pelican named “Riptide,” which is infinitely inferior to a furious liquid. Please bring us more Angry Wave."}, {"a043": "Best ‘College GameDay’ Sign"}, {"d092": "I’m giving it to this completely unnecessary joke about sex and cell biology:"}, {"46b2": "This is the second time in three weeks that somebody has shown up at College GameDay with a sign accurately assessing the biological function of an organelle. I’m all for this. I’ve seen enough signs about how your team’s opponent is bad, their school is stupid, and their best player listens to Nickelback — and I’ve seen more than enough signs about Harambe."}, {"fc8e": "From now on, just show up with jokes about things you learned in seventh grade earth science."}], "content": "Saturday Superlatives: The Weird and Wonderful From College Football Week 8 Penn State shocks Ohio State, Oklahoma and Texas Tech set the record books on fire, Alabama keeps on being Alabama, and more madness College football is glorious, but with 120-plus teams, it’s also impossible to fully track. So throughout the day, we’ll be celebrating the weird and wonderful moments that this silly sport has to offer. Grab an oatmeal creme pie and hang with us, won’t you? Most Meaningful Result College football crowds learned how to wear identically colored shirts some time ago, but it still feels different when Penn State does it. The Happy Valley White Out was on this week, and the crowd was so loud that players seemingly couldn’t hear whistles blowing plays dead. Fans had reason to cheer: The hometown Nittany Lions handed the visiting Ohio State Buckeyes, ranked second nationally and in the thick of the national championship race, their first loss on the year, 24–21. The Buckeyes got ahead early, but crumpled after taking a 21–7 lead, ultimately dooming themselves by allowing 10 points off of special teams screwery: On back-to-back fourth-quarter drives, Penn State blocked a punt and a field goal. The first gave the Nittany Lions the ball in field goal range, while the second was returned for a touchdown that wound up being the game winner. Ohio State had a chance to drive for a win, but the Buckeyes offense proved capable of little more than checkdowns. To this point in the season, we seemed destined for an Ohio State–Michigan matchup of infinite importance. I mean, if you ask their fans, EVERY Ohio State–Michigan game is of infinite importance, but this year the two teams actually appeared destined to face off as undefeateds for the right to play in the Big Ten championship game. The Game can still have College Football Playoff implications, though, as long as Urban Meyer’s club avoids another stumble. As this upset should remind us, the Wolverines could also lose. But if they don’t, and if both teams win all of their contests between now and November 26, the Buckeyes could topple Michigan and make the conference title game thanks to the head-to-head tiebreaker. And if the Bucks win that game, they’d be 12–1 and a shoo-in for the playoff. After all, Ohio State has lost a weird game and gone on to make and win the playoff before. You might not remember — it was a whole two seasons ago. But after needing overtime to survive Wisconsin in Week 7 and failing to even get that far against Penn State, I wonder if that’s reasonable to expect. The passing game was inefficient, with J.T. Barrett netting only 5.7 yards per attempt. The hypertalented receivers couldn’t get open, and the recently studly offensive line couldn’t keep Barrett safe for more than a few seconds, even when Penn State wasn’t blitzing. There was a 74-yard run by Curtis Samuel, but the receiver/RB hybrid got only two carries. Meanwhile, primary back Mike Weber managed just 71 yards on 21 carries. In an Ohio State fan’s dream world, this was all caused by the white shirts, and the Buckeyes will snap back to being a juggernaut next week. But the problems in Columbus seem to go beyond attire at this point. Least Surprising Thing Texas A&M–Alabama was THE BIGGEST GAME OF THE DAY: When the undefeated and top-ranked team in the country hosts the undefeated and sixth-ranked team in the country, we pay attention. But it was also a blowout, and that seemed normal: The Crimson Tide were 18-point favorites, and ended up winning by 19. Defensive end Jonathan Allen returned a fumble for a touchdown, meaning Alabama has now scored as many touchdowns on defense and special teams combined (12) as it has allowed overall. Oh, Allen also did this: AHHHH THAT’S NOT A PERSON THAT’S A TORPEDO. TORPEDOES SHOULDN’T BE ALLOWED TO PLAY FOOTBALL. Texas A&M is good! The Aggies entered Saturday 6–0, with three wins over ranked teams and another win over Auburn, which wasn’t ranked when the two played, but is now. That’s good!!!! But the Aggies really didn’t look like they belonged on the same field as Alabama. They briefly took a 14–13 lead in the third quarter, but then Bama decided it was time for carnage. The Tide have now played five games against ranked teams, and have won those games by an average of 25.6 points. We’re used to Nick Saban’s squad beating a lot of good teams, but this year Alabama is yawning while crushing the opposition. I’m sure a lot of the buildings that Godzilla destroyed in Tokyo were very nicely built, capable of resisting massive earthquakes and what not. But Godzilla was too busy demolishing them to notice. College Football’s Best Defender Is a PoetTexas A&M star Myles Garrett is so much more than a pass rushertheringer.com Most Stuff, Overall Football video games in 2016 are amazing, but sometimes they’re too demanding. I don’t always want to have to think. Sometimes I’m just trying to have fun, and a game forces me to read the defensive end and figure out whether the opposition is lined up in Cover 3. That’s too much work. Sometimes I just want to put up dozens of touchdowns against a virtual opponent, and that’s when I bust out my PS2 and pop in an old classic, Oklahoma vs. Texas Tech. The Sooners and Red Raiders each put up 854 yards on Saturday night, combining for an NCAA record 1,708 total. That’s 5,124 feet of offense, or .9705 miles. The two teams combined for 17 touchdowns and four punts. Texas Tech’s Patrick Mahomes tied an NCAA record with 734 yards passing. He also led his team in rushing with 85 yards and two touchdowns. It’s one of the greatest statistical single-game performances of all time. Oh, by the way: His team LOST, 66–59. To clarify: This dude set the all-time record for total yards and also scored while running the ball AND IT WASN’T GOOD ENOUGH. Step your game up, Pat! Patrick Mahomes Isn’t Another System QuarterbackKliff Kingsbury’s latest muse is a breakout startheringer.com Is there such a thing as too much offense? Is there a point at which the complete failure of two defenses to do anything meaningful actually ruins our ability to enjoy a game? No, no there is not. Go for 900 yards next time, Pat. Best Performance by Lamar Jackson Getty Images The Louisville quarterback and Heisman Trophy front-runner deserves his own category. At this point, it’s unfair to put anybody else on his level. Jackson obliterated NC State on Saturday, throwing for 304 yards and three touchdowns while running for a fourth in the Cardinals’ 44–0 win. NC State, by the way, is not a bad team, having forced overtime against Clemson last week. Ahh, wait: Those were his halftime stats, and that was Louisville’s halftime lead. This isn’t an attempt to cop out of writing about the second half. Remember: It’s not just that Alexander the Great conquered the entire known world; it’s that he did so by the time he was 32. The Heisman Race That Wasn’tWhy college football’s most touted backs failed to live up to the hypetheringer.com Some people might be growing tired of hearing about Jackson’s eye-popping numbers. Why should we get excited about another large number of yards and large number of touchdowns after already fawning over his big days against Charlotte, Syracuse, Florida State, Marshall, Clemson, and Duke? If that’s happening to you, I’d recommend actually watching Jackson. My breath still disappears every time I see him launching ludicrous lasers and whistling by would-be tacklers at warp speed. Best Performance, Non–Lamar Jackson Edition Utah’s Joe Williams torched UCLA, putting up 332 yards and four touchdowns in a 52–45 Utes win. Remember when UCLA was ranked? Yeah, look at this: Williams totaled the most rushing yards of any player this season, passing BYU’s Jamaal Williams in some quality Utahn usurpation. He also set the Utah school record and tallied the most rushing yards by any Pac-12 player since 2012. That’s all incredible enough. But it’s even more impressive from Williams, who announced his retirement from football about a month ago, citing injuries and “a loss of desire.” He’d managed only 75 yards in the team’s first two games, and he’d lost two fumbles, and Kyle Whittingham yelled at him very prominently on camera. It seemed he didn’t feel it was worth it. But the Utes got really dinged up at running back — REALLY dinged up — and came calling for Williams. He ran for 179 yards and a TD last week, and this week, he set a dang school record. It seems safe to say that unretiring was a good idea. Who do you guys think is going to win the NBA’s MVP award this year? I see a lot of people picking LeBron or Steph, but after Williams’s Saturday, I’m convinced it’s going to be Kobe. Biggest Humiliation LSU’s Leonard Fournette, who last played on September 24, returned from his ankle injury on Saturday. I’d say he’s healthy. Few running backs have brutalized defenders the way Fournette has. And this was one of his finest works. The player Fournette nearly flipped is Deontay Anderson, a true freshman for Ole Miss whom ESPN ranked as the top safety in this past year’s recruiting class. Pretty good! Unfortunately, Fournette, who finished the night with 284 yards and three touchdowns on 16 carries, is one of the top-ranked anythings in the history of everything. College football generally pits players of the same age range and developmental status against each other. But that’s a man trucking a teenager. Worst Week Ohio State’s loss might seem like the headliner, and in terms of potential playoff impacts, it is; but when it comes to sheer shock value, no. 11 Houston’s blowout 38–16 loss to SMU is actually the worst defeat any ranked team suffered in Week 8. To understand how big of an upset this was, consider that the Mustangs hadn’t beaten a top-15 opponent since 1986. That year, SMU was in its last throes as a powerhouse thanks to the strategy of openly buying elite players. In 1987, the NCAA hit the program with its now-infamous death penalty, and in the 30 years since, the Mustangs hadn’t bested a club of Houston’s caliber. Congrats to SMU on the win; hopefully it can get another one before 2046. Meanwhile, the loss capped a horrendous week for Houston. Just a few days ago, the Cougars had a pretty good chance of earning the Group of Five’s spot in the New Year’s Six bowl games. And more importantly, the program appeared to be on the verge of being announced as a new member of the Big 12, meaning that in future seasons, Tom Herman’s team wouldn’t even have to worry about the difficulties of being relevant in a little league. They’d be made. But the Big 12 decided not to expand. (Perhaps some Big 12 teams feared adding a very competitive team from the same state that produces the majority of Big 12 recruits.) And suddenly, Houston isn’t even favored to win the league it’s now forced to keep calling home. It really is all bad news: The Cougars’ second loss isn’t going to be damning enough to prevent Herman, their brilliant head coach, from getting poached at year’s end. In a week, Houston’s bright future turned into a mediocre present. Please don’t leave, Paul Wall — you’re all that’s left. Weakest Coaching Decision Iowa head coach Kirk Ferentz likely finds toasting bread exotic. Despite this — because of this? — the school recently gave him a massive contract extension that will pay him $4.5 million until 2026. The Hawkeyes did this even though it seems unlikely that a man who probably considers milk hard liquor was itching to leave a school he’s worked at since 1999. Against no. 10 Wisconsin on Saturday, Ferentz flexed his ironclad dedication to timidity. In the first quarter, an Iowa receiver was ruled inches short of the first-down marker at the Wisconsin 49. Ferentz INSTANTLY sent his punt team on the field instead of going for it on fourth down, seizing the opportunity to give his opponent the ball. But his masterpiece came with only five minutes to go. Down 14–6, the Hawkeyes faced a fourth-and-5 at the Wisconsin 20. In a one-possession game, his decision was clear-cut. Go for it! You need a touchdown! You don’t need a field goal! And kicking a field goal gives the opponent the ball with five minutes left! Ferentz called for a field goal. His kicker missed. When asked to explain his decision after the game, Ferentz gave an answer that seemingly implied he doesn’t know that two-point conversions exist. You’d think a man with such uncommon job security would feel confident taking risks. Instead, he’s recommitted to making decisions so cautious they actively hurt his football team. Last year, when Iowa went to the Rose Bowl, many Hawkeyes fans claimed that they had witnessed the birth of a “New Kirk,” one who sometimes rolled the dice. Well, midnight has struck, and Ferentz has turned back into a frog whose mating call is the sound of a foot punting a football. Iowans probably want to stop talking about Ferentz’s salary and extension. Don’t worry, guys: We’ll only make fun of it for another 10 years and two months. Best Trick Play This touchdown for Virginia’s Evan Butts — BUTTS! Butts is a tight end, but after some pre-snap movement, he ended up as the snapper on this play. He lateraled to Matt Johns, who serves as Virginia’s holder but used to be its starting QB. North Carolina’s defense promptly ignored Butts — BUTTS!!!! — and he waltzed into the end zone for the easiest touchdown throw of Johns’s career. So, two things here seem weird. First: the snap. Is that legal? Yes: There’s no rule saying players have to snap the ball through their legs. In fact, the rulebook says “the snap need not be between the snapper’s legs.” But the snap has to be “a quick and continuous backwards motion.” Butts’s snap fits that description. The reason centers tend to snap the ball between their legs is not because it’s the only legal way, but because they need to be in position to block right after the snap. If Butts — BUTTS! — had been facing a pass rush here after a snap that turned his body perpendicular to the line, he would’ve been in trouble. Second: What about the fact that the ball is THROWN TO THE GUY WHO SNAPPED IT? What the hell? Well, that’s kosher too. It has to do with how the team is lined up: A team must have seven players on the line of scrimmage for a formation to be legal. Of these seven, the five in the middle are ineligible to catch a pass, and the two on the ends are eligible. In almost every scenario, the guy snapping the ball is one of the five ineligible, since teams normally surround the center with other offensive linemen. Not here! Notice how the two players at the bottom of the screen are about 2 yards behind the line of scrimmage? Butts — BUTTS!!!!!!!! — is actually the rightmost player on the line of scrimmage, which means he’s allowed to catch a pass. Unfortunately, it didn’t matter much, as the Hoos lost 35–14. But still, good play. Congrats to Butts. Worst Trick Play It actually doesn’t look that bad on video, but I’ll explain why it’s problematic: Michigan State attempted that fake with one second left in the first half. So there was no next play: Either kicker Michael Geiger runs 28 yards to the end zone, or Sparty gets zero points. Kickers are not very fast or good at running, and it is hard for non-kickers to run 28 yards on do-or-die plays. I’d say this was a bad idea. The attempt was a 45-yarder, which is hard to hit. But a slim chance of getting three points is better than an all-but-0 percent chance of getting six points. Harshest Whuppin’ Last year Arkansas beat Auburn in four overtimes, and that kind of defeat stings. This year’s game was a bit less competitive. The Tigers made some Razorback bacon, cutting and frying Arkansas in a 56–3 beatdown. Earlier in the year, Gus Malzahn struggled to pick a quarterback, rotating through somewhere between three and 11 options in the season-opening loss to Clemson. Malzahn himself could’ve played QB in Week 8, though, as Auburn ran for 543 yards, a school record in an SEC regular-season game. Meanwhile, Arkansas ran for 25 yards. Twenty-five is less than 543. [Writer’s note: Can we have copy desk check on this? I’m not great at math. Please delete this before we publish. Thanks.] Auburn’s a pendulum. In 2013, the Tigers were picked to finish fifth in the SEC West in the media’s preseason poll. Instead, they made the national title game. Last year, that poll said they’d win the league. Instead, they finished last in the SEC West. This year they were picked sixth in the division. They just ground a pretty good Arkansas team into mush. They’d have to get past Alabama to make the SEC championship game, though. Maybe somebody should schedule a game between those two. Sometime in November sound good? Most Harbaugh Moment It’s gotta be this. It’s not the first time Harbaugh’s used this 10-man lineup, which he calls “trains” and I plan to continuing calling “The Wolverine Centipede.” But this time it led to a touchdown. The fact that he’s running something so weird repeatedly and effectively is Harbaugh as hell. But wait. Actually, the most Harbaugh moment has to be this. It didn’t work, and it’s possible it wasn’t even Harbaugh’s call — fake punts are sometimes decided on the field by the players if the opponent is set up in a favorable way — but still. Going for a fake punt up 34–0 is Harbaugh as hell. BUT WAIT: NO, THAT’S IT. THAT’S THE MOST HARBAUGH THING TODAY. Sorry, it’s hard to pick. Jim Harbaugh exists at 100 percent of his potential every second of his life. Jim Harbaugh Isn’t a Football Coach — He’s an ExperienceWhat’s it like inside this Michigan Man’s brain?theringer.com Most “College Football After Dark” Thing Pac-12 teams play their games after the rest of the world’s bedtime, and these wee-hours contests often provide college football’s weirdest moments. Defense is optional. If you drink for every point, you’ll die. Friday night, Oregon took on Cal in a game that had the highest over/under total in recorded history, with Vegas predicting the teams would combine for 89 points. Somehow, the oddsmakers underestimated. I didn’t spend my Friday night watching football. I went to some bars in Williamsburg with my girlfriend. At about 10:45 p.m., we arrived at one that had a TV, and I noticed Oregon-Cal had just started. We left at about 1 a.m., and I noticed it was still going. I got home a little bit before 2, and I looked at my phone to check the score and found that THE GAME WAS STILL GOING. My girlfriend went to sleep, like a normal person. I watched two subpar Pac-12 teams play football for another hour. Cal beat Oregon 52–49 in double overtime at 2:56 ET on Saturday morning, mercifully providing a loophole that allows me to write about this game in an article called “Saturday Superlatives.” The Golden Bears ran 118 plays, an FBS record. You have to be a glutton to enjoy College Football After Dark. There are more than enough hours of football in a week, and yet some of us still skimp on sleep to fulfill a perverse desire to witness disgusting amounts of points. All we can hope is that our friends and family never discover our disturbing habit. Most “You’re Old” Thing Yes, Jeff George Jr. is Illinois’s starting QB. I think this makes me feel particularly old because Jeff George Sr. kept playing for quite a long time — his last appearance on an NFL roster was in 2006, 16 years after he left Illinois. The younger George is a 20-year-old redshirt freshman. He entered the year as a third-stringer, but starter Wes Lunt got hurt, and so did backup Chayce Crouch, so George Jr. is Illinois’s starter now. Following this news, I made an important discovery, finding this on George Jr.’s Illinois bio page: So, either the question was “Who’s your favorite athlete — you know, besides your dad,” or Jeff genuinely prefers Tom Brady to his dad. I’ve actually uncovered some other results from George’s survey: Favorite former Illini athlete: Juice Williams Favorite dad: Peter Griffin from Family Guy Favorite NFL quarterback with two first names: Matt Flynn Favorite Jeff: Amazon.com founder and CEO Jeff Bezos George’s day didn’t go too well: He went 0-for-7 with an interception in the first half and finished just 4-for-15 with a touchdown. The lesson: It’s probably a bad idea to start a freshman against the no. 3 team in the country, even if his dad was once a no. 1 pick. (And even if he likes Tom Brady.) Least Respectful Moment Some backstory here: After the Big East collapsed, the sad state of UConn football left the Huskies without a conference. They wound up in the AAC, a second-tier league with no other teams anywhere near Connecticut, and they went 3–9 in 2013, their first year in the league. They remained awful in 2014, winning only one conference game, against UCF. So in 2015, head coach Bob Diaco announced that UCF was now UConn’s rival. There was no connection between the schools other than the fact that the Huskies had just beaten the Knights. But UConn couldn’t say that about any other AAC foe, so it was their only choice. They even made a trophy and a countdown clock! One problem: UCF straight-up refused to acknowledge the existence of the rivalry. This was embarrassing for Diaco, who no-commented when asked about the trophy this week. But apparently UConn brought it on the field for today’s game anyway. And when UCF won, the Knights declined to take it. It’s one thing to get left at the altar; it’s quite another to send out invitations only to have the supposed bride publicly say, “Uhh, what wedding?” I like rivalry trophies; they’re neat traditions, and it’s cool to see athletes lifting hideous hunks of wood and metal. But I think my favorite is this unrequited one. Best Swag For millennia, waves have inspired fear and wonder. In Japan, Hokusai painted the Great Wave off Kanagawa, beautifully demonstrating the unrelenting power of nature. In The Great American Novel, Moby-Dick, Herman Melville wrote not about America, but about the untamed ocean. And who can forget George Costanza’s simple, but iconic words: “The sea was angry that day, my friends.” Presumably with those inspirations in mind, Tulane is wearing these helmets against Tulsa today. That’s the Angry Wave an old mascot from the 1960s. He does not have a proper name. He is just Angry Wave. What I love about this mascot is that the sea is genuinely terrifying — tsunamis are no. 1 on my list of most frightening natural disasters — but someone decided a wave could not be scary unless it had some eyes, a growly mouth, and a little arm. I hope Tulane wears these constantly. Its current mascot is a pelican named “Riptide,” which is infinitely inferior to a furious liquid. Please bring us more Angry Wave. Best ‘College GameDay’ Sign I’m giving it to this completely unnecessary joke about sex and cell biology: This is the second time in three weeks that somebody has shown up at College GameDay with a sign accurately assessing the biological function of an organelle. I’m all for this. I’ve seen enough signs about how your team’s opponent is bad, their school is stupid, and their best player listens to Nickelback — and I’ve seen more than enough signs about Harambe. From now on, just show up with jokes about things you learned in seventh grade earth science. ", "child": "2009_1\t2009_2\t2009_3\t2009_4"}