{"name": "202", "parent": "", "title": "What to do if no one reads what you write.", "sentences": [{"2aec": "What to do if no one reads what you write."}, {"eb65": "How to break out of your echo chamber."}, {"11f2": "I’ve been a professional writer for more than 20 years."}, {"62fd": "I know how it feels to screw up your nerve and post something in public for the entire world to see — and then realize that the whole world doesn’t really care."}, {"270c": "They aren’t even paying attention."}, {"731d": "Before I tell you what to do when no one is reading what you write, I want to share a story with you that I hope will help you understand a hard, rather beautiful truth."}, {"d064": "If it’s possible for you to write something that no one reads — then no one is paying attention. And there’s real freedom in that idea."}, {"725a": "Once you realize that no one is paying attention, you can let go of the voice screaming in your head that you better not fuck up, because if you do the whole entire universe will laugh at you/hate you/shun you/whatever it is you’re afraid of."}, {"37b0": "Okay. My story."}, {"9657": "Over the last couple of years, I’ve lost more than 100 pounds. Last summer, I did something I’d promised my daughter I would. I took her to a water park and actually went on the slides instead of parking myself in the shade."}, {"7d7a": "I was still fat. I was still middle aged. I still did not look like a swimsuit model. Since I’d lost so much weight, I had some weird skin stuff happening. And, to top it all off, my hair was falling out."}, {"d46d": "I’m not going to lie. I felt weird about putting on a bathing suit and wearing it in public."}, {"00a5": "I was afraid of being looked at. But I’d promised my kid. And I don’t know. I guess I just decided that if I was going to do this, I was going to do it. I wore a two piece. In public. Outside."}, {"30cc": "Here’s proof."}, {"3090": "And, you know what? Literally no one cared. No one at the water park. No one in my city. No one in my country. No one in my hemisphere. No one in my galaxy. No one gave two shits that a fat lady with weird skin and hardly any hair wore a striped two piece to the water park."}, {"5a33": "Utter, total freedom. Because it meant that I could do what I wanted and the thing that was holding me back —fear of being seen — just didn’t matter anymore."}, {"0845": "No, of course, when it comes to your writing, you want people to care. You want people to read and respond and care. It’s a weird little thing that writing like no one is paying attention can get you there. Because, the whole freedom thing."}, {"9e70": "We want to be seen and we’re afraid to be seen, so we pull punches with our writing. It’s weird little dynamic we live with."}, {"6770": "Prelude"}, {"ffdb": "Okay, if you’re reading this, hopefully you’re already doing what I’m about to suggest."}, {"a60f": "Write consistently."}, {"caff": "That means produce consistently high-quality work on a consistent basis."}, {"7fac": "Here’s a framework that I use that really helps me. Maybe it will help you, too."}, {"8cb3": "How to be a good writer with a good lifeThe WRITER Frameworkmedium.com"}, {"1699": "Okay. Here are the things that matter, after you’ve done the write-like-no-one-cares part, and the write consistently part, and you find yourself posting to an empty void."}, {"15a8": "Be honest with yourself."}, {"6cf6": "First things first. Take a good, long, hard look at what you’re producing."}, {"7815": "Is it any good?"}, {"8243": "How’s your grammar? How about your spelling? Do you have enough white space in your post to make it easy to read? Are you telling a story or just dumping a bunch of information on your reader’s head?"}, {"7200": "Task one, if you want to be well read is to write well. Period. Other things matter, but they’re all tied for a distant second. Write well and you’ll find your audience. Write mediocre or worse and you’ll get a collective shrug from the reading universe."}, {"3c91": "Fix the things you were honest about."}, {"1baa": "If your technical writing skills aren’t up to par, fix that. It may just be that you need practice. No one is born a good writer. Write a lot. Also read a lot. Pay attention to how sentences flow and how grammar works."}, {"960b": "At the very least, use the grammar and spelling checkers on Word. Download the Grammarly extension and use that. Download the Hemmingway app to test the readability of your post."}, {"1767": "You don’t have to be perfect. Medium posts do better if they read conversationally, instead of dry and academic, after all. But you need to be competent if you want your readers to trust you."}, {"79ef": "Tweak your picture and headline."}, {"d7df": "This is what a Medium dashboard looks like:"}, {"e6a9": "All anyone sees, before they click through to your post, is a headline, a subhead, and a picture (maybe.) And, as you can see here, on the new paid dash, most posts don’t even get a picture."}, {"2e0c": "The headline matters. A LOT. The picture matters. A LOT. And the subtitle matters. A LOT."}, {"84f6": "Use this tool and play around with your headline until it gets a score above 70. Find the line between click bait yuck and compelling. A huge part of the difference is delivering on the promise in the title."}, {"d8a9": "If you’re going to give the 1 Best something or other, make it the best something or other EVER. Don’t regurgitate the same old, same old that everyone already knows."}, {"b6fa": "In other words: write a good headline, but it better be backed up by rule #1. (Write a good post.)"}, {"7d57": "Your post should have at least one good photograph. Put it at the top. When your work is shared on social media, the picture will show up with the headline. And hopefully it’ll show up in Medium feeds as well. I find pictures here."}, {"c4cf": "Find a wider audience."}, {"97c6": "If you’re writing solid content with a good picture and a great headline, you’re ready to start branching out and working toward having your work syndicated on a Medium publication with a much wider following than your own."}, {"3509": "Here’s a list of publications, based on how many followers they have."}, {"b0d0": "Most publications have submission guidelines either on their about page or somewhere on their site. You can Google “publication + submissions.” Follow their guidelines and submit your work. Once you’re picked up once, you become a writer for that publication and it’s much easier to be published there again. You can just submit to them straight from your dashboard."}, {"5350": "Dig deeper."}, {"47f5": "If you want to do well on Medium (or anywhere else) as a writer, you need to come to terms with digging down deep for your story."}, {"9f44": "Saying the same thing that’s been said before won’t get you much. You need to peel back and go to the next layer. Keep asking the most important question: WHY?"}, {"7c32": "Write what you have to say, then ask yourself WHY and write a little deeper. Write the thing you wish someone would write for you."}, {"13c0": "Let down your shield."}, {"9570": "The best, most well-received writing on Medium, or anywhere else, is at its heart, storytelling. The thing about good storytelling is that it requires you to be at least a little vulnerable."}, {"9314": "And actually, the more vulnerable you can manage to be, the more attention your post is likely to get."}, {"3e8d": "My most read post on Medium is called Here’s How I Got Fat. It has 58,000 views. It is, as the title suggests, about how I got fat. It’s a raw piece that touches on things like my struggle with eating disorder and my history of deep poverty."}, {"6aa2": "Here’s How I Got FatI was scrolling through pictures from an incredible writers’ conference I attended last week. As I went through them, I…medium.com"}, {"5105": "There are practical posts that go supernova viral. If you read some of them, you’ll see: storytelling plays a big part. And the writer not only makes themselves vulnerable, but invites the reader to be vulnerable, too."}, {"c6c3": "Write the next thing."}, {"4b0b": "I saved the best and most important for last."}, {"c8ce": "While you’re waiting to see if you blow up the Internets with your most recent piece — write the next one. And while you wait on the reception for that one — write the next one. And so on. And so on."}, {"14ac": "Build a body of work and see what happens. It might surprise you. Here’s what happened when I wrote on Medium everyday for 30 days."}, {"45f9": "I blogged every day for a month. Here’s what happened.The results of a Quora + Medium experiment.medium.com"}, {"d419": "So, basically: Write like no one is ever going to read what you have to say. And then be brave enough to get read anyway."}, {"2fe1": "If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤"}, {"194b": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "content": "What to do if no one reads what you write. How to break out of your echo chamber. I’ve been a professional writer for more than 20 years. I know how it feels to screw up your nerve and post something in public for the entire world to see — and then realize that the whole world doesn’t really care. They aren’t even paying attention. Before I tell you what to do when no one is reading what you write, I want to share a story with you that I hope will help you understand a hard, rather beautiful truth. If it’s possible for you to write something that no one reads — then no one is paying attention. And there’s real freedom in that idea. Once you realize that no one is paying attention, you can let go of the voice screaming in your head that you better not fuck up, because if you do the whole entire universe will laugh at you/hate you/shun you/whatever it is you’re afraid of. Okay. My story. Over the last couple of years, I’ve lost more than 100 pounds. Last summer, I did something I’d promised my daughter I would. I took her to a water park and actually went on the slides instead of parking myself in the shade. I was still fat. I was still middle aged. I still did not look like a swimsuit model. Since I’d lost so much weight, I had some weird skin stuff happening. And, to top it all off, my hair was falling out. I’m not going to lie. I felt weird about putting on a bathing suit and wearing it in public. I was afraid of being looked at. But I’d promised my kid. And I don’t know. I guess I just decided that if I was going to do this, I was going to do it. I wore a two piece. In public. Outside. Here’s proof. And, you know what? Literally no one cared. No one at the water park. No one in my city. No one in my country. No one in my hemisphere. No one in my galaxy. No one gave two shits that a fat lady with weird skin and hardly any hair wore a striped two piece to the water park. Utter, total freedom. Because it meant that I could do what I wanted and the thing that was holding me back —fear of being seen — just didn’t matter anymore. No, of course, when it comes to your writing, you want people to care. You want people to read and respond and care. It’s a weird little thing that writing like no one is paying attention can get you there. Because, the whole freedom thing. We want to be seen and we’re afraid to be seen, so we pull punches with our writing. It’s weird little dynamic we live with. Prelude Okay, if you’re reading this, hopefully you’re already doing what I’m about to suggest. Write consistently. That means produce consistently high-quality work on a consistent basis. Here’s a framework that I use that really helps me. Maybe it will help you, too. How to be a good writer with a good lifeThe WRITER Frameworkmedium.com Okay. Here are the things that matter, after you’ve done the write-like-no-one-cares part, and the write consistently part, and you find yourself posting to an empty void. Be honest with yourself. First things first. Take a good, long, hard look at what you’re producing. Is it any good? How’s your grammar? How about your spelling? Do you have enough white space in your post to make it easy to read? Are you telling a story or just dumping a bunch of information on your reader’s head? Task one, if you want to be well read is to write well. Period. Other things matter, but they’re all tied for a distant second. Write well and you’ll find your audience. Write mediocre or worse and you’ll get a collective shrug from the reading universe. Fix the things you were honest about. If your technical writing skills aren’t up to par, fix that. It may just be that you need practice. No one is born a good writer. Write a lot. Also read a lot. Pay attention to how sentences flow and how grammar works. At the very least, use the grammar and spelling checkers on Word. Download the Grammarly extension and use that. Download the Hemmingway app to test the readability of your post. You don’t have to be perfect. Medium posts do better if they read conversationally, instead of dry and academic, after all. But you need to be competent if you want your readers to trust you. Tweak your picture and headline. This is what a Medium dashboard looks like: All anyone sees, before they click through to your post, is a headline, a subhead, and a picture (maybe.) And, as you can see here, on the new paid dash, most posts don’t even get a picture. The headline matters. A LOT. The picture matters. A LOT. And the subtitle matters. A LOT. Use this tool and play around with your headline until it gets a score above 70. Find the line between click bait yuck and compelling. A huge part of the difference is delivering on the promise in the title. If you’re going to give the 1 Best something or other, make it the best something or other EVER. Don’t regurgitate the same old, same old that everyone already knows. In other words: write a good headline, but it better be backed up by rule #1. (Write a good post.) Your post should have at least one good photograph. Put it at the top. When your work is shared on social media, the picture will show up with the headline. And hopefully it’ll show up in Medium feeds as well. I find pictures here. Find a wider audience. If you’re writing solid content with a good picture and a great headline, you’re ready to start branching out and working toward having your work syndicated on a Medium publication with a much wider following than your own. Here’s a list of publications, based on how many followers they have. Most publications have submission guidelines either on their about page or somewhere on their site. You can Google “publication + submissions.” Follow their guidelines and submit your work. Once you’re picked up once, you become a writer for that publication and it’s much easier to be published there again. You can just submit to them straight from your dashboard. Dig deeper. If you want to do well on Medium (or anywhere else) as a writer, you need to come to terms with digging down deep for your story. Saying the same thing that’s been said before won’t get you much. You need to peel back and go to the next layer. Keep asking the most important question: WHY? Write what you have to say, then ask yourself WHY and write a little deeper. Write the thing you wish someone would write for you. Let down your shield. The best, most well-received writing on Medium, or anywhere else, is at its heart, storytelling. The thing about good storytelling is that it requires you to be at least a little vulnerable. And actually, the more vulnerable you can manage to be, the more attention your post is likely to get. My most read post on Medium is called Here’s How I Got Fat. It has 58,000 views. It is, as the title suggests, about how I got fat. It’s a raw piece that touches on things like my struggle with eating disorder and my history of deep poverty. Here’s How I Got FatI was scrolling through pictures from an incredible writers’ conference I attended last week. As I went through them, I…medium.com There are practical posts that go supernova viral. If you read some of them, you’ll see: storytelling plays a big part. And the writer not only makes themselves vulnerable, but invites the reader to be vulnerable, too. Write the next thing. I saved the best and most important for last. While you’re waiting to see if you blow up the Internets with your most recent piece — write the next one. And while you wait on the reception for that one — write the next one. And so on. And so on. Build a body of work and see what happens. It might surprise you. Here’s what happened when I wrote on Medium everyday for 30 days. I blogged every day for a month. Here’s what happened.The results of a Quora + Medium experiment.medium.com So, basically: Write like no one is ever going to read what you have to say. And then be brave enough to get read anyway. If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "child": "202_1\t202_2\t202_3\t202_4\t202_5\t202_6\t202_7\t202_8\t202_9\t202_10\t202_11\t202_12\t202_13\t202_14\t202_15\t202_16\t202_17\t202_18\t202_19\t202_20\t202_21\t202_22\t202_23\t202_24202_1\t202_2\t202_3\t202_4\t202_5\t202_6\t202_7\t202_8\t202_9\t202_10\t202_11\t202_12\t202_13\t202_14\t202_15\t202_16\t202_17\t202_18\t202_19\t202_20\t202_21\t202_22\t202_23\t202_24"}