{"name": "2026", "parent": "", "title": "The 2017 NFL Free-Agent Class Is Going to Cash In", "sentences": [{"17cb": "The 2017 NFL Free-Agent Class Is Going to Cash In"}, {"4186": "Teams have a ludicrous amount of cap space and a shrinking number of top free agents to target. For the players on this year’s market, that could make for a big week — and even bigger paydays."}, {"0a5e": "The negotiating period for NFL free agency doesn’t open until next Tuesday, but as the scouting combine forges on, the landscape of the league’s annual spending spree has already taken shape. The final piece of the puzzle was Wednesday’s deadline for teams to designate players as franchise-tagged, and, following the Rams’ decision to apply the tag to cornerback Trumaine Johnson (for the second season in a row), the pool of free agents and the money available to spend on them has come into view."}, {"da53": "Nearly every factor associated with free agency this year points to guys getting paid. The 27-year-old Johnson was the seventh player tagged in 2017, a decline from the 10 players who were stuck with some form of tag designation last season. But that figure is misleading. The Broncos were always going to give Von Miller a long-term deal. The Dolphins lifted the transition tag on Olivier Vernon just before the start of 2016 free agency. And the Ravens’ Justin Tucker is a kicker."}, {"06a5": "This year’s crop of tagged players is large enough (and concentrated at the right positions) to considerably impact the free-agent market. Given the seven high-profile names on the tag and the other current financial realities around the league, it’s possible that some guys will ink deals that are downright shocking. With the salary cap rising more than $12 million this season (to $167 million), franchises have an absurd amount of money and a shrinking number of top-tier players on which to spend it. This is the fourth straight season the cap has risen at least $10 million — it’s gone up more than $47 million since 2012 — and that spike has left eight teams with more than $50 million in cap room and more than half the NFL with at least $30 million."}, {"f38d": "The 13 Riskiest Free Agents in the NFLMeet your favorite team’s newest mistaketheringer.com"}, {"2f00": "With that amount of flexibility, a huge list of teams could be in the running for top free agents. The question is how long they’ll be able to stay in the mix. Expect the teams at the top of the scale to go on Scrooge McDuck–style shopping trips next week. The five franchises with the most cap space have a combined $377 million to spend."}, {"6d25": "Even if the Browns, who have more than $102 million of cap space, or other rebuilding teams, like the 49ers (more than $76 million), don’t end up shelling out huge money to sign the most coveted players on the market, the threat of those organizations getting involved and the total number of dollars on the table are likely to drive up the price for guys at virtually every position. And there are some spots where the market outlook and the rash of teams that have used the franchise tag could work in concert to help some players really cash in."}, {"76e2": "Take cornerback, for example. When the Texans’ A.J. Bouye and the Bills’ Stephon Gilmore heard about the Rams using their franchise tag on Johnson, they probably pumped their fists. A top corner coming off the market means that both should only become more valuable when negotiations begin next week."}, {"9119": "Nick Perry (Getty Images)"}, {"48d9": "The best example of this phenomenon, though, surrounds Packers pass rusher Nick Perry. As recently as last week, Perry may have been seen as the fourth-most attractive edge defender in this class. (However you want to list Arizona’s Calais Campbell, his best work is done on the inside.) But with Melvin Ingram (Chargers), Chandler Jones (Cardinals), and Jason Pierre-Paul (Giants) all getting the tag, Perry now sits atop most lists of the best pass rushers on the 2017 market. Just 26 years old, the former first-round pick posted the best season of his career in 2016, piling up 11 sacks in only 14 games. Since he was drafted by Green Bay in 2012, Perry has missed 20 games with a combination of hand, foot, and shoulder injuries. His résumé has its share of trouble spots, but in this market he’ll likely command a salary north of $10 million annually. Perry getting a deal that rivals the one Ryan Kerrigan signed with Washington in the summer of 2015 — five years for $57.5 million, with $23.8 million guaranteed — wouldn’t be surprising."}, {"2aef": "Free agency is often perceived as a way for teams to fill immediate needs, allowing them to approach the draft with the philosophy of taking the best player available. Yet as the premier pass-rushing options disappear from the market, those needs (and the money that teams have to spend to fill them) don’t change. Like they do in the draft, franchises put together big boards in free agency to pinpoint their targets and preferences. Part of that process involves specifying where to draw the line on price for any given player. In the case of this pass-rushing group, though, the scarcity of high-end talent and the abundance of cash available could make that line hard to discern. Teams with pass-rushing needs that miss out on Perry, for instance, could have to pay up to land a player like Jabaal Sheard. A 27-year-old who has never finished a season with more than 8.5 sacks, Sheard could secure a deal in the range of $8 million annually with $15 million or so guaranteed."}, {"dcb3": "At some positions this ripple effect is already on display. The two long-term deals that the Chiefs recently doled out offer an indication of what to expect in the free-agent market for both safeties and interior offensive linemen. Kansas City guard Laurent Duvernay-Tardif’s five-year, $42.3 million deal (with $20 million guaranteed, fifth most at the position) is now the floor for negotiations with a guy like Larry Warford and serves to pump up the value of superior players such as T.J. Lang and Kevin Zeitler. Seeing the latter pair land more lucrative deals than every guard in the league except Oakland’s Kelechi Osemele wouldn’t be a shock."}, {"dc5f": "At safety, the $40 million guaranteed that the Chiefs handed to Eric Berry — making him the highest-paid player at the position — has to have the likes of Tony Jefferson and Duron Harmon cheering. Though Jefferson is more of a box defender who can’t impact games the way Berry can, he still should be able to command a big deal, especially with the Chiefs star off the market. And Harmon is the sort of coverage safety who has never been more valuable. There’s a chance the former Patriots no. 3 will be paid like a no. 1. Harmon’s entire first contract with New England was for $2.7 million; next week, he’ll probably get a deal worth at least twice that much per season."}, {"77ed": "Ranking the Offseason Capital of All 32 NFL TeamsWho’s rich with draft picks and cap space?theringer.com"}, {"ae47": "There’s no way to know exactly what ramifications will come from the ridiculous silos of cash teams will bring to free agency this year, but it’s reasonable to assume that we’ll see some creative experiments. If a franchise misses out on the top edge rushers available, it could overpay for run-oriented defenders like Brandon Williams or Dontari Poe as a way to bolster its front four. Or, it could give a massive deal to Dont’a Hightower as a pass-rushing option (an underrated part of his game). Teams having a lot of money and not many ways to use it breeds volatility."}, {"11a3": "Then there are organizations that may try to circumvent the market entirely. ESPN reported Thursday that the Titans (and the Eagles) are exploring deals for Saints wide receiver Brandin Cooks, who’s reportedly unhappy with his role in New Orleans. By dealing a pick for Cooks (whether the 18th overall or another selection), Tennessee could fill a need by acquiring a player who’s cost-controlled for at least the next two seasons. That may be preferable to getting stuck in a bidding war for Alshon Jeffery, DeSean Jackson, or Terrelle Pryor."}, {"a335": "That’s an alternative to overpaying a 2017 free agent, but in the case of the teams with the most available cap space, it is hardly a requirement. The Titans are one of five teams with at least $60 million to burn (a list that should grow to six when the Bears release Jay Cutler). Holes are burning in front-office pockets across the league, and it should make for a wild — and wildly expensive — week."}], "content": "The 2017 NFL Free-Agent Class Is Going to Cash In Teams have a ludicrous amount of cap space and a shrinking number of top free agents to target. For the players on this year’s market, that could make for a big week — and even bigger paydays. The negotiating period for NFL free agency doesn’t open until next Tuesday, but as the scouting combine forges on, the landscape of the league’s annual spending spree has already taken shape. The final piece of the puzzle was Wednesday’s deadline for teams to designate players as franchise-tagged, and, following the Rams’ decision to apply the tag to cornerback Trumaine Johnson (for the second season in a row), the pool of free agents and the money available to spend on them has come into view. Nearly every factor associated with free agency this year points to guys getting paid. The 27-year-old Johnson was the seventh player tagged in 2017, a decline from the 10 players who were stuck with some form of tag designation last season. But that figure is misleading. The Broncos were always going to give Von Miller a long-term deal. The Dolphins lifted the transition tag on Olivier Vernon just before the start of 2016 free agency. And the Ravens’ Justin Tucker is a kicker. This year’s crop of tagged players is large enough (and concentrated at the right positions) to considerably impact the free-agent market. Given the seven high-profile names on the tag and the other current financial realities around the league, it’s possible that some guys will ink deals that are downright shocking. With the salary cap rising more than $12 million this season (to $167 million), franchises have an absurd amount of money and a shrinking number of top-tier players on which to spend it. This is the fourth straight season the cap has risen at least $10 million — it’s gone up more than $47 million since 2012 — and that spike has left eight teams with more than $50 million in cap room and more than half the NFL with at least $30 million. The 13 Riskiest Free Agents in the NFLMeet your favorite team’s newest mistaketheringer.com With that amount of flexibility, a huge list of teams could be in the running for top free agents. The question is how long they’ll be able to stay in the mix. Expect the teams at the top of the scale to go on Scrooge McDuck–style shopping trips next week. The five franchises with the most cap space have a combined $377 million to spend. Even if the Browns, who have more than $102 million of cap space, or other rebuilding teams, like the 49ers (more than $76 million), don’t end up shelling out huge money to sign the most coveted players on the market, the threat of those organizations getting involved and the total number of dollars on the table are likely to drive up the price for guys at virtually every position. And there are some spots where the market outlook and the rash of teams that have used the franchise tag could work in concert to help some players really cash in. Take cornerback, for example. When the Texans’ A.J. Bouye and the Bills’ Stephon Gilmore heard about the Rams using their franchise tag on Johnson, they probably pumped their fists. A top corner coming off the market means that both should only become more valuable when negotiations begin next week. Nick Perry (Getty Images) The best example of this phenomenon, though, surrounds Packers pass rusher Nick Perry. As recently as last week, Perry may have been seen as the fourth-most attractive edge defender in this class. (However you want to list Arizona’s Calais Campbell, his best work is done on the inside.) But with Melvin Ingram (Chargers), Chandler Jones (Cardinals), and Jason Pierre-Paul (Giants) all getting the tag, Perry now sits atop most lists of the best pass rushers on the 2017 market. Just 26 years old, the former first-round pick posted the best season of his career in 2016, piling up 11 sacks in only 14 games. Since he was drafted by Green Bay in 2012, Perry has missed 20 games with a combination of hand, foot, and shoulder injuries. His résumé has its share of trouble spots, but in this market he’ll likely command a salary north of $10 million annually. Perry getting a deal that rivals the one Ryan Kerrigan signed with Washington in the summer of 2015 — five years for $57.5 million, with $23.8 million guaranteed — wouldn’t be surprising. Free agency is often perceived as a way for teams to fill immediate needs, allowing them to approach the draft with the philosophy of taking the best player available. Yet as the premier pass-rushing options disappear from the market, those needs (and the money that teams have to spend to fill them) don’t change. Like they do in the draft, franchises put together big boards in free agency to pinpoint their targets and preferences. Part of that process involves specifying where to draw the line on price for any given player. In the case of this pass-rushing group, though, the scarcity of high-end talent and the abundance of cash available could make that line hard to discern. Teams with pass-rushing needs that miss out on Perry, for instance, could have to pay up to land a player like Jabaal Sheard. A 27-year-old who has never finished a season with more than 8.5 sacks, Sheard could secure a deal in the range of $8 million annually with $15 million or so guaranteed. At some positions this ripple effect is already on display. The two long-term deals that the Chiefs recently doled out offer an indication of what to expect in the free-agent market for both safeties and interior offensive linemen. Kansas City guard Laurent Duvernay-Tardif’s five-year, $42.3 million deal (with $20 million guaranteed, fifth most at the position) is now the floor for negotiations with a guy like Larry Warford and serves to pump up the value of superior players such as T.J. Lang and Kevin Zeitler. Seeing the latter pair land more lucrative deals than every guard in the league except Oakland’s Kelechi Osemele wouldn’t be a shock. At safety, the $40 million guaranteed that the Chiefs handed to Eric Berry — making him the highest-paid player at the position — has to have the likes of Tony Jefferson and Duron Harmon cheering. Though Jefferson is more of a box defender who can’t impact games the way Berry can, he still should be able to command a big deal, especially with the Chiefs star off the market. And Harmon is the sort of coverage safety who has never been more valuable. There’s a chance the former Patriots no. 3 will be paid like a no. 1. Harmon’s entire first contract with New England was for $2.7 million; next week, he’ll probably get a deal worth at least twice that much per season. Ranking the Offseason Capital of All 32 NFL TeamsWho’s rich with draft picks and cap space?theringer.com There’s no way to know exactly what ramifications will come from the ridiculous silos of cash teams will bring to free agency this year, but it’s reasonable to assume that we’ll see some creative experiments. If a franchise misses out on the top edge rushers available, it could overpay for run-oriented defenders like Brandon Williams or Dontari Poe as a way to bolster its front four. Or, it could give a massive deal to Dont’a Hightower as a pass-rushing option (an underrated part of his game). Teams having a lot of money and not many ways to use it breeds volatility. Then there are organizations that may try to circumvent the market entirely. ESPN reported Thursday that the Titans (and the Eagles) are exploring deals for Saints wide receiver Brandin Cooks, who’s reportedly unhappy with his role in New Orleans. By dealing a pick for Cooks (whether the 18th overall or another selection), Tennessee could fill a need by acquiring a player who’s cost-controlled for at least the next two seasons. That may be preferable to getting stuck in a bidding war for Alshon Jeffery, DeSean Jackson, or Terrelle Pryor. That’s an alternative to overpaying a 2017 free agent, but in the case of the teams with the most available cap space, it is hardly a requirement. The Titans are one of five teams with at least $60 million to burn (a list that should grow to six when the Bears release Jay Cutler). Holes are burning in front-office pockets across the league, and it should make for a wild — and wildly expensive — week. ", "child": "2026_1\t2026_2"}