{"name": "2029", "parent": "", "title": "The Vikings Are Ready to Spend Big in Free Agency", "sentences": [{"920b": "NFL Combine Daily Dispatch"}, {"dbc8": "The Vikings Are Ready to Spend Big in Free Agency"}, {"7f95": "Minnesota GM Rick Spielman’s comments suggest that the Vikings could make a big splash once the market opens. Plus, a look at the state of the rebuilding 49ers and Browns."}, {"cb46": "The 2017 NFL combine has arrived, meaning it’s time for prospects to perform drills in their underwear, franchises to chart their futures, and anonymous scouts to provide irresponsible quotes. So who and what is creating the most buzz? The Ringer NFL staff has you covered, providing five thoughts from each day in Indianapolis."}, {"b9e8": "1. In what might have been the biggest shock of the combine’s opening day, the first question posed to Vikings general manager Rick Spielman was not about released running back Adrian Peterson. The initial query was about Sam Bradford, and it surprised Spielman enough for him to admit that he’d lost a dollar bet he had made on which subject would come up first when he stepped to the podium."}, {"ae83": "Spielman has been with the Vikings (first as the vice president of player personnel and then as the GM; he ascended to the latter role in 2012) during Peterson’s entire tenure in Minnesota. The notion of the star running back donning any other uniform has to be bizarre to him in the same way it is for the rest of us."}, {"7ddc": "Can Adrian Peterson and Jamaal Charles Outrun History?Not many running backs keep producing at a high level after turning 30, but Peterson and Charles could both thrive in…theringer.com"}, {"1c2a": "Spielman told reporters that he spoke with Peterson on Friday, and that they had a frank and honest conversation. The message he delivered to AD — and to the Vikings’ other 2017 free agents–to-be, including Captain Munnerlyn and Terence Newman — is that he’d like to bring all of them back, but the likelihood of that happening is fluid. “If we go after some specific positions in free agency,” Spielman said Wednesday, “and we’re planning on spending Z amount of dollars, all of a sudden those dollars increase because of the amount of cap space teams have, then we have to adjust our game plan.”"}, {"f3cb": "Reading between the lines, that sounds like a GM who’s prepared to be active once free agency opens. This is a team that felt good enough about its roster last fall to trade first- and fourth-round picks for Bradford, and with $38 million or so in available cap space, Spielman has the resources to find upgrades at certain spots. Minnesota desperately needs help along its offensive line; with left tackle Andrew Whitworth and the bevy of guards on the market, it will have opportunities to get it. The Vikings would love to keep Peterson, but there may come a price at which a re-signing no longer makes sense for both sides."}, {"df03": "2. One of the combine’s annual hallmarks is longtime personnel people pulling out random anecdotes about bygone players. In the case of new Colts general manager Chris Ballard, this happened as a happy accident. Ballard — who spent 12 years in Chicago’s front office before moving to Kansas City when Andy Reid was hired as the Chiefs head coach in 2013 — misheard a question and thought a reporter was asking him about cornerback Nathan Vasher, whom the Bears drafted out of the University of Texas in 2004. Before Ballard could be informed that the original query was about something different, he told a story about how Vasher made up for a suspect 40-yard-dash time with an incredible performance in the three-cone drill. Vasher, keep in mind, was a fourth-round pick 13 years ago. This was stuff that Ballard could instantly recite."}, {"1963": "Panthers GM Dave Gettleman is good for at least one of these types of anecdotes every year. In explaining how he has developed his scouting instincts, he credited his history of working with some of the best talent evaluators in league history. And he ain’t lyin’. Gettleman broke into the NFL as a scouting intern with the Bills in 1986, and during his 30-year career he’s worked with the likes of Marv Levy, Mike Shanahan, and Ernie Accorsi, among others. That sort of longevity means plenty of stories, and Gettleman tossed one out Wednesday about evaluating small-school products, and particularly former Broncos linebacker John Mobley."}, {"7d29": "Mobley played his college football at Kutztown University, an 8,500-student school in eastern Pennsylvania that I swear is real. Gettleman used Mobley as an example of just how dominant off-the-radar prospects have to be to crack teams’ draft boards. Apparently, during his time at Kutztown, Mobley served as the middle linebacker, goal-line running back, kick returner, and everything else short of the guy taking tickets. And his destruction of the competition in the Blue-Gray Football Classic (a college all-star game that hasn’t even existed since 2003) was so complete that he was invited to the Senior Bowl. It was enough for Gettleman and the Broncos to be convinced that the guy from Kutztown was worth taking with the no. 15 pick in the 1996 draft. Teams make judgments on small-school guys all the time, and hearing Gettleman use an incident from 20 years ago to perfectly illustrate what goes into the decision-making process was pure nerdy football fun."}, {"be80": "San Francisco 49ers coach Kyle Shanahan (AP Images)"}, {"2d0c": "3. New 49ers coach Kyle Shanahan sounds like a guy working with the blankest possible slate. Considering the Niners’ void at the quarterback position and Shanahan’s success with the Falcons’ Matt Ryan last season, San Francisco’s future under center was inevitably going to be a hot topic during his press conference on Wednesday. Following reports that Colin Kaepernick will opt out of his deal next week, Shanahan said that he’s approaching the quarterback position the same way that he is the rest of his roster as free agency nears."}, {"ffa2": "Beyond quarterback, Shanahan was noncommittal about the rest of the players on the Niners offense. When asked about the pass catchers on the roster, he offered a response that didn’t mention anyone by name. The one player Shanahan did have kind things to say about was Carlos Hyde, whom he envisions as a feature back but who still “isn’t a finished product.” Given the flashes Hyde has shown when healthy, that’s saying something."}, {"c5ae": "Outside of Hyde, Shanahan and new San Francisco GM John Lynch will likely work primarily from scratch. With $77 million in cap room and the no. 2 overall pick, they have a chance to build a roster that fits their vision."}, {"633b": "Colin Kaepernick Is Average—and Someone Should Pay HimAfter devastating the NFL in his first few seasons, Kaepernick has settled into a more boring but still valuable place…theringer.com"}, {"cd54": "4. Bengals director of player personnel Duke Tobin remains one of the least-talked-about power players in the NFL — and a true scouting dork. Cincinnati’s front-office hierarchy has long been among the most bizarre in the NFL. Other than the Cowboys, the Bengals are the only franchise in the league whose owner also carries the general manager title. For a while, that left a murky picture of who was actually making the personnel decisions in Cincinnati."}, {"4eb6": "That confusion has dissipated in recent years. This is the second straight combine at which Tobin has addressed the media, and during his press conference he made clear why holding a position that includes a ton of scouting responsibility and almost none of the front-facing obligations of a de facto GM suits him. Asked about which factors the Bengals value most when projecting college wide receivers, Tobin gave a detailed answer that hit on their methods of parsing production. Beyond simply seeing what various players can do, Tobin said he finds it telling when a college team chooses to feature a wideout as the basis of its offense. “[Tyler Boyd] was the focus of what they did there, for a number of years,” Tobin said of the Bengals’ 2016 second-round pick, who had played receiver at Pitt. “We like that — if it’s good enough for [a player’s college team].”"}, {"e587": "Where Tobin really let his football geek out, though, was when fielding a question from SB Nation draft editor Dan Kadar. Kadar asked Tobin about the difficulty of evaluating small-school prospects who come out as juniors, therefore preventing them from participating in postseason all-star games that could provide glimpses of how they’d fare against better competition. Kadar brought up Ashland University tight end Adam Shaheen as an example, and while GMs tend to shy away from questions about specific players in an upcoming draft, Tobin was eager to respond. “Adam is a really interesting guy. The more we dig, the more we like on him.”"}, {"8273": "Shaheen originally attended the University of Pittsburgh–Johnston, a Division II school, to play basketball before transferring to Ashland. With such little football tape available, Tobin said he’d gone through Shaheen’s basketball highlights just to see how he moved as an athlete. We’re talking about maybe the 10th-best tight end prospect in the draft, and Tobin — the highest-ranking member of the Bengals front office — being familiar with his highlights from a sport that he no longer plays."}, {"15c3": "Ranking the Offseason Capital of All 32 NFL TeamsWho’s rich with draft picks and cap space?theringer.com"}, {"823a": "5. After listening to the remarks made by Cleveland GM Sashi Brown, it sure seems like the Browns are willing stick with their version of the Process. Since Brown took the reins in Cleveland last year (as the head of a brain trust that also includes former MLB executive Paul DePodesta), the franchise has shown that its new approach will be defined by two things: value and patience. The Browns were thrilled to accrue a boatload of draft picks by trading the no. 2 overall selection in the 2016 draft to Philadelphia, and if the right offer comes their way, it wouldn’t be a surprise to see them take a similar approach with the no. 1 pick in 2017."}, {"9cc2": "This method of roster building necessitates organization-wide patience, and based on Brown’s tone Wednesday, it feels like Cleveland has it. He was asked multiple times about pending free-agent receiver Terrelle Pryor, and his response to each question suggested that while the team wants to keep Pryor, it won’t betray its vision to make that happen. “I think we’d like to have Terrelle back,” Brown said. “That’s a priority for us. With that being said, we’re not going to panic if he’s not back.”"}, {"87ef": "When the subject of the franchise tag came up, Brown made it sound as if that hadn’t been given much thought in Pryor’s case. Shelling out $15.8 million (this year’s cap figure for receivers) for one season of Pryor doesn’t fall in line with how the Browns want to allocate their resources, even if the team has more than $102 million in available cap space. Eventually, all that cap flexibility and all the picks that Brown’s regime accrues will need to turn into real, significant players. Unlike previous Cleveland front offices, though, this one seems like it’ll be given time to follow through on its plan."}], "content": "NFL Combine Daily Dispatch The Vikings Are Ready to Spend Big in Free Agency Minnesota GM Rick Spielman’s comments suggest that the Vikings could make a big splash once the market opens. Plus, a look at the state of the rebuilding 49ers and Browns. The 2017 NFL combine has arrived, meaning it’s time for prospects to perform drills in their underwear, franchises to chart their futures, and anonymous scouts to provide irresponsible quotes. So who and what is creating the most buzz? The Ringer NFL staff has you covered, providing five thoughts from each day in Indianapolis. 1. In what might have been the biggest shock of the combine’s opening day, the first question posed to Vikings general manager Rick Spielman was not about released running back Adrian Peterson. The initial query was about Sam Bradford, and it surprised Spielman enough for him to admit that he’d lost a dollar bet he had made on which subject would come up first when he stepped to the podium. Spielman has been with the Vikings (first as the vice president of player personnel and then as the GM; he ascended to the latter role in 2012) during Peterson’s entire tenure in Minnesota. The notion of the star running back donning any other uniform has to be bizarre to him in the same way it is for the rest of us. Can Adrian Peterson and Jamaal Charles Outrun History?Not many running backs keep producing at a high level after turning 30, but Peterson and Charles could both thrive in…theringer.com Spielman told reporters that he spoke with Peterson on Friday, and that they had a frank and honest conversation. The message he delivered to AD — and to the Vikings’ other 2017 free agents–to-be, including Captain Munnerlyn and Terence Newman — is that he’d like to bring all of them back, but the likelihood of that happening is fluid. “If we go after some specific positions in free agency,” Spielman said Wednesday, “and we’re planning on spending Z amount of dollars, all of a sudden those dollars increase because of the amount of cap space teams have, then we have to adjust our game plan.” Reading between the lines, that sounds like a GM who’s prepared to be active once free agency opens. This is a team that felt good enough about its roster last fall to trade first- and fourth-round picks for Bradford, and with $38 million or so in available cap space, Spielman has the resources to find upgrades at certain spots. Minnesota desperately needs help along its offensive line; with left tackle Andrew Whitworth and the bevy of guards on the market, it will have opportunities to get it. The Vikings would love to keep Peterson, but there may come a price at which a re-signing no longer makes sense for both sides. 2. One of the combine’s annual hallmarks is longtime personnel people pulling out random anecdotes about bygone players. In the case of new Colts general manager Chris Ballard, this happened as a happy accident. Ballard — who spent 12 years in Chicago’s front office before moving to Kansas City when Andy Reid was hired as the Chiefs head coach in 2013 — misheard a question and thought a reporter was asking him about cornerback Nathan Vasher, whom the Bears drafted out of the University of Texas in 2004. Before Ballard could be informed that the original query was about something different, he told a story about how Vasher made up for a suspect 40-yard-dash time with an incredible performance in the three-cone drill. Vasher, keep in mind, was a fourth-round pick 13 years ago. This was stuff that Ballard could instantly recite. Panthers GM Dave Gettleman is good for at least one of these types of anecdotes every year. In explaining how he has developed his scouting instincts, he credited his history of working with some of the best talent evaluators in league history. And he ain’t lyin’. Gettleman broke into the NFL as a scouting intern with the Bills in 1986, and during his 30-year career he’s worked with the likes of Marv Levy, Mike Shanahan, and Ernie Accorsi, among others. That sort of longevity means plenty of stories, and Gettleman tossed one out Wednesday about evaluating small-school products, and particularly former Broncos linebacker John Mobley. Mobley played his college football at Kutztown University, an 8,500-student school in eastern Pennsylvania that I swear is real. Gettleman used Mobley as an example of just how dominant off-the-radar prospects have to be to crack teams’ draft boards. Apparently, during his time at Kutztown, Mobley served as the middle linebacker, goal-line running back, kick returner, and everything else short of the guy taking tickets. And his destruction of the competition in the Blue-Gray Football Classic (a college all-star game that hasn’t even existed since 2003) was so complete that he was invited to the Senior Bowl. It was enough for Gettleman and the Broncos to be convinced that the guy from Kutztown was worth taking with the no. 15 pick in the 1996 draft. Teams make judgments on small-school guys all the time, and hearing Gettleman use an incident from 20 years ago to perfectly illustrate what goes into the decision-making process was pure nerdy football fun. San Francisco 49ers coach Kyle Shanahan (AP Images) 3. New 49ers coach Kyle Shanahan sounds like a guy working with the blankest possible slate. Considering the Niners’ void at the quarterback position and Shanahan’s success with the Falcons’ Matt Ryan last season, San Francisco’s future under center was inevitably going to be a hot topic during his press conference on Wednesday. Following reports that Colin Kaepernick will opt out of his deal next week, Shanahan said that he’s approaching the quarterback position the same way that he is the rest of his roster as free agency nears. Beyond quarterback, Shanahan was noncommittal about the rest of the players on the Niners offense. When asked about the pass catchers on the roster, he offered a response that didn’t mention anyone by name. The one player Shanahan did have kind things to say about was Carlos Hyde, whom he envisions as a feature back but who still “isn’t a finished product.” Given the flashes Hyde has shown when healthy, that’s saying something. Outside of Hyde, Shanahan and new San Francisco GM John Lynch will likely work primarily from scratch. With $77 million in cap room and the no. 2 overall pick, they have a chance to build a roster that fits their vision. Colin Kaepernick Is Average—and Someone Should Pay HimAfter devastating the NFL in his first few seasons, Kaepernick has settled into a more boring but still valuable place…theringer.com 4. Bengals director of player personnel Duke Tobin remains one of the least-talked-about power players in the NFL — and a true scouting dork. Cincinnati’s front-office hierarchy has long been among the most bizarre in the NFL. Other than the Cowboys, the Bengals are the only franchise in the league whose owner also carries the general manager title. For a while, that left a murky picture of who was actually making the personnel decisions in Cincinnati. That confusion has dissipated in recent years. This is the second straight combine at which Tobin has addressed the media, and during his press conference he made clear why holding a position that includes a ton of scouting responsibility and almost none of the front-facing obligations of a de facto GM suits him. Asked about which factors the Bengals value most when projecting college wide receivers, Tobin gave a detailed answer that hit on their methods of parsing production. Beyond simply seeing what various players can do, Tobin said he finds it telling when a college team chooses to feature a wideout as the basis of its offense. “[Tyler Boyd] was the focus of what they did there, for a number of years,” Tobin said of the Bengals’ 2016 second-round pick, who had played receiver at Pitt. “We like that — if it’s good enough for [a player’s college team].” Where Tobin really let his football geek out, though, was when fielding a question from SB Nation draft editor Dan Kadar. Kadar asked Tobin about the difficulty of evaluating small-school prospects who come out as juniors, therefore preventing them from participating in postseason all-star games that could provide glimpses of how they’d fare against better competition. Kadar brought up Ashland University tight end Adam Shaheen as an example, and while GMs tend to shy away from questions about specific players in an upcoming draft, Tobin was eager to respond. “Adam is a really interesting guy. The more we dig, the more we like on him.” Shaheen originally attended the University of Pittsburgh–Johnston, a Division II school, to play basketball before transferring to Ashland. With such little football tape available, Tobin said he’d gone through Shaheen’s basketball highlights just to see how he moved as an athlete. We’re talking about maybe the 10th-best tight end prospect in the draft, and Tobin — the highest-ranking member of the Bengals front office — being familiar with his highlights from a sport that he no longer plays. Ranking the Offseason Capital of All 32 NFL TeamsWho’s rich with draft picks and cap space?theringer.com 5. After listening to the remarks made by Cleveland GM Sashi Brown, it sure seems like the Browns are willing stick with their version of the Process. Since Brown took the reins in Cleveland last year (as the head of a brain trust that also includes former MLB executive Paul DePodesta), the franchise has shown that its new approach will be defined by two things: value and patience. The Browns were thrilled to accrue a boatload of draft picks by trading the no. 2 overall selection in the 2016 draft to Philadelphia, and if the right offer comes their way, it wouldn’t be a surprise to see them take a similar approach with the no. 1 pick in 2017. This method of roster building necessitates organization-wide patience, and based on Brown’s tone Wednesday, it feels like Cleveland has it. He was asked multiple times about pending free-agent receiver Terrelle Pryor, and his response to each question suggested that while the team wants to keep Pryor, it won’t betray its vision to make that happen. “I think we’d like to have Terrelle back,” Brown said. “That’s a priority for us. With that being said, we’re not going to panic if he’s not back.” When the subject of the franchise tag came up, Brown made it sound as if that hadn’t been given much thought in Pryor’s case. Shelling out $15.8 million (this year’s cap figure for receivers) for one season of Pryor doesn’t fall in line with how the Browns want to allocate their resources, even if the team has more than $102 million in available cap space. Eventually, all that cap flexibility and all the picks that Brown’s regime accrues will need to turn into real, significant players. Unlike previous Cleveland front offices, though, this one seems like it’ll be given time to follow through on its plan. ", "child": "2029_1\t2029_2"}