{"name": "204", "parent": "", "title": "How Successful People Make A Ding In The Universe", "sentences": [{"65ee": "How Successful People Make A Ding In The Universe"}, {"3883": "Steve and Woz, 1975"}, {"97a9": "There are certain common traits of people who put dings in the universe."}, {"19ec": "1. They’re not good at everything."}, {"550b": "“Play to your strengths.”"}, {"a9a4": "“I haven’t got any,” said Harry, before he could stop himself."}, {"f697": "“Excuse me,” growled Moody, “you’ve got strengths if I say you’ve got them. Think now. What are you best at?” ― J.K. Rowling, Harry Potter and the Goblet of Fire"}, {"ef5d": "When Atari hired Steve Jobs and Steve Wozniak to develop a video game in 1976, Wozniak had to build the actual product. Jobs didn’t know how."}, {"afcf": "Woz recalls, “The game (Breakout) was not software in those days. It was hardware. A 6-man month job done in 4 days and nights with no sleep.” Woz was the digital designer, and Steve Jobs was the businessman. Jobs could barely code or program. He knew just enough to know who should be on his technical team."}, {"8493": "They rely on the strengths on others, because they’re not good at everything."}, {"3c31": "2. They make the world go from this:"}, {"bc9a": "to this."}, {"9e20": "(In their heads.)"}, {"9d6d": "They know they can’t do it all, so they pick and say no to everything else."}, {"2be0": "3. They seek the truth, no matter what."}, {"5fea": "The truth has value to people who want to crush it at anything, no matter what, even if it’s ego-bruising."}, {"9411": "They don’t turn away. They invite the truth in, because no matter how ugly it is, it sheds light on what they need to do."}, {"d76c": "They set up every situation so that the truth has the best chance to come out and lay the foundation for all of their decisions."}, {"f045": "“The upside of painful knowledge is so much greater than the downside of blissful ignorance.” — Sheryl Sandberg, Lean In: Women, Work, and the Will To Lead"}, {"c3a5": "4. They’re hyper-realistic."}, {"e181": "People who make dings in the universe know their probabilities better than anyone."}, {"dee0": "Tesla Motors should never have existed. The last American auto company created was 111 years ago, called Ford."}, {"2b78": "When Musk met Eberhard for the first time in 2004, they agreed that their most realistic business plan was to create a vastly superior car, rather than an electric car that sucked a little less."}, {"f0d8": "So they chose the sports car market, a small-size niche of the broader auto market, to attack first. Musk and Eberhard realized beforehand that forcing their way into the more saturated economy car market would be a losing game."}, {"5c83": "Wildly successful people assess their risks in detail before leaping. They handicap their potential failure points, and lay out their plans. They break down whatever’s hazy until it’s nuts and bolts. They make sure their strategy is as viable as possible, strategically and financially, from the get-go."}, {"a0a6": "Then they do it anyway."}, {"f8e9": "“When something is important enough, you do it even if the odds are not in your favor.” — Elon Musk"}, {"6a6b": "5. They see time as their most limited resource, never money."}, {"816b": "“Time abides long enough for those who make use of it.” — Leonardo da Vinci"}, {"7668": "Everything starts here. They know they can use time to make more money, but they can’t use money to buy more time."}, {"dbc9": "People start out with different chips. Some are born rich while others are born poor. Some have Ivy League degrees and others start their careers as high school dropouts. But time is the great equalizer of life. Everyone has the same number of minutes per day."}, {"499f": "Therefore, people who make dings in our world know that they must carve out their time and dedicate it to realize great success at anything. It does not matter what their focus is."}, {"b8ca": "Time is their most valuable resource."}, {"1a66": "Harland David Sanders, founder of Kentucky Fried Chicken, once said, “A tax man told me five years ago if I died, the government would get $900,000 in taxes. I told him if the good Lord let me live three years more I’d give away Uncle Sam’s share and $900,000 more. I never had any desire to be the richest man in the cemetery.”"}, {"f8d8": "6. They’ll listen, but rarely agree."}, {"ffa2": "When he was 22 years old, Walt Disney was told that he “lacked imagination and had no good ideas,” by one of his first bosses."}, {"e25a": "Then he was fired from at the Kansas City Star."}, {"6b54": "He tried to get MGM studios to distribute Mickey Mouse several years later, MGM said that the idea would never work because a giant mouse on the screen would terrify women. He and his brother decided to move to California and start Disney Brothers’ Studio, where they created the terrifying mouse."}, {"4208": "They try to listen to feedback learn every step of the way, but they don’t always agree. They’re often contrarians."}, {"3042": "“Don’t let people talk you into what they think is you.” — Oprah Winfrey"}, {"ddc8": "7. They build A-teams or no teams at all."}, {"8a94": "They’re obsessed with finding the right people. They know that people are everything."}, {"0df3": "Their teams have:"}, {"2798": "Even though the current bias in society is to believe that people are interchangeable and expendable, extremely successful people know this isn’t true. Companies rise and fall based on the people who run them. Their team matters, so they’re super choosy."}, {"c300": "They hire a team who feels the same way about who they hire. Thus, great company cultures are built."}, {"47a9": "“It’s better to hang out with people better than you. Pick out associates whose behavior is better than yours and you’ll drift in that direction.” — Warren Buffett"}, {"8c36": "8. They’re obsessed with improvement."}, {"d125": "“Genius is 1% inspiration and 99% perspiration.” — Thomas Edison"}, {"f607": "It’s simple. As Gary Vaynerchuk says, “1 is greater than 0.”"}, {"daf6": "They know that great achievements happen through a thousand small steps, compounded over time."}, {"e658": "They want to achieve overnight success, just like everyone else. But getting overwhelmed with unrealistic expectations is not an option."}, {"447b": "They do what it takes to improve 1% a day."}, {"8ae3": "9. They don’t ask for permission."}, {"b07b": "“The time is always right to do what is right.” — Martin Luther King Jr."}, {"7299": "J.K. Rowling didn’t feel she needed magic to accomplish anything. While struggling to support her daughter on welfare, Rowling wrote Harry Potter and the Sorcerer’s Stone and sold it for $4,000. She explains: ‘I was as poor as it’s possible to be in this country. I was a single parent.”"}, {"267a": "Sometimes she found herself inspired, but short on paper so she wrote on anything she could find. When she wanted to work out the names of the Hogwarts houses, she scribbled them on the back of an empty vomit bag in an airplane."}, {"57bd": "She’s now richer than the Queen of England."}, {"d1df": "They don’t let their resources hold them back. They find a way, and they sure as hell don’t ask for permission."}, {"9981": "“Anything’s possible if you’ve got enough nerve.” — J. K. Rowling"}, {"36fe": "10. They don’t let “process” become a substitute for thinking."}, {"7e61": "“I don’t believe in process. In fact, when I interview a potential employee and he or she says that ‘it’s all about the process,’ I see that as a bad sign. The problem is that at a lot of big companies, process becomes a substitute for thinking. You’re encouraged to behave like a little gear in a complex machine. Frankly, it allows you to keep people who aren’t that smart, who aren’t that creative.” — Elon Musk"}, {"66cb": "They remember that nothing’s a substitute for creativity."}, {"5282": "Einstein believed that the greatest scientists were artists as well. His insight didn’t come from logic or mathematics, but inspiration. He played music when he got stuck. He never traveled anywhere without his violin, “Lina.”"}, {"8517": "In order to be massively successful, they need to keep their thinking fresh. They never let process get in the way."}, {"c9c4": "11. They’re willing to be unpopular."}, {"c442": "“First they ignore you, then they laugh at you, then they fight you, then you win.” — Mahatma GandhiThey view unpopular thinking as required for all progress."}, {"e2d1": "No one wants to be a martyr. It’s just that thinking about a problem like everyone else will probably not going to lead to any breakthroughs."}, {"8ba2": "They know that popular thinking produces average results. They don’t let popular opinion hold them back."}, {"01d4": "Martin Luther King Jr., 1958"}, {"c4b2": "12. They never stop learning."}, {"b160": "“You can’t learn in school what the world is going to do next year.” — Henry FordThey may have graduated from school a long time ago, but their learning continues forever."}, {"0005": "This is why people who make dings in the universe tend to be voracious readers."}, {"8c66": "When Warren Buffett was once asked about the key to his success, he pointed to a stack of books and said, “Read 500 pages like this every day. That’s how knowledge works. It builds up, like compound interest. All of you can do it, but I guarantee not many of you will do it.”"}, {"a7c3": "He actually used to read 600–1000 pages a day in his youth. Mark Zuckerberg read a book every two weeks through 2015. Oprah Winfrey is always reading. When asked how he learned how to build rockets, Elon Musk replied, “I read books.”"}, {"af43": "They invest in themselves through learning. It’s self-empowering. It never stops."}, {"41b5": "Hit the ❤ button if you liked this article! You’ll help others find it."}, {"2fe0": "Sign up for my free weekly newsletter (packed with thoughts I don’t share anywhere else) at janehwangbo.com."}], "content": "How Successful People Make A Ding In The Universe Steve and Woz, 1975 There are certain common traits of people who put dings in the universe. 1. They’re not good at everything. “Play to your strengths.” “I haven’t got any,” said Harry, before he could stop himself. “Excuse me,” growled Moody, “you’ve got strengths if I say you’ve got them. Think now. What are you best at?” ― J.K. Rowling, Harry Potter and the Goblet of Fire When Atari hired Steve Jobs and Steve Wozniak to develop a video game in 1976, Wozniak had to build the actual product. Jobs didn’t know how. Woz recalls, “The game (Breakout) was not software in those days. It was hardware. A 6-man month job done in 4 days and nights with no sleep.” Woz was the digital designer, and Steve Jobs was the businessman. Jobs could barely code or program. He knew just enough to know who should be on his technical team. They rely on the strengths on others, because they’re not good at everything. 2. They make the world go from this: to this. (In their heads.) They know they can’t do it all, so they pick and say no to everything else. 3. They seek the truth, no matter what. The truth has value to people who want to crush it at anything, no matter what, even if it’s ego-bruising. They don’t turn away. They invite the truth in, because no matter how ugly it is, it sheds light on what they need to do. They set up every situation so that the truth has the best chance to come out and lay the foundation for all of their decisions. “The upside of painful knowledge is so much greater than the downside of blissful ignorance.” — Sheryl Sandberg, Lean In: Women, Work, and the Will To Lead 4. They’re hyper-realistic. People who make dings in the universe know their probabilities better than anyone. Tesla Motors should never have existed. The last American auto company created was 111 years ago, called Ford. When Musk met Eberhard for the first time in 2004, they agreed that their most realistic business plan was to create a vastly superior car, rather than an electric car that sucked a little less. So they chose the sports car market, a small-size niche of the broader auto market, to attack first. Musk and Eberhard realized beforehand that forcing their way into the more saturated economy car market would be a losing game. Wildly successful people assess their risks in detail before leaping. They handicap their potential failure points, and lay out their plans. They break down whatever’s hazy until it’s nuts and bolts. They make sure their strategy is as viable as possible, strategically and financially, from the get-go. Then they do it anyway. “When something is important enough, you do it even if the odds are not in your favor.” — Elon Musk 5. They see time as their most limited resource, never money. “Time abides long enough for those who make use of it.” — Leonardo da Vinci Everything starts here. They know they can use time to make more money, but they can’t use money to buy more time. People start out with different chips. Some are born rich while others are born poor. Some have Ivy League degrees and others start their careers as high school dropouts. But time is the great equalizer of life. Everyone has the same number of minutes per day. Therefore, people who make dings in our world know that they must carve out their time and dedicate it to realize great success at anything. It does not matter what their focus is. Time is their most valuable resource. Harland David Sanders, founder of Kentucky Fried Chicken, once said, “A tax man told me five years ago if I died, the government would get $900,000 in taxes. I told him if the good Lord let me live three years more I’d give away Uncle Sam’s share and $900,000 more. I never had any desire to be the richest man in the cemetery.” 6. They’ll listen, but rarely agree. When he was 22 years old, Walt Disney was told that he “lacked imagination and had no good ideas,” by one of his first bosses. Then he was fired from at the Kansas City Star. He tried to get MGM studios to distribute Mickey Mouse several years later, MGM said that the idea would never work because a giant mouse on the screen would terrify women. He and his brother decided to move to California and start Disney Brothers’ Studio, where they created the terrifying mouse. They try to listen to feedback learn every step of the way, but they don’t always agree. They’re often contrarians. “Don’t let people talk you into what they think is you.” — Oprah Winfrey 7. They build A-teams or no teams at all. They’re obsessed with finding the right people. They know that people are everything. Their teams have: Even though the current bias in society is to believe that people are interchangeable and expendable, extremely successful people know this isn’t true. Companies rise and fall based on the people who run them. Their team matters, so they’re super choosy. They hire a team who feels the same way about who they hire. Thus, great company cultures are built. “It’s better to hang out with people better than you. Pick out associates whose behavior is better than yours and you’ll drift in that direction.” — Warren Buffett 8. They’re obsessed with improvement. “Genius is 1% inspiration and 99% perspiration.” — Thomas Edison It’s simple. As Gary Vaynerchuk says, “1 is greater than 0.” They know that great achievements happen through a thousand small steps, compounded over time. They want to achieve overnight success, just like everyone else. But getting overwhelmed with unrealistic expectations is not an option. They do what it takes to improve 1% a day. 9. They don’t ask for permission. “The time is always right to do what is right.” — Martin Luther King Jr. J.K. Rowling didn’t feel she needed magic to accomplish anything. While struggling to support her daughter on welfare, Rowling wrote Harry Potter and the Sorcerer’s Stone and sold it for $4,000. She explains: ‘I was as poor as it’s possible to be in this country. I was a single parent.” Sometimes she found herself inspired, but short on paper so she wrote on anything she could find. When she wanted to work out the names of the Hogwarts houses, she scribbled them on the back of an empty vomit bag in an airplane. She’s now richer than the Queen of England. They don’t let their resources hold them back. They find a way, and they sure as hell don’t ask for permission. “Anything’s possible if you’ve got enough nerve.” — J. K. Rowling 10. They don’t let “process” become a substitute for thinking. “I don’t believe in process. In fact, when I interview a potential employee and he or she says that ‘it’s all about the process,’ I see that as a bad sign. The problem is that at a lot of big companies, process becomes a substitute for thinking. You’re encouraged to behave like a little gear in a complex machine. Frankly, it allows you to keep people who aren’t that smart, who aren’t that creative.” — Elon Musk They remember that nothing’s a substitute for creativity. Einstein believed that the greatest scientists were artists as well. His insight didn’t come from logic or mathematics, but inspiration. He played music when he got stuck. He never traveled anywhere without his violin, “Lina.” In order to be massively successful, they need to keep their thinking fresh. They never let process get in the way. 11. They’re willing to be unpopular. “First they ignore you, then they laugh at you, then they fight you, then you win.” — Mahatma GandhiThey view unpopular thinking as required for all progress. No one wants to be a martyr. It’s just that thinking about a problem like everyone else will probably not going to lead to any breakthroughs. They know that popular thinking produces average results. They don’t let popular opinion hold them back. Martin Luther King Jr., 1958 12. They never stop learning. “You can’t learn in school what the world is going to do next year.” — Henry FordThey may have graduated from school a long time ago, but their learning continues forever. This is why people who make dings in the universe tend to be voracious readers. When Warren Buffett was once asked about the key to his success, he pointed to a stack of books and said, “Read 500 pages like this every day. That’s how knowledge works. It builds up, like compound interest. All of you can do it, but I guarantee not many of you will do it.” He actually used to read 600–1000 pages a day in his youth. Mark Zuckerberg read a book every two weeks through 2015. Oprah Winfrey is always reading. When asked how he learned how to build rockets, Elon Musk replied, “I read books.” They invest in themselves through learning. It’s self-empowering. It never stops. Hit the ❤ button if you liked this article! You’ll help others find it. Sign up for my free weekly newsletter (packed with thoughts I don’t share anywhere else) at janehwangbo.com. ", "child": "204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24204_1\t204_2\t204_3\t204_4\t204_5\t204_6\t204_7\t204_8\t204_9\t204_10\t204_11\t204_12\t204_13\t204_14\t204_15\t204_16\t204_17\t204_18\t204_19\t204_20\t204_21\t204_22\t204_23\t204_24"}