{"name": "205", "parent": "", "title": "Blogging is the new Blockbuster Video. Do this instead.", "sentences": [{"8958": "Blogging is the new Blockbuster Video. Do this instead."}, {"acda": "Remember 2002?"}, {"5dc4": "One Friday in 2002, you went into Little Caesars for a $5 Hot and Ready pepperoni pizza, then headed next door to Blockbuster and spent a twenty renting a few movies for the weekend."}, {"b0ba": "Cost: $25 for a pizza and three movies."}, {"a951": "And then the next Friday, you skipped Blockbuster because there was a little red box in front of Little Caesar’s and it spit out a movie for $1 a night. And you never looked back."}, {"1b5e": "Cost: $8 for a pizza and three movies."}, {"b411": "Not only that, but you were a laggard. Because your friends were already getting little red envelopes in the mail with their movies — as many as they could watch for something like $7 a month. Plus streaming."}, {"d3ba": "Cost: $5.25-ish for a pizza and a night of Netflix (and chill, if you’re feeling it.)"}, {"acbb": "Literally, one day movie rentals were a huge part of your life. The next they weren’t even on your radar anymore. And then next the storefronts were empty. And now, I bet you don’t even use Red Box anymore."}, {"ff11": "I haven’t even used my DVD player in at least three years."}, {"9a6c": "Blogging is doing that kind of jump-the-shark dance."}, {"21a1": "I mean — you COULD spend a bunch of money designing a website and getting your blog all pretty before you launch it into the world. Plenty of people are still cramming your email inbox full of sales messages for expensive classes teaching you how to do what worked for them in 2012."}, {"9e58": "But the reality is that you don’t have to anymore."}, {"c969": "Blockbuster died because someone came along and offered a better user experience. And then someone came along and offered an EVEN BETTER user experience."}, {"344a": "I really think that the Netflix of the blogging world is the vast improvement in email servers and publication platforms over the last couple of years."}, {"93a1": "Seriously: even two years ago, your only real choice was to spend your blog startup funds on hosting and designing a self-hosted blog."}, {"ef1e": "Now? You can spend $29 a month on ConvertKit and get a service that is multitudes sleeker and more robust than the clunky, confusing free MailChimp account most bloggers start with."}, {"9728": "ConvertKit will let you build a landing page, if you need one in the beginning. A single page to point people to when you have something you need to tell them. Or sell them. Or sign them up for."}, {"6c00": "And you can host your content right here on Medium. For free. Right here, where there are already readers. Where there are publications searching for good content to promote. Where you aren’t throwing out blog posts like messages in the bottle, hoping for lightening to strike."}, {"7e14": "Okay, that was a mixed metaphor, but if you’ve tried to do this for any length of time, you know what I’m talking about."}, {"797d": "Here’s what happened when I blogged every day for 30 days on Medium."}, {"6da9": "Check it out. Some pretty awesome stuff happened. You wouldn’t want to read what happens when I blog every day for 30 days on my blog. Because it’s nothing. Nothing happens. If I don’t drive my own traffic to my blog, via my email list or Facebook ads, nothing happens."}, {"66e1": "Pretty much, nothing happens anyway. My blog is a silent receptacle for my work. Like a warehouse hardly anyone ventures to, unless I send them there."}, {"863f": "I blogged every day for a month. Here’s what happened.The results of a Quora + Medium experiment.medium.com"}, {"4558": "I wrote that post two weeks ago. There’s a screenshot of my Medium stats, showing about 36,000 page views and my blog stats showing about 18,000 page views."}, {"bb70": "Here’s a screenshot from right this minute"}, {"8d51": "My views on Medium quadrupled with two weeks of daily writing here."}, {"796f": "That’s not something you’ll see after six weeks of blogging on Wordpress."}, {"e5e8": "Okay. Let’s talk about how to use Medium and ConvertKit together."}, {"c3cb": "Use Upscribe, integrated with ConvertKit, to make a pretty little form to add to your Medium posts, and you’ll start building the only thing that really matters today when it comes to blogging: an email list."}, {"0678": "Host that lovely list on ConvertKit and you’ll never be sorry. You can set up a drip course, automate your list to tag your followers in a thousand different ways, and easily send out broadcasts to just the people you want to reach."}, {"53da": "Once you have a nice little following, and maybe you have some income coming in, then head over to Bluehost and get that self-hosted Wordpress blog. Repost your Medium work over there. Write fresh stuff and cross-post it to Medium. Send your email list there when you have something new to show them."}, {"a259": "But you don’t have to."}, {"4857": "If you only have a little money to spend your new online enterprise, spend it on the best email server you can."}, {"6d2e": "And if you have plenty of money? Start a blog. But still use ConvertKit and Medium — go back and look at my screenshots if you need a reminder of why."}, {"6dbe": "They’re offering a free class starting April 24 that I’m really looking forward to. It’s all about how to build that thing that will get your enterprise making a little money. You can sign up here. Participants get a free month to give ConvertKit a try."}, {"b7d6": "I’ll be offering a thing in May all about Anti-Blogging for Creatives. Want me to let you know when it’s live? Leave your email in the form below."}, {"7eba": "If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤"}, {"194b": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "content": "Blogging is the new Blockbuster Video. Do this instead. Remember 2002? One Friday in 2002, you went into Little Caesars for a $5 Hot and Ready pepperoni pizza, then headed next door to Blockbuster and spent a twenty renting a few movies for the weekend. Cost: $25 for a pizza and three movies. And then the next Friday, you skipped Blockbuster because there was a little red box in front of Little Caesar’s and it spit out a movie for $1 a night. And you never looked back. Cost: $8 for a pizza and three movies. Not only that, but you were a laggard. Because your friends were already getting little red envelopes in the mail with their movies — as many as they could watch for something like $7 a month. Plus streaming. Cost: $5.25-ish for a pizza and a night of Netflix (and chill, if you’re feeling it.) Literally, one day movie rentals were a huge part of your life. The next they weren’t even on your radar anymore. And then next the storefronts were empty. And now, I bet you don’t even use Red Box anymore. I haven’t even used my DVD player in at least three years. Blogging is doing that kind of jump-the-shark dance. I mean — you COULD spend a bunch of money designing a website and getting your blog all pretty before you launch it into the world. Plenty of people are still cramming your email inbox full of sales messages for expensive classes teaching you how to do what worked for them in 2012. But the reality is that you don’t have to anymore. Blockbuster died because someone came along and offered a better user experience. And then someone came along and offered an EVEN BETTER user experience. I really think that the Netflix of the blogging world is the vast improvement in email servers and publication platforms over the last couple of years. Seriously: even two years ago, your only real choice was to spend your blog startup funds on hosting and designing a self-hosted blog. Now? You can spend $29 a month on ConvertKit and get a service that is multitudes sleeker and more robust than the clunky, confusing free MailChimp account most bloggers start with. ConvertKit will let you build a landing page, if you need one in the beginning. A single page to point people to when you have something you need to tell them. Or sell them. Or sign them up for. And you can host your content right here on Medium. For free. Right here, where there are already readers. Where there are publications searching for good content to promote. Where you aren’t throwing out blog posts like messages in the bottle, hoping for lightening to strike. Okay, that was a mixed metaphor, but if you’ve tried to do this for any length of time, you know what I’m talking about. Here’s what happened when I blogged every day for 30 days on Medium. Check it out. Some pretty awesome stuff happened. You wouldn’t want to read what happens when I blog every day for 30 days on my blog. Because it’s nothing. Nothing happens. If I don’t drive my own traffic to my blog, via my email list or Facebook ads, nothing happens. Pretty much, nothing happens anyway. My blog is a silent receptacle for my work. Like a warehouse hardly anyone ventures to, unless I send them there. I blogged every day for a month. Here’s what happened.The results of a Quora + Medium experiment.medium.com I wrote that post two weeks ago. There’s a screenshot of my Medium stats, showing about 36,000 page views and my blog stats showing about 18,000 page views. Here’s a screenshot from right this minute My views on Medium quadrupled with two weeks of daily writing here. That’s not something you’ll see after six weeks of blogging on Wordpress. Okay. Let’s talk about how to use Medium and ConvertKit together. Use Upscribe, integrated with ConvertKit, to make a pretty little form to add to your Medium posts, and you’ll start building the only thing that really matters today when it comes to blogging: an email list. Host that lovely list on ConvertKit and you’ll never be sorry. You can set up a drip course, automate your list to tag your followers in a thousand different ways, and easily send out broadcasts to just the people you want to reach. Once you have a nice little following, and maybe you have some income coming in, then head over to Bluehost and get that self-hosted Wordpress blog. Repost your Medium work over there. Write fresh stuff and cross-post it to Medium. Send your email list there when you have something new to show them. But you don’t have to. If you only have a little money to spend your new online enterprise, spend it on the best email server you can. And if you have plenty of money? Start a blog. But still use ConvertKit and Medium — go back and look at my screenshots if you need a reminder of why. They’re offering a free class starting April 24 that I’m really looking forward to. It’s all about how to build that thing that will get your enterprise making a little money. You can sign up here. Participants get a free month to give ConvertKit a try. I’ll be offering a thing in May all about Anti-Blogging for Creatives. Want me to let you know when it’s live? Leave your email in the form below. If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "child": "205_1\t205_2\t205_3\t205_4\t205_5\t205_6\t205_7\t205_8\t205_9\t205_10\t205_11\t205_12\t205_13\t205_14\t205_15\t205_16\t205_17\t205_18\t205_19\t205_20205_1\t205_2\t205_3\t205_4\t205_5\t205_6\t205_7\t205_8\t205_9\t205_10\t205_11\t205_12\t205_13\t205_14\t205_15\t205_16\t205_17\t205_18\t205_19\t205_20"}