{"name": "2079", "parent": "", "title": "The Discomfort of Abundance", "sentences": [{"8eb0": "The Discomfort of Abundance"}, {"66e2": "3 Ways to start receiving without guilt."}, {"c950": "Have you ever noticed how uncomfortable we feel when we receive? Whether it’s an unexpected show of kindness or a small gift, or even a miracle that occurred in our lives, we tend to feel joyous and grateful — but while we’re doing our happy dance we keep getting tripped up by an uncomfortable sensation in the pit of our stomach."}, {"958d": "It’s not uncommon to feel guilt or unworthiness when the universe showers us with abundance. It’s usually a small feeling, lingering in the background, hiding somewhere behind the gratitude, but if you pay attention, you’ll notice it."}, {"33cb": "On the face of it, this sounds ludicrous. How can we feel anything but gratitude and happiness when we receive the gifts of life? The reason is simple — it’s because, deep down, we actually believe that any show of abundance is a once off event. Therefore we should count ourselves really lucky, don’t make too much fuss about it, and certainly don’t expect it to happen again tomorrow. Once it’s over, we figure that we simply go back to ordinary, non-abundant life until it’s our turn to receive again at some distant, uncontrollable point in the future — if we’re lucky enough."}, {"17f0": "So while we talk about abundance, do our affirmations and visualizations, and pretend like we believe in the endless bountifulness of life, our core belief is often that abundance is actually a random, once-off event — and if we’re in the right place at the right time, the universe might notice us (and our lists of affirmations and that colorful visionboard hanging on the bedroom wall)."}, {"2f4b": "If we didn’t have this fallacious belief hiding in our mind, we wouldn’t feel any trepidation when we receive abundance — we would simply enjoy it to the full. We would share freely, enjoy openly, and rest assured knowing that tomorrow will be another completely abundant day."}, {"57de": "Recognizing this sneaky belief wedged into our subconscious mind is one thing, but rooting it out and replacing it with another healthier belief is even more important. Feeling uncomfortable with receiving abundance is like putting up a wall with a big sign on it that says, “No Abundance Allowed.”"}, {"b619": "Luckily, we are in charge of our own minds and we can choose what we believe. Here are 3 easy ways to overcome the erroneous belief that abundance is a once-off event, which will help to make you feel much more comfortable with receiving the riches that life has to offer:"}, {"9fca": "1. Challenge the validity of the false belief that is causing your discomfort by recognizing that you have always been abundant."}, {"b52b": "Write a list of all the ways in which you have been abundant in your life up until now. Include every manifestation of abundance in your life, for example: good health, enough money, steady and satisfying employment, good weather where you live, loyal and supportive friends, lots to laugh about, and any other wonderful thing in your life."}, {"d8cb": "Noticing — in black and white — how abundant you have always been is a direct challenge to the discomfort that comes with receiving more abundance. It completely negates the false belief that abundance is a once-off lucky occurrence."}, {"7d52": "2. Train yourself to be comfortable with abundance, starting right now."}, {"1567": "The most effective way to do this is to simply say, “thank you” every time you notice abundance in your day. Once you start, you’ll find you can’t stop. That’s how abundant you really are — right now. I’ve done this many times, and challenged clients to do the same, and without fail we always find abundance scattered throughout the day — even the bad days."}, {"1c7b": "3. Say simple affirmations."}, {"4828": "Affirmations are hands down the best way to reprogram your mind and replace old, false beliefs with new, vibrant ones. Write your own, or use one of the examples below. Say them, write them, and think them often. Affirmations work through consistency, so keep at it."}, {"6b55": "Share this article:"}, {"04be": "Click here to view all articles"}, {"4928": "Originally published at www.tut.com."}], "content": "The Discomfort of Abundance 3 Ways to start receiving without guilt. Have you ever noticed how uncomfortable we feel when we receive? Whether it’s an unexpected show of kindness or a small gift, or even a miracle that occurred in our lives, we tend to feel joyous and grateful — but while we’re doing our happy dance we keep getting tripped up by an uncomfortable sensation in the pit of our stomach. It’s not uncommon to feel guilt or unworthiness when the universe showers us with abundance. It’s usually a small feeling, lingering in the background, hiding somewhere behind the gratitude, but if you pay attention, you’ll notice it. On the face of it, this sounds ludicrous. How can we feel anything but gratitude and happiness when we receive the gifts of life? The reason is simple — it’s because, deep down, we actually believe that any show of abundance is a once off event. Therefore we should count ourselves really lucky, don’t make too much fuss about it, and certainly don’t expect it to happen again tomorrow. Once it’s over, we figure that we simply go back to ordinary, non-abundant life until it’s our turn to receive again at some distant, uncontrollable point in the future — if we’re lucky enough. So while we talk about abundance, do our affirmations and visualizations, and pretend like we believe in the endless bountifulness of life, our core belief is often that abundance is actually a random, once-off event — and if we’re in the right place at the right time, the universe might notice us (and our lists of affirmations and that colorful visionboard hanging on the bedroom wall). If we didn’t have this fallacious belief hiding in our mind, we wouldn’t feel any trepidation when we receive abundance — we would simply enjoy it to the full. We would share freely, enjoy openly, and rest assured knowing that tomorrow will be another completely abundant day. Recognizing this sneaky belief wedged into our subconscious mind is one thing, but rooting it out and replacing it with another healthier belief is even more important. Feeling uncomfortable with receiving abundance is like putting up a wall with a big sign on it that says, “No Abundance Allowed.” Luckily, we are in charge of our own minds and we can choose what we believe. Here are 3 easy ways to overcome the erroneous belief that abundance is a once-off event, which will help to make you feel much more comfortable with receiving the riches that life has to offer: 1. Challenge the validity of the false belief that is causing your discomfort by recognizing that you have always been abundant. Write a list of all the ways in which you have been abundant in your life up until now. Include every manifestation of abundance in your life, for example: good health, enough money, steady and satisfying employment, good weather where you live, loyal and supportive friends, lots to laugh about, and any other wonderful thing in your life. Noticing — in black and white — how abundant you have always been is a direct challenge to the discomfort that comes with receiving more abundance. It completely negates the false belief that abundance is a once-off lucky occurrence. 2. Train yourself to be comfortable with abundance, starting right now. The most effective way to do this is to simply say, “thank you” every time you notice abundance in your day. Once you start, you’ll find you can’t stop. That’s how abundant you really are — right now. I’ve done this many times, and challenged clients to do the same, and without fail we always find abundance scattered throughout the day — even the bad days. 3. Say simple affirmations. Affirmations are hands down the best way to reprogram your mind and replace old, false beliefs with new, vibrant ones. Write your own, or use one of the examples below. Say them, write them, and think them often. Affirmations work through consistency, so keep at it. Share this article: Click here to view all articles Originally published at www.tut.com. ", "child": "2079_1\t2079_2\t2079_3\t2079_42079_1\t2079_2\t2079_3\t2079_4"}