{"name": "2084", "parent": "", "title": "When You Plant Trees In The Sky", "sentences": [{"3b62": "When You Plant Trees In The Sky"}, {"38f9": "We have entered the second quarter of 2017."}, {"6ef3": "And I find that my readership at Medium.com has crawled to a near standstill compared to how my stories were consumed in last few months of 2016."}, {"4f82": "Gone are the thousands of views and hundreds of “likes.”"}, {"dd55": "The congratulatory emails from Medium that say “top writer” or some other acknowledgment of a metric that ends with a zero, or two or three, is now at a trickle."}, {"9bce": "In 2016 as millions of readers discovered Medium’s platform, my contribution to the readership’s well-being rolled right along. The borrowed real estate of third party websites introduced a lot of eyeballs to my ideas."}, {"b95c": "My stories shared space with other deep thinking writers — I felt like I had joined the “popular writer’s club.”"}, {"0b38": "So what happened?"}, {"cc0d": "The Engagement That Matters"}, {"4a7b": "Extraordinary growth over a short period can be addictive. Positive change results in wanting more positive change."}, {"ff3e": "Beneath this rapid rise, was my enlightened awareness of something different. It felt like I was growing a big tree with no roots. Even worse, I watched as an unhealthy ecosystem shallowly expanded outwards."}, {"1bd5": "Along with the millions of readers on Medium, came millions of new submitters of content who promoted “click bait” headlines and regurgitated stories. Although I enjoyed the proximity to a few excellent storytellers, I withdrew my writing from prestigious publications on Medium where I fought to be heard alongside content that chases the shortest attention spans."}, {"fd7c": "I asked myself an important question:"}, {"6e1e": "What’s more important — tons of people voting “nice job” with a click, or one person who deeply interacts with an original idea that I create?"}, {"a187": "Let the Replanting Begin"}, {"36ba": "I redirected my work. In very small steps."}, {"5a02": "Specifically, I stopped creating in the *sky* and found new dirt. I tell the stories that I need to hear and share ideas upon which I need to act NOW."}, {"663e": "The Change Was Immediate"}, {"5f55": "My creative tree roots are growing deeper than my sky-reaching tree limbs."}, {"44d7": "I witness the results in real time as my Sundays are now enriched by meaningful one-on-one conversations with Sunday Morning Joe and Medium readers."}, {"a329": "More than ever, you respond about my ideas and suggestions with your deep and detailed emails, texts, and phone calls."}, {"7211": "It’s like we are right here together sharing conversations and coffee."}, {"4aca": "And the conversations continue beyond Sundays. This month is full of scheduled calls and in person meet-ups, all with the same theme: figuring out ways to make a difference together."}, {"5d7c": "I Bet You Have A Tree That Needs Replanting"}, {"8ac8": "Let’s talk about that."}, {"e4bb": "Maybe you are a musical artist or songwriter and you regularly feel external pressure to write a song the night before a recording session? Or because of some self-imposed “write a song a day” task. Your profession is a tree that could use a replant."}, {"1d8a": "Maybe you are an accountant who takes on additional clients because there is pressure to grow your firm, only to find that the tax preparation of your current clients must be pushed into late filing. Replant your tree."}, {"1d93": "Maybe you own a sports equipment company and no longer do you have time to participate in the sports you love. It’s replanting time."}, {"2f44": "What is your tree that has more limbs in the sky than roots in the earth? I’d like to hear from you."}, {"3ae3": "Spring is upon us. Replant that tree."}, {"5e5b": "With gratitude,"}, {"05a7": "Joe"}, {"87fa": "Hi, I’m Joe. I teach my clients the advanced techniques necessary to reveal talents which have been set to idle due to external and internal distractions."}, {"6541": "I, then, transfer my Olympic Gold Medal performance strategies that streamline decision making and actions when engaged in complicated life currents with an aim towards the freedom of playing your own game."}, {"9b61": "*Last Call for Gold Medal Mastermind* We’ve completed the first two sessions of the Gold Medal Mastermind. So far, our group has had great discussions and exchanges of ideas. The peer-to-peer support is inspiring. If you’d like to come into our group, you can easily catch up on the past two calls (view them anytime on our private Facebook page) and join us for the remaining 18 weeks of live video calls. Check out this program overview video and our Gold Medal Mastermind website to learn more."}], "content": "When You Plant Trees In The Sky We have entered the second quarter of 2017. And I find that my readership at Medium.com has crawled to a near standstill compared to how my stories were consumed in last few months of 2016. Gone are the thousands of views and hundreds of “likes.” The congratulatory emails from Medium that say “top writer” or some other acknowledgment of a metric that ends with a zero, or two or three, is now at a trickle. In 2016 as millions of readers discovered Medium’s platform, my contribution to the readership’s well-being rolled right along. The borrowed real estate of third party websites introduced a lot of eyeballs to my ideas. My stories shared space with other deep thinking writers — I felt like I had joined the “popular writer’s club.” So what happened? The Engagement That Matters Extraordinary growth over a short period can be addictive. Positive change results in wanting more positive change. Beneath this rapid rise, was my enlightened awareness of something different. It felt like I was growing a big tree with no roots. Even worse, I watched as an unhealthy ecosystem shallowly expanded outwards. Along with the millions of readers on Medium, came millions of new submitters of content who promoted “click bait” headlines and regurgitated stories. Although I enjoyed the proximity to a few excellent storytellers, I withdrew my writing from prestigious publications on Medium where I fought to be heard alongside content that chases the shortest attention spans. I asked myself an important question: What’s more important — tons of people voting “nice job” with a click, or one person who deeply interacts with an original idea that I create? Let the Replanting Begin I redirected my work. In very small steps. Specifically, I stopped creating in the *sky* and found new dirt. I tell the stories that I need to hear and share ideas upon which I need to act NOW. The Change Was Immediate My creative tree roots are growing deeper than my sky-reaching tree limbs. I witness the results in real time as my Sundays are now enriched by meaningful one-on-one conversations with Sunday Morning Joe and Medium readers. More than ever, you respond about my ideas and suggestions with your deep and detailed emails, texts, and phone calls. It’s like we are right here together sharing conversations and coffee. And the conversations continue beyond Sundays. This month is full of scheduled calls and in person meet-ups, all with the same theme: figuring out ways to make a difference together. I Bet You Have A Tree That Needs Replanting Let’s talk about that. Maybe you are a musical artist or songwriter and you regularly feel external pressure to write a song the night before a recording session? Or because of some self-imposed “write a song a day” task. Your profession is a tree that could use a replant. Maybe you are an accountant who takes on additional clients because there is pressure to grow your firm, only to find that the tax preparation of your current clients must be pushed into late filing. Replant your tree. Maybe you own a sports equipment company and no longer do you have time to participate in the sports you love. It’s replanting time. What is your tree that has more limbs in the sky than roots in the earth? I’d like to hear from you. Spring is upon us. Replant that tree. With gratitude, Joe Hi, I’m Joe. I teach my clients the advanced techniques necessary to reveal talents which have been set to idle due to external and internal distractions. I, then, transfer my Olympic Gold Medal performance strategies that streamline decision making and actions when engaged in complicated life currents with an aim towards the freedom of playing your own game. *Last Call for Gold Medal Mastermind* We’ve completed the first two sessions of the Gold Medal Mastermind. So far, our group has had great discussions and exchanges of ideas. The peer-to-peer support is inspiring. If you’d like to come into our group, you can easily catch up on the past two calls (view them anytime on our private Facebook page) and join us for the remaining 18 weeks of live video calls. Check out this program overview video and our Gold Medal Mastermind website to learn more. ", "child": "2084_1\t2084_2\t2084_3\t2084_42084_1\t2084_2\t2084_3\t2084_4"}