{"name": "2089", "parent": "", "title": "30 Things I’ve Learned in 30 Years About Startups, Dating, Travel and More", "sentences": [{"568c": "30 Things I’ve Learned in 30 Years About Startups, Dating, Travel and More"}, {"90d5": "Today I’m 30. Young enough to still talk with friends about how well we’re “adulting.” Old enough to have a real career and opinions about “kids these days,” including my own nieces and nephews, who use lip-syncing social networks I don’t understand."}, {"7c9c": "Possibly as just a self-indulgence (so millennial of me, right?), but hopefully because it will be helpful or interesting to others, I am going to share 30 things I have learned to be true over the past 30 years."}, {"9e06": "On Startups"}, {"8b43": "Most startups fail. Of course you believe it’s going to be big. Feeling that way is the ONLY way you should ever take a job at an early-stage startup. But don’t ever plan on it. Don’t count it as compensation. It’s a pot of gold at the end of a rainbow. Also, if your company refuses to help you understand the last valuation of the equity being offered to you, your strike price, and what this means for you, then be very wary."}, {"38ef": "2. Keep your eyes on the long game while focusing very short-term to succeed. Startups require laser focus on the next step. Without that next step you will never get to your goal at a startup. Startups don’t have the leeway that big companies do. They can’t plan the next 9 months carefully. Instead you keep the big vision in mind and then just keep putting one step in front of the other."}, {"07a6": "3. Your best work happens when you’re having fun."}, {"ab2b": "I truly believe pushing hard while having fun is where the magic happens. An occasional bad day or having some parts of your job you don’t love is totally normal. However, if you find yourself waking up dreading going to work, I’d highly advise thinking about what’s next."}, {"a927": "4. Be gentle with people who are working really hard. It’s not uncommon for startups to involve some late nights. If you are working with someone who has just worked a few late nights, gone on a long work trip or otherwise seems overly stressed and tired at that moment, save your criticism for another time. Say something nice, maybe a virtual high five GIF, and make a note to mention the constructive feedback once they’re rested. Hopefully they will do the same for you when you need it."}, {"a8c4": "On Jobs in General"}, {"3552": "5. If you don’t ask for it, you won’t get it. If you want a raise, the ability to work from home, a promotion, new job responsibilities or just about anything, you should ask. Your manager has a lot going on. If you are doing a good job they will try to do right by you, but you will very rarely get what you’re hoping for professionally if you don’t ask for it. You can “Lean In” as Sheryl Sandberg would say, by asking for a yearly review and then pushing for a raise, by asking for feedback regularly, or by explaining how something you want (i.e. working from home twice a week) will make you more productive."}, {"31dd": "6. Tell people when they’re doing a good job."}, {"4765": "If you have great employees or coworkers there are probably many times where you think to yourself “Thank God for Person X” or “I love working with Person Y” or “Work just wouldn’t be the same without Person Z.” Don’t just think it; share it. A super short email or slack message will do the trick. Everyone likes to hear positive feedback, it keeps us feeling motivated and happy. It also builds better relationships."}, {"e052": "7. About 80% of your work happiness is about how much you enjoy the people you work with."}, {"9a68": "This is my favorite image to send around the Octane AI slack channel"}, {"877c": "That’s not a scientific number, but I’ve realized over time that the majority of my job satisfaction is determined by who I work with. If I like them, am learning from them and we mutually respect each other, then I am generally happy to go to work in the morning. Find your tribe, not just your job."}, {"b988": "8. Always be learning."}, {"42c3": "The business world is constantly changing. As long as you are in a role where you’re always learning you’re setting yourself up to grow with it. If you stop learning, be very wary. Also, when I’m not learning at a job, I’m not having fun."}, {"f659": "On Being a Woman in Tech"}, {"0d62": "9. Yes, I have some of those stories too."}, {"ba01": "Yes, there is still an issue. Every woman in tech I know has some of those stories. Let’s try to change that for the next generation."}, {"86e7": "10. Guys, you can absolutely help make the situation better. I wrote up some tips on that."}, {"053f": "11. Don’t tell me you want me to speak because you need a woman on the panel. I admire your attempts to increase diversity at your event. It’s 100% important for event planners to think about this. As an industry we are so tired of all-male panels. But of course there are reasons you wanted me to speak, aside from my gender. Tell me those reasons."}, {"b74e": "On Love and Dating"}, {"1481": "12. When you’re single, think of every bad date as a fun story to tell your friends."}, {"6552": "This always helped me. As the date was going terribly I would start storing fun anecdotes to retell to my friends later. This made dating fun to talk about even if not always fun in the moment."}, {"d54c": "13. Try online dating. Aren’t we all over the stigma by now? Give it a try. Be safe about how you meet people, of course, but do try it. It’ll teach you a lot about what you are really looking for. You will have a lot of fun dates and you will have a lot of great stories. I met my fiancé on OKCupid so obviously I am a fan."}, {"681d": "14. When you find “the one” you know. I remember hearing people say this and I would wonder if I would ever feel that way. Now that I’m on the other side (I’m getting married this summer) I am very happy to report that it is true, when I found the right person, I knew."}, {"933a": "15. Never let anyone else tell you how your relationship “should” be. A relationship is like an iceberg in that from the outside your friends and family can only see a very small piece of it. Relationships are such a personal thing. There is no right amount of time to spend together, no right timeframe to move to the next step. It has to feel right to you and exactly one other person — the person you’re in the relationship with — and that’s it."}, {"7ada": "16. The right person won’t ask you to choose between a career you’re passionate about and them. They will see you care about it and they will understand when you need to work late, go on a business trip or are so focused on work you literally “don’t hear them.” If you ask my fiancé, when I’m focused on work I tune the rest of the world out. I call this the “open office effect” and it appears to be a permanent change in auditory focus even though I work from home now."}, {"908b": "17. With the right person you will soon realize they matter more to you than work."}, {"3443": "They won’t ask you to choose, but for the important things, you will choose them because it feels right. It will happen naturally."}, {"edc2": "On Friends"}, {"b24f": "18. Friendship tends to work best on even ground. A friendship can’t last long if one friend is putting a lot more into it than the other. We may give in different ways (maybe you’re a planner but your friend is always down for spontaneous fun) but friendship should involve some give and take so no person feels taken advantage of. Nothing is worse for a friendship than resentment. That being said, a friend who is generally there for you but goes through a rough time deserves a break."}, {"9218": "19. Friends who are consistently there for you are amazing. Go above and beyond for them in return. Especially in adulthood, it becomes increasingly rare for people to truly be there for each other. If you have friends like that, make sure you do the same for them. Treasure them."}, {"f638": "20. Celebrate special moments with your friends. Birthdays, promotions, weddings… there are certain moments in a friend’s life that will disproportionately affect how they feel about your friendship. Having to miss the occasional dinner is not a big deal; but consistently missing their big moments will wear on the friendship."}, {"b594": "On Travel"}, {"dd2c": "21. Vacations and travel are critical to being a creative, productive person."}, {"f103": "I have never regretted taking a trip. I have regretted not taking one. Work will still be there when you get back but you, on the other hand, will be mentally refreshed and ready for it. Travel changes your mental perspective. It gets you out of your routine and shows you something new. It doesn’t always have to be a big trip; even going on a day trip or long weekend can make a huge difference."}, {"ee71": "22. Make the big trips you dream of a reality by booking non-refundable tickets in advance. Booking way in advance can help with finding deals; but the real reason is that when the trip is already booked, you will go. However, if the time comes and it’s not booked, you will often find a reason that you can’t go right now. Once booked, put it in your work calendar and tell your colleagues. They might wonder why you are telling them 9 months ahead of time, but when the time comes everyone will be prepared."}, {"55b6": "On Advice"}, {"d332": "23. My dad always taught me advice is best given without strings attached. By that he means that someone who gives advice and then resents if his or her advice isn’t taken is not a good advice giver. Life is not a one-size-fits all world. Give and take advice freely, but then do exactly what feels right, and nothing else."}, {"16a9": "24. The best advice-givers often tease out how you feel about the situation rather than decide for you. When making a big life decision, no one else can make that for you, but sometimes friends and family can ask you questions that help you reveal the right decision. Treasure these people."}, {"4247": "On Being 30"}, {"f406": "25. I know so little. The more I learn the more I realize how little I know. You should absolutely listen to someone turning 60, or 90, instead of me."}, {"8709": "26. I care a bit less about everyone liking me. And it’s such a relief."}, {"da72": "Don’t get me wrong, I haven’t reached that “I don’t give a f**k” state that others talk about. But I care a lot less than I did as an insecure young adult and it’s such a huge relief. I’m looking forward to caring even less as I get older."}, {"b68d": "27. I’m more cognizant than ever of my parents’ mortality. Morbid, but true. I think much more now about how no matter how long I have with my parents (and I hope SO MUCH more time) it will probably not be as much time as I want. I feel very lucky to have amazing, supportive parents who I not only love but I genuinely enjoy hanging out with. I am going to spend as much time with them as possible."}, {"a827": "28. Being without internet freaks me out, but makes me so productive. I wrote this entire post (and this one on bots) because I was on a plane with broken wifi. First, I freaked out, “what am I going to do with 6 hours without wifi?!” Then, I started writing and it just poured out of me. Sidenote: if you want to question whether writing this post was truly productive, I will absolutely not blame you"}, {"9595": "29. Regular exercise, sleep and great food are so much better than staying out past 3am. I remember when I used to consider a great Saturday night one when I stayed out super late dancing. The hangover and late (/early?) hour were a badge of honor. Now I laugh at past Megan and love being in bed by midnight and doing a SoulCycle class on Sunday mornings."}, {"5ae8": "30. Experiences are *way* better than things."}, {"0f9d": "There’s plenty of science to back this up — spending money on experiences is a much better way to increase your happiness than spending money on things. Leave the new tv aside and use your money to go out and do something. Personally, I love great meals, travel and exercise classes like Soulcycle. I get infinitely more happiness from spending money on those things rather than a new couch or bag."}, {"e893": "So there you have it, an attempt to summarize 30 years of life lessons into a listicle. I hope it was a fun ride and I personally love reading posts like these so feel free to link to yours or share your own advice in the comments."}, {"d794": "Press the ❤️ if you liked reading this. Find me on Twitter as @meganberry"}], "content": "30 Things I’ve Learned in 30 Years About Startups, Dating, Travel and More Today I’m 30. Young enough to still talk with friends about how well we’re “adulting.” Old enough to have a real career and opinions about “kids these days,” including my own nieces and nephews, who use lip-syncing social networks I don’t understand. Possibly as just a self-indulgence (so millennial of me, right?), but hopefully because it will be helpful or interesting to others, I am going to share 30 things I have learned to be true over the past 30 years. On Startups Most startups fail. Of course you believe it’s going to be big. Feeling that way is the ONLY way you should ever take a job at an early-stage startup. But don’t ever plan on it. Don’t count it as compensation. It’s a pot of gold at the end of a rainbow. Also, if your company refuses to help you understand the last valuation of the equity being offered to you, your strike price, and what this means for you, then be very wary. 2. Keep your eyes on the long game while focusing very short-term to succeed. Startups require laser focus on the next step. Without that next step you will never get to your goal at a startup. Startups don’t have the leeway that big companies do. They can’t plan the next 9 months carefully. Instead you keep the big vision in mind and then just keep putting one step in front of the other. 3. Your best work happens when you’re having fun. I truly believe pushing hard while having fun is where the magic happens. An occasional bad day or having some parts of your job you don’t love is totally normal. However, if you find yourself waking up dreading going to work, I’d highly advise thinking about what’s next. 4. Be gentle with people who are working really hard. It’s not uncommon for startups to involve some late nights. If you are working with someone who has just worked a few late nights, gone on a long work trip or otherwise seems overly stressed and tired at that moment, save your criticism for another time. Say something nice, maybe a virtual high five GIF, and make a note to mention the constructive feedback once they’re rested. Hopefully they will do the same for you when you need it. On Jobs in General 5. If you don’t ask for it, you won’t get it. If you want a raise, the ability to work from home, a promotion, new job responsibilities or just about anything, you should ask. Your manager has a lot going on. If you are doing a good job they will try to do right by you, but you will very rarely get what you’re hoping for professionally if you don’t ask for it. You can “Lean In” as Sheryl Sandberg would say, by asking for a yearly review and then pushing for a raise, by asking for feedback regularly, or by explaining how something you want (i.e. working from home twice a week) will make you more productive. 6. Tell people when they’re doing a good job. If you have great employees or coworkers there are probably many times where you think to yourself “Thank God for Person X” or “I love working with Person Y” or “Work just wouldn’t be the same without Person Z.” Don’t just think it; share it. A super short email or slack message will do the trick. Everyone likes to hear positive feedback, it keeps us feeling motivated and happy. It also builds better relationships. 7. About 80% of your work happiness is about how much you enjoy the people you work with. This is my favorite image to send around the Octane AI slack channel That’s not a scientific number, but I’ve realized over time that the majority of my job satisfaction is determined by who I work with. If I like them, am learning from them and we mutually respect each other, then I am generally happy to go to work in the morning. Find your tribe, not just your job. 8. Always be learning. The business world is constantly changing. As long as you are in a role where you’re always learning you’re setting yourself up to grow with it. If you stop learning, be very wary. Also, when I’m not learning at a job, I’m not having fun. On Being a Woman in Tech 9. Yes, I have some of those stories too. Yes, there is still an issue. Every woman in tech I know has some of those stories. Let’s try to change that for the next generation. 10. Guys, you can absolutely help make the situation better. I wrote up some tips on that. 11. Don’t tell me you want me to speak because you need a woman on the panel. I admire your attempts to increase diversity at your event. It’s 100% important for event planners to think about this. As an industry we are so tired of all-male panels. But of course there are reasons you wanted me to speak, aside from my gender. Tell me those reasons. On Love and Dating 12. When you’re single, think of every bad date as a fun story to tell your friends. This always helped me. As the date was going terribly I would start storing fun anecdotes to retell to my friends later. This made dating fun to talk about even if not always fun in the moment. 13. Try online dating. Aren’t we all over the stigma by now? Give it a try. Be safe about how you meet people, of course, but do try it. It’ll teach you a lot about what you are really looking for. You will have a lot of fun dates and you will have a lot of great stories. I met my fiancé on OKCupid so obviously I am a fan. 14. When you find “the one” you know. I remember hearing people say this and I would wonder if I would ever feel that way. Now that I’m on the other side (I’m getting married this summer) I am very happy to report that it is true, when I found the right person, I knew. 15. Never let anyone else tell you how your relationship “should” be. A relationship is like an iceberg in that from the outside your friends and family can only see a very small piece of it. Relationships are such a personal thing. There is no right amount of time to spend together, no right timeframe to move to the next step. It has to feel right to you and exactly one other person — the person you’re in the relationship with — and that’s it. 16. The right person won’t ask you to choose between a career you’re passionate about and them. They will see you care about it and they will understand when you need to work late, go on a business trip or are so focused on work you literally “don’t hear them.” If you ask my fiancé, when I’m focused on work I tune the rest of the world out. I call this the “open office effect” and it appears to be a permanent change in auditory focus even though I work from home now. 17. With the right person you will soon realize they matter more to you than work. They won’t ask you to choose, but for the important things, you will choose them because it feels right. It will happen naturally. On Friends 18. Friendship tends to work best on even ground. A friendship can’t last long if one friend is putting a lot more into it than the other. We may give in different ways (maybe you’re a planner but your friend is always down for spontaneous fun) but friendship should involve some give and take so no person feels taken advantage of. Nothing is worse for a friendship than resentment. That being said, a friend who is generally there for you but goes through a rough time deserves a break. 19. Friends who are consistently there for you are amazing. Go above and beyond for them in return. Especially in adulthood, it becomes increasingly rare for people to truly be there for each other. If you have friends like that, make sure you do the same for them. Treasure them. 20. Celebrate special moments with your friends. Birthdays, promotions, weddings… there are certain moments in a friend’s life that will disproportionately affect how they feel about your friendship. Having to miss the occasional dinner is not a big deal; but consistently missing their big moments will wear on the friendship. On Travel 21. Vacations and travel are critical to being a creative, productive person. I have never regretted taking a trip. I have regretted not taking one. Work will still be there when you get back but you, on the other hand, will be mentally refreshed and ready for it. Travel changes your mental perspective. It gets you out of your routine and shows you something new. It doesn’t always have to be a big trip; even going on a day trip or long weekend can make a huge difference. 22. Make the big trips you dream of a reality by booking non-refundable tickets in advance. Booking way in advance can help with finding deals; but the real reason is that when the trip is already booked, you will go. However, if the time comes and it’s not booked, you will often find a reason that you can’t go right now. Once booked, put it in your work calendar and tell your colleagues. They might wonder why you are telling them 9 months ahead of time, but when the time comes everyone will be prepared. On Advice 23. My dad always taught me advice is best given without strings attached. By that he means that someone who gives advice and then resents if his or her advice isn’t taken is not a good advice giver. Life is not a one-size-fits all world. Give and take advice freely, but then do exactly what feels right, and nothing else. 24. The best advice-givers often tease out how you feel about the situation rather than decide for you. When making a big life decision, no one else can make that for you, but sometimes friends and family can ask you questions that help you reveal the right decision. Treasure these people. On Being 30 25. I know so little. The more I learn the more I realize how little I know. You should absolutely listen to someone turning 60, or 90, instead of me. 26. I care a bit less about everyone liking me. And it’s such a relief. Don’t get me wrong, I haven’t reached that “I don’t give a f**k” state that others talk about. But I care a lot less than I did as an insecure young adult and it’s such a huge relief. I’m looking forward to caring even less as I get older. 27. I’m more cognizant than ever of my parents’ mortality. Morbid, but true. I think much more now about how no matter how long I have with my parents (and I hope SO MUCH more time) it will probably not be as much time as I want. I feel very lucky to have amazing, supportive parents who I not only love but I genuinely enjoy hanging out with. I am going to spend as much time with them as possible. 28. Being without internet freaks me out, but makes me so productive. I wrote this entire post (and this one on bots) because I was on a plane with broken wifi. First, I freaked out, “what am I going to do with 6 hours without wifi?!” Then, I started writing and it just poured out of me. Sidenote: if you want to question whether writing this post was truly productive, I will absolutely not blame you 29. Regular exercise, sleep and great food are so much better than staying out past 3am. I remember when I used to consider a great Saturday night one when I stayed out super late dancing. The hangover and late (/early?) hour were a badge of honor. Now I laugh at past Megan and love being in bed by midnight and doing a SoulCycle class on Sunday mornings. 30. Experiences are *way* better than things. There’s plenty of science to back this up — spending money on experiences is a much better way to increase your happiness than spending money on things. Leave the new tv aside and use your money to go out and do something. Personally, I love great meals, travel and exercise classes like Soulcycle. I get infinitely more happiness from spending money on those things rather than a new couch or bag. So there you have it, an attempt to summarize 30 years of life lessons into a listicle. I hope it was a fun ride and I personally love reading posts like these so feel free to link to yours or share your own advice in the comments. Press the ❤️ if you liked reading this. Find me on Twitter as @meganberry ", "child": "2089_1\t2089_2\t2089_3\t2089_4"}