{"name": "2090", "parent": "", "title": "May You Always Embrace Opportunity with an Open Mind", "sentences": [{"f13d": "May You Always Embrace Opportunity with an Open Mind"}, {"d925": "“IN THE END… We only regret the chances we didn’t take, the relationships we were afraid to have,and the decisions we waited too long to make.” — Lewis Carroll"}, {"4d1e": "Can you get back up? You know what I mean. From the hurt. The pain. The defeat. The loss. The adversity. The fear that it may happen again. The anxiety that threatens to derail you… if you let it. Because, my friend, you and I both know it’s only in our minds. We have a choice to embrace new opportunity. We always have a choice."}, {"8cfc": "What holds us back is mental. Its fuel is negative emotional thought. A reciprocal relationship of negativity that takes away our confidence. While our confidence is paramount,it is opportunity that we’re talking about here from a high-level. Confidence is a state of mind. Opportunity is the prize we strive to reach."}, {"6e6a": "Opportunity is what gets us out of bed in the morning. It’s in front of us, awaiting our arrival, if only we embrace our current circumstances with an open mind. More than anything else, the key to keeping an open mind is mentally and emotionally entering each new situation by giving it a fresh start."}, {"5a29": "You cannot take emotional baggage from past jobs, past relationships or past school situations with you. It weighs you down, like that bag you should have just checked curbside, but now you’re lugging for that long walk through the terminal. You must learn from these situations, extract the value from each life lesson, then move on."}, {"a2fa": "If you don’t, you’re harming yourself, as well as the people around you."}, {"6267": "A Story to Tell"}, {"f1bb": "I want to share parts of my story with you — at least over the past year of my life. I think you’ll find some of yourself in here. I became so inspired to tell this story, because I learned, I’m not alone. Like millions of us, I was on a path to flaming out. I wasn’t focused on work, I wasn’t doing enough of the things I loved, and I wasn’t doing enough about it. Bad combination!"}, {"f0b2": "Sound like you? If so, what are you doing about it?"}, {"7a56": "I accepted a job with one of the top management consulting firms in the country. This job required me to be at the top of my game, at a time when I was carrying far too much emotional baggage with me. I had just made a move I didn’t want to make. My heart was torn, and on top of it, I was doing work I didn’t truly want to do. I was going through the motions."}, {"3f86": "Why? Because that’s what I had done in most of my previous jobs. Going through the motions, hoping, somehow, someway, I’d figure things out. As if the light bulb would magically go off and everything would make sense. BOOM! Some magical epiphany. Well, that’s never quite happened. As a result, I wasn’t making progress."}, {"3dc2": "Another symptom of so many of our failures is doing something because that’s the way we’ve always done it. Or, because we’ve observed others do things that way. Not because it’s right! Not because it’s the most efficient way. But because we haven’t matured into a leader willing to forge our own path… yet."}, {"5925": "So, I ended up OUT. The pieces did not fit. And it hurt like hell. I was always someone who wanted things to work out. I wanted to please people. When that didn’t happen, honestly, I was more upset because I felt I let everyone down. I was also disappointed in myself."}, {"58db": "I knew what had to be done. I started to rebuild MYSELF, piece by piece. I started investing in myself. I took inventory and realized I already had a strong foundation. I needed to get back to embracing the opportunity in front of me. One year later, I can confidently say this period in time was a Godsend. It was the biggest period of personal growth in my entire life."}, {"a533": "Why? Because I embraced the opportunity with full-throttled excitement."}, {"73bf": "Business and Personal Development"}, {"e187": "I launched my career coaching business. I wrote my first book, which will be out soon. I built a writing career, in earnest, that has earned me opportunity and rewards I previously only dreamed of."}, {"466d": "“Be open to opportunity and take risks. In fact, take the worst, the messiest, the most challenging assignment you can find, and then take control.” — Angela Braly"}, {"5dbd": "Where do you find yourself on the “Opportunity Scale” at this point in time? Are you waiting for one to come? Grinding away in an effort to achieve your goal? Looking for inspiration? Please never tell me you’ve lost hope. History is littered with many who have failed. But history is also chock full of people who overcame adversity and embraced new opportunity."}, {"b9d2": "J.K. Rowling’s manuscript for the first Harry Potter book was initially rejected by several literary agents. This was before a publisher even looked at it! Then, her literary agent sent it to 12 different publishers. ALL of them rejected her manuscript. The reason we know J.K. Rowling today is not because she decided to pack it in. Quite the contrary."}, {"08da": "She persevered and embraced the opportunity to find another publisher. Bloomsbury Publishing can thank its lucky stars today that it decided to give Ms. Rowling that opportunity."}, {"2154": "“The most beautiful people we have known are those who have known defeat, suffering, struggle, loss and have found their way out of the depths.” — Elisabeth Kubler-Ross"}, {"7fe1": "What does Opportunity look like?"}, {"cd29": "What do you think opportunity will look like? It’s not always the same thing as a dream. It’s not limited to our passions. It may be staring us right in the eyes, in the form of a man or woman that wants to spend forever with us. It may be a new job. Or the chance to strike things out on our own, starting a new entrepreneurial venture."}, {"a7cf": "Opportunity may simply be the moment to reinvent ourselves from the inside out. All of us need to hit the reset button at some point. To re-prioritize and make sure that we’re keeping an open mind, living the life our heart desires and embracing each new opportunity that comes our way. Sometimes, change, itself, is an opportunity."}, {"82a4": "Opportunities require that we act by faith, confidence and use our beautiful minds to think of bright, new ideas. Your ideas will lead you to opportunities. Opportunities could present themselves right before you. No matter how wounded you’ve been, how much you harbor envy, anger or foolish pride, refuse to give in. Press on. Move forward."}, {"75f5": "Give every new opportunity an embrace. Give it a shot. Then, tell me all about it. Hopefully, you too, are just beginning your biggest period of personal growth. Maybe, you’re well on your way. Keep Going!"}, {"9b6c": "Live Boldly!"}, {"a59d": "Want more great content like this? Find my absolute best, plus a free offer by subscribing for awesome updates on my Newsletter! Like my Facebook writer’s page here and follow me on Instagram! If you enjoyed reading this piece, please be so kind as to share and recommend to others. Also, please consider following me here on Medium! Good luck!"}], "content": "May You Always Embrace Opportunity with an Open Mind “IN THE END… We only regret the chances we didn’t take, the relationships we were afraid to have,and the decisions we waited too long to make.” — Lewis Carroll Can you get back up? You know what I mean. From the hurt. The pain. The defeat. The loss. The adversity. The fear that it may happen again. The anxiety that threatens to derail you… if you let it. Because, my friend, you and I both know it’s only in our minds. We have a choice to embrace new opportunity. We always have a choice. What holds us back is mental. Its fuel is negative emotional thought. A reciprocal relationship of negativity that takes away our confidence. While our confidence is paramount,it is opportunity that we’re talking about here from a high-level. Confidence is a state of mind. Opportunity is the prize we strive to reach. Opportunity is what gets us out of bed in the morning. It’s in front of us, awaiting our arrival, if only we embrace our current circumstances with an open mind. More than anything else, the key to keeping an open mind is mentally and emotionally entering each new situation by giving it a fresh start. You cannot take emotional baggage from past jobs, past relationships or past school situations with you. It weighs you down, like that bag you should have just checked curbside, but now you’re lugging for that long walk through the terminal. You must learn from these situations, extract the value from each life lesson, then move on. If you don’t, you’re harming yourself, as well as the people around you. A Story to Tell I want to share parts of my story with you — at least over the past year of my life. I think you’ll find some of yourself in here. I became so inspired to tell this story, because I learned, I’m not alone. Like millions of us, I was on a path to flaming out. I wasn’t focused on work, I wasn’t doing enough of the things I loved, and I wasn’t doing enough about it. Bad combination! Sound like you? If so, what are you doing about it? I accepted a job with one of the top management consulting firms in the country. This job required me to be at the top of my game, at a time when I was carrying far too much emotional baggage with me. I had just made a move I didn’t want to make. My heart was torn, and on top of it, I was doing work I didn’t truly want to do. I was going through the motions. Why? Because that’s what I had done in most of my previous jobs. Going through the motions, hoping, somehow, someway, I’d figure things out. As if the light bulb would magically go off and everything would make sense. BOOM! Some magical epiphany. Well, that’s never quite happened. As a result, I wasn’t making progress. Another symptom of so many of our failures is doing something because that’s the way we’ve always done it. Or, because we’ve observed others do things that way. Not because it’s right! Not because it’s the most efficient way. But because we haven’t matured into a leader willing to forge our own path… yet. So, I ended up OUT. The pieces did not fit. And it hurt like hell. I was always someone who wanted things to work out. I wanted to please people. When that didn’t happen, honestly, I was more upset because I felt I let everyone down. I was also disappointed in myself. I knew what had to be done. I started to rebuild MYSELF, piece by piece. I started investing in myself. I took inventory and realized I already had a strong foundation. I needed to get back to embracing the opportunity in front of me. One year later, I can confidently say this period in time was a Godsend. It was the biggest period of personal growth in my entire life. Why? Because I embraced the opportunity with full-throttled excitement. Business and Personal Development I launched my career coaching business. I wrote my first book, which will be out soon. I built a writing career, in earnest, that has earned me opportunity and rewards I previously only dreamed of. “Be open to opportunity and take risks. In fact, take the worst, the messiest, the most challenging assignment you can find, and then take control.” — Angela Braly Where do you find yourself on the “Opportunity Scale” at this point in time? Are you waiting for one to come? Grinding away in an effort to achieve your goal? Looking for inspiration? Please never tell me you’ve lost hope. History is littered with many who have failed. But history is also chock full of people who overcame adversity and embraced new opportunity. J.K. Rowling’s manuscript for the first Harry Potter book was initially rejected by several literary agents. This was before a publisher even looked at it! Then, her literary agent sent it to 12 different publishers. ALL of them rejected her manuscript. The reason we know J.K. Rowling today is not because she decided to pack it in. Quite the contrary. She persevered and embraced the opportunity to find another publisher. Bloomsbury Publishing can thank its lucky stars today that it decided to give Ms. Rowling that opportunity. “The most beautiful people we have known are those who have known defeat, suffering, struggle, loss and have found their way out of the depths.” — Elisabeth Kubler-Ross What does Opportunity look like? What do you think opportunity will look like? It’s not always the same thing as a dream. It’s not limited to our passions. It may be staring us right in the eyes, in the form of a man or woman that wants to spend forever with us. It may be a new job. Or the chance to strike things out on our own, starting a new entrepreneurial venture. Opportunity may simply be the moment to reinvent ourselves from the inside out. All of us need to hit the reset button at some point. To re-prioritize and make sure that we’re keeping an open mind, living the life our heart desires and embracing each new opportunity that comes our way. Sometimes, change, itself, is an opportunity. Opportunities require that we act by faith, confidence and use our beautiful minds to think of bright, new ideas. Your ideas will lead you to opportunities. Opportunities could present themselves right before you. No matter how wounded you’ve been, how much you harbor envy, anger or foolish pride, refuse to give in. Press on. Move forward. Give every new opportunity an embrace. Give it a shot. Then, tell me all about it. Hopefully, you too, are just beginning your biggest period of personal growth. Maybe, you’re well on your way. Keep Going! Live Boldly! Want more great content like this? Find my absolute best, plus a free offer by subscribing for awesome updates on my Newsletter! Like my Facebook writer’s page here and follow me on Instagram! If you enjoyed reading this piece, please be so kind as to share and recommend to others. Also, please consider following me here on Medium! Good luck! ", "child": "2090_1\t2090_2\t2090_3\t2090_4"}