{"name": "2093", "parent": "", "title": "Dicas para se tornar um desenvolvedor melhor", "sentences": [{"606e": "Dicas para se tornar um desenvolvedor melhor"}, {"bc32": "O artigo da vez também não é nada técnico (mas também não é polêmico como o anterior haha), mas sim um punhado de coisas que eu gostaria que alguém tivesse me dito quando comecei a aprender a desenvolver, então espero que as dicas aqui reunidas sirvam pelo menos para repensar algumas coisas."}, {"3680": "Dessa vez, trago o novo clipe da dupla britânica Royal Blood. Depois de um aclamado primeiro álbum (o homônimo Royal Blood, de 2014) a dupla promete não decepcionar:"}, {"bc05": "O mais louco de ouvir Royal Blood é pensar que tudo isso que está acontecendo sai de apenas uma bateria e um baixo (sim, um baixo!), o que nos traz toda a nostalgia de ver a The White Stripes de Jack e Meg White tocar. Resta aguardar o lançamento do álbum completo, mas podemos esperar uma linha bem parecida com o álbum debutante."}, {"35fc": "Participe da comunidade"}, {"bd0a": "Ser um desenvolvedor ativo na comunidade só te traz ventura. Vá à todos eventos possíveis, participe de meetups e palestras e tudo mais que você puder. Se você mora numa cidade pequena ou não tem tanto tempo quanto gostaria (alô alô faculdade), você pode ser ativo remotamente por meio de grupos do Facebook, Github ou Slack. A comunidade de desenvolvimento é repleta de gente interessada em compartilhar conhecimento e discutir sobre desenvolvimento, o que nos leva a…"}, {"fda5": "Contribua"}, {"4a18": "As melhores maneiras de aprender algo de verdade são:"}, {"f324": "E felizmente no mundo do desenvolvimento temos as duas possibilidades. Você pode repassar conhecimento de diversas formas: desde ministrar palestras, escrever artigos e preparar cursos online até adotar um pupilo."}, {"c023": "Maneiras de colocar a mão na massa também não faltam: muitos projetos open source para se contribuir ou até mesmo novas ideias esperando para serem colocadas em prática. Trabalho voluntário também é um opção muito viável, principalmente para quem está começando agora e precisa montar portifólio."}, {"fb77": "Aprenda inglês"}, {"64d8": "Sinto que essa aqui é chover no molhado, mas esse é um ponto importantíssimo que quem deixa passar batido sente muita falta no futuro. Muito do conteúdo (principalmente sobre as ferramentas mais vanguardistas) disponível na internet está em inglês, portanto dominar minimamente o idioma amplia suas possibilidades de aprendizado."}, {"3a72": "Isso sem falar que é quase unanimidade que toda contribuição à projetos colaborativos precisam ser em inglês (desde documentações, nomes de métodos e variáveis até mensagens de commit)."}, {"ac8c": "Aprender inglês te possibilita conseguir melhores oportunidades de trabalho (internacionais ou não), então não deixe esse aprendizado em segundo plano."}, {"4287": "Bônus: Quer juntar a dica 2 e 3? Comece a traduzir artigos em inglês! Você estará ajudando a comunidade e treinando o idioma! Só não esquece de pedir permissão para os autores :p"}, {"ba70": "Respeita as mina (e os mano também)"}, {"6487": "Devemos cultivar uma comunidade inclusiva onde ninguém tenha medo de se expressar e aprender. Você pode contribuir com programas inclusivos ou pelo menos não seja babaca."}, {"f092": "Não tente ser melhor que ninguém além de você mesmo."}, {"1a3e": "Não se apegue à libs (ou frameworks ou whatever)"}, {"5702": "Uma verdade inexorável sobre o ecossistema de desenvolvimento: as libs vêm e vão, e cada vez mais seu ciclo de vida está mais curto."}, {"6cd0": "É muito legal estar antenado nas últimas novidades (e sério, você deve continuar fazendo isso), mas se apegar às libs ao invés de ser fluente em linguagem nativa pode ser um belo tiro no pé. Ninguém deveria aprender Bootstrap ou até mesmo um pré processador antes de CSS nativo, por exemplo."}, {"b514": "É importantíssimo manter a mente aberta e conhecer de tudo um pouco, afinal, as novas ferramentas que surgem têm como objetivo solucionar problemas já conhecidos, e geralmente se apoiam em algo do passado."}, {"d3b4": "Estude, estude muito"}, {"f14b": "Mais uma verdade absoluta do mundo dos devs: você nunca vai saber tudo. Você precisa estudar e aprender o tempo inteiro, e o mais legal é que você não precisa necessariamente de um curso superior pra isso. Você tem acesso à conteúdo de todo o tipo: artigos, vídeo-aulas, podcasts, fóruns e chats… Aproveite todo esse poder e não fique parado, senão você vai ficar pra trás."}, {"4a16": "O ciclo do desenvolvedor: Estude. Pratique. Repasse. Repita."}, {"7736": "Mas não se prenda somente à parte técnica"}, {"f70e": "Temos o costume de nos prender a aprender novas tecnologias e ficarmos tecnicamente fodas, mas esquecemos que existem outras competências tão importantes quanto qualidade técnica para um desenvolvedor."}, {"9c5e": "Não adianta nada você ser foda em JS mas não conseguir contribuir em time ou não saber mensurar seus prazos. Aprenda técnicas de gerenciamento de tempo e de projetos, estude um pouco sobre design, idiomas, sobre oratória e expressão corporal e outras disciplinaridades. Você não deve se alienar ao resto do mundo e se focar somente em tecnologia."}, {"7b87": "Por hoje, é isso! Espero que essas dicas te sirvam de alguma forma, eu gostaria de tê-las ouvido quando comecei nessa vida de front ender."}, {"ff46": "Se tiver qualquer dúvida ou observação, manda ali nos comentários e bora bater um papo. E… vamos codar! =D"}], "content": "Dicas para se tornar um desenvolvedor melhor O artigo da vez também não é nada técnico (mas também não é polêmico como o anterior haha), mas sim um punhado de coisas que eu gostaria que alguém tivesse me dito quando comecei a aprender a desenvolver, então espero que as dicas aqui reunidas sirvam pelo menos para repensar algumas coisas. Dessa vez, trago o novo clipe da dupla britânica Royal Blood. Depois de um aclamado primeiro álbum (o homônimo Royal Blood, de 2014) a dupla promete não decepcionar: O mais louco de ouvir Royal Blood é pensar que tudo isso que está acontecendo sai de apenas uma bateria e um baixo (sim, um baixo!), o que nos traz toda a nostalgia de ver a The White Stripes de Jack e Meg White tocar. Resta aguardar o lançamento do álbum completo, mas podemos esperar uma linha bem parecida com o álbum debutante. Participe da comunidade Ser um desenvolvedor ativo na comunidade só te traz ventura. Vá à todos eventos possíveis, participe de meetups e palestras e tudo mais que você puder. Se você mora numa cidade pequena ou não tem tanto tempo quanto gostaria (alô alô faculdade), você pode ser ativo remotamente por meio de grupos do Facebook, Github ou Slack. A comunidade de desenvolvimento é repleta de gente interessada em compartilhar conhecimento e discutir sobre desenvolvimento, o que nos leva a… Contribua As melhores maneiras de aprender algo de verdade são: E felizmente no mundo do desenvolvimento temos as duas possibilidades. Você pode repassar conhecimento de diversas formas: desde ministrar palestras, escrever artigos e preparar cursos online até adotar um pupilo. Maneiras de colocar a mão na massa também não faltam: muitos projetos open source para se contribuir ou até mesmo novas ideias esperando para serem colocadas em prática. Trabalho voluntário também é um opção muito viável, principalmente para quem está começando agora e precisa montar portifólio. Aprenda inglês Sinto que essa aqui é chover no molhado, mas esse é um ponto importantíssimo que quem deixa passar batido sente muita falta no futuro. Muito do conteúdo (principalmente sobre as ferramentas mais vanguardistas) disponível na internet está em inglês, portanto dominar minimamente o idioma amplia suas possibilidades de aprendizado. Isso sem falar que é quase unanimidade que toda contribuição à projetos colaborativos precisam ser em inglês (desde documentações, nomes de métodos e variáveis até mensagens de commit). Aprender inglês te possibilita conseguir melhores oportunidades de trabalho (internacionais ou não), então não deixe esse aprendizado em segundo plano. Bônus: Quer juntar a dica 2 e 3? Comece a traduzir artigos em inglês! Você estará ajudando a comunidade e treinando o idioma! Só não esquece de pedir permissão para os autores :p Respeita as mina (e os mano também) Devemos cultivar uma comunidade inclusiva onde ninguém tenha medo de se expressar e aprender. Você pode contribuir com programas inclusivos ou pelo menos não seja babaca. Não tente ser melhor que ninguém além de você mesmo. Não se apegue à libs (ou frameworks ou whatever) Uma verdade inexorável sobre o ecossistema de desenvolvimento: as libs vêm e vão, e cada vez mais seu ciclo de vida está mais curto. É muito legal estar antenado nas últimas novidades (e sério, você deve continuar fazendo isso), mas se apegar às libs ao invés de ser fluente em linguagem nativa pode ser um belo tiro no pé. Ninguém deveria aprender Bootstrap ou até mesmo um pré processador antes de CSS nativo, por exemplo. É importantíssimo manter a mente aberta e conhecer de tudo um pouco, afinal, as novas ferramentas que surgem têm como objetivo solucionar problemas já conhecidos, e geralmente se apoiam em algo do passado. Estude, estude muito Mais uma verdade absoluta do mundo dos devs: você nunca vai saber tudo. Você precisa estudar e aprender o tempo inteiro, e o mais legal é que você não precisa necessariamente de um curso superior pra isso. Você tem acesso à conteúdo de todo o tipo: artigos, vídeo-aulas, podcasts, fóruns e chats… Aproveite todo esse poder e não fique parado, senão você vai ficar pra trás. O ciclo do desenvolvedor: Estude. Pratique. Repasse. Repita. Mas não se prenda somente à parte técnica Temos o costume de nos prender a aprender novas tecnologias e ficarmos tecnicamente fodas, mas esquecemos que existem outras competências tão importantes quanto qualidade técnica para um desenvolvedor. Não adianta nada você ser foda em JS mas não conseguir contribuir em time ou não saber mensurar seus prazos. Aprenda técnicas de gerenciamento de tempo e de projetos, estude um pouco sobre design, idiomas, sobre oratória e expressão corporal e outras disciplinaridades. Você não deve se alienar ao resto do mundo e se focar somente em tecnologia. Por hoje, é isso! Espero que essas dicas te sirvam de alguma forma, eu gostaria de tê-las ouvido quando comecei nessa vida de front ender. Se tiver qualquer dúvida ou observação, manda ali nos comentários e bora bater um papo. E… vamos codar! =D ", "child": "2093_1\t2093_22093_1\t2093_22093_1\t2093_22093_1\t2093_2"}