{"name": "2106", "parent": "", "title": "How to prepare for a Product Manager interview", "sentences": [{"9915": "How to prepare for a Product Manager interview"}, {"f448": "If you are reading this — you probably want to prepare for a PM interview. Hope this post helps you in that process or the very least points you in the right direction."}, {"5e98": "There is a lot of information around what is a product manager or how to become a good product manager (PM)or books to read as a PM and sometimes how to interview a PM. All these are great and necessary, but we rarely find any material on how to prepare for a product manager interview, which I feel is equally important."}, {"9d7f": "The lack of PM interview material became evident while guiding an extremely smart entrepreneur through an interview he was taking at one of the tech giants."}, {"00a0": "Everyone has a different way to approach an interview, but here is my humble attempt to share some information on how I go about preparing for PM interview. Hope this will help all future PM aspirants. I am also looking for some constructive feedback to improve this process."}, {"f375": "As part of the process, I observe the following steps (in no particular order)"}, {"3e67": "Networking"}, {"8b3d": "Networking"}, {"5369": "Before the interview, see if you can speak directly with someone who has actually worked as a product manager at the company you are interviewing, or at the very least a PM in any company."}, {"0156": "Books are great, but nothing beats getting information from the horse’s mouth. They probably won’t let too much slip about the actual interview questions, but they can provide real world context to the PM role that you won’t get from a book."}, {"b244": "If you don’t know anyone directly, check LinkedIn for possible connections who can put you in touch with a current or past PM’s. The alumni directory at whatever school you attended might be another resource. Join PM meetups in your city."}, {"9dad": "After speaking with a PM at a company you’ll be better equipped about the role, and ask better questions at the end of the interview."}, {"5aba": "Prep Tips"}, {"e4b4": "Prep Tips"}, {"7515": "All PM roles have certain skills that are the same regardless of employer. They need to think long term yet keeping the short term priorities in mind (strategy), need to make data driven decisions (analytical) and finally need to have start with the customer in mind (design) coupled with an appreciation for technology to develop the products (technical). Here is how I recommend to prepare for these skills:"}, {"339b": "1. Product design: PM’s are zealous about creating the best customer experience. It starts with customer empathy or working backwards from the customer. PM’s need to have a passion for products and an attention to the smallest of details. To validate these skills you could get asked questions like:"}, {"54e1": "It’s a bit hard and tricky to prepare for the above questions. But the world is filled with shitty products. As PM’s we need have a keen product design eye for every product we encounter in our daily lives. Then brainstorm solutions and ideas to improve them. Think for creative solutions and how you can scale them. Interviewers are evaluating your creativity, and they place a big emphasis on out of the box ideas. Excite them with unique, compelling ideas. Drawing wireframes on a whiteboard will help illustrate your ideas. To practice, download a wireframing tool like Balsamiq. Also study popular web and mobile design patterns for inspiration."}, {"b8d1": "2. Strategy/Business Acumen: PM’s are business leaders too. They need to be familiar with the business issues as they need to understand how to monetize their products or customer acquisition concepts. It’s not necessary for PMs to have business experience or formal business training. However, they do expect you to pick up business intuition or judgment quickly along with basic concepts like pricing curves etc. They also need you to ‘Think Big’. Sample interview questions include:"}, {"e246": "Use a framework to structure your strategy discussions. If you’re not familiar with strategy or frameworks, Porter’s Five Forces is a good start along with 4Ps and SWOT Analysis."}, {"5e54": "3. Technical Skills: PM’s work closely with product development teams and hence should build trust with them. To work effectively with the team, PMs must have the ability to influence and build credibility with engineers. Examples questions include:"}, {"2251": "It’s unlikely that you would be asked to write a program with the perfect programming syntax or optimize an problem to O(n) complexity or solve a NP complete problem. What you would be required to is that you have sufficient mastery of technical concepts so that you can participate in technical discussions and help make technical trade-offs. I would recommend going over computer science fundamentals and practicing a couple coding questions. One of my favorite resources is How to Ace the Software Engineering Interview. Also be prepared to describe key technologies including search engines, machine learning or large scale design systems."}, {"e03e": "4. Analytical: All good PM’s need to be data-driven. They need to define the success criteria for the products. And once the product is launched need to interpret the results (aka A/B test numbers) and make further iterations to the product. Now to evaluate those skills interviewer can ask the following questions:"}, {"cdb2": "Get well-versed in product launch metrics and A/B testing, including interpretation of results. Also prepare for estimation based questions."}, {"6567": "Lewis Lin (founder of impact interview and a leading authority in this space) has created a wonderful & detailed 2 week plan that covers all the above topics to prepare for a PM interview. Please go ahead and book mark it: http://bit.ly/PMPrepPlan"}, {"f3bf": "Practice"}, {"f948": "Practice"}, {"c03f": "Preparing for any interview is like preparing for any competition (or exam). Like athletes talk about getting into the zone, you also need to get into the zone. You can achieve it by doing some mock interviews. This can be hard if you are starting new and don’t have much context about the PM role. However as mentioned above speaking with other PM’s about how they interview candidates and what they look in for their ideal PM candidate can definitely help. Apart from Google, Glassdoor and Quora are very good sources to get sample PM interview questions."}, {"cc5b": "Then prepare notecards with the questions you think you might get and ask someone to interview you. And if possible I recommend doing at least some of your prep under circumstances that mimics a live interview — at a whiteboard, under time pressure, and ideally with a confidante to ask the question."}, {"4c5b": "All of the above will help you crystallize your answers and help create a powerful story/brand."}, {"f122": "More reading/reference material"}, {"d244": "Books"}, {"9671": "Online Resources"}, {"3c89": "Follow me on Twitter Vishal Sood"}], "content": "How to prepare for a Product Manager interview If you are reading this — you probably want to prepare for a PM interview. Hope this post helps you in that process or the very least points you in the right direction. There is a lot of information around what is a product manager or how to become a good product manager (PM)or books to read as a PM and sometimes how to interview a PM. All these are great and necessary, but we rarely find any material on how to prepare for a product manager interview, which I feel is equally important. The lack of PM interview material became evident while guiding an extremely smart entrepreneur through an interview he was taking at one of the tech giants. Everyone has a different way to approach an interview, but here is my humble attempt to share some information on how I go about preparing for PM interview. Hope this will help all future PM aspirants. I am also looking for some constructive feedback to improve this process. As part of the process, I observe the following steps (in no particular order) Networking Networking Before the interview, see if you can speak directly with someone who has actually worked as a product manager at the company you are interviewing, or at the very least a PM in any company. Books are great, but nothing beats getting information from the horse’s mouth. They probably won’t let too much slip about the actual interview questions, but they can provide real world context to the PM role that you won’t get from a book. If you don’t know anyone directly, check LinkedIn for possible connections who can put you in touch with a current or past PM’s. The alumni directory at whatever school you attended might be another resource. Join PM meetups in your city. After speaking with a PM at a company you’ll be better equipped about the role, and ask better questions at the end of the interview. Prep Tips Prep Tips All PM roles have certain skills that are the same regardless of employer. They need to think long term yet keeping the short term priorities in mind (strategy), need to make data driven decisions (analytical) and finally need to have start with the customer in mind (design) coupled with an appreciation for technology to develop the products (technical). Here is how I recommend to prepare for these skills: 1. Product design: PM’s are zealous about creating the best customer experience. It starts with customer empathy or working backwards from the customer. PM’s need to have a passion for products and an attention to the smallest of details. To validate these skills you could get asked questions like: It’s a bit hard and tricky to prepare for the above questions. But the world is filled with shitty products. As PM’s we need have a keen product design eye for every product we encounter in our daily lives. Then brainstorm solutions and ideas to improve them. Think for creative solutions and how you can scale them. Interviewers are evaluating your creativity, and they place a big emphasis on out of the box ideas. Excite them with unique, compelling ideas. Drawing wireframes on a whiteboard will help illustrate your ideas. To practice, download a wireframing tool like Balsamiq. Also study popular web and mobile design patterns for inspiration. 2. Strategy/Business Acumen: PM’s are business leaders too. They need to be familiar with the business issues as they need to understand how to monetize their products or customer acquisition concepts. It’s not necessary for PMs to have business experience or formal business training. However, they do expect you to pick up business intuition or judgment quickly along with basic concepts like pricing curves etc. They also need you to ‘Think Big’. Sample interview questions include: Use a framework to structure your strategy discussions. If you’re not familiar with strategy or frameworks, Porter’s Five Forces is a good start along with 4Ps and SWOT Analysis. 3. Technical Skills: PM’s work closely with product development teams and hence should build trust with them. To work effectively with the team, PMs must have the ability to influence and build credibility with engineers. Examples questions include: It’s unlikely that you would be asked to write a program with the perfect programming syntax or optimize an problem to O(n) complexity or solve a NP complete problem. What you would be required to is that you have sufficient mastery of technical concepts so that you can participate in technical discussions and help make technical trade-offs. I would recommend going over computer science fundamentals and practicing a couple coding questions. One of my favorite resources is How to Ace the Software Engineering Interview. Also be prepared to describe key technologies including search engines, machine learning or large scale design systems. 4. Analytical: All good PM’s need to be data-driven. They need to define the success criteria for the products. And once the product is launched need to interpret the results (aka A/B test numbers) and make further iterations to the product. Now to evaluate those skills interviewer can ask the following questions: Get well-versed in product launch metrics and A/B testing, including interpretation of results. Also prepare for estimation based questions. Lewis Lin (founder of impact interview and a leading authority in this space) has created a wonderful & detailed 2 week plan that covers all the above topics to prepare for a PM interview. Please go ahead and book mark it: http://bit.ly/PMPrepPlan Practice Practice Preparing for any interview is like preparing for any competition (or exam). Like athletes talk about getting into the zone, you also need to get into the zone. You can achieve it by doing some mock interviews. This can be hard if you are starting new and don’t have much context about the PM role. However as mentioned above speaking with other PM’s about how they interview candidates and what they look in for their ideal PM candidate can definitely help. Apart from Google, Glassdoor and Quora are very good sources to get sample PM interview questions. Then prepare notecards with the questions you think you might get and ask someone to interview you. And if possible I recommend doing at least some of your prep under circumstances that mimics a live interview — at a whiteboard, under time pressure, and ideally with a confidante to ask the question. All of the above will help you crystallize your answers and help create a powerful story/brand. More reading/reference material Books Online Resources Follow me on Twitter Vishal Sood ", "child": "2106_1\t2106_2\t2106_32106_1\t2106_2\t2106_32106_1\t2106_2\t2106_32106_1\t2106_2\t2106_32106_1\t2106_2\t2106_3"}