{"name": "2147", "parent": "", "title": "Ken Burns effect Android Image", "sentences": [{"2c6c": "Ken Burns effect Android Image"}, {"a3ff": "Sometimes, when you watch TV programs like documentary films, you notice that in some scenes, a photo was zooming carefully. This technology is called Ken Burns effect,it is a type of panning and zooming effect used in video production from still imagery. For more details, you can watch this description image and video(powered by Wikipedia):"}, {"96e4": "In Android developing, there are some external libaries allows us to make this effect. By this post, I would like to provide to my readers KenBurnsView. It is easy to use and the result look like this :"}, {"a0dc": "After starting a new Android project, to to use this libary, we should add the dependency to app/build.gradle file:"}, {"adc7": "compile 'com.flaviofaria:kenburnsview:1.0.6'"}, {"534b": "Declare a simple activity layout that contain KenBurnsView"}, {"7c8d": "You can change the duration and the interpolator of transitions: In programmatically code, set “zooming time” through RandomTransitionGenerator. Time is measured in milliseconds. More greater time, slower “zooming speed” it is:"}, {"1c2a": "Like this libary docs say, when image pan/zoom, you can handle this process at start/end time by KenBurnsView.TransitionListener, in this example, I show a Toast to notice:"}, {"a4c8": "This line describe how to set this method to KenBurnsView:"}, {"de14": "kbv.setTransitionListener(onTransittionListener());"}, {"d32b": "Over here, our work have almost completed. Therefore, this view can be pause or resume through call pause() and resume() methods."}, {"2119": "kbv.pause();"}, {"86c9": "or"}, {"b789": "kbv.resume();"}, {"447c": "Finally, this is full code for the main activity :"}, {"48df": "If you like the article, follow me on Medium for more awesome Android tips. You can also find me on LinkedIn.If you found this article helpful, make sure to hit the green heart!"}], "content": "Ken Burns effect Android Image Sometimes, when you watch TV programs like documentary films, you notice that in some scenes, a photo was zooming carefully. This technology is called Ken Burns effect,it is a type of panning and zooming effect used in video production from still imagery. For more details, you can watch this description image and video(powered by Wikipedia): In Android developing, there are some external libaries allows us to make this effect. By this post, I would like to provide to my readers KenBurnsView. It is easy to use and the result look like this : After starting a new Android project, to to use this libary, we should add the dependency to app/build.gradle file: compile 'com.flaviofaria:kenburnsview:1.0.6' Declare a simple activity layout that contain KenBurnsView You can change the duration and the interpolator of transitions: In programmatically code, set “zooming time” through RandomTransitionGenerator. Time is measured in milliseconds. More greater time, slower “zooming speed” it is: Like this libary docs say, when image pan/zoom, you can handle this process at start/end time by KenBurnsView.TransitionListener, in this example, I show a Toast to notice: This line describe how to set this method to KenBurnsView: kbv.setTransitionListener(onTransittionListener()); Over here, our work have almost completed. Therefore, this view can be pause or resume through call pause() and resume() methods. kbv.pause(); or kbv.resume(); Finally, this is full code for the main activity : If you like the article, follow me on Medium for more awesome Android tips. You can also find me on LinkedIn.If you found this article helpful, make sure to hit the green heart! ", "child": "2147_1\t2147_22147_1\t2147_2"}