{"name": "2161", "parent": "", "title": "Design Research", "sentences": [{"b39d": "Design ResearchFrom Interview to Insight:"}, {"7475": "Part Two,Synthesising Insight"}, {"baf5": "This is the second of a two-part post, if you haven’t already please read Part One, Summarising the Interview."}, {"6bb6": "Creating a coherent summary of your Design Research"}, {"b927": "Once your research is complete and you’ve captured the main points from each activity, the next stage is to bring your team back together and start the process of synthesising."}, {"61f5": "Synthesis is a foggy process, your goal is to identify patterns and themes from across your research; it’s about storytelling and searching for consensus. It may feel overwhelming at the beginning as you wonder if you’ll ever be able to distill down the mass of evidence into something actionable and inspiring to design."}, {"4836": "The trick is to become comfortable with the ambiguity and take small steps — try not to worry about the ultimate goal. If your research was good you’ll find the answers you need, synthesis will help you get the value from the notes your recorded when out in the field."}, {"1d7d": "What is synthesis?"}, {"e626": "Synthesis is…"}, {"45c6": "The goal is to develop…"}, {"45ef": "Synthesis is about rationalising all of your research into a clear story and actions for the client or design team. It’s a point to jump forward and look to the rest of the project, and a point to refer back to when you have questions later."}, {"625c": "It’s an opportunity to share everyone’s experiences and to review all research activities: inspirational trips, analogous experiences and interviews."}, {"7ec5": "Read more about Design Research Methods here."}, {"71b5": "Take no presumptions into the session, an open mind is vital. Defer judgement and embrace the fog."}, {"38c8": "Looking for insight"}, {"4d53": "Insight is a term that is used in different ways, it’s something of buzzword at the moment which means we need to define it precisely first. When we talk about insight in this article it’s an actionable expression of human behaviour and the associated motivation. The difference between a ‘finding’ and an ‘insight’ isn’t always apparent, generally an insight should feel inspiring to the designer in you."}, {"04a4": "For example a ‘finding’ might look like this:"}, {"a22e": "Patients are often non-compliant, this makes their conditions worsen and GPs frustrated."}, {"7e69": "This is valuable information to have found, but until we understand what causes the behaviour it will be difficult to design to improve the situation."}, {"33bc": "An insight looks more like this:"}, {"c58f": "Patients are so nervous during appointments that they don’t listen to their doctors."}, {"0bae": "This is much more actionable as it highlights the underlying behaviour."}, {"88b0": "To get to this underlying behaviour you basically need to keep asking why. At this point you can’t quickly speak to the person you interviewed, but if you took good notes you should be able to piece together the answer. If you find it difficult to identify the underlying behaviour from your notes this is a good point to reflect on how you’d approach the interview next time."}, {"ded6": "Insights should be common across different research activities, if you have an insight drawn from only one or two interviews you should question how broadly applicable it is. The richest insights are supported by multiple research activities with data points, quotes, photos and observations all pointing to the same thing."}, {"698e": "You should be able to identify anything between 3 and 8 insights. Less might suggest your research didn’t cover a wide enough range of people. More than 8 suggests that you’ve not been critical enough and might be expressing the same insight multiple times."}, {"6c52": "Grouping emerging themes"}, {"1447": "Begin by pulling post-it notes together into logical groups. Don’t worry so much about the precise nature of each group, follow your collective instinct about what feels right."}, {"f7e0": "You may find that an area that felt strong in your head doesn’t come together; or that disparate notes suddenly align. Equally others in the your team may spot patterns you had missed. Switch between confidently leading the discussion and humbly letting others lead you."}, {"0e42": "As insights come together, quick names can help set them in your mind. Spending time and discussing the names of areas is important, the names you give might encompass other notes that haven’t yet found a home in a group."}, {"2a20": "Once a clear set of insight groups has come together, look what’s left — do they form a group of their own? Perhaps they start to fall away as they fail to make it into a group. Don’t remove any notes yet, if they made it onto the wall they need to stick around for a little longer. Keep jumping between the groups you’ve found and the left over notes."}, {"9120": "Telling stories"}, {"32b8": "As you review post-it notes, stories can help remind you of the user’s point of view and the original observation; it might also help you remember more details from the interview."}, {"cfd2": "When i’m working with a group and the conversations have dried up, I ask someone to tell me a story (any story will do) from the notes on the wall. It’s amazing how quickly it opens up group conversation again."}, {"04aa": "How to get unstuck"}, {"8f7a": "While I might be making the process of synthesis seem straightforward and logical, you will inevitably get stuck and feel lost. When you feel stranded amidst a sea of post-it notes there are some things you can do to get moving again."}, {"03b5": "The most important thing is to recognise getting stuck is part of the process. Ask from help from the outside, someone less close to the project will help give you perspective. If you can’t find someone who feels confident enough to play this role, find someone to ask questions of you — even if they aren’t familiar with the work they will be able to interrogate your findings. Even naive questions are useful as while you explain an insight area to them, you’ll be explaining it to yourselves too."}, {"f6d0": "A second way to get unstuck is to take a break and give yourself some space to think. If you sense the group getting tense or even angry, stepping out of the room to get a coffee is a far more valuable use of your time than getting into a downward spiral."}, {"34d2": "Finally, a very practical way to unblock your team is to give yourselves a structured generative task. Take one of your emerging insights and see if you can create ‘How Might We’ questions (find out more here). As you create these questions it’ll force you to think more specifically about the insight and reveal if it’s inspiring for design. As you think around an area it might open up adjacent opportunities and spark a new way of looking at the situation."}, {"6224": "Finding insight"}, {"cb92": "There isn’t a perfect formula for an insight, but there are a few questions you can ask:"}, {"478c": "If you answer yes to all of these questions you’re probably in a good place."}, {"df98": "Wrapping up"}, {"b6fd": "Once you have captured your insights — and they answer the criteria above — you should document them."}, {"5383": "Aim for no fewer than three insights and no more than eight. This is a rough guide but should give some indication. There isn’t a precise target."}, {"52a8": "These insights will become part of the deliverables for the project and should be shared with the team to inspire the following design phase."}, {"601b": "Your insights are the clearest articulation of your users’ needs. If, later in the project, you feel like your designs have drifted from the insight you should question your design, and not the insight."}, {"ff5e": "A huge thank you to Jenny Winfield who developed much of the content in this piece. Jenny is a Design Researcher at IDEO, follow her on Twitter."}], "content": "Design ResearchFrom Interview to Insight: Part Two,Synthesising Insight This is the second of a two-part post, if you haven’t already please read Part One, Summarising the Interview. Creating a coherent summary of your Design Research Once your research is complete and you’ve captured the main points from each activity, the next stage is to bring your team back together and start the process of synthesising. Synthesis is a foggy process, your goal is to identify patterns and themes from across your research; it’s about storytelling and searching for consensus. It may feel overwhelming at the beginning as you wonder if you’ll ever be able to distill down the mass of evidence into something actionable and inspiring to design. The trick is to become comfortable with the ambiguity and take small steps — try not to worry about the ultimate goal. If your research was good you’ll find the answers you need, synthesis will help you get the value from the notes your recorded when out in the field. What is synthesis? Synthesis is… The goal is to develop… Synthesis is about rationalising all of your research into a clear story and actions for the client or design team. It’s a point to jump forward and look to the rest of the project, and a point to refer back to when you have questions later. It’s an opportunity to share everyone’s experiences and to review all research activities: inspirational trips, analogous experiences and interviews. Read more about Design Research Methods here. Take no presumptions into the session, an open mind is vital. Defer judgement and embrace the fog. Looking for insight Insight is a term that is used in different ways, it’s something of buzzword at the moment which means we need to define it precisely first. When we talk about insight in this article it’s an actionable expression of human behaviour and the associated motivation. The difference between a ‘finding’ and an ‘insight’ isn’t always apparent, generally an insight should feel inspiring to the designer in you. For example a ‘finding’ might look like this: Patients are often non-compliant, this makes their conditions worsen and GPs frustrated. This is valuable information to have found, but until we understand what causes the behaviour it will be difficult to design to improve the situation. An insight looks more like this: Patients are so nervous during appointments that they don’t listen to their doctors. This is much more actionable as it highlights the underlying behaviour. To get to this underlying behaviour you basically need to keep asking why. At this point you can’t quickly speak to the person you interviewed, but if you took good notes you should be able to piece together the answer. If you find it difficult to identify the underlying behaviour from your notes this is a good point to reflect on how you’d approach the interview next time. Insights should be common across different research activities, if you have an insight drawn from only one or two interviews you should question how broadly applicable it is. The richest insights are supported by multiple research activities with data points, quotes, photos and observations all pointing to the same thing. You should be able to identify anything between 3 and 8 insights. Less might suggest your research didn’t cover a wide enough range of people. More than 8 suggests that you’ve not been critical enough and might be expressing the same insight multiple times. Grouping emerging themes Begin by pulling post-it notes together into logical groups. Don’t worry so much about the precise nature of each group, follow your collective instinct about what feels right. You may find that an area that felt strong in your head doesn’t come together; or that disparate notes suddenly align. Equally others in the your team may spot patterns you had missed. Switch between confidently leading the discussion and humbly letting others lead you. As insights come together, quick names can help set them in your mind. Spending time and discussing the names of areas is important, the names you give might encompass other notes that haven’t yet found a home in a group. Once a clear set of insight groups has come together, look what’s left — do they form a group of their own? Perhaps they start to fall away as they fail to make it into a group. Don’t remove any notes yet, if they made it onto the wall they need to stick around for a little longer. Keep jumping between the groups you’ve found and the left over notes. Telling stories As you review post-it notes, stories can help remind you of the user’s point of view and the original observation; it might also help you remember more details from the interview. When i’m working with a group and the conversations have dried up, I ask someone to tell me a story (any story will do) from the notes on the wall. It’s amazing how quickly it opens up group conversation again. How to get unstuck While I might be making the process of synthesis seem straightforward and logical, you will inevitably get stuck and feel lost. When you feel stranded amidst a sea of post-it notes there are some things you can do to get moving again. The most important thing is to recognise getting stuck is part of the process. Ask from help from the outside, someone less close to the project will help give you perspective. If you can’t find someone who feels confident enough to play this role, find someone to ask questions of you — even if they aren’t familiar with the work they will be able to interrogate your findings. Even naive questions are useful as while you explain an insight area to them, you’ll be explaining it to yourselves too. A second way to get unstuck is to take a break and give yourself some space to think. If you sense the group getting tense or even angry, stepping out of the room to get a coffee is a far more valuable use of your time than getting into a downward spiral. Finally, a very practical way to unblock your team is to give yourselves a structured generative task. Take one of your emerging insights and see if you can create ‘How Might We’ questions (find out more here). As you create these questions it’ll force you to think more specifically about the insight and reveal if it’s inspiring for design. As you think around an area it might open up adjacent opportunities and spark a new way of looking at the situation. Finding insight There isn’t a perfect formula for an insight, but there are a few questions you can ask: If you answer yes to all of these questions you’re probably in a good place. Wrapping up Once you have captured your insights — and they answer the criteria above — you should document them. Aim for no fewer than three insights and no more than eight. This is a rough guide but should give some indication. There isn’t a precise target. These insights will become part of the deliverables for the project and should be shared with the team to inspire the following design phase. Your insights are the clearest articulation of your users’ needs. If, later in the project, you feel like your designs have drifted from the insight you should question your design, and not the insight. A huge thank you to Jenny Winfield who developed much of the content in this piece. Jenny is a Design Researcher at IDEO, follow her on Twitter. ", "child": "2161_12161_1"}