{"name": "2164", "parent": "", "title": "Real America is Only Two Hours Away", "sentences": [{"a23e": "Real America is Only Two Hours Away"}, {"a107": "The Sunday morning before the election, I got up early, packed a backpack, and walked to Cadman Plaza, just across the street from the Clinton campaign headquarters. After an hour of standing around, drinking coffee and waiting for instructions, we boarded a bus headed for Coatesville, Pennsylvania."}, {"1b87": "Coatesville is about halfway between Philadelphia and Lancaster; it was a railroad town, built on steel and iron works, and now has a population of about 13,000 people, though to be honest, that might be a generous number. You can tell it was once a pretty, working class town. Some parts are under redevelopment, others are burnt out and abandoned, or long-since boarded up and crumbling. Half of the residents are African-American; two-thirds rent their homes; about one-third are under 18. Out of curiosity, I looked it up — per capita income is less than $15,000 in Coatesville. The federal poverty limit for a family of four is about $24,000."}, {"69c2": "When we pulled into Coatesville, we parked at a local church, got our briefing and materials, and received a list of registered Democrats and their addresses. Our job was limited — knock on doors, ask if they’re voting (and for whom), and make sure they have a plan to vote. Then on to the next."}, {"29b4": "I paired up with a black, British woman about my age, a doctor with the UN Refugee program; she was in the US on vacation. Having just witnessed her countrymen vote for Brexit, she wanted to help us avoid a similar fate. She was using her holiday to assist us in our activism — while admirable, it also seemed like a harbinger of what was to come."}, {"8cdc": "As we walked our little precinct, we visited mostly what I think was sectioned housing. Kids roamed from yard to yard, following us as we walked, curious what we were up to, asking questions and cracking jokes, requesting stickers and pins to wear."}, {"5480": "Men in their late 20s and 30s sat on porches here and there, watching us as we walked by, nodding or waving back if we said hello. But on the whole it was a quiet afternoon, not a lot of people out — a Sunday, after all, and the Eagles were playing."}, {"dc58": "Like a lot of small towns, churches were everywhere. Our plat of voters all shared a polling station inside the Olivet United Methodist church. They didn’t need to be told where it was, they’d been there before; they didn’t need help getting there, it was within walking distance; they didn’t need to be nagged about making a plan, they knew what to do."}, {"8308": "A lot of times, no one answered the door. We stuck polling station information to closed doors, and slid candidate brochures between the door and the jamb. We could see where our predecessors had already been, and where doors and gates and mailboxes hadn’t been opened in days. Sometimes you could tell the home was unoccupied or abandoned — empty front rooms stripped of curtains, old TVs left behind on porches."}, {"a9d2": "At one apartment, we met a middle-aged white woman; she told us she’d recently moved to Coatesville, that she’d changed parties to vote for Clinton, that Trump was terrifying and she could never vote for him."}, {"68d9": "At a house, we met another, slightly younger, white woman. She told us she’d voted for Clinton in the primary, but after doing research and hearing from friends, she’d changed her mind and would vote for Trump. Because Hillary just can’t be trusted, she explained."}, {"4e1b": "An older, multi-story apartment building, probably one of the few in town tall enough to need an elevator, seemed to be a de facto retirement home, full of older, mostly African-American women. One woman, who lived in a ground floor apartment, opened her door, and offered to let us into the building. She told us, grimly, that most everyone in that building would vote, and that they would all vote Democrat."}, {"4c07": "At another apartment, a home nurse told us her patient couldn’t vote because she couldn’t be moved."}, {"17af": "The moments when we could trouble-shoot a real problem were the most useful. If you’ve voted at this station before, you don’t need ID. If you haven’t voted here before, you only need one piece of ID. If your driver’s license is expired, you can bring a utility bill with your address on it as proof of identity. If you were charged with a misdemeanor you can still vote. If you’re not registered in Coatesville, you can’t vote here — let’s see if we can help you vote where you are registered. No, those ID and residence requirements were for North Carolina, not here. I know you heard about it on the news, but it isn’t true. If you’re worried, you can always request a provisional ballot. I’m not sure if there will be long lines — better to go early if you can. Voting is on Tuesday, polls open at 7."}, {"68a4": "But it also seemed that these questions should have been answered months ago. People who couldn’t physically make it to the polls because of jobs or disability should already have received and sent in absentee ballots. People who needed ID should have been offered help to get it."}, {"a0b8": "On the way back to the church, we stopped into a convenience store. While we got coffee and snacks, a late middle-aged African-American couple bought the doctor a machine cappuccino, and thanked us for canvassing."}, {"84a3": "In the basement, as an evening service took place upstairs, a few canvassers were placing follow-up phone calls to the people who hadn’t opened their doors. Meanwhile, children of congregants in dresses and trousers and vests tried hard to sit still while watching a Disney movie, as two of the moms tried to keep order. We all took turns using the only restroom."}, {"4a96": "What struck me most was this: everyone in town was very polite, but you could tell they were tired of us."}, {"c7a2": "One person we met said, “I’ve heard more from the Democratic Party in the last two weeks than I have in my whole life.” Suddenly, I identified the feeling that had been creeping up on me all afternoon. I was ashamed."}, {"abc6": "I wondered — how is this a fair exchange? We turn up asking them to vote (for us!), but what do they get for their trouble? What do the parties do for their members? If voting is irrational, what itch does it scratch? If it’s a transaction, what do they expect in return? If it’s a stitch holding us together in a social net, then what do we owe to each other?"}, {"b22f": "There, along the Brandywine River, it seemed like politics should be allowed to stop at the water’s edge. But as a political culture, we’re too often afraid of what lies beyond our partisan shores."}, {"e610": "Troubles v. Issues"}, {"5c0c": "As we were leaving Coatesville, I couldn’t shake the feeling that I should have stayed — to listen and to learn, to find out how much we have in common, as Americans, and how much really does divide us. As a researcher, I know this is always the beginning of designing something better: a better way to engage citizens and to serve them, a better way of understanding why they vote the way they do — what they want and need, not just what they think and who they’ll vote for."}, {"9063": "Too often, we’re focused on asking people about issues — what I want to understand is their troubles. Issues are public matters; troubles are individual experiences. Where issues fail to connect with troubles, and troubles fail to become issues, people lose faith with the institutions that make up our democracy. (For more on this, check out some of Jay Rosen’s writings.)"}, {"eeaa": "We — people who measure, and attempt to inform or influence the public — spend too much time and energy on issues, and not nearly enough on troubles."}, {"7b42": "We need to engage in authentic, humble listening, and to translate empathy and insight into action. This is the only way I know to earn trust from anyone. As it happens, it’s what qualitative researchers, design researchers, people like me, get paid to do. We have an enormous trove of tools and skills that enable us to do this about any subject, with any subject."}, {"a96f": "I didn’t think this was solely our domain, however. While I spent most of the election dissatisfied with the practices of political pollsters, and with the recent tendency to worship poll numbers, prediction markets, and forecasts as if they are magical, I still assumed that journalists were equipped to do the qualitative, shoe-leather work to contextualize the data and to inform the polling methods and questions."}, {"3097": "I looked for journalists who were trying something different. Long-form journalism profiled towns and voters; reporters on news networks did vox populi reporting in swing states; podcasts like fivethirtyeight’s elections podcast aired a series they did on key voter demographics; the United States of Anxiety was another series that tried to provide context. On the Media did a terrific series on poverty. But these stories were hemmed in by the editorial perspectives of their makers."}, {"cc23": "Investigative journalism is a skill set that shares a lot in common with what ethnographers and design researchers do, but this work is famously underfunded. The Texas Tribune, after the election, crowdfunded a role for their first ever community reporter — whose beat will be, literally, Texans. This reporter’s job will be to “ensure that the voices of more Texans from more places inform our coverage.” I genuinely thought that was already the job of journalists — I was wrong."}, {"df9e": "Properly framing the question is always the hardest part of discovering the answer. Politics has focused for a long time on quantifiable questions: which party do you belong to, who are you voting for, are you voting, did you vote. We put a slate of issues or candidates in front of voters on a ballot, or likely voters on a survey, and we ask them to rank and rate, to evaluate."}, {"8458": "Us v. Us"}, {"0c47": "This is, in a way, an adversarial system. Pollsters, politicos and journalists craft surveys for ordinary folks to take. It’s easy to see these not as surveys, measurements of how many people do or think something, but rather as tests, indicators of how savvy or stupid people are. We think we see in the data people contradicting themselves, we think we spy in the cross-tabs hypocrisy in the body politic. We become suspicious of one another, reduce our interpretations and explanations to cultural and political spheres of influence and alignment. We choose polarization."}, {"d1c1": "As a result, for example, we see our political parties engage in misery-pandering to the American working class. The parties peddle an “America in Decline” story (or, “American Carnage”), but then neglect the folks who are in fact experiencing that decline. Depending on the era, one party chooses to be essentially pessimistic, and the other essentially optimistic; one side wants to roll back changes to the good old days, and the other side wants to build a bridge to the next great epoch of American exceptionalism."}, {"f9b4": "Stuck in our narratives, we find ourselves incapable of connecting with each other, of perspective-taking, of sense-making. We meet unemployed or underemployed people, whether on the reporter’s beat, the op-ed columnist’s taxi ride, the civil servant’s counter or desk, or at the elected official’s coffee klatch, and we respond to their troubles with, “Well, statistically you do have a job, you do have lower insurance premiums.”"}, {"f0df": "Yet we can’t afford to descend into nihilism — a national narrative of problems too complex, too old, too entrenched to be solved; or of institutions too corrupt and decrepit to solve them. Polarization and nihilism are choices we make — we can make other choices."}, {"c6f4": "Change v. More of the Same"}, {"f6d7": "What if we started from a different perspective — what if we started with these questions: What problems can we solve? What do we want but can’t do by ourselves? What does our community need? What kind of community could we create? What are our troubles?"}, {"870a": "Many of the answers will be functional or financial, but many will also be emotional, social, communal. We will see demographic boundaries blur, we will discover common troubles that don’t respect demographic fault lines or gerrymandered districts."}, {"94b7": "We should start with a critical assumption: there are solutions to most of these troubles. Some of these solutions will be found in awareness and communication; some in technology; some in system and service design; some in legal action or legislation; some in fund-raising; some will be found in community action and activation. We could enlist the very people who share these troubles in the creation of solutions."}, {"b1f8": "But to do this, we’d need to be in communities more often than once every four years. We’d need to sit down and spend time; we’d need to do more listening and observing than talking; we’d need to ditch our checklists and tallies; we’d need to park our beliefs about what policies should or could work, and what slogans resonate, and why people behave the way they do."}, {"c441": "What are the social, economic and political structures that affect the way we live, educate our children, find and get to work, engage in our communities? Where can these structures be improved, or reimagined, or invented? How can more people be brought into civic involvement, unite with the body politic?"}, {"842e": "Let’s zero out the current mode of politicking and reporting and do literally anything else. Let’s start simply. “What do you need? What do you want? What can we do together?” We’d dig beneath issues — voting, public schools, public health, infrastructure, veterans — to get at the troubles. Then we could begin to co-design solutions, to advocate, to educate, to activate."}, {"16a0": "To start, we’d go back to Coatesville — and a hundred towns bigger and smaller, more diverse and less, richer and poorer — to ask these questions, to listen to the answers, to look for the opportunities, to go and see for ourselves."}, {"8294": "The plan for how we’re going to do that will be in the next post. Get in touch if you’re interested in helping."}], "content": "Real America is Only Two Hours Away The Sunday morning before the election, I got up early, packed a backpack, and walked to Cadman Plaza, just across the street from the Clinton campaign headquarters. After an hour of standing around, drinking coffee and waiting for instructions, we boarded a bus headed for Coatesville, Pennsylvania. Coatesville is about halfway between Philadelphia and Lancaster; it was a railroad town, built on steel and iron works, and now has a population of about 13,000 people, though to be honest, that might be a generous number. You can tell it was once a pretty, working class town. Some parts are under redevelopment, others are burnt out and abandoned, or long-since boarded up and crumbling. Half of the residents are African-American; two-thirds rent their homes; about one-third are under 18. Out of curiosity, I looked it up — per capita income is less than $15,000 in Coatesville. The federal poverty limit for a family of four is about $24,000. When we pulled into Coatesville, we parked at a local church, got our briefing and materials, and received a list of registered Democrats and their addresses. Our job was limited — knock on doors, ask if they’re voting (and for whom), and make sure they have a plan to vote. Then on to the next. I paired up with a black, British woman about my age, a doctor with the UN Refugee program; she was in the US on vacation. Having just witnessed her countrymen vote for Brexit, she wanted to help us avoid a similar fate. She was using her holiday to assist us in our activism — while admirable, it also seemed like a harbinger of what was to come. As we walked our little precinct, we visited mostly what I think was sectioned housing. Kids roamed from yard to yard, following us as we walked, curious what we were up to, asking questions and cracking jokes, requesting stickers and pins to wear. Men in their late 20s and 30s sat on porches here and there, watching us as we walked by, nodding or waving back if we said hello. But on the whole it was a quiet afternoon, not a lot of people out — a Sunday, after all, and the Eagles were playing. Like a lot of small towns, churches were everywhere. Our plat of voters all shared a polling station inside the Olivet United Methodist church. They didn’t need to be told where it was, they’d been there before; they didn’t need help getting there, it was within walking distance; they didn’t need to be nagged about making a plan, they knew what to do. A lot of times, no one answered the door. We stuck polling station information to closed doors, and slid candidate brochures between the door and the jamb. We could see where our predecessors had already been, and where doors and gates and mailboxes hadn’t been opened in days. Sometimes you could tell the home was unoccupied or abandoned — empty front rooms stripped of curtains, old TVs left behind on porches. At one apartment, we met a middle-aged white woman; she told us she’d recently moved to Coatesville, that she’d changed parties to vote for Clinton, that Trump was terrifying and she could never vote for him. At a house, we met another, slightly younger, white woman. She told us she’d voted for Clinton in the primary, but after doing research and hearing from friends, she’d changed her mind and would vote for Trump. Because Hillary just can’t be trusted, she explained. An older, multi-story apartment building, probably one of the few in town tall enough to need an elevator, seemed to be a de facto retirement home, full of older, mostly African-American women. One woman, who lived in a ground floor apartment, opened her door, and offered to let us into the building. She told us, grimly, that most everyone in that building would vote, and that they would all vote Democrat. At another apartment, a home nurse told us her patient couldn’t vote because she couldn’t be moved. The moments when we could trouble-shoot a real problem were the most useful. If you’ve voted at this station before, you don’t need ID. If you haven’t voted here before, you only need one piece of ID. If your driver’s license is expired, you can bring a utility bill with your address on it as proof of identity. If you were charged with a misdemeanor you can still vote. If you’re not registered in Coatesville, you can’t vote here — let’s see if we can help you vote where you are registered. No, those ID and residence requirements were for North Carolina, not here. I know you heard about it on the news, but it isn’t true. If you’re worried, you can always request a provisional ballot. I’m not sure if there will be long lines — better to go early if you can. Voting is on Tuesday, polls open at 7. But it also seemed that these questions should have been answered months ago. People who couldn’t physically make it to the polls because of jobs or disability should already have received and sent in absentee ballots. People who needed ID should have been offered help to get it. On the way back to the church, we stopped into a convenience store. While we got coffee and snacks, a late middle-aged African-American couple bought the doctor a machine cappuccino, and thanked us for canvassing. In the basement, as an evening service took place upstairs, a few canvassers were placing follow-up phone calls to the people who hadn’t opened their doors. Meanwhile, children of congregants in dresses and trousers and vests tried hard to sit still while watching a Disney movie, as two of the moms tried to keep order. We all took turns using the only restroom. What struck me most was this: everyone in town was very polite, but you could tell they were tired of us. One person we met said, “I’ve heard more from the Democratic Party in the last two weeks than I have in my whole life.” Suddenly, I identified the feeling that had been creeping up on me all afternoon. I was ashamed. I wondered — how is this a fair exchange? We turn up asking them to vote (for us!), but what do they get for their trouble? What do the parties do for their members? If voting is irrational, what itch does it scratch? If it’s a transaction, what do they expect in return? If it’s a stitch holding us together in a social net, then what do we owe to each other? There, along the Brandywine River, it seemed like politics should be allowed to stop at the water’s edge. But as a political culture, we’re too often afraid of what lies beyond our partisan shores. Troubles v. Issues As we were leaving Coatesville, I couldn’t shake the feeling that I should have stayed — to listen and to learn, to find out how much we have in common, as Americans, and how much really does divide us. As a researcher, I know this is always the beginning of designing something better: a better way to engage citizens and to serve them, a better way of understanding why they vote the way they do — what they want and need, not just what they think and who they’ll vote for. Too often, we’re focused on asking people about issues — what I want to understand is their troubles. Issues are public matters; troubles are individual experiences. Where issues fail to connect with troubles, and troubles fail to become issues, people lose faith with the institutions that make up our democracy. (For more on this, check out some of Jay Rosen’s writings.) We — people who measure, and attempt to inform or influence the public — spend too much time and energy on issues, and not nearly enough on troubles. We need to engage in authentic, humble listening, and to translate empathy and insight into action. This is the only way I know to earn trust from anyone. As it happens, it’s what qualitative researchers, design researchers, people like me, get paid to do. We have an enormous trove of tools and skills that enable us to do this about any subject, with any subject. I didn’t think this was solely our domain, however. While I spent most of the election dissatisfied with the practices of political pollsters, and with the recent tendency to worship poll numbers, prediction markets, and forecasts as if they are magical, I still assumed that journalists were equipped to do the qualitative, shoe-leather work to contextualize the data and to inform the polling methods and questions. I looked for journalists who were trying something different. Long-form journalism profiled towns and voters; reporters on news networks did vox populi reporting in swing states; podcasts like fivethirtyeight’s elections podcast aired a series they did on key voter demographics; the United States of Anxiety was another series that tried to provide context. On the Media did a terrific series on poverty. But these stories were hemmed in by the editorial perspectives of their makers. Investigative journalism is a skill set that shares a lot in common with what ethnographers and design researchers do, but this work is famously underfunded. The Texas Tribune, after the election, crowdfunded a role for their first ever community reporter — whose beat will be, literally, Texans. This reporter’s job will be to “ensure that the voices of more Texans from more places inform our coverage.” I genuinely thought that was already the job of journalists — I was wrong. Properly framing the question is always the hardest part of discovering the answer. Politics has focused for a long time on quantifiable questions: which party do you belong to, who are you voting for, are you voting, did you vote. We put a slate of issues or candidates in front of voters on a ballot, or likely voters on a survey, and we ask them to rank and rate, to evaluate. Us v. Us This is, in a way, an adversarial system. Pollsters, politicos and journalists craft surveys for ordinary folks to take. It’s easy to see these not as surveys, measurements of how many people do or think something, but rather as tests, indicators of how savvy or stupid people are. We think we see in the data people contradicting themselves, we think we spy in the cross-tabs hypocrisy in the body politic. We become suspicious of one another, reduce our interpretations and explanations to cultural and political spheres of influence and alignment. We choose polarization. As a result, for example, we see our political parties engage in misery-pandering to the American working class. The parties peddle an “America in Decline” story (or, “American Carnage”), but then neglect the folks who are in fact experiencing that decline. Depending on the era, one party chooses to be essentially pessimistic, and the other essentially optimistic; one side wants to roll back changes to the good old days, and the other side wants to build a bridge to the next great epoch of American exceptionalism. Stuck in our narratives, we find ourselves incapable of connecting with each other, of perspective-taking, of sense-making. We meet unemployed or underemployed people, whether on the reporter’s beat, the op-ed columnist’s taxi ride, the civil servant’s counter or desk, or at the elected official’s coffee klatch, and we respond to their troubles with, “Well, statistically you do have a job, you do have lower insurance premiums.” Yet we can’t afford to descend into nihilism — a national narrative of problems too complex, too old, too entrenched to be solved; or of institutions too corrupt and decrepit to solve them. Polarization and nihilism are choices we make — we can make other choices. Change v. More of the Same What if we started from a different perspective — what if we started with these questions: What problems can we solve? What do we want but can’t do by ourselves? What does our community need? What kind of community could we create? What are our troubles? Many of the answers will be functional or financial, but many will also be emotional, social, communal. We will see demographic boundaries blur, we will discover common troubles that don’t respect demographic fault lines or gerrymandered districts. We should start with a critical assumption: there are solutions to most of these troubles. Some of these solutions will be found in awareness and communication; some in technology; some in system and service design; some in legal action or legislation; some in fund-raising; some will be found in community action and activation. We could enlist the very people who share these troubles in the creation of solutions. But to do this, we’d need to be in communities more often than once every four years. We’d need to sit down and spend time; we’d need to do more listening and observing than talking; we’d need to ditch our checklists and tallies; we’d need to park our beliefs about what policies should or could work, and what slogans resonate, and why people behave the way they do. What are the social, economic and political structures that affect the way we live, educate our children, find and get to work, engage in our communities? Where can these structures be improved, or reimagined, or invented? How can more people be brought into civic involvement, unite with the body politic? Let’s zero out the current mode of politicking and reporting and do literally anything else. Let’s start simply. “What do you need? What do you want? What can we do together?” We’d dig beneath issues — voting, public schools, public health, infrastructure, veterans — to get at the troubles. Then we could begin to co-design solutions, to advocate, to educate, to activate. To start, we’d go back to Coatesville — and a hundred towns bigger and smaller, more diverse and less, richer and poorer — to ask these questions, to listen to the answers, to look for the opportunities, to go and see for ourselves. The plan for how we’re going to do that will be in the next post. Get in touch if you’re interested in helping. ", "child": "2164_1"}