{"name": "2165", "parent": "", "title": "A Cup of Coffee and States of UI Screens", "sentences": [{"b91e": "A Cup of Coffee and States of UI Screens"}, {"80e5": "A coffee cup can exist in the following five states ."}, {"ec0c": "What if I tell you that a UI screen of an app should be designed in these exact five states?"}, {"84be": "1. Blank/Empty State"}, {"5dc9": "Empty coffee cup and ‘Watching’ empty screen of eBay app."}, {"d444": "Think about the initial state of a UI — during the first run of the app when there is no data to be shown to the user. This is the ‘empty cup' state."}, {"17d3": "Design the screen in such a way that a call to action can be shown. Did you notice the “Go shopping” button in the ‘Watching’ screenshot of eBay app?"}, {"4194": "Visit Empty States website for design inspiration."}, {"a4f6": "2. Loading State"}, {"8aa7": "Coffee being poured into the cup and skeleton screen of ‘My Orders’ in Flipkart app."}, {"d268": "When data is being loaded on to the UI screen, the user should be informed about this activity."}, {"631a": "‘Activity indicators' and ‘skeleton screens’ have to be designed for this. The above screenshot is the skeleton screen of ‘My Orders' in Flipkart app."}, {"1ccc": "3. Partial State"}, {"d9a5": "Half full (half empty) cup and prompt screen of LinkedIn app."}, {"71c3": "If the data on the screen is lesser than the ideal state, the users can be prompted to use the app more often or enter more data."}, {"390f": "LinkedIn app prompts the user to complete his profile by showing a screen filled with pointers and helpful info."}, {"9239": "4. Error State"}, {"2382": "An upside down cup that cannot be filled and ‘Location Not Found’ error screen from Uber app."}, {"a8e5": "Think about the errors that can occur on a screen and embed useful info for the users to get out of this annoying state."}, {"203b": "Try to design screens that take care of data missing errors, data validation errors in forms and internet connectivity errors. Your users will thank you for helping them out with relevant and contextual messages/action buttons."}, {"1d1f": "‘Location Not Found' error screen from Uber app is shown above. Observe how the message presents two options to the user to get out of the whole mess."}, {"7b46": "5. Ideal State"}, {"cf07": "A cup full of hot, steaming coffee and home screen of Gaana music streaming app."}, {"e9f2": "We all know this, right? This is the first state that is designed in any app UI project. A screen full of data is presented in a useful, beautiful way."}, {"fae3": "The screenshot shown above is the home screen of Gaana music streaming app."}, {"0096": "Takeaway"}, {"77db": "Never forget your coffee cup while designing UI screens of apps!"}, {"c3a5": "Whenever a UI is being designed, just think about a coffee cup! Design beyond the ideal state of a UI screen to include four more states."}, {"32c3": "Our mission is to help the users to lead a better life!"}, {"81b7": "Enjoyed this article? Spread the joy to others by sharing and recommending!Also, head to www.antzFxWay.com for more design and photography stuff."}, {"c8ca": "Inspired by ‘How to fix a bad user interface' by Scott Hurff"}, {"1035": "Cover image courtesy: Pixabay.com"}, {"eaad": "Coffee icons from The Noun Project, created by Raz Cohen, Adrian Q and Charlotte Vogel."}], "content": "A Cup of Coffee and States of UI Screens A coffee cup can exist in the following five states . What if I tell you that a UI screen of an app should be designed in these exact five states? 1. Blank/Empty State Empty coffee cup and ‘Watching’ empty screen of eBay app. Think about the initial state of a UI — during the first run of the app when there is no data to be shown to the user. This is the ‘empty cup' state. Design the screen in such a way that a call to action can be shown. Did you notice the “Go shopping” button in the ‘Watching’ screenshot of eBay app? Visit Empty States website for design inspiration. 2. Loading State Coffee being poured into the cup and skeleton screen of ‘My Orders’ in Flipkart app. When data is being loaded on to the UI screen, the user should be informed about this activity. ‘Activity indicators' and ‘skeleton screens’ have to be designed for this. The above screenshot is the skeleton screen of ‘My Orders' in Flipkart app. 3. Partial State Half full (half empty) cup and prompt screen of LinkedIn app. If the data on the screen is lesser than the ideal state, the users can be prompted to use the app more often or enter more data. LinkedIn app prompts the user to complete his profile by showing a screen filled with pointers and helpful info. 4. Error State An upside down cup that cannot be filled and ‘Location Not Found’ error screen from Uber app. Think about the errors that can occur on a screen and embed useful info for the users to get out of this annoying state. Try to design screens that take care of data missing errors, data validation errors in forms and internet connectivity errors. Your users will thank you for helping them out with relevant and contextual messages/action buttons. ‘Location Not Found' error screen from Uber app is shown above. Observe how the message presents two options to the user to get out of the whole mess. 5. Ideal State A cup full of hot, steaming coffee and home screen of Gaana music streaming app. We all know this, right? This is the first state that is designed in any app UI project. A screen full of data is presented in a useful, beautiful way. The screenshot shown above is the home screen of Gaana music streaming app. Takeaway Never forget your coffee cup while designing UI screens of apps! Whenever a UI is being designed, just think about a coffee cup! Design beyond the ideal state of a UI screen to include four more states. Our mission is to help the users to lead a better life! Enjoyed this article? Spread the joy to others by sharing and recommending!Also, head to www.antzFxWay.com for more design and photography stuff. Inspired by ‘How to fix a bad user interface' by Scott Hurff Cover image courtesy: Pixabay.com Coffee icons from The Noun Project, created by Raz Cohen, Adrian Q and Charlotte Vogel. ", "child": "2165_1\t2165_2\t2165_3\t2165_4\t2165_52165_1\t2165_2\t2165_3\t2165_4\t2165_52165_1\t2165_2\t2165_3\t2165_4\t2165_52165_1\t2165_2\t2165_3\t2165_4\t2165_5"}