{"name": "2167", "parent": "", "title": "DRS2016 Debates Briefing", "sentences": [{"4e87": "DRS2016 Debates Briefing"}, {"6a88": "Following is a rationale and briefing for the three Debates (in place of Keynote Addresses) at the Design Research Society Conference at the University of Brighton in late June, 2016."}, {"1b0f": "Our societies seem to be losing their capacity for debate, for arguing civilly through positions and then concluding with a decided upon course of action. Politics for instance appears to be devolving into attacks — even physical — from incommensurable bubbles rather than negotiation."}, {"e623": "Since Horst Rittel at least, the practice of design has realized that it is unavoidably an act of argumentation, about which preferred futures and how to realize them. The discipline of design has responded with a range of more or less successful initiatives: the Design Methods movement; dialogue mapping; design thinking; participatory design and co-design., for instance. The establishment of Design Research as a field has itself been the result of contested debates around Doctoral Design Education and Practice-based Design Research."}, {"746c": "However, these debates have not always been as productive as perhaps necessary: the discipline could and probably should be more functional than the PhD-Design List for example sometimes evidences. On this occasion of 50 years of the Design Research Society, we ask, what role can Conferences play in re-establishing processes for Debating Design and Designed Debate?"}, {"7cde": "Conferences are occasions at which a discipline shares research. That act of sharing is an opportunity to learn about new knowledge created by research in the discipline. But it is also, before that, a moment in the process of knowledge creation. Though research at a conference should have been reviewed by peers who funded the research and then by peers on the conference’s Scientific Committee, the presentation of the research to a wider group of peers offers a further moment of validation. In this way, conferences not only share new knowledge, but arbitrate further about what constitutes new knowledge in the discipline."}, {"3c34": "This task overlaps with the other rationale for conferences: an opportunity for representatives of a discipline to make decisions about the state of the discipline. Conferences with these agenda often involve formal congresses that pass resolutions and even issue media statements."}, {"c7ea": "Two practices of conferences have tended to undermine these decision-making potentials. The one is the keynote address. This kind of presentation, both because of its individualistic format, and because of the hierarchy it reinforces, is not conducive to collective decision-making, even if the presentation proves to be thought-provoking or exemplary. The other more significant but less acknowledged practice is pluralism. The role conferences play in academic economies has tended to mean that themes are only loosely observed so that any kind of design research can find a way to be included. This openness limits the capacity of conferences to be venues for making determinations about a discipline’s findings and priorities."}, {"6800": "The Design Research Society Conference at Umea in 2014 innovated a series of Debates in place of Keynote Addresses. The DRS Conference at Brighton will further this precedent. The aim is to experiment with moments in the Conference that recover collective decision-making with respect to the discipline of design. These negotiations will not have any legal force but instead will prototype what it might be like for a large conference on design to try explicitly to design the future of design research."}, {"58b8": "The Debates will therefore be structured around resolutions that invited representatives will put forward. The Conference Chairs have curated three topics for these invited resolutions: (Speculative) Futures in Design Research, (Sustainable) Design Research for Change, Design Research in (the Tech) Industry."}, {"fc16": "To break with a too dyadic version of argumentation, each Debate will involve 3 participants, speaking for and against 3 distinct propositions. The following briefing papers are informing the resolutions that the invited Debaters will propose at the conference."}, {"21f6": "(Speculative) Futures in Design Research"}, {"cfe1": "Design realizes preferred futures. The process for getting to the nature of preferred supposedly involves balancing"}, {"aee5": "a) the radical and the feasible (what Raymond Loewy called the Most Advanced yet Acceptable)"}, {"3113": "b) the long-term and the short-term"}, {"bea6": "c) the particularities of some and what suits most (since design is the art and/or science of mass production for mass consumption)"}, {"075a": "The centrality of futures and futuring to design suggests that core skills taught to research-based designers is:"}, {"9156": "i) foresighting"}, {"c592": "ii) scenario planning"}, {"1ba0": "iii) backcasting"}, {"0473": "Despite Futures being a moderately substantial discipline and practice, few Design Schools seem to explicitly teach its principles and techniques (though titling degree programs Design Futures seems currently in vogue)."}, {"a126": "Some of this reticence is perhaps a reaction to the deterministic futuring that structured much of modernist designing. Strong visions of futures were imposed on society in Procrustean ways and current societies must deal with their consequent unsustainability."}, {"043f": "As a result however, there is the risk of design tending toward the timid. Bold visions are supplanted by what must be evidence-based, or collaboratively consensual, or iteratively emergent."}, {"e406": "What remains of design visioning are ‘speculations.’ These tend to privilege ambiguity, with a bias toward the photogenically dystopian. They often reinforce technology-driven change rather than social change. When it comes to the future, the designer’s only responsibility appears to be to provoke thought, not argue for what should be preferred."}, {"855e": "Without robust approaches to futuring, designing seems easily dominated by technological solutions in search of problems, or worse, more or less random A/B tests in search of monetizable scale."}, {"1933": "Design Researchers needs to reassert the role of Design Research in Futuring and Futuring in Design Research."}, {"099a": "(Sustainable) Design Research for Change"}, {"1885": "Design is the expert practice of change-making. Research in support of design therefore tends to be oriented toward change; change in the how designing happens in the case of Research of Design; or change as the outcome of designing in the case of Research for Design."}, {"b11c": "This applied nature of design research is often disconcerting to scholars of other disciplines working with design researchers. This is especially so when designers undertake their research by making changes to a situation rather than prior to intervening."}, {"74d7": "Being change-oriented places a burden on design research that can be at odds with the creativity of designing. As with many professional practices, there are pressures for design to do more to become more evidence-based. But can creative leaps toward preferable futures ever be evidential? The practice of designing has bolstered the reliability of its nevertheless abductive and situated nature in two ways: methods and precedents or patterns. Both are attempts to extrapolate from the particulars of a design challenge ways of designing or design forms that could be used in other different contexts. These strategies however do depend on designers being diligent about extracting methods and patterns from jobs, sharing those findings with other designers, and then taking the time when next designing to find and try shared methods and patterns. Have designers a good track record in learning from design research in this way?"}, {"33b9": "The case study of Sustainable Design suggests ‘no.’ The demand for designers to take responsibility for enhancing the sustainability of our societies has been voiced powerfully since at least the time of Victor Papanek. Dilemmas like paper or plastic prompted research, and those Life Cycle Assessments often indicated that what was most ‘eco-friendly’ was counter-intuitive. Sustainable design has therefore always been a strongly research-led process — perhaps to a fault: many ecodesign tools failed to achieve take-up because their research-heavy processes failed to interface well with design practice."}, {"7fee": "Given how research-driven sustainable design has been, we could perhaps have expected significant improvements in the ecological performance of designed products, environments and services. Since the overwhelming majority of designs remain ecologically harmful in significant ways, why has sustainable design research not been effective?"}, {"bcd2": "No doubt the large-scale forces of unsustainability — global capital selling a particular consumerist version of well-being — are difficult to combat with research-based design. However, have sustainable design researchers been as coordinated and determined as such an enemy warrants? Certainly, Tony Fry, for example, has made a strong case for a much more concerted version of sustainable design."}, {"1754": "Quite the reverse, sustainable design projects frequently seem repetitious (e.g., how many guides to eco-friendly paper stock for graphic designers?), and frequently ignorant of prior research (e.g., how many unfeasible power generating gyms or playgrounds?). Sustainability in student projects often seems to be an off-the-shelf politics excusing poor quality research."}, {"de93": "The problem here might not be limited to design. Much sustainability research now appears misdirected, failing to bridge knowledge-action gaps, or, when they do, failing to account for later rebound effects."}, {"5ace": "How could design research be adequate to the massive challenge of enhancing societal sustainability? What could other social-change-enabling practices of design, like design for social innovation, learn from the inadequacies of sustainable design research."}, {"b949": "Design Research in (the Tech) Industry"}, {"e0a3": "In many ways, the modern practice of design began in educational institutions — e.g., the Bauhaus — as an attempt to bring the ambitions for social change of modernist art to the power and scale of industry. In North America, the Streamliners proved more successful at this act of translation, both in terms of the scale of households their products reached, and in terms of the extent to which their wider narratives about technological progress were adopted."}, {"46eb": "The story is similar with respect to academic design research. At the same moment that Design Schools were incorporated into university systems and so began to develop formal research activity and doctoral programs, the industries responsible for bringing computation to everyday devices began to develop and promote contextual inquiry and user research, for instance. While much of this work was done in partnership with universities (more Computer Science Departments than Schools of Design though), it was often led by industry."}, {"5039": "Industry-driven initiatives have resulted in very significant contributions to design research. Consider personas, developed by Alan Cooper and later appropriated by Microsoft — perhaps the most widely used design-specific research technique. Should not design research be led by the discipline of design? What academic design research initiatives have managed to successfully alter the processes and outcomes of their industry partners?"}, {"cb5d": "There is perhaps nothing per se wrong with industry-led design research. Speculative Design is an interesting example. Many projects in this tradition are industry-sponsored rather than funded as formal research — think of Microsoft’s extensive resourcing of the field of ‘ludic design.’ What does it mean that even speculative design research projects are industry-led?"}, {"4593": "One danger may lie with current industry trends. Digital devices afford rapid, field-released modifications. Tech companies searching for exponentially scalable value are incorporating design thinking into processes of rapid iteration. Design research in industry at the moment is predominantly a series of data-analytic-based sprints. This accelerated empiricism constrains design research’s capacity for long-term forethought and criticality. How can academic design researchers gain agency in the face of the wealth and speed of the tech industry?"}], "content": "DRS2016 Debates Briefing Following is a rationale and briefing for the three Debates (in place of Keynote Addresses) at the Design Research Society Conference at the University of Brighton in late June, 2016. Our societies seem to be losing their capacity for debate, for arguing civilly through positions and then concluding with a decided upon course of action. Politics for instance appears to be devolving into attacks — even physical — from incommensurable bubbles rather than negotiation. Since Horst Rittel at least, the practice of design has realized that it is unavoidably an act of argumentation, about which preferred futures and how to realize them. The discipline of design has responded with a range of more or less successful initiatives: the Design Methods movement; dialogue mapping; design thinking; participatory design and co-design., for instance. The establishment of Design Research as a field has itself been the result of contested debates around Doctoral Design Education and Practice-based Design Research. However, these debates have not always been as productive as perhaps necessary: the discipline could and probably should be more functional than the PhD-Design List for example sometimes evidences. On this occasion of 50 years of the Design Research Society, we ask, what role can Conferences play in re-establishing processes for Debating Design and Designed Debate? Conferences are occasions at which a discipline shares research. That act of sharing is an opportunity to learn about new knowledge created by research in the discipline. But it is also, before that, a moment in the process of knowledge creation. Though research at a conference should have been reviewed by peers who funded the research and then by peers on the conference’s Scientific Committee, the presentation of the research to a wider group of peers offers a further moment of validation. In this way, conferences not only share new knowledge, but arbitrate further about what constitutes new knowledge in the discipline. This task overlaps with the other rationale for conferences: an opportunity for representatives of a discipline to make decisions about the state of the discipline. Conferences with these agenda often involve formal congresses that pass resolutions and even issue media statements. Two practices of conferences have tended to undermine these decision-making potentials. The one is the keynote address. This kind of presentation, both because of its individualistic format, and because of the hierarchy it reinforces, is not conducive to collective decision-making, even if the presentation proves to be thought-provoking or exemplary. The other more significant but less acknowledged practice is pluralism. The role conferences play in academic economies has tended to mean that themes are only loosely observed so that any kind of design research can find a way to be included. This openness limits the capacity of conferences to be venues for making determinations about a discipline’s findings and priorities. The Design Research Society Conference at Umea in 2014 innovated a series of Debates in place of Keynote Addresses. The DRS Conference at Brighton will further this precedent. The aim is to experiment with moments in the Conference that recover collective decision-making with respect to the discipline of design. These negotiations will not have any legal force but instead will prototype what it might be like for a large conference on design to try explicitly to design the future of design research. The Debates will therefore be structured around resolutions that invited representatives will put forward. The Conference Chairs have curated three topics for these invited resolutions: (Speculative) Futures in Design Research, (Sustainable) Design Research for Change, Design Research in (the Tech) Industry. To break with a too dyadic version of argumentation, each Debate will involve 3 participants, speaking for and against 3 distinct propositions. The following briefing papers are informing the resolutions that the invited Debaters will propose at the conference. (Speculative) Futures in Design Research Design realizes preferred futures. The process for getting to the nature of preferred supposedly involves balancing a) the radical and the feasible (what Raymond Loewy called the Most Advanced yet Acceptable) b) the long-term and the short-term c) the particularities of some and what suits most (since design is the art and/or science of mass production for mass consumption) The centrality of futures and futuring to design suggests that core skills taught to research-based designers is: i) foresighting ii) scenario planning iii) backcasting Despite Futures being a moderately substantial discipline and practice, few Design Schools seem to explicitly teach its principles and techniques (though titling degree programs Design Futures seems currently in vogue). Some of this reticence is perhaps a reaction to the deterministic futuring that structured much of modernist designing. Strong visions of futures were imposed on society in Procrustean ways and current societies must deal with their consequent unsustainability. As a result however, there is the risk of design tending toward the timid. Bold visions are supplanted by what must be evidence-based, or collaboratively consensual, or iteratively emergent. What remains of design visioning are ‘speculations.’ These tend to privilege ambiguity, with a bias toward the photogenically dystopian. They often reinforce technology-driven change rather than social change. When it comes to the future, the designer’s only responsibility appears to be to provoke thought, not argue for what should be preferred. Without robust approaches to futuring, designing seems easily dominated by technological solutions in search of problems, or worse, more or less random A/B tests in search of monetizable scale. Design Researchers needs to reassert the role of Design Research in Futuring and Futuring in Design Research. (Sustainable) Design Research for Change Design is the expert practice of change-making. Research in support of design therefore tends to be oriented toward change; change in the how designing happens in the case of Research of Design; or change as the outcome of designing in the case of Research for Design. This applied nature of design research is often disconcerting to scholars of other disciplines working with design researchers. This is especially so when designers undertake their research by making changes to a situation rather than prior to intervening. Being change-oriented places a burden on design research that can be at odds with the creativity of designing. As with many professional practices, there are pressures for design to do more to become more evidence-based. But can creative leaps toward preferable futures ever be evidential? The practice of designing has bolstered the reliability of its nevertheless abductive and situated nature in two ways: methods and precedents or patterns. Both are attempts to extrapolate from the particulars of a design challenge ways of designing or design forms that could be used in other different contexts. These strategies however do depend on designers being diligent about extracting methods and patterns from jobs, sharing those findings with other designers, and then taking the time when next designing to find and try shared methods and patterns. Have designers a good track record in learning from design research in this way? The case study of Sustainable Design suggests ‘no.’ The demand for designers to take responsibility for enhancing the sustainability of our societies has been voiced powerfully since at least the time of Victor Papanek. Dilemmas like paper or plastic prompted research, and those Life Cycle Assessments often indicated that what was most ‘eco-friendly’ was counter-intuitive. Sustainable design has therefore always been a strongly research-led process — perhaps to a fault: many ecodesign tools failed to achieve take-up because their research-heavy processes failed to interface well with design practice. Given how research-driven sustainable design has been, we could perhaps have expected significant improvements in the ecological performance of designed products, environments and services. Since the overwhelming majority of designs remain ecologically harmful in significant ways, why has sustainable design research not been effective? No doubt the large-scale forces of unsustainability — global capital selling a particular consumerist version of well-being — are difficult to combat with research-based design. However, have sustainable design researchers been as coordinated and determined as such an enemy warrants? Certainly, Tony Fry, for example, has made a strong case for a much more concerted version of sustainable design. Quite the reverse, sustainable design projects frequently seem repetitious (e.g., how many guides to eco-friendly paper stock for graphic designers?), and frequently ignorant of prior research (e.g., how many unfeasible power generating gyms or playgrounds?). Sustainability in student projects often seems to be an off-the-shelf politics excusing poor quality research. The problem here might not be limited to design. Much sustainability research now appears misdirected, failing to bridge knowledge-action gaps, or, when they do, failing to account for later rebound effects. How could design research be adequate to the massive challenge of enhancing societal sustainability? What could other social-change-enabling practices of design, like design for social innovation, learn from the inadequacies of sustainable design research. Design Research in (the Tech) Industry In many ways, the modern practice of design began in educational institutions — e.g., the Bauhaus — as an attempt to bring the ambitions for social change of modernist art to the power and scale of industry. In North America, the Streamliners proved more successful at this act of translation, both in terms of the scale of households their products reached, and in terms of the extent to which their wider narratives about technological progress were adopted. The story is similar with respect to academic design research. At the same moment that Design Schools were incorporated into university systems and so began to develop formal research activity and doctoral programs, the industries responsible for bringing computation to everyday devices began to develop and promote contextual inquiry and user research, for instance. While much of this work was done in partnership with universities (more Computer Science Departments than Schools of Design though), it was often led by industry. Industry-driven initiatives have resulted in very significant contributions to design research. Consider personas, developed by Alan Cooper and later appropriated by Microsoft — perhaps the most widely used design-specific research technique. Should not design research be led by the discipline of design? What academic design research initiatives have managed to successfully alter the processes and outcomes of their industry partners? There is perhaps nothing per se wrong with industry-led design research. Speculative Design is an interesting example. Many projects in this tradition are industry-sponsored rather than funded as formal research — think of Microsoft’s extensive resourcing of the field of ‘ludic design.’ What does it mean that even speculative design research projects are industry-led? One danger may lie with current industry trends. Digital devices afford rapid, field-released modifications. Tech companies searching for exponentially scalable value are incorporating design thinking into processes of rapid iteration. Design research in industry at the moment is predominantly a series of data-analytic-based sprints. This accelerated empiricism constrains design research’s capacity for long-term forethought and criticality. How can academic design researchers gain agency in the face of the wealth and speed of the tech industry? ", "child": "2167_1"}