{"name": "2169", "parent": "", "title": "The “Job” to be done is never what you think.", "sentences": [{"4895": "The “Job” to be done is never what you think."}, {"2d3d": "There’s a story about a Hungarian mathematician during World War II named Abraham Wald. He had a profound impact on how warplanes were built and repaired, but not in the way you may think."}, {"d6cf": "Essentially, the US Navy was looking into how to better armor and equip their fighter planes. They would look at the planes that returned from battle and observe where the most damage had been done. The fuselage, the tail, the wings — wherever it was, it was noted and recorded."}, {"da49": "The hypothesis was: if these areas are where planes were being damaged the most, that is where the weight-increasing, fuel-inefficient armor should be beefed up. Increasing armor has a big price tag — you want minimal viable armoring."}, {"7085": "The Navy exclaimed, “If the rear fuselage is getting shot to swiss-cheese, clearly we need to make that area tougher!”"}, {"9df1": "Wrong."}, {"0ac9": "Wald, the statistician and mathematician that he was, had a different idea. If planes were returning with damage to certain areas, it meant that these areas weren’t critical. It was evidence of survivable damage."}, {"0bb4": "His hypothesis was: the undamaged areas of planes is where armor should be increased because planes damaged in those areas were shot down and never made it back."}, {"6a48": "And he was right. This concept was proven out and helped protect and improve the planes armoring throughout the war. This is one of those times that it’s not an apocryphal story like the Henry Ford lie. The effects and statistical probabilities are documented!"}, {"e0f9": "There’s a much deeper meaning to this story: The Navy was focused on a lower order “Job” of improving plane’s survivability in hopes of solving the problem of losing pilots. Wald was focused on the higher order “Job to be done” — preventing loss of lives so the goal of winning a war could be attained, and he was going to solve that downstream by increasing the plane’s survivability."}, {"b016": "It’s a different way of approaching the same goal, but focusing on the higher order “Job” allows for broader thinking and looking for different possible solutions instead of locking in on just the obvious downstream problem."}, {"f013": "What is Jobs To Be Done?"}, {"3654": "Jobs To Be Done (JTBD) is the world’s simplest idea; there is almost nothing new about it."}, {"0b80": "Essentially, JTBD is a way of looking at a downstream problem from the original human root need, and letting that need be the motivation behind the many ways you could solve the problem."}, {"9a2a": "Here’s an example: If someone buys a hammer at the hardware store, they are not buying it to hammer nails into their wall, they are buying it to hang memories and make their home feel like a home."}, {"36a7": "Looking at this from a JTBD perspective, us as the people who make the hammers can take a step back and look at if a hammer and nail is the way we want to service that goal; the goal isn’t to own a hammer, it’s to warm up the living room."}, {"4d98": "There are a lot of other great resources that help break down JTBD and the framework around using this in your design problems, like this article about writing features using job stories, or this one about big JTBD misconceptions."}, {"7fb7": "Here’s a story about JTBD from my own real-world work."}, {"66d5": "A guerrilla dive into QuickBooks Self-Employed"}, {"9c5d": "I recently took a guerrilla research dive into some of the services that the QuickBooks Self-Employed service offers through its web and mobile app."}, {"8d80": "I wanted to approach this rapid empathy study with the JTBD mindset that people hire us to serve them in some way to accomplish a life need, and gain insight into what that Job was. I wanted to peer into what they were originally trying to do in their lives that led them to us."}, {"0416": "What we offered through this product/service was mileage tracking, categorizing expenses as business or personal, estimating taxes, sending invoices, and a basic overview of your self-employed financial picture. Essential and simple stuff."}, {"3ef6": "I pulled some data, reached out to some local users and met them face to face. It was empathy time. No surveys, no studies, no remote testing sessions. No testing at all! We were getting human."}, {"4c5e": "Well, after talking to these wonderful humans, suffice it to say, here’s a simple list of things they weren’t trying to do:"}, {"23c6": "WHAT? But wait! That’s what our product does! If they aren’t trying to do that, what exactly is it that we’re offering them??"}, {"0096": "The truth is, that our customers wanted a “Job” to be done at a deeper level that created a disconnect between the “offerings” of our service, and the true needs the customers were trying to fulfill. The list is the “how and what” of how we’re addressing needs."}, {"969b": "These true needs manifested as abstract goals that serve a greater purpose to their well-being or livelihood. Here’s the true list of “Jobs” and needs to serve for our customers:"}, {"532e": "That is what they need. These true needs are where we can better act in service to our customers through the features in the offering. This is classic JTBD. The better we articulate the customer’s true “Jobs” and stay close to that list, the stronger the relationship we form with the customers we exist to serve."}, {"52f8": "It’s funny how much that second list looks like value propositions and marketing-speak. Is the “Job” just marketing shorthand?"}, {"5ddb": "No."}, {"3ae8": "When you’re phrasing and seeking out the JTBD as the need you want to serve, it can sound a lot like marketing. A lot. It has that ad agency shrink-wrapped feel to it. You’re appealing to the hopes and dreams of a person’s life and what they’re trying to accomplish. Selling floor cleaner as a way to a better quality of life, or photo projectors as a way to connect with your family."}, {"46e4": "Or the Simon Sinek example of the TiVo and the “Job” it could have tried to fulfill:"}, {"2e16": "“If you’re the kind of person who likes to have total control over every aspect of your life, boy, do we have a product for you. It pauses live TV, skips commercials, memorizes your viewing habits, etc., etc.”"}, {"7954": "It can feel like the “Job” is the top of the funnel. It can mirror it and emulate it, but marketing itself doesn’t offer the value. It surfaces it. And if you start with the surface, you get surface-level messaging. No depth, no meaning."}, {"fd7f": "Why should anyone believe in what you do when on the inside, you can’t even articulate the purpose you serve?"}, {"0ed9": "JTBD in Service Design"}, {"4238": "If we’re taking a service design lens, that “Job” has to be the deeper purpose we’re trying to perform or provide service to. You market the outcome that you deliver to the customer, based on the JTBD."}, {"7126": "The fact is, you can’t create a meaningful marketing language if you don’t already know the core human need you’re serving. Be it an app, a soap, a drill, a delivery, a hammer, a massage, a haircut — all of these serve a core “Job,” and it’s never the actual thing or act."}, {"aaae": "Losing focus of human needs, and neglecting to articulate how you serve them, is a surefire way to lose footing and let down not only your customers, but yourselves."}, {"6c91": "You can come up with good, even great, marketing language, but if you can’t tie it back to the “Job” that you can articulate as an organization on a mission to serve a need, it’s going to catch up to you. And when it does, the results are never good."}, {"acae": "“Listen, and understand! That Terminator is out there! It can’t be bargained with. It can’t be reasoned with. It doesn’t feel pity, or remorse, or fear. And it absolutely will not stop… ever, until you are dead!”"}, {"e274": "They failed to innovate."}, {"34e6": "More than one way to serve"}, {"3f48": "The beauty in all of this is that focusing on the human need gives you a much broader range of way you can serve while still staying in your business domain."}, {"9c23": "Kodak was once in the film and camera industry. What was the need they were fulfilling? The human need for film to run through their cameras? They tried to attach themselves to the humanity of the camera; the story of the Carousel has become a modern pop-culture reference. And it might have worked. Take a second to read the copy in this ad. What “Job” is it attempting to fulfill? My need for feature stats?"}, {"c9a9": "Then the 90’s hit. They chose to stick to their well-developed film and camera industry instead of moving into the space where the real human need was; moving past the idea of point-and-shoot and into the memory industry. The technology was there–Kodak even helped invent a lot of digital camera tech–but they just didn’t connect the dots."}, {"bf9a": "How many lives, memories, moment are now captured on a phone? Who moved into the memory and moment industry? Computer-turned-phone companies, not camera companies. Even chat app sunglass companies are a thing now."}, {"d5ad": "The point is: give me my moments, my memories. Innovate on serving that “Job”, don’t just innovate on what you already have available."}, {"3173": "So, what’s the “Job” in this story? There’s no value in product or service until later, when I look at the picture and feel something. That’s the only place value is created and the need fulfilled. The ability to take the picture isn’t even the need or “Job,” the need occurs hours, weeks, days, years, decades later. That “Job?”"}, {"0023": "Well…"}, {"89f0": "Maybe it’s to capture the stillness of a moment never to be repeated. To remind you that everything changes and in time, the memory and picture of that moment is all you have left of it."}, {"dbd3": "Like this:"}, {"e60c": "Innovate on principle"}, {"6edb": "It’s a struggle and constant tension between how much to look forward towards iterative innovation, and how much to look backwards to root cause and origination."}, {"2871": "Looking backwards is usually seen as something to be avoided. “Only look backwards if that’s the direction you’re planning on heading.” Maybe backwards isn’t the right word; upstream might be more appropriate."}, {"e0dd": "Where upstream does the human need come from? What is the original watershed that led to that moment when a whole collection of human life needs and collision of circumstances become a “Job”. That’s the need that is inviting us to provide or perform some service."}, {"faab": "We exist to serve needs. Period. There is no debate to be had. There is no alternative, whether we can admit it, or at least recognize it. Every business is acting in service to some “Job”, whether you call it that or not. The closer you can get to how you’re serving, the better you’ll be able to do so, and in more ways than you think."}, {"d32b": "These are principles you can adhere to. When you build principles around the customer’s human need, you have so much more freedom to tweak, turn, pivot, or re-innovate because you’re not married to what you build; you’ve fallen in love with the human’s problem, not your business solution."}, {"c86f": "And when you love the human need, what we call the “Job”, there are so many places you can look to help serve them and make their lives better through how you provide and perform in service to them."}, {"db29": "You can take from all that is around you and your customers and make with it something more."}, {"3a84": "You should give this article a 💚 , follow me on Medium, and on Twitter!"}, {"1c6b": "Continue the conversation, and join the global Service Design Community of Practice in Slack at www.practicalservicedesign.com/community"}], "content": "The “Job” to be done is never what you think. There’s a story about a Hungarian mathematician during World War II named Abraham Wald. He had a profound impact on how warplanes were built and repaired, but not in the way you may think. Essentially, the US Navy was looking into how to better armor and equip their fighter planes. They would look at the planes that returned from battle and observe where the most damage had been done. The fuselage, the tail, the wings — wherever it was, it was noted and recorded. The hypothesis was: if these areas are where planes were being damaged the most, that is where the weight-increasing, fuel-inefficient armor should be beefed up. Increasing armor has a big price tag — you want minimal viable armoring. The Navy exclaimed, “If the rear fuselage is getting shot to swiss-cheese, clearly we need to make that area tougher!” Wrong. Wald, the statistician and mathematician that he was, had a different idea. If planes were returning with damage to certain areas, it meant that these areas weren’t critical. It was evidence of survivable damage. His hypothesis was: the undamaged areas of planes is where armor should be increased because planes damaged in those areas were shot down and never made it back. And he was right. This concept was proven out and helped protect and improve the planes armoring throughout the war. This is one of those times that it’s not an apocryphal story like the Henry Ford lie. The effects and statistical probabilities are documented! There’s a much deeper meaning to this story: The Navy was focused on a lower order “Job” of improving plane’s survivability in hopes of solving the problem of losing pilots. Wald was focused on the higher order “Job to be done” — preventing loss of lives so the goal of winning a war could be attained, and he was going to solve that downstream by increasing the plane’s survivability. It’s a different way of approaching the same goal, but focusing on the higher order “Job” allows for broader thinking and looking for different possible solutions instead of locking in on just the obvious downstream problem. What is Jobs To Be Done? Jobs To Be Done (JTBD) is the world’s simplest idea; there is almost nothing new about it. Essentially, JTBD is a way of looking at a downstream problem from the original human root need, and letting that need be the motivation behind the many ways you could solve the problem. Here’s an example: If someone buys a hammer at the hardware store, they are not buying it to hammer nails into their wall, they are buying it to hang memories and make their home feel like a home. Looking at this from a JTBD perspective, us as the people who make the hammers can take a step back and look at if a hammer and nail is the way we want to service that goal; the goal isn’t to own a hammer, it’s to warm up the living room. There are a lot of other great resources that help break down JTBD and the framework around using this in your design problems, like this article about writing features using job stories, or this one about big JTBD misconceptions. Here’s a story about JTBD from my own real-world work. A guerrilla dive into QuickBooks Self-Employed I recently took a guerrilla research dive into some of the services that the QuickBooks Self-Employed service offers through its web and mobile app. I wanted to approach this rapid empathy study with the JTBD mindset that people hire us to serve them in some way to accomplish a life need, and gain insight into what that Job was. I wanted to peer into what they were originally trying to do in their lives that led them to us. What we offered through this product/service was mileage tracking, categorizing expenses as business or personal, estimating taxes, sending invoices, and a basic overview of your self-employed financial picture. Essential and simple stuff. I pulled some data, reached out to some local users and met them face to face. It was empathy time. No surveys, no studies, no remote testing sessions. No testing at all! We were getting human. Well, after talking to these wonderful humans, suffice it to say, here’s a simple list of things they weren’t trying to do: WHAT? But wait! That’s what our product does! If they aren’t trying to do that, what exactly is it that we’re offering them?? The truth is, that our customers wanted a “Job” to be done at a deeper level that created a disconnect between the “offerings” of our service, and the true needs the customers were trying to fulfill. The list is the “how and what” of how we’re addressing needs. These true needs manifested as abstract goals that serve a greater purpose to their well-being or livelihood. Here’s the true list of “Jobs” and needs to serve for our customers: That is what they need. These true needs are where we can better act in service to our customers through the features in the offering. This is classic JTBD. The better we articulate the customer’s true “Jobs” and stay close to that list, the stronger the relationship we form with the customers we exist to serve. It’s funny how much that second list looks like value propositions and marketing-speak. Is the “Job” just marketing shorthand? No. When you’re phrasing and seeking out the JTBD as the need you want to serve, it can sound a lot like marketing. A lot. It has that ad agency shrink-wrapped feel to it. You’re appealing to the hopes and dreams of a person’s life and what they’re trying to accomplish. Selling floor cleaner as a way to a better quality of life, or photo projectors as a way to connect with your family. Or the Simon Sinek example of the TiVo and the “Job” it could have tried to fulfill: “If you’re the kind of person who likes to have total control over every aspect of your life, boy, do we have a product for you. It pauses live TV, skips commercials, memorizes your viewing habits, etc., etc.” It can feel like the “Job” is the top of the funnel. It can mirror it and emulate it, but marketing itself doesn’t offer the value. It surfaces it. And if you start with the surface, you get surface-level messaging. No depth, no meaning. Why should anyone believe in what you do when on the inside, you can’t even articulate the purpose you serve? JTBD in Service Design If we’re taking a service design lens, that “Job” has to be the deeper purpose we’re trying to perform or provide service to. You market the outcome that you deliver to the customer, based on the JTBD. The fact is, you can’t create a meaningful marketing language if you don’t already know the core human need you’re serving. Be it an app, a soap, a drill, a delivery, a hammer, a massage, a haircut — all of these serve a core “Job,” and it’s never the actual thing or act. Losing focus of human needs, and neglecting to articulate how you serve them, is a surefire way to lose footing and let down not only your customers, but yourselves. You can come up with good, even great, marketing language, but if you can’t tie it back to the “Job” that you can articulate as an organization on a mission to serve a need, it’s going to catch up to you. And when it does, the results are never good. “Listen, and understand! That Terminator is out there! It can’t be bargained with. It can’t be reasoned with. It doesn’t feel pity, or remorse, or fear. And it absolutely will not stop… ever, until you are dead!” They failed to innovate. More than one way to serve The beauty in all of this is that focusing on the human need gives you a much broader range of way you can serve while still staying in your business domain. Kodak was once in the film and camera industry. What was the need they were fulfilling? The human need for film to run through their cameras? They tried to attach themselves to the humanity of the camera; the story of the Carousel has become a modern pop-culture reference. And it might have worked. Take a second to read the copy in this ad. What “Job” is it attempting to fulfill? My need for feature stats? Then the 90’s hit. They chose to stick to their well-developed film and camera industry instead of moving into the space where the real human need was; moving past the idea of point-and-shoot and into the memory industry. The technology was there–Kodak even helped invent a lot of digital camera tech–but they just didn’t connect the dots. How many lives, memories, moment are now captured on a phone? Who moved into the memory and moment industry? Computer-turned-phone companies, not camera companies. Even chat app sunglass companies are a thing now. The point is: give me my moments, my memories. Innovate on serving that “Job”, don’t just innovate on what you already have available. So, what’s the “Job” in this story? There’s no value in product or service until later, when I look at the picture and feel something. That’s the only place value is created and the need fulfilled. The ability to take the picture isn’t even the need or “Job,” the need occurs hours, weeks, days, years, decades later. That “Job?” Well… Maybe it’s to capture the stillness of a moment never to be repeated. To remind you that everything changes and in time, the memory and picture of that moment is all you have left of it. Like this: Innovate on principle It’s a struggle and constant tension between how much to look forward towards iterative innovation, and how much to look backwards to root cause and origination. Looking backwards is usually seen as something to be avoided. “Only look backwards if that’s the direction you’re planning on heading.” Maybe backwards isn’t the right word; upstream might be more appropriate. Where upstream does the human need come from? What is the original watershed that led to that moment when a whole collection of human life needs and collision of circumstances become a “Job”. That’s the need that is inviting us to provide or perform some service. We exist to serve needs. Period. There is no debate to be had. There is no alternative, whether we can admit it, or at least recognize it. Every business is acting in service to some “Job”, whether you call it that or not. The closer you can get to how you’re serving, the better you’ll be able to do so, and in more ways than you think. These are principles you can adhere to. When you build principles around the customer’s human need, you have so much more freedom to tweak, turn, pivot, or re-innovate because you’re not married to what you build; you’ve fallen in love with the human’s problem, not your business solution. And when you love the human need, what we call the “Job”, there are so many places you can look to help serve them and make their lives better through how you provide and perform in service to them. You can take from all that is around you and your customers and make with it something more. You should give this article a 💚 , follow me on Medium, and on Twitter! Continue the conversation, and join the global Service Design Community of Practice in Slack at www.practicalservicedesign.com/community ", "child": "2169_1\t2169_2\t2169_3\t2169_4\t2169_5\t2169_6\t2169_7\t2169_8\t2169_92169_1\t2169_2\t2169_3\t2169_4\t2169_5\t2169_6\t2169_7\t2169_8\t2169_9"}