{"name": "2171", "parent": "", "title": "The Message Gets the Medium it Deserves", "sentences": [{"1307": "I’ve been building things in the digital world since I was a child, before the world wide web was a thing. Back then the medium of connectivity was a black screen, ASCII characters making up UI, and games that relied on textual descriptions over pictures. I loved it, and for some reason I instantly gravitated towards building things."}, {"3bd5": "It’s taken a long time to realize that I wasn’t only building, but facilitating. I was both creating something new, and reducing the noise that my creation had to live in."}, {"f8c1": "The Mediums"}, {"ffd0": "Marhsall MacLuhan was a communication theorist from the mid 20th century, know for popularizing his term “the medium is the message.” He lived from 1911 to 1990, seeing virtually the entire evolution of pre-internet electronic media. Unfortunately, he wasn’t around to see the emergence of the World Wide Web and how it allowed computer to conquer nearly all forms all media."}, {"0297": "The Internet, and software, has far exceeded any reach that television or radio had in the 20th century. It is now a universal medium that consumes almost all the rest. Video, audio, literature, art, news — it all is able to come across the wire and be presented through the screen. What we create now exists in a new medium, a ubiquitous digital medium. This medium is far more powerful than any message we could deliver. The medium is the message."}, {"7e9c": "When delivering a specific experience, there is an ever-present storm of information that surrounds it. That is a primary challenge I think I face as a creator in a digital space. My goal is to reduce the unnecessary noise as much as I can. It’s a nested problem — the messages exist in an overwhelming medium, and the experience and interaction exists inside the message itself. A coupled task of getting someone’s attention, and then keeping someone’s attention. It’s two different sets of behavior."}, {"0fbe": "I see this as a core principle of higher order UX; to use the medium in such a way that the medium facilitates the delivery of the message instead of polluting it. It’ that pollution that brings about unanticipated consequences in what the user experiences. This is just as much a holistic experience problem as well as a nitty-gritty design and interaction problem."}, {"da79": "Identifying Patterns"}, {"3756": "“When you give people too much information, they instantly resort to pattern recognition, in other words, to structure the experience.” — Marshall MacLuhan"}, {"4775": "If the medium is too overpowering, it consumes the user’s attention and obscures the message. The user resorts to looking for patterns and make inferences that we are probably not attempting to project. To fulfill the instinctual need to make sense of what is being presented, the user has to essentially “structure their own experience.” Learning bad patterns is how the user accommodates the noise. It’s the foundation that bad experiences are made on. The medium and the message are inseparable — the medium becomes the message."}, {"d9d6": "I am starting to realize that more and more, the patterns begin with the very first exposure a user has with a touchpoint. Right from hearing about the product or service (or anything), a message is being presented. It could be how it’s described by a friend, something they read in an article, a piece of marketing, virtually anything. The medium can’t be stopped; we can only hope to mitigate it."}, {"780a": "Focusing on reducing the noise with the product, and especially UI, is insufficient. The world has moved beyond just delivering the base experience; that’s just table stakes. Users demand and expect something better, and they should."}, {"8c3a": "Creating patterns from the start is how I see UX impacting the message. It’s the design of how all the experience touchpoints impact a person. Message design."}, {"3df3": "The Role of Artists"}, {"f090": "MacLuhan had an extreme prediction on the role of artists. I see that as sort of the role UX designers play as a part of stewarding a vision. Here is MacLuhan on the role of the artist in recognizing the patterns and the plight of the scientist:"}, {"ceea": "“I think this is part of the artist’s world. The artist, when he encounters the present… is always seeking new patterns, new pattern recognition, which is his task. The absolute indispensability of the artist is that he alone in the present can give the pattern recognition. He alone has the sensory awareness necessary to tell us what our world is made of. He is more important than the scientist. The scientists are going to wake up to this shortly and will resort en mass to the artist’s studio in order to discover the forms and the matter they are dealing with.”"}, {"b8d9": "It’s a bold statement. I think that there’s an element of truth in that “design” is stepping out of the simple world of delivering end-result interfaces and into identifying those patterns in the medium and designing ways to accentuate or diminish their impact on the message; a message that will perpetually be contained, constrained and inseparable from the medium."}, {"cde5": "Reducing The Noise"}, {"4940": "It’s a way of looking at UX that is still an evolving perspective. I am no Marshall MacLuhan, and certainly just a novice in communication theory (and cybernetics). It’s something that continually fascinates me how, decades before things went digital, these theorists essentially defined what would become the higher-order UX we know today."}, {"3226": "So much focus is put in presenting the right thing at the right time in the right place, the inverse action of reducing the wrong things can go unnoticed. But as I write this, I am thinking back to the projects that have been the most fun and successful, and they all have a huge aspect of taking the medium we’re trying to work in and designing ways to reduce that noise, before even working on what exactly we’re going to try and place inside of it. It is the tireless job of excavating and clearing away all the junk and pollution that blocks the way. Once we’ve done that the best we can, we now have somewhere that the experiences we’re designing for can flourish."}, {"be0c": "The message gets the medium it deserves. Our job is to reduce noise as much as it is to build delight. This is what UX is becoming. It’s not a design skill, it’s communication theory."}, {"4562": "Watch a 3 part video of Marhsall MacLuhan talk about the Medium is the Message. Part 1 / Part 2 / Part 3"}, {"b1b2": "Originally published at www.helloerik.com June 19, 2013."}], "content": "I’ve been building things in the digital world since I was a child, before the world wide web was a thing. Back then the medium of connectivity was a black screen, ASCII characters making up UI, and games that relied on textual descriptions over pictures. I loved it, and for some reason I instantly gravitated towards building things. It’s taken a long time to realize that I wasn’t only building, but facilitating. I was both creating something new, and reducing the noise that my creation had to live in. The Mediums Marhsall MacLuhan was a communication theorist from the mid 20th century, know for popularizing his term “the medium is the message.” He lived from 1911 to 1990, seeing virtually the entire evolution of pre-internet electronic media. Unfortunately, he wasn’t around to see the emergence of the World Wide Web and how it allowed computer to conquer nearly all forms all media. The Internet, and software, has far exceeded any reach that television or radio had in the 20th century. It is now a universal medium that consumes almost all the rest. Video, audio, literature, art, news — it all is able to come across the wire and be presented through the screen. What we create now exists in a new medium, a ubiquitous digital medium. This medium is far more powerful than any message we could deliver. The medium is the message. When delivering a specific experience, there is an ever-present storm of information that surrounds it. That is a primary challenge I think I face as a creator in a digital space. My goal is to reduce the unnecessary noise as much as I can. It’s a nested problem — the messages exist in an overwhelming medium, and the experience and interaction exists inside the message itself. A coupled task of getting someone’s attention, and then keeping someone’s attention. It’s two different sets of behavior. I see this as a core principle of higher order UX; to use the medium in such a way that the medium facilitates the delivery of the message instead of polluting it. It’ that pollution that brings about unanticipated consequences in what the user experiences. This is just as much a holistic experience problem as well as a nitty-gritty design and interaction problem. Identifying Patterns “When you give people too much information, they instantly resort to pattern recognition, in other words, to structure the experience.” — Marshall MacLuhan If the medium is too overpowering, it consumes the user’s attention and obscures the message. The user resorts to looking for patterns and make inferences that we are probably not attempting to project. To fulfill the instinctual need to make sense of what is being presented, the user has to essentially “structure their own experience.” Learning bad patterns is how the user accommodates the noise. It’s the foundation that bad experiences are made on. The medium and the message are inseparable — the medium becomes the message. I am starting to realize that more and more, the patterns begin with the very first exposure a user has with a touchpoint. Right from hearing about the product or service (or anything), a message is being presented. It could be how it’s described by a friend, something they read in an article, a piece of marketing, virtually anything. The medium can’t be stopped; we can only hope to mitigate it. Focusing on reducing the noise with the product, and especially UI, is insufficient. The world has moved beyond just delivering the base experience; that’s just table stakes. Users demand and expect something better, and they should. Creating patterns from the start is how I see UX impacting the message. It’s the design of how all the experience touchpoints impact a person. Message design. The Role of Artists MacLuhan had an extreme prediction on the role of artists. I see that as sort of the role UX designers play as a part of stewarding a vision. Here is MacLuhan on the role of the artist in recognizing the patterns and the plight of the scientist: “I think this is part of the artist’s world. The artist, when he encounters the present… is always seeking new patterns, new pattern recognition, which is his task. The absolute indispensability of the artist is that he alone in the present can give the pattern recognition. He alone has the sensory awareness necessary to tell us what our world is made of. He is more important than the scientist. The scientists are going to wake up to this shortly and will resort en mass to the artist’s studio in order to discover the forms and the matter they are dealing with.” It’s a bold statement. I think that there’s an element of truth in that “design” is stepping out of the simple world of delivering end-result interfaces and into identifying those patterns in the medium and designing ways to accentuate or diminish their impact on the message; a message that will perpetually be contained, constrained and inseparable from the medium. Reducing The Noise It’s a way of looking at UX that is still an evolving perspective. I am no Marshall MacLuhan, and certainly just a novice in communication theory (and cybernetics). It’s something that continually fascinates me how, decades before things went digital, these theorists essentially defined what would become the higher-order UX we know today. So much focus is put in presenting the right thing at the right time in the right place, the inverse action of reducing the wrong things can go unnoticed. But as I write this, I am thinking back to the projects that have been the most fun and successful, and they all have a huge aspect of taking the medium we’re trying to work in and designing ways to reduce that noise, before even working on what exactly we’re going to try and place inside of it. It is the tireless job of excavating and clearing away all the junk and pollution that blocks the way. Once we’ve done that the best we can, we now have somewhere that the experiences we’re designing for can flourish. The message gets the medium it deserves. Our job is to reduce noise as much as it is to build delight. This is what UX is becoming. It’s not a design skill, it’s communication theory. Watch a 3 part video of Marhsall MacLuhan talk about the Medium is the Message. Part 1 / Part 2 / Part 3 Originally published at www.helloerik.com June 19, 2013. ", "child": "2171_1\t2171_2\t2171_3\t2171_4\t2171_5\t2171_6\t2171_7\t2171_82171_1\t2171_2\t2171_3\t2171_4\t2171_5\t2171_6\t2171_7\t2171_8"}