{"name": "2173", "parent": "", "title": "Be The Experiment — Organizing the Design Thinking Conference (2)", "sentences": [{"2c33": "Be The Experiment — Organizing the Design Thinking Conference (2)"}, {"f038": "(This article is a follow up on my previous article “Through Different Eyes”)"}, {"78d4": "I’d like to give you a short update on the Design Thinking Conference. But first… what an amazing amount of cool people have responded to my first article about the Design Thinking Conference. I have received so many comments and emails by people telling me they are interested, want to participate and… and above all, really really dislike traditional conference too ;-)"}, {"198f": "Thank you for your support and positive feedback. Even though I haven’t been able to answer everyone yet, I do so much appreciate your positive energy. It’s something our world desperately need these days… at least it’s something I need."}, {"04a8": "So here’s what we’ve been doing."}, {"99cd": "We have found a fantastic location! The Conference will be held 26–27 October at the Tobacco Theatre Amsterdam… yes it’s s theatre."}, {"ed98": "And as you might remember, the conference is going to be heavily influenced by theatre. My design challenge was “The only difference between theatre and a conference is that conferences are always bad theatre, but theatre is never a conference… good or bad. What if a conference would be good theatre? “"}, {"41e0": "Besides the location we also have been approaching people to be part of our cast. We can confirm two new members:"}, {"eb9e": "> John Bielenberg"}, {"a65a": "John is going to help us “think wrong” (check out his new book). He is the founder of Future Partners based in Silicon Valley and has been such a source of inspiration to me over the year, especially with his work at Project M."}, {"6cfb": "> Guy van Liemt"}, {"5022": "Guy is the director at the Erasmus Happiness Economics Research Organisation (EHERO).“The mission of EHERO is to contribute to greater happiness for a greater number of people. EHERO is a multidisciplinary institution which include economics, sociology, psychology, philosophy, business and health care.”"}, {"d87d": "I am so happy to have them on our team. Their knowledge, stories and unique perspective are a perfect match to our theme “Through Different Eyes”. They have a deep understanding on how to build empathy and the importance of understanding that there are different realities. They also love to play games… so be prepared."}, {"953d": "(Between you an me, I’m trying to get convince Susan Schaller to join us. She’s the author of “A Man Without Words” You can watch the documentary based on her book on Vimeo…. Fingers crossed)"}, {"49a0": "I am also acutely aware that we should not have only man on our cast. In fact… and oddly enough this just came to me, the majority should be women, if only because this hardly ever (never?) happens."}, {"fe07": "Last but not least I would like to share a thought that will explain the title of this article… finally."}, {"67e9": "While we are organizing the conference I realized that we are trying to make sure we would meet or better exceed expectations. Which is logical. However, this also sometimes leads to making safe choices. And this kills serendipity, which is the opposite of what we are trying to do. Not only do we want to create a space for experimentation, we want to BE the experiment. In my mind this is the only way to discover and co-create something new. So please keep reminding me to break some rules ;-)"}, {"f16b": "We’ll be launching our website (www.designthinkingconference.com ASAP. But if you want to stay informed please send an email to info@designthinkingconference.com."}, {"e2df": "I’d love to hear from you!"}], "content": "Be The Experiment — Organizing the Design Thinking Conference (2) (This article is a follow up on my previous article “Through Different Eyes”) I’d like to give you a short update on the Design Thinking Conference. But first… what an amazing amount of cool people have responded to my first article about the Design Thinking Conference. I have received so many comments and emails by people telling me they are interested, want to participate and… and above all, really really dislike traditional conference too ;-) Thank you for your support and positive feedback. Even though I haven’t been able to answer everyone yet, I do so much appreciate your positive energy. It’s something our world desperately need these days… at least it’s something I need. So here’s what we’ve been doing. We have found a fantastic location! The Conference will be held 26–27 October at the Tobacco Theatre Amsterdam… yes it’s s theatre. And as you might remember, the conference is going to be heavily influenced by theatre. My design challenge was “The only difference between theatre and a conference is that conferences are always bad theatre, but theatre is never a conference… good or bad. What if a conference would be good theatre? “ Besides the location we also have been approaching people to be part of our cast. We can confirm two new members: > John Bielenberg John is going to help us “think wrong” (check out his new book). He is the founder of Future Partners based in Silicon Valley and has been such a source of inspiration to me over the year, especially with his work at Project M. > Guy van Liemt Guy is the director at the Erasmus Happiness Economics Research Organisation (EHERO).“The mission of EHERO is to contribute to greater happiness for a greater number of people. EHERO is a multidisciplinary institution which include economics, sociology, psychology, philosophy, business and health care.” I am so happy to have them on our team. Their knowledge, stories and unique perspective are a perfect match to our theme “Through Different Eyes”. They have a deep understanding on how to build empathy and the importance of understanding that there are different realities. They also love to play games… so be prepared. (Between you an me, I’m trying to get convince Susan Schaller to join us. She’s the author of “A Man Without Words” You can watch the documentary based on her book on Vimeo…. Fingers crossed) I am also acutely aware that we should not have only man on our cast. In fact… and oddly enough this just came to me, the majority should be women, if only because this hardly ever (never?) happens. Last but not least I would like to share a thought that will explain the title of this article… finally. While we are organizing the conference I realized that we are trying to make sure we would meet or better exceed expectations. Which is logical. However, this also sometimes leads to making safe choices. And this kills serendipity, which is the opposite of what we are trying to do. Not only do we want to create a space for experimentation, we want to BE the experiment. In my mind this is the only way to discover and co-create something new. So please keep reminding me to break some rules ;-) We’ll be launching our website (www.designthinkingconference.com ASAP. But if you want to stay informed please send an email to info@designthinkingconference.com. I’d love to hear from you! ", "child": "2173_1"}