{"name": "2175", "parent": "", "title": "Saying Hi, while saying Goodbye", "sentences": [{"f456": "Saying Hi, while saying Goodbye"}, {"81a3": "Today we (Janko Grassere and @Egid van Houtem) announce our new venture: Grasswoods — We create new markets and innovative products and services. Accelerate ideas with a human centered approach."}, {"47b4": "We are currently setting up shop and will be fully operational September 1st.We are very proud to get the news out to the world and excited tot start new projects with both familiar and new faces. Still this day also has something else for us to remember."}, {"7ec3": "Bud Spencer — Carlo Pedersoli *1929- +2016"}, {"8023": "A hero of youth died at the age of 86 today. The only guy that could beat Chuck Norris in a fistfight: Bud Spencer. Man of few but funny words, a major appetite and a lot of slapping people — for a good cause — with his big hands. We both enjoyed his numerous films in German when we we’re kids. Solving problems by slapping people is not what we will do at Grasswoods, still a no-nonsense approach and slapping with words can be your share if you decide to work with us."}, {"0827": "Visual likeness of the founders of Grasswoods is unintentional ;-)"}, {"eecb": "Are you curious about our new venture and the services we provide? Shoot us a mail and let’s have a coffee!"}], "content": "Saying Hi, while saying Goodbye Today we (Janko Grassere and @Egid van Houtem) announce our new venture: Grasswoods — We create new markets and innovative products and services. Accelerate ideas with a human centered approach. We are currently setting up shop and will be fully operational September 1st.We are very proud to get the news out to the world and excited tot start new projects with both familiar and new faces. Still this day also has something else for us to remember. Bud Spencer — Carlo Pedersoli *1929- +2016 A hero of youth died at the age of 86 today. The only guy that could beat Chuck Norris in a fistfight: Bud Spencer. Man of few but funny words, a major appetite and a lot of slapping people — for a good cause — with his big hands. We both enjoyed his numerous films in German when we we’re kids. Solving problems by slapping people is not what we will do at Grasswoods, still a no-nonsense approach and slapping with words can be your share if you decide to work with us. Visual likeness of the founders of Grasswoods is unintentional ;-) Are you curious about our new venture and the services we provide? Shoot us a mail and let’s have a coffee! ", "child": "2175_1"}