{"name": "2186", "parent": "", "title": "Is Facebook Trying to Kill LinkedIn Next?", "sentences": [{"3033": "Is Facebook Trying to Kill LinkedIn Next?"}, {"3561": "By Jay Baer"}, {"048f": "Jay: Hey guys it’s Jay, hope you are doing great."}, {"f53a": "Look, Facebook plays amazing defense, okay? Facebook strangled Twitter, right? Twitter said hey, we’re gonna try and succeed with live video. Facebook comes out with Facebook Live, here we are. Facebook is slowly strangling Snapchat which was interesting. I’m just back from the Social Media Marketing World conference last week. There were fewer Snapchat sessions than ever."}, {"4983": "Look, I’m not suggesting that Snapchat is gonna go away, I’m actually bullish on Snapchat’s future, but I think Snapchat’s chances to be a big, public social network that everybody uses are gone. Why? Because Facebook was threatened and stole all of their good features and put them into Instagram and now Facebook itself, and so that feature advantage that Snapchat had is simply gone. It’s just the way Facebook plays, right? That’s why they bought Instagram because they Instagram as a threat. That’s why they bought WhatsApp, because they thought WhatsApp was a threat. These guys play for keeps, and I think their next victim might be LinkedIn."}, {"c353": "Facebook, as you may know, is already starting to offer job listings. Now those job listings are mostly for small biz, mostly retail, those kind of things for now, but there is nothing to prevent Facebook from starting to offer white collar jobs and offer all the functionality that LinkedIn employs. There’s nothing particularly technically amazing about what LinkedIn does. They’ve got some nice ad targeting options and things like that, and there’s a lot of content there and a lot of institutionalized behavior of people using LinkedIn for that kind of purpose, but there’s nothing in LinkedIn’s arsenal that Facebook couldn’t copy. There’s certainly no sort of moat around the functionality. And so if LinkedIn continues to succeed, and I think LinkedIn’s doing a real good job lately with the new redesign and things like that, is Facebook going to let LinkedIn continue to have this kind of toe hold in the business market?"}, {"11ca": "Now let’s recognize that according to Tom Webster at Edison Research, 67 percent of Americans ages 12 and older have used Facebook. 22 percent of Americans have used LinkedIn ever, and we talk about Twitter’s slowing growth. LinkedIn has grown three percent over four years, right? So LinkedIn’s audience is essentially LinkedIn’s audience, where of course Facebook’s continues to rise. And so to me, it seems like Facebook’s next natural enemy is in fact LinkedIn."}, {"39f0": "Now the only thing that might prevent this from happening is the fact that Microsoft owns 1.3 percent of Facebook. Now that’s a sizable chunk, but that’s not so sizable I think that they couldn’t do something about that if they wanted to. It will be very very interesting to see how this goes."}, {"87a9": "So two questions for you. One, will Facebook train its considerable guns and ammunition on LinkedIn next? And two, if it was available, would you use Facebook for the kind of things that you use LinkedIn for now? Or would you go to Facebook and say, “Hey, I wanna use it for business to business content? I wanna use it for, you know, the kind of things, looking for jobs or recruiting, etc.?” Let me know what you think in the comments. I’d be really interested to see what you think is the future of the Facebook versus LinkedIn debate and potentially a battle."}, {"dbcc": "This is Jay Today. Jay Today’s brought to you by my friends at Emma. Get more from your email marketing, go to MyEmma.com. Emma as far as I know is not the next enemy of Facebook, but guys, you never know. See you next time."}, {"aa82": "Originally published at www.convinceandconvert.com."}], "content": "Is Facebook Trying to Kill LinkedIn Next? By Jay Baer Jay: Hey guys it’s Jay, hope you are doing great. Look, Facebook plays amazing defense, okay? Facebook strangled Twitter, right? Twitter said hey, we’re gonna try and succeed with live video. Facebook comes out with Facebook Live, here we are. Facebook is slowly strangling Snapchat which was interesting. I’m just back from the Social Media Marketing World conference last week. There were fewer Snapchat sessions than ever. Look, I’m not suggesting that Snapchat is gonna go away, I’m actually bullish on Snapchat’s future, but I think Snapchat’s chances to be a big, public social network that everybody uses are gone. Why? Because Facebook was threatened and stole all of their good features and put them into Instagram and now Facebook itself, and so that feature advantage that Snapchat had is simply gone. It’s just the way Facebook plays, right? That’s why they bought Instagram because they Instagram as a threat. That’s why they bought WhatsApp, because they thought WhatsApp was a threat. These guys play for keeps, and I think their next victim might be LinkedIn. Facebook, as you may know, is already starting to offer job listings. Now those job listings are mostly for small biz, mostly retail, those kind of things for now, but there is nothing to prevent Facebook from starting to offer white collar jobs and offer all the functionality that LinkedIn employs. There’s nothing particularly technically amazing about what LinkedIn does. They’ve got some nice ad targeting options and things like that, and there’s a lot of content there and a lot of institutionalized behavior of people using LinkedIn for that kind of purpose, but there’s nothing in LinkedIn’s arsenal that Facebook couldn’t copy. There’s certainly no sort of moat around the functionality. And so if LinkedIn continues to succeed, and I think LinkedIn’s doing a real good job lately with the new redesign and things like that, is Facebook going to let LinkedIn continue to have this kind of toe hold in the business market? Now let’s recognize that according to Tom Webster at Edison Research, 67 percent of Americans ages 12 and older have used Facebook. 22 percent of Americans have used LinkedIn ever, and we talk about Twitter’s slowing growth. LinkedIn has grown three percent over four years, right? So LinkedIn’s audience is essentially LinkedIn’s audience, where of course Facebook’s continues to rise. And so to me, it seems like Facebook’s next natural enemy is in fact LinkedIn. Now the only thing that might prevent this from happening is the fact that Microsoft owns 1.3 percent of Facebook. Now that’s a sizable chunk, but that’s not so sizable I think that they couldn’t do something about that if they wanted to. It will be very very interesting to see how this goes. So two questions for you. One, will Facebook train its considerable guns and ammunition on LinkedIn next? And two, if it was available, would you use Facebook for the kind of things that you use LinkedIn for now? Or would you go to Facebook and say, “Hey, I wanna use it for business to business content? I wanna use it for, you know, the kind of things, looking for jobs or recruiting, etc.?” Let me know what you think in the comments. I’d be really interested to see what you think is the future of the Facebook versus LinkedIn debate and potentially a battle. This is Jay Today. Jay Today’s brought to you by my friends at Emma. Get more from your email marketing, go to MyEmma.com. Emma as far as I know is not the next enemy of Facebook, but guys, you never know. See you next time. Originally published at www.convinceandconvert.com. ", "child": "2186_1\t2186_2\t2186_3\t2186_4\t2186_5\t2186_6"}