{"name": "2190", "parent": "", "title": "Are You Following @BOTUS?", "sentences": [{"afd9": "Are You Following @BOTUS?"}, {"3be7": "Planet Money created a Twitter bot that will trade stocks based on President Trump’s tweets."}, {"b243": "It’s a big day in the stock market world: Planet Money just launched @BOTUS, a Twitter bot that will buy and sell stocks based on President Trump’s tweets."}, {"048a": "Bot of the U.S. (@BOTUS) | TwitterThe latest Tweets from Bot of the U.S. (@BOTUS). I'm a stock-trading bot created by the podcast @PlanetMoney. twitter.com"}, {"ed09": "Here’s how they explain it on the latest Planet Money podcast:"}, {"e908": "ALEX GOLDMARK: So here’s what I want to do. I want to build a computer program that monitors President Trump’s tweets. And when he says something nice about a company, we buy that company’s stock. And when President Trump tweets something negative about a company, we will sell that company’s stock short. What that just means is that we will set ourselves up to make a profit if the stock price goes down."}, {"4f29": "The majority of the podcast is about the complexity of creating a bot that can both identify whether tweets are positive or negative (easy) and identify whether a tweet names a specific company (hard). The Planet Money team decides, for example, that the bot should ignore all instances of the word “Tiffany” because the bot isn’t intelligent enough to deduce whether Trump is referring to his daughter or the jewelry retailer."}, {"1e55": "The Planet Money team worked with a fintech company called Tradeworx to build BOTUS, and Tradeworx did a little reverse engineering to figure out what would have happened had they launched BOTUS right after the election. They don’t show us the numbers—which is unfortunate—but it’s interesting to hear Planet Money’s Alex Goldmark look at the data and assume that BOTUS is going to earn them money, and then hear Tradeworx’s Mani Mahjouri say:"}, {"3ff0": "MANI MAHJOURI: No, no, no, I just, I just — I don’t want to overstate — I don’t want to understate the risk and I don’t want to overstate the benefit of doing something like this. I just feel like, um… you know, it’s not, uh… we haven’t scientifically proven anything."}, {"8b65": "So I guess we’ll have to see what happens. It’s the Planet Money team members’ individual cash on the line, not NPR’s, which adds a human element to this robot trading game."}, {"71d3": "Also, um… I kinda want to write BOTUS/Toxie fan fiction now. (You remember Toxie, Planet Money’s toxic asset, right? I’d have to write a vampire AU because Toxie died, but I could definitely see a world in which a robot that trades stocks and a vampire that eats mortgages bond over a shared love of taking financial risks.)"}], "content": "Are You Following @BOTUS? Planet Money created a Twitter bot that will trade stocks based on President Trump’s tweets. It’s a big day in the stock market world: Planet Money just launched @BOTUS, a Twitter bot that will buy and sell stocks based on President Trump’s tweets. Bot of the U.S. (@BOTUS) | TwitterThe latest Tweets from Bot of the U.S. (@BOTUS). I'm a stock-trading bot created by the podcast @PlanetMoney. twitter.com Here’s how they explain it on the latest Planet Money podcast: ALEX GOLDMARK: So here’s what I want to do. I want to build a computer program that monitors President Trump’s tweets. And when he says something nice about a company, we buy that company’s stock. And when President Trump tweets something negative about a company, we will sell that company’s stock short. What that just means is that we will set ourselves up to make a profit if the stock price goes down. The majority of the podcast is about the complexity of creating a bot that can both identify whether tweets are positive or negative (easy) and identify whether a tweet names a specific company (hard). The Planet Money team decides, for example, that the bot should ignore all instances of the word “Tiffany” because the bot isn’t intelligent enough to deduce whether Trump is referring to his daughter or the jewelry retailer. The Planet Money team worked with a fintech company called Tradeworx to build BOTUS, and Tradeworx did a little reverse engineering to figure out what would have happened had they launched BOTUS right after the election. They don’t show us the numbers—which is unfortunate—but it’s interesting to hear Planet Money’s Alex Goldmark look at the data and assume that BOTUS is going to earn them money, and then hear Tradeworx’s Mani Mahjouri say: MANI MAHJOURI: No, no, no, I just, I just — I don’t want to overstate — I don’t want to understate the risk and I don’t want to overstate the benefit of doing something like this. I just feel like, um… you know, it’s not, uh… we haven’t scientifically proven anything. So I guess we’ll have to see what happens. It’s the Planet Money team members’ individual cash on the line, not NPR’s, which adds a human element to this robot trading game. Also, um… I kinda want to write BOTUS/Toxie fan fiction now. (You remember Toxie, Planet Money’s toxic asset, right? I’d have to write a vampire AU because Toxie died, but I could definitely see a world in which a robot that trades stocks and a vampire that eats mortgages bond over a shared love of taking financial risks.) ", "child": "2190_1\t2190_2"}