{"name": "2192", "parent": "", "title": "A McDonald’s Twitter account insulted Trump, and now it is content: A step-by-step guide", "sentences": [{"0079": "Exhibit A: The Tweet"}, {"cdde": "A McDonald’s Twitter account insulted Trump, and now it is content: A step-by-step guide"}, {"fd64": "We have fun here on the Internet."}, {"ff2b": "By Abby Ohlheiser"}, {"f7c3": "Hi. Today’s viral news story has been chosen, and it is this tweet from a verified corporate account run by McDonald’s, the popular fast-food restaurant."}, {"a360": "As you can clearly see in Exhibit A above, the tweet is a reply to President Trump, and it is not very nice to him. Whoever tweeted it really wanted to make sure that a lot of people saw it, which is why it was the “pinned tweet” for this account Thursday morning before it was deleted."}, {"1cae": "“Rogue” tweets, from dubious anonymous accounts claiming to be from Trump administration staffers or from real, verified accounts of brands and government agencies, have become a favorite meme for parts of the American public who are desperately looking for signs, any sign, of institutional #resistance against the president. Which is why this McDonald’s tweet was destined to become content the moment it was born. Here is a step-by-step guide to how that happens."}, {"540c": "Step 1: McDonald’s tweets."}, {"29ba": "At 9:16 a.m., the @McDonaldsCorp account tweets at the president: “You are actually a disgusting excuse of a President and we would love to have @BarackObama back, also you have tiny hands.” The tweet comes from the company’s corporate account; the brand account is @ McDonalds."}, {"1c22": "Step 2: People see the McDonald’s tweet."}, {"a059": "The tweet collects hundreds of retweets. This is not something a brand should tweet, although it’s pretty clear that many people sharing this one are happy it did."}, {"202f": "Step 3: People take screen shots of the McDonald’s tweet."}, {"dc1f": "The first thing you do when you see a corporate account of a major international company tweet something like this is take a screen shot. Usually they don’t stay up for long. So even as the original tweet is being retweeted, others are posting their own, more permanent records of the tweet."}, {"4eff": "If you, like me, follow a lot of people who closely follow politics, then you probably saw your feed turn into a river of images of this same tweet earlier Thursday morning."}, {"1a4a": "Step 4: People meme and joke about the McDonald’s tweet."}, {"70b8": "This one was actually pretty easy to accomplish, because as it turns out, McDonald’s and Trump have a history. Snippets of this commercial become GIFs:"}, {"a3be": "Others make jokes:"}, {"8e99": "We have fun here on the Internet."}, {"7e3e": "Step 5: McDonald’s deletes the tweet."}, {"915e": "The tweet is deleted, but thanks to step 3, there are plenty of records."}, {"17f9": "Step 6: The tweet becomes content."}, {"4081": "Although some outlets made their content about the tweet even before McDonald’s deleted it (congrats!), the story continues to spread even after McDonald’s gets rid of the tweet. By 10 a.m., it’s the lead story on the Drudge Report."}, {"67b7": "And many other places have converted the tweet into a headline:"}, {"c3ed": "Step 7: We were hacked"}, {"42bd": "We, like many outlets, reached out to McDonald’s about the original tweet. McDonald’s issued the above statement via Twitter later Thursday morning."}, {"8838": "Terri Hickey, a spokesperson for McDonald’s, later emailed us an identical statement in response to a request for comment."}, {"c326": "Step 8: The tweet becomes good content."}, {"a74f": "Hello! Thank you for reading."}, {"34bb": "This story originally appeared on The Washington Post’s The Intersect blog."}], "content": "Exhibit A: The Tweet A McDonald’s Twitter account insulted Trump, and now it is content: A step-by-step guide We have fun here on the Internet. By Abby Ohlheiser Hi. Today’s viral news story has been chosen, and it is this tweet from a verified corporate account run by McDonald’s, the popular fast-food restaurant. As you can clearly see in Exhibit A above, the tweet is a reply to President Trump, and it is not very nice to him. Whoever tweeted it really wanted to make sure that a lot of people saw it, which is why it was the “pinned tweet” for this account Thursday morning before it was deleted. “Rogue” tweets, from dubious anonymous accounts claiming to be from Trump administration staffers or from real, verified accounts of brands and government agencies, have become a favorite meme for parts of the American public who are desperately looking for signs, any sign, of institutional #resistance against the president. Which is why this McDonald’s tweet was destined to become content the moment it was born. Here is a step-by-step guide to how that happens. Step 1: McDonald’s tweets. At 9:16 a.m., the @McDonaldsCorp account tweets at the president: “You are actually a disgusting excuse of a President and we would love to have @BarackObama back, also you have tiny hands.” The tweet comes from the company’s corporate account; the brand account is @ McDonalds. Step 2: People see the McDonald’s tweet. The tweet collects hundreds of retweets. This is not something a brand should tweet, although it’s pretty clear that many people sharing this one are happy it did. Step 3: People take screen shots of the McDonald’s tweet. The first thing you do when you see a corporate account of a major international company tweet something like this is take a screen shot. Usually they don’t stay up for long. So even as the original tweet is being retweeted, others are posting their own, more permanent records of the tweet. If you, like me, follow a lot of people who closely follow politics, then you probably saw your feed turn into a river of images of this same tweet earlier Thursday morning. Step 4: People meme and joke about the McDonald’s tweet. This one was actually pretty easy to accomplish, because as it turns out, McDonald’s and Trump have a history. Snippets of this commercial become GIFs: Others make jokes: We have fun here on the Internet. Step 5: McDonald’s deletes the tweet. The tweet is deleted, but thanks to step 3, there are plenty of records. Step 6: The tweet becomes content. Although some outlets made their content about the tweet even before McDonald’s deleted it (congrats!), the story continues to spread even after McDonald’s gets rid of the tweet. By 10 a.m., it’s the lead story on the Drudge Report. And many other places have converted the tweet into a headline: Step 7: We were hacked We, like many outlets, reached out to McDonald’s about the original tweet. McDonald’s issued the above statement via Twitter later Thursday morning. Terri Hickey, a spokesperson for McDonald’s, later emailed us an identical statement in response to a request for comment. Step 8: The tweet becomes good content. Hello! Thank you for reading. This story originally appeared on The Washington Post’s The Intersect blog. ", "child": "2192_1\t2192_2\t2192_3\t2192_42192_1\t2192_2\t2192_3\t2192_4"}