{"name": "2203", "parent": "", "title": "How to select a common topic for a blog (or video or podcast)", "sentences": [{"1021": "How to select a common topic for a blog (or video or podcast)"}, {"83d5": "When I coach executives about content marketing or personal blogging, a very common problem I encounter is the challenge of focusing on a single topic for a blog (or podcast or video series). “I like so many things,” my clients will say. “How do I pick just one?”"}, {"0ec7": "But it is something that must happen. When you commit to creating content on a consistent basis, you don’t want to confuse your readers (or viewers 0r listeners) by discussing cookie recipes in one post and exploring Russian history in the next. Your fans generally need to rely on you for some common theme."}, {"abe8": "That doesn’t mean you have to be stuck on one idea, or that it has to be boring. Let’s look at some practical ideas on how to achieve a content theme that stays relevant, fresh, and fun."}, {"1e95": "The ties that bind"}, {"57a9": "The first thing to consider is that even if you have diverse interests, there is probably one core idea that holds everything together."}, {"6607": "I was working with a young executive who was into martial arts, grief counseling, and leadership studies. She was exasperated and didn’t know where to start. I asked her, “what makes you come alive … what is that moment that makes you most proud?” She off-handedly remarked “when I bring people to their moment of courage.”"}, {"5c32": "That was it."}, {"4022": "That message tied everything together and provided a theme that was sort of an umbrella for all of her interests. In my book KNOWN, this would be referred to her as her sustainable interest. She is happily blogging about this core passion! I find that even when a person’s interests are seemingly disparate, there is usually some core idea we can find that holds everything together."}, {"7075": "I’ve found that often people have a core idea right in front of them, but it may be difficult to discern until they start talking about it with another person."}, {"7ce5": "Bring many ideas into your theme"}, {"46c4": "Even though I blog about one theme — the intersection of marketing, strategy, and humanity — I’m never bored because I tell this story through my own varied interests and life experiences."}, {"4c69": "I even used a story about my grandfather to explain a marketing concept. So you see, I told my stories about my interests in art, gardening, sports, and travel to teach lessons about marketing. I’m always thinking in terms of stories!"}, {"e34d": "The best bloggers learn to pay attention to daily epiphanies and quickly immortalize them in blog posts. The real key to success is having the discipline to collect these ideas and explore them through your content."}, {"5ef0": "What is the need?"}, {"35f3": "There are many reasons to blog, but if you hope to turn it into a business some day, you’ll need to focus on solving a problem for your audience. You want to be indispensable to your readers because you help them in some way every day."}, {"f4ec": "If you’re active on the web, maybe you’ve noticed that something is missing in your industry. That could be a sign of a market need. How would you improve upon the existing content in your niche, or create something entirely new that pushes the envelope? Can you bring a new attitude or perspective to a stale marketplace?"}, {"d82c": "How can you deliver your own story and expertise to your vertical in a way that attracts a meaningful audience?"}, {"2c59": "The headline test"}, {"0208": "Start writing down headline ideas of any post you’d like to write about, or video you’d like to record. Don’t flesh out the ideas, just write down the idea."}, {"25dd": "Now look over the list. is there a certain theme that comes out? Pay special attention to the last 10 ideas on the list. Is there some common thread that holds them together?"}, {"b49e": "Mark Schaefer is the chief blogger for {grow}, executive director of Schaefer Marketing Solutions, and the author of several best-selling digital marketing books. He is an acclaimed keynote speaker, college educator, and business consultant. The Marketing Companion podcast is among the top business podcasts in the world. Contact Mark to have him speak to your company event or conference soon."}, {"3f78": "Originally published at www.businessesgrow.com on April 10, 2017."}], "content": "How to select a common topic for a blog (or video or podcast) When I coach executives about content marketing or personal blogging, a very common problem I encounter is the challenge of focusing on a single topic for a blog (or podcast or video series). “I like so many things,” my clients will say. “How do I pick just one?” But it is something that must happen. When you commit to creating content on a consistent basis, you don’t want to confuse your readers (or viewers 0r listeners) by discussing cookie recipes in one post and exploring Russian history in the next. Your fans generally need to rely on you for some common theme. That doesn’t mean you have to be stuck on one idea, or that it has to be boring. Let’s look at some practical ideas on how to achieve a content theme that stays relevant, fresh, and fun. The ties that bind The first thing to consider is that even if you have diverse interests, there is probably one core idea that holds everything together. I was working with a young executive who was into martial arts, grief counseling, and leadership studies. She was exasperated and didn’t know where to start. I asked her, “what makes you come alive … what is that moment that makes you most proud?” She off-handedly remarked “when I bring people to their moment of courage.” That was it. That message tied everything together and provided a theme that was sort of an umbrella for all of her interests. In my book KNOWN, this would be referred to her as her sustainable interest. She is happily blogging about this core passion! I find that even when a person’s interests are seemingly disparate, there is usually some core idea we can find that holds everything together. I’ve found that often people have a core idea right in front of them, but it may be difficult to discern until they start talking about it with another person. Bring many ideas into your theme Even though I blog about one theme — the intersection of marketing, strategy, and humanity — I’m never bored because I tell this story through my own varied interests and life experiences. I even used a story about my grandfather to explain a marketing concept. So you see, I told my stories about my interests in art, gardening, sports, and travel to teach lessons about marketing. I’m always thinking in terms of stories! The best bloggers learn to pay attention to daily epiphanies and quickly immortalize them in blog posts. The real key to success is having the discipline to collect these ideas and explore them through your content. What is the need? There are many reasons to blog, but if you hope to turn it into a business some day, you’ll need to focus on solving a problem for your audience. You want to be indispensable to your readers because you help them in some way every day. If you’re active on the web, maybe you’ve noticed that something is missing in your industry. That could be a sign of a market need. How would you improve upon the existing content in your niche, or create something entirely new that pushes the envelope? Can you bring a new attitude or perspective to a stale marketplace? How can you deliver your own story and expertise to your vertical in a way that attracts a meaningful audience? The headline test Start writing down headline ideas of any post you’d like to write about, or video you’d like to record. Don’t flesh out the ideas, just write down the idea. Now look over the list. is there a certain theme that comes out? Pay special attention to the last 10 ideas on the list. Is there some common thread that holds them together? Mark Schaefer is the chief blogger for {grow}, executive director of Schaefer Marketing Solutions, and the author of several best-selling digital marketing books. He is an acclaimed keynote speaker, college educator, and business consultant. The Marketing Companion podcast is among the top business podcasts in the world. Contact Mark to have him speak to your company event or conference soon. Originally published at www.businessesgrow.com on April 10, 2017. ", "child": "2203_1\t2203_2\t2203_3\t2203_4\t2203_5\t2203_62203_1\t2203_2\t2203_3\t2203_4\t2203_5\t2203_6"}