{"name": "2207", "parent": "", "title": "How On-Demand Video Can Significantly Increase Your Lead Generation Strategy", "sentences": [{"b872": "How On-Demand Video Can Significantly Increase Your Lead Generation Strategy"}, {"c2d1": "From a conversion optimization point of view, much depends on “top of the funnel” content. Your articles and lead magnets can bring thousands of clicks, and hundreds of opt-ins. And though for the average startup founder this can sound like unicorns galloping around on rainbows, if the middle of the funnel is broken, all those numbers amount to zero."}, {"ace4": "The small guide below can turn everything around, explaining how you can use video in order to increase opt-ins, retention rate, trust, and finally sales."}, {"a18a": "Why simply building a list is not enough"}, {"dbb0": "Startup founders, affiliates, and website owners alike, all struggle to bring in more leads. For some, the quest starts and ends with top of the funnel content."}, {"1158": "An article, an extensive guide, maybe some lead magnet like an e-book, a collection of some sort, a pdf. resource etc."}, {"1b98": "But what sits on top of the funnel is not particularly important. The middle of the funnel — if it’s carefully designed — dwarfs everything else in significance."}, {"39e5": "Newsletters, even if they offer stellar content, have dismal open rates across industries. You’d be lucky to go over 20%, if you can even reach close at all."}, {"9730": "And we all know that sale offers cannot possibly be preceded by lead magnets only. There gotta be something in between. Something that builds trust, creates a “YES ladder”, and warms your prospects."}, {"5608": "Webinars have became the golden standard- but you should’t stop there (why explore on-demand video instead)"}, {"0172": "For those of us who feel like newsletters can be an exercise in frustration, filling the middle of the funnel with something else seems reasonable."}, {"9035": "Witnessing an open rate of 17% even when you did many things right, leaves you impotently angry."}, {"87c0": "So webinars can very well be the best way to fill the gap between somebody opting in, and becoming a customer. They have the best conversion rates across the board. Which makes them a Middleman extraordinaire."}, {"d7df": "But why stop there when you can improve even more?"}, {"1886": "Ask any industry marketing specialist, and he will tell you how video courses are becoming the new black."}, {"13af": "Almost identical to a webinar, the course has numerous advantages, further improving conversion rates down the funnel."}, {"2799": "Let’s talk about some of them:"}, {"a03b": "Courses, unlike webinars, are not time sensitive."}, {"5f8d": "While a webinar can run once or twice, requiring more effort to set up, and more active engagement on your part, a course is more of a passive piece of content you can leave on autopilot."}, {"7f96": "Their perceived value is way higher."}, {"959c": "A webinar is something that almost anyone with a laptop camera can create. It doesn’t promise much. In a world where people consume quality content on daily basis, a simple webinar is old news."}, {"7594": "Courses on the other hand, feel way more professional. Naturally, people want them more."}, {"123a": "In a world where courses often have a price-tag attached, offering one for free can be quite the lead magnet. The competition is scarce when it comes to people handing around free courses, so yours will immediately stand out."}, {"f4a9": "Most importantly, they are convenient."}, {"d3e0": "Divided into chapters, and therefore easy to watch at smaller intervals, they can be quite convenient. Plus, there is no time barrier for the user. Starting today, the course can be finished a month later, which means they can consume the content at their own pace."}, {"e00e": "A webinar on the other hand, requires a bigger time investment. And if they are not familiar with your brand, it’s not likely they will open the webinar at all."}, {"b299": "Passive and automated funnel content."}, {"607f": "While webinars require a lot of set-up and a lot of promotion, video courses follow a self-serve principle. Set up the landing page, and that’s it."}, {"7b1f": "They create a “YES ladder”."}, {"65b3": "When people watch a webinar, and instantly step on your sales offer, there is still a healthy dose of skepticism. With courses on the other hand, each separate episode/chapter can create what is known as a YES ladder. The more sections of the course they complete, the more likely they will buy from you at the end."}, {"51a1": "They offer you more data to work with"}, {"ead5": "Depending on your video hosting service, you can access how many people watched each video and to what length. This can help you A/B test your title, content, description, video thumbnails etc."}, {"47b7": "It will help you learn more about your customers as well."}, {"364c": "Examples on how to create them"}, {"87cb": "You can map a garden variety of ideas. Whiteboards, stock footage with narration, studio quality videos, or simple slides with voice-overs attached."}, {"cb7b": "The format depends on experience, budget, and willingness to experiment with filming equipment. But don’t let the sound of that scare you- we’ve created 10+ hours of video content for our product, with the lowest budget imaginable, despite never previously holding a camera in our hands."}, {"3ae4": "Fiverr voice-over gigs can cover 400 words for 5$, and that’s studio quality audio you can easily work with. On top of that, you can learn a video editing software in less than 2 or 3 days."}, {"3acc": "The most important thing though, is the concept, not the format. What do you plan to teach or give away?"}, {"51a7": "If you are a software startup selling a keyword research tool for example, the video course can go over “Tips on how to do quality keyword research”. You can then mention your tool and how easy it makes everything, somewhere around the end of the course."}, {"2c87": "When they learn from you, they trust you. Plus your offer is highly targeted to what they are after, and you have a lot of room to warm things up with a couple of casual mentions and feature descriptions of your product."}, {"7256": "If you are in fitness, like we are, the course can cover healthy habits, or workout tips, or anything else in between. If your product is partially video (like ours), you can re-purpose some of the footage, attaching new voice-overs and voila- the course is ready."}, {"ff39": "Additional marketing tactics"}, {"ed9f": "A nicely structured landing page ties your course with a shiny ribbon on top. So make sure to pay attention to the top of the funnel as well. The course will do it’s job in converting leads into customers, but you must “sell it well”."}, {"d3fc": "Here, scarcity and urgency can work in tandem."}, {"2613": "Write how your course is free, but only up to a certain date. Or limit the number of sign-ups. You can even visualize with a countdown timer, and a progress bar indicating how many spots are being taken."}, {"0db0": "Consider making it shareable"}, {"6c75": "And allow visitors to brag when they sign-up, complete the course, or watch a certain portion of it. They can instantly Tweet or share on Facebook. Set your meta description right, and step back."}, {"5cb6": "Allow those who complete the course to refer others"}, {"deb7": "In exchange for something, of course. The ideal timing being when you present your offer. Give a free package, or a monthly trial, or a premium subscription to those who bring in more people through the funnel by sharing the course, and inviting some of their friends to join."}, {"a121": "This is easy, because everybody is getting some value out of the exchange."}, {"311c": "Offer a free trial for your product, or set-up a pre-launch landing page"}, {"e90f": "After every episode/chapter, you can include a call to action, or a sign-up form right there, in order to gauge interest about your product or service."}, {"be30": "You can offer a free trial if your product is live, or collect e-mails for a pre-launch campaign. Consider your video course as pre-onboarding material."}, {"cfd6": "We are developing the course, so it explains the features of Fitness Updated, even before users have a chance to actually see them. That way, the on-boarding works even better."}, {"b372": "Follow Hubspot’s strategy"}, {"224e": "They are one of the biggest SaaS companies on the market because they leverage a powerful marketing strategy. Which coincidentally works well with video too."}, {"fca4": "Just identify related audiences that might love your course, and product down the road."}, {"b219": "Then write massive pieces of content trying to solve a problem. See that there is a connection between your content, video course, and some feature of your product."}, {"4829": "Then, invest some time in SEO and rank for those long term and specific phrases. It might not be a large search volume we are talking about here, but it’s laser specific which makes it super valuable top-of-the-funnel."}, {"f2ca": "Advertising and affiliate networks"}, {"f75d": "If the conversion is well, you can pay in order to bring more people down the funnel. Facebook advertising, or maybe even paying to affiliates."}, {"5c64": "Lot of networks love to work with offers that include only an e-mail sign-up."}, {"98bb": "You will spend some money, but the conversion rate and price of your product can make up for every dollar you put into bringing in more leads."}, {"d808": "If you open an affiliate program for your product, the course can still be extremely valuable as a promotional material that affiliates can work with. They love when you give them a converting funnel to send traffic to, and are more likely to jump on the wagon. Whatever their methods (mail lists, PPC, or website placements…) the on-demand video course can significantly increase conversions."}, {"6353": "For more articles like this one, and case studies from scaling Fitness Updated, follow me on Twitter, or here on Medium."}], "content": "How On-Demand Video Can Significantly Increase Your Lead Generation Strategy From a conversion optimization point of view, much depends on “top of the funnel” content. Your articles and lead magnets can bring thousands of clicks, and hundreds of opt-ins. And though for the average startup founder this can sound like unicorns galloping around on rainbows, if the middle of the funnel is broken, all those numbers amount to zero. The small guide below can turn everything around, explaining how you can use video in order to increase opt-ins, retention rate, trust, and finally sales. Why simply building a list is not enough Startup founders, affiliates, and website owners alike, all struggle to bring in more leads. For some, the quest starts and ends with top of the funnel content. An article, an extensive guide, maybe some lead magnet like an e-book, a collection of some sort, a pdf. resource etc. But what sits on top of the funnel is not particularly important. The middle of the funnel — if it’s carefully designed — dwarfs everything else in significance. Newsletters, even if they offer stellar content, have dismal open rates across industries. You’d be lucky to go over 20%, if you can even reach close at all. And we all know that sale offers cannot possibly be preceded by lead magnets only. There gotta be something in between. Something that builds trust, creates a “YES ladder”, and warms your prospects. Webinars have became the golden standard- but you should’t stop there (why explore on-demand video instead) For those of us who feel like newsletters can be an exercise in frustration, filling the middle of the funnel with something else seems reasonable. Witnessing an open rate of 17% even when you did many things right, leaves you impotently angry. So webinars can very well be the best way to fill the gap between somebody opting in, and becoming a customer. They have the best conversion rates across the board. Which makes them a Middleman extraordinaire. But why stop there when you can improve even more? Ask any industry marketing specialist, and he will tell you how video courses are becoming the new black. Almost identical to a webinar, the course has numerous advantages, further improving conversion rates down the funnel. Let’s talk about some of them: Courses, unlike webinars, are not time sensitive. While a webinar can run once or twice, requiring more effort to set up, and more active engagement on your part, a course is more of a passive piece of content you can leave on autopilot. Their perceived value is way higher. A webinar is something that almost anyone with a laptop camera can create. It doesn’t promise much. In a world where people consume quality content on daily basis, a simple webinar is old news. Courses on the other hand, feel way more professional. Naturally, people want them more. In a world where courses often have a price-tag attached, offering one for free can be quite the lead magnet. The competition is scarce when it comes to people handing around free courses, so yours will immediately stand out. Most importantly, they are convenient. Divided into chapters, and therefore easy to watch at smaller intervals, they can be quite convenient. Plus, there is no time barrier for the user. Starting today, the course can be finished a month later, which means they can consume the content at their own pace. A webinar on the other hand, requires a bigger time investment. And if they are not familiar with your brand, it’s not likely they will open the webinar at all. Passive and automated funnel content. While webinars require a lot of set-up and a lot of promotion, video courses follow a self-serve principle. Set up the landing page, and that’s it. They create a “YES ladder”. When people watch a webinar, and instantly step on your sales offer, there is still a healthy dose of skepticism. With courses on the other hand, each separate episode/chapter can create what is known as a YES ladder. The more sections of the course they complete, the more likely they will buy from you at the end. They offer you more data to work with Depending on your video hosting service, you can access how many people watched each video and to what length. This can help you A/B test your title, content, description, video thumbnails etc. It will help you learn more about your customers as well. Examples on how to create them You can map a garden variety of ideas. Whiteboards, stock footage with narration, studio quality videos, or simple slides with voice-overs attached. The format depends on experience, budget, and willingness to experiment with filming equipment. But don’t let the sound of that scare you- we’ve created 10+ hours of video content for our product, with the lowest budget imaginable, despite never previously holding a camera in our hands. Fiverr voice-over gigs can cover 400 words for 5$, and that’s studio quality audio you can easily work with. On top of that, you can learn a video editing software in less than 2 or 3 days. The most important thing though, is the concept, not the format. What do you plan to teach or give away? If you are a software startup selling a keyword research tool for example, the video course can go over “Tips on how to do quality keyword research”. You can then mention your tool and how easy it makes everything, somewhere around the end of the course. When they learn from you, they trust you. Plus your offer is highly targeted to what they are after, and you have a lot of room to warm things up with a couple of casual mentions and feature descriptions of your product. If you are in fitness, like we are, the course can cover healthy habits, or workout tips, or anything else in between. If your product is partially video (like ours), you can re-purpose some of the footage, attaching new voice-overs and voila- the course is ready. Additional marketing tactics A nicely structured landing page ties your course with a shiny ribbon on top. So make sure to pay attention to the top of the funnel as well. The course will do it’s job in converting leads into customers, but you must “sell it well”. Here, scarcity and urgency can work in tandem. Write how your course is free, but only up to a certain date. Or limit the number of sign-ups. You can even visualize with a countdown timer, and a progress bar indicating how many spots are being taken. Consider making it shareable And allow visitors to brag when they sign-up, complete the course, or watch a certain portion of it. They can instantly Tweet or share on Facebook. Set your meta description right, and step back. Allow those who complete the course to refer others In exchange for something, of course. The ideal timing being when you present your offer. Give a free package, or a monthly trial, or a premium subscription to those who bring in more people through the funnel by sharing the course, and inviting some of their friends to join. This is easy, because everybody is getting some value out of the exchange. Offer a free trial for your product, or set-up a pre-launch landing page After every episode/chapter, you can include a call to action, or a sign-up form right there, in order to gauge interest about your product or service. You can offer a free trial if your product is live, or collect e-mails for a pre-launch campaign. Consider your video course as pre-onboarding material. We are developing the course, so it explains the features of Fitness Updated, even before users have a chance to actually see them. That way, the on-boarding works even better. Follow Hubspot’s strategy They are one of the biggest SaaS companies on the market because they leverage a powerful marketing strategy. Which coincidentally works well with video too. Just identify related audiences that might love your course, and product down the road. Then write massive pieces of content trying to solve a problem. See that there is a connection between your content, video course, and some feature of your product. Then, invest some time in SEO and rank for those long term and specific phrases. It might not be a large search volume we are talking about here, but it’s laser specific which makes it super valuable top-of-the-funnel. Advertising and affiliate networks If the conversion is well, you can pay in order to bring more people down the funnel. Facebook advertising, or maybe even paying to affiliates. Lot of networks love to work with offers that include only an e-mail sign-up. You will spend some money, but the conversion rate and price of your product can make up for every dollar you put into bringing in more leads. If you open an affiliate program for your product, the course can still be extremely valuable as a promotional material that affiliates can work with. They love when you give them a converting funnel to send traffic to, and are more likely to jump on the wagon. Whatever their methods (mail lists, PPC, or website placements…) the on-demand video course can significantly increase conversions. For more articles like this one, and case studies from scaling Fitness Updated, follow me on Twitter, or here on Medium. ", "child": "2207_12207_1"}