{"name": "2219", "parent": "", "title": "8 Reasons Why Being a Dark-Skinned Black Woman Doesn’t Require a Disclaimer", "sentences": [{"3e30": "8 Reasons Why Being a Dark-Skinned Black Woman Doesn’t Require a Disclaimer"}, {"4f1d": "We are dark and it’s a big deal because of how incredible it is to watch the sun glaze over our skin when it’s in blessing mode — but we don’t need permission to demand the attention you give us even when your words are coded in self-hate."}, {"3ab8": "You mock the fiery strands that crown our heads in the patterns that build a maze of historical blasphemy. The maps provide the clue to the emotional prison that holds you hostage. We love the way our scalp drives the incentive to widen the gap between simple and spectacular. We don’t need the praises for our uniqueness to be replicated by foreign dolls in unchecked territory."}, {"fb41": "When the lights are out — and the white sheets soak our sweat, we shimmer just for the ones who see us glowing in competition with the moon — as it streams the crevices of our covering — that matches the night and yet outshines the shadows of lust you protect in private."}, {"d537": "The scene outside the realm of reason is cluttered with quotes and insults from half-men and clothed demons — that battle to the end to deny the wringing at the neck when faced with the tragedy of their own deniability. You need the key ingredient to jive with the mesh that has been created to blacken our existence. We are too damn black to accept the utterance of our demise."}, {"6bc1": "We don’t need a hero to rescue us from the tunnel of banishment nor do we need the voices that scream on our behalf as if we warrant that level of reassurance. Our presence coerces a visceral reaction that can’t be thwarted. We sit alone in the vibes of the day. We sift through bodies clamming for destinations unknown. We perch on sidewalks as we await the signal to move away. We need to keep it moving to give others the opportunity to match our likeness."}, {"309e": "Copycats drenched in hoods with dreads and cornrows screaming for freedom from a host that hijacked the culture of appropriation without recognition or respect. We are armed with the dignified path to what it means to be what we are when we are what we were born to be. We don’t need to plot ways to remain that consistency and we demean those that don’t even try to perfect their strategy."}, {"0492": "Hate us please. Mock us with the accompaniment of the worn out rhetoric that never ceases to amaze. Repost, rehash and redesign all the bullet points that display why really dark women with broad nostrils, kinky hair, and eyes that mute any hope that icy glaciers will survive our gaze — need to be tormented and verbally raped in exchange for the pleasure at the tears that never fall."}, {"86f5": "Being a dark-skinned woman will never demand a disclaimer because beauty without a trace of interference — that is etched in the templates that hold the secret of what was discovered under the crown of figures with names that require the will of sophisticated tongues — is simply too precious to scold into submission."}, {"e4e9": "Stay dark and continue to light the way that leads to the seductive rapture of our jarring presence."}], "content": "8 Reasons Why Being a Dark-Skinned Black Woman Doesn’t Require a Disclaimer We are dark and it’s a big deal because of how incredible it is to watch the sun glaze over our skin when it’s in blessing mode — but we don’t need permission to demand the attention you give us even when your words are coded in self-hate. You mock the fiery strands that crown our heads in the patterns that build a maze of historical blasphemy. The maps provide the clue to the emotional prison that holds you hostage. We love the way our scalp drives the incentive to widen the gap between simple and spectacular. We don’t need the praises for our uniqueness to be replicated by foreign dolls in unchecked territory. When the lights are out — and the white sheets soak our sweat, we shimmer just for the ones who see us glowing in competition with the moon — as it streams the crevices of our covering — that matches the night and yet outshines the shadows of lust you protect in private. The scene outside the realm of reason is cluttered with quotes and insults from half-men and clothed demons — that battle to the end to deny the wringing at the neck when faced with the tragedy of their own deniability. You need the key ingredient to jive with the mesh that has been created to blacken our existence. We are too damn black to accept the utterance of our demise. We don’t need a hero to rescue us from the tunnel of banishment nor do we need the voices that scream on our behalf as if we warrant that level of reassurance. Our presence coerces a visceral reaction that can’t be thwarted. We sit alone in the vibes of the day. We sift through bodies clamming for destinations unknown. We perch on sidewalks as we await the signal to move away. We need to keep it moving to give others the opportunity to match our likeness. Copycats drenched in hoods with dreads and cornrows screaming for freedom from a host that hijacked the culture of appropriation without recognition or respect. We are armed with the dignified path to what it means to be what we are when we are what we were born to be. We don’t need to plot ways to remain that consistency and we demean those that don’t even try to perfect their strategy. Hate us please. Mock us with the accompaniment of the worn out rhetoric that never ceases to amaze. Repost, rehash and redesign all the bullet points that display why really dark women with broad nostrils, kinky hair, and eyes that mute any hope that icy glaciers will survive our gaze — need to be tormented and verbally raped in exchange for the pleasure at the tears that never fall. Being a dark-skinned woman will never demand a disclaimer because beauty without a trace of interference — that is etched in the templates that hold the secret of what was discovered under the crown of figures with names that require the will of sophisticated tongues — is simply too precious to scold into submission. Stay dark and continue to light the way that leads to the seductive rapture of our jarring presence. ", "child": "2219_1\t2219_2\t2219_3\t2219_4\t2219_5\t2219_6\t2219_7\t2219_8\t2219_9\t2219_10\t2219_11\t2219_12\t2219_13\t2219_14"}