{"name": "2224", "parent": "", "title": "I Hated Southern Hip-Hop For Years. And I Was Wrong.", "sentences": [{"635b": "I Hated Southern Hip-Hop For Years. And I Was Wrong."}, {"cd81": "Looking back at the 11 years of dominance that made me get over myself and start loving Southern hip-hop"}, {"ceab": "I hated Southern hip-hop music. Hated it."}, {"cd78": "I hated “Laffy Taffy.” I hated “Lean Wit It, Rock Wit It.” I couldn’t stand that “Snap Yo Fingers” bullshit, and “It’s Goin’ Down” made me want to throw up."}, {"a13c": "It was 2006 and, if you were a “real” Hip-Hop head like I was then, this part of that year was torture. My Rap music heroes were Rakim, Nas, Biggie, Pac, Cube, Jay-Z, ‘Face, and the Wu-Tang Clan. Mostly all East Coast artists, with a few West Coast G’s sprinkled in. Shit, Andre 3000 was also in my list and I did mention Scarface. All of them verbal were Jedi Knights, lyrical geniuses who could get busy over the best of beats. These were the guys who never got less than 3.5 mics in a Source review. And these dudes were my Rap music standards."}, {"a672": "So, you can imagine how I felt when in the spring of ’06, a new strain of Rap music started hitting the airways and MySpace pages. Songs with slow to mid-tempo beats with MCs who chanted — or in some cases, slurred — the hook of their songs for four minutes. The classic 16 bars model was being replaced with maybe eight bars. The word “trap” would get rhymed with…trap. Lyrical complexity was being replaced with deliberate simplicity. The rest of these songs were…instructions. Dance this way, lean that way. Drink that, shake this."}, {"24b0": "By Rakim’s beard! What was going on with Hip-Hop?!!"}, {"9bef": "As you can deduce, Rap blogs and chat-rooms exploded. The consensus from hip-hop snobs — I was, proudly, and still am, one of them — was that the South was fucking up Rap music. In 2006, Jay -Z was dropping his comeback album, and we were marveling at the genius of the sophomore project from Kanye West. Common, with considerable help from Kanye, was releasing hot new music. There were quality albums coming from gifted rappers. Why was this…shit, polluting, and, running radio airwaves?"}, {"41f6": "While I seethed with outrage at the music industry for unleashing the dual viruses known as snap music and ringtone rap on the public, I got an offer from a close friend to help her with party promotion endeavors. She was a promoter, and she needed someone she could trust to help her, namely with public relations and communication issues. I accepted her offer and began to assist her."}, {"cd0f": "There were quality albums coming from gifted rappers. Why was this…shit, polluting, and, running radio airwaves?"}, {"649a": "The first party I co-promoted was successful. For about an hour and a half. Due to our combined efforts, we were able to pretty much pack the house with people. The problem was we didn’t have that many people dancing. My promotions partner then walked up to the DJ, and asked him to play something, anything that would get people on the dance floor."}, {"ad20": "The DJ told my partner that he was just warming up the crowd with some mild stuff. The real shit was coming right up. As soon as my partner told me that, the DJ dropped a song."}, {"896c": "It was “Snap Yo Fingers.”"}, {"ee3f": "Then, the strangest thing happened."}, {"2236": "I bobbed my head. Hard."}, {"e656": "I didn’t want to bob my head."}, {"5bcc": "My head didn’t give a shit."}, {"0b56": "Then, after I took a quick sip from my glass of Hennessy, I looked up at the party."}, {"df81": "It exploded."}, {"4459": "The place was a madhouse. I tried to look at the dance floor…but I couldn’t see it. It was packed with people. I was amazed. And humbled. Because, after two hours of gawking at people dancing, drinking more Henny, and frantically rocking my neck, I realized two important things:"}, {"9b3a": "1. Nothing gets the party jumping like Southern Hip-Hop"}, {"3c18": "I figured out that night and few more parties later, that no form of music can get a group of people lit like Rap music from the South. That shit compels people to dance."}, {"1c88": "My theory about this? I think that, with the exception of a handful of Southern rappers, many rappers from that region were passed over by the major labels. So, because they may have had problems getting their stuff on the radio, they made music that would pop in nightclubs, bars, and strip clubs. That’s why their music explodes at parties and social functions. It’s ready-made to do just that."}, {"0a25": "2. If you like women, you should love Southern Rap"}, {"f314": "I’m not trying to come across as creepy, so don’t take it this way. But, if you are a guy, and you like to see women dance sexy, you can’t do better than Southern hip-hop music. You can’t. Something mystical happens when women hear a Mike Will Made-It beat. Regular girls turn into strippers when this stuff comes on. Ever see a club full of women shaking their asses in unison? I have. And I’ll tell you that Wu-Tang’s music has never been able to do that."}, {"73ce": "I have a good female friend of mine who’s an accomplished professional. She holds two college degrees and has had a “good” job for years. When Future comes on in the club, she’ll twerk like she lives in New Orleans’s Fifth Ward. And her hips do not lie when she’s getting it in on the dance-floor."}, {"ac5d": "After that fateful night, I realized that I had to accept that hip-hop music wasn’t just one thing. That it was lyrical mastery and boom bap, but, it was also crowd-pleasing trap anthems. And there was nothing wrong with that. Both kinds of music have their place and, for a while, they both co-existed in their respective lanes."}, {"c0e8": "Obviously, it’s 2017 and things are a bit different now with hip-hop music (Emo Rap Rules Everything Around Us). But, one thing remains: people still love the South. The players may have changed, but the game remains as strong as ever. I’ll listen to Kendrick and J. Cole for my soul food. But, when I’m in the club, I’m drinkin’ Henny and dancing to Gucci Mane."}, {"1323": "Greg Simms Jr. is a veteran writer, cultural observer, and sage who’s written for Ebony.com , HipHopDX.com , and YourTango.com. When he isn’t screaming “Ya’ll don’t know nuthin’ about the Fu Schnickens!!” to millennials, he’s thinking of clever ways to survive the Trump era. For podcast/radio/media guest appearances and opportunities, contact him: grgsmmsjr@gmail.com."}, {"80ba": "Please recommend the article if you enjoyed it. Be sure to follow us on Twitter and Facebook, username WeAreStillCrew."}], "content": "I Hated Southern Hip-Hop For Years. And I Was Wrong. Looking back at the 11 years of dominance that made me get over myself and start loving Southern hip-hop I hated Southern hip-hop music. Hated it. I hated “Laffy Taffy.” I hated “Lean Wit It, Rock Wit It.” I couldn’t stand that “Snap Yo Fingers” bullshit, and “It’s Goin’ Down” made me want to throw up. It was 2006 and, if you were a “real” Hip-Hop head like I was then, this part of that year was torture. My Rap music heroes were Rakim, Nas, Biggie, Pac, Cube, Jay-Z, ‘Face, and the Wu-Tang Clan. Mostly all East Coast artists, with a few West Coast G’s sprinkled in. Shit, Andre 3000 was also in my list and I did mention Scarface. All of them verbal were Jedi Knights, lyrical geniuses who could get busy over the best of beats. These were the guys who never got less than 3.5 mics in a Source review. And these dudes were my Rap music standards. So, you can imagine how I felt when in the spring of ’06, a new strain of Rap music started hitting the airways and MySpace pages. Songs with slow to mid-tempo beats with MCs who chanted — or in some cases, slurred — the hook of their songs for four minutes. The classic 16 bars model was being replaced with maybe eight bars. The word “trap” would get rhymed with…trap. Lyrical complexity was being replaced with deliberate simplicity. The rest of these songs were…instructions. Dance this way, lean that way. Drink that, shake this. By Rakim’s beard! What was going on with Hip-Hop?!! As you can deduce, Rap blogs and chat-rooms exploded. The consensus from hip-hop snobs — I was, proudly, and still am, one of them — was that the South was fucking up Rap music. In 2006, Jay -Z was dropping his comeback album, and we were marveling at the genius of the sophomore project from Kanye West. Common, with considerable help from Kanye, was releasing hot new music. There were quality albums coming from gifted rappers. Why was this…shit, polluting, and, running radio airwaves? While I seethed with outrage at the music industry for unleashing the dual viruses known as snap music and ringtone rap on the public, I got an offer from a close friend to help her with party promotion endeavors. She was a promoter, and she needed someone she could trust to help her, namely with public relations and communication issues. I accepted her offer and began to assist her. There were quality albums coming from gifted rappers. Why was this…shit, polluting, and, running radio airwaves? The first party I co-promoted was successful. For about an hour and a half. Due to our combined efforts, we were able to pretty much pack the house with people. The problem was we didn’t have that many people dancing. My promotions partner then walked up to the DJ, and asked him to play something, anything that would get people on the dance floor. The DJ told my partner that he was just warming up the crowd with some mild stuff. The real shit was coming right up. As soon as my partner told me that, the DJ dropped a song. It was “Snap Yo Fingers.” Then, the strangest thing happened. I bobbed my head. Hard. I didn’t want to bob my head. My head didn’t give a shit. Then, after I took a quick sip from my glass of Hennessy, I looked up at the party. It exploded. The place was a madhouse. I tried to look at the dance floor…but I couldn’t see it. It was packed with people. I was amazed. And humbled. Because, after two hours of gawking at people dancing, drinking more Henny, and frantically rocking my neck, I realized two important things: 1. Nothing gets the party jumping like Southern Hip-Hop I figured out that night and few more parties later, that no form of music can get a group of people lit like Rap music from the South. That shit compels people to dance. My theory about this? I think that, with the exception of a handful of Southern rappers, many rappers from that region were passed over by the major labels. So, because they may have had problems getting their stuff on the radio, they made music that would pop in nightclubs, bars, and strip clubs. That’s why their music explodes at parties and social functions. It’s ready-made to do just that. 2. If you like women, you should love Southern Rap I’m not trying to come across as creepy, so don’t take it this way. But, if you are a guy, and you like to see women dance sexy, you can’t do better than Southern hip-hop music. You can’t. Something mystical happens when women hear a Mike Will Made-It beat. Regular girls turn into strippers when this stuff comes on. Ever see a club full of women shaking their asses in unison? I have. And I’ll tell you that Wu-Tang’s music has never been able to do that. I have a good female friend of mine who’s an accomplished professional. She holds two college degrees and has had a “good” job for years. When Future comes on in the club, she’ll twerk like she lives in New Orleans’s Fifth Ward. And her hips do not lie when she’s getting it in on the dance-floor. After that fateful night, I realized that I had to accept that hip-hop music wasn’t just one thing. That it was lyrical mastery and boom bap, but, it was also crowd-pleasing trap anthems. And there was nothing wrong with that. Both kinds of music have their place and, for a while, they both co-existed in their respective lanes. Obviously, it’s 2017 and things are a bit different now with hip-hop music (Emo Rap Rules Everything Around Us). But, one thing remains: people still love the South. The players may have changed, but the game remains as strong as ever. I’ll listen to Kendrick and J. Cole for my soul food. But, when I’m in the club, I’m drinkin’ Henny and dancing to Gucci Mane. Greg Simms Jr. is a veteran writer, cultural observer, and sage who’s written for Ebony.com , HipHopDX.com , and YourTango.com. When he isn’t screaming “Ya’ll don’t know nuthin’ about the Fu Schnickens!!” to millennials, he’s thinking of clever ways to survive the Trump era. For podcast/radio/media guest appearances and opportunities, contact him: grgsmmsjr@gmail.com. Please recommend the article if you enjoyed it. Be sure to follow us on Twitter and Facebook, username WeAreStillCrew. ", "child": "2224_1\t2224_2"}