{"name": "2226", "parent": "", "title": "Damn, Kendrick", "sentences": [{"02d4": "Damn, Kendrick"}, {"2421": "Call him “lyrical” if you must. We prefer “athletic.” On his latest album, Kendrick Lamar is a transcendent rapper at his creative peak."}, {"609c": "Hip-hop’s reactionaries often glom on to Kendrick Lamar as a holy steward of all things “lyrical” in the 21st century. It’s pretty easy to hear why. For one, Kendrick loves concept albums. He appreciates saxophones and old, black music. He’s likely the last platinum-selling rapper who will feature George Clinton laying vocals for a G-funk intro. Kendrick often tells stories in relatively straightforward fashion, at least when compared to the intoxicated streams-of-consciousness that define trap and other party-rap styles. And then there’s the matter of his personal conservatism, evident in his Christian conviction and his frequently characterizing women as femme fatales in his songs."}, {"219f": "All of the above are valid points that distinguish Kendrick from most contemporary rap — specifically the type that’s coming from, or inspired by, Atlanta. Still, framing Kendrick Lamar as Chuck D’s heir is a tad dramatic, and it also sells the Compton rapper short. Kendrick may indeed admire Chuck D, but it’s Lil Wayne whom he knows by heart. And it is his fidelity to not just one generation within hip-hop but to the genre as a whole tradition and continuum that has made Kendrick a transcendent hip-hop figure."}, {"a0c7": "Kendrick’s latest album, Damn., is for sale on Friday, having leaked early Thursday night to wild anticipation. LeBron James shared a bit of the album via Instagram on Thursday morning, billing one song, “Element.,” as a “playoff vibe.” That’s a kind word of marketing on James’s part, no doubt, but it works as music criticism too; Kendrick’s rapping on the album is nothing short of athletic. He is wonderfully varied in form, and propulsive without end, so fuel efficient and reserved that he’s often able to craft an eight-bar run-on sentence as an understatement. Of course, he can pack a punch in two bars as well, such as on the aforementioned “Element.,” a hilariously aggressive song on which Kendrick raps: “Bitch, all my grandmas dead / So ain’t nobody praying for me, I’m on your head.” Damn. is “lyrical,” all right, if that’s the signifier you’re searching for, though it’s a pretty insipid way of saying that Kendrick is exceedingly focused and urgent in his delivery, even when a song concept requires him to be simply horny and/or drunk."}, {"8ec4": "Kendrick is “vital” in the serious sense, not only because he’s the last hope of an old guard, stylistically, but also because his songwriting is vigorously rooted in the nation’s present tense. Yes, he is on here rapping about President Trump, alongside U2, on “XXX.” And, as always, he’s haunted by two kinds of street violence: what he experienced as a kid, and what he’s now largely spared as a superstar rapper. But for all its talk of death and Donald Trump, Damn. is the most fun album Kendrick has made to date. On album closer “Duckworth.,” Kendrick hails God as a comedian and raps a sly biography of his manager Top Dawg, once a small-time hustler who nearly robbed Kendrick’s father."}, {"57db": "The track list may include a couple of cardinal sins as song titles, but the songs themselves are hardly so prudish; there’s a song called “Love.,” and a song called “Lust.,” and I’ll have you know that both are about lust. On “Loyalty.,” a rap ballad that features Rihanna singing low on a slurpy, screwed chorus, Kendrick flirts with an ease that we haven’t really heard from him since “Poetic Justice”: “Is it love for the streets when the lights get dark? / Is it unconditional when the ’Rari don’t start?”"}, {"94d1": "It’s a very different Kendrick Lamar album compared to To Pimp a Butterfly, which dared to fit in a lot of things, but probably couldn’t have fit a Rihanna feature. The funk and jazz orchestras that distinguished that album are gone, though the musicians whom Kendrick recruited to produce its soundscape — Sounwave, Terrace Martin, 9th Wonder — remain. On Damn., they keep an even, modern balance of trap hi-hats and real, live drums. Mike WILL Made-It, who produced “Humble.,” marks the biggest departure from the last jazz and bossa nova traces we heard on untitled unmastered. last spring, instead bringing his space-age booms to bear. Mike WILL produced “XXX.” (pronounced “X-rated”), which goes down smoother and bluesier than you might have feared when you first heard it was a U2 collaboration. It’s a song in which Kendrick and Bono commiserate over America’s imminent closure to the rest of the world as it also splinters internally, now a map of “barricaded blocks and borders.”"}, {"8e59": "Kendrick Lamar Is Back, and Right on TimeWith a new song, “The Heart Part 4,” the king stay the king. But who will he be next?theringer.com"}, {"4c4b": "In retrospect, perhaps I shouldn’t have been so surprised to see Bono in the mix this time around. Kendrick has spent the past six years reimagining — five times over at this point — what it means to make a great Compton rap album, having gone so far as to make a jazz opus instead with To Pimp a Butterfly. Compared to the rapper’s 2015 masterpiece, Damn. feels much less like an art project. It is far more engaged with contemporary hip-hop without having to capitulate to every SoundCloud trend. Damn. proves that the rapper’s right ear is turned toward the past only because his left ear faces hip-hop’s future."}], "content": "Damn, Kendrick Call him “lyrical” if you must. We prefer “athletic.” On his latest album, Kendrick Lamar is a transcendent rapper at his creative peak. Hip-hop’s reactionaries often glom on to Kendrick Lamar as a holy steward of all things “lyrical” in the 21st century. It’s pretty easy to hear why. For one, Kendrick loves concept albums. He appreciates saxophones and old, black music. He’s likely the last platinum-selling rapper who will feature George Clinton laying vocals for a G-funk intro. Kendrick often tells stories in relatively straightforward fashion, at least when compared to the intoxicated streams-of-consciousness that define trap and other party-rap styles. And then there’s the matter of his personal conservatism, evident in his Christian conviction and his frequently characterizing women as femme fatales in his songs. All of the above are valid points that distinguish Kendrick from most contemporary rap — specifically the type that’s coming from, or inspired by, Atlanta. Still, framing Kendrick Lamar as Chuck D’s heir is a tad dramatic, and it also sells the Compton rapper short. Kendrick may indeed admire Chuck D, but it’s Lil Wayne whom he knows by heart. And it is his fidelity to not just one generation within hip-hop but to the genre as a whole tradition and continuum that has made Kendrick a transcendent hip-hop figure. Kendrick’s latest album, Damn., is for sale on Friday, having leaked early Thursday night to wild anticipation. LeBron James shared a bit of the album via Instagram on Thursday morning, billing one song, “Element.,” as a “playoff vibe.” That’s a kind word of marketing on James’s part, no doubt, but it works as music criticism too; Kendrick’s rapping on the album is nothing short of athletic. He is wonderfully varied in form, and propulsive without end, so fuel efficient and reserved that he’s often able to craft an eight-bar run-on sentence as an understatement. Of course, he can pack a punch in two bars as well, such as on the aforementioned “Element.,” a hilariously aggressive song on which Kendrick raps: “Bitch, all my grandmas dead / So ain’t nobody praying for me, I’m on your head.” Damn. is “lyrical,” all right, if that’s the signifier you’re searching for, though it’s a pretty insipid way of saying that Kendrick is exceedingly focused and urgent in his delivery, even when a song concept requires him to be simply horny and/or drunk. Kendrick is “vital” in the serious sense, not only because he’s the last hope of an old guard, stylistically, but also because his songwriting is vigorously rooted in the nation’s present tense. Yes, he is on here rapping about President Trump, alongside U2, on “XXX.” And, as always, he’s haunted by two kinds of street violence: what he experienced as a kid, and what he’s now largely spared as a superstar rapper. But for all its talk of death and Donald Trump, Damn. is the most fun album Kendrick has made to date. On album closer “Duckworth.,” Kendrick hails God as a comedian and raps a sly biography of his manager Top Dawg, once a small-time hustler who nearly robbed Kendrick’s father. The track list may include a couple of cardinal sins as song titles, but the songs themselves are hardly so prudish; there’s a song called “Love.,” and a song called “Lust.,” and I’ll have you know that both are about lust. On “Loyalty.,” a rap ballad that features Rihanna singing low on a slurpy, screwed chorus, Kendrick flirts with an ease that we haven’t really heard from him since “Poetic Justice”: “Is it love for the streets when the lights get dark? / Is it unconditional when the ’Rari don’t start?” It’s a very different Kendrick Lamar album compared to To Pimp a Butterfly, which dared to fit in a lot of things, but probably couldn’t have fit a Rihanna feature. The funk and jazz orchestras that distinguished that album are gone, though the musicians whom Kendrick recruited to produce its soundscape — Sounwave, Terrace Martin, 9th Wonder — remain. On Damn., they keep an even, modern balance of trap hi-hats and real, live drums. Mike WILL Made-It, who produced “Humble.,” marks the biggest departure from the last jazz and bossa nova traces we heard on untitled unmastered. last spring, instead bringing his space-age booms to bear. Mike WILL produced “XXX.” (pronounced “X-rated”), which goes down smoother and bluesier than you might have feared when you first heard it was a U2 collaboration. It’s a song in which Kendrick and Bono commiserate over America’s imminent closure to the rest of the world as it also splinters internally, now a map of “barricaded blocks and borders.” Kendrick Lamar Is Back, and Right on TimeWith a new song, “The Heart Part 4,” the king stay the king. But who will he be next?theringer.com In retrospect, perhaps I shouldn’t have been so surprised to see Bono in the mix this time around. Kendrick has spent the past six years reimagining — five times over at this point — what it means to make a great Compton rap album, having gone so far as to make a jazz opus instead with To Pimp a Butterfly. Compared to the rapper’s 2015 masterpiece, Damn. feels much less like an art project. It is far more engaged with contemporary hip-hop without having to capitulate to every SoundCloud trend. Damn. proves that the rapper’s right ear is turned toward the past only because his left ear faces hip-hop’s future. ", "child": "2226_1\t2226_2\t2226_3\t2226_4\t2226_5\t2226_6\t2226_7\t2226_8\t2226_9\t2226_10\t2226_11\t2226_12\t2226_13\t2226_14\t2226_15\t2226_16"}