{"name": "2229", "parent": "", "title": "What Kind of ‘Star Wars’ Trailer Would Convince You Not to See the Movie?", "sentences": [{"8d29": "What Kind of ‘Star Wars’ Trailer Would Convince You Not to See the Movie?"}, {"7298": "The new teaser for ‘The Last Jedi’ is light on plot, but we’re all in. It got us wondering: Is it possible to ruin a ‘Star Wars’ trailer? We took our best shot."}, {"9f79": "The first teaser for Star Wars: The Last Jedi, released Friday, got us wondering: Is there anything these movies could include in a teaser that wouldn’t leave us frothing and hyped to buy tickets? Turns out there are a couple of Star Wars deal breakers."}, {"ed5e": "Alison Herman: If they explode BB-8."}, {"98e3": "Rubie Edmondson: If a Star Wars trailer teased the death of BB-8, I would not go see the movie, for the same reasons I would not see a movie whose trailer killed off puppies or kittens."}, {"204d": "Sean Yoo: If it talks only about midi-chlorians."}, {"d187": "Jason Concepcion: If the trailer depicted a Jerry Maguire–style rom-com in which a ruined Luke Skywalker kinda, sorta falls for his new trainee, I’d be out."}, {"037e": "Amanda Dobbins: Jason, I’d definitely see that and make you sit next to me. And we’d have a great time."}, {"60a5": "Sam Schube: If they kill — or even talk about killing! — any more baby Jedis."}, {"3aa9": "Ben Lindbergh: If the trailer is a phishing scam that includes a link to an official-looking site that asks me to enter my personal info so I can see more of the movie. I’d do it, because it’s Star Wars. Lucasfilm would steal my identity and empty my bank account, leaving me destitute. Over the next year, I’d painstakingly put the pieces of my life back together with the goal of being able to afford a ticket to Episode IX."}, {"6584": "‘The Last Jedi’ Strikes Back With Its First TeaserLuke Skywalker is back, and so is ‘Star Wars.’ Is it Christmas yet?theringer.com"}, {"d2af": "Claire McNear: If one more character has a rattail (or Padawan braid, whatever), so help me God. Or if the trailer included Hayden Christensen."}, {"7f5f": "Jack McCluskey: If they took a page out of the DC book: Be incredibly self-serious about every plot point. Make formerly beloved characters borderline intolerable. And smother every scene in darkness, making it hard to even tell what’s going on. Or bring back Hayden Christensen."}, {"df7a": "Lindbergh: Artist Stephen Byrne already did it:"}, {"3a5e": "Andrew Gruttadaro: If it’s revealed that Han Solo was alive but suffering from memory loss and working with Kylo Ren, and the trailer ended with Han stepping out of an X-wing and firing a laser gun at Leia, before cutting to Leia explaining to Rey, “You don’t turn your back on family.”"}, {"37db": "Ugh, who am I kidding? I would absolutely see that movie."}, {"b4ca": "Michael Baumann: God, I went to a J.J. Abrams–directed Star Wars film post–Star Trek Into Darkness. I’m legitimately not sure the franchise can talk me out of it. Maybe if it connected it to the Marvel Cinematic Universe, like I’m 30 percent sure is going to happen in the next 10 years."}, {"55b0": "David Shoemaker: CGI Leia doing flippy lightsaber fighting like Yoda in Attack of the Clones would make me question a lot."}, {"846e": "Schube: If all of the characters are creepy CGI reconstructions of beloved and long-deceased actors, I’m walking."}, {"9c8b": "Jason Gallagher: If it looked like this:"}, {"0d85": "Long pan across the starry sky."}, {"bc6f": "(FROM THE MINDS OF ZACK SNYDER)"}, {"82d2": "A distant voice cries out, “Use the force.”"}, {"d74f": "(AND FATHER JOHN MISTY)"}, {"2777": "Ewan McGregor awakes from a deep sleep. He’s startled. He’s sweating."}, {"8ae9": "“Was it … all a dream?”"}, {"f9ce": "(RECORD SCRATCH)"}, {"e1d5": "♬ SOMEBODY ONCE TOLD ME THE WOOOOORLD IS GONNA ROLL ME ♬"}, {"4132": "(STAR WARS TITLE SCREEN)"}, {"8d94": "I guess the answer is nothing because I’d totally see the hell out of that movie."}], "content": "What Kind of ‘Star Wars’ Trailer Would Convince You Not to See the Movie? The new teaser for ‘The Last Jedi’ is light on plot, but we’re all in. It got us wondering: Is it possible to ruin a ‘Star Wars’ trailer? We took our best shot. The first teaser for Star Wars: The Last Jedi, released Friday, got us wondering: Is there anything these movies could include in a teaser that wouldn’t leave us frothing and hyped to buy tickets? Turns out there are a couple of Star Wars deal breakers. Alison Herman: If they explode BB-8. Rubie Edmondson: If a Star Wars trailer teased the death of BB-8, I would not go see the movie, for the same reasons I would not see a movie whose trailer killed off puppies or kittens. Sean Yoo: If it talks only about midi-chlorians. Jason Concepcion: If the trailer depicted a Jerry Maguire–style rom-com in which a ruined Luke Skywalker kinda, sorta falls for his new trainee, I’d be out. Amanda Dobbins: Jason, I’d definitely see that and make you sit next to me. And we’d have a great time. Sam Schube: If they kill — or even talk about killing! — any more baby Jedis. Ben Lindbergh: If the trailer is a phishing scam that includes a link to an official-looking site that asks me to enter my personal info so I can see more of the movie. I’d do it, because it’s Star Wars. Lucasfilm would steal my identity and empty my bank account, leaving me destitute. Over the next year, I’d painstakingly put the pieces of my life back together with the goal of being able to afford a ticket to Episode IX. ‘The Last Jedi’ Strikes Back With Its First TeaserLuke Skywalker is back, and so is ‘Star Wars.’ Is it Christmas yet?theringer.com Claire McNear: If one more character has a rattail (or Padawan braid, whatever), so help me God. Or if the trailer included Hayden Christensen. Jack McCluskey: If they took a page out of the DC book: Be incredibly self-serious about every plot point. Make formerly beloved characters borderline intolerable. And smother every scene in darkness, making it hard to even tell what’s going on. Or bring back Hayden Christensen. Lindbergh: Artist Stephen Byrne already did it: Andrew Gruttadaro: If it’s revealed that Han Solo was alive but suffering from memory loss and working with Kylo Ren, and the trailer ended with Han stepping out of an X-wing and firing a laser gun at Leia, before cutting to Leia explaining to Rey, “You don’t turn your back on family.” Ugh, who am I kidding? I would absolutely see that movie. Michael Baumann: God, I went to a J.J. Abrams–directed Star Wars film post–Star Trek Into Darkness. I’m legitimately not sure the franchise can talk me out of it. Maybe if it connected it to the Marvel Cinematic Universe, like I’m 30 percent sure is going to happen in the next 10 years. David Shoemaker: CGI Leia doing flippy lightsaber fighting like Yoda in Attack of the Clones would make me question a lot. Schube: If all of the characters are creepy CGI reconstructions of beloved and long-deceased actors, I’m walking. Jason Gallagher: If it looked like this: Long pan across the starry sky. (FROM THE MINDS OF ZACK SNYDER) A distant voice cries out, “Use the force.” (AND FATHER JOHN MISTY) Ewan McGregor awakes from a deep sleep. He’s startled. He’s sweating. “Was it … all a dream?” (RECORD SCRATCH) ♬ SOMEBODY ONCE TOLD ME THE WOOOOORLD IS GONNA ROLL ME ♬ (STAR WARS TITLE SCREEN) I guess the answer is nothing because I’d totally see the hell out of that movie. ", "child": "2229_1\t2229_2\t2229_3\t2229_4\t2229_5"}