{"name": "223", "parent": "", "title": "How to make compound interest work for you?", "sentences": [{"0f61": "How to make compound interest work for you?"}, {"27cd": "The answer is pretty simple"}, {"d7ae": "Source: Business Insider"}, {"e711": "The king was pleased. He had every reason to feel this way. One of his subjects had invented a sport that had become his new favorite pastime. The game went by the name of chess."}, {"6848": "The inventor was asked to appear before the king. The generous king asked the inventor to name his reward. Anything the inventor desired."}, {"0672": "The inventor’s answer shocked the king."}, {"d861": "“I am a simple man of few wants, he said. My needs are a few. Give me one grain of rice for the first square of the chessboard, two for the second, four for the third and so on. Each square having double the number of rice than the previous square. This is all I ask of thee, O generous king.”"}, {"026e": "The king was offended. Here he was, a mighty emperor, asking this peasant to ask him for anything he desired and all he was asking for was a few grains of rice. Surely this was an affront!"}, {"52f6": "“I mean thee no disrespect O mighty king. This is all my heart desires and all that I need.”"}, {"004b": "The king calmed down. He ordered his minister,"}, {"e083": "“Give this fool what he wants and let us be done with his request. Take him out of my sight”"}, {"bb90": "A week passed. Still no sign of the minister. He was asked to appear before the king immediately."}, {"d922": "“Explain your absence”, said the irritated king."}, {"7ea7": "“We are still trying to procure the required number of rice to fill the chessboard, Your majesty. We have sent people far and wide to collect rice but we still haven’t been able to procure enough rice”"}, {"0e12": "The minister should not have even bothered. The required amount of rice has not been produced in the history of mankind."}, {"6c62": "For the mathematically inclined, the number of grains of rice required to fill the chess board is 18,446,744,073,709,551,615."}, {"fe7e": "Such is the power of compound interest."}, {"0ebf": "We all know about it. Have read numerous articles about it. The magic of compound interest."}, {"2190": "If you think you have grasped it, try this."}, {"d31c": "Fold an ordinary piece of paper in half 42 times. What is the resultant height?"}, {"2d6e": "So, you think you can think? Try this!How evolution actually comes in the way of our thinkingmedium.com"}, {"6e81": "If you got the answer right, great! If you got it wrong, not to worry! Most of us have trouble comprehending the answer even though we know the math behind it."}, {"3ff7": "Evolution has programmed our brains to think linearly. Which is great since this is exactly what has helped us survive and thrive as a species."}, {"5e14": "But the downside is that this very same linear thinking comes in our way of truly understanding and appreciating the power of compound interest."}, {"0d85": "An understanding of the powers of compound interest is the one thing that is essential not only to create wealth, but also to change our entire perspective about money. And since so much of our daily life is spent in the pursuit of money, an appreciation of the working of compound interest, also changes our perspective and attitude towards life."}, {"6294": "The legend of the chess board and a grain of rice may or may not be true. And nobody has been able to fold a piece of paper more than 12 times in succession."}, {"f5f4": "But the following story certainly is true. It happened before our very eyes and is happening even as you read this post."}, {"e180": "Source: Marketwatch"}, {"467e": "So, Warren Buffet is rich. We already knew that. What’s the big deal?"}, {"2678": "The important thing about the above graph is not the huge skyscrapers on the right hand side, but the barely visible columns on the left."}, {"aa38": "Between the ages of 30 and 33, Warren Buffet’s networth increased by two and a half times. It became almost 5 times from the age of 35 and 43 — from 7 million to 34 million dollars."}, {"3e33": "These are some serious numbers. 2.5 times increase and 5 times increase is nothing to sneeze at! But yet, you can rarely make out these columns in the graph."}, {"aa87": "376 million at the age of 52 is a big deal! But yet its barely a dot on the graph."}, {"747b": "And therein lies the lesson."}, {"c951": "Compound interest is a tail heavy process. You really start seeing the results only after a certain period of time."}, {"298c": "The more you wait, the more you get. As simple as that."}, {"1a7e": "And that’s the reason why Warren Buffet made most of his net worth after the age of 60."}, {"1144": "Its also the reason why the 42nd fold of paper takes you to the moon but that one extra fold takes you to the moon and back."}, {"62c7": "What about you? Are you giving your investments enough time to benefit from the power of compounding?"}, {"415f": "If you liked this article, click the💚 below so that more people can read it. Thanks for reading!"}], "content": "How to make compound interest work for you? The answer is pretty simple Source: Business Insider The king was pleased. He had every reason to feel this way. One of his subjects had invented a sport that had become his new favorite pastime. The game went by the name of chess. The inventor was asked to appear before the king. The generous king asked the inventor to name his reward. Anything the inventor desired. The inventor’s answer shocked the king. “I am a simple man of few wants, he said. My needs are a few. Give me one grain of rice for the first square of the chessboard, two for the second, four for the third and so on. Each square having double the number of rice than the previous square. This is all I ask of thee, O generous king.” The king was offended. Here he was, a mighty emperor, asking this peasant to ask him for anything he desired and all he was asking for was a few grains of rice. Surely this was an affront! “I mean thee no disrespect O mighty king. This is all my heart desires and all that I need.” The king calmed down. He ordered his minister, “Give this fool what he wants and let us be done with his request. Take him out of my sight” A week passed. Still no sign of the minister. He was asked to appear before the king immediately. “Explain your absence”, said the irritated king. “We are still trying to procure the required number of rice to fill the chessboard, Your majesty. We have sent people far and wide to collect rice but we still haven’t been able to procure enough rice” The minister should not have even bothered. The required amount of rice has not been produced in the history of mankind. For the mathematically inclined, the number of grains of rice required to fill the chess board is 18,446,744,073,709,551,615. Such is the power of compound interest. We all know about it. Have read numerous articles about it. The magic of compound interest. If you think you have grasped it, try this. Fold an ordinary piece of paper in half 42 times. What is the resultant height? So, you think you can think? Try this!How evolution actually comes in the way of our thinkingmedium.com If you got the answer right, great! If you got it wrong, not to worry! Most of us have trouble comprehending the answer even though we know the math behind it. Evolution has programmed our brains to think linearly. Which is great since this is exactly what has helped us survive and thrive as a species. But the downside is that this very same linear thinking comes in our way of truly understanding and appreciating the power of compound interest. An understanding of the powers of compound interest is the one thing that is essential not only to create wealth, but also to change our entire perspective about money. And since so much of our daily life is spent in the pursuit of money, an appreciation of the working of compound interest, also changes our perspective and attitude towards life. The legend of the chess board and a grain of rice may or may not be true. And nobody has been able to fold a piece of paper more than 12 times in succession. But the following story certainly is true. It happened before our very eyes and is happening even as you read this post. Source: Marketwatch So, Warren Buffet is rich. We already knew that. What’s the big deal? The important thing about the above graph is not the huge skyscrapers on the right hand side, but the barely visible columns on the left. Between the ages of 30 and 33, Warren Buffet’s networth increased by two and a half times. It became almost 5 times from the age of 35 and 43 — from 7 million to 34 million dollars. These are some serious numbers. 2.5 times increase and 5 times increase is nothing to sneeze at! But yet, you can rarely make out these columns in the graph. 376 million at the age of 52 is a big deal! But yet its barely a dot on the graph. And therein lies the lesson. Compound interest is a tail heavy process. You really start seeing the results only after a certain period of time. The more you wait, the more you get. As simple as that. And that’s the reason why Warren Buffet made most of his net worth after the age of 60. Its also the reason why the 42nd fold of paper takes you to the moon but that one extra fold takes you to the moon and back. What about you? Are you giving your investments enough time to benefit from the power of compounding? If you liked this article, click the💚 below so that more people can read it. Thanks for reading! ", "child": "223_1\t223_2\t223_3\t223_4\t223_5\t223_6223_1\t223_2\t223_3\t223_4\t223_5\t223_6223_1\t223_2\t223_3\t223_4\t223_5\t223_6223_1\t223_2\t223_3\t223_4\t223_5\t223_6223_1\t223_2\t223_3\t223_4\t223_5\t223_6223_1\t223_2\t223_3\t223_4\t223_5\t223_6"}