{"name": "2230", "parent": "", "title": "In Memory of Michael Ballhaus, Cinematography Legend", "sentences": [{"906d": "In Memory of Michael Ballhaus, Cinematography Legend"}, {"c797": "He cut his teeth with German auteur Rainer Werner Fassbinder and became a Hollywood staple alongside Martin Scorsese. That ‘Goodfellas’ Copacabana scene is but one highlight of Ballhaus’s sterling legacy."}, {"aec7": "Michelle Pfeiffer glowing crimson with passion in The Age of Innocence. The Technicolor majesty of Prince, somehow more vibrant in the black-and-white textures of Under the Cherry Moon. Joe Pesci and Ray Liotta, of Goodfellas, digging up a guy named Billy Batts as the tail lights of their car make the night sky rage red like embers."}, {"30d1": "This is all the work of German cinematographer Michael Ballhaus, who died on Tuesday evening at 81. Ballhaus was the director of photography for more than 120 projects, but he’s most famous for his long-term collaborations with two of cinema’s most masterful stylists and storytellers: Scorsese, with whom he made seven movies, and the radical German auteur Rainer Werner Fassbinder, with whom he made a whopping 16. Ballhaus worked with other major directors, too, including a few notable American ones: James L. Brooks (Broadcast News), Mike Nichols (Working Girl), Nancy Meyers (Something’s Gotta Give), Francis Ford Coppola (Dracula), and Robert Redford (Quiz Show)."}, {"476c": "He may have eventually proved himself essential to Hollywood movies, but Ballhaus cut his teeth on the small, experimental sets of Fassbinder, who, he later said, “had the ability to be very fast in deciding what he wanted, but [wasn’t] so good at preparing what he wanted to do. So his ideas came on the day.” Fassbinder — an avowed student of the films of Douglas Sirk, one of Hollywood’s most extravagantly stylish melodramatists — wanted his own movies to sparkle with the richly saturated color of big Hollywood movies like Sirk’s, but on smaller budgets. Making the job even harder, Fassbinder was also known to be profoundly temperamental. In one instance, Ballhaus had to defend himself against Fassbinder’s exacting, impractical demands: “I was mad at him because, I said, I have my own timing for this shot. … I’m not a machine, and if you don’t like that, hire somebody else.” It’s a reminder that, though we often credit directors for the visual wonder of their movies, their work is the result of a deep collaboration with their cinematographers, to say nothing of the gaffers, light designers, camerapeople, and the like."}, {"afde": "It’s no wonder, given their influence on his work with Fassbinder, that Ballhaus would eventually wind up working on actual Hollywood pictures. It should surprise us even less that he wound up working with Scorsese, who’s as much a film historian and pure lover of movies as he is a filmmaker. Ballhaus’s collaboration with Scorsese, who’s best known for his gangster movies despite hardly sticking to that genre, is a little ironic. “Marty is my favorite director because he’s the most visual filmmaker I’ve worked with in America,” Ballhaus once said, “but if you have a philosophy about violence, you’d better put it aside when you work with him. In general, I’m not a big fan of violence, but in Marty’s case, I accept it.”"}, {"bf9b": "What set Scorsese apart for Ballhaus were the ideas underlying that violence, and the visual intelligence Scorsese’s movies use to depict it. “Sometimes you can feel hurt or insulted by the violence, but the world Marty is portraying is violent, and the way he presents those scenes tells you something about the characters. So I see a reason for it in terms of the story.”"}, {"3f69": "Ballhaus’s images are not merely gorgeous; even when depicting violence with the candor required by Scorsese’s work, they have an expressive mastery of tone that gives the inner worlds of characters outer life. That, and not the mere technical feat, is what distinguishes career-best accomplishments like the famous tracking shot at the Copa — one of the visual centerpieces of Goodfellas — from its scores of imitators. That’s style. Ballhaus had a lot — and movies are all the better for it."}, {"2217": "An earlier version of this piece misstated the name of filmmaker Rainer Werner (not Maria) Fassbinder."}], "content": "In Memory of Michael Ballhaus, Cinematography Legend He cut his teeth with German auteur Rainer Werner Fassbinder and became a Hollywood staple alongside Martin Scorsese. That ‘Goodfellas’ Copacabana scene is but one highlight of Ballhaus’s sterling legacy. Michelle Pfeiffer glowing crimson with passion in The Age of Innocence. The Technicolor majesty of Prince, somehow more vibrant in the black-and-white textures of Under the Cherry Moon. Joe Pesci and Ray Liotta, of Goodfellas, digging up a guy named Billy Batts as the tail lights of their car make the night sky rage red like embers. This is all the work of German cinematographer Michael Ballhaus, who died on Tuesday evening at 81. Ballhaus was the director of photography for more than 120 projects, but he’s most famous for his long-term collaborations with two of cinema’s most masterful stylists and storytellers: Scorsese, with whom he made seven movies, and the radical German auteur Rainer Werner Fassbinder, with whom he made a whopping 16. Ballhaus worked with other major directors, too, including a few notable American ones: James L. Brooks (Broadcast News), Mike Nichols (Working Girl), Nancy Meyers (Something’s Gotta Give), Francis Ford Coppola (Dracula), and Robert Redford (Quiz Show). He may have eventually proved himself essential to Hollywood movies, but Ballhaus cut his teeth on the small, experimental sets of Fassbinder, who, he later said, “had the ability to be very fast in deciding what he wanted, but [wasn’t] so good at preparing what he wanted to do. So his ideas came on the day.” Fassbinder — an avowed student of the films of Douglas Sirk, one of Hollywood’s most extravagantly stylish melodramatists — wanted his own movies to sparkle with the richly saturated color of big Hollywood movies like Sirk’s, but on smaller budgets. Making the job even harder, Fassbinder was also known to be profoundly temperamental. In one instance, Ballhaus had to defend himself against Fassbinder’s exacting, impractical demands: “I was mad at him because, I said, I have my own timing for this shot. … I’m not a machine, and if you don’t like that, hire somebody else.” It’s a reminder that, though we often credit directors for the visual wonder of their movies, their work is the result of a deep collaboration with their cinematographers, to say nothing of the gaffers, light designers, camerapeople, and the like. It’s no wonder, given their influence on his work with Fassbinder, that Ballhaus would eventually wind up working on actual Hollywood pictures. It should surprise us even less that he wound up working with Scorsese, who’s as much a film historian and pure lover of movies as he is a filmmaker. Ballhaus’s collaboration with Scorsese, who’s best known for his gangster movies despite hardly sticking to that genre, is a little ironic. “Marty is my favorite director because he’s the most visual filmmaker I’ve worked with in America,” Ballhaus once said, “but if you have a philosophy about violence, you’d better put it aside when you work with him. In general, I’m not a big fan of violence, but in Marty’s case, I accept it.” What set Scorsese apart for Ballhaus were the ideas underlying that violence, and the visual intelligence Scorsese’s movies use to depict it. “Sometimes you can feel hurt or insulted by the violence, but the world Marty is portraying is violent, and the way he presents those scenes tells you something about the characters. So I see a reason for it in terms of the story.” Ballhaus’s images are not merely gorgeous; even when depicting violence with the candor required by Scorsese’s work, they have an expressive mastery of tone that gives the inner worlds of characters outer life. That, and not the mere technical feat, is what distinguishes career-best accomplishments like the famous tracking shot at the Copa — one of the visual centerpieces of Goodfellas — from its scores of imitators. That’s style. Ballhaus had a lot — and movies are all the better for it. An earlier version of this piece misstated the name of filmmaker Rainer Werner (not Maria) Fassbinder. ", "child": "2230_1"}