{"name": "2233", "parent": "", "title": "‘Win It All’ Is a Small Gamble, but a Big Reward", "sentences": [{"ef33": "‘Win It All’ Is a Small Gamble, but a Big Reward"}, {"e289": "Director Joe Swanberg may keep things simple and low key, but that doesn’t mean he skimps on the storytelling. His new Netflix original movie, starring frequent collaborator Jake Johnson, is another rich example of his trademark comedic style."}, {"c3b9": "“Oh, fuck me,” says Eddie, grabbing stacks of money by the fistful. “Oh no. Oh no. Oh no.”"}, {"50b4": "Win It All, a new movie now streaming on Netflix, is about a gambling addict. Given the usual goings-on in gambling movies, with someone always either about to blow their life’s fortune or be killed for the debts they’ve accordingly racked up, you’d think a black duffel bag full of money would be a good thing. That’s sort of the case for Eddie, played by New Girl’s Jake Johnson, but not really."}, {"4ee9": "To be clear, it’s not as if he couldn’t use the money. He starts the movie walking into a gambling spot with thick pockets and leaving so poor he can’t even afford bodega coffee the next morning. But the money in the duffel bag isn’t what’s supposed to get him in the black: holding the money is. Eddie’s made a deal to mind a former creditor’s bag until the guy gets out of jail in six to nine months. It’s a deal that’d earn Eddie 10 grand — far less than what’s in the bag, we gather, but enough for a fresh start. Even better, there’s really only one condition — scratch that, more like an extremely good piece of advice: Don’t open the bag."}, {"90a5": "Eddie opens the bag."}, {"aef1": "It’d have been better for Eddie not to do this, for all sorts of reasons, including the known fact that he’s a gambling addict. But this is a Joe Swanberg movie. And a comedy, no less. So of course Eddie opens the bag. Of course it’s full of his great temptation. And of course he gambles it all away."}, {"e9c2": "Better to reel you in with details like these, spiced up with a sense of genre and suspense, as opposed to the kinds of details people usually use to describe Swanberg movies. They’re low-budget, simple, and largely improvised, the story usually goes: the end. Thirty films into his career as a director, those descriptors remain true, even as a recent uptick in notoriety has won Swanberg bigger budgets, bigger-name actors (Lena Dunham, Olivia Wilde, and Anna Kendrick, among others) and swanky partnerships like his current deal with Netflix. But Win It All is a sleek, enjoyable reminder that Swanberg is a notable storyteller, too, a director who uses humor and coincidence to throw the lives of his impulsive characters hilariously out of whack."}, {"ef97": "Win It All begins as an enjoyable-enough comedy that gets richer, and more vexing, with each beat. Despite the terror of gradually losing more and more of the money he’s supposed to be holding (at one point, he’s over $57,000 down), Eddie meets and falls for a woman named Eva (Aislinn Derbez) and even lands himself a job working for his brother (Joe Lo Truglio), who runs their father’s landscaping business. (Keegan-Michael Key also costars in a smaller role as Eddie’s hilariously put-upon Gamblers Anonymous sponsor.) Eddie’s brother knows he’s in debt but doesn’t know the extent of it. Eva, meanwhile, has no idea. It all feels precariously interconnected — Eddie is gambling with more than money here. Swanberg and his actors make every turn in Eddie’s life feel like it’s colliding with the next. It all piles up: the debt, the duffel bag, the lucky break, the girl, the loss of it all, the chance to win it all back."}, {"3e00": "‘Easy’ Is Auteur TV Done RightAnd Joe Swanberg’s most polished work to datetheringer.com"}, {"68a1": "I’ve unsurprisingly found it hard to convince friends that Swanberg’s movies are worth more than an “And?” or a polite “Cool.” His ambition is hard to measure; his films are deliberately humble fare. But they make me rethink what’s at stake in a director’s style, particularly directors with little money to spend on fancy tricks. Style is a matter of how a director films two people talking to each other, how he/she works with actors, editors, cinematographers, and other collaborators to think through the information of a scene."}, {"924d": "Swanberg is traditionally an ultra-low-budget filmmaker: Eddie loses more money in the course of Win It All than Swanberg’s early movies cost to make. Until relatively recently, seemingly all Swanberg could afford for his characters to do, really, is talk it out. His shooting style has always made his characters’ conflicts feel humorously erratic, his camera becoming a bit player in the action. Swanberg alternates between swinging the camera back and forth between people as they hammer things out and jump-cutting to isolate the most incisive bits. Our first impressions of Eddie in Win It All come at us like a quick cascade of bad decisions. That never really changes; we don’t watch Swanberg’s movie so much as fly through it, thinking “Oof” every time Eddie messes up."}, {"ebfe": "Joe Swanberg (Getty Imagese)"}, {"e4dd": "Given that Swanberg is now on his second project with Netflix (and currently filming Season 2 of the first, Easy), the choice to remain small, in scope as well as in aesthetic, is itself a matter of style. Even with a budget, Swanberg’s still interested in keeping things simple. When you reduce characters and their stories down to their essentials, what you’re left with are questions of behavior. Impulse. Swanberg writes some of the most frustratingly impulsive comedic characters in recent memory. But the lesson of his movies is that they are who they are. Eddie can’t not gamble away the money a known criminal is stashing at his house, and he can’t not try to win it all back the same way he lost it. Swanberg is a fatalist, but he’s not mean about it. He films his movies with the good humor of someone watching comically misguided people navigate their natural habitats, and he never lets the characters become too broad."}, {"1c2a": "That’s what’s special about Johnson, who cowrote the script, and who always lends his performances a shaggy likability. It’s a particularly effective trait when Swanberg is around to take advantage of it. This is their third collaboration together, after Drinking Buddies and Digging for Fire. Johnson is always a little bit of a loser in Swanberg’s movies; even when it’s not in the script, it’s there in his timing, and in the slightly sunken charisma of his face. He’s not playing the gambling man you see in movies: He’s playing the gambler down the street."}, {"0b78": "Win It All is a chance to see a handful of great comic actors, Johnson chief among them, milk Swanberg’s low-key narrative designs for all the comedy they’re worth. The movie itself is no big gamble — but as always, Swanberg’s style is rich enough that it doesn’t have to be."}], "content": "‘Win It All’ Is a Small Gamble, but a Big Reward Director Joe Swanberg may keep things simple and low key, but that doesn’t mean he skimps on the storytelling. His new Netflix original movie, starring frequent collaborator Jake Johnson, is another rich example of his trademark comedic style. “Oh, fuck me,” says Eddie, grabbing stacks of money by the fistful. “Oh no. Oh no. Oh no.” Win It All, a new movie now streaming on Netflix, is about a gambling addict. Given the usual goings-on in gambling movies, with someone always either about to blow their life’s fortune or be killed for the debts they’ve accordingly racked up, you’d think a black duffel bag full of money would be a good thing. That’s sort of the case for Eddie, played by New Girl’s Jake Johnson, but not really. To be clear, it’s not as if he couldn’t use the money. He starts the movie walking into a gambling spot with thick pockets and leaving so poor he can’t even afford bodega coffee the next morning. But the money in the duffel bag isn’t what’s supposed to get him in the black: holding the money is. Eddie’s made a deal to mind a former creditor’s bag until the guy gets out of jail in six to nine months. It’s a deal that’d earn Eddie 10 grand — far less than what’s in the bag, we gather, but enough for a fresh start. Even better, there’s really only one condition — scratch that, more like an extremely good piece of advice: Don’t open the bag. Eddie opens the bag. It’d have been better for Eddie not to do this, for all sorts of reasons, including the known fact that he’s a gambling addict. But this is a Joe Swanberg movie. And a comedy, no less. So of course Eddie opens the bag. Of course it’s full of his great temptation. And of course he gambles it all away. Better to reel you in with details like these, spiced up with a sense of genre and suspense, as opposed to the kinds of details people usually use to describe Swanberg movies. They’re low-budget, simple, and largely improvised, the story usually goes: the end. Thirty films into his career as a director, those descriptors remain true, even as a recent uptick in notoriety has won Swanberg bigger budgets, bigger-name actors (Lena Dunham, Olivia Wilde, and Anna Kendrick, among others) and swanky partnerships like his current deal with Netflix. But Win It All is a sleek, enjoyable reminder that Swanberg is a notable storyteller, too, a director who uses humor and coincidence to throw the lives of his impulsive characters hilariously out of whack. Win It All begins as an enjoyable-enough comedy that gets richer, and more vexing, with each beat. Despite the terror of gradually losing more and more of the money he’s supposed to be holding (at one point, he’s over $57,000 down), Eddie meets and falls for a woman named Eva (Aislinn Derbez) and even lands himself a job working for his brother (Joe Lo Truglio), who runs their father’s landscaping business. (Keegan-Michael Key also costars in a smaller role as Eddie’s hilariously put-upon Gamblers Anonymous sponsor.) Eddie’s brother knows he’s in debt but doesn’t know the extent of it. Eva, meanwhile, has no idea. It all feels precariously interconnected — Eddie is gambling with more than money here. Swanberg and his actors make every turn in Eddie’s life feel like it’s colliding with the next. It all piles up: the debt, the duffel bag, the lucky break, the girl, the loss of it all, the chance to win it all back. ‘Easy’ Is Auteur TV Done RightAnd Joe Swanberg’s most polished work to datetheringer.com I’ve unsurprisingly found it hard to convince friends that Swanberg’s movies are worth more than an “And?” or a polite “Cool.” His ambition is hard to measure; his films are deliberately humble fare. But they make me rethink what’s at stake in a director’s style, particularly directors with little money to spend on fancy tricks. Style is a matter of how a director films two people talking to each other, how he/she works with actors, editors, cinematographers, and other collaborators to think through the information of a scene. Swanberg is traditionally an ultra-low-budget filmmaker: Eddie loses more money in the course of Win It All than Swanberg’s early movies cost to make. Until relatively recently, seemingly all Swanberg could afford for his characters to do, really, is talk it out. His shooting style has always made his characters’ conflicts feel humorously erratic, his camera becoming a bit player in the action. Swanberg alternates between swinging the camera back and forth between people as they hammer things out and jump-cutting to isolate the most incisive bits. Our first impressions of Eddie in Win It All come at us like a quick cascade of bad decisions. That never really changes; we don’t watch Swanberg’s movie so much as fly through it, thinking “Oof” every time Eddie messes up. Joe Swanberg (Getty Imagese) Given that Swanberg is now on his second project with Netflix (and currently filming Season 2 of the first, Easy), the choice to remain small, in scope as well as in aesthetic, is itself a matter of style. Even with a budget, Swanberg’s still interested in keeping things simple. When you reduce characters and their stories down to their essentials, what you’re left with are questions of behavior. Impulse. Swanberg writes some of the most frustratingly impulsive comedic characters in recent memory. But the lesson of his movies is that they are who they are. Eddie can’t not gamble away the money a known criminal is stashing at his house, and he can’t not try to win it all back the same way he lost it. Swanberg is a fatalist, but he’s not mean about it. He films his movies with the good humor of someone watching comically misguided people navigate their natural habitats, and he never lets the characters become too broad. That’s what’s special about Johnson, who cowrote the script, and who always lends his performances a shaggy likability. It’s a particularly effective trait when Swanberg is around to take advantage of it. This is their third collaboration together, after Drinking Buddies and Digging for Fire. Johnson is always a little bit of a loser in Swanberg’s movies; even when it’s not in the script, it’s there in his timing, and in the slightly sunken charisma of his face. He’s not playing the gambling man you see in movies: He’s playing the gambler down the street. Win It All is a chance to see a handful of great comic actors, Johnson chief among them, milk Swanberg’s low-key narrative designs for all the comedy they’re worth. The movie itself is no big gamble — but as always, Swanberg’s style is rich enough that it doesn’t have to be. ", "child": "2233_1"}