{"name": "2236", "parent": "", "title": "Who Is the Fastest and Most Furious in ‘Fast & Furious’?", "sentences": [{"1e5f": "Who Is the Fastest and Most Furious in ‘Fast & Furious’?"}, {"da7c": "With a cast stacked with action stars, the greatest mystery of the ‘Fast & Furious’ franchise has gone unsolved for too long. Who is the fastest and most furious of them all? The Ringer has the answers."}, {"6ca3": "For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of The Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time."}, {"9f50": "The Fast & Furious franchise has asked and answered many pressing questions over its 16-year run. Do Vin Diesel and Paul Walker have palpable onscreen chemistry? Would audiences embrace a shameless Point Break knockoff, but with cars? Would they be OK with us revealing that some of our sequels are actually prequels? (The answer is extremely yes, to all three.) But there’s one question that has remained unanswered, a question with an answer which may define the entire series: Who is the fastest and most furious?"}, {"fa9e": "To figure it out, we rewatched the seven previous Fast films and quantified the fastness and furiousness of nine of the franchise’s main characters using a sophisticated mathematical formula."}, {"4a44": "To chart each character’s fastness levels, we clocked and measured their speed each time they drove. When we could, we calculated miles per hour using the very abundant and very handy speedometer shots. In all other situations, we eyeballed it. To arrive at an average mph, we added up the mphs for each instance and divided it by the number of times the character drove. For a furiousness figure, using a stopwatch, we timed each character whenever they appeared angry, enraged, or sufficiently agitated on screen and divided that by the film’s running time. Then, to arrive at a “Fast & Furious Rating” (F&F), we multiplied the two numbers together. And it worked. Wow."}, {"d198": "Here are our findings: each character’s average F&F from lowest to highest, broken down by film, and the official answer to “Who is the fastest and most furious?” Thank you to the Fields Medal committee in advance."}, {"62e1": "Tej (Ludacris)"}, {"f52e": "2 Fast 2 Furious: 0Fast Five: 0Fast & Furious 6: 0Furious 7: 0.35"}, {"5961": "Join me in a retelling of the greatest transformation in movie history. Tej was introduced in 2 Fast 2 Furious as a garage owner with unimaginable connections. When he returned to the franchise in Fast Five, he was suddenly one of the best hackers in the world. How? Maybe he went to ITT Tech during his hiatus? Whatever the explanation, the fact remains that Tej has never been one of the best drivers in the family. He’s much more adept at giving directions to others over a walkie-talkie. And he has a very temperate disposition. For all of those reasons, his F&F is the lowest among the main cast members."}, {"1a8f": "Han (Sung Kang)"}, {"a79d": "Tokyo Drift: 0.55Fast & Furious: 0Fast Five: 0Fast & Furious 6: 0"}, {"af4c": "For anyone who has seen the series, it shouldn’t be a surprise that Han’s F&F is so low — he just isn’t an angry dude. But that’s what makes him so great and invaluable in these movies! You can’t have every character be a beefy guy who’s about to fury-flex out of his tank top — you also need the guy who approaches stressful situations with a wry smile and a bag of chips in his hand."}, {"4d74": "Letty (Michelle Rodriguez)"}, {"2057": "The Fast and the Furious: 0.24Fast & Furious: 0.32Fast & Furious 6: 0.05Furious 7: 0.9"}, {"3778": "Has Michelle Rodriguez ever played a character who wasn’t intermittently furious? She was even mad for the entirety of Blue Crush, and that movie was all about sunshine and the power of female friendship. Her Fast character, Letty, loves a good scowl, keeping Rodriguez firmly within her frown-filled comfort zone. However, her highest average speed in any of the movies is just 86 mph in Furious 7, which keeps her F&F pretty low. Plus, she’s quote-unquote “dead” for a couple of the movies. Once she returns, her amnesia briefly slows her down, but by Furious 7, when she’s starting to remember her former life, she picks up some speed."}, {"43df": "Mia (Jordana Brewster)"}, {"83bc": "The Fast and the Furious: 0.99Fast & Furious: 0.99Fast Five: 0Fast & Furious 6: 0Furious 7: 0"}, {"dfc7": "Look, nobody thought Mia was gonna win this thing. And she didn’t. She started strong, tying Brian for speediest in the original film with a 90 mph average. But once she became Brian’s beau, she slowed down to a standstill — her average mph is zero in Furious 7, because she straight-up doesn’t get to drive — and became resolutely agreeable. Though, wouldn’t we all if we were boinging young Paul Walker on a regular basis?"}, {"f21c": "Roman Pierce (Tyrese)"}, {"9982": "2 Fast 2 Furious: 2.62Fast Five: 0.05Fast & Furious 6: 0.02Furious 7: 0.04"}, {"5b6d": "The franchise’s resident comic relief was mildly fast and furious during his debut, but spent most of his screen time cracking jokes outside of a moving vehicle. By Furious 7, he was spending only 0.04 percent of the running time being actually furious."}, {"b61c": "Hobbs (Dwayne Johnson)"}, {"7a6c": "Fast Five: 1.17Fast & Furious 6: 0.54Furious 7: 1.86"}, {"7085": "When the Rock joined the franchise, we expected two things: speed and rage. He didn’t really deliver on either, spending most of his time flummoxed and immobile. Sure, he was pretty mean and mad in Fast Five, telling lowly policemen to “stay the fuck out of my way,” but statistically speaking, he’s only the fourth-most furious cast member in Furious 7! Embarrassing. How much do you want to bet that Vin Diesel had a clause written into his contract that Dwayne Johnson could be neither faster nor more furious than him?"}, {"2b10": "Brian O’Connor (Paul Walker)"}, {"0864": "The Fast and the Furious: 3.872 Fast 2 Furious: 2.70Fast & Furious: 3.12Fast Five: 0.22Fast & Furious 6: 0.28Furious 7: 3.04"}, {"ad90": "Brian was the fastest and most furious when he was in disguise as a cop in the original 2001 film, with an F&F of 3.87. Struggling to reconcile your brotherly love for Vin Diesel with your professional responsibilities and ethical mores is enough to make anyone reckless and surly. But he mostly chilled out after that, coming close to his F&F peak in only Fast & Furious, a movie in which he breaks a coworker’s face."}, {"620a": "Dominic Toretto (Vin Diesel)"}, {"701f": "The Fast and the Furious: 3.53Tokyo Drift: 0.16Fast & Furious: 6.47Fast Five: 1.83Fast & Furious 6: 0.36Furious 7: 5.47"}, {"45bf": "Dom’s a volatile guy — he once beat a man with a wrench until he could no longer lift his arms — and his journey of fastness and furiousness is equally turbulent, from a measly 0.16 F&F index in Tokyo Drift (which is mostly due to the fact that he’s in only the last two minutes of the movie and therefore has very little time to get angry) to a forehead-vein-popping 6.47 in Fast & Furious. Dom’s F&F spikes when his family is imperiled, because Dom loves family even more than he loves stealing cars. That’s why he reaches his fastest and most furious in Fast & Furious, when he believes his ride-or-die love Letty has, uh, died."}, {"276d": "Deckard Shaw (Jason Statham)"}, {"f3f9": "Furious 7: 8.74"}, {"ef16": "Deckard doesn’t make an appearance until the most recent film, but let me assure you, he is so fast and so furious we had to include him. Dude never turns his frown upside-down, and he always slams the gas. His performance in Furious 7 set a record for F&F in a single film."}, {"9aa1": "Conclusion"}, {"c862": "The characters in these films spend far less screen time irate and speedy than one might assume from the movies’ titles. For every scene where they’re driving their cars into one another or out of an airplane, there’s a few minutes spent showing the gang clinking ice-cold Mexican beers and grinning ear-to-ear. A more accurate title for the franchise might be “A Little Bit Angry and Driving Around” or “Buff Friend Adventures.” Now, for the awards ceremony."}, {"dbc7": "The Fastest Performance in a Single Film: With average speeds of 90 mph, Brian, Mia, and Tej are all tied for this illustrious award. Brian logged his best speed in The Fast and the Furious. As did Mia. (Remember when she drives Brian around once and he’s like, “Whoa! That’s a lot of woman!”?) As for how Tej ended up here, he drives only once in Fast Five, but that one time he goes really fast."}, {"5a5f": "The Most Furious Performance in a Single Film: Dom and Deckard Shaw are tied, both spending 11 percent of a film’s total running time furious. Shaw posted his all-time furious performance in Furious 7, of course, while Dom’s came in Fast & Furious when he was avenging Letty’s apparent death."}, {"9c4b": "Now for the big award, the one you came for."}, {"f477": "The Most Fast & Furious Character in Fast & Furious: Technically, it’s Deckard Shaw, with a magnificent F&F of 8.74. But, since Shaw is in only one film, it didn’t feel like there was a large enough sample size to give him this ultimate prize. Therefore, the award goes to … yep, you called it, the one and only Dominic Toretto. Truly, no character is more firmly cemented in the middle of the Venn diagram that is fast and furiousness. Congrats, Dom. Coronas are on us."}], "content": "Who Is the Fastest and Most Furious in ‘Fast & Furious’? With a cast stacked with action stars, the greatest mystery of the ‘Fast & Furious’ franchise has gone unsolved for too long. Who is the fastest and most furious of them all? The Ringer has the answers. For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of The Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time. The Fast & Furious franchise has asked and answered many pressing questions over its 16-year run. Do Vin Diesel and Paul Walker have palpable onscreen chemistry? Would audiences embrace a shameless Point Break knockoff, but with cars? Would they be OK with us revealing that some of our sequels are actually prequels? (The answer is extremely yes, to all three.) But there’s one question that has remained unanswered, a question with an answer which may define the entire series: Who is the fastest and most furious? To figure it out, we rewatched the seven previous Fast films and quantified the fastness and furiousness of nine of the franchise’s main characters using a sophisticated mathematical formula. To chart each character’s fastness levels, we clocked and measured their speed each time they drove. When we could, we calculated miles per hour using the very abundant and very handy speedometer shots. In all other situations, we eyeballed it. To arrive at an average mph, we added up the mphs for each instance and divided it by the number of times the character drove. For a furiousness figure, using a stopwatch, we timed each character whenever they appeared angry, enraged, or sufficiently agitated on screen and divided that by the film’s running time. Then, to arrive at a “Fast & Furious Rating” (F&F), we multiplied the two numbers together. And it worked. Wow. Here are our findings: each character’s average F&F from lowest to highest, broken down by film, and the official answer to “Who is the fastest and most furious?” Thank you to the Fields Medal committee in advance. Tej (Ludacris) 2 Fast 2 Furious: 0Fast Five: 0Fast & Furious 6: 0Furious 7: 0.35 Join me in a retelling of the greatest transformation in movie history. Tej was introduced in 2 Fast 2 Furious as a garage owner with unimaginable connections. When he returned to the franchise in Fast Five, he was suddenly one of the best hackers in the world. How? Maybe he went to ITT Tech during his hiatus? Whatever the explanation, the fact remains that Tej has never been one of the best drivers in the family. He’s much more adept at giving directions to others over a walkie-talkie. And he has a very temperate disposition. For all of those reasons, his F&F is the lowest among the main cast members. Han (Sung Kang) Tokyo Drift: 0.55Fast & Furious: 0Fast Five: 0Fast & Furious 6: 0 For anyone who has seen the series, it shouldn’t be a surprise that Han’s F&F is so low — he just isn’t an angry dude. But that’s what makes him so great and invaluable in these movies! You can’t have every character be a beefy guy who’s about to fury-flex out of his tank top — you also need the guy who approaches stressful situations with a wry smile and a bag of chips in his hand. Letty (Michelle Rodriguez) The Fast and the Furious: 0.24Fast & Furious: 0.32Fast & Furious 6: 0.05Furious 7: 0.9 Has Michelle Rodriguez ever played a character who wasn’t intermittently furious? She was even mad for the entirety of Blue Crush, and that movie was all about sunshine and the power of female friendship. Her Fast character, Letty, loves a good scowl, keeping Rodriguez firmly within her frown-filled comfort zone. However, her highest average speed in any of the movies is just 86 mph in Furious 7, which keeps her F&F pretty low. Plus, she’s quote-unquote “dead” for a couple of the movies. Once she returns, her amnesia briefly slows her down, but by Furious 7, when she’s starting to remember her former life, she picks up some speed. Mia (Jordana Brewster) The Fast and the Furious: 0.99Fast & Furious: 0.99Fast Five: 0Fast & Furious 6: 0Furious 7: 0 Look, nobody thought Mia was gonna win this thing. And she didn’t. She started strong, tying Brian for speediest in the original film with a 90 mph average. But once she became Brian’s beau, she slowed down to a standstill — her average mph is zero in Furious 7, because she straight-up doesn’t get to drive — and became resolutely agreeable. Though, wouldn’t we all if we were boinging young Paul Walker on a regular basis? Roman Pierce (Tyrese) 2 Fast 2 Furious: 2.62Fast Five: 0.05Fast & Furious 6: 0.02Furious 7: 0.04 The franchise’s resident comic relief was mildly fast and furious during his debut, but spent most of his screen time cracking jokes outside of a moving vehicle. By Furious 7, he was spending only 0.04 percent of the running time being actually furious. Hobbs (Dwayne Johnson) Fast Five: 1.17Fast & Furious 6: 0.54Furious 7: 1.86 When the Rock joined the franchise, we expected two things: speed and rage. He didn’t really deliver on either, spending most of his time flummoxed and immobile. Sure, he was pretty mean and mad in Fast Five, telling lowly policemen to “stay the fuck out of my way,” but statistically speaking, he’s only the fourth-most furious cast member in Furious 7! Embarrassing. How much do you want to bet that Vin Diesel had a clause written into his contract that Dwayne Johnson could be neither faster nor more furious than him? Brian O’Connor (Paul Walker) The Fast and the Furious: 3.872 Fast 2 Furious: 2.70Fast & Furious: 3.12Fast Five: 0.22Fast & Furious 6: 0.28Furious 7: 3.04 Brian was the fastest and most furious when he was in disguise as a cop in the original 2001 film, with an F&F of 3.87. Struggling to reconcile your brotherly love for Vin Diesel with your professional responsibilities and ethical mores is enough to make anyone reckless and surly. But he mostly chilled out after that, coming close to his F&F peak in only Fast & Furious, a movie in which he breaks a coworker’s face. Dominic Toretto (Vin Diesel) The Fast and the Furious: 3.53Tokyo Drift: 0.16Fast & Furious: 6.47Fast Five: 1.83Fast & Furious 6: 0.36Furious 7: 5.47 Dom’s a volatile guy — he once beat a man with a wrench until he could no longer lift his arms — and his journey of fastness and furiousness is equally turbulent, from a measly 0.16 F&F index in Tokyo Drift (which is mostly due to the fact that he’s in only the last two minutes of the movie and therefore has very little time to get angry) to a forehead-vein-popping 6.47 in Fast & Furious. Dom’s F&F spikes when his family is imperiled, because Dom loves family even more than he loves stealing cars. That’s why he reaches his fastest and most furious in Fast & Furious, when he believes his ride-or-die love Letty has, uh, died. Deckard Shaw (Jason Statham) Furious 7: 8.74 Deckard doesn’t make an appearance until the most recent film, but let me assure you, he is so fast and so furious we had to include him. Dude never turns his frown upside-down, and he always slams the gas. His performance in Furious 7 set a record for F&F in a single film. Conclusion The characters in these films spend far less screen time irate and speedy than one might assume from the movies’ titles. For every scene where they’re driving their cars into one another or out of an airplane, there’s a few minutes spent showing the gang clinking ice-cold Mexican beers and grinning ear-to-ear. A more accurate title for the franchise might be “A Little Bit Angry and Driving Around” or “Buff Friend Adventures.” Now, for the awards ceremony. The Fastest Performance in a Single Film: With average speeds of 90 mph, Brian, Mia, and Tej are all tied for this illustrious award. Brian logged his best speed in The Fast and the Furious. As did Mia. (Remember when she drives Brian around once and he’s like, “Whoa! That’s a lot of woman!”?) As for how Tej ended up here, he drives only once in Fast Five, but that one time he goes really fast. The Most Furious Performance in a Single Film: Dom and Deckard Shaw are tied, both spending 11 percent of a film’s total running time furious. Shaw posted his all-time furious performance in Furious 7, of course, while Dom’s came in Fast & Furious when he was avenging Letty’s apparent death. Now for the big award, the one you came for. The Most Fast & Furious Character in Fast & Furious: Technically, it’s Deckard Shaw, with a magnificent F&F of 8.74. But, since Shaw is in only one film, it didn’t feel like there was a large enough sample size to give him this ultimate prize. Therefore, the award goes to … yep, you called it, the one and only Dominic Toretto. Truly, no character is more firmly cemented in the middle of the Venn diagram that is fast and furiousness. Congrats, Dom. Coronas are on us. ", "child": "2236_1\t2236_2\t2236_3\t2236_4\t2236_5\t2236_6\t2236_7\t2236_8\t2236_9"}