{"name": "2255", "parent": "", "title": "Torturas que precisamos conhecer", "sentences": [{"367c": "Torturas que precisamos conhecer"}, {"4e5b": "Sou mulher. Sou apaixonada pela literatura. Para além de escrever, eu leio. Compulsivamente."}, {"2f37": "Em uma dessas conversas de bar, comentando sobre um recém terminado da Clarice Lispector, ouvi dizer: “pra essa, temos que bater palmas”. Remexi na cadeira e, inconscientemente, já sabia — lá vinha o complemento: “Afinal, mulher que escreve bem é raro”."}, {"0ff7": "“Com base em quê”, fui obrigada a perguntar."}, {"51cf": "É só olhar a literatura: pouquíssimos nomes femininos para milhares de homens."}, {"3900": "Senta aqui, vamos conversar."}, {"4905": "Quando a imprensa se populariza, no século XIX, a escola literária que está em vigor no Brasil e na Europa (o nosso mundo e o mundo da época) era o Romantismo. Para ilustrar um pouco a vibe dessa escola literária, que teve três fases — vou, contudo, fazer um recorte no ultrarromantismo — , vamos pegar um clássico português conhecidíssimo à época: O primo Basílio, de Eça de Queiroz. Assim como nesse livro, que ilustra meu exemplo, as demais histórias que chegavam às mulheres, pelas mãos de seus maridos, eram histórias de mulheres submissas que adoeciam, por puro castigo divino, quando transgrediam as normas sociais. Essa é a história do Primo Basílio, publicado em 1878, quando Luísa troca cartas românticas com seu primo e, _spoiler_, termina o livro gravemente doente — interpretando a efemeridade como castigo divino."}, {"b5ab": "Pra quê toda essa história chata de literatura de ensino médio? Exatamente por ser literatura de ensino médio. E porque pinta o que são as mulheres na literatura: subordinadas, submissas. Reprimidas e oprimidas inconscientemente, num primeiro momento, para que não transgridam… Mas transgredimos. E, por isso, me propus, depois dessa aterrorizadora perspectiva de que não existem mulheres boas além da Clarice, a caçar mulheres boas na literatura. E, assim, surge essa primeira resenha: Virginia Woolf, Profissões para mulheres e outros artigos feministas — que, coerentemente ou não, me disse que a literatura é o meio mais fácil para ser mulher."}, {"d456": "Um tapa na cara por dia"}, {"b326": "Nossa querida Woolf, sob curadoria de Viviane Borba Barbosa, me mostrou, em sete artigos, que o meio literário é o lugar mais fácil para mulheres — e que, ainda assim, ele já é árduo e áspero. Alguns dos artigos foram discursos para trabalhadoras em que a autora fala como os ofícios para as mulheres são tradicionalmente necessários: se não fossem eles, não seríamos classe."}, {"03d0": "Em “A posição intelectual das mulheres”, a autora responde cartas de opiniões sexistas que foram enviadas para um jornal da época. Um debate muito interessante se constrói, especialmente no que tange a diminuição da arte feminina."}, {"df02": "Por fim, destaco:"}, {"8dc2": "“Escrever era a arte mais acessível, e escrever elas escreviam, mas livros profundamente influenciados pelo ângulo de onde eram obrigadas a olhar o mundo. Sem grandes afazeres, sempre interrompidas, com bastante tempo ocioso, mas poucos momentos para si mesmas, sem nenhum dinheiro próprio, essas legiões de mulheres apáticas iam procurar consolo na atividade e na religião.[…] ‘Eu, que tinha sido obrigada a escrever antes do café da manhã ou às escondidas, a partir daí tibe liberdade para trabalhar a minha maneira, pois havíamos perdido nossa posição.’”"}, {"f250": "Adeline Virginia Stephen nasceu em 25 de janeiro de 1882, em Londres, filha de um historiador, crítico e editor e uma mãe que teve, desde cedo, contato com a literatura. Ainda assim, reconhecia as nuances de dificuldade por ter, em primeiro lugar, escolhido um ofício; depois, por exercê-lo."}, {"24d7": "Quer receber mais textos como esse? Siga nossa publicação, fale sobre elas e compartilhe!"}, {"beef": "Nossa Página no Facebook: Fale com Elas"}, {"083a": "Nosso Instagram: @falecomelas"}, {"31f8": "Nosso Twitter: falecomelass"}], "content": "Torturas que precisamos conhecer Sou mulher. Sou apaixonada pela literatura. Para além de escrever, eu leio. Compulsivamente. Em uma dessas conversas de bar, comentando sobre um recém terminado da Clarice Lispector, ouvi dizer: “pra essa, temos que bater palmas”. Remexi na cadeira e, inconscientemente, já sabia — lá vinha o complemento: “Afinal, mulher que escreve bem é raro”. “Com base em quê”, fui obrigada a perguntar. É só olhar a literatura: pouquíssimos nomes femininos para milhares de homens. Senta aqui, vamos conversar. Quando a imprensa se populariza, no século XIX, a escola literária que está em vigor no Brasil e na Europa (o nosso mundo e o mundo da época) era o Romantismo. Para ilustrar um pouco a vibe dessa escola literária, que teve três fases — vou, contudo, fazer um recorte no ultrarromantismo — , vamos pegar um clássico português conhecidíssimo à época: O primo Basílio, de Eça de Queiroz. Assim como nesse livro, que ilustra meu exemplo, as demais histórias que chegavam às mulheres, pelas mãos de seus maridos, eram histórias de mulheres submissas que adoeciam, por puro castigo divino, quando transgrediam as normas sociais. Essa é a história do Primo Basílio, publicado em 1878, quando Luísa troca cartas românticas com seu primo e, _spoiler_, termina o livro gravemente doente — interpretando a efemeridade como castigo divino. Pra quê toda essa história chata de literatura de ensino médio? Exatamente por ser literatura de ensino médio. E porque pinta o que são as mulheres na literatura: subordinadas, submissas. Reprimidas e oprimidas inconscientemente, num primeiro momento, para que não transgridam… Mas transgredimos. E, por isso, me propus, depois dessa aterrorizadora perspectiva de que não existem mulheres boas além da Clarice, a caçar mulheres boas na literatura. E, assim, surge essa primeira resenha: Virginia Woolf, Profissões para mulheres e outros artigos feministas — que, coerentemente ou não, me disse que a literatura é o meio mais fácil para ser mulher. Um tapa na cara por dia Nossa querida Woolf, sob curadoria de Viviane Borba Barbosa, me mostrou, em sete artigos, que o meio literário é o lugar mais fácil para mulheres — e que, ainda assim, ele já é árduo e áspero. Alguns dos artigos foram discursos para trabalhadoras em que a autora fala como os ofícios para as mulheres são tradicionalmente necessários: se não fossem eles, não seríamos classe. Em “A posição intelectual das mulheres”, a autora responde cartas de opiniões sexistas que foram enviadas para um jornal da época. Um debate muito interessante se constrói, especialmente no que tange a diminuição da arte feminina. Por fim, destaco: “Escrever era a arte mais acessível, e escrever elas escreviam, mas livros profundamente influenciados pelo ângulo de onde eram obrigadas a olhar o mundo. Sem grandes afazeres, sempre interrompidas, com bastante tempo ocioso, mas poucos momentos para si mesmas, sem nenhum dinheiro próprio, essas legiões de mulheres apáticas iam procurar consolo na atividade e na religião.[…] ‘Eu, que tinha sido obrigada a escrever antes do café da manhã ou às escondidas, a partir daí tibe liberdade para trabalhar a minha maneira, pois havíamos perdido nossa posição.’” Adeline Virginia Stephen nasceu em 25 de janeiro de 1882, em Londres, filha de um historiador, crítico e editor e uma mãe que teve, desde cedo, contato com a literatura. Ainda assim, reconhecia as nuances de dificuldade por ter, em primeiro lugar, escolhido um ofício; depois, por exercê-lo. Quer receber mais textos como esse? Siga nossa publicação, fale sobre elas e compartilhe! Nossa Página no Facebook: Fale com Elas Nosso Instagram: @falecomelas Nosso Twitter: falecomelass ", "child": "2255_1\t2255_22255_1\t2255_2"}