{"name": "2256", "parent": "", "title": "Saga: Eixo", "sentences": [{"b5ae": "Olá pessoal, após ler Fabulosos Vingadores e trazer a resenha para vocês no começo deste ano (link aqui), venho trazer a saga que é uma continuação direta da HQ!"}, {"4ccb": "NOTA: Esta resenha contém SPOILERS!"}, {"d9b2": "Tudo começa após o Massacre ter sido acordado pelo Magneto. (Tanto que a leitura das edições de Fabulosos Vingadores e Magneto são obrigatórias!). Em um ato de desespero os Vingadores se reunem para atacar, juntamente com os X-men pois a treta estava séria!"}, {"f6dd": "No meio da luta os Vingadores se encontram praticamente derrotados por causa de uma sacada MUITO FODA! (Parabéns mesmo ao Rick Remender)É quando o Magneto tem uma ideia desesperadora de reunir um time para enfrentar o Massacre."}, {"da2c": "Como mesmo com este time as coisas não andam dando, eles tem uma ideia de utilizar um feitiço que inverteria o Eixo da consciencia do Massacre, de forma que o professor Xavier assuma a consciencia do corpo. O tiro acaba saindo pela culatra e todos envolvidos possuem suas personalidades invertidas!"}, {"3823": "Então começa uma parte muito legal onde os X-men resolvem lutar pela dominação mutante na terra matando todos que passarem pela frente! Já os Vingadores começam a tomar medidas drásticas para lidar com tudo, acusando e aprisionando todos os outros personagens do time que não concordavam com as “novas ideias”."}, {"3fdc": "Eis que surge então um novo time de Heróis para salvar os mundo: os vilões com consciências de heróis!"}, {"3c7b": "O pau quebra solto entre os três times: Vingadores, X-men e Vilões Heróis."}, {"3a6e": "Até que o Dr. Destino SALVA a porra toda!! O grande herói da história!"}, {"3b82": "E nosso velhinho Steve Rogers acaba salvando o Caveira Vermelha (temporariamente bonzinho por causa da inversão de consciência)"}, {"e910": "No final das contas, a história termina com a Feiticeira Escarlate e o Dr. Destino invertendo novamente o eixo e trazendo quase todas as coisas para o normal…. e isso mesmo… QUASE.. rsrs Alguns personagens não voltam… eis que nós temos a origem do Superior Homem de Ferro e o Dentes-de-Sabre bonzinho."}, {"6c7a": "Um Tie-in especial é para os “Vingadores do Destino” que eu gostei bastante! ☺Bem que o Agente Americano poderia assumir o posto do Capitão América!"}, {"ec8d": "Recomendo esta Saga?"}, {"4ced": "SIM!"}, {"596a": "Trata-se de uma saga divertida: cheia de lutas, sacadas e cenas legais! “Ah Filipe… mas alguns personagens foram descaracterizados… mimimimi…” Nem todas as sagas precisam respeitar a coesão do universo Marvel, tanto que este material não respeita mesmo! No final é um puta material legal e fechadinho se você ignorar a obrigatoriedade de coesão. Para pensar, porque Reino do Amanhã (uma história alternativa) pode viajar na maionese e o Eixo não pode? Por que tinha o Alex Ross envolvido? Enfim, esta é a minha humilde opinião, recomendo fortemente a todos que leiam este material! ☺ Grande abraço e feliz páscoa a todos!"}], "content": "Olá pessoal, após ler Fabulosos Vingadores e trazer a resenha para vocês no começo deste ano (link aqui), venho trazer a saga que é uma continuação direta da HQ! NOTA: Esta resenha contém SPOILERS! Tudo começa após o Massacre ter sido acordado pelo Magneto. (Tanto que a leitura das edições de Fabulosos Vingadores e Magneto são obrigatórias!). Em um ato de desespero os Vingadores se reunem para atacar, juntamente com os X-men pois a treta estava séria! No meio da luta os Vingadores se encontram praticamente derrotados por causa de uma sacada MUITO FODA! (Parabéns mesmo ao Rick Remender)É quando o Magneto tem uma ideia desesperadora de reunir um time para enfrentar o Massacre. Como mesmo com este time as coisas não andam dando, eles tem uma ideia de utilizar um feitiço que inverteria o Eixo da consciencia do Massacre, de forma que o professor Xavier assuma a consciencia do corpo. O tiro acaba saindo pela culatra e todos envolvidos possuem suas personalidades invertidas! Então começa uma parte muito legal onde os X-men resolvem lutar pela dominação mutante na terra matando todos que passarem pela frente! Já os Vingadores começam a tomar medidas drásticas para lidar com tudo, acusando e aprisionando todos os outros personagens do time que não concordavam com as “novas ideias”. Eis que surge então um novo time de Heróis para salvar os mundo: os vilões com consciências de heróis! O pau quebra solto entre os três times: Vingadores, X-men e Vilões Heróis. Até que o Dr. Destino SALVA a porra toda!! O grande herói da história! E nosso velhinho Steve Rogers acaba salvando o Caveira Vermelha (temporariamente bonzinho por causa da inversão de consciência) No final das contas, a história termina com a Feiticeira Escarlate e o Dr. Destino invertendo novamente o eixo e trazendo quase todas as coisas para o normal…. e isso mesmo… QUASE.. rsrs Alguns personagens não voltam… eis que nós temos a origem do Superior Homem de Ferro e o Dentes-de-Sabre bonzinho. Um Tie-in especial é para os “Vingadores do Destino” que eu gostei bastante! ☺Bem que o Agente Americano poderia assumir o posto do Capitão América! Recomendo esta Saga? SIM! Trata-se de uma saga divertida: cheia de lutas, sacadas e cenas legais! “Ah Filipe… mas alguns personagens foram descaracterizados… mimimimi…” Nem todas as sagas precisam respeitar a coesão do universo Marvel, tanto que este material não respeita mesmo! No final é um puta material legal e fechadinho se você ignorar a obrigatoriedade de coesão. Para pensar, porque Reino do Amanhã (uma história alternativa) pode viajar na maionese e o Eixo não pode? Por que tinha o Alex Ross envolvido? Enfim, esta é a minha humilde opinião, recomendo fortemente a todos que leiam este material! ☺ Grande abraço e feliz páscoa a todos! ", "child": "2256_1"}