{"name": "2259", "parent": "", "title": "Autores contra blogueiros, a polêmica literária do dia", "sentences": [{"becf": "Autores contra blogueiros, a polêmica literária do dia"}, {"8f87": "Parei de resenhar livros para editoras porque nem relógio trabalha de graça."}, {"54a8": "Não estou sendo ingrata — antes dos vinte, ganhar livros e falar sobre eles era muito bacana, fora a oportunidade de escolhê-los, recebê-los em casa e o crescimento literário inevitável que tive. Além, claro, das pessoas interessantes que trabalham no meio e se tornaram minhas amigas."}, {"918b": "Depois, porém, notei que o marketing gratuito beneficia muito mais apenas um lado que não é o mais fraco da corda. As responsabilidades chegam, você ganha outras ocupações e muitas editoras estabelecem prazos. Quando não soube mais lidar, saí dessa. E, como leio “cada vez mais lentamente”, quero pelo menos ler o que já tenho na estante, quero repetir leituras, quero me viciar em um mesmo autor por longo período."}, {"011e": "Fora que me angustiava o fato de que muitos blogs literários prestigiados pelo elevado número de visitas não apresentavam resenhas consistentes. Não eram convincentes, mas eram automáticos — montavam equipes de cinco colaboradores e todos pareciam escrever a mesmíssima coisa. Copiavam o enredo da própria editora, davam sete linhas do próprio parecer e, no final, uma “nota”, umas “estrelas”. Amigo, teu blog não é a Folha de S. Paulo."}, {"2a4c": "E blogs menores, mas com resenhas fantásticas, não recebiam a devida visualização, muitas vezes nem por parte dessas editoras. Editoras grandes divulgam “grandes” blogueiros."}, {"d946": "O ápice, para mim, foi quando uma ~certa editora~ avisou que não entregaria mais os livros, enviaria a versão digital por e-mail. Foi muita canalhice, pois os blogueiros, quando se inscreveram, não foram avisados e muitos questionaram, óbvio: “ganharemos também o leitor digital?”."}, {"d565": "Estou vendo que a “polêmica literária do dia” é a ~guerra~(antiga, até) entre autores e blogueiros que cobram para escrever resenhas. Os autores estão indignados porque “é muito difícil ser autor nesse país, portanto, absurdo demais esses adolescentes que não tem ensino superior exigindo dinheiro em troca de umas poucas linhas sobre o meu trabalho”."}, {"929b": "Vocês têm noção da vergonha que passam quando dizem isso, meus queridos?"}, {"9af4": "A vida não tá fácil pra ninguém. Se você escolhe sobreviver de escrita, sabe disso. Sabe que será criticado, sabe que as pessoas não têm a menor obrigação de lidar com a literatura na base da ~camaradagem~, da compaixão pelo autor-nacional-fodido-que-não-tem-onde-cair-morto."}, {"ccc9": "Eu mesma não aceito mais resenhar livros de autores que entram em contato comigo porque, me desculpem, quero dedicar o meu tempo às leituras que me interessam. E se eu gosto de romances de época, mas o seu livro trata de alienígenas que vistam a Terra no ano 4000, adivinha qual caminho escolherei?"}, {"2606": "Leitura é prazer, mas quando a pessoa se dispõe a resenhar a sua obra, torna-se obrigação, portanto, ela merece receber pelo tempo que se dedica a ler o teu livro. Acho engraçado quando o autor aparece todo humilde pedindo atenção do blogueiro literário, mas na primeira oportunidade, ao receber a tabela de valores, expõe o mesmo em grupos, na timeline e diz que “só existe gente interesseira”."}, {"3579": "O blogueiro literário não tá nem aí pra se você tem que comprar o seu próprio livro da editora;"}, {"79ab": "O blogueiro literário não se interessa por quanto você vai gastar nesse envio pelos Correios;"}, {"49ca": "O blogueiro literário também paga contas sozinho ou ajuda no sustento familiar."}, {"ae26": "Respeite o blogueiro literário, afinal é você quem está pedindo a divulgação dele. É um trabalho como qualquer outro e, se você desdenha, devia ter vergonha."}], "content": "Autores contra blogueiros, a polêmica literária do dia Parei de resenhar livros para editoras porque nem relógio trabalha de graça. Não estou sendo ingrata — antes dos vinte, ganhar livros e falar sobre eles era muito bacana, fora a oportunidade de escolhê-los, recebê-los em casa e o crescimento literário inevitável que tive. Além, claro, das pessoas interessantes que trabalham no meio e se tornaram minhas amigas. Depois, porém, notei que o marketing gratuito beneficia muito mais apenas um lado que não é o mais fraco da corda. As responsabilidades chegam, você ganha outras ocupações e muitas editoras estabelecem prazos. Quando não soube mais lidar, saí dessa. E, como leio “cada vez mais lentamente”, quero pelo menos ler o que já tenho na estante, quero repetir leituras, quero me viciar em um mesmo autor por longo período. Fora que me angustiava o fato de que muitos blogs literários prestigiados pelo elevado número de visitas não apresentavam resenhas consistentes. Não eram convincentes, mas eram automáticos — montavam equipes de cinco colaboradores e todos pareciam escrever a mesmíssima coisa. Copiavam o enredo da própria editora, davam sete linhas do próprio parecer e, no final, uma “nota”, umas “estrelas”. Amigo, teu blog não é a Folha de S. Paulo. E blogs menores, mas com resenhas fantásticas, não recebiam a devida visualização, muitas vezes nem por parte dessas editoras. Editoras grandes divulgam “grandes” blogueiros. O ápice, para mim, foi quando uma ~certa editora~ avisou que não entregaria mais os livros, enviaria a versão digital por e-mail. Foi muita canalhice, pois os blogueiros, quando se inscreveram, não foram avisados e muitos questionaram, óbvio: “ganharemos também o leitor digital?”. Estou vendo que a “polêmica literária do dia” é a ~guerra~(antiga, até) entre autores e blogueiros que cobram para escrever resenhas. Os autores estão indignados porque “é muito difícil ser autor nesse país, portanto, absurdo demais esses adolescentes que não tem ensino superior exigindo dinheiro em troca de umas poucas linhas sobre o meu trabalho”. Vocês têm noção da vergonha que passam quando dizem isso, meus queridos? A vida não tá fácil pra ninguém. Se você escolhe sobreviver de escrita, sabe disso. Sabe que será criticado, sabe que as pessoas não têm a menor obrigação de lidar com a literatura na base da ~camaradagem~, da compaixão pelo autor-nacional-fodido-que-não-tem-onde-cair-morto. Eu mesma não aceito mais resenhar livros de autores que entram em contato comigo porque, me desculpem, quero dedicar o meu tempo às leituras que me interessam. E se eu gosto de romances de época, mas o seu livro trata de alienígenas que vistam a Terra no ano 4000, adivinha qual caminho escolherei? Leitura é prazer, mas quando a pessoa se dispõe a resenhar a sua obra, torna-se obrigação, portanto, ela merece receber pelo tempo que se dedica a ler o teu livro. Acho engraçado quando o autor aparece todo humilde pedindo atenção do blogueiro literário, mas na primeira oportunidade, ao receber a tabela de valores, expõe o mesmo em grupos, na timeline e diz que “só existe gente interesseira”. O blogueiro literário não tá nem aí pra se você tem que comprar o seu próprio livro da editora; O blogueiro literário não se interessa por quanto você vai gastar nesse envio pelos Correios; O blogueiro literário também paga contas sozinho ou ajuda no sustento familiar. Respeite o blogueiro literário, afinal é você quem está pedindo a divulgação dele. É um trabalho como qualquer outro e, se você desdenha, devia ter vergonha. ", "child": "2259_1\t2259_2\t2259_3\t2259_4\t2259_5\t2259_6\t2259_7\t2259_8\t2259_9"}