{"name": "2271", "parent": "", "title": "Led Zeppelin Is Hollywood’s New Secret Weapon", "sentences": [{"9488": "Led Zeppelin Is Hollywood’s New Secret Weapon"}, {"fce4": "Rock’s most flamboyant band is setting the stage for a summer of movies."}, {"ca19": "If you’re me, the first thing you thought of when you saw the Thor: Ragnarok trailer was King Arthur: Legend of the Sword. No, not because both movies feature a dethroned ruler who is trying to defend his kingdom from an evil sorcerer, or because both feature bombastic feats of slow-motion swordplay, or even because each movie adheres to a sort of punk-medieval aesthetic with splashes of color (well, OK, now I’m thinking of those things). No, I thought of King Arthur: Legend of the Sword because that was the other trailer in only a month’s span to pull out all the stops and feature an iconic song by Led Zeppelin, arguably the greatest band that ever lived. They’re big, they’re bold, and they’re Hollywood’s new secret weapon when it comes to blockbuster titles."}, {"be7a": "When you hear a Zeppelin song in a trailer, the first thought that immediately comes to mind is the time and money it must’ve taken to get the rights to one of their songs. Led Zeppelin is a notoriously finicky band when it comes to licensing their music. Back in 2012, The Los Angeles Times ran a piece on the hoops the band would make filmmakers jump through to use one of their songs in a film. According to the article, the license fee for a Zeppelin song often dips into the seven-figure range; the band might also ask for creative changes in how you make their music, such as the time Ben Affleck was asked to digitally alter a shot of a record in Argo so his character would be putting the record arm down on the right part of the record for the track. “So not only did we have to pay for the song,” Affleck told the Times, “we had to pay for an effects shot.” In other words, if you’re Zeppelin, you can make crazy demands and people have to say yes."}, {"cd16": "There was also the time that Jack Black and the cast of School of Rock shot a video basically begging the band to let them use a brief clip of “Immigrant Song” for the movie; Zeppelin would eventually relent, buying themselves some latitude in Black’s eyes when they would later refuse to let him reference one of their songs in Tenacious D: The Pick of Destiny. And the time when a music supervisor on True Blood used Zeppelin’s “In the Evening” as a piece of temp music during an episode, causing producers to fall in love with the music and kicking off a long (and successful) campaign to license the song for the show. This isn’t just restricted to movies and television, either. When game developer Activision released a special live-action trailer for the release of Destiny, their sci-fi first-person shooter that cost a reported $500 million to produce and promote, they spared no expense, licensing Zeppelin’s “Immigrant Song” for use in the trailer. Activision would later feature “Black Dog” in the trailer for the game’s expansion, Destiny: The Taken King."}, {"ad39": "Knowing that Zeppelin is both expensive and mercurial is only one part of the equation. The other part is the quality of the music itself. Zeppelin’s songs have been described — lovingly, of course — as “pompous pretentiousness,” a term that might also fit in nicely with the current slate of summer blockbusters. When applied to a movie like King Arthur: Legend of the Sword, it leans into Guy Ritchie’s reputation as a filmmaker who shares the band’s appreciation for largesse in all things. Like Zeppelin, Ritchie is loud and bombastic and an undeniably skilled technician, and his use of “Babe I’m Gonna Leave You” in the King Arthur trailer proves that (on some level, anyway) he’s definitely in on the joke. For Thor: Ragnarok, it emphasizes the franchise’s newfound direction as the vision of an esoteric filmmaker. You don’t use Led Zeppelin in a Marvel trailer if you’re trying to convince people it’s business as usual; you use Zeppelin to show fans that there’s heart, intent, and, yes, ego at stake with the movie. With all due respect to James Gunn, Taika Waititi is perhaps the most unique talent Marvel has ever put behind the camera, and Zeppelin’s music serves as a promise to its audiences that they’d rather err on the side of too much than too little."}, {"ea3b": "So while fans might clamor for the release of Thor: Ragnarok and roll their eyes at another Guy Ritchie blockbuster, there’s no denying that the use of Led Zeppelin in their films’ trailers was the right choice for what they’re trying to sell. If nothing else, Zeppelin shows that these studios are trying to find a common ground between artistic vision and blockbuster filmmaking for their audiences. The movies may be good or bad, but when 1% of your production budget is being earmarked for a single song by one of rock’s most flamboyant bands, you’ve at least got someone on staff who’s willing to gamble a bit to deliver something special to audiences. And at the end of the day, isn’t that all we really want? A studio that is willing to gamble a bit with a $200 million movie; it doesn’t get more metal than that."}], "content": "Led Zeppelin Is Hollywood’s New Secret Weapon Rock’s most flamboyant band is setting the stage for a summer of movies. If you’re me, the first thing you thought of when you saw the Thor: Ragnarok trailer was King Arthur: Legend of the Sword. No, not because both movies feature a dethroned ruler who is trying to defend his kingdom from an evil sorcerer, or because both feature bombastic feats of slow-motion swordplay, or even because each movie adheres to a sort of punk-medieval aesthetic with splashes of color (well, OK, now I’m thinking of those things). No, I thought of King Arthur: Legend of the Sword because that was the other trailer in only a month’s span to pull out all the stops and feature an iconic song by Led Zeppelin, arguably the greatest band that ever lived. They’re big, they’re bold, and they’re Hollywood’s new secret weapon when it comes to blockbuster titles. When you hear a Zeppelin song in a trailer, the first thought that immediately comes to mind is the time and money it must’ve taken to get the rights to one of their songs. Led Zeppelin is a notoriously finicky band when it comes to licensing their music. Back in 2012, The Los Angeles Times ran a piece on the hoops the band would make filmmakers jump through to use one of their songs in a film. According to the article, the license fee for a Zeppelin song often dips into the seven-figure range; the band might also ask for creative changes in how you make their music, such as the time Ben Affleck was asked to digitally alter a shot of a record in Argo so his character would be putting the record arm down on the right part of the record for the track. “So not only did we have to pay for the song,” Affleck told the Times, “we had to pay for an effects shot.” In other words, if you’re Zeppelin, you can make crazy demands and people have to say yes. There was also the time that Jack Black and the cast of School of Rock shot a video basically begging the band to let them use a brief clip of “Immigrant Song” for the movie; Zeppelin would eventually relent, buying themselves some latitude in Black’s eyes when they would later refuse to let him reference one of their songs in Tenacious D: The Pick of Destiny. And the time when a music supervisor on True Blood used Zeppelin’s “In the Evening” as a piece of temp music during an episode, causing producers to fall in love with the music and kicking off a long (and successful) campaign to license the song for the show. This isn’t just restricted to movies and television, either. When game developer Activision released a special live-action trailer for the release of Destiny, their sci-fi first-person shooter that cost a reported $500 million to produce and promote, they spared no expense, licensing Zeppelin’s “Immigrant Song” for use in the trailer. Activision would later feature “Black Dog” in the trailer for the game’s expansion, Destiny: The Taken King. Knowing that Zeppelin is both expensive and mercurial is only one part of the equation. The other part is the quality of the music itself. Zeppelin’s songs have been described — lovingly, of course — as “pompous pretentiousness,” a term that might also fit in nicely with the current slate of summer blockbusters. When applied to a movie like King Arthur: Legend of the Sword, it leans into Guy Ritchie’s reputation as a filmmaker who shares the band’s appreciation for largesse in all things. Like Zeppelin, Ritchie is loud and bombastic and an undeniably skilled technician, and his use of “Babe I’m Gonna Leave You” in the King Arthur trailer proves that (on some level, anyway) he’s definitely in on the joke. For Thor: Ragnarok, it emphasizes the franchise’s newfound direction as the vision of an esoteric filmmaker. You don’t use Led Zeppelin in a Marvel trailer if you’re trying to convince people it’s business as usual; you use Zeppelin to show fans that there’s heart, intent, and, yes, ego at stake with the movie. With all due respect to James Gunn, Taika Waititi is perhaps the most unique talent Marvel has ever put behind the camera, and Zeppelin’s music serves as a promise to its audiences that they’d rather err on the side of too much than too little. So while fans might clamor for the release of Thor: Ragnarok and roll their eyes at another Guy Ritchie blockbuster, there’s no denying that the use of Led Zeppelin in their films’ trailers was the right choice for what they’re trying to sell. If nothing else, Zeppelin shows that these studios are trying to find a common ground between artistic vision and blockbuster filmmaking for their audiences. The movies may be good or bad, but when 1% of your production budget is being earmarked for a single song by one of rock’s most flamboyant bands, you’ve at least got someone on staff who’s willing to gamble a bit to deliver something special to audiences. And at the end of the day, isn’t that all we really want? A studio that is willing to gamble a bit with a $200 million movie; it doesn’t get more metal than that. ", "child": "2271_1\t2271_2\t2271_3\t2271_4\t2271_5\t2271_6\t2271_7\t2271_8\t2271_9\t2271_10\t2271_11"}