{"name": "2274", "parent": "", "title": "The Geek & The Weeb #3: Doctor Strange, cambiar algo para dejarlo igual.", "sentences": [{"2e24": "The Geek & The Weeb #3: Doctor Strange, cambiar algo para dejarlo igual."}, {"5236": "Película de Marvel media = Villano de mierda + Humor forzado + Guión con lagunas + Subtramas irrelevantes"}, {"42f5": "Doctor Strange = Todo lo anterior + Hechicería"}, {"06e2": "Quizá esté exagerando, mejor desarrollemos esto."}, {"b7fd": "Doctor Strange carece de una buena base, sus cómics son una copia para niños de The Sandman y si quieres leer algo de él o empiezas por el principio o al final lo acabas dejando por no entender una mierda con tanto aparato mágico y tecnicismo esotérico pero, como ya comenta Obbd98 en su Internet Odyssey, el cómic y el cine son dos medios distintos que no deben ser tratados por igual, así que olvidemos el cómic y centrémonos en la película."}, {"282a": "Doctor Strange sigue la historia de un talentoso neurocirujano, el Doctor Stephen Strange, quien, después de un trágico accidente de coche, deja su ego a un lado y aprende los secretos de un mundo escondido de misticismo y dimensiones alternativas. En el Greenwich Village de Nueva York, Doctor Strange debe actuar como un intermediario entre el mundo real y lo que hay más allá, utilizando una amplia gama de capacidades metafísicas y artefactos para proteger el Universo Cinematográfico de Marvel"}, {"3ef3": "No sé ni por qué me molesto en poner la sinopsis si todo el mundo la conoce (Gracias Disney por tu campaña masiva de publicidad)."}, {"0048": "Como es tradición en Marvel, la cinta empieza con un flashback ¿Sirve para algo? Más bien poco, lo ocurrido en este se nos repetirá a lo largo de la cinta, no es más que un contexto para enseñarnos las distintas dimensiones de la película y que flipemos un poco mucho con el CGI, pues así más o menos es toda la película."}, {"ab4e": "Imagen recién hecha de los cines FullHD de Cádiz, mentira puta es de Google"}, {"047e": "¿Y que tal con los personajes?"}, {"d970": "La evolución de Doctor Strange interpretado por Benedict Cumberbatch(Sherlock) está forzadísima, la primera vez que descubre todo el misticismo sólo se lo cuestiona con una frase “¿El té no llevará LSD?”(La época del MK-Ultra ya acabó Sr.Marvel) a lo que La Anciana (maestra de todos los brujos) responde con un no, con un puto monosílabo elimina el materialismo pensamiento del Doctor sin pensárselo de nuevo, es cierto que La Anciana le hace un conjuro o algo para que de un viaje por el cosmos y las dimensiones pero estamos hablando de una persona puramente material, un mínimo de duda por favor y ya no hablemos de su entrenamiento, en 5 min pasa de ser un negado en las artes místicas a ser el fucking pro SOLO PORQUE EL GUION ASI LO QUIERE."}, {"87f4": "El villano de la cinta es una basura unidimensional, no exploran sus aspiraciones más allá de 3 o 4 diálogos, el resto de la cinta sólo sirve para las escenas de acción tanto él como sus seguidores que estos ni siquiera hablan, es una lástima desperdiciar a Mads Mikkelsen (Hannibal TV) de esta forma (No quiero ni hablar del “verdadero villano” al nivel de Galactus de los 4 fantásticos 2)"}, {"8265": "Ya que digo desperdicio de actuación, para desperdicio el papel de Rachel McAdam (Spotlight) su papel es de la subtrama amorosa e irrelevante, en serio no entiendo la manía que tienen con meter una trama amorosa si no me vas a contar nada, solo hace una cosa relevante que bien podría haberlo hecho cualquiera, mejor haberla dejado como una amiga del trabajo."}, {"4911": "Tilda Swinton (Las Crónicas de Narnia) y Chiwetel Ejiofor (12 años de esclavitud) haciendo de La Anciana y el otro brujo negrata quizá sea la relación que mas merezca la pena aunque no se explora una mierda hubiera sido interesante haberla visto mas profundizada."}, {"cb90": "Me quedo con el papel de Benedict Wong (Marco polo) un bibliotecario que no pretende ser más de lo que es con escenas muy divertidas."}, {"15a9": "Like Iron Man"}, {"91d9": "Entonces el guion…"}, {"0d16": "No hay mucho que decir, cae en los típicos errores de las películas de marvel además que si me dices que lo ha escrito Christoper Nolan me lo creo a medias, no voy a nombrar a los verdaderos guionistas porque a excepción del snob de Scott Derrickson (El exorcismo de Emily Rose) quien también es el director de la cinta, a los otros dos no los conoce ni su madre."}, {"840b": "El guión es lo que es, una mierda que se apresura por terminar lo que está haciendo sin importar que deje por el camino, ve al tiempo como un enemigo, por este motivo el final estan poca cosa."}, {"5dde": "¿Humor forzado again?"}, {"24c3": "Si pero no, no llega al nivel de gilipollez de Ultrón en Los Vengadores 2 o lo que coño fuera el Mandarín de Iron Man 3, tampoco digo que sea tan divertida como Guardianes de la Galaxia o Ant-man pero quitando alguna que otra metedura de pata, con los chistes de Doctor Strange te ríes."}, {"b19a": "¿Algo más? Espero que no"}, {"ac7a": "Lo siento pero si, estoy harto de las putas escenas post-créditos, apenas 1 minuto de información solo para confirmar lo que ya sabemos antes de ir al cine, la puta secuela, y sin contar que no era 1 sino 2 jodidas escenas, claro que podría haberme ido y no verlas pero luego quedo de impaciente y de hater con la gente que la vi, estos fanboys."}, {"d3e5": "Además de la manía de “unir” las películas para crear un universo, lo que hacen es liar más al espectador, ya en Los Vengadores 2 se notaba que a Joss Whedon le costaba manejar a tanto personaje en la pantalla no me quiero imaginar en Los Vengadores 3 y 4 con tanto superheroe suelto."}, {"7063": "Vivan los mandalas aéreos"}, {"3d23": "¿Me vas a decir algo bueno de la película o vas a seguir de hater?"}, {"6628": "Si claro, las escenas de acción están muy logradas, la actuación del Doctor es de sobresaliente, las ropas que llevan los actores están geniales y se ven muy reales y el CGI es una gozada para que engañarnos."}, {"165f": "Termina ya por favor"}, {"080c": "Conclusión: Doctor Strange es más de lo mismo, podrían haber puesto empeño en pulir algunos fallos, tampoco hace falta que todas las cintas de Marvel sean Capitán América: El Soldado de Invierno, disfrutas viéndola si no le prestas demasiada atención, si quieres pasar un rato entretenido no dudes en ir a verla."}], "content": "The Geek & The Weeb #3: Doctor Strange, cambiar algo para dejarlo igual. Película de Marvel media = Villano de mierda + Humor forzado + Guión con lagunas + Subtramas irrelevantes Doctor Strange = Todo lo anterior + Hechicería Quizá esté exagerando, mejor desarrollemos esto. Doctor Strange carece de una buena base, sus cómics son una copia para niños de The Sandman y si quieres leer algo de él o empiezas por el principio o al final lo acabas dejando por no entender una mierda con tanto aparato mágico y tecnicismo esotérico pero, como ya comenta Obbd98 en su Internet Odyssey, el cómic y el cine son dos medios distintos que no deben ser tratados por igual, así que olvidemos el cómic y centrémonos en la película. Doctor Strange sigue la historia de un talentoso neurocirujano, el Doctor Stephen Strange, quien, después de un trágico accidente de coche, deja su ego a un lado y aprende los secretos de un mundo escondido de misticismo y dimensiones alternativas. En el Greenwich Village de Nueva York, Doctor Strange debe actuar como un intermediario entre el mundo real y lo que hay más allá, utilizando una amplia gama de capacidades metafísicas y artefactos para proteger el Universo Cinematográfico de Marvel No sé ni por qué me molesto en poner la sinopsis si todo el mundo la conoce (Gracias Disney por tu campaña masiva de publicidad). Como es tradición en Marvel, la cinta empieza con un flashback ¿Sirve para algo? Más bien poco, lo ocurrido en este se nos repetirá a lo largo de la cinta, no es más que un contexto para enseñarnos las distintas dimensiones de la película y que flipemos un poco mucho con el CGI, pues así más o menos es toda la película. Imagen recién hecha de los cines FullHD de Cádiz, mentira puta es de Google ¿Y que tal con los personajes? La evolución de Doctor Strange interpretado por Benedict Cumberbatch(Sherlock) está forzadísima, la primera vez que descubre todo el misticismo sólo se lo cuestiona con una frase “¿El té no llevará LSD?”(La época del MK-Ultra ya acabó Sr.Marvel) a lo que La Anciana (maestra de todos los brujos) responde con un no, con un puto monosílabo elimina el materialismo pensamiento del Doctor sin pensárselo de nuevo, es cierto que La Anciana le hace un conjuro o algo para que de un viaje por el cosmos y las dimensiones pero estamos hablando de una persona puramente material, un mínimo de duda por favor y ya no hablemos de su entrenamiento, en 5 min pasa de ser un negado en las artes místicas a ser el fucking pro SOLO PORQUE EL GUION ASI LO QUIERE. El villano de la cinta es una basura unidimensional, no exploran sus aspiraciones más allá de 3 o 4 diálogos, el resto de la cinta sólo sirve para las escenas de acción tanto él como sus seguidores que estos ni siquiera hablan, es una lástima desperdiciar a Mads Mikkelsen (Hannibal TV) de esta forma (No quiero ni hablar del “verdadero villano” al nivel de Galactus de los 4 fantásticos 2) Ya que digo desperdicio de actuación, para desperdicio el papel de Rachel McAdam (Spotlight) su papel es de la subtrama amorosa e irrelevante, en serio no entiendo la manía que tienen con meter una trama amorosa si no me vas a contar nada, solo hace una cosa relevante que bien podría haberlo hecho cualquiera, mejor haberla dejado como una amiga del trabajo. Tilda Swinton (Las Crónicas de Narnia) y Chiwetel Ejiofor (12 años de esclavitud) haciendo de La Anciana y el otro brujo negrata quizá sea la relación que mas merezca la pena aunque no se explora una mierda hubiera sido interesante haberla visto mas profundizada. Me quedo con el papel de Benedict Wong (Marco polo) un bibliotecario que no pretende ser más de lo que es con escenas muy divertidas. Like Iron Man Entonces el guion… No hay mucho que decir, cae en los típicos errores de las películas de marvel además que si me dices que lo ha escrito Christoper Nolan me lo creo a medias, no voy a nombrar a los verdaderos guionistas porque a excepción del snob de Scott Derrickson (El exorcismo de Emily Rose) quien también es el director de la cinta, a los otros dos no los conoce ni su madre. El guión es lo que es, una mierda que se apresura por terminar lo que está haciendo sin importar que deje por el camino, ve al tiempo como un enemigo, por este motivo el final estan poca cosa. ¿Humor forzado again? Si pero no, no llega al nivel de gilipollez de Ultrón en Los Vengadores 2 o lo que coño fuera el Mandarín de Iron Man 3, tampoco digo que sea tan divertida como Guardianes de la Galaxia o Ant-man pero quitando alguna que otra metedura de pata, con los chistes de Doctor Strange te ríes. ¿Algo más? Espero que no Lo siento pero si, estoy harto de las putas escenas post-créditos, apenas 1 minuto de información solo para confirmar lo que ya sabemos antes de ir al cine, la puta secuela, y sin contar que no era 1 sino 2 jodidas escenas, claro que podría haberme ido y no verlas pero luego quedo de impaciente y de hater con la gente que la vi, estos fanboys. Además de la manía de “unir” las películas para crear un universo, lo que hacen es liar más al espectador, ya en Los Vengadores 2 se notaba que a Joss Whedon le costaba manejar a tanto personaje en la pantalla no me quiero imaginar en Los Vengadores 3 y 4 con tanto superheroe suelto. Vivan los mandalas aéreos ¿Me vas a decir algo bueno de la película o vas a seguir de hater? Si claro, las escenas de acción están muy logradas, la actuación del Doctor es de sobresaliente, las ropas que llevan los actores están geniales y se ven muy reales y el CGI es una gozada para que engañarnos. Termina ya por favor Conclusión: Doctor Strange es más de lo mismo, podrían haber puesto empeño en pulir algunos fallos, tampoco hace falta que todas las cintas de Marvel sean Capitán América: El Soldado de Invierno, disfrutas viéndola si no le prestas demasiada atención, si quieres pasar un rato entretenido no dudes en ir a verla. ", "child": "2274_1\t2274_2"}