{"name": "228", "parent": "", "title": "10 Bad Habits That Could Be Destroying Your Happiness", "sentences": [{"d4d2": "10 Bad Habits That Could Be Destroying Your Happiness"}, {"1e7d": "Bad habits keep you unhappy, keep you stuck, make you do things you don’t want to do."}, {"3dde": "Start today, right now, to eliminate them from your life. When you do, you’ll open up room for new positive habits to take their place."}, {"368b": "Any or all of these 10 habits is a good place to start because maybe all of them are destroying your happiness."}, {"320b": "1. Postponing your goals."}, {"5a01": "Procrastination will keep you from reaching your goals more effectively than any external obstacle. Start today by taking one baby step toward a goal. Do the same the next day. It doesn’t have to be much, but do something every day. Consistent effort is the key."}, {"2420": "2. Living a mediocre life."}, {"6db8": "Step out of your comfort zone and remember that many of the greatest pleasures in life include some degree of risk. Happiness is not about avoiding the painful things in life; it’s about chasing our dreams and aspirations."}, {"7ebc": "3. Self-sabotaging."}, {"0a7c": "Any pattern that keeps disrupting your growth, your success, or your happiness has to stop. What’s keeping you stuck? Find it and then find your way out of it. Develop patterns that support your highest goals."}, {"95b3": "4. Running from your problems."}, {"74b2": "Start chasing the right things instead of running from what’s wrong. Don’t look at problems as something to be ashamed of or avoid, but as an opportunity to learn and grow."}, {"f255": "5. Worrying about your flaws."}, {"3f26": "Everyone has flaws, but it’s up to you whether you’ll give them the power to keep you from doing what you want. Instead, take your flaws, find your strength in them, and make them work for you."}, {"643d": "6. Trying to control everything."}, {"a550": "Control is an illusion. If you try to control everything, you will quickly become frustrated and angry. Instead, remember the only thing you can reliably control is your own reaction to the things going on around you and within you. To have command of yourself is a much more reliable source of happiness than trying to control everything around you."}, {"d41c": "7. Blaming others."}, {"fadb": "Nothing great has ever come from blaming or accusing others. The way to really be happy is to be accountable for your actions and responsible for your own consequences."}, {"2562": "8. Trying to be something you are not."}, {"fd7e": "Why do so many people want to be something they are not? What would it take to be happy with who you are, and celebrate your gifts and talents? Don’t compare yourself to anyone else. Look in the mirror and see who you are — and build on that foundation."}, {"19e1": "9. Living in the past or in the future."}, {"1179": "The trick is to stay in the present long enough to truly figure out what makes you happy. What memories can you create today? What choices can you make to start creating happiness?"}, {"3275": "10. Constant complaining."}, {"ab40": "Did you wake up in a bed? Do you have shelter and food? Don’t take the necessities of life for granted. Be grateful for all of life’s blessings: food, health, relationships, your mind, your heart. When you catch yourself complaining, take a moment to look around you in gratitude."}, {"51a4": "At the end of the day, quit the habits that do not serve you, that do not make you happy, and find the things that will make you happier and healthier in mind, body, and heart."}, {"d41d": "The Leadership Gap: What Gets Between You And Your Greatness"}, {"c02c": "If you are serious about finding your happiness and you want to get rid of your bad habits."}, {"436e": "Get my new book. The Leadership Gap: What Gets Between You and Your Greatness. Every pre-order book comes with great bonuses and gifts."}, {"da5f": "Found this post useful? Kindly tap the ❤ button below! Thank You!"}, {"72c3": "Lolly Daskal is the founder of Lead from Within, a global leadership, executive coaching, and business consulting firm. You can connect with her on Twitter, Linkedin, Facebook and Google+"}, {"def4": "Originally published on Inc.com"}], "content": "10 Bad Habits That Could Be Destroying Your Happiness Bad habits keep you unhappy, keep you stuck, make you do things you don’t want to do. Start today, right now, to eliminate them from your life. When you do, you’ll open up room for new positive habits to take their place. Any or all of these 10 habits is a good place to start because maybe all of them are destroying your happiness. 1. Postponing your goals. Procrastination will keep you from reaching your goals more effectively than any external obstacle. Start today by taking one baby step toward a goal. Do the same the next day. It doesn’t have to be much, but do something every day. Consistent effort is the key. 2. Living a mediocre life. Step out of your comfort zone and remember that many of the greatest pleasures in life include some degree of risk. Happiness is not about avoiding the painful things in life; it’s about chasing our dreams and aspirations. 3. Self-sabotaging. Any pattern that keeps disrupting your growth, your success, or your happiness has to stop. What’s keeping you stuck? Find it and then find your way out of it. Develop patterns that support your highest goals. 4. Running from your problems. Start chasing the right things instead of running from what’s wrong. Don’t look at problems as something to be ashamed of or avoid, but as an opportunity to learn and grow. 5. Worrying about your flaws. Everyone has flaws, but it’s up to you whether you’ll give them the power to keep you from doing what you want. Instead, take your flaws, find your strength in them, and make them work for you. 6. Trying to control everything. Control is an illusion. If you try to control everything, you will quickly become frustrated and angry. Instead, remember the only thing you can reliably control is your own reaction to the things going on around you and within you. To have command of yourself is a much more reliable source of happiness than trying to control everything around you. 7. Blaming others. Nothing great has ever come from blaming or accusing others. The way to really be happy is to be accountable for your actions and responsible for your own consequences. 8. Trying to be something you are not. Why do so many people want to be something they are not? What would it take to be happy with who you are, and celebrate your gifts and talents? Don’t compare yourself to anyone else. Look in the mirror and see who you are — and build on that foundation. 9. Living in the past or in the future. The trick is to stay in the present long enough to truly figure out what makes you happy. What memories can you create today? What choices can you make to start creating happiness? 10. Constant complaining. Did you wake up in a bed? Do you have shelter and food? Don’t take the necessities of life for granted. Be grateful for all of life’s blessings: food, health, relationships, your mind, your heart. When you catch yourself complaining, take a moment to look around you in gratitude. At the end of the day, quit the habits that do not serve you, that do not make you happy, and find the things that will make you happier and healthier in mind, body, and heart. The Leadership Gap: What Gets Between You And Your Greatness If you are serious about finding your happiness and you want to get rid of your bad habits. Get my new book. The Leadership Gap: What Gets Between You and Your Greatness. Every pre-order book comes with great bonuses and gifts. Found this post useful? Kindly tap the ❤ button below! Thank You! Lolly Daskal is the founder of Lead from Within, a global leadership, executive coaching, and business consulting firm. You can connect with her on Twitter, Linkedin, Facebook and Google+ Originally published on Inc.com ", "child": "228_1\t228_2\t228_3\t228_4"}