{"name": "2282", "parent": "", "title": "The New Spider-Man Video Game Looks To Bring That Marvel Magic", "sentences": [{"b39b": "The New Spider-Man Video Game Looks To Bring That Marvel Magic"}, {"0af6": "A new yet promising direction from the film universe."}, {"79fe": "Announced Monday during 2016’s E3 convention, Marvel is working with developer Insomniac Games to bring Spider-Man back to video games. Marvel Creative Games Director Bill Rosemann explained a mold-breaking return to the virtual world for the hero, something many gamers have clamored for since the critically-acclaimed Spider-Man 2 game that Activision published back in 2004. This was the introduction to 3-D webslinging, as the player could explore Manhattan, Roosevelt, Ellis, and Liberty Islands as freely as Spidey. Here’s the teaser for the new Playstation 4 exclusive:"}, {"c9a1": "By teaming up with Insomniac Games, Marvel is tapping the same goofy humor that spawned the studio’s character-driven hits Ratchet & Clank (with two leads so popular that it was recently adapted into a film of the same name) and Sunset Overdrive. Marvel has already begun focusing on his Queens ‘hood in his brief cameo in Captain America: Civil War to build out the character in different ways than his previous screen adaptations’ reliance on the “pretty dork” trope."}, {"f0dc": "However, this isn’t the high school whippersnapper from Spider-Man: Homecoming. The press blurb below the teaser promises an “experienced Peter Parker” comfortable with his role and skills as a crimefighter. That means no worrying about origins and no more suffering through any more of Uncle Ben’s foreshadowing speeches."}, {"3ca8": "The new costume debuting in the teaser has hints and flairs to separate him from his much younger on-screen counterpart while reminding everyone that Marvel takes any opportunity to flex its character-building skills. White, a new addition to Spidey’s color scheme, appears on shimmering forearm and hand gauntlets while taking over his spider emblem. The same style of white metal accent on the soles of his feet suggest a new modern upgrade to his webshooters and landing tech. Maybe this’ll explain how he never breaks his legs. While the costume is more sophisticated and stylized than the rather minimalist costumes in the comics and film versions of Spidey, you can also see the same retractable-lens eyes that impressed us in Civil War."}, {"2c29": "Even if you’re a traditionalist and you don’t like the new look, Insomniac Games has a history of outrageous costume design and unlockables, so get ready to cycle through the history of Spidey’s outfits (even if they won’t be as entertaining as a kangaroo codpiece). It’s also a safe bet that they’ll be using locomotion and animation engine implemented in Sunset Overdrive, a game that prized acrobatic experimentation over all else, to generate the same kind of improvisational web-slinging. Sassy parkour, with a Deadpool-esque penchant for breaking the fourth wall, Sunset Overdrive is one of the most innovative games of the last generation and a great basis for Spidey to build off of."}, {"9b63": "Ratchet & Clank and Sunset Overdrive also have a knack for motor-mouthed leads that jump and bounce off of, well, everything. Those are the two biggest components for building a Spider-Man ANYTHING, so the hero is in good hands. The teaser doesn’t give us too much of Peter’s jokey combat disposition, but there’s so much excellent web combat, it’s hard to ask for more. Just a quick peek at the Sunset Overdrive trailer gives you a taste of the tongue-in-cheek tone that mixes with over-the-top action — something pushed to the extreme in Deadpool, but looks metered to a realistic amount of mayhem for the webslinger."}, {"5dd2": "Meanwhile, with the casting of Donald Glover, the new Spider-Man movie is building up a good head of diverse steam. It’s good to have you back in the right hands, Spidey."}, {"a252": "Read On:"}, {"0f09": "The Time That Spider-Man Saved My LifeSometimes, the most unexpected things become a lifeline.filmschoolrejects.com"}, {"0f79": "The Future of Spider-Man at the MoviesA Spectacular, Speculative Dive Into Peter Parker’s Future on the Big Screen.filmschoolrejects.com"}, {"36b1": "Captain America: Civil War and the Enduring Magic of Spider-ManThe best on-screen version of Spidey yet also reminds us of why the character is so beloved.filmschoolrejects.com"}, {"4ac0": "Iron Man, Spider-Man, and ParenthoodWhy Tony and Peter’s relationship is the most important part of Civil War.filmschoolrejects.com"}], "content": "The New Spider-Man Video Game Looks To Bring That Marvel Magic A new yet promising direction from the film universe. Announced Monday during 2016’s E3 convention, Marvel is working with developer Insomniac Games to bring Spider-Man back to video games. Marvel Creative Games Director Bill Rosemann explained a mold-breaking return to the virtual world for the hero, something many gamers have clamored for since the critically-acclaimed Spider-Man 2 game that Activision published back in 2004. This was the introduction to 3-D webslinging, as the player could explore Manhattan, Roosevelt, Ellis, and Liberty Islands as freely as Spidey. Here’s the teaser for the new Playstation 4 exclusive: By teaming up with Insomniac Games, Marvel is tapping the same goofy humor that spawned the studio’s character-driven hits Ratchet & Clank (with two leads so popular that it was recently adapted into a film of the same name) and Sunset Overdrive. Marvel has already begun focusing on his Queens ‘hood in his brief cameo in Captain America: Civil War to build out the character in different ways than his previous screen adaptations’ reliance on the “pretty dork” trope. However, this isn’t the high school whippersnapper from Spider-Man: Homecoming. The press blurb below the teaser promises an “experienced Peter Parker” comfortable with his role and skills as a crimefighter. That means no worrying about origins and no more suffering through any more of Uncle Ben’s foreshadowing speeches. The new costume debuting in the teaser has hints and flairs to separate him from his much younger on-screen counterpart while reminding everyone that Marvel takes any opportunity to flex its character-building skills. White, a new addition to Spidey’s color scheme, appears on shimmering forearm and hand gauntlets while taking over his spider emblem. The same style of white metal accent on the soles of his feet suggest a new modern upgrade to his webshooters and landing tech. Maybe this’ll explain how he never breaks his legs. While the costume is more sophisticated and stylized than the rather minimalist costumes in the comics and film versions of Spidey, you can also see the same retractable-lens eyes that impressed us in Civil War. Even if you’re a traditionalist and you don’t like the new look, Insomniac Games has a history of outrageous costume design and unlockables, so get ready to cycle through the history of Spidey’s outfits (even if they won’t be as entertaining as a kangaroo codpiece). It’s also a safe bet that they’ll be using locomotion and animation engine implemented in Sunset Overdrive, a game that prized acrobatic experimentation over all else, to generate the same kind of improvisational web-slinging. Sassy parkour, with a Deadpool-esque penchant for breaking the fourth wall, Sunset Overdrive is one of the most innovative games of the last generation and a great basis for Spidey to build off of. Ratchet & Clank and Sunset Overdrive also have a knack for motor-mouthed leads that jump and bounce off of, well, everything. Those are the two biggest components for building a Spider-Man ANYTHING, so the hero is in good hands. The teaser doesn’t give us too much of Peter’s jokey combat disposition, but there’s so much excellent web combat, it’s hard to ask for more. Just a quick peek at the Sunset Overdrive trailer gives you a taste of the tongue-in-cheek tone that mixes with over-the-top action — something pushed to the extreme in Deadpool, but looks metered to a realistic amount of mayhem for the webslinger. Meanwhile, with the casting of Donald Glover, the new Spider-Man movie is building up a good head of diverse steam. It’s good to have you back in the right hands, Spidey. Read On: The Time That Spider-Man Saved My LifeSometimes, the most unexpected things become a lifeline.filmschoolrejects.com The Future of Spider-Man at the MoviesA Spectacular, Speculative Dive Into Peter Parker’s Future on the Big Screen.filmschoolrejects.com Captain America: Civil War and the Enduring Magic of Spider-ManThe best on-screen version of Spidey yet also reminds us of why the character is so beloved.filmschoolrejects.com Iron Man, Spider-Man, and ParenthoodWhy Tony and Peter’s relationship is the most important part of Civil War.filmschoolrejects.com ", "child": "2282_12282_12282_1"}