{"name": "2307", "parent": "", "title": "Dear Mr. Leto: Please Stop Visiting Our Children’s Hospital Dressed As The Joker", "sentences": [{"6339": "Dear Mr. Leto: Please Stop Visiting Our Children’s Hospital Dressed As The Joker"}, {"f29d": "From: Molly BohmerCommunications DirectorEast Suburban Children’s Hospital"}, {"5393": "Dear Mr. Leto,"}, {"f518": "I am not familiar with your work. I understand that you are an actor of some note, and may have even won an Academy Award (congratulations). Under normal circumstances we would be delighted to have your involvement in promoting or fundraising for our pediatric medical facility. But I write to you today to ask that you, please, from the bottom of my heart, stop visiting our children’s hospital dressed as the Joker."}, {"6392": "It is beyond inappropriate."}, {"a62a": "During your first visit, there was a great deal of confusion about who you were, and why you were here, dressed as what was described to me over the phone as “some kind of European monster.” It was not until a younger orderly recognized you from the commercials that word spread that a movie star was visiting us, and in character as his comic book alter-ego no less."}, {"402f": "However, in these circumstances, the event is usually requested by the families and planned well in advance with the help of the celebrity’s publicity team and a third-party charity organization. You simply double-parked in our ambulance zone in what appeared to be a car covered in imitation (?) diamonds, flung your arms wide, and declared yourself to be “Gotham’s reckoning.” If you recall, you then kicked open the door where nine-year-old Sarah Matthews was recuperating from a common inguinal hernia repair, shouted “Where’s the birthday girl?!” and produced a live tarantula that you allowed to crawl freely on your face."}, {"6765": "This was just the first visit."}, {"415b": "Forty-eight hours later, you had returned, this time menacing our receptionist, Gabrielle, with a solid-gold switchblade and offering to “free her mind … from itself.” Before security could be called, you darted into the room of Simon Gonzalez (six), threw off your magenta fur coat and screamed that you were “the forgotten child of a dead god,” while pouring hot candle wax on your chest tattoos."}, {"2eeb": "At this point, I feel I must point out that Simon was only in our care for a minor collarbone fracture. In fact, unlike in the cases of many celebrity visits common in our industry, none of the patients you have visited are terminally ill. The vast majority of our patients are recovering from common inpatient procedures, like tonsillitis or appendectomies."}, {"839c": "But even under the noblest of circumstances, your repeated, unsolicited, flamboyant in-character appearances are disruptive at best, and at worse, traumatizing. I am only passingly familiar with Batman’s arch-nemesis, but I cannot recall any film or comic book where he perched on the bed of a six-year-old girl in the process of having her ear fluids drained, blasting a strobe light in her face while he drank ladybugs from a champagne flute."}, {"ac96": "However, credit where credit is due — like the real Joker, you have always managed to disappear before the police arrived."}, {"9782": "Mr. Leto, I will not pretend to understand show business, anymore than I expect you to understand the business of running marketing and communications for a mid-size family care center. But I have to believe that the process of putting on your Joker make-up takes many hours, and probably the assistance of other people. To say nothing of your elaborate wardrobe — did you purchase it upon completion of the film? Did you provide your own clothing for this movie?"}, {"ce70": "I won’t even ask what you’re doing in Lincoln, Nebraska to begin with."}, {"c299": "These are all questions I shouldn’t be occupying my day with, just as you should not be prancing through our halls in a crushed velvet S.S. Uniform, announcing in a sing-song caterwaul that the “angel of fun has arrived to topple the alphabet blocks of our precious widdle society.” Inflection yours."}, {"b138": "I can only conceive of one incident which may have confused you into feeling this behavior was acceptable: The one-time visit from Chris “Captain America” Evans, to eight-year-old Charlotte Bennington before her partial liver resection. Perhaps you saw this photo on our Instagram account and considered it an open invitation. Charlotte, thankfully, has made a full recovery, and we have not seen Chris Evans since. We wish him well."}, {"4f82": "Please, sir, if there is anything decent left in your psyche from your previous life, a life before whatever cocktail of method acting and recreational substances turned you into this ill-begotten, mumbly glam-rock skeleton, please, please, please, allow our community’s children to heal in peace."}, {"2c89": "We used to comfort them that monsters weren’t real. You have made us liars."}, {"97b3": "Sincerely,Molly BohmerCommunications Director, ESCH"}, {"1730": "P.S. Please let us know if you can put us in contact with Will Smith regarding M.C.’ing our upcoming board of directors gala. E-mail is fine."}], "content": "Dear Mr. Leto: Please Stop Visiting Our Children’s Hospital Dressed As The Joker From: Molly BohmerCommunications DirectorEast Suburban Children’s Hospital Dear Mr. Leto, I am not familiar with your work. I understand that you are an actor of some note, and may have even won an Academy Award (congratulations). Under normal circumstances we would be delighted to have your involvement in promoting or fundraising for our pediatric medical facility. But I write to you today to ask that you, please, from the bottom of my heart, stop visiting our children’s hospital dressed as the Joker. It is beyond inappropriate. During your first visit, there was a great deal of confusion about who you were, and why you were here, dressed as what was described to me over the phone as “some kind of European monster.” It was not until a younger orderly recognized you from the commercials that word spread that a movie star was visiting us, and in character as his comic book alter-ego no less. However, in these circumstances, the event is usually requested by the families and planned well in advance with the help of the celebrity’s publicity team and a third-party charity organization. You simply double-parked in our ambulance zone in what appeared to be a car covered in imitation (?) diamonds, flung your arms wide, and declared yourself to be “Gotham’s reckoning.” If you recall, you then kicked open the door where nine-year-old Sarah Matthews was recuperating from a common inguinal hernia repair, shouted “Where’s the birthday girl?!” and produced a live tarantula that you allowed to crawl freely on your face. This was just the first visit. Forty-eight hours later, you had returned, this time menacing our receptionist, Gabrielle, with a solid-gold switchblade and offering to “free her mind … from itself.” Before security could be called, you darted into the room of Simon Gonzalez (six), threw off your magenta fur coat and screamed that you were “the forgotten child of a dead god,” while pouring hot candle wax on your chest tattoos. At this point, I feel I must point out that Simon was only in our care for a minor collarbone fracture. In fact, unlike in the cases of many celebrity visits common in our industry, none of the patients you have visited are terminally ill. The vast majority of our patients are recovering from common inpatient procedures, like tonsillitis or appendectomies. But even under the noblest of circumstances, your repeated, unsolicited, flamboyant in-character appearances are disruptive at best, and at worse, traumatizing. I am only passingly familiar with Batman’s arch-nemesis, but I cannot recall any film or comic book where he perched on the bed of a six-year-old girl in the process of having her ear fluids drained, blasting a strobe light in her face while he drank ladybugs from a champagne flute. However, credit where credit is due — like the real Joker, you have always managed to disappear before the police arrived. Mr. Leto, I will not pretend to understand show business, anymore than I expect you to understand the business of running marketing and communications for a mid-size family care center. But I have to believe that the process of putting on your Joker make-up takes many hours, and probably the assistance of other people. To say nothing of your elaborate wardrobe — did you purchase it upon completion of the film? Did you provide your own clothing for this movie? I won’t even ask what you’re doing in Lincoln, Nebraska to begin with. These are all questions I shouldn’t be occupying my day with, just as you should not be prancing through our halls in a crushed velvet S.S. Uniform, announcing in a sing-song caterwaul that the “angel of fun has arrived to topple the alphabet blocks of our precious widdle society.” Inflection yours. I can only conceive of one incident which may have confused you into feeling this behavior was acceptable: The one-time visit from Chris “Captain America” Evans, to eight-year-old Charlotte Bennington before her partial liver resection. Perhaps you saw this photo on our Instagram account and considered it an open invitation. Charlotte, thankfully, has made a full recovery, and we have not seen Chris Evans since. We wish him well. Please, sir, if there is anything decent left in your psyche from your previous life, a life before whatever cocktail of method acting and recreational substances turned you into this ill-begotten, mumbly glam-rock skeleton, please, please, please, allow our community’s children to heal in peace. We used to comfort them that monsters weren’t real. You have made us liars. Sincerely,Molly BohmerCommunications Director, ESCH P.S. Please let us know if you can put us in contact with Will Smith regarding M.C.’ing our upcoming board of directors gala. E-mail is fine. ", "child": "2307_1\t2307_2\t2307_3\t2307_4\t2307_5\t2307_6\t2307_7\t2307_8\t2307_9\t2307_10\t2307_11\t2307_12\t2307_13"}