{"name": "231", "parent": "", "title": "Beat the competition by sticking to the basics", "sentences": [{"76ab": "Beat the competition by sticking to the basics"}, {"a1ef": "At first glance the stories of Bubba Gump and Planet Hollywood restaurants seem similar: exploit famous brands to get people to eat your food."}, {"8da8": "Bubba Gump was the shrimping company Forrest Gump created in the Hollywood movie starring Tom Hanks. The film grossed over $677 million dollars worldwide. Bubba Gump was just a fictional company, but of course once there was a restaurant named after it, people went in droves."}, {"639b": "And in 1990, a guy who used to run a London pub had a genius idea. He could open up a chain of restaurants, and give shares of the company to famous celebrities who would endorse those restaurants. Planet Hollywood was born. And it grew fast. At its peak Planet Hollywood had 87 restaurants in 36 countries. Stallone, Schwarzenegger, Whoopi Goldberg, Bruce Willis, all had their names attached."}, {"0873": "But the stories rapidly diverge."}, {"c115": "Today, Planet Hollywood is a shell of itself. The celebrities ran away. Bankruptcy protection was needed multiple times. And now there’s just a few restaurants left."}, {"fb9b": "Bubba Gump stood strong, now in 44 locations. And the place is packed. Be prepared for a long wait to get a table at ours in Chicago’s Navy Pier."}, {"fd93": "So what went wrong for Planet Hollywood? How did famous people fail at growing a restaurant? Or what did Bubba Gump do so right?"}, {"6fc7": "Scott Barnett was the CEO of Bubba Gump during its start and rise. Scott wrote a book called Gumption, and did rounds of podcasts and interviews when his book was published. His story is packed with interesting anecdotes about what made them successful."}, {"1288": "One that stuck out the most was how Scott hired waitstaff. He purposefully chose to hire inexperienced folks — as long as they were nice and happy people."}, {"5e7f": "His philosophy was they could train someone to wait tables, but not to be nice."}, {"d166": "But obviously, training wait staff who haven’t ever worked in a restaurant still isn’t an easy task. This is where they made an interesting innovation. First, they’d only give waitstaff sections of 3 tables. Keep their responsibility small."}, {"72bd": "Next, he realized that a table didn’t need a dedicated waitperson. That’s not the “job to be done” of a restaurant. You go because often you don’t want to cook and serve this meal yourself. Who cares if you have 1 waitperson or 10? As long as folks are nice and the food is hot and tasty."}, {"24ba": "So Scott implemented a system at Bubba Gump where you could flip a sign on the table. Red meant you needed service. Blue meant you were all good."}, {"a7ef": "Pic from TripAdvisor"}, {"b30d": "By implementing a system like this, you weren’t obligated to “waive down your waiter”. A common gesture most waiters abhor."}, {"4260": "You could just move the sign to red, and any available Bubba Gump staff member would show up to help. That way inexperienced people who were falling behind could rely on others to help out in a pinch."}, {"bc47": "Simple idea. Genius results."}, {"ab6b": "Bubba Gump’s service was excellent and in Scott’s words they were able to deliver: “Hot food hot. Cold food cold”."}, {"5e73": "Scott nailed the basics."}, {"9640": "At one point while Planet Hollywood was rising, Scott met a Planet Hollywood executive who told Scott, “Planet Hollywood isn’t in the restaurant business, we’re in the trademark business.”"}, {"3de4": "It’s clear where Planet Hollywood put their priorities."}, {"8693": "Planet Hollywood is an example of a company that got too clever with their attempt at growing a business. They forgot the basics. And their customers felt fooled."}, {"3835": "Sure you might be able to get people in the door because of a famous person’s endorsement. But if your service sucks and your food takes forever to get to the table, they won’t come back."}, {"feae": "There’s a lot of businesses like that. They think the key to success is a clever innovation they dreamt up, or marketing plan that’s so smart they should win an award."}, {"4306": "But they forget people often just want the basics."}, {"fe8d": "Get the basics right and you might just get enough repeat business to keep you open for the long term."}, {"58fb": "P.S. If you enjoyed this article, please help spread it by clicking that ❤ below. And if you are interested in more, you should follow my YouTube channel, where I share more about how history, psychology, and science can help us come up with better ideas and start businesses. And if you need a simple system to track leads and follow-ups you should give Highrise a look."}], "content": "Beat the competition by sticking to the basics At first glance the stories of Bubba Gump and Planet Hollywood restaurants seem similar: exploit famous brands to get people to eat your food. Bubba Gump was the shrimping company Forrest Gump created in the Hollywood movie starring Tom Hanks. The film grossed over $677 million dollars worldwide. Bubba Gump was just a fictional company, but of course once there was a restaurant named after it, people went in droves. And in 1990, a guy who used to run a London pub had a genius idea. He could open up a chain of restaurants, and give shares of the company to famous celebrities who would endorse those restaurants. Planet Hollywood was born. And it grew fast. At its peak Planet Hollywood had 87 restaurants in 36 countries. Stallone, Schwarzenegger, Whoopi Goldberg, Bruce Willis, all had their names attached. But the stories rapidly diverge. Today, Planet Hollywood is a shell of itself. The celebrities ran away. Bankruptcy protection was needed multiple times. And now there’s just a few restaurants left. Bubba Gump stood strong, now in 44 locations. And the place is packed. Be prepared for a long wait to get a table at ours in Chicago’s Navy Pier. So what went wrong for Planet Hollywood? How did famous people fail at growing a restaurant? Or what did Bubba Gump do so right? Scott Barnett was the CEO of Bubba Gump during its start and rise. Scott wrote a book called Gumption, and did rounds of podcasts and interviews when his book was published. His story is packed with interesting anecdotes about what made them successful. One that stuck out the most was how Scott hired waitstaff. He purposefully chose to hire inexperienced folks — as long as they were nice and happy people. His philosophy was they could train someone to wait tables, but not to be nice. But obviously, training wait staff who haven’t ever worked in a restaurant still isn’t an easy task. This is where they made an interesting innovation. First, they’d only give waitstaff sections of 3 tables. Keep their responsibility small. Next, he realized that a table didn’t need a dedicated waitperson. That’s not the “job to be done” of a restaurant. You go because often you don’t want to cook and serve this meal yourself. Who cares if you have 1 waitperson or 10? As long as folks are nice and the food is hot and tasty. So Scott implemented a system at Bubba Gump where you could flip a sign on the table. Red meant you needed service. Blue meant you were all good. Pic from TripAdvisor By implementing a system like this, you weren’t obligated to “waive down your waiter”. A common gesture most waiters abhor. You could just move the sign to red, and any available Bubba Gump staff member would show up to help. That way inexperienced people who were falling behind could rely on others to help out in a pinch. Simple idea. Genius results. Bubba Gump’s service was excellent and in Scott’s words they were able to deliver: “Hot food hot. Cold food cold”. Scott nailed the basics. At one point while Planet Hollywood was rising, Scott met a Planet Hollywood executive who told Scott, “Planet Hollywood isn’t in the restaurant business, we’re in the trademark business.” It’s clear where Planet Hollywood put their priorities. Planet Hollywood is an example of a company that got too clever with their attempt at growing a business. They forgot the basics. And their customers felt fooled. Sure you might be able to get people in the door because of a famous person’s endorsement. But if your service sucks and your food takes forever to get to the table, they won’t come back. There’s a lot of businesses like that. They think the key to success is a clever innovation they dreamt up, or marketing plan that’s so smart they should win an award. But they forget people often just want the basics. Get the basics right and you might just get enough repeat business to keep you open for the long term. P.S. If you enjoyed this article, please help spread it by clicking that ❤ below. And if you are interested in more, you should follow my YouTube channel, where I share more about how history, psychology, and science can help us come up with better ideas and start businesses. And if you need a simple system to track leads and follow-ups you should give Highrise a look. ", "child": "231_1\t231_2\t231_3\t231_4\t231_5231_1\t231_2\t231_3\t231_4\t231_5231_1\t231_2\t231_3\t231_4\t231_5"}