{"name": "232", "parent": "", "title": "Rise of Subscriptions and the Fall of Advertising", "sentences": [{"1c2f": "Rise of Subscriptions and the Fall of Advertising"}, {"9a12": "We talk a lot about how individual startups disrupt existing business models — such as Airbnb vs. hotels or Craigslist vs. newspaper classifieds — but we sometimes fail to appreciate the more massive disruptions that cut across many industries at once. Ecommerce is one example: People increasingly choose to purchase everything from airplane tickets to underwear via digital storefronts. Consumer habits are slow to change, but when they do change they cut across categories — and even iconic companies with hundreds of years of history can fall away."}, {"b258": "I believe we are on the eve of another “macro disruption” based on consumer habit change: Media consumption is moving from advertising to subscription-supported models. We are getting closer to a consumer-controlled world, and every company that spends money on advertising will be forced to find a new way to do business."}, {"32ee": "Subscriptions are Growing Everywhere"}, {"5f7f": "The hottest topic in the media business right now is the unexpected growth in paid subscriptions. Newspapers — left for dead many times in the past few years — are now seeing a resurgence thanks to direct sales. The New York Times gained 130,000 subscribers in November and the WSJ is up 300%. Netflix and Amazon Prime continue torrid growth with their ad-free experiences, and Hulu and YouTube are racing to launch their own subscription models. Spotify and SiriusXM have proven that people will pay for ad-free radio, and Pandora recently bragged that it will rapidly erase last year’s $343MM net loss thanks to the launch of $9.99 monthly subscriptions."}, {"2d7c": "Like ecommerce, in which people start in one category and get more comfortable buying online across the board, people who subscribe to one media channel often start a subscription habit in others. Over time we choose to get our video with Netflix, music with Spotify, news with the Washington Post, dinner from Blue Apron, and meditation from Headspace."}, {"eb94": "Businesses and consumers are learning to make this subscription habit easier and more appealing. The media players are getting better at pricing and building beautiful, fast and personalized app experiences. Customers increasingly appreciate direct engagement with the channel, and we find ways to afford subscriptions by, say, cutting the cable cord."}, {"0653": "Advertising is Worsening for Everyone"}, {"c123": "While there are many explanations for the growth of subscriptions, it is undeniably driven in part by a frustration with the onslaught of advertising that we are subject to. Advertising has always been a “tax” on our attention. Historically the interruptions were limited and we had little control over the handful of channels we read, watched and listened to. But the rise of digital media has put more control in people’s hands. When you give people freedom to get what they want, when they want it, they will seek to get it without paying that attention tax."}, {"ad73": "The “free media with advertising” grand bargain seems more like a bad deal as the value of our attention spans rise. We have more media choices and distractions than ever before in our lives. We are multi-tasking and keeping up with many things at once. Pausing to watch an advertisement is a speed bump in our busy lives. And once we cut some of these interruptions out with subscriptions, the remaining ads we do see feel even more painful — thus shifting the value equation toward skipping and subscribing."}, {"cc24": "“Advertising is a tax on the poor” — Scott Galloway"}, {"40ea": "The media channels haven’t been in love with the advertising-supported business model lately, either. Not only do they make a lot less money by trading in analog dollars for digital dimes, but they are under constant pressure to keep up with the rapid pace change. Big brands are forcing publishers to cover the cost of 3rd party verification thanks to a system that is being overwhelmed by fraud. There is a “stack” of ad-tech add-ons from venture-backed startups and sexier social networks that are taking a growing piece of every budget."}, {"84eb": "All that cost is on top of the investment in a highly-paid sales force that must continually wine and dine clients to stay in the preference set. And don’t get me started on the Taboola and Outbrain models that add click-bait to the bottom of every page in order to try and wring out just a little more revenue — at the cost of brand equity and journalistic integrity."}, {"5a3c": "At some point you stop hitting your head against the wall and look for a new path."}, {"9664": "Subscriptions Improve the Product"}, {"281b": "A funny thing happens once you completely focus your business around making paying customers happy: Your product gets better. The mobile game makers discovered this a few years ago, moving from tiny, crappy banner ads at the bottom of screens to a model in which the free game is so amazing that people willingly fork over dollars to upgrade their experience further. Candy Crush grew revenue by 35% by deleting ads."}, {"703e": "“If you interrupt with ads, [people] play less.” — Sebastian Knutsson, Chief Creative Officer, King Games"}, {"eaa3": "In the media world, Netflix should be credited as the first to recognize this way back when it was a DVD mailer. Netflix recognized that it would be in danger of losing subscribers once they had seen all of the movies on their wish lists. So it invested in an algorithm to make personalized recommendations of movies and television shows that people had not heard of or were not sure about. This algorithm became so important that the company offered multiple million-dollar payouts to teams that could slightly improve it."}, {"97e9": "So it was logical for Netflix to start investing in its own original programming — and no surprise that Amazon, Hulu, and YouTube have followed suit. The race is on to produce more quality content to keep subscribers happy, often using data from their direct relationships to learn about their preferences and continually improve. We’ve started to see industry awards for their programs, and the top talent in the business is lining up for the chance to create for their platforms. We’re on the verge of a golden age of quality writing, film and music as these platforms compete to delight their subscribers."}, {"40af": "And the cost of ad sales and an ad-tech stack can go toward even better product. There’s no reason to wine and dine Ford and Nike at the Cannes Lions Advertising Festival when you’re wining and dining Harrison Ford and Nicole Kidman at the Cannes Film Festival."}, {"4987": "Prepare for a Wave of Investment"}, {"83b0": "As the market sniffs the winds of change toward subscription models, we’ll see investors shift dollars, too. Pandora is moving to a subscription because of profit pressure from public investors who are tired of subsidizing an ad business model that hasn’t materialized. The investor community in general has become enamored with Software as Service (SaaS) subscription business models because they bring predictable, recurring revenues."}, {"68f9": "As investors pour money into these models, we might see the rise of a new generation of media channels that skip the ad model and go straight to subscriptions. Medium is on the verge of this approach. It recently axed its ad sales organization and announced that a subscription model is on the way. The Information, which features in-depth reporting on the tech industry, is growing quickly with a subscription-only product. Perhaps the last hot attempt at a new ad-supported model, Buzzfeed, missed its growth targets and continues to bleed cash. We’ll see investors applying metrics like Average Revenue Per User (ARPU) to public and private companies — and see such variation as New York Times’ $140 vs. Buzzfeed’s $1."}, {"d760": "Ironically, the consumer products industry — which is the biggest mass advertiser on the planet — has also discovered the value of subscription business models. Dollar Shave Club was purchased by Unilever for $1 billion last year, in part to help this massive company build a new direct sales path. At our company, Ahalogy, CPG clients are investing ahead of the curve with their retail partners on models such as Kroger’s ClickList and Amazon’s Subscribe & Save. If CPG brands can make it onto ongoing shopping lists, marketers, too, can spend less money and time fighting to remind consumers to choose them before every store visit. Like in content, all that saved ad money can go into better products, margins or prices."}, {"0e6c": "Wither Social Networks?"}, {"e9c9": "A habitual shift toward subscription media apps leave one wondering how this might impact social networks such as Facebook/Instagram, Snapchat, Pinterest and Twitter. Each of them is completely reliant on an advertising-based business model and they seem a long way from asking for direct payment from their users. Cracks are starting to show here. Twitter mobile revenue is expected to decline this year. Facebook has warned investors that it simply can’t put more ads into its users’ feeds without losing them."}, {"8a25": "The baton of “the last place to reach your audience at scale” might pass from live sporting events to social media platforms in the years ahead. We might even see ad prices jump quickly and rise ahead of inflation as major marketers bid up prices to appear on the feeds we check religiously."}, {"3245": "But at some point you have to listen to your audience. The more people get used to an ad-free experience, the more painful those interruptions will feel. Even personalized ads are more likely to be seen as creepy rather than relevant. We might start hitting the New York Times app (that we paid for) instead of Twitter to get quality, trusted news. We might pull up our YouTube Red accounts instead of taking a gamble on whatever Facebook forces into our feeds. No business is safe from changing consumer habits: Even the omnipotent NFL saw its ratings decline this year — and it’s considering a cut in the number of ads during games to recapture lost viewers."}, {"f9e4": "The other challenge social networks are due to face is the fact that they own little or no content themselves. Facebook, Pinterest, Twitter and Snapchat all rely on sharing content that is created elsewhere. Maybe this is why Facebook, too, is starting to invest in original video. At some point the social networks will be forced to choose between their users and advertisers. (I’ll save the next post for my belief on what will happen next…)"}, {"1296": "Today’s advertising model won’t be disrupted by subscriptions this year or next, but the signs of change are growing. Any major marketing leader that is not planning for a world when their consumer is unreachable by traditional, interruptive advertising is like the proverbial frog in a slowly simmering pot."}, {"b31b": "Bob Gilbreath is co-founder and CEO of Ahalogy, the Passion to Purchase Platform, and author of The Next Evolution of Marketing: Connect with your Customers by Marketing with Meaning. Follow him on Twitter."}, {"4f23": "UPDATES: (I’ll add a few relevant links below over time)"}], "content": "Rise of Subscriptions and the Fall of Advertising We talk a lot about how individual startups disrupt existing business models — such as Airbnb vs. hotels or Craigslist vs. newspaper classifieds — but we sometimes fail to appreciate the more massive disruptions that cut across many industries at once. Ecommerce is one example: People increasingly choose to purchase everything from airplane tickets to underwear via digital storefronts. Consumer habits are slow to change, but when they do change they cut across categories — and even iconic companies with hundreds of years of history can fall away. I believe we are on the eve of another “macro disruption” based on consumer habit change: Media consumption is moving from advertising to subscription-supported models. We are getting closer to a consumer-controlled world, and every company that spends money on advertising will be forced to find a new way to do business. Subscriptions are Growing Everywhere The hottest topic in the media business right now is the unexpected growth in paid subscriptions. Newspapers — left for dead many times in the past few years — are now seeing a resurgence thanks to direct sales. The New York Times gained 130,000 subscribers in November and the WSJ is up 300%. Netflix and Amazon Prime continue torrid growth with their ad-free experiences, and Hulu and YouTube are racing to launch their own subscription models. Spotify and SiriusXM have proven that people will pay for ad-free radio, and Pandora recently bragged that it will rapidly erase last year’s $343MM net loss thanks to the launch of $9.99 monthly subscriptions. Like ecommerce, in which people start in one category and get more comfortable buying online across the board, people who subscribe to one media channel often start a subscription habit in others. Over time we choose to get our video with Netflix, music with Spotify, news with the Washington Post, dinner from Blue Apron, and meditation from Headspace. Businesses and consumers are learning to make this subscription habit easier and more appealing. The media players are getting better at pricing and building beautiful, fast and personalized app experiences. Customers increasingly appreciate direct engagement with the channel, and we find ways to afford subscriptions by, say, cutting the cable cord. Advertising is Worsening for Everyone While there are many explanations for the growth of subscriptions, it is undeniably driven in part by a frustration with the onslaught of advertising that we are subject to. Advertising has always been a “tax” on our attention. Historically the interruptions were limited and we had little control over the handful of channels we read, watched and listened to. But the rise of digital media has put more control in people’s hands. When you give people freedom to get what they want, when they want it, they will seek to get it without paying that attention tax. The “free media with advertising” grand bargain seems more like a bad deal as the value of our attention spans rise. We have more media choices and distractions than ever before in our lives. We are multi-tasking and keeping up with many things at once. Pausing to watch an advertisement is a speed bump in our busy lives. And once we cut some of these interruptions out with subscriptions, the remaining ads we do see feel even more painful — thus shifting the value equation toward skipping and subscribing. “Advertising is a tax on the poor” — Scott Galloway The media channels haven’t been in love with the advertising-supported business model lately, either. Not only do they make a lot less money by trading in analog dollars for digital dimes, but they are under constant pressure to keep up with the rapid pace change. Big brands are forcing publishers to cover the cost of 3rd party verification thanks to a system that is being overwhelmed by fraud. There is a “stack” of ad-tech add-ons from venture-backed startups and sexier social networks that are taking a growing piece of every budget. All that cost is on top of the investment in a highly-paid sales force that must continually wine and dine clients to stay in the preference set. And don’t get me started on the Taboola and Outbrain models that add click-bait to the bottom of every page in order to try and wring out just a little more revenue — at the cost of brand equity and journalistic integrity. At some point you stop hitting your head against the wall and look for a new path. Subscriptions Improve the Product A funny thing happens once you completely focus your business around making paying customers happy: Your product gets better. The mobile game makers discovered this a few years ago, moving from tiny, crappy banner ads at the bottom of screens to a model in which the free game is so amazing that people willingly fork over dollars to upgrade their experience further. Candy Crush grew revenue by 35% by deleting ads. “If you interrupt with ads, [people] play less.” — Sebastian Knutsson, Chief Creative Officer, King Games In the media world, Netflix should be credited as the first to recognize this way back when it was a DVD mailer. Netflix recognized that it would be in danger of losing subscribers once they had seen all of the movies on their wish lists. So it invested in an algorithm to make personalized recommendations of movies and television shows that people had not heard of or were not sure about. This algorithm became so important that the company offered multiple million-dollar payouts to teams that could slightly improve it. So it was logical for Netflix to start investing in its own original programming — and no surprise that Amazon, Hulu, and YouTube have followed suit. The race is on to produce more quality content to keep subscribers happy, often using data from their direct relationships to learn about their preferences and continually improve. We’ve started to see industry awards for their programs, and the top talent in the business is lining up for the chance to create for their platforms. We’re on the verge of a golden age of quality writing, film and music as these platforms compete to delight their subscribers. And the cost of ad sales and an ad-tech stack can go toward even better product. There’s no reason to wine and dine Ford and Nike at the Cannes Lions Advertising Festival when you’re wining and dining Harrison Ford and Nicole Kidman at the Cannes Film Festival. Prepare for a Wave of Investment As the market sniffs the winds of change toward subscription models, we’ll see investors shift dollars, too. Pandora is moving to a subscription because of profit pressure from public investors who are tired of subsidizing an ad business model that hasn’t materialized. The investor community in general has become enamored with Software as Service (SaaS) subscription business models because they bring predictable, recurring revenues. As investors pour money into these models, we might see the rise of a new generation of media channels that skip the ad model and go straight to subscriptions. Medium is on the verge of this approach. It recently axed its ad sales organization and announced that a subscription model is on the way. The Information, which features in-depth reporting on the tech industry, is growing quickly with a subscription-only product. Perhaps the last hot attempt at a new ad-supported model, Buzzfeed, missed its growth targets and continues to bleed cash. We’ll see investors applying metrics like Average Revenue Per User (ARPU) to public and private companies — and see such variation as New York Times’ $140 vs. Buzzfeed’s $1. Ironically, the consumer products industry — which is the biggest mass advertiser on the planet — has also discovered the value of subscription business models. Dollar Shave Club was purchased by Unilever for $1 billion last year, in part to help this massive company build a new direct sales path. At our company, Ahalogy, CPG clients are investing ahead of the curve with their retail partners on models such as Kroger’s ClickList and Amazon’s Subscribe & Save. If CPG brands can make it onto ongoing shopping lists, marketers, too, can spend less money and time fighting to remind consumers to choose them before every store visit. Like in content, all that saved ad money can go into better products, margins or prices. Wither Social Networks? A habitual shift toward subscription media apps leave one wondering how this might impact social networks such as Facebook/Instagram, Snapchat, Pinterest and Twitter. Each of them is completely reliant on an advertising-based business model and they seem a long way from asking for direct payment from their users. Cracks are starting to show here. Twitter mobile revenue is expected to decline this year. Facebook has warned investors that it simply can’t put more ads into its users’ feeds without losing them. The baton of “the last place to reach your audience at scale” might pass from live sporting events to social media platforms in the years ahead. We might even see ad prices jump quickly and rise ahead of inflation as major marketers bid up prices to appear on the feeds we check religiously. But at some point you have to listen to your audience. The more people get used to an ad-free experience, the more painful those interruptions will feel. Even personalized ads are more likely to be seen as creepy rather than relevant. We might start hitting the New York Times app (that we paid for) instead of Twitter to get quality, trusted news. We might pull up our YouTube Red accounts instead of taking a gamble on whatever Facebook forces into our feeds. No business is safe from changing consumer habits: Even the omnipotent NFL saw its ratings decline this year — and it’s considering a cut in the number of ads during games to recapture lost viewers. The other challenge social networks are due to face is the fact that they own little or no content themselves. Facebook, Pinterest, Twitter and Snapchat all rely on sharing content that is created elsewhere. Maybe this is why Facebook, too, is starting to invest in original video. At some point the social networks will be forced to choose between their users and advertisers. (I’ll save the next post for my belief on what will happen next…) Today’s advertising model won’t be disrupted by subscriptions this year or next, but the signs of change are growing. Any major marketing leader that is not planning for a world when their consumer is unreachable by traditional, interruptive advertising is like the proverbial frog in a slowly simmering pot. Bob Gilbreath is co-founder and CEO of Ahalogy, the Passion to Purchase Platform, and author of The Next Evolution of Marketing: Connect with your Customers by Marketing with Meaning. Follow him on Twitter. UPDATES: (I’ll add a few relevant links below over time) ", "child": "232_1\t232_2\t232_3\t232_4\t232_5"}