{"name": "2325", "parent": "", "title": "Cognitive bias cheat sheet, simplified", "sentences": [{"5ed6": "Cognitive bias cheat sheet, simplified"}, {"a4e2": "Thinking is hard because of 4 universal conundrums."}, {"6492": "By John Manoogian III. Get the poster: http://bit.ly/bias-poster"}, {"6790": "Four months ago I attempted to synthesize Wikipedia’s crazy list of cognitive biases, and after banging my head against the wall for weeks, came up with this Cognitive Bias Cheat Sheet which John Manoogian III beautifully organized into the above poster. It’s a 12-minute read, and I didn’t actually expect anyone to read it, but four months later it’s been viewed 700,000 times and recommended almost 5,000 times! Since then, I’ve started working on a book proposal (get on the email list!) around these topics, and wanted to start by creating an actual cheat sheet that doesn’t take so long to read. Here it is…"}, {"3a79": "The 4 conundrums of the universe that lead to all biases"}, {"6c85": "There are 4 qualities of the universe that limit our own intelligence and the intelligence of every other person, collective, organism, machine, alien, or imaginable god. All 200ish of our known biases are attempts to work around these conundrums!"}, {"ff82": "🙈 1st conundrum: there’s too much information"}, {"2391": "The 1st conundrum is that there’s too much information in the universe for any individual within the universe to process it all. We have our 5 senses (or up to a dozen depending on how you divide them up), and we’re located at points within vast planes of space and time. So there’s a lot of information out there (outside your house, across the street, on the other side of the world, throughout the galaxy, and back in time) that we have missed and will continue to miss. When we talk of super artificial intelligences that eventually dwarf the power of our own brains, even they will be constrained in this way. They will likely install and network some insane number of cameras and other sensors around the world, and maybe deploy rockets to continue mapping our solar system and beyond, but the limitations of material, fuel, the speed of light, and the lack of time travel options guarantee that full coverage of the universe’s information will never even be remotely possible."}, {"b062": "🔮 2nd conundrum: there’s not enough meaning"}, {"9389": "The 2nd conundrum is that the process of turning raw information into something meaningful requires connecting the dots between the limited information that’s made it to you and the catalog of mental models, beliefs, symbols, and associations that you’ve stored from previous experiences. Connecting dots is an imprecise and subjective process, resulting in a story that’s a blend of new and old information. Your new stories are being built out of the bricks of your old stories, and so will always have a hint of past qualities and textures that may not have actually been there. A simple example of this is how the first automobile was referred to as a horseless carriage, because the closest thing to it had horses attached. If a super artificial intelligence was loaded with every symbol and story on the internet and in our collective human minds, it would still not be able to interpret new information without using old symbols (and a ton of those symbols and stories would be pretty wonky and mostly useless… I do not envy that super A.I. the task of sifting through all of that)."}, {"6b58": "⌛️ 3rd conundrum: there’s not enough time & resources"}, {"6437": "The 3rd conundrum is that there just isn’t enough time in the moment/day/lifetime to thoroughly consider and analyze all possibilities to make sure we’re making the right decisions and taking the right actions. Even deciding what you should have for lunch would take longer than the remaining life of the universe if you truly considered all of your options. A super artificial intelligence would have this same problem, and until recently was the “proof” that a computer would never be able to beat the world champion in Go — there are 129,960 possible board positions after just the first round of moves alone, at that number grows exponentially after every additional round. Then, someone built a computer that did what humans do and just crossed its eyes and picked the best move based on intuition built up over watching millions of games, thus succumbing to the 3rd conundrum."}, {"cc17": "💾 4th conundrum: there’s not enough memory"}, {"e1a6": "The 4th conundrum is that there’s not enough space in our brains, or in all of the matter in the universe, to store all the raw information, all the symbols and stories, and all of the past decisions that we’ve made. We have to be strategic about what we choose to remember, and what we choose to let slide back out of our minds. We can try to generalize, or identify patterns, to save some space, but those create problems of their own. A super artificial intelligence that could remember everything it ever saw or processed would then create a situation where the 4 conundrums applied to retrieving its own memories."}, {"93df": "✨ A real cheat sheet"}, {"2acd": "My challenge was to attempt to reduce all 200+ known cognitive biases into something that could be used as your phone’s lock screen wallpaper. Here are the 4 conundrums and the 20 categories of bias that relate to each one:"}, {"9657": "I’m sure real visual artists and designers could come up with a version of that cheat sheet that is 100% less ugly. If you do, post it as a reply to this post! In the meantime, that at least captures the highest level summary of how our brains deal with the 4 conundrums."}, {"e851": "Here’s a version of it you can download, and here’s one you can turn into your phone’s lock screen. Enjoy!"}, {"dc3c": "🏊 Dive in further"}, {"38ef": "Each of the bullet points under the 4 conundrums has a whole bunch of specific biases (about 200 in total) that have been discovered and studied by various scientists over the last 50 years, but if you remember the 4 conundrums and the 20 categories of bias, you basically have everything you need to know. To learn more about all of those, read the original cheat sheet post:"}, {"271b": "Cognitive bias cheat sheetBecause thinking is hard.betterhumans.coach.me"}, {"9bd1": "There’s so much more to explore here! And area that’s really interesting me lately is thinking about if there’s a way to draw/visualize our thought processes so that they’re easier to share and talk about."}, {"a882": "🎟 Get notified about the book’s progress"}, {"aca4": "I’m not sure where this is going to take me in 2017, but if you’d like to get a email whenever significant progress is made on my as-yet-untitled book on cognitive biases, systems thinking, and beliefs, you can sign up to be notified here and/or follow this Medium publication."}, {"fee6": "Have a nice day!"}], "content": "Cognitive bias cheat sheet, simplified Thinking is hard because of 4 universal conundrums. By John Manoogian III. Get the poster: http://bit.ly/bias-poster Four months ago I attempted to synthesize Wikipedia’s crazy list of cognitive biases, and after banging my head against the wall for weeks, came up with this Cognitive Bias Cheat Sheet which John Manoogian III beautifully organized into the above poster. It’s a 12-minute read, and I didn’t actually expect anyone to read it, but four months later it’s been viewed 700,000 times and recommended almost 5,000 times! Since then, I’ve started working on a book proposal (get on the email list!) around these topics, and wanted to start by creating an actual cheat sheet that doesn’t take so long to read. Here it is… The 4 conundrums of the universe that lead to all biases There are 4 qualities of the universe that limit our own intelligence and the intelligence of every other person, collective, organism, machine, alien, or imaginable god. All 200ish of our known biases are attempts to work around these conundrums! 🙈 1st conundrum: there’s too much information The 1st conundrum is that there’s too much information in the universe for any individual within the universe to process it all. We have our 5 senses (or up to a dozen depending on how you divide them up), and we’re located at points within vast planes of space and time. So there’s a lot of information out there (outside your house, across the street, on the other side of the world, throughout the galaxy, and back in time) that we have missed and will continue to miss. When we talk of super artificial intelligences that eventually dwarf the power of our own brains, even they will be constrained in this way. They will likely install and network some insane number of cameras and other sensors around the world, and maybe deploy rockets to continue mapping our solar system and beyond, but the limitations of material, fuel, the speed of light, and the lack of time travel options guarantee that full coverage of the universe’s information will never even be remotely possible. 🔮 2nd conundrum: there’s not enough meaning The 2nd conundrum is that the process of turning raw information into something meaningful requires connecting the dots between the limited information that’s made it to you and the catalog of mental models, beliefs, symbols, and associations that you’ve stored from previous experiences. Connecting dots is an imprecise and subjective process, resulting in a story that’s a blend of new and old information. Your new stories are being built out of the bricks of your old stories, and so will always have a hint of past qualities and textures that may not have actually been there. A simple example of this is how the first automobile was referred to as a horseless carriage, because the closest thing to it had horses attached. If a super artificial intelligence was loaded with every symbol and story on the internet and in our collective human minds, it would still not be able to interpret new information without using old symbols (and a ton of those symbols and stories would be pretty wonky and mostly useless… I do not envy that super A.I. the task of sifting through all of that). ⌛️ 3rd conundrum: there’s not enough time & resources The 3rd conundrum is that there just isn’t enough time in the moment/day/lifetime to thoroughly consider and analyze all possibilities to make sure we’re making the right decisions and taking the right actions. Even deciding what you should have for lunch would take longer than the remaining life of the universe if you truly considered all of your options. A super artificial intelligence would have this same problem, and until recently was the “proof” that a computer would never be able to beat the world champion in Go — there are 129,960 possible board positions after just the first round of moves alone, at that number grows exponentially after every additional round. Then, someone built a computer that did what humans do and just crossed its eyes and picked the best move based on intuition built up over watching millions of games, thus succumbing to the 3rd conundrum. 💾 4th conundrum: there’s not enough memory The 4th conundrum is that there’s not enough space in our brains, or in all of the matter in the universe, to store all the raw information, all the symbols and stories, and all of the past decisions that we’ve made. We have to be strategic about what we choose to remember, and what we choose to let slide back out of our minds. We can try to generalize, or identify patterns, to save some space, but those create problems of their own. A super artificial intelligence that could remember everything it ever saw or processed would then create a situation where the 4 conundrums applied to retrieving its own memories. ✨ A real cheat sheet My challenge was to attempt to reduce all 200+ known cognitive biases into something that could be used as your phone’s lock screen wallpaper. Here are the 4 conundrums and the 20 categories of bias that relate to each one: I’m sure real visual artists and designers could come up with a version of that cheat sheet that is 100% less ugly. If you do, post it as a reply to this post! In the meantime, that at least captures the highest level summary of how our brains deal with the 4 conundrums. Here’s a version of it you can download, and here’s one you can turn into your phone’s lock screen. Enjoy! 🏊 Dive in further Each of the bullet points under the 4 conundrums has a whole bunch of specific biases (about 200 in total) that have been discovered and studied by various scientists over the last 50 years, but if you remember the 4 conundrums and the 20 categories of bias, you basically have everything you need to know. To learn more about all of those, read the original cheat sheet post: Cognitive bias cheat sheetBecause thinking is hard.betterhumans.coach.me There’s so much more to explore here! And area that’s really interesting me lately is thinking about if there’s a way to draw/visualize our thought processes so that they’re easier to share and talk about. 🎟 Get notified about the book’s progress I’m not sure where this is going to take me in 2017, but if you’d like to get a email whenever significant progress is made on my as-yet-untitled book on cognitive biases, systems thinking, and beliefs, you can sign up to be notified here and/or follow this Medium publication. Have a nice day! ", "child": "2325_1\t2325_2\t2325_3\t2325_4\t2325_5\t2325_6\t2325_7\t2325_8\t2325_9\t2325_10\t2325_11\t2325_12\t2325_13\t2325_14\t2325_15\t2325_16\t2325_17\t2325_18\t2325_19\t2325_20\t2325_21\t2325_22\t2325_23\t2325_24\t2325_252325_1\t2325_2\t2325_3\t2325_4\t2325_5\t2325_6\t2325_7\t2325_8\t2325_9\t2325_10\t2325_11\t2325_12\t2325_13\t2325_14\t2325_15\t2325_16\t2325_17\t2325_18\t2325_19\t2325_20\t2325_21\t2325_22\t2325_23\t2325_24\t2325_25"}