{"name": "2336", "parent": "", "title": "Blood, Sweat and Fears — Part 3 of 3", "sentences": [{"3bc3": "Blood, Sweat and Fears — Part 3 of 3"}, {"f77e": "How I got my first steady design job."}, {"e870": "I learned to “Trust The Process”. Near the end of my struggle, I was getting up every morning to go to a labor job where I would do mindless tasks for hours and then get paid at the end of the day. There was no magic, no passion and no thought of what was next anymore. I just did my job and got money to eat and live to do it again and again. See, with this portfolio, I was expecting too much of myself too soon. I was waiting for inspiration and a crystal clear image to come to me before I would allow myself to begin which was getting me nowhere. I simply stopped waiting for that and started looking at it like a set of mindless tasks that needed to get done in a set order I created. During some of my botched interviews a recruiter told me to learn WordPress in order to even be looked seriously. I did, it took me a few months and 4 iterations but I finally built my portfolio with a very Call-to-Actionisc title….HireMikeNathan.com. I found a very useful theme and a set of plugins that made it look professional and then I created the content. My new images were not artistic at all but they where more like examples of categories now. I stared with 5 of each. 5 print designs, 5 presentation designs, 5 logo designs…etc. I was no longer emotionally attached to the work which allowed me to not give a fuck if it was bad or not. I just made like 15 of each and picked the best 5 to add to the site. It was now mindless work, just like my manual labor job. Easy to do and easy to reproduce as I added more categories to my site. And just like that, one day during all this work and prepping and interviewing and pain I got the call. I went to the interview beaten and broken but still managed to compose thoughtful and honest answers. They say, it’s when you stop looking for love is when love finds you. That love will be effortless and organic. That is pretty much how my first interview and steady graphic design job with Apothecom went. As of today, I have been freelancing there through my recuitment agency Synertec for about 5 months and I have a good feeling I may be there for a long time. My name is Mike Nathan and my career goal has always been to become a full-time designer for a great company and have a side hustle that allows for full creative freedom and extra income. It took me 10 long years to become that graphic designer at what is truly a great company."}, {"d5dd": "Now then, let’s talk about that Side Hustle!…… (coming soon)."}], "content": "Blood, Sweat and Fears — Part 3 of 3 How I got my first steady design job. I learned to “Trust The Process”. Near the end of my struggle, I was getting up every morning to go to a labor job where I would do mindless tasks for hours and then get paid at the end of the day. There was no magic, no passion and no thought of what was next anymore. I just did my job and got money to eat and live to do it again and again. See, with this portfolio, I was expecting too much of myself too soon. I was waiting for inspiration and a crystal clear image to come to me before I would allow myself to begin which was getting me nowhere. I simply stopped waiting for that and started looking at it like a set of mindless tasks that needed to get done in a set order I created. During some of my botched interviews a recruiter told me to learn WordPress in order to even be looked seriously. I did, it took me a few months and 4 iterations but I finally built my portfolio with a very Call-to-Actionisc title….HireMikeNathan.com. I found a very useful theme and a set of plugins that made it look professional and then I created the content. My new images were not artistic at all but they where more like examples of categories now. I stared with 5 of each. 5 print designs, 5 presentation designs, 5 logo designs…etc. I was no longer emotionally attached to the work which allowed me to not give a fuck if it was bad or not. I just made like 15 of each and picked the best 5 to add to the site. It was now mindless work, just like my manual labor job. Easy to do and easy to reproduce as I added more categories to my site. And just like that, one day during all this work and prepping and interviewing and pain I got the call. I went to the interview beaten and broken but still managed to compose thoughtful and honest answers. They say, it’s when you stop looking for love is when love finds you. That love will be effortless and organic. That is pretty much how my first interview and steady graphic design job with Apothecom went. As of today, I have been freelancing there through my recuitment agency Synertec for about 5 months and I have a good feeling I may be there for a long time. My name is Mike Nathan and my career goal has always been to become a full-time designer for a great company and have a side hustle that allows for full creative freedom and extra income. It took me 10 long years to become that graphic designer at what is truly a great company. Now then, let’s talk about that Side Hustle!…… (coming soon). ", "child": "2336_1"}