{"name": "2342", "parent": "", "title": "Is Hard Work More Important Than Intelligence?", "sentences": [{"7a81": "Sundays."}, {"261e": "Is Hard Work More Important Than Intelligence?"}, {"9302": "As I was coming up with an example of a personal story I could tell where hard work beat success (and I can think of a few), I realized something:"}, {"40af": "It doesn’t matter."}, {"21b9": "Why? Because hard work is your only option, either way. Let’s say you took an IQ test, right now. There are two possible outcomes:"}, {"e04b": "I’d like to ask you:"}, {"a26f": "Why should that change your work ethic in any way, whatsoever?"}, {"60db": "Would you work less hard if you found out you were a genius? Would you work harder if you found out you weren’t?"}, {"18f7": "I hope not. I hope you know that, if you have a goal, your best shot is to work hard for it until you get it. No matter the circumstances."}, {"ab9e": "There are a lot of things you can’t control:"}, {"4a61": "How hard you work is just about the only thing you can control. Not just that, but it maximizes all the other things."}, {"5fa9": "I don’t know what your dream is, but I hope you have one. When you really commit yourself to it, and make a promise to work hard for it, only one of two things can happen:"}, {"f051": "Because the only other option is to give up. To quit. To look at your dream and say:"}, {"8b1e": "“You’re not worth it. You’re too hard. I can’t chase you. I’m not strong enough.”"}, {"0b7f": "I don’t know about you, but that’s not an option for me. We only get one life."}, {"93b7": "I wrote this on a Sunday. At school, working. Less than 10 people were there. But I showed up anyway. Because for me, that’s part of being committed to my dream."}, {"fa4a": "Whatever the right answer to this question is, I hope you’ll choose hard work either way."}, {"e4ae": "If this inspired you, please hit the ❤ so someone else will see it. Thank you!"}, {"7220": "I write more here. I learned part of this lesson from Casey Neistat. This was originally published at www.quora.com."}], "content": "Sundays. Is Hard Work More Important Than Intelligence? As I was coming up with an example of a personal story I could tell where hard work beat success (and I can think of a few), I realized something: It doesn’t matter. Why? Because hard work is your only option, either way. Let’s say you took an IQ test, right now. There are two possible outcomes: I’d like to ask you: Why should that change your work ethic in any way, whatsoever? Would you work less hard if you found out you were a genius? Would you work harder if you found out you weren’t? I hope not. I hope you know that, if you have a goal, your best shot is to work hard for it until you get it. No matter the circumstances. There are a lot of things you can’t control: How hard you work is just about the only thing you can control. Not just that, but it maximizes all the other things. I don’t know what your dream is, but I hope you have one. When you really commit yourself to it, and make a promise to work hard for it, only one of two things can happen: Because the only other option is to give up. To quit. To look at your dream and say: “You’re not worth it. You’re too hard. I can’t chase you. I’m not strong enough.” I don’t know about you, but that’s not an option for me. We only get one life. I wrote this on a Sunday. At school, working. Less than 10 people were there. But I showed up anyway. Because for me, that’s part of being committed to my dream. Whatever the right answer to this question is, I hope you’ll choose hard work either way. If this inspired you, please hit the ❤ so someone else will see it. Thank you! I write more here. I learned part of this lesson from Casey Neistat. This was originally published at www.quora.com. ", "child": "2342_1\t2342_2\t2342_3\t2342_4\t2342_5\t2342_6\t2342_7\t2342_8\t2342_92342_1\t2342_2\t2342_3\t2342_4\t2342_5\t2342_6\t2342_7\t2342_8\t2342_92342_1\t2342_2\t2342_3\t2342_4\t2342_5\t2342_6\t2342_7\t2342_8\t2342_9"}