{"name": "2345", "parent": "", "title": "David Foster Wallace on the Power of Introversion", "sentences": [{"1397": "David Foster Wallace on the Power of Introversion"}, {"d039": "Growing up, I hated myself for being shy."}, {"8093": "I wanted to be one of the naturals—one of those kids with a lot of friends that ruled the schoolyard with an easy social grace. Each time I fumbled in front of a girl, each time I ate alone in the cafeteria, I hated myself a bit more."}, {"f24c": "Why am I so dysfunctional? I asked myself."}, {"74f8": "Later, I decided to fight my shy side. Through self-help books and daily practice, I would “reprogram” my personality… I would become a natural."}, {"a2f9": "All that effort payed off. I’m a lot less shy today."}, {"170d": "But during all that time, I never considered that there could be an advantage to being shy."}, {"7147": "I only changed my mind after reading David Lipsky’s Although Of Course You End Up Becoming Yourself. In it, Lipsky follows David Foster Wallace on a 5-day book tour for Infinite Jest — which Time magazine considers one of the 100 greatest novels of the last century."}, {"a014": "Here’s Wallace talking about his shyness:"}, {"82a0": "Well, I think being shy basically means being self-absorbed to the extent that it makes it difficult to be around other people. For instance, if I’m hanging out with you, I can’t even tell whether I like you or not, because I’m too worried about whether you like me. It’s stressful and unpleasant or whatever. And I have elements of that shyness in me."}, {"cc5c": "Wallace goes on to explain how shyness can benefit to the writer:"}, {"61e2": "But there’s also, the shyness feeds into some of the stuff that you need as a fiction writer. Like: Part of the shyness for me is, it’s very easy for me to play this game of, What do you want? What will the effect of this be on you? You know? It’s this kind of mental chess. Which in personal intercourse? Makes things very difficult."}, {"df75": "But in writing, when I think a lot of what you’re doing — there are very few innocent sentences in writing. You’ve gotta know not just how it looks and sounds to you. But you’ve gotta be able plausibly to project what an alien consciousness will make of it. So that there’s a kind of split consciousness that I think makes it difficult to deal with people in the real world. For a writer. But that actually comes in handy."}, {"5ada": "When I read this, something clicked for me."}, {"4325": "Oh, I thought. I’ve been playing mental chess all my life."}, {"6747": "Every social struggle I’ve been through has been a mental battlefield — a battlefield where I’ve learned how to get inside people’s heads and “see” how they think."}, {"b447": "Shyness, it seems, has an incredible upside: it teaches us to empathize."}, {"c4cd": "Is it really shyness?"}, {"357e": "Literary genius or not, David Foster Wallace fought depression all his life. In 2008, his wife came home to find him with a rope around his neck."}, {"81a7": "If suicidal depression is the tradeoff for the benefits of “mental chess,” it is — in my mind — not worth it."}, {"2cbd": "But what if it is not shyness that leads to mental chess but one of its close cousins, introversion?"}, {"03de": "Shyness vs Introversion"}, {"6309": "Contrary to what most people believe, shyness and introversion are not the same thing."}, {"caf0": "In her book Quiet, Susan Cain explains the difference:"}, {"1797": "“Shyness is the fear of social disapproval or humiliation, while introversion is a preference for environments that are not overstimulating. Shyness is inherently painful; introversion is not.”"}, {"b1de": "Introversion is, as far as we understand, mostly innate. Shyness, on the other hand, is something we acquire — put a introvert into the world and there’s a high chance she’ll develop a fear of social humiliation."}, {"fe5e": "That’s good news."}, {"af90": "If shyness is developed, it means that shyness can be overcome."}, {"0632": "Mommy, I want to be an introvert."}, {"05fa": "Ten years ago, if you had asked me if I wanted to be born again as an extrovert, it would have been an easy yes."}, {"f6b7": "Now, it’s an easy no."}, {"fbad": "I’ve realized that introvert have all sorts of advantages — many of them related to Wallace’s mental chess."}, {"a68e": "Here’s Sebastian Marshall, author of Gateless (one of my all-time favorite books), on the introvert advantage:"}, {"a360": "“It seems much easier for introverts to learn how to navigate the social and political worlds than for extroverts to learn how to be alone and reflective without going insane. And being able to be reflective — to self-modify, study, analyze, synthesize — is probably the master meta-skill for nearly all of thriving at life.”"}, {"0157": "Introverts are naturally better at reflecting. This gives us the ability to learn and affect outcomes. We tend to start out lower (shy in school) but our “ceiling” for improvement is also much higher."}, {"0bae": "If you look at high-level performers, says Marshall, you see a lot of introspective types:"}, {"e9e8": "Introverts pretty consistently run the world."}, {"63a1": "George Washington, of course, was hyper-introverted. Churchill? Introvert. (He drank a hell of a lot when around people.) Hamilton? Introvert. Napoleon? Introvert. Tokugawa? Introvert."}, {"694e": "That’s before getting into all your favorite inventors, scientists, etc. Introverts, the vast majority of them."}, {"8c2a": "I’m not saying introverts are better than extroverts. Rather, I agree with Susan Cain when she says there are many kinds of people in the world:"}, {"4196": "“We know from myths and fairy tales that there are many different kinds of powers in this world. One child is given a light saber, another a wizard’s education. The trick is not to amass all the different kinds of power, but to use well the kind you’ve been granted.”"}, {"def5": "This was my roll of the dice, and it’s not all bad."}, {"afc8": "I am an introvert, and that’s okay."}, {"7f5e": "Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here."}], "content": "David Foster Wallace on the Power of Introversion Growing up, I hated myself for being shy. I wanted to be one of the naturals—one of those kids with a lot of friends that ruled the schoolyard with an easy social grace. Each time I fumbled in front of a girl, each time I ate alone in the cafeteria, I hated myself a bit more. Why am I so dysfunctional? I asked myself. Later, I decided to fight my shy side. Through self-help books and daily practice, I would “reprogram” my personality… I would become a natural. All that effort payed off. I’m a lot less shy today. But during all that time, I never considered that there could be an advantage to being shy. I only changed my mind after reading David Lipsky’s Although Of Course You End Up Becoming Yourself. In it, Lipsky follows David Foster Wallace on a 5-day book tour for Infinite Jest — which Time magazine considers one of the 100 greatest novels of the last century. Here’s Wallace talking about his shyness: Well, I think being shy basically means being self-absorbed to the extent that it makes it difficult to be around other people. For instance, if I’m hanging out with you, I can’t even tell whether I like you or not, because I’m too worried about whether you like me. It’s stressful and unpleasant or whatever. And I have elements of that shyness in me. Wallace goes on to explain how shyness can benefit to the writer: But there’s also, the shyness feeds into some of the stuff that you need as a fiction writer. Like: Part of the shyness for me is, it’s very easy for me to play this game of, What do you want? What will the effect of this be on you? You know? It’s this kind of mental chess. Which in personal intercourse? Makes things very difficult. But in writing, when I think a lot of what you’re doing — there are very few innocent sentences in writing. You’ve gotta know not just how it looks and sounds to you. But you’ve gotta be able plausibly to project what an alien consciousness will make of it. So that there’s a kind of split consciousness that I think makes it difficult to deal with people in the real world. For a writer. But that actually comes in handy. When I read this, something clicked for me. Oh, I thought. I’ve been playing mental chess all my life. Every social struggle I’ve been through has been a mental battlefield — a battlefield where I’ve learned how to get inside people’s heads and “see” how they think. Shyness, it seems, has an incredible upside: it teaches us to empathize. Is it really shyness? Literary genius or not, David Foster Wallace fought depression all his life. In 2008, his wife came home to find him with a rope around his neck. If suicidal depression is the tradeoff for the benefits of “mental chess,” it is — in my mind — not worth it. But what if it is not shyness that leads to mental chess but one of its close cousins, introversion? Shyness vs Introversion Contrary to what most people believe, shyness and introversion are not the same thing. In her book Quiet, Susan Cain explains the difference: “Shyness is the fear of social disapproval or humiliation, while introversion is a preference for environments that are not overstimulating. Shyness is inherently painful; introversion is not.” Introversion is, as far as we understand, mostly innate. Shyness, on the other hand, is something we acquire — put a introvert into the world and there’s a high chance she’ll develop a fear of social humiliation. That’s good news. If shyness is developed, it means that shyness can be overcome. Mommy, I want to be an introvert. Ten years ago, if you had asked me if I wanted to be born again as an extrovert, it would have been an easy yes. Now, it’s an easy no. I’ve realized that introvert have all sorts of advantages — many of them related to Wallace’s mental chess. Here’s Sebastian Marshall, author of Gateless (one of my all-time favorite books), on the introvert advantage: “It seems much easier for introverts to learn how to navigate the social and political worlds than for extroverts to learn how to be alone and reflective without going insane. And being able to be reflective — to self-modify, study, analyze, synthesize — is probably the master meta-skill for nearly all of thriving at life.” Introverts are naturally better at reflecting. This gives us the ability to learn and affect outcomes. We tend to start out lower (shy in school) but our “ceiling” for improvement is also much higher. If you look at high-level performers, says Marshall, you see a lot of introspective types: Introverts pretty consistently run the world. George Washington, of course, was hyper-introverted. Churchill? Introvert. (He drank a hell of a lot when around people.) Hamilton? Introvert. Napoleon? Introvert. Tokugawa? Introvert. That’s before getting into all your favorite inventors, scientists, etc. Introverts, the vast majority of them. I’m not saying introverts are better than extroverts. Rather, I agree with Susan Cain when she says there are many kinds of people in the world: “We know from myths and fairy tales that there are many different kinds of powers in this world. One child is given a light saber, another a wizard’s education. The trick is not to amass all the different kinds of power, but to use well the kind you’ve been granted.” This was my roll of the dice, and it’s not all bad. I am an introvert, and that’s okay. Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here. ", "child": "2345_1\t2345_2\t2345_3\t2345_4\t2345_5\t2345_6\t2345_7\t2345_8\t2345_9\t2345_10\t2345_11\t2345_12\t2345_13\t2345_14\t2345_15\t2345_16\t2345_17\t2345_18\t2345_19\t2345_20\t2345_21\t2345_22\t2345_23\t2345_24\t2345_252345_1\t2345_2\t2345_3\t2345_4\t2345_5\t2345_6\t2345_7\t2345_8\t2345_9\t2345_10\t2345_11\t2345_12\t2345_13\t2345_14\t2345_15\t2345_16\t2345_17\t2345_18\t2345_19\t2345_20\t2345_21\t2345_22\t2345_23\t2345_24\t2345_25"}