{"name": "2350", "parent": "", "title": "How to Become a Coach and Change the World", "sentences": [{"9e5d": "How to Become a Coach and Change the World"}, {"7ab2": "And make some money along the way."}, {"150f": "Coaching is the secret weapon of elite performers. Look behind the scenes of any successful person — business, media, sports, music — and you’ll find a team of people who helped them reach the top."}, {"a794": "The coaching industry is surprisingly large: nine billion dollars per year. But the top coaches are rare and reserved for the already rich-and-famous. A top coach is sort of like a private jet. Great to have, but completely inaccessible to most people."}, {"ef8a": "Here’s where you come in."}, {"b16e": "We want everyone in the world to have a great coach and that means we need more great coaches."}, {"ea31": "You may already think of yourself as a coach. That’s great — we can make you better."}, {"789c": "Or you may not yet think of yourself as a coach. That’s also great — we can train you to become a top coach."}, {"9e74": "You could be a top coach if…"}, {"76ba": "Here’s a story about why you might be a top coach."}, {"9255": "Our first wave of coaches were all recruited from within our original goal-tracking community (Coach.me has a long history and started with a large community of goal trackers)."}, {"b755": "Our top coach in 2015 had never coached before. He is a Boston-based CTO with a 600 day streak of Inbox Zero who coaches business productivity. His clients more than 200 clients have stuck with their goals three times longer than our average coach."}, {"b31a": "That’s a lesson for everyone — with practice and hard work, you can turn yourself into an amazing coach. If you’re a new coach, we can train you to be great. If you’ve coached before, we’ll have some important tips for you as well (plus a ton of tools)."}, {"c858": "The key tools are…"}, {"3243": "Our coaching platform offers two things that have never been available before."}, {"8554": "The first is a cutting edge Digital Coaching Certification program based on real lessons from the first people to ever successfully coach online. This is the first and only certification for the new realm of digital coaching. And, as far as I can tell, it’s the only coaching certification anywhere that is based on measuring exactly what works for clients."}, {"93f4": "The second, is we’re opening our full stack coaching platform. Our platform gives you a profile page, coaching tools, a turn-key billing system, and built-in client management and acquisition."}, {"cd14": "These tools help any type of coach — you could be offering phone sessions, digital chat coaching, or even courses."}, {"7e74": "With these key tools, you can be open for business in very short order."}, {"d570": "First of its kind certification"}, {"beda": "Digital coaching is a new branch of coaching."}, {"a97c": "Traditional coaching happens face to face. Sometimes traditional coaches use Skype or the phone. But that’s not an innovation that changes the nature of their coaching."}, {"9a77": "Digital coaching happens via text messaging, email and chat. That fundamentally changes the nature of how you coach."}, {"5859": "Digital is different. You don’t have to say that it’s a better than face-to-face, although it clearly has some advantages."}, {"7479": "Digital coaching needs different training because it is radically different than traditional coaching."}, {"0225": "We’re offering open sourced training materials and a free Digital Coaching Certification. This is the first and only certification for this branch of coaching."}, {"74ef": "The part of the certification that we’re most proud of is that it’s based on real data. We can see which coaches are succeeding and which aren’t. That lets us build training that is literally cutting edge."}, {"99c2": "Full stack, coaching platform"}, {"b7e1": "From a coaching perspective, the Coach.me platform does everything for you."}, {"1183": "We host your profile. We provide tools for all three of the major coaching services (chat, calls, plans). We handle billing and subscriptions. We even bring you customers."}, {"5903": "That’s the full stack."}, {"cb1b": "Chat is the dominant category for digital coaching."}, {"35b5": "We also make it easy for clients to schedule phone or video chats for those times when you want to take a deep dive."}, {"af36": "Finally, we offer a Plans feature for hosting courses or training plans. Imagine you’re a running coach and you want to hand out a training schedule for the next month."}, {"3011": "Top questions, i.e. how much money?"}, {"41ee": "We aim to help a range of coaches, from people wanting a small side business, through people who aspire to $50k annual salaries, all the way up to the elite end of the freelance economy where people are making $100k to $250k per year."}, {"7b07": "For everyone else, here is a guide for understanding the business side of coaching and planning for how to make it part of your personal income."}, {"3ee4": "You’re probably also wondering how payments work."}, {"d67c": "Our membership covers access to our tools and training. Beyond that, we just collect a small fee to cover bank processing and support. So if you use Coach.me for billing with your own clients, the price is 5% + $0.30/charge."}, {"493e": "Beyond that, and this is probably the most powerful part of coaching membership, you can join the Coach.me affiliate network. We share revenue with people who coach on our platform (especially if we brought you the client). The default is 50/50, and we pay referral and affiliate bonuses up to 40%. Here is the full schedule for revenue sharing."}, {"bec5": "How to get started"}, {"af18": "If you want to try your hand at coaching, here is the first step is to become a member of our Coaching Community. The price is fair and I’m going to give you a 15% promo code because you read this entire post."}, {"8c1d": "Join: coach.me/applyPromo: NEWCOACH"}, {"efdf": "Here are some of the areas that the world needs more coaches for:"}, {"e487": "That’s just the tip of the iceberg."}, {"08ac": "Good luck!"}, {"721b": "Tony & Coach.me Team"}], "content": "How to Become a Coach and Change the World And make some money along the way. Coaching is the secret weapon of elite performers. Look behind the scenes of any successful person — business, media, sports, music — and you’ll find a team of people who helped them reach the top. The coaching industry is surprisingly large: nine billion dollars per year. But the top coaches are rare and reserved for the already rich-and-famous. A top coach is sort of like a private jet. Great to have, but completely inaccessible to most people. Here’s where you come in. We want everyone in the world to have a great coach and that means we need more great coaches. You may already think of yourself as a coach. That’s great — we can make you better. Or you may not yet think of yourself as a coach. That’s also great — we can train you to become a top coach. You could be a top coach if… Here’s a story about why you might be a top coach. Our first wave of coaches were all recruited from within our original goal-tracking community (Coach.me has a long history and started with a large community of goal trackers). Our top coach in 2015 had never coached before. He is a Boston-based CTO with a 600 day streak of Inbox Zero who coaches business productivity. His clients more than 200 clients have stuck with their goals three times longer than our average coach. That’s a lesson for everyone — with practice and hard work, you can turn yourself into an amazing coach. If you’re a new coach, we can train you to be great. If you’ve coached before, we’ll have some important tips for you as well (plus a ton of tools). The key tools are… Our coaching platform offers two things that have never been available before. The first is a cutting edge Digital Coaching Certification program based on real lessons from the first people to ever successfully coach online. This is the first and only certification for the new realm of digital coaching. And, as far as I can tell, it’s the only coaching certification anywhere that is based on measuring exactly what works for clients. The second, is we’re opening our full stack coaching platform. Our platform gives you a profile page, coaching tools, a turn-key billing system, and built-in client management and acquisition. These tools help any type of coach — you could be offering phone sessions, digital chat coaching, or even courses. With these key tools, you can be open for business in very short order. First of its kind certification Digital coaching is a new branch of coaching. Traditional coaching happens face to face. Sometimes traditional coaches use Skype or the phone. But that’s not an innovation that changes the nature of their coaching. Digital coaching happens via text messaging, email and chat. That fundamentally changes the nature of how you coach. Digital is different. You don’t have to say that it’s a better than face-to-face, although it clearly has some advantages. Digital coaching needs different training because it is radically different than traditional coaching. We’re offering open sourced training materials and a free Digital Coaching Certification. This is the first and only certification for this branch of coaching. The part of the certification that we’re most proud of is that it’s based on real data. We can see which coaches are succeeding and which aren’t. That lets us build training that is literally cutting edge. Full stack, coaching platform From a coaching perspective, the Coach.me platform does everything for you. We host your profile. We provide tools for all three of the major coaching services (chat, calls, plans). We handle billing and subscriptions. We even bring you customers. That’s the full stack. Chat is the dominant category for digital coaching. We also make it easy for clients to schedule phone or video chats for those times when you want to take a deep dive. Finally, we offer a Plans feature for hosting courses or training plans. Imagine you’re a running coach and you want to hand out a training schedule for the next month. Top questions, i.e. how much money? We aim to help a range of coaches, from people wanting a small side business, through people who aspire to $50k annual salaries, all the way up to the elite end of the freelance economy where people are making $100k to $250k per year. For everyone else, here is a guide for understanding the business side of coaching and planning for how to make it part of your personal income. You’re probably also wondering how payments work. Our membership covers access to our tools and training. Beyond that, we just collect a small fee to cover bank processing and support. So if you use Coach.me for billing with your own clients, the price is 5% + $0.30/charge. Beyond that, and this is probably the most powerful part of coaching membership, you can join the Coach.me affiliate network. We share revenue with people who coach on our platform (especially if we brought you the client). The default is 50/50, and we pay referral and affiliate bonuses up to 40%. Here is the full schedule for revenue sharing. How to get started If you want to try your hand at coaching, here is the first step is to become a member of our Coaching Community. The price is fair and I’m going to give you a 15% promo code because you read this entire post. Join: coach.me/applyPromo: NEWCOACH Here are some of the areas that the world needs more coaches for: That’s just the tip of the iceberg. Good luck! Tony & Coach.me Team ", "child": "2350_1\t2350_2\t2350_3\t2350_4"}