{"name": "2352", "parent": "", "title": "Ozawa and Haruki: Three Traits of Creative Excellence", "sentences": [{"7d13": "Source"}, {"4713": "Ozawa and Haruki: Three Traits of Creative Excellence"}, {"b7fd": "In January 2010, Seiji Ozawa was on the brink of death."}, {"f80a": "Diagnosed with esophageal cancer, the famed Japanese conductor was rushed to the hospital. At 75 years of age, there was no guarantee he would survive."}, {"a3a3": "The only choice the doctors had was to cut into Ozawa’s body and remove his esophagus. His stomach was then stretched up to his collarbone and surgically attached to his throat. To this day, he has a scar on his neck from where they sliced him."}, {"ca7f": "For an ordinary person, that would be end of a career."}, {"1d8e": "But not Seiji Ozawa. In less than a year, despite warnings from doctors, friends and family, Ozawa was back on stage doing what he had done for his whole life — making music."}, {"c145": "After surgery, the man could barely stand on the best of days. Yet, on stage, he was full of life."}, {"1607": "Another creative master, the novelist Murakami Haruki, was there to see Ozawa’s performance. Haruki describes Ozawa’s performance in Absolutely on Music:"}, {"3620": "“I was simply awestruck by the fierce intensity with which [Ozawa] threw himself into the work. I could not help worrying about his health, however, and how it would hold up under such a strain."}, {"5025": "[…]"}, {"d628": "“I too wanted to say to him, “You really ought to hold off a little, take some time to recover, and start performing after you’ve got your strength back. I understand how you feel, but you know what they say — ‘Slow and steady wins the race.’ ” Really that was the only reasonable response, but I couldn’t bring myself to say it to him when I saw him wringing every ounce of strength out of his body to stand upright on the podium. I felt that those words would become a lie once I spoke them. To put it simply, this man was living in a world that transcended reasonable ways of thinking…”"}, {"073c": "Ozawa’s performance triggered a feeling in Haruki that, as a novelist, he understand with a fierce intimacy:"}, {"1680": "“As I watched him in action, however, one thing dawned on me: He can’t help himself; he has to do this. […] For Seiji Ozawa, music was the indispensable fuel that kept him moving through life. Without periodic injections of live music into his veins, he could not go on living. There was only one way in this world for him to feel truly alive, and that was for him to create music with his own hands and to thrust it as a living, throbbing thing into the faces of an audience: “Here!” Who could possibly tell him to stop?”"}, {"2913": "For Ozawa, music is life. For Haruki, writing is life. These are two men from different disciplines, but at the core, they are one and the same."}, {"5103": "In Absolutely on Music, Haruki is constantly making connections between himself and Ozawa:"}, {"f82e": "“In the course of our many conversations, I began to suspect that Seiji Ozawa and I might have several things in common. Questions of talent or productivity or fame aside, what I mean here is that I can feel a sense of identity in the way we live our lives.”"}, {"0eb7": "What does Haruki mean by this way of life? How do Haruki and Ozawa differ from ordinary people?"}, {"f16c": "Haruki points out three similarities between Ozawa and himself."}, {"5e7e": "1. Intrinsic Reward"}, {"6e24": "The first similarity Haruki is their perspective on work."}, {"633d": "“First of all, both of us seem to take the same simple joy in our work. Whatever differences there might be between making music and writing fiction, both of us are happiest when absorbed in our work. And the very fact that we are able to become so totally engrossed in it gives us the deepest satisfaction. What we end up producing as a result of that work may well be important, but aside from that, our ability to work with utter concentration and to devote ourselves to it so completely that we forget the passage of time is its own irreplaceable reward.”"}, {"6583": "It is not just the book or product or musical masterpiece that drives them, it is the intrinsic reward."}, {"0d1a": "But there’s something else to the above passage. Let’s take a look that phrase at the end again:"}, {"55be": "“…our ability to work with utter concentration and to devote ourselves to it so completely that we forget the passage of time…”"}, {"8d6e": "Now compare with this excerpt from Steven Kotler’s The Rise of Superman about the psychological state called flow:"}, {"dd4b": "“In flow, we are so focused on the task at hand that everything else falls away. Action and awareness merge. Time flies. Self vanishes. Performance goes through the roof.”"}, {"3c9a": "The flow state — also known as “the zone” — is the state of being completely absorbed in what you do. It feels really, really good."}, {"cf01": "Another excerpt from Kotler’s book:"}, {"d344": "“During a peak experience,” Maslow explained, ‘the individual experiences an expansion of self, a sense of unity, and meaningfulness in life. The experience lingers in one’s consciousness and gives a sense of purpose, integration, self-determination and empathy.’ ”"}, {"afc0": "Perhaps this is what Haruki and Ozawa experience when they are deeply absorbed in their work?"}, {"768d": "For more clues, let’s look at the next similarity."}, {"927a": "2. Stay Hungry"}, {"c350": "Closely related to Ozawa and Haruki’s love of their work is their constant search for a challenge:"}, {"db8c": "Secondly, we both maintain the same “hungry heart” we possessed in our youth, that persistent feeling that “this is not good enough,” that we must dig deeper, forge farther ahead. This is the major motif of our work and our lives."}, {"b8fd": "Observing Ozawa in action, I could feel the depth and intensity of the desire he brought to his work. He was convinced of his own rightness and proud of what he was doing, but not in the least satisfied with it. I could see he knew he should be able to make the music even better, even deeper, and he was determined to make it happen even as he struggled with the constraints of time and his own physical strength."}, {"9c5c": "Even when Ozawa earns the respect of everyone around him, even when he has enough money in his bank account to live for 200 years, he does stop challenging himself. He cannot stop challenging himself."}, {"5ade": "Could this mindset be related to the flow state too?"}, {"5ea3": "Let’s look at a passage from a seminal book on the subject, Csikszentmihalyi’s Flow:"}, {"d12b": "“…the best moments in our lives, are not the passive, receptive, relaxing times — although such experiences can also be enjoyable, if we have worked hard to attain them. The best moments usually occur when a person’s body or mind is stretched to its limits in a voluntary effort to accomplish something difficult and worthwhile.”"}, {"4e3d": "Aha."}, {"dfdf": "To enter the flow state, we need to be challenged. And in order to be challenged, we must never be satisfied…"}, {"9323": "Now, on to the third similarity."}, {"9378": "3. Stubborn Independence"}, {"9e85": "The third of our shared traits is stubbornness. We’re patient, tough, and, finally, just plain stubborn. Once we’ve decided to do something in a certain way, it doesn’t matter what anybody else says, that’s how we’re going to do it. And even if, as a result, we find ourselves in dire straits, possibly even hated, we will take responsibility for our actions without making excuses."}, {"b467": "Hmm. Does stubbornness have anything to do with the flow state?"}, {"5aac": "To enter flow, activities must be done for their own, intrinsic reward. Think about a child building her sandcastle at the beach. She’s not doing it for money or fame; she’s doing it for fun."}, {"bdc1": "The flow state and play are close cousins. Sadly, society doesn’t want its adults playing around."}, {"863e": "Here’s Kotler again in The Rise of Superman:"}, {"2a71": "…we have decided that play — an activity fundamental to survival, tied to the greatest neurochemical rewards the brain can produce, and flat out necessary for achieving peak performance, creative brilliance, and overall life satisfaction — is a waste of time for adults. If we are hunting the highest version of ourselves, then we need to turn work into play and not the other way round."}, {"3e27": "When you have an idea that nobody has thought of before, family and friends are going to doubt you. They might tell you to “grow up” or “be realistic.”"}, {"3b44": "If you aren’t stubborn, you might even listen to them."}, {"b0c0": "So there you have it. Three traits that Murakami Haruki shares with Seiji Ozawa."}, {"a9d2": "But maybe it’s not three traits. Perhaps it’s just one trait that the two of them share — a deep, irresistible love for the experience of flow."}, {"20d7": "They only look crazy to us."}, {"7f5e": "Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here."}], "content": "Source Ozawa and Haruki: Three Traits of Creative Excellence In January 2010, Seiji Ozawa was on the brink of death. Diagnosed with esophageal cancer, the famed Japanese conductor was rushed to the hospital. At 75 years of age, there was no guarantee he would survive. The only choice the doctors had was to cut into Ozawa’s body and remove his esophagus. His stomach was then stretched up to his collarbone and surgically attached to his throat. To this day, he has a scar on his neck from where they sliced him. For an ordinary person, that would be end of a career. But not Seiji Ozawa. In less than a year, despite warnings from doctors, friends and family, Ozawa was back on stage doing what he had done for his whole life — making music. After surgery, the man could barely stand on the best of days. Yet, on stage, he was full of life. Another creative master, the novelist Murakami Haruki, was there to see Ozawa’s performance. Haruki describes Ozawa’s performance in Absolutely on Music: “I was simply awestruck by the fierce intensity with which [Ozawa] threw himself into the work. I could not help worrying about his health, however, and how it would hold up under such a strain. […] “I too wanted to say to him, “You really ought to hold off a little, take some time to recover, and start performing after you’ve got your strength back. I understand how you feel, but you know what they say — ‘Slow and steady wins the race.’ ” Really that was the only reasonable response, but I couldn’t bring myself to say it to him when I saw him wringing every ounce of strength out of his body to stand upright on the podium. I felt that those words would become a lie once I spoke them. To put it simply, this man was living in a world that transcended reasonable ways of thinking…” Ozawa’s performance triggered a feeling in Haruki that, as a novelist, he understand with a fierce intimacy: “As I watched him in action, however, one thing dawned on me: He can’t help himself; he has to do this. […] For Seiji Ozawa, music was the indispensable fuel that kept him moving through life. Without periodic injections of live music into his veins, he could not go on living. There was only one way in this world for him to feel truly alive, and that was for him to create music with his own hands and to thrust it as a living, throbbing thing into the faces of an audience: “Here!” Who could possibly tell him to stop?” For Ozawa, music is life. For Haruki, writing is life. These are two men from different disciplines, but at the core, they are one and the same. In Absolutely on Music, Haruki is constantly making connections between himself and Ozawa: “In the course of our many conversations, I began to suspect that Seiji Ozawa and I might have several things in common. Questions of talent or productivity or fame aside, what I mean here is that I can feel a sense of identity in the way we live our lives.” What does Haruki mean by this way of life? How do Haruki and Ozawa differ from ordinary people? Haruki points out three similarities between Ozawa and himself. 1. Intrinsic Reward The first similarity Haruki is their perspective on work. “First of all, both of us seem to take the same simple joy in our work. Whatever differences there might be between making music and writing fiction, both of us are happiest when absorbed in our work. And the very fact that we are able to become so totally engrossed in it gives us the deepest satisfaction. What we end up producing as a result of that work may well be important, but aside from that, our ability to work with utter concentration and to devote ourselves to it so completely that we forget the passage of time is its own irreplaceable reward.” It is not just the book or product or musical masterpiece that drives them, it is the intrinsic reward. But there’s something else to the above passage. Let’s take a look that phrase at the end again: “…our ability to work with utter concentration and to devote ourselves to it so completely that we forget the passage of time…” Now compare with this excerpt from Steven Kotler’s The Rise of Superman about the psychological state called flow: “In flow, we are so focused on the task at hand that everything else falls away. Action and awareness merge. Time flies. Self vanishes. Performance goes through the roof.” The flow state — also known as “the zone” — is the state of being completely absorbed in what you do. It feels really, really good. Another excerpt from Kotler’s book: “During a peak experience,” Maslow explained, ‘the individual experiences an expansion of self, a sense of unity, and meaningfulness in life. The experience lingers in one’s consciousness and gives a sense of purpose, integration, self-determination and empathy.’ ” Perhaps this is what Haruki and Ozawa experience when they are deeply absorbed in their work? For more clues, let’s look at the next similarity. 2. Stay Hungry Closely related to Ozawa and Haruki’s love of their work is their constant search for a challenge: Secondly, we both maintain the same “hungry heart” we possessed in our youth, that persistent feeling that “this is not good enough,” that we must dig deeper, forge farther ahead. This is the major motif of our work and our lives. Observing Ozawa in action, I could feel the depth and intensity of the desire he brought to his work. He was convinced of his own rightness and proud of what he was doing, but not in the least satisfied with it. I could see he knew he should be able to make the music even better, even deeper, and he was determined to make it happen even as he struggled with the constraints of time and his own physical strength. Even when Ozawa earns the respect of everyone around him, even when he has enough money in his bank account to live for 200 years, he does stop challenging himself. He cannot stop challenging himself. Could this mindset be related to the flow state too? Let’s look at a passage from a seminal book on the subject, Csikszentmihalyi’s Flow: “…the best moments in our lives, are not the passive, receptive, relaxing times — although such experiences can also be enjoyable, if we have worked hard to attain them. The best moments usually occur when a person’s body or mind is stretched to its limits in a voluntary effort to accomplish something difficult and worthwhile.” Aha. To enter the flow state, we need to be challenged. And in order to be challenged, we must never be satisfied… Now, on to the third similarity. 3. Stubborn Independence The third of our shared traits is stubbornness. We’re patient, tough, and, finally, just plain stubborn. Once we’ve decided to do something in a certain way, it doesn’t matter what anybody else says, that’s how we’re going to do it. And even if, as a result, we find ourselves in dire straits, possibly even hated, we will take responsibility for our actions without making excuses. Hmm. Does stubbornness have anything to do with the flow state? To enter flow, activities must be done for their own, intrinsic reward. Think about a child building her sandcastle at the beach. She’s not doing it for money or fame; she’s doing it for fun. The flow state and play are close cousins. Sadly, society doesn’t want its adults playing around. Here’s Kotler again in The Rise of Superman: …we have decided that play — an activity fundamental to survival, tied to the greatest neurochemical rewards the brain can produce, and flat out necessary for achieving peak performance, creative brilliance, and overall life satisfaction — is a waste of time for adults. If we are hunting the highest version of ourselves, then we need to turn work into play and not the other way round. When you have an idea that nobody has thought of before, family and friends are going to doubt you. They might tell you to “grow up” or “be realistic.” If you aren’t stubborn, you might even listen to them. So there you have it. Three traits that Murakami Haruki shares with Seiji Ozawa. But maybe it’s not three traits. Perhaps it’s just one trait that the two of them share — a deep, irresistible love for the experience of flow. They only look crazy to us. Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here. ", "child": "2352_1\t2352_2\t2352_3\t2352_4\t2352_5\t2352_6\t2352_7\t2352_8\t2352_9\t2352_10\t2352_11\t2352_12\t2352_13\t2352_142352_1\t2352_2\t2352_3\t2352_4\t2352_5\t2352_6\t2352_7\t2352_8\t2352_9\t2352_10\t2352_11\t2352_12\t2352_13\t2352_142352_1\t2352_2\t2352_3\t2352_4\t2352_5\t2352_6\t2352_7\t2352_8\t2352_9\t2352_10\t2352_11\t2352_12\t2352_13\t2352_142352_1\t2352_2\t2352_3\t2352_4\t2352_5\t2352_6\t2352_7\t2352_8\t2352_9\t2352_10\t2352_11\t2352_12\t2352_13\t2352_142352_1\t2352_2\t2352_3\t2352_4\t2352_5\t2352_6\t2352_7\t2352_8\t2352_9\t2352_10\t2352_11\t2352_12\t2352_13\t2352_14"}