{"name": "2355", "parent": "", "title": "Startup World, Can You Think Of Real Ideas, Please?", "sentences": [{"fab3": "Startup World, Can You Think Of Real Ideas, Please?"}, {"7f5b": "It’s Time We Stop Chasing Money For The Wrong Reasons"}, {"12fe": "“Fruit salad!”"}, {"63df": "I had to blink a couple times. She couldn’t possibly be serious, could she?"}, {"ccb5": "“What do you mean, ‘fruit salad?’”"}, {"c8af": "“I want to create a fruit salad brand. The best one ever! You know, I want to become the Hershey’s of fruit salad!”"}, {"e1a8": "My roommate and I were attending a startup event at a reputable VC fund in Munich. Free food, free booze and more hot air than in Richard Branson’s balloon, most of which came straight from the founders’ mouths."}, {"edc8": "While we were scoffed at every time we answered the icebreaker question “What’s your startup?” — because we didn’t have one — it was soon on us to do the scoffing."}, {"d135": "Within minutes of talking to this girl we learned that:"}, {"6808": "She didn’t want to make fruit salad. She wanted to create a brand."}, {"a761": "She didn’t want it to be fresh, good and hand-made, she wanted it to be cheap, fast and easy."}, {"0100": "She didn’t want to serve a specific group of people, she wanted to serve everyone."}, {"6eb5": "Worst of all, she didn’t see that she didn’t need VC money, because her idea was not a startup idea at all. It was a business idea."}, {"8a72": "What she had seen was an unbranded plastic cup on the shelves of the grocery store she’d worked in for 5 years and thought “Free money! 💰”"}, {"4cd9": "Oh, how I wish I could tell you she was the exception at this event. But she wasn’t."}, {"8514": "When you want to start a fruit salad business, here’s what any person with common sense would do:"}, {"f002": "1. Make fruit salad."}, {"9aa1": "2. Try to sell it."}, {"09dc": "You don’t need a business plan for that, you don’t need a team, you don’t need an office and you sure as hell don’t need $1,000,000 in funding."}, {"8f73": "But common sense is in short supply in startup land these days."}, {"6cb0": "It seems to me the majority of founders confuse startup ideas with business ideas. There’s a huge difference between the two."}, {"c284": "Most people have lots of business ideas. They’re a dime a dozen. Very few people have true startup ideas."}, {"a1ab": "Startup world, if I could recommend just one book to you to solve all of this, I’d say:"}, {"d7ce": "Zero To One. Read Peter Thiel’s book, Zero To One."}, {"7fd4": "Here are the two main things it’ll teach you:"}, {"5a29": "1. The difference between a startup and a normal business."}, {"9b24": "Two of the key traits of startups are:"}, {"eb96": "This makes startups well-suited to solve big, important problems by doing things in an entirely new way, instead of making incremental progress."}, {"f094": "According to Thiel, one is horizontal (like globalization, which scales and extends what exists already), the other vertical (like technology, which gives us a new way of doing things)."}, {"bc6e": "The benefit of building a startup in Thiel’s sense is that it can, if successful, turn into a monopoly, which ensures profits for a long time, that can then be used to created further, vertical progress."}, {"1fb6": "Here are the 4 key traits of a monopoly:"}, {"2e41": "Let’s look at two examples."}, {"9f0a": "Google was a startup."}, {"c09f": "Before Google, no other search engine had developed a proper, proprietary technology it bases its results on. Yahoo had just gobbled together something from all the companies they had acquired, and so Google won. It’s been a monopoly since pretty much 2000, when it first indexed more sites than any other search engine and Yahoo caved: they started using Google’s technology. Google still reaps the profits of that monopoly 17 years later."}, {"fb9c": "If you’re thinking about replacing the car as a means of transport, making grocery stores unnecessary or a way to use electric power in your house without sockets, those might be startup ideas."}, {"39ba": "For a true startup idea, no one will ever tell you that “it’s a great idea,” because what you’re suggesting is unheard of. People will think you’re crazy and you’ll have to fight long and hard to convince the world. But if you pull it off, you’ll make it a much better place."}, {"41a7": "To find out if your startup idea is worth launching:"}, {"a6c1": "Then, you can put your heart and soul into it and even if it falls flat on its face, you won’t regret a single day spent on it."}, {"286f": "DuckDuckGo is a business."}, {"44c2": "It doesn’t replace or succeed search the way we do it now, but instead is another player in the search engine industry. DuckDuckGo creates competition. It’s carved out a niche for itself (focus on privacy) and it’s successful, but it’s not a “startup” in Peter Thiel’s sense."}, {"e127": "If you’re thinking about starting a lemonade stand, coding a fitness app, creating a content management software, video community website or new productivity tool, those are all business ideas."}, {"46ad": "These are the kinds of ideas your friends will tell you are “great ideas.”"}, {"d425": "To find out if they’re worth launching:"}, {"ff90": "That’s it. By getting some people to pay, you know your business idea is valid and it won’t fall flat on its face."}, {"9a90": "There. No risk involved. No capital needed."}, {"a455": "The second thing the book will teach you is this:"}, {"53ce": "2. Which questions will help you find true startup ideas?"}, {"f588": "Based on Thiel’s definition, you can use a variety of questions to pinpoint whether what you’re about to embark on fits the idea of a startup. Here are the most important ones from the book:"}, {"59b0": "A lot of startups fail. At least 75%. And that’s 75% of those, which have received funding already. I’m not going to start a startup for the foreseeable future, but if I ever, this is the setup I’ll use."}, {"7476": "When you use these questions to find your idea, run it through Thiel’s filter and it passes, I think you’ll have a decent shot."}, {"4520": "Then it’s just years of failing, uphill battles and hard work and who knows, maybe, one day, the world will look back and think of you as someone who invented the future."}, {"953b": "Unless we change our thinking, we’ll soon burn more money, time, energy and human ambition than we have in a long, long time."}, {"ea87": "Even watching from the sidelines hurts so much I want to grab the entire industry by the collar, shake it and say: “FRUIT SALAD?! What the fuck is wrong with you?!”"}, {"7ddf": "But I thought I’d ask nicely first."}, {"5e68": "So hey startup world, can you think of real ideas? Please!"}, {"7631": "Think it’s smart? Hit the heart! ❤"}, {"3c9e": "PS: I’ve written a summary of the book here. I write more here."}, {"1902": "Originally published at www.quora.com."}], "content": "Startup World, Can You Think Of Real Ideas, Please? It’s Time We Stop Chasing Money For The Wrong Reasons “Fruit salad!” I had to blink a couple times. She couldn’t possibly be serious, could she? “What do you mean, ‘fruit salad?’” “I want to create a fruit salad brand. The best one ever! You know, I want to become the Hershey’s of fruit salad!” My roommate and I were attending a startup event at a reputable VC fund in Munich. Free food, free booze and more hot air than in Richard Branson’s balloon, most of which came straight from the founders’ mouths. While we were scoffed at every time we answered the icebreaker question “What’s your startup?” — because we didn’t have one — it was soon on us to do the scoffing. Within minutes of talking to this girl we learned that: She didn’t want to make fruit salad. She wanted to create a brand. She didn’t want it to be fresh, good and hand-made, she wanted it to be cheap, fast and easy. She didn’t want to serve a specific group of people, she wanted to serve everyone. Worst of all, she didn’t see that she didn’t need VC money, because her idea was not a startup idea at all. It was a business idea. What she had seen was an unbranded plastic cup on the shelves of the grocery store she’d worked in for 5 years and thought “Free money! 💰” Oh, how I wish I could tell you she was the exception at this event. But she wasn’t. When you want to start a fruit salad business, here’s what any person with common sense would do: 1. Make fruit salad. 2. Try to sell it. You don’t need a business plan for that, you don’t need a team, you don’t need an office and you sure as hell don’t need $1,000,000 in funding. But common sense is in short supply in startup land these days. It seems to me the majority of founders confuse startup ideas with business ideas. There’s a huge difference between the two. Most people have lots of business ideas. They’re a dime a dozen. Very few people have true startup ideas. Startup world, if I could recommend just one book to you to solve all of this, I’d say: Zero To One. Read Peter Thiel’s book, Zero To One. Here are the two main things it’ll teach you: 1. The difference between a startup and a normal business. Two of the key traits of startups are: This makes startups well-suited to solve big, important problems by doing things in an entirely new way, instead of making incremental progress. According to Thiel, one is horizontal (like globalization, which scales and extends what exists already), the other vertical (like technology, which gives us a new way of doing things). The benefit of building a startup in Thiel’s sense is that it can, if successful, turn into a monopoly, which ensures profits for a long time, that can then be used to created further, vertical progress. Here are the 4 key traits of a monopoly: Let’s look at two examples. Google was a startup. Before Google, no other search engine had developed a proper, proprietary technology it bases its results on. Yahoo had just gobbled together something from all the companies they had acquired, and so Google won. It’s been a monopoly since pretty much 2000, when it first indexed more sites than any other search engine and Yahoo caved: they started using Google’s technology. Google still reaps the profits of that monopoly 17 years later. If you’re thinking about replacing the car as a means of transport, making grocery stores unnecessary or a way to use electric power in your house without sockets, those might be startup ideas. For a true startup idea, no one will ever tell you that “it’s a great idea,” because what you’re suggesting is unheard of. People will think you’re crazy and you’ll have to fight long and hard to convince the world. But if you pull it off, you’ll make it a much better place. To find out if your startup idea is worth launching: Then, you can put your heart and soul into it and even if it falls flat on its face, you won’t regret a single day spent on it. DuckDuckGo is a business. It doesn’t replace or succeed search the way we do it now, but instead is another player in the search engine industry. DuckDuckGo creates competition. It’s carved out a niche for itself (focus on privacy) and it’s successful, but it’s not a “startup” in Peter Thiel’s sense. If you’re thinking about starting a lemonade stand, coding a fitness app, creating a content management software, video community website or new productivity tool, those are all business ideas. These are the kinds of ideas your friends will tell you are “great ideas.” To find out if they’re worth launching: That’s it. By getting some people to pay, you know your business idea is valid and it won’t fall flat on its face. There. No risk involved. No capital needed. The second thing the book will teach you is this: 2. Which questions will help you find true startup ideas? Based on Thiel’s definition, you can use a variety of questions to pinpoint whether what you’re about to embark on fits the idea of a startup. Here are the most important ones from the book: A lot of startups fail. At least 75%. And that’s 75% of those, which have received funding already. I’m not going to start a startup for the foreseeable future, but if I ever, this is the setup I’ll use. When you use these questions to find your idea, run it through Thiel’s filter and it passes, I think you’ll have a decent shot. Then it’s just years of failing, uphill battles and hard work and who knows, maybe, one day, the world will look back and think of you as someone who invented the future. Unless we change our thinking, we’ll soon burn more money, time, energy and human ambition than we have in a long, long time. Even watching from the sidelines hurts so much I want to grab the entire industry by the collar, shake it and say: “FRUIT SALAD?! What the fuck is wrong with you?!” But I thought I’d ask nicely first. So hey startup world, can you think of real ideas? Please! Think it’s smart? Hit the heart! ❤ PS: I’ve written a summary of the book here. I write more here. Originally published at www.quora.com. ", "child": "2355_1\t2355_2\t2355_3\t2355_4\t2355_5\t2355_6\t2355_7\t2355_8\t2355_9\t2355_10\t2355_11\t2355_12\t2355_132355_1\t2355_2\t2355_3\t2355_4\t2355_5\t2355_6\t2355_7\t2355_8\t2355_9\t2355_10\t2355_11\t2355_12\t2355_132355_1\t2355_2\t2355_3\t2355_4\t2355_5\t2355_6\t2355_7\t2355_8\t2355_9\t2355_10\t2355_11\t2355_12\t2355_132355_1\t2355_2\t2355_3\t2355_4\t2355_5\t2355_6\t2355_7\t2355_8\t2355_9\t2355_10\t2355_11\t2355_12\t2355_132355_1\t2355_2\t2355_3\t2355_4\t2355_5\t2355_6\t2355_7\t2355_8\t2355_9\t2355_10\t2355_11\t2355_12\t2355_132355_1\t2355_2\t2355_3\t2355_4\t2355_5\t2355_6\t2355_7\t2355_8\t2355_9\t2355_10\t2355_11\t2355_12\t2355_13"}