{"name": "2356", "parent": "", "title": "A Simple Method to Take Control of Your Productivity", "sentences": [{"b6d4": "Source: Wikimedia Commons"}, {"ab2b": "A Simple Method to Take Control of Your Productivity"}, {"a6c6": "Take a look at how Beethoven spent his day:"}, {"c135": "Source: Info We Trust"}, {"7fd4": "“Beethoven rose at dawn and wasted little time getting down to work. His breakfast was coffee, which he prepared himself with great care — he determined that there should be sixty beans per cup, and he often counted them out one by one for a precise dose. Then he sat at his desk and worked until 2:00 or 3:00, taking the occasional break to walk outdoors, which aided his creativity.” (From Daily Rituals: How Artists Work)"}, {"1182": "Beethoven spent eight hours a day composing, plus a few hours walking in the afternoons."}, {"bf22": "Rock solid productivity."}, {"31f6": "Compare that to your average person’s day:"}, {"3031": "You have to give the man credit — he worked hard."}, {"8595": "Sometimes, the right answers are the obvious ones. If you aren’t getting the results you want in work or life, maybe you simply aren’t working hard enough."}, {"ba99": "Over the years, I’ve developed a simple method for (1) identifying my productivity “blind spots” and (2) replacing them with something better."}, {"1155": "1. Track Your Time"}, {"309d": "Our memories are flawed. We tend to put a positive spin on everything. That’s a great way to stay optimistic, but a terrible way to get results."}, {"7812": "The only way to stay honest is to track your time."}, {"f0c8": "For a week, track everything that you do. I like to do it in 15-minute blocks."}, {"cc78": "Some options you can use for tracking:"}, {"5184": "2. Analyze"}, {"c276": "After you track your time for week, review your records."}, {"da7f": "Ask yourself:"}, {"5d05": "You might notice a pattern."}, {"a09f": "The time you waste in a week will be spent on the same few activities. Usually, this is entertainment — TV, social media, YouTube, etc."}, {"a85d": "We can’t tackle everything at once. Instead, we’ll pick the 1–2 most damaging activities and tackle those."}, {"428a": "3. Rewire Habits"}, {"5713": "Like heroin, bad habits are addictive. Instead of quitting cold, try to rewire your bad habits into good ones."}, {"0055": "It helps to write down your replacement triggers or say them out loud."}, {"6fc9": "What helps even more is removing bad options from the environment. Throw away your TV and put books in the house. Don’t bring your wallet to work. Carry a bag of beef jerky and munch on that instead."}, {"d532": "Keep it up for a few weeks — rewiring habits takes time."}, {"8a37": "(“Keep it up” is easier said than done. Luckily, self-control is a learnable skill. Two good reads on this are Progression and Superhuman by Habit.)"}, {"96a4": "4. Reflect and Repeat"}, {"81b9": "This is the step most people miss. That’s too bad, because it’s the most important one."}, {"f97e": "After your rewiring phase, pause and reflect."}, {"a0b3": "Did you succeed in replacing your bad habits? If not, why? Did you lack self control? Were there too many distractions? Did you choose the wrong trigger?"}, {"7480": "Ask a lot of questions — that’s how learning happens."}, {"dfb6": "If all went well, you’re a better version of you than before. Repeat this process several times a year for some impressive results."}, {"c193": "Cheers."}, {"54db": "Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here."}], "content": "Source: Wikimedia Commons A Simple Method to Take Control of Your Productivity Take a look at how Beethoven spent his day: Source: Info We Trust “Beethoven rose at dawn and wasted little time getting down to work. His breakfast was coffee, which he prepared himself with great care — he determined that there should be sixty beans per cup, and he often counted them out one by one for a precise dose. Then he sat at his desk and worked until 2:00 or 3:00, taking the occasional break to walk outdoors, which aided his creativity.” (From Daily Rituals: How Artists Work) Beethoven spent eight hours a day composing, plus a few hours walking in the afternoons. Rock solid productivity. Compare that to your average person’s day: You have to give the man credit — he worked hard. Sometimes, the right answers are the obvious ones. If you aren’t getting the results you want in work or life, maybe you simply aren’t working hard enough. Over the years, I’ve developed a simple method for (1) identifying my productivity “blind spots” and (2) replacing them with something better. 1. Track Your Time Our memories are flawed. We tend to put a positive spin on everything. That’s a great way to stay optimistic, but a terrible way to get results. The only way to stay honest is to track your time. For a week, track everything that you do. I like to do it in 15-minute blocks. Some options you can use for tracking: 2. Analyze After you track your time for week, review your records. Ask yourself: You might notice a pattern. The time you waste in a week will be spent on the same few activities. Usually, this is entertainment — TV, social media, YouTube, etc. We can’t tackle everything at once. Instead, we’ll pick the 1–2 most damaging activities and tackle those. 3. Rewire Habits Like heroin, bad habits are addictive. Instead of quitting cold, try to rewire your bad habits into good ones. It helps to write down your replacement triggers or say them out loud. What helps even more is removing bad options from the environment. Throw away your TV and put books in the house. Don’t bring your wallet to work. Carry a bag of beef jerky and munch on that instead. Keep it up for a few weeks — rewiring habits takes time. (“Keep it up” is easier said than done. Luckily, self-control is a learnable skill. Two good reads on this are Progression and Superhuman by Habit.) 4. Reflect and Repeat This is the step most people miss. That’s too bad, because it’s the most important one. After your rewiring phase, pause and reflect. Did you succeed in replacing your bad habits? If not, why? Did you lack self control? Were there too many distractions? Did you choose the wrong trigger? Ask a lot of questions — that’s how learning happens. If all went well, you’re a better version of you than before. Repeat this process several times a year for some impressive results. Cheers. Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here. ", "child": "2356_1\t2356_2\t2356_3\t2356_4\t2356_5\t2356_6\t2356_7\t2356_8\t2356_9\t2356_10\t2356_11\t2356_12\t2356_132356_1\t2356_2\t2356_3\t2356_4\t2356_5\t2356_6\t2356_7\t2356_8\t2356_9\t2356_10\t2356_11\t2356_12\t2356_132356_1\t2356_2\t2356_3\t2356_4\t2356_5\t2356_6\t2356_7\t2356_8\t2356_9\t2356_10\t2356_11\t2356_12\t2356_132356_1\t2356_2\t2356_3\t2356_4\t2356_5\t2356_6\t2356_7\t2356_8\t2356_9\t2356_10\t2356_11\t2356_12\t2356_132356_1\t2356_2\t2356_3\t2356_4\t2356_5\t2356_6\t2356_7\t2356_8\t2356_9\t2356_10\t2356_11\t2356_12\t2356_132356_1\t2356_2\t2356_3\t2356_4\t2356_5\t2356_6\t2356_7\t2356_8\t2356_9\t2356_10\t2356_11\t2356_12\t2356_13"}