{"name": "2357", "parent": "", "title": "What Would Steve Jobs Do to Your Whiteboard?", "sentences": [{"edf1": "What Would Steve Jobs Do to Your Whiteboard?"}, {"743b": "Out of everything you have to do right now, reading this is your #1 priority."}, {"954e": "Our behavior defines our priority. By definition, yours is reading this. That’s not to say you aren’t distracted by all of your other priorities, but right now you’re choosing this as your number one."}, {"a46f": "The word “priority” came into the English language in the 1400s. It was singular. It meant the very first or prior thing. It stayed singular for the next 500 years. Only in the 1900s did we pluralize the term and start talking about “priorities.” -Greg McKeown, “Essentialism”"}, {"c827": "Somehow we went 500 years knowing that there could only be one most important thing. Then, magically, we discovered we could have multiple most important things."}, {"94ca": "Or are we just kidding ourselves?"}, {"05a5": "“We can only do three.”"}, {"1403": "Steve Jobs changed the world in part because he chose to focus on a very small number of most important things."}, {"8c82": "Walter Isaacson’s biography of the Apple founder is full of stories of Jobs’ technique, often referred to as “slash and burn.”"}, {"304c": "Jobs hosted an annual retreat for the top 100 leaders of the company. He would stand at a whiteboard and list out the company’s top 10 priorities. As the group fought to get their ideas on the list, Jobs would deem which were worthy of inclusion on the board, and write them down."}, {"e0ea": "Once the agonizing work had been done to get the list to 10, Jobs would cross off the bottom seven. “We can only do three.”"}, {"fca3": "By deciding what our priority is, we’re also deciding what it isn’t. That’s hard."}, {"f256": "What are we so busy doing?"}, {"3757": "Before my wife and I had children, I remember telling a coworker how busy we were. She laughed and gave me a patronizing “you’re too dumb to even know what you just said” look."}, {"5bdf": "She had two young children at the time, and explained true business as “when there’s something you absolutely, positively have to get done before going to bed, and you fall asleep on your way to doing it.”"}, {"0795": "Yes. That’s busy."}, {"ddaa": "While we’ve been convincing ourselves that it’s somehow possible to have multiple priorities, we’ve also been convincing ourselves that extreme business equals productivity."}, {"b4bf": "“Busy” has almost replaced “fine” as the standard response to the hallway question “How are you?”"}, {"78ce": "This happens a lot:"}, {"6bd6": "Person: “How’s it going?”Me: “Crazy busy. You?”Person: “Yep. I hear you.”Me: “It’s a good thing, right?”Person: “Job security.”"}, {"79ce": "This is ridiculous. What am I so busy with? My priority? Usually not. Usually it’s managing all of those things distracting me from my priority. Email. Meetings. Text messages. IMs."}, {"422d": "Other people’s priorities. Not mine."}, {"fb4d": "I’m not getting work done. I’m just processing messages."}, {"4718": "If I listed the 100 things I find myself doing on one of those Steve Jobs whiteboards, he’d cross 97 of them off the list."}, {"be17": "What’s stopping me from doing the same thing?"}, {"1032": "If you’d like some guidance on incorporating the concepts from this post in your life or work, I’d love to help. Find me at Christopher Sowers — Coach Profile on Coach.me. You can use the promo code CHRIS11873WEEK for a free week of online coaching."}], "content": "What Would Steve Jobs Do to Your Whiteboard? Out of everything you have to do right now, reading this is your #1 priority. Our behavior defines our priority. By definition, yours is reading this. That’s not to say you aren’t distracted by all of your other priorities, but right now you’re choosing this as your number one. The word “priority” came into the English language in the 1400s. It was singular. It meant the very first or prior thing. It stayed singular for the next 500 years. Only in the 1900s did we pluralize the term and start talking about “priorities.” -Greg McKeown, “Essentialism” Somehow we went 500 years knowing that there could only be one most important thing. Then, magically, we discovered we could have multiple most important things. Or are we just kidding ourselves? “We can only do three.” Steve Jobs changed the world in part because he chose to focus on a very small number of most important things. Walter Isaacson’s biography of the Apple founder is full of stories of Jobs’ technique, often referred to as “slash and burn.” Jobs hosted an annual retreat for the top 100 leaders of the company. He would stand at a whiteboard and list out the company’s top 10 priorities. As the group fought to get their ideas on the list, Jobs would deem which were worthy of inclusion on the board, and write them down. Once the agonizing work had been done to get the list to 10, Jobs would cross off the bottom seven. “We can only do three.” By deciding what our priority is, we’re also deciding what it isn’t. That’s hard. What are we so busy doing? Before my wife and I had children, I remember telling a coworker how busy we were. She laughed and gave me a patronizing “you’re too dumb to even know what you just said” look. She had two young children at the time, and explained true business as “when there’s something you absolutely, positively have to get done before going to bed, and you fall asleep on your way to doing it.” Yes. That’s busy. While we’ve been convincing ourselves that it’s somehow possible to have multiple priorities, we’ve also been convincing ourselves that extreme business equals productivity. “Busy” has almost replaced “fine” as the standard response to the hallway question “How are you?” This happens a lot: Person: “How’s it going?”Me: “Crazy busy. You?”Person: “Yep. I hear you.”Me: “It’s a good thing, right?”Person: “Job security.” This is ridiculous. What am I so busy with? My priority? Usually not. Usually it’s managing all of those things distracting me from my priority. Email. Meetings. Text messages. IMs. Other people’s priorities. Not mine. I’m not getting work done. I’m just processing messages. If I listed the 100 things I find myself doing on one of those Steve Jobs whiteboards, he’d cross 97 of them off the list. What’s stopping me from doing the same thing? If you’d like some guidance on incorporating the concepts from this post in your life or work, I’d love to help. Find me at Christopher Sowers — Coach Profile on Coach.me. You can use the promo code CHRIS11873WEEK for a free week of online coaching. ", "child": "2357_1\t2357_2\t2357_3\t2357_4\t2357_5\t2357_6\t2357_7\t2357_82357_1\t2357_2\t2357_3\t2357_4\t2357_5\t2357_6\t2357_7\t2357_82357_1\t2357_2\t2357_3\t2357_4\t2357_5\t2357_6\t2357_7\t2357_82357_1\t2357_2\t2357_3\t2357_4\t2357_5\t2357_6\t2357_7\t2357_8"}