{"name": "2358", "parent": "", "title": "The Surprising Trait of Great Leaders — and how to develop it.", "sentences": [{"9107": "The Surprising Trait of Great Leaders — and how to develop it."}, {"1387": "“I don’t know.”"}, {"6ed8": "I was standing in front of more than 200 owners at my first annual meeting as General Manager. It felt like I’d been at the microphone for hours on every subject imaginable — operations, capital projects, insurance, fund balances, team development, specific fees and allocations, and so on. It was their main chance to get questions answered, and they deserved full accountability and transparency."}, {"c92b": "I don’t recall the topic, but I do remember what it felt like to say those three words. I’d been dreading it all morning, reaching into the far corners of my mind and our supporting material. It could no longer be avoided. The words of my mentor echoed silently between my ears."}, {"d55c": "Just admit what you don’t know."}, {"799e": "So I did. And … nothing happened. There was no lightning strike or angry mob. The owner nodded, and I followed up that we would research it and be back in touch. That was it."}, {"e657": "Aside from releasing mountains of anxiety and expectations, I learned a powerful lesson that day — to be respected and trusted, I had to be vulnerable."}, {"00fb": "I had to be open about my weaknesses and knowledge gaps. In order to have confidence in what I did share, they had to know I could admit when we were venturing into an unknown."}, {"a708": "If we plot vulnerability on a spectrum, there’s certainly a sweet spot for leaders. Pitfalls exist at either extreme."}, {"90a8": "To the far left are leaders that will not allow any chinks in their armor. They’re either unaware that they have any deficiencies, or unwilling to admit them."}, {"2eec": "To the far right are leaders that draw attention to every obstacle or challenge in their path. They want to be sure everyone is fully aware of the stress or workload they’re carrying."}, {"2580": "We’ll want to avoid either of those approaches, and focus on behaviors that move us closer to the right balance."}, {"9d92": "Here are some examples to consider:"}, {"b651": "When tasked with a new project by your manager, do you:"}, {"f3f1": "When confronted with a funding shortfall, do you:"}, {"6690": "In each set, the third option navigates with appropriate vulnerability."}, {"1165": "The key factors to consider are:"}, {"4739": "It takes practice, and we’re likely to misstep from time to time. That’s a part of the leadership journey. The key is to be intentional and learn from each experience."}, {"014f": "Have you ever been vulnerable with your team in a tough situation? Was that a difficult choice to make?"}, {"5515": "— —"}, {"4401": "I believe that leadership is a choice to be a contagious force for the positive, and I’m committed to helping leaders live and serve at their best. If that sounds interesting to you, let’s connect."}, {"fadd": "— —"}, {"8890": "image credit: flickr/Infusionsoft"}], "content": "The Surprising Trait of Great Leaders — and how to develop it. “I don’t know.” I was standing in front of more than 200 owners at my first annual meeting as General Manager. It felt like I’d been at the microphone for hours on every subject imaginable — operations, capital projects, insurance, fund balances, team development, specific fees and allocations, and so on. It was their main chance to get questions answered, and they deserved full accountability and transparency. I don’t recall the topic, but I do remember what it felt like to say those three words. I’d been dreading it all morning, reaching into the far corners of my mind and our supporting material. It could no longer be avoided. The words of my mentor echoed silently between my ears. Just admit what you don’t know. So I did. And … nothing happened. There was no lightning strike or angry mob. The owner nodded, and I followed up that we would research it and be back in touch. That was it. Aside from releasing mountains of anxiety and expectations, I learned a powerful lesson that day — to be respected and trusted, I had to be vulnerable. I had to be open about my weaknesses and knowledge gaps. In order to have confidence in what I did share, they had to know I could admit when we were venturing into an unknown. If we plot vulnerability on a spectrum, there’s certainly a sweet spot for leaders. Pitfalls exist at either extreme. To the far left are leaders that will not allow any chinks in their armor. They’re either unaware that they have any deficiencies, or unwilling to admit them. To the far right are leaders that draw attention to every obstacle or challenge in their path. They want to be sure everyone is fully aware of the stress or workload they’re carrying. We’ll want to avoid either of those approaches, and focus on behaviors that move us closer to the right balance. Here are some examples to consider: When tasked with a new project by your manager, do you: When confronted with a funding shortfall, do you: In each set, the third option navigates with appropriate vulnerability. The key factors to consider are: It takes practice, and we’re likely to misstep from time to time. That’s a part of the leadership journey. The key is to be intentional and learn from each experience. Have you ever been vulnerable with your team in a tough situation? Was that a difficult choice to make? — — I believe that leadership is a choice to be a contagious force for the positive, and I’m committed to helping leaders live and serve at their best. If that sounds interesting to you, let’s connect. — — image credit: flickr/Infusionsoft ", "child": "2358_1\t2358_22358_1\t2358_22358_1\t2358_2"}