{"name": "2360", "parent": "", "title": "How to Make Sure Your Team is as Brilliant as the People On It", "sentences": [{"61ca": "How to Make Sure Your Team is as Brilliant as the People On It"}, {"bfde": "The Ford Pinto goes into production. Mortgage-backed securities bring down an economy. Vanilla Oreos are a thing."}, {"db6d": "One of the biggest pitfalls for a team of people working together is groupthink — the tendency for individuals on the team to go along with whatever the group seems to be deciding, simply because the group seems to be deciding it. After all, there’s no way all of these people can be wrong. Right?"}, {"8095": "If they’re not continually challenged, even strong, high performing teams can get complacent. And when they get complacent, the team members stop challenging each other, stop appropriately questioning one another’s conclusions, and stop making great decisions. Groupthink sets in."}, {"9865": "“If we are all in agreement on the decision, then I propose we postpone further discussion of this matter until our next meeting to give ourselves time to develop disagreement and perhaps gain some understanding of what the decision is all about.”"}, {"0c5d": "— Alfred Sloan, Former Chairman / CEO, General Motors"}, {"519c": "So how does a team avoid groupthink? First of all, they perform. It’s the definition of high-performing teams — they don’t get lulled into ‘because-that’s-what-everyone-seems-to-believe-itis.’ They continually push one another, asking each other the difficult or sometimes child-like obvious questions. They aren’t afraid, and they don’t hold back."}, {"29cd": "Some tools for avoiding groupthink:"}, {"8233": "Host A Premortem. You’re probably familiar with the concept of a Postmortem — or its more optimistic cousin the Lessons Learned Session — where the team dissects the root cause(s) of a failed project after the failure has occurred in an effort to avoid those causes in the future."}, {"ae17": "Premortems take place in the early- to mid-stages of a project, and get the team thinking about how the project might fail. “Pretend its 3 months after launch, and this project has failed. Write down as many reasons as you can think of for this failure.”"}, {"523a": "The team then examines their predicted root causes, and determines steps they can take to preempt the failure where feasible. Our pretend failure was because we didn’t engage the purchasing department early enough? We can do something about that now. We failed because global warming turned the entire surface of the planet into an ocean? Not so much. You get the idea."}, {"eb3c": "Have A Debate. Even if you weren’t captain of your high school debate team, chances are you did this at some point during your education. The teacher assigned an issue, and assigned you to argue one side of the issue. Didn’t matter how you felt about gun control, your grade was based on how well you argued the side you were assigned to."}, {"e4ee": "Try this in a project meeting with a contentious issue. Have everyone vote for what side they’re on, then make them argue the opposing side in a debate in your next meeting."}, {"aef2": "Assign A Role. Designate someone in the room as the Devil’s Advocate. Whenever the group seems to be at consensus, or when groupthink might be settling in, it’s the Devil’s Advocate’s responsibility to speak up and do their thing. Rotate this responsibility so that everyone on the team has a chance to take on this role and to keep it fresh."}, {"3ce2": "Whatever approach you take, address groupthink head on. Talk about it with the team. Discuss measures you want to take as a group to avoid the trap. This will keep it front and center in everyone’s mind, and will keep them on the lookout. Even better, they won’t be afraid to talk about it when they sense the team falling into it."}, {"2511": "If you’d like some guidance on incorporating the concepts from this post in your life or work, I’d love to help. Find me at Christopher Sowers — Coach Profile on Coach.me. You can use the promo code CHRIS11873WEEK for a free week of online coaching."}], "content": "How to Make Sure Your Team is as Brilliant as the People On It The Ford Pinto goes into production. Mortgage-backed securities bring down an economy. Vanilla Oreos are a thing. One of the biggest pitfalls for a team of people working together is groupthink — the tendency for individuals on the team to go along with whatever the group seems to be deciding, simply because the group seems to be deciding it. After all, there’s no way all of these people can be wrong. Right? If they’re not continually challenged, even strong, high performing teams can get complacent. And when they get complacent, the team members stop challenging each other, stop appropriately questioning one another’s conclusions, and stop making great decisions. Groupthink sets in. “If we are all in agreement on the decision, then I propose we postpone further discussion of this matter until our next meeting to give ourselves time to develop disagreement and perhaps gain some understanding of what the decision is all about.” — Alfred Sloan, Former Chairman / CEO, General Motors So how does a team avoid groupthink? First of all, they perform. It’s the definition of high-performing teams — they don’t get lulled into ‘because-that’s-what-everyone-seems-to-believe-itis.’ They continually push one another, asking each other the difficult or sometimes child-like obvious questions. They aren’t afraid, and they don’t hold back. Some tools for avoiding groupthink: Host A Premortem. You’re probably familiar with the concept of a Postmortem — or its more optimistic cousin the Lessons Learned Session — where the team dissects the root cause(s) of a failed project after the failure has occurred in an effort to avoid those causes in the future. Premortems take place in the early- to mid-stages of a project, and get the team thinking about how the project might fail. “Pretend its 3 months after launch, and this project has failed. Write down as many reasons as you can think of for this failure.” The team then examines their predicted root causes, and determines steps they can take to preempt the failure where feasible. Our pretend failure was because we didn’t engage the purchasing department early enough? We can do something about that now. We failed because global warming turned the entire surface of the planet into an ocean? Not so much. You get the idea. Have A Debate. Even if you weren’t captain of your high school debate team, chances are you did this at some point during your education. The teacher assigned an issue, and assigned you to argue one side of the issue. Didn’t matter how you felt about gun control, your grade was based on how well you argued the side you were assigned to. Try this in a project meeting with a contentious issue. Have everyone vote for what side they’re on, then make them argue the opposing side in a debate in your next meeting. Assign A Role. Designate someone in the room as the Devil’s Advocate. Whenever the group seems to be at consensus, or when groupthink might be settling in, it’s the Devil’s Advocate’s responsibility to speak up and do their thing. Rotate this responsibility so that everyone on the team has a chance to take on this role and to keep it fresh. Whatever approach you take, address groupthink head on. Talk about it with the team. Discuss measures you want to take as a group to avoid the trap. This will keep it front and center in everyone’s mind, and will keep them on the lookout. Even better, they won’t be afraid to talk about it when they sense the team falling into it. If you’d like some guidance on incorporating the concepts from this post in your life or work, I’d love to help. Find me at Christopher Sowers — Coach Profile on Coach.me. You can use the promo code CHRIS11873WEEK for a free week of online coaching. ", "child": "2360_12360_1"}