{"name": "2362", "parent": "", "title": "How to Start Coaching Anyone on Anything", "sentences": [{"f29c": "How to Start Coaching Anyone on Anything"}, {"199b": "One of the most difficult things about beginning a managing / coaching relationship with someone is figuring out where to start. More than any other, two questions have helped me determine where to start when I begin coaching someone:"}, {"ba42": "The first question gets to the skills and abilities to do the work. The second gets to the willingness to do the work. The willingness to put forth best effort. The answers to these questions help define the approach I’m going to start with — shown by the 4 quadrants in the illustration. The overall goal is to always be working towards Quadrant IV, where our coachee is both willing and able to do the work, and where we can use as much Socratic coaching as possible."}, {"e470": "Quadrant I — Willing, Not Able"}, {"0042": "In Q1, the coachee is perfectly willing to do the work, but doesn’t have the skills or ability. This is the perfect situation to take a directive approach. Directive coaching and teaching are nearly synonymous. The coachee needs to be taught the skill before she can be expected to perform it. Perhaps it’s new subject matter, a new type of project, or a new tool or piece of software. Whatever the case, when the skill is absent, the skill needs to be taught. Directly."}, {"40e6": "Quadrant II — Not Willing, Not Able"}, {"3203": "In Q2, nothing seems to be working. The coachee not only doesn’t seem to have the ability to do the work, he doesn’t even seem interested in it. In these situations, it’s often the case that the coachee doesn’t seem interested in the work because he doesn’t have the skills. That’s why the advice in this quadrant is for the coach to take a directive approach — start with teaching the skills. Many times, an increase in skills will lead to an increase in motivation (simply being good at something can be motivating), moving you closer to Q4."}, {"d9b0": "Quadrant III — Not Willing, Able"}, {"9ca8": "This is perhaps the most difficult quadrant to deal with as a coach. The coachee seems to have all the skills required to do the work, but doesn’t seem to have any desire or drive for it. There is likely a motivation issue here — something may be going on either in the coachee’s work environment or personal life that’s keeping him from investing fully in the task at hand. Start with the work environment — is the work itself challenging enough? Is the coachee having to put up with a toxic teammate? Have expectations been clearly outlined? If there aren’t any apparent work environment causes, move on to outside of work, but be careful how you approach this subject. A simple, direct but gentle question will likely be enough. “I’ve noticed you haven’t seemed very energized by your work lately. What’s going on?” Be prepared to refer your coachee to additional resources (counseling, company’s HR or Employee Assistance Program, etc.) as appropriate."}, {"a183": "Quadrant IV — Willing and Able"}, {"13e7": "Q4 is where we’d most like to be, and where our coaching in the other quadrants is trying to get us. The coachee is motivated to do the work, and she has the skills for it. Perhaps she just needs a little guidance, a different perspective, someone to talk through things with. Note that she may not believe she has the skills or ability. That doesn’t matter. What does matter is that you — her coach — do. You may have more confidence in her ability to take this on than she has in herself — that’s the perfect opportunity for Socratic coaching. There are lots of resources and methods out there for Socratic coaching, but the best I’ve come across is the GROW method (Google’s “rework” project happens to agree)."}, {"3682": "If someone working for or with you needs a bit of coaching, figure out which quadrant they’re in and get started."}, {"816b": "I’ve spent the last decade managing engineers and leading engineering teams, and have trained over 900 managers in coaching skills along the way. Find me at Christopher Sowers — Coach Profile on Coach.me, and use the promo code CHRIS11873WEEK for a free week of online coaching."}], "content": "How to Start Coaching Anyone on Anything One of the most difficult things about beginning a managing / coaching relationship with someone is figuring out where to start. More than any other, two questions have helped me determine where to start when I begin coaching someone: The first question gets to the skills and abilities to do the work. The second gets to the willingness to do the work. The willingness to put forth best effort. The answers to these questions help define the approach I’m going to start with — shown by the 4 quadrants in the illustration. The overall goal is to always be working towards Quadrant IV, where our coachee is both willing and able to do the work, and where we can use as much Socratic coaching as possible. Quadrant I — Willing, Not Able In Q1, the coachee is perfectly willing to do the work, but doesn’t have the skills or ability. This is the perfect situation to take a directive approach. Directive coaching and teaching are nearly synonymous. The coachee needs to be taught the skill before she can be expected to perform it. Perhaps it’s new subject matter, a new type of project, or a new tool or piece of software. Whatever the case, when the skill is absent, the skill needs to be taught. Directly. Quadrant II — Not Willing, Not Able In Q2, nothing seems to be working. The coachee not only doesn’t seem to have the ability to do the work, he doesn’t even seem interested in it. In these situations, it’s often the case that the coachee doesn’t seem interested in the work because he doesn’t have the skills. That’s why the advice in this quadrant is for the coach to take a directive approach — start with teaching the skills. Many times, an increase in skills will lead to an increase in motivation (simply being good at something can be motivating), moving you closer to Q4. Quadrant III — Not Willing, Able This is perhaps the most difficult quadrant to deal with as a coach. The coachee seems to have all the skills required to do the work, but doesn’t seem to have any desire or drive for it. There is likely a motivation issue here — something may be going on either in the coachee’s work environment or personal life that’s keeping him from investing fully in the task at hand. Start with the work environment — is the work itself challenging enough? Is the coachee having to put up with a toxic teammate? Have expectations been clearly outlined? If there aren’t any apparent work environment causes, move on to outside of work, but be careful how you approach this subject. A simple, direct but gentle question will likely be enough. “I’ve noticed you haven’t seemed very energized by your work lately. What’s going on?” Be prepared to refer your coachee to additional resources (counseling, company’s HR or Employee Assistance Program, etc.) as appropriate. Quadrant IV — Willing and Able Q4 is where we’d most like to be, and where our coaching in the other quadrants is trying to get us. The coachee is motivated to do the work, and she has the skills for it. Perhaps she just needs a little guidance, a different perspective, someone to talk through things with. Note that she may not believe she has the skills or ability. That doesn’t matter. What does matter is that you — her coach — do. You may have more confidence in her ability to take this on than she has in herself — that’s the perfect opportunity for Socratic coaching. There are lots of resources and methods out there for Socratic coaching, but the best I’ve come across is the GROW method (Google’s “rework” project happens to agree). If someone working for or with you needs a bit of coaching, figure out which quadrant they’re in and get started. I’ve spent the last decade managing engineers and leading engineering teams, and have trained over 900 managers in coaching skills along the way. Find me at Christopher Sowers — Coach Profile on Coach.me, and use the promo code CHRIS11873WEEK for a free week of online coaching. ", "child": "2362_1\t2362_2\t2362_32362_1\t2362_2\t2362_3"}