{"name": "2365", "parent": "", "title": "Why Networking Is Not Overrated", "sentences": [{"7f06": "Why Networking Is Not Overrated"}, {"5ade": "How an introvert networked their way to a few million in revenue"}, {"aeb1": "Theme Song: Rise and Shine — J. Cole"}, {"6242": "I caught a conversation last week started by Naval Ravikant of Angelist (Hi Naval, lets talk sometime:"}, {"5daa": "The response from Anil Dash :"}, {"6d32": "My response in short:"}, {"1fc3": "I won’t preach too much, but rather just tell you my story."}, {"fc2c": "I was born in Harlem, NY to Jamaican and Guyanese parents. We moved to Jamaica for a bit, until Hurricane Gilbert, and then to Guyana afterwards. While in Guyana I lived with my grandma Enid, who is someone you should read about to understand who influences me on this topic."}, {"39cd": "After another tragic event, my parents decided to move me to the US. We didn’t have a big network or resources in the United States, but they were willing to sacrifice the networks they had in the Caribbean in order to give me better educational and life opportunities."}, {"4e3b": "Growing up, I was generally a quiet kid. Cordial with others but always subtly feeling like an “other” since in any educational setting, I was usually the only black male in the room."}, {"4e94": "Fast forward to after college, I had studied computer science at Carnegie Mellon and had some technical skills after interning at Apple. Health problems hit me suddenly and I ended up spending the prime years of my mid twenties in and out of hospitals recovering."}, {"864a": "The any semblance of a small network that I had at the time via school, I largely lost. My core “crew” abandoned me and I had to work back to even being a normal, functioning member of society."}, {"33df": "I knew that I wanted to build that network back up so I (as an introvert) started going to meet ups and events. I remember getting pumped up when I happened to stumble into Gary Vaynerchuk’s epic talk at Web 2.0. I saw someone on stage who seemed to be antithesis of where I was mentally at the time in every conceivable way."}, {"f6eb": "The pep talk I needed"}, {"e6f8": "So I started going to meetups. I remember going to one in particular. I walked around, super nervous to talk to anyone. So I did a lap, walking around the perimeter, waiting to see if anyone would strike up a conversation. 3 laps later, I went to the bar and was about to walk out the door when the little Gary Vee on my shoulder said to go talk to someone. I turned to my left and said hi to the first person, she struck up a conversation and then ended up dragging me over to Vin Vacanti (Vin was working on aggregating daily deals, and I was helping my college friend Matt Humphrey with his daily deal site Homerun in NY). It was a perfect match, and Vin’s welcoming spirit helped me to see how open people in the NY tech community were to meeting folks and helping them on their journeys. We met for lunch soon after and he gave advice and counsel that I still cherish."}, {"fd06": "One directed networking activity I started doing was writing a blog. I started putting together thoughts and opinions about parts of the industry and although I originally got very little traffic, I wanted people who did find me to have a window into how I think and whats important to me. A little while after I started this effort, I met Carter Cleveland of Artsy after importing my whole gmail into LinkedIn (tricky dark pattern there, but I recommend it). Carter emailed me after getting the invite from a stranger at the time:"}, {"0441": "Random Linkedin requests FTW"}, {"a428": "After building a relationship with Carter for a while, he eventually handed over the StartupDigest in New York to me, a newsletter with 25,000+ subscribers. This was hugely valuable as I was able to get my name and company out to a ton of folks each week. Carter has been an inspiration and a friend who I’m also grateful to have met."}, {"560f": "Conference paid for itself by 10x"}, {"dcef": "Through more pointed effort, I began voicing my opinions online, volunteering to clean up for events, being a “conference ho,” and grabbing coffee with random people, I built a network of folks and found ways to give value to folks who I previously had no connection to."}, {"ce04": "When I decided to launch StartupThreads, I needed to get companies on board each month to let me use their logo. The well of folks who I had met at conferences and meetups were the initial group I went to, and since many of them I became friends with, they decided to give me a shot before I had really proven anything. That network seeded the revenue for the first few million in revenue for the business. I’m grateful to those folks for giving me a shot, and I attribute the networking (in my definition, connecting with people in a community and finding ways to help them succeed) that I did as the catalyst."}, {"94bc": "I didn’t just have value and let things come to me: I had to put in work to break through into some of these networks and earn the trust of others, especially being outside of silicon valley."}, {"a30d": "For me, networking is about building trust and respect with others, finding ways you can add value to the system as a whole. Rand Fishkin’s wording of it sums it up for me:"}, {"2e8d": "P.S. I just did a 1 hour talk on more tactical information related to networking. If any entrepreneurs want to get a preview of the talk (or want feedback or someone to vent to) just shoot me an email frank at startupthreads."}], "content": "Why Networking Is Not Overrated How an introvert networked their way to a few million in revenue Theme Song: Rise and Shine — J. Cole I caught a conversation last week started by Naval Ravikant of Angelist (Hi Naval, lets talk sometime: The response from Anil Dash : My response in short: I won’t preach too much, but rather just tell you my story. I was born in Harlem, NY to Jamaican and Guyanese parents. We moved to Jamaica for a bit, until Hurricane Gilbert, and then to Guyana afterwards. While in Guyana I lived with my grandma Enid, who is someone you should read about to understand who influences me on this topic. After another tragic event, my parents decided to move me to the US. We didn’t have a big network or resources in the United States, but they were willing to sacrifice the networks they had in the Caribbean in order to give me better educational and life opportunities. Growing up, I was generally a quiet kid. Cordial with others but always subtly feeling like an “other” since in any educational setting, I was usually the only black male in the room. Fast forward to after college, I had studied computer science at Carnegie Mellon and had some technical skills after interning at Apple. Health problems hit me suddenly and I ended up spending the prime years of my mid twenties in and out of hospitals recovering. The any semblance of a small network that I had at the time via school, I largely lost. My core “crew” abandoned me and I had to work back to even being a normal, functioning member of society. I knew that I wanted to build that network back up so I (as an introvert) started going to meet ups and events. I remember getting pumped up when I happened to stumble into Gary Vaynerchuk’s epic talk at Web 2.0. I saw someone on stage who seemed to be antithesis of where I was mentally at the time in every conceivable way. The pep talk I needed So I started going to meetups. I remember going to one in particular. I walked around, super nervous to talk to anyone. So I did a lap, walking around the perimeter, waiting to see if anyone would strike up a conversation. 3 laps later, I went to the bar and was about to walk out the door when the little Gary Vee on my shoulder said to go talk to someone. I turned to my left and said hi to the first person, she struck up a conversation and then ended up dragging me over to Vin Vacanti (Vin was working on aggregating daily deals, and I was helping my college friend Matt Humphrey with his daily deal site Homerun in NY). It was a perfect match, and Vin’s welcoming spirit helped me to see how open people in the NY tech community were to meeting folks and helping them on their journeys. We met for lunch soon after and he gave advice and counsel that I still cherish. One directed networking activity I started doing was writing a blog. I started putting together thoughts and opinions about parts of the industry and although I originally got very little traffic, I wanted people who did find me to have a window into how I think and whats important to me. A little while after I started this effort, I met Carter Cleveland of Artsy after importing my whole gmail into LinkedIn (tricky dark pattern there, but I recommend it). Carter emailed me after getting the invite from a stranger at the time: Random Linkedin requests FTW After building a relationship with Carter for a while, he eventually handed over the StartupDigest in New York to me, a newsletter with 25,000+ subscribers. This was hugely valuable as I was able to get my name and company out to a ton of folks each week. Carter has been an inspiration and a friend who I’m also grateful to have met. Conference paid for itself by 10x Through more pointed effort, I began voicing my opinions online, volunteering to clean up for events, being a “conference ho,” and grabbing coffee with random people, I built a network of folks and found ways to give value to folks who I previously had no connection to. When I decided to launch StartupThreads, I needed to get companies on board each month to let me use their logo. The well of folks who I had met at conferences and meetups were the initial group I went to, and since many of them I became friends with, they decided to give me a shot before I had really proven anything. That network seeded the revenue for the first few million in revenue for the business. I’m grateful to those folks for giving me a shot, and I attribute the networking (in my definition, connecting with people in a community and finding ways to help them succeed) that I did as the catalyst. I didn’t just have value and let things come to me: I had to put in work to break through into some of these networks and earn the trust of others, especially being outside of silicon valley. For me, networking is about building trust and respect with others, finding ways you can add value to the system as a whole. Rand Fishkin’s wording of it sums it up for me: P.S. I just did a 1 hour talk on more tactical information related to networking. If any entrepreneurs want to get a preview of the talk (or want feedback or someone to vent to) just shoot me an email frank at startupthreads. ", "child": "2365_1\t2365_2\t2365_3\t2365_4\t2365_5\t2365_6\t2365_7\t2365_8\t2365_9\t2365_10\t2365_11\t2365_12"}