{"name": "2366", "parent": "", "title": "T’es solo founder, tu rentres pas !", "sentences": [{"266f": "T’es solo founder, tu rentres pas !"}, {"2c5b": "T’es solo founder, tu rentres pas !"}, {"59db": "L’écosystème startup est maintenant très développé en France et on trouve tous types de structures pour aider et accompagner les entrepreneurs : incubateurs, accélérateurs, associations de business angels, VCs, BPI France, etc. Même si toutes ces structures n’ont pas le même rôle, toutes ont un leitmotiv, sans expliquer pourquoi :"}, {"7dcd": "Nous n’acceptons pas les solo founders !"}, {"e021": "Pour quelle(s) raison(s) ?"}, {"9bf0": "Si tu te fais écraser par un bus demain, le projet est mort."}, {"9230": "Certes, c’est compliqué de relancer un projet une fois que le créateur n’est plus là. Mais dans le cas d’un projet monté par une “équipe complémentaire”, est-ce que cet argument n’est pas également valable si le CTO arrive à disparaître ?"}, {"c728": "Tout seul on va plus vite, en équipe on va plus loin."}, {"a393": "À petite phrase bateau ridicule, réponse par petite phrase bateau ridicule : “vaut mieux être seul que mal accompagné”. Plus sérieusement, ces petites phrases que tous les acteurs de l’écosystème s’amusent à sortir comme si c’était des citations de Platon ou Freud n’apportent absolument rien et n’ont aucun fondement."}, {"86f6": "Une seule personne ne peut pas (savoir) tout faire."}, {"1675": "Alors sur ce point, je suis d’accord à 100%. Et avant tout, c’est le temps qui vient à manquer. Mais est-ce qu’avoir un associé business developer ou bien un salarié intéressé comme il se doit ne revient pas à peu près à la même chose ?"}, {"40b5": "Être solo founder n’est pas un choix"}, {"faf3": "Sans les paraphraser, quand elles misent sur un projet “c’est avant tout pour l’équipe qui doit être composée de profils qui s’entendent bien et qui sont complémentaires”. Ce qui est assez amusant quand ces structures font leur classement des raisons qui font qu’une startup échoue, c’est qu’elles concluent que très souvent c’est dû à l’équipe. Tiens tiens…"}, {"0ceb": "Elles voient souvent le fait d’être solo founder comme un choix de l’entrepreneur. Or non ça n’en n’est pas un. Si on essaie d’analyser comment des personnes arrivent à s’associer, on en arrive à deux situations : les associés ont fait leurs études ensemble et ont décidé de monter une boîte en sortant de l’école OU ils ont travaillé dans une entreprise et ont une envie de tout quitter pour monter leur boîte. Pour me contredire on peut citer le cas d’OpenClassrooms (ex. Site du Zéro). La façon dont s’est créée l’association entre Mathieu Nebra et Pierre Dubuc est tout à fait admirable. Mais quelle est la probabilité que cela arrive ?"}, {"e9ca": "Trouve un associé et reviens"}, {"c6f8": "Le principal conseil que l’on entend alors pour trouver un associé :"}, {"ec08": "Faites du networking"}, {"6236": "Ce conseil vu, lu et revu est loin de la réalité. Après plusieurs années passées à Paris, à participer à divers événements, je n’ai jamais rencontré quelqu’un de sérieux qui cherche un projet auquel s’associer. Chacun des participants arrive avec son propre projet et cherche un associé, souvent technique d’ailleurs. En conclusion, aller à ces événements c’est aller sur un marché vendre quelque chose où il n’y a que des vendeurs et aucun acheteur."}, {"ab9d": "Je comprends pas, trouver un associé développeur c’est dur, mais toi tu cherches un associé business, c’est facile à trouver !"}, {"b7eb": "Théoriquement, en effet, ce constat est correct. Dans la réalité, c’est un peu différent. J’ai eu l’occasion de discuter et partager avec de potentiels futurs associés et à chaque fois ça a été la déception : entre celui qui veut directement plus de 50% “parce que sa mère connait des investisseurs qui sont intéressés” et l’autre, qui au bout de plusieurs séances de travail en commun, me montre les mockups de son projet “de réseau social révolutionnaire”, qu’il veut qu’on monte ensemble parce qu’il cherche un bon développeur, la déception a toujours été au rendez-vous !"}, {"e08e": "Il y a plein de sites et applications mobiles spécialisées maintenant"}, {"1e4b": "Toutes testées, toutes désapprouvées. Certaines vendent la promesse de trouver un associé à la suite d’un questionnaire interminable quand d’autres sont devenues le repaire d’agences web offshore."}, {"bdf9": "Que faire donc ?"}, {"5581": "Trouver un associé coûte que coûte ou continuer seul, ce qui signifie sans associé ET sans accompagnement ? Comment faire changer cette espèce de vérité générale qui consiste à dire qu’un solo founder est indéniablement voué à l’échec ?"}, {"68e5": "À vos réponses :)"}], "content": "T’es solo founder, tu rentres pas ! T’es solo founder, tu rentres pas ! L’écosystème startup est maintenant très développé en France et on trouve tous types de structures pour aider et accompagner les entrepreneurs : incubateurs, accélérateurs, associations de business angels, VCs, BPI France, etc. Même si toutes ces structures n’ont pas le même rôle, toutes ont un leitmotiv, sans expliquer pourquoi : Nous n’acceptons pas les solo founders ! Pour quelle(s) raison(s) ? Si tu te fais écraser par un bus demain, le projet est mort. Certes, c’est compliqué de relancer un projet une fois que le créateur n’est plus là. Mais dans le cas d’un projet monté par une “équipe complémentaire”, est-ce que cet argument n’est pas également valable si le CTO arrive à disparaître ? Tout seul on va plus vite, en équipe on va plus loin. À petite phrase bateau ridicule, réponse par petite phrase bateau ridicule : “vaut mieux être seul que mal accompagné”. Plus sérieusement, ces petites phrases que tous les acteurs de l’écosystème s’amusent à sortir comme si c’était des citations de Platon ou Freud n’apportent absolument rien et n’ont aucun fondement. Une seule personne ne peut pas (savoir) tout faire. Alors sur ce point, je suis d’accord à 100%. Et avant tout, c’est le temps qui vient à manquer. Mais est-ce qu’avoir un associé business developer ou bien un salarié intéressé comme il se doit ne revient pas à peu près à la même chose ? Être solo founder n’est pas un choix Sans les paraphraser, quand elles misent sur un projet “c’est avant tout pour l’équipe qui doit être composée de profils qui s’entendent bien et qui sont complémentaires”. Ce qui est assez amusant quand ces structures font leur classement des raisons qui font qu’une startup échoue, c’est qu’elles concluent que très souvent c’est dû à l’équipe. Tiens tiens… Elles voient souvent le fait d’être solo founder comme un choix de l’entrepreneur. Or non ça n’en n’est pas un. Si on essaie d’analyser comment des personnes arrivent à s’associer, on en arrive à deux situations : les associés ont fait leurs études ensemble et ont décidé de monter une boîte en sortant de l’école OU ils ont travaillé dans une entreprise et ont une envie de tout quitter pour monter leur boîte. Pour me contredire on peut citer le cas d’OpenClassrooms (ex. Site du Zéro). La façon dont s’est créée l’association entre Mathieu Nebra et Pierre Dubuc est tout à fait admirable. Mais quelle est la probabilité que cela arrive ? Trouve un associé et reviens Le principal conseil que l’on entend alors pour trouver un associé : Faites du networking Ce conseil vu, lu et revu est loin de la réalité. Après plusieurs années passées à Paris, à participer à divers événements, je n’ai jamais rencontré quelqu’un de sérieux qui cherche un projet auquel s’associer. Chacun des participants arrive avec son propre projet et cherche un associé, souvent technique d’ailleurs. En conclusion, aller à ces événements c’est aller sur un marché vendre quelque chose où il n’y a que des vendeurs et aucun acheteur. Je comprends pas, trouver un associé développeur c’est dur, mais toi tu cherches un associé business, c’est facile à trouver ! Théoriquement, en effet, ce constat est correct. Dans la réalité, c’est un peu différent. J’ai eu l’occasion de discuter et partager avec de potentiels futurs associés et à chaque fois ça a été la déception : entre celui qui veut directement plus de 50% “parce que sa mère connait des investisseurs qui sont intéressés” et l’autre, qui au bout de plusieurs séances de travail en commun, me montre les mockups de son projet “de réseau social révolutionnaire”, qu’il veut qu’on monte ensemble parce qu’il cherche un bon développeur, la déception a toujours été au rendez-vous ! Il y a plein de sites et applications mobiles spécialisées maintenant Toutes testées, toutes désapprouvées. Certaines vendent la promesse de trouver un associé à la suite d’un questionnaire interminable quand d’autres sont devenues le repaire d’agences web offshore. Que faire donc ? Trouver un associé coûte que coûte ou continuer seul, ce qui signifie sans associé ET sans accompagnement ? Comment faire changer cette espèce de vérité générale qui consiste à dire qu’un solo founder est indéniablement voué à l’échec ? À vos réponses :) ", "child": "2366_1\t2366_2\t2366_3\t2366_4\t2366_5"}