{"name": "2369", "parent": "", "title": "How to get your investors to add value", "sentences": [{"3b37": "How to get your investors to add value"}, {"ad14": "Investors want to help their companies, but it isn’t that easy. So here’s my manual of making sure you get the most out of the people who gave you money."}, {"0ff7": "1. What to expect"}, {"09e1": "Think of investors like parents with too many, and grown up, kids. They care about you, want you to do well, but don’t really get you."}, {"4300": "2. Keep them informed"}, {"a620": "3. Pigeonhole them"}, {"6b93": "Hi [name],"}, {"9252": "How do we best leverage your brain & network? Do you want to be involved in operations and talk to a lot of us or do you prefer that you and I interact mostly?"}, {"cc47": "And, what is the best way; meetings, calls, coffee dates, or random? Should we schedule a date in a month — just pick a time that looks good in your calendar so we can kick it off."}, {"468d": "4. Involve them"}, {"498f": "I’m going to San Francisco 12th — 20th of March and would love intros. Mainly CTOs/techys at payment providers, but also if you know people in our space then I am happy to meet them for casual coffee. Here are some people I would love to meet:"}, {"3574": "- LinkedIn profile #1 URL (looks like you are connected to him, Janet)"}, {"6897": "- LinkedIn profile #2 URL"}, {"443a": "- LinkedIn profile #3 URL"}, {"0988": "— — — intro text blurb— — —"}, {"5841": "Hampus is the founder of Botcoin, a blockchain for chat bot attention. He is in SF 12–20th of March and I think you want to meet. Botcoin reduces fraud by 10% and they have Praypal as a client already."}, {"5759": "5. Don’ts"}, {"906f": "TL;DR"}, {"87cb": "Investors are useful as advisors, network, and peers who have been through product market fit and growth themselves. Make sure to use them."}, {"8a24": "Investors are like parents; they have been there before, but in another time, they want to help, but don’t necessarily know how."}], "content": "How to get your investors to add value Investors want to help their companies, but it isn’t that easy. So here’s my manual of making sure you get the most out of the people who gave you money. 1. What to expect Think of investors like parents with too many, and grown up, kids. They care about you, want you to do well, but don’t really get you. 2. Keep them informed 3. Pigeonhole them Hi [name], How do we best leverage your brain & network? Do you want to be involved in operations and talk to a lot of us or do you prefer that you and I interact mostly? And, what is the best way; meetings, calls, coffee dates, or random? Should we schedule a date in a month — just pick a time that looks good in your calendar so we can kick it off. 4. Involve them I’m going to San Francisco 12th — 20th of March and would love intros. Mainly CTOs/techys at payment providers, but also if you know people in our space then I am happy to meet them for casual coffee. Here are some people I would love to meet: - LinkedIn profile #1 URL (looks like you are connected to him, Janet) - LinkedIn profile #2 URL - LinkedIn profile #3 URL — — — intro text blurb— — — Hampus is the founder of Botcoin, a blockchain for chat bot attention. He is in SF 12–20th of March and I think you want to meet. Botcoin reduces fraud by 10% and they have Praypal as a client already. 5. Don’ts TL;DR Investors are useful as advisors, network, and peers who have been through product market fit and growth themselves. Make sure to use them. Investors are like parents; they have been there before, but in another time, they want to help, but don’t necessarily know how. ", "child": "2369_1"}