{"name": "237", "parent": "", "title": "An Unconventional Model: We’re In The People Business (And So Are You)", "sentences": [{"81f8": "An Unconventional Model: We’re In The People Business (And So Are You)"}, {"bfb8": "Fishbowl Day of Service, 2014 (Image courtesy of FishbowlInventory.com)"}, {"bdbc": "How often do entrepreneurs hear the question, “What business are you in?” Their eyes light up as they talk about inventions, customer experience platforms or enterprise software. They unleash a fire hose of passion about the uniqueness and benefits of the particular product they sell and the business model they’ve chosen."}, {"cc4f": "But here’s a contrarian view. We’re in the people business. That’s my company’s model and it’s what compelled me to start the venture I’m in. When I explain my reasoning, I’m betting you’ll realize it’s the business you want to get into as well."}, {"e092": "My company, Fishbowl, is ostensibly about inventory management and asset tracking software. We support manufacturers and warehouse facilities as well as Fortune 500 companies who want to track their assets. But deeper than this, Fishbowl is the vision and hope of a team of six people I met in 2004. This little group was clinging to a hope of survival in a tiny venture that was struggling for life. Their investor had sent me in to close the operation and find out the extent of the company’s debt."}, {"5256": "The product was a small matter. But these six individuals were the caliber of people I could feel good about advancing and growing for the rest of their lives (and mine). From that day forward, the product of the business was people. I went back to the investor and asked if he would give me and this team a few more weeks and promised him that if he’d do this, I wouldn’t ask him for another penny and would spend my own time and money to help the business progress. We kept that promise. In fact, not long afterwards we enjoyed the experience of sending money to him."}, {"8c63": "What does it mean to be in “the people business?”"}, {"b977": "Over the course of growing Fishbowl I also developed my unusual formula for business success. I consider the people within my company (and any company) to be its most important product and its most valuable asset. So I invest in my people. I love them and I expect great things from them. They, in turn, are in the business to try to do a little bit better and be a little bit better each day. That is all."}, {"2607": "In contrast, we’ve all seen a plethora of organizations that are not in the people business. They are in the business of making money, or of gathering market or of achieving power and fortune and fame. I’ve been in those businesses, too. But when I came to Fishbowl, I saw not only the potential for a product and market, but also the opportunity — perhaps my only opportunity — to make sure these six people who’d hung in with this tiny venture could continue to stay. That they could be compensated more than fairly, and could become part of a business that could provide a growing place and livelihood for the rest of their lives, and perhaps for the rest of their children’s lives, too."}, {"715e": "If we could create a wholesome and happy environment, then everything else would work out. I could simplify the moving parts down to the questions of “Are my people happy? Are they expanding in their capacity? Are they becoming leaders, and able to do things both independently and interdependently?” When I meet with them one on one, I’m more interested in their health, vitality and well-being and whether they’re enjoying their work than any other aspect of what they do in their roles."}, {"6293": "For established and larger companies, the culture of a business can move towards becoming more people-centric over time. But in my own case, I started out with this focus from our very first day. I made the do-or-die decision that I (and they) would sink or sail with the approach I had taken."}, {"eee0": "We were fearless in protecting this focus. We turned a $2.5M loss into a profit within the space of a year. When the recession arrived in 2008–2010, our competitors contracted. Some of them died. But that fearlessness allowed us to double down on our marketing instead. We’d forged our very existence in the face of adversity, so we weren’t about to let the fear of a dire market take us down."}, {"23d9": "Learning and Living the Law of the Harvest"}, {"24e4": "Business is difficult. Life is difficult, too. But with a people-centric focus, a team is able to construct a fabric that lifts its members up when bumps and bruises come along. We’ve grown — rapidly, at times — to become a team of more than 100 people that have achieved Inc. 500 awards, Deloitte Fast 500 acknowledgement and even a Red Herring Global 100 award. Revenue has risen to set new records each year. In 2010, our investor, who’d by now been well-rewarded for his patience in letting the fledgling company grow, needed to divest himself."}, {"b588": "Again, the people focus allowed our team to meld together in achieving a company buyback, aided by a commercial loan from a regional bank (the only enterprise loan they’d extended that year, we later discovered, as we were still in the thick of the economic downturn and crisis)."}, {"2a6b": "At times, even internally, the questions arise — “Shouldn’t we be looking at our numbers this way?” Sometimes, yes, we can (and we should). But in many cases, the question simply presents the opportunity to explain the strategy and the paradigm of being in the “people business” again. (For more on the topic, you can download an eBook version of my recent podcast interview on leadership strategies here.)"}, {"3316": "Yes, it may seem simplistic. But as a leader, when you are able to treat the people in our company like they’re as important in the company as you are (which, in fact, they are), you will see the results that you need. People will die for you, if they know of a certainty that you would die for them, too."}, {"f31d": "We are a stark contrast to the investment-funded businesses with models that compel employees who aren’t highly valued or committed to move down the street to a competing organization for an additional $10–15 per hour. In this paradigm, nobody is living in pursuit of their next big gig. You don’t have to worry about the headhunters trying to pull your best people away. People are content in a long-term relationship in which they don’t have to worry about looking over their shoulder, or being sold out or replaced. A company can function on all cylinders and engage all horsepower for a thrilling and profitable long-term ride."}, {"8c79": "When you get into the people business, beautiful things occur."}, {"cd7b": "Call to Action"}, {"3b50": "Would you like to know more? You can follow my weekly Forbes.com columns (where this originally appeared) on life, leadership and entrepreneurship here."}, {"30b9": "You can learn more about my company, Fishbowl Inventory, by visiting our website here. I look forward to hearing from you."}], "content": "An Unconventional Model: We’re In The People Business (And So Are You) Fishbowl Day of Service, 2014 (Image courtesy of FishbowlInventory.com) How often do entrepreneurs hear the question, “What business are you in?” Their eyes light up as they talk about inventions, customer experience platforms or enterprise software. They unleash a fire hose of passion about the uniqueness and benefits of the particular product they sell and the business model they’ve chosen. But here’s a contrarian view. We’re in the people business. That’s my company’s model and it’s what compelled me to start the venture I’m in. When I explain my reasoning, I’m betting you’ll realize it’s the business you want to get into as well. My company, Fishbowl, is ostensibly about inventory management and asset tracking software. We support manufacturers and warehouse facilities as well as Fortune 500 companies who want to track their assets. But deeper than this, Fishbowl is the vision and hope of a team of six people I met in 2004. This little group was clinging to a hope of survival in a tiny venture that was struggling for life. Their investor had sent me in to close the operation and find out the extent of the company’s debt. The product was a small matter. But these six individuals were the caliber of people I could feel good about advancing and growing for the rest of their lives (and mine). From that day forward, the product of the business was people. I went back to the investor and asked if he would give me and this team a few more weeks and promised him that if he’d do this, I wouldn’t ask him for another penny and would spend my own time and money to help the business progress. We kept that promise. In fact, not long afterwards we enjoyed the experience of sending money to him. What does it mean to be in “the people business?” Over the course of growing Fishbowl I also developed my unusual formula for business success. I consider the people within my company (and any company) to be its most important product and its most valuable asset. So I invest in my people. I love them and I expect great things from them. They, in turn, are in the business to try to do a little bit better and be a little bit better each day. That is all. In contrast, we’ve all seen a plethora of organizations that are not in the people business. They are in the business of making money, or of gathering market or of achieving power and fortune and fame. I’ve been in those businesses, too. But when I came to Fishbowl, I saw not only the potential for a product and market, but also the opportunity — perhaps my only opportunity — to make sure these six people who’d hung in with this tiny venture could continue to stay. That they could be compensated more than fairly, and could become part of a business that could provide a growing place and livelihood for the rest of their lives, and perhaps for the rest of their children’s lives, too. If we could create a wholesome and happy environment, then everything else would work out. I could simplify the moving parts down to the questions of “Are my people happy? Are they expanding in their capacity? Are they becoming leaders, and able to do things both independently and interdependently?” When I meet with them one on one, I’m more interested in their health, vitality and well-being and whether they’re enjoying their work than any other aspect of what they do in their roles. For established and larger companies, the culture of a business can move towards becoming more people-centric over time. But in my own case, I started out with this focus from our very first day. I made the do-or-die decision that I (and they) would sink or sail with the approach I had taken. We were fearless in protecting this focus. We turned a $2.5M loss into a profit within the space of a year. When the recession arrived in 2008–2010, our competitors contracted. Some of them died. But that fearlessness allowed us to double down on our marketing instead. We’d forged our very existence in the face of adversity, so we weren’t about to let the fear of a dire market take us down. Learning and Living the Law of the Harvest Business is difficult. Life is difficult, too. But with a people-centric focus, a team is able to construct a fabric that lifts its members up when bumps and bruises come along. We’ve grown — rapidly, at times — to become a team of more than 100 people that have achieved Inc. 500 awards, Deloitte Fast 500 acknowledgement and even a Red Herring Global 100 award. Revenue has risen to set new records each year. In 2010, our investor, who’d by now been well-rewarded for his patience in letting the fledgling company grow, needed to divest himself. Again, the people focus allowed our team to meld together in achieving a company buyback, aided by a commercial loan from a regional bank (the only enterprise loan they’d extended that year, we later discovered, as we were still in the thick of the economic downturn and crisis). At times, even internally, the questions arise — “Shouldn’t we be looking at our numbers this way?” Sometimes, yes, we can (and we should). But in many cases, the question simply presents the opportunity to explain the strategy and the paradigm of being in the “people business” again. (For more on the topic, you can download an eBook version of my recent podcast interview on leadership strategies here.) Yes, it may seem simplistic. But as a leader, when you are able to treat the people in our company like they’re as important in the company as you are (which, in fact, they are), you will see the results that you need. People will die for you, if they know of a certainty that you would die for them, too. We are a stark contrast to the investment-funded businesses with models that compel employees who aren’t highly valued or committed to move down the street to a competing organization for an additional $10–15 per hour. In this paradigm, nobody is living in pursuit of their next big gig. You don’t have to worry about the headhunters trying to pull your best people away. People are content in a long-term relationship in which they don’t have to worry about looking over their shoulder, or being sold out or replaced. A company can function on all cylinders and engage all horsepower for a thrilling and profitable long-term ride. When you get into the people business, beautiful things occur. Call to Action Would you like to know more? You can follow my weekly Forbes.com columns (where this originally appeared) on life, leadership and entrepreneurship here. You can learn more about my company, Fishbowl Inventory, by visiting our website here. I look forward to hearing from you. ", "child": "237_1\t237_2\t237_3\t237_4\t237_5"}