{"name": "238", "parent": "", "title": "The Future of Telecommuting", "sentences": [{"ecb9": "The Future of Telecommuting"}, {"cc74": "Potentially Positive Economic News?"}, {"ecf9": "There’s a common theme in news analysis about the economy: it tells you about how some new development will prove excellent for the rich, terrible for everyone else, and help bring about the decline of civilization. So it’s a bit hard for me to say this, but I think there may be some actually positive news all around for once — and it has to do with a change in telecommuting."}, {"a43d": "The story begins with the graph above, which comes from Christopher Groskopf’s recent article about the rise of telecommuting among software engineers. His article collects a variety of data and graphs, which show that this is becoming significantly more popular, one of the most-desired perks of a SWE job, and has in particular been on the rise since around 2012."}, {"ecb7": "But this is not a story about the latest Silicon Valley perk, because there’s a reason it started to rise sharply around 2012: the tools got a lot better. For many years, telecommuting meant being excluded from hallway conversations, participating in meetings only through conference calls, and having only a limited connection to the rest of your workgroup. Videoconferencing, when available, was so jumpy and unreliable that you couldn’t reliably be a full participant in meetings. It was possible, but it wasn’t something you would do if you wanted a successful career. I remember running a team distributed between Mountain View, Kraków, and Tel Aviv back in 2007; it was almost impossible, and the teams not at “headquarters” suffered for it."}, {"a246": "Starting in 2012, a host of technological changes made this shift. Google’s Hangouts started to provide high-quality, high-reliability videoconferencing, and soon all VC software was at this bar. (Today, almost every meeting I’m in involves at least one person on a VC bridge, typically several.) Cloud office products made everyone sharing comments on a doc the preferred way to do group edits, even if everyone was in the same building. Tools like Slack became the primary ways for workgroups to talk with each other. What happened is really simple: telecommuting tools finally got good enough that it wasn’t career suicide to depend on them."}, {"84d3": "I’ve seen this extensively in my own work. A year ago, I tried telecommuting for a month, working from high in the mountains. I could attend meetings just as well as I could in person; I was just one more person on a bridge. I could communicate with people just as fluidly as I did in the office. Even though my work hasn’t been focused on individual contribution as a coder in years — I’m basically a full-time engineering executive, and I spend my time in technical meetings, writing documents, and carefully arranging internal politics to make projects succeed — I could do all of its aspects just as effectively."}, {"7a2b": "Over the following year, I ran projects which were split between California, Massachusetts, New York, London, and Zurich; we had to shift our schedules a bit to allow for near-daily meetings across time zones, and I spent a bit of time on airplanes, but very few of the problems we encountered had to do with distance. One of the people in my team was even managing an individual contributor living in Sydney, with no other team around him, and that worked out fine. All of these would have been unimaginable a few years earlier."}, {"1e2d": "As a result, I’m now convinced that we’re at the point where telecommuting is becoming not just a viable second choice, but a potential routine. It’s affected software engineers first for the simple reason that we were the ones building and testing the tools on ourselves; it’s now reaching the point where it’s starting to be useful for the broader public."}, {"edf3": "Getting Out the Crystal Ball"}, {"5298": "So with this in mind, I’ve been thinking about the concrete effects it could have on our economy. The rest of this article will consist of me prognosticating; you should take it as seriously as you take any other so-called “think piece” about the future, that is, with a large grain of salt."}, {"8202": "“Foolhardy economic and technological prognostication.” (Opens envelope) “What is the largest growth industry of the early 21st century?” With apologies to Johnny Carson, whose “Carnac the Magnificent” set the standard for thinkpieces for a generation to come."}, {"ea74": "This seems to split into three natural periods: the adoption phase, in which telecommuting starts to penetrate more industries, over the next 10–15 years; the economic shift phase, in which local economies react to having entirely different pressures, maybe between 2025 and 2035; and the long-term phase, where those changes in turn start to affect culture and society. Note that these changes aren’t instantaneous, and they will happen hand-in-hand with generational change; that’s going to have important effects as well. (And all of them, of course, depend on the hypothesis that there will still be a modern world by then. Inshallah.)"}, {"2a1d": "Adoption Phase: Now — 2030"}, {"6a38": "The toolchain for telecommuting isn’t complete yet (notably absent: a distributed whiteboard that doesn’t suck), but by 2017 it’s already suitable for a range of jobs. However, companies aren’t going to change their behavior overnight; even a shift to telecommuting being acceptable tends to take about five years once a company has decided to do it, and it does require changes in all sorts of details of how people do things."}, {"a7c8": "Furthermore, not every company or industry will start at the same time. Unsurprisingly, this has started from two directions: at the very high end (e.g. software engineering), where telecommuting is a perk that attracts top talent, and at the very low end (e.g. telemarketing), where telecommuting lets employers avoid paying for a physical plant."}, {"66ee": "(It’s inevitable: Any new technology will be used, out of the gate, to screw the workers and the poor. However, this story is more likely to have a happy ending; see below.)"}, {"2ffb": "Industries with a deep mythology of the value of “the personal touch” will likely adopt this more slowly. To be honest, these aren’t industries which literally require a personal touch, such as child care; these are largely industries where older people in the field have a stronger grip over the culture, and want things to keep working the way they do. This will likely persist well into later phases, when new generations start spinning up businesses and not caring about those established norms. The existing business owners will be furious. But ultimately, any industry which can adopt telecommuting likely will, because it gives workers more flexibility and employers less costs."}, {"85ab": "Economic Shifts: 2025–2040"}, {"4526": "What’s interesting about this is that this creates a new economic axis which separates industries, much like “blue-collar” and “white-collar” did in the early 20th century: location-dependent (LD) and location-independent (LI) jobs. Jobs are generally location-dependent if they either involve operating a specific physical plant (manufacturing in a factory, agriculture, running a datacenter, working in a retail store) or physical interaction with people (child care, medicine). The set of location-dependent jobs would change over time, both because of industry adoption, and because changes in various industries may make things less location-dependent, as has been happening in retail."}, {"7109": "What’s interesting is that this means some big, and potentially positive, changes for local economies."}, {"072e": "Say we’re in the year 2035. By now, gen X is retiring, Millenials and gen Z are the senior people in offices, and the generation after Z — today’s toddlers, let’s call them gen A — is entering the workforce in large numbers. Jobs which were LD just because of slow adoption of telecommuting by X’ers and Boomers are now LI; the remaining LD jobs are either tied to physical plants, or to people."}, {"3ce4": "Physical plant LD jobs, though, are likely to be much smaller in number. These are precisely the jobs which have been most effectively automated in past decades; a modern factory or dockyard requires a small number of highly skilled workers, not a large number of low-skilled workers. By 2035, it’s likely that most other plant management jobs, from warehouse management to agriculture, will have done the same. So even though these “LD/plant” jobs will be localized, they won’t be a huge part of most local economies, since they just won’t employ that many people."}, {"d03f": "(Note, by the way, that the American jobs which moved to China over the years have started to leave China as well. Many of them aren’t moving to Malaysia or elsewhere in Southeast Asia; they’re simply disappearing outright, in favor of machines. Offshoring was simply a precursor to automation.)"}, {"6caf": "This means that industry economic cycles, and collapses of individual employers, no longer also mean the collapse of local economies, which can trigger the collapse of local infrastructure (social and physical), and ultimately make places even less suitable for companies to land. An LI-dominated economy is likely to have fewer geographically-localized disasters."}, {"ad85": "Contrast this with LI jobs. As more and more of the tasks we need to do become LI, these will become the large majority of jobs, at all skill levels. These have an interesting economic difference from location-based jobs: there’s no reason that any single employer would become the dominant local employer in most places. Rather than a company dropping a lot of jobs in one place, LI companies are dropping a small number of jobs in a lot of places. This means that industry economic cycles, and collapses of individual employers, no longer also mean the collapse of local economies, which can trigger the collapse of local infrastructure (social and physical), and ultimately make places even less suitable for companies to land. An LI-dominated economy is likely to have fewer geographically-localized disasters."}, {"3c91": "Now consider the third category, LD jobs which are LD because they involve people. These jobs will always be LD; you can’t change a diaper or administer an IV over videoconference. Their economics are determined by local demand and ability to pay, which in turn means local population density and overall local economic health. But if the rise in LI jobs means that local economic health becomes less variable, that means that these “LD/people” jobs are mostly economically tied to population density, which controls both supply and demand and changes slowly. That gives them more economic stability as well."}, {"4999": "For some jobs, it’s hard to tell which category they’ll land in, but this three-way division still seems to work. For example, retail was entirely LD in 1990, but in sectors where depth of stock really matters (like books), there’s already been a shift to location-independence. Even clothing, which used to be based entirely on trying things on in person, is becoming more reasonable to buy online, thanks to improvements in shipping logistics. Groceries are likely to be among the last to move, because they’re bulky and often require refrigeration. But since demand for these types of retail is entirely local (for the same reason!), grocery jobs are tied to local population, and behave more like LD/people than LD/plant. Generally, any LD jobs which remain such because their consumers must be local behave like LD/people jobs — even subsistence agriculture."}, {"94c2": "Some jobs may even split up. Consider elementary and secondary education: teaching today is really a fusion of two jobs, teaching and child care. The former is potentially LI; the latter is firmly LD. But the separation of these jobs into two different things is already being pioneered by home-schooling co-ops. It’s quite possible that we’ll see these grow in popularity, and turn into a larger industry, and the skillset of teachers split into the two groups. This will be a very slow change, of course, since its impact on the profession is so profound; teachers essentially remain LD/people until such a time as this happens. (At which point, we’ll likely see a great deal of hand-wringing about the two different “classes” of teachers, their different social status and pay, and so on.)"}, {"bdda": "To summarize the economic transition: Between roughly 1930 and 1990, the industrialized world was dominated by LD/plant jobs. Offshoring made many of these jobs location-independent from the employer’s perspective (you can manufacture things anywhere and ship them), but not from the employee’s perspective (you still need a factory to work at). This was just a transition to automation, however, where low-end LD/plant jobs were replaced by machines, and LD/plant jobs are increasingly specialized jobs held by a small number of people. This led to LD/people jobs like the service sector becoming the dominant employers. But with the rise of warehouses, online trade, and telecommuting, we’re moving into a world where most of the jobs are LI, and the second-most are LD/people — jobs which are location-dependent because they have to be next to their customers. LD/plant jobs, jobs location-dependent because they have to be next to specialized equipment, are becoming more specialized and a smaller part of the total employment picture."}, {"5be9": "Different players in this period will see different effects. Cities and towns will no longer have the “company town” effect, both for good and for ill; the idea of luring a single employer for such purpose will become less tempting. This will also reduce the bargaining power of companies relative to locales, which may affect the “tax incentive” industry quite a bit as well, but it also reduces the ability of locales to create sudden giant improvements. Essentially, this shift moderates the large up- and down-swings of economies into a more stable middle."}, {"899b": "Workers will be differently positioned, too. Traditional techniques for organizing workers won’t work when workers are spread around the world, but new ones likely will. (The union Slack channel?) Succeeding in LI jobs will likely require somewhat different skillsets as well — e.g., ones around organization and communication. These aren’t highly specialized, but they will impose a cultural penalty on people who don’t have them. Generational shift will almost certainly play a role."}, {"93f1": "More broadly, this will interact in complicated ways with existing social stratification. To work from home, for example, you need a partially quiet home. People who don’t have access to this, because of homelessness or a large number of children they’re responsible for, are likely to be excluded from an LI economy. Likewise, telecommuting will require some basic equipment, and it’s quite possible that (especially at the lower end of the economy) companies will either require people to have it, or lease it to them at usurious rates, creating a sort of “company store” effect. This is likely to be a significant way in which companies oppress their employees."}, {"0b6f": "A few things we do now can significantly affect that. For example, if we move towards relatively open standards of hardware for telecommuting, so that it works from any standard computer or smartphone, there’s both less opportunity to require people to rent expensive, specialized goods, and more opportunity for “work centers” where such equipment is available by the hour. Such centers are actually an advantage for everyone, not just people with low incomes: they’re the extension of modern co-working spaces, and are quite good for people who would like to telecommute, but not necessarily work from home."}, {"3d8f": "It is certain that, whatever happens, it will split along existing cultural and economic lines; the strong will try to use it to exploit the weak. But the possibility of creating local economic stability, and exiting the local busts which have devastated so many communities around the world (from collapsed company towns in Midwestern America to fields fallowed by drought in eastern Syria) creates a real option for this to do the opposite as well."}, {"c118": "The Long Term: 2035 and Beyond"}, {"ff1b": "Economics, over time, becomes culture. America’s modern culture was profoundly shaped by a few transitions between 1930 and 1955: the mass migration of nuclear families in search of (LD) work during the Depression, the huge rise in factory labor in the postwar period, and the rise of the “corporate welfare state,” where public benefits like health care and retirement were mediated through employers, were all created then. This also enabled the very specific racial and gender lines of the 20th century: those factory jobs with access to social benefits were specifically limited to white men, with the expectation that white women would acquire them as dependents. (The deal of excluding non-white communities from benefits was key to passing many of the basic laws powering these, especially during the New Deal.)"}, {"2441": "The entry of women into the workforce, the end of the strange period where factory labor could move you into the middle class (think for a moment: when in history, apart from roughly 1945–1975, was such a thing even possible? We have the phrase “working class” for a reason), the collapse of large-scale industrial labor, and the rise of global trade making such labor location-independent from the employer’s perspective, but not the employee’s, shook all of the basic principles of this."}, {"36d6": "What happens in a post-telecommuting world?"}, {"73fa": "Unlike today’s LD/plant-dominated world, in this world there’s a lot less reason to move to a particular place for work."}, {"b953": "The impetus for cultural changes is that we now have an economy (not just in the United States, but across the world) broken roughly into three subsets: LI jobs, the bulk of work at all socioeconomic levels; LD/plant jobs, a small and specialized set of jobs increasingly at the middle to high end of the spectrum; and LD/people jobs, likely to weight towards the lower end of the economic spectrum, defined by needing to be physically next to their customers, a smaller but significant set of jobs."}, {"c9fc": "Unlike today’s LD/plant-dominated world, in this world there’s a lot less reason to move to a particular place for work. This doesn’t just reverse the primary impetus of the major migrations of the 1930’s; it may have significant effects on transnational migrations, at least ones for economic reasons. If people are fleeing poverty, and their homes still have reliable access to food, shelter, and security, then landing a relatively small amount of infrastructure can then effectively connect them to a global economy."}, {"dbfa": "A likely impact is that Generation A (the one just being born now, entering the workforce en masse late in the economic shift phase) is going to be far less concerned with moving to places for work, and far more concerned with where they live for other reasons. In the developed world, this could reverse the trend of nuclear families; staying close to your extended family suddenly makes a lot more sense. It could also lead to a decentralization of cities."}, {"c63e": "This is likely to have far-reaching impacts which are hard to guess. Cities have several advantages around infrastructure concentration and causing people to interact with a wide range of people; but this latter advantage might be replaced by online interaction through work. Alternatively, it might not, leading to increased tribalism as people live only near people familiar to them. Suburbs, exurbs, and the countryside, on the other hand, have advantages around quality of life; these are likely to become substantially more appealing if not counterbalanced by a lack of (LD) work."}, {"22f4": "Most interesting to me are the impacts on class, race, gender, and the like, but I don’t know how to predict this. Will LI jobs have strong de facto racial or class barriers, like LD/plant jobs did in the 1950’s, or will the changing requirements and generations move us to entirely different social schisms? It’s hard to tell."}, {"89fd": "But for once, I’m glad to be telling an economic story about the future which contains a real option for good news."}], "content": "The Future of Telecommuting Potentially Positive Economic News? There’s a common theme in news analysis about the economy: it tells you about how some new development will prove excellent for the rich, terrible for everyone else, and help bring about the decline of civilization. So it’s a bit hard for me to say this, but I think there may be some actually positive news all around for once — and it has to do with a change in telecommuting. The story begins with the graph above, which comes from Christopher Groskopf’s recent article about the rise of telecommuting among software engineers. His article collects a variety of data and graphs, which show that this is becoming significantly more popular, one of the most-desired perks of a SWE job, and has in particular been on the rise since around 2012. But this is not a story about the latest Silicon Valley perk, because there’s a reason it started to rise sharply around 2012: the tools got a lot better. For many years, telecommuting meant being excluded from hallway conversations, participating in meetings only through conference calls, and having only a limited connection to the rest of your workgroup. Videoconferencing, when available, was so jumpy and unreliable that you couldn’t reliably be a full participant in meetings. It was possible, but it wasn’t something you would do if you wanted a successful career. I remember running a team distributed between Mountain View, Kraków, and Tel Aviv back in 2007; it was almost impossible, and the teams not at “headquarters” suffered for it. Starting in 2012, a host of technological changes made this shift. Google’s Hangouts started to provide high-quality, high-reliability videoconferencing, and soon all VC software was at this bar. (Today, almost every meeting I’m in involves at least one person on a VC bridge, typically several.) Cloud office products made everyone sharing comments on a doc the preferred way to do group edits, even if everyone was in the same building. Tools like Slack became the primary ways for workgroups to talk with each other. What happened is really simple: telecommuting tools finally got good enough that it wasn’t career suicide to depend on them. I’ve seen this extensively in my own work. A year ago, I tried telecommuting for a month, working from high in the mountains. I could attend meetings just as well as I could in person; I was just one more person on a bridge. I could communicate with people just as fluidly as I did in the office. Even though my work hasn’t been focused on individual contribution as a coder in years — I’m basically a full-time engineering executive, and I spend my time in technical meetings, writing documents, and carefully arranging internal politics to make projects succeed — I could do all of its aspects just as effectively. Over the following year, I ran projects which were split between California, Massachusetts, New York, London, and Zurich; we had to shift our schedules a bit to allow for near-daily meetings across time zones, and I spent a bit of time on airplanes, but very few of the problems we encountered had to do with distance. One of the people in my team was even managing an individual contributor living in Sydney, with no other team around him, and that worked out fine. All of these would have been unimaginable a few years earlier. As a result, I’m now convinced that we’re at the point where telecommuting is becoming not just a viable second choice, but a potential routine. It’s affected software engineers first for the simple reason that we were the ones building and testing the tools on ourselves; it’s now reaching the point where it’s starting to be useful for the broader public. Getting Out the Crystal Ball So with this in mind, I’ve been thinking about the concrete effects it could have on our economy. The rest of this article will consist of me prognosticating; you should take it as seriously as you take any other so-called “think piece” about the future, that is, with a large grain of salt. “Foolhardy economic and technological prognostication.” (Opens envelope) “What is the largest growth industry of the early 21st century?” With apologies to Johnny Carson, whose “Carnac the Magnificent” set the standard for thinkpieces for a generation to come. This seems to split into three natural periods: the adoption phase, in which telecommuting starts to penetrate more industries, over the next 10–15 years; the economic shift phase, in which local economies react to having entirely different pressures, maybe between 2025 and 2035; and the long-term phase, where those changes in turn start to affect culture and society. Note that these changes aren’t instantaneous, and they will happen hand-in-hand with generational change; that’s going to have important effects as well. (And all of them, of course, depend on the hypothesis that there will still be a modern world by then. Inshallah.) Adoption Phase: Now — 2030 The toolchain for telecommuting isn’t complete yet (notably absent: a distributed whiteboard that doesn’t suck), but by 2017 it’s already suitable for a range of jobs. However, companies aren’t going to change their behavior overnight; even a shift to telecommuting being acceptable tends to take about five years once a company has decided to do it, and it does require changes in all sorts of details of how people do things. Furthermore, not every company or industry will start at the same time. Unsurprisingly, this has started from two directions: at the very high end (e.g. software engineering), where telecommuting is a perk that attracts top talent, and at the very low end (e.g. telemarketing), where telecommuting lets employers avoid paying for a physical plant. (It’s inevitable: Any new technology will be used, out of the gate, to screw the workers and the poor. However, this story is more likely to have a happy ending; see below.) Industries with a deep mythology of the value of “the personal touch” will likely adopt this more slowly. To be honest, these aren’t industries which literally require a personal touch, such as child care; these are largely industries where older people in the field have a stronger grip over the culture, and want things to keep working the way they do. This will likely persist well into later phases, when new generations start spinning up businesses and not caring about those established norms. The existing business owners will be furious. But ultimately, any industry which can adopt telecommuting likely will, because it gives workers more flexibility and employers less costs. Economic Shifts: 2025–2040 What’s interesting about this is that this creates a new economic axis which separates industries, much like “blue-collar” and “white-collar” did in the early 20th century: location-dependent (LD) and location-independent (LI) jobs. Jobs are generally location-dependent if they either involve operating a specific physical plant (manufacturing in a factory, agriculture, running a datacenter, working in a retail store) or physical interaction with people (child care, medicine). The set of location-dependent jobs would change over time, both because of industry adoption, and because changes in various industries may make things less location-dependent, as has been happening in retail. What’s interesting is that this means some big, and potentially positive, changes for local economies. Say we’re in the year 2035. By now, gen X is retiring, Millenials and gen Z are the senior people in offices, and the generation after Z — today’s toddlers, let’s call them gen A — is entering the workforce in large numbers. Jobs which were LD just because of slow adoption of telecommuting by X’ers and Boomers are now LI; the remaining LD jobs are either tied to physical plants, or to people. Physical plant LD jobs, though, are likely to be much smaller in number. These are precisely the jobs which have been most effectively automated in past decades; a modern factory or dockyard requires a small number of highly skilled workers, not a large number of low-skilled workers. By 2035, it’s likely that most other plant management jobs, from warehouse management to agriculture, will have done the same. So even though these “LD/plant” jobs will be localized, they won’t be a huge part of most local economies, since they just won’t employ that many people. (Note, by the way, that the American jobs which moved to China over the years have started to leave China as well. Many of them aren’t moving to Malaysia or elsewhere in Southeast Asia; they’re simply disappearing outright, in favor of machines. Offshoring was simply a precursor to automation.) This means that industry economic cycles, and collapses of individual employers, no longer also mean the collapse of local economies, which can trigger the collapse of local infrastructure (social and physical), and ultimately make places even less suitable for companies to land. An LI-dominated economy is likely to have fewer geographically-localized disasters. Contrast this with LI jobs. As more and more of the tasks we need to do become LI, these will become the large majority of jobs, at all skill levels. These have an interesting economic difference from location-based jobs: there’s no reason that any single employer would become the dominant local employer in most places. Rather than a company dropping a lot of jobs in one place, LI companies are dropping a small number of jobs in a lot of places. This means that industry economic cycles, and collapses of individual employers, no longer also mean the collapse of local economies, which can trigger the collapse of local infrastructure (social and physical), and ultimately make places even less suitable for companies to land. An LI-dominated economy is likely to have fewer geographically-localized disasters. Now consider the third category, LD jobs which are LD because they involve people. These jobs will always be LD; you can’t change a diaper or administer an IV over videoconference. Their economics are determined by local demand and ability to pay, which in turn means local population density and overall local economic health. But if the rise in LI jobs means that local economic health becomes less variable, that means that these “LD/people” jobs are mostly economically tied to population density, which controls both supply and demand and changes slowly. That gives them more economic stability as well. For some jobs, it’s hard to tell which category they’ll land in, but this three-way division still seems to work. For example, retail was entirely LD in 1990, but in sectors where depth of stock really matters (like books), there’s already been a shift to location-independence. Even clothing, which used to be based entirely on trying things on in person, is becoming more reasonable to buy online, thanks to improvements in shipping logistics. Groceries are likely to be among the last to move, because they’re bulky and often require refrigeration. But since demand for these types of retail is entirely local (for the same reason!), grocery jobs are tied to local population, and behave more like LD/people than LD/plant. Generally, any LD jobs which remain such because their consumers must be local behave like LD/people jobs — even subsistence agriculture. Some jobs may even split up. Consider elementary and secondary education: teaching today is really a fusion of two jobs, teaching and child care. The former is potentially LI; the latter is firmly LD. But the separation of these jobs into two different things is already being pioneered by home-schooling co-ops. It’s quite possible that we’ll see these grow in popularity, and turn into a larger industry, and the skillset of teachers split into the two groups. This will be a very slow change, of course, since its impact on the profession is so profound; teachers essentially remain LD/people until such a time as this happens. (At which point, we’ll likely see a great deal of hand-wringing about the two different “classes” of teachers, their different social status and pay, and so on.) To summarize the economic transition: Between roughly 1930 and 1990, the industrialized world was dominated by LD/plant jobs. Offshoring made many of these jobs location-independent from the employer’s perspective (you can manufacture things anywhere and ship them), but not from the employee’s perspective (you still need a factory to work at). This was just a transition to automation, however, where low-end LD/plant jobs were replaced by machines, and LD/plant jobs are increasingly specialized jobs held by a small number of people. This led to LD/people jobs like the service sector becoming the dominant employers. But with the rise of warehouses, online trade, and telecommuting, we’re moving into a world where most of the jobs are LI, and the second-most are LD/people — jobs which are location-dependent because they have to be next to their customers. LD/plant jobs, jobs location-dependent because they have to be next to specialized equipment, are becoming more specialized and a smaller part of the total employment picture. Different players in this period will see different effects. Cities and towns will no longer have the “company town” effect, both for good and for ill; the idea of luring a single employer for such purpose will become less tempting. This will also reduce the bargaining power of companies relative to locales, which may affect the “tax incentive” industry quite a bit as well, but it also reduces the ability of locales to create sudden giant improvements. Essentially, this shift moderates the large up- and down-swings of economies into a more stable middle. Workers will be differently positioned, too. Traditional techniques for organizing workers won’t work when workers are spread around the world, but new ones likely will. (The union Slack channel?) Succeeding in LI jobs will likely require somewhat different skillsets as well — e.g., ones around organization and communication. These aren’t highly specialized, but they will impose a cultural penalty on people who don’t have them. Generational shift will almost certainly play a role. More broadly, this will interact in complicated ways with existing social stratification. To work from home, for example, you need a partially quiet home. People who don’t have access to this, because of homelessness or a large number of children they’re responsible for, are likely to be excluded from an LI economy. Likewise, telecommuting will require some basic equipment, and it’s quite possible that (especially at the lower end of the economy) companies will either require people to have it, or lease it to them at usurious rates, creating a sort of “company store” effect. This is likely to be a significant way in which companies oppress their employees. A few things we do now can significantly affect that. For example, if we move towards relatively open standards of hardware for telecommuting, so that it works from any standard computer or smartphone, there’s both less opportunity to require people to rent expensive, specialized goods, and more opportunity for “work centers” where such equipment is available by the hour. Such centers are actually an advantage for everyone, not just people with low incomes: they’re the extension of modern co-working spaces, and are quite good for people who would like to telecommute, but not necessarily work from home. It is certain that, whatever happens, it will split along existing cultural and economic lines; the strong will try to use it to exploit the weak. But the possibility of creating local economic stability, and exiting the local busts which have devastated so many communities around the world (from collapsed company towns in Midwestern America to fields fallowed by drought in eastern Syria) creates a real option for this to do the opposite as well. The Long Term: 2035 and Beyond Economics, over time, becomes culture. America’s modern culture was profoundly shaped by a few transitions between 1930 and 1955: the mass migration of nuclear families in search of (LD) work during the Depression, the huge rise in factory labor in the postwar period, and the rise of the “corporate welfare state,” where public benefits like health care and retirement were mediated through employers, were all created then. This also enabled the very specific racial and gender lines of the 20th century: those factory jobs with access to social benefits were specifically limited to white men, with the expectation that white women would acquire them as dependents. (The deal of excluding non-white communities from benefits was key to passing many of the basic laws powering these, especially during the New Deal.) The entry of women into the workforce, the end of the strange period where factory labor could move you into the middle class (think for a moment: when in history, apart from roughly 1945–1975, was such a thing even possible? We have the phrase “working class” for a reason), the collapse of large-scale industrial labor, and the rise of global trade making such labor location-independent from the employer’s perspective, but not the employee’s, shook all of the basic principles of this. What happens in a post-telecommuting world? Unlike today’s LD/plant-dominated world, in this world there’s a lot less reason to move to a particular place for work. The impetus for cultural changes is that we now have an economy (not just in the United States, but across the world) broken roughly into three subsets: LI jobs, the bulk of work at all socioeconomic levels; LD/plant jobs, a small and specialized set of jobs increasingly at the middle to high end of the spectrum; and LD/people jobs, likely to weight towards the lower end of the economic spectrum, defined by needing to be physically next to their customers, a smaller but significant set of jobs. Unlike today’s LD/plant-dominated world, in this world there’s a lot less reason to move to a particular place for work. This doesn’t just reverse the primary impetus of the major migrations of the 1930’s; it may have significant effects on transnational migrations, at least ones for economic reasons. If people are fleeing poverty, and their homes still have reliable access to food, shelter, and security, then landing a relatively small amount of infrastructure can then effectively connect them to a global economy. A likely impact is that Generation A (the one just being born now, entering the workforce en masse late in the economic shift phase) is going to be far less concerned with moving to places for work, and far more concerned with where they live for other reasons. In the developed world, this could reverse the trend of nuclear families; staying close to your extended family suddenly makes a lot more sense. It could also lead to a decentralization of cities. This is likely to have far-reaching impacts which are hard to guess. Cities have several advantages around infrastructure concentration and causing people to interact with a wide range of people; but this latter advantage might be replaced by online interaction through work. Alternatively, it might not, leading to increased tribalism as people live only near people familiar to them. Suburbs, exurbs, and the countryside, on the other hand, have advantages around quality of life; these are likely to become substantially more appealing if not counterbalanced by a lack of (LD) work. Most interesting to me are the impacts on class, race, gender, and the like, but I don’t know how to predict this. Will LI jobs have strong de facto racial or class barriers, like LD/plant jobs did in the 1950’s, or will the changing requirements and generations move us to entirely different social schisms? It’s hard to tell. But for once, I’m glad to be telling an economic story about the future which contains a real option for good news. ", "child": "238_1\t238_2\t238_3\t238_4\t238_5\t238_6\t238_7\t238_8\t238_9\t238_10\t238_11\t238_12\t238_13238_1\t238_2\t238_3\t238_4\t238_5\t238_6\t238_7\t238_8\t238_9\t238_10\t238_11\t238_12\t238_13238_1\t238_2\t238_3\t238_4\t238_5\t238_6\t238_7\t238_8\t238_9\t238_10\t238_11\t238_12\t238_13"}