{"name": "2380", "parent": "", "title": "How we convinced Peter Thiel’s fund to invest in Qonto", "sentences": [{"9441": "How we convinced Peter Thiel’s fund to invest in Qonto"}, {"392f": "The behind-the-scenes story"}, {"b58a": "Qonto got a lot of PR attention 2 months ago as the 1st investment of Valar Ventures (founded by Peter Thiel) in France. This definitely helped us spread the word about Qonto, and contributed to attract our first 2,000+ signups on the Qonto beta waiting list, with literally no marketing cost."}, {"08e6": "I thought it would be worth sharing the behind-the-scenes story."}, {"fc3a": "Starting"}, {"eced": "My co-founder Steve and I sold our previous venture (Smokio) to a Fortune 500 company, just after 2 years of existence."}, {"9e7d": "As much as I loved this journey, I never really experienced the pain we aimed at solving — help people quit smoking — myself, as I never really smoked."}, {"e312": "I more or less consciously started seeking another pain point to address that I would personally know. I was the one in charge of all admin and financial tasks at Smokio, and I can’t say enough about how our banking services nearly drove me crazy: outdated tools, poor customer service, and this constant feeling of not knowing what we were paying for. I had been looking for banking alternatives for a while, but all the existing ‘modern’ ones appeared to be (i) geared towards B2C users, (ii) not currently available in France: Simple (US), Nubank (Brazil), for instance."}, {"ef4d": "This is how Steve and I, started being more and more intimately convinced something BIG would happen in the small business banking space in Europe."}, {"18f2": "To be totally honest, there was another idea we really liked: ‘disrupting health insurance’… this is how we met Jean-Charles Samuelian. We were really impressed by his drive, experience and grit, and he had already started working on what would become Alan. We just thought this pain point was in good hands already. 😉"}, {"fa9d": "So we started drafting wireframes, interviewing experts, registered a new company and invested a couple of hundreds thousand euros in it to hire a designer and 2 developers to kickstart our online business banking startup. This was the easiest part."}, {"6b55": "We interviewed our friends, and friends of friends, who all agreed current business banking services were really bad and needed a fix."}, {"0a80": "Carried by these feedback and by the confidence we got from our previous exit, we decided to start pitching VCs."}, {"cc40": "Pitching"}, {"b0c7": "To be honest, being second-time entrepreneurs really helped securing meetings with investors. When we pitched for Smokio, they assumed we were straight-A students (being INSEAD MBA graduates, McKinsey and Goldman Sachs alumni) but always questioned our ability to be ‘down-to-earth’ and to execute. In one word, that we were ‘street-smart’ entrepreneurs. This time we had our Smokio experience to prove it, or… one of these pictures."}, {"602a": "Souvenir from Smokio: Steve and I in a factory in Shenzhen"}, {"25db": "Expected ones"}, {"f1be": "Unexpected ones"}, {"8322": "2. Also, as Fintech ventures are very capital intensive, we were very mindful of dilution, and this might have been a deal breaker for several VCs."}, {"11f2": "We were lucky enough to have existing ‘comparables’ we could leverage to negotiate with investors: Atom Bank $230 million valuation or Simple $117 million exit, for instance. We then had to prove that (i) valuations would be equivalent or superior in B2B, (ii) we could adapt these B2C successes to B2B. I think there is no ‘magic tip’ or fancy industry analysis here, and at the end of the day, all founders who plan to launch in a new market will have to convince investors to ‘just’ bet on them."}, {"fe1e": "3. On top of this, I believe founders should not underestimate how draining and stressful this process can be"}, {"48ce": "Steve was really fond of the Miracle Morning routing to help him face this intense period. I just tried to keep my schedule available for (i) running sessions several times a week (I still aim at running my 4th marathon in less than 3 hours!), and, more importantly (ii) quality time with my family. Again, no ‘magic recipe’ here: I think that being a solid two-founder team really helped coping with tough moments. Having a partner with whom you can laugh during hardships makes life easier."}, {"d658": "Doubting"}, {"9ef3": "After 4 weeks of pitching, and 18 meetings, we secured a couple of term-sheets, with several VCs, which proposed pretty much the same financial deal."}, {"a50f": "A lot of people would think, ‘What are you complaining about’, and I would totally get this."}, {"e87f": "However, this is an overview of what was going through our mind when we got the two term-sheets:"}, {"3f31": "Taking the plunge"}, {"6bc9": "Well, I guess you already know what we decided."}, {"eaaf": "We could not think of another career option than building another startup, and truly believed we would disrupt B2B banking."}, {"a324": "Also, picking Valar Ventures and Alven Capital’s offer (option 2) made most sense because:"}, {"21ec": "Building Qonto"}, {"73fb": "Every fundraising must be celebrated as it brings both financial means and experts’ validation ; therefore the self-confidence required to build something from scratch. However, raising funds is just a necessary step towards success, and we could not wait to be 100% back with the team to actually focus on Qonto, meaning, in priority order:"}, {"c20b": "Wrapping up"}, {"96ad": "We did have our set of doubts and insecurities, but since then, we never looked back. Today we have a team of 15+ talented and passionate people, our beta is live, 2,000+ companies signed up to open a Qonto account."}, {"0384": "I think experts like Sequoia Capital or our investor Peter Thiel will be best at giving pitch deck advice (see Appendix). To all founders, I would just say:"}, {"078a": "With love,"}, {"0d26": "Alex."}, {"9066": "PS: We’re looking for talents for these exciting roles!"}, {"ca1d": "Appendix"}, {"d085": "(i) Our pitch deck, if you’d like to have a look. We were called Finpal at the time (but this is another story 😉)."}, {"a3e1": "Finpal Seed Round Pitch Deck"}, {"dbe2": "(ii) Ressources I found useful when building the pitch deck:"}, {"ef0b": "Peter Thiel Pitch Deck Example"}, {"e591": "Sequoia Capital Pitch Deck template"}], "content": "How we convinced Peter Thiel’s fund to invest in Qonto The behind-the-scenes story Qonto got a lot of PR attention 2 months ago as the 1st investment of Valar Ventures (founded by Peter Thiel) in France. This definitely helped us spread the word about Qonto, and contributed to attract our first 2,000+ signups on the Qonto beta waiting list, with literally no marketing cost. I thought it would be worth sharing the behind-the-scenes story. Starting My co-founder Steve and I sold our previous venture (Smokio) to a Fortune 500 company, just after 2 years of existence. As much as I loved this journey, I never really experienced the pain we aimed at solving — help people quit smoking — myself, as I never really smoked. I more or less consciously started seeking another pain point to address that I would personally know. I was the one in charge of all admin and financial tasks at Smokio, and I can’t say enough about how our banking services nearly drove me crazy: outdated tools, poor customer service, and this constant feeling of not knowing what we were paying for. I had been looking for banking alternatives for a while, but all the existing ‘modern’ ones appeared to be (i) geared towards B2C users, (ii) not currently available in France: Simple (US), Nubank (Brazil), for instance. This is how Steve and I, started being more and more intimately convinced something BIG would happen in the small business banking space in Europe. To be totally honest, there was another idea we really liked: ‘disrupting health insurance’… this is how we met Jean-Charles Samuelian. We were really impressed by his drive, experience and grit, and he had already started working on what would become Alan. We just thought this pain point was in good hands already. 😉 So we started drafting wireframes, interviewing experts, registered a new company and invested a couple of hundreds thousand euros in it to hire a designer and 2 developers to kickstart our online business banking startup. This was the easiest part. We interviewed our friends, and friends of friends, who all agreed current business banking services were really bad and needed a fix. Carried by these feedback and by the confidence we got from our previous exit, we decided to start pitching VCs. Pitching To be honest, being second-time entrepreneurs really helped securing meetings with investors. When we pitched for Smokio, they assumed we were straight-A students (being INSEAD MBA graduates, McKinsey and Goldman Sachs alumni) but always questioned our ability to be ‘down-to-earth’ and to execute. In one word, that we were ‘street-smart’ entrepreneurs. This time we had our Smokio experience to prove it, or… one of these pictures. Souvenir from Smokio: Steve and I in a factory in Shenzhen Expected ones Unexpected ones 2. Also, as Fintech ventures are very capital intensive, we were very mindful of dilution, and this might have been a deal breaker for several VCs. We were lucky enough to have existing ‘comparables’ we could leverage to negotiate with investors: Atom Bank $230 million valuation or Simple $117 million exit, for instance. We then had to prove that (i) valuations would be equivalent or superior in B2B, (ii) we could adapt these B2C successes to B2B. I think there is no ‘magic tip’ or fancy industry analysis here, and at the end of the day, all founders who plan to launch in a new market will have to convince investors to ‘just’ bet on them. 3. On top of this, I believe founders should not underestimate how draining and stressful this process can be Steve was really fond of the Miracle Morning routing to help him face this intense period. I just tried to keep my schedule available for (i) running sessions several times a week (I still aim at running my 4th marathon in less than 3 hours!), and, more importantly (ii) quality time with my family. Again, no ‘magic recipe’ here: I think that being a solid two-founder team really helped coping with tough moments. Having a partner with whom you can laugh during hardships makes life easier. Doubting After 4 weeks of pitching, and 18 meetings, we secured a couple of term-sheets, with several VCs, which proposed pretty much the same financial deal. A lot of people would think, ‘What are you complaining about’, and I would totally get this. However, this is an overview of what was going through our mind when we got the two term-sheets: Taking the plunge Well, I guess you already know what we decided. We could not think of another career option than building another startup, and truly believed we would disrupt B2B banking. Also, picking Valar Ventures and Alven Capital’s offer (option 2) made most sense because: Building Qonto Every fundraising must be celebrated as it brings both financial means and experts’ validation ; therefore the self-confidence required to build something from scratch. However, raising funds is just a necessary step towards success, and we could not wait to be 100% back with the team to actually focus on Qonto, meaning, in priority order: Wrapping up We did have our set of doubts and insecurities, but since then, we never looked back. Today we have a team of 15+ talented and passionate people, our beta is live, 2,000+ companies signed up to open a Qonto account. I think experts like Sequoia Capital or our investor Peter Thiel will be best at giving pitch deck advice (see Appendix). To all founders, I would just say: With love, Alex. PS: We’re looking for talents for these exciting roles! Appendix (i) Our pitch deck, if you’d like to have a look. We were called Finpal at the time (but this is another story 😉). Finpal Seed Round Pitch Deck (ii) Ressources I found useful when building the pitch deck: Peter Thiel Pitch Deck Example Sequoia Capital Pitch Deck template ", "child": "2380_12380_12380_1"}