{"name": "2382", "parent": "", "title": "The fear is real. I listen.", "sentences": [{"98d2": "The fear is real. I listen."}, {"9f6c": "“I honestly have no idea what I am doing. I know a big challenge is coming and it is going to take a lot of resources to overcome it. If I don’t solve this problem, in 18 months we are screwed, but today, I can’t spare the resources or make time to focus here. I can’t balance urgent or important when the answer is both and I can’t hit my milestones and maintain my runway because even if I do, it will just lead to stalling in a year when we are not ready for what I know is coming. I just need to solve this structural issue. Maybe I need better people but I am scared I’m shitty at hiring because my last exec hire is drowning and doing everything he can to pull me down with him. Tripling this year doesn’t matter if we are flat after that…I will not be a zombie company, I can’t let that happen. But I don’t feel like I can stop it either as we are set up today. Fighting for air uses up all my energy and I have nothing left to do my job.” said the incredibly successful founder with tons of cash in the bank and a business that is up and to the right on all metrics that matter."}, {"3668": "I acknowledge how hard it is"}, {"c7a0": "I listen"}, {"daa0": "I ask some clarifying questions"}, {"3e60": "I listen"}, {"55f4": "I ask some what if questions"}, {"2036": "I listen"}, {"d3fd": "I ask some stupid questions"}, {"cae0": "I listen"}, {"9681": "I push back on some answers"}, {"6a55": "I listen"}, {"1124": "I repeat back some answers"}, {"36f7": "I listen"}, {"8a90": "I clarify next steps"}, {"2b41": "I listen"}, {"c492": "From the start of the call, I know he will be ok, the company will be fine and he has lots of time and resources to figure this challenge out. I believe this because just like so many moments since he founded the company and we started working together, this is a challenge he can overcome, a puzzle he can solve. He is an amazing CEO with good instincts and tons of grit. But if I just say that, It is dismissive of the crippling emotion. So I don’t say it. Instead, I do my work. I get him talking and I listen. I Listen intently and with everything I’ve got. I listen like my job depends on it because it does."}, {"5b83": "When fear of the unknown bubbles up, recognizing its clammy grip on the throat is important. Diving into details right away doesn’t help because no one can make the unknown known in a quick call — it is something that has to be worked through, felt and kneaded into the soul of an entrepreneur by experience. There is a kinesthetic sense of what’s next and times where a founder goes numb — this is when fear starts to squeeze the neck and breath gets short. It paralyzes the brain like waking up from a nap and finding your arm is asleep, a dead appendage hanging at the shoulder."}, {"7a3b": "If someone will just listen, slowly the pins and needles start. Questions can massage the blood flow back to normal and the act of reaching for the answers will remind you that you know more than you think, that you are in fact capable of solving these problems and overcoming these challenges."}, {"4e55": "Confidence returns. Fog burns off. Fear loses its grip and recedes back into its hole for the moment. You can access your best and bring it to the table."}, {"b366": "You are back in a position to win, at least for today."}], "content": "The fear is real. I listen. “I honestly have no idea what I am doing. I know a big challenge is coming and it is going to take a lot of resources to overcome it. If I don’t solve this problem, in 18 months we are screwed, but today, I can’t spare the resources or make time to focus here. I can’t balance urgent or important when the answer is both and I can’t hit my milestones and maintain my runway because even if I do, it will just lead to stalling in a year when we are not ready for what I know is coming. I just need to solve this structural issue. Maybe I need better people but I am scared I’m shitty at hiring because my last exec hire is drowning and doing everything he can to pull me down with him. Tripling this year doesn’t matter if we are flat after that…I will not be a zombie company, I can’t let that happen. But I don’t feel like I can stop it either as we are set up today. Fighting for air uses up all my energy and I have nothing left to do my job.” said the incredibly successful founder with tons of cash in the bank and a business that is up and to the right on all metrics that matter. I acknowledge how hard it is I listen I ask some clarifying questions I listen I ask some what if questions I listen I ask some stupid questions I listen I push back on some answers I listen I repeat back some answers I listen I clarify next steps I listen From the start of the call, I know he will be ok, the company will be fine and he has lots of time and resources to figure this challenge out. I believe this because just like so many moments since he founded the company and we started working together, this is a challenge he can overcome, a puzzle he can solve. He is an amazing CEO with good instincts and tons of grit. But if I just say that, It is dismissive of the crippling emotion. So I don’t say it. Instead, I do my work. I get him talking and I listen. I Listen intently and with everything I’ve got. I listen like my job depends on it because it does. When fear of the unknown bubbles up, recognizing its clammy grip on the throat is important. Diving into details right away doesn’t help because no one can make the unknown known in a quick call — it is something that has to be worked through, felt and kneaded into the soul of an entrepreneur by experience. There is a kinesthetic sense of what’s next and times where a founder goes numb — this is when fear starts to squeeze the neck and breath gets short. It paralyzes the brain like waking up from a nap and finding your arm is asleep, a dead appendage hanging at the shoulder. If someone will just listen, slowly the pins and needles start. Questions can massage the blood flow back to normal and the act of reaching for the answers will remind you that you know more than you think, that you are in fact capable of solving these problems and overcoming these challenges. Confidence returns. Fog burns off. Fear loses its grip and recedes back into its hole for the moment. You can access your best and bring it to the table. You are back in a position to win, at least for today. ", "child": "2382_1\t2382_2\t2382_3\t2382_4"}