{"name": "2396", "parent": "", "title": "How Do I Feel About the Snap IPO Given I Didn’t Invest?", "sentences": [{"0704": "How Do I Feel About the Snap IPO Given I Didn’t Invest?"}, {"0106": "Every tech or major news journal in the country is preparing to write their Snap, Inc (creators of Snapchat, Spectacles, etc) stories and many of them seem to want a “How does it feel to have missed this investment story.”"}, {"3587": "I won’t speak to most of them due to time and also due to the fact that I simply am not the story and don’t want to pretend like I am. The story is Evan Spiegel and Bobby Murphy and the amazing team that supports them. The story are the early investors who had foresight to back them — Lightspeed, Benchmark, IVP, SV Angel, General Catalyst, etc. We simply aren’t part of the story and shouldn’t pretend to be."}, {"3f38": "I did speak to the LA Times for a story that appeared yesterday both because I like and trusted the journalist, Paresh Dave, to do a fair story and also because we always try to support our hometown paper The LA Times."}, {"8ced": "And since it’s out there I’ll just tell my quick views on Snap and then try to get out of the way."}, {"21ed": "We did know about Snapchat as early as anybody. My colleague at the time James Bailey was bugging me to take a meeting when it was an unknown company because he had younger family members and friends obsessed with Snapchat who were in university at the time. I never even took a meeting so to say you “passed” would be a misrepresentation and make it sound like you took a meeting and looked down on this project and said “meh.” I didn’t do that."}, {"deb0": "What happened was I had just seen (maybe 6 months before) a project called TigerText. It was a “disappearing text app” where the founders told me that they named the company because the idea came from how Tiger Woods got caught cheating on his wife because all of his mistresses had evidence that he cheated because they saved text messages from him. What if text messages disappeared? To be fair to TigerText they build a company focused on the healthcare industry and HIPAA compliance. But that narrative was fresh in my head when I first had the discussion about Snapchat."}, {"ea59": "I hugely respect James Bailey’s instincts (I still do) and he pushed other deals that we did complete. So we had the discussion and I told James, “Isn’t Snapchat just a photo-based TigerText?” I had a narrative in my head that I didn’t want to fund apps that would help husbands cheat on their wives or help kids send naked photos. Of course that was a wrong narrative for both companies."}, {"a523": "What I *SHOULD HAVE* considered was that I was in college in a time when there were no digital cameras and I’m very thankful for that or I likely wouldn’t be writing this blog post today. Mostly kidding. But of course we all need the space to be young, to experiment, to do stupid things and not to have it define our entire future. Evan Spiegel and Bobby Murphy were fresh out of college in this generation as was James Bailey who was slightly older but not much. I simply couldn’t see it. I should have. But I didn’t even have a meeting so it’s not like I passed. I hear tons of ideas for early-stage apps."}, {"5d2e": "What I did see were several companies doing similar things and many taking off. I saw one that we considered strongly and then declined due to the nature of sharing obscene photos on their app and our worry that the company might struggle to contain that. Another firm funded them. 6 months later the company was in the press because predators had used the app to rape and molest three children under the age of 15. These experiences make you cautious. I don’t blame this company but honestly it just does make you cautious."}, {"e5b8": "So Jeremy Liew at Lightspeed wrote the first $500,000. I don’t feel badly about that — Jeremy is smart, successful and a friend and there’s no reason to sit around and be jealous about his success — I’m genuinely happy for him."}, {"d814": "Benchmark deserves the biggest credit for writing a $12 million check at what then seemed a healthy price to get into Snapchat. By then we knew that Snapchat was on fire but we knew the price would be too high relative to our fund size and frankly Snapchat was so successful at that point we knew it was also more likely that they would choose a Bay Area firm. $12m on a $60m for an early-stage business is a not a bet that most LA firms could or would take. I don’t feel badly about that — there are hundreds of other bets like that which don’t pay off."}, {"f28d": "My job as a VC isn’t to beat myself up or any other partner up for the one deal we didn’t do. My job is simply to make sure we’re getting into a few industry defining investments per fund and to make sure we capture enough successes. If you swing at every pitch you’ll end up with a lot more losers."}, {"14f2": "Mostly I wanted the journalist to know:"}, {"a724": "Any other angle is just sour grapes. And we will be cheering on our fellow Angelinos over the coming year, not taking snipe swipes at them. Snapchat truly built an amazing product and an amazing community and anybody who knows me knows that I’m very active on it."}, {"ce32": "If you really want to know how I feel about Snapchat then you need to check out www.snapstorms.com where I post short advice videos that I previously recorded on Snapchat. I love this product & the community I’ve formed there."}], "content": "How Do I Feel About the Snap IPO Given I Didn’t Invest? Every tech or major news journal in the country is preparing to write their Snap, Inc (creators of Snapchat, Spectacles, etc) stories and many of them seem to want a “How does it feel to have missed this investment story.” I won’t speak to most of them due to time and also due to the fact that I simply am not the story and don’t want to pretend like I am. The story is Evan Spiegel and Bobby Murphy and the amazing team that supports them. The story are the early investors who had foresight to back them — Lightspeed, Benchmark, IVP, SV Angel, General Catalyst, etc. We simply aren’t part of the story and shouldn’t pretend to be. I did speak to the LA Times for a story that appeared yesterday both because I like and trusted the journalist, Paresh Dave, to do a fair story and also because we always try to support our hometown paper The LA Times. And since it’s out there I’ll just tell my quick views on Snap and then try to get out of the way. We did know about Snapchat as early as anybody. My colleague at the time James Bailey was bugging me to take a meeting when it was an unknown company because he had younger family members and friends obsessed with Snapchat who were in university at the time. I never even took a meeting so to say you “passed” would be a misrepresentation and make it sound like you took a meeting and looked down on this project and said “meh.” I didn’t do that. What happened was I had just seen (maybe 6 months before) a project called TigerText. It was a “disappearing text app” where the founders told me that they named the company because the idea came from how Tiger Woods got caught cheating on his wife because all of his mistresses had evidence that he cheated because they saved text messages from him. What if text messages disappeared? To be fair to TigerText they build a company focused on the healthcare industry and HIPAA compliance. But that narrative was fresh in my head when I first had the discussion about Snapchat. I hugely respect James Bailey’s instincts (I still do) and he pushed other deals that we did complete. So we had the discussion and I told James, “Isn’t Snapchat just a photo-based TigerText?” I had a narrative in my head that I didn’t want to fund apps that would help husbands cheat on their wives or help kids send naked photos. Of course that was a wrong narrative for both companies. What I *SHOULD HAVE* considered was that I was in college in a time when there were no digital cameras and I’m very thankful for that or I likely wouldn’t be writing this blog post today. Mostly kidding. But of course we all need the space to be young, to experiment, to do stupid things and not to have it define our entire future. Evan Spiegel and Bobby Murphy were fresh out of college in this generation as was James Bailey who was slightly older but not much. I simply couldn’t see it. I should have. But I didn’t even have a meeting so it’s not like I passed. I hear tons of ideas for early-stage apps. What I did see were several companies doing similar things and many taking off. I saw one that we considered strongly and then declined due to the nature of sharing obscene photos on their app and our worry that the company might struggle to contain that. Another firm funded them. 6 months later the company was in the press because predators had used the app to rape and molest three children under the age of 15. These experiences make you cautious. I don’t blame this company but honestly it just does make you cautious. So Jeremy Liew at Lightspeed wrote the first $500,000. I don’t feel badly about that — Jeremy is smart, successful and a friend and there’s no reason to sit around and be jealous about his success — I’m genuinely happy for him. Benchmark deserves the biggest credit for writing a $12 million check at what then seemed a healthy price to get into Snapchat. By then we knew that Snapchat was on fire but we knew the price would be too high relative to our fund size and frankly Snapchat was so successful at that point we knew it was also more likely that they would choose a Bay Area firm. $12m on a $60m for an early-stage business is a not a bet that most LA firms could or would take. I don’t feel badly about that — there are hundreds of other bets like that which don’t pay off. My job as a VC isn’t to beat myself up or any other partner up for the one deal we didn’t do. My job is simply to make sure we’re getting into a few industry defining investments per fund and to make sure we capture enough successes. If you swing at every pitch you’ll end up with a lot more losers. Mostly I wanted the journalist to know: Any other angle is just sour grapes. And we will be cheering on our fellow Angelinos over the coming year, not taking snipe swipes at them. Snapchat truly built an amazing product and an amazing community and anybody who knows me knows that I’m very active on it. If you really want to know how I feel about Snapchat then you need to check out www.snapstorms.com where I post short advice videos that I previously recorded on Snapchat. I love this product & the community I’ve formed there. ", "child": "2396_1\t2396_2\t2396_3\t2396_4\t2396_5\t2396_6\t2396_7\t2396_8\t2396_9"}