{"name": "2397", "parent": "", "title": "Understanding What’s Going on in #LATech", "sentences": [{"f6af": "Understanding What’s Going on in #LATech"}, {"6a67": "Upfront Ventures was created 20 years ago as one of the original VC funds in Los Angeles. Back then only 15% of our dollars were invested locally whereas today 50% of our dollars are invested in LA. 10 years ago we found ourselves trying to persuade LPs and VCs that it was worth spending more time getting to know the LA market and now the most common refrain that I hear from them is “there really is something going on in LA.”"}, {"8829": "Don’t we know it."}, {"631d": "It’s not just Snapchat, although there’s that. Not just Tinder, Dollar Shave Club, Riot Games, CornerStone OnDemand and the companies you’ve heard of but there are large successes that are less well known but now very large startups businesses like Ring, Zip Recruiter, GumGum, Laurel & Wolf and too many other great companies to mention."}, {"e0bd": "And I constantly have to remind people that the largest tech startup employer in LA is actually SpaceX and that, yes, Elon Musk does live in LA. See we have JPL that designed the rockets that put men on the moon in the first place and Caltech, one of the two most prestigious engineering universities in the country."}, {"5c1b": "We put together this really short, music video (less than 2 minutes)that gives you a great aerial view of the LA Tech ecosystem (plus a great aerial shot of Upfront Ventures HQ if you are interested) all shot with our portfolio company DroneBase."}, {"468a": "In addition to all the great companies being created here another often overlooked feature of Los Angeles is just how many great VC funds have been formed here in the past decade. I wrote this overview of the LA Tech Ecosystem in December and on page 15 you’ll see a host of amazing VC firms at all stages from pre-seed through to early-B rounds."}, {"2fa3": "Today we learned that another great fund was announced — Fika Ventures. I hope you’ll take a minute to read about Fika Ventures but by quick background it is a $40 million LA-based seed fund founded by three of our favorite local investors: Tianxiang Zhuo, Eva Ho & arteen arabshahi. Candidly all three were on our short list of VCs that we secretly wanted to poach (seriously, they were!) for future Upfront Ventures growth :) but when we heard a year ago that they were joining forces we were super happy for them and for LA."}, {"5781": "See in the end, in LA VC firms are far more collaborative than competitive. Of course we compete from time-to-time but you’re way more likely to find us binding together to build a great tech ecosystem than fighting or bad-mouthing each other."}, {"8f85": "We love LA!"}], "content": "Understanding What’s Going on in #LATech Upfront Ventures was created 20 years ago as one of the original VC funds in Los Angeles. Back then only 15% of our dollars were invested locally whereas today 50% of our dollars are invested in LA. 10 years ago we found ourselves trying to persuade LPs and VCs that it was worth spending more time getting to know the LA market and now the most common refrain that I hear from them is “there really is something going on in LA.” Don’t we know it. It’s not just Snapchat, although there’s that. Not just Tinder, Dollar Shave Club, Riot Games, CornerStone OnDemand and the companies you’ve heard of but there are large successes that are less well known but now very large startups businesses like Ring, Zip Recruiter, GumGum, Laurel & Wolf and too many other great companies to mention. And I constantly have to remind people that the largest tech startup employer in LA is actually SpaceX and that, yes, Elon Musk does live in LA. See we have JPL that designed the rockets that put men on the moon in the first place and Caltech, one of the two most prestigious engineering universities in the country. We put together this really short, music video (less than 2 minutes)that gives you a great aerial view of the LA Tech ecosystem (plus a great aerial shot of Upfront Ventures HQ if you are interested) all shot with our portfolio company DroneBase. In addition to all the great companies being created here another often overlooked feature of Los Angeles is just how many great VC funds have been formed here in the past decade. I wrote this overview of the LA Tech Ecosystem in December and on page 15 you’ll see a host of amazing VC firms at all stages from pre-seed through to early-B rounds. Today we learned that another great fund was announced — Fika Ventures. I hope you’ll take a minute to read about Fika Ventures but by quick background it is a $40 million LA-based seed fund founded by three of our favorite local investors: Tianxiang Zhuo, Eva Ho & arteen arabshahi. Candidly all three were on our short list of VCs that we secretly wanted to poach (seriously, they were!) for future Upfront Ventures growth :) but when we heard a year ago that they were joining forces we were super happy for them and for LA. See in the end, in LA VC firms are far more collaborative than competitive. Of course we compete from time-to-time but you’re way more likely to find us binding together to build a great tech ecosystem than fighting or bad-mouthing each other. We love LA! ", "child": "2397_1\t2397_2\t2397_3\t2397_4\t2397_5\t2397_6\t2397_7\t2397_8\t2397_9\t2397_10\t2397_11\t2397_12\t2397_13\t2397_14"}