{"name": "2407", "parent": "", "title": "The Coming Shift in Enterprise Software", "sentences": [{"e897": "The Coming Shift in Enterprise Software"}, {"0c47": "Today it has been announced that I’m leading a $15 million funding round in Tact, a new generation of Enterprise Software company along with other investors including Microsoft Ventures and previous investors Accel and Redpoint"}, {"72eb": "Rather than just waxing lyrically about how great the company is I thought I’d provide some context about why I invested and also about a fundamental change I see in the coming years in the way enterprise software is used."}, {"7898": "Why Invest? (Part I, Team)"}, {"1004": "Tact was founded by Chuck Ganapathi, who was formerly the SVP of Products at Salesforce.com having led initiatives like their chat product, CRM and mobile. For six years before that he was at Siebel who was the market leader in CRM before Salesforce, and he has both a masters in product design from Stanford and an MBA. But more importantly I worked with Chuck 10 years ago when I was at Salesforce.com and have kept a relationship over the past decade."}, {"d026": "Put simply Chuck is amongst the smartest and most knowledgeable leaders in the CRM industry and in the components I consider the future of enterprise software — voice driving input/output, chat-based computing and mobile-first design."}, {"87a6": "And while my relationship with Chuck was critical to my investment, so too was the leadership of Trevor Templar, the Chief Revenue Officer. He spent nearly five years at each of Salesforce.com and Oracle and was an Area VP at Salesforce leading sales efforts at some of the largest clients that Salesforce.com has. In all my time investing I have never seen such a senior revenue officer join a company at this stage. In my referencing with very senior executives at both Salesforce & Oracle people called Trevor “the smartest sales executive I’ve ever worked with — he literally rewrote the rules of how we worked here.”"}, {"5e92": "It was a high bar but even then I must admit that my experience in working with Trevor has exceeded these expectations. To watch a young company win 1,000+ seat deals at Global 100 companies at this stage of development has been simply stunning."}, {"bc87": "I am often quoted as saying “70% of my investment decision is the people and 30% is the market” and there is a reason. The most common theme of being a startup in today’s world is that the computing environment and platforms change so rapidly that only the best equipped teams survive the transitions (think Facebook’s shift to mobile or Snapchat’s embrace of augmented reality)."}, {"d8bb": "The other reason for great teams is that the biggest competitors in the tech industry are so adept at changing to market conditions that even substantial innovations by startups can be usurped by the nimblest of big tech competitors."}, {"2d5c": "So riffing off the famous Andy Grove statement that “only the paranoid survive” and believing that “only the most exceptionally talented startup teams survive” — most get washed out by the constant cycle of change and competition."}, {"5650": "Why Invest? (Part II, Market)"}, {"6834": "The Enterprise Software market feels ripe for a massive shift and Tact has made big innovations at the forefront of the most important changes. Consumer product companies have to be “user centric” to survive and yet most enterprise software companies fall short on this front."}, {"c7f1": "The reason is simple. If you’re a consumer software company your buyer is your user. If you’re an enterprise software company often the buyer isn’t the user and the buyer has a checklist of features they want and often performs a feature bake-off without knowing what will really drive usage or benefits to the end-users."}, {"11d3": "Tact stated with a user-centric approach from Day 1. Here’s how they did it …"}, {"a8cf": "Mobile First — It is now well understood that “mobile first” dominated the consumer Internet and we take this for granted. Facebook was largely a web-based company and none of its revenues were generated on mobile, where many analysts were predicting it would be too hard to replicate the revenue potential of the larger real estate on desktop computers. Boy, were these analysts wrong."}, {"1aab": "The key to Facebook’s success has been building an app that is completely embedded in the way we use our mobile devices and almost invisible to the end-user, which is what makes it so powerful. The fact that when you upload photos to your camera roll Facebook knows, when you’re in a specific location Facebook knows, when you upload a photo to share Facebook has image recognition, Facebook knows not only your friend graph but whom you share with the most. The best designed mobile apps use the accelerometer, the camera, map integration, location, contact book integration, QR codes and so on."}, {"1ac1": "Think about Snapchat. As users are typing messages to you, a popup notification appears as they’re typing — it’s kind of magical. They have taken advantage of augmented reality, voice-changing, image-based communications, private messaging and so forth."}, {"9185": "Uber has built its entire service around the map metaphor and real-time knowledge of driver locations. It has built a single-click app that assumes I want to be picked up where I am now and lists the most likely location that I will want to go based on past history. It is a single-click experience that exceeds nearly every other mobile app in its seamlessness."}, {"50f6": "Swarm App now uses location in the background to gather large volumes of data about month-over-month retail visits so this 3rd-party data is invaluable and other than a little battery juice is frictionless to the user. They make it seamless to check into a venue but also help you figure out when you have friends nearby."}, {"fc89": "The point is that in the past five years we have taken for granted how great the best consumer Internet companies have gotten in mobile-first computing and in incorporating the full value of the mobile experience in order to drive up daily user adoption. Companies that didn’t properly embrace mobile have largely faded."}, {"87b2": "By this standard Enterprise Software companies are largely in the caveman era. Most large enterprise companies were either built in the pre-Internet era or rose on the prominence of Internet 1.0, making the experience “as easy as buying a book on Amazon.”"}, {"297b": "This is the area where Tact has crushed it. When I did my customer reference calls with some of the largest corporate buyers in the country who have adopted Tact I heard the same narrative repeatedly"}, {"82db": "“We use CRM tools but our mobile workforce always struggled with adoption. Maybe 25% of the users would log in weekly. Often they waited until they were in the office but then the value of the information we got was limited. With Tact we have been able to drive weekly usage about 75% because they are using it regularly on their mobile devices.”"}, {"9cac": "I am not over-selling. The heads of sales operations were emphatic in ways I have seldom experienced. Tact had mastered the art of data replication, map integration, calendar integration & notification prompts, camera i/o (for business cards), voice-based inputs, SMS-like inputs and so forth. Tact rose by building a mobile-first enterprise software company — but then they took it to the next level."}, {"8fea": "Voice I/O — I have been saying for years to anybody who would listen that keyboards and mice have a limited shelf life because they don’t work how humans work. In the era of Siri, Alexa and Cortana this is starting to become obvious yet we are still just in the nascency of how this gets rolled out in consumer and enterprise applications."}, {"eec2": "Chuck as a software visionary understood this. V1 of Tact has been a mobile-first CRM (which by the way will soon exceed a $50 billion market, making it the largest category for enterprise applications) but the team was very early in embracing enterprise applications for voice i/o (input, output). This is critical when you’re working with mobile workforces both because they’re often in the car but they’re also in coffee shops and airport lounges where capturing or receiving information is critical but pulling out one’s laptop is often impractical (or even tapping a mobile phone can be a huge safety hazard). Tact has now won several awards for its Amazon Echo integration and use cases."}, {"10c9": "Chat-based Communications. Another area that gets much press coverage but hasn’t yet permeated the enterprise world is chat-based communications and the one company who has truly owned this space and frankly had the largest impact on enterprise computing in this area is Slack. The trailblazer in the category of course was Twitter and David Sacks quickly spotted the use case for enterprise and launched Yammer, which was purchased by Microsoft for more than $1 billion. Around that time Salesforce launched “Chatter,” which was led by Chuck — so it’s a space he knows well."}, {"16d1": "We believe that chat-based communications will be another i/o for all enterprise applications. The idea that your i/o must be a computer log-in screen or even a mobile app is antiquated in a world in which we increasingly like to message either 1–1 or in groups. Tact is a pioneer in using chat-based communications as a computing metaphor."}, {"be6d": "AI / Bots — Neither voice nor chat-based communications would truly work as seamlessly without a level of artificial intelligence that powers the communications."}, {"6edd": "For example, on voice you can either stick to a defined set of commands for asking questions and thus the users must have heavy training, or you can learn from past queries and intelligently adapt the system to look up information and deliver results. You might want to ask, “What is the Q3 sales forecast for the central region?” or “Who is the budget holder on our Dupont sales campaign?” or “Please list all of my teammates who have had communications with Verizon in the past 90 days.”"}, {"5e67": "On chat — the key for enterprise is getting teams of people to collaborate and to do so you can’t rely on everybody logging into a system. You need to pull them in on their mobile devices with notifications if you want timely responses. But the chat needs a “bot” that can offer intelligent support. So a text query that says, “What is Karthick Sharma’s title” or “How much did we close with Verizon last year?” can receive instant, accurate response without requiring human intervention — critical for teams in the field."}, {"9b3a": "Voice and chat are both very powerful computing metaphors but only if the underlying technologies and interactions become as seamless as mobile integrations have become in the consumer worlds. This is why we believe that AI will be a critical part of the future of enterprise computing."}, {"d110": "Summary"}, {"0041": "I’m thrilled to be able to work with my old friend Chuck Ganapathi as well as Trevor Templar and the whole team at Tact. As leaders they have been truly inspiring and I believe a benchmark for the industry."}, {"3c6f": "I have enjoyed having a third deal between Upfront & Accel (along with Osmo and Invoca) and strengthening that relationship. The lead partner is Kevin Efrusy who amongst other things helped source Facebook for Accel."}, {"cb6e": "I also have really enjoyed working with Satish Dharmaraj at Redpoint who like me was an enterprise software CEO (he was the founder & CEO of Zimbra — so he’s a perfect board partner for Tact)."}, {"ad62": "I would be remiss if I didn’t point out that our other investor is Subrah Iyer, the founder of WebEx. To say that the board, investor base and management team of Tact is stacked would be an understatement."}, {"7c47": "And of course we welcome Microsoft Ventures. It’s great to see Microsoft understand the importance of venture capital under the leadership of Satya Nadella and at Tact working with Rashmi Gopinath."}], "content": "The Coming Shift in Enterprise Software Today it has been announced that I’m leading a $15 million funding round in Tact, a new generation of Enterprise Software company along with other investors including Microsoft Ventures and previous investors Accel and Redpoint Rather than just waxing lyrically about how great the company is I thought I’d provide some context about why I invested and also about a fundamental change I see in the coming years in the way enterprise software is used. Why Invest? (Part I, Team) Tact was founded by Chuck Ganapathi, who was formerly the SVP of Products at Salesforce.com having led initiatives like their chat product, CRM and mobile. For six years before that he was at Siebel who was the market leader in CRM before Salesforce, and he has both a masters in product design from Stanford and an MBA. But more importantly I worked with Chuck 10 years ago when I was at Salesforce.com and have kept a relationship over the past decade. Put simply Chuck is amongst the smartest and most knowledgeable leaders in the CRM industry and in the components I consider the future of enterprise software — voice driving input/output, chat-based computing and mobile-first design. And while my relationship with Chuck was critical to my investment, so too was the leadership of Trevor Templar, the Chief Revenue Officer. He spent nearly five years at each of Salesforce.com and Oracle and was an Area VP at Salesforce leading sales efforts at some of the largest clients that Salesforce.com has. In all my time investing I have never seen such a senior revenue officer join a company at this stage. In my referencing with very senior executives at both Salesforce & Oracle people called Trevor “the smartest sales executive I’ve ever worked with — he literally rewrote the rules of how we worked here.” It was a high bar but even then I must admit that my experience in working with Trevor has exceeded these expectations. To watch a young company win 1,000+ seat deals at Global 100 companies at this stage of development has been simply stunning. I am often quoted as saying “70% of my investment decision is the people and 30% is the market” and there is a reason. The most common theme of being a startup in today’s world is that the computing environment and platforms change so rapidly that only the best equipped teams survive the transitions (think Facebook’s shift to mobile or Snapchat’s embrace of augmented reality). The other reason for great teams is that the biggest competitors in the tech industry are so adept at changing to market conditions that even substantial innovations by startups can be usurped by the nimblest of big tech competitors. So riffing off the famous Andy Grove statement that “only the paranoid survive” and believing that “only the most exceptionally talented startup teams survive” — most get washed out by the constant cycle of change and competition. Why Invest? (Part II, Market) The Enterprise Software market feels ripe for a massive shift and Tact has made big innovations at the forefront of the most important changes. Consumer product companies have to be “user centric” to survive and yet most enterprise software companies fall short on this front. The reason is simple. If you’re a consumer software company your buyer is your user. If you’re an enterprise software company often the buyer isn’t the user and the buyer has a checklist of features they want and often performs a feature bake-off without knowing what will really drive usage or benefits to the end-users. Tact stated with a user-centric approach from Day 1. Here’s how they did it … Mobile First — It is now well understood that “mobile first” dominated the consumer Internet and we take this for granted. Facebook was largely a web-based company and none of its revenues were generated on mobile, where many analysts were predicting it would be too hard to replicate the revenue potential of the larger real estate on desktop computers. Boy, were these analysts wrong. The key to Facebook’s success has been building an app that is completely embedded in the way we use our mobile devices and almost invisible to the end-user, which is what makes it so powerful. The fact that when you upload photos to your camera roll Facebook knows, when you’re in a specific location Facebook knows, when you upload a photo to share Facebook has image recognition, Facebook knows not only your friend graph but whom you share with the most. The best designed mobile apps use the accelerometer, the camera, map integration, location, contact book integration, QR codes and so on. Think about Snapchat. As users are typing messages to you, a popup notification appears as they’re typing — it’s kind of magical. They have taken advantage of augmented reality, voice-changing, image-based communications, private messaging and so forth. Uber has built its entire service around the map metaphor and real-time knowledge of driver locations. It has built a single-click app that assumes I want to be picked up where I am now and lists the most likely location that I will want to go based on past history. It is a single-click experience that exceeds nearly every other mobile app in its seamlessness. Swarm App now uses location in the background to gather large volumes of data about month-over-month retail visits so this 3rd-party data is invaluable and other than a little battery juice is frictionless to the user. They make it seamless to check into a venue but also help you figure out when you have friends nearby. The point is that in the past five years we have taken for granted how great the best consumer Internet companies have gotten in mobile-first computing and in incorporating the full value of the mobile experience in order to drive up daily user adoption. Companies that didn’t properly embrace mobile have largely faded. By this standard Enterprise Software companies are largely in the caveman era. Most large enterprise companies were either built in the pre-Internet era or rose on the prominence of Internet 1.0, making the experience “as easy as buying a book on Amazon.” This is the area where Tact has crushed it. When I did my customer reference calls with some of the largest corporate buyers in the country who have adopted Tact I heard the same narrative repeatedly “We use CRM tools but our mobile workforce always struggled with adoption. Maybe 25% of the users would log in weekly. Often they waited until they were in the office but then the value of the information we got was limited. With Tact we have been able to drive weekly usage about 75% because they are using it regularly on their mobile devices.” I am not over-selling. The heads of sales operations were emphatic in ways I have seldom experienced. Tact had mastered the art of data replication, map integration, calendar integration & notification prompts, camera i/o (for business cards), voice-based inputs, SMS-like inputs and so forth. Tact rose by building a mobile-first enterprise software company — but then they took it to the next level. Voice I/O — I have been saying for years to anybody who would listen that keyboards and mice have a limited shelf life because they don’t work how humans work. In the era of Siri, Alexa and Cortana this is starting to become obvious yet we are still just in the nascency of how this gets rolled out in consumer and enterprise applications. Chuck as a software visionary understood this. V1 of Tact has been a mobile-first CRM (which by the way will soon exceed a $50 billion market, making it the largest category for enterprise applications) but the team was very early in embracing enterprise applications for voice i/o (input, output). This is critical when you’re working with mobile workforces both because they’re often in the car but they’re also in coffee shops and airport lounges where capturing or receiving information is critical but pulling out one’s laptop is often impractical (or even tapping a mobile phone can be a huge safety hazard). Tact has now won several awards for its Amazon Echo integration and use cases. Chat-based Communications. Another area that gets much press coverage but hasn’t yet permeated the enterprise world is chat-based communications and the one company who has truly owned this space and frankly had the largest impact on enterprise computing in this area is Slack. The trailblazer in the category of course was Twitter and David Sacks quickly spotted the use case for enterprise and launched Yammer, which was purchased by Microsoft for more than $1 billion. Around that time Salesforce launched “Chatter,” which was led by Chuck — so it’s a space he knows well. We believe that chat-based communications will be another i/o for all enterprise applications. The idea that your i/o must be a computer log-in screen or even a mobile app is antiquated in a world in which we increasingly like to message either 1–1 or in groups. Tact is a pioneer in using chat-based communications as a computing metaphor. AI / Bots — Neither voice nor chat-based communications would truly work as seamlessly without a level of artificial intelligence that powers the communications. For example, on voice you can either stick to a defined set of commands for asking questions and thus the users must have heavy training, or you can learn from past queries and intelligently adapt the system to look up information and deliver results. You might want to ask, “What is the Q3 sales forecast for the central region?” or “Who is the budget holder on our Dupont sales campaign?” or “Please list all of my teammates who have had communications with Verizon in the past 90 days.” On chat — the key for enterprise is getting teams of people to collaborate and to do so you can’t rely on everybody logging into a system. You need to pull them in on their mobile devices with notifications if you want timely responses. But the chat needs a “bot” that can offer intelligent support. So a text query that says, “What is Karthick Sharma’s title” or “How much did we close with Verizon last year?” can receive instant, accurate response without requiring human intervention — critical for teams in the field. Voice and chat are both very powerful computing metaphors but only if the underlying technologies and interactions become as seamless as mobile integrations have become in the consumer worlds. This is why we believe that AI will be a critical part of the future of enterprise computing. Summary I’m thrilled to be able to work with my old friend Chuck Ganapathi as well as Trevor Templar and the whole team at Tact. As leaders they have been truly inspiring and I believe a benchmark for the industry. I have enjoyed having a third deal between Upfront & Accel (along with Osmo and Invoca) and strengthening that relationship. The lead partner is Kevin Efrusy who amongst other things helped source Facebook for Accel. I also have really enjoyed working with Satish Dharmaraj at Redpoint who like me was an enterprise software CEO (he was the founder & CEO of Zimbra — so he’s a perfect board partner for Tact). I would be remiss if I didn’t point out that our other investor is Subrah Iyer, the founder of WebEx. To say that the board, investor base and management team of Tact is stacked would be an understatement. And of course we welcome Microsoft Ventures. It’s great to see Microsoft understand the importance of venture capital under the leadership of Satya Nadella and at Tact working with Rashmi Gopinath. ", "child": "2407_1\t2407_2\t2407_3\t2407_4\t2407_5\t2407_6\t2407_7\t2407_8\t2407_9\t2407_10\t2407_11\t2407_12\t2407_13\t2407_14\t2407_15"}