{"name": "2411", "parent": "", "title": "Why You Should Put Yourself Out There and Try New Products", "sentences": [{"4f64": "Why You Should Put Yourself Out There and Try New Products"}, {"4059": "In 2006 I started using Facebook and most of my friends & colleagues thought I was strange. They thought it was like MySpace and why did I need a MySpace page?"}, {"2f3e": "In 2007 I started using Twitter and most of my friends & colleagues wondered why people would care what I ate for lunch."}, {"3a26": "In 2008 I started VC blogging. I had blogged when I was an entrepreneur. I went to an industry event where people actually called me self-centered for writing publicly. Ironic to be self-centered while you’re trying to offer advice to others."}, {"6d53": "In 2011 I started using Instagram. To this day I mostly just find it a fun escape to post pictures of life and to follow the lives of my friends. It was a break from information overload of Facebook. My friends said, “I don’t need another network. I already have Facebook.”"}, {"bba9": "In 2015 I opened up my Facebook page to the public. Before that I had used it only with tight-knit friends and family. That’s what happens when you join a network and have kids. But the engagement of FB is way too large to ignore and engagement through FB has been phenomenal."}, {"f6b0": "In 2016 I finally cracked SnapChat with the launch of Discovery. I started doing SnapStorms, which are short burst of video around a certain startup or financing topic. I also did a few SnapAMAs where I let people ask any question and I responded to 100% of them. I love it. Right now the volume is manageable during an AMA. It’s hard to be discovered on SnapChat right now so I occasionally tweet my SnapChat add handle: https://www.snapchat.com/add/msuster"}, {"99ae": "Sure, I’d rather not have to ask but that’s when happens when discovery is hard."}, {"e0a2": "So this dude on Twitter says that I’m “trying to hard” because I’m using SnapChat in a new way. By now I’m used to the haters."}, {"fbe3": "Here’s the thing:"}, {"bb7a": "But honestly it just proves to me that haters are gonna hate. People can’t resist being negative. Some people draw satisfaction by pointing at you and saying, “See! Look how stupid that guy is!” I can’t imagine being that miserable person. I’d much rather be the fool always trying new stuff. And honestly I love technology products and if you don’t try the newest stuff you’ll wake up an old person emailing from your Hotmail account with links to MapQuest over your dial-up AOL plan."}, {"0208": "For the rest of us — onward and upward. Stay young. Even when you’re gray."}, {"fc95": "And I Tweeted this post and David Tirazona’s response was precious"}, {"8d02": "It’s called getting youthenized! https://t.co/D7elVkC4XR"}, {"685a": "— David Tirazona (@TirazonaD) March 7, 2016"}], "content": "Why You Should Put Yourself Out There and Try New Products In 2006 I started using Facebook and most of my friends & colleagues thought I was strange. They thought it was like MySpace and why did I need a MySpace page? In 2007 I started using Twitter and most of my friends & colleagues wondered why people would care what I ate for lunch. In 2008 I started VC blogging. I had blogged when I was an entrepreneur. I went to an industry event where people actually called me self-centered for writing publicly. Ironic to be self-centered while you’re trying to offer advice to others. In 2011 I started using Instagram. To this day I mostly just find it a fun escape to post pictures of life and to follow the lives of my friends. It was a break from information overload of Facebook. My friends said, “I don’t need another network. I already have Facebook.” In 2015 I opened up my Facebook page to the public. Before that I had used it only with tight-knit friends and family. That’s what happens when you join a network and have kids. But the engagement of FB is way too large to ignore and engagement through FB has been phenomenal. In 2016 I finally cracked SnapChat with the launch of Discovery. I started doing SnapStorms, which are short burst of video around a certain startup or financing topic. I also did a few SnapAMAs where I let people ask any question and I responded to 100% of them. I love it. Right now the volume is manageable during an AMA. It’s hard to be discovered on SnapChat right now so I occasionally tweet my SnapChat add handle: https://www.snapchat.com/add/msuster Sure, I’d rather not have to ask but that’s when happens when discovery is hard. So this dude on Twitter says that I’m “trying to hard” because I’m using SnapChat in a new way. By now I’m used to the haters. Here’s the thing: But honestly it just proves to me that haters are gonna hate. People can’t resist being negative. Some people draw satisfaction by pointing at you and saying, “See! Look how stupid that guy is!” I can’t imagine being that miserable person. I’d much rather be the fool always trying new stuff. And honestly I love technology products and if you don’t try the newest stuff you’ll wake up an old person emailing from your Hotmail account with links to MapQuest over your dial-up AOL plan. For the rest of us — onward and upward. Stay young. Even when you’re gray. And I Tweeted this post and David Tirazona’s response was precious It’s called getting youthenized! https://t.co/D7elVkC4XR — David Tirazona (@TirazonaD) March 7, 2016 ", "child": "2411_1\t2411_2"}