{"name": "2415", "parent": "", "title": "Developing an Action Plan for High Performance With ADD", "sentences": [{"2710": "Developing an Action Plan for High Performance With ADD"}, {"fc71": "I’ve written about Attention Deficit Disorder a couple of times."}, {"5d2a": "In the articles I made it clear that I’m not a doctor and if you have severe ADD you should consult a professional. But I talked about my personal experiences of finding out I had ADD when I was 39 years old and how this discovery led to a freedom mentally and emotionally because it explained some of my self-perceived weaknesses. It helped me to better understand how my brain works and I began working on coping mechanisms. Since then I’ve been able to Jujitsu my slow-processing frontal cortex into an advantage."}, {"b0fe": "Since I’m not a doctor I can’t promise these will work for you but I thought I’d at least share what I’ve learned about myself:"}, {"9ac5": "1. FoodBefore having kids I literally never paid attention to the impact that food had on my brain. I never realized that if I didn’t eat in the morning I would get grumpy or if I ate the wrong kinds of foods I’d lost concentration. Anyone who has kids will be much more hyper-aware of food impacts. All you need to do is give you kids a little bit of sugar and you’ll see them bouncing off the walls / becoming hyperactive."}, {"8f57": "I also became more aware of the impact of food on my body overall after being diagnosed with acid reflux in 2000. I wrote about that experience in my post, “The Yo-yo Life of a Tech Entrepreneur,” in which I described an experience that some entrepreneurs has told me mirrored their own so much they found it scary. From the stresses of being a startup founder I began to have pain in my chest that I became worried was heart trouble. After seeing a doctor I found out what acid reflux even was and it turns out it’s very common in entrepreneurs. The doctor told me"}, {"8bf6": "“You don’t mentally process how much you’re under stress because of your personality but your body still perceives the stress. So while you’re mind feels calm, your body is becoming a mess. That stress — plus your unhealthy eating and lifestyle — have given you acid reflux.”"}, {"8f23": "In short I was eating too much, drinking alcohol at night to unwind and making poor food choices exacerbated by travel and work: Late-night pizza, Indian food, french fries and such all washed down with beer or stronger. And some key trigger foods were: orange juice, caffeine, spicy foods & these kicked in whenever I ate meals in too large of proportions."}, {"398b": "So I became more aware of the impact of food on myself. My brain and my body. I’m not perfect but I’m aware."}, {"e31b": "Here is my exact situation. If I eat sugar I’m screwed. My brain ends up on the roof, bouncing around and my concentration goes from 100 to 0. And sugar also comes in the form of many processed carb-heavy foods. Protein is my friend. As is smaller meal sizes. If I eat eggs & cheese for breakfast I’m golden. If I include a bagel it’s a struggle — no matter how much I LOVE bagels. If I have a bagel and hash browns — fuggetaboutit."}, {"076e": "So I try really, really hard to control carbs. It’s a struggle, for sure. If I have a long meeting and eat a chocolate chip cookie I might as well leave the meeting because no good will happen after 20 minutes when it fully hits my system."}, {"83bf": "2. CaffeineI mentioned above that caffeine was a trigger for acid reflux. That said, I’ve found that if I cut out most carbs and eat smaller sized meals my acid reflux is completely dormant as long as I avoid orange juice and red wine. Oy. Red wine kills me."}, {"d81d": "But what I learned about ADD is that coffee is a super-charger input into my system. In a book I read about ADD it said that your brain has a slow processing frontal cortex. Anything that stimulates this increases your concentration, which is part of the efficacy of drugs like Adderall. And coffee in the morning gives me the stimulation I need to up my concentration levels. Coffee + protein — carbs = magic."}, {"eeb3": "I should also tell you that I had HUGE success mentally (and weight control) with Bullet Proof Coffee in the morning. Basically you blend coffee with butter and coconut (or similar) oil in stead of eating breakfast in the morning. For concentration this was actually my biggest gain. I’m not going to try and defend IF (intermittent fasting) here but if you want to learn more about Bullet Proof Coffee or IF just Google it. It worked magic for me."}, {"04cd": "Right now I’ve been eating Freshology and some Power Supply and this is working so well for me that I’m sticking to it for a while. Both have great lifestyle options for low carbs, paleo, vege or whatever lifestyle choice is right for you."}, {"1954": "But basically coffee has become my friend again."}, {"db6a": "3. SleepAnother huge correlating factor with ADD is sleep. Simply, if I get more sleep my concentration levels go up and if I get less my ADD is more of a struggle. Half of the battle is just being aware of my daily brain chemistry and knowing when I need a little bit more concentration to get the job done. If you’re struggling with concentration definitely track your sleep and see if you can get more. This isn’t an area I score highly in but I’m aware of the need and on days where I’ll have very long meetings, depositions or if I’m going to be in charge of a big event I definitely dial up the sleep right before."}, {"4a83": "4. Partnering with Completer FinishersOne of the known weaknesses of ADD is that you start many tasks but aren’t the best at finishing them all. People with ADD get too distracted to “close” and if I’m honest too bored. Once the problem set is mostly figured out your brain is on to the next problem."}, {"12a8": "I’ve defined myself as a “shaper” in that I am filled with tons of ideas and energy and I kick off a lot of detailed work myself. But I’m mister 80%. The “shaping.” But I know it’s very important to complete tasks so long before I even knew that I had ADD I would surround myself people were closers. At my first startup this was Stuart Lander, who became the COO at BuildOnline. And years later at Upfront when I needed somebody who was the best closer I had ever worked with I turned to Stuart Lander to join is as Chief Operating Partner. I’m a big believer in getting the band back together."}, {"c241": "In my home life I’d be a mess without my completer-fisher-extraordinaire wife. When I work on tasks or presentations or analyses I often get into the weeds but I often rely on a partner to make sure we cross every T and dot every I. I choose lawyers who are great completer finishers (believe it or not, not all are) and so forth."}, {"897d": "5. Turning the Urgency Addiction into a Competitive AssetOne of weaknesses of ADD is the inability to prioritize tasks and a poor ability to estimate the time it takes to complete a task. These are known symptoms of people with ADD. But as I’ve pointed out on many occasions, people who have ADD can also be peak performers and it’s not as big of a limitation as conventional wisdom would suggest. One of the “superpowers” is the ability to have hyper focus when you need to."}, {"7727": "The way this works out for me is that because I hate failure I often get crazy focused (and drop everything else) when I have something big I need to achieve. Steven Covey wrote best about it when he talked about “The Urgency Addiction” where people like me prioritize things that are urgent & important. (Of course you’re supposed to prioritize things that are important but not yet urgent!)."}, {"0295": "And when the Urgency Addiction kicks in I’m able to turn that energy into huge creativity for presentations that I need to give, analysis I need to work on or a big undertaking like leading our Upfront Summit."}, {"facd": "The trick is combing a trusted completer-finisher with the urgency addiction. Because I trust Stuart so much I sometimes literally turn over my work efforts to him. I simply say, “Ok, we know we have to get X done by Y date and if I’m in charge it will get done last minute. Set early deadlines for me and then hold me accountable. If you hassle me on these early deadlines I promise to deliver against your plan.”"}, {"1939": "And that’s how our Summit has gotten better every year. Things that I used to start in January for a February date now get starting in October. And the week we finished our 2016 Summit, Stuart had already survey attendees for feedback, completed an analysis of what worked and what didn’t and identified the dates for our 2017 Summit. I would have started in June :)"}, {"b17d": "6. Active Participation in MeetingsWhat I’ve learned about ADD is that while concentration can be a struggle, you actually develop hyper focus for things that interest you. If you attend a meeting and aren’t actively talking, asking questions and participating you’ll likely be bored. It’s how our brains work. So I try much harder to participate in meetings because I know that if I do I’ll pay attention and retain more of the content."}, {"bf14": "I also found that not having your computer or mobile phone available drastically increasing your engagement and lowers your distractions. Knowing you have something you can turn to in a moment of boredom is actually a weakness, not a strength. Embrace it."}, {"c36c": "You can’t participate in all meetings. Some just aren’t your show and it would be inappropriate to speak up. And if you don’t have a device to turn to (which I recommend you don’t) the single best hack I have is that I bring a pad of paper and a pen. If for some reason the meeting isn’t productive for me and I can’t see a way to make it more productive I simply begin taking notes for other tasks I need to complete. It’s much less rude than being on a device where the participants KNOW you aren’t paying attention. If you’re writing and looking up occasionally you’re assumed to taking notes."}, {"b4f8": "I know it’s less ideal that paying attention but sometimes you just can’t. So given the choice between devices that are rude and paper productivity I’d choose the later. Plus, if you don’t you’re prone to …"}, {"0ec2": "7. ArguingOne of the things I never knew (and I’ll bet you didn’t either) is that people with ADD tend to argue much more than people who don’t have it. I’m told this is an evolutionary response to a slow-processing frontal cortex. When you argue it stimulates your brain and helps you pay attention. I have been an arguer all my life and when I learned about this I realized that it really does help me stay more engaged in the present."}, {"4eb9": "Obviously arguing all the time isn’t the best way to Win Friends and Influence People so you have to keep it in check. The way I’ve described it is that historically if I’ve been in really boring meetings where people are slow and wasting my time and not fascinating is that the pressure builds in my brain and my body to say something. And then eventually it pops out almost like Tourette syndrome and I sometimes can’t believe, “Wow. So I just said that out loud.”"}, {"271f": "In group meetings it would often start with my making a small hand motion to the presenter to move to the next page. Or saying something slightly polite like, “Ok. Assume we already understand this topic. How about if we go a little bit faster and then have more time for a fuller debate at the end.” By the third or fourth “hint” that this is boring the fuck out of me eventually it would become an outburst."}, {"5efa": "Pen and paper. Pen and paper. Zen and paper. I don’t have to fight. I don’t have to be in control of this meeting. It’s ok for this presenter to suck and waste time and not get the outcome he or she wanted. I tried. But I can’t help everybody. So I need to give in, give up and just accept that my time is better spent truly lost in my next task or my to-do list. And sometimes it’s better to be polite than helpful. I know this isn’t my normal modus operandi but there are times when a meeting or person is unsavable."}, {"362f": "8. Forced Self ControlSo you know I prefer not to be distracted by a computer in a meeting and if I can help it also not by a mobile phone. But I actually have to have this self-imposed discipline in my personal life as well. This is especially true if you have ADD. Sometimes if I go to dinner with my wife and kids I’ll leave my phone in the car or at home. It’s honestly liberating to know that I CAN’T check my email, Twitter, Facebook, Snapchat, NYTimes, etc."}, {"3c53": "And my biggest win came last Summer when I made a rule that I wouldn’t bring my mobile phone into the bedroom."}, {"ac92": "9. MedicationOne thing that angers many people who don’t have ADD is that doctors prescribe medicine. I’m sure this is abused by some but I’m equally sure it’s life-saving for many. If you’ve never had to live with and ADD brain you simply don’t have the right to judge others who do. You don’t know what you’re speaking about."}, {"2354": "I was prescribed with a very low dose of Adderall — 5mg. Because my food, drink and lifestyle choices mostly keep my ADD in a box I tend not to take drugs very often. I probably take Adderall twice per month maximum. But there simply are days where I need it. When I have to sit through an 8-hour deposition or planning session for a deposition, I’m going to need it. If I haven’t slept well for days and need to perform well (or avoid arguing) in a meeting Adderall is a lifesaver."}, {"5592": "I don’t recommend medicine lightly. I also don’t discourage it. It’s a very personal decision between a patient and his or her doctor."}, {"ba74": "But I know with not reservation that it makes a huge difference in my life when I need it. And all of those know-it-alls who claim they know what they’re talking about when they say that “ADD isn’t real” or “we shouldn’t medicate this condition” should keep their opinions to themselves. And that’s just me being polite."}, {"ed62": "10. Self RespectThe biggest gain from finding out you have ADD is just being more at peace with yourself. Once you know that you’re not a loser, that it isn’t just that you’re a bad person for not completing tasks, when you understand why you argue or read 70% of your book … you can get more comfortable in your own skin. You can look at life altering changes to food, drink, sleep, exercise (which helps greatly!) and even medicine."}, {"ff66": "Just know that ADD isn’t a sign of weakness. It can be a great strength. Embrace it. And respect yourself despite your flaws and idiosyracies. Everybody has them. Ours are simply unique to how our unique brain chemistry."}], "content": "Developing an Action Plan for High Performance With ADD I’ve written about Attention Deficit Disorder a couple of times. In the articles I made it clear that I’m not a doctor and if you have severe ADD you should consult a professional. But I talked about my personal experiences of finding out I had ADD when I was 39 years old and how this discovery led to a freedom mentally and emotionally because it explained some of my self-perceived weaknesses. It helped me to better understand how my brain works and I began working on coping mechanisms. Since then I’ve been able to Jujitsu my slow-processing frontal cortex into an advantage. Since I’m not a doctor I can’t promise these will work for you but I thought I’d at least share what I’ve learned about myself: 1. FoodBefore having kids I literally never paid attention to the impact that food had on my brain. I never realized that if I didn’t eat in the morning I would get grumpy or if I ate the wrong kinds of foods I’d lost concentration. Anyone who has kids will be much more hyper-aware of food impacts. All you need to do is give you kids a little bit of sugar and you’ll see them bouncing off the walls / becoming hyperactive. I also became more aware of the impact of food on my body overall after being diagnosed with acid reflux in 2000. I wrote about that experience in my post, “The Yo-yo Life of a Tech Entrepreneur,” in which I described an experience that some entrepreneurs has told me mirrored their own so much they found it scary. From the stresses of being a startup founder I began to have pain in my chest that I became worried was heart trouble. After seeing a doctor I found out what acid reflux even was and it turns out it’s very common in entrepreneurs. The doctor told me “You don’t mentally process how much you’re under stress because of your personality but your body still perceives the stress. So while you’re mind feels calm, your body is becoming a mess. That stress — plus your unhealthy eating and lifestyle — have given you acid reflux.” In short I was eating too much, drinking alcohol at night to unwind and making poor food choices exacerbated by travel and work: Late-night pizza, Indian food, french fries and such all washed down with beer or stronger. And some key trigger foods were: orange juice, caffeine, spicy foods & these kicked in whenever I ate meals in too large of proportions. So I became more aware of the impact of food on myself. My brain and my body. I’m not perfect but I’m aware. Here is my exact situation. If I eat sugar I’m screwed. My brain ends up on the roof, bouncing around and my concentration goes from 100 to 0. And sugar also comes in the form of many processed carb-heavy foods. Protein is my friend. As is smaller meal sizes. If I eat eggs & cheese for breakfast I’m golden. If I include a bagel it’s a struggle — no matter how much I LOVE bagels. If I have a bagel and hash browns — fuggetaboutit. So I try really, really hard to control carbs. It’s a struggle, for sure. If I have a long meeting and eat a chocolate chip cookie I might as well leave the meeting because no good will happen after 20 minutes when it fully hits my system. 2. CaffeineI mentioned above that caffeine was a trigger for acid reflux. That said, I’ve found that if I cut out most carbs and eat smaller sized meals my acid reflux is completely dormant as long as I avoid orange juice and red wine. Oy. Red wine kills me. But what I learned about ADD is that coffee is a super-charger input into my system. In a book I read about ADD it said that your brain has a slow processing frontal cortex. Anything that stimulates this increases your concentration, which is part of the efficacy of drugs like Adderall. And coffee in the morning gives me the stimulation I need to up my concentration levels. Coffee + protein — carbs = magic. I should also tell you that I had HUGE success mentally (and weight control) with Bullet Proof Coffee in the morning. Basically you blend coffee with butter and coconut (or similar) oil in stead of eating breakfast in the morning. For concentration this was actually my biggest gain. I’m not going to try and defend IF (intermittent fasting) here but if you want to learn more about Bullet Proof Coffee or IF just Google it. It worked magic for me. Right now I’ve been eating Freshology and some Power Supply and this is working so well for me that I’m sticking to it for a while. Both have great lifestyle options for low carbs, paleo, vege or whatever lifestyle choice is right for you. But basically coffee has become my friend again. 3. SleepAnother huge correlating factor with ADD is sleep. Simply, if I get more sleep my concentration levels go up and if I get less my ADD is more of a struggle. Half of the battle is just being aware of my daily brain chemistry and knowing when I need a little bit more concentration to get the job done. If you’re struggling with concentration definitely track your sleep and see if you can get more. This isn’t an area I score highly in but I’m aware of the need and on days where I’ll have very long meetings, depositions or if I’m going to be in charge of a big event I definitely dial up the sleep right before. 4. Partnering with Completer FinishersOne of the known weaknesses of ADD is that you start many tasks but aren’t the best at finishing them all. People with ADD get too distracted to “close” and if I’m honest too bored. Once the problem set is mostly figured out your brain is on to the next problem. I’ve defined myself as a “shaper” in that I am filled with tons of ideas and energy and I kick off a lot of detailed work myself. But I’m mister 80%. The “shaping.” But I know it’s very important to complete tasks so long before I even knew that I had ADD I would surround myself people were closers. At my first startup this was Stuart Lander, who became the COO at BuildOnline. And years later at Upfront when I needed somebody who was the best closer I had ever worked with I turned to Stuart Lander to join is as Chief Operating Partner. I’m a big believer in getting the band back together. In my home life I’d be a mess without my completer-fisher-extraordinaire wife. When I work on tasks or presentations or analyses I often get into the weeds but I often rely on a partner to make sure we cross every T and dot every I. I choose lawyers who are great completer finishers (believe it or not, not all are) and so forth. 5. Turning the Urgency Addiction into a Competitive AssetOne of weaknesses of ADD is the inability to prioritize tasks and a poor ability to estimate the time it takes to complete a task. These are known symptoms of people with ADD. But as I’ve pointed out on many occasions, people who have ADD can also be peak performers and it’s not as big of a limitation as conventional wisdom would suggest. One of the “superpowers” is the ability to have hyper focus when you need to. The way this works out for me is that because I hate failure I often get crazy focused (and drop everything else) when I have something big I need to achieve. Steven Covey wrote best about it when he talked about “The Urgency Addiction” where people like me prioritize things that are urgent & important. (Of course you’re supposed to prioritize things that are important but not yet urgent!). And when the Urgency Addiction kicks in I’m able to turn that energy into huge creativity for presentations that I need to give, analysis I need to work on or a big undertaking like leading our Upfront Summit. The trick is combing a trusted completer-finisher with the urgency addiction. Because I trust Stuart so much I sometimes literally turn over my work efforts to him. I simply say, “Ok, we know we have to get X done by Y date and if I’m in charge it will get done last minute. Set early deadlines for me and then hold me accountable. If you hassle me on these early deadlines I promise to deliver against your plan.” And that’s how our Summit has gotten better every year. Things that I used to start in January for a February date now get starting in October. And the week we finished our 2016 Summit, Stuart had already survey attendees for feedback, completed an analysis of what worked and what didn’t and identified the dates for our 2017 Summit. I would have started in June :) 6. Active Participation in MeetingsWhat I’ve learned about ADD is that while concentration can be a struggle, you actually develop hyper focus for things that interest you. If you attend a meeting and aren’t actively talking, asking questions and participating you’ll likely be bored. It’s how our brains work. So I try much harder to participate in meetings because I know that if I do I’ll pay attention and retain more of the content. I also found that not having your computer or mobile phone available drastically increasing your engagement and lowers your distractions. Knowing you have something you can turn to in a moment of boredom is actually a weakness, not a strength. Embrace it. You can’t participate in all meetings. Some just aren’t your show and it would be inappropriate to speak up. And if you don’t have a device to turn to (which I recommend you don’t) the single best hack I have is that I bring a pad of paper and a pen. If for some reason the meeting isn’t productive for me and I can’t see a way to make it more productive I simply begin taking notes for other tasks I need to complete. It’s much less rude than being on a device where the participants KNOW you aren’t paying attention. If you’re writing and looking up occasionally you’re assumed to taking notes. I know it’s less ideal that paying attention but sometimes you just can’t. So given the choice between devices that are rude and paper productivity I’d choose the later. Plus, if you don’t you’re prone to … 7. ArguingOne of the things I never knew (and I’ll bet you didn’t either) is that people with ADD tend to argue much more than people who don’t have it. I’m told this is an evolutionary response to a slow-processing frontal cortex. When you argue it stimulates your brain and helps you pay attention. I have been an arguer all my life and when I learned about this I realized that it really does help me stay more engaged in the present. Obviously arguing all the time isn’t the best way to Win Friends and Influence People so you have to keep it in check. The way I’ve described it is that historically if I’ve been in really boring meetings where people are slow and wasting my time and not fascinating is that the pressure builds in my brain and my body to say something. And then eventually it pops out almost like Tourette syndrome and I sometimes can’t believe, “Wow. So I just said that out loud.” In group meetings it would often start with my making a small hand motion to the presenter to move to the next page. Or saying something slightly polite like, “Ok. Assume we already understand this topic. How about if we go a little bit faster and then have more time for a fuller debate at the end.” By the third or fourth “hint” that this is boring the fuck out of me eventually it would become an outburst. Pen and paper. Pen and paper. Zen and paper. I don’t have to fight. I don’t have to be in control of this meeting. It’s ok for this presenter to suck and waste time and not get the outcome he or she wanted. I tried. But I can’t help everybody. So I need to give in, give up and just accept that my time is better spent truly lost in my next task or my to-do list. And sometimes it’s better to be polite than helpful. I know this isn’t my normal modus operandi but there are times when a meeting or person is unsavable. 8. Forced Self ControlSo you know I prefer not to be distracted by a computer in a meeting and if I can help it also not by a mobile phone. But I actually have to have this self-imposed discipline in my personal life as well. This is especially true if you have ADD. Sometimes if I go to dinner with my wife and kids I’ll leave my phone in the car or at home. It’s honestly liberating to know that I CAN’T check my email, Twitter, Facebook, Snapchat, NYTimes, etc. And my biggest win came last Summer when I made a rule that I wouldn’t bring my mobile phone into the bedroom. 9. MedicationOne thing that angers many people who don’t have ADD is that doctors prescribe medicine. I’m sure this is abused by some but I’m equally sure it’s life-saving for many. If you’ve never had to live with and ADD brain you simply don’t have the right to judge others who do. You don’t know what you’re speaking about. I was prescribed with a very low dose of Adderall — 5mg. Because my food, drink and lifestyle choices mostly keep my ADD in a box I tend not to take drugs very often. I probably take Adderall twice per month maximum. But there simply are days where I need it. When I have to sit through an 8-hour deposition or planning session for a deposition, I’m going to need it. If I haven’t slept well for days and need to perform well (or avoid arguing) in a meeting Adderall is a lifesaver. I don’t recommend medicine lightly. I also don’t discourage it. It’s a very personal decision between a patient and his or her doctor. But I know with not reservation that it makes a huge difference in my life when I need it. And all of those know-it-alls who claim they know what they’re talking about when they say that “ADD isn’t real” or “we shouldn’t medicate this condition” should keep their opinions to themselves. And that’s just me being polite. 10. Self RespectThe biggest gain from finding out you have ADD is just being more at peace with yourself. Once you know that you’re not a loser, that it isn’t just that you’re a bad person for not completing tasks, when you understand why you argue or read 70% of your book … you can get more comfortable in your own skin. You can look at life altering changes to food, drink, sleep, exercise (which helps greatly!) and even medicine. Just know that ADD isn’t a sign of weakness. It can be a great strength. Embrace it. And respect yourself despite your flaws and idiosyracies. Everybody has them. Ours are simply unique to how our unique brain chemistry. ", "child": "2415_1\t2415_2\t2415_3\t2415_4"}