{"name": "2418", "parent": "", "title": "What You Could Learn from a True Pioneer in Digital, Social & Mobile Media", "sentences": [{"633d": "What You Could Learn from a True Pioneer in Digital, Social & Mobile Media"}, {"9a4c": "BuzzFeed. It conjures up a range of emotions anytime I’ve privately expressed my opinion to thought leaders in our industry that I believe it is one of the most innovative companies in digital media. Some, of course, agree with me that BuzzFeed has been and continues to be the gold standard innovator in digital media to emulate."}, {"ea89": "Others are skeptical, “Ha! It’s a lightweight website of listicles that is grossly over-valued” some have argued. Others have said, “Sure, they grow so fast because they buy all their traffic.”"}, {"7ca1": "Or perhaps you think Donald Trump’s assessment that BuzzFeed is a “Failing pile of garbage” is correct? (there’s a great story from Jonah in the video but you have to watch to hear it :))"}, {"612b": "But it’s undeniable that it has become a digital media powerhouse having raised around $500 million in capital with a valuation reported at $1.7 billion and revenues likely exceeding $250 million (Wikipedia lists 2015 revenue at $167 million)."}, {"8559": "If you ask me, I think it’s one of the companies that has led and will continue to lead the transformation of media from a lethargic print-based (newspapers, magazines) and linear based (TV) format into the most successful digital media brand of the next decade. That is why I invited the Founder & CEO, Jonah Peretti, to come talk at the 2017 Upfront Summit and make the case himself. I have been so fascinated by the emotions that BuzzFeed arouses that I asked Jonah if I could do the interview myself. The 30-minute interview of Jonah Peretti is here but my summary in the notes below."}, {"0552": "I moved to Los Angeles in 2007 and as a VC who had built his career as a programmer, database designer, program manager, CEO then VP Products at Salesforce, I wanted to build a portfolio of software investments. But I knew I had to look for investments in “software meets X (often known as Vertical Software solutions)” rather than necessarily horizontal enterprise software applications. An obvious vector for me would be software for the media industry."}, {"bf5a": "I began asking around who the smartest people in the online media industry were and two names came up again and again — Jonah Peretti (social & viral content) and Ze Frank (social video). I asked Jonah in my interview how he became this viral guru. Around 2001 Jonah was studying at MIT Media Lab and began running experiments in viral stories in an era before smart phones (2007) and before social networks took off (2004–2007) and before YouTube (2005). Back then there were “email forwards.” For those too young to remember perhaps the best known of this era came in 1996 and was known as Dancing Baby, a strange, animated gif of — you guessed it."}, {"edcd": "Jonah was working on his masters thesis and he asked Nike to produce a customized shoe with the word “Sweatshop” on it. Nike responded that “Nike was inappropriate slang” and they wouldn’t make them. Jonah replied, “No, actually sweatshop is in the dictionary and it means a shop or a factor where workers toil under unhealthy conditions.” Nike wrote back another excuse not to make the shoes so Jonah asked, “Would you at least send me a picture of the 10-year-old Vietnamese girl who stitches my shoes together?”"}, {"4de4": "This got passed around on email from person to person and became so popular it appeared on the Today Show where Jonah (admittedly not an expert in global factory conditions) appeared with Katie Couric and Nike’s head of global PR and debated sweatshops."}, {"86aa": "“How was it possible for a student with no connections in the media industry to reach millions of people around the world just by making something and sharing it with a few friends?”"}, {"0711": "Perhaps we should have seen the signs 15 years ago of what was coming but these trends are hard to spot. At the time we heralded in a new era where “gatekeepers” were no longer going to shape stories to the public and “democratic news” would reign freely. Of course we all had the Utopian view as technologists often do but the laws of unintended consequences takes over."}, {"a2d9": "We discussed this as the social news website DIGG took off with this ethos and quickly became a clique where groups of influential DIGG publishers formed rings of voters that used Instant Messaging to hide their coordination and they were able to control the front page and thus huge volumes of traffic. This had an impact on the 2008 election where apparently groups of DIGG publishers would promote positive stories about Obama and negative stories about Hillary Clinton (sound familiar?)."}, {"3150": "I personally experienced the even more subversive side of DIGG when I learned that groups of people were actually demanding money to get stories on the DIGG homepage and I, the naive believer in online democracy and good intentions of people, learned about the black hat and gray hat monetization of the Internet. I would see this many times of the next decade where I learned that nearly every part of the web that involved monetization was immediately gamed and arms races emerged between platforms to combat abuse and people looking for a quick buck. In fact, the platforms weren’t always so quick to crack down as many of them benefitted financially. Only when a platform felt its reputation might be impinged did they escalate to crack down on their newfound monetization. But I digress."}, {"ba0a": "I asked Jonah whether he thought it was a good idea that he seemed to be indifferent as to where his content was consumed as he was perhaps the first major online media company to abandon the idea that most of one’s content must be consumed on your own website (industry term is O&O — Owned & Operated website). Wasn’t Jonah worried about “platform risks?”"}, {"0da3": "Jonah said that didn’t map to his views on the history of the media business or to his own experiences at BuzzFeed where he contents that he is being paid to produce content by companies like Facebook and Snapchat. Jonah pointed out that originally content companies had to pay cable companies to carry their content and then it became neutral and over time the cable companies actually paid large fees to content creators in order to get access to the highest quality content and differentiate their offering and avoid being commoditized. He sees the same situation playing out today in online media."}, {"ef8e": "Jonah believes that the media business is still mostly stuck in the traditional world where too many ad dollars and too much content is still produced in a traditional way but he thinks the next few years will change that dramatically as most competition switched to social, mobile & digital."}, {"22a5": "I asked Jonah about his started position in photos, lists, GIFs and text and where he thought video fit in. Jonah said that 50% of BuzzFeed’s revenue now comes from video and the pace of this change really surprised him. A few years ago Jonah acquired Ze Frank’s video production company and the two of them have really built an enormous video production & distribution business. For example, one product alone — Tasty — is consumed by 500 million people per month. He thinks the very nature of video is changing. It’s no longer necessarily just a long-form, audio on format — it’s becoming part of the fabric of the Internet."}, {"d789": "“Video is the new HTML.”"}, {"d7c6": "I asked Jonah about his decision to get so heavily into the news business, which seemed as a big departure from “snackable content.” Again he looked to the media industry history and pointed out that before Ted Turner founded CNN he had an entertainment channel. He thinks the history of media businesses show that they have three fundamental pillars: news, entertainment and advertising and you need to be great at all three of these things."}, {"efa5": "You may notice in the pictures that Jonah is wearing a “Los Angeles” sweatshirt and I don’t believe this was simply catering to me. Video has become such an integral part of what BuzzFeed does that Jonah actually moved with his family to Los Angeles, a further sign of the growing influence of the LA Tech Ecosystem."}, {"0900": "As the 2017 Upfront Summit came less than 2-weeks after the Trump inauguration I had to ask Jonah about some of the more controversial (and in this author’s eyes — inspirational) decisions BuzzFeed had made."}, {"0b3a": "BuzzFeed famously turned down a seven-figure upfront ad purchase from the RNC after Donald Trump won the election. I asked Jonah about this."}, {"33a4": "“I usually think of these (decisions) through the lens of my employees and because we create native advertising we’re often producing the content and distributing it. And the idea that my employees many of whom felt directly attacked by the rhetoric on the campaign trail and they felt that their lives or their identities were directly attacked. The idea that they would then be assigned to make Trump ads … seemed pretty unacceptable.”"}, {"cc9e": "We talked about the role that employees now have in companies to advocate for their personal beliefs and perhaps force their leadership to take a more aggressive stance to protect their beliefs (in whatever direction). Of course we saw this in the case of Uber where employees and customers protested the CEO’s decision to be on Donald Trump’s business advisory council."}, {"85c8": "Jonah, “One of the shifts that surprised me was all of a sudden having employees say, ‘hey will BuzzFeed help protect our reproductive rights?’ or ‘Will BuzzFeed help protect us if immigrants are attacked?’”"}, {"51e5": "“Generally as a CEO of a company my expectation wasn’t that my job would be to have to think about things like that (protecting his employees). Generally the rights of citizens are protected by The Constitution and by the government.”"}, {"be16": "“I think you’re seeing a lot more people who are looking to corporations or state governments or local government to protect them.”"}, {"8eb6": "This is an idea that interests me a great deal. If leaders of companies want to cozy up to an autocratic and kleptocratic president for personal gain or corporate gain while sacrificing rights of workers then these very workers should feel empowered to organize to hold their leadership accountable. Imagine if Oracle got more vocal about Safra Catz’s relationship to Trump? Or maybe customers or partners and employees would be more inclined to work with Marc Benioff at Salesforce.com who has put protection of the social rights of his employees front-and-center in how Salesforce conducts business."}, {"84db": "Lastly we had to talk about “the dossier.” Perhaps you’ve heard of it? :)"}, {"c324": "I wanted to ask Jonah about the decision of BuzzFeed to publish the dossier of Donald Trump and his potential interest in rather exotic showers in Russia and whether that may have influenced his treatment of the US relationship with Russia to to “kompromat” (compromising information potentially held about Trump). While the BuzzFeed editor Ben Smith had spoken about it publicly I had never heard any statements from BuzzFeed’s CEO."}, {"e616": "You have to watch the video to get the full story (starting just after 23:30) — but in essence it boils down to this:"}, {"284b": "And Jonah stands by this decision stating that since the publication of the dossier a lot more research has gone into the claims and a lot of progress has been made in researching and tracking down details that wouldn’t have happened had they not published it. He said reasonable people could come to different conclusions about this decision but they stand by their choice and he said anybody wanting to understand this better should watch this video between Brian Stelter and Ben Smith."}, {"a96e": "If you have any interest in the future of online media or even better understanding fake news, why it exists and what to do about it — do yourself and watch this short 30-minute video interview. Jonah is truly a pioneer in online media."}], "content": "What You Could Learn from a True Pioneer in Digital, Social & Mobile Media BuzzFeed. It conjures up a range of emotions anytime I’ve privately expressed my opinion to thought leaders in our industry that I believe it is one of the most innovative companies in digital media. Some, of course, agree with me that BuzzFeed has been and continues to be the gold standard innovator in digital media to emulate. Others are skeptical, “Ha! It’s a lightweight website of listicles that is grossly over-valued” some have argued. Others have said, “Sure, they grow so fast because they buy all their traffic.” Or perhaps you think Donald Trump’s assessment that BuzzFeed is a “Failing pile of garbage” is correct? (there’s a great story from Jonah in the video but you have to watch to hear it :)) But it’s undeniable that it has become a digital media powerhouse having raised around $500 million in capital with a valuation reported at $1.7 billion and revenues likely exceeding $250 million (Wikipedia lists 2015 revenue at $167 million). If you ask me, I think it’s one of the companies that has led and will continue to lead the transformation of media from a lethargic print-based (newspapers, magazines) and linear based (TV) format into the most successful digital media brand of the next decade. That is why I invited the Founder & CEO, Jonah Peretti, to come talk at the 2017 Upfront Summit and make the case himself. I have been so fascinated by the emotions that BuzzFeed arouses that I asked Jonah if I could do the interview myself. The 30-minute interview of Jonah Peretti is here but my summary in the notes below. I moved to Los Angeles in 2007 and as a VC who had built his career as a programmer, database designer, program manager, CEO then VP Products at Salesforce, I wanted to build a portfolio of software investments. But I knew I had to look for investments in “software meets X (often known as Vertical Software solutions)” rather than necessarily horizontal enterprise software applications. An obvious vector for me would be software for the media industry. I began asking around who the smartest people in the online media industry were and two names came up again and again — Jonah Peretti (social & viral content) and Ze Frank (social video). I asked Jonah in my interview how he became this viral guru. Around 2001 Jonah was studying at MIT Media Lab and began running experiments in viral stories in an era before smart phones (2007) and before social networks took off (2004–2007) and before YouTube (2005). Back then there were “email forwards.” For those too young to remember perhaps the best known of this era came in 1996 and was known as Dancing Baby, a strange, animated gif of — you guessed it. Jonah was working on his masters thesis and he asked Nike to produce a customized shoe with the word “Sweatshop” on it. Nike responded that “Nike was inappropriate slang” and they wouldn’t make them. Jonah replied, “No, actually sweatshop is in the dictionary and it means a shop or a factor where workers toil under unhealthy conditions.” Nike wrote back another excuse not to make the shoes so Jonah asked, “Would you at least send me a picture of the 10-year-old Vietnamese girl who stitches my shoes together?” This got passed around on email from person to person and became so popular it appeared on the Today Show where Jonah (admittedly not an expert in global factory conditions) appeared with Katie Couric and Nike’s head of global PR and debated sweatshops. “How was it possible for a student with no connections in the media industry to reach millions of people around the world just by making something and sharing it with a few friends?” Perhaps we should have seen the signs 15 years ago of what was coming but these trends are hard to spot. At the time we heralded in a new era where “gatekeepers” were no longer going to shape stories to the public and “democratic news” would reign freely. Of course we all had the Utopian view as technologists often do but the laws of unintended consequences takes over. We discussed this as the social news website DIGG took off with this ethos and quickly became a clique where groups of influential DIGG publishers formed rings of voters that used Instant Messaging to hide their coordination and they were able to control the front page and thus huge volumes of traffic. This had an impact on the 2008 election where apparently groups of DIGG publishers would promote positive stories about Obama and negative stories about Hillary Clinton (sound familiar?). I personally experienced the even more subversive side of DIGG when I learned that groups of people were actually demanding money to get stories on the DIGG homepage and I, the naive believer in online democracy and good intentions of people, learned about the black hat and gray hat monetization of the Internet. I would see this many times of the next decade where I learned that nearly every part of the web that involved monetization was immediately gamed and arms races emerged between platforms to combat abuse and people looking for a quick buck. In fact, the platforms weren’t always so quick to crack down as many of them benefitted financially. Only when a platform felt its reputation might be impinged did they escalate to crack down on their newfound monetization. But I digress. I asked Jonah whether he thought it was a good idea that he seemed to be indifferent as to where his content was consumed as he was perhaps the first major online media company to abandon the idea that most of one’s content must be consumed on your own website (industry term is O&O — Owned & Operated website). Wasn’t Jonah worried about “platform risks?” Jonah said that didn’t map to his views on the history of the media business or to his own experiences at BuzzFeed where he contents that he is being paid to produce content by companies like Facebook and Snapchat. Jonah pointed out that originally content companies had to pay cable companies to carry their content and then it became neutral and over time the cable companies actually paid large fees to content creators in order to get access to the highest quality content and differentiate their offering and avoid being commoditized. He sees the same situation playing out today in online media. Jonah believes that the media business is still mostly stuck in the traditional world where too many ad dollars and too much content is still produced in a traditional way but he thinks the next few years will change that dramatically as most competition switched to social, mobile & digital. I asked Jonah about his started position in photos, lists, GIFs and text and where he thought video fit in. Jonah said that 50% of BuzzFeed’s revenue now comes from video and the pace of this change really surprised him. A few years ago Jonah acquired Ze Frank’s video production company and the two of them have really built an enormous video production & distribution business. For example, one product alone — Tasty — is consumed by 500 million people per month. He thinks the very nature of video is changing. It’s no longer necessarily just a long-form, audio on format — it’s becoming part of the fabric of the Internet. “Video is the new HTML.” I asked Jonah about his decision to get so heavily into the news business, which seemed as a big departure from “snackable content.” Again he looked to the media industry history and pointed out that before Ted Turner founded CNN he had an entertainment channel. He thinks the history of media businesses show that they have three fundamental pillars: news, entertainment and advertising and you need to be great at all three of these things. You may notice in the pictures that Jonah is wearing a “Los Angeles” sweatshirt and I don’t believe this was simply catering to me. Video has become such an integral part of what BuzzFeed does that Jonah actually moved with his family to Los Angeles, a further sign of the growing influence of the LA Tech Ecosystem. As the 2017 Upfront Summit came less than 2-weeks after the Trump inauguration I had to ask Jonah about some of the more controversial (and in this author’s eyes — inspirational) decisions BuzzFeed had made. BuzzFeed famously turned down a seven-figure upfront ad purchase from the RNC after Donald Trump won the election. I asked Jonah about this. “I usually think of these (decisions) through the lens of my employees and because we create native advertising we’re often producing the content and distributing it. And the idea that my employees many of whom felt directly attacked by the rhetoric on the campaign trail and they felt that their lives or their identities were directly attacked. The idea that they would then be assigned to make Trump ads … seemed pretty unacceptable.” We talked about the role that employees now have in companies to advocate for their personal beliefs and perhaps force their leadership to take a more aggressive stance to protect their beliefs (in whatever direction). Of course we saw this in the case of Uber where employees and customers protested the CEO’s decision to be on Donald Trump’s business advisory council. Jonah, “One of the shifts that surprised me was all of a sudden having employees say, ‘hey will BuzzFeed help protect our reproductive rights?’ or ‘Will BuzzFeed help protect us if immigrants are attacked?’” “Generally as a CEO of a company my expectation wasn’t that my job would be to have to think about things like that (protecting his employees). Generally the rights of citizens are protected by The Constitution and by the government.” “I think you’re seeing a lot more people who are looking to corporations or state governments or local government to protect them.” This is an idea that interests me a great deal. If leaders of companies want to cozy up to an autocratic and kleptocratic president for personal gain or corporate gain while sacrificing rights of workers then these very workers should feel empowered to organize to hold their leadership accountable. Imagine if Oracle got more vocal about Safra Catz’s relationship to Trump? Or maybe customers or partners and employees would be more inclined to work with Marc Benioff at Salesforce.com who has put protection of the social rights of his employees front-and-center in how Salesforce conducts business. Lastly we had to talk about “the dossier.” Perhaps you’ve heard of it? :) I wanted to ask Jonah about the decision of BuzzFeed to publish the dossier of Donald Trump and his potential interest in rather exotic showers in Russia and whether that may have influenced his treatment of the US relationship with Russia to to “kompromat” (compromising information potentially held about Trump). While the BuzzFeed editor Ben Smith had spoken about it publicly I had never heard any statements from BuzzFeed’s CEO. You have to watch the video to get the full story (starting just after 23:30) — but in essence it boils down to this: And Jonah stands by this decision stating that since the publication of the dossier a lot more research has gone into the claims and a lot of progress has been made in researching and tracking down details that wouldn’t have happened had they not published it. He said reasonable people could come to different conclusions about this decision but they stand by their choice and he said anybody wanting to understand this better should watch this video between Brian Stelter and Ben Smith. If you have any interest in the future of online media or even better understanding fake news, why it exists and what to do about it — do yourself and watch this short 30-minute video interview. Jonah is truly a pioneer in online media. ", "child": "2418_1\t2418_2\t2418_3\t2418_4\t2418_5"}