{"name": "2422", "parent": "", "title": "Snapchat 101 for VCs and Old Folks", "sentences": [{"f31d": "Snapchat 101 for VCs and Old Folks"}, {"bd52": "As the human ear ages it loses its ability to hear high-pitched sound frequencies (above 15–16 kHz) through a condition known as presbycusis that starts at 18 years old. There’s an old parlor trick where a sound is played at a higher frequency than adults can hear while kids are left smiling and laughing at us because for once it’s US who are out of the loop."}, {"3c3f": "Thus begins Snapchat and why you don’t get it. That’s the point. But that’s going to change so the sooner you get get over the fact that it’s not a “sexting app” the better. Let me just put this more clearly for you up front — the vast majority of the Internet is used for porn so every product has this use but you probably just don’t know about it: YouTube, Tumblr, Facebook, FaceTime, Skype and of course be very careful on Google Search without “safe mode” on."}, {"ec40": "So get over it. Snapchat will be used for both like the Internet (and TV) are. I just need to break you of the idea that Snapchat is for one thing — it is not."}, {"1412": "Now. Let me first address VCs or anybody else who is likely above the age where they “get” Snapchat but whose customers are likely in the age demo who use it religiously. Your customers are all on this product so not trying to grok this platform gives you a few big handicaps:"}, {"e425": "But since Snapchat uses the frequency above your hearing range it’s nearly impossible to “get” without help. It took me ages and as I walk many friends through how to use the product I get profound “thank you’s” every time. So even though it’s a playground I have mostly to myself right now — I figure every gathering is a bit more fun when your peers turn up."}, {"2eaa": "This post is a “how to” guide so I’ll save the “why I believe Snapchat is an important medium” for one of my next posts. If you already get Snapchat please forward this to your friends who keep asking you why you use that damn app all the time!"}, {"c7d0": "You can follow me on Snapchat here or by searching in the app for msuster. I do regular (almost daily) “Snapstorms” of content around one topic for entrepreneurs and VCs. This morning I’m going to talk about the Mobile App ecosystem and why it’s led so many startups astray. It will be a follow on from my “App is Crap” or “Web Second, Mobile First” blog posts but in short, video, updated, digestible formats. I can tell you now that between 1,100–1,500 people (growing by the week) will watch these in 24 hours. And I save them to my camera roll and will publish them permanently later in a different venue."}, {"c836": "But now for the 101 …"}, {"022d": "Main Areas of Snapchat"}, {"2dfd": "Mostly what you probably know about Snapchat is that it’s used as a messaging app for 1–1 or 1-many photo + text + scribbling messages. It is highly unlikely you will use it this way as a novice. As you get more expert you’re realize some huge benefits of this but for now please move past this use case — which is how your younger peers use Snapchat."}, {"f14f": "The second part of Snapchat is “stories” and this is where you can see a 24-hour compilation of photos and/or videos from a person’s account. This is your sweet spot if you’re new. The beauty of Stories is that it has a very similar feel to the products you already know like Twitter and FB. Why? Because I am not so narcissistic at 47 to want to take a photo of myself and send it out to 200 friends in hopes that that they want to see my message in their inbox. But if I put photos or videos into a “story” then people can choose to view it or not so it feels less intrusive. It’s more like writing a Tweet vs. sending a Direct Message (DM) in Twitter, which feels more intimate and intrusive or a FB post vs. a Private Message. Stories is the place to find your sea legs. More on whom to follow later."}, {"5698": "The third part of Snapchat is “live stories,” which are awesome. They are either the local, geo-coded area you’re in or a world event. Right now mine shows the Miami GOP Debate because that just happened and “Kobe/LeBron: The Finale.” Think of this area almost like “Twitter Moments” if you know that product or trending. When the Paris massacre was happening I found this to be the single best source to get a quick sense of what was happening on the ground by everybody who was Snapping from Paris. It really was the best place on the Internet to get a sense. Better than FB, Twitter or any news site. This is a hidden story most don’t understand."}, {"07b4": "The fourth part is “discover” and this is the professional media part of Snapchat that you barely knew existed but your younger peers certainly know about. It has Vice, Tastemade, Vox, ESPN, Comedy Central, BuzzFeed and more."}, {"58bd": "The final part of Snapchat for now is the most hidden and is a lot of fun, which is the secret part of Snapchat where you can take photos or videos of people with rainbows coming out of their mouths or do the “head swap” that you probably saw in the press. For now, avoid this until you grok the basics, which as a reminder is STORIES."}, {"d153": "Navigation"}, {"0282": "The first time you use a video game it’s really hard to program in your brain what each button or joystick does. The Xbox has X,Y,A,B plus bumpers and joysticks. Yet a few weeks in your mind automatically controls to joystick without thinking about it. So, too, Snapchat. Snapchat’s navigation is through “swiping” but they leave breadcrumb clues of how to navigate that also work by clicking (for novices)."}, {"8ad6": "The starting screen every time is the camera. This is the dog whistle. It’s the frequency designed to keep old people out and keep the product cool and hip for young people. And make sure they can use Snapchat without mom & dad wanting to send Snaps to their friends or snoop on them. It’s super ironic because while Twitter is busy trying to simplify its product for newbies Snapchat is trying to do the exact opposite. It’s worth pondering."}, {"5466": "Open Snapchat. Look at the top of your screen in the middle and you’ll see the Snapchat ghost. If you click on that it will take you to your personal home page on Snapchat. If it’s just white nothing has changed and if it’s a white ghost with a yellow box around it you have new followers. You can click on the ghost to “navigate up” or when you get better at Snapchat you’ll simply “swipe down” but both actions take you to your home screen."}, {"4e07": "Here you should see your ghost (which you can personalize or add a picture to) in the middle. That’s how others will see you when they search for you. You can change your name if you want to be called something else in the app. Below your name (and that of others) is a number and it took me for freaking ever to figure out WTF this was. It’s your Snapchat “score,” which is just a measure of how much you actually engage in the app. If you send and receive a ton of private messages to others your score will be high and if you don’t, it won’t. Don’t worry about this. But if you DO see somebody with a high score then you can assume they’re a power user — at least worth knowing. Yes, I was up early this morning."}, {"2320": "If you’re newer to Snapchat you obviously want to add some friends so you can click on that button. The easiest is obviously to add from your Address Book because that’s where you can find out whom you know that actually has downloaded the app and may or may not use it. And of course you can add by user name (mine is msuster). This is also where you can share out your user name with friends or on Twitter by clicking the “Share Username” button that will allow you to text, email, Tweet, FB or just copy your user name to share with others."}, {"a36c": "Ok. So here’s how most newbies get forked. Now I’m on the “Add Friends” page and like the joystick in a video game I have no idea how to “get back” or ever where I’m actually supposed to go. Fear not. Follow the breadcrumb. If you look in the top left you’ll see the left arrow that guides you what to do next or when you become a pro you’ll know to swipe right. You’re back at your personal home page."}, {"ca11": "Click on the top right tool button and you’ll see your settings with your user name, birth date, email account, etc. This is where you also control whether any user can send you a Snap (think text or photo message) or just friends. This will say whether anybody can view your stories or just friends. Beyond some basics don’t yet worry about settings. You can play around more with it once you grok the app."}, {"a643": "Breadcrumb nav top left and you’re back at your user page. While there is more you can do on this page it’s not important for now. Look for the breadcrumb nav out, which is at the bottom center. If you click it you are page at the “home screen” which is for you to take a photo or video. Pro users will “swipe up.”"}, {"fa60": "For now you’re not going to take a photo or video but I’ll come back to that. Remember Snapchat is about swiping for quick nav with breadcrumb nav clues for novices. If you look at the bottom of your screen you’ll see buttons in each bottom corner. If you click on the bottom right it’s the same as “swipe left” and if you click in the bottom left it’s the same as “swipe right” so if you ever forget what to do you can click those."}, {"496b": "Let me tell you that as a beginner all the real stuff will come from swiping left (clicking the bottom right). Try that now. If you swiped left you’re at the stories page. Here you’ll see recent stories from people you follow. Some regular VC or tech people putting out stories include me, Justin Kan, Gary Vaynerchuk, Chris Sacca and several others. Probably the best known person now on Snapchat is Dj Khaled. He’s worth following for now if for no other reason than he’s prolific so you can follow how some people use stories. Frankly, the more tech equivalent and easier understood by you is probably Gary V."}, {"12dd": "But when you hear everybody talking about “key” or using the key symbol that’s Dj Khaled. Or when you hear people saying, “They don’t want you to have …” that’s Khaled, too. As in, “They don’t want you to have a nice beautiful breakfast. But you gotta have it” or “They don’t want you to be healthy. But get on the treadmill.”"}, {"56bb": "My thinking? They don’t want you to use Snapchat. Use Snapchat. Trust me. Stick with it the same way you “didn’t get” Twitter in 2007 when you signed up but by 2009 you were using it effortlessly."}, {"6b8a": "When you’re watching a story it will be either text or video. It could be one photo/video or 20 in a row. I have been using it like a short video blog where I’ll take a topic and put out 10–15, 10-second videos on topics like Fund Raising, Tech PR, Recruiting or just “A day in the life of a VC.” Sometimes I interview tech friends. The beauty of the medium is the time constraint like Twitter. Because each video is only 10 seconds it forces you to get to the point."}, {"0928": "While you’re watching if you want to “fast forward” you simply click on the photo or video and it skips to the next segment. So if I shot 15 short videos and you click on number 8 it will skip the remainder of that video and go to 9. If you want to cancel out of the entire story simply scroll down and it will take you back to the main stories page."}, {"fcc6": "Swipe left again (or if you look in the top right corner you’ll see the reminder breadcrumb nav with the “Discover logo” that you can press to take you to the Discover page. Here you’ll see the professional and curated content. Yes, this is where your kids or nephews are reading news and watching comedy. Click on Tastemade — one of my favorite channels. It’s the Millennial version of The Food Network. It takes a while to figure out the nav of Discover but once you do it’s a fun way to consume media. You may not be in the age to want to watch media like this but if you are in a job that requires you to understand the future of media and tech products you should at least force yourself to “get it” before moving on."}, {"c397": "You swipe left to see more videos or swipe right to go back to the last video. It is just a teaser on the main left/right axis. To watch a video or read a story (if it’s text) you scroll up. Now you’re watching Snapchat media videos that you barely knew even existed. Still think Snapchat is just for sexting? Scroll down to get out of that video, down again to get back to the main Discover page and if you forget what to do you can see the breadcrumb nav in the left as a guide to remind you to swipe right (or click on that nav) and you’re back to stories."}, {"e0d9": "Swipe right again and you’re back to the camera."}, {"6f7c": "For Slightly More Experienced Users"}, {"c6b5": "Ok. You have the basics. But there is more."}, {"44df": "Swipe right from the home screen (the photo / video taking screen) and you’ll see your messages if you have any. It’s impossible to know what do to as a newbie. So let me hack through it for you."}, {"c87d": "If you have a blue solid square it’s a text message sent to you. It could be a group message or just for you. Snapchat doesn’t tell you that, which is a product flaw they need to fix. If you see a red square it’s a photo that was sent to you. If it’s purple it’s a video that has audio so it’s a warning that you need to turn on your sound before clicking on it (or that you shouldn’t open it if you’re in a public setting where volume is inappropriate)."}, {"66a9": "If you have any blue messages here you can swipe right on them to read the message. Be careful. Once you come back to this message in the future it’s gone. Remember — it’s an ephemeral network. The beauty is that you can send a message to a person that disappears unlike a normal text. Call this an “advanced use case.” But you can read this message and reply by typing and then hitting “send” in the bottom right. If you type and then hit the yellow button in the middle it will add your text to a picture of yourself. Don’t do that for now if you’re a newbie :)"}, {"4358": "Once done look at the top nav for breadcrumb clues. If you click the hamburger in the top left corner it will show you more details about the person who sent you the message. It’s an easy way to follow somebody or to block them if they send you something inappropriate."}, {"1c0e": "Once you’re read a message the person who sent it will be able to know. They also can know if you never read it. It’s also important for you to know that if you ever take a screen grab of any message (text, photo, story, whatever) the person who created that message is alerted. It’s ok to take a screen grab (it’s even considered a sign of flattery within Snapchat etiquette) but just know people will know."}, {"f48a": "To send somebody a message click on the top left nav of the messages screen, search for a name, click on their user name and it will put you in the messages screen. There are several hidden features here (like sending files from your phone) but I’ll save those until you’re an expert."}, {"1d72": "More Advanced Users"}, {"cfd4": "Ok. My guess is that you’ll want to be a lurker for a while and consume media before producing your own stories. And you probably should learn the basics of sending texts, photos and videos to a few friends before publishing stories. But let me at least tell you how."}, {"939e": "The first thing you do is shoot video or a photo on the home screen. You can shoot in front of you or click the top right nav to go into selfie mode. As an experiment just take a photo — I promise it won’t get sent anywhere."}, {"2180": "Now you see a static image. If you click the top left “x” it will cancel the image (or video) so you can retake it. Look at the top right. You can type text over it by hitting the T or add an emoticon by hitting the palette left of the T. If you click the crayon to the right of the T you can draw/scribble on the photo."}, {"472f": "Look at the bottom left. The number tells you how long that photo will appear before disappearing in your story or in your personal message to friends. You can set it between 1–10 seconds. Immediately to the right is a bit of magic. It’s the ability to save the photo or video to your camera roll WITHOUT it being saved in Snapchat or being sent to friends. This is a very useful feature once you’re an expert. I won’t elaborate now."}, {"7969": "Immediately to the right of the local save is the “add to stories” button. This is a short cut to save your photo/video to a story. Click on this — you can still go back. I promise! It usually gives you the ability to add to “my story” or to a local geo-coded story (mine shows “Our LA Local Story”). If you want to “publish” you click on the chevron in the bottom right so don’t click that if you don’t want to publish. You can click the top left “x” to bail out. But this is the quick way to send something to a story."}, {"f4b3": "Here’s the really, really nice thing about stories. You can publish a photo and you don’t feel like you’re spamming anybody. Either they decide to watch your story or they don’t! It’s like Twitter or FB that way. No consumer will feel bothered by the fact that you published this. Some will see it, some won’t. It will be live for 24 hours and then disappear. Or you can delete it if you want to take it down."}, {"3851": "Cancel out and then take another photo. This time instead of hitting the “add to stories” tab click on the bottom right chevron. Now you see all the people in you’ve added on Snapchat whom you can send messages to. If you click on the square to the right of their name it will prompt you to send them the photo or video in their private messages area. If you click on many people it will send it to all of them but not like a “group message” more like a 1-to-many message. In fact, they won’t necessarily know you sent it to multiple people. And from this screen you can also publish to your own personal story."}, {"55b2": "Super Advanced"}, {"8dfa": "Now let’s pretend you’re a ninja and sending out Stories. If you swipe left from the home page (which remember is where you take photos / videos) then you’ll see “My Story” with all of your contributions over the past 24 hours."}, {"74ff": "To the right My Story you see three dots in a column. If you click on that it shows you all of your individual photos / videos and show you how many times each has been seen or snapped. I’m showing you mine right now. See each of these videos has been seen between by between 1,000–1,100 people and screen grabbed by 10–20. It tells me what time I uploaded thus I know what time this part of the story will disappear."}, {"bf5e": "I can click on the eyeball at it tells me exactly who watched my video and who snapped it. That’s pretty cool! Swipe down to get back to your stories page. And if you see a little down arrow to the right of your My Story and click it then it saves your entire story to your local camera roll. Thus I’ve saved all of my Snapstorms to my local camera roll and uploaded them to Dropbox. So I’ll be publishing them in the future on a more permanent location. For now I’m enjoying the fact that if people want to see them they need to turn in daily."}, {"f904": "The End"}, {"4c5e": "As usual I wrote this in one sitting with no editing. I’ve just been dying to find the time to write a how-to guide for many of my friends who don’t get Snapchat. I promise to write more about how to get the most out of it and why I think it’s important for media. In fact, it’s the most important tool for media to come along since Twitter, FB, YouTube and Netflix. But I promise to elaborate another day. I also have a bunch of screen shots I can add to this post but I gotta get ready for work so I’ll try to add later."}, {"8278": "And yes — I know I need to plug in my mobile phone. Trust me, this will really bother people with OCD :) Sorry."}, {"f491": "And don’t forget to follow me to get a sense of how Snapchat stories work: https://www.snapchat.com/add/msuster"}, {"26a0": "And please don’t forget to forward this post to a friend if you got any value. Thank you!"}, {"9c09": "P.S. I’ll clean up any errors or typos later. Feel free to alert me in comments section."}, {"8c7e": "P.P.S. No, I don’t take pitches on Snapchat. I do respond to messages when I can. I can’t always. I have met people on Snapchat and moved the conversation to email and even phone. It’s just like Twitter. I just met an entrepreneur in Kuwait and we’re now connected on email. I met another in Chicago who I’m going to see when I’m there in May. I’ve chatted with several from Israel, Ghana, South Africa, New Zealand — you name it. Like every other network my followers are entrepreneurs so it’s a perfect place for me to engage."}, {"fd10": "And until I persuade more VCs to engage I feel like it’s a playground I have mostly to myself!"}], "content": "Snapchat 101 for VCs and Old Folks As the human ear ages it loses its ability to hear high-pitched sound frequencies (above 15–16 kHz) through a condition known as presbycusis that starts at 18 years old. There’s an old parlor trick where a sound is played at a higher frequency than adults can hear while kids are left smiling and laughing at us because for once it’s US who are out of the loop. Thus begins Snapchat and why you don’t get it. That’s the point. But that’s going to change so the sooner you get get over the fact that it’s not a “sexting app” the better. Let me just put this more clearly for you up front — the vast majority of the Internet is used for porn so every product has this use but you probably just don’t know about it: YouTube, Tumblr, Facebook, FaceTime, Skype and of course be very careful on Google Search without “safe mode” on. So get over it. Snapchat will be used for both like the Internet (and TV) are. I just need to break you of the idea that Snapchat is for one thing — it is not. Now. Let me first address VCs or anybody else who is likely above the age where they “get” Snapchat but whose customers are likely in the age demo who use it religiously. Your customers are all on this product so not trying to grok this platform gives you a few big handicaps: But since Snapchat uses the frequency above your hearing range it’s nearly impossible to “get” without help. It took me ages and as I walk many friends through how to use the product I get profound “thank you’s” every time. So even though it’s a playground I have mostly to myself right now — I figure every gathering is a bit more fun when your peers turn up. This post is a “how to” guide so I’ll save the “why I believe Snapchat is an important medium” for one of my next posts. If you already get Snapchat please forward this to your friends who keep asking you why you use that damn app all the time! You can follow me on Snapchat here or by searching in the app for msuster. I do regular (almost daily) “Snapstorms” of content around one topic for entrepreneurs and VCs. This morning I’m going to talk about the Mobile App ecosystem and why it’s led so many startups astray. It will be a follow on from my “App is Crap” or “Web Second, Mobile First” blog posts but in short, video, updated, digestible formats. I can tell you now that between 1,100–1,500 people (growing by the week) will watch these in 24 hours. And I save them to my camera roll and will publish them permanently later in a different venue. But now for the 101 … Main Areas of Snapchat Mostly what you probably know about Snapchat is that it’s used as a messaging app for 1–1 or 1-many photo + text + scribbling messages. It is highly unlikely you will use it this way as a novice. As you get more expert you’re realize some huge benefits of this but for now please move past this use case — which is how your younger peers use Snapchat. The second part of Snapchat is “stories” and this is where you can see a 24-hour compilation of photos and/or videos from a person’s account. This is your sweet spot if you’re new. The beauty of Stories is that it has a very similar feel to the products you already know like Twitter and FB. Why? Because I am not so narcissistic at 47 to want to take a photo of myself and send it out to 200 friends in hopes that that they want to see my message in their inbox. But if I put photos or videos into a “story” then people can choose to view it or not so it feels less intrusive. It’s more like writing a Tweet vs. sending a Direct Message (DM) in Twitter, which feels more intimate and intrusive or a FB post vs. a Private Message. Stories is the place to find your sea legs. More on whom to follow later. The third part of Snapchat is “live stories,” which are awesome. They are either the local, geo-coded area you’re in or a world event. Right now mine shows the Miami GOP Debate because that just happened and “Kobe/LeBron: The Finale.” Think of this area almost like “Twitter Moments” if you know that product or trending. When the Paris massacre was happening I found this to be the single best source to get a quick sense of what was happening on the ground by everybody who was Snapping from Paris. It really was the best place on the Internet to get a sense. Better than FB, Twitter or any news site. This is a hidden story most don’t understand. The fourth part is “discover” and this is the professional media part of Snapchat that you barely knew existed but your younger peers certainly know about. It has Vice, Tastemade, Vox, ESPN, Comedy Central, BuzzFeed and more. The final part of Snapchat for now is the most hidden and is a lot of fun, which is the secret part of Snapchat where you can take photos or videos of people with rainbows coming out of their mouths or do the “head swap” that you probably saw in the press. For now, avoid this until you grok the basics, which as a reminder is STORIES. Navigation The first time you use a video game it’s really hard to program in your brain what each button or joystick does. The Xbox has X,Y,A,B plus bumpers and joysticks. Yet a few weeks in your mind automatically controls to joystick without thinking about it. So, too, Snapchat. Snapchat’s navigation is through “swiping” but they leave breadcrumb clues of how to navigate that also work by clicking (for novices). The starting screen every time is the camera. This is the dog whistle. It’s the frequency designed to keep old people out and keep the product cool and hip for young people. And make sure they can use Snapchat without mom & dad wanting to send Snaps to their friends or snoop on them. It’s super ironic because while Twitter is busy trying to simplify its product for newbies Snapchat is trying to do the exact opposite. It’s worth pondering. Open Snapchat. Look at the top of your screen in the middle and you’ll see the Snapchat ghost. If you click on that it will take you to your personal home page on Snapchat. If it’s just white nothing has changed and if it’s a white ghost with a yellow box around it you have new followers. You can click on the ghost to “navigate up” or when you get better at Snapchat you’ll simply “swipe down” but both actions take you to your home screen. Here you should see your ghost (which you can personalize or add a picture to) in the middle. That’s how others will see you when they search for you. You can change your name if you want to be called something else in the app. Below your name (and that of others) is a number and it took me for freaking ever to figure out WTF this was. It’s your Snapchat “score,” which is just a measure of how much you actually engage in the app. If you send and receive a ton of private messages to others your score will be high and if you don’t, it won’t. Don’t worry about this. But if you DO see somebody with a high score then you can assume they’re a power user — at least worth knowing. Yes, I was up early this morning. If you’re newer to Snapchat you obviously want to add some friends so you can click on that button. The easiest is obviously to add from your Address Book because that’s where you can find out whom you know that actually has downloaded the app and may or may not use it. And of course you can add by user name (mine is msuster). This is also where you can share out your user name with friends or on Twitter by clicking the “Share Username” button that will allow you to text, email, Tweet, FB or just copy your user name to share with others. Ok. So here’s how most newbies get forked. Now I’m on the “Add Friends” page and like the joystick in a video game I have no idea how to “get back” or ever where I’m actually supposed to go. Fear not. Follow the breadcrumb. If you look in the top left you’ll see the left arrow that guides you what to do next or when you become a pro you’ll know to swipe right. You’re back at your personal home page. Click on the top right tool button and you’ll see your settings with your user name, birth date, email account, etc. This is where you also control whether any user can send you a Snap (think text or photo message) or just friends. This will say whether anybody can view your stories or just friends. Beyond some basics don’t yet worry about settings. You can play around more with it once you grok the app. Breadcrumb nav top left and you’re back at your user page. While there is more you can do on this page it’s not important for now. Look for the breadcrumb nav out, which is at the bottom center. If you click it you are page at the “home screen” which is for you to take a photo or video. Pro users will “swipe up.” For now you’re not going to take a photo or video but I’ll come back to that. Remember Snapchat is about swiping for quick nav with breadcrumb nav clues for novices. If you look at the bottom of your screen you’ll see buttons in each bottom corner. If you click on the bottom right it’s the same as “swipe left” and if you click in the bottom left it’s the same as “swipe right” so if you ever forget what to do you can click those. Let me tell you that as a beginner all the real stuff will come from swiping left (clicking the bottom right). Try that now. If you swiped left you’re at the stories page. Here you’ll see recent stories from people you follow. Some regular VC or tech people putting out stories include me, Justin Kan, Gary Vaynerchuk, Chris Sacca and several others. Probably the best known person now on Snapchat is Dj Khaled. He’s worth following for now if for no other reason than he’s prolific so you can follow how some people use stories. Frankly, the more tech equivalent and easier understood by you is probably Gary V. But when you hear everybody talking about “key” or using the key symbol that’s Dj Khaled. Or when you hear people saying, “They don’t want you to have …” that’s Khaled, too. As in, “They don’t want you to have a nice beautiful breakfast. But you gotta have it” or “They don’t want you to be healthy. But get on the treadmill.” My thinking? They don’t want you to use Snapchat. Use Snapchat. Trust me. Stick with it the same way you “didn’t get” Twitter in 2007 when you signed up but by 2009 you were using it effortlessly. When you’re watching a story it will be either text or video. It could be one photo/video or 20 in a row. I have been using it like a short video blog where I’ll take a topic and put out 10–15, 10-second videos on topics like Fund Raising, Tech PR, Recruiting or just “A day in the life of a VC.” Sometimes I interview tech friends. The beauty of the medium is the time constraint like Twitter. Because each video is only 10 seconds it forces you to get to the point. While you’re watching if you want to “fast forward” you simply click on the photo or video and it skips to the next segment. So if I shot 15 short videos and you click on number 8 it will skip the remainder of that video and go to 9. If you want to cancel out of the entire story simply scroll down and it will take you back to the main stories page. Swipe left again (or if you look in the top right corner you’ll see the reminder breadcrumb nav with the “Discover logo” that you can press to take you to the Discover page. Here you’ll see the professional and curated content. Yes, this is where your kids or nephews are reading news and watching comedy. Click on Tastemade — one of my favorite channels. It’s the Millennial version of The Food Network. It takes a while to figure out the nav of Discover but once you do it’s a fun way to consume media. You may not be in the age to want to watch media like this but if you are in a job that requires you to understand the future of media and tech products you should at least force yourself to “get it” before moving on. You swipe left to see more videos or swipe right to go back to the last video. It is just a teaser on the main left/right axis. To watch a video or read a story (if it’s text) you scroll up. Now you’re watching Snapchat media videos that you barely knew even existed. Still think Snapchat is just for sexting? Scroll down to get out of that video, down again to get back to the main Discover page and if you forget what to do you can see the breadcrumb nav in the left as a guide to remind you to swipe right (or click on that nav) and you’re back to stories. Swipe right again and you’re back to the camera. For Slightly More Experienced Users Ok. You have the basics. But there is more. Swipe right from the home screen (the photo / video taking screen) and you’ll see your messages if you have any. It’s impossible to know what do to as a newbie. So let me hack through it for you. If you have a blue solid square it’s a text message sent to you. It could be a group message or just for you. Snapchat doesn’t tell you that, which is a product flaw they need to fix. If you see a red square it’s a photo that was sent to you. If it’s purple it’s a video that has audio so it’s a warning that you need to turn on your sound before clicking on it (or that you shouldn’t open it if you’re in a public setting where volume is inappropriate). If you have any blue messages here you can swipe right on them to read the message. Be careful. Once you come back to this message in the future it’s gone. Remember — it’s an ephemeral network. The beauty is that you can send a message to a person that disappears unlike a normal text. Call this an “advanced use case.” But you can read this message and reply by typing and then hitting “send” in the bottom right. If you type and then hit the yellow button in the middle it will add your text to a picture of yourself. Don’t do that for now if you’re a newbie :) Once done look at the top nav for breadcrumb clues. If you click the hamburger in the top left corner it will show you more details about the person who sent you the message. It’s an easy way to follow somebody or to block them if they send you something inappropriate. Once you’re read a message the person who sent it will be able to know. They also can know if you never read it. It’s also important for you to know that if you ever take a screen grab of any message (text, photo, story, whatever) the person who created that message is alerted. It’s ok to take a screen grab (it’s even considered a sign of flattery within Snapchat etiquette) but just know people will know. To send somebody a message click on the top left nav of the messages screen, search for a name, click on their user name and it will put you in the messages screen. There are several hidden features here (like sending files from your phone) but I’ll save those until you’re an expert. More Advanced Users Ok. My guess is that you’ll want to be a lurker for a while and consume media before producing your own stories. And you probably should learn the basics of sending texts, photos and videos to a few friends before publishing stories. But let me at least tell you how. The first thing you do is shoot video or a photo on the home screen. You can shoot in front of you or click the top right nav to go into selfie mode. As an experiment just take a photo — I promise it won’t get sent anywhere. Now you see a static image. If you click the top left “x” it will cancel the image (or video) so you can retake it. Look at the top right. You can type text over it by hitting the T or add an emoticon by hitting the palette left of the T. If you click the crayon to the right of the T you can draw/scribble on the photo. Look at the bottom left. The number tells you how long that photo will appear before disappearing in your story or in your personal message to friends. You can set it between 1–10 seconds. Immediately to the right is a bit of magic. It’s the ability to save the photo or video to your camera roll WITHOUT it being saved in Snapchat or being sent to friends. This is a very useful feature once you’re an expert. I won’t elaborate now. Immediately to the right of the local save is the “add to stories” button. This is a short cut to save your photo/video to a story. Click on this — you can still go back. I promise! It usually gives you the ability to add to “my story” or to a local geo-coded story (mine shows “Our LA Local Story”). If you want to “publish” you click on the chevron in the bottom right so don’t click that if you don’t want to publish. You can click the top left “x” to bail out. But this is the quick way to send something to a story. Here’s the really, really nice thing about stories. You can publish a photo and you don’t feel like you’re spamming anybody. Either they decide to watch your story or they don’t! It’s like Twitter or FB that way. No consumer will feel bothered by the fact that you published this. Some will see it, some won’t. It will be live for 24 hours and then disappear. Or you can delete it if you want to take it down. Cancel out and then take another photo. This time instead of hitting the “add to stories” tab click on the bottom right chevron. Now you see all the people in you’ve added on Snapchat whom you can send messages to. If you click on the square to the right of their name it will prompt you to send them the photo or video in their private messages area. If you click on many people it will send it to all of them but not like a “group message” more like a 1-to-many message. In fact, they won’t necessarily know you sent it to multiple people. And from this screen you can also publish to your own personal story. Super Advanced Now let’s pretend you’re a ninja and sending out Stories. If you swipe left from the home page (which remember is where you take photos / videos) then you’ll see “My Story” with all of your contributions over the past 24 hours. To the right My Story you see three dots in a column. If you click on that it shows you all of your individual photos / videos and show you how many times each has been seen or snapped. I’m showing you mine right now. See each of these videos has been seen between by between 1,000–1,100 people and screen grabbed by 10–20. It tells me what time I uploaded thus I know what time this part of the story will disappear. I can click on the eyeball at it tells me exactly who watched my video and who snapped it. That’s pretty cool! Swipe down to get back to your stories page. And if you see a little down arrow to the right of your My Story and click it then it saves your entire story to your local camera roll. Thus I’ve saved all of my Snapstorms to my local camera roll and uploaded them to Dropbox. So I’ll be publishing them in the future on a more permanent location. For now I’m enjoying the fact that if people want to see them they need to turn in daily. The End As usual I wrote this in one sitting with no editing. I’ve just been dying to find the time to write a how-to guide for many of my friends who don’t get Snapchat. I promise to write more about how to get the most out of it and why I think it’s important for media. In fact, it’s the most important tool for media to come along since Twitter, FB, YouTube and Netflix. But I promise to elaborate another day. I also have a bunch of screen shots I can add to this post but I gotta get ready for work so I’ll try to add later. And yes — I know I need to plug in my mobile phone. Trust me, this will really bother people with OCD :) Sorry. And don’t forget to follow me to get a sense of how Snapchat stories work: https://www.snapchat.com/add/msuster And please don’t forget to forward this post to a friend if you got any value. Thank you! P.S. I’ll clean up any errors or typos later. Feel free to alert me in comments section. P.P.S. No, I don’t take pitches on Snapchat. I do respond to messages when I can. I can’t always. I have met people on Snapchat and moved the conversation to email and even phone. It’s just like Twitter. I just met an entrepreneur in Kuwait and we’re now connected on email. I met another in Chicago who I’m going to see when I’m there in May. I’ve chatted with several from Israel, Ghana, South Africa, New Zealand — you name it. Like every other network my followers are entrepreneurs so it’s a perfect place for me to engage. And until I persuade more VCs to engage I feel like it’s a playground I have mostly to myself! ", "child": "2422_1\t2422_2\t2422_3\t2422_4"}