{"name": "2423", "parent": "", "title": "Announcing Upfront Ventures’ Newest Partner — Kobie Fuller", "sentences": [{"8c7f": "Announcing Upfront Ventures’ Newest Partner — Kobie Fuller"}, {"5c9a": "Kobie Fuller, Partner at Upfront Ventures"}, {"1b3a": "We set out to build a venture capital firm that would not only be a beacon for the rapidly growing LA tech ecosystem but also one that would compete and collaborate nationally with the best firms in the country."}, {"3018": "To do that you need to have the most talented partners and operating staff because entrepreneurs (and venture capital funds) have choices about whom they will work with and the best deals go to the best firms."}, {"84bc": "That’s why I’m so excited to announce today that we’ve hired Kobie Fuller as a Partner at Upfront Ventures — he will move down to Los Angeles with his wife and 1-year-old son and start later this summer. Kobie joins us from Accel, a firm we deeply respect and have worked closely with over the past few years."}, {"0ab9": "Why Kobie?"}, {"bd1d": "We were looking for somebody who:"}, {"4985": "Kobie scored highly on all fronts."}, {"b56a": "He started his career at Insight Venture Partners in New York (another firm we work closely with) and then spun out with a group of people to create OpenView Venture Partners in Boston. With one single arc he had the chance to experience two great firms with distinct cultures and working practices and did all of this in his 20s."}, {"c90b": "During this period Kobie worked closely with many SaaS companies including ExactTarget from its early days and the Founder & CEO, Scott Dorsey, served as a strong reference for Kobie."}, {"58a4": "Kobie then headed to Los Angeles to join LA-based startup REVOLVE as its CMO where he got his direct operating experience. From REVOLVE Kobie headed up to the Bay Area to join Accel, where he worked for three years before joining Upfront."}, {"98b0": "I worked on two boards with Kobie (Invoca & Osmo) where I got to experience his operating insights and work ethic first hand. Importantly, our entire partnership knew Kobie and there was a strong cultural alignment with his work style, ethos and skills."}, {"1baf": "Kobie worked with several companies while at Accel including Campaign Monitor (run by my good friend Alex Bard), UserTesting, and Emergent VR. He also was an angel investor in Oculus, who was bought by Facebook for $2 billion."}, {"dee6": "Kobie is also a pretty competitive mo-fo and as I discovered in referencing him is still on the all-time leaderboard at Harvard for fastest times in the 200 & 400 meter races. But the real question is … can he beat me at ping pong? I don’t think so."}, {"bc42": "Over the past several years we’ve added talented general partners including Greg Bettinelli and Kara Nortman and anybody who knows us will tell you that our firm has become a lot stronger, broadened our skills & reach and become a lot more cohesive as a result of bringing on world-class talent."}, {"df86": "Today, I’m super proud to announce that we’ve just added another talented partner at Upfront and a great person to boot."}, {"f11d": "Please help me in amplifying this message and in welcoming Kobie to the team on social media."}], "content": "Announcing Upfront Ventures’ Newest Partner — Kobie Fuller Kobie Fuller, Partner at Upfront Ventures We set out to build a venture capital firm that would not only be a beacon for the rapidly growing LA tech ecosystem but also one that would compete and collaborate nationally with the best firms in the country. To do that you need to have the most talented partners and operating staff because entrepreneurs (and venture capital funds) have choices about whom they will work with and the best deals go to the best firms. That’s why I’m so excited to announce today that we’ve hired Kobie Fuller as a Partner at Upfront Ventures — he will move down to Los Angeles with his wife and 1-year-old son and start later this summer. Kobie joins us from Accel, a firm we deeply respect and have worked closely with over the past few years. Why Kobie? We were looking for somebody who: Kobie scored highly on all fronts. He started his career at Insight Venture Partners in New York (another firm we work closely with) and then spun out with a group of people to create OpenView Venture Partners in Boston. With one single arc he had the chance to experience two great firms with distinct cultures and working practices and did all of this in his 20s. During this period Kobie worked closely with many SaaS companies including ExactTarget from its early days and the Founder & CEO, Scott Dorsey, served as a strong reference for Kobie. Kobie then headed to Los Angeles to join LA-based startup REVOLVE as its CMO where he got his direct operating experience. From REVOLVE Kobie headed up to the Bay Area to join Accel, where he worked for three years before joining Upfront. I worked on two boards with Kobie (Invoca & Osmo) where I got to experience his operating insights and work ethic first hand. Importantly, our entire partnership knew Kobie and there was a strong cultural alignment with his work style, ethos and skills. Kobie worked with several companies while at Accel including Campaign Monitor (run by my good friend Alex Bard), UserTesting, and Emergent VR. He also was an angel investor in Oculus, who was bought by Facebook for $2 billion. Kobie is also a pretty competitive mo-fo and as I discovered in referencing him is still on the all-time leaderboard at Harvard for fastest times in the 200 & 400 meter races. But the real question is … can he beat me at ping pong? I don’t think so. Over the past several years we’ve added talented general partners including Greg Bettinelli and Kara Nortman and anybody who knows us will tell you that our firm has become a lot stronger, broadened our skills & reach and become a lot more cohesive as a result of bringing on world-class talent. Today, I’m super proud to announce that we’ve just added another talented partner at Upfront and a great person to boot. Please help me in amplifying this message and in welcoming Kobie to the team on social media. ", "child": "2423_1\t2423_2\t2423_3\t2423_4\t2423_5\t2423_6\t2423_7\t2423_8\t2423_9\t2423_10"}