{"name": "2425", "parent": "", "title": "How Would You Build a Movie Studio if You Started Today?", "sentences": [{"145a": "How Would You Build a Movie Studio if You Started Today?"}, {"63ba": "I met Andrew Stalbow and Petri Järvilehto from Seriously several years ago after they had just left Angry Birds where they were responsible for international business development / licensing and the game studio, respectively."}, {"4cfa": "They had a new company in mind and they posed a question to me"}, {"f351": "“If Walt Disney were to try and build a movie studio from scratch today — how would he do it?”"}, {"8b47": "I took the bait."}, {"35f3": "They told me that if you look at modern studios they have many diverse revenue streams: movies, TV, online media, toys, licensing, video games and so forth. But the idea that you could start a new studio today — with the hundreds of millions required just to launch one blockbuster hit — is absurd."}, {"46eb": "They pointed out that the most successful franchises are built around characters that people fall in love with and the narrative that surrounds their lives. Look at Harry Potter. It started with a series of books and is now a multi-billion dollar franchise with products, theme parks and games."}, {"299d": "Andrew & Petri told me that a modern movie studio would start with video games and then branch out into other media. But the problem with most games companies is that they build products more than character franchises."}, {"26b8": "We bought the narrative and backed the team at Seriously, whose hit first product is called Best Fiends. Since then the product has been downloaded more than 35 million times and has more than 2 million daily players. They are doing tens of millions in revenue and the first product hasn’t even been live for 2 years."}, {"0630": "It has been amazing watching Andrew, Petri and team. What I’ve learned most is that they pay excruciating attention to details that other companies don’t. They hire world-class animators and sweat every detail of the drawings. They pay for composers to create original music."}, {"b5a2": "When they put out toys they did limited edition runs and kept the quality very high. They did several partnership launches with social good campaigns including the World Wildlife Fund and Malaria No More."}, {"c587": "And they have used influencer marketing on YouTube like nobody else I’ve seen, running authentic competitions with top YouTubers including PewDiePie."}, {"ac20": "So every company that I now work with or talk to that has a need for character-based IP — I always direct them to Andrew."}, {"3020": "If you want to learn from Andrew — he’s written a great post on what they’ve been up to. If you work at all in this world I think you’ll really enjoy it and learn from watching where they take the company."}], "content": "How Would You Build a Movie Studio if You Started Today? I met Andrew Stalbow and Petri Järvilehto from Seriously several years ago after they had just left Angry Birds where they were responsible for international business development / licensing and the game studio, respectively. They had a new company in mind and they posed a question to me “If Walt Disney were to try and build a movie studio from scratch today — how would he do it?” I took the bait. They told me that if you look at modern studios they have many diverse revenue streams: movies, TV, online media, toys, licensing, video games and so forth. But the idea that you could start a new studio today — with the hundreds of millions required just to launch one blockbuster hit — is absurd. They pointed out that the most successful franchises are built around characters that people fall in love with and the narrative that surrounds their lives. Look at Harry Potter. It started with a series of books and is now a multi-billion dollar franchise with products, theme parks and games. Andrew & Petri told me that a modern movie studio would start with video games and then branch out into other media. But the problem with most games companies is that they build products more than character franchises. We bought the narrative and backed the team at Seriously, whose hit first product is called Best Fiends. Since then the product has been downloaded more than 35 million times and has more than 2 million daily players. They are doing tens of millions in revenue and the first product hasn’t even been live for 2 years. It has been amazing watching Andrew, Petri and team. What I’ve learned most is that they pay excruciating attention to details that other companies don’t. They hire world-class animators and sweat every detail of the drawings. They pay for composers to create original music. When they put out toys they did limited edition runs and kept the quality very high. They did several partnership launches with social good campaigns including the World Wildlife Fund and Malaria No More. And they have used influencer marketing on YouTube like nobody else I’ve seen, running authentic competitions with top YouTubers including PewDiePie. So every company that I now work with or talk to that has a need for character-based IP — I always direct them to Andrew. If you want to learn from Andrew — he’s written a great post on what they’ve been up to. If you work at all in this world I think you’ll really enjoy it and learn from watching where they take the company. ", "child": "2425_1\t2425_2\t2425_3\t2425_4\t2425_5\t2425_6\t2425_7\t2425_8"}