{"name": "2431", "parent": "", "title": "The Corrosive Nature of Over-Introducers", "sentences": [{"1ca5": "The Corrosive Nature of Over-Introducers"}, {"9ff1": "In modern society we’re all over-worked and over-loaded with information and tasks and to-dos and obligations. Nowhere is this more apparent than working in a startup where you are definitionally under-resourced and trying to make big accomplishments in compressed periods of time."}, {"a5f5": "That’s why focus is critical. Saying “no” often to people who want to divert you from your mission becomes obligatory if you want to make progress. Modern-society is also littered with over-networkers and over-introducers and professional conference attendees. These people are like the friend in college who always tempted you by telling you about the latest party when you were at the library studying."}, {"e5dd": "I find the over-introducers especially corrosive around first-time founders who often struggle with the balance of their time between tasks like building product versus tasks like speaking at conferences or meeting with potential business development partners."}, {"4d0e": "Focus is almost always the right answer. Meeting new people is critical to business success yet you must be judicious with your time."}, {"0243": "It’s human nature to try and be helpful to others. In many instances this help is genuine, well-meaning and productive. Most of us like to help create connections between people for whom an introduction, we believe, would be mutually beneficial."}, {"7abf": "For the respectful person we usually try to assess whether the recipient of the introduction would truly find it useful and we try to filter out unnecessary connections because we know that connecting people creates a time obligation. Many of us go one step further and almost always ask the recipient if it’s ok to do an introduction before we do it. It’s often called the “double opt in” as in you make sure both sides are ok with an introduction before creating it."}, {"ecf0": "Draped under the guise of “being helpful” many super-connectors create flurries of meetings for first-time founders. I try to steer entrepreneurs away from over-introducers and I often find myself wanting to be careful about them becoming an investor in companies I back."}, {"2e5a": "It starts seemingly innocent enough. A person at a board meeting starts listing all the people they know at companies a, b and c. Or an angel investor starts emailing the CEO of a company with all the people they want him or her to meet."}, {"a5f4": "Newer founders are often flattered to make the connections, are not experienced enough to know which people are valuable to meet or are simply too polite to say “no.” It’s hard enough building a valuable product or service in competitive global markets without spending time on unproductive tasks."}, {"6468": "I find over-introducers are often motivated by their own self currency. Showing founders they know important people makes them feel more self important. They assume that helping senior executives meet interesting startup people will show the introduced party that they are tapped in and relevant."}, {"a1af": "Over introducers use this currency liberally because in the absence of any real operating knowledge or without actually taking the time to diagnose what the important issues are at a company and how to truly be helpful, over-introducers fall back on the easiest and often least-productive form of help."}, {"0e69": "I know some will read this as an indictment of all introductions and of course it’s not that. I introduce people constantly and it’s an important part of my job. Each time I carefully consider whether the connection would be helpful to each party and I almost always ask both sides whether it’s ok."}, {"d708": "Mostly I just wanted to write this as a reminder to founders to be suspicious of people who constantly introduce you around. And maybe also a reminder that the library, while infinitely less exciting than the party, is where real breakthroughs occur."}], "content": "The Corrosive Nature of Over-Introducers In modern society we’re all over-worked and over-loaded with information and tasks and to-dos and obligations. Nowhere is this more apparent than working in a startup where you are definitionally under-resourced and trying to make big accomplishments in compressed periods of time. That’s why focus is critical. Saying “no” often to people who want to divert you from your mission becomes obligatory if you want to make progress. Modern-society is also littered with over-networkers and over-introducers and professional conference attendees. These people are like the friend in college who always tempted you by telling you about the latest party when you were at the library studying. I find the over-introducers especially corrosive around first-time founders who often struggle with the balance of their time between tasks like building product versus tasks like speaking at conferences or meeting with potential business development partners. Focus is almost always the right answer. Meeting new people is critical to business success yet you must be judicious with your time. It’s human nature to try and be helpful to others. In many instances this help is genuine, well-meaning and productive. Most of us like to help create connections between people for whom an introduction, we believe, would be mutually beneficial. For the respectful person we usually try to assess whether the recipient of the introduction would truly find it useful and we try to filter out unnecessary connections because we know that connecting people creates a time obligation. Many of us go one step further and almost always ask the recipient if it’s ok to do an introduction before we do it. It’s often called the “double opt in” as in you make sure both sides are ok with an introduction before creating it. Draped under the guise of “being helpful” many super-connectors create flurries of meetings for first-time founders. I try to steer entrepreneurs away from over-introducers and I often find myself wanting to be careful about them becoming an investor in companies I back. It starts seemingly innocent enough. A person at a board meeting starts listing all the people they know at companies a, b and c. Or an angel investor starts emailing the CEO of a company with all the people they want him or her to meet. Newer founders are often flattered to make the connections, are not experienced enough to know which people are valuable to meet or are simply too polite to say “no.” It’s hard enough building a valuable product or service in competitive global markets without spending time on unproductive tasks. I find over-introducers are often motivated by their own self currency. Showing founders they know important people makes them feel more self important. They assume that helping senior executives meet interesting startup people will show the introduced party that they are tapped in and relevant. Over introducers use this currency liberally because in the absence of any real operating knowledge or without actually taking the time to diagnose what the important issues are at a company and how to truly be helpful, over-introducers fall back on the easiest and often least-productive form of help. I know some will read this as an indictment of all introductions and of course it’s not that. I introduce people constantly and it’s an important part of my job. Each time I carefully consider whether the connection would be helpful to each party and I almost always ask both sides whether it’s ok. Mostly I just wanted to write this as a reminder to founders to be suspicious of people who constantly introduce you around. And maybe also a reminder that the library, while infinitely less exciting than the party, is where real breakthroughs occur. ", "child": "2431_1\t2431_2\t2431_3\t2431_4\t2431_5\t2431_6\t2431_7\t2431_8\t2431_9\t2431_10\t2431_11\t2431_12\t2431_13\t2431_14\t2431_15\t2431_16\t2431_17\t2431_18\t2431_19\t2431_20\t2431_21\t2431_22\t2431_23\t2431_24\t2431_25"}