{"name": "2435", "parent": "", "title": "Lead, Follow or Get the Fuck Out of the Way", "sentences": [{"3b33": "Lead, Follow or Get the Fuck Out of the Way"}, {"28ff": "Lead —"}, {"e6c7": "It’s hard to be a real leader. Decisions are never black or white, so most people fudge. The straddle middle grounds to keep everybody happy. They make compromises to try and hold together constituencies. On business decisions they want to hedge their bets so they do a little bit of everything but nothing extremely well."}, {"f379": "As highlighted by Brad Garlinghouse years ago in the famous “peanut butter manifesto”— it’s like spreading peanut butter evenly over a piece of bread. And of course fudging never produces world-class results, so many companies suffer from mediocrity."}, {"a595": "The problem with hard decisions is that you can never make everybody happy. There is always somebody impacted or somebody who thought “plan B” was better. Leadership is about listening to multiple opinions but in the end trusting your instincts and deciding. Leadership is about not worrying about how people will think about you for hard calls. It is about being willing to be wrong."}, {"ca9b": "Leadership, as I’ve pointed out before, is about being respected more than loved."}, {"50ef": "As somebody fortunate enough to spend time with senior people from our tech and investment sectors I can tell you that even at the upper echelons people struggle to make hard decisions and the people willing to forge difficult paths are few and far between."}, {"14bc": "It was not a popular decision at all when Steve Jobs chose to open retail stores. People laughed at Google buying YouTube for $1.65 billion. Evan Spiegel was thought an idiot for not selling Snapchat for $3 billion. Netflix was widely criticized for breaking their business in two."}, {"1d6f": "Leaders have well-formed opinions that go against the grain, the temerity to sell their vision to skeptics, the tenacity to stick to their ideas when they are inevitably criticized, the resiliency to wake every day when they’re being kicked by everybody for their beliefs but also the willingness to look at data and re-chart their course when they got it wrong."}, {"16d5": "Leaders need to be early, have conviction, be persuasive and get others to follow when rational people should not. And trust me, the world is FILLED with naysayers. Whether they succeed or not does not defeat their leadership and willingness to try."}, {"159f": "Follow —"}, {"70ba": "There truly aren’t many leaders, it’s a thankless and stressful job. And leaders aren’t always right and even when they are they don’t always win. And while leaders set direction, of course it is teams that deliver results. The leader can only point and recruit world-class people but the results are owed to the team."}, {"f95d": "In every team you need the majority of people who excel at their job functions. They are great at their respective fields whether they be marketing, sales, programming, PR, whatever. People running these job functions are also leaders — don’t get me wrong — on each team you still need leaders & followers. You simply can’t have a team of people all pulling in different directions and death by a thousand cuts is having multiple departments all moving in their own direction."}, {"cf58": "While the overall leader must set the direction of the top, the goal is each department must be to align the objectives of that group with the overall goals of the organization. When done well companies have a system like OKRs (objectives and key results) or V2MOM (vision, values, methods, obstacles, measures)."}, {"c632": "If an organization and its people won’t align themselves with the direction from the top you will also end up with mediocrity. Only aligned orgs excel."}, {"301e": "Get the Fuck Out of the Way —"}, {"a86b": "Dissent is fine. Dissent actually makes groups stronger. I love being challenged because it forces me to think harder about what my convictions are. I love when people come with ideas that conflict with my world view because the conflict either ends up giving me more confidence in my convictions or helps me to evolve. Sometimes it even causes me to consider revolution."}, {"3a19": "But dissenters need ideas of their own. Dissenters need facts and logic. Dissenters need to be willing to roll up their sleeves and help do the work. Dissenters need to be willing to have their own necks on the chopping block and admit that they were wrong in the end."}, {"24f0": "Dissenters don’t get to be “back benchers.” They don’t get to yell from the peanut gallery but never own results or the consequences of decisions. Dissenters don’t get to second guess but never lead."}, {"df65": "Throughout life I’ve realized that many people are back benchers. “That will never work” is their motto. They like to criticize but they don’t have strong ideas of their own. They “know” what’s wrong but they never do anything about it. They never lead. Yet they don’t follow."}, {"6ba3": "“We’re Doomed. It will never work. We’ll never make it.”"}, {"f92a": "When you spot people like that in your company you have no choice but to part ways with them. If you wake up one day in any organization and you realize that you’re no longer “part of the solution” it’s time to get the fuck out of the way. This is especially true when you’re senior and too many people are looking at how you react to change or when your disbelief undermines the confidence of others."}, {"c980": "When you get the fuck out of the way you either find out that the other leadership was right or you get the chance from the outside to later say they were wrong. But either way you at least let your organization have cohesion in the plan."}, {"362d": "And if you can’t lead, follow or get the fuck out of the way — have the decency to move on to another organization."}], "content": "Lead, Follow or Get the Fuck Out of the Way Lead — It’s hard to be a real leader. Decisions are never black or white, so most people fudge. The straddle middle grounds to keep everybody happy. They make compromises to try and hold together constituencies. On business decisions they want to hedge their bets so they do a little bit of everything but nothing extremely well. As highlighted by Brad Garlinghouse years ago in the famous “peanut butter manifesto”— it’s like spreading peanut butter evenly over a piece of bread. And of course fudging never produces world-class results, so many companies suffer from mediocrity. The problem with hard decisions is that you can never make everybody happy. There is always somebody impacted or somebody who thought “plan B” was better. Leadership is about listening to multiple opinions but in the end trusting your instincts and deciding. Leadership is about not worrying about how people will think about you for hard calls. It is about being willing to be wrong. Leadership, as I’ve pointed out before, is about being respected more than loved. As somebody fortunate enough to spend time with senior people from our tech and investment sectors I can tell you that even at the upper echelons people struggle to make hard decisions and the people willing to forge difficult paths are few and far between. It was not a popular decision at all when Steve Jobs chose to open retail stores. People laughed at Google buying YouTube for $1.65 billion. Evan Spiegel was thought an idiot for not selling Snapchat for $3 billion. Netflix was widely criticized for breaking their business in two. Leaders have well-formed opinions that go against the grain, the temerity to sell their vision to skeptics, the tenacity to stick to their ideas when they are inevitably criticized, the resiliency to wake every day when they’re being kicked by everybody for their beliefs but also the willingness to look at data and re-chart their course when they got it wrong. Leaders need to be early, have conviction, be persuasive and get others to follow when rational people should not. And trust me, the world is FILLED with naysayers. Whether they succeed or not does not defeat their leadership and willingness to try. Follow — There truly aren’t many leaders, it’s a thankless and stressful job. And leaders aren’t always right and even when they are they don’t always win. And while leaders set direction, of course it is teams that deliver results. The leader can only point and recruit world-class people but the results are owed to the team. In every team you need the majority of people who excel at their job functions. They are great at their respective fields whether they be marketing, sales, programming, PR, whatever. People running these job functions are also leaders — don’t get me wrong — on each team you still need leaders & followers. You simply can’t have a team of people all pulling in different directions and death by a thousand cuts is having multiple departments all moving in their own direction. While the overall leader must set the direction of the top, the goal is each department must be to align the objectives of that group with the overall goals of the organization. When done well companies have a system like OKRs (objectives and key results) or V2MOM (vision, values, methods, obstacles, measures). If an organization and its people won’t align themselves with the direction from the top you will also end up with mediocrity. Only aligned orgs excel. Get the Fuck Out of the Way — Dissent is fine. Dissent actually makes groups stronger. I love being challenged because it forces me to think harder about what my convictions are. I love when people come with ideas that conflict with my world view because the conflict either ends up giving me more confidence in my convictions or helps me to evolve. Sometimes it even causes me to consider revolution. But dissenters need ideas of their own. Dissenters need facts and logic. Dissenters need to be willing to roll up their sleeves and help do the work. Dissenters need to be willing to have their own necks on the chopping block and admit that they were wrong in the end. Dissenters don’t get to be “back benchers.” They don’t get to yell from the peanut gallery but never own results or the consequences of decisions. Dissenters don’t get to second guess but never lead. Throughout life I’ve realized that many people are back benchers. “That will never work” is their motto. They like to criticize but they don’t have strong ideas of their own. They “know” what’s wrong but they never do anything about it. They never lead. Yet they don’t follow. “We’re Doomed. It will never work. We’ll never make it.” When you spot people like that in your company you have no choice but to part ways with them. If you wake up one day in any organization and you realize that you’re no longer “part of the solution” it’s time to get the fuck out of the way. This is especially true when you’re senior and too many people are looking at how you react to change or when your disbelief undermines the confidence of others. When you get the fuck out of the way you either find out that the other leadership was right or you get the chance from the outside to later say they were wrong. But either way you at least let your organization have cohesion in the plan. And if you can’t lead, follow or get the fuck out of the way — have the decency to move on to another organization. ", "child": "2435_1\t2435_2\t2435_3\t2435_4\t2435_5\t2435_6\t2435_7\t2435_8\t2435_9\t2435_10\t2435_11\t2435_12\t2435_13\t2435_14\t2435_15\t2435_16\t2435_17\t2435_18\t2435_19\t2435_20\t2435_21\t2435_22\t2435_23\t2435_24\t2435_25"}