{"name": "2438", "parent": "", "title": "I am [enter your age here]. Is that too late to become a developer?", "sentences": [{"b4e2": "I am [enter your age here]. Is that too late to become a developer?"}, {"f70c": "There’s a popular meme going around the developer boot-camp world: “I’m an unborn child. Is that too old to start learning to code?”"}, {"15d2": "Even millennials ask it. Like exposing themselves as a clunky beginner might become an embarrassing fashion statement?"}, {"bdba": "When you turn 30, you have no experience with being 30. Nobody has any experience with the age they become, which means we’re all newbies at life."}, {"d543": "So, if you’re not learning, you’re not living."}, {"2c66": "I’m a sixty-something code-newbie who’s been a product manager and payments expert for several years. I’m here to prove that you’re never too old to start a new challenge like learning to code, or a new career."}, {"0916": "Here’s the thing"}, {"8d92": "Learning and striving to become a developer with some age and business-world experience can result in tremendous advantages. Those benefits will serve both you and the company or client that is going to hire you:"}, {"a736": "1. You have problem-solving creds. Logic comes easier after earning some merit badges in the scout-troop of Life."}, {"234b": "2. You better know the rewards of patience, persistence and practice."}, {"2ac4": "3. You have emotional intelligence. That means you can be a high-performing contributor to a team and get along with everybody."}, {"e77f": "4. You are more equipped to understand customer experience and see the reasons why."}, {"3d47": "5. You contribute to diversity."}, {"489f": "How Older Developers Help Diversity"}, {"2595": "Ageism is one of those biases that most people are not even aware of. Even older folks can be proponents of codger-bias if they refer to themselves as grumpy, stubborn, or obstinate."}, {"6246": "Big news! You’ve got no time for any of that nonsense when scoping an algorithm."}, {"e1bc": "Like the best sports coaches you had in school, older life-seasoned team-mates add the sauce of wisdom to youthful meat. Besides the benefits listed above, they can enhance team collaboration, performance, and mutual trust."}, {"953e": "The tech world needs tons more gender-equality AND diversity, and that means more women, more black and brown skin, more homo-lesbian-trans, and definitely more older folks."}, {"b9f6": "I’m helping to fill two of those buckets — the gays and the grays."}, {"65f3": "My Path to Front End Developer"}, {"8053": "My career as a product manager was not demanding enough creative input. I was not getting the opportunities to put my constant self-learning and self-acquired business knowledge to full use."}, {"a5ee": "One day, I got turned down for a new role because I lacked web and mobile experience. And that was when I decided to switch my focus to learning some really hard stuff."}, {"6fa8": "The first online course was One Month Rails and I got my first exposure to Bash, Sublime Text, and GitHub. Then in one of their HTML courses, I coded my first static page and put it up on the web."}, {"5c14": "Later, I taught myself how to wire-frame a mobile app and took a course from Udemy to try and build it in Swift code (not easy)."}, {"d38a": "At that point about a year ago, I pivoted to Free Code Camp and haven’t stopped growing. I believe it’s the best free online training for web development, because it teaches you how easy it is to swallow lessons and how hard it is to cough up real projects and algorithms."}, {"3387": "Six months later, I paused my Free Code Camp assignments to help two startups with design ideas (for free)."}, {"97df": "From that, I expanded my FCC portfolio-page project to a live site."}, {"4696": "I put in screenshots of my design concepts, simple web sites, and a company video."}, {"8523": "I learned how to add Google Analytics, meta tags, the Facebook share button, and a whole lot more."}, {"7535": "Last month, something interesting happened to speed things up: I got my first paid freelance-developer gig from a friend who owns a small local business. You’ll be able to see it later in my portfolio."}, {"6a5e": "I also found a great community called CodeNewbies and attended their amazing Codeland conference in New York City. More about that to come."}, {"5fcb": "So what have I learned from learning to code?"}, {"9957": "Besides renewed clarity of purpose and creative excitement, here are five practical observations that have sunk in for me:"}, {"4389": "1. Free (and almost free) resources are endless. I determined not to consider a paid boot camp until I had exhausted everything free on the Internet. Yet, the more I know, the farther this free supply appears to stretch."}, {"b14e": "2. The coder ecosphere is a giving community, and I’m drawn to a culture like that. It rewards and commends smart people who give away knowledge for the good of all. And we must thank Google and others like them. The Big G might be the largest money machine in history, but it provides the world a lot of free knowledge."}, {"34d5": "3. Making stuff is the real learning. The hard part is the valuable part. The goal is learning enough to create the evidence that you can — and will — get paid to make good stuff every day. So, do that now."}, {"c770": "4. Learning to code improves sensory and short-term memory. Before this, I couldn’t recall a phone number past five-seconds. No more. It feels like my eye-to-brain coordination has gotten more “imprintable”. Staring at JQuery functions and color-picking hex codes may do that for you."}, {"b7d9": "Note: Millennials may not get this concept. Being the first babies born after the invention of video games, many grew up with a natural eye-hand cognitive congruity. When Mark Zuckerberg stated that “Young people are just smarter,” this might be what he meant."}, {"da1b": "And my final point:"}, {"626a": "5. Learning to code makes you smarter and younger. This has been my experience over the past year with Free Code Camp, Hack Reactor prep, and completing projects. Yeah, some paperwork says I’m older than everybody in the room, but who cares. I have value to give the world and nothing to lose."}, {"ecf3": "So listen-up, kids (and everybody else). Forget about “too old” to learn to code, because it’s never too late. Clunky beginners are cool!"}, {"438c": "Please share this with all your Medium friends and hit that ❤ button to encourage more newbies of every age."}], "content": "I am [enter your age here]. Is that too late to become a developer? There’s a popular meme going around the developer boot-camp world: “I’m an unborn child. Is that too old to start learning to code?” Even millennials ask it. Like exposing themselves as a clunky beginner might become an embarrassing fashion statement? When you turn 30, you have no experience with being 30. Nobody has any experience with the age they become, which means we’re all newbies at life. So, if you’re not learning, you’re not living. I’m a sixty-something code-newbie who’s been a product manager and payments expert for several years. I’m here to prove that you’re never too old to start a new challenge like learning to code, or a new career. Here’s the thing Learning and striving to become a developer with some age and business-world experience can result in tremendous advantages. Those benefits will serve both you and the company or client that is going to hire you: 1. You have problem-solving creds. Logic comes easier after earning some merit badges in the scout-troop of Life. 2. You better know the rewards of patience, persistence and practice. 3. You have emotional intelligence. That means you can be a high-performing contributor to a team and get along with everybody. 4. You are more equipped to understand customer experience and see the reasons why. 5. You contribute to diversity. How Older Developers Help Diversity Ageism is one of those biases that most people are not even aware of. Even older folks can be proponents of codger-bias if they refer to themselves as grumpy, stubborn, or obstinate. Big news! You’ve got no time for any of that nonsense when scoping an algorithm. Like the best sports coaches you had in school, older life-seasoned team-mates add the sauce of wisdom to youthful meat. Besides the benefits listed above, they can enhance team collaboration, performance, and mutual trust. The tech world needs tons more gender-equality AND diversity, and that means more women, more black and brown skin, more homo-lesbian-trans, and definitely more older folks. I’m helping to fill two of those buckets — the gays and the grays. My Path to Front End Developer My career as a product manager was not demanding enough creative input. I was not getting the opportunities to put my constant self-learning and self-acquired business knowledge to full use. One day, I got turned down for a new role because I lacked web and mobile experience. And that was when I decided to switch my focus to learning some really hard stuff. The first online course was One Month Rails and I got my first exposure to Bash, Sublime Text, and GitHub. Then in one of their HTML courses, I coded my first static page and put it up on the web. Later, I taught myself how to wire-frame a mobile app and took a course from Udemy to try and build it in Swift code (not easy). At that point about a year ago, I pivoted to Free Code Camp and haven’t stopped growing. I believe it’s the best free online training for web development, because it teaches you how easy it is to swallow lessons and how hard it is to cough up real projects and algorithms. Six months later, I paused my Free Code Camp assignments to help two startups with design ideas (for free). From that, I expanded my FCC portfolio-page project to a live site. I put in screenshots of my design concepts, simple web sites, and a company video. I learned how to add Google Analytics, meta tags, the Facebook share button, and a whole lot more. Last month, something interesting happened to speed things up: I got my first paid freelance-developer gig from a friend who owns a small local business. You’ll be able to see it later in my portfolio. I also found a great community called CodeNewbies and attended their amazing Codeland conference in New York City. More about that to come. So what have I learned from learning to code? Besides renewed clarity of purpose and creative excitement, here are five practical observations that have sunk in for me: 1. Free (and almost free) resources are endless. I determined not to consider a paid boot camp until I had exhausted everything free on the Internet. Yet, the more I know, the farther this free supply appears to stretch. 2. The coder ecosphere is a giving community, and I’m drawn to a culture like that. It rewards and commends smart people who give away knowledge for the good of all. And we must thank Google and others like them. The Big G might be the largest money machine in history, but it provides the world a lot of free knowledge. 3. Making stuff is the real learning. The hard part is the valuable part. The goal is learning enough to create the evidence that you can — and will — get paid to make good stuff every day. So, do that now. 4. Learning to code improves sensory and short-term memory. Before this, I couldn’t recall a phone number past five-seconds. No more. It feels like my eye-to-brain coordination has gotten more “imprintable”. Staring at JQuery functions and color-picking hex codes may do that for you. Note: Millennials may not get this concept. Being the first babies born after the invention of video games, many grew up with a natural eye-hand cognitive congruity. When Mark Zuckerberg stated that “Young people are just smarter,” this might be what he meant. And my final point: 5. Learning to code makes you smarter and younger. This has been my experience over the past year with Free Code Camp, Hack Reactor prep, and completing projects. Yeah, some paperwork says I’m older than everybody in the room, but who cares. I have value to give the world and nothing to lose. So listen-up, kids (and everybody else). Forget about “too old” to learn to code, because it’s never too late. Clunky beginners are cool! Please share this with all your Medium friends and hit that ❤ button to encourage more newbies of every age. ", "child": "2438_1\t2438_2\t2438_3\t2438_4\t2438_5\t2438_6\t2438_7\t2438_8\t2438_9\t2438_10\t2438_11\t2438_12\t2438_132438_1\t2438_2\t2438_3\t2438_4\t2438_5\t2438_6\t2438_7\t2438_8\t2438_9\t2438_10\t2438_11\t2438_12\t2438_13"}