{"name": "2444", "parent": "", "title": "This Is Your Life in Silicon Valley", "sentences": [{"4d8a": "Silicon Valley. Photo by Vadim Kurland."}, {"9b9c": "This Is Your Life in Silicon Valley"}, {"be0b": "UPDATE — 02/06/17: Just released the latest in this series."}, {"fb7b": "You wake up at 6:30 a.m. after an Ambien-induced sleep. It’s Friday. Last night at the Rosewood was pretty intense — you had to check out Madera and see if there is any truth to the long-running Silicon Valley rumors. You were disappointed, but at least you did get to see a few GPs from prominent VC firms at the bar. Did they notice you? Did you make eye contact? You remind yourself that they are not real celebrities — only well known in a 15-mile radius to the TechCrunch-reading crowd."}, {"c844": "Your non-English-speaking nanny shows up at 7:30 a.m. on the nose. You are paying her $24/hour and entrusting her (and Daniel the Tiger) with raising your child. You tell yourself that it’s OK for now. When he’s old enough, he’ll (someday) be in public school in the Palo Alto Unified School District."}, {"aa47": "You commit to being a better parent this weekend and spending more quality time with him as you browse through the latest headlines on Flipboard. You recently realized he may not be the next Mark Zuckerberg after all, but still you send him to a music school even though he’s only three. You swear he’s a genius, because he can say a few four-syllable words and can clap perfectly to the beat of “Call Me Maybe.” He’s special. He is destined for greatness, and you’ll make sure he achieves every ounce of it. After all, both of you are so smart and accomplished."}, {"86cf": "California Academy of Sciences. Photo by Brook Peterson."}, {"0468": "You ask your nanny if she has any availability to watch your son this weekend. Bummer — you wish the California Academy of Sciences hadn’t sold you on the annual pass 11 months ago. You figured you’d be going there every weekend but only ended up going the one time. Not a break-even proposition for you."}, {"1507": "Your Wi-Fi-enabled coffee maker downloads the perfect instructions on how to brew a cup of Blue Bottle — and you don’t have to do anything. The Roomba purrs in the background while you continue to read from your smartphone. You see a few articles about Trump and how crazy he is. Somehow this comforts you."}, {"89ee": "You decide to share an article about Brexit from The Atlantic, which will somehow shed light to all your friends as to why it happened. The article is 1,000 words long — you read only half of it, but that’s good enough. It captures all the arguments you’ve been wanting to make for the past two months to your friends. Will this be the Facebook post that finally spurs your friends into action? You realize your Facebook friends all agree with your political views and social views already."}, {"b7af": "After 15 minutes, it’s gotten only three likes — better luck next time. The Facebook News Feed algorithm totally fucked you — you should have shared from your browser, not your phone, and perhaps at a more optimal time."}, {"61fd": "But then you realize that another friend already shared the article. You feel stupid."}, {"2528": "The YouTube office in San Bruno. Photo by Travis Wise."}, {"e79a": "Your spouse hurriedly gets ready for work. You are a two-income family, and you have to be one for now. The spreadsheet shows that with only three more years of savings, you can finally afford that two-bedroom condo in San Bruno. So what if the weather is shitty 340 days out of the year? At least you’ll be a homeowner in the Bay Area, and nothing says you’ve “made it” like being able to afford a down payment. Besides, San Bruno is “up and coming,” and YouTube has an office there."}, {"04b8": "Your commute to work sucks, but at least it’s an opportunity to catch up on podcasts, so you can have great conversations over cocktails with your friends. Should you listen to Serial Season 2 today? Or should you listen to that amazing StartUp podcast? So many choices, so little time. You instead decide to expand your horizons by trying a new playlist on Spotify — something about Indian-infused jazz music. It sounds great. It makes you feel cultured."}, {"cd30": "You decide to park your car using Luxe today. You justify it to yourself by saying that parking garages are only $10 less expensive. And you have to spend all that time walking back and forth. And besides — today you are meeting some friends after work for dinner, and you’ll be on the other end of town. You can’t decide whether you’ll take Uber or Lyft to the dinner from your office — decisions, decisions."}, {"f452": "You are the director of business development at your start-up. You aren’t even sure what that means, but the start-up seems to be doing well. Your company recently raised a round and was featured in TechCrunch. You have 5,000 stock options. You aren’t exactly sure what that means, but that must be good. If you exit, maybe that will mean money toward a down payment."}, {"6d20": "Your day starts at Salesforce. You have to e-mail a bunch of people. You briefly contemplate a business idea you have that will totally kill Salesforce and Facebook at the same time. But you need a technical cofounder. Eventually, you’ll get to it — after all, you’re smart and destined for greatness yourself. And your friends all tell you how you should start something someday."}, {"b13f": "Your 27-year-old CEO calls an ad-hoc all-hands meeting and regales about company culture and how your mission is to “kill e-mail because it’s broken.” He wants to make every enterprise company in the world switches to your product. He’s never worked for an enterprise company or any other company at all."}, {"8a3e": "The sales team got rowdy the night before. They missed their quota, but it was not their fault — it was implementation’s fault for fucking up a major deal. Also, marketing didn’t send them enough inbound leads for them to hit quota. Maybe next quarter. You trade e-mails with your college buddies on Gmail about how ridiculous Kevin Durant is for joining the Warriors. You come to realize that e-mail is working just fine for you. You feel depressed for a moment. Your summer intern is trying to figure out a Snapchat strategy."}, {"86c1": "Philz Coffee. Photo by Rick."}, {"8562": "It’s time for that afternoon coffee to keep you going through the day. You head over to Philz with some coworkers. You order a vegan donut and very clearly ask the barista for three Splendas. He is clearly a Splenda short, but the line is long, and you want to be civil. You are above mentioning something like this to the barista — you let it pass and feel a “micro aggression” bubbling inside."}, {"d1d0": "You have to decide where to go for dinner tonight. You look at Yelp for a place that’s within one mile and is rated at least three and a half stars. But really you’re looking for something four-stars-plus and at least $$$. What will your friends think of you if you pick a place that’s too cheap? But you also don’t want to go $$$$ because that’s too expensive. You have good taste. This comforts you."}, {"9f53": "You realize your reservation with your spouse at the French Laundry is coming up this weekend. Your calendar app reminds you of this. You’ve been looking forward to it for months. You can’t wait to take perfectly Instagrammed photos of the meal to go along with your perfectly Instagrammed life."}, {"2951": "#San Francisco is trending on Twitter. You realize the San Francisco journalism community is angry about something — they are full of rage at the way a homeless person is being treated. The reporters all share photos and videos of the homeless person, but no one talks to him."}, {"ae65": "It’s time for some afternoon Facebook browsing. Your friends are all doing SO well. You are secretly jealous of your friend who just bought a house in Noe Valley. You speculate as to how rich they must be after their exit from LinkedIn. Even though they were only employee #500, they must have done well. You briefly try to do the math in your head. Maybe that can be you at your current start-up. It’s only a matter of time."}, {"8f24": "More browsing. One friend was employee #5 at a company that just sold to Twitter. They must have made so much money, you think. You like the status update, but you are jealous. Another friend’s kid seems to be more advanced than your kid based on the Vine they just shared of them playing the piano. Damnit, need to be a better parent."}, {"f108": "You go to Redfin to see how much they paid for their house."}, {"0be6": "You briefly daydream about how you once had an opportunity to work at Google pre-IPO. And that you could have joined Facebook right after IPO. And imagine that — the stock price has tripled in a short amount of time. Would that have been the big break you needed?"}, {"0390": "Your CEO grabs you in a panic and asks you to do a quick analysis for a board member. The board member was base-jumping in Mexico and panicked about something related to burn rate and strategy. The CEO’s job is at risk."}, {"0e6f": "Microsoft Excel. Photo by Collin Anderson."}, {"e182": "You do the grunt work and analysis, and finish it just in time for him to breathe a sigh of relief and tell you what an “Excel ninja” you are. Your analysis makes you realize that the company maybe should have saved money on office space, and perhaps the rock-climbing wall and Segways. You realize that your CEO knows nothing about your business."}, {"7717": "Your mind briefly drifts off, and you ask yourself, “Is this all really worth it? Should I move to Seattle, Austin or maybe even Florida?” After all, there is no state tax, and you could have a great quality of life there with an actual house with your beautiful family."}, {"a9f4": "You browse Redfin again. Hmmm. Maybe not Austin. What about something less ambitious, like Fremont, Morgan Hill or Milpitas? That wouldn’t solve your commute problems, you think. It would be more affordable, though."}, {"97be": "Delicious-looking cupcakes. Photo by Frederic Bisson."}, {"7549": "You know what? If you move to Austin, you could somehow get by. After all, your spouse is so amazing at baking. She could easily make a living selling her cupcakes. She has so much talent as a cook, and you could afford culinary school. Worst case, she also has an amazing knack for craft jewelry. The three pieces she sold on Etsy last month are evidence of that. How talented both of you are."}, {"d47f": "And, hey, if you move to Austin, you can finally build that home with a “Zen minimalist” theme you’ve been dreaming of. You go to Blu Homes’ website — their design aesthetic perfectly matches yours. You just need to save the money to make it happen. You browse Pinterest and Houzz for ideas on how to decorate the interior. Is red or navy blue too bold of a color? You don’t know. Maybe you should use an on-demand service for that."}, {"44d3": "You forgot to order groceries, and the nanny needs milk for your kid ASAP. She texts you frantically in broken English. Thank goodness for Instacart. You spend $10 in delivery costs, and you need to add a bunch of items to your cart to hit the minimum threshold. You add a few squeezies, some bananas and a few artisan cheeses to hit the mark. You realize you haven’t stepped into a grocery store for months — but don’t worry, your opportunity cost of time is way too high at the moment. Especially if you factor in those stock options."}, {"49bd": "Almost time for dinner. You are having dinner tonight with the “chief hacking officer” at the company and the “VP of awesomeness.” You arrive at the restaurant, and they marvel at your taste — nice job surfing Yelp."}, {"e570": "Your dinner conversation centers on how autonomous vehicles are going to be better in the long run than ordinary cars for a variety of reasons. And something about how Elon Musk handles meetings. You are all too busy making your own points and citing articles to really listen to each other. You order the $17 risotto and the $9 glass of Pleasanton-brewed IPA."}, {"50d7": "On your ride home, you find the time to catch up on the Malcolm Gladwell podcast. What an interesting guy he is. He’s so smart, and he makes you think about things."}, {"1211": "After coming home, you briefly use that “seven-minute workout” app, which scientists have proven is way more effective than a one-hour cardio workout. You got your exercise in for the day — nice work."}, {"fe77": "You and your spouse get ready for bed. What’s in your Netflix queue? Well, you have to catch up on Making a Murderer since it’s been all over the news for so long. And let’s not get too far behind on Mr. Robot, since it’s so critically acclaimed. For lighter fare, and if you have time, you can always try Last Week Tonight. John Oliver always says exactly what you’re thinking in your head — just funnier than you would have said it."}, {"52a2": "You quietly shuffle to bed, tired from the long, hard day. You check your e-mail, Twitter, Facebook and Snapchat one last time before bedtime. You don’t think you’ll have enough energy to check LinkedIn today — and besides, their mobile UI is not very good. Maybe you can start a company that will disrupt LinkedIn? They did just sell for a bunch of money, after all."}, {"78fa": "Your last thought before bed: should you switch to the Android ecosystem? You are on the “S” iPhone replacement cycle, and you are getting impatient. But then you realize you are so heavily invested in the Apple ecosystem that it may not make sense."}, {"e032": "Vipassana Retreat. Photo by kinnla."}, {"d72b": "You briefly use mobile Safari to browse for Vipassana retreats. You hear a 10-day retreat in Soquel may be the ticket to shake things up. You realize it’s not going to be possible. You download a meditation app. You turn it off. You don’t have time."}, {"f0a2": "You briefly recall your ride home on the 280 tonight. The sun was setting. It was beautiful. You realize you live in paradise."}], "content": "Silicon Valley. Photo by Vadim Kurland. This Is Your Life in Silicon Valley UPDATE — 02/06/17: Just released the latest in this series. You wake up at 6:30 a.m. after an Ambien-induced sleep. It’s Friday. Last night at the Rosewood was pretty intense — you had to check out Madera and see if there is any truth to the long-running Silicon Valley rumors. You were disappointed, but at least you did get to see a few GPs from prominent VC firms at the bar. Did they notice you? Did you make eye contact? You remind yourself that they are not real celebrities — only well known in a 15-mile radius to the TechCrunch-reading crowd. Your non-English-speaking nanny shows up at 7:30 a.m. on the nose. You are paying her $24/hour and entrusting her (and Daniel the Tiger) with raising your child. You tell yourself that it’s OK for now. When he’s old enough, he’ll (someday) be in public school in the Palo Alto Unified School District. You commit to being a better parent this weekend and spending more quality time with him as you browse through the latest headlines on Flipboard. You recently realized he may not be the next Mark Zuckerberg after all, but still you send him to a music school even though he’s only three. You swear he’s a genius, because he can say a few four-syllable words and can clap perfectly to the beat of “Call Me Maybe.” He’s special. He is destined for greatness, and you’ll make sure he achieves every ounce of it. After all, both of you are so smart and accomplished. California Academy of Sciences. Photo by Brook Peterson. You ask your nanny if she has any availability to watch your son this weekend. Bummer — you wish the California Academy of Sciences hadn’t sold you on the annual pass 11 months ago. You figured you’d be going there every weekend but only ended up going the one time. Not a break-even proposition for you. Your Wi-Fi-enabled coffee maker downloads the perfect instructions on how to brew a cup of Blue Bottle — and you don’t have to do anything. The Roomba purrs in the background while you continue to read from your smartphone. You see a few articles about Trump and how crazy he is. Somehow this comforts you. You decide to share an article about Brexit from The Atlantic, which will somehow shed light to all your friends as to why it happened. The article is 1,000 words long — you read only half of it, but that’s good enough. It captures all the arguments you’ve been wanting to make for the past two months to your friends. Will this be the Facebook post that finally spurs your friends into action? You realize your Facebook friends all agree with your political views and social views already. After 15 minutes, it’s gotten only three likes — better luck next time. The Facebook News Feed algorithm totally fucked you — you should have shared from your browser, not your phone, and perhaps at a more optimal time. But then you realize that another friend already shared the article. You feel stupid. The YouTube office in San Bruno. Photo by Travis Wise. Your spouse hurriedly gets ready for work. You are a two-income family, and you have to be one for now. The spreadsheet shows that with only three more years of savings, you can finally afford that two-bedroom condo in San Bruno. So what if the weather is shitty 340 days out of the year? At least you’ll be a homeowner in the Bay Area, and nothing says you’ve “made it” like being able to afford a down payment. Besides, San Bruno is “up and coming,” and YouTube has an office there. Your commute to work sucks, but at least it’s an opportunity to catch up on podcasts, so you can have great conversations over cocktails with your friends. Should you listen to Serial Season 2 today? Or should you listen to that amazing StartUp podcast? So many choices, so little time. You instead decide to expand your horizons by trying a new playlist on Spotify — something about Indian-infused jazz music. It sounds great. It makes you feel cultured. You decide to park your car using Luxe today. You justify it to yourself by saying that parking garages are only $10 less expensive. And you have to spend all that time walking back and forth. And besides — today you are meeting some friends after work for dinner, and you’ll be on the other end of town. You can’t decide whether you’ll take Uber or Lyft to the dinner from your office — decisions, decisions. You are the director of business development at your start-up. You aren’t even sure what that means, but the start-up seems to be doing well. Your company recently raised a round and was featured in TechCrunch. You have 5,000 stock options. You aren’t exactly sure what that means, but that must be good. If you exit, maybe that will mean money toward a down payment. Your day starts at Salesforce. You have to e-mail a bunch of people. You briefly contemplate a business idea you have that will totally kill Salesforce and Facebook at the same time. But you need a technical cofounder. Eventually, you’ll get to it — after all, you’re smart and destined for greatness yourself. And your friends all tell you how you should start something someday. Your 27-year-old CEO calls an ad-hoc all-hands meeting and regales about company culture and how your mission is to “kill e-mail because it’s broken.” He wants to make every enterprise company in the world switches to your product. He’s never worked for an enterprise company or any other company at all. The sales team got rowdy the night before. They missed their quota, but it was not their fault — it was implementation’s fault for fucking up a major deal. Also, marketing didn’t send them enough inbound leads for them to hit quota. Maybe next quarter. You trade e-mails with your college buddies on Gmail about how ridiculous Kevin Durant is for joining the Warriors. You come to realize that e-mail is working just fine for you. You feel depressed for a moment. Your summer intern is trying to figure out a Snapchat strategy. Philz Coffee. Photo by Rick. It’s time for that afternoon coffee to keep you going through the day. You head over to Philz with some coworkers. You order a vegan donut and very clearly ask the barista for three Splendas. He is clearly a Splenda short, but the line is long, and you want to be civil. You are above mentioning something like this to the barista — you let it pass and feel a “micro aggression” bubbling inside. You have to decide where to go for dinner tonight. You look at Yelp for a place that’s within one mile and is rated at least three and a half stars. But really you’re looking for something four-stars-plus and at least $$$. What will your friends think of you if you pick a place that’s too cheap? But you also don’t want to go $$$$ because that’s too expensive. You have good taste. This comforts you. You realize your reservation with your spouse at the French Laundry is coming up this weekend. Your calendar app reminds you of this. You’ve been looking forward to it for months. You can’t wait to take perfectly Instagrammed photos of the meal to go along with your perfectly Instagrammed life. #San Francisco is trending on Twitter. You realize the San Francisco journalism community is angry about something — they are full of rage at the way a homeless person is being treated. The reporters all share photos and videos of the homeless person, but no one talks to him. It’s time for some afternoon Facebook browsing. Your friends are all doing SO well. You are secretly jealous of your friend who just bought a house in Noe Valley. You speculate as to how rich they must be after their exit from LinkedIn. Even though they were only employee #500, they must have done well. You briefly try to do the math in your head. Maybe that can be you at your current start-up. It’s only a matter of time. More browsing. One friend was employee #5 at a company that just sold to Twitter. They must have made so much money, you think. You like the status update, but you are jealous. Another friend’s kid seems to be more advanced than your kid based on the Vine they just shared of them playing the piano. Damnit, need to be a better parent. You go to Redfin to see how much they paid for their house. You briefly daydream about how you once had an opportunity to work at Google pre-IPO. And that you could have joined Facebook right after IPO. And imagine that — the stock price has tripled in a short amount of time. Would that have been the big break you needed? Your CEO grabs you in a panic and asks you to do a quick analysis for a board member. The board member was base-jumping in Mexico and panicked about something related to burn rate and strategy. The CEO’s job is at risk. Microsoft Excel. Photo by Collin Anderson. You do the grunt work and analysis, and finish it just in time for him to breathe a sigh of relief and tell you what an “Excel ninja” you are. Your analysis makes you realize that the company maybe should have saved money on office space, and perhaps the rock-climbing wall and Segways. You realize that your CEO knows nothing about your business. Your mind briefly drifts off, and you ask yourself, “Is this all really worth it? Should I move to Seattle, Austin or maybe even Florida?” After all, there is no state tax, and you could have a great quality of life there with an actual house with your beautiful family. You browse Redfin again. Hmmm. Maybe not Austin. What about something less ambitious, like Fremont, Morgan Hill or Milpitas? That wouldn’t solve your commute problems, you think. It would be more affordable, though. Delicious-looking cupcakes. Photo by Frederic Bisson. You know what? If you move to Austin, you could somehow get by. After all, your spouse is so amazing at baking. She could easily make a living selling her cupcakes. She has so much talent as a cook, and you could afford culinary school. Worst case, she also has an amazing knack for craft jewelry. The three pieces she sold on Etsy last month are evidence of that. How talented both of you are. And, hey, if you move to Austin, you can finally build that home with a “Zen minimalist” theme you’ve been dreaming of. You go to Blu Homes’ website — their design aesthetic perfectly matches yours. You just need to save the money to make it happen. You browse Pinterest and Houzz for ideas on how to decorate the interior. Is red or navy blue too bold of a color? You don’t know. Maybe you should use an on-demand service for that. You forgot to order groceries, and the nanny needs milk for your kid ASAP. She texts you frantically in broken English. Thank goodness for Instacart. You spend $10 in delivery costs, and you need to add a bunch of items to your cart to hit the minimum threshold. You add a few squeezies, some bananas and a few artisan cheeses to hit the mark. You realize you haven’t stepped into a grocery store for months — but don’t worry, your opportunity cost of time is way too high at the moment. Especially if you factor in those stock options. Almost time for dinner. You are having dinner tonight with the “chief hacking officer” at the company and the “VP of awesomeness.” You arrive at the restaurant, and they marvel at your taste — nice job surfing Yelp. Your dinner conversation centers on how autonomous vehicles are going to be better in the long run than ordinary cars for a variety of reasons. And something about how Elon Musk handles meetings. You are all too busy making your own points and citing articles to really listen to each other. You order the $17 risotto and the $9 glass of Pleasanton-brewed IPA. On your ride home, you find the time to catch up on the Malcolm Gladwell podcast. What an interesting guy he is. He’s so smart, and he makes you think about things. After coming home, you briefly use that “seven-minute workout” app, which scientists have proven is way more effective than a one-hour cardio workout. You got your exercise in for the day — nice work. You and your spouse get ready for bed. What’s in your Netflix queue? Well, you have to catch up on Making a Murderer since it’s been all over the news for so long. And let’s not get too far behind on Mr. Robot, since it’s so critically acclaimed. For lighter fare, and if you have time, you can always try Last Week Tonight. John Oliver always says exactly what you’re thinking in your head — just funnier than you would have said it. You quietly shuffle to bed, tired from the long, hard day. You check your e-mail, Twitter, Facebook and Snapchat one last time before bedtime. You don’t think you’ll have enough energy to check LinkedIn today — and besides, their mobile UI is not very good. Maybe you can start a company that will disrupt LinkedIn? They did just sell for a bunch of money, after all. Your last thought before bed: should you switch to the Android ecosystem? You are on the “S” iPhone replacement cycle, and you are getting impatient. But then you realize you are so heavily invested in the Apple ecosystem that it may not make sense. Vipassana Retreat. Photo by kinnla. You briefly use mobile Safari to browse for Vipassana retreats. You hear a 10-day retreat in Soquel may be the ticket to shake things up. You realize it’s not going to be possible. You download a meditation app. You turn it off. You don’t have time. You briefly recall your ride home on the 280 tonight. The sun was setting. It was beautiful. You realize you live in paradise. ", "child": "2444_1\t2444_2\t2444_3\t2444_4\t2444_5\t2444_6\t2444_7\t2444_8\t2444_9\t2444_10\t2444_11\t2444_12\t2444_13\t2444_14\t2444_15\t2444_16\t2444_17\t2444_18\t2444_19\t2444_20\t2444_21\t2444_22\t2444_23\t2444_24\t2444_25"}