{"name": "2455", "parent": "", "title": "An Impossibly Detailed Breakdown of All the Hidden Meanings on ‘Damn.’", "sentences": [{"fb4d": "An Impossibly Detailed Breakdown of All the Hidden Meanings on ‘Damn.’"}, {"2679": "If you look hard enough, you can figure out exactly who Kendrick Lamar is dissing. (Hint: It’s the Pope, and also Joel Embiid.)"}, {"72d0": "I. The Hunt"}, {"542b": "A Kendrick Lamar song is never just a Kendrick Lamar song. It’s always a puzzle, a riddle, a murder mystery, a quandary, an enigma. It’s a maze so tightly wound that it’s nearly impossible to find its center. He says a thing, and it means the thing it means, yes, but also it means a different thing, but actually it means a Different Thing, but really it means a different thing, but truly it means a d-i-f-f-e-r-e-n-t thing. And it’s not just the songs, either. It’s all of the surrounding pieces, too. It’s why people spend so much time perusing his stuff and TDE’s stuff (that’s Kendrick’s label) looking for Easter eggs. Was that a shot at Drake? Was that a shot at Sean? Is there a secret album coming? On and on. I’ll give you a recent example, which I read about in the sidebar of the Genius page for “Humble.”"}, {"ebe9": "Shortly after the video for “Humble.” came out, Dave Free (the president of TDE) tweeted “No interview.” It seemed simple enough — it was probably a preemptive “Hey, media, don’t ask to schedule an interview with Kendrick right now because we’re not interested in doing one” thing. That’s an easy thing to understand. BUUUUUUUUUT, maybe not. Because there’s also a way where, if you squint a tiny amount, it looks a lot like it’s a sneaky shot at Big Sean (a frequent sparring mate for Kendrick), given that Sean released a song called “No More Interviews” last year that took a not-that-subtle shot at Kendrick."}, {"308c": "But that’s the kind of stuff that happens when Kendrick does a thing, like release a new song or appear in a commercial or tweet or breathe or exist."}, {"f1a5": "Or put out a new album."}, {"5f95": "II. The Spoils"}, {"4c3e": "Not including his usual targets (rappers, I mean), Kendrick took shots at 51 people/things/ideas on Damn., many of them so slick and so smooth that they’re almost impossible to grab hold of. They are all included below."}, {"6c3f": "(Pixar)"}, {"0246": "(Sean Mack)"}, {"b19f": "(Sean Mack)"}, {"1cfa": "III. The Summary"}, {"d844": "Nobody is safe from Kendrick. May God protect us all."}], "content": "An Impossibly Detailed Breakdown of All the Hidden Meanings on ‘Damn.’ If you look hard enough, you can figure out exactly who Kendrick Lamar is dissing. (Hint: It’s the Pope, and also Joel Embiid.) I. The Hunt A Kendrick Lamar song is never just a Kendrick Lamar song. It’s always a puzzle, a riddle, a murder mystery, a quandary, an enigma. It’s a maze so tightly wound that it’s nearly impossible to find its center. He says a thing, and it means the thing it means, yes, but also it means a different thing, but actually it means a Different Thing, but really it means a different thing, but truly it means a d-i-f-f-e-r-e-n-t thing. And it’s not just the songs, either. It’s all of the surrounding pieces, too. It’s why people spend so much time perusing his stuff and TDE’s stuff (that’s Kendrick’s label) looking for Easter eggs. Was that a shot at Drake? Was that a shot at Sean? Is there a secret album coming? On and on. I’ll give you a recent example, which I read about in the sidebar of the Genius page for “Humble.” Shortly after the video for “Humble.” came out, Dave Free (the president of TDE) tweeted “No interview.” It seemed simple enough — it was probably a preemptive “Hey, media, don’t ask to schedule an interview with Kendrick right now because we’re not interested in doing one” thing. That’s an easy thing to understand. BUUUUUUUUUT, maybe not. Because there’s also a way where, if you squint a tiny amount, it looks a lot like it’s a sneaky shot at Big Sean (a frequent sparring mate for Kendrick), given that Sean released a song called “No More Interviews” last year that took a not-that-subtle shot at Kendrick. But that’s the kind of stuff that happens when Kendrick does a thing, like release a new song or appear in a commercial or tweet or breathe or exist. Or put out a new album. II. The Spoils Not including his usual targets (rappers, I mean), Kendrick took shots at 51 people/things/ideas on Damn., many of them so slick and so smooth that they’re almost impossible to grab hold of. They are all included below. (Pixar) (Sean Mack) (Sean Mack) III. The Summary Nobody is safe from Kendrick. May God protect us all. ", "child": "2455_1\t2455_2\t2455_3\t2455_4\t2455_5\t2455_6\t2455_7\t2455_8\t2455_9\t2455_10\t2455_11\t2455_12\t2455_13\t2455_14\t2455_15\t2455_16\t2455_17\t2455_18\t2455_19\t2455_20\t2455_21\t2455_22\t2455_23\t2455_24"}