{"name": "2456", "parent": "", "title": "Lots of people are saying that Instagram just officially ‘killed Snapchat’ Here’s why they’re wrong.", "sentences": [{"9a8e": "Lots of people are saying that Instagram just officially ‘killed Snapchat’ Here’s why they’re wrong."}, {"8def": "Last week, Facebook announced that Instagram Stories had reached 200 million daily active users (DAUs)."}, {"2aaf": "People were quick to pounce on that significant number and declare that finally, Mark Zuckerberg had ‘killed’ Snapchat and Facebook and Instagram were winning some imaginary war. Many tweeted things like, “RIP Snap,” “Is Snapchat already dead?,” “Snapchat is dead fam. Instagram stories came and ended her,” “Instagram just destroyed Snapchat.”"}, {"dedd": "But to compare Instagram Stories’ 200M DAUs with Snapchat’s total 161M daily active users is to equate apples with oranges. And, despite the fact that Instagram has made an effort to copy nearly all of Snapchat’s signature features, treating the two apps as similar platforms to begin with is a fruitless exercise."}, {"b96c": "First, it’s worth noting that Instagram Stories is not its own app. It’s a feature bolted onto a pre-existing app that has already amassed more than 400M daily active users."}, {"3a0c": "Second, when Instagram talks about Instagram Stories “daily active users”, the company seems to mean “anyone who checks Instagram Stories on a daily basis.”"}, {"b91d": "Instagram Stories"}, {"77c9": "Facebook won’t explicitly confirm what goes into calculating this metric, but it seems to be that if Beyonce blasts out an Instagram story to her nearly 100M Instagram followers and you happen to click it while scrolling through your feed, you are counted Instagram Stories daily active user."}, {"b36e": "Facebook has previously faced criticism over lowering the threshold of what is considered engagement. On the company’s flagship app a view only counts as three seconds and in September it was revealed that the company had “significantly inflated average video view times for years.”"}, {"dc3e": "Sure, Snapchat similarly defines a daily active users as a person who opens the app once in a 24-hour-period, but consider the fact that the average snapchatter spends around half an hour on the app per day and 60% of users create content. Instagram is primarily used for browsing and the average user spends just 15 minutes per day within the app. It’s highly unlikely that all 15 of those minutes are spent engaging with Instagram Stories."}, {"4530": "Assuming that Instagram has grown from the 400M DAUs it had in February, that means that under half of Instagram’s total daily user base engages with a feature that has been shoved into their feeds and promoted aggressively within the platform. This is far from an achievement — it’s unsurprising."}, {"b62b": "And this is the challenge for Instagram: the company has also yet to prove that users are using Instagram specifically for stories. Snapchat has cultivated a fertile niche in consumer behavior as an addictive, essential destination, while, right now, Instagram Stories is just one more feature haphazardly incorporated into a fragmented app."}, {"cff1": "Shots from an older version of Snapchat"}, {"accc": "Tech observers are desperate to pit the two companies against each other, but part of the reason it’s hard to even have a productive discussion about Instagram vs Snapchat, is that Snapchat breaks the mold of what so many consider a “social media company.”"}, {"d3ac": "Instagram, like Twitter and other social platforms, is built on a broadcast model of one-to-many communication. It encourages public posting by default and incentivizes high follower counts and likes. This is great for users looking to gain mass exposure, like brands and influencers, but it doesn’t stoke a high level of private and intentional communication with your closest friends."}, {"f348": "On Snapchat, there is no incentive to get followers or build an overly curated persona. It’s almost closer to a messaging platform than any of the public-facing social networks it’s often compared to. But to equate Snapchat to WhatsApp, WeChat, or even Facebook Messenger is also off. None of those apps are focused on photo and video consumption and sharing (Though naturally, Facebook Messenger now has Stories)."}, {"6e46": "Ultimately, social products aren’t just defined by the features they offer, they are also shaped by the learned user behaviors and norms that evolve within them."}, {"455c": "“What happens when you drop a feature like Stories into a community that doesn’t have that well developed set of norms? Some different set of norms will develop,” Parker Thompson an early stage investor and partner at Angelist recently told me “Your mom, for instance, when she sees your Instagram story, she’s not a Snapchat user so she doesn’t have that context and the experience and the way she treats the feature is just not going to be the same.”"}, {"5fc3": "Instagram Stories"}, {"853c": "Many people say that Instagram Stories offer a more enjoyable experience because “more people see your story.” But they are thinking of Stories within the context of the learned behaviors shaped by Instagram and other social networks that have pre-conditioned them to equate more views with “success” on a platform."}, {"9ee5": "Snapchat, on the other hand, is focused on facilitating deeper communication between a smaller group of friends, which is why it garners much more engagement. It’s a communication platform, not a broadcast platform. Snapchat did recently introduce a search function for public Stories, allowing users to discover content from people they don’t follow, but the snaps that are surfaced are stripped of usernames or Snap handles. There is still no internal discovery mechanism for finding interest-based user accounts on Snapchat."}, {"9aa7": "And while it’s true that Instagram might have shaved off some would-be Snapchat users, it’s unclear if many of these people would have ever joined the platform to begin with."}, {"8b59": "“Instagram is still a place for users to show off their day in images and has built an aesthetic around smartphone photography. What brings many users back to Snapchat is… the messaging they do with friends,” says Noah Mallin Head of Social, North America for MEC."}, {"5757": "Snapchat video chatting"}, {"9e7f": "All this isn’t to say that Snapchat doesn’t have problems. Snap is a publicly traded company now and as it grows it will have to deliver value to its shareholders. As the company noted in its S-1, the majority of its users are concentrated among top advertising markets, which bodes well for the company if it can offer innovative ad products and move out of advertisers’ “experimental bucket”."}, {"073e": "“To me, Snapchat has always been ahead of the curve. I fondly call it the ‘Snapchat effect.’ They lead and others follow,” Gemma Craven Senior Vice President and Director of Social & Mobile at McCann told me recently. “Snap called itself a camera company and now Facebook is talking about the camera being the most important part of any device, you see it all over.”"}, {"b914": "“I am confident that they are going to be able to monetize successfully,” she added. To her, Snap will likely end up going after TV dollars by offering more premium content in Snapchat Discover, something Instagram will have difficulty doing."}, {"f5f2": "Silicon Valley loves the spectacle of a no-holds-barred clash of tech titans, and comparing Snapchat to Instagram is certainly entertaining. But, rather than focusing on irrelevant metrics, people should think critically about the different ways people use these platforms to connect with others."}, {"9358": "Snapchat is not just another social network. It represents a radical shift in the way we communicate. It has established new norms and broken the mold of what we think of as social media — and that is something that Instagram will most likely never be able to replicate."}], "content": "Lots of people are saying that Instagram just officially ‘killed Snapchat’ Here’s why they’re wrong. Last week, Facebook announced that Instagram Stories had reached 200 million daily active users (DAUs). People were quick to pounce on that significant number and declare that finally, Mark Zuckerberg had ‘killed’ Snapchat and Facebook and Instagram were winning some imaginary war. Many tweeted things like, “RIP Snap,” “Is Snapchat already dead?,” “Snapchat is dead fam. Instagram stories came and ended her,” “Instagram just destroyed Snapchat.” But to compare Instagram Stories’ 200M DAUs with Snapchat’s total 161M daily active users is to equate apples with oranges. And, despite the fact that Instagram has made an effort to copy nearly all of Snapchat’s signature features, treating the two apps as similar platforms to begin with is a fruitless exercise. First, it’s worth noting that Instagram Stories is not its own app. It’s a feature bolted onto a pre-existing app that has already amassed more than 400M daily active users. Second, when Instagram talks about Instagram Stories “daily active users”, the company seems to mean “anyone who checks Instagram Stories on a daily basis.” Instagram Stories Facebook won’t explicitly confirm what goes into calculating this metric, but it seems to be that if Beyonce blasts out an Instagram story to her nearly 100M Instagram followers and you happen to click it while scrolling through your feed, you are counted Instagram Stories daily active user. Facebook has previously faced criticism over lowering the threshold of what is considered engagement. On the company’s flagship app a view only counts as three seconds and in September it was revealed that the company had “significantly inflated average video view times for years.” Sure, Snapchat similarly defines a daily active users as a person who opens the app once in a 24-hour-period, but consider the fact that the average snapchatter spends around half an hour on the app per day and 60% of users create content. Instagram is primarily used for browsing and the average user spends just 15 minutes per day within the app. It’s highly unlikely that all 15 of those minutes are spent engaging with Instagram Stories. Assuming that Instagram has grown from the 400M DAUs it had in February, that means that under half of Instagram’s total daily user base engages with a feature that has been shoved into their feeds and promoted aggressively within the platform. This is far from an achievement — it’s unsurprising. And this is the challenge for Instagram: the company has also yet to prove that users are using Instagram specifically for stories. Snapchat has cultivated a fertile niche in consumer behavior as an addictive, essential destination, while, right now, Instagram Stories is just one more feature haphazardly incorporated into a fragmented app. Shots from an older version of Snapchat Tech observers are desperate to pit the two companies against each other, but part of the reason it’s hard to even have a productive discussion about Instagram vs Snapchat, is that Snapchat breaks the mold of what so many consider a “social media company.” Instagram, like Twitter and other social platforms, is built on a broadcast model of one-to-many communication. It encourages public posting by default and incentivizes high follower counts and likes. This is great for users looking to gain mass exposure, like brands and influencers, but it doesn’t stoke a high level of private and intentional communication with your closest friends. On Snapchat, there is no incentive to get followers or build an overly curated persona. It’s almost closer to a messaging platform than any of the public-facing social networks it’s often compared to. But to equate Snapchat to WhatsApp, WeChat, or even Facebook Messenger is also off. None of those apps are focused on photo and video consumption and sharing (Though naturally, Facebook Messenger now has Stories). Ultimately, social products aren’t just defined by the features they offer, they are also shaped by the learned user behaviors and norms that evolve within them. “What happens when you drop a feature like Stories into a community that doesn’t have that well developed set of norms? Some different set of norms will develop,” Parker Thompson an early stage investor and partner at Angelist recently told me “Your mom, for instance, when she sees your Instagram story, she’s not a Snapchat user so she doesn’t have that context and the experience and the way she treats the feature is just not going to be the same.” Instagram Stories Many people say that Instagram Stories offer a more enjoyable experience because “more people see your story.” But they are thinking of Stories within the context of the learned behaviors shaped by Instagram and other social networks that have pre-conditioned them to equate more views with “success” on a platform. Snapchat, on the other hand, is focused on facilitating deeper communication between a smaller group of friends, which is why it garners much more engagement. It’s a communication platform, not a broadcast platform. Snapchat did recently introduce a search function for public Stories, allowing users to discover content from people they don’t follow, but the snaps that are surfaced are stripped of usernames or Snap handles. There is still no internal discovery mechanism for finding interest-based user accounts on Snapchat. And while it’s true that Instagram might have shaved off some would-be Snapchat users, it’s unclear if many of these people would have ever joined the platform to begin with. “Instagram is still a place for users to show off their day in images and has built an aesthetic around smartphone photography. What brings many users back to Snapchat is… the messaging they do with friends,” says Noah Mallin Head of Social, North America for MEC. Snapchat video chatting All this isn’t to say that Snapchat doesn’t have problems. Snap is a publicly traded company now and as it grows it will have to deliver value to its shareholders. As the company noted in its S-1, the majority of its users are concentrated among top advertising markets, which bodes well for the company if it can offer innovative ad products and move out of advertisers’ “experimental bucket”. “To me, Snapchat has always been ahead of the curve. I fondly call it the ‘Snapchat effect.’ They lead and others follow,” Gemma Craven Senior Vice President and Director of Social & Mobile at McCann told me recently. “Snap called itself a camera company and now Facebook is talking about the camera being the most important part of any device, you see it all over.” “I am confident that they are going to be able to monetize successfully,” she added. To her, Snap will likely end up going after TV dollars by offering more premium content in Snapchat Discover, something Instagram will have difficulty doing. Silicon Valley loves the spectacle of a no-holds-barred clash of tech titans, and comparing Snapchat to Instagram is certainly entertaining. But, rather than focusing on irrelevant metrics, people should think critically about the different ways people use these platforms to connect with others. Snapchat is not just another social network. It represents a radical shift in the way we communicate. It has established new norms and broken the mold of what we think of as social media — and that is something that Instagram will most likely never be able to replicate. ", "child": "2456_1\t2456_2\t2456_3\t2456_4\t2456_5\t2456_6\t2456_7\t2456_8\t2456_9\t2456_10\t2456_11\t2456_12\t2456_13\t2456_14\t2456_15\t2456_16"}