{"name": "2459", "parent": "", "title": "Men Recommend David Foster Wallace to Me", "sentences": [{"d063": "Men Recommend David Foster Wallace to Me"}, {"0e67": "Late to the Party: Reading ‘Brief Interviews with Hideous Men’ for the first time"}, {"7e5e": "Editor’s Note: Late to the Party is a new Electric Literature series where we ask writers to read an author that, for some reason, they’ve never read. You can read previous entries here."}, {"5fb6": "Pre-Reading Impressions"}, {"13ee": "For awhile, I was seeing a guy who really liked David Foster Wallace. He once forced me to do cocaine by shoving it inside me during sex. He wasn’t the first man to recommend Wallace, but he’s the last whose suggestion I pretended to consider. So while I’ve never read a book by Wallace, I’m preemptively uninterested in your opinion about it."}, {"af37": "These recommendations from men have never inspired me to read Wallace’s magnum opus, Infinite Jest, or his essays, or stories, or even to take the path of least resistance and see the Jason Segel movie about him. Said recommendations have, however, festered over such a long period that they’ve mutated into deeply felt opinions about Wallace himself: namely, that he was an overly self-aware genius who needed a better editor and that I’d hate his writing."}, {"e9c9": "Wallace-recommending men are ubiquitous enough to be their own in-joke. New York Magazine notes that “Wallace, too, has become lit-bro shorthand…some women [treat] ‘loves DFW’ as synonymous with ‘is one of those motherfuckers’” (hi, it’s me). When conservative Supreme Court nominee Neil Gorsuch cited Wallace in a hearing, The New Republic asserted that “Wallace is the lingua franca of a certain subset of overeducated, usually wealthy, extremely self-serious (mostly) men.” Onion-esque news outlet Reductress clickbaited me perfectly with “Why I’m Waiting for The Right Man to Tell Me I Should Read ‘Infinite Jest.’” Wallace is on a list of books that literally all white men own."}, {"16ff": "Joking about this phenomenon, however, doesn’t make it stop."}, {"1b42": "Small, liberal arts colleges are spawning ground for Wallace fans; mine was no exception. The guys at my college — and this is not necessarily an attack on their characters — did many predictable things: played ultimate frisbee, rallied against multinational beverage corporations, listened to The Mountain Goats, and told me to read Infinite Jest."}, {"69f4": "The guys at my college — and this is not necessarily an attack on their characters — did many predictable things: played ultimate frisbee, rallied against multinational beverage corporations, listened to The Mountain Goats, and told me to read Infinite Jest."}, {"50ae": "These guys persevere after graduation. A guy joked that you couldn’t live in Brooklyn unless you owned Infinite Jest. My longtime friend Nat told me Wallace’s writing was Faulkner-level good, Joyce-level good (“The Dead” is cool; I never got into Faulkner). A boyfriend lent me Consider the Lobster when I asked for non-fiction recs (I stopped reading after one essay). The cocaine guy."}, {"e7b3": "But the first man to recommend Wallace to me was Robert Lanham, author of The Hipster Handbook, a caustic guide to early-2000s-Williamsburg-era culture that I picked up as a teenager in Virginia. I felt obliged to pay attention to a section titled “Hipster Literature: If You Haven’t Read These Works, At Least Pretend You Have,” where Infinite Jest appears between Haruki Murakami and Ben Marcus (the list is 93.5% male). “Actually, scratch this one,” Lanham concludes. “It’s too damn long. Hipsters just hear that it’s good. If they actually read it they’d see that Wallace is a poseur.” Despite this relatively sick burn, I wanted to know for myself. I wanted to become the right kind of person: savvy, culturally literate, respected by the metropolitan elite that might assume by default the cultural illiteracy of someone from Virginia."}, {"8851": "For a long time, I’d respond to men’s Wallace recommendations with “he’s on my list,” or “I’ve been meaning to — totally.” And for a long time, I meant it. Now, thinking about becoming that kind of person makes me feel tired. This is how you become the right kind of person: if you’re not in a position of power, identify your oppressors — well-intentioned, oblivious, or otherwise — and love their art. This is why it’s hard to distinguish my reaction to Wallace from my reaction to patriarchy. This insistence that I read his work feels like yet another insistence that The Thing That’s Good Is The Thing Men Like."}, {"d5fd": "Of course, I know female DFW fans. But when women have talked to me about Wallace, their commentary is usually “he’s funny,” or “I liked A Supposedly Fun Thing I’ll Never Do Again.” It has never been “Go read Infinite Jest,” or “You haven’t read any of his work?” It should also be noted that, upon hearing about this essay, male Wallace fans have specifically listed women they know who like Wallace — as if this invalidates my disinterest somehow."}, {"6363": "The men in my life who love Wallace also love legions of stylistically similar male writers I’m not interested in (Pynchon, DeLillo, Barth). I began checking out of literary conversations with them altogether. Now, when getting into book discussions with a certain kind of man, I often say “I can’t read” as soon as possible. This is a pretty transparent defense mechanism, but it works for me, sort of."}, {"607f": "Here’s the thing: I don’t doubt that Wallace is a genius. And it’s not that I believe there’s no value in self-indulgent works by men. It’s just that I’m not very interested in them. These men seem to think I’m saying the thing they love is bad, when really I’m just saying I don’t care about the thing they love."}, {"b3d5": "Sure, some of this is personal preference, a desire for relatability in my fiction: I may not want to read a book about a sad white man, but many of my favorite books are about sad white women (The House of Mirth, White Oleander, The Yellow Wallpaper, The Torn Skirt). My issue with many self-indulgent works by white men (the ones I’ve read, the ones I’ve given up on, and the ones I’ve refused to try) is not that I think they’re evil or poorly written or even, necessarily, offensive (though plenty of them are), but that I can’t find any entry point — and nothing incentivizes me to find one except other men’s approval."}, {"b28a": "Now, the male editor of this website has asked me to read Brief Interviews with Hideous Men and write about it for money. This I can relate to."}, {"1d3a": "Now, the male editor of this website has asked me to read Brief Interviews with Hideous Men and write about it for money. This I can relate to."}, {"0660": "Before I started, my boyfriend (who’s read everything Wallace has ever written, but has never recommended him to me) lifted the book off my bedside table. Flipping through, he laughed. “You’re going to hate this.”"}, {"47de": "Post-Reading Impressions"}, {"aab8": "Reading these stories felt like being a tourist in the incubation tanks of other writers I know. I recognized narrative structures, stylistic idiosyncrasies, a detached anguish."}, {"71ba": "The book opens with a seventy-nine-word story called “A Radically Condensed History of Postindustrial Life.” The title’s attempt at humor through grandiosity instinctively annoyed me, but I related to the narrative: a pathetic interaction between three desperate people hoping to be liked. Who wouldn’t relate? We all want to be the right kind of person."}, {"8511": "The first story to really stick with me was “The Depressed Person.” “Wallace writes depression the way Jason Molina sings it,” my friend Nat wrote to me in 2012. “Hits too close to home, but is absolutely riveting.” As a story, “The Depressed Person” is deeply claustrophobic: I’ve never read anything that made me feel as inextricably trapped inside depression’s bell jar, including The Bell Jar. I had to take many breaks while reading this thirty-two-page story to replenish my own levels of sanity. I’ve dealt with depression, though never major, and I’d go so far as to say that this story is perfectly executed. I did not enjoy the experience of reading it, but neither have I enjoyed the experience of being depressed."}, {"e362": "I’ve dealt with depression, though never major, and I’d go so far as to say that this story is perfectly executed. I did not enjoy the experience of reading it, but neither have I enjoyed the experience of being depressed."}, {"ef14": "With regard to this particular collection, the praise I’ve most often heard is that it’s funny. “Octet” was the only story to make me laugh out loud, in part because I hated it at first. The story is structured as a series of pop quizzes written in the second person featuring morally questionable vignettes that leave the reader to decide characters’ culpability (among other things). This follows another tedious piece called “Datum Centurio,” which traces the etymological history of the word “date” through an insufferable series of definitions from a 2096 dictionary. I felt equally bored by “Octet” until, fifteen pages in, I arrived at “Pop Quiz 9” (actually the fifth quiz). It begins, “You are, unfortunately, a fiction writer. You are attempting a cycle of very short belletristic fiction pieces…So you do an eight-part cycle of these little mortise-and-tenon pieces. And it ends up a total fiasco. Five of the eight pieces don’t work at all — meaning they don’t interrogate or palpate what you want them to, plus are too contrived or too cartoonish or too annoying or all three — and you have to toss them out.” For the first and only time while reading this collection, I laughed out loud. There’s nothing like feeling superior to a piece of writing only to have its author acknowledge exactly what’s annoying about the work, apologize for it, apologize for apologizing for it, and funnel along through the remaining sixteen pages in an adorably overwrought trainwreck of meta commentary (but then, you have to admit that this probably exists to win over more cynical readers [hit, it’s me]). Wallace indicates that he, too, wants to be the right kind of person."}, {"5533": "The main thing to talk about is the series of titular stories. There are four sets of “Brief Interviews with Hideous Men,” each following an unnamed female narrator as she interviews shitty dudes. The types of repulsive interviewees are deeply familiar: pickup artists, breakup artists, rape apologists, men who pontificate on what women “really” want."}, {"6d30": "Honestly, I don’t think there’s much point in my writing about the text — it’s been written about enough (if you’re looking for an intelligent essay by a woman who loves Wallace, Zadie Smith’s “Brief Interviews with Hideous Men: The Difficult Gifts of David Foster Wallace” is predictably wonderful). So I’m going to do one of the many things which, as a non-male writer, feels terrible, and I’m going to talk about my feelings."}, {"3b93": "It feels bad to read a book by a straight cis man about misogyny. It feels bad when this book contains some relatively graphic depictions of sexual assault. This is par for the course, when the course is reading books and the par is the Western canon. What feels worse is having this man’s work recommended to you, over and over, by men who have talked over you, talked down to you, coerced you into certain things, physically forced you into others, and devalued your opinion in ways too subtle to be worth explaining in an essay (as in the interviews, where the hideous men are the only characters we hear from). Either these Wallace-recommending men don’t realize that they’re the hideous men in question, or they think self-awareness is the best anyone could expect from them."}, {"83f8": "In the second iteration of “Brief Interviews,” one of the interviewees says, in explaining a rape victim’s revelation, “you can do anything to anybody or even to yourself if you want because who cares because what does it really matter because what are you anyway just this thing to shove a Jack Daniel’s bottle into, and who cares if it’s a bottle what difference does it make if it’s a dick or a fist or a plumber’s helper or this cane right here — what would it be like to be able to be like this?” The interview culminates in the subject saying to the unnamed female interviewer, “What if I did it to you? Right here? Raped you with a bottle? Do you think it’d make any difference? Why? What are you? How do you know? You don’t know shit.”"}, {"f489": "Wallace’s writing is effective in that it invokes both familiarity and repulsion. He knew what he was doing and did it very well. Many of the stories upset me. Many contained beautiful sentences. All were intelligent. I laughed once. But why have so many men been so insistent that I should read his work? What do they think Wallace has to teach me?"}, {"b0c3": "Why have so many men been so insistent that I should read his work? What do they think Wallace has to teach me?"}, {"d774": "Obviously work by women about sexual assault has received critical acclaim and attention (Morrison, Oates, Walker, to name a few). But men rarely recommend those books to me (excepting my dad, who gave me Morrison novels when I was a teenager), and as far as I can tell, men are far less likely to idolize those authors, aspire to their cultural status, or blatantly copy their stylistic idiosyncrasies. More mundanely, I’ve never heard a woman express shock or horror on hearing that a man has never read Beloved. It wouldn’t occur to most women to recommend books by women to men the way men recommend books by men to women."}, {"bf48": "Civic Memory, Feminist FutureA personal and political history from Lidia Yuknavitchelectricliterature.com"}, {"3597": "I opened this essay with the cocaine story because exploiting my own physical experiences, especially sexual, establishes and theoretically validates my reflexive resentment toward Wallace (by way of his fans) before anyone has time to question me. It also encourages continued scrolling. Then I considered cutting the paragraph because I don’t necessarily want the internet to know that story. Now it does. Yet in either case, the choice was mine to make, and this is, of course, why it enrages me so much when men exploit women’s sexual suffering for Art."}, {"a733": "It is enraging to have a straight man tell me a story about straight men telling stories to a woman about straight men acting like shitheads. I understand that this is the point of the text. I know. I understand that maybe other men wouldn’t absorb the message unless it was being told to them by another, probably smarter and better educated man. But then why do men keep recommending his work to me? BECAUSE I KNOW I KNOW I KNOW I KNOW I KNOW I KNOW I KNOW I KNOW I KNOW."}, {"3a2c": "Let me condense Brief Interviews with Hideous Men to its most quintessential line: “Men mostly are shit, you’re right, heh heh.” Fine, Wallace: you’re right. Heh heh."}], "content": "Men Recommend David Foster Wallace to Me Late to the Party: Reading ‘Brief Interviews with Hideous Men’ for the first time Editor’s Note: Late to the Party is a new Electric Literature series where we ask writers to read an author that, for some reason, they’ve never read. You can read previous entries here. Pre-Reading Impressions For awhile, I was seeing a guy who really liked David Foster Wallace. He once forced me to do cocaine by shoving it inside me during sex. He wasn’t the first man to recommend Wallace, but he’s the last whose suggestion I pretended to consider. So while I’ve never read a book by Wallace, I’m preemptively uninterested in your opinion about it. These recommendations from men have never inspired me to read Wallace’s magnum opus, Infinite Jest, or his essays, or stories, or even to take the path of least resistance and see the Jason Segel movie about him. Said recommendations have, however, festered over such a long period that they’ve mutated into deeply felt opinions about Wallace himself: namely, that he was an overly self-aware genius who needed a better editor and that I’d hate his writing. Wallace-recommending men are ubiquitous enough to be their own in-joke. New York Magazine notes that “Wallace, too, has become lit-bro shorthand…some women [treat] ‘loves DFW’ as synonymous with ‘is one of those motherfuckers’” (hi, it’s me). When conservative Supreme Court nominee Neil Gorsuch cited Wallace in a hearing, The New Republic asserted that “Wallace is the lingua franca of a certain subset of overeducated, usually wealthy, extremely self-serious (mostly) men.” Onion-esque news outlet Reductress clickbaited me perfectly with “Why I’m Waiting for The Right Man to Tell Me I Should Read ‘Infinite Jest.’” Wallace is on a list of books that literally all white men own. Joking about this phenomenon, however, doesn’t make it stop. Small, liberal arts colleges are spawning ground for Wallace fans; mine was no exception. The guys at my college — and this is not necessarily an attack on their characters — did many predictable things: played ultimate frisbee, rallied against multinational beverage corporations, listened to The Mountain Goats, and told me to read Infinite Jest. The guys at my college — and this is not necessarily an attack on their characters — did many predictable things: played ultimate frisbee, rallied against multinational beverage corporations, listened to The Mountain Goats, and told me to read Infinite Jest. These guys persevere after graduation. A guy joked that you couldn’t live in Brooklyn unless you owned Infinite Jest. My longtime friend Nat told me Wallace’s writing was Faulkner-level good, Joyce-level good (“The Dead” is cool; I never got into Faulkner). A boyfriend lent me Consider the Lobster when I asked for non-fiction recs (I stopped reading after one essay). The cocaine guy. But the first man to recommend Wallace to me was Robert Lanham, author of The Hipster Handbook, a caustic guide to early-2000s-Williamsburg-era culture that I picked up as a teenager in Virginia. I felt obliged to pay attention to a section titled “Hipster Literature: If You Haven’t Read These Works, At Least Pretend You Have,” where Infinite Jest appears between Haruki Murakami and Ben Marcus (the list is 93.5% male). “Actually, scratch this one,” Lanham concludes. “It’s too damn long. Hipsters just hear that it’s good. If they actually read it they’d see that Wallace is a poseur.” Despite this relatively sick burn, I wanted to know for myself. I wanted to become the right kind of person: savvy, culturally literate, respected by the metropolitan elite that might assume by default the cultural illiteracy of someone from Virginia. For a long time, I’d respond to men’s Wallace recommendations with “he’s on my list,” or “I’ve been meaning to — totally.” And for a long time, I meant it. Now, thinking about becoming that kind of person makes me feel tired. This is how you become the right kind of person: if you’re not in a position of power, identify your oppressors — well-intentioned, oblivious, or otherwise — and love their art. This is why it’s hard to distinguish my reaction to Wallace from my reaction to patriarchy. This insistence that I read his work feels like yet another insistence that The Thing That’s Good Is The Thing Men Like. Of course, I know female DFW fans. But when women have talked to me about Wallace, their commentary is usually “he’s funny,” or “I liked A Supposedly Fun Thing I’ll Never Do Again.” It has never been “Go read Infinite Jest,” or “You haven’t read any of his work?” It should also be noted that, upon hearing about this essay, male Wallace fans have specifically listed women they know who like Wallace — as if this invalidates my disinterest somehow. The men in my life who love Wallace also love legions of stylistically similar male writers I’m not interested in (Pynchon, DeLillo, Barth). I began checking out of literary conversations with them altogether. Now, when getting into book discussions with a certain kind of man, I often say “I can’t read” as soon as possible. This is a pretty transparent defense mechanism, but it works for me, sort of. Here’s the thing: I don’t doubt that Wallace is a genius. And it’s not that I believe there’s no value in self-indulgent works by men. It’s just that I’m not very interested in them. These men seem to think I’m saying the thing they love is bad, when really I’m just saying I don’t care about the thing they love. Sure, some of this is personal preference, a desire for relatability in my fiction: I may not want to read a book about a sad white man, but many of my favorite books are about sad white women (The House of Mirth, White Oleander, The Yellow Wallpaper, The Torn Skirt). My issue with many self-indulgent works by white men (the ones I’ve read, the ones I’ve given up on, and the ones I’ve refused to try) is not that I think they’re evil or poorly written or even, necessarily, offensive (though plenty of them are), but that I can’t find any entry point — and nothing incentivizes me to find one except other men’s approval. Now, the male editor of this website has asked me to read Brief Interviews with Hideous Men and write about it for money. This I can relate to. Now, the male editor of this website has asked me to read Brief Interviews with Hideous Men and write about it for money. This I can relate to. Before I started, my boyfriend (who’s read everything Wallace has ever written, but has never recommended him to me) lifted the book off my bedside table. Flipping through, he laughed. “You’re going to hate this.” Post-Reading Impressions Reading these stories felt like being a tourist in the incubation tanks of other writers I know. I recognized narrative structures, stylistic idiosyncrasies, a detached anguish. The book opens with a seventy-nine-word story called “A Radically Condensed History of Postindustrial Life.” The title’s attempt at humor through grandiosity instinctively annoyed me, but I related to the narrative: a pathetic interaction between three desperate people hoping to be liked. Who wouldn’t relate? We all want to be the right kind of person. The first story to really stick with me was “The Depressed Person.” “Wallace writes depression the way Jason Molina sings it,” my friend Nat wrote to me in 2012. “Hits too close to home, but is absolutely riveting.” As a story, “The Depressed Person” is deeply claustrophobic: I’ve never read anything that made me feel as inextricably trapped inside depression’s bell jar, including The Bell Jar. I had to take many breaks while reading this thirty-two-page story to replenish my own levels of sanity. I’ve dealt with depression, though never major, and I’d go so far as to say that this story is perfectly executed. I did not enjoy the experience of reading it, but neither have I enjoyed the experience of being depressed. I’ve dealt with depression, though never major, and I’d go so far as to say that this story is perfectly executed. I did not enjoy the experience of reading it, but neither have I enjoyed the experience of being depressed. With regard to this particular collection, the praise I’ve most often heard is that it’s funny. “Octet” was the only story to make me laugh out loud, in part because I hated it at first. The story is structured as a series of pop quizzes written in the second person featuring morally questionable vignettes that leave the reader to decide characters’ culpability (among other things). This follows another tedious piece called “Datum Centurio,” which traces the etymological history of the word “date” through an insufferable series of definitions from a 2096 dictionary. I felt equally bored by “Octet” until, fifteen pages in, I arrived at “Pop Quiz 9” (actually the fifth quiz). It begins, “You are, unfortunately, a fiction writer. You are attempting a cycle of very short belletristic fiction pieces…So you do an eight-part cycle of these little mortise-and-tenon pieces. And it ends up a total fiasco. Five of the eight pieces don’t work at all — meaning they don’t interrogate or palpate what you want them to, plus are too contrived or too cartoonish or too annoying or all three — and you have to toss them out.” For the first and only time while reading this collection, I laughed out loud. There’s nothing like feeling superior to a piece of writing only to have its author acknowledge exactly what’s annoying about the work, apologize for it, apologize for apologizing for it, and funnel along through the remaining sixteen pages in an adorably overwrought trainwreck of meta commentary (but then, you have to admit that this probably exists to win over more cynical readers [hit, it’s me]). Wallace indicates that he, too, wants to be the right kind of person. The main thing to talk about is the series of titular stories. There are four sets of “Brief Interviews with Hideous Men,” each following an unnamed female narrator as she interviews shitty dudes. The types of repulsive interviewees are deeply familiar: pickup artists, breakup artists, rape apologists, men who pontificate on what women “really” want. Honestly, I don’t think there’s much point in my writing about the text — it’s been written about enough (if you’re looking for an intelligent essay by a woman who loves Wallace, Zadie Smith’s “Brief Interviews with Hideous Men: The Difficult Gifts of David Foster Wallace” is predictably wonderful). So I’m going to do one of the many things which, as a non-male writer, feels terrible, and I’m going to talk about my feelings. It feels bad to read a book by a straight cis man about misogyny. It feels bad when this book contains some relatively graphic depictions of sexual assault. This is par for the course, when the course is reading books and the par is the Western canon. What feels worse is having this man’s work recommended to you, over and over, by men who have talked over you, talked down to you, coerced you into certain things, physically forced you into others, and devalued your opinion in ways too subtle to be worth explaining in an essay (as in the interviews, where the hideous men are the only characters we hear from). Either these Wallace-recommending men don’t realize that they’re the hideous men in question, or they think self-awareness is the best anyone could expect from them. In the second iteration of “Brief Interviews,” one of the interviewees says, in explaining a rape victim’s revelation, “you can do anything to anybody or even to yourself if you want because who cares because what does it really matter because what are you anyway just this thing to shove a Jack Daniel’s bottle into, and who cares if it’s a bottle what difference does it make if it’s a dick or a fist or a plumber’s helper or this cane right here — what would it be like to be able to be like this?” The interview culminates in the subject saying to the unnamed female interviewer, “What if I did it to you? Right here? Raped you with a bottle? Do you think it’d make any difference? Why? What are you? How do you know? You don’t know shit.” Wallace’s writing is effective in that it invokes both familiarity and repulsion. He knew what he was doing and did it very well. Many of the stories upset me. Many contained beautiful sentences. All were intelligent. I laughed once. But why have so many men been so insistent that I should read his work? What do they think Wallace has to teach me? Why have so many men been so insistent that I should read his work? What do they think Wallace has to teach me? Obviously work by women about sexual assault has received critical acclaim and attention (Morrison, Oates, Walker, to name a few). But men rarely recommend those books to me (excepting my dad, who gave me Morrison novels when I was a teenager), and as far as I can tell, men are far less likely to idolize those authors, aspire to their cultural status, or blatantly copy their stylistic idiosyncrasies. More mundanely, I’ve never heard a woman express shock or horror on hearing that a man has never read Beloved. It wouldn’t occur to most women to recommend books by women to men the way men recommend books by men to women. Civic Memory, Feminist FutureA personal and political history from Lidia Yuknavitchelectricliterature.com I opened this essay with the cocaine story because exploiting my own physical experiences, especially sexual, establishes and theoretically validates my reflexive resentment toward Wallace (by way of his fans) before anyone has time to question me. It also encourages continued scrolling. Then I considered cutting the paragraph because I don’t necessarily want the internet to know that story. Now it does. Yet in either case, the choice was mine to make, and this is, of course, why it enrages me so much when men exploit women’s sexual suffering for Art. It is enraging to have a straight man tell me a story about straight men telling stories to a woman about straight men acting like shitheads. I understand that this is the point of the text. I know. I understand that maybe other men wouldn’t absorb the message unless it was being told to them by another, probably smarter and better educated man. But then why do men keep recommending his work to me? BECAUSE I KNOW I KNOW I KNOW I KNOW I KNOW I KNOW I KNOW I KNOW I KNOW. Let me condense Brief Interviews with Hideous Men to its most quintessential line: “Men mostly are shit, you’re right, heh heh.” Fine, Wallace: you’re right. Heh heh. ", "child": "2459_1\t2459_2\t2459_3\t2459_4\t2459_5\t2459_6\t2459_7\t2459_8\t2459_9\t2459_10\t2459_11\t2459_12\t2459_13\t2459_14\t2459_15\t2459_16\t2459_17\t2459_18\t2459_19\t2459_20\t2459_21\t2459_22\t2459_23\t2459_24\t2459_252459_1\t2459_2\t2459_3\t2459_4\t2459_5\t2459_6\t2459_7\t2459_8\t2459_9\t2459_10\t2459_11\t2459_12\t2459_13\t2459_14\t2459_15\t2459_16\t2459_17\t2459_18\t2459_19\t2459_20\t2459_21\t2459_22\t2459_23\t2459_24\t2459_252459_1\t2459_2\t2459_3\t2459_4\t2459_5\t2459_6\t2459_7\t2459_8\t2459_9\t2459_10\t2459_11\t2459_12\t2459_13\t2459_14\t2459_15\t2459_16\t2459_17\t2459_18\t2459_19\t2459_20\t2459_21\t2459_22\t2459_23\t2459_24\t2459_25"}