{"name": "2466", "parent": "", "title": "Informed communities are engaged communities", "sentences": [{"a880": "Informed communities are engaged communities"}, {"0049": "Using smart maps, one of France’s most popular shows is driving the conversation regarding transparency for members of the French Parliament."}, {"5007": "In February, the popular journalist and TV host Yann Barthès and his show ‘Quotidien’ (The Daily) launched an investigative report entitled “#ParlementTransparent.” In this election year, Yann and his team contacted all 925 members of Parliament and asked them to answer a series of 4 questions."}, {"c94e": "With a short turn-around time confronting them and looking for a user-friendly tool that would help their audience find their respective representatives quickly and update automatically with new responses as recorded, the Quotidien team turned to Wemap to power their user-facing interactive."}, {"a478": "In one day a smart map with live data was launched on Quotidien’s website."}, {"69fa": "An in-depth look into the “#ParlementTransparent” operation"}, {"017a": "Building and connecting the data set"}, {"1f1d": "The Quotidien team had previously compiled a list of all 925 members of Parliament including party affiliation and legislative districts in order to send out their initial questionnaire. They optimized their ability to collaborate by compiling the responses in a dedicated Google Sheet."}, {"a2a7": "Working together, we connected this Google Sheet to a smart map through through the Wemap platform; adding columns for location and a given individual’s response or lack thereof for each of the four questions asked."}, {"3e44": "The connection between the GoogleSheet and the smart map deployed on Quotidien’s site ensures that any time a member of Parliament responds to the questionnaire, the updated information is automatically visible in the map."}, {"4e3d": "Using tags to deliver content effectively"}, {"7cbe": "Being able to build a customized connection between their dataset enabled the Quotidien team to put in place select tags to facilitate and accelerate a user’s search for their local representatives."}, {"9bea": "Editorial driven selection of tags enabling filtering by position, response and political party."}, {"49be": "In addition to filtering by editorially relevant tags, the Quotidien journalists were able to select the GeoJSON layering option of their choosing from our library of GeoJSON layers based on political boundaires."}, {"f958": "Activation of GeoJSON layers to zoom-in to a specific legislative district."}, {"4c9e": "The combination of key-word search, tags and clickable layers based on legislative districts provides for an advanced search experience and makes finding one’s representatives exceptionally quick, from any device."}, {"d846": "Good products yield engaged, informed audiences"}, {"aebb": "Quotidien launched the “#ParlementTransparent” project on Feburary 17th and within minutes, over 10,000 visitors were simultaneously consulting the embedded smart map to see their local representatives answers to the questionnaire."}, {"e346": "In addition to enabling visitors to quickly find their local representatives, the project also generated a significant number of direct calls to respond to the questionnaire on behalf of constituents to their local representatives."}, {"734e": "The connection of the smart map to the Quotidien database transforms what could have been a limited data visualization based on a spreadsheet into a powerful, always up-to-date, trackable tool that can be leveraged again-and-again to drive traffic to the website and, just as crucially, pressure members of Parlement to respond to the questionnaire."}, {"af4a": "In a little over a month, the number of representatives who’ve responded to the questionnaire has grown by 40% and the #ParlementTransparent hashtag continues to be one of the more popular trending hashtags in France with consistently high traffic to the smart map."}, {"d0b6": "With no additional code or dedicated development resources, the Quotidien team embedded a smart map to effectively and efficiently better inform their audience on a topic of interest in the midst of an important campaign cycle."}, {"58ca": "The operation is ongoing, you can check it out here:"}, {"5dd3": "http://www.tf1.fr/tmc/quotidien-avec-yann-barthes/pages/parlement-transparent.html"}, {"6608": "***"}, {"c24b": "Wemap developed a breakthrough map technology that has been adopted in a few months by global leaders like Le Parisien, Hachette and ministère de la Culture et de la Communication. The French-American start-up is building a smart maps platform to offer individuals and organizations a bridge to the real world: combining meaningful information and practical services. Wemap combines an intuitive user experience and a powerful tool to connect a map to any sources and publish it. By empowering publishers to create and embed live maps with their content in minutes, Wemap has already reached 4 millions monthly viewers of its maps."}, {"f19c": "To learn more about Wemap’s technology: https://getwemap.com."}], "content": "Informed communities are engaged communities Using smart maps, one of France’s most popular shows is driving the conversation regarding transparency for members of the French Parliament. In February, the popular journalist and TV host Yann Barthès and his show ‘Quotidien’ (The Daily) launched an investigative report entitled “#ParlementTransparent.” In this election year, Yann and his team contacted all 925 members of Parliament and asked them to answer a series of 4 questions. With a short turn-around time confronting them and looking for a user-friendly tool that would help their audience find their respective representatives quickly and update automatically with new responses as recorded, the Quotidien team turned to Wemap to power their user-facing interactive. In one day a smart map with live data was launched on Quotidien’s website. An in-depth look into the “#ParlementTransparent” operation Building and connecting the data set The Quotidien team had previously compiled a list of all 925 members of Parliament including party affiliation and legislative districts in order to send out their initial questionnaire. They optimized their ability to collaborate by compiling the responses in a dedicated Google Sheet. Working together, we connected this Google Sheet to a smart map through through the Wemap platform; adding columns for location and a given individual’s response or lack thereof for each of the four questions asked. The connection between the GoogleSheet and the smart map deployed on Quotidien’s site ensures that any time a member of Parliament responds to the questionnaire, the updated information is automatically visible in the map. Using tags to deliver content effectively Being able to build a customized connection between their dataset enabled the Quotidien team to put in place select tags to facilitate and accelerate a user’s search for their local representatives. Editorial driven selection of tags enabling filtering by position, response and political party. In addition to filtering by editorially relevant tags, the Quotidien journalists were able to select the GeoJSON layering option of their choosing from our library of GeoJSON layers based on political boundaires. Activation of GeoJSON layers to zoom-in to a specific legislative district. The combination of key-word search, tags and clickable layers based on legislative districts provides for an advanced search experience and makes finding one’s representatives exceptionally quick, from any device. Good products yield engaged, informed audiences Quotidien launched the “#ParlementTransparent” project on Feburary 17th and within minutes, over 10,000 visitors were simultaneously consulting the embedded smart map to see their local representatives answers to the questionnaire. In addition to enabling visitors to quickly find their local representatives, the project also generated a significant number of direct calls to respond to the questionnaire on behalf of constituents to their local representatives. The connection of the smart map to the Quotidien database transforms what could have been a limited data visualization based on a spreadsheet into a powerful, always up-to-date, trackable tool that can be leveraged again-and-again to drive traffic to the website and, just as crucially, pressure members of Parlement to respond to the questionnaire. In a little over a month, the number of representatives who’ve responded to the questionnaire has grown by 40% and the #ParlementTransparent hashtag continues to be one of the more popular trending hashtags in France with consistently high traffic to the smart map. With no additional code or dedicated development resources, the Quotidien team embedded a smart map to effectively and efficiently better inform their audience on a topic of interest in the midst of an important campaign cycle. The operation is ongoing, you can check it out here: http://www.tf1.fr/tmc/quotidien-avec-yann-barthes/pages/parlement-transparent.html *** Wemap developed a breakthrough map technology that has been adopted in a few months by global leaders like Le Parisien, Hachette and ministère de la Culture et de la Communication. The French-American start-up is building a smart maps platform to offer individuals and organizations a bridge to the real world: combining meaningful information and practical services. Wemap combines an intuitive user experience and a powerful tool to connect a map to any sources and publish it. By empowering publishers to create and embed live maps with their content in minutes, Wemap has already reached 4 millions monthly viewers of its maps. To learn more about Wemap’s technology: https://getwemap.com. ", "child": "2466_1\t2466_2"}