{"name": "2472", "parent": "", "title": "Resisting Operation Extract and Export", "sentences": [{"ad85": "Resisting Operation Extract and Export"}, {"bceb": "An Essay of the Man From the North"}, {"7d0e": "Don’t wait until the perils of extraction are on your doorstep, in your backyard, or poisoning your water. Look around! Pay attention to the stories coming from the north, south, east, west. See the noose of hard truth tightening."}, {"0a68": "Creative Commons CCO Image"}, {"1b66": "Oil and gas extraction is invading the United States of America, occupying this country like a foreign power comprised of global elites and wealthy interests. Every pipeline, drilling rig, and export terminal is funded by a transnational alliance of greedy crooks and criminals wearing the facade of respectability, big name banks, and brand-recognition corporate logos."}, {"7922": "These are the ideological descendants of the war criminals of human history: the tyrants, dictators, genocidal maniacs, supremacists, and conquistadors. They are the Hannibals and Genghis Khans and King George’s. They are the modern empire builders . . . and they are here to pillage and plunder, murder, rape, and destroy."}, {"92e3": "They have spewed lies for decades and brainwashed half our populace. They have produced climate change denying science and mislead our citizens. They continue to claim their oil and gas developments are for energy independence when the track record of pipelines, export terminals, and financiers is clear: they have seized power to extract and export our resources, against our will, and to line their own pockets."}, {"ac6f": "As the world’s nations shift toward renewables and ban fossil fuel extraction within their lands, a dangerous race is going on. Like teenagers with cars, the fossil fuel addicts are playing chicken. They are driving full-throttle to the cliff’s edge of extinction, believing that he who laughs last, laughs best. Whichever set of extractors holds the final fossil fuel card stands to win enormous profits in the era of expensive fossil fuel pricing. So, the greedy elites who occupy our halls of power are engaged in operation extract and export. The United States will become the cash cow of their greed as they mine the resources beneath the surface and sell them overseas."}, {"c32c": "We have been invaded, conquered and colonized once again. The irony of the situation stabs like a knife to the gut. Americans are descendants of centuries of conquest and genocide. The biggest bullies have always risen to the top. Now, we are all being subjugated clearly again. Long ago, the colonial pillage was for gold, timber, furs, and land. Today, the violence and repression is to steal the oil and gas that will poison and pollute every inch of its journey to the surface, across our landscape, to the end users and into the air. Our water, air, land, and entire planet will be destroyed by this greed."}, {"5be5": "We must rise up to stop it."}, {"24bb": "Three hundred and twenty million souls stand between this destructive greed and the beautiful fragile living Earth we inhabit. But many are passive, brainwashed, addicted to fossil fuels, in denial of climate change, bought off by the grimy lint of deep pockets, deluded by lies about energy independence, irrationally afraid of Saudis, Russians, the Chinese or whichever bogey-man of the day has been drudged up to keep the US populace in line."}, {"f754": "As for the rest of us . . . we must throw our lives into active nonviolent resistance. There is no other option. The oil and gas elites control the left and the right of our politics, which is nothing more than the apparatus of wealthy pillaging and plunder. They control the courts, which have year-by-year, decision-by-decision, built up the right of corporations over the rights of people and never granted the rest of the Earth, animals, plants, or ecosystems any rights whatsoever. There are no knights in shining armor looming on our horizon. We must do the hard, determined work of not only stopping pipelines and extraction, but taking back our democracy as well."}, {"2be4": "In politics, culture, knowledge, media, entertainment, social circles, education, finance, business — in every sector of our nation, we must wrest back popular power, and insist on shared decision-making by and of the People. We must actively build true democracy, in politics and in every other aspect of our lives. Every pipeline, oil rig, gas well, export terminal must be resisted. We have to organize campaigns to divest every dollar possible from profiting off the most destructive and dangerous industry on the planet. We must mobilize in our towns and communities for renewable energy and conservation."}, {"2f6a": "And, on top of all this, we must declare the truth: we have been invaded and occupied by greedy elites and corporate power. We can no longer accept this situation; we must change it. We must reject, actively, their lies and brainwashing. We must evict them from our halls of power."}, {"41fb": "And we must do this today, not tomorrow. We must act now . . . before we no longer have clean water to drink or air to breathe or a healthy planet that we can call home."}, {"c9e2": "_______________"}, {"4c89": "The Man From the North is a fictional writer in Rivera Sun’s novel, The Dandelion Insurrection. The novel takes place in the near future, in “a time that looms around the corner of today”, when a rising police state controlled by the corporate-political elite have plunged the nation into the grip of a hidden dictatorship. In spite of severe surveillance and repression, the Man From the North’s banned articles circulate through the American populace, reporting on resistance and fomenting nonviolent revolution. This article is one of a series written by The Man From the North, which are not included in the novel, but can be read here."}], "content": "Resisting Operation Extract and Export An Essay of the Man From the North Don’t wait until the perils of extraction are on your doorstep, in your backyard, or poisoning your water. Look around! Pay attention to the stories coming from the north, south, east, west. See the noose of hard truth tightening. Creative Commons CCO Image Oil and gas extraction is invading the United States of America, occupying this country like a foreign power comprised of global elites and wealthy interests. Every pipeline, drilling rig, and export terminal is funded by a transnational alliance of greedy crooks and criminals wearing the facade of respectability, big name banks, and brand-recognition corporate logos. These are the ideological descendants of the war criminals of human history: the tyrants, dictators, genocidal maniacs, supremacists, and conquistadors. They are the Hannibals and Genghis Khans and King George’s. They are the modern empire builders . . . and they are here to pillage and plunder, murder, rape, and destroy. They have spewed lies for decades and brainwashed half our populace. They have produced climate change denying science and mislead our citizens. They continue to claim their oil and gas developments are for energy independence when the track record of pipelines, export terminals, and financiers is clear: they have seized power to extract and export our resources, against our will, and to line their own pockets. As the world’s nations shift toward renewables and ban fossil fuel extraction within their lands, a dangerous race is going on. Like teenagers with cars, the fossil fuel addicts are playing chicken. They are driving full-throttle to the cliff’s edge of extinction, believing that he who laughs last, laughs best. Whichever set of extractors holds the final fossil fuel card stands to win enormous profits in the era of expensive fossil fuel pricing. So, the greedy elites who occupy our halls of power are engaged in operation extract and export. The United States will become the cash cow of their greed as they mine the resources beneath the surface and sell them overseas. We have been invaded, conquered and colonized once again. The irony of the situation stabs like a knife to the gut. Americans are descendants of centuries of conquest and genocide. The biggest bullies have always risen to the top. Now, we are all being subjugated clearly again. Long ago, the colonial pillage was for gold, timber, furs, and land. Today, the violence and repression is to steal the oil and gas that will poison and pollute every inch of its journey to the surface, across our landscape, to the end users and into the air. Our water, air, land, and entire planet will be destroyed by this greed. We must rise up to stop it. Three hundred and twenty million souls stand between this destructive greed and the beautiful fragile living Earth we inhabit. But many are passive, brainwashed, addicted to fossil fuels, in denial of climate change, bought off by the grimy lint of deep pockets, deluded by lies about energy independence, irrationally afraid of Saudis, Russians, the Chinese or whichever bogey-man of the day has been drudged up to keep the US populace in line. As for the rest of us . . . we must throw our lives into active nonviolent resistance. There is no other option. The oil and gas elites control the left and the right of our politics, which is nothing more than the apparatus of wealthy pillaging and plunder. They control the courts, which have year-by-year, decision-by-decision, built up the right of corporations over the rights of people and never granted the rest of the Earth, animals, plants, or ecosystems any rights whatsoever. There are no knights in shining armor looming on our horizon. We must do the hard, determined work of not only stopping pipelines and extraction, but taking back our democracy as well. In politics, culture, knowledge, media, entertainment, social circles, education, finance, business — in every sector of our nation, we must wrest back popular power, and insist on shared decision-making by and of the People. We must actively build true democracy, in politics and in every other aspect of our lives. Every pipeline, oil rig, gas well, export terminal must be resisted. We have to organize campaigns to divest every dollar possible from profiting off the most destructive and dangerous industry on the planet. We must mobilize in our towns and communities for renewable energy and conservation. And, on top of all this, we must declare the truth: we have been invaded and occupied by greedy elites and corporate power. We can no longer accept this situation; we must change it. We must reject, actively, their lies and brainwashing. We must evict them from our halls of power. And we must do this today, not tomorrow. We must act now . . . before we no longer have clean water to drink or air to breathe or a healthy planet that we can call home. _______________ The Man From the North is a fictional writer in Rivera Sun’s novel, The Dandelion Insurrection. The novel takes place in the near future, in “a time that looms around the corner of today”, when a rising police state controlled by the corporate-political elite have plunged the nation into the grip of a hidden dictatorship. In spite of severe surveillance and repression, the Man From the North’s banned articles circulate through the American populace, reporting on resistance and fomenting nonviolent revolution. This article is one of a series written by The Man From the North, which are not included in the novel, but can be read here. ", "child": "2472_1"}