{"name": "2484", "parent": "", "title": "Trump advisers abruptly cancel meeting on fate of Paris climate accord", "sentences": [{"d92e": "Trump advisers abruptly cancel meeting on fate of Paris climate accord"}, {"3cfd": "More evidence this much-hyped meeting is mostly theater."}, {"827d": "Even for a White House in as much disarray as this one, the last-minute cancellation of a much-hyped meeting on Tuesday, purportedly to decide the fate of the Paris climate agreement, is remarkable and revealing."}, {"a2cc": "For days, the White House has stage-managed the hype on this meeting as if it were the season finale of a reality show like The Voice or… Celebrity Apprentice."}, {"ca70": "Friday’s headline in Politico was typical: “White House showdown on Paris deal set for next week.” Not one, not two, but “three administration officials told Politico” this meeting would “resolve long-simmering tensions” about whether the U.S. should remain in the landmark agreement, “a major point of dispute between the moderate and nationalist wings of the White House.”"}, {"1ebb": "The stories continued through Tuesday morning, with the New York Times explaining “divided policy advisers will meet Tuesday afternoon to hash over whether Mr. Trump should withdraw the United States from the landmark Paris climate accord of 2015.” The Washington Times wrote, “Future of Paris climate deal hangs in the balance at White House.”"}, {"ad9d": "Sounds like D-Day: a long-planned and decisive fight."}, {"ccb8": "Then, just before noon, the White House pulled an Emily Litella and said “never mind.”"}, {"622d": "At 11:20, Politico reported the big meeting “has been postponed” and “it’s unclear when the meeting will be rescheduled.”"}, {"e1d6": "At 11:30, CNN reported:"}, {"45b3": "A White House official told CNN the meeting … was delayed because of “scheduling conflicts for several of the principles including several people traveling today to Wisconsin.”"}, {"32ae": "Yes, the big meeting the world has been on the edge of it seats for turned out to have scheduling conflicts for several principles."}, {"3abe": "Will you accept this robe?On Trump’s Bachelor-style Supreme Court announcement.thinkprogress.org"}, {"382a": "Seriously (or, in the White House’s case, unseriously) this weak explanation is yet more evidence that this meeting was just a stage-managed event — pure theater aimed at giving the president high visibility for “doing the right thing” and staying in the global deal to preserve a livable climate that had been unanimously approved by the world’s nations in December 2015."}, {"6805": "The problem, it would seem, is that team Trump decided the message of the day would be the president going to Wisconsin to promote jobs. There, according to the Washington Post, he will sign an executive order aimed at “harder for tech companies to replace American workers with cheaper foreign labor” and “putting American firms at an advantage when it comes to winning contracts.”"}, {"d787": "Of course, like most executive orders this president has signed, “it was not immediately clear how much the administration could accomplish without cooperation from Congress.”"}, {"43d2": "It seems increasingly likely that Trump will choose to stay with Paris now that the forces of internationalism are ascendant in the White House, as evidenced by Trump’s recent embrace of China and NATO."}, {"7945": "Formally pulling out of the Paris agreement wouldn’t gain Trump much that he can’t achieve simply by pursuing domestic actions that undermine the whole deal. But exiting the international process would make the U.S. — and the president — an overt villain."}, {"1e0d": "The U.S. will become a pariah when Trump pulls out of the Paris Climate AgreementAnd the trade war he campaigned on will be all but guaranteed.thinkprogress.org"}, {"4050": "The rescheduled showdown/meeting/photo-op is almost certain to occur in time for the president to make his decision on Paris before the G7 meeting at the end of May. But don’t worry, I’m sure the White House hype-machine will give us all plenty of advance notice."}], "content": "Trump advisers abruptly cancel meeting on fate of Paris climate accord More evidence this much-hyped meeting is mostly theater. Even for a White House in as much disarray as this one, the last-minute cancellation of a much-hyped meeting on Tuesday, purportedly to decide the fate of the Paris climate agreement, is remarkable and revealing. For days, the White House has stage-managed the hype on this meeting as if it were the season finale of a reality show like The Voice or… Celebrity Apprentice. Friday’s headline in Politico was typical: “White House showdown on Paris deal set for next week.” Not one, not two, but “three administration officials told Politico” this meeting would “resolve long-simmering tensions” about whether the U.S. should remain in the landmark agreement, “a major point of dispute between the moderate and nationalist wings of the White House.” The stories continued through Tuesday morning, with the New York Times explaining “divided policy advisers will meet Tuesday afternoon to hash over whether Mr. Trump should withdraw the United States from the landmark Paris climate accord of 2015.” The Washington Times wrote, “Future of Paris climate deal hangs in the balance at White House.” Sounds like D-Day: a long-planned and decisive fight. Then, just before noon, the White House pulled an Emily Litella and said “never mind.” At 11:20, Politico reported the big meeting “has been postponed” and “it’s unclear when the meeting will be rescheduled.” At 11:30, CNN reported: A White House official told CNN the meeting … was delayed because of “scheduling conflicts for several of the principles including several people traveling today to Wisconsin.” Yes, the big meeting the world has been on the edge of it seats for turned out to have scheduling conflicts for several principles. Will you accept this robe?On Trump’s Bachelor-style Supreme Court announcement.thinkprogress.org Seriously (or, in the White House’s case, unseriously) this weak explanation is yet more evidence that this meeting was just a stage-managed event — pure theater aimed at giving the president high visibility for “doing the right thing” and staying in the global deal to preserve a livable climate that had been unanimously approved by the world’s nations in December 2015. The problem, it would seem, is that team Trump decided the message of the day would be the president going to Wisconsin to promote jobs. There, according to the Washington Post, he will sign an executive order aimed at “harder for tech companies to replace American workers with cheaper foreign labor” and “putting American firms at an advantage when it comes to winning contracts.” Of course, like most executive orders this president has signed, “it was not immediately clear how much the administration could accomplish without cooperation from Congress.” It seems increasingly likely that Trump will choose to stay with Paris now that the forces of internationalism are ascendant in the White House, as evidenced by Trump’s recent embrace of China and NATO. Formally pulling out of the Paris agreement wouldn’t gain Trump much that he can’t achieve simply by pursuing domestic actions that undermine the whole deal. But exiting the international process would make the U.S. — and the president — an overt villain. The U.S. will become a pariah when Trump pulls out of the Paris Climate AgreementAnd the trade war he campaigned on will be all but guaranteed.thinkprogress.org The rescheduled showdown/meeting/photo-op is almost certain to occur in time for the president to make his decision on Paris before the G7 meeting at the end of May. But don’t worry, I’m sure the White House hype-machine will give us all plenty of advance notice. ", "child": "2484_1\t2484_2\t2484_3\t2484_4\t2484_5\t2484_6\t2484_7"}