{"name": "2485", "parent": "", "title": "The deep imagery of coal mining in the 1970s shows a lifestyle of peril and persistence", "sentences": [{"5b53": "The deep imagery of coal mining in the 1970s shows a lifestyle of peril and persistence"}, {"c0a6": "Proud workers, not political pawns"}, {"7db0": "Appalachian coal production has been on shaky ground almost since the industry’s inception in the mid 19th century. After the Civil War, industrialization meant a nearly limitless demand for anthracite and bituminous coal, and hundreds of thousands of new jobs spurred a population boom in the region, which stretches from western New York state to Alabama. But Appalachian coal production peaked in 1918. During the Great Depression output was nearly halved from 680 million tons to 360 million. The industry has been in slow decline ever since, compounded along the way by the rise of steam engines, mechanized extraction methods, and competition from oil and natural gas, and now renewable energy."}, {"8c11": "Coal industry labor strikes were common from the turn of the century up through the 1930s, as were catastrophic workplace injuries and the prevalence of black lung disease. By the 1940s, the United Mine Workers union had established better wages and somewhat safer conditions for miners, though a contentious relationship between workers and bosses persisted. Appalachia’s traditionally small, locally owned mines started merging with larger energy firms in the 1960s, and by 1970 bituminous coal employment had dropped to 140,000 people from its 1923 peak of 740,000. By 2003 that number had dipped to just 70,000."}, {"ce66": "In 1974, the Environmental Protection Agency commissioned photojournalist Jack Corn to document the “plight of the American coal miner” in Appalachia. Corn visited coal mines and mountain communities from Virginia to Tennessee, photographing the working and domestic lives of miner families and their struggles with low wages, unsafe working conditions, and black lung disease. His pictures also reflect a variegated experience in Appalachia, countering stereotypes by depicting middle-class miners, racial diversity, and community pride. It’s an era of company town labor we are not likely to see return as automation and renewable energy continue to render these kinds of occupations obsolete."}, {"02e2": "Trump blames his predecessor’s environmentalism for the loss of jobs in Appalachia, but the reality is a long-running product of market forces, not liberal tree-hugging. That the president’s persistent nostalgia for a yesteryear America had such visceral effect on rural voters only betrays the entrenched anxiety of a region where decline is a multi-generational way of life."}, {"33e6": "As former miner Gary Bentley of Kentucky remarked in a recent New York Times article, “It’s not going to make a comeback. But you get a certain amount of desperation, where you’re willing to believe stuff even though you know in your gut it’s not true.”"}], "content": "The deep imagery of coal mining in the 1970s shows a lifestyle of peril and persistence Proud workers, not political pawns Appalachian coal production has been on shaky ground almost since the industry’s inception in the mid 19th century. After the Civil War, industrialization meant a nearly limitless demand for anthracite and bituminous coal, and hundreds of thousands of new jobs spurred a population boom in the region, which stretches from western New York state to Alabama. But Appalachian coal production peaked in 1918. During the Great Depression output was nearly halved from 680 million tons to 360 million. The industry has been in slow decline ever since, compounded along the way by the rise of steam engines, mechanized extraction methods, and competition from oil and natural gas, and now renewable energy. Coal industry labor strikes were common from the turn of the century up through the 1930s, as were catastrophic workplace injuries and the prevalence of black lung disease. By the 1940s, the United Mine Workers union had established better wages and somewhat safer conditions for miners, though a contentious relationship between workers and bosses persisted. Appalachia’s traditionally small, locally owned mines started merging with larger energy firms in the 1960s, and by 1970 bituminous coal employment had dropped to 140,000 people from its 1923 peak of 740,000. By 2003 that number had dipped to just 70,000. In 1974, the Environmental Protection Agency commissioned photojournalist Jack Corn to document the “plight of the American coal miner” in Appalachia. Corn visited coal mines and mountain communities from Virginia to Tennessee, photographing the working and domestic lives of miner families and their struggles with low wages, unsafe working conditions, and black lung disease. His pictures also reflect a variegated experience in Appalachia, countering stereotypes by depicting middle-class miners, racial diversity, and community pride. It’s an era of company town labor we are not likely to see return as automation and renewable energy continue to render these kinds of occupations obsolete. Trump blames his predecessor’s environmentalism for the loss of jobs in Appalachia, but the reality is a long-running product of market forces, not liberal tree-hugging. That the president’s persistent nostalgia for a yesteryear America had such visceral effect on rural voters only betrays the entrenched anxiety of a region where decline is a multi-generational way of life. As former miner Gary Bentley of Kentucky remarked in a recent New York Times article, “It’s not going to make a comeback. But you get a certain amount of desperation, where you’re willing to believe stuff even though you know in your gut it’s not true.” ", "child": "2485_1\t2485_2\t2485_3\t2485_4\t2485_5\t2485_6\t2485_7\t2485_8\t2485_9\t2485_10\t2485_11\t2485_12\t2485_13\t2485_14\t2485_15\t2485_16\t2485_17\t2485_18\t2485_19\t2485_202485_1\t2485_2\t2485_3\t2485_4\t2485_5\t2485_6\t2485_7\t2485_8\t2485_9\t2485_10\t2485_11\t2485_12\t2485_13\t2485_14\t2485_15\t2485_16\t2485_17\t2485_18\t2485_19\t2485_20"}