{"name": "2488", "parent": "", "title": "This battery could revolutionize renewable energy — and it fits in your basement", "sentences": [{"82ca": "This battery could revolutionize renewable energy — and it fits in your basement"}, {"0331": "The global race for clean energy is on. Image: REUTERS/Lucy Nicholson"}, {"a3f6": "Rosamond Hutt, Formative Content"}, {"89f0": "The race is on to build the next-generation battery that could help the world switch over to clean energy. But as Bill Gates explained in his blog last year: “storing energy turns out to be surprisingly hard and expensive”."}, {"f883": "Now Harvard researchers have developed a cheap, non-toxic battery that lasts more than 10 years, which they say could be a game changer for renewable energy storage."}, {"c67a": "Image: REUTERS/Mike Blake"}, {"a8e9": "Their new type of battery stores energy in organic molecules dissolved in neutral pH water. This makes the battery non-toxic and cheaper. It’s suitable for home storage and lasts for more than a decade."}, {"2c48": "“This is a long-lasting battery you could put in your basement,” Roy Gordon, a lead researcher and the Thomas Dudley Cabot Professor of Chemistry and Professor of Materials Science, said in a Harvard news article."}, {"4e3b": "“If it spilled on the floor, it wouldn’t eat the concrete and since the medium is non-corrosive, you can use cheaper materials to build the components of the batteries, like the tanks and pumps.”"}, {"550a": "The energy storage problem"}, {"e55a": "There’s a big problem with renewable energy sources: intermittency. In other words, how to keep the lights on when the sun isn’t shining or the wind isn’t blowing."}, {"5f27": "Image: International Energy Agency"}, {"4716": "In recent years, universities and the tech sector have been working on better batteries that they hope could help solve the energy storage problem."}, {"0028": "Despite significant improvements though, batteries are riddled with issues such as high cost, toxicity and short lifespan."}, {"bc86": "Solar power customers usually have two options to store power: lithium-ion batteries such as the ones found in electronics, which are still very expensive; or lead-acid batteries. These cost half as much, but need a lot of maintenance and contain toxic materials."}, {"4102": "Image: Bloomberg New Energy Finance"}, {"1138": "An emerging and promising technology is the “v-flow” battery, which uses vanadium in large external tanks of corrosive acids. The bigger the tanks, the more energy they store. But there’s a catch: vanadium is an expensive metal and like all other battery technologies, v-flow batteries lose capacity after a few years."}, {"dc71": "Have you read?"}, {"94a9": "The quest for the next-generation battery"}, {"f246": "The US Department of Energy has set a goal of building a battery that can store energy for less than $100 per kilowatt-hour, which would make stored wind and solar energy competitive with energy produced from traditional power plants."}, {"62a3": "The Harvard researchers say their breakthrough puts them within sight of this goal."}, {"e1e2": "“If you can get anywhere near this cost target then you change the world,” said Michael Aziz, lead researcher and professor of Materials and Energy Technologies at Harvard."}, {"9ec9": "“It becomes cost effective to put batteries in so many places. This research puts us one step closer to reaching that target.”"}, {"7538": "Originally published at www.weforum.org."}], "content": "This battery could revolutionize renewable energy — and it fits in your basement The global race for clean energy is on. Image: REUTERS/Lucy Nicholson Rosamond Hutt, Formative Content The race is on to build the next-generation battery that could help the world switch over to clean energy. But as Bill Gates explained in his blog last year: “storing energy turns out to be surprisingly hard and expensive”. Now Harvard researchers have developed a cheap, non-toxic battery that lasts more than 10 years, which they say could be a game changer for renewable energy storage. Image: REUTERS/Mike Blake Their new type of battery stores energy in organic molecules dissolved in neutral pH water. This makes the battery non-toxic and cheaper. It’s suitable for home storage and lasts for more than a decade. “This is a long-lasting battery you could put in your basement,” Roy Gordon, a lead researcher and the Thomas Dudley Cabot Professor of Chemistry and Professor of Materials Science, said in a Harvard news article. “If it spilled on the floor, it wouldn’t eat the concrete and since the medium is non-corrosive, you can use cheaper materials to build the components of the batteries, like the tanks and pumps.” The energy storage problem There’s a big problem with renewable energy sources: intermittency. In other words, how to keep the lights on when the sun isn’t shining or the wind isn’t blowing. Image: International Energy Agency In recent years, universities and the tech sector have been working on better batteries that they hope could help solve the energy storage problem. Despite significant improvements though, batteries are riddled with issues such as high cost, toxicity and short lifespan. Solar power customers usually have two options to store power: lithium-ion batteries such as the ones found in electronics, which are still very expensive; or lead-acid batteries. These cost half as much, but need a lot of maintenance and contain toxic materials. Image: Bloomberg New Energy Finance An emerging and promising technology is the “v-flow” battery, which uses vanadium in large external tanks of corrosive acids. The bigger the tanks, the more energy they store. But there’s a catch: vanadium is an expensive metal and like all other battery technologies, v-flow batteries lose capacity after a few years. Have you read? The quest for the next-generation battery The US Department of Energy has set a goal of building a battery that can store energy for less than $100 per kilowatt-hour, which would make stored wind and solar energy competitive with energy produced from traditional power plants. The Harvard researchers say their breakthrough puts them within sight of this goal. “If you can get anywhere near this cost target then you change the world,” said Michael Aziz, lead researcher and professor of Materials and Energy Technologies at Harvard. “It becomes cost effective to put batteries in so many places. This research puts us one step closer to reaching that target.” Originally published at www.weforum.org. ", "child": "2488_1\t2488_2\t2488_3\t2488_42488_1\t2488_2\t2488_3\t2488_42488_1\t2488_2\t2488_3\t2488_4"}