{"name": "2502", "parent": "", "title": "A roadmap to becoming a web developer in 2017", "sentences": [{"9a50": "A roadmap to becoming a web developer in 2017"}, {"fe86": "These charts were created by GitHub user Kamranahmedse. They visualize three roadmaps to becoming a web developer."}, {"29b6": "Even though I disagree with some of his suggestions (I recommend you starting building projects almost immediately — and you will with freeCodeCamp’s curriculum), I still think this is worth reading. It will give you a birds-eye view of the modern tools that web developers use."}, {"0f1a": "Here’s his chart for front-end development:"}, {"247a": "And for back-end development:"}, {"92ad": "And for DevOps, which he views as an extension of back-end development:"}, {"6327": "Of course, these just the tools. Check out Saul Costa’s exploration of the underlying software development skills, which are far more important than the tools (5 minute read)"}, {"9585": "And here are three other links worth your time:"}, {"58e5": "Thought of the day:"}, {"ce74": "“Ever Tried. Ever failed. No matter. Try again. Fail again. Fail better.” — Samuel Beckett"}, {"48ac": "Image of the day:"}, {"bf13": "If you Google “Once in a blue moon” it will tell you the precise frequency of blue moons in hertz."}, {"3125": "Study group of the day:"}, {"9ade": "freeCodeCamp Kolkata"}, {"d1f3": "Happy coding!"}, {"ee9d": "– Quincy Larson, teacher at freeCodeCamp"}, {"1ea4": "If you get value out of these emails, please consider supporting our nonprofit."}], "content": "A roadmap to becoming a web developer in 2017 These charts were created by GitHub user Kamranahmedse. They visualize three roadmaps to becoming a web developer. Even though I disagree with some of his suggestions (I recommend you starting building projects almost immediately — and you will with freeCodeCamp’s curriculum), I still think this is worth reading. It will give you a birds-eye view of the modern tools that web developers use. Here’s his chart for front-end development: And for back-end development: And for DevOps, which he views as an extension of back-end development: Of course, these just the tools. Check out Saul Costa’s exploration of the underlying software development skills, which are far more important than the tools (5 minute read) And here are three other links worth your time: Thought of the day: “Ever Tried. Ever failed. No matter. Try again. Fail again. Fail better.” — Samuel Beckett Image of the day: If you Google “Once in a blue moon” it will tell you the precise frequency of blue moons in hertz. Study group of the day: freeCodeCamp Kolkata Happy coding! – Quincy Larson, teacher at freeCodeCamp If you get value out of these emails, please consider supporting our nonprofit. ", "child": "2502_1"}