{"name": "2506", "parent": "", "title": "A Simple Agreement for Future Tokens (or Equity)", "sentences": [{"2dbb": "A Simple Agreement for Future Tokens (or Equity)"}, {"d6dc": "There’s a very good reason startups flock to the Bay Area — it’s way easier to raise VC money there than anywhere else in the world."}, {"b695": "Why then, is there not a corresponding concentration of Ethereum startups in San Francisco? Well, it’s largely because ‘Token Sales’ have democratised access to funding for blockchain based projects."}, {"6f07": "As a contributor to several token sales, and as the co-founder of a project planning one later in the year, I am fully on board with the concept."}, {"ef99": "In several recent cases however, a fancy website, and (using the term exceedingly loosely) a “white paper”, has been all that’s necessary for a pre-product, pre-revenue startup to raise millions of dollars, thereby avoiding altogether the wheat-chaff sorting process of—crazy I know—actually building something people want before asking investors for money."}, {"03a1": "Very early stage projects do not need millions of dollars. Frugality is a vital quality in a startup. Limited resources make you focus on doing as much as you can on as little as possible—a mindset which stands you in good stead when you do have money. It makes you concentrate on hiring sparsely, but really well, and only when you absolutely need to. And you sleep soundly at night knowing that those few, amazing people you do hire, joined you because they vibe with your mission and culture, not because they’re for sale to the highest bidder."}, {"2a5d": "A few projects are making efforts to be better though."}, {"01fc": "Instead of going in for the big kill, they’re raising money more modestly, and in multiple stages — rather like the funding stages in Venture Capital. First they do a small sale—the equivalent of an Angel round. If that goes well, in the future, they can sell some more."}, {"bdaa": "Even that however, is challenging."}, {"7e74": "In the very early days of a project, it’s hard to know if issuing a token is really the right thing to do. Even if you’re certain your protocol/dApp requires a token, it can be complicated to design for compliance with the relevant regulations — most notably concerning US securities."}, {"14b5": "There has been some excellent work done to make this easier for projects by the likes of Coinbase, but it’s only a reference. Conducting a token sale properly absolutely requires specialist legal counsel, and a suitable legal entity to conduct the sale."}, {"7abb": "If all that sounds expensive, it’s because it is. Typically way out of budget for a couple of dudes in a basement. Yet conducting a token sale without first putting your house in order legally speaking, jeopardises both project, and token purchaser."}, {"456c": "When COLONY raised seed capital, we knew that our protocol ideally required the distribution of a native token. What we did not know however, was whether, from a regulatory perspective, it would be feasible to issue one."}, {"7021": "Consequently, we drafted an agreement which would entitle those from whom we raised capital tokens at a modest discount if we held a token sale, or equity at the same discount if we instead raised Venture Capital."}, {"fc02": "This is it:"}, {"a6ce": "You’re damn right it’s on Swarm."}, {"863e": "It’s based on YCombinator’s SAFE: Simple Agreement for Future Equity. We’ve called it, imaginatively enough, the SAFTE: Simple Agreement for Future Tokens or Equity. Specifically, it’s based on the ‘Discount, no Cap’ SAFE, which felt like the right balance of benefit to the purchaser for the higher risk they were taking, and fairness to the wider community who will ultimately be custodians of the Colony Network."}, {"a063": "It provides a level of security to the purchaser of the SAFTE, that if for any reason the token sale does not take place, they have a right to equity in the company instead."}, {"94e1": "The principle benefits of the SAFTE are:"}, {"7b26": "This agreement enabled us to raise several rounds of funding, under the same terms without undertaking additional onerous paperwork, simply by demonstrating our consistent progress and operational excellence."}, {"b009": "We think this is a more responsible way for early stage Ethereum projects to raise their initial funding, and we’re excited to make it available for others in the community to use. Indeed, a couple of your favourite projects within the Ethersphere already have. 😉"}, {"b9de": "Needless to say, we do not assume any responsibility for any consequence of using this document. You should consult your own lawyer if you are considering using it. This was drafted to be applicable under law in England and Wales, and will likely require amendment to be applicable in other jurisdictions. Finally, anyone entering into such an agreement should take appropriate tax advice before doing so."}, {"71ed": "This work is licensed under a Creative Commons Attribution 4.0 International License."}, {"bd14": "Open Collaboration for Open Organisations"}, {"2a6f": "Join the conversation on Slack, follow us on Twitter, or sign up for (occasional) email updates."}], "content": "A Simple Agreement for Future Tokens (or Equity) There’s a very good reason startups flock to the Bay Area — it’s way easier to raise VC money there than anywhere else in the world. Why then, is there not a corresponding concentration of Ethereum startups in San Francisco? Well, it’s largely because ‘Token Sales’ have democratised access to funding for blockchain based projects. As a contributor to several token sales, and as the co-founder of a project planning one later in the year, I am fully on board with the concept. In several recent cases however, a fancy website, and (using the term exceedingly loosely) a “white paper”, has been all that’s necessary for a pre-product, pre-revenue startup to raise millions of dollars, thereby avoiding altogether the wheat-chaff sorting process of—crazy I know—actually building something people want before asking investors for money. Very early stage projects do not need millions of dollars. Frugality is a vital quality in a startup. Limited resources make you focus on doing as much as you can on as little as possible—a mindset which stands you in good stead when you do have money. It makes you concentrate on hiring sparsely, but really well, and only when you absolutely need to. And you sleep soundly at night knowing that those few, amazing people you do hire, joined you because they vibe with your mission and culture, not because they’re for sale to the highest bidder. A few projects are making efforts to be better though. Instead of going in for the big kill, they’re raising money more modestly, and in multiple stages — rather like the funding stages in Venture Capital. First they do a small sale—the equivalent of an Angel round. If that goes well, in the future, they can sell some more. Even that however, is challenging. In the very early days of a project, it’s hard to know if issuing a token is really the right thing to do. Even if you’re certain your protocol/dApp requires a token, it can be complicated to design for compliance with the relevant regulations — most notably concerning US securities. There has been some excellent work done to make this easier for projects by the likes of Coinbase, but it’s only a reference. Conducting a token sale properly absolutely requires specialist legal counsel, and a suitable legal entity to conduct the sale. If all that sounds expensive, it’s because it is. Typically way out of budget for a couple of dudes in a basement. Yet conducting a token sale without first putting your house in order legally speaking, jeopardises both project, and token purchaser. When COLONY raised seed capital, we knew that our protocol ideally required the distribution of a native token. What we did not know however, was whether, from a regulatory perspective, it would be feasible to issue one. Consequently, we drafted an agreement which would entitle those from whom we raised capital tokens at a modest discount if we held a token sale, or equity at the same discount if we instead raised Venture Capital. This is it: You’re damn right it’s on Swarm. It’s based on YCombinator’s SAFE: Simple Agreement for Future Equity. We’ve called it, imaginatively enough, the SAFTE: Simple Agreement for Future Tokens or Equity. Specifically, it’s based on the ‘Discount, no Cap’ SAFE, which felt like the right balance of benefit to the purchaser for the higher risk they were taking, and fairness to the wider community who will ultimately be custodians of the Colony Network. It provides a level of security to the purchaser of the SAFTE, that if for any reason the token sale does not take place, they have a right to equity in the company instead. The principle benefits of the SAFTE are: This agreement enabled us to raise several rounds of funding, under the same terms without undertaking additional onerous paperwork, simply by demonstrating our consistent progress and operational excellence. We think this is a more responsible way for early stage Ethereum projects to raise their initial funding, and we’re excited to make it available for others in the community to use. Indeed, a couple of your favourite projects within the Ethersphere already have. 😉 Needless to say, we do not assume any responsibility for any consequence of using this document. You should consult your own lawyer if you are considering using it. This was drafted to be applicable under law in England and Wales, and will likely require amendment to be applicable in other jurisdictions. Finally, anyone entering into such an agreement should take appropriate tax advice before doing so. This work is licensed under a Creative Commons Attribution 4.0 International License. Open Collaboration for Open Organisations Join the conversation on Slack, follow us on Twitter, or sign up for (occasional) email updates. ", "child": "2506_1\t2506_2\t2506_3\t2506_4\t2506_5\t2506_6\t2506_7\t2506_82506_1\t2506_2\t2506_3\t2506_4\t2506_5\t2506_6\t2506_7\t2506_82506_1\t2506_2\t2506_3\t2506_4\t2506_5\t2506_6\t2506_7\t2506_82506_1\t2506_2\t2506_3\t2506_4\t2506_5\t2506_6\t2506_7\t2506_8"}