{"name": "2507", "parent": "", "title": "The Reinvention of Film & Television Distribution", "sentences": [{"5942": "SingularDTV: The Reinvention of Film & Television Distribution"}, {"2e2b": "The Beginning of the End for Netflix, Hulu and Amazon"}, {"01a1": "by Zach LeBeau, CEO of SingularDTV"}, {"c0e2": "The addition of Jason Tyrrell as VP of Content for SingularDTV marks the beginning of a new era for film and television distribution — the beginning of the end for Netflix and all the rest. Yes, a bold statement. I’m confident writing it. Netflix and Amazon may be multi-billion dollar platforms but they’re flying on propeller engine technology — so to speak — and blockchain is a spaceship powered by the latest in warp drive technology. Mark this moment in time, the hiring of Jason, as a crucial step forward in challenging Hollywood and laying the foundation for a decentralized entertainment industry."}, {"2733": "The entertainment industry doesn’t know SingularDTV exists yet. We like it that way. It’s part of our overall strategy as we develop and launch our platform and slowly gain content and users over the next few years. When the “majors” wake up to blockchain tech they’ll be way behind, throwing billions at companies like SingularDTV just to catch up and stay relevant."}, {"5c62": "It’s interesting to hear Reed Hastings, CEO of Netflix, proclaim the death of cinema. Hollywood as we know it is already dead. Inflammatory words that strike at the hearts and egos of the studios and the Hollywood establishment, aka the Hollywood monarchy. Of course it’s all true, we’ve been watching the decay and dismantling of the studio/Hollywood system in various ways for decades. It’s called evolution. But the subscription numbers have just come in for Netflix, they’ve peaked. In addition, they’re spending $6 billion on original content this year. Yes, their model usurps the old model by using the internet as best it can, but it’s unsustainable because its not decentralized and the internet’s functionality is far behind the capability of what blockchain technology can offer. Decentralization takes the burden and cost of supplying original content off the shoulders of one entity and transforms it into the natural network effect of countless original content creators from around the world. The efficiencies are unparalleled."}, {"cc42": "Netflix talks about the death of cinema while at the height of their power. How ironic that they too are the walking dead and don’t even know it yet."}, {"feff": "As CEO of SingularDTV I see this as the future — decentralize or die. Integrate decentralized computing into your platform or become extinct. It could take 10 years before Netflix knows it’s dead, perhaps longer before it’s proven true, but every version of my future reality tells me this is so. What I cannot see is whether Netflix will be looking to buy SingularDTV in order to decentralize and survive, or if SingularDTV will end up buying Netflix?"}, {"8c4f": "Okay, the above comment about buying Netflix doesn’t really fit into a decentralized future. SingularDTV Co-founder Joseph Lubin points out that if we’re thinking in terms of centralized entities potentially owning each other, then SingularDTV too will be ripe for disruption by something that is truly decentralized. Full decentralization where all potential stakeholders have ownership and skin in the game is the most stable configuration. This is SingularDTV’s ultimate goal, a truly decentralized entertainment economy the steps of which are described in SingularDTV’s Economic Model."}, {"2425": "Our VP of Content, Jason Tyrrell, has been in the distribution game in Hollywood for over 10 years. SingularDTV is fortunate to have him head the effort to build our content acquisition department. This is an innovative and visionary hire made by Kim Jackson, a SingularDTV co-founder and our President of Entertainment. It’s Kim’s primary mission to make sure our platform has the best content possible, acquired and original. Perfect timing and serendipity led to the recruiting of Jason from his previous position as Director of Content for the entertainment aggregator Vubiquity. For those of you that don’t know, entertainment aggregators are an example of Hollywood’s well established strata of intermediaries. They basically broker the deals between the content creators and distributors. More than that, they shepherd this content to the viewers on any screen, whether it be Netflix, Hulu or Amazon, on your television set, laptop or cellphone. In fact, every piece of digitized film or television content goes through a company like Vubiquity. They work with nearly 650 leading film studios, television networks, independent producers and MCNs to bring “premium” content to over 1,000 global video distributors spanning 109 million households. Jason’s in the middle of all of this, brokering the deals and conducting the flow of content from creator to screen. Now he’s here with SingularDTV."}, {"d68c": "In a decentralized entertainment industry there are no aggregators. Jason will be building the bridge to ultimately render such intermediaries obsolete. He works with all the Hollywood content owners/publishers, including the major studios and networks, and knows how to distribute to nearly a thousand end points in 80+ languages and 120+ countries. He’s touched nearly every piece of mainstream film and television content released in the US during his time at Vubiquity. Hundreds of feature titles, thousands of hours of television, millions of audience members. Maintaining an eye on that level of scale is a huge undertaking that was supported by scores of hard-working staff members at offices in Los Angeles, Toronto, and London, among others. And now Jason will be utilizing his expertise to help build SingularDTV into a content distribution platform to one day rival Netflix."}, {"1b93": "Jason’s mission is multi-phased, as are all of the strategies at SingularDTV. We’ll acquire similar content the “majors” have and the addition of our own original content will allow SingularDTV to compete internationally as a distribution platform. But more than this, acquiring and facilitating such content to viewers will force us to build a real, working distribution infrastructure on the blockchain, an infrastructure that currently may not be able to handle the load. Just as SingularDTV had to create the tools to build its Smart Contract System, tokenized ecosystem and SNGLS token, we must also forge ahead and build the tools to allow an infrastructure like this to exist, anchored on Ethereum. This is no small task. It will be harder and take longer than anticipated, but in doing so will add incredible value to SingularDTV. And not just for English and Chinese speaking audiences but for audiences all around the world and in every language. As content creators realize the control and transparency that using SingularDTV affords them, we’ll be the platform for the most progressive and cutting edge artists. This will generate audience. I haven’t even mentioned all the additional functionality that SingularDTV will offer its users, functions that have mostly remained secret."}, {"ca8b": "Throughout Jason’s distribution career he maintained multi-million dollar revenue lines at a time of huge upheaval in how audiences find and connect with content, and he directly managed the relationships with every major studio and 30+ independent distributors. He handled the dealmaking, the drafting, negotiation, and eventual signing of literally dozens of content deals, with both the largest, most powerful studios in the world, and the smallest, most passionate indie labels."}, {"f750": "The most amazing thing about Jason is that he “get’s it”. Although new to Ethereum and blockchain technology, he has the most important quality that is the hardest to find — a decentralizing mindset. We’re looking forward to breaking glass and causing a little upheaval along the way to building an alternative for creators and audience."}, {"2e32": "Stay tuned for exciting things to come and please join us at https://slack.singulardtv.com/to learn more."}, {"44dc": "Zach LeBeau, CEO of SingularDTV"}], "content": "SingularDTV: The Reinvention of Film & Television Distribution The Beginning of the End for Netflix, Hulu and Amazon by Zach LeBeau, CEO of SingularDTV The addition of Jason Tyrrell as VP of Content for SingularDTV marks the beginning of a new era for film and television distribution — the beginning of the end for Netflix and all the rest. Yes, a bold statement. I’m confident writing it. Netflix and Amazon may be multi-billion dollar platforms but they’re flying on propeller engine technology — so to speak — and blockchain is a spaceship powered by the latest in warp drive technology. Mark this moment in time, the hiring of Jason, as a crucial step forward in challenging Hollywood and laying the foundation for a decentralized entertainment industry. The entertainment industry doesn’t know SingularDTV exists yet. We like it that way. It’s part of our overall strategy as we develop and launch our platform and slowly gain content and users over the next few years. When the “majors” wake up to blockchain tech they’ll be way behind, throwing billions at companies like SingularDTV just to catch up and stay relevant. It’s interesting to hear Reed Hastings, CEO of Netflix, proclaim the death of cinema. Hollywood as we know it is already dead. Inflammatory words that strike at the hearts and egos of the studios and the Hollywood establishment, aka the Hollywood monarchy. Of course it’s all true, we’ve been watching the decay and dismantling of the studio/Hollywood system in various ways for decades. It’s called evolution. But the subscription numbers have just come in for Netflix, they’ve peaked. In addition, they’re spending $6 billion on original content this year. Yes, their model usurps the old model by using the internet as best it can, but it’s unsustainable because its not decentralized and the internet’s functionality is far behind the capability of what blockchain technology can offer. Decentralization takes the burden and cost of supplying original content off the shoulders of one entity and transforms it into the natural network effect of countless original content creators from around the world. The efficiencies are unparalleled. Netflix talks about the death of cinema while at the height of their power. How ironic that they too are the walking dead and don’t even know it yet. As CEO of SingularDTV I see this as the future — decentralize or die. Integrate decentralized computing into your platform or become extinct. It could take 10 years before Netflix knows it’s dead, perhaps longer before it’s proven true, but every version of my future reality tells me this is so. What I cannot see is whether Netflix will be looking to buy SingularDTV in order to decentralize and survive, or if SingularDTV will end up buying Netflix? Okay, the above comment about buying Netflix doesn’t really fit into a decentralized future. SingularDTV Co-founder Joseph Lubin points out that if we’re thinking in terms of centralized entities potentially owning each other, then SingularDTV too will be ripe for disruption by something that is truly decentralized. Full decentralization where all potential stakeholders have ownership and skin in the game is the most stable configuration. This is SingularDTV’s ultimate goal, a truly decentralized entertainment economy the steps of which are described in SingularDTV’s Economic Model. Our VP of Content, Jason Tyrrell, has been in the distribution game in Hollywood for over 10 years. SingularDTV is fortunate to have him head the effort to build our content acquisition department. This is an innovative and visionary hire made by Kim Jackson, a SingularDTV co-founder and our President of Entertainment. It’s Kim’s primary mission to make sure our platform has the best content possible, acquired and original. Perfect timing and serendipity led to the recruiting of Jason from his previous position as Director of Content for the entertainment aggregator Vubiquity. For those of you that don’t know, entertainment aggregators are an example of Hollywood’s well established strata of intermediaries. They basically broker the deals between the content creators and distributors. More than that, they shepherd this content to the viewers on any screen, whether it be Netflix, Hulu or Amazon, on your television set, laptop or cellphone. In fact, every piece of digitized film or television content goes through a company like Vubiquity. They work with nearly 650 leading film studios, television networks, independent producers and MCNs to bring “premium” content to over 1,000 global video distributors spanning 109 million households. Jason’s in the middle of all of this, brokering the deals and conducting the flow of content from creator to screen. Now he’s here with SingularDTV. In a decentralized entertainment industry there are no aggregators. Jason will be building the bridge to ultimately render such intermediaries obsolete. He works with all the Hollywood content owners/publishers, including the major studios and networks, and knows how to distribute to nearly a thousand end points in 80+ languages and 120+ countries. He’s touched nearly every piece of mainstream film and television content released in the US during his time at Vubiquity. Hundreds of feature titles, thousands of hours of television, millions of audience members. Maintaining an eye on that level of scale is a huge undertaking that was supported by scores of hard-working staff members at offices in Los Angeles, Toronto, and London, among others. And now Jason will be utilizing his expertise to help build SingularDTV into a content distribution platform to one day rival Netflix. Jason’s mission is multi-phased, as are all of the strategies at SingularDTV. We’ll acquire similar content the “majors” have and the addition of our own original content will allow SingularDTV to compete internationally as a distribution platform. But more than this, acquiring and facilitating such content to viewers will force us to build a real, working distribution infrastructure on the blockchain, an infrastructure that currently may not be able to handle the load. Just as SingularDTV had to create the tools to build its Smart Contract System, tokenized ecosystem and SNGLS token, we must also forge ahead and build the tools to allow an infrastructure like this to exist, anchored on Ethereum. This is no small task. It will be harder and take longer than anticipated, but in doing so will add incredible value to SingularDTV. And not just for English and Chinese speaking audiences but for audiences all around the world and in every language. As content creators realize the control and transparency that using SingularDTV affords them, we’ll be the platform for the most progressive and cutting edge artists. This will generate audience. I haven’t even mentioned all the additional functionality that SingularDTV will offer its users, functions that have mostly remained secret. Throughout Jason’s distribution career he maintained multi-million dollar revenue lines at a time of huge upheaval in how audiences find and connect with content, and he directly managed the relationships with every major studio and 30+ independent distributors. He handled the dealmaking, the drafting, negotiation, and eventual signing of literally dozens of content deals, with both the largest, most powerful studios in the world, and the smallest, most passionate indie labels. The most amazing thing about Jason is that he “get’s it”. Although new to Ethereum and blockchain technology, he has the most important quality that is the hardest to find — a decentralizing mindset. We’re looking forward to breaking glass and causing a little upheaval along the way to building an alternative for creators and audience. Stay tuned for exciting things to come and please join us at https://slack.singulardtv.com/to learn more. Zach LeBeau, CEO of SingularDTV ", "child": "2507_1\t2507_2\t2507_3\t2507_4"}