{"name": "2515", "parent": "", "title": "Chronobank to partner with SONM", "sentences": [{"d798": "Chronobank to partner with SONM"}, {"b014": "SONM ICO will accept Chronobank TIME tokens!"}, {"1056": "At Chronobank, we have always maintained that we support progress and we believe in Blockchain and its applications in the real world."}, {"7007": "We scout the landscape for the projects the we can support and help further. We have decided to join forces with guys from SONM in their quest to develop better and more efficient computational processes based on blockchain."}, {"b79d": "SONM is a global operating system that is a decentralized worldwide fog supercomputer, which has the potential to include any computing power in the world (IoE, IoT). Worldwide computations organized using SONM can serve to complete any number of tasks from CGI rendering to scientific computations."}, {"ee68": "Chronobank CEO Sergei Sergienko has joined advisory board of SONM and will also act as an escrow in the project during its upcoming pre-sale and followed by ICO."}, {"7654": "SONM will be the first project to accept Chronobank’s TIME tokens in their ICO."}, {"7de0": "We would like to announce that we believe that this project has great potential and would like to urge all of our supporters to check it out. SONM’s pre-sale starts in one hour."}, {"9316": "For more information, do not hesitate to contact us or the rest of the SONM team on their slack."}, {"248b": "http://sonm.io"}], "content": "Chronobank to partner with SONM SONM ICO will accept Chronobank TIME tokens! At Chronobank, we have always maintained that we support progress and we believe in Blockchain and its applications in the real world. We scout the landscape for the projects the we can support and help further. We have decided to join forces with guys from SONM in their quest to develop better and more efficient computational processes based on blockchain. SONM is a global operating system that is a decentralized worldwide fog supercomputer, which has the potential to include any computing power in the world (IoE, IoT). Worldwide computations organized using SONM can serve to complete any number of tasks from CGI rendering to scientific computations. Chronobank CEO Sergei Sergienko has joined advisory board of SONM and will also act as an escrow in the project during its upcoming pre-sale and followed by ICO. SONM will be the first project to accept Chronobank’s TIME tokens in their ICO. We would like to announce that we believe that this project has great potential and would like to urge all of our supporters to check it out. SONM’s pre-sale starts in one hour. For more information, do not hesitate to contact us or the rest of the SONM team on their slack. http://sonm.io ", "child": "2515_1\t2515_2"}