{"name": "2520", "parent": "", "title": "ChronoBank Dev Update #7", "sentences": [{"84ad": "ChronoBank Dev Update #7"}, {"5bb7": "ChronoWallet and ChronoMint ready for public Beta"}, {"73de": "We have completed most of the features detailed in the ChronoBank white paper and are glad to be able to announce our public Beta release. This will be deployed to the upcoming Kovan testnet on Ethereum. The ChronoMint frontend itself will be distributed over the IPFS (InterPlanetary File System) and will be available on beta.chronobank.io. Issues tracking and a bounty rewards program for the most active beta testers will be announced soon."}, {"c4a0": "Additionally, the first issuance of LHAU — the Australian dollar Labour Hour token — will soon be made. This will be a major milestone for ChronoBank!"}, {"83b8": "Testnet spam"}, {"c0a2": "When we were preparing ChronoMint for beta deployment, we discovered that the Ropsten testnet was clogged with spam transactions, effectively bringing it to a halt. This spam attack demonstrates an important principle to the Ethereum community. We must be better prepared to co-ordinate our response to this kind of attack, even if they are unlikely to occur on mainnet."}, {"d28f": "Fortunately, the next version of the Ethereum testnet, Kovan, has been announced by the Parity community. Although this new testnet is incompatible with geth nodes, it uses the PoA (Proof of Authority) consensus, which should improve its resilience to spam attacks. ChronoBank has also made an application to become a trusted validator for the new testnet."}, {"12c7": "PoA is a replacement for PoW and can be used for both public and private chain setups. There is no mining involved to secure the network with PoA. Instead, it relies on trusted ‘Validators’ to ensure that legitimate transactions are added to blocks, and are processed and executed by the EVM faithfully."}, {"3700": "Because mining does not occur on our proposed public testnet, malicious actors are prevented from acquiring testnet Ether — solving the spam attack that Ropsten currently faces. There is no difference in the way that contracts are executed on PoA and PoW chains, so developers can test their contracts and user interfaces before deploying to the mainnet in a more reliable and convenient environment."}, {"84a2": "Aside from solving the critical stability issue of the ongoing Ropsten ‘spam attack’, there are additional benefits for providing a public consortium PoA network:"}, {"554a": "More information about PoA can be found at https://github.com/ethcore/parity/wiki/Proof-of-Authority-Chains."}, {"1d96": "LaborX"}, {"eecf": "The LaborX white paper is finished, and we are starting active project development. The first commits in the LaborX github repository will be available from next week. We are still discussing whether we should use middleware servers in LaborX for caching or any other purposes regarding business logic, as described in the white paper."}, {"15bb": "Members of the community who have ideas and feedback about LaborX architecture are invited to share these with us. The most active contributors will be rewarded with bounties."}, {"da3f": "Two Week Software Cycle"}, {"7cd9": "We are pleased to announce that we will be switching from a feature-based versioning and release model to a continuous release model with a two-week, two-phase software cycle."}, {"71b3": "The first phase is a one week merge period. In this week any stable Pull Requests will be accepted into the development branch. The second phase is a one week test/regression and release period. During this stage we will branch a new release/version, then test, patch or undo any PRs that are unstable."}, {"e2bb": "This will allow a process of continual deployment and incremental improvement for LaborX, while also allowing features to develop and mature before being included into the release version. The approach also allows us to ‘roll back’ or regress certain changes, should they become problematic. Hopefully this will enable us to release a new version of LaborX consistently every two weeks ."}, {"ac18": "That’s all for now!"}, {"e884": "https://chronobank.io"}], "content": "ChronoBank Dev Update #7 ChronoWallet and ChronoMint ready for public Beta We have completed most of the features detailed in the ChronoBank white paper and are glad to be able to announce our public Beta release. This will be deployed to the upcoming Kovan testnet on Ethereum. The ChronoMint frontend itself will be distributed over the IPFS (InterPlanetary File System) and will be available on beta.chronobank.io. Issues tracking and a bounty rewards program for the most active beta testers will be announced soon. Additionally, the first issuance of LHAU — the Australian dollar Labour Hour token — will soon be made. This will be a major milestone for ChronoBank! Testnet spam When we were preparing ChronoMint for beta deployment, we discovered that the Ropsten testnet was clogged with spam transactions, effectively bringing it to a halt. This spam attack demonstrates an important principle to the Ethereum community. We must be better prepared to co-ordinate our response to this kind of attack, even if they are unlikely to occur on mainnet. Fortunately, the next version of the Ethereum testnet, Kovan, has been announced by the Parity community. Although this new testnet is incompatible with geth nodes, it uses the PoA (Proof of Authority) consensus, which should improve its resilience to spam attacks. ChronoBank has also made an application to become a trusted validator for the new testnet. PoA is a replacement for PoW and can be used for both public and private chain setups. There is no mining involved to secure the network with PoA. Instead, it relies on trusted ‘Validators’ to ensure that legitimate transactions are added to blocks, and are processed and executed by the EVM faithfully. Because mining does not occur on our proposed public testnet, malicious actors are prevented from acquiring testnet Ether — solving the spam attack that Ropsten currently faces. There is no difference in the way that contracts are executed on PoA and PoW chains, so developers can test their contracts and user interfaces before deploying to the mainnet in a more reliable and convenient environment. Aside from solving the critical stability issue of the ongoing Ropsten ‘spam attack’, there are additional benefits for providing a public consortium PoA network: More information about PoA can be found at https://github.com/ethcore/parity/wiki/Proof-of-Authority-Chains. LaborX The LaborX white paper is finished, and we are starting active project development. The first commits in the LaborX github repository will be available from next week. We are still discussing whether we should use middleware servers in LaborX for caching or any other purposes regarding business logic, as described in the white paper. Members of the community who have ideas and feedback about LaborX architecture are invited to share these with us. The most active contributors will be rewarded with bounties. Two Week Software Cycle We are pleased to announce that we will be switching from a feature-based versioning and release model to a continuous release model with a two-week, two-phase software cycle. The first phase is a one week merge period. In this week any stable Pull Requests will be accepted into the development branch. The second phase is a one week test/regression and release period. During this stage we will branch a new release/version, then test, patch or undo any PRs that are unstable. This will allow a process of continual deployment and incremental improvement for LaborX, while also allowing features to develop and mature before being included into the release version. The approach also allows us to ‘roll back’ or regress certain changes, should they become problematic. Hopefully this will enable us to release a new version of LaborX consistently every two weeks . That’s all for now! https://chronobank.io ", "child": "2520_1"}