{"name": "2522", "parent": "", "title": "TIME token reward model 2.0", "sentences": [{"9d66": "TIME token reward model 2.0"}, {"a2cc": "The TIME tokens purchased by backers at ICO will receive rewards based on activity within the ChronoBank ecosystem — similar to the mining or staking fees collected by active nodes in a regular cryptocurrency network. In order to be eligible for these rewards, TIME holders will need to transfer their tokens to a mining contract balance."}, {"f047": "Over the last few days a significant proportion of the total supply of TIME tokens created after our successful ICO ended have been distributed to ChronoBank participants."}, {"e9ec": "We decided to improve the old reward model to make it SEC compliant and deliver more fees to TIME token holders than we initially promised."}, {"716d": "Unlike many other appcoins, ChronoBank’s TIME tokens have a real-world use-case built in from day one. We have not targeted speculation as a means of raising market cap. Instead, by delivering our cryptographic tokens to buyers, we are making anyone who holds TIME an intrinsic part of the ChronoBank ecosystem, and the partial owner of the Labour Hour and LaborX software platform — just as if they held a share in the real estate market."}, {"28e6": "In the course of designing the ChronoBank platform, we considered a number of approaches to reward our backers. The revenue model for ChronoBank is straightforward: every time that Labour Hour (LH) tokens are issued or transacted, and every time workers get paid on the decentralised LaborX exchange, a small fee is incurred. The decentralised nature of the blockchain means that these fees can be significantly smaller than those of a traditional recruitment agency. This is a fundamental feature that will allow us to transform the inefficient short-term recruitment sector and make it more effective."}, {"a377": "Distribution of revenues"}, {"21bd": "In order to distribute these fees to TIME holders, we have opted for a ‘mining rewards’ approach. In theory, it might be technically simpler to dividend them out to holders. This, however, will inevitably cause problems for the majority of TIME owners, since it raises red flags from a regulatory viewpoint in several key jurisdictions — particularly the US, where it would clearly signal that TIME was a security under the criteria laid out in the Howey test. This would mean that holders and indeed ChronoBank as an organisation could expect legal challenges in the future."}, {"e794": "Holding TIME tokens allows members of the ChronoBank ecosystem to perform a broad range of activities. These include:"}, {"55b1": "This article focuses on the procedure required to ‘register’ your TIME tokens for mining rewards."}, {"20ea": "Mining"}, {"cc42": "The concept behind “mining” is that the LaborX platform uses ERC20 compatible assets by design, for operation registration and data storage on top of the Ethereum blockchain. (A parallel example might be something like HTTP or SMTP operating on top of TCP/IP networks.) What makes these assets valuable lies in their use cases, rather than being intrinsic to the ERC20 token itself. In this instance, their value is tied to the activity within the ChronoBank ecosystem, since LH are ‘backed’ by labour time."}, {"12ea": "Any TIME token holder can participate in mining once the LaborX platform is up and running, and there is activity on the LaborX exchange. The process is as follows:"}, {"5b16": "The process can quickly and easily be completed from within the ChronoWallet or LaborX Dapp, and is akin to locking coins for staking in other wallets. In this way, we hope to ensure that it is profitable to hold TIME tokens without falling foul of any regulatory bodies that will regard the distribution of dividends as a breach of securities laws."}, {"5c4b": "Voting of TIME token holders will determine whether or not any reward model changes are made."}, {"3243": "http://chronobank.io"}], "content": "TIME token reward model 2.0 The TIME tokens purchased by backers at ICO will receive rewards based on activity within the ChronoBank ecosystem — similar to the mining or staking fees collected by active nodes in a regular cryptocurrency network. In order to be eligible for these rewards, TIME holders will need to transfer their tokens to a mining contract balance. Over the last few days a significant proportion of the total supply of TIME tokens created after our successful ICO ended have been distributed to ChronoBank participants. We decided to improve the old reward model to make it SEC compliant and deliver more fees to TIME token holders than we initially promised. Unlike many other appcoins, ChronoBank’s TIME tokens have a real-world use-case built in from day one. We have not targeted speculation as a means of raising market cap. Instead, by delivering our cryptographic tokens to buyers, we are making anyone who holds TIME an intrinsic part of the ChronoBank ecosystem, and the partial owner of the Labour Hour and LaborX software platform — just as if they held a share in the real estate market. In the course of designing the ChronoBank platform, we considered a number of approaches to reward our backers. The revenue model for ChronoBank is straightforward: every time that Labour Hour (LH) tokens are issued or transacted, and every time workers get paid on the decentralised LaborX exchange, a small fee is incurred. The decentralised nature of the blockchain means that these fees can be significantly smaller than those of a traditional recruitment agency. This is a fundamental feature that will allow us to transform the inefficient short-term recruitment sector and make it more effective. Distribution of revenues In order to distribute these fees to TIME holders, we have opted for a ‘mining rewards’ approach. In theory, it might be technically simpler to dividend them out to holders. This, however, will inevitably cause problems for the majority of TIME owners, since it raises red flags from a regulatory viewpoint in several key jurisdictions — particularly the US, where it would clearly signal that TIME was a security under the criteria laid out in the Howey test. This would mean that holders and indeed ChronoBank as an organisation could expect legal challenges in the future. Holding TIME tokens allows members of the ChronoBank ecosystem to perform a broad range of activities. These include: This article focuses on the procedure required to ‘register’ your TIME tokens for mining rewards. Mining The concept behind “mining” is that the LaborX platform uses ERC20 compatible assets by design, for operation registration and data storage on top of the Ethereum blockchain. (A parallel example might be something like HTTP or SMTP operating on top of TCP/IP networks.) What makes these assets valuable lies in their use cases, rather than being intrinsic to the ERC20 token itself. In this instance, their value is tied to the activity within the ChronoBank ecosystem, since LH are ‘backed’ by labour time. Any TIME token holder can participate in mining once the LaborX platform is up and running, and there is activity on the LaborX exchange. The process is as follows: The process can quickly and easily be completed from within the ChronoWallet or LaborX Dapp, and is akin to locking coins for staking in other wallets. In this way, we hope to ensure that it is profitable to hold TIME tokens without falling foul of any regulatory bodies that will regard the distribution of dividends as a breach of securities laws. Voting of TIME token holders will determine whether or not any reward model changes are made. http://chronobank.io ", "child": "2522_1"}