{"name": "2528", "parent": "", "title": "Taiwan AML reforms & USD/Crypto Drama", "sentences": [{"6f6f": "Taiwan AML reforms & USD/Crypto Drama"}, {"fc14": "There is a ton of unsubstantiated fud and misinformation going around about the current state of US Dollar in crypto services to the point where a solid facts only article needs to be written."}, {"de79": "Bitfinex USD woes"}, {"b7fa": "By now, most know the Bitfinex situation around withdrawals and deposits. This is the start and main source of the drama chatter on social media but here’s quick *facts only* recap"}, {"aa3a": "· March 23 2017 — first noted delay receiving US Dollar withdrawal from Bitfinex ."}, {"d763": "· March 31 2017 — Wells Fargo , a major clearing and intermediary bank, starts denying incoming wires to cryptocurrency and MSB based business including Bitfinex citing major Tiawan banking AML reforms. (more on that below). Incoming wires still functioned at this time"}, {"a400": "· April 3 2017 — Bitfinex repays outstanding debt on bfxtokens by cash deposit or converting to dividend yielding share holders."}, {"5602": "· April 5 2017 — Bitfinex v. Well Fargo lawsuit is filed as WF is not responding to general inquiries from bitfinex or their bank regarding withdrawl issues citing BFX is not their direct customer or a bank."}, {"a20b": "· April 12 2017 — Bitfinex withdraw lawsuit is withdrawn. Banks are private institutions in the USA and have the rights to do business with whom ever and what countries they want."}, {"731a": "· April 17 2017 — Bitfinex’s Bank in Taiwan warns of halts all incoming USD wires deposits. Later news states all deposits were halted."}, {"0233": "· April 18 2017 — Hong Kong Dollar Dollar (hkd) and Swiss Franc (CHF) withdrawls are offered with several other major currencies being processed in the week. Nomad has confirmed with two customers that HKD is flowing."}, {"0937": "Others joining in the fun"}, {"03f7": "Shortly after Bitfinex made their announcement, OKcoin(.com), BTCE, XAPO and other crypto services also announced they would not be able to process direct USD withdrawals or deposit for at least the next 30 days and were seeking other payment processors. (ie other friendly banks or third parties)."}, {"af11": "Note: BTCE has a number of payment processors that are still able to take and withdraw USD but there is a transaction fee of around 3%"}, {"d219": "But why the sudden change? what do these services have in common ?"}, {"53d6": "They all have accounts of the 8 Taiwan Mega banks. (per wire origin from users)"}, {"cf15": "Taiwan AML and banking reforms."}, {"16f0": "This is an evolving story. Taiwan has been a banking mess for years but in the last few years they wished to be a world bank center and fintech startup incubator. So as a country, they have been attempting to go through these reforms to meeting this goal. Many crypto currencies exchanges/services and MSBs choose to bank in Taiwan because they have more lax compliance/AML/KYC requirements then some banks but enough to meet the agreement in the US Banks. However, USA has changed these requirements recently at a Fed level. If you like USD you must comply."}, {"0ccf": "History Lesson w/ reference"}, {"851e": "Taiwan seeks banking and aml reform by collapsing many small banks into larger “mega banks” in 2013"}, {"3908": "http://taiwantoday.tw/news.php?unit=2,23,45&post=3111"}, {"6762": "180 million in AML violation to one of these new “mega banks” in 8/2016 http://www.reuters.com/article/us-taiwan-moneylaundering-idUSKCN1100NY"}, {"7371": "Taiwan open first official AML office in response to this http://focustaiwan.tw/news/aipl/201703160021.aspx"}, {"466a": "same news but brief blurb on Money laundering Control Act changes http://taiwantoday.tw/news.php?unit=2&post=112843"}, {"cc17": "mentions the approved and upcoming changes to MLCA http://law.moj.gov.tw/Eng/"}, {"7a49": "Add to this AML changes.."}, {"43ca": "The United States unveiled at the beginning of April part of several new AML requirements :"}, {"d780": "“A group of state regulators announced new disclosure requirements for money services businesses that will build a new, publicly available database of publicly available financial data to streamline monitoring of the remittance industry. “"}, {"c3e1": "http://www.moneylaundering.com/Pages/Login.aspx?ReturnUrl=%2fNews%2fPages%2f142101.aspx"}, {"80dd": "This applies to all USD business. There were further changes to FINCEN requirements for MSBs across the board."}, {"c49c": "FINCEN site https://www.fincen.gov/money-services-business-msb-suspicious-activity-reporting"}, {"9c7a": "The current anti money laundering requirements will most likely take several months of auditing and many check marks to be fully complete in foriegn banks. However, some cryptoservices may choose not to complete this level of work and move their funds to another bank and remove US dollar as an option. Compliance is an expensive process and a multi billion dollar industry for a reason. Never mind that some customer may choose to stay anonymous vs providing further documents to a third party."}, {"6942": "So crypto currency services are good after this AML stuff is done right ?"}, {"2416": "If only it were that simple. There are 13 intermediary and clearing banks for US dollar in the world. After this compliance piece is complete, they must once again establish banking relations again. The same policy that Wells Fargo used before to refuse business, can potentially be used again."}, {"06ac": "Even if a crypto service moved to a bank with solid US banking relations, they will still have to comply with the new AML policies in order to be able to participate in USD transfers uninterrupted"}, {"41eb": "Why aren’t all the US dollar crypto exchanges and services having this problem?"}, {"e797": "The issue stems from domestic vs non-domestic requirements. If you have ever opened a Coinbase or Kraken account, you know what I’m talking about. No anonymous accounts allowed, proof of everything they can thinks of *just* to send them money. Never mind take it out. Also, being on US soil means they do not have to go through such a harsh intermediary process when transferred between two parties (US based or not)"}, {"97bf": "If you have a two party transfer between banks, there is a policy on US dollar transactions that they need to be settled and routed domestically, regardless of if neither banking party is in the United States. This makes these transactions subject to any and all policies the Fed, SEC, FINRA etc etc want to extend."}, {"bd6c": "Correspondent bank in this case is a US intermediary bank."}, {"e90d": "So where does this leave us?"}, {"95c6": "None of the exchanges impacted by this issue are insolvent or blocking crypto transfers so you have a few solid options… options that are way easier then it was 3 years ago"}, {"540d": "If you want your funds out of the currently impacted exchanges now, you can buy some form of crypto and hold it in your wallet or a third-party service and wait for it to blow over. (or trade on an exchange)"}, {"fc70": "If you want fiat now , you need to buy some form of crypto, send it to another exchange/gateway you have a bank account setup with and cash out there. Fair warning though — if you wait too long the spread in spot price might be high. As of this writing Bitstamp has a 56 dollar discount on bitcoin over Bitfinex, Coinbase has 50 dollar."}, {"3e2b": "You can also send your crypto to another exchange to pull out other fiat such at JPY, GBP, CAD and EU."}, {"4886": "Bitfinex is also offering immediate withdrawals to HKD and CHF directly (with other currencies on the way) None of the other services impacted are offering direct routes at the time of writing."}, {"5bad": "Is this the end of BTCUSD as we know it ?"}, {"3c6c": "There is too much interest in the USD pair for it to simply go away without a fight. What might happen is that only domestic exchanges and service will have USD fiat denominations available. While others end up with a synthetic product such as a future or CFD and settle directly to crypto."}, {"8026": "Coindesk — dont steal our content again."}, {"736f": "update: It was mentioned on twitter that having received wires from Okcoin using a HKD bank, may other have cited Taiwanese banks . Also that BTCE has listed a Mongolian Bank publicly. There is no reason to expect that an exchange wouldn’t maintain many multiple bank relations (especially for USD vs none) for business continuity reasons. As well as the fact the USA AML policy applies to any bank dealing in USD as the wire must still be processed at a correspondent bank."}], "content": "Taiwan AML reforms & USD/Crypto Drama There is a ton of unsubstantiated fud and misinformation going around about the current state of US Dollar in crypto services to the point where a solid facts only article needs to be written. Bitfinex USD woes By now, most know the Bitfinex situation around withdrawals and deposits. This is the start and main source of the drama chatter on social media but here’s quick *facts only* recap · March 23 2017 — first noted delay receiving US Dollar withdrawal from Bitfinex . · March 31 2017 — Wells Fargo , a major clearing and intermediary bank, starts denying incoming wires to cryptocurrency and MSB based business including Bitfinex citing major Tiawan banking AML reforms. (more on that below). Incoming wires still functioned at this time · April 3 2017 — Bitfinex repays outstanding debt on bfxtokens by cash deposit or converting to dividend yielding share holders. · April 5 2017 — Bitfinex v. Well Fargo lawsuit is filed as WF is not responding to general inquiries from bitfinex or their bank regarding withdrawl issues citing BFX is not their direct customer or a bank. · April 12 2017 — Bitfinex withdraw lawsuit is withdrawn. Banks are private institutions in the USA and have the rights to do business with whom ever and what countries they want. · April 17 2017 — Bitfinex’s Bank in Taiwan warns of halts all incoming USD wires deposits. Later news states all deposits were halted. · April 18 2017 — Hong Kong Dollar Dollar (hkd) and Swiss Franc (CHF) withdrawls are offered with several other major currencies being processed in the week. Nomad has confirmed with two customers that HKD is flowing. Others joining in the fun Shortly after Bitfinex made their announcement, OKcoin(.com), BTCE, XAPO and other crypto services also announced they would not be able to process direct USD withdrawals or deposit for at least the next 30 days and were seeking other payment processors. (ie other friendly banks or third parties). Note: BTCE has a number of payment processors that are still able to take and withdraw USD but there is a transaction fee of around 3% But why the sudden change? what do these services have in common ? They all have accounts of the 8 Taiwan Mega banks. (per wire origin from users) Taiwan AML and banking reforms. This is an evolving story. Taiwan has been a banking mess for years but in the last few years they wished to be a world bank center and fintech startup incubator. So as a country, they have been attempting to go through these reforms to meeting this goal. Many crypto currencies exchanges/services and MSBs choose to bank in Taiwan because they have more lax compliance/AML/KYC requirements then some banks but enough to meet the agreement in the US Banks. However, USA has changed these requirements recently at a Fed level. If you like USD you must comply. History Lesson w/ reference Taiwan seeks banking and aml reform by collapsing many small banks into larger “mega banks” in 2013 http://taiwantoday.tw/news.php?unit=2,23,45&post=3111 180 million in AML violation to one of these new “mega banks” in 8/2016 http://www.reuters.com/article/us-taiwan-moneylaundering-idUSKCN1100NY Taiwan open first official AML office in response to this http://focustaiwan.tw/news/aipl/201703160021.aspx same news but brief blurb on Money laundering Control Act changes http://taiwantoday.tw/news.php?unit=2&post=112843 mentions the approved and upcoming changes to MLCA http://law.moj.gov.tw/Eng/ Add to this AML changes.. The United States unveiled at the beginning of April part of several new AML requirements : “A group of state regulators announced new disclosure requirements for money services businesses that will build a new, publicly available database of publicly available financial data to streamline monitoring of the remittance industry. “ http://www.moneylaundering.com/Pages/Login.aspx?ReturnUrl=%2fNews%2fPages%2f142101.aspx This applies to all USD business. There were further changes to FINCEN requirements for MSBs across the board. FINCEN site https://www.fincen.gov/money-services-business-msb-suspicious-activity-reporting The current anti money laundering requirements will most likely take several months of auditing and many check marks to be fully complete in foriegn banks. However, some cryptoservices may choose not to complete this level of work and move their funds to another bank and remove US dollar as an option. Compliance is an expensive process and a multi billion dollar industry for a reason. Never mind that some customer may choose to stay anonymous vs providing further documents to a third party. So crypto currency services are good after this AML stuff is done right ? If only it were that simple. There are 13 intermediary and clearing banks for US dollar in the world. After this compliance piece is complete, they must once again establish banking relations again. The same policy that Wells Fargo used before to refuse business, can potentially be used again. Even if a crypto service moved to a bank with solid US banking relations, they will still have to comply with the new AML policies in order to be able to participate in USD transfers uninterrupted Why aren’t all the US dollar crypto exchanges and services having this problem? The issue stems from domestic vs non-domestic requirements. If you have ever opened a Coinbase or Kraken account, you know what I’m talking about. No anonymous accounts allowed, proof of everything they can thinks of *just* to send them money. Never mind take it out. Also, being on US soil means they do not have to go through such a harsh intermediary process when transferred between two parties (US based or not) If you have a two party transfer between banks, there is a policy on US dollar transactions that they need to be settled and routed domestically, regardless of if neither banking party is in the United States. This makes these transactions subject to any and all policies the Fed, SEC, FINRA etc etc want to extend. Correspondent bank in this case is a US intermediary bank. So where does this leave us? None of the exchanges impacted by this issue are insolvent or blocking crypto transfers so you have a few solid options… options that are way easier then it was 3 years ago If you want your funds out of the currently impacted exchanges now, you can buy some form of crypto and hold it in your wallet or a third-party service and wait for it to blow over. (or trade on an exchange) If you want fiat now , you need to buy some form of crypto, send it to another exchange/gateway you have a bank account setup with and cash out there. Fair warning though — if you wait too long the spread in spot price might be high. As of this writing Bitstamp has a 56 dollar discount on bitcoin over Bitfinex, Coinbase has 50 dollar. You can also send your crypto to another exchange to pull out other fiat such at JPY, GBP, CAD and EU. Bitfinex is also offering immediate withdrawals to HKD and CHF directly (with other currencies on the way) None of the other services impacted are offering direct routes at the time of writing. Is this the end of BTCUSD as we know it ? There is too much interest in the USD pair for it to simply go away without a fight. What might happen is that only domestic exchanges and service will have USD fiat denominations available. While others end up with a synthetic product such as a future or CFD and settle directly to crypto. Coindesk — dont steal our content again. update: It was mentioned on twitter that having received wires from Okcoin using a HKD bank, may other have cited Taiwanese banks . Also that BTCE has listed a Mongolian Bank publicly. There is no reason to expect that an exchange wouldn’t maintain many multiple bank relations (especially for USD vs none) for business continuity reasons. As well as the fact the USA AML policy applies to any bank dealing in USD as the wire must still be processed at a correspondent bank. ", "child": "2528_1\t2528_2\t2528_3\t2528_4\t2528_5\t2528_6\t2528_7"}