{"name": "258", "parent": "", "title": "Why Facebook Is So Thirsty For Your Story", "sentences": [{"0dd4": "Why Facebook Is So Thirsty For Your Story"}, {"4589": "Facebook’s photocopier is doing some serious overtime."}, {"cec5": "On 3/15/2017, the company announced Facebook Stories, a new feature that lets you add photos and videos to a slideshow stuck to your News Feed. All uploads disappear after 24 hours."}, {"8c67": "Sounds familiar? That’s because Messenger, WhatsApp and Instagram added similar features over the last couple of months, all inspired by Snapchat’s Stories."}, {"c295": "Today, you can share your Story to five major social networking apps, four of which are owned by Facebook. The thirst for your daily uploads is real—but why?"}, {"8f1d": "Yet another thing to keep up to date"}, {"d46d": "Stories are ridiculously easy to share"}, {"bdec": "Posting to Facebook? Choose between text, pictures or video. Sharing an Instagram? Prepare to edit your life away."}, {"99a3": "Adding something to your Story? Just a couple of taps and you’re done. It’s an incredibly easy and frictionless way to share your life."}, {"22a9": "Simplifying the way we share is a big deal for social networks. The easier it is to share content, the more people end up actually doing it."}, {"c5a1": "And it’s working. Only five months after its launch, over 150 million people use Instagram Stories every single day. An astonishing number, in part achieved by slapping it on top of the app’s main feed—a daring move that proved to be successful."}, {"a5dc": "With users sharing more, they spend more time in the app, which means they can look at…"}, {"4035": "Ads — huge, unmissable, full-screen ads"}, {"7985": "Advertising on social networks is slowly losing its value — people are trained to swipe past them immediately. On desktop, ad blockers are a huge problem."}, {"e228": "But there’s hope."}, {"fbd1": "And that hope looks like full-screen ads. Stuck in between your friends’ Stories, it’s impossible to ignore them — your whole screen literally becomes a giant ad. You can’t block them. You have to watch."}, {"49cd": "It’s every advertiser’s dream, which makes for some valuable real estate for Facebook. And even though Messenger Day is launching ad-free, it probably won’t stay that way for long—Instagram added ads in between Stories after only a couple of months."}, {"ff3f": "Stories, everywhere"}, {"edf6": "In the near future, expect to see Stories and similar features making its way to more and more apps for one or both of these reasons:"}, {"23d3": "It’s a massively popular way of sharing content."}, {"bff4": "It‘s extremely valuable ad inventory."}, {"3952": "Some other companies can be seen experimenting with similar formats—Medium recently launched Series, a mobile-only editorial format that looks and feels a ton like a Story."}, {"2007": "Medium’s new Stories —wait, no— Series feature"}, {"ddd3": "Its layout offers authors a new way to create content, but the future addition of ads could potentially offer a breakthrough in Medium’s ongoing search for a viable business model."}, {"9eac": "If you’re not a fan of full-screen content, the future is looking pretty bleak. Pushing the feature to (almost) all of its products, Facebook shows it’s going all in."}, {"48ba": "If the rest of the industry neglects the move, there’s a chance most things will stay the same. But if they take notes, we might soon be tapping through a seemingly endless stream of terrible, full-screen ads."}, {"205b": "Enjoyed this post? Don’t forget to click the 💚 below to let me know!"}], "content": "Why Facebook Is So Thirsty For Your Story Facebook’s photocopier is doing some serious overtime. On 3/15/2017, the company announced Facebook Stories, a new feature that lets you add photos and videos to a slideshow stuck to your News Feed. All uploads disappear after 24 hours. Sounds familiar? That’s because Messenger, WhatsApp and Instagram added similar features over the last couple of months, all inspired by Snapchat’s Stories. Today, you can share your Story to five major social networking apps, four of which are owned by Facebook. The thirst for your daily uploads is real—but why? Yet another thing to keep up to date Stories are ridiculously easy to share Posting to Facebook? Choose between text, pictures or video. Sharing an Instagram? Prepare to edit your life away. Adding something to your Story? Just a couple of taps and you’re done. It’s an incredibly easy and frictionless way to share your life. Simplifying the way we share is a big deal for social networks. The easier it is to share content, the more people end up actually doing it. And it’s working. Only five months after its launch, over 150 million people use Instagram Stories every single day. An astonishing number, in part achieved by slapping it on top of the app’s main feed—a daring move that proved to be successful. With users sharing more, they spend more time in the app, which means they can look at… Ads — huge, unmissable, full-screen ads Advertising on social networks is slowly losing its value — people are trained to swipe past them immediately. On desktop, ad blockers are a huge problem. But there’s hope. And that hope looks like full-screen ads. Stuck in between your friends’ Stories, it’s impossible to ignore them — your whole screen literally becomes a giant ad. You can’t block them. You have to watch. It’s every advertiser’s dream, which makes for some valuable real estate for Facebook. And even though Messenger Day is launching ad-free, it probably won’t stay that way for long—Instagram added ads in between Stories after only a couple of months. Stories, everywhere In the near future, expect to see Stories and similar features making its way to more and more apps for one or both of these reasons: It’s a massively popular way of sharing content. It‘s extremely valuable ad inventory. Some other companies can be seen experimenting with similar formats—Medium recently launched Series, a mobile-only editorial format that looks and feels a ton like a Story. Medium’s new Stories —wait, no— Series feature Its layout offers authors a new way to create content, but the future addition of ads could potentially offer a breakthrough in Medium’s ongoing search for a viable business model. If you’re not a fan of full-screen content, the future is looking pretty bleak. Pushing the feature to (almost) all of its products, Facebook shows it’s going all in. If the rest of the industry neglects the move, there’s a chance most things will stay the same. But if they take notes, we might soon be tapping through a seemingly endless stream of terrible, full-screen ads. Enjoyed this post? Don’t forget to click the 💚 below to let me know! ", "child": "258_1\t258_2\t258_3\t258_4\t258_5\t258_6\t258_7\t258_8\t258_9\t258_10\t258_11\t258_12"}