{"name": "267", "parent": "", "title": "The Philadelphia Eagles vs. the Philadelphia Eagles Media", "sentences": [{"7131": "The Philadelphia Eagles vs. the Philadelphia Eagles Media"}, {"68bc": "A mini oral history of one sportswriter’s ejection from The Linc, and the reaction of his brothers on the football beat"}, {"85a3": "On Sunday, not long after the Eagles finished an uninspiring season with a meaningless win over the Cowboys at home, Philadelphia Inquirer beat writer Jeff McLane tweeted about Lane Johnson. The Eagles offensive lineman told McLane that he thought the team would have made the playoffs if he hadn’t been suspended for much of the season for violating the NFL’s drug policy. It was a good get for McLane, but gathering the information wasn’t as simple as it usually would have been. On any other day, McLane might have talked to Johnson at his locker. But it wasn’t any other day."}, {"672c": "McLane texted with Johnson rather than speaking in person. That’s because, a few hours earlier, McLane was ejected from the Lincoln Financial Field press box by Eagles PR personnel and facility security. In the third quarter, Zach Groen, an Eagles PR coordinator, reportedly told McLane and some other media members that they were being too loud while debating a possible penalty. McLane and some other journalists took umbrage with the admonishment. McLane asked Groen to step aside with him and discuss it in private."}, {"aa07": "He described that conversation to the Inquirer as “a slight argument, but nothing out of the ordinary.”"}, {"9f62": "If the conversation wasn’t unusual, everything that followed was. About 10 or 15 minutes later, security escorted McLane out of the stadium. Anne Gordon — a senior vice president of marketing, media and communication for the Eagles, and a former managing editor for the Inquirer — told the remaining writers in the press box he had violated the press box “code of conduct,” according to the Inquirer report. That decision did not sit well with other members of the Philly sports media on hand. They pressed Gordon on what exactly McLane did wrong, while chronicling the saga in Twitter dispatches."}, {"169f": "Strange stuff — made stranger by the fact that McLane’s biggest defender was also arguably one of his biggest competitors: Daily News beat writer Les Bowen. Just five years ago, the two were such bitter rivals that they got into a much-publicized fist fight at the Eagles practice facility. They’ve since mended the rift, but that story tells you quite a bit about the Philadelphia media in general, and the Eagles beat in particular. I spent a good portion of my career among them (I was a columnist at the Inquirer and Comcast Sports)."}, {"d30c": "It’s an exclusive group, a kind of professional fraternity that often wars internally but can be protective and oddly loyal when one of its own is confronted by external forces. It’s unlike any workplace environment I know — a host of disparate characters with different employers who spend so much time together that they reflexively form a unit. Here, members of that periodically dysfunctional family explain what happened on Sunday and why they defend the same people they sometimes battle. They’re fun that way."}, {"68ce": "Marcus Hayes (Philadelphia Daily News columnist): I kind of thought it was a gag. I kind of thought it was a joke. The security guard said to Jeff, very professionally, “You have to pack your stuff up. I have to eject you from the stadium.”"}, {"647f": "Bowen: I didn’t think it was a joke. This guy was a real security guard. Anne Gordon was standing there. I thought it was incredibly out of proportion to what had happened."}, {"1eee": "McLane: I just thought they had the wrong person."}, {"455f": "Hayes: Jeff said, “Well, I’m not leaving. I’m going to call my boss and see what I should do.” The security guard let him call his boss."}, {"c329": "At that point, Anne Gordon, who runs pretty much all of the game-day operations, including the national anthem and flyovers and stuff, swoops down from the third level [of the press box] with a walkie-talkie in her hand and said, “No, you’re leaving.” Jeff sort of ignored her, but then he and his boss agreed he would go."}, {"e2ee": "McLane: My higher-ups are dealing with it. I don’t know what kind of explanation they’ve gotten about it, but I didn’t get one I understood."}, {"fc84": "Jimmy Kempski (PhillyVoice.com Eagles writer, noted stick-figure enthusiast): Like anything in Philly media, it spread instantly. It went from seat to seat to seat right on down the line in the press box. “They’re throwing McLane out, pass it down. They’re throwing McLane out, pass it down. They’re throwing McLane out, pass it down.” We love the whisper-down-the-lane thing."}, {"e803": "Mike Sielski (Inquirer columnist): We were all sort of stunned. The parochialism here is very heavy. It’s an all-in-this-together element at times. An Eagles game at the Linc feels like a town meeting of Philly sports media."}, {"78cc": "Bob Ford (Inquirer columnist): Actually, it was sort of a compliment. Most sportswriters, it would take maybe half a security guard to eject you. They felt Jeff McLane required three security guards. I think that really reflects well on him and how the organization views him."}, {"6593": "I can see this story is really going to turn out great."}, {"4dbd": "Bowen: My first impulse was for everyone there to sort of be Spartacus and say, “No, if you throw him out, you throw all of us out.” There were things said to that effect. [Gordon’s] response was that would be just fine."}, {"aae5": "Hayes: She turned to us and pointed her walkie-talkie at us and said, “Anybody who doesn’t agree with this, I’ll eject them too.”"}, {"dfca": "Eliot Shorr-Parks (NJ.com Eagles writer): Granted, at that point everyone sat back down."}, {"0c9b": "Ford: People bark at each other now and then in a press box. But that’s just part of working in close proximity with a hundred people who are under a certain amount of work pressure. Everyone is tweeting and blogging and writing and trying to figure out what comes next and look at replays and everyone shouts. It passes. It’s part of the working environment. It’s not that dissimilar from working on the floor of the stock exchange. There’s a lot of yelling going on."}, {"57f9": "It’s a boisterous fraternity. There’s no question. There’s a lot of egos. There’s a lot of opinions. There’s a lot of history. A lot of this press corps has been together for 30 years. That environment was misunderstood by someone who didn’t understand the environment. I was certainly surprised that he was ejected."}, {"f851": "Gordon declined an interview request through an Eagles PR intermediary. Eagles director of public relations Derek Boyko declined comment. Several other members of the Eagles PR staff did not respond to interview requests or declined comment."}, {"42f7": "Parks: I’m usually on “the media is wrong” side. We’re the worst. For sure. You’ve been there. The media in general in Philly, when you go to different things, like the NFL owners meetings, there’s like 20 times more of us than any other group. We’re by far the most aggressive. Some teams will only have three or four writers. We’re always 15 deep. We’re the most cliquey. Certain reporters don’t like other reporters. We all talk shit about each other behind each other’s backs. We’re obnoxious usually. But not this time."}, {"4d95": "He’s right about Philly media being the worst sometimes. I once watched an Eagles writer openly complain when a food truck provided by the team ran out of grilled cheese and gave him a different sandwich instead. He literally complained about a free lunch."}, {"6d87": "Kempski: I talked to a Dallas reporter after the game, and he asked me, “Does this happen here all the time?” No, I think this is a first, even for us."}, {"d29c": "Bowen: We had no collective recourse. There was somebody who said, “Well, maybe we shouldn’t ask questions of Doug Pederson after the game.” But Doug Pederson had no idea it was happening. That would be muddying the waters and create another set of issues. So we didn’t do that. We didn’t know what to do."}, {"1065": "McLane: They were just rallying because they saw something that was wrong, at least according to them. This is all sausage-making stuff. You have arguments or discussions with team personnel all the time. Generally that doesn’t see the light of day because it happens behind closed doors."}, {"3b68": "Hayes: That’s when Les began tweeting a sort of play-by-play."}, {"603a": "Bowen: That’s not something I thought I would have done five years ago."}, {"b1b9": "Bowen: I felt that was important to do, to get that out there. Certainly sportswriters across the country, I felt like everyone needed to know what’s happening. When have you ever heard of someone getting ejected from a press box?"}, {"a613": "Ford: I’ve never seen something like that. But I’ve only been doing this 40 years."}, {"9160": "Angelo Cataldi (longtime Philly sports radio host, former Inquirer Eagles beat writer): My first reaction was to go on Twitter, which I don’t really do much, and to start yelling and screaming like an idiot because I was so frustrated that someone wasn’t allowed to do their job who was there to do their job."}, {"4913": "Parks: The fans love the drama. They love to pit us against each other on Twitter. People were tweeting which writers they wanted to be ejected next. “Eject Eliot. Eject Les. Eject Jimmy.” They really enjoyed it."}, {"248d": "Cataldi: We absolutely hate each other when we’re competing. And then we immediately team up when necessity arises like this. What I do now, and the bully pulpit that I have now, there’s never a time when I’m not screaming at GMs who feel they don’t need to make themselves available in a crisis with their team, like Bryan Colangelo, who’s become invisible the last six months. I feel like I have this forum, and it’s my responsibility to speak on behalf of all the media in the area and say this isn’t the way you do it in Philadelphia. So, yeah, in that regard we’re all on the team. But over the years, yeah, the team has its issues internally."}, {"6462": "Ford: Philly media is a really, really big, loud Thanksgiving table where, essentially, everyone is competing for the good drumstick. Everyone wants the good story. Everyone wants to be better than the other guy. But then we all go out to dinner. When we’re on the road, it’s not uncommon for us to have 12, 14 guys going out to dinner together. And being loud, by the way."}, {"c547": "McLane: The dynamic of what happens with our media is interesting. [Eagles director of public relations] Derek Boyko always says he’d have a reality show about the inner workings and personalities on the beat. It’s a weird crew. There are some guys who shall remain nameless, I don’t know how they exist, but they exist."}, {"acea": "Hayes: The reality of any media group, but especially the closed group of media that’s covered the same team for a long time, the reality is you form relationships with those people … but, I mean, there’s conflict at times."}, {"f8ae": "Kempski: If someone writes something dumb, pretty good chance that will get made fun of by us privately. And publicly."}, {"3901": "Hayes: The irony that Jeff’s greatest champion in this is Les Bowen is palpable."}, {"f088": "In September 2011, a heated Twitter exchange between Bowen and McLane led to a physical confrontation at the Eagles practice facility."}, {"ea3d": "Parks: Twitter is the worst."}, {"88fb": "Ford: It’s hard to do nuance in 140 characters. And then you have two quirky, competing senses of humor in Jeff and Les. And it’s all wrapped up in id. Id. We’ve all got a lot of id. They competed hard and got into a fistfight in the work room at the NovaCare Complex."}, {"d029": "Parks: I was late that day. I was so pissed I missed it. I literally still think about it. Everyone talks about it, and I’m still kicking myself for being late."}, {"3e7f": "Ford: The fight didn’t surprise me. What happened [Sunday in the press box] surprised me — that Jeff was ejected. But it didn’t surprise me that Les supported him and backed him up. We all might be biting at each other, but were all in the same foxhole. Their thing has been over for years. There’s a lot of history with us."}, {"6415": "McLane: Les and I, we had one little incident that got blown out of proportion. Honestly, that would have been another thing that never would have reached the light of day and would have been handled in house if bigmouth Howard Eskin didn’t blab it on radio."}, {"0af7": "Howard Eskin (longtime Philly sports radio/TV host, antagonist, Santa impersonator): I still think it’s hilarious. It’s hilarious that it got to that point. Those guys still work together. It was hilarious. It was for the twitidiots and the Twitter world. It’s nothing personal."}, {"d324": "Listen, I don’t want to start any more fights with people. I can do that on my own. I don’t need you to help me."}, {"0cfe": "This is true. He once threatened me in the Eagles locker room and it still makes me smile."}, {"1929": "Bowen: I’m still not sure how much I’m supposed to discuss what happened five years ago. That was a very tricky thing. We both worked for the same company and there was discipline involved and so forth. I will say that Jeff and I … there was a time when we were very bitter and fierce rivals. That’s much less true now. We know each other much better than we did years ago. We’ve been around each other a lot more. We’ve shared a lot of things."}, {"97d0": "We’re players, and they’re the other team. You don’t think that in a day-in and day-out basis. But it’s very clear who’s on which team."}, {"7f7f": "McLane: We’re on the journalism team."}, {"3974": "Ford: Of course the locker room learned about [the fight] almost immediately. Players are fabulous gossips. They love all that kind of stuff. There was a media scrum around Michael Vick that day. And around the perimeter of the scrum was Asante Samuel. And he’s going: “Jeeffffff. Leeeesssss. I know you’re in there. Jeeffffff. Leesssss. Come out. I need to talk to yoooouuuu.” The players couldn’t get enough of it. They love that kind of stuff. That’s what I remember most — how much delight Asante took in it."}, {"ff0f": "Kempski: It got to the point where Asante was being so intrusive that Vick just stopped talking and started laughing."}, {"967f": "Parks: I shot that video."}, {"e51b": "I wasn’t full time on the beat yet. I was trying to work my way up. I kept recording and I was like, “Oh shit, I think I have something.” It was the first time that national people picked up my stuff and retweeted it. It didn’t have anything to do with writing skill or talent."}, {"b543": "Maybe there’s no ESP without Jeff or Les."}, {"8276": "It became such a big deal locally and nationally that it got made into a bizarre and hilarious Taiwanese computer animation."}, {"ca66": "Kempski: That’s when you know you’ve made it. You’ve done something special when there’s Taiwanese computer animation of you."}, {"dfeb": "Bowen: I was embarrassed and wish people would drop it. Five years later people still haven’t dropped it."}, {"f073": "Cataldi: Many of the guys we’ve had in our press corps have been eccentrics. When you put them all in the same room, sometimes things get heated. You may as well sell popcorn."}, {"3982": "Parks: I wouldn’t say me and Jeff are close. The beat is so competitive. We’re coworkers in some ways, but in other ways we’re not. It’s like a competitiveness that brings out cattiness sometimes. But that also forms a bond. The Jeff-and-Les thing is the perfect example. Jeff and Les, even after they got in that fight, I’m around them every single day. They talk. They joke. When something happens in a big moment, we all sort of talk about what it means. Even though Jeff and Les literally hit each other, they stand up for each other. I think there’s a mutual respect there."}, {"3eb7": "Hayes: The fraternity we’re talking about is something we take seriously."}, {"e2e4": "Ford: It’s that thing about “I can yell at my brother. I can even punch my brother. But you can’t.”"}, {"38ae": "Bowen: A year ago, I was at the viewing for Jeff’s mom when the Eagles fired Chip Kelly. We don’t hang out together. For one thing, he’s 20 years younger than I am. But we all have dinner together on the road. We’re cordial. I respect what he does, and I think he respects what I do."}, {"db7c": "McLane: I have tremendous respect for Les. We’re friends."}, {"c170": "Bowen: We’re in a much different situation than we were years ago. It’s not nearly as bitter or contentious between the papers. There used to be a lot of sniping back and forth. That doesn’t occur anymore now that we’re all in the same newsroom. That’s discouraged now quite strongly."}, {"e194": "Cataldi: These are some really colorful people, funny to be around, really entertaining — and they’ll slit your throat if you look away for a second. I like it."}], "content": "The Philadelphia Eagles vs. the Philadelphia Eagles Media A mini oral history of one sportswriter’s ejection from The Linc, and the reaction of his brothers on the football beat On Sunday, not long after the Eagles finished an uninspiring season with a meaningless win over the Cowboys at home, Philadelphia Inquirer beat writer Jeff McLane tweeted about Lane Johnson. The Eagles offensive lineman told McLane that he thought the team would have made the playoffs if he hadn’t been suspended for much of the season for violating the NFL’s drug policy. It was a good get for McLane, but gathering the information wasn’t as simple as it usually would have been. On any other day, McLane might have talked to Johnson at his locker. But it wasn’t any other day. McLane texted with Johnson rather than speaking in person. That’s because, a few hours earlier, McLane was ejected from the Lincoln Financial Field press box by Eagles PR personnel and facility security. In the third quarter, Zach Groen, an Eagles PR coordinator, reportedly told McLane and some other media members that they were being too loud while debating a possible penalty. McLane and some other journalists took umbrage with the admonishment. McLane asked Groen to step aside with him and discuss it in private. He described that conversation to the Inquirer as “a slight argument, but nothing out of the ordinary.” If the conversation wasn’t unusual, everything that followed was. About 10 or 15 minutes later, security escorted McLane out of the stadium. Anne Gordon — a senior vice president of marketing, media and communication for the Eagles, and a former managing editor for the Inquirer — told the remaining writers in the press box he had violated the press box “code of conduct,” according to the Inquirer report. That decision did not sit well with other members of the Philly sports media on hand. They pressed Gordon on what exactly McLane did wrong, while chronicling the saga in Twitter dispatches. Strange stuff — made stranger by the fact that McLane’s biggest defender was also arguably one of his biggest competitors: Daily News beat writer Les Bowen. Just five years ago, the two were such bitter rivals that they got into a much-publicized fist fight at the Eagles practice facility. They’ve since mended the rift, but that story tells you quite a bit about the Philadelphia media in general, and the Eagles beat in particular. I spent a good portion of my career among them (I was a columnist at the Inquirer and Comcast Sports). It’s an exclusive group, a kind of professional fraternity that often wars internally but can be protective and oddly loyal when one of its own is confronted by external forces. It’s unlike any workplace environment I know — a host of disparate characters with different employers who spend so much time together that they reflexively form a unit. Here, members of that periodically dysfunctional family explain what happened on Sunday and why they defend the same people they sometimes battle. They’re fun that way. Marcus Hayes (Philadelphia Daily News columnist): I kind of thought it was a gag. I kind of thought it was a joke. The security guard said to Jeff, very professionally, “You have to pack your stuff up. I have to eject you from the stadium.” Bowen: I didn’t think it was a joke. This guy was a real security guard. Anne Gordon was standing there. I thought it was incredibly out of proportion to what had happened. McLane: I just thought they had the wrong person. Hayes: Jeff said, “Well, I’m not leaving. I’m going to call my boss and see what I should do.” The security guard let him call his boss. At that point, Anne Gordon, who runs pretty much all of the game-day operations, including the national anthem and flyovers and stuff, swoops down from the third level [of the press box] with a walkie-talkie in her hand and said, “No, you’re leaving.” Jeff sort of ignored her, but then he and his boss agreed he would go. McLane: My higher-ups are dealing with it. I don’t know what kind of explanation they’ve gotten about it, but I didn’t get one I understood. Jimmy Kempski (PhillyVoice.com Eagles writer, noted stick-figure enthusiast): Like anything in Philly media, it spread instantly. It went from seat to seat to seat right on down the line in the press box. “They’re throwing McLane out, pass it down. They’re throwing McLane out, pass it down. They’re throwing McLane out, pass it down.” We love the whisper-down-the-lane thing. Mike Sielski (Inquirer columnist): We were all sort of stunned. The parochialism here is very heavy. It’s an all-in-this-together element at times. An Eagles game at the Linc feels like a town meeting of Philly sports media. Bob Ford (Inquirer columnist): Actually, it was sort of a compliment. Most sportswriters, it would take maybe half a security guard to eject you. They felt Jeff McLane required three security guards. I think that really reflects well on him and how the organization views him. I can see this story is really going to turn out great. Bowen: My first impulse was for everyone there to sort of be Spartacus and say, “No, if you throw him out, you throw all of us out.” There were things said to that effect. [Gordon’s] response was that would be just fine. Hayes: She turned to us and pointed her walkie-talkie at us and said, “Anybody who doesn’t agree with this, I’ll eject them too.” Eliot Shorr-Parks (NJ.com Eagles writer): Granted, at that point everyone sat back down. Ford: People bark at each other now and then in a press box. But that’s just part of working in close proximity with a hundred people who are under a certain amount of work pressure. Everyone is tweeting and blogging and writing and trying to figure out what comes next and look at replays and everyone shouts. It passes. It’s part of the working environment. It’s not that dissimilar from working on the floor of the stock exchange. There’s a lot of yelling going on. It’s a boisterous fraternity. There’s no question. There’s a lot of egos. There’s a lot of opinions. There’s a lot of history. A lot of this press corps has been together for 30 years. That environment was misunderstood by someone who didn’t understand the environment. I was certainly surprised that he was ejected. Gordon declined an interview request through an Eagles PR intermediary. Eagles director of public relations Derek Boyko declined comment. Several other members of the Eagles PR staff did not respond to interview requests or declined comment. Parks: I’m usually on “the media is wrong” side. We’re the worst. For sure. You’ve been there. The media in general in Philly, when you go to different things, like the NFL owners meetings, there’s like 20 times more of us than any other group. We’re by far the most aggressive. Some teams will only have three or four writers. We’re always 15 deep. We’re the most cliquey. Certain reporters don’t like other reporters. We all talk shit about each other behind each other’s backs. We’re obnoxious usually. But not this time. He’s right about Philly media being the worst sometimes. I once watched an Eagles writer openly complain when a food truck provided by the team ran out of grilled cheese and gave him a different sandwich instead. He literally complained about a free lunch. Kempski: I talked to a Dallas reporter after the game, and he asked me, “Does this happen here all the time?” No, I think this is a first, even for us. Bowen: We had no collective recourse. There was somebody who said, “Well, maybe we shouldn’t ask questions of Doug Pederson after the game.” But Doug Pederson had no idea it was happening. That would be muddying the waters and create another set of issues. So we didn’t do that. We didn’t know what to do. McLane: They were just rallying because they saw something that was wrong, at least according to them. This is all sausage-making stuff. You have arguments or discussions with team personnel all the time. Generally that doesn’t see the light of day because it happens behind closed doors. Hayes: That’s when Les began tweeting a sort of play-by-play. Bowen: That’s not something I thought I would have done five years ago. Bowen: I felt that was important to do, to get that out there. Certainly sportswriters across the country, I felt like everyone needed to know what’s happening. When have you ever heard of someone getting ejected from a press box? Ford: I’ve never seen something like that. But I’ve only been doing this 40 years. Angelo Cataldi (longtime Philly sports radio host, former Inquirer Eagles beat writer): My first reaction was to go on Twitter, which I don’t really do much, and to start yelling and screaming like an idiot because I was so frustrated that someone wasn’t allowed to do their job who was there to do their job. Parks: The fans love the drama. They love to pit us against each other on Twitter. People were tweeting which writers they wanted to be ejected next. “Eject Eliot. Eject Les. Eject Jimmy.” They really enjoyed it. Cataldi: We absolutely hate each other when we’re competing. And then we immediately team up when necessity arises like this. What I do now, and the bully pulpit that I have now, there’s never a time when I’m not screaming at GMs who feel they don’t need to make themselves available in a crisis with their team, like Bryan Colangelo, who’s become invisible the last six months. I feel like I have this forum, and it’s my responsibility to speak on behalf of all the media in the area and say this isn’t the way you do it in Philadelphia. So, yeah, in that regard we’re all on the team. But over the years, yeah, the team has its issues internally. Ford: Philly media is a really, really big, loud Thanksgiving table where, essentially, everyone is competing for the good drumstick. Everyone wants the good story. Everyone wants to be better than the other guy. But then we all go out to dinner. When we’re on the road, it’s not uncommon for us to have 12, 14 guys going out to dinner together. And being loud, by the way. McLane: The dynamic of what happens with our media is interesting. [Eagles director of public relations] Derek Boyko always says he’d have a reality show about the inner workings and personalities on the beat. It’s a weird crew. There are some guys who shall remain nameless, I don’t know how they exist, but they exist. Hayes: The reality of any media group, but especially the closed group of media that’s covered the same team for a long time, the reality is you form relationships with those people … but, I mean, there’s conflict at times. Kempski: If someone writes something dumb, pretty good chance that will get made fun of by us privately. And publicly. Hayes: The irony that Jeff’s greatest champion in this is Les Bowen is palpable. In September 2011, a heated Twitter exchange between Bowen and McLane led to a physical confrontation at the Eagles practice facility. Parks: Twitter is the worst. Ford: It’s hard to do nuance in 140 characters. And then you have two quirky, competing senses of humor in Jeff and Les. And it’s all wrapped up in id. Id. We’ve all got a lot of id. They competed hard and got into a fistfight in the work room at the NovaCare Complex. Parks: I was late that day. I was so pissed I missed it. I literally still think about it. Everyone talks about it, and I’m still kicking myself for being late. Ford: The fight didn’t surprise me. What happened [Sunday in the press box] surprised me — that Jeff was ejected. But it didn’t surprise me that Les supported him and backed him up. We all might be biting at each other, but were all in the same foxhole. Their thing has been over for years. There’s a lot of history with us. McLane: Les and I, we had one little incident that got blown out of proportion. Honestly, that would have been another thing that never would have reached the light of day and would have been handled in house if bigmouth Howard Eskin didn’t blab it on radio. Howard Eskin (longtime Philly sports radio/TV host, antagonist, Santa impersonator): I still think it’s hilarious. It’s hilarious that it got to that point. Those guys still work together. It was hilarious. It was for the twitidiots and the Twitter world. It’s nothing personal. Listen, I don’t want to start any more fights with people. I can do that on my own. I don’t need you to help me. This is true. He once threatened me in the Eagles locker room and it still makes me smile. Bowen: I’m still not sure how much I’m supposed to discuss what happened five years ago. That was a very tricky thing. We both worked for the same company and there was discipline involved and so forth. I will say that Jeff and I … there was a time when we were very bitter and fierce rivals. That’s much less true now. We know each other much better than we did years ago. We’ve been around each other a lot more. We’ve shared a lot of things. We’re players, and they’re the other team. You don’t think that in a day-in and day-out basis. But it’s very clear who’s on which team. McLane: We’re on the journalism team. Ford: Of course the locker room learned about [the fight] almost immediately. Players are fabulous gossips. They love all that kind of stuff. There was a media scrum around Michael Vick that day. And around the perimeter of the scrum was Asante Samuel. And he’s going: “Jeeffffff. Leeeesssss. I know you’re in there. Jeeffffff. Leesssss. Come out. I need to talk to yoooouuuu.” The players couldn’t get enough of it. They love that kind of stuff. That’s what I remember most — how much delight Asante took in it. Kempski: It got to the point where Asante was being so intrusive that Vick just stopped talking and started laughing. Parks: I shot that video. I wasn’t full time on the beat yet. I was trying to work my way up. I kept recording and I was like, “Oh shit, I think I have something.” It was the first time that national people picked up my stuff and retweeted it. It didn’t have anything to do with writing skill or talent. Maybe there’s no ESP without Jeff or Les. It became such a big deal locally and nationally that it got made into a bizarre and hilarious Taiwanese computer animation. Kempski: That’s when you know you’ve made it. You’ve done something special when there’s Taiwanese computer animation of you. Bowen: I was embarrassed and wish people would drop it. Five years later people still haven’t dropped it. Cataldi: Many of the guys we’ve had in our press corps have been eccentrics. When you put them all in the same room, sometimes things get heated. You may as well sell popcorn. Parks: I wouldn’t say me and Jeff are close. The beat is so competitive. We’re coworkers in some ways, but in other ways we’re not. It’s like a competitiveness that brings out cattiness sometimes. But that also forms a bond. The Jeff-and-Les thing is the perfect example. Jeff and Les, even after they got in that fight, I’m around them every single day. They talk. They joke. When something happens in a big moment, we all sort of talk about what it means. Even though Jeff and Les literally hit each other, they stand up for each other. I think there’s a mutual respect there. Hayes: The fraternity we’re talking about is something we take seriously. Ford: It’s that thing about “I can yell at my brother. I can even punch my brother. But you can’t.” Bowen: A year ago, I was at the viewing for Jeff’s mom when the Eagles fired Chip Kelly. We don’t hang out together. For one thing, he’s 20 years younger than I am. But we all have dinner together on the road. We’re cordial. I respect what he does, and I think he respects what I do. McLane: I have tremendous respect for Les. We’re friends. Bowen: We’re in a much different situation than we were years ago. It’s not nearly as bitter or contentious between the papers. There used to be a lot of sniping back and forth. That doesn’t occur anymore now that we’re all in the same newsroom. That’s discouraged now quite strongly. Cataldi: These are some really colorful people, funny to be around, really entertaining — and they’ll slit your throat if you look away for a second. I like it. ", "child": "267_1\t267_2\t267_3\t267_4\t267_5\t267_6\t267_7\t267_8\t267_9\t267_10\t267_11\t267_12\t267_13\t267_14\t267_15\t267_16\t267_17"}