{"name": "269", "parent": "", "title": "The Media’s Challenge in a Trump Administration", "sentences": [{"9c50": "The Media’s Challenge in a Trump Administration"}, {"10aa": "Sunday’s off-the-record gathering shows how hard it will be to get access to the president"}, {"9632": "President-elect Donald Trump held an off-the-record meeting with reporters Sunday evening at the Mar-a-Lago resort in Palm Beach, Florida. The gathering has drawn criticism from those who say that the media should be tougher on gaining access with Trump, who hasn’t held a press conference in 145 days. On the latest Keepin’ It 1600, Jon Favreau, Tommy Vietor, and Jon Lovett talked about the role of the media in the Trump administration."}, {"a7d8": "Listen to the full podcast here. This transcript has been edited and condensed."}, {"360f": "Trump Both Breaks and Follows Norms When it Suits Him"}, {"92a7": "Jon Favreau: OK, let’s talk about Mar-a-Lago, because last night it was the scene of an off-the-record gathering with the traveling press for Donald Trump. There was Trump wine, there were Trump steaks, there were pictures. We know this because Mike Allen of Axios posted a bunch of pictures on Twitter last night. It was off the record, but you could post pictures, as he told us in his tweets. And then there was one final picture of all of the reporters who went to this, smiling with Donald Trump, giving his little thumbs-up there."}, {"d944": "Jon Lovett: Like a class photo."}, {"f400": "J.F.: So this obviously engendered quite a bit of criticism on Twitter last night. Some reporters and liberals thought it was completely outrageous because Trump has threatened the press and refused to hold a press conference in [145] days. Others thought, “Hey, it’s an off-the-record meeting. You get to talk to the president-elect of the United States. What reporter refuses that? You can learn important information.” And then I think everyone thought the picture was pretty fucking silly."}, {"d93c": "J.L.: No one’s a fan of the photoshoot. Like, “look at us, here we are at our off-the-record gathering where Donald Trump has a thumbs-up, looking like everyone’s favorite high school gym coach.”"}, {"c4bc": "Tommy Vietor: The problem is it’s been [145] days since his last press conference and he canceled the one he was supposed to have about all the conflicts of interest, right? So at this point [in 2008], Obama had held like a half dozen or more availabilities with press. Trump hasn’t done that; he hasn’t named a real press secretary. They’re talking about it being [an] RNC communications guy, Sean Spicer. He might be a known quantity with the press, but he’s certainly not in the Trump inner circle the way Robert Gibbs was [with Obama] back in 2008. I think it’s absolutely fine to do off-the-record conversations with the press. I think it’s good for them to get to know him. I set up many of those myself with President Obama."}, {"8a5f": "It’s that I don’t think the press corps is fighting hard enough for things that are really important. That’s what makes me nervous. The way the correspondents’ association has been relatively impotent so far as they’ve seen their access curtailed and they’ve gotten nothing from the Trump Organization. I think the photo sort of encapsulates it because it has this sort of giddy tone of a tourist snapping a photo when they met a celebrity. It doesn’t bring with it the gravitas of how serious the job is. Especially when it’s a president who’s more hostile to the press than any since [Richard] Nixon."}, {"6445": "J.F.: This is an example of sort of asymmetrical warfare. Trump violates norms and institutions all the time and then he counts on the rest of us to not. So, like, “Trump, you’re not supposed to threaten the press. You’re not supposed to get your crowds riled up and attacking the press. You’re not supposed to restrict access. You’re not supposed to do these things.” But it’s not law. At least most of it’s not law, but it’s just the way things are done. Trump says, “Fuck the way things are done. I’m going to do whatever I want.” The press, on the other hand, will say, “Off-the-record meetings happen all the time. That’s what we do. We’re going to go to the White House Correspondents’ Dinner when Trump goes and tells jokes. That’s what we always do.”"}, {"cbf7": "J.L.: Look, and when they call me and offer me a contract to write those jokes, who am I to say no to that check? I’ve got to eat."}, {"c54a": "J.F.: So Trump wins on both accounts. Because when he wants to violate norms and shake up institutions, he can, and when he wants to use them for his benefit, like he did last night, he can also do that."}, {"ff32": "The Press Needs Trump More Than Trump Needs the Press"}, {"afa4": "J.L.: Two things. One, this is not the first time the press have challenged an off-the-record gathering because there hasn’t been enough on-the-record access. Amy Chozick of The New York Times was talking about how in 2008, The New York Times and the AP sat out of an off-the-record gathering with Hillary Clinton because she wasn’t doing enough on-the-record conversations and, moving forward, [Clinton] did more on-the-record conversations. So it’s of course fine for reporters to talk to politicians off the record as long as there is also plenty of on-the-record conversation. So this is not only a case where they’re not upholding a norm, they’re bending over backward to give this guy credit and to give him a chance because they’re so afraid of losing access because Donald Trump understands that at this point, the press needs him more than he needs them."}, {"affb": "J.F.: Right. There was a reporter who tweeted on Friday that if Obama had done more press conferences, he would have left a better legacy and it would’ve made it easier to hold future presidents’ feet to the fire in terms of that kind of access, and I thought that was an incredibly stupid [and] naive thing to say because they are the ones who have to hold presidents accountable. If the press corps wants to demand more access, they need to be far more adversarial than they’ve been. And you have Reince Priebus on TV talking about fundamentally changing the way you do press briefings. Not only access to Donald Trump himself but even just the press secretary. So there was this erosion of access and [the media’s] response has not been close to sufficient to me with how serious of a threat this is to all of us who rely on the press for information."}, {"1e06": "But isn’t it a bit of a prisoner’s dilemma too? Because for the press to take action here, they have to all agree to do it together. And if a couple of them decided to protest last night and not go to Mar-a-Lago, then they lose out and their competitors go and get the information, right?"}, {"c665": "J.L.: Yeah, but that’s always the cost of fighting for a better kind of access at the expense of short-term access that benefits the candidate or the president. Yes, that’s always why things end up off the record. … There are so many outlets. There are so many reporters. They are all competing for the same limited amount of attention from powerful people. Look, the Obama administration has made use of that power dynamic and now Trump, without the same kind of moral standards, is using it even more. And that’s just the way it’s going to be unless these outlets and the White House Correspondents’ Association find a way to use its muscle."}, {"d27e": "T.V.: The broader problem is that it used to be that there could be some utility in reporters … refusing to go to a briefing as a group. In that it would have an actual cost for the president in terms of getting his message out. Unfortunately, I don’t know that that avenue is there anymore. Like [Trump’s] best buddy Sean Hannity is always going to be there to take his phone call and put him on air. Trump adviser Joe Scarborough will always welcome his call on Morning Joe. … So that’s the change in the landscape of the media that gives Trump even more power and means the White House Correspondents’ Association needs to be even tougher than they’ve been."}, {"d5a9": "J.L.: And maybe also recognizing that there’s a double-edged sword in that if a lack of access doesn’t cost Trump that much, then maybe access doesn’t get him that much and doesn’t get [the media] that much."}, {"a512": "T.V.: Right. Look at Vanity Fair. Vanity Fair had [the most] daily sign-ups in [its 103-year] history because Trump attacked them on Twitter. There is a good business to be made in being adversarial. The three of us know a little something about that on this podcast. So reporters need to get as tough as humanly possible and start digging into this guy. And who cares if you get a backgrounder with Reince Priebus? Move on. Figure out a way to do your job without it."}, {"c92a": "J.F.: Also, does Trump really want to be seen smiling, thumbs-up, with the crooked media?"}, {"58c1": "J.L.: He does, because it says, I own these people now. Look at my vassals."}, {"db8b": "J.F.: Just like his dinner with Mitt [Romney]."}, {"7bea": "J.L.: Exactly. Those people stand there. He puts his thumb up in the middle. He’s the center of that picture. He’s the center of their world. They all got potato chips and roast beef sandwiches and Trump wine and he’s like, look, look. Look at my supplicants. Behold. I own them now too."}], "content": "The Media’s Challenge in a Trump Administration Sunday’s off-the-record gathering shows how hard it will be to get access to the president President-elect Donald Trump held an off-the-record meeting with reporters Sunday evening at the Mar-a-Lago resort in Palm Beach, Florida. The gathering has drawn criticism from those who say that the media should be tougher on gaining access with Trump, who hasn’t held a press conference in 145 days. On the latest Keepin’ It 1600, Jon Favreau, Tommy Vietor, and Jon Lovett talked about the role of the media in the Trump administration. Listen to the full podcast here. This transcript has been edited and condensed. Trump Both Breaks and Follows Norms When it Suits Him Jon Favreau: OK, let’s talk about Mar-a-Lago, because last night it was the scene of an off-the-record gathering with the traveling press for Donald Trump. There was Trump wine, there were Trump steaks, there were pictures. We know this because Mike Allen of Axios posted a bunch of pictures on Twitter last night. It was off the record, but you could post pictures, as he told us in his tweets. And then there was one final picture of all of the reporters who went to this, smiling with Donald Trump, giving his little thumbs-up there. Jon Lovett: Like a class photo. J.F.: So this obviously engendered quite a bit of criticism on Twitter last night. Some reporters and liberals thought it was completely outrageous because Trump has threatened the press and refused to hold a press conference in [145] days. Others thought, “Hey, it’s an off-the-record meeting. You get to talk to the president-elect of the United States. What reporter refuses that? You can learn important information.” And then I think everyone thought the picture was pretty fucking silly. J.L.: No one’s a fan of the photoshoot. Like, “look at us, here we are at our off-the-record gathering where Donald Trump has a thumbs-up, looking like everyone’s favorite high school gym coach.” Tommy Vietor: The problem is it’s been [145] days since his last press conference and he canceled the one he was supposed to have about all the conflicts of interest, right? So at this point [in 2008], Obama had held like a half dozen or more availabilities with press. Trump hasn’t done that; he hasn’t named a real press secretary. They’re talking about it being [an] RNC communications guy, Sean Spicer. He might be a known quantity with the press, but he’s certainly not in the Trump inner circle the way Robert Gibbs was [with Obama] back in 2008. I think it’s absolutely fine to do off-the-record conversations with the press. I think it’s good for them to get to know him. I set up many of those myself with President Obama. It’s that I don’t think the press corps is fighting hard enough for things that are really important. That’s what makes me nervous. The way the correspondents’ association has been relatively impotent so far as they’ve seen their access curtailed and they’ve gotten nothing from the Trump Organization. I think the photo sort of encapsulates it because it has this sort of giddy tone of a tourist snapping a photo when they met a celebrity. It doesn’t bring with it the gravitas of how serious the job is. Especially when it’s a president who’s more hostile to the press than any since [Richard] Nixon. J.F.: This is an example of sort of asymmetrical warfare. Trump violates norms and institutions all the time and then he counts on the rest of us to not. So, like, “Trump, you’re not supposed to threaten the press. You’re not supposed to get your crowds riled up and attacking the press. You’re not supposed to restrict access. You’re not supposed to do these things.” But it’s not law. At least most of it’s not law, but it’s just the way things are done. Trump says, “Fuck the way things are done. I’m going to do whatever I want.” The press, on the other hand, will say, “Off-the-record meetings happen all the time. That’s what we do. We’re going to go to the White House Correspondents’ Dinner when Trump goes and tells jokes. That’s what we always do.” J.L.: Look, and when they call me and offer me a contract to write those jokes, who am I to say no to that check? I’ve got to eat. J.F.: So Trump wins on both accounts. Because when he wants to violate norms and shake up institutions, he can, and when he wants to use them for his benefit, like he did last night, he can also do that. The Press Needs Trump More Than Trump Needs the Press J.L.: Two things. One, this is not the first time the press have challenged an off-the-record gathering because there hasn’t been enough on-the-record access. Amy Chozick of The New York Times was talking about how in 2008, The New York Times and the AP sat out of an off-the-record gathering with Hillary Clinton because she wasn’t doing enough on-the-record conversations and, moving forward, [Clinton] did more on-the-record conversations. So it’s of course fine for reporters to talk to politicians off the record as long as there is also plenty of on-the-record conversation. So this is not only a case where they’re not upholding a norm, they’re bending over backward to give this guy credit and to give him a chance because they’re so afraid of losing access because Donald Trump understands that at this point, the press needs him more than he needs them. J.F.: Right. There was a reporter who tweeted on Friday that if Obama had done more press conferences, he would have left a better legacy and it would’ve made it easier to hold future presidents’ feet to the fire in terms of that kind of access, and I thought that was an incredibly stupid [and] naive thing to say because they are the ones who have to hold presidents accountable. If the press corps wants to demand more access, they need to be far more adversarial than they’ve been. And you have Reince Priebus on TV talking about fundamentally changing the way you do press briefings. Not only access to Donald Trump himself but even just the press secretary. So there was this erosion of access and [the media’s] response has not been close to sufficient to me with how serious of a threat this is to all of us who rely on the press for information. But isn’t it a bit of a prisoner’s dilemma too? Because for the press to take action here, they have to all agree to do it together. And if a couple of them decided to protest last night and not go to Mar-a-Lago, then they lose out and their competitors go and get the information, right? J.L.: Yeah, but that’s always the cost of fighting for a better kind of access at the expense of short-term access that benefits the candidate or the president. Yes, that’s always why things end up off the record. … There are so many outlets. There are so many reporters. They are all competing for the same limited amount of attention from powerful people. Look, the Obama administration has made use of that power dynamic and now Trump, without the same kind of moral standards, is using it even more. And that’s just the way it’s going to be unless these outlets and the White House Correspondents’ Association find a way to use its muscle. T.V.: The broader problem is that it used to be that there could be some utility in reporters … refusing to go to a briefing as a group. In that it would have an actual cost for the president in terms of getting his message out. Unfortunately, I don’t know that that avenue is there anymore. Like [Trump’s] best buddy Sean Hannity is always going to be there to take his phone call and put him on air. Trump adviser Joe Scarborough will always welcome his call on Morning Joe. … So that’s the change in the landscape of the media that gives Trump even more power and means the White House Correspondents’ Association needs to be even tougher than they’ve been. J.L.: And maybe also recognizing that there’s a double-edged sword in that if a lack of access doesn’t cost Trump that much, then maybe access doesn’t get him that much and doesn’t get [the media] that much. T.V.: Right. Look at Vanity Fair. Vanity Fair had [the most] daily sign-ups in [its 103-year] history because Trump attacked them on Twitter. There is a good business to be made in being adversarial. The three of us know a little something about that on this podcast. So reporters need to get as tough as humanly possible and start digging into this guy. And who cares if you get a backgrounder with Reince Priebus? Move on. Figure out a way to do your job without it. J.F.: Also, does Trump really want to be seen smiling, thumbs-up, with the crooked media? J.L.: He does, because it says, I own these people now. Look at my vassals. J.F.: Just like his dinner with Mitt [Romney]. J.L.: Exactly. Those people stand there. He puts his thumb up in the middle. He’s the center of that picture. He’s the center of their world. They all got potato chips and roast beef sandwiches and Trump wine and he’s like, look, look. Look at my supplicants. Behold. I own them now too. ", "child": "269_1"}