{"name": "271", "parent": "", "title": "I blogged every day for a month. Here’s what happened.", "sentences": [{"72fc": "I blogged every day for a month. Here’s what happened."}, {"c3c7": "The results of a Quora + Medium experiment."}, {"95cb": "Fair warning! This is a very long post."}, {"ec27": "For the past month, I’ve been experimenting with a strategy for blogging."}, {"2b38": "A strategy for blogging.How to figure out what you want to say.medium.com"}, {"4a4a": "Here’s the quick and dirty details:"}, {"aec9": "Everyday I answered at least one question on Quora and wrote at least one post on Medium."}, {"1e83": "Quora lets you see how many views and upvotes any of your answers has. The stats page looks like this:"}, {"cd27": "The list of answers on the left are in order of how popular they are. So, I can see which of my answers are getting traction. I cross posted some of those to Medium. Other days I wrote fresh content for Medium, or wrote a post on Medium that was inspired by an answer on Quora, but wasn’t a direct cross post."}, {"8f4d": "I posted on Medium every day for 30 days. I answered questions on Quora starting on day 10."}, {"3103": "Here’s how that worked for me:"}, {"417d": "I had 10K views on Quora"}, {"021a": "I don’t have enough experience on Quora to know whether or not this is good, bad, or somewhere in the middle. I do know that none of my answers had more than 600 views and none had more than 10 upvotes."}, {"b223": "My strategy for choosing questions was to answer those that were either less than a day old, or about a week old with 1000 or more views."}, {"be7d": "Quora featured three of my answers in small newsletters"}, {"d0d5": "This felt nice. Again, I don’t really know how normal or unusual it might be. It was enough, though, for me to know that I’ll definitely keep up with my one answer a day strategy."}, {"7839": "My stories on Medium had more than 36,000 views"}, {"e600": "This was a definite increase. my page views in February were just less than 12,000, which included one post that had 8,000 views. If you look at my stats chart, you can see that my views steadily increased over the month, as I had more and more content."}, {"c02b": "Here’s February’s stats, for comparison. You can easily see where I had one post that did very well. Both January and December, I had fewer than 4,000 page views."}, {"0c9a": "I posted 9 times in February, 5 times in January, and twice in December. Here’s January’s stats page."}, {"2fb1": "None of my posts in March went viral, but there was a steady feeling of growth. I’m pretty sure that’s how blogging should be. A viral post is a nice, but it can’t be counted on."}, {"6169": "As a comparison, my Medium posts got roughly twice as many page views as the posts I made to my own blog in the last 30 days."}, {"fa0d": "I haven’t had the same feeling of steady growth there. I’ve had about 500 page views a month for months. However, I can see maybe a slight uptick in the last thirty days."}, {"82e2": "One story had more than 4000 views"}, {"b710": "The One Habit Every Writer Needs. Right now.It only takes ten minutes a day.writingcooperative.com"}, {"feac": "Several had more than 2000 views"}, {"7034": "How to Become a Goddamn Idea MachineJames Altucher is my new best friend.medium.com"}, {"835f": "A strategy for blogging.How to figure out what you want to say.medium.com"}, {"31ff": "My Take on the Whole Medium Membership ThingLet’s all just take a breaththecoffeelicious.com"}, {"7b99": "Rethinking Internet MarketingI am sick of being sold to. And by extension, I’m dead sick of selling.thecoffeelicious.com"}, {"5bd7": "I was mansplained about my level of passion for writing"}, {"4272": "I wanted to like this.medium.com"}, {"1f6e": "The largest publication on Medium asked to publish my response to said mansplaining"}, {"33e3": "It was a nice surprise to get an email from Startup Grind, asking if they could publish one of my posts. This one:"}, {"42c2": "It’s OK to write what people want to read.Thoughts on chasing eyeballs.medium.com"}, {"4688": "It’s interesting to note that it wasn’t a viral post. Not even close. It had about 75 page views when the request came in. That request just came in yesterday and Startup Grind hasn’t actually published my post yet, so I can’t tell you how it went. (I’ll update this post in a day or two.)"}, {"c2c2": "Another note: that post was the most directly confrontational thing I’d ever written and I almost didn’t post it at all."}, {"02cd": "I added more than 150 subscribers to my email list directly from Medium and gained 800+ Medium followers"}, {"a7fb": "I used Upscribe to add a form to my posts on Medium. I’ve used Rabbut in the past, so older posts have Rabbut forms. Over both, I added 157 subscribers to my email list."}, {"2a44": "Trying to figure out how that translates to a conversion rate and comparing it to my blog was difficult. The welcome mat on my blog had a conversion rate of a little more than 10% over the last 30 days."}, {"fe23": "If my math is right (it might totally not be), 157 is a little less than .5% of 36,000. But, that’s every single time someone saw a Medium post. On my blog, if someone is already a subscriber, they don’t see the welcome mat. My welcome mat was only shown 9,265 times, or to about half of my blog’s visitors, so the conversion rate is artificially high."}, {"18f0": "I also gained a bunch of followers on Medium who didn’t make it to my email list. My Medium followers went from 2800 to 3600. If you add in the people who followed me on Medium, the conversion rate goes up to almost three percent."}, {"767f": "There is no way for me to know what percentage of the people who viewed my posts on Medium are already my followers. So, really, it’s impossible to know what my conversion rate is or compare it fairly to my blog conversion rate. I’m pretty sure that my blog converts better."}, {"40d0": "I give something away on my blog in exchange for an email. People sometimes sign up for the free thing and never open another email or come back to my blog. People who signed up on Medium only signed up to read what I’m writing. I’m not sure if that makes them higher quality subscribers, but it seems like it’s at least possible."}, {"9e65": "My Quora followers went from 0 to 48. I’m super new on that site."}, {"9cbe": "The Huffington Post reprinted one of my stories"}, {"77f8": "Vox bought the same story for $500."}, {"47bb": "I spent about an hour a day on this experiment. So, I was paid $500 for 30 hours work, which comes to $16.66 per hour, before taxes. A living wage, according to Bernie Sanders. It hasn’t been published yet."}, {"2b60": "If I don’t make this one story subsidize all the others, I was paid $500 for about two hours work, or $250 an hour. But I think that’s misleading."}, {"68fd": "I became a top writer and was invited to apply to Medium’s Partnership Program."}, {"d3da": "I’m not sure. Maybe I would have been invited anyway. But, I have a feeling that being very active during the time when they were making these decisions didn’t hurt."}, {"fca4": "I was also made a top writer in Fiction, Creativity, Writing, Art, and Productivity. I think it was probably just good timing that I decided to become more active on Medium at a time when they were making some changes."}, {"84fd": "I met another Medium writer, who lives in my area."}, {"3d5a": "It was super cool to get a message from Jonas Ellison, who’s publication Higher Thoughts is one of my favorite Medium reads. We both live in the Reno/Tahoe area, so we had coffee."}, {"fcd0": "I got the idea for this 30 day debriefing post from him. Thanks Jonas!"}, {"1d8a": "I never ran out of ideas."}, {"a9c6": "By far the coolest part of the whole Quora/Medium one-two punch is that I never even came close to running out of ideas. They just flowed."}, {"e983": "Also, Quora helped me to gauge which ideas might actually appeal to readers. If I had an idea for a post, I could search questions on Quora and see if people were responding to that topic."}, {"9dab": "I played around with a headline analyzer + found out click bait works."}, {"73ba": "This probably isn’t exactly good news, but I thought I’d report back anyway, since it was part of my experiment. The post below had less than 100 page views in three days when it’s title was “On Becoming an Idea Machine.”"}, {"d466": "How to Become a Goddamn Idea MachineJames Altucher is my new best friend.medium.com"}, {"6b1d": "I found this site, where you can input a story headline and it will analyze it for you. I fiddled around until I had a headline that scored 73, which was the highest I could get it. (The original title scored 52.)"}, {"6f57": "Literally all I did was make it a ‘how to’ headline and add a swear. I didn’t change anything else about the story (Including where it was published. Coffeelicious published the story the day I wrote it.)"}, {"6c80": "As I write this, it has 2,100 views and 143 recommends. The page views tripled within an hour of changing the title."}, {"73db": "This whole experiment proved something I already knew: consistent writing pays off."}, {"3afc": "I’m going to extend my experiment to three months. I’ll keep you posted."}, {"4fee": "Liked this? Give it some love with a ❤ below!Want more? Sign up for the Ninja Writers Newsletter & hang out with the Ninjas on Facebook.Last, there are some pretty kickass rewards on our Patreon page."}], "content": "I blogged every day for a month. Here’s what happened. The results of a Quora + Medium experiment. Fair warning! This is a very long post. For the past month, I’ve been experimenting with a strategy for blogging. A strategy for blogging.How to figure out what you want to say.medium.com Here’s the quick and dirty details: Everyday I answered at least one question on Quora and wrote at least one post on Medium. Quora lets you see how many views and upvotes any of your answers has. The stats page looks like this: The list of answers on the left are in order of how popular they are. So, I can see which of my answers are getting traction. I cross posted some of those to Medium. Other days I wrote fresh content for Medium, or wrote a post on Medium that was inspired by an answer on Quora, but wasn’t a direct cross post. I posted on Medium every day for 30 days. I answered questions on Quora starting on day 10. Here’s how that worked for me: I had 10K views on Quora I don’t have enough experience on Quora to know whether or not this is good, bad, or somewhere in the middle. I do know that none of my answers had more than 600 views and none had more than 10 upvotes. My strategy for choosing questions was to answer those that were either less than a day old, or about a week old with 1000 or more views. Quora featured three of my answers in small newsletters This felt nice. Again, I don’t really know how normal or unusual it might be. It was enough, though, for me to know that I’ll definitely keep up with my one answer a day strategy. My stories on Medium had more than 36,000 views This was a definite increase. my page views in February were just less than 12,000, which included one post that had 8,000 views. If you look at my stats chart, you can see that my views steadily increased over the month, as I had more and more content. Here’s February’s stats, for comparison. You can easily see where I had one post that did very well. Both January and December, I had fewer than 4,000 page views. I posted 9 times in February, 5 times in January, and twice in December. Here’s January’s stats page. None of my posts in March went viral, but there was a steady feeling of growth. I’m pretty sure that’s how blogging should be. A viral post is a nice, but it can’t be counted on. As a comparison, my Medium posts got roughly twice as many page views as the posts I made to my own blog in the last 30 days. I haven’t had the same feeling of steady growth there. I’ve had about 500 page views a month for months. However, I can see maybe a slight uptick in the last thirty days. One story had more than 4000 views The One Habit Every Writer Needs. Right now.It only takes ten minutes a day.writingcooperative.com Several had more than 2000 views How to Become a Goddamn Idea MachineJames Altucher is my new best friend.medium.com A strategy for blogging.How to figure out what you want to say.medium.com My Take on the Whole Medium Membership ThingLet’s all just take a breaththecoffeelicious.com Rethinking Internet MarketingI am sick of being sold to. And by extension, I’m dead sick of selling.thecoffeelicious.com I was mansplained about my level of passion for writing I wanted to like this.medium.com The largest publication on Medium asked to publish my response to said mansplaining It was a nice surprise to get an email from Startup Grind, asking if they could publish one of my posts. This one: It’s OK to write what people want to read.Thoughts on chasing eyeballs.medium.com It’s interesting to note that it wasn’t a viral post. Not even close. It had about 75 page views when the request came in. That request just came in yesterday and Startup Grind hasn’t actually published my post yet, so I can’t tell you how it went. (I’ll update this post in a day or two.) Another note: that post was the most directly confrontational thing I’d ever written and I almost didn’t post it at all. I added more than 150 subscribers to my email list directly from Medium and gained 800+ Medium followers I used Upscribe to add a form to my posts on Medium. I’ve used Rabbut in the past, so older posts have Rabbut forms. Over both, I added 157 subscribers to my email list. Trying to figure out how that translates to a conversion rate and comparing it to my blog was difficult. The welcome mat on my blog had a conversion rate of a little more than 10% over the last 30 days. If my math is right (it might totally not be), 157 is a little less than .5% of 36,000. But, that’s every single time someone saw a Medium post. On my blog, if someone is already a subscriber, they don’t see the welcome mat. My welcome mat was only shown 9,265 times, or to about half of my blog’s visitors, so the conversion rate is artificially high. I also gained a bunch of followers on Medium who didn’t make it to my email list. My Medium followers went from 2800 to 3600. If you add in the people who followed me on Medium, the conversion rate goes up to almost three percent. There is no way for me to know what percentage of the people who viewed my posts on Medium are already my followers. So, really, it’s impossible to know what my conversion rate is or compare it fairly to my blog conversion rate. I’m pretty sure that my blog converts better. I give something away on my blog in exchange for an email. People sometimes sign up for the free thing and never open another email or come back to my blog. People who signed up on Medium only signed up to read what I’m writing. I’m not sure if that makes them higher quality subscribers, but it seems like it’s at least possible. My Quora followers went from 0 to 48. I’m super new on that site. The Huffington Post reprinted one of my stories Vox bought the same story for $500. I spent about an hour a day on this experiment. So, I was paid $500 for 30 hours work, which comes to $16.66 per hour, before taxes. A living wage, according to Bernie Sanders. It hasn’t been published yet. If I don’t make this one story subsidize all the others, I was paid $500 for about two hours work, or $250 an hour. But I think that’s misleading. I became a top writer and was invited to apply to Medium’s Partnership Program. I’m not sure. Maybe I would have been invited anyway. But, I have a feeling that being very active during the time when they were making these decisions didn’t hurt. I was also made a top writer in Fiction, Creativity, Writing, Art, and Productivity. I think it was probably just good timing that I decided to become more active on Medium at a time when they were making some changes. I met another Medium writer, who lives in my area. It was super cool to get a message from Jonas Ellison, who’s publication Higher Thoughts is one of my favorite Medium reads. We both live in the Reno/Tahoe area, so we had coffee. I got the idea for this 30 day debriefing post from him. Thanks Jonas! I never ran out of ideas. By far the coolest part of the whole Quora/Medium one-two punch is that I never even came close to running out of ideas. They just flowed. Also, Quora helped me to gauge which ideas might actually appeal to readers. If I had an idea for a post, I could search questions on Quora and see if people were responding to that topic. I played around with a headline analyzer + found out click bait works. This probably isn’t exactly good news, but I thought I’d report back anyway, since it was part of my experiment. The post below had less than 100 page views in three days when it’s title was “On Becoming an Idea Machine.” How to Become a Goddamn Idea MachineJames Altucher is my new best friend.medium.com I found this site, where you can input a story headline and it will analyze it for you. I fiddled around until I had a headline that scored 73, which was the highest I could get it. (The original title scored 52.) Literally all I did was make it a ‘how to’ headline and add a swear. I didn’t change anything else about the story (Including where it was published. Coffeelicious published the story the day I wrote it.) As I write this, it has 2,100 views and 143 recommends. The page views tripled within an hour of changing the title. This whole experiment proved something I already knew: consistent writing pays off. I’m going to extend my experiment to three months. I’ll keep you posted. Liked this? Give it some love with a ❤ below!Want more? Sign up for the Ninja Writers Newsletter & hang out with the Ninjas on Facebook.Last, there are some pretty kickass rewards on our Patreon page. ", "child": "271_1\t271_2\t271_3\t271_4\t271_5\t271_6\t271_7\t271_8\t271_9\t271_10\t271_11\t271_12\t271_13\t271_14\t271_15\t271_16\t271_17\t271_18\t271_19\t271_20\t271_21\t271_22\t271_23\t271_24\t271_25271_1\t271_2\t271_3\t271_4\t271_5\t271_6\t271_7\t271_8\t271_9\t271_10\t271_11\t271_12\t271_13\t271_14\t271_15\t271_16\t271_17\t271_18\t271_19\t271_20\t271_21\t271_22\t271_23\t271_24\t271_25"}