{"name": "273", "parent": "", "title": "New York Times defends hiring extreme climate denier: ‘millions agree with him’", "sentences": [{"254c": "New York Times defends hiring extreme climate denier: ‘millions agree with him’"}, {"4578": "The Times replaces search for truth with search for popular ideas that are false. But would they hire a Holocaust denier?"}, {"dca2": "CREDIT: Flickr/Scott Beale/Laughing Squid"}, {"dca0": "Amidst backlash and subscription cancellations for hiring extreme climate science denier, Bret Stephens, the New York Times offered a stunning defense: There are “millions of people who agree with him.”"}, {"0534": "With that ‘logic’, the Times could hire as a columnist former Imperial Wizard of the Ku Klux Klan David Duke — or a flat earther or someone who thinks vaccines pose a health hazard. After all, millions agree with them."}, {"fe2f": "Screenshot of a typical pop-up ad in the NY Times new ad campaign."}, {"5139": "This defense is especially absurd since, as I detailed Friday, the Times has been running a major ad campaign claiming there is no alternative to the truth — and former Wall Street Journal deputy editorial page editor Stephens has repeatedly dismissed as “imaginary” the climate reality reported on every week by the Times’ own journalists."}, {"d3b1": "But apparently the Times editorial page is not engaged in a search for the truth. Instead, it is engaged in the search for popular ideas to spread even if they are known to be false “alternative” facts."}, {"d001": "After hyping itself as antidote to fake news, New York Times hires extreme climate denierNew columnist Bret Stephens dismisses as “imaginary” the climate reality routinely reported by the Times. They can’t…thinkprogress.org"}, {"a6db": "Indeed, James Bennet, the Times’ editorial page editor, told The Huffington Post on Friday that “to pretend like the views of a thinker like Bret, and the millions of people who agree with him on a range of issues, should simply be ignored, that they’re outside the bounds of reasonable debate, is a really dangerous form of delusion.”"}, {"8228": "No one is saying climate science denial should be ignored. Yet rather than embracing denial, as the Times editors are now doing, they should be debunking it, something that the news section of the paper does on a routine basis."}, {"8980": "Now here’s where the Times defense gets especially Orwellian:"}, {"fb6f": "The charge that Stephens is a “climate denialist” is “terribly unfair,” Bennet said. “There’s more than one kind of denial,” he continued."}, {"564a": "But just two weeks ago, in a story on the deniers in the Trump administration, the Times itself labeled those who deny the established science of human-caused climate change “climate change denialists”!"}, {"1087": "And while it’s true that there’s more than one kind of denial, Stephens is clearly one the most extreme deniers in the country, as a reading of his Wall Street Journal columns makes clear. Climatologist Michael Mann emailed ThinkProgress that Stephens was “one of the most notorious climate change deniers.”"}, {"56d7": "To quickly review, a 2008 column titled, “Global Warming as Mass Neurosis,” begins, “last week marked the 20th anniversary of the mass hysteria phenomenon known as global warming. Much of the science has since been discredited.” In 2009 he directly compared climate scientists and those who accept their finding to Stalinists, anti-Semites and Communists."}, {"d13a": "Climate scientists around the world debunk Wall Street Journal “Stalinist” screedthinkprogress.org"}, {"e8db": "In 2015, he called concern over climate change “hysteria” and wrote that global warming — along with hunger in America, campus rape statistics, and institutionalized racism — are “imaginary enemies.” He is so extreme that he dismissed the well-documented “vanishing polar ice” as based on “flimsy studies” — when in fact it has been unbelievably well documented, including by the Times itself."}, {"2614": "And while the Times asserts that Stephens brings to the paper, “profound intellectual depth, honesty and bravery,” Stephens won’t even stand by what he wrote for the Journal. He actually told the Huffington Post he is a “climate agnostic.”"}, {"c05e": "I defy anybody to read his entire November 2015 column (let alone all the others) and assert Stephens is “agnostic” on climate change. That is the very definition of an alternative fact."}, {"37ea": "In a statement to Huffington Post, Stephens wrote “Is the earth warming? That’s what the weight of scientific evidence indicates. Is it at least partially, and probably largely, a result of man-made carbon emissions? Again, that seems to be the case.”"}, {"1f55": "Seriously? His 2015 Wall Street Journal column ends by offering a “climate prediction for the year 2115: …. Temperatures will be about the same.”"}, {"5fda": "He and the Times are playing their readers for suckers if the goal is to feature controversy and obtain more readers. Like United Airlines, the Times would be valuing profits more than its customers. But if this is a play for more readers, clicks, and subscriptions, it may not be as successful as the Times would hope."}, {"5a9e": "Subscribers such as climatologist Ken Caldeira are opting out."}], "content": "New York Times defends hiring extreme climate denier: ‘millions agree with him’ The Times replaces search for truth with search for popular ideas that are false. But would they hire a Holocaust denier? CREDIT: Flickr/Scott Beale/Laughing Squid Amidst backlash and subscription cancellations for hiring extreme climate science denier, Bret Stephens, the New York Times offered a stunning defense: There are “millions of people who agree with him.” With that ‘logic’, the Times could hire as a columnist former Imperial Wizard of the Ku Klux Klan David Duke — or a flat earther or someone who thinks vaccines pose a health hazard. After all, millions agree with them. Screenshot of a typical pop-up ad in the NY Times new ad campaign. This defense is especially absurd since, as I detailed Friday, the Times has been running a major ad campaign claiming there is no alternative to the truth — and former Wall Street Journal deputy editorial page editor Stephens has repeatedly dismissed as “imaginary” the climate reality reported on every week by the Times’ own journalists. But apparently the Times editorial page is not engaged in a search for the truth. Instead, it is engaged in the search for popular ideas to spread even if they are known to be false “alternative” facts. After hyping itself as antidote to fake news, New York Times hires extreme climate denierNew columnist Bret Stephens dismisses as “imaginary” the climate reality routinely reported by the Times. They can’t…thinkprogress.org Indeed, James Bennet, the Times’ editorial page editor, told The Huffington Post on Friday that “to pretend like the views of a thinker like Bret, and the millions of people who agree with him on a range of issues, should simply be ignored, that they’re outside the bounds of reasonable debate, is a really dangerous form of delusion.” No one is saying climate science denial should be ignored. Yet rather than embracing denial, as the Times editors are now doing, they should be debunking it, something that the news section of the paper does on a routine basis. Now here’s where the Times defense gets especially Orwellian: The charge that Stephens is a “climate denialist” is “terribly unfair,” Bennet said. “There’s more than one kind of denial,” he continued. But just two weeks ago, in a story on the deniers in the Trump administration, the Times itself labeled those who deny the established science of human-caused climate change “climate change denialists”! And while it’s true that there’s more than one kind of denial, Stephens is clearly one the most extreme deniers in the country, as a reading of his Wall Street Journal columns makes clear. Climatologist Michael Mann emailed ThinkProgress that Stephens was “one of the most notorious climate change deniers.” To quickly review, a 2008 column titled, “Global Warming as Mass Neurosis,” begins, “last week marked the 20th anniversary of the mass hysteria phenomenon known as global warming. Much of the science has since been discredited.” In 2009 he directly compared climate scientists and those who accept their finding to Stalinists, anti-Semites and Communists. Climate scientists around the world debunk Wall Street Journal “Stalinist” screedthinkprogress.org In 2015, he called concern over climate change “hysteria” and wrote that global warming — along with hunger in America, campus rape statistics, and institutionalized racism — are “imaginary enemies.” He is so extreme that he dismissed the well-documented “vanishing polar ice” as based on “flimsy studies” — when in fact it has been unbelievably well documented, including by the Times itself. And while the Times asserts that Stephens brings to the paper, “profound intellectual depth, honesty and bravery,” Stephens won’t even stand by what he wrote for the Journal. He actually told the Huffington Post he is a “climate agnostic.” I defy anybody to read his entire November 2015 column (let alone all the others) and assert Stephens is “agnostic” on climate change. That is the very definition of an alternative fact. In a statement to Huffington Post, Stephens wrote “Is the earth warming? That’s what the weight of scientific evidence indicates. Is it at least partially, and probably largely, a result of man-made carbon emissions? Again, that seems to be the case.” Seriously? His 2015 Wall Street Journal column ends by offering a “climate prediction for the year 2115: …. Temperatures will be about the same.” He and the Times are playing their readers for suckers if the goal is to feature controversy and obtain more readers. Like United Airlines, the Times would be valuing profits more than its customers. But if this is a play for more readers, clicks, and subscriptions, it may not be as successful as the Times would hope. Subscribers such as climatologist Ken Caldeira are opting out. ", "child": "273_1\t273_2\t273_3\t273_4\t273_5\t273_6\t273_7\t273_8\t273_9\t273_10\t273_11\t273_12\t273_13\t273_14\t273_15"}