{"name": "278", "parent": "", "title": "The People of the Past and Future", "sentences": [{"e8ef": "The People of the Past and Future"}, {"b6e5": "Looking Backwards and Forwards a Million Years"}, {"b2c9": "A million years ago, early humans possessed modern body proportions, having longer legs and shorter arms relative to their torsos. Males were about 25% larger than females. There was significantly increased encephalization in this hominan, being about two-thirds the size of that of Homo sapiens, displaying a general trend toward a more modern brain. Homo erectus even became the first ape to have consistently noticeable whites in their eyes. This, allowed them to convey a rich depth of meaning with nothing more than a glance. Plus, hair loss reduced the need to pant, which freed up their breathing for much more efficient communication, giving erectus a greater range of calls than that of their ancestors. Although they lacked complex language, these were the first humans to have a truly modern sounding voice."}, {"0fd2": "Having developed the strength and confidence they needed, our primitive hominan ancestors began their great diaspora across the continents, beginning in Africa and moving out into Asia and then on to other parts of the world. During the time of Homo erectus, there were only about 25,000 breeding humans on the planet, leading to an incredibly small population of people. However, this otherwise endangered species cared for the sick and elderly within its communities. As a result of all the improving social conditions among these people, reproduction and migration flourished. So, these hominans eventually thrived."}, {"5834": "To do this, Homo erectus developed the Aucheulean hand axe by refining on the concept of the earlier Oldowan tool. Rather than just rock flakes, the more sophisticated two-sided hand axes were several inches long and specifically shaped as multi-purpose tools. This marvelous invention was used for digging and hammering and butchering and many other things. As if that wasn’t enough, by that point in the evolution, Homo erectus had also gained mastery over fire and began to cook their food. These god-like powers gave them a kind of dominion over the rest of nature."}, {"d0b8": "Looking forward instead of backward, we are surely as far removed from Homo erectus as our descendants will be from us a million years in the future. By then, humans will evolve into a far more egalitarian species. People will become increasingly indistinguishable, as more and more genetic material is exchanged within our species. Humans will develop a more uniform kind of mono-ethnic appearance as Africans, Asians, Europeans, and everyone else interbreeds more and more. Recessive genes will be removed, causing the loss of many inheritable traits like divergent hair and eye colors. Our descendants will become far more androgynous as sexual dimorphism vanishes. They will develop highly dexterous thumbs. Their eyes will grow larger, and their foreheads will get a little bit bigger. All of their follicles will become dormant, making them completely hairless. Their feet will even become more streamlined, as smaller toes recede away, along with other vestigial parts like the appendix."}, {"9f10": "In a hundred years Homo sapiens will become a type I civilization. Then, in a thousand years we will be at type II, and in a million years people will achieve type III status. By then people will have control over the Milky Way, having established colonies in many different solar systems within the galaxy. They will be able to fully harness the energy within the stars, being capable of generating power on the order of 10³⁷ watts. As they reach out from the eighth scale of being, to the planetary at the ninth, and stellar at the tenth, and so on and so forth, humans will evolve more and more, but they will also invent and integrate a great deal as well. Technology will surely propel them to whole new levels."}, {"b72f": "Presumably, their super society will be so advanced, that it would be like erectus trying to make sense of sapiens, for me to even begin to grasp what things will be like a million years from now. In reality, there is simply no way of knowing the unimaginably profound changes people will undergo in the hundreds of thousands of years to come. Our genus is undoubtedly going to be altered in unrecognizable ways, but at the same time people are still just basically going to be the same old humans we’ve always been. Sure, the intergalactic descendants of our species are going to live in some kind of sci-fi dream world compared to us, with wonders beyond belief, but humanity will still exist at the heart of it all, in more or less the same way that it always has. The human condition will continue to revolve around personal and familial struggles, people will still fall in love like we always do. Whatever Homo sapiens become, they will still be human, if not far more so…"}], "content": "The People of the Past and Future Looking Backwards and Forwards a Million Years A million years ago, early humans possessed modern body proportions, having longer legs and shorter arms relative to their torsos. Males were about 25% larger than females. There was significantly increased encephalization in this hominan, being about two-thirds the size of that of Homo sapiens, displaying a general trend toward a more modern brain. Homo erectus even became the first ape to have consistently noticeable whites in their eyes. This, allowed them to convey a rich depth of meaning with nothing more than a glance. Plus, hair loss reduced the need to pant, which freed up their breathing for much more efficient communication, giving erectus a greater range of calls than that of their ancestors. Although they lacked complex language, these were the first humans to have a truly modern sounding voice. Having developed the strength and confidence they needed, our primitive hominan ancestors began their great diaspora across the continents, beginning in Africa and moving out into Asia and then on to other parts of the world. During the time of Homo erectus, there were only about 25,000 breeding humans on the planet, leading to an incredibly small population of people. However, this otherwise endangered species cared for the sick and elderly within its communities. As a result of all the improving social conditions among these people, reproduction and migration flourished. So, these hominans eventually thrived. To do this, Homo erectus developed the Aucheulean hand axe by refining on the concept of the earlier Oldowan tool. Rather than just rock flakes, the more sophisticated two-sided hand axes were several inches long and specifically shaped as multi-purpose tools. This marvelous invention was used for digging and hammering and butchering and many other things. As if that wasn’t enough, by that point in the evolution, Homo erectus had also gained mastery over fire and began to cook their food. These god-like powers gave them a kind of dominion over the rest of nature. Looking forward instead of backward, we are surely as far removed from Homo erectus as our descendants will be from us a million years in the future. By then, humans will evolve into a far more egalitarian species. People will become increasingly indistinguishable, as more and more genetic material is exchanged within our species. Humans will develop a more uniform kind of mono-ethnic appearance as Africans, Asians, Europeans, and everyone else interbreeds more and more. Recessive genes will be removed, causing the loss of many inheritable traits like divergent hair and eye colors. Our descendants will become far more androgynous as sexual dimorphism vanishes. They will develop highly dexterous thumbs. Their eyes will grow larger, and their foreheads will get a little bit bigger. All of their follicles will become dormant, making them completely hairless. Their feet will even become more streamlined, as smaller toes recede away, along with other vestigial parts like the appendix. In a hundred years Homo sapiens will become a type I civilization. Then, in a thousand years we will be at type II, and in a million years people will achieve type III status. By then people will have control over the Milky Way, having established colonies in many different solar systems within the galaxy. They will be able to fully harness the energy within the stars, being capable of generating power on the order of 10³⁷ watts. As they reach out from the eighth scale of being, to the planetary at the ninth, and stellar at the tenth, and so on and so forth, humans will evolve more and more, but they will also invent and integrate a great deal as well. Technology will surely propel them to whole new levels. Presumably, their super society will be so advanced, that it would be like erectus trying to make sense of sapiens, for me to even begin to grasp what things will be like a million years from now. In reality, there is simply no way of knowing the unimaginably profound changes people will undergo in the hundreds of thousands of years to come. Our genus is undoubtedly going to be altered in unrecognizable ways, but at the same time people are still just basically going to be the same old humans we’ve always been. Sure, the intergalactic descendants of our species are going to live in some kind of sci-fi dream world compared to us, with wonders beyond belief, but humanity will still exist at the heart of it all, in more or less the same way that it always has. The human condition will continue to revolve around personal and familial struggles, people will still fall in love like we always do. Whatever Homo sapiens become, they will still be human, if not far more so… ", "child": "278_1\t278_2\t278_3"}