{"name": "287", "parent": "", "title": "Bad News: Your Fitbit Is A Fit-Bust", "sentences": [{"14fb": "Bad News: Your Fitbit Is A Fit-Bust"}, {"7415": "A surprising study found participants who did not wear a fitness tracker lost more weight."}, {"0963": "If you’ve ever done a “quick lap” around the house to cram in some additional steps before bed, then you may want to sit down before this next announcement: Your Fitbit is a lie. The fitness technology industry has played us for fools and we stepped right into their trap."}, {"4cc0": "We were previously led to believe that using a wearable technology device (like a Fitbit, Jawbone, Garmin or any of those terrible smartwatches), coupled with diet and exercise, could increase our weight-loss potential. But according to a new study published by the Journal of the American Medical Association, this is not the case."}, {"c10a": "John M. Jakicic is a Professor at the University of Pittsburgh and the Chair of the Department of Health and Physical Activity. Between 2010 and 2012, he and his team of fellow researchers studied 471 eighteen- to thirty-five-year-olds who qualified as overweight or obese. After six months, the study participants were divided into two groups; one group was given a wearable device. According to Jakicic, the objective of the study was:"}, {"1133": "“To examine whether or not when we gave a behavioral weight loss program to individuals who were overweight or obese if we added wearable technology—something that actually monitored physical activity and energy expenditure— whether that would actually enhance the weight loss over 24 months.”"}, {"066c": "To their surprise, it did not. The control group ended up losing, on average, 5.3 pounds more than the group that utilized wearable devices."}, {"0f0b": "However, the study is not without its limitations. Jakicic points out that the device participants were given is now five years old, and was worn on participants’ arms (most wearable tech is now strapped to the wrist)."}, {"13d8": "Wearable technology is becoming ever more prevalent. Snapchat, which is in the process of rebranding to Snap, Inc., just announced the release of their first piece of wearable technology: Spectacles, sunglasses with a built-in camera that allows users to share what they’re seeing with their eyes directly on their Snapchat."}, {"5b8c": "But while wearable technology continues to evolve, Jakicic cautions that fitness tech is not a one-size-fits-all industry. In fact, he believes that if you’re successfully engaging in a behavioral weight-loss program, you should avoid purchasing a wearable device because, in his words, “You probably don’t need it.”"}, {"b1ea": "“[Wearable devices] might actually give people somewhat of a false sense of security that they don’t pay attention to some of the key behaviors that they otherwise might pay attention to,” Jakicic says. “They’re relying on the device or the technology maybe a little bit too much and that may be why we saw a little bit less weight loss in that group.”"}], "content": "Bad News: Your Fitbit Is A Fit-Bust A surprising study found participants who did not wear a fitness tracker lost more weight. If you’ve ever done a “quick lap” around the house to cram in some additional steps before bed, then you may want to sit down before this next announcement: Your Fitbit is a lie. The fitness technology industry has played us for fools and we stepped right into their trap. We were previously led to believe that using a wearable technology device (like a Fitbit, Jawbone, Garmin or any of those terrible smartwatches), coupled with diet and exercise, could increase our weight-loss potential. But according to a new study published by the Journal of the American Medical Association, this is not the case. John M. Jakicic is a Professor at the University of Pittsburgh and the Chair of the Department of Health and Physical Activity. Between 2010 and 2012, he and his team of fellow researchers studied 471 eighteen- to thirty-five-year-olds who qualified as overweight or obese. After six months, the study participants were divided into two groups; one group was given a wearable device. According to Jakicic, the objective of the study was: “To examine whether or not when we gave a behavioral weight loss program to individuals who were overweight or obese if we added wearable technology—something that actually monitored physical activity and energy expenditure— whether that would actually enhance the weight loss over 24 months.” To their surprise, it did not. The control group ended up losing, on average, 5.3 pounds more than the group that utilized wearable devices. However, the study is not without its limitations. Jakicic points out that the device participants were given is now five years old, and was worn on participants’ arms (most wearable tech is now strapped to the wrist). Wearable technology is becoming ever more prevalent. Snapchat, which is in the process of rebranding to Snap, Inc., just announced the release of their first piece of wearable technology: Spectacles, sunglasses with a built-in camera that allows users to share what they’re seeing with their eyes directly on their Snapchat. But while wearable technology continues to evolve, Jakicic cautions that fitness tech is not a one-size-fits-all industry. In fact, he believes that if you’re successfully engaging in a behavioral weight-loss program, you should avoid purchasing a wearable device because, in his words, “You probably don’t need it.” “[Wearable devices] might actually give people somewhat of a false sense of security that they don’t pay attention to some of the key behaviors that they otherwise might pay attention to,” Jakicic says. “They’re relying on the device or the technology maybe a little bit too much and that may be why we saw a little bit less weight loss in that group.” ", "child": "287_1\t287_2"}