{"name": "29", "parent": "", "title": "The Best Points, Rebounds, and Assists From Russell Westbrook’s Incredible Triple-Double Season", "sentences": [{"d768": "The Best Points, Rebounds, and Assists From Russell Westbrook’s Incredible Triple-Double Season"}, {"437a": "Only our favorite boards, dimes, and scores"}, {"471d": "Russ 6:38–39"}, {"cac2": "All that Russell “Bestbrook” “NotStressedbrook” “OnAQuestbrook” “WellDressedbrook” Westbrook gives Me will come to Me, and the Triple-Double he gives to Me I will never turn away. For he has come down from Southern California, not to do My own will, but the will of Jerry West (who is tired of Oscar Robertson being the only guy to average a Triple-Double in a season). And this is the will of West’s Spirit who sent Russ, that I shall watch of all those He has given Me, and raise them up at the last game …"}, {"4732": "After logging his 42nd triple-double in Sunday’s 106–105 win over the Nuggets, Russell Westbrook surpassed Oscar Robertson’s record for the most such games in a season. Two days earlier against the Suns, he secured double-digit averages in three major statistical categories for the season, the first since the Big O in 1961–62. Witnessing Russ’s glorious late-game heroics as he carried the backbreaking weight of the Oklahoma City Thunder to a playoff spot was thrilling and now historic, so much so that the highlights demand revisiting."}, {"965e": "To celebrate the historic feat, here are his best 15 points, his nastiest five assists, and his five most impressive rebounds. The end to the 55-year drought was worth the wait."}, {"f078": "Points"}, {"4994": "Three against the Nuggets on April 9 to win the game. The MVP moment of the season, of a lifetime."}, {"59da": "Three against the Magic on March 29 to send the game to overtime.Double-teamed, slightly off-balance, and with seven seconds to go, Russ took this deep shot and Elfrid Payton retreated into adolescence."}, {"bf2c": "Three against the Wizards on November 30 to send the game to overtime.With the shot clock off and down by three, Westbrook dribbled inward, remembered he needed a 3, made Bradley Beal the new star of the Home Alone reboot, retreated, and fired away."}, {"494a": "Two against the Jazz on March 1.Upon hearing the whistle on the drive, he flung it at the hoop to get a shot off and it somehow went in. Getting the and-1 here is as improbable as a guy elevating a supporting cast like OKC’s into a winning team, averaging a triple-double, and people still thinking he may not be the MVP."}, {"6607": "Two against the Warriors on January 18.Simple facts:"}, {"9cfd": "Two against the Rockets on November 16 with five seconds left in the fourth quarter.Westbrook received the inbound in full motion toward the basket, and within a second posterized Clint Capela and won the game."}, {"3dbe": "Assists"}, {"5e20": "To Victor Oladipo against the Raptors on March 16.On first glance, this is just a gorgeous cross-court bounce pass. But look again, and you’ll see the ball nutmeg Cory Joseph on its way to Dipo."}, {"723b": "Two years ago, Dove did a campaign where it asked women what their beauty legacy is. This is Russell Westbrook’s."}, {"d61c": "To Steven Adams against the Suns on December 17.This nasty Shammgod dime was his 22nd assist of the night."}, {"ec51": "To Andre Roberson against the Kings on March 19.Remember when Andre Roberson had Russ’s back against KD when they played Golden State for the first time in Oklahoma? I like to think he had a That’s So Raven–esque vision, knowing this pass would eventually happen."}, {"1f6f": "To Steven Adams against the Clippers on December 31.This one-handed push up top to Adams drew the Kiwi a foul and put OKC up 20."}, {"4eda": "To Steven Adams against the Cavaliers on February 9.A dime that indubitably prompted this."}, {"15e6": "Rebounds"}, {"519d": "Against the Mavericks on January 26.“Russell Westbrook’s rebounds don’t help the team.”"}, {"d184": "Against the Wizards on December 2.“Russell Westbrook’s rebounds don’t help the team.”"}, {"3244": "Against the Knicks on November 30.Just to pause the theme for a moment: Porzingis is A FOOT TALLER."}, {"720c": "Against the Lakers on October 30“Russell Westbrook’s rebounds don’t help the team.”"}, {"2162": "Against the Pelicans on December 21“Russell Westbrook’s rebounds don’t help the team.”"}], "content": "The Best Points, Rebounds, and Assists From Russell Westbrook’s Incredible Triple-Double Season Only our favorite boards, dimes, and scores Russ 6:38–39 All that Russell “Bestbrook” “NotStressedbrook” “OnAQuestbrook” “WellDressedbrook” Westbrook gives Me will come to Me, and the Triple-Double he gives to Me I will never turn away. For he has come down from Southern California, not to do My own will, but the will of Jerry West (who is tired of Oscar Robertson being the only guy to average a Triple-Double in a season). And this is the will of West’s Spirit who sent Russ, that I shall watch of all those He has given Me, and raise them up at the last game … After logging his 42nd triple-double in Sunday’s 106–105 win over the Nuggets, Russell Westbrook surpassed Oscar Robertson’s record for the most such games in a season. Two days earlier against the Suns, he secured double-digit averages in three major statistical categories for the season, the first since the Big O in 1961–62. Witnessing Russ’s glorious late-game heroics as he carried the backbreaking weight of the Oklahoma City Thunder to a playoff spot was thrilling and now historic, so much so that the highlights demand revisiting. To celebrate the historic feat, here are his best 15 points, his nastiest five assists, and his five most impressive rebounds. The end to the 55-year drought was worth the wait. Points Three against the Nuggets on April 9 to win the game. The MVP moment of the season, of a lifetime. Three against the Magic on March 29 to send the game to overtime.Double-teamed, slightly off-balance, and with seven seconds to go, Russ took this deep shot and Elfrid Payton retreated into adolescence. Three against the Wizards on November 30 to send the game to overtime.With the shot clock off and down by three, Westbrook dribbled inward, remembered he needed a 3, made Bradley Beal the new star of the Home Alone reboot, retreated, and fired away. Two against the Jazz on March 1.Upon hearing the whistle on the drive, he flung it at the hoop to get a shot off and it somehow went in. Getting the and-1 here is as improbable as a guy elevating a supporting cast like OKC’s into a winning team, averaging a triple-double, and people still thinking he may not be the MVP. Two against the Warriors on January 18.Simple facts: Two against the Rockets on November 16 with five seconds left in the fourth quarter.Westbrook received the inbound in full motion toward the basket, and within a second posterized Clint Capela and won the game. Assists To Victor Oladipo against the Raptors on March 16.On first glance, this is just a gorgeous cross-court bounce pass. But look again, and you’ll see the ball nutmeg Cory Joseph on its way to Dipo. Two years ago, Dove did a campaign where it asked women what their beauty legacy is. This is Russell Westbrook’s. To Steven Adams against the Suns on December 17.This nasty Shammgod dime was his 22nd assist of the night. To Andre Roberson against the Kings on March 19.Remember when Andre Roberson had Russ’s back against KD when they played Golden State for the first time in Oklahoma? I like to think he had a That’s So Raven–esque vision, knowing this pass would eventually happen. To Steven Adams against the Clippers on December 31.This one-handed push up top to Adams drew the Kiwi a foul and put OKC up 20. To Steven Adams against the Cavaliers on February 9.A dime that indubitably prompted this. Rebounds Against the Mavericks on January 26.“Russell Westbrook’s rebounds don’t help the team.” Against the Wizards on December 2.“Russell Westbrook’s rebounds don’t help the team.” Against the Knicks on November 30.Just to pause the theme for a moment: Porzingis is A FOOT TALLER. Against the Lakers on October 30“Russell Westbrook’s rebounds don’t help the team.” Against the Pelicans on December 21“Russell Westbrook’s rebounds don’t help the team.” ", "child": "29_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_1029_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_10"}