{"name": "3", "parent": "", "title": "From the Internet Archives: The ancient design of your favorite websites", "sentences": [{"ab15": "From the Internet Archives: The ancient design of your favorite websites"}, {"1e6a": "The A — Z of famous landing pages from a time long, long ago."}, {"b223": "Some time ago I was working on a lecture about the importance of unique value proposition in UX design process. One of the hint I wanted to give my students was that in many cases older (or first) versions of big brands’ UVPs can be better benchmarks than those that these companies are using today."}, {"8e8e": "In many cases: the older the brand, the more its UVP is being replaced by a slogan."}, {"3661": "And since I wanted to illustrate this process with an example, I thought — hm, let’s see what the first MailChimp’s UVP was, and if it changed much. So I went to Web Archive to look for some old version of MailChimp website and a few minutes later… I got sucked into this research completely."}, {"10bb": "Not to mention the feeling of nostalgia."}, {"b24d": "I jotted down a short list of websites that are popular today and then started taking screenshots of their predecessors. For some reason these companies succeeded, and perhaps it was their well-built websites what helped them with it. I believe there’s a lot that business owners, product-, UX-, visual designers, copywriters etc. could learn from studying the past."}, {"4f85": "My short list soon became the list so I thought I could share the results of this research. Hence this post."}, {"42a2": "So here they are, ordered A — Z. Sit back, relax, turn your clock back and enjoy."}, {"6330": "Adobe"}, {"6b53": "Amazon"}, {"ad25": "Apple"}, {"a9d9": "Basecamp"}, {"006f": "Buffer"}, {"74f8": "Campaign Monitor"}, {"047a": "Chrome"}, {"8c8f": "Dribbble"}, {"1619": "Dropbox"}, {"acae": "eBay"}, {"d16e": "Etsy"}, {"7bab": "Evernote"}, {"2a06": "Facebook (a.k.a. Thefacebook)"}, {"6fba": "Firefox"}, {"2124": "GitHub"}, {"959a": "GoDaddy"}, {"612f": "Google"}, {"b0ba": "HubSpot"}, {"77b6": "IDEO"}, {"096a": "IMDb"}, {"c638": "Instagram"}, {"0ca6": "Intercom"}, {"56d0": "Jira"}, {"9821": "jQuery"}, {"7fca": "Kickstarter"}, {"0ab5": "Kissmetrics"}, {"6cc3": "LiveChat"}, {"9126": "MailChimp"}, {"cf97": "Mashable"}, {"038b": "Medium"}, {"3612": "Microsoft"}, {"ba93": "NASA"}, {"8257": "Opera"}, {"fcc8": "PayPal"}, {"f179": "Pinterest"}, {"bcf0": "Product Hunt"}, {"39c8": "Reddit"}, {"62cf": "Samsung"}, {"9787": "Shopify"}, {"7c4b": "Slack"}, {"6f52": "Snapchat"}, {"ab9f": "Spotify"}, {"88d2": "TNW"}, {"f96e": "Tumblr"}, {"88fc": "Twitter"}, {"1e4b": "Uber"}, {"0842": "Vimeo"}, {"e1ac": "Wikipedia"}, {"bd2e": "Xero"}, {"7e85": "Xing"}, {"5d8f": "YouTube"}, {"a589": "Zapier"}, {"55a5": "Zendesk"}, {"fa78": "That’s it. A lot has changed, huh?"}, {"97d6": "I’ll probably return to the initial subject of UVPs in the near future, so if you are interested ☞ follow me. Also, if you enjoyed this post ☞ ❤︎. Cheers!"}, {"b972": "If there’s a website you think I should also add to this list, feel free to leave a comment!"}, {"f212": "Thank you, Alina, for helping me with putting it all together!"}], "content": "From the Internet Archives: The ancient design of your favorite websites The A — Z of famous landing pages from a time long, long ago. Some time ago I was working on a lecture about the importance of unique value proposition in UX design process. One of the hint I wanted to give my students was that in many cases older (or first) versions of big brands’ UVPs can be better benchmarks than those that these companies are using today. In many cases: the older the brand, the more its UVP is being replaced by a slogan. And since I wanted to illustrate this process with an example, I thought — hm, let’s see what the first MailChimp’s UVP was, and if it changed much. So I went to Web Archive to look for some old version of MailChimp website and a few minutes later… I got sucked into this research completely. Not to mention the feeling of nostalgia. I jotted down a short list of websites that are popular today and then started taking screenshots of their predecessors. For some reason these companies succeeded, and perhaps it was their well-built websites what helped them with it. I believe there’s a lot that business owners, product-, UX-, visual designers, copywriters etc. could learn from studying the past. My short list soon became the list so I thought I could share the results of this research. Hence this post. So here they are, ordered A — Z. Sit back, relax, turn your clock back and enjoy. Adobe Amazon Apple Basecamp Buffer Campaign Monitor Chrome Dribbble Dropbox eBay Etsy Evernote Facebook (a.k.a. Thefacebook) Firefox GitHub GoDaddy Google HubSpot IDEO IMDb Instagram Intercom Jira jQuery Kickstarter Kissmetrics LiveChat MailChimp Mashable Medium Microsoft NASA Opera PayPal Pinterest Product Hunt Reddit Samsung Shopify Slack Snapchat Spotify TNW Tumblr Twitter Uber Vimeo Wikipedia Xero Xing YouTube Zapier Zendesk That’s it. A lot has changed, huh? I’ll probably return to the initial subject of UVPs in the near future, so if you are interested ☞ follow me. Also, if you enjoyed this post ☞ ❤︎. Cheers! If there’s a website you think I should also add to this list, feel free to leave a comment! Thank you, Alina, for helping me with putting it all together! ", "child": "3_1\t3_2\t3_3\t3_4\t3_5\t3_6\t3_7\t3_8\t3_93_1\t3_2\t3_3\t3_4\t3_5\t3_6\t3_7\t3_8\t3_9"}