{"name": "307", "parent": "", "title": "FBI’s Comey Uses Alarming “Lucifer Proxy” In Referring To Trump", "sentences": [{"4f59": "Truth In Satire"}, {"5c56": "FBI’s Comey Uses Alarming “Lucifer Proxy” In Referring To Trump"}, {"9590": "(There have been only two other Lucifer Proxies in history)"}, {"c8c0": "A team of psychologists hired by the Federal Bureau of Investigation has concluded that Donald Trump possesses the dreaded psychological profile of a “Lucifer Proxy” — a character type so feared in criminal circles that the term is rarely spoken out loud."}, {"df85": "An FBI rendering of how Donald Trump might look when he takes his suit off at night after a long day of being a Lucifer Proxy. (Credit: Carbonated.TV)"}, {"3432": "“We had four forensic psychologists review the data because the conclusions were so disturbing,” said FBI Director James Comey. “But we can’t avoid the truth any longer — President Trump has the five high-risk personality traits that make him so unimaginably dangerous. Our profiling experts say that there have been only two other Lucifer Proxies in the history of mankind. We’re talking about a magnitude of evil here that is barely measurable.”"}, {"878b": "Director Comey made public an “analytical brief” issued by the FBI’s psychological team that describes the five traits:"}, {"4ece": "A CCTV photo taken in the White House residence after President Trump had removed his make-up that reduces his red coloring to a more presentable orange. (Credit: Chicago Now)"}, {"80c5": "4. Hellfire Hue Syndrome: Every day unsuspecting comics make jokes about the orange color of Trump’s skin, wondering why he would add make-up or tanning creams to turn his face that strange color. But these naive sloths know nothing. Donald Trump is not adding anything to make his face appear orange — he is subtracting color! He is actually using creams, powders, and other forms of artificial cover-up to mute the shade of his skin, which is actually a bright, fiery red (see above photo). If he did not go to great lengths to soften his naturally singed coloring, the world would have found him out years ago."}, {"e25c": "Have you ever wondered why Donald Trump is ALWAYS in a suit? This is not a businessman’s savoir faire, it’s the disguise of a long-tailed Lucifer Proxy."}, {"4d5b": "5. Spade-Tail Tailoring: The signature spade tail of every Lucifer Proxy must be concealed for them to do their diabolical work unimpeded. Many choose to tie it down between their legs or wear a type of heavy tail-corset to tame the whipping action of the satanic appendage. But it is conceivable that a present day Lucifer Proxy, walking in the world using the disguise of a businessman, would use finely-tailored suits to “trap” the spade tail inside the well-made fabrics. Many people comment that Donald Trump is always wearing a suit, but few explore exactly why that is. Now we know. (Note: The FBI’s analytical brief mentions that Trump’s sons, Eric and Don Jr., are also rarely seen out of their suits, suggesting that they might be Lucifer Proxy apprentices and should be closely surveilled.)"}, {"9f65": "Since the release of the FBI report on Donald Trump, many are wondering about the identity of the other Lucifer Proxies mentioned — two dark diablos who brought hell to earth in the past."}, {"d66e": "The first, as many people might have guessed, was Adolf Hitler, responsible for the deaths of as many as six million Jews, and another five million gypsies, artists, intellectuals, homosexuals, and other “degenerates” who were killed in Nazi concentration camps. In fact, Hitler had 96% of the personality characteristics associated with the Lucifer Proxy-type."}, {"52c3": "The identity of the other Lucifer Proxy might surprise some people. That man was none other than Frankie O’Brien, a bully and thug who lived in a Northern New Jersey suburb of New York City in the late 1960’s and early 1970’s and who terrorized a number of local school children and his own classmates. O’Brien possessed 97% of the Lucifer Proxy traits (Note: There is no connection between the author of this post, who lived in that same NJ community, and the despicable tormentor Frankie O’Brien — so don’t go snooping around looking for any)."}, {"5239": "Chillingly, the FBI psychologists believe that Donald Trump may have a stunning 100% of the diabolical qualities of a Lucifer Proxy. Which is why Director Comey felt he had to reveal their findings now."}, {"ea9a": "“While I hesitated to make this announcement a day before Easter,” said Director Comey, “we felt the stunning news about the president’s real identity must be shared with the public immediately so the American people can decide what actions to take to limit the destruction of this Lucifer Proxy who rules supreme at the seat of Washington power. Make no mistake about it, a man this evil could end life on the planet without even batting one satanic eyelash.”"}, {"bcd0": "****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment."}, {"25a5": "And click here for my most popular post, or at least one I liked writing a whole lot."}, {"718f": "Thank you."}, {"2fde": "–AI"}], "content": "Truth In Satire FBI’s Comey Uses Alarming “Lucifer Proxy” In Referring To Trump (There have been only two other Lucifer Proxies in history) A team of psychologists hired by the Federal Bureau of Investigation has concluded that Donald Trump possesses the dreaded psychological profile of a “Lucifer Proxy” — a character type so feared in criminal circles that the term is rarely spoken out loud. An FBI rendering of how Donald Trump might look when he takes his suit off at night after a long day of being a Lucifer Proxy. (Credit: Carbonated.TV) “We had four forensic psychologists review the data because the conclusions were so disturbing,” said FBI Director James Comey. “But we can’t avoid the truth any longer — President Trump has the five high-risk personality traits that make him so unimaginably dangerous. Our profiling experts say that there have been only two other Lucifer Proxies in the history of mankind. We’re talking about a magnitude of evil here that is barely measurable.” Director Comey made public an “analytical brief” issued by the FBI’s psychological team that describes the five traits: A CCTV photo taken in the White House residence after President Trump had removed his make-up that reduces his red coloring to a more presentable orange. (Credit: Chicago Now) 4. Hellfire Hue Syndrome: Every day unsuspecting comics make jokes about the orange color of Trump’s skin, wondering why he would add make-up or tanning creams to turn his face that strange color. But these naive sloths know nothing. Donald Trump is not adding anything to make his face appear orange — he is subtracting color! He is actually using creams, powders, and other forms of artificial cover-up to mute the shade of his skin, which is actually a bright, fiery red (see above photo). If he did not go to great lengths to soften his naturally singed coloring, the world would have found him out years ago. Have you ever wondered why Donald Trump is ALWAYS in a suit? This is not a businessman’s savoir faire, it’s the disguise of a long-tailed Lucifer Proxy. 5. Spade-Tail Tailoring: The signature spade tail of every Lucifer Proxy must be concealed for them to do their diabolical work unimpeded. Many choose to tie it down between their legs or wear a type of heavy tail-corset to tame the whipping action of the satanic appendage. But it is conceivable that a present day Lucifer Proxy, walking in the world using the disguise of a businessman, would use finely-tailored suits to “trap” the spade tail inside the well-made fabrics. Many people comment that Donald Trump is always wearing a suit, but few explore exactly why that is. Now we know. (Note: The FBI’s analytical brief mentions that Trump’s sons, Eric and Don Jr., are also rarely seen out of their suits, suggesting that they might be Lucifer Proxy apprentices and should be closely surveilled.) Since the release of the FBI report on Donald Trump, many are wondering about the identity of the other Lucifer Proxies mentioned — two dark diablos who brought hell to earth in the past. The first, as many people might have guessed, was Adolf Hitler, responsible for the deaths of as many as six million Jews, and another five million gypsies, artists, intellectuals, homosexuals, and other “degenerates” who were killed in Nazi concentration camps. In fact, Hitler had 96% of the personality characteristics associated with the Lucifer Proxy-type. The identity of the other Lucifer Proxy might surprise some people. That man was none other than Frankie O’Brien, a bully and thug who lived in a Northern New Jersey suburb of New York City in the late 1960’s and early 1970’s and who terrorized a number of local school children and his own classmates. O’Brien possessed 97% of the Lucifer Proxy traits (Note: There is no connection between the author of this post, who lived in that same NJ community, and the despicable tormentor Frankie O’Brien — so don’t go snooping around looking for any). Chillingly, the FBI psychologists believe that Donald Trump may have a stunning 100% of the diabolical qualities of a Lucifer Proxy. Which is why Director Comey felt he had to reveal their findings now. “While I hesitated to make this announcement a day before Easter,” said Director Comey, “we felt the stunning news about the president’s real identity must be shared with the public immediately so the American people can decide what actions to take to limit the destruction of this Lucifer Proxy who rules supreme at the seat of Washington power. Make no mistake about it, a man this evil could end life on the planet without even batting one satanic eyelash.” **** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post, or at least one I liked writing a whole lot. Thank you. –AI ", "child": "307_1\t307_2\t307_3\t307_4\t307_5\t307_6\t307_7\t307_8\t307_9\t307_10\t307_11\t307_12\t307_13\t307_14\t307_15\t307_16\t307_17\t307_18\t307_19\t307_20\t307_21\t307_22\t307_23\t307_24"}