{"name": "314", "parent": "", "title": "Confession Time: I’m Really Not Into Smells Right Now, You Guys", "sentences": [{"118f": "Confession Time: I’m Really Not Into Smells Right Now, You Guys"}, {"6b56": "The thing about pregnancy is that you can smell everything — and it’s all bad."}, {"bbb8": "Opening the freezer be like “Oh hey remember that thing that you put in here 8 months ago? It’s not here anymore, but the smell is.”"}, {"fb1a": "Every morning when I come down the stairs I can instantly smell the dirt on the floor, the dog hair on the rug, the coffee that we haven’t made in 3 weeks (my husband gave up coffee in solidarity), and the everything bagels that are still in the plastic bag."}, {"7d8f": "I can smell the water in the dog dish."}, {"544a": "I can smell the cheerio that fell into the heat vent."}, {"bc09": "I can smell the fork in the dishwasher that didn’t quite get clean."}, {"5631": "I can smell the sadness of cloth furniture that needs so much more than spot-cleaning, but can’t be put in the washer."}, {"1e8b": "I can smell the despair in the head of iceberg lettuce sitting in the back of the crisper drawer in the refrigerator, knowing that I’m never going to finish eating it."}, {"abd5": "I can smell the bad memories of the people who lived here before we did. I can smell their tears … and they stink."}, {"4173": "I think I’d like to go to the desert. I bet it smells like absolutely NOTHING in the desert. That would be AMAZING."}], "content": "Confession Time: I’m Really Not Into Smells Right Now, You Guys The thing about pregnancy is that you can smell everything — and it’s all bad. Opening the freezer be like “Oh hey remember that thing that you put in here 8 months ago? It’s not here anymore, but the smell is.” Every morning when I come down the stairs I can instantly smell the dirt on the floor, the dog hair on the rug, the coffee that we haven’t made in 3 weeks (my husband gave up coffee in solidarity), and the everything bagels that are still in the plastic bag. I can smell the water in the dog dish. I can smell the cheerio that fell into the heat vent. I can smell the fork in the dishwasher that didn’t quite get clean. I can smell the sadness of cloth furniture that needs so much more than spot-cleaning, but can’t be put in the washer. I can smell the despair in the head of iceberg lettuce sitting in the back of the crisper drawer in the refrigerator, knowing that I’m never going to finish eating it. I can smell the bad memories of the people who lived here before we did. I can smell their tears … and they stink. I think I’d like to go to the desert. I bet it smells like absolutely NOTHING in the desert. That would be AMAZING. ", "child": "314_1\t314_2\t314_3\t314_4\t314_5\t314_6\t314_7\t314_8\t314_9\t314_10"}