{"name": "315", "parent": "", "title": "When your Head is louder than your Heart.", "sentences": [{"8ac0": "When your Head is louder than your Heart."}, {"9079": "source"}, {"be26": "I thought long and hard about the words I wanted to write. The sentences congealed — guts spilling, shoved haphazardly into sausage skins — trying to emote in stilted stanzas. The half-formed thoughts, the bitter emotions, the hollow emptiness that filled every beat, every pause, every"}, {"a17c": "break."}, {"b61a": "I tamp the wordless fears down, shoved them mercilessly back into boxes marked “do not touch” — they overflowed. Spilling out the sides with disgust, with self-pity, with fear. Self-loathing topped with shame. So much shame."}, {"ce30": "I pushed harder. Taped the sides up, but the stray feelings niggled. Wriggling into the forefront of my consciousness: him, her, she, they, we, I… me. A whirlpool of “not OK”."}, {"d021": "The only actualized thought: I can’t do this anymore."}, {"ec59": "I run. It’s what I always do. I run from the hard truths. I shut down. I box myself in. I build up walls and I shutter the windows and I block the doors. I hide. I run. I go away."}, {"3b58": "I disappear."}, {"b126": "I disappear because it’s easier than facing the problems head on."}, {"c87c": "I can’t. I’m not equipped to deal with the thoughts, the emotions, the entire collapse of myself."}, {"3403": "Knowing when the collapse is coming isn’t any better than a sudden earthquake. You can be prepared for it, but preparation will only take you so far."}, {"7dc4": "What if you’re trapped under the rubble, unable to reach your safety kit?"}, {"9415": "What do you do then?"}, {"bffd": "I was taught to be strong. To keep everything in. That the world doesn’t owe you anything. That you have to fight, you have to be hungry, you have to want more than you think you do."}, {"34b6": "You have to be the strongest. Don’t let anyone in because they will only leave you. Everything is mind over matter, the stronger your conviction, the less your fear of failure. I was taught that failure was an option, and you get to choose."}, {"0c35": "You always have a choice."}, {"c94f": "I spent my adolescence warring with myself. Against the beliefs ingrained within the structural walls of my psyche. Against who I actually was — the instinctual need to flee when things got real, battling intimacy."}, {"35bc": "Somewhere along the way, I lost sight of who I was and became the person I am. I’m not ashamed of myself. I am ashamed of my reactions."}, {"6b23": "The instinctual movement of feet that fuck up every good thing, every bad thing, and compounds the fuckery more."}, {"eb7e": "I drank too much."}, {"5433": "I smoke too much."}, {"0748": "I run too much."}, {"a7dd": "I linger too long."}, {"3cb2": "I linger too long in the places that are safe — because they are no longer real. They are no longer there. They are no longer an option."}, {"f244": "This is why the past calls to me. I linger in the nostalgia, in my head, in the imagined, instead of the painful reality. It is painful because I am unwilling to admit. To see."}, {"76af": "This is why my boxes are overflowing."}, {"7c92": "I thought long and hard about the words I needed to write, but couldn’t. My voice isn’t stuck in my throat, it is “stuck” within my head. The half-formed epiphanies, lingering just out of grasp — unable to coalesce because I am still running. I’m always running."}, {"d531": "I say I want to stop, but honestly? I don’t."}, {"8b15": "Now what?"}], "content": "When your Head is louder than your Heart. source I thought long and hard about the words I wanted to write. The sentences congealed — guts spilling, shoved haphazardly into sausage skins — trying to emote in stilted stanzas. The half-formed thoughts, the bitter emotions, the hollow emptiness that filled every beat, every pause, every break. I tamp the wordless fears down, shoved them mercilessly back into boxes marked “do not touch” — they overflowed. Spilling out the sides with disgust, with self-pity, with fear. Self-loathing topped with shame. So much shame. I pushed harder. Taped the sides up, but the stray feelings niggled. Wriggling into the forefront of my consciousness: him, her, she, they, we, I… me. A whirlpool of “not OK”. The only actualized thought: I can’t do this anymore. I run. It’s what I always do. I run from the hard truths. I shut down. I box myself in. I build up walls and I shutter the windows and I block the doors. I hide. I run. I go away. I disappear. I disappear because it’s easier than facing the problems head on. I can’t. I’m not equipped to deal with the thoughts, the emotions, the entire collapse of myself. Knowing when the collapse is coming isn’t any better than a sudden earthquake. You can be prepared for it, but preparation will only take you so far. What if you’re trapped under the rubble, unable to reach your safety kit? What do you do then? I was taught to be strong. To keep everything in. That the world doesn’t owe you anything. That you have to fight, you have to be hungry, you have to want more than you think you do. You have to be the strongest. Don’t let anyone in because they will only leave you. Everything is mind over matter, the stronger your conviction, the less your fear of failure. I was taught that failure was an option, and you get to choose. You always have a choice. I spent my adolescence warring with myself. Against the beliefs ingrained within the structural walls of my psyche. Against who I actually was — the instinctual need to flee when things got real, battling intimacy. Somewhere along the way, I lost sight of who I was and became the person I am. I’m not ashamed of myself. I am ashamed of my reactions. The instinctual movement of feet that fuck up every good thing, every bad thing, and compounds the fuckery more. I drank too much. I smoke too much. I run too much. I linger too long. I linger too long in the places that are safe — because they are no longer real. They are no longer there. They are no longer an option. This is why the past calls to me. I linger in the nostalgia, in my head, in the imagined, instead of the painful reality. It is painful because I am unwilling to admit. To see. This is why my boxes are overflowing. I thought long and hard about the words I needed to write, but couldn’t. My voice isn’t stuck in my throat, it is “stuck” within my head. The half-formed epiphanies, lingering just out of grasp — unable to coalesce because I am still running. I’m always running. I say I want to stop, but honestly? I don’t. Now what? ", "child": "315_1\t315_2315_1\t315_2315_1\t315_2315_1\t315_2315_1\t315_2315_1\t315_2315_1\t315_2"}