{"name": "328", "parent": "", "title": "The Future of Flight in the Age of Aviation", "sentences": [{"0f93": "The Future of Flight in the Age of Aviation"}, {"6b0f": "In the future, revolutions in aviation technology will allow people to traverse the airways more and more, with strange craft constantly zooming through the skyline. We can expect to see the return of zeppelins as cargo ships. Automated solar powered drones will deliver broadband across the globe to supplement satellite transmissions. Massive airbuses will carry a thousand passengers, or more, in every flight. Pilots will eventually all have AI copilots. Spaceflights will become more and more common, leading to interplanetary tourism, and eventually even interstellar travel. Our world will undoubtedly take to the skies more and more in the decades and centuries to come."}, {"ee6c": "As engineers unlock the secrets of insect wings and other things, society gains a better understanding of flight. By incorporating this knowledge into robots, like an MAV, it will become possible to build autonomous flying machines capable of the most extraordinary aerial acrobatics. Insects generate highly efficient vertical lift by generating a special down-stroke vortex. To do this, they have to change the direction of their wings along with the shape of them, as they fly, controlling a few different kinds of movement all at once. So, in the meantime, intelligent drones will be powered by counter-rotating blades, sort of like giant mechanical bugs whizzing through the air delivering goods. They will fly throughout the urban jungle, constantly floating past, and even in through everyone’s windows."}, {"bb28": "It will also become increasingly more common to see pilotless planes being flown in conjunction with driverless cars, as the automated vehicle industries boom. Although, rather than being like the conventional piston-powered planes that require runways, these will be far more practical and energy efficient than something like a personal Cessna. In fact, most of the robotic aircraft of the future will make use of vertical takeoff and landing procedures. These artificially intelligent electric airships will be battery-powered, initially running on a lithium-based product."}, {"dfff": "Due to the complex nature of air traffic control, this will all need to be highly regulated and carefully monitored, by both humans and computers alike. Natural and artificial ground-based and space-based ATC agents and programs will direct aircraft through increasingly controlled airspace, providing advisory services to organize and expedite the flow of traffic, offering support to pilots, and of course preventing collisions. Air traffic control will also play a crucial security role in the military forces of the UN."}, {"9764": "In the military application of flight, fighter jets will become so maneuverable that they can no longer be manned. As creatures with sensitive bodies, pilots tend to blackout at a g-force of around 5 and become completely useless above 10. This is why automated drones will eventually completely replace the less effective vehicles currently in use. It is now possible for a twenty ton machine to instantly change direction in midair, thanks to thrust vectoring and small nose wings and other aeronautic innovations. The gravity defying close combat maneuvers of modern war machines are quickly surpassing the capabilities of personnel. Pilots will become useless in close combat very soon."}, {"34b0": "In 1903 it was a miracle to fly at a speed of just 10 miles an hour. However, by 2003 Concorde could travel faster than 1,350 mph, and planes will be able to go as fast as 11,510 mph in the year 2103. Someday, hypersonic jets will carry people over the Atlantic in less than an hour. Of course, along with requiring shockwave sound-dampening technology, these planes will also need to be built out of extremely heat-resistant materials to cope with the insanely high temperatures this vehicle would reach in the process of flight."}, {"7ca2": "Long after people use synthetic bio-fuels and hydrogen fuel cells to power aircraft, humanity will discover something revolutionary. We will inevitably develop the ability to generate unprecedented thrust with a sufficiently advanced propulsion system. At some point in the far flung future, traveling through the hyperspace bulk of the omniverse, or using some kind of warp drive to get around will change everything forever. For now, visionary groups like SpaceX and NASA are working on rockets to get us back and forth from the different worlds, like Earth and Mars. Someday though, spaceships will be able to take people anywhere they want to go, once things like distance and speed become concerns of the past. We just need a paradigm shift to lead to the right technological breakthroughs that will get us to where we need to go…"}, {"aea4": "Please support the Futurist Files on Patreon. Thank you."}], "content": "The Future of Flight in the Age of Aviation In the future, revolutions in aviation technology will allow people to traverse the airways more and more, with strange craft constantly zooming through the skyline. We can expect to see the return of zeppelins as cargo ships. Automated solar powered drones will deliver broadband across the globe to supplement satellite transmissions. Massive airbuses will carry a thousand passengers, or more, in every flight. Pilots will eventually all have AI copilots. Spaceflights will become more and more common, leading to interplanetary tourism, and eventually even interstellar travel. Our world will undoubtedly take to the skies more and more in the decades and centuries to come. As engineers unlock the secrets of insect wings and other things, society gains a better understanding of flight. By incorporating this knowledge into robots, like an MAV, it will become possible to build autonomous flying machines capable of the most extraordinary aerial acrobatics. Insects generate highly efficient vertical lift by generating a special down-stroke vortex. To do this, they have to change the direction of their wings along with the shape of them, as they fly, controlling a few different kinds of movement all at once. So, in the meantime, intelligent drones will be powered by counter-rotating blades, sort of like giant mechanical bugs whizzing through the air delivering goods. They will fly throughout the urban jungle, constantly floating past, and even in through everyone’s windows. It will also become increasingly more common to see pilotless planes being flown in conjunction with driverless cars, as the automated vehicle industries boom. Although, rather than being like the conventional piston-powered planes that require runways, these will be far more practical and energy efficient than something like a personal Cessna. In fact, most of the robotic aircraft of the future will make use of vertical takeoff and landing procedures. These artificially intelligent electric airships will be battery-powered, initially running on a lithium-based product. Due to the complex nature of air traffic control, this will all need to be highly regulated and carefully monitored, by both humans and computers alike. Natural and artificial ground-based and space-based ATC agents and programs will direct aircraft through increasingly controlled airspace, providing advisory services to organize and expedite the flow of traffic, offering support to pilots, and of course preventing collisions. Air traffic control will also play a crucial security role in the military forces of the UN. In the military application of flight, fighter jets will become so maneuverable that they can no longer be manned. As creatures with sensitive bodies, pilots tend to blackout at a g-force of around 5 and become completely useless above 10. This is why automated drones will eventually completely replace the less effective vehicles currently in use. It is now possible for a twenty ton machine to instantly change direction in midair, thanks to thrust vectoring and small nose wings and other aeronautic innovations. The gravity defying close combat maneuvers of modern war machines are quickly surpassing the capabilities of personnel. Pilots will become useless in close combat very soon. In 1903 it was a miracle to fly at a speed of just 10 miles an hour. However, by 2003 Concorde could travel faster than 1,350 mph, and planes will be able to go as fast as 11,510 mph in the year 2103. Someday, hypersonic jets will carry people over the Atlantic in less than an hour. Of course, along with requiring shockwave sound-dampening technology, these planes will also need to be built out of extremely heat-resistant materials to cope with the insanely high temperatures this vehicle would reach in the process of flight. Long after people use synthetic bio-fuels and hydrogen fuel cells to power aircraft, humanity will discover something revolutionary. We will inevitably develop the ability to generate unprecedented thrust with a sufficiently advanced propulsion system. At some point in the far flung future, traveling through the hyperspace bulk of the omniverse, or using some kind of warp drive to get around will change everything forever. For now, visionary groups like SpaceX and NASA are working on rockets to get us back and forth from the different worlds, like Earth and Mars. Someday though, spaceships will be able to take people anywhere they want to go, once things like distance and speed become concerns of the past. We just need a paradigm shift to lead to the right technological breakthroughs that will get us to where we need to go… Please support the Futurist Files on Patreon. Thank you. ", "child": "328_1\t328_2328_1\t328_2"}