{"name": "33", "parent": "", "title": "A Rational Case for an Irrational MVP", "sentences": [{"ae3a": "A Rational Case for an Irrational MVP"}, {"a5c6": "Russell Westbrook has used the end of the season to make the strongest case possible that he is the NBA’s Most Valuable Player"}, {"5aa4": "Welcome to the waning days of the NBA season. It’s time to tether yourself to the playoff teams, and relish these last few moments of almost completely meaningless basketball. Make yourself care about the race for the eighth seed. Do whatever you need to do to cope, but above all, familiarize yourself with the image below, because it’s about to come true."}, {"0d29": "Russell Westbrook is going to win MVP. There is little doubt in my mind about this. It’s the end of the debate that has carried us through these last few weeks of the regular season, and it is being etched in stone, if not in hardware."}, {"a271": "This is not a coronation, but rather a simple statement rooted in fact. It is a testament to the effect of recency bias that Westbrook has capitalized on, and his ability to turn triple-doubles into an action as facile as pushing a Staples Easy Button."}, {"8fb6": "We can malign the triple-double as a useless barometer — an accolade devoid of efficiency — but we can’t simply ignore that Westbrook is averaging a league-high 31.8 points while also posting 10.7 rebounds and 10.4 assists per game. Those numbers are great no matter how you combine them."}, {"46cf": "I abide by the accuracy of analytics as much as the next guy, and trust me, I’ve tried to make cases — both in my mind and verbally — for why James Harden, LeBron James, or even Kawhi Leonard should win MVP. They each have impressive résumés, but Westbrook is making those arguments irrelevant by finishing his season with a climax while the others plateau."}, {"135c": "The Thunder have won nine of their past 13 games, solidifying their place as the Western Conference’s sixth seed. In those 13 games, Westbrook, of course, averaged a triple-double, posted a triple-double in 10 of those 13 games, and ran rampant with a streak of seven straight triple-doubles — tied for the most in a given stretch this season."}, {"d103": "On Wednesday night, he had 45 points, nine rebounds, and 10 assists, rescuing the Thunder from a loss to the Grizzlies by shooting an — gasp — efficient 14-of-25 from the field and 8-of-13 from 3, including two daggers in the final minutes to seal the victory."}, {"5095": "If we weren’t impressed by the numbers before, Westbrook has essentially gorged us on his feats until we had no choice but to bow down. It’s about time we all make like Jason Terry and relent."}, {"4d40": "Westbrook’s case has been fueled by the way his competitors have finished this season. In his previous six games prior to Wednesday night, Westbrook had scored 219 points. He achieved a triple-double against the Bucks in 27 minutes, the least amount of playing time he’s needed to reach the threshold this season."}, {"e1db": "During that same span, Harden hasn’t declined exactly (he averaged 30–8–10 in March), but he also hasn’t had the types of peaks that made him the MVP front-runner for much of the season. On Wednesday night, Harden posted 31 points with ease, and the Rockets handled the Nuggets. But as Westbrook exploded in Memphis, populating the box score and Twitter timelines, Harden’s line became just “another one” among the nightly pile. In a close race, the aesthetics matter, too."}, {"1942": "Recently, Harden has been plagued by a wrist injury and the flu, the latter of which forced him to sit out last Friday’s game against the Suns. He’s also being held back by something Russ refuses to think about: the playoffs."}, {"3350": "As Daryl Morey told Vice Sports, the Rockets, Warriors, and Spurs have the best “indicators” to win a title this year. He’s not wrong. Mike D’Antoni’s squad possesses the second-best offense in the league, while boasting a defense that’s not that great, but five spots better than it was last season. For those and many other reasons, the Rockets are locked into the 3-seed, and there is no reason to play or push Harden the rest of the way. Harden may deserve the award as much as Westbrook, but he’s got a run at the championship to think about."}, {"99ae": "Oklahoma City just wants to play spoiler. There’s no real path for the Thunder to win a title. The regular season is their be-all and end-all. Westbrook’s season is their be-all and end-all. He will play Game 82 with the same relentlessness he played Game 1. Westbrook doesn’t look to the horizon or to the future, he has eyes only for the ball and the basket that exist within the game he is playing."}, {"98b8": "Advantage, Russ."}, {"af63": "What about the other guys?"}, {"2a48": "The Cavs defeated the Celtics soundly on Wednesday, but there’s no denying that their defense remains abhorrent, troublesome, damning — take your pick. That’s been the talking point about Cleveland heading into the postseason. Not even LeBron can overcome that narrative this late in the day."}, {"fc7a": "Kawhi, on the other hand, struggles with what Westbrook has an abundance of: highlights and signature moments that push his case forward on top of the foundation that is his great numbers. At least for the most part."}, {"b4ea": "Kawhi scored 32 points on the Grizzlies in an overtime game Tuesday, but he hasn’t been quite the same since he suffered a concussion in early March. And on Wednesday night, he scored only 11 in a shocking loss to the tanking Lakers."}, {"ea73": "In the past two seasons, Stephen Curry has made us — forced us to, even — recognize and appreciate efficiency. LeBron has been doing that his whole career. Kawhi is PER in the flesh. But this year, Westbrook is making history while making us believe in the eye test once again."}, {"f614": "Playing a sport that prides itself on the past, defines itself by its history, and even has old-timers still decrying today’s game in comparison to their tougher times, Westbrook is now on the brink of toppling one of the game’s giants, on the verge of breaking one of the records we all thought couldn’t be broken."}, {"6bc4": "When you think of it like that, “soon” is a lot closer than you think."}], "content": "A Rational Case for an Irrational MVP Russell Westbrook has used the end of the season to make the strongest case possible that he is the NBA’s Most Valuable Player Welcome to the waning days of the NBA season. It’s time to tether yourself to the playoff teams, and relish these last few moments of almost completely meaningless basketball. Make yourself care about the race for the eighth seed. Do whatever you need to do to cope, but above all, familiarize yourself with the image below, because it’s about to come true. Russell Westbrook is going to win MVP. There is little doubt in my mind about this. It’s the end of the debate that has carried us through these last few weeks of the regular season, and it is being etched in stone, if not in hardware. This is not a coronation, but rather a simple statement rooted in fact. It is a testament to the effect of recency bias that Westbrook has capitalized on, and his ability to turn triple-doubles into an action as facile as pushing a Staples Easy Button. We can malign the triple-double as a useless barometer — an accolade devoid of efficiency — but we can’t simply ignore that Westbrook is averaging a league-high 31.8 points while also posting 10.7 rebounds and 10.4 assists per game. Those numbers are great no matter how you combine them. I abide by the accuracy of analytics as much as the next guy, and trust me, I’ve tried to make cases — both in my mind and verbally — for why James Harden, LeBron James, or even Kawhi Leonard should win MVP. They each have impressive résumés, but Westbrook is making those arguments irrelevant by finishing his season with a climax while the others plateau. The Thunder have won nine of their past 13 games, solidifying their place as the Western Conference’s sixth seed. In those 13 games, Westbrook, of course, averaged a triple-double, posted a triple-double in 10 of those 13 games, and ran rampant with a streak of seven straight triple-doubles — tied for the most in a given stretch this season. On Wednesday night, he had 45 points, nine rebounds, and 10 assists, rescuing the Thunder from a loss to the Grizzlies by shooting an — gasp — efficient 14-of-25 from the field and 8-of-13 from 3, including two daggers in the final minutes to seal the victory. If we weren’t impressed by the numbers before, Westbrook has essentially gorged us on his feats until we had no choice but to bow down. It’s about time we all make like Jason Terry and relent. Westbrook’s case has been fueled by the way his competitors have finished this season. In his previous six games prior to Wednesday night, Westbrook had scored 219 points. He achieved a triple-double against the Bucks in 27 minutes, the least amount of playing time he’s needed to reach the threshold this season. During that same span, Harden hasn’t declined exactly (he averaged 30–8–10 in March), but he also hasn’t had the types of peaks that made him the MVP front-runner for much of the season. On Wednesday night, Harden posted 31 points with ease, and the Rockets handled the Nuggets. But as Westbrook exploded in Memphis, populating the box score and Twitter timelines, Harden’s line became just “another one” among the nightly pile. In a close race, the aesthetics matter, too. Recently, Harden has been plagued by a wrist injury and the flu, the latter of which forced him to sit out last Friday’s game against the Suns. He’s also being held back by something Russ refuses to think about: the playoffs. As Daryl Morey told Vice Sports, the Rockets, Warriors, and Spurs have the best “indicators” to win a title this year. He’s not wrong. Mike D’Antoni’s squad possesses the second-best offense in the league, while boasting a defense that’s not that great, but five spots better than it was last season. For those and many other reasons, the Rockets are locked into the 3-seed, and there is no reason to play or push Harden the rest of the way. Harden may deserve the award as much as Westbrook, but he’s got a run at the championship to think about. Oklahoma City just wants to play spoiler. There’s no real path for the Thunder to win a title. The regular season is their be-all and end-all. Westbrook’s season is their be-all and end-all. He will play Game 82 with the same relentlessness he played Game 1. Westbrook doesn’t look to the horizon or to the future, he has eyes only for the ball and the basket that exist within the game he is playing. Advantage, Russ. What about the other guys? The Cavs defeated the Celtics soundly on Wednesday, but there’s no denying that their defense remains abhorrent, troublesome, damning — take your pick. That’s been the talking point about Cleveland heading into the postseason. Not even LeBron can overcome that narrative this late in the day. Kawhi, on the other hand, struggles with what Westbrook has an abundance of: highlights and signature moments that push his case forward on top of the foundation that is his great numbers. At least for the most part. Kawhi scored 32 points on the Grizzlies in an overtime game Tuesday, but he hasn’t been quite the same since he suffered a concussion in early March. And on Wednesday night, he scored only 11 in a shocking loss to the tanking Lakers. In the past two seasons, Stephen Curry has made us — forced us to, even — recognize and appreciate efficiency. LeBron has been doing that his whole career. Kawhi is PER in the flesh. But this year, Westbrook is making history while making us believe in the eye test once again. Playing a sport that prides itself on the past, defines itself by its history, and even has old-timers still decrying today’s game in comparison to their tougher times, Westbrook is now on the brink of toppling one of the game’s giants, on the verge of breaking one of the records we all thought couldn’t be broken. When you think of it like that, “soon” is a lot closer than you think. ", "child": "33_1\t33_2\t33_3\t33_4\t33_5\t33_6\t33_7"}