{"name": "332", "parent": "", "title": "Become a Member", "sentences": [{"467d": "Become a Member"}, {"059b": "Your support is needed — and it’s going to mean everything."}, {"3a6e": "On top of being an ad-minimal oasis for our content, our move to Medium offers us a number of ways to better serve our readers while supporting the growing cadre of voices who write for our site."}, {"dbb2": "Today, we’re introducing Memberships. An opportunity for you to contribute directly to the success of our publication and to get up-close and personal with your favorite writers."}, {"1ed4": "Memberships start at $2/month. You can pledge more if you’d like. It’s up to how generous you want to be."}, {"d033": "Click here to sign-up."}, {"70f5": "Why are we doing this?"}, {"d9bd": "Every month, we reach well into the millions of readers. And while this sounds like a lot, it isn’t always enough to pay the bills and grow. That’s why we need you. We’re talking about our most loyal readers."}, {"d307": "If 1,000 out of those millions of people signed up as members at $2 per month, we’d be able to double the amount of amazing content we publish every month. You could spend more than $2 to rent a bad movie on-demand tonight. Save that money, give it us instead, and we’ll recommend a bunch of good movies you can watch on Netflix. This isn’t a campaign where we beg for money in a fight to survive, every dollar of membership goes to paying for new content. New voices, new ideas, new perspectives. (And maybe some new podcasts.)"}, {"f8d3": "Membership is going to a pivotal part of our future. Your contribution will support our independence as a publication and the growth of our community. We’ve learned a lot from our past efforts in Crowdfunding, so we’re starting small and building as we go."}, {"a231": "Your Film School Rejects membership grants you exclusive access to:"}, {"c3ce": "The One Perfect Shot Slack Community"}, {"e495": "Access to our Members Only Slack channel. We don’t have money yet for matching jackets, but we’ll work on it. Interact directly and personally with the Film School Rejects/One Perfect Shot team, submit questions for our weekly Members Only Q&A article, or simply shoot the breeze about movies, television, comics, life. You can also suggest Shots for the One Perfect Shot Twitter account and if we choose your shot, we’ll give you a shout-out."}, {"a444": "Exclusive Content"}, {"8236": "We’ll be created content (2–3 articles per week at first) exclusively for our members. This will include:"}, {"69cc": "More in the future!"}, {"49f4": "We’re just getting started with Memberships, which means that there’s so much more to come as we grow. We have no doubt that you’ve read articles about the doomed nature of quality journalism and cultural commentary on the internet. We’ve seen friends lose jobs, whole sites go under, and great voices get snuffed out by the realities of our industry. After 10 years, we’ve survived by holding tight to the sides of our boat as we navigate choppy waters. We’re still the same scrappy, independent publication we’ve always been. And with Memberships, we can continue to turn the tide and bring the focus back to quality content on the Internet."}, {"c49d": "Become a Film School Rejects member by clicking here."}, {"59b8": "We can’t wait to go on this journey with all of you!"}, {"4962": "Thank you,"}, {"a2d8": "The Film School Rejects Team"}], "content": "Become a Member Your support is needed — and it’s going to mean everything. On top of being an ad-minimal oasis for our content, our move to Medium offers us a number of ways to better serve our readers while supporting the growing cadre of voices who write for our site. Today, we’re introducing Memberships. An opportunity for you to contribute directly to the success of our publication and to get up-close and personal with your favorite writers. Memberships start at $2/month. You can pledge more if you’d like. It’s up to how generous you want to be. Click here to sign-up. Why are we doing this? Every month, we reach well into the millions of readers. And while this sounds like a lot, it isn’t always enough to pay the bills and grow. That’s why we need you. We’re talking about our most loyal readers. If 1,000 out of those millions of people signed up as members at $2 per month, we’d be able to double the amount of amazing content we publish every month. You could spend more than $2 to rent a bad movie on-demand tonight. Save that money, give it us instead, and we’ll recommend a bunch of good movies you can watch on Netflix. This isn’t a campaign where we beg for money in a fight to survive, every dollar of membership goes to paying for new content. New voices, new ideas, new perspectives. (And maybe some new podcasts.) Membership is going to a pivotal part of our future. Your contribution will support our independence as a publication and the growth of our community. We’ve learned a lot from our past efforts in Crowdfunding, so we’re starting small and building as we go. Your Film School Rejects membership grants you exclusive access to: The One Perfect Shot Slack Community Access to our Members Only Slack channel. We don’t have money yet for matching jackets, but we’ll work on it. Interact directly and personally with the Film School Rejects/One Perfect Shot team, submit questions for our weekly Members Only Q&A article, or simply shoot the breeze about movies, television, comics, life. You can also suggest Shots for the One Perfect Shot Twitter account and if we choose your shot, we’ll give you a shout-out. Exclusive Content We’ll be created content (2–3 articles per week at first) exclusively for our members. This will include: More in the future! We’re just getting started with Memberships, which means that there’s so much more to come as we grow. We have no doubt that you’ve read articles about the doomed nature of quality journalism and cultural commentary on the internet. We’ve seen friends lose jobs, whole sites go under, and great voices get snuffed out by the realities of our industry. After 10 years, we’ve survived by holding tight to the sides of our boat as we navigate choppy waters. We’re still the same scrappy, independent publication we’ve always been. And with Memberships, we can continue to turn the tide and bring the focus back to quality content on the Internet. Become a Film School Rejects member by clicking here. We can’t wait to go on this journey with all of you! Thank you, The Film School Rejects Team ", "child": "332_1\t332_2\t332_3\t332_4\t332_5\t332_6\t332_7332_1\t332_2\t332_3\t332_4\t332_5\t332_6\t332_7332_1\t332_2\t332_3\t332_4\t332_5\t332_6\t332_7"}