{"name": "347", "parent": "", "title": "When Should You Punt on a Television Show?", "sentences": [{"d177": "When Should You Punt on a Television Show?"}, {"d907": "We look to the best and brightest of television criticism and see what they have to say."}, {"4faf": "A few weeks ago, I realized that I hadn’t been living my best possible Netflix life. With a one-hour train ride to work each day — roughly two hours door-to-door — my daily commute provided me the perfect opportunity to try out a few television shows on my backlist. My freelance writing tends to focus on film criticism and film history; that means I tend to feel bad when I waste valuable movie-watching time on episodes of television shows. Put another way: two episodes of any hour-long show is time better spent moving one more classic or foreign film from my ‘to-watch’ list to my ‘watched’ list."}, {"9c5c": "But while I have a hard-and-fast rule about watching movies on my phone, I have no such restrictions on consuming modern television in a handheld format. That’s where Netflix comes in handy. I can dig into television shows without taking away time I have earmarked for new (re: old) movies, a revelation that has come as both a blessing and a curse. On the one hand, I’m watching more television than ever before; on the other hand, I’ve struggled to find a consistent jump-off point when I’m ready to leave a show. Despite a bad pilot, for instance, Santa Clarita Diet finally found its stride due to Timothy Olyphant’s stoner-comedy performance and Drew Barrymore’s surprisingly poignant turn as a zombie mom. And yet, when confronted with the well-respected first seasons of Into the Badlands and The Expanse — not currently available for download on Netflix but shows I’ve earmarked for future consideration — I was only able to make it about 15 minutes in before punting on each. And that doesn’t even mention The 100, a show I’ve long wanted to try out but one I’m really struggling to enjoy through three inarguably bad episodes."}, {"23dd": "All of which begs the question: when is the appropriate time to jump off a television show? In 2016, The Hollywood Reporter’s Tim Goodman argued that it wasn’t reasonable for most people to “watch four episodes of a show they don’t like just to get to the turning point that makes it good.” This would suggest that a television series that starts off weak — regardless of its eventual destination — isn’t worth the effort for most people. If that’s too vague for you, then perhaps you’ll enjoy Vox’s Todd VanDerWerff and his cardinal rule: “sometimes you’ll realize a show is just rubbing you the wrong way, or you don’t like the lead actor, or whatever. And if that’s the case, turn it off.” At VanDerWerff notes, there are “well over 400 scripted shows on TV” these days, each vying for our time and affection. If one show doesn’t hook you right out of the gate, you shouldn’t feel bad that you moved onto the next series rather than waiting the show out."}, {"3dfe": "Streaming video providers like Netflix have even mathematically quantified the moment when audience members commit to their new series. In 2015, Netflix — which is notoriously finicky when it comes to releasing their in-house metrics — released a list of the episodes that effectively “hooked” audiences for each of their biggest shows. As noted by The Verge, Netflix keeps a list of the episode from each show that “kept 70 percent of people on board for the rest of the season,” ensuring that a show had hit critical mass. The eighth episode of Arrow; the second episode of The Walking Dead; the third episode of Dexter. For fans of each series, this list not only provides a mathematical proof for something they already instinctively knew, it also gives them a potential jumping off point for friends and family. If you don’t like Dexter by its third episode, you can say, then it’s probably not the show for you."}, {"224e": "‘Santa Clarita Diet’ Hits the Spot, If You Can Stomach ItThe strange, wonderful Netflix zombie show is a cult comedy looking for its cult.filmschoolrejects.com"}, {"d7cb": "None of that really helps answer the central question, though: when should you quit a show that isn’t doing it for you? One of the ideas that repeats itself in each article — either explicitly or implicitly — is the idea of that thing that makes you keep watching. For The Hollywood Reporter’s Daniel Feinberg, that thing was James Spader, whose steady presence as the antihero of The Blacklist “can make up for a lot.” As mentioned before, I came dangerously close to quitting Santa Clarita Diet but refused to give up on the opportunity to watch Timothy Olyphant play a non-stoic sheriff for once in his Hollywood career. If you’re in need of a hard-and-fast rule on when to quit, you could do a lot worse than VanDerWerff’s helpful guide, but there is something to be said for hanging on as long as that something continues to keep you interested in. Maybe if more people appreciated the beauty that is Gerald McRaney, for example, we would’ve gotten more than a season and change of Jericho. One actor, one plot point, one piece of intrigue. Or, to invert it slightly: just as VanDerWerff suggests you should never feel bad about ditching a show, you should also never feel bad about hanging on for one small reason. After all, it’s your free time."}, {"5eba": "So will I continue to watch The 100 even as the show struggles to hit the bare minimums of character development and dialogue? As it turns out, Feinberg has given me hope. Sort of. “The first five or six episodes are genuinely awful,” Feinberg noted in his piece, “but enough people insisted it got better that I revisited and you know what? It did get better.” Later in this interview, he also notes that he never got farther than a “5 or 6” on the series and ended up bailing in Season 2, but the damage here has been done. Right now, The 100 is the perfect show for me to watch every morning while doing my best not to bump into the woman carrying three shopping bags worth of work supplies. As it turns out, that one thing that keeps me hooked is the promise that things do indeed get better."}], "content": "When Should You Punt on a Television Show? We look to the best and brightest of television criticism and see what they have to say. A few weeks ago, I realized that I hadn’t been living my best possible Netflix life. With a one-hour train ride to work each day — roughly two hours door-to-door — my daily commute provided me the perfect opportunity to try out a few television shows on my backlist. My freelance writing tends to focus on film criticism and film history; that means I tend to feel bad when I waste valuable movie-watching time on episodes of television shows. Put another way: two episodes of any hour-long show is time better spent moving one more classic or foreign film from my ‘to-watch’ list to my ‘watched’ list. But while I have a hard-and-fast rule about watching movies on my phone, I have no such restrictions on consuming modern television in a handheld format. That’s where Netflix comes in handy. I can dig into television shows without taking away time I have earmarked for new (re: old) movies, a revelation that has come as both a blessing and a curse. On the one hand, I’m watching more television than ever before; on the other hand, I’ve struggled to find a consistent jump-off point when I’m ready to leave a show. Despite a bad pilot, for instance, Santa Clarita Diet finally found its stride due to Timothy Olyphant’s stoner-comedy performance and Drew Barrymore’s surprisingly poignant turn as a zombie mom. And yet, when confronted with the well-respected first seasons of Into the Badlands and The Expanse — not currently available for download on Netflix but shows I’ve earmarked for future consideration — I was only able to make it about 15 minutes in before punting on each. And that doesn’t even mention The 100, a show I’ve long wanted to try out but one I’m really struggling to enjoy through three inarguably bad episodes. All of which begs the question: when is the appropriate time to jump off a television show? In 2016, The Hollywood Reporter’s Tim Goodman argued that it wasn’t reasonable for most people to “watch four episodes of a show they don’t like just to get to the turning point that makes it good.” This would suggest that a television series that starts off weak — regardless of its eventual destination — isn’t worth the effort for most people. If that’s too vague for you, then perhaps you’ll enjoy Vox’s Todd VanDerWerff and his cardinal rule: “sometimes you’ll realize a show is just rubbing you the wrong way, or you don’t like the lead actor, or whatever. And if that’s the case, turn it off.” At VanDerWerff notes, there are “well over 400 scripted shows on TV” these days, each vying for our time and affection. If one show doesn’t hook you right out of the gate, you shouldn’t feel bad that you moved onto the next series rather than waiting the show out. Streaming video providers like Netflix have even mathematically quantified the moment when audience members commit to their new series. In 2015, Netflix — which is notoriously finicky when it comes to releasing their in-house metrics — released a list of the episodes that effectively “hooked” audiences for each of their biggest shows. As noted by The Verge, Netflix keeps a list of the episode from each show that “kept 70 percent of people on board for the rest of the season,” ensuring that a show had hit critical mass. The eighth episode of Arrow; the second episode of The Walking Dead; the third episode of Dexter. For fans of each series, this list not only provides a mathematical proof for something they already instinctively knew, it also gives them a potential jumping off point for friends and family. If you don’t like Dexter by its third episode, you can say, then it’s probably not the show for you. ‘Santa Clarita Diet’ Hits the Spot, If You Can Stomach ItThe strange, wonderful Netflix zombie show is a cult comedy looking for its cult.filmschoolrejects.com None of that really helps answer the central question, though: when should you quit a show that isn’t doing it for you? One of the ideas that repeats itself in each article — either explicitly or implicitly — is the idea of that thing that makes you keep watching. For The Hollywood Reporter’s Daniel Feinberg, that thing was James Spader, whose steady presence as the antihero of The Blacklist “can make up for a lot.” As mentioned before, I came dangerously close to quitting Santa Clarita Diet but refused to give up on the opportunity to watch Timothy Olyphant play a non-stoic sheriff for once in his Hollywood career. If you’re in need of a hard-and-fast rule on when to quit, you could do a lot worse than VanDerWerff’s helpful guide, but there is something to be said for hanging on as long as that something continues to keep you interested in. Maybe if more people appreciated the beauty that is Gerald McRaney, for example, we would’ve gotten more than a season and change of Jericho. One actor, one plot point, one piece of intrigue. Or, to invert it slightly: just as VanDerWerff suggests you should never feel bad about ditching a show, you should also never feel bad about hanging on for one small reason. After all, it’s your free time. So will I continue to watch The 100 even as the show struggles to hit the bare minimums of character development and dialogue? As it turns out, Feinberg has given me hope. Sort of. “The first five or six episodes are genuinely awful,” Feinberg noted in his piece, “but enough people insisted it got better that I revisited and you know what? It did get better.” Later in this interview, he also notes that he never got farther than a “5 or 6” on the series and ended up bailing in Season 2, but the damage here has been done. Right now, The 100 is the perfect show for me to watch every morning while doing my best not to bump into the woman carrying three shopping bags worth of work supplies. As it turns out, that one thing that keeps me hooked is the promise that things do indeed get better. ", "child": "347_1\t347_2\t347_3\t347_4\t347_5\t347_6"}