{"name": "364", "parent": "", "title": "Charlie Murphy Was the Only Good Storyteller", "sentences": [{"d098": "Charlie Murphy Was the Only Good Storyteller"}, {"f452": "The comedy great, who died Wednesday at the age of 57, wove facts and fiction together so artfully that the difference between the two rarely mattered"}, {"426b": "While Charlie Murphy was a comedian by trade, it never felt like he was telling jokes."}, {"0cfc": "Murphy spun tall tales, the kind you might hear over the low hum of music in the kitchen with your closest friends in those tweener hours when it’s too late in the evening to start anything and anywhere farther than the living room seems miles away. He had a low, gruff voice that felt familiar — like work boot heels dragging across loose gravel — and a slow, deliberate pace to his storytelling. He hitched to remember details or, perhaps more likely, to make them up as he went along. Fussing over whether the stories were strictly-speaking “true” was wide of the point. Where was the fun in questioning whether he and his younger brother Eddie had actually beat the motor function out of Rick James’s legs? Why ruin a story so perfect with something as needless as facts?"}, {"c9af": "On Wednesday, Murphy passed away at the age of 57 after a cruelly long battle with leukemia, and the poverty of the English language is such that I cannot describe to you how much that sucks. There was, of course, a requisite outpouring of love and respect for the late and legendary storyteller from fellow comics and fans alike, but Paul Mooney, also something of a Chappelle’s Show regular, got nearest to what I felt when I heard the news."}, {"37a9": "While most will remember Murphy for his “True Hollywood Stories” appearances on Chappelle’s Show — which truly and without exaggeration can be argued as the funniest moments in television history — his oeuvre was larger than that. He wrote Vampire in Brooklyn, and had a handful of smaller film roles — the 1989 (black people) classic Harlem Nights, Spike Lee’s Mo’ Better Blues, Ice Cube’s The Players Club — as well as a few one-off TV roles in shows like Black Dynamite and Black Jesus. But a personal favorite was Murphy’s work on The Boondocks as a white and profoundly bizarre Iraq War vet named Ed Wuncler III who tended toward the extreme in all walks of life. There’s a scene in the second season where he snatches up and interrogates the wrong schoolkid over Riley’s missing chain. “WELL FUCK YOU THEN” isn’t especially funny on its own, but the subtle tonal changes of the brief, genuine apology that precedes it and the sudden veer into full-on shouting illustrate Murphy’s draw. It’s not what he said but how he said it that held your attention and popped into your head at random for some time afterward:"}, {"ecda": "Wuncler was an outrageous character, but like anything else Murphy did, this depiction was at least somewhat rooted in fact. Murphy served in the U.S. Navy from 1978 to 1983, and after being discharged, worked security for his younger brother. This laid ground for another underrated piece of Charlie’s work, which was when he (probably) called a heckler a bitch in the middle of Eddie’s Delirious set. Charlie’s policy, according to Charlie himself in a now-blocked outtake on YouTube (honestly Viacom, let the kids play), was that overkill was underrated when it came to doing for family, which ultimately led to him resigning his post as Eddie’s head of security. Though a mouthy dude in a wheelchair that Had It Coming was used as a (hilarious) plot device, the core idea here was that he loved his brother. Maybe too much. But also, living in Eddie’s shadow was a splinter that had begun to fester."}, {"8911": "In 2012, Charlie spoke to Vice after finishing the American leg of his Acid Trip Tour, before heading overseas to the U.K. There was the usual seasoned-comedian grousing about how everyone is too sensitive now, but the most interesting part was when he opened up about being the lesser-known older brother of a mega-famous comic, and how that drove him."}, {"1aa5": "“When I first started doing comedy, I was 42 years old and I was the brother of one of the most celebrated comics in history who made his name in the game 20 years earlier. … It’s like, if Michael Jordan all of a sudden had a big brother who plays basketball and he’s good, too. That does not compute for most people. So, I had to have anger to do this because there were going to be people saying, ‘You can’t do this.’ And when they saw the rage and anger, they got out of my way.”"}, {"230b": "Reading that, I got the sense that he was never quite at ease with how life shook out — because there was, of course, “anger” — but it didn’t quite seem he was bemoaning the hand he was dealt, either. Murphy’s final, strangely prescient tweet — why does it always feel like they know? — lent context: the past is untenable, and life is just kind of stupid that way."}], "content": "Charlie Murphy Was the Only Good Storyteller The comedy great, who died Wednesday at the age of 57, wove facts and fiction together so artfully that the difference between the two rarely mattered While Charlie Murphy was a comedian by trade, it never felt like he was telling jokes. Murphy spun tall tales, the kind you might hear over the low hum of music in the kitchen with your closest friends in those tweener hours when it’s too late in the evening to start anything and anywhere farther than the living room seems miles away. He had a low, gruff voice that felt familiar — like work boot heels dragging across loose gravel — and a slow, deliberate pace to his storytelling. He hitched to remember details or, perhaps more likely, to make them up as he went along. Fussing over whether the stories were strictly-speaking “true” was wide of the point. Where was the fun in questioning whether he and his younger brother Eddie had actually beat the motor function out of Rick James’s legs? Why ruin a story so perfect with something as needless as facts? On Wednesday, Murphy passed away at the age of 57 after a cruelly long battle with leukemia, and the poverty of the English language is such that I cannot describe to you how much that sucks. There was, of course, a requisite outpouring of love and respect for the late and legendary storyteller from fellow comics and fans alike, but Paul Mooney, also something of a Chappelle’s Show regular, got nearest to what I felt when I heard the news. While most will remember Murphy for his “True Hollywood Stories” appearances on Chappelle’s Show — which truly and without exaggeration can be argued as the funniest moments in television history — his oeuvre was larger than that. He wrote Vampire in Brooklyn, and had a handful of smaller film roles — the 1989 (black people) classic Harlem Nights, Spike Lee’s Mo’ Better Blues, Ice Cube’s The Players Club — as well as a few one-off TV roles in shows like Black Dynamite and Black Jesus. But a personal favorite was Murphy’s work on The Boondocks as a white and profoundly bizarre Iraq War vet named Ed Wuncler III who tended toward the extreme in all walks of life. There’s a scene in the second season where he snatches up and interrogates the wrong schoolkid over Riley’s missing chain. “WELL FUCK YOU THEN” isn’t especially funny on its own, but the subtle tonal changes of the brief, genuine apology that precedes it and the sudden veer into full-on shouting illustrate Murphy’s draw. It’s not what he said but how he said it that held your attention and popped into your head at random for some time afterward: Wuncler was an outrageous character, but like anything else Murphy did, this depiction was at least somewhat rooted in fact. Murphy served in the U.S. Navy from 1978 to 1983, and after being discharged, worked security for his younger brother. This laid ground for another underrated piece of Charlie’s work, which was when he (probably) called a heckler a bitch in the middle of Eddie’s Delirious set. Charlie’s policy, according to Charlie himself in a now-blocked outtake on YouTube (honestly Viacom, let the kids play), was that overkill was underrated when it came to doing for family, which ultimately led to him resigning his post as Eddie’s head of security. Though a mouthy dude in a wheelchair that Had It Coming was used as a (hilarious) plot device, the core idea here was that he loved his brother. Maybe too much. But also, living in Eddie’s shadow was a splinter that had begun to fester. In 2012, Charlie spoke to Vice after finishing the American leg of his Acid Trip Tour, before heading overseas to the U.K. There was the usual seasoned-comedian grousing about how everyone is too sensitive now, but the most interesting part was when he opened up about being the lesser-known older brother of a mega-famous comic, and how that drove him. “When I first started doing comedy, I was 42 years old and I was the brother of one of the most celebrated comics in history who made his name in the game 20 years earlier. … It’s like, if Michael Jordan all of a sudden had a big brother who plays basketball and he’s good, too. That does not compute for most people. So, I had to have anger to do this because there were going to be people saying, ‘You can’t do this.’ And when they saw the rage and anger, they got out of my way.” Reading that, I got the sense that he was never quite at ease with how life shook out — because there was, of course, “anger” — but it didn’t quite seem he was bemoaning the hand he was dealt, either. Murphy’s final, strangely prescient tweet — why does it always feel like they know? — lent context: the past is untenable, and life is just kind of stupid that way. ", "child": "364_1\t364_2\t364_3\t364_4\t364_5\t364_6\t364_7\t364_8"}