{"name": "371", "parent": "", "title": "The Founder of WorldStarHipHop Was a Visionary", "sentences": [{"d9d8": "The Founder of WorldStarHipHop Was a Visionary"}, {"8f09": "Remembering Lee “Q” O’Denat, who helped frame how we view conflict online"}, {"d81c": "WorldStarHipHop is a repository for human conflict, often recorded with an iPhone camera. The viral video site — a mix of crowdsourced street fights, police dashcam footage, meme explainers, and strippers — aspires to be a one-stop shop for all content under the umbrella of “hip-hop culture,” which founder Lee “Q” O’Denat once described as “strippers, drug talk, violent talk, fights, animosity, love and hate.” O’Denat built WorldStar from a mixtape portal into one of the most-trafficked websites in the United States and eventually into a common exclamation that means, approximately, “some nefarious but entertaining shit is afoot.” On Monday night, he died in his sleep, according to TMZ. He was 43."}, {"cf70": "O’Denat, from Hollis, Queens, had been fascinated with computers since an early job working at Circuit City. While his early online ventures floundered, WorldStar, launched in 2005 (the same year as YouTube), found success as a video aggregator. Over time it evolved into a hip-hop gatekeeper at a time when print rap mags were struggling. With the genre lacking in the culture-consuming beefs that had propelled hip-hop media in the ’90s, WorldStar instead cobbled together an audience via a thousand lesser battles. Some of the combatants were famous — 50 Cent and Q had a heated argument on New York’s Hot 97 after the rapper (falsely) took credit for shutting WorldStar down for a day. Others were angling for fame; a major plot point in the first season of Love & Hip-Hop turns on Jim Jones’s mother releasing a WorldStar dis track about his girlfriend, then parlaying the controversy into a merchandising opportunity. But most of the fighters were anonymous kids brawling outside their high schools, on their project steps, or in their suburban driveways."}, {"9863": "The mélange of B-list celebrity controversy and “True Life: I Got My Ass Kicked” dispatches from regular folks proved to be potent. In 2011, worldstarhiphop.com was the 225th most-trafficked site in the U.S., making it about as popular as MTV.com, according to Alexa data cited in a Vibe piece. (WSHH is currently ranked 313th.) And the winning formula persists. On Tuesday the trending videos on the website included “Dude Throws Hands With a Dwarf!,” “Kid Punches a Racist Homeless Man a Few Times for Calling Him the N-Word!,” and “Shia Labeouf Punks Alleged White Supremacist on His Anti-Trump Livestream!”"}, {"8c1d": "During its rise, the site attracted controversy for its lewd and violent videos, but today it’s stuffed with ads from Papa John’s and Jet.com, which is owned by Wal-Mart. WorldStar also rakes in money from music artists, both big and small, who pay to have their videos placed on the site. O’Denat was a tastemaker who understood many of the tenets of the modern web before they had been codified into billion-dollar business models by tech giants. Conflict attracts eyeballs. Attribution is optional. Facts don’t matter. If he profited from the misery of a person who just got knocked the eff out, well, so did the social platforms that helped WorldStar expand its reach. “People may be offended by some of the content, but hey, the Internet is not a censorship boat,” he said in a 2015 interview with The New York Times. “There’s no reason we shouldn’t be standing up with the Snapchats, the Vines.”"}, {"150b": "But such a lucrative formula was bound to be copied. Today, Facebook is overrun with pages broadcasting “X scenario gone wrong” clips for mass entertainment. The most WorldStar moment of the year so far was white nationalist Richard Spencer getting sucker-punched on Inauguration Day, which Twitter gleefully set to all kinds of music."}, {"f35e": "Aware that his brand was being commodified, Q had recently sought to expand his horizons. In 2014, WorldStar launched a documentary series called The Field, focusing on the struggles faced by urban youth in cities such as Chicago and Miami. And this February, the company is launching a show on MTV2, on which talking heads will crack jokes about the most viral WorldStar clips of the moment."}, {"207a": "It’s not clear how Q’s death will affect WorldStar’s future. He was the face of the organization and had spurned suitors as famous as Sean “Puffy” Combs to retain complete control of the company. But even if Q’s not here to see it, there’s no denying that WorldStar’s influence has extended far beyond its old-school homepage."}], "content": "The Founder of WorldStarHipHop Was a Visionary Remembering Lee “Q” O’Denat, who helped frame how we view conflict online WorldStarHipHop is a repository for human conflict, often recorded with an iPhone camera. The viral video site — a mix of crowdsourced street fights, police dashcam footage, meme explainers, and strippers — aspires to be a one-stop shop for all content under the umbrella of “hip-hop culture,” which founder Lee “Q” O’Denat once described as “strippers, drug talk, violent talk, fights, animosity, love and hate.” O’Denat built WorldStar from a mixtape portal into one of the most-trafficked websites in the United States and eventually into a common exclamation that means, approximately, “some nefarious but entertaining shit is afoot.” On Monday night, he died in his sleep, according to TMZ. He was 43. O’Denat, from Hollis, Queens, had been fascinated with computers since an early job working at Circuit City. While his early online ventures floundered, WorldStar, launched in 2005 (the same year as YouTube), found success as a video aggregator. Over time it evolved into a hip-hop gatekeeper at a time when print rap mags were struggling. With the genre lacking in the culture-consuming beefs that had propelled hip-hop media in the ’90s, WorldStar instead cobbled together an audience via a thousand lesser battles. Some of the combatants were famous — 50 Cent and Q had a heated argument on New York’s Hot 97 after the rapper (falsely) took credit for shutting WorldStar down for a day. Others were angling for fame; a major plot point in the first season of Love & Hip-Hop turns on Jim Jones’s mother releasing a WorldStar dis track about his girlfriend, then parlaying the controversy into a merchandising opportunity. But most of the fighters were anonymous kids brawling outside their high schools, on their project steps, or in their suburban driveways. The mélange of B-list celebrity controversy and “True Life: I Got My Ass Kicked” dispatches from regular folks proved to be potent. In 2011, worldstarhiphop.com was the 225th most-trafficked site in the U.S., making it about as popular as MTV.com, according to Alexa data cited in a Vibe piece. (WSHH is currently ranked 313th.) And the winning formula persists. On Tuesday the trending videos on the website included “Dude Throws Hands With a Dwarf!,” “Kid Punches a Racist Homeless Man a Few Times for Calling Him the N-Word!,” and “Shia Labeouf Punks Alleged White Supremacist on His Anti-Trump Livestream!” During its rise, the site attracted controversy for its lewd and violent videos, but today it’s stuffed with ads from Papa John’s and Jet.com, which is owned by Wal-Mart. WorldStar also rakes in money from music artists, both big and small, who pay to have their videos placed on the site. O’Denat was a tastemaker who understood many of the tenets of the modern web before they had been codified into billion-dollar business models by tech giants. Conflict attracts eyeballs. Attribution is optional. Facts don’t matter. If he profited from the misery of a person who just got knocked the eff out, well, so did the social platforms that helped WorldStar expand its reach. “People may be offended by some of the content, but hey, the Internet is not a censorship boat,” he said in a 2015 interview with The New York Times. “There’s no reason we shouldn’t be standing up with the Snapchats, the Vines.” But such a lucrative formula was bound to be copied. Today, Facebook is overrun with pages broadcasting “X scenario gone wrong” clips for mass entertainment. The most WorldStar moment of the year so far was white nationalist Richard Spencer getting sucker-punched on Inauguration Day, which Twitter gleefully set to all kinds of music. Aware that his brand was being commodified, Q had recently sought to expand his horizons. In 2014, WorldStar launched a documentary series called The Field, focusing on the struggles faced by urban youth in cities such as Chicago and Miami. And this February, the company is launching a show on MTV2, on which talking heads will crack jokes about the most viral WorldStar clips of the moment. It’s not clear how Q’s death will affect WorldStar’s future. He was the face of the organization and had spurned suitors as famous as Sean “Puffy” Combs to retain complete control of the company. But even if Q’s not here to see it, there’s no denying that WorldStar’s influence has extended far beyond its old-school homepage. ", "child": "371_1"}