{"name": "388", "parent": "", "title": "Digit Wants to Charge a Monthly Fee", "sentences": [{"7f2e": "Digit Wants to Charge a Monthly Fee"}, {"ee70": "We’re actually going to break up this time."}, {"19c5": "In January I made a big stink about breaking up with Digit, the app that automatically saves an algorithmically-determined amount of money for me, because for one month, it didn’t save any money at all."}, {"cf48": "Breaking Up Is Hard To DoDigit and I are no longer.thebillfold.com"}, {"855c": "Confession time: I didn’t actually stop using it, partially because I forgot and mostly because it started saving money for me again and we got right back on track. I ignored its transgressions because I was blinded by savings. Also, as mentioned above, I’m lazy and slow to change."}, {"d891": "Digit, however, is not. And as per the Terms of Service agreement that I didn’t really read all the way through but agreed to anyway, they will start charging me $2.99 a month for using their service."}, {"7763": "Digit Is Testing Its Users' Loyalty With A New Monthly FeeDigit, a popular app that automates savings for its users, will soon begin charging a monthly fee in what will amount…www.forbes.com"}, {"c6a7": "Existing users like me and the one other person I’ve convinced to use this app will have 100 days to decide whether or not they want to stick with it before the $2.99 monthly fee kicks in. Forbes also notes that aside from that fee, Digit really isn’t introducing any new features: the “savings bonus” that they offer users for keeping money in the app will go up to 1% from a paltry 0.2%."}, {"bd13": "The way that Digit decided on $2.99 as the magic number to charge people for its service is a little gross, too."}, {"a431": "Digit experimented with how much to charge users by selecting guinea pigs from its user ranks at random. The negative reviews in the App Store suggest that the monthly fee will not exactly be welcomed with open arms. These users will be refunded, says Bloch, in addition to receiving an email from him with an explanation."}, {"00a0": "I get it — they have to make money somehow and the money they’ll generate from the user fee will allow them to expand by becoming more of a “financial destination” for its users. I have seen no explanation for what a “financial destination” is and seeing as the only financial destination I truly visit is my bank account, I’m comfortable saying that I don’t need another."}, {"a9eb": "As a dedicated user who chronicled my waning passion for the app in more detail that was likely necessary, the “savings bonus” wasn’t something that appealed to me. Digit’s utility was that I didn’t have to think about saving money but it also proved to me that saving money isn’t the insurmountable struggle I thought it was. As of four days ago, the app took $118.75 out of my bank account and I didn’t really feel it — proof that the algorithm is working, but also proof that I can save money in perfectly respectable and manageable chunks without feeling like I’m broke."}, {"9f0a": "After the 100 days are up, I’ll stop using Digit and take my money to a savings account, like I (maybe) should have in the first place."}], "content": "Digit Wants to Charge a Monthly Fee We’re actually going to break up this time. In January I made a big stink about breaking up with Digit, the app that automatically saves an algorithmically-determined amount of money for me, because for one month, it didn’t save any money at all. Breaking Up Is Hard To DoDigit and I are no longer.thebillfold.com Confession time: I didn’t actually stop using it, partially because I forgot and mostly because it started saving money for me again and we got right back on track. I ignored its transgressions because I was blinded by savings. Also, as mentioned above, I’m lazy and slow to change. Digit, however, is not. And as per the Terms of Service agreement that I didn’t really read all the way through but agreed to anyway, they will start charging me $2.99 a month for using their service. Digit Is Testing Its Users' Loyalty With A New Monthly FeeDigit, a popular app that automates savings for its users, will soon begin charging a monthly fee in what will amount…www.forbes.com Existing users like me and the one other person I’ve convinced to use this app will have 100 days to decide whether or not they want to stick with it before the $2.99 monthly fee kicks in. Forbes also notes that aside from that fee, Digit really isn’t introducing any new features: the “savings bonus” that they offer users for keeping money in the app will go up to 1% from a paltry 0.2%. The way that Digit decided on $2.99 as the magic number to charge people for its service is a little gross, too. Digit experimented with how much to charge users by selecting guinea pigs from its user ranks at random. The negative reviews in the App Store suggest that the monthly fee will not exactly be welcomed with open arms. These users will be refunded, says Bloch, in addition to receiving an email from him with an explanation. I get it — they have to make money somehow and the money they’ll generate from the user fee will allow them to expand by becoming more of a “financial destination” for its users. I have seen no explanation for what a “financial destination” is and seeing as the only financial destination I truly visit is my bank account, I’m comfortable saying that I don’t need another. As a dedicated user who chronicled my waning passion for the app in more detail that was likely necessary, the “savings bonus” wasn’t something that appealed to me. Digit’s utility was that I didn’t have to think about saving money but it also proved to me that saving money isn’t the insurmountable struggle I thought it was. As of four days ago, the app took $118.75 out of my bank account and I didn’t really feel it — proof that the algorithm is working, but also proof that I can save money in perfectly respectable and manageable chunks without feeling like I’m broke. After the 100 days are up, I’ll stop using Digit and take my money to a savings account, like I (maybe) should have in the first place. ", "child": "388_1\t388_2\t388_3\t388_4\t388_5\t388_6\t388_7\t388_8"}