{"name": "391", "parent": "", "title": "Wells Fargo’s Hard-Driving Culture Hits a Dead End", "sentences": [{"894d": "The NewCo Daily: Today’s Top Stories"}, {"ae92": "Wells Fargo’s Hard-Driving Culture Hits a Dead End"}, {"2d83": "The Internet Archive"}, {"9500": "Last year’s revelation that hyper-competitive, goal-crazed Wells Fargo salespeople opened millions of bogus accounts that customers never asked for already cost the bank’s CEO his job. But the fallout keeps growing. Today an outside law firm hired by the Wells board released a tough-talking report that put the onus chiefly on the banks’ former retail chief, Carrie Tolstedt (Reuters)."}, {"abd6": "Wells said it would penalize Tolstedt and former CEO John Stumpf a total of $75 million more than it already has. These penalties are known on Wall Street as “clawbacks.” The label makes them sound difficult and unpleasant, which is exactly what executives want the world to think they are."}, {"3c95": "When scandals get this big, the buck really stops with the board directors. The real question for Wells Fargo is whether the same board that dropped the ball on oversight while its sales team ran amok can effectively oversee the cleanup of its own mess. The new report largely exonerates board members, but that isn’t persuading investor advisory groups, who are urging Wells shareholders to replace many of the bank’s incumbent directors. Who said accountability should be painless?"}, {"5447": "When Implants Replace Passwords"}, {"c629": "If you’re the sort of person who’s wary of companies tracking your web and smartphone use, just wait till the chip implants take off. We already tag pets with chips so we don’t lose them, and similar tech is coming soon to human beings, if the Swedish company Biohax has its way (Recode)."}, {"d518": "The rice-grain-sized wireless devices can replace entry keycards, payment systems, and other electronic-ID schemes, so that instead of inserting a card or typing a PIN all you need to do is wave your hand. That’s fantastic — until someone you don’t know starts hacking into your implant (or, more likely, the cloud-based systems behind it), monitoring your location, and manipulating the world around you in ways that might end up feeling supernatural."}, {"b2c9": "“Turning the internet of things into the internet of us” is how Biohax’s CEO describes its project, and that may give you some good old cyberpunk shivers. But let’s not forget that the world of Neuromancer and Snow Crash was a dystopia."}, {"9a22": "China’s Cities Have Their Own Culture of Innovation"}, {"f88e": "If you’re old enough you might remember that “Made in Japan” was once a slur in the U.S., suggesting that a product was a cheap copy of someone else’s innovation. Then we went through the Rising Sun era, when some Americans feared Japanese economic might would overwhelm the world."}, {"cb88": "Today Japan is just one player among many economic superpowers, and China is the new threat on the global-domination block. In an arc similar to Japan’s — but on a much huger scale — China is evolving quickly from a manufacturing copycat to a creative engine in its own right (The Economist)."}, {"ef96": "At the national level, China remains largely a command economy. But China’s industrial growth has centered in specific cities like Shenzhen, which developed their own innovative industrial techniques and organizing principles in a much more bottom-up, decentralized manner. As that has happened, China began “moving up the value chain,” with a better educated workforce and more creative companies that register increasing numbers of patents today."}, {"49cc": "One cloud on the horizon: China’s industrial renaissance is centered in the Pearl River Delta lowlands. If sea levels rise thanks to climate change, as scientists expect, the region is going to face a soggy reckoning before long."}, {"c997": "The Ghost of Main Streets Past"}, {"017b": "Part of the energy behind Trump-style populism grows out of a nostalgia for a business world where Main Street mattered more than Wall Street. But the Main Street ideal — small towns and cities served by local businesses paying good wages — died off long before the internet and globalization, according to economic historian Louis Hyman (The New York Times). The chief culprit was chain stores that used their purchasing clout to lower prices, as Walmart does today, and undercut the Main Street family businesses."}, {"cf9b": "This Main Street ideal does survive, but not in old working-class factory towns. You’ll find it in trendy urban enclaves where people have enough wealth to pay a premium for things that are local, rare, or ethically sourced. Today, Hyman writes, “Main Street requires shoppers who don’t really care about low prices. The dream of Main Street may be populist, but the reality is elitist.”"}, {"909f": "But we don’t need to resurrect Main Street to improve the lives of those it left behind. Hyman argues that, rather than try to retrain middle America’s unemployed to become information workers, we can provide them with more autonomy and prosperity by helping them employ their existing skills through distributed online platforms. Etsy to the rescue? That can only work if those platforms don’t seek to maximize profit over the well-being of their worker-users. Otherwise, they’ll just become the next incarnation of the chain stores."}], "content": "The NewCo Daily: Today’s Top Stories Wells Fargo’s Hard-Driving Culture Hits a Dead End The Internet Archive Last year’s revelation that hyper-competitive, goal-crazed Wells Fargo salespeople opened millions of bogus accounts that customers never asked for already cost the bank’s CEO his job. But the fallout keeps growing. Today an outside law firm hired by the Wells board released a tough-talking report that put the onus chiefly on the banks’ former retail chief, Carrie Tolstedt (Reuters). Wells said it would penalize Tolstedt and former CEO John Stumpf a total of $75 million more than it already has. These penalties are known on Wall Street as “clawbacks.” The label makes them sound difficult and unpleasant, which is exactly what executives want the world to think they are. When scandals get this big, the buck really stops with the board directors. The real question for Wells Fargo is whether the same board that dropped the ball on oversight while its sales team ran amok can effectively oversee the cleanup of its own mess. The new report largely exonerates board members, but that isn’t persuading investor advisory groups, who are urging Wells shareholders to replace many of the bank’s incumbent directors. Who said accountability should be painless? When Implants Replace Passwords If you’re the sort of person who’s wary of companies tracking your web and smartphone use, just wait till the chip implants take off. We already tag pets with chips so we don’t lose them, and similar tech is coming soon to human beings, if the Swedish company Biohax has its way (Recode). The rice-grain-sized wireless devices can replace entry keycards, payment systems, and other electronic-ID schemes, so that instead of inserting a card or typing a PIN all you need to do is wave your hand. That’s fantastic — until someone you don’t know starts hacking into your implant (or, more likely, the cloud-based systems behind it), monitoring your location, and manipulating the world around you in ways that might end up feeling supernatural. “Turning the internet of things into the internet of us” is how Biohax’s CEO describes its project, and that may give you some good old cyberpunk shivers. But let’s not forget that the world of Neuromancer and Snow Crash was a dystopia. China’s Cities Have Their Own Culture of Innovation If you’re old enough you might remember that “Made in Japan” was once a slur in the U.S., suggesting that a product was a cheap copy of someone else’s innovation. Then we went through the Rising Sun era, when some Americans feared Japanese economic might would overwhelm the world. Today Japan is just one player among many economic superpowers, and China is the new threat on the global-domination block. In an arc similar to Japan’s — but on a much huger scale — China is evolving quickly from a manufacturing copycat to a creative engine in its own right (The Economist). At the national level, China remains largely a command economy. But China’s industrial growth has centered in specific cities like Shenzhen, which developed their own innovative industrial techniques and organizing principles in a much more bottom-up, decentralized manner. As that has happened, China began “moving up the value chain,” with a better educated workforce and more creative companies that register increasing numbers of patents today. One cloud on the horizon: China’s industrial renaissance is centered in the Pearl River Delta lowlands. If sea levels rise thanks to climate change, as scientists expect, the region is going to face a soggy reckoning before long. The Ghost of Main Streets Past Part of the energy behind Trump-style populism grows out of a nostalgia for a business world where Main Street mattered more than Wall Street. But the Main Street ideal — small towns and cities served by local businesses paying good wages — died off long before the internet and globalization, according to economic historian Louis Hyman (The New York Times). The chief culprit was chain stores that used their purchasing clout to lower prices, as Walmart does today, and undercut the Main Street family businesses. This Main Street ideal does survive, but not in old working-class factory towns. You’ll find it in trendy urban enclaves where people have enough wealth to pay a premium for things that are local, rare, or ethically sourced. Today, Hyman writes, “Main Street requires shoppers who don’t really care about low prices. The dream of Main Street may be populist, but the reality is elitist.” But we don’t need to resurrect Main Street to improve the lives of those it left behind. Hyman argues that, rather than try to retrain middle America’s unemployed to become information workers, we can provide them with more autonomy and prosperity by helping them employ their existing skills through distributed online platforms. Etsy to the rescue? That can only work if those platforms don’t seek to maximize profit over the well-being of their worker-users. Otherwise, they’ll just become the next incarnation of the chain stores. ", "child": "391_1391_1391_1391_1"}