{"name": "399", "parent": "", "title": "i’m just noting the political realities", "sentences": [{"0f2e": "i’m just noting the political realities"}, {"4f50": "Twitter"}, {"6301": "There’s a certain kind of liberal thinker — not common, but common enough — who doesn’t just value compromise, but thinks the fact that they value compromise makes them more politically savvy and knowledgable than people who want to start the discussion from further to the left. It does not."}, {"59e9": "During the primary last year, proposals like Medicare-for-all and free public college tuition were attacked as unrealistic by many liberals, partly because — so the thinking went — the filibuster in the Senate and the slim possibility that Democrats would take back the House made any big Sanders proposal dead on arrival. Only Hillary Clinton, in spite of the visceral hatred against her by a Republican base that dominates the conservative movement, could build the kind of compromise with someone like Paul Ryan and possibly Mitch McConnell that furthered some progressive goals. Never mind the fact that Barack Obama, one of the best American political communicators of all time, tried some form of this during his six years sharing power with Republicans and largely failed."}, {"6a50": "Now, as Democrats start to figure out how to be an adversarial minority party in the House and the Senate, these proposals are still derided as unrealistic. Taken to its logical conclusion, the argument against legislation like Rep. John Conyers’ Medicare-for-All bill is that Democrats should actually propose no new bills while they’re out of power, because to do so would be a “waste of time.”"}, {"43dc": "This is the actual political reality: anything Democrats propose over the next two years, unless it’s supported by a majority in the Republican House and Senate caucuses, is dead on arrival. For the next two years at the very least, the Democrats are not going to get anything done."}, {"5efa": "It doesn’t matter if a Democratic member of Congress proposes a $15 minimum wage, or a $12 minimum wage, or a $20 minimum wage, or an $8 minimum wage. As long as Paul Ryan is Speaker of the House, the minimum wage is not going to rise. It simply does not matter how much of a compromise on your values that you’re willing to make, because the other side doesn’t have to compromise."}, {"3dff": "The point of a mostly powerless opposition party, then, is to do three main things: one, rally the base in defense of the policies they created while they were in government; two, attempt to minimize the damage that the party in power can do while they’re running the government; and three, give people a reason to vote for you the next time around."}, {"dbe8": "Proposals like Medicare-for-all, free public college tuition, a $15 minimum wage, and other economic policies that significantly benefit the whole American working class do just that. If Democrats want to take a step toward regaining power, these are popular policies that can drive grassroots volunteering, small-dollar donations, and both the base and apathetic voters to give them their votes."}, {"37dc": "This doesn’t mean, of course, that people should just take liberal Democrats at their word that co-sponsoring a Medicare-for-all bill (that of course won’t pass) confirms their support should the bill ever actually have a chance of passing. One only need to look at how House Republicans repealed Obamacare over fifty times and then quickly changed their tune once they had the power to do so to know that the pressure has to stay on after the electoral cycle is over."}, {"e43a": "But for the moment, this is all those of us in opposition to austerity and Trumpism can do: defend what little we have and offer a better vision for the future than the bleak one we’re facing. If the liberal left stops tripping over its own dick to find a justification for why they shouldn’t give people any reason to vote for them, those big ideas might eventually become the new political reality."}], "content": "i’m just noting the political realities Twitter There’s a certain kind of liberal thinker — not common, but common enough — who doesn’t just value compromise, but thinks the fact that they value compromise makes them more politically savvy and knowledgable than people who want to start the discussion from further to the left. It does not. During the primary last year, proposals like Medicare-for-all and free public college tuition were attacked as unrealistic by many liberals, partly because — so the thinking went — the filibuster in the Senate and the slim possibility that Democrats would take back the House made any big Sanders proposal dead on arrival. Only Hillary Clinton, in spite of the visceral hatred against her by a Republican base that dominates the conservative movement, could build the kind of compromise with someone like Paul Ryan and possibly Mitch McConnell that furthered some progressive goals. Never mind the fact that Barack Obama, one of the best American political communicators of all time, tried some form of this during his six years sharing power with Republicans and largely failed. Now, as Democrats start to figure out how to be an adversarial minority party in the House and the Senate, these proposals are still derided as unrealistic. Taken to its logical conclusion, the argument against legislation like Rep. John Conyers’ Medicare-for-All bill is that Democrats should actually propose no new bills while they’re out of power, because to do so would be a “waste of time.” This is the actual political reality: anything Democrats propose over the next two years, unless it’s supported by a majority in the Republican House and Senate caucuses, is dead on arrival. For the next two years at the very least, the Democrats are not going to get anything done. It doesn’t matter if a Democratic member of Congress proposes a $15 minimum wage, or a $12 minimum wage, or a $20 minimum wage, or an $8 minimum wage. As long as Paul Ryan is Speaker of the House, the minimum wage is not going to rise. It simply does not matter how much of a compromise on your values that you’re willing to make, because the other side doesn’t have to compromise. The point of a mostly powerless opposition party, then, is to do three main things: one, rally the base in defense of the policies they created while they were in government; two, attempt to minimize the damage that the party in power can do while they’re running the government; and three, give people a reason to vote for you the next time around. Proposals like Medicare-for-all, free public college tuition, a $15 minimum wage, and other economic policies that significantly benefit the whole American working class do just that. If Democrats want to take a step toward regaining power, these are popular policies that can drive grassroots volunteering, small-dollar donations, and both the base and apathetic voters to give them their votes. This doesn’t mean, of course, that people should just take liberal Democrats at their word that co-sponsoring a Medicare-for-all bill (that of course won’t pass) confirms their support should the bill ever actually have a chance of passing. One only need to look at how House Republicans repealed Obamacare over fifty times and then quickly changed their tune once they had the power to do so to know that the pressure has to stay on after the electoral cycle is over. But for the moment, this is all those of us in opposition to austerity and Trumpism can do: defend what little we have and offer a better vision for the future than the bleak one we’re facing. If the liberal left stops tripping over its own dick to find a justification for why they shouldn’t give people any reason to vote for them, those big ideas might eventually become the new political reality. ", "child": "399_1\t399_2"}