{"name": "401", "parent": "", "title": "229 House Republicans just voted to keep Trump’s tax returns secret", "sentences": [{"d339": "229 House Republicans just voted to keep Trump’s tax returns secret"}, {"8c79": "“The American people have the right to know.”"}, {"659c": "CREDIT: AP Photo/J. Scott Applewhite"}, {"b087": "House Republicans voted en masse to block a resolution that would have forced Trump to turn his tax returns over to Congress on Monday night."}, {"84b0": "The measure was introduced by Rep. Bill Pascrell (D-NJ), a member of the House Ways and Means Committee. Under a 1924 law, the Ways and Means Committee is empowered to examine tax returns. The committee could then decide to release them to the full Congress, effectively making them public."}, {"13ce": "Trump has broken with decades of precedent and refused to release his tax returns, citing an ongoing audit."}, {"1833": "Pascrell first brought his request to the Chairman of the Way and Mean Committee, Rep. Kevin Brady (R-TX). Brady rejected the request, citing concern for Trump’s “civil liberties.”"}, {"90f0": "Pascrell was able to bring the issue to a full vote on the floor through a vehicle known as a “privileged resolution.”"}, {"676b": "“The American people have the right to know whether or not their president is operating under conflicts of interest related to international affairs, tax reform, government contracts or otherwise,” Pascrell said."}, {"c5e8": "Republicans in the House disagreed, virtually unanimously. Nearly every Republican voted to kill Pascrell’s resolution and keep Trump’s tax returns secret. No Republicans voted to require Trump to hand over his tax returns. (Two Republicans, including Mark Sanford of South Carolina, voted “present.”)"}, {"a442": "185 Democrats voted in favor of Pascrell’s efforts."}, {"f28b": "Nearly 1.1 million people have signed a White House petition demanding the immediate release of Trump’s tax returns."}, {"269e": "Trump promised to release his tax return if he ever ran for president."}, {"e93e": "“If I decide to run for office, I’ll produce my tax returns. Absolutely. I would love to do that,” Trump said in 2014."}], "content": "229 House Republicans just voted to keep Trump’s tax returns secret “The American people have the right to know.” CREDIT: AP Photo/J. Scott Applewhite House Republicans voted en masse to block a resolution that would have forced Trump to turn his tax returns over to Congress on Monday night. The measure was introduced by Rep. Bill Pascrell (D-NJ), a member of the House Ways and Means Committee. Under a 1924 law, the Ways and Means Committee is empowered to examine tax returns. The committee could then decide to release them to the full Congress, effectively making them public. Trump has broken with decades of precedent and refused to release his tax returns, citing an ongoing audit. Pascrell first brought his request to the Chairman of the Way and Mean Committee, Rep. Kevin Brady (R-TX). Brady rejected the request, citing concern for Trump’s “civil liberties.” Pascrell was able to bring the issue to a full vote on the floor through a vehicle known as a “privileged resolution.” “The American people have the right to know whether or not their president is operating under conflicts of interest related to international affairs, tax reform, government contracts or otherwise,” Pascrell said. Republicans in the House disagreed, virtually unanimously. Nearly every Republican voted to kill Pascrell’s resolution and keep Trump’s tax returns secret. No Republicans voted to require Trump to hand over his tax returns. (Two Republicans, including Mark Sanford of South Carolina, voted “present.”) 185 Democrats voted in favor of Pascrell’s efforts. Nearly 1.1 million people have signed a White House petition demanding the immediate release of Trump’s tax returns. Trump promised to release his tax return if he ever ran for president. “If I decide to run for office, I’ll produce my tax returns. Absolutely. I would love to do that,” Trump said in 2014. ", "child": "401_1\t401_2\t401_3\t401_4\t401_5\t401_6\t401_7\t401_8\t401_9\t401_10\t401_11\t401_12\t401_13\t401_14\t401_15\t401_16\t401_17\t401_18\t401_19\t401_20\t401_21\t401_22\t401_23\t401_24\t401_25"}