{"name": "404", "parent": "", "title": "Congressional Democrats condemn Sean Spicer for Holocaust denial", "sentences": [{"fb30": "Congressional Democrats condemn Sean Spicer for Holocaust denial"}, {"7f18": "Spicer should get some history lessons, perhaps from the nearby Holocaust Museum."}, {"176d": "CREDIT: AP Photo/Alex Brandon"}, {"29e0": "During Tuesday’s press briefing, White House Press Secretary falsely claimed that Adolf Hitler never used chemical weapons on his own people and, in subsequent clarifications, continued to insist that Syrian President Bashar al-Assad’s use of chemical weapons was somehow worse."}, {"0d7c": "Members of Congress, most of whom are spending their recesses engaged at home with constituents, soon started issuing responses to Spicer’s comments. Most condemned the remarks and suggested Spicer needed some history lessons, perhaps from the United States Holocaust Museum, which is located just a few blocks from the White House."}, {"3128": "*Lawmakers marked with an asterisk have called for Spicer to lose his job."}, {"cc27": "Sen. Ben Cardin (D-MD):"}, {"aa47": "Sen. Ed Markey (D-MA):"}, {"0b64": "*Rep. Donald Payne Jr. (D-NJ):"}, {"68a3": "*Rep. David Cicilline (D-RI):"}, {"04b4": "Rep. Kathleen Rice (D-NY):"}, {"55ca": "Rep. Adam Schiff (D-CA):"}, {"0a4f": "Rep. Jamie Raskin (D-MD):"}, {"d673": "Rep. Jerry Nadler (D-NY):"}, {"7fb4": "Sen. Mazie Hirono (D-HI):"}, {"5293": "Rep. John Yarmuth (D-KY):"}, {"ee59": "*House Minority Leader Nancy Pelosi (D-CA):"}, {"af05": "Rep. Adriano Espaillat (D-NY):"}, {"4629": "Rep. Jim McGovern (D-MA):"}, {"4d1f": "Rep. Lucille Roybal-Allard (D-CA):"}, {"7c5a": "Rep. Linda Sanchez (D-CA):"}, {"09bf": "Rep. Ted Deutch (D-FL):"}, {"7b48": "Rep. Dan Kildee (D-MI):"}, {"9326": "So far, only Democratic lawmakers have responded to the comments. Congressional Republicans have been active on social media, though. For example, Rep. Larry Bucschon (R-IN) retweeted President Trump’s video congratulating Justice Neil Gorsuch, while Sen. Marco Rubio (R-FL) lent a helping hand to 16-year-old Carter Wilkerson, who is trying to get 18 million retweets so that Wendy’s will give him a year’s supply of chicken nuggets:"}, {"9eb0": "This post has been updated."}], "content": "Congressional Democrats condemn Sean Spicer for Holocaust denial Spicer should get some history lessons, perhaps from the nearby Holocaust Museum. CREDIT: AP Photo/Alex Brandon During Tuesday’s press briefing, White House Press Secretary falsely claimed that Adolf Hitler never used chemical weapons on his own people and, in subsequent clarifications, continued to insist that Syrian President Bashar al-Assad’s use of chemical weapons was somehow worse. Members of Congress, most of whom are spending their recesses engaged at home with constituents, soon started issuing responses to Spicer’s comments. Most condemned the remarks and suggested Spicer needed some history lessons, perhaps from the United States Holocaust Museum, which is located just a few blocks from the White House. *Lawmakers marked with an asterisk have called for Spicer to lose his job. Sen. Ben Cardin (D-MD): Sen. Ed Markey (D-MA): *Rep. Donald Payne Jr. (D-NJ): *Rep. David Cicilline (D-RI): Rep. Kathleen Rice (D-NY): Rep. Adam Schiff (D-CA): Rep. Jamie Raskin (D-MD): Rep. Jerry Nadler (D-NY): Sen. Mazie Hirono (D-HI): Rep. John Yarmuth (D-KY): *House Minority Leader Nancy Pelosi (D-CA): Rep. Adriano Espaillat (D-NY): Rep. Jim McGovern (D-MA): Rep. Lucille Roybal-Allard (D-CA): Rep. Linda Sanchez (D-CA): Rep. Ted Deutch (D-FL): Rep. Dan Kildee (D-MI): So far, only Democratic lawmakers have responded to the comments. Congressional Republicans have been active on social media, though. For example, Rep. Larry Bucschon (R-IN) retweeted President Trump’s video congratulating Justice Neil Gorsuch, while Sen. Marco Rubio (R-FL) lent a helping hand to 16-year-old Carter Wilkerson, who is trying to get 18 million retweets so that Wendy’s will give him a year’s supply of chicken nuggets: This post has been updated. ", "child": "404_1\t404_2\t404_3\t404_4\t404_5\t404_6"}