{"name": "408", "parent": "", "title": "Arctic meltdown: Sea and land ice are cracking up at a record pace", "sentences": [{"83a3": "Arctic meltdown: Sea and land ice are cracking up at a record pace"}, {"37cc": "The images from the Arctic ice death spiral are haunting. The impacts will be terrifying."}, {"62ae": "Driven by warming air and water temperatures, Arctic sea ice continues its death spiral. A big new crack has been found in a major outlet glacier of the Greenland ice sheet, whose disintegration is speeding up."}, {"e50b": "Last month set records for the lowest Arctic sea ice extent ever in March, as well as the lowest sea ice volume and lowest sea ice thickness."}, {"d938": "Here is a chart of the volume of Arctic sea ice found at the end of every March since 1979. Not a pretty picture."}, {"fdd4": "The volume of sea ice at the end of March has dropped sharply since 1979. CREDIT: PIOMAS data plotted by Oren at the Arctic Sea Ice Forum."}, {"1e5a": "The Pan-Arctic Ice Ocean Modeling and Assimilation System (PIOMAS) at the University of Washington’s Polar Science Center provides monthly updates of Arctic sea ice volume. They using numerical modeling based on “observations from satellites, Navy submarines, moorings, and field measurements.”"}, {"54c1": "Here is their daily Arctic ice volume chart. The sea ice volume peaks in early spring and it hits its minimum in September. The 2017 numbers (in red) have set a record each month."}, {"11ea": "Shaded areas show one and two standard deviations from the 1979–2016 mean volume. CREDIT: PIOMAS"}, {"71c7": "Ice volume is determined by figuring out sea ice extent or surface area — and then factoring in the ice thickness."}, {"f503": "The National Snow and Ice Data Center (NSIDC) tracks sea ice extent with satellites, and this year has seen record lows set every month. Indeed, as this figure shows, sea ice extent has been unusually flat over the last three months, which is normally a time of significant refreezing."}, {"ddff": "CREDIT: NSIDC"}, {"6977": "“Arctic sea ice extent for March 2017 was the lowest in the satellite record for the month,” the NSIDC reported on Tuesday. “This month continues the record low conditions seen since October 2016.”"}, {"a948": "But not only has sea ice extent been setting records for months, so has sea ice thickness."}, {"2f52": "Average Arctic sea ice thickness (1 meter equals 39 inches). CREDIT: PIOMAS"}, {"2e5a": "Arctic sea ice is in a state of meltdown, and at some point soon will simply become too thin and fragmented to be called an “ice cap.”"}, {"c6dc": "Significantly, what happens in the Arctic does not stay in the Arctic. Arctic amplification drives more extreme weather in North America, while accelerating the defrosting of carbon-rich permafrost, which releases CO2 and methane that each cause faster warming — a dangerous amplifying feedback."}, {"8359": "Earth’s melting permafrost threatens to unleash a dangerous climate feedback loopNew permafrost study underscores the critical importance of ambitious climate targets, like the Paris agreement.thinkprogress.org"}, {"7a29": "In addition, as the sea ice disappears and Arctic warming speeds up, that causes faster melting of the land-based Greenland ice sheet, which in turn causes faster sea level rise. A recent study found that Greenland ice mass loss has tripled since 1997."}, {"5e3c": "So perhaps it’s not totally surprising that, as the Washington Post reported, “Scientists just found a strange and worrying crack in one of Greenland’s biggest glaciers.”"}, {"1641": "The implications of the ice cracking up at an accelerating rate are terrifying for humanity. The images created by it are haunting."}, {"d476": "NOTE: The top photo of Disko Bay, Greenland is titled “Broken Arches.” It’s by photographer Diane Tuff from her forthcoming book, “The Arctic Melt: Images of a Disappearing Landscape.” ThinkProgress’s Joe Romm wrote the foreword."}], "content": "Arctic meltdown: Sea and land ice are cracking up at a record pace The images from the Arctic ice death spiral are haunting. The impacts will be terrifying. Driven by warming air and water temperatures, Arctic sea ice continues its death spiral. A big new crack has been found in a major outlet glacier of the Greenland ice sheet, whose disintegration is speeding up. Last month set records for the lowest Arctic sea ice extent ever in March, as well as the lowest sea ice volume and lowest sea ice thickness. Here is a chart of the volume of Arctic sea ice found at the end of every March since 1979. Not a pretty picture. The volume of sea ice at the end of March has dropped sharply since 1979. CREDIT: PIOMAS data plotted by Oren at the Arctic Sea Ice Forum. The Pan-Arctic Ice Ocean Modeling and Assimilation System (PIOMAS) at the University of Washington’s Polar Science Center provides monthly updates of Arctic sea ice volume. They using numerical modeling based on “observations from satellites, Navy submarines, moorings, and field measurements.” Here is their daily Arctic ice volume chart. The sea ice volume peaks in early spring and it hits its minimum in September. The 2017 numbers (in red) have set a record each month. Shaded areas show one and two standard deviations from the 1979–2016 mean volume. CREDIT: PIOMAS Ice volume is determined by figuring out sea ice extent or surface area — and then factoring in the ice thickness. The National Snow and Ice Data Center (NSIDC) tracks sea ice extent with satellites, and this year has seen record lows set every month. Indeed, as this figure shows, sea ice extent has been unusually flat over the last three months, which is normally a time of significant refreezing. CREDIT: NSIDC “Arctic sea ice extent for March 2017 was the lowest in the satellite record for the month,” the NSIDC reported on Tuesday. “This month continues the record low conditions seen since October 2016.” But not only has sea ice extent been setting records for months, so has sea ice thickness. Average Arctic sea ice thickness (1 meter equals 39 inches). CREDIT: PIOMAS Arctic sea ice is in a state of meltdown, and at some point soon will simply become too thin and fragmented to be called an “ice cap.” Significantly, what happens in the Arctic does not stay in the Arctic. Arctic amplification drives more extreme weather in North America, while accelerating the defrosting of carbon-rich permafrost, which releases CO2 and methane that each cause faster warming — a dangerous amplifying feedback. Earth’s melting permafrost threatens to unleash a dangerous climate feedback loopNew permafrost study underscores the critical importance of ambitious climate targets, like the Paris agreement.thinkprogress.org In addition, as the sea ice disappears and Arctic warming speeds up, that causes faster melting of the land-based Greenland ice sheet, which in turn causes faster sea level rise. A recent study found that Greenland ice mass loss has tripled since 1997. So perhaps it’s not totally surprising that, as the Washington Post reported, “Scientists just found a strange and worrying crack in one of Greenland’s biggest glaciers.” The implications of the ice cracking up at an accelerating rate are terrifying for humanity. The images created by it are haunting. NOTE: The top photo of Disko Bay, Greenland is titled “Broken Arches.” It’s by photographer Diane Tuff from her forthcoming book, “The Arctic Melt: Images of a Disappearing Landscape.” ThinkProgress’s Joe Romm wrote the foreword. ", "child": "408_1\t408_2\t408_3\t408_4\t408_5\t408_6\t408_7\t408_8\t408_9\t408_10\t408_11\t408_12\t408_13\t408_14\t408_15\t408_16\t408_17\t408_18408_1\t408_2\t408_3\t408_4\t408_5\t408_6\t408_7\t408_8\t408_9\t408_10\t408_11\t408_12\t408_13\t408_14\t408_15\t408_16\t408_17\t408_18"}