{"name": "412", "parent": "", "title": "The little-known federal agency with the power to buck Trump’s anti-climate agenda", "sentences": [{"9870": "The little-known federal agency with the power to buck Trump’s anti-climate agenda"}, {"6d09": "With EPA under attack, clean energy advocates remain energized."}, {"98da": "Demonstrators protest outside the Federal Energy Regulatory Commission against gas pipelines and liquefied natural gas export terminals in Washington, D.C., on July 13, 2014. CREDIT: AP Photo/Jose Luis Magana"}, {"595a": "The nation’s primary energy regulatory agency has become a frequent target of environmentalists in recent years. They charge that the Federal Energy Regulatory Commission (FERC) is a rubber-stamp machine, approving every natural gas infrastructure project application it receives without consideration of the long-term climate impacts."}, {"bb7b": "But not every environmental and public advocacy group views the agency with such animosity. Some think FERC could in fact play an important role in combating climate change in an era when the Trump administration is gutting climate initiatives at the Environmental Protection Agency and other federal agencies, according to one regulatory expert."}, {"9537": "“The activists who are calling for FERC to be shut down and are against the nomination of three new commissioners are ignoring potential opportunities for some positive progress on climate initiatives,” Tyson Slocum, director of Public Citizen’s Energy Program, told ThinkProgress."}, {"b0d6": "The five-member commission has three openings that President Donald Trump will likely fill with Republicans or similarly-minded individuals."}, {"ee90": "Headquartered in Washington, D.C., FERC regulates the interstate transmission of natural gas, oil, and electricity and oversees the wholesale sale of electricity. The commission’s policies have played a major role in determining the extent to which renewable energy, energy storage, and energy efficiency are integrated into power markets."}, {"01d2": "“Even when these Republicans eventually join FERC, there is a chance FERC could chug along as an agency that could explore or even embrace regional climate change initiatives under the umbrella of wholesale power market reform,” Slocum explained."}, {"5293": "A high-voltage electric transmission line passes through a wind farm near Ellsworth, Kan. CREDIT: AP Photo/Charlie Riedel."}, {"6cd0": "The commission’s rules for ensuring grid reliability, especially in the eastern U.S. where utilities have banded together to form regional grid entities, increase costs for customers and often lead to the running of otherwise uneconomic coal-fired power plants, Slocum contended."}, {"5922": "The Sierra Club and other environmental groups are challenging FERC’s approval of structures proposed by regional grid operators that are “unduly preferential for outdated, inefficient technologies like coal and nuclear,” said Mark Kresowik, deputy director of Sierra Club’s Beyond Coal Campaign."}, {"e2a5": "With the eventual addition of three new commissioners, environmental and public interest groups hope FERC maintains a “good bipartisan tradition” in how it regulates the nation’s electric grid, said John Moore, director of the Sustainable FERC Project, a program housed at the Natural Resources Defense Council (NRDC)."}, {"573b": "Kresowik, who also serves as a member of the Sustainable FERC Project’s steering committee, agreed FERC has demonstrated independence over its history and expects that style of decision-making will continue when Trump’s nominees join the commission."}, {"bd1b": "“My basic message to the new FERC would be to keep up with the fast-changing grid,” Moore said. He hopes FERC, when it returns to a full five-person commission, will not impede progress to create a more reliable grid using clean energy resources. The Federal Power Act gives FERC plenty of authority and obligation to strike down barriers to clean energy integration, he said."}, {"c61d": "States such as New York and Illinois have moved in recent years to adopt policies aimed at fighting climate change and decarbonizing the electricity sector. FERC can help sustain these clean energy efforts by viewing them as complementary policies rather than ones that usurp the commission’s power, Moore said."}, {"a96f": "If FERC chooses to interfere in these efforts, however, the resulting uncertainty would have a “chilling effect on sound energy regulation, impeding the development and execution of clean energy policies,” NRDC said in a court brief filed this week in Illinois, similar to a “friend of the court” brief it filed in New York State in December."}, {"7e2c": "John Hanger, former secretary of the Pennsylvania Department of Environmental Protection under then-Gov. Ed Rendell (D), isn’t convinced FERC could be a climate savior, especially after Trump’s nominees fill the three vacant seats. There’s little reason to believe Trump will nominate anybody to the commission with the goal of fighting climate change, he said."}, {"8d6a": "“Count me skeptical on the idea that FERC would become an intentional helper in reducing greenhouse gas emissions,” Hanger said. “Its decisions might have that effect, but they would be completely independent of any concern about climate.”"}, {"0716": "The federalist views of some Republicans could mean that the clean energy state programs would be insulated from intensive federal review, he said. On the other hand, there are times when the Republican position is in favor of federal preemption. “I can’t find a principled position when Republicans favor federal preemption and when they don’t,” Hanger said."}, {"1b1d": "Demonstrators march for global action against climate change in New York City on September 21, 2014. CREDIT: ThinkProgress/Mark Hand"}, {"f837": "While others express skepticism about FERC’s role on fighting climate change, Slocum remains optimistic and was heartened by a parting statement issued by former FERC Chairman Norman Bay, who highlighted flaws in how the commission ensures multi-state grid operators procure capacity and energy in an equitable manner. In future proceedings, Slocum believes other commissioners may heed his advice on the value in reforming these markets."}, {"baf1": "“He’s 100 percent right. These capacity markets are terrible for consumers, they’re terrible for the environment. But they persist because some powerful interests within the private RTO structures make hundreds of millions of dollars. There are enormous amounts of money at stake here,” Slocum said."}, {"4c99": "But Slocum also laments Bay’s relatively short tenure as head of FERC, where he served as chairman from mid-2014 until his departure on February 3. “He was really a transformative chairman,” he said. “He was completely different from anyone we’ve had before. He initiated some very, very important but not well-known reforms. He wasn’t able to do everything that he wanted to do.”"}, {"1104": "Even as the commission is headed for a rightward political turn under Trump, opportunities still exist for the public to push the commission in a direction that could further reduce harmful power plant emissions, Slocum added."}, {"0c86": "Slocum views wholesale market reforms as more effective in fighting climate change than targeting gas infrastructure construction, but he doesn’t expect the commission to stray from its habit of green-lighting almost every natural gas pipeline and liquefied natural gas terminal application it receives. Over the past half-dozen years, activists have targeted the construction of pipelines as a way to put the brakes on the so-called shale gas revolution."}, {"b3fd": "Virginia county approves massive natural gas compressor over community outrageThe project is part of a 600-mile long pipeline that will reach from Pennsylvania to North Carolina.thinkprogress.org"}, {"4dbf": "“In the history of the agency, FERC has never rejected a natural gas application for an environmental reason,” said Aaron Mintzes, policy advocate for the environmental group Earthworks."}, {"8dd7": "Just before his departure from FERC, Bay also recommended the commission perform a programmatic review of natural gas production from the Marcellus and Utica Shales and, in connection with each new pipeline project, perform an assessment of the downstream impacts of gas use and a life-cycle greenhouse gas emissions study."}, {"1fdb": "“Norman is a good person in his heart,” Mintzes said. “That statement reflected a slow but important shift that the Federal Energy Regulatory Commission should make in the way it evaluates applications.”"}, {"b2a4": "Mintzes agreed with Slocum’s view on the commission’s regulation of wholesale power markets. “Real policy discussions do happen at FERC with respect to the electric power grid,” Mintzes said. “With respect to pipelines, nothing like that happens. It is a rubber stamp. That’s why it has to be politicized because it’s a captured agency funded by the industry where they’ve never denied a pipeline.”"}, {"18e5": "When FERC’s predecessor agency, the Federal Power Commission, was created under the Federal Power Act, Congress granted the agency a great deal of independence, noted Scott Edwards, an attorney and co-director of Food & Water Watch’s Food & Water Justice Project."}, {"14da": "At the time, lawmakers were unsure about granting an agency so much autonomy, especially if the agency failed to work on behalf of the American public."}, {"034a": "“The lawmakers said very specifically, ‘This is an experiment and we’ll have to revisit it soon to see if it is working and how it is working because we are giving this unprecedented lack of congressional oversight over an agency and this is a unique situation and this could be a disaster,” Edwards said."}, {"bcb0": "Dozens of people rally outside New Mexico Public Regulation Commission on Jan. 5, 2015, against coal-fired San Juan Generating Station. CREDIT: AP Photo/Susan Montoya Bryan."}, {"4d4e": "Slocum’s Public Citizen is trying to push FERC further in the direction of public advocacy. Public Citizen, along with 30 other consumer and environmental groups, submitted a petition for rulemaking for FERC to carry out the instructions issued by Congress — almost 40 years ago — to fund the work of an Office of Public Participation. Similar to how California provides public funding — known as intervenor compensation — in cases before the state Public Utilities Commission, FERC could do the same for public interest and environmental groups that would not otherwise have the means to get involved in cases at the federal level, according to Slocum."}, {"edf4": "Climate activists and consumer advocates could then afford to hire attorneys and expert witnesses to work on FERC cases that affect greenhouse gas emissions, potentially giving nonprofit groups and concerned citizens an opportunity to sway the commission in the direction of issuing orders and rulemakings that do not put clean energy at a disadvantage."}, {"4a3c": "“One awesome thing about the Federal Power Act is that it carves out opportunities for any individual or public interest group to request that FERC do something. And FERC has to respond,” Slocum said. “There is no other federal program like that that would pay public interest groups for their costs associated with intervening at a federal agency.”"}], "content": "The little-known federal agency with the power to buck Trump’s anti-climate agenda With EPA under attack, clean energy advocates remain energized. Demonstrators protest outside the Federal Energy Regulatory Commission against gas pipelines and liquefied natural gas export terminals in Washington, D.C., on July 13, 2014. CREDIT: AP Photo/Jose Luis Magana The nation’s primary energy regulatory agency has become a frequent target of environmentalists in recent years. They charge that the Federal Energy Regulatory Commission (FERC) is a rubber-stamp machine, approving every natural gas infrastructure project application it receives without consideration of the long-term climate impacts. But not every environmental and public advocacy group views the agency with such animosity. Some think FERC could in fact play an important role in combating climate change in an era when the Trump administration is gutting climate initiatives at the Environmental Protection Agency and other federal agencies, according to one regulatory expert. “The activists who are calling for FERC to be shut down and are against the nomination of three new commissioners are ignoring potential opportunities for some positive progress on climate initiatives,” Tyson Slocum, director of Public Citizen’s Energy Program, told ThinkProgress. The five-member commission has three openings that President Donald Trump will likely fill with Republicans or similarly-minded individuals. Headquartered in Washington, D.C., FERC regulates the interstate transmission of natural gas, oil, and electricity and oversees the wholesale sale of electricity. The commission’s policies have played a major role in determining the extent to which renewable energy, energy storage, and energy efficiency are integrated into power markets. “Even when these Republicans eventually join FERC, there is a chance FERC could chug along as an agency that could explore or even embrace regional climate change initiatives under the umbrella of wholesale power market reform,” Slocum explained. A high-voltage electric transmission line passes through a wind farm near Ellsworth, Kan. CREDIT: AP Photo/Charlie Riedel. The commission’s rules for ensuring grid reliability, especially in the eastern U.S. where utilities have banded together to form regional grid entities, increase costs for customers and often lead to the running of otherwise uneconomic coal-fired power plants, Slocum contended. The Sierra Club and other environmental groups are challenging FERC’s approval of structures proposed by regional grid operators that are “unduly preferential for outdated, inefficient technologies like coal and nuclear,” said Mark Kresowik, deputy director of Sierra Club’s Beyond Coal Campaign. With the eventual addition of three new commissioners, environmental and public interest groups hope FERC maintains a “good bipartisan tradition” in how it regulates the nation’s electric grid, said John Moore, director of the Sustainable FERC Project, a program housed at the Natural Resources Defense Council (NRDC). Kresowik, who also serves as a member of the Sustainable FERC Project’s steering committee, agreed FERC has demonstrated independence over its history and expects that style of decision-making will continue when Trump’s nominees join the commission. “My basic message to the new FERC would be to keep up with the fast-changing grid,” Moore said. He hopes FERC, when it returns to a full five-person commission, will not impede progress to create a more reliable grid using clean energy resources. The Federal Power Act gives FERC plenty of authority and obligation to strike down barriers to clean energy integration, he said. States such as New York and Illinois have moved in recent years to adopt policies aimed at fighting climate change and decarbonizing the electricity sector. FERC can help sustain these clean energy efforts by viewing them as complementary policies rather than ones that usurp the commission’s power, Moore said. If FERC chooses to interfere in these efforts, however, the resulting uncertainty would have a “chilling effect on sound energy regulation, impeding the development and execution of clean energy policies,” NRDC said in a court brief filed this week in Illinois, similar to a “friend of the court” brief it filed in New York State in December. John Hanger, former secretary of the Pennsylvania Department of Environmental Protection under then-Gov. Ed Rendell (D), isn’t convinced FERC could be a climate savior, especially after Trump’s nominees fill the three vacant seats. There’s little reason to believe Trump will nominate anybody to the commission with the goal of fighting climate change, he said. “Count me skeptical on the idea that FERC would become an intentional helper in reducing greenhouse gas emissions,” Hanger said. “Its decisions might have that effect, but they would be completely independent of any concern about climate.” The federalist views of some Republicans could mean that the clean energy state programs would be insulated from intensive federal review, he said. On the other hand, there are times when the Republican position is in favor of federal preemption. “I can’t find a principled position when Republicans favor federal preemption and when they don’t,” Hanger said. Demonstrators march for global action against climate change in New York City on September 21, 2014. CREDIT: ThinkProgress/Mark Hand While others express skepticism about FERC’s role on fighting climate change, Slocum remains optimistic and was heartened by a parting statement issued by former FERC Chairman Norman Bay, who highlighted flaws in how the commission ensures multi-state grid operators procure capacity and energy in an equitable manner. In future proceedings, Slocum believes other commissioners may heed his advice on the value in reforming these markets. “He’s 100 percent right. These capacity markets are terrible for consumers, they’re terrible for the environment. But they persist because some powerful interests within the private RTO structures make hundreds of millions of dollars. There are enormous amounts of money at stake here,” Slocum said. But Slocum also laments Bay’s relatively short tenure as head of FERC, where he served as chairman from mid-2014 until his departure on February 3. “He was really a transformative chairman,” he said. “He was completely different from anyone we’ve had before. He initiated some very, very important but not well-known reforms. He wasn’t able to do everything that he wanted to do.” Even as the commission is headed for a rightward political turn under Trump, opportunities still exist for the public to push the commission in a direction that could further reduce harmful power plant emissions, Slocum added. Slocum views wholesale market reforms as more effective in fighting climate change than targeting gas infrastructure construction, but he doesn’t expect the commission to stray from its habit of green-lighting almost every natural gas pipeline and liquefied natural gas terminal application it receives. Over the past half-dozen years, activists have targeted the construction of pipelines as a way to put the brakes on the so-called shale gas revolution. Virginia county approves massive natural gas compressor over community outrageThe project is part of a 600-mile long pipeline that will reach from Pennsylvania to North Carolina.thinkprogress.org “In the history of the agency, FERC has never rejected a natural gas application for an environmental reason,” said Aaron Mintzes, policy advocate for the environmental group Earthworks. Just before his departure from FERC, Bay also recommended the commission perform a programmatic review of natural gas production from the Marcellus and Utica Shales and, in connection with each new pipeline project, perform an assessment of the downstream impacts of gas use and a life-cycle greenhouse gas emissions study. “Norman is a good person in his heart,” Mintzes said. “That statement reflected a slow but important shift that the Federal Energy Regulatory Commission should make in the way it evaluates applications.” Mintzes agreed with Slocum’s view on the commission’s regulation of wholesale power markets. “Real policy discussions do happen at FERC with respect to the electric power grid,” Mintzes said. “With respect to pipelines, nothing like that happens. It is a rubber stamp. That’s why it has to be politicized because it’s a captured agency funded by the industry where they’ve never denied a pipeline.” When FERC’s predecessor agency, the Federal Power Commission, was created under the Federal Power Act, Congress granted the agency a great deal of independence, noted Scott Edwards, an attorney and co-director of Food & Water Watch’s Food & Water Justice Project. At the time, lawmakers were unsure about granting an agency so much autonomy, especially if the agency failed to work on behalf of the American public. “The lawmakers said very specifically, ‘This is an experiment and we’ll have to revisit it soon to see if it is working and how it is working because we are giving this unprecedented lack of congressional oversight over an agency and this is a unique situation and this could be a disaster,” Edwards said. Dozens of people rally outside New Mexico Public Regulation Commission on Jan. 5, 2015, against coal-fired San Juan Generating Station. CREDIT: AP Photo/Susan Montoya Bryan. Slocum’s Public Citizen is trying to push FERC further in the direction of public advocacy. Public Citizen, along with 30 other consumer and environmental groups, submitted a petition for rulemaking for FERC to carry out the instructions issued by Congress — almost 40 years ago — to fund the work of an Office of Public Participation. Similar to how California provides public funding — known as intervenor compensation — in cases before the state Public Utilities Commission, FERC could do the same for public interest and environmental groups that would not otherwise have the means to get involved in cases at the federal level, according to Slocum. Climate activists and consumer advocates could then afford to hire attorneys and expert witnesses to work on FERC cases that affect greenhouse gas emissions, potentially giving nonprofit groups and concerned citizens an opportunity to sway the commission in the direction of issuing orders and rulemakings that do not put clean energy at a disadvantage. “One awesome thing about the Federal Power Act is that it carves out opportunities for any individual or public interest group to request that FERC do something. And FERC has to respond,” Slocum said. “There is no other federal program like that that would pay public interest groups for their costs associated with intervening at a federal agency.” ", "child": "412_1\t412_2"}