{"name": "413", "parent": "", "title": "Goodbye America", "sentences": [{"b000": "Goodbye America"}, {"8bea": "I’m emigrating away from the United States today, but that’s not the only reason I’m saying “goodbye”. Today I’m paying my respects to the idea of “American Exceptionalism”, because to me, “Make America Great Again” represents the final nail in its coffin."}, {"ed83": "What made America great — and I do believe it has been — was the restless and hard-fought pursuit of progress. Despite huge inertia, there was a determination to adapt to a changing country in a changing world, with governance informed in large part by science, reason and fairness."}, {"f721": "What makes “Make America Great Again” so sadly ironic is that by reversing direction on 220 years of carefully-considered incremental progress, they are ensuring that America won’t be great again, for decades to come."}, {"6e71": "A lot of my friends who are from or who live in the US are much more optimistic than I am. They tell me that I should trust the checks-and-balances that are enshrined in the constitution. They remind me that part of the role of the legislative and judicial branches is to rein-in a rampant executive branch. My friends are convinced that the public backlash and growing resistance movement will make the country stronger and better in the long run. And I’ve been repeatedly assured that the electoral pendulum will swing back to the left, in an equal and opposite reaction to the extreme rightward swing we are currently experiencing."}, {"f899": "But all of these rationales for optimism ignore a very important distinction: whereas those whose politics are grounded in science, reason and fairness tend to act in ways that are similarly constrained by science, reason and fairness, the same is not true of those whose politics take root in greed and God. Liberals are almost never willing to go as far or to employ tactics as extreme as Conservatives are, in pursuit of their goals."}, {"502c": "There is a fundamental false equivalency at play in US politics, which is that the Republicans and Democrats are as bad as each other. We must dispense with this fallacy."}, {"5360": "If you look across all levels of government, it’s clear that Democrats are consistently losing out to Republicans, because Republicans are more willing to cheat and lie, to appeal to bigotry and to use church-aligned positions on polarizing social issues to trick people into voting against their own interests."}, {"9267": "Yes, Democrats are almost as beholden to corporate special interests as their Republican counterparts, but that’s because they’re playing catchup. It was Republicans that pushed through the bills that unshackled lobbyists and lifted limits on corporate campaign contributions. It was the conservative majority on the Supreme Court that upheld Citizens United. And nothing the modern Democratic Party has done comes close to the conniving voter disenfranchisement efforts that Republicans continue to pursue. From draconian voter ID laws and a racially-biased criminal justice system, to electoral district gerrymandering, the GOP has cemented an unfair advantage that makes it very difficult for Democrats to compete at the polls. All this, despite Democrats advocating legislative policy that is demonstrably fairer and measurably better for the vast majority of people, than that offered by Republicans."}, {"e72b": "Meanwhile Trump is like King Midas — except that everything he touches turns to shit. And, like the spoilt toddler that he is, he touches everything."}, {"9568": "So far it’s been two months of “unpresidented” scandals and screw-ups, nepotism and despotism, and there’s no indication of him being capable of acting any other way."}, {"2dec": "And yes, he has been checked-and-balanced, to a certain extent. Federal judges have thus far blocked two Muslim bans and when push came to shove, even congressional Republicans couldn’t bring themselves to kick 24 million Americans off health care. My more optimistic friends like to point out that all this “winning” has resulted in plummeting approval ratings and has inspired a very visible protest movement. Even the shamelessly Republican-friendly Fox News doesn’t wholeheartedly support his words and deeds. I must admit, I have taken some solace in the depth and breadth of resistance."}, {"6197": "We pat ourselves on the back, cheering every small victory and prematurely proclaiming that people power works. But while we’re battling the most blatant outrages — the Russian doll that is the Russia scandal, a string of racist executive orders as long as a clown’s handkerchief and a wall that Mexico definitely won’t pay for — this administration has been quietly steering America into decline and condemning humanity to extinction. This flailing and incoherent regime is succeeding at least in distracting nearly everyone from the headlong pursuit of one of their more predictable policy initiatives, climate change denial — mortgaging the future of the planet for short term profit."}, {"edb7": "The overwhelming majority of Americans accept the consensus of the scientific community, that climate change is a phenomenon being driven by human activity. The effects of climate change on our weather patterns are plain for all to see and the devastating impact of rising sea levels is blindingly obvious. Even if one genuinely believes that all of this could have happened without human influence, choosing not to do anything about it is nothing short of criminal negligence."}, {"497f": "Climate change represents an existential crisis for our civilization and our species. Pretending and acting otherwise should be recognized for what it is: a crime against humanity."}, {"aead": "It seems like a geological age ago that the Obama administration took America’s first tentative steps in the right direction, acknowledging and pledging action on climate change. Had a Democrat been elected to replace him as president, there is every reason to believe that further, more aggressive steps would have been taken and that the impending climate disaster would have at least been mitigated, if not averted."}, {"2e27": "But the Republican Party has long played the role of an inverse Robin Hood — stealing from the poor to give to the rich. In previous administrations they’ve hidden their motives behind discredited ruses like “trickle-down economics”. This time around it’s “jobs over climate”, which is a particularly cynical sleight-of-hand, misrepresenting a last ditch money grab by the fossil fuel industry as something of benefit to those who stand to lose the most."}, {"5a8d": "Let’s use the Congressional Budget Office’s assessment of TRyancare as a benchmark."}, {"43fa": "Even if the AHCA had passed and 24 million people had lost their health insurance; even if every one of those people had died, it would still pale in comparison to the global death toll which is now all-but-inevitable, thanks to the acceleration of climate change that this administration has institutionalized."}, {"80ac": "I, for one, won’t stand by while my tax dollars contribute to this future-cide. Being a foreigner, I didn’t get to vote, but in the run-up to the election I did everything I could think of to try and sway likely Trump voters and to motivate ambivalent Hillary voters. When the wrong outcome resulted, I poured a lot of effort into resisting: going to all the marches, petitioning the White House and foreign governments, launching social media and crowdfunding campaigns, writing and sharing my thoughts in prose and poetry."}, {"e78c": "But at every turn I was met with resignation and apathy. My more optimistic friends still maintain their confidence that everything will work itself out. To them I say this: trusting in political institutions to fix the Trump problem is as irresponsible as trusting in God to fix the climate problem. And soon enough my friends will have to pull their heads out of the sand, to start filling sand bags."}, {"225f": "My only remaining option to exert some small measure of influence is to leave the country, thereby withdrawing my contribution to the economy, denying the government my tax dollars and absolving myself from complicity. And, on the plus side, for everyone who leaves, a bit less electricity is needed; a bit less coal is burned; a bit less poisonous sludge is dumped into the rivers."}, {"e23e": "I will, of course, continue resisting from outside, but when I look back on this turning point in human history, I don’t want to wonder if there was something more I could have done."}, {"eac4": "Goodbye America."}], "content": "Goodbye America I’m emigrating away from the United States today, but that’s not the only reason I’m saying “goodbye”. Today I’m paying my respects to the idea of “American Exceptionalism”, because to me, “Make America Great Again” represents the final nail in its coffin. What made America great — and I do believe it has been — was the restless and hard-fought pursuit of progress. Despite huge inertia, there was a determination to adapt to a changing country in a changing world, with governance informed in large part by science, reason and fairness. What makes “Make America Great Again” so sadly ironic is that by reversing direction on 220 years of carefully-considered incremental progress, they are ensuring that America won’t be great again, for decades to come. A lot of my friends who are from or who live in the US are much more optimistic than I am. They tell me that I should trust the checks-and-balances that are enshrined in the constitution. They remind me that part of the role of the legislative and judicial branches is to rein-in a rampant executive branch. My friends are convinced that the public backlash and growing resistance movement will make the country stronger and better in the long run. And I’ve been repeatedly assured that the electoral pendulum will swing back to the left, in an equal and opposite reaction to the extreme rightward swing we are currently experiencing. But all of these rationales for optimism ignore a very important distinction: whereas those whose politics are grounded in science, reason and fairness tend to act in ways that are similarly constrained by science, reason and fairness, the same is not true of those whose politics take root in greed and God. Liberals are almost never willing to go as far or to employ tactics as extreme as Conservatives are, in pursuit of their goals. There is a fundamental false equivalency at play in US politics, which is that the Republicans and Democrats are as bad as each other. We must dispense with this fallacy. If you look across all levels of government, it’s clear that Democrats are consistently losing out to Republicans, because Republicans are more willing to cheat and lie, to appeal to bigotry and to use church-aligned positions on polarizing social issues to trick people into voting against their own interests. Yes, Democrats are almost as beholden to corporate special interests as their Republican counterparts, but that’s because they’re playing catchup. It was Republicans that pushed through the bills that unshackled lobbyists and lifted limits on corporate campaign contributions. It was the conservative majority on the Supreme Court that upheld Citizens United. And nothing the modern Democratic Party has done comes close to the conniving voter disenfranchisement efforts that Republicans continue to pursue. From draconian voter ID laws and a racially-biased criminal justice system, to electoral district gerrymandering, the GOP has cemented an unfair advantage that makes it very difficult for Democrats to compete at the polls. All this, despite Democrats advocating legislative policy that is demonstrably fairer and measurably better for the vast majority of people, than that offered by Republicans. Meanwhile Trump is like King Midas — except that everything he touches turns to shit. And, like the spoilt toddler that he is, he touches everything. So far it’s been two months of “unpresidented” scandals and screw-ups, nepotism and despotism, and there’s no indication of him being capable of acting any other way. And yes, he has been checked-and-balanced, to a certain extent. Federal judges have thus far blocked two Muslim bans and when push came to shove, even congressional Republicans couldn’t bring themselves to kick 24 million Americans off health care. My more optimistic friends like to point out that all this “winning” has resulted in plummeting approval ratings and has inspired a very visible protest movement. Even the shamelessly Republican-friendly Fox News doesn’t wholeheartedly support his words and deeds. I must admit, I have taken some solace in the depth and breadth of resistance. We pat ourselves on the back, cheering every small victory and prematurely proclaiming that people power works. But while we’re battling the most blatant outrages — the Russian doll that is the Russia scandal, a string of racist executive orders as long as a clown’s handkerchief and a wall that Mexico definitely won’t pay for — this administration has been quietly steering America into decline and condemning humanity to extinction. This flailing and incoherent regime is succeeding at least in distracting nearly everyone from the headlong pursuit of one of their more predictable policy initiatives, climate change denial — mortgaging the future of the planet for short term profit. The overwhelming majority of Americans accept the consensus of the scientific community, that climate change is a phenomenon being driven by human activity. The effects of climate change on our weather patterns are plain for all to see and the devastating impact of rising sea levels is blindingly obvious. Even if one genuinely believes that all of this could have happened without human influence, choosing not to do anything about it is nothing short of criminal negligence. Climate change represents an existential crisis for our civilization and our species. Pretending and acting otherwise should be recognized for what it is: a crime against humanity. It seems like a geological age ago that the Obama administration took America’s first tentative steps in the right direction, acknowledging and pledging action on climate change. Had a Democrat been elected to replace him as president, there is every reason to believe that further, more aggressive steps would have been taken and that the impending climate disaster would have at least been mitigated, if not averted. But the Republican Party has long played the role of an inverse Robin Hood — stealing from the poor to give to the rich. In previous administrations they’ve hidden their motives behind discredited ruses like “trickle-down economics”. This time around it’s “jobs over climate”, which is a particularly cynical sleight-of-hand, misrepresenting a last ditch money grab by the fossil fuel industry as something of benefit to those who stand to lose the most. Let’s use the Congressional Budget Office’s assessment of TRyancare as a benchmark. Even if the AHCA had passed and 24 million people had lost their health insurance; even if every one of those people had died, it would still pale in comparison to the global death toll which is now all-but-inevitable, thanks to the acceleration of climate change that this administration has institutionalized. I, for one, won’t stand by while my tax dollars contribute to this future-cide. Being a foreigner, I didn’t get to vote, but in the run-up to the election I did everything I could think of to try and sway likely Trump voters and to motivate ambivalent Hillary voters. When the wrong outcome resulted, I poured a lot of effort into resisting: going to all the marches, petitioning the White House and foreign governments, launching social media and crowdfunding campaigns, writing and sharing my thoughts in prose and poetry. But at every turn I was met with resignation and apathy. My more optimistic friends still maintain their confidence that everything will work itself out. To them I say this: trusting in political institutions to fix the Trump problem is as irresponsible as trusting in God to fix the climate problem. And soon enough my friends will have to pull their heads out of the sand, to start filling sand bags. My only remaining option to exert some small measure of influence is to leave the country, thereby withdrawing my contribution to the economy, denying the government my tax dollars and absolving myself from complicity. And, on the plus side, for everyone who leaves, a bit less electricity is needed; a bit less coal is burned; a bit less poisonous sludge is dumped into the rivers. I will, of course, continue resisting from outside, but when I look back on this turning point in human history, I don’t want to wonder if there was something more I could have done. Goodbye America. ", "child": "413_1\t413_2\t413_3\t413_4\t413_5\t413_6\t413_7\t413_8\t413_9\t413_10\t413_11\t413_12\t413_13\t413_14\t413_15\t413_16\t413_17\t413_18\t413_19\t413_20\t413_21\t413_22\t413_23\t413_24\t413_25"}