{"name": "425", "parent": "", "title": "The real story everyone missed while they were paying attention to Amal Clooney’s baby bump", "sentences": [{"1bdf": "The real story everyone missed while they were paying attention to Amal Clooney’s baby bump"}, {"a9a5": "“My words, tears, and my testimony have not made you act. I wonder whether there is any point in continuing my campaign at all.”"}, {"b548": "Nadia Murad on Nov. 14, 2016, in Los Angeles. CREDIT: Photo by Jordan Strauss/Invision/AP"}, {"8f6e": "On Thursday, Nadia Murad stood before the United Nations Security Council to give an impassioned speech about the brutality that she and other Yazidis have experienced under the ISIS militant group."}, {"e705": "“For over a year and a half now, I have been travelling around the world to give testimony on ISIS’ brutality and the crimes they committed against me personally, and against my people,” the 23-year-old Yazidi victim of ISIS said, according to her prepared remarks."}, {"6c1e": "“My words, tears, and my testimony have not made you act,” Murad said. “I wonder whether there is any point in continuing my campaign at all.”"}, {"8845": "She added that she was disappointed that no ISIS militants had been brought to justice for committing genocide or for war crimes against her and other Iraqis, and pleaded for the United Nations to begin an investigation."}, {"9ef1": "“I cannot understand what is taking so long,” Murad said. “I cannot understand why you are letting ISIS get away with it, or what more you need to hear before you will act. So today I ask the Iraqi government and the UN to establish an investigation and give all victims of ISIS the justice they deserve.”"}, {"9770": "Murad was right. Americans didn’t hear her. That’s because people decided to focus in on another woman in close proximity to her: Amal Clooney, an internationally renowned human rights lawyer and the wife of a Hollywood big shot who is currently pregnant with twins."}, {"d6fb": "Here’s how People Magazine headlined its story about the speech:"}, {"74ec": "People Magazine led with this headline. CREDIT: Screenshot"}, {"cc6c": "Entertainment Tonight also took a lighthearted approach that negated the purpose of the speech and focused on Clooney’s canary color dress."}, {"c01e": "CREDIT: Screenshot"}, {"a786": "Time Magazine, which in 2015 conducted a very good, insightful interview with Murad, also tweeted about Clooney’s baby bump."}, {"aebe": "CREDIT: Screenshot"}, {"b680": "The Sun, a United Kingdom tabloid, went for the triple whammy. It not only identified Clooney by focusing on her husband’s professional credentials, but also put details about the humans she is carrying and the dress she was wearing ahead of her professional credentials."}, {"fde7": "CREDIT: Screenshot"}, {"98a8": "The Today Show was close to tweeting out substantive information about ISIS and genocide, but still felt compelled to include Clooney’s pregnancy in its video captions."}, {"274d": "CREDIT: Screenshot"}, {"b746": "Some media outlets correctly observed that Clooney was at the United Nations to speak on behalf of vulnerable victims. But they also allowed Clooney’s star power to overshadow Murad’s accomplishments and primary purpose for being there."}, {"9377": "Though Murad’s own accomplishments weren’t highlighted in the mainstream media, they are numerous. Murad was a candidate for the 2016 Nobel Peace Prize; is a Goodwill Ambassador for the Dignity of Survivors of Human Trafficking of the United Nations; was awarded the Council of Europe Vaclav Havel Award for Human Rights; and was awarded the Sakharov Prize for Freedom of Thought."}, {"2c1f": "There’s a reason why these media outlets deserve to be criticized for their coverage of the U.N. speech. What’s going on in Iraq is no joke."}, {"c6ae": "Murad’s plea for attention comes one week after ISIS militants were accused of using a chemical attack to wrest control of Mosul from Iraqi forces — the fourth such attack since September 2016. Things are increasingly complex and dangerous for civilians in Iraq. On the one hand, ISIS is raping and killing some people. On the other hand, Iraqi forces are holding suspected “ISIS families,” or people remotely affiliated with ISIS militants, against their will in a camp that is essentially an open-air prison."}, {"22d1": "On Friday, Aris Messinis, the chief photographer with the Agence France-Presse Athens bureau, tweeted about the heartbreaking conditions in Mosul as Iraqi forces continue to fight Islamic State militants in western Mosul."}, {"5338": "Still, at least now we know the answer to this riddle: If humans are continually wiped out of existence in Iraq and a celebrity is pregnant in America, you can get the dress that George Clooney’s wife wore in yellow."}], "content": "The real story everyone missed while they were paying attention to Amal Clooney’s baby bump “My words, tears, and my testimony have not made you act. I wonder whether there is any point in continuing my campaign at all.” Nadia Murad on Nov. 14, 2016, in Los Angeles. CREDIT: Photo by Jordan Strauss/Invision/AP On Thursday, Nadia Murad stood before the United Nations Security Council to give an impassioned speech about the brutality that she and other Yazidis have experienced under the ISIS militant group. “For over a year and a half now, I have been travelling around the world to give testimony on ISIS’ brutality and the crimes they committed against me personally, and against my people,” the 23-year-old Yazidi victim of ISIS said, according to her prepared remarks. “My words, tears, and my testimony have not made you act,” Murad said. “I wonder whether there is any point in continuing my campaign at all.” She added that she was disappointed that no ISIS militants had been brought to justice for committing genocide or for war crimes against her and other Iraqis, and pleaded for the United Nations to begin an investigation. “I cannot understand what is taking so long,” Murad said. “I cannot understand why you are letting ISIS get away with it, or what more you need to hear before you will act. So today I ask the Iraqi government and the UN to establish an investigation and give all victims of ISIS the justice they deserve.” Murad was right. Americans didn’t hear her. That’s because people decided to focus in on another woman in close proximity to her: Amal Clooney, an internationally renowned human rights lawyer and the wife of a Hollywood big shot who is currently pregnant with twins. Here’s how People Magazine headlined its story about the speech: People Magazine led with this headline. CREDIT: Screenshot Entertainment Tonight also took a lighthearted approach that negated the purpose of the speech and focused on Clooney’s canary color dress. CREDIT: Screenshot Time Magazine, which in 2015 conducted a very good, insightful interview with Murad, also tweeted about Clooney’s baby bump. CREDIT: Screenshot The Sun, a United Kingdom tabloid, went for the triple whammy. It not only identified Clooney by focusing on her husband’s professional credentials, but also put details about the humans she is carrying and the dress she was wearing ahead of her professional credentials. CREDIT: Screenshot The Today Show was close to tweeting out substantive information about ISIS and genocide, but still felt compelled to include Clooney’s pregnancy in its video captions. CREDIT: Screenshot Some media outlets correctly observed that Clooney was at the United Nations to speak on behalf of vulnerable victims. But they also allowed Clooney’s star power to overshadow Murad’s accomplishments and primary purpose for being there. Though Murad’s own accomplishments weren’t highlighted in the mainstream media, they are numerous. Murad was a candidate for the 2016 Nobel Peace Prize; is a Goodwill Ambassador for the Dignity of Survivors of Human Trafficking of the United Nations; was awarded the Council of Europe Vaclav Havel Award for Human Rights; and was awarded the Sakharov Prize for Freedom of Thought. There’s a reason why these media outlets deserve to be criticized for their coverage of the U.N. speech. What’s going on in Iraq is no joke. Murad’s plea for attention comes one week after ISIS militants were accused of using a chemical attack to wrest control of Mosul from Iraqi forces — the fourth such attack since September 2016. Things are increasingly complex and dangerous for civilians in Iraq. On the one hand, ISIS is raping and killing some people. On the other hand, Iraqi forces are holding suspected “ISIS families,” or people remotely affiliated with ISIS militants, against their will in a camp that is essentially an open-air prison. On Friday, Aris Messinis, the chief photographer with the Agence France-Presse Athens bureau, tweeted about the heartbreaking conditions in Mosul as Iraqi forces continue to fight Islamic State militants in western Mosul. Still, at least now we know the answer to this riddle: If humans are continually wiped out of existence in Iraq and a celebrity is pregnant in America, you can get the dress that George Clooney’s wife wore in yellow. ", "child": "425_1\t425_2\t425_3"}