{"name": "429", "parent": "", "title": "5 countries that could do more for refugees", "sentences": [{"6ee5": "5 countries that could do more for refugees"}, {"628b": "U.N. member states convened in New York City this week to address a global refugee crisis that has displaced 65.3 million people and sent hundreds of thousands of people across oceans and borders. These member states, including the United States, are expected to adopt a broad refugee draft that would deal with resettlement issues."}, {"7c3f": "But in the lead up to the summit, member states have removed a “Global Compact on Refugees” clause — a commitment that calls on international governments to take in 10 percent of refugees annually. World leaders will instead discuss a “watered-down” declaration with proposals that do not include “concrete responsibility-sharing measures,” the human rights group Amnesty International charged."}, {"0346": "Many host countries already shoulder the burden of taking in refugees. And moving forward, Canada announced on Monday that it would increase humanitarian assistance by 10 percent and will commit to a $64.5 million multi-year funding to support people affected by humanitarian crises around the world. But there are many other governments that have given excuses and shirked responsibility to resettle refugees."}, {"da02": "Here are five countries that could commit to doing more after the U.N. meeting:"}, {"dfde": "1. United States of America"}, {"01ec": "A U.S. Border Patrol agent drives near the U.S.-Mexico border fence in Sunland Park, N.M. CREDIT: AP Photo/Russell Contreras, File"}, {"74f0": "A growing refugee crisis on the southern U.S. border with Mexico began in late 2013, when a large increase of Central American children began showing up and surrendering to U.S. border agents, some of whom were running from violence and persecution. Many children have asked for humanitarian relief, in the form of refugee or asylum status, but not everyone who applied for refugee status got a fair shot to present their case in immigration court."}, {"053c": "The United States is the world’s largest donor of humanitarian assistance and refugee relief, but it has been very slow to acknowledge that a current refugee crisis was happening in Central America until now. It was only early this year when U.S. Secretary of State John Kerry said that the United States would increase the number of refugees admitted from El Salvador, Honduras, and Guatemala — the three “Northern Triangle” countries that are currently embroiled in increasing gang violence and extreme poverty."}, {"401c": "“Rounding up and detaining refugees will undoubtedly lead to the re-victimization of refugee families fleeing gang warfare and drug violence,” Rep. Judy Chu (D-CA) said in May. “They deserve due process and a fair day in court with access to appropriate language services as needed. We should help these refugees by offering them government provided attorneys rather than returning them to peril or even death.”"}, {"0a02": "2. Hungary"}, {"d970": "Children stand in a tent inside a migrant camp at Serbia’s border with Hungary, in Horgos, Serbia, Monday, July 11, 2016. CREDIT: AP Photo/Marko Drobnjakovic"}, {"ad0c": "Hungary became a flash-point in the European Union refugee crisis when people streamed in through the so-called western Balkan refugee route on their way into other E.U. nations. In September 2015, the country cracked down hard on “irregular migration,” setting up razor wire fences and sealing shut entry points except for a theoretical no-man’s land, or a “transit zone,” on Hungarian soil where people are forced to apply for refugee status without actually stepping foot into the country. There are effectively four of these points: two along Serbia and two along Croatia in the south."}, {"1c7d": "“The Hungarian government is pretending that it’s not on Hungarian soil, but it is on Hungarian soil, therefore the law should apply,” Orsolya Jeney, Director of Amnesty International in Hungary, told ThinkProgress in an interview."}, {"f139": "Hungarian Prime Minister Viktor Orban has previously called migrants “poison,” adding that “whoever needs migrants can take them, but don’t force them on us, we don’t need them.” Orban and other Hungarian officials have condemned the distribution of refugees and migrants among E.U. countries, insisting that it would commit to zero resettlement."}, {"ec51": "According to Amnesty International, Hungarian officials regularly violated international law in its treatment of refugees who ask for humanitarian protection. Officials have reportedly turned people away to Serbia and have even beat refugees and migrants, a process that has drawn the ire of the Luxembourg foreign minister who wants Hungary to be kicked out of the European Union."}, {"85b2": "“What we feared became reality,” Jeney added, explaining that the country has only accepted 300 refugee applications this year. “About 80 percent of [the] Hungarian public is against refugees… The refugees have been dehumanized and they are being portrayed as ‘them,’ like a bunch of illegal people who are here to take our jobs and who are going to threaten our lives. Unfortunately the hate propaganda is working and harmful.”"}, {"e107": "3. Kenya"}, {"d734": "Somali refugees walk through an area housing new arrivals, on the outskirts of Hagadera Camp outside Dadaab, Kenya, Saturday July 9, 2011. CREDIT: AP Photo/Rebecca Blackwell, File"}, {"c7d2": "The Kenyan government announced plans in May to shut down two of its largest refugee camps in Dadaab by the end of the year. The move would affect upwards of 300,000 people, mostly from Somalia and South Sudan. The government cited economy and national security concerns for the closure, insisting that it would voluntarily return refugees through a repatriation process that ensures the safe return of refugees back to their countries."}, {"8131": "Advocacy groups have said voluntary repatriation has not happened. Instead, refugees are afraid that they would get deported anyway and forfeit a $400 (£300) U.N. cash grant in the meantime."}, {"2033": "“Our team went to the refugee camp two weeks ago and they confirmed that there are people who are coerced and pushed out — it is not voluntary repatriation,” Justus Nyang’aya, Amnesty International Kenya Section Director, told ThinkProgress in an interview. “A number of people …went to Somalia, but they are coming back because some of them are being recruited to Al-Shabaab [an Al-Qaeda affiliate in Somalia]. Some of them are [also] being threatened.”"}, {"df5f": "Because Kenya disbanded its Department of Refugee Affairs — the official office that gives out special movement passes to refugees to travel outside — people who come back can no longer register as refugees and do not receive the same kind of security as other refugees, Nyang’aya said."}, {"682f": "“The problem is that the government is talking about voluntary repatriation in keeping with international law so that they don’t violate the principle, but if they put a timeline of November 30 and saying ‘you need to leave,’ they’re actually deporting them,” Nyang’aya explained."}, {"b9e6": "Some advocates believe that the Kenyan government’s rationale to close the camps because of terrorism concerns has been overhyped. There has not been any credible evidence linking Somali refugees to any terrorist attacks in Kenya, the human rights group Human Rights Watch reported."}, {"11df": "“We are saying, you have the security operators, please identify those refugees and others that are creating problems for others and arrest them and prosecute them,” Nyang’aya added. “But what we have found that some of the people terrorizing Kenyans are Kenyans themselves.”"}, {"3f4c": "4. Australia"}, {"f79a": "Men shave, brush their teeth, and prepare for the day at a refugee camp on the Island of Nauru, Sept. 21, 2001. CREDIT: AP Photo/Rick Rycroft, File"}, {"47cc": "Australia has only resettled 3,500 refugees since last year, when the government promised to take in 12,000. Australia also refuses to accept refugees and asylum seekers on its shores, so the government sends them to offshore detention centers where people can await the adjudication process inside a detention center."}, {"a86a": "But Australia has a history of mistreating people sent to the detention center at Nauru and the one at Manus Island, Papua New Guinea, which will shut down soon. A shocking report released in August detailed more than 2,000 incidents of abuse of children at the Nauru detention center. Those allegations include assaults, sexual abuse, self-harm attempts, child abuse, and poor living conditions that occurred between 2013 and 2015."}, {"f220": "Massive Leak Of Nauru Detention Center Files Exposes Egregious Child Abuse AllegationsThe allegations are disturbing.thinkprogress.org"}, {"8099": "The abuse has continued on Nauru even on the eve of the U.N. General Assembly, with reports of an Afghan refugee who was denied emergency evacuation after he suffered from an apparent heart attack."}, {"52db": "Just hours before the Summit began, Australian Prime Minister Malcolm Turnbull claimed that his country’s border policy — including the use of boat pushbacks and offshore detention — is “the best in the world,” The Guardian reported. Former Prime Minister Tony Abbott also recently suggested that E.U. nations should adopt a similarly harsh policy towards refugees."}, {"7034": "Graham Thom, Amnesty International Australia’s National Refugee Coordinator, said that while the outcomes of the Summit would probably be “disappointing,” it would instead highlight “some of the negative practices in terms of boat pushbacks, offshore processing, and the fact that we have 2,000 people warehoused on Manus Island and Nauru, where there has been serious mental health damage done to those people.”"}, {"4588": "“These are incredibly dangerous practices for the people, but also [could set] the precedence around the world,” he added."}, {"539b": "What’s more, some people issued travel documents by the Nauru government that show their status as “refugees” have been rejected by other countries after they apply for visas."}, {"2286": "“They are stuck on a very small island where they are really not welcome,” Thom explained. He also said that Australia has been increasing its intake of refugees, but doing it too slow of a pace."}, {"7efa": "“It plans to take up 18,500 [refugee slots] in three years,” Thom said. “We think that’s too little, too slow. We think they should move up to 30,000 people.”"}, {"5567": "“We need that commitment as quickly as possible,” he added. “We cannot wait for an extra two to three years for Australia to marginally increase its offshore humanitarian program.”"}, {"0648": "5. Russia"}, {"5d82": "Syrian refugee Nihad Sadder, left, and his family pose for a photo in Murmansk, Russia, Jan. 28, 2016. CREDIT: AP Photo/Roman Stepanovich"}, {"c3fc": "In a recent 27-nation index where Amnesty International ranked countries from most to least welcoming toward refugees, Russia placed last. When it comes to refugees, Russia falls woefully short of its responsibility to the international community."}, {"2211": "“In response to the UN Refugee Agency’s Syrian refugee resettlement appeal earlier this year, Russia pledged no refugee resettlement places, but only to provide university scholarships for 300 Syrian students,” Human Rights Watch reported last week."}, {"b379": "These figures are even more staggering considering the level of damage Russia has inflicted on Syria. Russian and Syrian regime airstrikes have destroyed Syria’s largest city, Aleppo."}, {"2eb5": "“Russia has had extensive involvement in the Syrian conflict in which hundreds of thousands of Syrians have been killed and 11 million displaced, losing their homes and livelihoods,” Bill Frelick, refugee rights director at Human Rights Watch, wrote for CNN last week. “ Perhaps Russia is beginning to play a more responsible role in cooperating with others on a ceasefire as a first step to bringing this conflict to an end, but so far it has shown almost no inclination to contribute to UN aid efforts for Syrian refugees, even while countries around the world discuss the need for more “responsibility sharing” amid a global refugee crisis.”"}, {"3c65": "Resettlement aside, Russia hasn’t pulled its weight with regards to aid either. Russia so far pledged $6.8 million to the cause of Syria’s refugees. Oxfam ran a ‘fair share analysis’ for 2016 and found the Russians should be contributing more than 100 times that amount —at $717 million."}, {"eb6e": "Justin Salhani contributed to this report."}], "content": "5 countries that could do more for refugees U.N. member states convened in New York City this week to address a global refugee crisis that has displaced 65.3 million people and sent hundreds of thousands of people across oceans and borders. These member states, including the United States, are expected to adopt a broad refugee draft that would deal with resettlement issues. But in the lead up to the summit, member states have removed a “Global Compact on Refugees” clause — a commitment that calls on international governments to take in 10 percent of refugees annually. World leaders will instead discuss a “watered-down” declaration with proposals that do not include “concrete responsibility-sharing measures,” the human rights group Amnesty International charged. Many host countries already shoulder the burden of taking in refugees. And moving forward, Canada announced on Monday that it would increase humanitarian assistance by 10 percent and will commit to a $64.5 million multi-year funding to support people affected by humanitarian crises around the world. But there are many other governments that have given excuses and shirked responsibility to resettle refugees. Here are five countries that could commit to doing more after the U.N. meeting: 1. United States of America A U.S. Border Patrol agent drives near the U.S.-Mexico border fence in Sunland Park, N.M. CREDIT: AP Photo/Russell Contreras, File A growing refugee crisis on the southern U.S. border with Mexico began in late 2013, when a large increase of Central American children began showing up and surrendering to U.S. border agents, some of whom were running from violence and persecution. Many children have asked for humanitarian relief, in the form of refugee or asylum status, but not everyone who applied for refugee status got a fair shot to present their case in immigration court. The United States is the world’s largest donor of humanitarian assistance and refugee relief, but it has been very slow to acknowledge that a current refugee crisis was happening in Central America until now. It was only early this year when U.S. Secretary of State John Kerry said that the United States would increase the number of refugees admitted from El Salvador, Honduras, and Guatemala — the three “Northern Triangle” countries that are currently embroiled in increasing gang violence and extreme poverty. “Rounding up and detaining refugees will undoubtedly lead to the re-victimization of refugee families fleeing gang warfare and drug violence,” Rep. Judy Chu (D-CA) said in May. “They deserve due process and a fair day in court with access to appropriate language services as needed. We should help these refugees by offering them government provided attorneys rather than returning them to peril or even death.” 2. Hungary Children stand in a tent inside a migrant camp at Serbia’s border with Hungary, in Horgos, Serbia, Monday, July 11, 2016. CREDIT: AP Photo/Marko Drobnjakovic Hungary became a flash-point in the European Union refugee crisis when people streamed in through the so-called western Balkan refugee route on their way into other E.U. nations. In September 2015, the country cracked down hard on “irregular migration,” setting up razor wire fences and sealing shut entry points except for a theoretical no-man’s land, or a “transit zone,” on Hungarian soil where people are forced to apply for refugee status without actually stepping foot into the country. There are effectively four of these points: two along Serbia and two along Croatia in the south. “The Hungarian government is pretending that it’s not on Hungarian soil, but it is on Hungarian soil, therefore the law should apply,” Orsolya Jeney, Director of Amnesty International in Hungary, told ThinkProgress in an interview. Hungarian Prime Minister Viktor Orban has previously called migrants “poison,” adding that “whoever needs migrants can take them, but don’t force them on us, we don’t need them.” Orban and other Hungarian officials have condemned the distribution of refugees and migrants among E.U. countries, insisting that it would commit to zero resettlement. According to Amnesty International, Hungarian officials regularly violated international law in its treatment of refugees who ask for humanitarian protection. Officials have reportedly turned people away to Serbia and have even beat refugees and migrants, a process that has drawn the ire of the Luxembourg foreign minister who wants Hungary to be kicked out of the European Union. “What we feared became reality,” Jeney added, explaining that the country has only accepted 300 refugee applications this year. “About 80 percent of [the] Hungarian public is against refugees… The refugees have been dehumanized and they are being portrayed as ‘them,’ like a bunch of illegal people who are here to take our jobs and who are going to threaten our lives. Unfortunately the hate propaganda is working and harmful.” 3. Kenya Somali refugees walk through an area housing new arrivals, on the outskirts of Hagadera Camp outside Dadaab, Kenya, Saturday July 9, 2011. CREDIT: AP Photo/Rebecca Blackwell, File The Kenyan government announced plans in May to shut down two of its largest refugee camps in Dadaab by the end of the year. The move would affect upwards of 300,000 people, mostly from Somalia and South Sudan. The government cited economy and national security concerns for the closure, insisting that it would voluntarily return refugees through a repatriation process that ensures the safe return of refugees back to their countries. Advocacy groups have said voluntary repatriation has not happened. Instead, refugees are afraid that they would get deported anyway and forfeit a $400 (£300) U.N. cash grant in the meantime. “Our team went to the refugee camp two weeks ago and they confirmed that there are people who are coerced and pushed out — it is not voluntary repatriation,” Justus Nyang’aya, Amnesty International Kenya Section Director, told ThinkProgress in an interview. “A number of people …went to Somalia, but they are coming back because some of them are being recruited to Al-Shabaab [an Al-Qaeda affiliate in Somalia]. Some of them are [also] being threatened.” Because Kenya disbanded its Department of Refugee Affairs — the official office that gives out special movement passes to refugees to travel outside — people who come back can no longer register as refugees and do not receive the same kind of security as other refugees, Nyang’aya said. “The problem is that the government is talking about voluntary repatriation in keeping with international law so that they don’t violate the principle, but if they put a timeline of November 30 and saying ‘you need to leave,’ they’re actually deporting them,” Nyang’aya explained. Some advocates believe that the Kenyan government’s rationale to close the camps because of terrorism concerns has been overhyped. There has not been any credible evidence linking Somali refugees to any terrorist attacks in Kenya, the human rights group Human Rights Watch reported. “We are saying, you have the security operators, please identify those refugees and others that are creating problems for others and arrest them and prosecute them,” Nyang’aya added. “But what we have found that some of the people terrorizing Kenyans are Kenyans themselves.” 4. Australia Men shave, brush their teeth, and prepare for the day at a refugee camp on the Island of Nauru, Sept. 21, 2001. CREDIT: AP Photo/Rick Rycroft, File Australia has only resettled 3,500 refugees since last year, when the government promised to take in 12,000. Australia also refuses to accept refugees and asylum seekers on its shores, so the government sends them to offshore detention centers where people can await the adjudication process inside a detention center. But Australia has a history of mistreating people sent to the detention center at Nauru and the one at Manus Island, Papua New Guinea, which will shut down soon. A shocking report released in August detailed more than 2,000 incidents of abuse of children at the Nauru detention center. Those allegations include assaults, sexual abuse, self-harm attempts, child abuse, and poor living conditions that occurred between 2013 and 2015. Massive Leak Of Nauru Detention Center Files Exposes Egregious Child Abuse AllegationsThe allegations are disturbing.thinkprogress.org The abuse has continued on Nauru even on the eve of the U.N. General Assembly, with reports of an Afghan refugee who was denied emergency evacuation after he suffered from an apparent heart attack. Just hours before the Summit began, Australian Prime Minister Malcolm Turnbull claimed that his country’s border policy — including the use of boat pushbacks and offshore detention — is “the best in the world,” The Guardian reported. Former Prime Minister Tony Abbott also recently suggested that E.U. nations should adopt a similarly harsh policy towards refugees. Graham Thom, Amnesty International Australia’s National Refugee Coordinator, said that while the outcomes of the Summit would probably be “disappointing,” it would instead highlight “some of the negative practices in terms of boat pushbacks, offshore processing, and the fact that we have 2,000 people warehoused on Manus Island and Nauru, where there has been serious mental health damage done to those people.” “These are incredibly dangerous practices for the people, but also [could set] the precedence around the world,” he added. What’s more, some people issued travel documents by the Nauru government that show their status as “refugees” have been rejected by other countries after they apply for visas. “They are stuck on a very small island where they are really not welcome,” Thom explained. He also said that Australia has been increasing its intake of refugees, but doing it too slow of a pace. “It plans to take up 18,500 [refugee slots] in three years,” Thom said. “We think that’s too little, too slow. We think they should move up to 30,000 people.” “We need that commitment as quickly as possible,” he added. “We cannot wait for an extra two to three years for Australia to marginally increase its offshore humanitarian program.” 5. Russia Syrian refugee Nihad Sadder, left, and his family pose for a photo in Murmansk, Russia, Jan. 28, 2016. CREDIT: AP Photo/Roman Stepanovich In a recent 27-nation index where Amnesty International ranked countries from most to least welcoming toward refugees, Russia placed last. When it comes to refugees, Russia falls woefully short of its responsibility to the international community. “In response to the UN Refugee Agency’s Syrian refugee resettlement appeal earlier this year, Russia pledged no refugee resettlement places, but only to provide university scholarships for 300 Syrian students,” Human Rights Watch reported last week. These figures are even more staggering considering the level of damage Russia has inflicted on Syria. Russian and Syrian regime airstrikes have destroyed Syria’s largest city, Aleppo. “Russia has had extensive involvement in the Syrian conflict in which hundreds of thousands of Syrians have been killed and 11 million displaced, losing their homes and livelihoods,” Bill Frelick, refugee rights director at Human Rights Watch, wrote for CNN last week. “ Perhaps Russia is beginning to play a more responsible role in cooperating with others on a ceasefire as a first step to bringing this conflict to an end, but so far it has shown almost no inclination to contribute to UN aid efforts for Syrian refugees, even while countries around the world discuss the need for more “responsibility sharing” amid a global refugee crisis.” Resettlement aside, Russia hasn’t pulled its weight with regards to aid either. Russia so far pledged $6.8 million to the cause of Syria’s refugees. Oxfam ran a ‘fair share analysis’ for 2016 and found the Russians should be contributing more than 100 times that amount —at $717 million. Justin Salhani contributed to this report. ", "child": "429_1\t429_2\t429_3\t429_4\t429_5\t429_6"}