{"name": "430", "parent": "", "title": "Child refugees to world leaders: We aren’t refugees. We aren’t migrants. We’re children.", "sentences": [{"5521": "Child refugees to world leaders: We aren’t refugees. We aren’t migrants. We’re children."}, {"2bc2": "“I was not a refugee first. I was not a migrant first. I was a child.”"}, {"2d22": "About 50 million children — or roughly one in every 45 kids in the world — are currently displaced globally, many of whom have been uprooted by violent wars and persecution. Some are called “refugees.” Others are called “migrants.” Some have been memorialized in splashy photos of lifeless bodies found adrift in the Mediterranean Sea. Still other children barely make it out alive, too young to understand the machinations of war, but now too aware to escape trauma."}, {"1d06": "On Sunday night, a group of children who fled their home countries held a candlelight vigil in New York City asking world leaders to ensure that any promise they make during the U.N. Summit for Refugees and Migrants takes into account the needs of children central to any international commitments."}, {"154f": "During the Summit, which began Monday, world leaders are discussing ways to share responsibilities posed by the largest migration crisis since World War II. The Summit has been a widely anticipated high-level event, but it has also been also widely panned because a “draft outcome” preview document released in August failed to present concrete actions to protect vulnerable people. What’s more, countries have until 2018 to act on promises made."}, {"dd65": "But on Sunday, children reminded world leaders to see them for what they are beyond the technical labels: kids."}, {"2e5e": "“One thing I want people to remember is that all children are basically the same, no matter where they come from. Children are children and they shouldn’t have to deal with adult problems,” one of the four child refugees said during the vigil, explaining that she and her family had to leave Zimbabwe more than five years ago. “That year I fled was the year I had to grow up. I watched my mom struggle with her health and had to become her mom at times, even though I was nine. The stress of our circumstances took a toll on all of us. For me, I lost my childhood.”"}, {"6111": "“I was not a refugee first. I was not a migrant first. I was a child,” she added."}, {"ad01": "Along with faith organizations and UNICEF, the Children’s Defense Fund of New York hosted the vigil to get U.N. member states to not only talk about the root causes of the international crisis, but to help highlight the positive contributions by migrants and refugees. In particular, advocates hope that the summit could amplify the voices of people who are most impacted, such as children."}, {"634c": "“If you look at the trauma to which they’ve been subjected in their home countries — the dangers they survive during their journeys where in some instances they face death or further exploitation, our response should be a lot more humane than it is,” Naomi Post, Executive Director of the Children’s Defense Fund, told ThinkProgress in a phone interview ahead of the vigil. “We haven’t created the environment that supports them in a holistic kind of way or that provides the legal representation that they need.”"}, {"f9c6": "Post said that the children they picked to speak at the vigil don’t have “unique” problems, but are representative of the larger number of children who are on the run. Children, in fact, make up half of all refugees, with 45 percent of all child refugees under United Nations High Commissioner for Refugees (UNHRC) care in 2015 coming from Syria and Afghanistan. According to a UNICEF report, 28 million children have been driven from their homes because of violence and insecurity, including 10 million child refugees. The same report found that one in two African refugees are children. This can present a problem since 3.7 million school-age children under UNHRC protection “have no school to go to,” according to a recent U.N. Refugee agency report, which indicated that education could help refugees change the future of both their host and home countries."}, {"0763": "“I think children are the most powerful conduits of information — both about their experiences and what their needs are and how they can contribute to this society,” Post said. “Lifting up their voices is paramount.”"}], "content": "Child refugees to world leaders: We aren’t refugees. We aren’t migrants. We’re children. “I was not a refugee first. I was not a migrant first. I was a child.” About 50 million children — or roughly one in every 45 kids in the world — are currently displaced globally, many of whom have been uprooted by violent wars and persecution. Some are called “refugees.” Others are called “migrants.” Some have been memorialized in splashy photos of lifeless bodies found adrift in the Mediterranean Sea. Still other children barely make it out alive, too young to understand the machinations of war, but now too aware to escape trauma. On Sunday night, a group of children who fled their home countries held a candlelight vigil in New York City asking world leaders to ensure that any promise they make during the U.N. Summit for Refugees and Migrants takes into account the needs of children central to any international commitments. During the Summit, which began Monday, world leaders are discussing ways to share responsibilities posed by the largest migration crisis since World War II. The Summit has been a widely anticipated high-level event, but it has also been also widely panned because a “draft outcome” preview document released in August failed to present concrete actions to protect vulnerable people. What’s more, countries have until 2018 to act on promises made. But on Sunday, children reminded world leaders to see them for what they are beyond the technical labels: kids. “One thing I want people to remember is that all children are basically the same, no matter where they come from. Children are children and they shouldn’t have to deal with adult problems,” one of the four child refugees said during the vigil, explaining that she and her family had to leave Zimbabwe more than five years ago. “That year I fled was the year I had to grow up. I watched my mom struggle with her health and had to become her mom at times, even though I was nine. The stress of our circumstances took a toll on all of us. For me, I lost my childhood.” “I was not a refugee first. I was not a migrant first. I was a child,” she added. Along with faith organizations and UNICEF, the Children’s Defense Fund of New York hosted the vigil to get U.N. member states to not only talk about the root causes of the international crisis, but to help highlight the positive contributions by migrants and refugees. In particular, advocates hope that the summit could amplify the voices of people who are most impacted, such as children. “If you look at the trauma to which they’ve been subjected in their home countries — the dangers they survive during their journeys where in some instances they face death or further exploitation, our response should be a lot more humane than it is,” Naomi Post, Executive Director of the Children’s Defense Fund, told ThinkProgress in a phone interview ahead of the vigil. “We haven’t created the environment that supports them in a holistic kind of way or that provides the legal representation that they need.” Post said that the children they picked to speak at the vigil don’t have “unique” problems, but are representative of the larger number of children who are on the run. Children, in fact, make up half of all refugees, with 45 percent of all child refugees under United Nations High Commissioner for Refugees (UNHRC) care in 2015 coming from Syria and Afghanistan. According to a UNICEF report, 28 million children have been driven from their homes because of violence and insecurity, including 10 million child refugees. The same report found that one in two African refugees are children. This can present a problem since 3.7 million school-age children under UNHRC protection “have no school to go to,” according to a recent U.N. Refugee agency report, which indicated that education could help refugees change the future of both their host and home countries. “I think children are the most powerful conduits of information — both about their experiences and what their needs are and how they can contribute to this society,” Post said. “Lifting up their voices is paramount.” ", "child": "430_1\t430_2"}