{"name": "434", "parent": "", "title": "Economists across the political spectrum tell Trump that immigrants are good for the country", "sentences": [{"45fb": "Economists across the political spectrum tell Trump that immigrants are good for the country"}, {"ae11": "Immigrants: they get stuff done."}, {"3ecf": "Farmworker Florentino Reyes picks tomatoes Tuesday, Aug. 30, 2016, at a field near Mendota, Calif. CREDIT: AP Photo/Scott Smith"}, {"efe2": "Almost 1,500 economists across the political spectrum wrote a letter addressed to President Trump and congressional leaders that praised immigrants as an economic benefit to the United States and implored lawmakers to “modernize our immigration system.”"}, {"ddf5": "“As Congress and the Administration prepare to revisit our immigration laws, we write to express our broad consensus that immigration is one of America’s significant competitive advantages in the global economy,” the letter stated in part. “With the proper and necessary safeguards in place, immigration represents an opportunity rather than a threat to our economy and to American workers.”"}, {"e517": "The letter pointed out that immigrants have a positive effect on job creation by creating entrepreneurs who hire American workers; offsetting the retirement of the Baby Boomer population; granting diverse skill sets that help companies grow; and driving economic growth in industries like science, technology, engineering, and math."}, {"968a": "The letter writers pointed out that immigration has economic costs, but ultimately said that “the benefits that immigration brings to society far outweigh their costs, and smart immigration policy could better maximize the benefits of immigration while reducing the costs.”"}, {"1b1e": "Among the signatories included Douglas Holtz-Eakin, president of the right-leaning American Action Forum think tank and who served under President George H.W. Bush, and Austan Goolsbee, the former chairman of President Obama’s Council of Economic Advisers."}, {"7944": "The crux of the letter — that immigrants are an economic benefit for the country — has been consistently proven true. More than half of U.S. firms that are valued at $1 billion or more, had at least one immigrant co-founder, according to a 2016 National Foundation for American Policy study. One-quarter of engineering and technology companies started in the United States between 2006 and 2012 had at least one founder who was an immigrant. And as the letter writers alluded to, the massive wave of 77 million Baby Boomers retiring between 2010 and 2030 will slow labor force growth. A 2013 Center for American Progress study found that at least two-thirds of all entrants into the workforce, including immigrants, are needed to replace today’s current workers with the additional one-third needed to grow the workforce."}, {"86d1": "The study doesn’t clarify which immigrants bring an economic boon to the economy. But studies show that all kinds of immigrants — including undocumented ones who contribute $11.74 billion in taxes annually — are integral to the economic health of this country."}, {"5673": "The letter follows President Donald Trump’s rhetoric that paints immigrants as criminals and rapists. He has promised to harshly penalize undocumented immigrants with threats of deportation. Although the president no longer talks about mass deportation, it’s clear that the immigration raids authorized by his administration have had a chilling effect, and many are too scared to leave their homes. Farmers have been hard pressed to find workers for western Massachusetts farms, a factor that could lead to the same kind economic loss for the agriculture industry in Alabama, Georgia, and Arizona when they passed anti-immigrant state legislation a few years ago."}], "content": "Economists across the political spectrum tell Trump that immigrants are good for the country Immigrants: they get stuff done. Farmworker Florentino Reyes picks tomatoes Tuesday, Aug. 30, 2016, at a field near Mendota, Calif. CREDIT: AP Photo/Scott Smith Almost 1,500 economists across the political spectrum wrote a letter addressed to President Trump and congressional leaders that praised immigrants as an economic benefit to the United States and implored lawmakers to “modernize our immigration system.” “As Congress and the Administration prepare to revisit our immigration laws, we write to express our broad consensus that immigration is one of America’s significant competitive advantages in the global economy,” the letter stated in part. “With the proper and necessary safeguards in place, immigration represents an opportunity rather than a threat to our economy and to American workers.” The letter pointed out that immigrants have a positive effect on job creation by creating entrepreneurs who hire American workers; offsetting the retirement of the Baby Boomer population; granting diverse skill sets that help companies grow; and driving economic growth in industries like science, technology, engineering, and math. The letter writers pointed out that immigration has economic costs, but ultimately said that “the benefits that immigration brings to society far outweigh their costs, and smart immigration policy could better maximize the benefits of immigration while reducing the costs.” Among the signatories included Douglas Holtz-Eakin, president of the right-leaning American Action Forum think tank and who served under President George H.W. Bush, and Austan Goolsbee, the former chairman of President Obama’s Council of Economic Advisers. The crux of the letter — that immigrants are an economic benefit for the country — has been consistently proven true. More than half of U.S. firms that are valued at $1 billion or more, had at least one immigrant co-founder, according to a 2016 National Foundation for American Policy study. One-quarter of engineering and technology companies started in the United States between 2006 and 2012 had at least one founder who was an immigrant. And as the letter writers alluded to, the massive wave of 77 million Baby Boomers retiring between 2010 and 2030 will slow labor force growth. A 2013 Center for American Progress study found that at least two-thirds of all entrants into the workforce, including immigrants, are needed to replace today’s current workers with the additional one-third needed to grow the workforce. The study doesn’t clarify which immigrants bring an economic boon to the economy. But studies show that all kinds of immigrants — including undocumented ones who contribute $11.74 billion in taxes annually — are integral to the economic health of this country. The letter follows President Donald Trump’s rhetoric that paints immigrants as criminals and rapists. He has promised to harshly penalize undocumented immigrants with threats of deportation. Although the president no longer talks about mass deportation, it’s clear that the immigration raids authorized by his administration have had a chilling effect, and many are too scared to leave their homes. Farmers have been hard pressed to find workers for western Massachusetts farms, a factor that could lead to the same kind economic loss for the agriculture industry in Alabama, Georgia, and Arizona when they passed anti-immigrant state legislation a few years ago. ", "child": "434_1\t434_2\t434_3\t434_4\t434_5\t434_6\t434_7\t434_8\t434_9"}