{"name": "445", "parent": "", "title": "ICE agents arrested a domestic violence victim trying to get a protective order", "sentences": [{"d653": "ICE agents arrested a domestic violence victim trying to get a protective order"}, {"a89f": "Her abuser may have tipped off the agents about where she was."}, {"3b7b": "Immigration and Custom Enforcement police CREDIT: AP Photo/Ed Andrieski"}, {"de85": "Federal immigration agents arrested an undocumented transgender woman in Texas last week just moments after she obtained a protective order against her alleged abuser — and her abuser may have tipped off the agents."}, {"fc91": "Immigration lawyers say this signals a disturbing new precedent for the U.S. Immigration and Customs Enforcement (ICE) agency, which is not supposed to solely use information provided by an abusive partner to make decisions about whether to detain someone. They are concerned this case will make undocumented domestic violence victims across the country too scared to come forward and seek protection against their abusers."}, {"9368": "According to reporting from the El Paso Times, documents filed on Friday state the woman went to the El Paso County Courthouse on February 9 to seek a protective order against her boyfriend. They also reveal that someone contacted authorities on February 2 to inform them the woman had filed this order and was staying at a domestic violence shelter."}, {"365d": "The woman is now being held in El Paso County jail."}, {"c553": "For restaurant owners in the nation’s capital, an immigrant worker strike is personal“We are a family, and we wanted to show our support.”thinkprogress.org"}, {"c3f8": "Although the documents don’t specify who sent the tip to ICE agents earlier this month, local officials told the El Paso Times they suspect it was the woman’s live-in boyfriend, who had previously been detained by ICE."}, {"0c9e": "“I’m suspicious that the tip may have come from the abuser, who knew precisely where the victim would be at that time and date since he had received notice to be in that courtroom as well,” El Paso County Attorney Jo Anne Bernal told local news outlet KFOX."}, {"5013": "There are several points at which Bernal’s account of the case differs from the account represented in the documents. The criminal complaint states that the arrest took place on the street, but Bernal said that it happened inside of the courthouse; she told the El Paso Times that six immigration agents showed up on 10th floor of the building. And although the documents refer to the woman with a male name, Bernal said she is actually a transgender woman."}, {"e244": "Bernal, whose office deals with victims who are seeking court orders to protect them from their alleged abusers, said that ICE should not be picking up undocumented immigrants outside of family court."}, {"a126": "Immigration experts who spoke to the Huffington Post agreed."}, {"dc66": "Federal officials arrested 680 immigrants in 11 states this week aloneActivists fear Trump’s administration is being aggressive.thinkprogress.org"}, {"b4c6": "“I’ve never heard of targeting a person in that way before,” Stephen Legomsky, a professor at the Washington University School of Law and the former Chief Counsel of U.S. Citizenship and Immigration Services, told the Huffington Post. “It’s possible there’s facts we don’t know, but if this is the whole story, it seems like this is a coldblooded way to go after somebody.”"}, {"5019": "The arrest of the alleged domestic violence victim comes amid nationwide deportation raids that are terrifying the immigrant community."}, {"da28": "ICE agents say they arrested nearly 700 immigrants over the past week in what the agency is characterizing as a routine operation. Immigrant advocates, on the other hand, say that the aggressive enforcement actions are targeting people who aren’t usually considered to be deportation priorities."}, {"eed0": "The first women deported by the Trump administration, for example, was a mother of two U.S. citizens who had lived in Arizona for two decades and posed no apparent threat to the United States. A Methodist Sunday School teacher was detained last week and may be in deportation proceedings. And ICE agents recently detained a young man who is shielded from deportation under the Deferred Action for Childhood Arrivals (DACA) initiative."}], "content": "ICE agents arrested a domestic violence victim trying to get a protective order Her abuser may have tipped off the agents about where she was. Immigration and Custom Enforcement police CREDIT: AP Photo/Ed Andrieski Federal immigration agents arrested an undocumented transgender woman in Texas last week just moments after she obtained a protective order against her alleged abuser — and her abuser may have tipped off the agents. Immigration lawyers say this signals a disturbing new precedent for the U.S. Immigration and Customs Enforcement (ICE) agency, which is not supposed to solely use information provided by an abusive partner to make decisions about whether to detain someone. They are concerned this case will make undocumented domestic violence victims across the country too scared to come forward and seek protection against their abusers. According to reporting from the El Paso Times, documents filed on Friday state the woman went to the El Paso County Courthouse on February 9 to seek a protective order against her boyfriend. They also reveal that someone contacted authorities on February 2 to inform them the woman had filed this order and was staying at a domestic violence shelter. The woman is now being held in El Paso County jail. For restaurant owners in the nation’s capital, an immigrant worker strike is personal“We are a family, and we wanted to show our support.”thinkprogress.org Although the documents don’t specify who sent the tip to ICE agents earlier this month, local officials told the El Paso Times they suspect it was the woman’s live-in boyfriend, who had previously been detained by ICE. “I’m suspicious that the tip may have come from the abuser, who knew precisely where the victim would be at that time and date since he had received notice to be in that courtroom as well,” El Paso County Attorney Jo Anne Bernal told local news outlet KFOX. There are several points at which Bernal’s account of the case differs from the account represented in the documents. The criminal complaint states that the arrest took place on the street, but Bernal said that it happened inside of the courthouse; she told the El Paso Times that six immigration agents showed up on 10th floor of the building. And although the documents refer to the woman with a male name, Bernal said she is actually a transgender woman. Bernal, whose office deals with victims who are seeking court orders to protect them from their alleged abusers, said that ICE should not be picking up undocumented immigrants outside of family court. Immigration experts who spoke to the Huffington Post agreed. Federal officials arrested 680 immigrants in 11 states this week aloneActivists fear Trump’s administration is being aggressive.thinkprogress.org “I’ve never heard of targeting a person in that way before,” Stephen Legomsky, a professor at the Washington University School of Law and the former Chief Counsel of U.S. Citizenship and Immigration Services, told the Huffington Post. “It’s possible there’s facts we don’t know, but if this is the whole story, it seems like this is a coldblooded way to go after somebody.” The arrest of the alleged domestic violence victim comes amid nationwide deportation raids that are terrifying the immigrant community. ICE agents say they arrested nearly 700 immigrants over the past week in what the agency is characterizing as a routine operation. Immigrant advocates, on the other hand, say that the aggressive enforcement actions are targeting people who aren’t usually considered to be deportation priorities. The first women deported by the Trump administration, for example, was a mother of two U.S. citizens who had lived in Arizona for two decades and posed no apparent threat to the United States. A Methodist Sunday School teacher was detained last week and may be in deportation proceedings. And ICE agents recently detained a young man who is shielded from deportation under the Deferred Action for Childhood Arrivals (DACA) initiative. ", "child": "445_1\t445_2\t445_3\t445_4\t445_5\t445_6\t445_7\t445_8\t445_9\t445_10"}