{"name": "452", "parent": "", "title": "Thousands march across the country calling for Trump to release his tax returns", "sentences": [{"f3b6": "Thousands march across the country calling for Trump to release his tax returns"}, {"5758": "An estimated 25,000 marched in Washington, D.C. alone."}, {"5657": "Protesters march near the U.S. Capitol. CREDIT: AP Photo/Manuel Balce Ceneta"}, {"e91b": "Around the country, thousands of people marched on Tax Day (America’s traditional day to file income taxes) to call on Donald Trump to release his tax returns — something presidential candidates have done since Richard Nixon’s tax-related ethics conflagration."}, {"bb34": "Trump has yet to release his tax returns from any year, saying that his taxes from last year are under audit. He is also the only modern president to refuse to divest from his business holdings. Concerns about potential conflicts of interest have plagued his presidency before it began."}, {"e4ca": "Around 150 marches were scheduled to take place in cities around the country, with significant participation arising in dozens of cities at the least, according to organizers."}, {"8afc": "Sen. Ron Wyden spoke at the main rally outside the Capitol in Washington D.C., saying people have “a basic right to know whether the president pays his fair share.” Rep. Jaime Raskin (D-MD) told the crowd, “Mr. President, if you can hear us from Mar-a-Lago, read the Constitution! We have no kings here!”"}, {"ba9b": "Worries that anti-Trump protests were “losing steam” may have been overblown. While the Women’s March in January was the largest single-day protest event in U.S. history, and Saturday’s targeted events were never expected to meet or surpass that turnout, thousands of people hit the streets for the main march in Washington, D.C."}, {"2ee5": "MoveOn.org’s Washington director, Ben Wikler, told ThinkProgress that the crowd was in the area outside the Capitol that holds about 25,000 people, and it was “pretty full,” if not all the way filled. A statement released by other organizers put the estimate at an even 25,000. After the rally finished at the Capitol, attendees marched toward the Lincoln Memorial."}, {"05d4": "“It’s time to officially retire the false notion that America doesn’t care about Trump’s tax returns,” Wikler told ThinkProgress. “If Trump doesn’t release them voluntarily, sooner or later Congress and state governments are going to force him to make them public, and we’ll find out just who has been paying Donald Trump for all these years.”"}, {"d452": "In February, 229 House Republicans voted to keep Trump’s tax returns a secret. Legislators in more than half of states have introduced legislation that would require all presidential candidates to disclose tax returns ."}, {"f601": "Many marchers want to know who pays Trump personally, and to whom he owes money. The subtext here is Russian influence on Trump and his presidential campaign, currently the subject of investigations in the House, Senate, and by the FBI. Additionally, right now it is impossible to say exactly how billionaires like Trump use the tax system, and therefore how much he and his family would personally benefit if he passes different tax reform proposals."}, {"cb4c": "On the same day, the Electronic Privacy Information Center filed a “FOIA lawsuit” against the IRS to for the release of Trump’s tax returns. The group said in a statement, “There has never been a more compelling FOIA request presented to the IRS.” The group based its request on rules that state the IRS Commissioner may release returns to “correct misstatements of fact.” Trump has pointedly not fired the current commissioner, angering some conservatives."}, {"b3e8": "Jennifer Epstein, Bloomberg’s White House reporter, tweeted that Trump’s motorcade heading back to Mar-a-Lago from his golf course trip today took a longer-than-usual route to avoid Floridian tax march protesters."}, {"ec81": "Tax returns for the current year, due on Tuesday, would not be under audit, and Trump would not be able to use the same audit excuse for not releasing them — something several attendees mentioned as a reason for the marches. A portion of one year of tax returns was leaked to DCReport.org, revealing that Trump paid taxes for that year at a much lower rate than most taxpayers. Last year, another purportedly leaked copy of Trump’s 1995 taxes showed him declaring over $900 million in losses which would mean he could avoid hundreds of millions in taxes in future years."}, {"d917": "Protesters show signs at the D.C. march. CREDIT: Public Citizen"}, {"f555": "Lisa Gilbert, vice president of legislative affairs for Public Citizen, spoke at the DC march. She told ThinkProgress:"}, {"c8b4": "We march because disclosure of Trump’s returns is vital for understanding his conflicts of interest, his foreign entanglements, and how much he really makes as a “successful businessman,” but also to stand together against a rigged system. Americans deserve better than a tax structure in which billionaires pay a lower rate than secretaries, some profitable multinational corporations pay no federal income tax at all , and hardworking families are forced to pick up the tab to create the type of society we want to live in."}, {"de38": "This sign at the D.C. march read, “David Farenthold for Supreme Court” — a nod to the Washington Post reporter’s work uncovering how well Trump’s boasts about charitable giving match up with reality, which yielded him a Pulitzer this year. Revealing his tax returns would allow Trump to show people how much he has actually donated to charity over the years."}, {"ec8b": "The cost of protecting Trump Tower, where First Lady Melania Trump and son Barron Trump are living in New York City, is estimated at $183 million per year, something on protesters minds who are concerned about how much Trump has paid in federal income taxes."}, {"b667": "Another protest on Saturday in Berkeley, California turned violent, when Trump supporters and Oathkeepers holding a rally clashed with counter-protesters who tore down plastic netting separating the groups, who have clashed several times in the last few months. Despite initial confusion that this violence happened at the San Francisco tax march, the events were reportedly separate and the two cities are, in fact, in different places."}], "content": "Thousands march across the country calling for Trump to release his tax returns An estimated 25,000 marched in Washington, D.C. alone. Protesters march near the U.S. Capitol. CREDIT: AP Photo/Manuel Balce Ceneta Around the country, thousands of people marched on Tax Day (America’s traditional day to file income taxes) to call on Donald Trump to release his tax returns — something presidential candidates have done since Richard Nixon’s tax-related ethics conflagration. Trump has yet to release his tax returns from any year, saying that his taxes from last year are under audit. He is also the only modern president to refuse to divest from his business holdings. Concerns about potential conflicts of interest have plagued his presidency before it began. Around 150 marches were scheduled to take place in cities around the country, with significant participation arising in dozens of cities at the least, according to organizers. Sen. Ron Wyden spoke at the main rally outside the Capitol in Washington D.C., saying people have “a basic right to know whether the president pays his fair share.” Rep. Jaime Raskin (D-MD) told the crowd, “Mr. President, if you can hear us from Mar-a-Lago, read the Constitution! We have no kings here!” Worries that anti-Trump protests were “losing steam” may have been overblown. While the Women’s March in January was the largest single-day protest event in U.S. history, and Saturday’s targeted events were never expected to meet or surpass that turnout, thousands of people hit the streets for the main march in Washington, D.C. MoveOn.org’s Washington director, Ben Wikler, told ThinkProgress that the crowd was in the area outside the Capitol that holds about 25,000 people, and it was “pretty full,” if not all the way filled. A statement released by other organizers put the estimate at an even 25,000. After the rally finished at the Capitol, attendees marched toward the Lincoln Memorial. “It’s time to officially retire the false notion that America doesn’t care about Trump’s tax returns,” Wikler told ThinkProgress. “If Trump doesn’t release them voluntarily, sooner or later Congress and state governments are going to force him to make them public, and we’ll find out just who has been paying Donald Trump for all these years.” In February, 229 House Republicans voted to keep Trump’s tax returns a secret. Legislators in more than half of states have introduced legislation that would require all presidential candidates to disclose tax returns . Many marchers want to know who pays Trump personally, and to whom he owes money. The subtext here is Russian influence on Trump and his presidential campaign, currently the subject of investigations in the House, Senate, and by the FBI. Additionally, right now it is impossible to say exactly how billionaires like Trump use the tax system, and therefore how much he and his family would personally benefit if he passes different tax reform proposals. On the same day, the Electronic Privacy Information Center filed a “FOIA lawsuit” against the IRS to for the release of Trump’s tax returns. The group said in a statement, “There has never been a more compelling FOIA request presented to the IRS.” The group based its request on rules that state the IRS Commissioner may release returns to “correct misstatements of fact.” Trump has pointedly not fired the current commissioner, angering some conservatives. Jennifer Epstein, Bloomberg’s White House reporter, tweeted that Trump’s motorcade heading back to Mar-a-Lago from his golf course trip today took a longer-than-usual route to avoid Floridian tax march protesters. Tax returns for the current year, due on Tuesday, would not be under audit, and Trump would not be able to use the same audit excuse for not releasing them — something several attendees mentioned as a reason for the marches. A portion of one year of tax returns was leaked to DCReport.org, revealing that Trump paid taxes for that year at a much lower rate than most taxpayers. Last year, another purportedly leaked copy of Trump’s 1995 taxes showed him declaring over $900 million in losses which would mean he could avoid hundreds of millions in taxes in future years. Protesters show signs at the D.C. march. CREDIT: Public Citizen Lisa Gilbert, vice president of legislative affairs for Public Citizen, spoke at the DC march. She told ThinkProgress: We march because disclosure of Trump’s returns is vital for understanding his conflicts of interest, his foreign entanglements, and how much he really makes as a “successful businessman,” but also to stand together against a rigged system. Americans deserve better than a tax structure in which billionaires pay a lower rate than secretaries, some profitable multinational corporations pay no federal income tax at all , and hardworking families are forced to pick up the tab to create the type of society we want to live in. This sign at the D.C. march read, “David Farenthold for Supreme Court” — a nod to the Washington Post reporter’s work uncovering how well Trump’s boasts about charitable giving match up with reality, which yielded him a Pulitzer this year. Revealing his tax returns would allow Trump to show people how much he has actually donated to charity over the years. The cost of protecting Trump Tower, where First Lady Melania Trump and son Barron Trump are living in New York City, is estimated at $183 million per year, something on protesters minds who are concerned about how much Trump has paid in federal income taxes. Another protest on Saturday in Berkeley, California turned violent, when Trump supporters and Oathkeepers holding a rally clashed with counter-protesters who tore down plastic netting separating the groups, who have clashed several times in the last few months. Despite initial confusion that this violence happened at the San Francisco tax march, the events were reportedly separate and the two cities are, in fact, in different places. ", "child": "452_1\t452_2\t452_3\t452_4\t452_5\t452_6"}