{"name": "455", "parent": "", "title": "GOP Sen. Flake was asked to defend Trump’s Mar-a-Lago trips. It didn’t go well.", "sentences": [{"571e": "GOP Sen. Flake was asked to defend Trump’s Mar-a-Lago trips. It didn’t go well."}, {"cf2d": "Sen. Flake tried to compare Trump’s trips with Obama’s, but there’s no comparison."}, {"1c95": "President Trump is spending Easter weekend at Mar-a-Lago. It’s the seventh weekend he’s spent at his private club in Florida in the 12 weeks since his inauguration."}, {"3c0f": "On Friday morning, as tensions on the Korean Peninsula reached a fever pitch, the president headed to the Trump International Golf Club in West Palm Beach, marking the eleventh straight weekend he’s visited a Trump-branded property."}, {"3c28": "Commemorating the president’s 10th consecutive weekend at a Trump-branded propertyThe streak continues.thinkprogress.org"}, {"94c8": "NBC News estimates that by the end of this weekend, Trump will have spent 28 percent of his presidency traveling to or spending time at Mar-a-Lago. The costs of his $3 million-plus trips are adding up — Trump is reportedly on track to spend more taxpayer dollars in a single year on travel than President Obama did during his entire two terms in office."}, {"991f": "Sen. Jeff Flake (R-AZ) was asked about Trump’s travel during a town hall on Thursday night."}, {"baa6": "“As a fiscal conservative, what is your position on all the weekend trips that the preisdent makes down to Mar-a-Lago?” an attendee asked."}, {"5ae0": "The senator responded with a false equivalency."}, {"043d": "“With regard to presidents and what they do on the weekend, I’m not going to criticize presidents,” Flake said, as boos erupted. “I refrained from criticizing President Obama, and I’ll refrain from criticizing President Trump.”"}, {"55a8": "Flake reiterated the false equivalency when Trump’s Mar-a-Lago trips were brought up at another point, saying, “As I mentioned, I wasn’t critical of the last president or the president before that for what they do on their time off.”"}, {"cb4c": "But not only was Obama’s travel far less frequent and costly than Trump’s, he also didn’t enrich himself in the process. Trump’s frequent travels to Mar-a-Lago have coincided with membership dues doubling to $200,000. His trips to his golf courses have coincided with his sons marketing them. And because Trump still owns his business, he’s able to profit off his office in an unprecedented way."}, {"09ee": "Flake was also asked about Trump’s tax returns. He responded by saying that while he thinks “it’s a good policy” to release them, he won’t support efforts in Congress to make Trump’s public."}, {"4c5b": "“I think that ought to be handled in the election,” Flake said. “If you feel somebody isn’t being transparent, you don’t vote for them.”"}, {"1ded": "But during the campaign, Trump repeatedly promised to release his tax returns upon the completion of an audit."}, {"2d6e": "“I’m under a routine audit and it’ll be released, and as soon as the audit is finished it will be released,” Trump said during the first debate in September."}, {"1e38": "Flake was at times critical of Trump during the campaign, but has largely supported Trump’s agenda since he’s become president. He’s up for reelection next year and is considered a top Democratic target."}], "content": "GOP Sen. Flake was asked to defend Trump’s Mar-a-Lago trips. It didn’t go well. Sen. Flake tried to compare Trump’s trips with Obama’s, but there’s no comparison. President Trump is spending Easter weekend at Mar-a-Lago. It’s the seventh weekend he’s spent at his private club in Florida in the 12 weeks since his inauguration. On Friday morning, as tensions on the Korean Peninsula reached a fever pitch, the president headed to the Trump International Golf Club in West Palm Beach, marking the eleventh straight weekend he’s visited a Trump-branded property. Commemorating the president’s 10th consecutive weekend at a Trump-branded propertyThe streak continues.thinkprogress.org NBC News estimates that by the end of this weekend, Trump will have spent 28 percent of his presidency traveling to or spending time at Mar-a-Lago. The costs of his $3 million-plus trips are adding up — Trump is reportedly on track to spend more taxpayer dollars in a single year on travel than President Obama did during his entire two terms in office. Sen. Jeff Flake (R-AZ) was asked about Trump’s travel during a town hall on Thursday night. “As a fiscal conservative, what is your position on all the weekend trips that the preisdent makes down to Mar-a-Lago?” an attendee asked. The senator responded with a false equivalency. “With regard to presidents and what they do on the weekend, I’m not going to criticize presidents,” Flake said, as boos erupted. “I refrained from criticizing President Obama, and I’ll refrain from criticizing President Trump.” Flake reiterated the false equivalency when Trump’s Mar-a-Lago trips were brought up at another point, saying, “As I mentioned, I wasn’t critical of the last president or the president before that for what they do on their time off.” But not only was Obama’s travel far less frequent and costly than Trump’s, he also didn’t enrich himself in the process. Trump’s frequent travels to Mar-a-Lago have coincided with membership dues doubling to $200,000. His trips to his golf courses have coincided with his sons marketing them. And because Trump still owns his business, he’s able to profit off his office in an unprecedented way. Flake was also asked about Trump’s tax returns. He responded by saying that while he thinks “it’s a good policy” to release them, he won’t support efforts in Congress to make Trump’s public. “I think that ought to be handled in the election,” Flake said. “If you feel somebody isn’t being transparent, you don’t vote for them.” But during the campaign, Trump repeatedly promised to release his tax returns upon the completion of an audit. “I’m under a routine audit and it’ll be released, and as soon as the audit is finished it will be released,” Trump said during the first debate in September. Flake was at times critical of Trump during the campaign, but has largely supported Trump’s agenda since he’s become president. He’s up for reelection next year and is considered a top Democratic target. ", "child": "455_1\t455_2\t455_3\t455_4\t455_5\t455_6\t455_7\t455_8\t455_9\t455_10\t455_11\t455_12\t455_13\t455_14\t455_15\t455_16\t455_17\t455_18\t455_19\t455_20\t455_21\t455_22\t455_23\t455_24\t455_25"}