{"name": "457", "parent": "", "title": "Donald Jr. admits there is no barrier between President Trump and his businesses", "sentences": [{"1adc": "Donald Jr. admits there is no barrier between President Trump and his businesses"}, {"33ba": "Trump’s sons are supposed to keep him away from his businesses. But according to them, they talk frequently."}, {"6cba": "Eric Trump, Ivanka Trump, Donald Trump and Donald Trump, Jr. at a press conference for the President-Elect in New York City. CREDIT: Dennis Van Tine/STAR MAX/IPx"}, {"0848": "President Donald Trump has ignored the advice of the independent Office of Government Ethics and other ethics experts to fully divest from his businesses. Instead, he insists that, because he has resigned from management positions and handed control over to his adult sons Eric and Donald Jr., he has no conflicts."}, {"e042": "Trump and his lawyers say that by putting his sons in charge, Trump has set up a firewall between his administration and his businesses, though he still owns them. But his sons’ own public statements show there’s no firewall at all."}, {"a2b8": "Donald Trump Jr. told the Associate Press on Tuesday that he “has spoken to his father more frequently in recent weeks,” though he said he didn’t discuss the details of either business or the government with his father."}, {"0292": "Yet a few weeks ago, defending his father’s business arrangements, Trump Jr. said he had almost no contact with his father."}, {"37da": "“I basically have zero contact with him at this point,” he said in a speech at a GOP fundraiser in Dallas, according to NBC news."}, {"93ef": "In a March interview with Forbes, Eric Trump said that he would give his father business profitability updates as often as every quarter."}, {"5d79": "“My father and I are very close,” Eric Trump said. “I talk to him a lot. We’re pretty inseparable.” According to Forbes, Eric Trump’s admission that he’d give his father business reports came less than two minutes after he said that he and his father didn’t discuss the government or the business."}, {"f998": "Eric Trump also told the Telegraph on Monday that he expects his father is watching his businesses closely — despite Trump having vowed many times that he’d have no conflicts with his businesses as president because he “couldn’t care less” about them."}, {"f2ac": "New reports confirm Trump’s plan to disentangle from his business is a farceThe conflicts of interest remain.thinkprogress.org"}, {"1885": "According to the Telegraph’s report, Eric Trump said that he expected his father “will be watching closely” as Eric stewards his projects in Scotland — and that when Trump makes a state visit to the UK later this year, he’ll probably stop by to check on it and play a round of golf."}, {"84e5": "“Hey, if he is over in this part of the world, would he I’m sure love to come over and play a round of golf. Absolutely, no question about it. This is a property he loves,” Eric Trump said."}, {"7feb": "Eric and Donald Trump Jr have also been included in some of Trump’s government meetings and events, despite their claims that they have no involvement whatsoever in the Trump administration. They were even official members of his transition team."}, {"6b8a": "Because Trump hasn’t divested from his businesses, his separation from the vast conflicts of interest they pose is already shaky — and any separation at all rests wholly on his promise not to talk to his sons about them. None of the parties involved have provided any way to verify that this promise has been kept — and now, reports keep leaking out from Trump Jr. and Eric Trump themselves that President Trump is much more informed on his businesses than he alleges."}, {"90c4": "It’s just one more piece of evidence that Trump’s separation from his businesses is no more than a corporate shell game, and that there is little to stop him from making decisions as president that enrich him personally."}, {"c8f2": "“He is breaking down one of the few barriers he claimed to be establishing between him and his businesses, and those barriers themselves were weak to begin with. But if he is now going to get reports from his son about the businesses, then he really isn’t separate in any real way,” Larry Noble, general counsel of the nonpartisan Campaign Legal Center and a former chief ethics officer at the Federal Election Commission, told Forbes."}], "content": "Donald Jr. admits there is no barrier between President Trump and his businesses Trump’s sons are supposed to keep him away from his businesses. But according to them, they talk frequently. Eric Trump, Ivanka Trump, Donald Trump and Donald Trump, Jr. at a press conference for the President-Elect in New York City. CREDIT: Dennis Van Tine/STAR MAX/IPx President Donald Trump has ignored the advice of the independent Office of Government Ethics and other ethics experts to fully divest from his businesses. Instead, he insists that, because he has resigned from management positions and handed control over to his adult sons Eric and Donald Jr., he has no conflicts. Trump and his lawyers say that by putting his sons in charge, Trump has set up a firewall between his administration and his businesses, though he still owns them. But his sons’ own public statements show there’s no firewall at all. Donald Trump Jr. told the Associate Press on Tuesday that he “has spoken to his father more frequently in recent weeks,” though he said he didn’t discuss the details of either business or the government with his father. Yet a few weeks ago, defending his father’s business arrangements, Trump Jr. said he had almost no contact with his father. “I basically have zero contact with him at this point,” he said in a speech at a GOP fundraiser in Dallas, according to NBC news. In a March interview with Forbes, Eric Trump said that he would give his father business profitability updates as often as every quarter. “My father and I are very close,” Eric Trump said. “I talk to him a lot. We’re pretty inseparable.” According to Forbes, Eric Trump’s admission that he’d give his father business reports came less than two minutes after he said that he and his father didn’t discuss the government or the business. Eric Trump also told the Telegraph on Monday that he expects his father is watching his businesses closely — despite Trump having vowed many times that he’d have no conflicts with his businesses as president because he “couldn’t care less” about them. New reports confirm Trump’s plan to disentangle from his business is a farceThe conflicts of interest remain.thinkprogress.org According to the Telegraph’s report, Eric Trump said that he expected his father “will be watching closely” as Eric stewards his projects in Scotland — and that when Trump makes a state visit to the UK later this year, he’ll probably stop by to check on it and play a round of golf. “Hey, if he is over in this part of the world, would he I’m sure love to come over and play a round of golf. Absolutely, no question about it. This is a property he loves,” Eric Trump said. Eric and Donald Trump Jr have also been included in some of Trump’s government meetings and events, despite their claims that they have no involvement whatsoever in the Trump administration. They were even official members of his transition team. Because Trump hasn’t divested from his businesses, his separation from the vast conflicts of interest they pose is already shaky — and any separation at all rests wholly on his promise not to talk to his sons about them. None of the parties involved have provided any way to verify that this promise has been kept — and now, reports keep leaking out from Trump Jr. and Eric Trump themselves that President Trump is much more informed on his businesses than he alleges. It’s just one more piece of evidence that Trump’s separation from his businesses is no more than a corporate shell game, and that there is little to stop him from making decisions as president that enrich him personally. “He is breaking down one of the few barriers he claimed to be establishing between him and his businesses, and those barriers themselves were weak to begin with. But if he is now going to get reports from his son about the businesses, then he really isn’t separate in any real way,” Larry Noble, general counsel of the nonpartisan Campaign Legal Center and a former chief ethics officer at the Federal Election Commission, told Forbes. ", "child": "457_1\t457_2\t457_3\t457_4\t457_5\t457_6\t457_7\t457_8\t457_9\t457_10\t457_11"}