{"name": "458", "parent": "", "title": "Commemorating the president’s 10th consecutive weekend at a Trump-branded property", "sentences": [{"4a8c": "Commemorating the president’s 10th consecutive weekend at a Trump-branded property"}, {"1b89": "The streak continues."}, {"555f": "By Aaron Rupar and Diana Ofosu"}, {"80c6": "Though the Camp David retreat is available for presidential summits, President Trump decided to hold his first get-together with Chinese President Xi Jinping at his private club in Florida this week."}, {"86d2": "The two leaders had a “working lunch” at Mar-a-Lago on Friday. Then, on Saturday, Trump headed to the Trump International Golf Club in West Palm Beach. This marks the 10th consecutive weekend he’s visited a Trump-branded property during his time as president."}, {"fabd": "Each of those trips costs taxpayers more than $3 million, meaning Trump has already racked up about $20 million in needless travel costs. Meanwhile, the budget Trump proposed would cut funding for after-school programs, meals for poor people, and heating assistance that helps keep folks alive."}, {"8171": "Here’s a weekend-by-weekend look at Trump’s visits to his properties:"}, {"637c": "During the campaign, Trump promised that he “would rarely leave the White House because there’s so much work to be done” and “would not be a president who took vacations” because “you don’t have time to take time off.” Consider that promise obliterated. And since Trump refused to divest from his company, his frequent visits to properties with his name on them also generates free publicity for his brand and profit off the presidency in an unprecedented manner."}, {"6768": "Graphics by Diana Ofosu."}], "content": "Commemorating the president’s 10th consecutive weekend at a Trump-branded property The streak continues. By Aaron Rupar and Diana Ofosu Though the Camp David retreat is available for presidential summits, President Trump decided to hold his first get-together with Chinese President Xi Jinping at his private club in Florida this week. The two leaders had a “working lunch” at Mar-a-Lago on Friday. Then, on Saturday, Trump headed to the Trump International Golf Club in West Palm Beach. This marks the 10th consecutive weekend he’s visited a Trump-branded property during his time as president. Each of those trips costs taxpayers more than $3 million, meaning Trump has already racked up about $20 million in needless travel costs. Meanwhile, the budget Trump proposed would cut funding for after-school programs, meals for poor people, and heating assistance that helps keep folks alive. Here’s a weekend-by-weekend look at Trump’s visits to his properties: During the campaign, Trump promised that he “would rarely leave the White House because there’s so much work to be done” and “would not be a president who took vacations” because “you don’t have time to take time off.” Consider that promise obliterated. And since Trump refused to divest from his company, his frequent visits to properties with his name on them also generates free publicity for his brand and profit off the presidency in an unprecedented manner. Graphics by Diana Ofosu. ", "child": "458_1\t458_2\t458_3\t458_4\t458_5\t458_6\t458_7\t458_8\t458_9\t458_10\t458_11"}