{"name": "459", "parent": "", "title": "Ambassador’s tweet accidentally reveals that Trump is violating the Constitution", "sentences": [{"f080": "Ambassador’s tweet accidentally reveals that Trump is violating the Constitution"}, {"5533": "This is why the emoluments clause is important."}, {"ffb2": "The Trump International Hotel at 1100 Pennsylvania Avenue NW, is seen Wednesday, Dec. 21, 2016 in Washington. CREDIT: AP Photo/Alex Brandon"}, {"e00b": "Before President Donald Trump took office, “emoluments clause” was hardly a common phrase, even in the politics- and history-obsessed city of Washington, D.C. Now that Trump is in the White House, however, the Constitution’s chief protection against foreign bribes has become one of the primary controversies of his presidency — and on Thursday, a Georgian ambassador inadvertently showed why."}, {"4981": "“Great #hotel and so far the best service I’ve seen in the United States! Keep it up!” Ambassador Kaha Imnadze tweeted, accompanied by a picture from inside the Trump International Hotel in downtown D.C."}, {"49f0": "Imnadze’s tweet is not only a stark example of an emolument — an illegal payment from a foreign government entity to the President of the United States — but also an indication of the importance of this clause’s guard against corruption."}, {"8564": "The framers crafted the emoluments clause to silo off the president from any foreign influence; that is, to prevent any temptation of foreign-policy favoritism based on gifts or bribes. It prohibits the U.S. president from receiving “any present, Emolument, Office, or Title, of any kind whatever” from a foreign government or its dignitaries without the express consent of Congress."}, {"9164": "Enter President Donald Trump, who owns an international real estate empire. It’s a perfect avenue for foreign governments to attempt to curry favor by patronizing his hotels, thereby funneling money into his pockets."}, {"d9cc": "Since Trump became the president, his downtown D.C. hotel has become the new go-to place for foreign embassy events, diplomats, and even lobbyists and government officials looking to get close to the President."}, {"2f3f": "Imnadze, a foreign government agent, clearly wants his stay at the Trump International hotel to be noticed. His tweet isn’t part of his common travel practice: He has never before tweeted about a hotel, and most of his few previous tweets tagged “#travel” have been travel advertisements for Georgia."}, {"2d42": "It is, however, a clear example of how foreign governments are using Trump’s hotels to curry favor with his administration."}, {"c443": "“Rumor has it that there are quite a few of these forbidden foreign government payments to Donald Trump that are taking place in secret. This is some evidence of that,” Norm Eisen, President Barack Obama’s chief ethics counsel, told ThinkProgress regarding Imnadze’s tweet."}, {"6b7a": "Eisen and the nonpartisan government watchdog group he co-chairs, Citizens for Responsibility and Ethics in Washington (CREW), are currently suing the president for his alleged violation of the Constitution."}, {"e6c1": "“We also know of Saudi and other Middle East examples. We will find out about a lot more when we get to discovery in our case,” Eisen said. He also pointed out that, now that Ivanka Trump has an official government post, foreign payments to the hotel concern her too. She owns part of the property, along with her father and brothers Eric and Donald Jr."}, {"0d22": "“This is not just a problem for the president but, now that she works for him, for his daughter. According to her financial disclosures, she apparently benefits from the foreign government payments there as well. If so, that’s a violation too,” Eisen said."}, {"629b": "Trump administration decides Trump isn’t violating his government lease“It is harmful to the integrity — and thus credibility — of GSA, the Presidency, and federal procurement process.”thinkprogress.org"}, {"819e": "Trump’s downtown D.C. hotel has emerged as one of the key sites in the emoluments controversy, in part because of its location just a few blocks from the White House."}, {"f96c": "It’s also the site of another type of corruption: Trump is leasing the building from the government, effectively making him both tenant and landlord. This is prohibited by most government leases, including Trump’s."}, {"8978": "The General Services Administration, which administers the lease (and is now part of the Trump administration), however, ruled that Trump’s ownership is not a violation. Ethics experts weren’t convinced by this reasoning."}, {"f7a5": "“Not only is the conclusion unexpected and unpersuasive, as a matter of law, but, as a matter of policy, it is harmful to the integrity — and thus credibility — of GSA, the Presidency, and federal procurement process,” Steven L. Schooner, George Washington University Professor of Government Procurement Law, previously told ThinkProgress."}], "content": "Ambassador’s tweet accidentally reveals that Trump is violating the Constitution This is why the emoluments clause is important. The Trump International Hotel at 1100 Pennsylvania Avenue NW, is seen Wednesday, Dec. 21, 2016 in Washington. CREDIT: AP Photo/Alex Brandon Before President Donald Trump took office, “emoluments clause” was hardly a common phrase, even in the politics- and history-obsessed city of Washington, D.C. Now that Trump is in the White House, however, the Constitution’s chief protection against foreign bribes has become one of the primary controversies of his presidency — and on Thursday, a Georgian ambassador inadvertently showed why. “Great #hotel and so far the best service I’ve seen in the United States! Keep it up!” Ambassador Kaha Imnadze tweeted, accompanied by a picture from inside the Trump International Hotel in downtown D.C. Imnadze’s tweet is not only a stark example of an emolument — an illegal payment from a foreign government entity to the President of the United States — but also an indication of the importance of this clause’s guard against corruption. The framers crafted the emoluments clause to silo off the president from any foreign influence; that is, to prevent any temptation of foreign-policy favoritism based on gifts or bribes. It prohibits the U.S. president from receiving “any present, Emolument, Office, or Title, of any kind whatever” from a foreign government or its dignitaries without the express consent of Congress. Enter President Donald Trump, who owns an international real estate empire. It’s a perfect avenue for foreign governments to attempt to curry favor by patronizing his hotels, thereby funneling money into his pockets. Since Trump became the president, his downtown D.C. hotel has become the new go-to place for foreign embassy events, diplomats, and even lobbyists and government officials looking to get close to the President. Imnadze, a foreign government agent, clearly wants his stay at the Trump International hotel to be noticed. His tweet isn’t part of his common travel practice: He has never before tweeted about a hotel, and most of his few previous tweets tagged “#travel” have been travel advertisements for Georgia. It is, however, a clear example of how foreign governments are using Trump’s hotels to curry favor with his administration. “Rumor has it that there are quite a few of these forbidden foreign government payments to Donald Trump that are taking place in secret. This is some evidence of that,” Norm Eisen, President Barack Obama’s chief ethics counsel, told ThinkProgress regarding Imnadze’s tweet. Eisen and the nonpartisan government watchdog group he co-chairs, Citizens for Responsibility and Ethics in Washington (CREW), are currently suing the president for his alleged violation of the Constitution. “We also know of Saudi and other Middle East examples. We will find out about a lot more when we get to discovery in our case,” Eisen said. He also pointed out that, now that Ivanka Trump has an official government post, foreign payments to the hotel concern her too. She owns part of the property, along with her father and brothers Eric and Donald Jr. “This is not just a problem for the president but, now that she works for him, for his daughter. According to her financial disclosures, she apparently benefits from the foreign government payments there as well. If so, that’s a violation too,” Eisen said. Trump administration decides Trump isn’t violating his government lease“It is harmful to the integrity — and thus credibility — of GSA, the Presidency, and federal procurement process.”thinkprogress.org Trump’s downtown D.C. hotel has emerged as one of the key sites in the emoluments controversy, in part because of its location just a few blocks from the White House. It’s also the site of another type of corruption: Trump is leasing the building from the government, effectively making him both tenant and landlord. This is prohibited by most government leases, including Trump’s. The General Services Administration, which administers the lease (and is now part of the Trump administration), however, ruled that Trump’s ownership is not a violation. Ethics experts weren’t convinced by this reasoning. “Not only is the conclusion unexpected and unpersuasive, as a matter of law, but, as a matter of policy, it is harmful to the integrity — and thus credibility — of GSA, the Presidency, and federal procurement process,” Steven L. Schooner, George Washington University Professor of Government Procurement Law, previously told ThinkProgress. ", "child": "459_1\t459_2\t459_3\t459_4\t459_5\t459_6\t459_7\t459_8\t459_9\t459_10\t459_11\t459_12\t459_13\t459_14\t459_15\t459_16\t459_17\t459_18\t459_19\t459_20\t459_21\t459_22\t459_23\t459_24\t459_25"}