{"name": "462", "parent": "", "title": "In epic letter, investment fund fires law firm for enabling the Trump kleptocracy", "sentences": [{"462c": "In epic letter, investment fund fires law firm for enabling the Trump kleptocracy"}, {"604f": "“America deserves a President of undivided loyalty. Your firm has denied them that.”"}, {"94db": "President-elect Donald Trump speaks during a news conference in the lobby of Trump Tower in New York, Wednesday, Jan. 11, 2017. CREDIT: AP Photo/Evan Vucci"}, {"561c": "The Wallace Global Fund is sick of pretending."}, {"433e": "In a scathing letter, the investment fund fired its elite law firm, Morgan Lewis, for its role in enabling Donald Trump to use the presidency to line his pockets."}, {"1174": "In January, Morgan Lewis partner Sheri Dillon publicly signed off on Trump’s plan to maintain ownership of his business empire while president. Instead, Dillon established a variety of measures that fell “well short of the steps recommended by the Office of Government Ethics.”"}, {"4843": "Trump, meanwhile, is not even hiding his efforts to use the prestige of the presidency for profit. He has spent the last nine consecutive weekends at Trump-branded properties."}, {"152a": "Now, one of Morgan Lewis’ clients has had enough. In its letter, the Wallace Global Fund accuses Morgan Lewis of abetting “corruption and an assault on our democracy.”"}, {"a1d2": "The Office of Government Ethics has recommended that, in order to avoid conflicts of interest while he occupies the White House, Trump should divest from his business assets through a blind trust."}, {"7fba": "Instead, Morgan Lewis signed off on a plan for Trump to hand over operational control of his businesses to his two sons and another long-term executive. The plan also established a hand-picked “Ethics Adviser” who would sign off on new deals struck by the Trump Organization while Trump is president."}, {"5724": "The Wallace Fund writes that Morgan Lewis has “legitimized a complete non-solution to Trump’s manifold conflicts, both foreign and domestic.”"}, {"9bf2": "Indeed, Eric Trump recently revealed that he is in regular contact with his father and will update him quarterly on the financial performance of his companies."}, {"3376": "The Wallace Fund also blasts Morgan Lewis for largely ignoring the Constitutional prohibition on presidents receiving payments from foreign governments. Trump will purportedly donate the “profits” from foreign governments spending money at his hotels, a step that has been widely dismissed as insufficient and unenforceable."}, {"07ea": "A business partner of Trump’s in Las Vegas recently revealed that Trump is not taking steps to segregate profits from foreign governments."}, {"c05c": "The letter ticks through the “ethical carnage” that has piled up since Morgan Lewis blessed Trump’s plan: the doubling of initiation fees at Mar-a-lago, Trump’s private club; the courting of foreign governments at Trump’s D.C. hotel; and his numerous financial entanglements with the Chinese government."}, {"b763": "“America deserves a President of undivided loyalty. Your firm has denied them that. We cannot be complicit in that,” the letter concludes."}], "content": "In epic letter, investment fund fires law firm for enabling the Trump kleptocracy “America deserves a President of undivided loyalty. Your firm has denied them that.” President-elect Donald Trump speaks during a news conference in the lobby of Trump Tower in New York, Wednesday, Jan. 11, 2017. CREDIT: AP Photo/Evan Vucci The Wallace Global Fund is sick of pretending. In a scathing letter, the investment fund fired its elite law firm, Morgan Lewis, for its role in enabling Donald Trump to use the presidency to line his pockets. In January, Morgan Lewis partner Sheri Dillon publicly signed off on Trump’s plan to maintain ownership of his business empire while president. Instead, Dillon established a variety of measures that fell “well short of the steps recommended by the Office of Government Ethics.” Trump, meanwhile, is not even hiding his efforts to use the prestige of the presidency for profit. He has spent the last nine consecutive weekends at Trump-branded properties. Now, one of Morgan Lewis’ clients has had enough. In its letter, the Wallace Global Fund accuses Morgan Lewis of abetting “corruption and an assault on our democracy.” The Office of Government Ethics has recommended that, in order to avoid conflicts of interest while he occupies the White House, Trump should divest from his business assets through a blind trust. Instead, Morgan Lewis signed off on a plan for Trump to hand over operational control of his businesses to his two sons and another long-term executive. The plan also established a hand-picked “Ethics Adviser” who would sign off on new deals struck by the Trump Organization while Trump is president. The Wallace Fund writes that Morgan Lewis has “legitimized a complete non-solution to Trump’s manifold conflicts, both foreign and domestic.” Indeed, Eric Trump recently revealed that he is in regular contact with his father and will update him quarterly on the financial performance of his companies. The Wallace Fund also blasts Morgan Lewis for largely ignoring the Constitutional prohibition on presidents receiving payments from foreign governments. Trump will purportedly donate the “profits” from foreign governments spending money at his hotels, a step that has been widely dismissed as insufficient and unenforceable. A business partner of Trump’s in Las Vegas recently revealed that Trump is not taking steps to segregate profits from foreign governments. The letter ticks through the “ethical carnage” that has piled up since Morgan Lewis blessed Trump’s plan: the doubling of initiation fees at Mar-a-lago, Trump’s private club; the courting of foreign governments at Trump’s D.C. hotel; and his numerous financial entanglements with the Chinese government. “America deserves a President of undivided loyalty. Your firm has denied them that. We cannot be complicit in that,” the letter concludes. ", "child": "462_1\t462_2\t462_3\t462_4\t462_5\t462_6\t462_7\t462_8\t462_9\t462_10\t462_11\t462_12\t462_13\t462_14\t462_15\t462_16\t462_17\t462_18\t462_19\t462_20\t462_21\t462_22\t462_23\t462_24\t462_25"}