{"name": "483", "parent": "", "title": "An Open Letter to Tom McClintock", "sentences": [{"fd38": "An Open Letter to Tom McClintock"}, {"ecd3": "Dear Tom,"}, {"7578": "I’ve been to all our town hall meetings so far this year. You may remember me as the guy who ran out into the middle of the gymnasium at the El Dorado Hills Town Hall, waving my arms in downward gestures, and putting a finger to my lips to try and quiet the audience after they exploded in outrage after you told DREAMer Doris Romero that she should leave her home and return to El Salvador. (I was worried about our meeting coming to a premature end.) Then, afterwards, I was the guy who “shooshed” you repeatedly as I tried to answer your question over your constant interruptions and over-talking. I’m also the guy that put you on notice at the Mariposa Town Hall.  Given all that we’ve already been through together, I thought it was time I introduced myself."}, {"df9f": "My name is Paul Smith. I am a co-founder of Indivisible Citizens of California’s 4th Congressional District. I’ve been a homeowner and resident in Rocklin for the past 17 years. Both of my children were born here in CA-04, and they’ve thrived under the tutelage of the amazing public school teachers in Rocklin Unified School District. Since I moved here, I’ve been actively involved in educational technology and “EdTech” startups. Currently, I am a Senior Global Marketing Manager at Apple. That title will hold until April 28th when I leave the company and wholly commit myself to kicking you out of office in 2018."}, {"b3bc": "Just a regular family guy who loves his country, and loves CA-04."}, {"d06c": "I live in our district. You do not. You are an outsider: Technically, and quite literally a “carpetbagger” from Los Angeles, now living in Elk Grove. You are a constituent of CA-07 and Ami Bera is your representative. You can’t even vote for yourself. I am writing today to address recent fundraising spam you’ve been sending out to your email list, and comments you made recently on Fox News. You said in response to a question about last Saturday’s town hall meeting:"}, {"b54e": "“What we’re seeing is the “radical left” on full display; the appalling lack of civility, the intolerance for any dissenting viewpoints…”"}, {"5f3d": "I see your propaganda, and I raise you a whole pile of truth. In fact, I’m all in. Let’s put our cards on the table, shall we?"}, {"aa7d": "Tom’s 5-Step Plan for Dividing and Conquering:"}, {"b181": "I hate to break it to you, but it’s not going to work. You’re up against something you don’t understand. Your usual way of pitting us against each other is now working against you, as more, and more people like me begin to put sunshine on your divisive antics."}, {"5d9d": "This is a mainstream uprising. The “radical left” you are attempting to promote is actually a very large collective of regular folks. We are mothers, children, fathers, grandparents, neighbors and friends. Most of us have never been active in politics prior to the 2016 election. We are frustrated, but we are expressing that frustration through acts of kindness, support, and peaceful protest. We are stepping out and stepping up, lifting our collective voice to affect positive change in our communities, and our government. Over the next two months, two things are going to happen:"}, {"6333": "First, my team and I are going to continue a targeted campaign, helping key segments across our district learn all about who Indivisible is, and what our district is all about. So far, our progress has been remarkable. In just two months we’ve gained more followers on Facebook than all northern California Tea Party and Democratic groups combined, and nearly as many followers as the Republicans of California, and their page has been up for 4 years. Our organization now includes 24 local Progressive, Environmental, and Democrat groups who together represent more than 10,000 members."}, {"5ffa": "Second, there is going to be an ongoing, and aggressive campaign to educate constituents across the district about who you are, what you’ve said, the votes you’ve made and how you are working against our collective interests. Your unwavering support of Trump will be a heavy albatross you wear around your neck as you slog your way through your losing 2018 reelection campaign."}, {"a958": "All of which will be funded with nothing more than blood, sweat, tears, and good ole 21st century Growth Marketing know-how."}, {"0179": "So please continue with your hateful propaganda. It’s working beautifully for us. Your divisive comments are dismissive of all the people who opened their remarks with a respectful “thank you” and addressed you as “Representative” despite the fact that they feel that you do not represent them in D.C. You’re making your constituents angry, and this is exactly the fuel we need to continue our unprecedented growth.  Regards, Paul SmithCo-founder and Director of MarketingIndivisible Citizens of California’s 4th Congressional District(916) 741–3389 c.paul@indivisibleca04.comindivisibleca04.comAll About Me"}], "content": "An Open Letter to Tom McClintock Dear Tom, I’ve been to all our town hall meetings so far this year. You may remember me as the guy who ran out into the middle of the gymnasium at the El Dorado Hills Town Hall, waving my arms in downward gestures, and putting a finger to my lips to try and quiet the audience after they exploded in outrage after you told DREAMer Doris Romero that she should leave her home and return to El Salvador. (I was worried about our meeting coming to a premature end.) Then, afterwards, I was the guy who “shooshed” you repeatedly as I tried to answer your question over your constant interruptions and over-talking. I’m also the guy that put you on notice at the Mariposa Town Hall.  Given all that we’ve already been through together, I thought it was time I introduced myself. My name is Paul Smith. I am a co-founder of Indivisible Citizens of California’s 4th Congressional District. I’ve been a homeowner and resident in Rocklin for the past 17 years. Both of my children were born here in CA-04, and they’ve thrived under the tutelage of the amazing public school teachers in Rocklin Unified School District. Since I moved here, I’ve been actively involved in educational technology and “EdTech” startups. Currently, I am a Senior Global Marketing Manager at Apple. That title will hold until April 28th when I leave the company and wholly commit myself to kicking you out of office in 2018. Just a regular family guy who loves his country, and loves CA-04. I live in our district. You do not. You are an outsider: Technically, and quite literally a “carpetbagger” from Los Angeles, now living in Elk Grove. You are a constituent of CA-07 and Ami Bera is your representative. You can’t even vote for yourself. I am writing today to address recent fundraising spam you’ve been sending out to your email list, and comments you made recently on Fox News. You said in response to a question about last Saturday’s town hall meeting: “What we’re seeing is the “radical left” on full display; the appalling lack of civility, the intolerance for any dissenting viewpoints…” I see your propaganda, and I raise you a whole pile of truth. In fact, I’m all in. Let’s put our cards on the table, shall we? Tom’s 5-Step Plan for Dividing and Conquering: I hate to break it to you, but it’s not going to work. You’re up against something you don’t understand. Your usual way of pitting us against each other is now working against you, as more, and more people like me begin to put sunshine on your divisive antics. This is a mainstream uprising. The “radical left” you are attempting to promote is actually a very large collective of regular folks. We are mothers, children, fathers, grandparents, neighbors and friends. Most of us have never been active in politics prior to the 2016 election. We are frustrated, but we are expressing that frustration through acts of kindness, support, and peaceful protest. We are stepping out and stepping up, lifting our collective voice to affect positive change in our communities, and our government. Over the next two months, two things are going to happen: First, my team and I are going to continue a targeted campaign, helping key segments across our district learn all about who Indivisible is, and what our district is all about. So far, our progress has been remarkable. In just two months we’ve gained more followers on Facebook than all northern California Tea Party and Democratic groups combined, and nearly as many followers as the Republicans of California, and their page has been up for 4 years. Our organization now includes 24 local Progressive, Environmental, and Democrat groups who together represent more than 10,000 members. Second, there is going to be an ongoing, and aggressive campaign to educate constituents across the district about who you are, what you’ve said, the votes you’ve made and how you are working against our collective interests. Your unwavering support of Trump will be a heavy albatross you wear around your neck as you slog your way through your losing 2018 reelection campaign. All of which will be funded with nothing more than blood, sweat, tears, and good ole 21st century Growth Marketing know-how. So please continue with your hateful propaganda. It’s working beautifully for us. Your divisive comments are dismissive of all the people who opened their remarks with a respectful “thank you” and addressed you as “Representative” despite the fact that they feel that you do not represent them in D.C. You’re making your constituents angry, and this is exactly the fuel we need to continue our unprecedented growth.  Regards, Paul SmithCo-founder and Director of MarketingIndivisible Citizens of California’s 4th Congressional District(916) 741–3389 c.paul@indivisibleca04.comindivisibleca04.comAll About Me ", "child": "483_1\t483_2\t483_3\t483_4\t483_5\t483_6\t483_7\t483_8"}