{"name": "486", "parent": "", "title": "Mike Pence’s dinner rule would stop female journalists from doing their jobs", "sentences": [{"2c9c": "Mike Pence’s dinner rule would stop female journalists from doing their jobs"}, {"fff3": "If men hadn’t been willing to meet me for a meal, I would have had to eat alone. That would mean missing out on stories"}, {"c370": "But do they have any female friends? (Credit: Twitter)"}, {"20c0": "Last week the Washington Post published a profile of America’s vice-president, Mike Pence, a single detail from which has sparked fierce debate. It repeated a fact about Mr Pence quoted in an article in The Hill, a political website, in 2002, to the effect that he never ate alone with a woman other than his wife, or attended events at which alcohol would be served, unless she was at his side. Cue for conservatives and evangelicals to praise Mr Pence for avoiding sin by adhering to what is apparently known as the “Billy Graham” rule — and for feminists and liberals to complain that it cast all women as temptresses, and shut them out of opportunities to network with powerful men."}, {"331d": "“If Mr Pence’s rule were to be widely followed, I would have been unable to do my job. The Economist would have had to send a man instead”"}, {"737c": "I’ve been thinking about the rule from a more specific perspective: what it would mean for female journalists, if many men were to stick to it. Between 2010 and 2013 I was The Economist’s Brazil correspondent, based in São Paulo (I’m now the editor of the International section, based in London). During that time I am sure I ate alone with dozens of men, maybe into triple figures. I went to plenty of events at which alcohol was served, without my husband and mingling with men unaccompanied by their wives. And I’ve concluded that, if Mr Pence’s rule were to be widely followed, I would have been unable to do my job. The Economist would have had to send a man instead."}, {"f6d7": "One reason for having meals with people is sheer efficiency. If you leave your husband and children behind in order to spend a few days in Brasília, or Rio — or deep in the Amazon rainforest, or visiting the stadiums being built for the World Cup — you want to make the most of your time. I tried to report for at least two stories everywhere I went. I generally scheduled at least two of my meals, often three, each day with people I wanted to interview. If I attended a conference I’d stay for the drinks afterwards, to mingle and get story ideas. If men hadn’t been willing to meet me for a meal, I would have had to eat alone."}, {"4e9c": "“Over a meal people become expansive; they unwind. They’re much more likely to tell you something interesting”"}, {"0d28": "That would have been miserable and time-wasting; more importantly, it would have meant missing out on a certain type of conversation. Over a meal people become expansive; they unwind. They’re much more likely to tell you something interesting and off-topic. To give just one unremarkable example, I remember a lunch I arranged in 2010 to talk about the approaching presidential election. Over coffee the man I had invited started to tell me about science funding in São Paulo state. I lingered, and later followed up with a couple of university visits. An article on developments of Brazilian science duly followed. (And as soon as I’ve finished writing this, I’m off to have lunch alone with another man, as it happens — this time to talk about mathematics education.)"}, {"aa87": "Relaxed conversations are also how journalists find out about that things that people, deep down, want to tell them — if you can persuade them. People who know about political corruption, or that a company is struggling, want to get a feel for you before they start to hint at what they know. Those who feel an obligation to be boosterish about, say, the economy or their industry’s prospects, often change their tone over the course of a meal. The best interviews, and therefore the best stories, were when I was able to forge a connection — and this was often easier in a situation that was framed as social, rather than strictly professional. To exaggerate only slightly, the best interviews had something of the feel of a conversation with a dear friend."}, {"f4e4": "And that, I think, gets to the heart of what bothers me about Mr Pence’s unwillingness to dine alone with a woman. It’s not so much that it would have made it impossible for me to do my job as well as a man could — though it would have, and I note that plenty of women do jobs that involve them being on the road and socialising, for example in civil engineering, or in sales, or representing firms at trade fairs. It’s that the point of the Billy Graham rule is, quite explicitly, to deny a man the chance ever to be confidential with a woman; that is, ever to make a friend of one."}, {"6db1": "If you never make a friend of a woman who is not your wife, you are unlikely to fall in love with one. And for anyone who values marriage and family, that will be an important benefit. But something is lost, too — and not only by the Mr Pences of this world."}, {"4a4c": "It is still men who run most countries and companies; who set public policies; who decide what taxpayers’ money should go on; and who write and enforce laws. If powerful men have no female friends (and someone you cannot have a private conversation with isn’t a true friend), then they are running the world in a state of profound, mostly unacknowledged, ignorance about women’s experiences, needs and lives. The recent pictures of Mr Pence with Donald Trump at an all-male meeting about reforming health insurance — at which reproductive care for women was dismissed as an “inessential” part of health insurance — are a vivid reminder of the consequences."}], "content": "Mike Pence’s dinner rule would stop female journalists from doing their jobs If men hadn’t been willing to meet me for a meal, I would have had to eat alone. That would mean missing out on stories But do they have any female friends? (Credit: Twitter) Last week the Washington Post published a profile of America’s vice-president, Mike Pence, a single detail from which has sparked fierce debate. It repeated a fact about Mr Pence quoted in an article in The Hill, a political website, in 2002, to the effect that he never ate alone with a woman other than his wife, or attended events at which alcohol would be served, unless she was at his side. Cue for conservatives and evangelicals to praise Mr Pence for avoiding sin by adhering to what is apparently known as the “Billy Graham” rule — and for feminists and liberals to complain that it cast all women as temptresses, and shut them out of opportunities to network with powerful men. “If Mr Pence’s rule were to be widely followed, I would have been unable to do my job. The Economist would have had to send a man instead” I’ve been thinking about the rule from a more specific perspective: what it would mean for female journalists, if many men were to stick to it. Between 2010 and 2013 I was The Economist’s Brazil correspondent, based in São Paulo (I’m now the editor of the International section, based in London). During that time I am sure I ate alone with dozens of men, maybe into triple figures. I went to plenty of events at which alcohol was served, without my husband and mingling with men unaccompanied by their wives. And I’ve concluded that, if Mr Pence’s rule were to be widely followed, I would have been unable to do my job. The Economist would have had to send a man instead. One reason for having meals with people is sheer efficiency. If you leave your husband and children behind in order to spend a few days in Brasília, or Rio — or deep in the Amazon rainforest, or visiting the stadiums being built for the World Cup — you want to make the most of your time. I tried to report for at least two stories everywhere I went. I generally scheduled at least two of my meals, often three, each day with people I wanted to interview. If I attended a conference I’d stay for the drinks afterwards, to mingle and get story ideas. If men hadn’t been willing to meet me for a meal, I would have had to eat alone. “Over a meal people become expansive; they unwind. They’re much more likely to tell you something interesting” That would have been miserable and time-wasting; more importantly, it would have meant missing out on a certain type of conversation. Over a meal people become expansive; they unwind. They’re much more likely to tell you something interesting and off-topic. To give just one unremarkable example, I remember a lunch I arranged in 2010 to talk about the approaching presidential election. Over coffee the man I had invited started to tell me about science funding in São Paulo state. I lingered, and later followed up with a couple of university visits. An article on developments of Brazilian science duly followed. (And as soon as I’ve finished writing this, I’m off to have lunch alone with another man, as it happens — this time to talk about mathematics education.) Relaxed conversations are also how journalists find out about that things that people, deep down, want to tell them — if you can persuade them. People who know about political corruption, or that a company is struggling, want to get a feel for you before they start to hint at what they know. Those who feel an obligation to be boosterish about, say, the economy or their industry’s prospects, often change their tone over the course of a meal. The best interviews, and therefore the best stories, were when I was able to forge a connection — and this was often easier in a situation that was framed as social, rather than strictly professional. To exaggerate only slightly, the best interviews had something of the feel of a conversation with a dear friend. And that, I think, gets to the heart of what bothers me about Mr Pence’s unwillingness to dine alone with a woman. It’s not so much that it would have made it impossible for me to do my job as well as a man could — though it would have, and I note that plenty of women do jobs that involve them being on the road and socialising, for example in civil engineering, or in sales, or representing firms at trade fairs. It’s that the point of the Billy Graham rule is, quite explicitly, to deny a man the chance ever to be confidential with a woman; that is, ever to make a friend of one. If you never make a friend of a woman who is not your wife, you are unlikely to fall in love with one. And for anyone who values marriage and family, that will be an important benefit. But something is lost, too — and not only by the Mr Pences of this world. It is still men who run most countries and companies; who set public policies; who decide what taxpayers’ money should go on; and who write and enforce laws. If powerful men have no female friends (and someone you cannot have a private conversation with isn’t a true friend), then they are running the world in a state of profound, mostly unacknowledged, ignorance about women’s experiences, needs and lives. The recent pictures of Mr Pence with Donald Trump at an all-male meeting about reforming health insurance — at which reproductive care for women was dismissed as an “inessential” part of health insurance — are a vivid reminder of the consequences. ", "child": "486_1\t486_2\t486_3\t486_4\t486_5\t486_6\t486_7\t486_8\t486_9\t486_10\t486_11\t486_12\t486_13\t486_14\t486_15\t486_16\t486_17\t486_18\t486_19\t486_20\t486_21\t486_22\t486_23"}