{"name": "497", "parent": "", "title": "Who’s fixing our streets?", "sentences": [{"5a34": "Who’s fixing our streets?"}, {"8167": "We’ve all felt the frustration of seeing things in our spaces which shouldn’t be there. Potholes, fly dumps, broken signage and streetlights, bad or nonexistent pedestrian walkways and crossings, and even rubbish bins in weird, not-useful places."}, {"a262": "Read Nick’s post on putting rubbish bins in sane places"}, {"2818": "Yes, council websites have contact details on their websites, and one can email, call it in or, if they’re on social media (and actually using it), pop them a tweet or Facebook post."}, {"b02a": "But this isn’t always convenient, and it doesn’t lend itself to developing an open, publicly-accessible record of issues and their resolutions. People calling in issues is also _far_ more expensive for councils (think call centre staff, time, etc), which are under increasing budgetary pressure."}, {"8a0f": "Fix my street, please"}, {"7366": "Enter FixMyStreet. The service has been around since 2007, and has been hugely successful overseas. Essentially, one reports an issue and its location, and the site automatically sends it through to the relevant council authorities."}, {"175e": "Read MySociety’s case study on FixMyStreet UK"}, {"e5d8": "There’s also a New Zealand version, built by local dev and#opendata advocate Jonathan Hunt (otherwise known as @kayakr). It’s a great example of civic tech."}, {"2bd1": "Why we keep banging on about civic tech"}, {"f5bd": "Screenshot from fixmystreet.org.nz, taken on 20 June 2016."}, {"6a12": "I was having a nosey around the site, and found myself wondering what a map of all issues — reported and fixed — might look like. It would be a great indication of a number of things, including:"}, {"93a7": "A lot of streets aren’t being fixed"}, {"2a37": "So, I built a map."}, {"b16a": "I scraped the overview table in http://fixmystreet.org.nz/reports, and then set about cleaning up the data. The main bit which, yes, I ended up doing manually so I could get the precision I wanted, was getting all the markers properly geolocated."}, {"f59e": "For this, I looked up the physical office address of each of the 67 district and city councils’ in the list, and then geocoded those."}, {"1557": "After this, I generated a bubble chart, which you can see, for new issues, fixed new issues, older issues and fixed older issues."}, {"3d4b": "What you see below is the result, and is exactly why I love data visualisation so much. Popping everything onto a map gives one an immediate, intuitive understanding of what’s going on throughout NZ."}, {"32cb": "If you’re wondering why there are a number of councils missing, it’s because the map’s been set not to show any 0 values. So in cases where a council has had nothing reported nor fixed, it doesn’t display. The other possibility is that the council wasn’t on the FixMyStreet site at all, which I reckon counts as a very solid “nothing reported nor fixed”."}, {"af99": "See the FixMyStreet NZ reports overview map and dataset"}, {"442b": "Taupo has a pretty active user base, and it looks like the council’s been very responsive! Less so councils like Wellington and Christchurch, where there’s a relatively active user base but less than a quarter of the reported issues have been fixed (or reported as fixed, at least)."}, {"6604": "And then there are the councils with an inactive or nonexistent user base, or councils which aren’t reporting fixing any (or very few) or the issues reported."}, {"9a2d": "Why aren’t people engaging?"}, {"1202": "I know that the site sends automated emails to councils, so I can’t help but wonder: are councils not fixing these issues, or are they simply not reporting them as fixed? Both cases will, over time, dissuade people from using FixMyStreet, and potentially from trying to engage with council. These days, with councils increasingly wanting to be seen to be actively working on improving engagement, this seems like a Bad Thing."}, {"df55": "The flip side is, of course — why aren’t people reporting issues using FixMyStreet? Is it because they don’t know about the services, or is it because they see a council which isn’t reporting issues as fixed, and so they stop bothering? Are there other reasons?"}, {"984c": "I propose two things:"}, {"06c7": "Given the relative dearth of actual local government performance KPIs and data in New Zealand*, I’m going to be keeping a close eye on how my council is doing on FixMyStreet."}, {"6eb2": "Because yes, while drawing amusing artwork** around potholes to force councils to finally fix them is amusing (and effective), I believe we can (all) do better :)"}, {"7a35": "— — —"}, {"c571": "Disclaimer: of course, this is just an overview. It would certainly be fascinating to dive in a little, and look at what sorts of issues people are reporting, which issues get fixed and how long it takes, and so on."}, {"2e72": "I’d love to see what other people are generating with this sort of thing, or hear your ideas on what analyses you’d like to see!"}, {"a28d": "— — —"}, {"a53e": "* LGNZ is hoping to improve matters with its Local Government Excellence Programme"}, {"3fed": "* Amusing and effective pothole artwork (warning, potentially NSFW)"}], "content": "Who’s fixing our streets? We’ve all felt the frustration of seeing things in our spaces which shouldn’t be there. Potholes, fly dumps, broken signage and streetlights, bad or nonexistent pedestrian walkways and crossings, and even rubbish bins in weird, not-useful places. Read Nick’s post on putting rubbish bins in sane places Yes, council websites have contact details on their websites, and one can email, call it in or, if they’re on social media (and actually using it), pop them a tweet or Facebook post. But this isn’t always convenient, and it doesn’t lend itself to developing an open, publicly-accessible record of issues and their resolutions. People calling in issues is also _far_ more expensive for councils (think call centre staff, time, etc), which are under increasing budgetary pressure. Fix my street, please Enter FixMyStreet. The service has been around since 2007, and has been hugely successful overseas. Essentially, one reports an issue and its location, and the site automatically sends it through to the relevant council authorities. Read MySociety’s case study on FixMyStreet UK There’s also a New Zealand version, built by local dev and#opendata advocate Jonathan Hunt (otherwise known as @kayakr). It’s a great example of civic tech. Why we keep banging on about civic tech Screenshot from fixmystreet.org.nz, taken on 20 June 2016. I was having a nosey around the site, and found myself wondering what a map of all issues — reported and fixed — might look like. It would be a great indication of a number of things, including: A lot of streets aren’t being fixed So, I built a map. I scraped the overview table in http://fixmystreet.org.nz/reports, and then set about cleaning up the data. The main bit which, yes, I ended up doing manually so I could get the precision I wanted, was getting all the markers properly geolocated. For this, I looked up the physical office address of each of the 67 district and city councils’ in the list, and then geocoded those. After this, I generated a bubble chart, which you can see, for new issues, fixed new issues, older issues and fixed older issues. What you see below is the result, and is exactly why I love data visualisation so much. Popping everything onto a map gives one an immediate, intuitive understanding of what’s going on throughout NZ. If you’re wondering why there are a number of councils missing, it’s because the map’s been set not to show any 0 values. So in cases where a council has had nothing reported nor fixed, it doesn’t display. The other possibility is that the council wasn’t on the FixMyStreet site at all, which I reckon counts as a very solid “nothing reported nor fixed”. See the FixMyStreet NZ reports overview map and dataset Taupo has a pretty active user base, and it looks like the council’s been very responsive! Less so councils like Wellington and Christchurch, where there’s a relatively active user base but less than a quarter of the reported issues have been fixed (or reported as fixed, at least). And then there are the councils with an inactive or nonexistent user base, or councils which aren’t reporting fixing any (or very few) or the issues reported. Why aren’t people engaging? I know that the site sends automated emails to councils, so I can’t help but wonder: are councils not fixing these issues, or are they simply not reporting them as fixed? Both cases will, over time, dissuade people from using FixMyStreet, and potentially from trying to engage with council. These days, with councils increasingly wanting to be seen to be actively working on improving engagement, this seems like a Bad Thing. The flip side is, of course — why aren’t people reporting issues using FixMyStreet? Is it because they don’t know about the services, or is it because they see a council which isn’t reporting issues as fixed, and so they stop bothering? Are there other reasons? I propose two things: Given the relative dearth of actual local government performance KPIs and data in New Zealand*, I’m going to be keeping a close eye on how my council is doing on FixMyStreet. Because yes, while drawing amusing artwork** around potholes to force councils to finally fix them is amusing (and effective), I believe we can (all) do better :) — — — Disclaimer: of course, this is just an overview. It would certainly be fascinating to dive in a little, and look at what sorts of issues people are reporting, which issues get fixed and how long it takes, and so on. I’d love to see what other people are generating with this sort of thing, or hear your ideas on what analyses you’d like to see! — — — * LGNZ is hoping to improve matters with its Local Government Excellence Programme * Amusing and effective pothole artwork (warning, potentially NSFW) ", "child": "497_1\t497_2\t497_3"}