{"name": "503", "parent": "", "title": "Tassonomia delle piattaforme", "sentences": [{"1e40": "Tassonomia delle piattaforme"}, {"324e": "Ecosistema, ownership e governance nelle piattaforme positive"}, {"3243": "English version here"}, {"b117": "Lo scorso dicembre insieme a Chiara, Marta e Valeria abbiamo organizzato presso il Cohub di Milano una delle tante Positive Platforms Design Jam che si sono tenute in contemporanea in tutto mondo."}, {"cfd1": "L’iniziativa è stata lanciata da IFTF (Institute For The Future) con l’obiettivo di provare ad immaginare, con un approccio collaborativo, le possibili evoluzioni positive delle pratiche lavorative nel mondo delle piattaforme, facendo particolare riferimento ai fenomeni legati a sharing e gig economy. Per approfondire e dare concretezza alle idee progettuali emerse durante le diverse jam, IFTF ha messo in palio 4 borse di ricerca. Ogni partecipante o team aveva la possibilità di candidare il proprio progetto."}, {"ebaa": "Presentando la nostra proposta Positive platforms identity siamo riusciti ad aggiudicarci una delle borse e dal 15 febbraio abbiamo iniziato il percorso d’indagine. Partendo dal lavoro prodotto da diversi istituti di ricerca, il nostro obiettivo è tentare di sviluppare delle linee guida condivise che permettano di definire il concetto di piattaforma positiva. Vorremmo capire quali piattaforme esistenti possano ricadere in questa categoria, quali sono i parametri di positività che le caratterizzano e come questi parametri possano incidere sulla salute delle piattaforme stesse. Fin dalla fase di organizzazione della jam ci siamo resi conto che, seppur le piattaforme vengono utilizzate quotidianamente, c’è una scarsa cultura a riguardo."}, {"2203": "Effettivamente, a livello semantico, la parola positivo può essere declinata in maniera completamente soggettiva e la questione diventa ancora più delicata associando il termine alle piattaforme, il cui campo di definizione è ancora sfumato."}, {"5d7e": "Quello che ci proponiamo di fare con questo articolo (che probabilmente sarà il primo di una serie) è condividere il nostro lavoro passo dopo passo, per coinvolgere quelle persone che vorranno contribuire attivamente o portare il proprio punto di vista, cercando di approfondire un tema che per il momento è poco definito ma che avrà un impatto enorme sulle nostre vite personali e lavorative."}, {"f72a": "Il processo seguito."}, {"d205": "Siamo partiti da una ricerca sulla letteratura esistente: abbiamo cercato, letto e selezionato articoli che potessero aiutarci ad arricchire il nostro bagaglio teorico, a capire chi a livello mondiale stesse già riflettendo sull’argomento e a individuare delle linee di pensiero. A questo link potete trovare la versione aperta e modificabile della bibliografia che stiamo costruendo."}, {"e979": "Alla luce del materiale raccolto e attraverso alcune sessioni di dibattito, ciò che è emerso in maniera preponderante è la ricorrenza a parlare di piattaforme positive solo quando queste presentano precise forme di ownership e governance, in particolare facendo riferimento a forme cooperative. Questa restrizione di campo non ci è sembrata sufficientemente convincente, soprattutto se tra gli indicatori di positività si tiene conto della solidità e della capacità di sopravvivere delle già citate piattaforme cooperative. Inoltre ci siamo resi conto che la positività di una piattaforma è quasi esclusivamente associata alla presenza di norme che tutelino i lavoratori che ne prendono parte. Crediamo invece che ci siano altri parametri che a partire dalla nostra esperienza sul caso BlaBlaCar in Italia abbia senso considerare."}, {"2785": "Abbiamo quindi deciso di ampliare il campo d’indagine, strutturando una proto-classificazione delle piattaforme che ci permettesse da un lato di non escludere a priori alcune tipologie e dall’altro di fissare i punti di partenza della nostra analisi. Come provare a stabilire dei parametri di positività adattabili alle molteplici identità delle piattaforme se non partendo dall’individuazione delle stesse?"}, {"38c8": "Studiando insieme le diverse definizioni di piattaforma ce n’è stata una in particolare che ci ha colpito. Indicandone gli elementi chiave, John Hagel definisce la piattaforma come:"}, {"33df": "“A governance structure […] that determines who can participate, what roles they might play, how they might interact and how disputes get resolved” and a “set of protocols or standards […] to facilitate connection, coordination, and collaboration”."}, {"6fd3": "Generando riflessioni e discussioni all’interno del team, la definizione di Hagel ha creato un cortocircuito che ci ha permesso di riconfigurare il nostro punto di vista. Se con la prima classificazione avevamo differenziato le piattaforme focalizzandoci sul tipo di ecosistema che queste generano, ci è poi sembrato necessario sviluppare una nuova tassonomia che tenesse anche conto delle strutture di ownership e governance come parametri caratterizzanti."}, {"9bb8": "In questa fase della ricerca ci stiamo concentrando sulla formulazione di questionari da rivolgere a vari casi studio di piattaforme italiane, con l’obiettivo di porre delle domande che ci permettano di studiarne gli aspetti peculiari, nella loro eterogeneità. Per questo il lavoro di classificazione doveva prima di tutto essere funzionale alla raccolta dati, facilitarne l’interpretazione e aiutarci ad evitare pregiudizi nelle valutazioni finali."}, {"8b46": "Scegliendo di scomporre la piattaforma e studiandone separatamente ownership, governance ed ecosistema (intesi come singoli elementi strutturali) abbiamo pensato che sarebbe stato più semplice ottenere dai questionari dei dati comparabili. Allo stesso tempo, dopo aver delineato l’identità di queste singole componenti, potremo analizzarne le intersezioni e mettere i risultati a sistema, così da ottenere una fotografia del modello di piattaforma che tenga conto della sua complessità."}, {"63c9": "Questo è l’albero delle piattaforme su cui stiamo lavorando, è ancora in fase di definizione e aperto a modifiche:"}, {"c265": "Qui è possibile visualizzare l’albero navigabile."}, {"f492": "A questo link trovate il glossario che raccoglie le definizioni delle tipologie di piattaforme che stiamo proponendo e alcuni esempi per ognuna di queste. Sappiamo che molte delle piattaforme proposte possono rientrare in più categorie e probabilmente è proprio questa ibridazione a dargli forza e carattere. Il documento è aperto ai vostri commenti e contributi, chiunque fosse interessato può proporre dei casi studio (preferibilmente italiani) o nuovi spunti di riflessione."}, {"292c": "Co-autori: Valeria Loreti, Marta Mainieri, Chiara Agamennone"}], "content": "Tassonomia delle piattaforme Ecosistema, ownership e governance nelle piattaforme positive English version here Lo scorso dicembre insieme a Chiara, Marta e Valeria abbiamo organizzato presso il Cohub di Milano una delle tante Positive Platforms Design Jam che si sono tenute in contemporanea in tutto mondo. L’iniziativa è stata lanciata da IFTF (Institute For The Future) con l’obiettivo di provare ad immaginare, con un approccio collaborativo, le possibili evoluzioni positive delle pratiche lavorative nel mondo delle piattaforme, facendo particolare riferimento ai fenomeni legati a sharing e gig economy. Per approfondire e dare concretezza alle idee progettuali emerse durante le diverse jam, IFTF ha messo in palio 4 borse di ricerca. Ogni partecipante o team aveva la possibilità di candidare il proprio progetto. Presentando la nostra proposta Positive platforms identity siamo riusciti ad aggiudicarci una delle borse e dal 15 febbraio abbiamo iniziato il percorso d’indagine. Partendo dal lavoro prodotto da diversi istituti di ricerca, il nostro obiettivo è tentare di sviluppare delle linee guida condivise che permettano di definire il concetto di piattaforma positiva. Vorremmo capire quali piattaforme esistenti possano ricadere in questa categoria, quali sono i parametri di positività che le caratterizzano e come questi parametri possano incidere sulla salute delle piattaforme stesse. Fin dalla fase di organizzazione della jam ci siamo resi conto che, seppur le piattaforme vengono utilizzate quotidianamente, c’è una scarsa cultura a riguardo. Effettivamente, a livello semantico, la parola positivo può essere declinata in maniera completamente soggettiva e la questione diventa ancora più delicata associando il termine alle piattaforme, il cui campo di definizione è ancora sfumato. Quello che ci proponiamo di fare con questo articolo (che probabilmente sarà il primo di una serie) è condividere il nostro lavoro passo dopo passo, per coinvolgere quelle persone che vorranno contribuire attivamente o portare il proprio punto di vista, cercando di approfondire un tema che per il momento è poco definito ma che avrà un impatto enorme sulle nostre vite personali e lavorative. Il processo seguito. Siamo partiti da una ricerca sulla letteratura esistente: abbiamo cercato, letto e selezionato articoli che potessero aiutarci ad arricchire il nostro bagaglio teorico, a capire chi a livello mondiale stesse già riflettendo sull’argomento e a individuare delle linee di pensiero. A questo link potete trovare la versione aperta e modificabile della bibliografia che stiamo costruendo. Alla luce del materiale raccolto e attraverso alcune sessioni di dibattito, ciò che è emerso in maniera preponderante è la ricorrenza a parlare di piattaforme positive solo quando queste presentano precise forme di ownership e governance, in particolare facendo riferimento a forme cooperative. Questa restrizione di campo non ci è sembrata sufficientemente convincente, soprattutto se tra gli indicatori di positività si tiene conto della solidità e della capacità di sopravvivere delle già citate piattaforme cooperative. Inoltre ci siamo resi conto che la positività di una piattaforma è quasi esclusivamente associata alla presenza di norme che tutelino i lavoratori che ne prendono parte. Crediamo invece che ci siano altri parametri che a partire dalla nostra esperienza sul caso BlaBlaCar in Italia abbia senso considerare. Abbiamo quindi deciso di ampliare il campo d’indagine, strutturando una proto-classificazione delle piattaforme che ci permettesse da un lato di non escludere a priori alcune tipologie e dall’altro di fissare i punti di partenza della nostra analisi. Come provare a stabilire dei parametri di positività adattabili alle molteplici identità delle piattaforme se non partendo dall’individuazione delle stesse? Studiando insieme le diverse definizioni di piattaforma ce n’è stata una in particolare che ci ha colpito. Indicandone gli elementi chiave, John Hagel definisce la piattaforma come: “A governance structure […] that determines who can participate, what roles they might play, how they might interact and how disputes get resolved” and a “set of protocols or standards […] to facilitate connection, coordination, and collaboration”. Generando riflessioni e discussioni all’interno del team, la definizione di Hagel ha creato un cortocircuito che ci ha permesso di riconfigurare il nostro punto di vista. Se con la prima classificazione avevamo differenziato le piattaforme focalizzandoci sul tipo di ecosistema che queste generano, ci è poi sembrato necessario sviluppare una nuova tassonomia che tenesse anche conto delle strutture di ownership e governance come parametri caratterizzanti. In questa fase della ricerca ci stiamo concentrando sulla formulazione di questionari da rivolgere a vari casi studio di piattaforme italiane, con l’obiettivo di porre delle domande che ci permettano di studiarne gli aspetti peculiari, nella loro eterogeneità. Per questo il lavoro di classificazione doveva prima di tutto essere funzionale alla raccolta dati, facilitarne l’interpretazione e aiutarci ad evitare pregiudizi nelle valutazioni finali. Scegliendo di scomporre la piattaforma e studiandone separatamente ownership, governance ed ecosistema (intesi come singoli elementi strutturali) abbiamo pensato che sarebbe stato più semplice ottenere dai questionari dei dati comparabili. Allo stesso tempo, dopo aver delineato l’identità di queste singole componenti, potremo analizzarne le intersezioni e mettere i risultati a sistema, così da ottenere una fotografia del modello di piattaforma che tenga conto della sua complessità. Questo è l’albero delle piattaforme su cui stiamo lavorando, è ancora in fase di definizione e aperto a modifiche: Qui è possibile visualizzare l’albero navigabile. A questo link trovate il glossario che raccoglie le definizioni delle tipologie di piattaforme che stiamo proponendo e alcuni esempi per ognuna di queste. Sappiamo che molte delle piattaforme proposte possono rientrare in più categorie e probabilmente è proprio questa ibridazione a dargli forza e carattere. Il documento è aperto ai vostri commenti e contributi, chiunque fosse interessato può proporre dei casi studio (preferibilmente italiani) o nuovi spunti di riflessione. Co-autori: Valeria Loreti, Marta Mainieri, Chiara Agamennone ", "child": "503_1\t503_2503_1\t503_2"}