{"name": "505", "parent": "", "title": "A divided country. This does not end well.", "sentences": [{"1520": "A divided country. This does not end well."}, {"f538": "I’m in Vietnam on vacation. We’re headed to Cambodia next. Reading a lot of history of these two places. Strange to immerse yourself in so much painful history while surrounded by so much beauty: in the landscape, the culture, and the people."}, {"3a6a": "Last night before bed I uploaded vacation pictures to Facebook. I woke up thinking that I could upload and share my dreams too. But they weren’t beautiful. They overlaid histories of atrocities in Cambodia and displacement in Vietnam onto our current American moment. I woke up petrified."}, {"cf5e": "Countries can divide. It doesn’t go well. We need to unify, but we’re just dividing further. Listen to my friend Marina Martin."}, {"e1df": "Marina’s tweet after Trump’s press conference yesterday"}, {"9cd7": "We need to listen to each other. I don’t have the answers but it looks to me like we are not remotely out of our filter bubbles and being right isn’t going to be much consolation if we lose our country because we couldn’t find common ground, not with Trump or Bannon (who appear to be playing some entirely different game than the rest of us) but with other regular Americans who are obviously experiencing something I don’t understand well."}, {"3cd8": "I’m not saying don’t resist. We have to resist. But we also have to reach out. And that’s a lot harder on a lot of different fronts so we’re not doing it. At our own peril, I fear."}], "content": "A divided country. This does not end well. I’m in Vietnam on vacation. We’re headed to Cambodia next. Reading a lot of history of these two places. Strange to immerse yourself in so much painful history while surrounded by so much beauty: in the landscape, the culture, and the people. Last night before bed I uploaded vacation pictures to Facebook. I woke up thinking that I could upload and share my dreams too. But they weren’t beautiful. They overlaid histories of atrocities in Cambodia and displacement in Vietnam onto our current American moment. I woke up petrified. Countries can divide. It doesn’t go well. We need to unify, but we’re just dividing further. Listen to my friend Marina Martin. Marina’s tweet after Trump’s press conference yesterday We need to listen to each other. I don’t have the answers but it looks to me like we are not remotely out of our filter bubbles and being right isn’t going to be much consolation if we lose our country because we couldn’t find common ground, not with Trump or Bannon (who appear to be playing some entirely different game than the rest of us) but with other regular Americans who are obviously experiencing something I don’t understand well. I’m not saying don’t resist. We have to resist. But we also have to reach out. And that’s a lot harder on a lot of different fronts so we’re not doing it. At our own peril, I fear. ", "child": "505_1\t505_2\t505_3\t505_4\t505_5\t505_6"}