{"name": "526", "parent": "", "title": "Let’s Stop Pretending Christianity is Actually Relevant, Okay?", "sentences": [{"9777": "Let’s Stop Pretending Christianity is Actually Relevant, Okay?"}, {"e475": "It’s quite strange to expect people to conform to your morals because you quoted a book they don’t read"}, {"5ec4": "“Because Christians admit that ignorant people are worthy of their God, Christians show that they want to convert only foolish, dishonorable, stupid people, and only slaves, women, and little children.”-Celsus, Greek Philosopher"}, {"d4e5": "Van’s Warped Tour. Ventura, CA"}, {"80d3": "“I don’t want to bait and switch you, but we’re a Christian organization…”"}, {"8615": "I’ve rehearsed this line a thousand times. Sometimes I wait for the cringe, the headcock, or the resting bitch face to appear. Sometimes it’s a smile. I’m quick to follow up with just what being a “Christian” organization means for us, but this time I’m cut off."}, {"8250": "“Well, I’m Wiccan,” one says.“I used to be Christian, but now I’m an atheist,” another chimes in."}, {"f269": "I smile wanting them to understand this doesn’t bother me. “Well, regardless of what you believe, you’re loved and welcomed here. We’re to love our neighbor as ourselves and you’re our neighbor.” This disarms them and we have a conversation about life, their struggles, and even their views on God. At the end we all hug and take a selfie together."}, {"b2d7": "Later in the day I shoot a quick text to our founder, Jake Luhrs. “I’m fairly certain being Christian isn’t even relevant to most people here on Warped Tour, but it’s cool to see how many people are engaging with us.”"}, {"67e4": "Jake is quick to respond. “Yeah, it’s too bad the name ‘Christian’ has been tainted so much that the love of God isn’t recognized in the name. Instead people think ‘republican, homophobe, or bigot’ instead of ‘servant, loving, and gracious.’”"}, {"5d65": "A few short days after that text, the Supreme Court announces gay couples have the same civil rights as other Americans and may legally marry (not a biblical argument here, just a legal fact, folks). Two days later, the State of Oklahoma orders the 10 Commandments removed from the front of their State Capitol. These events are followed up by bathroom debates, racial division, and an explosive election causing Christians take to social media and their local outlets to discuss their outrage. With every post and comment it’s apparent they think this nation is going straight down the shitter."}, {"167a": "The Beginnings of Christianity"}, {"c21b": "When Christianity first began, it was a small sub sect of the Jewish faith. At the time, Rome ruled the world and pagan practices were the norm. Most of the civilized world worshipped Zeus, Apollo, Aphrodite, and other gods. Drunkenness and festivals were common in day-to-day life. Women and slaves were viewed as secondary citizens and at such an extreme level that a Greek statesman once remarked:"}, {"1023": "“We keep prostitutes for pleasure; we keep young female slaves for the day to day needs of the body; we keep wives for the begetting of children and for the faithful guardianship of our homes. So long as a man supported his wife and family there was no shame whatsoever in extra-marital affairs.”"}, {"61bc": "Many Christians found themselves persecuted and tortured for their strange beliefs and due to the fact they welcomed slaves, treated women as equals, and demanded husbands treat their wives with respect and fidelity. Church funds were used to buy the emancipation of Christian slaves. When Roman fathers would leave unwanted children in fields to die, Christians would adopt the children and defy the social structure by caring for them. They lived counter-cultural and showed love, grace, and affection towards those with different beliefs. This perhaps became most evident when multiple plagues struck Rome in 165 AD and later from 251 to 266 AD."}, {"a229": "At the height of what became known as the Plague of Cyprian it was estimated some 5,000 people a day were dying in Rome. Many Romans fled the city believing it the anger of the gods. Most nobles, doctors, statesmen, and priests fled the city in hordes leaving the poor to suffer."}, {"d2b6": "Instead of fear and self-preservation, Christians quickly invaded the city and cared for the poor, sick, and dying at great risk to their own lives. What they understood was simple: God loved humanity, and so to love God back, one was supposed to love and care for others just as Jesus did. During this time period, Christians not only buried their own, but also pagans who had died without proper funds for burial. Reports estimate some churches fed 3,000 people daily. Once the plague hit Alexandria, the Christians there risked their lives performing simple deeds of washing the sick, offering food and water, and consoling the dying. Rome tried to even emulate this model, but it failed because for Christians it was done out of love, not duty. Romans began to marvel and often whispered in the streets “look how they love one another.”"}, {"db08": "Not surprisingly, Christianity rapidly expanded."}, {"6ca1": "Irrelevant"}, {"5105": "A recent Barna survey reports only 18% of Millennials find Christianity relevant to their lives. That’s not surprising if we’re honest. After the Supreme Court decision regarding the ruling on gay marriage things got really weird. Some Christians put up “straight pride” profile pictures on social media and reminded people of what the Bible teaches (which, just for clarification, the church is currently split over because of how they view the interpretation). It’s a strange practice to ask people who don’t hold the same beliefs as you to conform to your morals because you quoted a book they don’t read. My friends that aren’t Christians have never tried to force their morality on me, so this is an odd practice in Christendom. Even Jesus didn’t blame pagans for acting like pagans. Yet, many Christians insist their beliefs apply to the culture at large even though most don’t share the same beliefs. With the Supreme Court ruling in Oklahoma, Christians raged about how the government was “forcing their beliefs on them and how they were no longer allowed to have theirs anymore.” Well, no, it was Christians who forced their views in the public forum by putting the 10 Commandments there first (if we look at it objectively). And never mind that as of late, many evangelical Christians care more about keeping refugees out of the U.S. despite what their sacred literature teaches."}, {"e706": "What we need to face is that public perception has shifted. We live in post-Christian America where we’re no longer relevant to the culture at large. Whatever influence Christians used to have, much like a parasite trying to reconnect to its host for fear of dying, many Christians are thrashing about trying to create waves and convince people they are relevant within our culture. But sadly, instead of men and women looking like Jesus we sure have a lot of talking heads. We sure have a healthy dose of condemnation in our ranks. We love being “right” instead of the hard task of humility."}, {"8c21": "Is it any wonder we’re not relevant?"}, {"5de9": "Back to Our Roots"}, {"539d": "I’m excited the North American church is dying. Christians not having the influence we once had in the 1900s gives me great hope. For the past 100 years we’ve had a lot of cultural converts. Everyone is a Christian because they grew up in Texas. Or they go to church. Or their mom and dad raised them that way. Hell, according to the U.S. census 70% of Americans identify as “Christian.” But the vast majority of those responses are nothing more than cultural identification, not Christianity. I imagine that’s why so many people despise Christians. Their belief is cultural, and no one intends to follow the man they claim governs their life, so we end up this giant homogenous blob of hypocrites that judge and condemn people, instead of looking like they did in 165 AD. Instead of rushing to the aid of others, or paying for pagan burials like our ancestors did, we have half-hearted followers who run rampant through the streets of social media pointing the finger to everyone except themselves."}, {"2372": "The reason I’m excited about the shift is because as the cultural converts die, vibrant Christians will take their place. Churches will be smaller and stranger to the public, but they’ll be healthier. More organizations committed to social issues that love others without borders but are unashamed about their faith will pop up. We won’t be relevant or even “cool” to the populace at large, but neither were our brothers and sisters in antiquity. It’s not cool to give your money to the poor or tithe to a church. Noble maybe, but what’s cooler is to keep your money, buy the Nintendo Switch, a vacation, and some new clothes. It’s not cool to wait to engage in intimate relationships until you’re married because you trust it will enrich your marriage. What’s cool is hooking up. It’s not cool that you didn’t get all crazy at the bar with your friends and end up taking your shirt off. What’s cool is getting hammered, making out with a random stranger, and then re-telling the story on Instagram."}, {"169a": "Christians were never relevant or cool to begin with. Celsus realized this from the beginning. Culture at large will see the things we do and traditions we follow as silly myths. But the love, grace, and acceptance we extend they won’t be able to argue with if we truly live the life of Jesus to others."}, {"1d04": "So while Christianity may never be relevant or cool, here’s what it will be: Attractive."}, {"e907": "People will be curious why you were kind to them when they may have been a jerk to you. That’s attractive. People will wonder why you value the broken, poor, and marginalized and use your finances, life, and time to help them (even if they never change). That’s attractive. People will marvel that your friend group doesn’t just consist of people the same color, sexual orientation, or nationality as you, but it spans different beliefs, races, and political views. They’ll be shocked you serve, love, laugh, and mourn with them. That’s attractive."}, {"faa2": "And finally, people will come to understand the truth of what we believe as Dr. Timothy Keller so eloquently put it:"}, {"4d46": "“So loved that we don’t despair when we do wrong, but so sinful that we have no right to be puffed up when we do right.”"}, {"2bc2": "So here’s to a vibrant, attractive future. May we at HeartSupport, and fellow followers around the globe live, love, and speak in such a manner that inspires our fellow man and causes God to do a work in their heart."}, {"42d0": "If you enjoyed reading this we’d love for you to share or recommend."}, {"3618": "Join our community and find thousands of other people from different beliefs and backgrounds finding friendship and help every day."}], "content": "Let’s Stop Pretending Christianity is Actually Relevant, Okay? It’s quite strange to expect people to conform to your morals because you quoted a book they don’t read “Because Christians admit that ignorant people are worthy of their God, Christians show that they want to convert only foolish, dishonorable, stupid people, and only slaves, women, and little children.”-Celsus, Greek Philosopher Van’s Warped Tour. Ventura, CA “I don’t want to bait and switch you, but we’re a Christian organization…” I’ve rehearsed this line a thousand times. Sometimes I wait for the cringe, the headcock, or the resting bitch face to appear. Sometimes it’s a smile. I’m quick to follow up with just what being a “Christian” organization means for us, but this time I’m cut off. “Well, I’m Wiccan,” one says.“I used to be Christian, but now I’m an atheist,” another chimes in. I smile wanting them to understand this doesn’t bother me. “Well, regardless of what you believe, you’re loved and welcomed here. We’re to love our neighbor as ourselves and you’re our neighbor.” This disarms them and we have a conversation about life, their struggles, and even their views on God. At the end we all hug and take a selfie together. Later in the day I shoot a quick text to our founder, Jake Luhrs. “I’m fairly certain being Christian isn’t even relevant to most people here on Warped Tour, but it’s cool to see how many people are engaging with us.” Jake is quick to respond. “Yeah, it’s too bad the name ‘Christian’ has been tainted so much that the love of God isn’t recognized in the name. Instead people think ‘republican, homophobe, or bigot’ instead of ‘servant, loving, and gracious.’” A few short days after that text, the Supreme Court announces gay couples have the same civil rights as other Americans and may legally marry (not a biblical argument here, just a legal fact, folks). Two days later, the State of Oklahoma orders the 10 Commandments removed from the front of their State Capitol. These events are followed up by bathroom debates, racial division, and an explosive election causing Christians take to social media and their local outlets to discuss their outrage. With every post and comment it’s apparent they think this nation is going straight down the shitter. The Beginnings of Christianity When Christianity first began, it was a small sub sect of the Jewish faith. At the time, Rome ruled the world and pagan practices were the norm. Most of the civilized world worshipped Zeus, Apollo, Aphrodite, and other gods. Drunkenness and festivals were common in day-to-day life. Women and slaves were viewed as secondary citizens and at such an extreme level that a Greek statesman once remarked: “We keep prostitutes for pleasure; we keep young female slaves for the day to day needs of the body; we keep wives for the begetting of children and for the faithful guardianship of our homes. So long as a man supported his wife and family there was no shame whatsoever in extra-marital affairs.” Many Christians found themselves persecuted and tortured for their strange beliefs and due to the fact they welcomed slaves, treated women as equals, and demanded husbands treat their wives with respect and fidelity. Church funds were used to buy the emancipation of Christian slaves. When Roman fathers would leave unwanted children in fields to die, Christians would adopt the children and defy the social structure by caring for them. They lived counter-cultural and showed love, grace, and affection towards those with different beliefs. This perhaps became most evident when multiple plagues struck Rome in 165 AD and later from 251 to 266 AD. At the height of what became known as the Plague of Cyprian it was estimated some 5,000 people a day were dying in Rome. Many Romans fled the city believing it the anger of the gods. Most nobles, doctors, statesmen, and priests fled the city in hordes leaving the poor to suffer. Instead of fear and self-preservation, Christians quickly invaded the city and cared for the poor, sick, and dying at great risk to their own lives. What they understood was simple: God loved humanity, and so to love God back, one was supposed to love and care for others just as Jesus did. During this time period, Christians not only buried their own, but also pagans who had died without proper funds for burial. Reports estimate some churches fed 3,000 people daily. Once the plague hit Alexandria, the Christians there risked their lives performing simple deeds of washing the sick, offering food and water, and consoling the dying. Rome tried to even emulate this model, but it failed because for Christians it was done out of love, not duty. Romans began to marvel and often whispered in the streets “look how they love one another.” Not surprisingly, Christianity rapidly expanded. Irrelevant A recent Barna survey reports only 18% of Millennials find Christianity relevant to their lives. That’s not surprising if we’re honest. After the Supreme Court decision regarding the ruling on gay marriage things got really weird. Some Christians put up “straight pride” profile pictures on social media and reminded people of what the Bible teaches (which, just for clarification, the church is currently split over because of how they view the interpretation). It’s a strange practice to ask people who don’t hold the same beliefs as you to conform to your morals because you quoted a book they don’t read. My friends that aren’t Christians have never tried to force their morality on me, so this is an odd practice in Christendom. Even Jesus didn’t blame pagans for acting like pagans. Yet, many Christians insist their beliefs apply to the culture at large even though most don’t share the same beliefs. With the Supreme Court ruling in Oklahoma, Christians raged about how the government was “forcing their beliefs on them and how they were no longer allowed to have theirs anymore.” Well, no, it was Christians who forced their views in the public forum by putting the 10 Commandments there first (if we look at it objectively). And never mind that as of late, many evangelical Christians care more about keeping refugees out of the U.S. despite what their sacred literature teaches. What we need to face is that public perception has shifted. We live in post-Christian America where we’re no longer relevant to the culture at large. Whatever influence Christians used to have, much like a parasite trying to reconnect to its host for fear of dying, many Christians are thrashing about trying to create waves and convince people they are relevant within our culture. But sadly, instead of men and women looking like Jesus we sure have a lot of talking heads. We sure have a healthy dose of condemnation in our ranks. We love being “right” instead of the hard task of humility. Is it any wonder we’re not relevant? Back to Our Roots I’m excited the North American church is dying. Christians not having the influence we once had in the 1900s gives me great hope. For the past 100 years we’ve had a lot of cultural converts. Everyone is a Christian because they grew up in Texas. Or they go to church. Or their mom and dad raised them that way. Hell, according to the U.S. census 70% of Americans identify as “Christian.” But the vast majority of those responses are nothing more than cultural identification, not Christianity. I imagine that’s why so many people despise Christians. Their belief is cultural, and no one intends to follow the man they claim governs their life, so we end up this giant homogenous blob of hypocrites that judge and condemn people, instead of looking like they did in 165 AD. Instead of rushing to the aid of others, or paying for pagan burials like our ancestors did, we have half-hearted followers who run rampant through the streets of social media pointing the finger to everyone except themselves. The reason I’m excited about the shift is because as the cultural converts die, vibrant Christians will take their place. Churches will be smaller and stranger to the public, but they’ll be healthier. More organizations committed to social issues that love others without borders but are unashamed about their faith will pop up. We won’t be relevant or even “cool” to the populace at large, but neither were our brothers and sisters in antiquity. It’s not cool to give your money to the poor or tithe to a church. Noble maybe, but what’s cooler is to keep your money, buy the Nintendo Switch, a vacation, and some new clothes. It’s not cool to wait to engage in intimate relationships until you’re married because you trust it will enrich your marriage. What’s cool is hooking up. It’s not cool that you didn’t get all crazy at the bar with your friends and end up taking your shirt off. What’s cool is getting hammered, making out with a random stranger, and then re-telling the story on Instagram. Christians were never relevant or cool to begin with. Celsus realized this from the beginning. Culture at large will see the things we do and traditions we follow as silly myths. But the love, grace, and acceptance we extend they won’t be able to argue with if we truly live the life of Jesus to others. So while Christianity may never be relevant or cool, here’s what it will be: Attractive. People will be curious why you were kind to them when they may have been a jerk to you. That’s attractive. People will wonder why you value the broken, poor, and marginalized and use your finances, life, and time to help them (even if they never change). That’s attractive. People will marvel that your friend group doesn’t just consist of people the same color, sexual orientation, or nationality as you, but it spans different beliefs, races, and political views. They’ll be shocked you serve, love, laugh, and mourn with them. That’s attractive. And finally, people will come to understand the truth of what we believe as Dr. Timothy Keller so eloquently put it: “So loved that we don’t despair when we do wrong, but so sinful that we have no right to be puffed up when we do right.” So here’s to a vibrant, attractive future. May we at HeartSupport, and fellow followers around the globe live, love, and speak in such a manner that inspires our fellow man and causes God to do a work in their heart. If you enjoyed reading this we’d love for you to share or recommend. Join our community and find thousands of other people from different beliefs and backgrounds finding friendship and help every day. ", "child": "526_1\t526_2\t526_3\t526_4\t526_5\t526_6\t526_7\t526_8\t526_9\t526_10\t526_11\t526_12\t526_13\t526_14\t526_15\t526_16\t526_17\t526_18\t526_19\t526_20\t526_21\t526_22\t526_23\t526_24\t526_25526_1\t526_2\t526_3\t526_4\t526_5\t526_6\t526_7\t526_8\t526_9\t526_10\t526_11\t526_12\t526_13\t526_14\t526_15\t526_16\t526_17\t526_18\t526_19\t526_20\t526_21\t526_22\t526_23\t526_24\t526_25"}