{"name": "53", "parent": "", "title": "Carmelo Anthony: the Scrutiny and the Future of the Knicks Star Forward", "sentences": [{"424c": "Carmelo Anthony: the Scrutiny and the Future of the Knicks Star Forward"}, {"0f0d": "We analyze the criticisms of ‘Melo during his time in New York and take a look at his future as a Knick"}, {"cf64": "Photo: Player’s Lounge"}, {"fb8c": "It has been nearly six calendar years since Carmelo Anthony came out of the tunnel at Madison Square Garden for the first time as a Knick. “Coming Home” by Diddy was the theme song of the acquisition, as it was seemingly played on every commercial on MSG Network that evening and throughout the rest of the season. Anthony, born in New York, had essentially talked his way out of Denver, where he led his team to the playoffs in all seven seasons as a Nugget (which many people unfairly choose to neglect)."}, {"a8c3": "Since joining the Knicks, ‘Melo has been one of the most highly scrutinized players in the NBA, despite being a top-tier offensive talent. He has been called selfish, one-dimensional, un-coachable, a ball hog, and an ineffective leader by fans and media members."}, {"215a": "To be h0nest, he deserves some of the criticism he has received, as he has failed to bring the Knicks to even an Eastern Conference Finals appearance. At times, ‘Melo makes you want to throw your remote through the TV with his poor shot selection and often looks disinterested in playing defense. Yes, we all understand that Carmelo Anthony is not a superstar and isn’t in the same class as LeBron, KD, Westbrook, or Harden, but a lot of the heat he has taken during his tenure here in New York has been unjustified and off target. The most recent analysis of ‘Melo by the spineless George Karl is a prime example of the off-base and quite frankly disrespectful criticisms he has had to endure."}, {"47f6": "Here are a few reasons why I believe ‘Melo deserves more credit and less blame:"}, {"3d91": "Handling the New York media"}, {"2fe4": "One concern about many athletes coming to New York is whether they can handle the intense, overwhelming, and relentless media."}, {"d34e": "I know it’s a cliché, but Carmelo has said all the right things during his time here in New York and hasn’t created large distractions for his team. Despite having a dysfunctional/terrible owner, a loose cannon of a GM who has put ‘Melo in some precarious spots, and a subpar supporting cast of players, he has handled tough questions with class and tempered honesty. Not once has this man complained about having Raymond Felton as his point guard or having little talent to work with for most of his time here. I don’t know a lot of guys who have to constantly answer these redundant and difficult questions like ‘Melo has to and he has done a great job in making sure he articulates himself in a way that isn’t throwing anyone under the bus."}, {"fcdc": "A Way-Too-Early Knicks 2017 Draft GuideThe Knicks have their own first and second round picks in the NBA Draft for the first time since 2005theknickswall.com"}, {"4369": "Being part of three rebuilding processes is not a desirable place to be in, so props to ‘Melo for putting up with it and not jumping ship or quitting on the franchise."}, {"31a9": "Toughness"}, {"f323": "What many fans don’t realize is that ‘Melo is one of the toughest, grind-it-out type players in the NBA. He is often nicked up and chooses to play through injuries he could easily miss extended time with. Yes, I am aware of the questionable decision he made to play in the All-Star game a couple years back when he was hurt, but overall this guy is going to fight through nagging injuries and make sure he’s there for his teammates. Right now, in fact, he is playing with a painful shoulder injury and continues to put up solid numbers."}, {"2c36": "Photo: Nathaniel S. Butler/NBAE"}, {"f2df": "Reinvention of his game"}, {"ce87": "Over the past few seasons, ‘Melo has played better all around basketball than he did in his first few seasons in New York."}, {"dada": "It is apparent that ‘Melo has finally realized hurling up 30 shots per game is not a recipe for success. Sometimes he still struggles with his choice of shots and appears to be a chucker on some possessions, but I have noticed him trying to get his teammates involved more and more. His rebounding numbers have always been solid but it seems like he has been more willing to bang around with the big men down low to get a rebound. Having offensive weapons like Kristaps Porzingis and Derrick Rose has helped ‘Melo be less of a one-dimensional player."}, {"7463": "Why Are the Knicks Afraid to Be Purposefully Bad?Tanking is not an option. It never was, and it will never betheknickswall.com"}, {"9b85": "“Reinvention” might be a strong word in this case, but ‘Melo has made a concerted effort to alter his game for the betterment of the team. How can you knock a guy for that?"}, {"7b13": "Another reason why I believe ‘Melo comes under fire much of the time for his lack of winning is because of the draft class he was in. The top five picks of the 2003 draft, aside from Darko Milicic have, had great careers, with Dwyane Wade, LeBron James, and Chris Bosh all with multiple championships on their résumé. Especially in the cases of Wade and James, they are bonafide superstars who are all time greats at their respective positions."}, {"f206": "‘Melo, despite his incredible scoring prowess and elite shooting ability, doesn’t have a NBA Finals ring to show for it. The natural comparison to LeBron James doesn’t help ‘Melo’s case at all. In a league where you are judged by championships, Carmelo Anthony falls short, while many of his counterparts have rings. I do believe rings are important in determining the legacy and success of a player, but I do think ‘Melo does take too much heat for not having a ring. After all, many great players don’t have rings (e.g. Kevin Durant)"}, {"5bb7": "Photo: Kathy Willens/AP"}, {"412b": "In terms of the future of ‘Melo in New York City, I don’t have a clue what will happen. With next year being his contract year, many are speculating he will be traded in the offseason so the Knicks don’t lose him for nothing. Despite the emergence of KP, I still think ‘Melo is the Knicks’ best player and most prized possession. I would hate to see him traded away and I would like to see him retire a Knick. At the same time though, the organization needs to be smart about it. If they can get high picks and/or a valuable player(s) in return for a ‘Melo trade, I would be a proponent of it."}, {"2ee4": "It is very difficult to separate your love for a player from your love of an organization. Let’s be real, the Knicks are not going to win a championship with ‘Melo as their centerpiece. He is simply not that kind of player anymore and arguably never was. If he is ever traded, I would want nothing more than for him to win a championship, because he definitely deserves it for all the talent he has and all the hard work he has put in over the years. I would be surprised if this season is his last full one in New York, but there will come a time to move on and us Knicks fans will know it when the time has come."}, {"fe63": "In the meantime, I would love to see him amp up his play this season and lead the Knicks to a playoff spot. That would definitely silence some of the haters out there who criticize ‘Melo for every move he makes. Overall, though I believe the six seasons ‘Melo had been here, he has performed well and done all he can do to bring the Knicks back to where they once were. He’s far from a superstar or a perfect player, but lets show the man some love for his hard work, exciting moments and electricity he has brought back to the Garden since arriving in the Mecca."}, {"3425": "— Nick Scolaro, site writer"}, {"796f": "Follow The Knicks Wall on Facebook and Twitter and listen to the TKW Podcast on SoundCloud, this week featuring Jared Mintz of FanRag Sports!"}], "content": "Carmelo Anthony: the Scrutiny and the Future of the Knicks Star Forward We analyze the criticisms of ‘Melo during his time in New York and take a look at his future as a Knick Photo: Player’s Lounge It has been nearly six calendar years since Carmelo Anthony came out of the tunnel at Madison Square Garden for the first time as a Knick. “Coming Home” by Diddy was the theme song of the acquisition, as it was seemingly played on every commercial on MSG Network that evening and throughout the rest of the season. Anthony, born in New York, had essentially talked his way out of Denver, where he led his team to the playoffs in all seven seasons as a Nugget (which many people unfairly choose to neglect). Since joining the Knicks, ‘Melo has been one of the most highly scrutinized players in the NBA, despite being a top-tier offensive talent. He has been called selfish, one-dimensional, un-coachable, a ball hog, and an ineffective leader by fans and media members. To be h0nest, he deserves some of the criticism he has received, as he has failed to bring the Knicks to even an Eastern Conference Finals appearance. At times, ‘Melo makes you want to throw your remote through the TV with his poor shot selection and often looks disinterested in playing defense. Yes, we all understand that Carmelo Anthony is not a superstar and isn’t in the same class as LeBron, KD, Westbrook, or Harden, but a lot of the heat he has taken during his tenure here in New York has been unjustified and off target. The most recent analysis of ‘Melo by the spineless George Karl is a prime example of the off-base and quite frankly disrespectful criticisms he has had to endure. Here are a few reasons why I believe ‘Melo deserves more credit and less blame: Handling the New York media One concern about many athletes coming to New York is whether they can handle the intense, overwhelming, and relentless media. I know it’s a cliché, but Carmelo has said all the right things during his time here in New York and hasn’t created large distractions for his team. Despite having a dysfunctional/terrible owner, a loose cannon of a GM who has put ‘Melo in some precarious spots, and a subpar supporting cast of players, he has handled tough questions with class and tempered honesty. Not once has this man complained about having Raymond Felton as his point guard or having little talent to work with for most of his time here. I don’t know a lot of guys who have to constantly answer these redundant and difficult questions like ‘Melo has to and he has done a great job in making sure he articulates himself in a way that isn’t throwing anyone under the bus. A Way-Too-Early Knicks 2017 Draft GuideThe Knicks have their own first and second round picks in the NBA Draft for the first time since 2005theknickswall.com Being part of three rebuilding processes is not a desirable place to be in, so props to ‘Melo for putting up with it and not jumping ship or quitting on the franchise. Toughness What many fans don’t realize is that ‘Melo is one of the toughest, grind-it-out type players in the NBA. He is often nicked up and chooses to play through injuries he could easily miss extended time with. Yes, I am aware of the questionable decision he made to play in the All-Star game a couple years back when he was hurt, but overall this guy is going to fight through nagging injuries and make sure he’s there for his teammates. Right now, in fact, he is playing with a painful shoulder injury and continues to put up solid numbers. Photo: Nathaniel S. Butler/NBAE Reinvention of his game Over the past few seasons, ‘Melo has played better all around basketball than he did in his first few seasons in New York. It is apparent that ‘Melo has finally realized hurling up 30 shots per game is not a recipe for success. Sometimes he still struggles with his choice of shots and appears to be a chucker on some possessions, but I have noticed him trying to get his teammates involved more and more. His rebounding numbers have always been solid but it seems like he has been more willing to bang around with the big men down low to get a rebound. Having offensive weapons like Kristaps Porzingis and Derrick Rose has helped ‘Melo be less of a one-dimensional player. Why Are the Knicks Afraid to Be Purposefully Bad?Tanking is not an option. It never was, and it will never betheknickswall.com “Reinvention” might be a strong word in this case, but ‘Melo has made a concerted effort to alter his game for the betterment of the team. How can you knock a guy for that? Another reason why I believe ‘Melo comes under fire much of the time for his lack of winning is because of the draft class he was in. The top five picks of the 2003 draft, aside from Darko Milicic have, had great careers, with Dwyane Wade, LeBron James, and Chris Bosh all with multiple championships on their résumé. Especially in the cases of Wade and James, they are bonafide superstars who are all time greats at their respective positions. ‘Melo, despite his incredible scoring prowess and elite shooting ability, doesn’t have a NBA Finals ring to show for it. The natural comparison to LeBron James doesn’t help ‘Melo’s case at all. In a league where you are judged by championships, Carmelo Anthony falls short, while many of his counterparts have rings. I do believe rings are important in determining the legacy and success of a player, but I do think ‘Melo does take too much heat for not having a ring. After all, many great players don’t have rings (e.g. Kevin Durant) Photo: Kathy Willens/AP In terms of the future of ‘Melo in New York City, I don’t have a clue what will happen. With next year being his contract year, many are speculating he will be traded in the offseason so the Knicks don’t lose him for nothing. Despite the emergence of KP, I still think ‘Melo is the Knicks’ best player and most prized possession. I would hate to see him traded away and I would like to see him retire a Knick. At the same time though, the organization needs to be smart about it. If they can get high picks and/or a valuable player(s) in return for a ‘Melo trade, I would be a proponent of it. It is very difficult to separate your love for a player from your love of an organization. Let’s be real, the Knicks are not going to win a championship with ‘Melo as their centerpiece. He is simply not that kind of player anymore and arguably never was. If he is ever traded, I would want nothing more than for him to win a championship, because he definitely deserves it for all the talent he has and all the hard work he has put in over the years. I would be surprised if this season is his last full one in New York, but there will come a time to move on and us Knicks fans will know it when the time has come. In the meantime, I would love to see him amp up his play this season and lead the Knicks to a playoff spot. That would definitely silence some of the haters out there who criticize ‘Melo for every move he makes. Overall, though I believe the six seasons ‘Melo had been here, he has performed well and done all he can do to bring the Knicks back to where they once were. He’s far from a superstar or a perfect player, but lets show the man some love for his hard work, exciting moments and electricity he has brought back to the Garden since arriving in the Mecca. — Nick Scolaro, site writer Follow The Knicks Wall on Facebook and Twitter and listen to the TKW Podcast on SoundCloud, this week featuring Jared Mintz of FanRag Sports! ", "child": "53_1\t53_253_1\t53_2"}