{"name": "530", "parent": "", "title": "Reflection on quitting, leading, and uprooting our UU faith", "sentences": [{"9b25": "Reflection on quitting, leading, and uprooting our UU faith"}, {"3ae7": "The Black Lives of UU organizing collective began less than two years ago. Part of our work since our inception has been to make visible injustices within our own faith. It is both personal and incredibly challenging work for all of us, and this work is an integral part of building a world where the full dignity and humanity of Black people is recognized. We understand that our liberation is bound up with others and we work in solidarity with other people of color and Indigenous people. We take seriously a core tenet of almost every spiritual tradition that change begins within. Change happens within the individual, within the collective bodies we are all a part of, and this ought not to come at the expense of hiding out from the world or ceasing to build a new way in the real world. None of this work can be done in isolation. It also cannot be done without commitment, tenacity, and discomfort."}, {"d78e": "I, personally, was not caught off guard by the actions of the UUA administration, the resignation of the President of the administration of the UUA and subsequent resignations in the leadership of the administration. I was caught off guard by the incredible number of Black, people of color, and Indigenous people who came forward from every corner of our faith — religious educators, ministers, lay leaders, everyday parishioners — who poured out their stories of painful discrimination. Many who also felt they could not share or speak up before now and even now, only in confidence with me or other people of color they hold in confidence. People couldn’t share their stories because they feared retaliation from the Ministerial Formation Committee (the committee that decides whether or not people can become ministers), from people in the Leadership Council at the UUA or others in positions of power over them, or they just feared being told they were crazy and it was all in their head."}, {"b467": "For instance, in this very public case with the position for the regional lead of the Southern Region, the hiring notice clearly indicated living in the region as a requirement. However, when the story went public Scott Tayler attempted to gaslight Christina Rivera and tell her it was all in her head even though there is a screenshot of the original job posting which clearly contradicts Scott Tayler’s declaration. Whether his actions are from incompetence or partiality toward white applicants (even when they clearly don’t meet the listed criteria) the result is a contribution to systemic oppression. The attempted silencing or discrediting of her claims is not living into our deepest faith values and it is continuing to play into oppressive systems that UUs claim to be committed to fighting against. I can publicly talk about this, because Christina Rivera has been courageous enough to be public about her story. There are many others with less power, in different positions in our faith who cannot be public."}, {"89ec": "There are many in our UU family who have held their silence in pain, in fear of their job or of other retaliation for speaking up and it has been a corrosive to their soul. And these cultural practices, these unwritten white cultural norms of defensiveness, discrediting, and minimizing must be vociferously uprooted. They must no longer be tolerated. The voices of Black and Brown people in our faith have been interrogated, minimized, discredited for too long. Even now, the consistent admonishment to call out racism and institutional injustice in the “right way” through the “right” channels, is in and of itself part of the problem. We have already seen that for years upon years, this is not working and has not worked and continues not to work. So why would we continue down this path? It doesn’t make sense. And I implore any UU — whatever their cultural or racial background — who feels the need to question the necessity of directly and unapologetically naming and call out systemic oppression and institutional injustice to ask themselves what they are afraid of? Are you afraid of finding ugliness in your own heart? What are the edges at the corner of your own mind telling you about speaking up and out against the times you have invariably seen oppressive practices or instances and have kept silent?"}, {"089b": "The crisis before us is not the recent resignations in administration — that is just poor leadership. The crisis is that we as a faith body have actively been exclusionary, sometimes in direct ways and sometimes in indirect ways. The crisis is also one of personalization without responsibility. Personalizing systemic critiques as attacks on personhood rather than as attacks on problematic behavior rooted in white supremacy is a problem. It’s a problem that has led to devastating consequences for our faith and immeasurable wounds. To claim that removal of one’s self as the main solution to widespread problematic cultural practices and systemic and institutional oppression is to center and inflate one’s own sense of ego while at the same time abdicating any responsibility for behavior and actions and at the same time render impotent and anemic that power for which one does actually have. All at the same time the resignations simultaneously do present our faith institution with an incredible opportunity, it is also challenging."}, {"1cf8": "It is hard work to change one’s behaviors, to face the ways that all of us have been trained by powerful forces to suppress one another and deny the full humanity and dignity of each other based along many lines including gender, race, class, and ability. Even with new leadership, this is still part of the work before each and every person who claims Unitarian Universalism as their own faith. Personally, I believe in the power of our faith to hold me in those most difficult moments of personal transformation and growth and in fact over the years as a part of the Black Lives Matter movement, I have leaned into the power of my faith, of my congregation’s complicated support for strength and nourishment to continue working on myself and the world around me around. One thing I didn’t do was give up and quit. This wasn’t really an option for me and still isn’t an option for me. What’s at stake is too important, and it’s a marker of privilege and of an all too comfortable life to give up when the hardness of life comes careening down around you in new ways that make you uncomfortable."}, {"89f0": "This time of truth telling is a gift and we can choose to receive it with humility and rededicate ourselves to the cause of building Beloved Community. We can embrace new practices that instead of scaring and bullying POCI (people of color and Indigenous) voices into submission and silence, listens carefully and then takes action in accordance. We can embolden and strengthen voices that have been devalued and discredited. This requires that we jettison the commitment to order over process. It takes a sense of urgency but the right urgency — the urgency to do things differently, not just to a rush to fill the vacuum of leadership caused by the fragility of a few people’s egos and quickly return to things as usual. This is an incredible opportunity and a gift and it could be seismic change within our faith — if we are intentional, and seek first to comfort the afflicted and afflict the comfortable, instead of the comforting the comfortable and forgetting the afflicted, which has been the standard for too long in our faith."}, {"7de5": "When I first heard about the hiring decision in the Southern Region, I have to admit I wasn’t that upset. It occurred to me as others were witnessing and giving voice to their pain that I didn’t have that much — and it wasn’t for a good reason. It’s because I’m accustomed to being treated poorly from white people in positions of power and white UUs in particular. I have come to expect mistreatment, minimization, discrediting, and disbelief — so much so that I sometimes do it to my own self because it’s easier than facing the pain of hearing that from your own faith community. But if I am honest, the betrayal, the continued overwhelming silence is painful and facing the truth of the prevalence and insidiousness of white supremacy within the organizations of our faith — congregations and the association — is actually so painful."}, {"9911": "What does it say about our faith that I cannot expect to be treated with dignity and respect from white UUs? What does it say about our faith that Black and Brown people, and trans people would rather leave than try to speak up and out? What does it say that people are calling this a crisis rather than a reckoning, an opportunity, a breaking open of heart and spirit? Rather than a gift of courage and tenacity from leaders of color — specifically Christina Rivera and Aisha Hauser and Leslie MacFadyen — people’s whose spirits are so whole and intact they have the courage to expect to be treated as fully human, with dignity and respect?"}, {"0f3d": "What kind of faith purports to be a “movement” but will not give generously and with no strings attached of their gifts of time, talent, treasure, and space to the broader world wide movement for Black Lives (or any justice movement across the country or world)? What kind of faith is that?"}, {"b5d2": "This is not the faith I recognize. It is not the faith that promised me an unconditional love. It is not a faith that I lean on when I am facing down the police after they have murdered another one of my Black family. It is not a faith I lean on when I am speaking hard truths to the Governor of Minnesota, the City Council, the Deputy Chief of Police, or even the ministers at my own church — the very same ministers who have prayed with me and ministered to me after surgeries, through tough times of all types. This is not the faith I recognize. Journalist Finley Peter Dunne, in 1902, wrote that the job of newspapers is to comfort the afflicted and afflict the comfortable. As I mentioned above I think it is our job in these times, to be a faith that comforts the afflicted and afflicts the comfortable. Our guilt and shame from our privileges is not enough to transform our communities and build a new world — the world that is the promise of this faith. It is constant, unrelenting work and it is a work that most are unwilling to do, but if you proclaim yourself to be a person of faith, you ought to be willing to do it. Jesus did not hesitate in emphatically tipping over tables in the most sacred of places in Judaism, in the Temple. He didn’t hesitate because he knew, as I know, as you know, that change doesn’t come from or in comfort. It is with that spirit that we must now go into the temples of our faith and tip the tables over. We must, must, must be willing to face what we are afraid of facing — that we are not the good people we thought we were."}, {"479c": "Giving up must not be an option we entertain this time around. The leadership of our faith gave up in 1967, the delegates at General Assembly gave up multiple times in recent years in voting down anti-racism commitments in our faith, and recently the President of the association and other leadership have given up."}, {"75d9": "Thankfully, the association is not our faith. The association is meant to serve our faith, to support our faith, to support the people in the faith and to support the congregations. It means that we cannot give up. This cracking open of our collective institutional heart is an opportunity to change. An invitation to move into discomfort. The thing that is beautiful about this kind of discomfort is that there is freedom, there is a taste of liberation in it and it is life giving even as it is disorienting. This is actual movement work, it’s terribly messy, it’s terribly unforgiving when it comes to comfort and if we are to claim any spiritual fortitude from our faith — now is the time to lean into our beliefs about building a new way, about Beloved Community, about liberation."}, {"8414": "If we are to be whole and healed people, it first starts with tending to the wounds. And my friends, if there is any crisis in our faith, it is that the Black and Brown people in our faith have been hemorrhaging for too long, have been alone for too long, have been abandoned and thrown away as disposable. Our needs, cares, concerns, are always on the back burner. Our stories always belittled, discredited and we are made to feel as if it’s all in our head and the pain minimized or completely unseen such as this experience related from a Black UU woman:"}, {"782d": "There are just too many places where passive (and sometimes active) resistance to ANY suggestion that institutional racism is at work; too much resistance to the acknowledgment of unconscious bias as a reality; and waaaay too much micro-invalidation. Patronizing, condescension, defensiveness, passive-aggression and other demeaning behaviors are unleashed that end up not only souring the experience of the Search, but also making the individual question the “rightness” of their presence in that community altogether. This has been a damaging experience psychically for me as a Black woman, and as a UU…!"}, {"f16e": "If you need another example, let me point to after the election the immediate concern for many ministers was actually to create space for those who voted for the current president of the US and making space for them and their needs, instead of concern for the people whose lives would and are being most directly affected by his policies — our immigrant families which include Black and African people (remember 3 out of the 7 on the list of banned immigrant countries are in Africa) — Black and brown people, trans people, LGBTQ people, and other targeted populations from the Republican regime who were and (justifiably) continue to be afraid for their lives. This is one of many reasons why there is a large number of Black UUs that choose to remain unaffiliated with a bricks and mortar congregation rather than subject themselves to that pain consistently. And even now so many are talking about the hurt of a few “good liberal” white people in leadership electing to give up, rather than tending to or even recognizing the pain of hundreds of UUs of color who are telling the truth of years of silencing and subjection within our faith."}, {"0c6a": "So I ask you now, to stop being afraid and to lean into the power of our faith. Understand that we have set the table in an impossible way and we must now leave that table and forge a new way. We must be bold, we must not give up, we have all that we need —and we have capable people of color who are willing to lead and we cannot do it alone. The usual order and process of things have been disrupted, and my friends this is a blessing because that process, that order that was so comfortable was fraught with deeply rooted and harmful problems. Let us go now, together, on a journey of building a new way and uprooting white supremacy within our communities, in the world around us, and in our own hearts. This can be a new beginning if we make it so."}], "content": "Reflection on quitting, leading, and uprooting our UU faith The Black Lives of UU organizing collective began less than two years ago. Part of our work since our inception has been to make visible injustices within our own faith. It is both personal and incredibly challenging work for all of us, and this work is an integral part of building a world where the full dignity and humanity of Black people is recognized. We understand that our liberation is bound up with others and we work in solidarity with other people of color and Indigenous people. We take seriously a core tenet of almost every spiritual tradition that change begins within. Change happens within the individual, within the collective bodies we are all a part of, and this ought not to come at the expense of hiding out from the world or ceasing to build a new way in the real world. None of this work can be done in isolation. It also cannot be done without commitment, tenacity, and discomfort. I, personally, was not caught off guard by the actions of the UUA administration, the resignation of the President of the administration of the UUA and subsequent resignations in the leadership of the administration. I was caught off guard by the incredible number of Black, people of color, and Indigenous people who came forward from every corner of our faith — religious educators, ministers, lay leaders, everyday parishioners — who poured out their stories of painful discrimination. Many who also felt they could not share or speak up before now and even now, only in confidence with me or other people of color they hold in confidence. People couldn’t share their stories because they feared retaliation from the Ministerial Formation Committee (the committee that decides whether or not people can become ministers), from people in the Leadership Council at the UUA or others in positions of power over them, or they just feared being told they were crazy and it was all in their head. For instance, in this very public case with the position for the regional lead of the Southern Region, the hiring notice clearly indicated living in the region as a requirement. However, when the story went public Scott Tayler attempted to gaslight Christina Rivera and tell her it was all in her head even though there is a screenshot of the original job posting which clearly contradicts Scott Tayler’s declaration. Whether his actions are from incompetence or partiality toward white applicants (even when they clearly don’t meet the listed criteria) the result is a contribution to systemic oppression. The attempted silencing or discrediting of her claims is not living into our deepest faith values and it is continuing to play into oppressive systems that UUs claim to be committed to fighting against. I can publicly talk about this, because Christina Rivera has been courageous enough to be public about her story. There are many others with less power, in different positions in our faith who cannot be public. There are many in our UU family who have held their silence in pain, in fear of their job or of other retaliation for speaking up and it has been a corrosive to their soul. And these cultural practices, these unwritten white cultural norms of defensiveness, discrediting, and minimizing must be vociferously uprooted. They must no longer be tolerated. The voices of Black and Brown people in our faith have been interrogated, minimized, discredited for too long. Even now, the consistent admonishment to call out racism and institutional injustice in the “right way” through the “right” channels, is in and of itself part of the problem. We have already seen that for years upon years, this is not working and has not worked and continues not to work. So why would we continue down this path? It doesn’t make sense. And I implore any UU — whatever their cultural or racial background — who feels the need to question the necessity of directly and unapologetically naming and call out systemic oppression and institutional injustice to ask themselves what they are afraid of? Are you afraid of finding ugliness in your own heart? What are the edges at the corner of your own mind telling you about speaking up and out against the times you have invariably seen oppressive practices or instances and have kept silent? The crisis before us is not the recent resignations in administration — that is just poor leadership. The crisis is that we as a faith body have actively been exclusionary, sometimes in direct ways and sometimes in indirect ways. The crisis is also one of personalization without responsibility. Personalizing systemic critiques as attacks on personhood rather than as attacks on problematic behavior rooted in white supremacy is a problem. It’s a problem that has led to devastating consequences for our faith and immeasurable wounds. To claim that removal of one’s self as the main solution to widespread problematic cultural practices and systemic and institutional oppression is to center and inflate one’s own sense of ego while at the same time abdicating any responsibility for behavior and actions and at the same time render impotent and anemic that power for which one does actually have. All at the same time the resignations simultaneously do present our faith institution with an incredible opportunity, it is also challenging. It is hard work to change one’s behaviors, to face the ways that all of us have been trained by powerful forces to suppress one another and deny the full humanity and dignity of each other based along many lines including gender, race, class, and ability. Even with new leadership, this is still part of the work before each and every person who claims Unitarian Universalism as their own faith. Personally, I believe in the power of our faith to hold me in those most difficult moments of personal transformation and growth and in fact over the years as a part of the Black Lives Matter movement, I have leaned into the power of my faith, of my congregation’s complicated support for strength and nourishment to continue working on myself and the world around me around. One thing I didn’t do was give up and quit. This wasn’t really an option for me and still isn’t an option for me. What’s at stake is too important, and it’s a marker of privilege and of an all too comfortable life to give up when the hardness of life comes careening down around you in new ways that make you uncomfortable. This time of truth telling is a gift and we can choose to receive it with humility and rededicate ourselves to the cause of building Beloved Community. We can embrace new practices that instead of scaring and bullying POCI (people of color and Indigenous) voices into submission and silence, listens carefully and then takes action in accordance. We can embolden and strengthen voices that have been devalued and discredited. This requires that we jettison the commitment to order over process. It takes a sense of urgency but the right urgency — the urgency to do things differently, not just to a rush to fill the vacuum of leadership caused by the fragility of a few people’s egos and quickly return to things as usual. This is an incredible opportunity and a gift and it could be seismic change within our faith — if we are intentional, and seek first to comfort the afflicted and afflict the comfortable, instead of the comforting the comfortable and forgetting the afflicted, which has been the standard for too long in our faith. When I first heard about the hiring decision in the Southern Region, I have to admit I wasn’t that upset. It occurred to me as others were witnessing and giving voice to their pain that I didn’t have that much — and it wasn’t for a good reason. It’s because I’m accustomed to being treated poorly from white people in positions of power and white UUs in particular. I have come to expect mistreatment, minimization, discrediting, and disbelief — so much so that I sometimes do it to my own self because it’s easier than facing the pain of hearing that from your own faith community. But if I am honest, the betrayal, the continued overwhelming silence is painful and facing the truth of the prevalence and insidiousness of white supremacy within the organizations of our faith — congregations and the association — is actually so painful. What does it say about our faith that I cannot expect to be treated with dignity and respect from white UUs? What does it say about our faith that Black and Brown people, and trans people would rather leave than try to speak up and out? What does it say that people are calling this a crisis rather than a reckoning, an opportunity, a breaking open of heart and spirit? Rather than a gift of courage and tenacity from leaders of color — specifically Christina Rivera and Aisha Hauser and Leslie MacFadyen — people’s whose spirits are so whole and intact they have the courage to expect to be treated as fully human, with dignity and respect? What kind of faith purports to be a “movement” but will not give generously and with no strings attached of their gifts of time, talent, treasure, and space to the broader world wide movement for Black Lives (or any justice movement across the country or world)? What kind of faith is that? This is not the faith I recognize. It is not the faith that promised me an unconditional love. It is not a faith that I lean on when I am facing down the police after they have murdered another one of my Black family. It is not a faith I lean on when I am speaking hard truths to the Governor of Minnesota, the City Council, the Deputy Chief of Police, or even the ministers at my own church — the very same ministers who have prayed with me and ministered to me after surgeries, through tough times of all types. This is not the faith I recognize. Journalist Finley Peter Dunne, in 1902, wrote that the job of newspapers is to comfort the afflicted and afflict the comfortable. As I mentioned above I think it is our job in these times, to be a faith that comforts the afflicted and afflicts the comfortable. Our guilt and shame from our privileges is not enough to transform our communities and build a new world — the world that is the promise of this faith. It is constant, unrelenting work and it is a work that most are unwilling to do, but if you proclaim yourself to be a person of faith, you ought to be willing to do it. Jesus did not hesitate in emphatically tipping over tables in the most sacred of places in Judaism, in the Temple. He didn’t hesitate because he knew, as I know, as you know, that change doesn’t come from or in comfort. It is with that spirit that we must now go into the temples of our faith and tip the tables over. We must, must, must be willing to face what we are afraid of facing — that we are not the good people we thought we were. Giving up must not be an option we entertain this time around. The leadership of our faith gave up in 1967, the delegates at General Assembly gave up multiple times in recent years in voting down anti-racism commitments in our faith, and recently the President of the association and other leadership have given up. Thankfully, the association is not our faith. The association is meant to serve our faith, to support our faith, to support the people in the faith and to support the congregations. It means that we cannot give up. This cracking open of our collective institutional heart is an opportunity to change. An invitation to move into discomfort. The thing that is beautiful about this kind of discomfort is that there is freedom, there is a taste of liberation in it and it is life giving even as it is disorienting. This is actual movement work, it’s terribly messy, it’s terribly unforgiving when it comes to comfort and if we are to claim any spiritual fortitude from our faith — now is the time to lean into our beliefs about building a new way, about Beloved Community, about liberation. If we are to be whole and healed people, it first starts with tending to the wounds. And my friends, if there is any crisis in our faith, it is that the Black and Brown people in our faith have been hemorrhaging for too long, have been alone for too long, have been abandoned and thrown away as disposable. Our needs, cares, concerns, are always on the back burner. Our stories always belittled, discredited and we are made to feel as if it’s all in our head and the pain minimized or completely unseen such as this experience related from a Black UU woman: There are just too many places where passive (and sometimes active) resistance to ANY suggestion that institutional racism is at work; too much resistance to the acknowledgment of unconscious bias as a reality; and waaaay too much micro-invalidation. Patronizing, condescension, defensiveness, passive-aggression and other demeaning behaviors are unleashed that end up not only souring the experience of the Search, but also making the individual question the “rightness” of their presence in that community altogether. This has been a damaging experience psychically for me as a Black woman, and as a UU…! If you need another example, let me point to after the election the immediate concern for many ministers was actually to create space for those who voted for the current president of the US and making space for them and their needs, instead of concern for the people whose lives would and are being most directly affected by his policies — our immigrant families which include Black and African people (remember 3 out of the 7 on the list of banned immigrant countries are in Africa) — Black and brown people, trans people, LGBTQ people, and other targeted populations from the Republican regime who were and (justifiably) continue to be afraid for their lives. This is one of many reasons why there is a large number of Black UUs that choose to remain unaffiliated with a bricks and mortar congregation rather than subject themselves to that pain consistently. And even now so many are talking about the hurt of a few “good liberal” white people in leadership electing to give up, rather than tending to or even recognizing the pain of hundreds of UUs of color who are telling the truth of years of silencing and subjection within our faith. So I ask you now, to stop being afraid and to lean into the power of our faith. Understand that we have set the table in an impossible way and we must now leave that table and forge a new way. We must be bold, we must not give up, we have all that we need —and we have capable people of color who are willing to lead and we cannot do it alone. The usual order and process of things have been disrupted, and my friends this is a blessing because that process, that order that was so comfortable was fraught with deeply rooted and harmful problems. Let us go now, together, on a journey of building a new way and uprooting white supremacy within our communities, in the world around us, and in our own hearts. This can be a new beginning if we make it so. ", "child": "530_1\t530_2"}