{"name": "532", "parent": "", "title": "Minnesota Republicans accuse female legislator of racism because she criticized white men", "sentences": [{"4a8f": "Minnesota Republicans accuse female legislator of racism because she criticized white men"}, {"4408": "Rep. Melissa Hortman is not sorry."}, {"33f5": "On April 4, America’s first Somali legislator —Rep. Ilhan Omar (D) — made a speech on the House floor about the connection between today’s Black Lives Matter activists and civil rights icons like Martin Luther King Jr. She was speaking out in opposition to a Republican bill that would increase penalties for protesters if they block highways — a tactic that has been used in Minnesota in response to the deaths of Jamar Clark and Philando Castile at the hands of cops."}, {"fd1a": "But many Republicans weren’t around to hear what Omar and other Minnesota legislators of color like Rep. Susan Allen (D) had to say. Instead of being on the floor, they were relaxing in a separate room."}, {"a104": "House Minority Leader Melissa Hortman (D) wasn’t happy about it. So she made a “call of the House” to get members back to the floor."}, {"6552": "Minnesota Lawmaker Launches Possibly Unconstitutional Attempt To Curtail Black Lives Matter…thinkprogress.org"}, {"e2dd": "“I hate to break up the 100 percent white male card game in the retiring room, but I think this is an important debate,” Hortman said."}, {"121a": "Her remark apparently cut Republicans close to the bone. Rep. Bob Dettmer (R) said, “I’m a white male — I respect everybody. But I really believe that the comments made by the minority leader were really not appropriate.”"}, {"53a8": "Dettmer asked Hortman to apologize, but that wasn’t happening."}, {"61b9": "“I have no intention of apologizing,” she said, adding that she’s “really tired of watching women of color in particular being ignored. So I’m not sorry.”"}, {"55c6": "House Republican Majority Leader Joyce Peppin called Hortman’s claim “racist,” and Republicans continued to play the race card in the days that followed. The longest-tenured Republican in the House, Rep. Greg Davids, told the Rochester Post-Bulletin he “was greatly offended by Hortman’s racist statement about white males. I believe her comments have created a very hostile working environment.” Davids even called on Hortman to resign."}, {"5418": "On Friday, dozens of Republicans signed a letter that will be entered in the House’s official journal saying Hortman’s comments “needlessly invoked the race and gender of her colleagues, and called into question the motives of members during a lengthy floor debate.”"}, {"7185": "“We the undersigned members of the Members of the House of Representatives admonish Minority Leader Hortman for her statements,” it continues. “We implore Minority Leader Hortman to apologize for her actions and strive to repair damage she has caused to the collaborative work environment at the Minnesota House of Representatives.”"}, {"496a": "Hortman responded later Friday with a four-word statement: “I’m still not sorry.”"}, {"efbd": "Reached for comment Monday afternoon, Hortman told ThinkProgress that she “wanted members who hadn’t ever suffered racism to listen to the women of color on the floor talk about their experiences.”"}, {"a85a": "“The point that Rep. Allen and Rep. [Rena] Moran were making that was so eloquently stated was that this is still an issue today,” she continued. “We’re not done with the work that we need to with civil rights, and they spoke on their own experiences having lived in this society. What I thought Rep. Moran spoke to so eloquently is that the laws are not fair and just to all people at all times, and this is still true today.”"}, {"1ded": "Hortman, a 12-year veteran of the legislature, said the retiring room card games are a new development. She attributed them to the culture fostered by House Speaker Kurt Daudt (R) since he took over the Speaker’s gavel following the 2014 election. Last year, the House Republican majority had mute buttons installed, allowing Daudt to cut legislators’ microphones whenever he wants."}, {"b2ef": "“Under Speaker Daudt, tolerance for dissent is at an all-time low,” Hortman said. “Going back and playing cards takes intolerance to dissent to its logical conclusion, which is if you don’t agree with them, you don’t have to listen.”"}, {"b280": "Hortman added that she thinks her comments “just exposed the gulf between the two parties, really turns a light on the fact that we are so far apart that we are not even listening to each other.”"}, {"9ca8": "“I hope the result of this will be that we spend more time and energy listening to each other — why is it that we are so divided, have gotten to this point where we don’t even feel a need to listen?” she said."}, {"7666": "The back-and-forth generated by Hortman’s comments overshadowed the fact that the anti-protesting measure was approved as part of a public safety package. In January, Gov. Mark Dayton (D) expressed concern about the measure, saying he feels “very strongly that (the right to protest) is a fundamental right that needs to be honored and protected, even when people disagree with what’s being said.” Dayton acknowledged the role systemic racism in the death of Castile, saying last summer that he thought Castile would still be alive if he were white."}, {"5654": "But Dayton also said he “would draw the line at something like… shutting down a freeway,” so it’s unclear whether he’d sign a public safety package containing the anti-protesting measure."}], "content": "Minnesota Republicans accuse female legislator of racism because she criticized white men Rep. Melissa Hortman is not sorry. On April 4, America’s first Somali legislator —Rep. Ilhan Omar (D) — made a speech on the House floor about the connection between today’s Black Lives Matter activists and civil rights icons like Martin Luther King Jr. She was speaking out in opposition to a Republican bill that would increase penalties for protesters if they block highways — a tactic that has been used in Minnesota in response to the deaths of Jamar Clark and Philando Castile at the hands of cops. But many Republicans weren’t around to hear what Omar and other Minnesota legislators of color like Rep. Susan Allen (D) had to say. Instead of being on the floor, they were relaxing in a separate room. House Minority Leader Melissa Hortman (D) wasn’t happy about it. So she made a “call of the House” to get members back to the floor. Minnesota Lawmaker Launches Possibly Unconstitutional Attempt To Curtail Black Lives Matter…thinkprogress.org “I hate to break up the 100 percent white male card game in the retiring room, but I think this is an important debate,” Hortman said. Her remark apparently cut Republicans close to the bone. Rep. Bob Dettmer (R) said, “I’m a white male — I respect everybody. But I really believe that the comments made by the minority leader were really not appropriate.” Dettmer asked Hortman to apologize, but that wasn’t happening. “I have no intention of apologizing,” she said, adding that she’s “really tired of watching women of color in particular being ignored. So I’m not sorry.” House Republican Majority Leader Joyce Peppin called Hortman’s claim “racist,” and Republicans continued to play the race card in the days that followed. The longest-tenured Republican in the House, Rep. Greg Davids, told the Rochester Post-Bulletin he “was greatly offended by Hortman’s racist statement about white males. I believe her comments have created a very hostile working environment.” Davids even called on Hortman to resign. On Friday, dozens of Republicans signed a letter that will be entered in the House’s official journal saying Hortman’s comments “needlessly invoked the race and gender of her colleagues, and called into question the motives of members during a lengthy floor debate.” “We the undersigned members of the Members of the House of Representatives admonish Minority Leader Hortman for her statements,” it continues. “We implore Minority Leader Hortman to apologize for her actions and strive to repair damage she has caused to the collaborative work environment at the Minnesota House of Representatives.” Hortman responded later Friday with a four-word statement: “I’m still not sorry.” Reached for comment Monday afternoon, Hortman told ThinkProgress that she “wanted members who hadn’t ever suffered racism to listen to the women of color on the floor talk about their experiences.” “The point that Rep. Allen and Rep. [Rena] Moran were making that was so eloquently stated was that this is still an issue today,” she continued. “We’re not done with the work that we need to with civil rights, and they spoke on their own experiences having lived in this society. What I thought Rep. Moran spoke to so eloquently is that the laws are not fair and just to all people at all times, and this is still true today.” Hortman, a 12-year veteran of the legislature, said the retiring room card games are a new development. She attributed them to the culture fostered by House Speaker Kurt Daudt (R) since he took over the Speaker’s gavel following the 2014 election. Last year, the House Republican majority had mute buttons installed, allowing Daudt to cut legislators’ microphones whenever he wants. “Under Speaker Daudt, tolerance for dissent is at an all-time low,” Hortman said. “Going back and playing cards takes intolerance to dissent to its logical conclusion, which is if you don’t agree with them, you don’t have to listen.” Hortman added that she thinks her comments “just exposed the gulf between the two parties, really turns a light on the fact that we are so far apart that we are not even listening to each other.” “I hope the result of this will be that we spend more time and energy listening to each other — why is it that we are so divided, have gotten to this point where we don’t even feel a need to listen?” she said. The back-and-forth generated by Hortman’s comments overshadowed the fact that the anti-protesting measure was approved as part of a public safety package. In January, Gov. Mark Dayton (D) expressed concern about the measure, saying he feels “very strongly that (the right to protest) is a fundamental right that needs to be honored and protected, even when people disagree with what’s being said.” Dayton acknowledged the role systemic racism in the death of Castile, saying last summer that he thought Castile would still be alive if he were white. But Dayton also said he “would draw the line at something like… shutting down a freeway,” so it’s unclear whether he’d sign a public safety package containing the anti-protesting measure. ", "child": "532_1\t532_2\t532_3\t532_4\t532_5\t532_6\t532_7\t532_8\t532_9\t532_10\t532_11\t532_12\t532_13\t532_14\t532_15\t532_16\t532_17\t532_18\t532_19\t532_20\t532_21\t532_22\t532_23\t532_24\t532_25"}