{"name": "533", "parent": "", "title": "5 Quick Things The Loeb Family Can Do", "sentences": [{"2341": "5 Quick Things The Loeb Family Can Do"}, {"54e1": "By now you’ve probably heard about the racist rant that Loeb progeny, Lauren Loeb allegedly delivered by phone in Turks and Caicos last week."}, {"1505": "Both Lauren Loeb, the granddaughter of former Memphis mayor Henry Loeb, and the other Loeb family branch, which runs Loeb Properties, have their lawyers’ wheels spinning, hoping to stem the destruction caused by Lauren’s (allegedly) hateful potty mouth. (Here’s the transcript of the call.)"}, {"a58f": "The denial and distance game isn’t sitting well with many Memphians, especially black Memphians, for whom this incident opened recent and aged wounds regarding both branches of the Loeb family and their history of discriminatory business and political practices."}, {"ea23": "The Loeb family (both branches) might find the legal and media spin route isn’t the best route. So here are 5 quick actions (in the vein of Heavy.com) they can take to begin to make amends for it all — from Henry Loeb’s role in Dr. Martin Luther King Jr.’s murder to Loeb Properties’ discriminatory leasing practices to Lauren Loeb’s (allegedly) spoiled racist tantrum and everything in between."}, {"aebd": "For those asking, why does any of this matter and how are the other Loeb’s responsible for Lauren Loeb’s behavior, I’ll let Dr. King himself answer that: “Capitalism was built on the exploitation and suffering of black slaves and continues to thrive on the exploitation of the poor — both black and white, both here and abroad.” Lauren’s privilege and wealth is the outcome of generations of profit from the exploitation of black people in Memphis. The same is true for the owners of Loeb Properties who profited from segregation to own 2 million square feet of Memphis land today. While Lauren’s outburst was an outward show of this privilege, the family businesses have implicitly participated in equally distasteful acts and should be held responsible for the unbalanced system of racism and generational poverty that they benefit from today."}, {"cd75": "Tami Sawyer is an education reformer and a local social and political activist. She believes Black Lives Matter and so should you."}], "content": "5 Quick Things The Loeb Family Can Do By now you’ve probably heard about the racist rant that Loeb progeny, Lauren Loeb allegedly delivered by phone in Turks and Caicos last week. Both Lauren Loeb, the granddaughter of former Memphis mayor Henry Loeb, and the other Loeb family branch, which runs Loeb Properties, have their lawyers’ wheels spinning, hoping to stem the destruction caused by Lauren’s (allegedly) hateful potty mouth. (Here’s the transcript of the call.) The denial and distance game isn’t sitting well with many Memphians, especially black Memphians, for whom this incident opened recent and aged wounds regarding both branches of the Loeb family and their history of discriminatory business and political practices. The Loeb family (both branches) might find the legal and media spin route isn’t the best route. So here are 5 quick actions (in the vein of Heavy.com) they can take to begin to make amends for it all — from Henry Loeb’s role in Dr. Martin Luther King Jr.’s murder to Loeb Properties’ discriminatory leasing practices to Lauren Loeb’s (allegedly) spoiled racist tantrum and everything in between. For those asking, why does any of this matter and how are the other Loeb’s responsible for Lauren Loeb’s behavior, I’ll let Dr. King himself answer that: “Capitalism was built on the exploitation and suffering of black slaves and continues to thrive on the exploitation of the poor — both black and white, both here and abroad.” Lauren’s privilege and wealth is the outcome of generations of profit from the exploitation of black people in Memphis. The same is true for the owners of Loeb Properties who profited from segregation to own 2 million square feet of Memphis land today. While Lauren’s outburst was an outward show of this privilege, the family businesses have implicitly participated in equally distasteful acts and should be held responsible for the unbalanced system of racism and generational poverty that they benefit from today. Tami Sawyer is an education reformer and a local social and political activist. She believes Black Lives Matter and so should you. ", "child": "533_1"}