{"name": "534", "parent": "", "title": "White Boy Problems", "sentences": [{"e84e": "White Boy Problems"}, {"f06e": "By: Rosalind Wiseman"}, {"d1b9": "I’ve been working with teens and parents for over twenty years and lately I’ve been getting a lot of questions about how to talk about racism and privilege without people getting defensive and jumping to the worst of conclusions about each other. Here’s one question from a mother I recently received:"}, {"3974": "My 16-year-old son is an open-minded person who sees people for what they do, not what they look like. I’m proud of his acceptance of people who are different than him. He’s politically savvy and we’ve had many discussions about the election. Out of the blue the other day he said that he feels hated because he is a white male. He doesn’t want to be defensive but it’s hard to know what to tell him when so many seem to be against the demographic that he fits into. I’m sure he’s not alone in feeling this way. Any thoughts?"}, {"27e7": "Here’s the truth: None of us are entirely open-minded. It’s like when people say, “I don’t see color” or “I don’t have a racist bone in my body.” Not possible. People only say that if they don’t know how racism and bigotry work. We have all been raised to judge people based on race, class, and how we conform to cultural rules about how we “should” look or act. The sooner we admit it, the sooner we can have more interesting, honest conversations."}, {"7c75": "We are creating a reinforcing cycle; the more we cling to the belief that we are free of bias, the more defensive, blind, and deaf we are to our biases."}, {"bcc2": "What does this mean for your son? As the mother of two white boys myself, this is something I think about as well. Your son, like my boys, has the right to his experiences and his feelings about those experiences — just like everyone else has the right to theirs. And I’m sure it’s annoying for him to experience people making negative assumptions about him because he is a white male. But it’s also time for him to grow up. For example, black women put up with people’s negative assumptions about them on a regular basis."}, {"f957": "It’s exhausting choosing which battles to fight and how to fight them — without being stereotyped as an “angry black woman.” It’s part of their lived experience. So it’s good for your son to be uncomfortable. It’s good for him to feel what it’s like for people to make assumptions about him that he thinks are unfair and inaccurate. It’s good for him to feel what it’s like to be labeled. Then he can take those experiences, learn from them, and use them to increase his own understanding of the people who live around him."}, {"be5c": "But how? Even well-intentioned people in his situation can be nervous about making “a mistake” and saying the wrong thing. But there’s also a lot of willful ignorance and callousness out there. I’ve had several teen boys say recently that they just wished people would stop talking about race and that if we did, it would stop racism from happening. It’s an illogical argument — the people who experience racism and discrimination have no choice but to think about it and talk about it because it’s part of their everyday experience. It’s only people who are not discriminated against that believe this argument makes sense because they can convince themselves that the problem doesn’t exist. But their response is motivated by fear — fear of not knowing how to be with people who have a different life experience, fear of facing a person’s anger, and fear that people who have been systematically disempowered will be given equal power and voice."}, {"56ad": "If your son really wants to address this issue here are some responses he can use when the conversation makes him defensive or he wants to rage:"}, {"b112": "I’m asking because I’m curious and I really want to know what you think and how you experienced x."}, {"79df": "If I say something that comes across as hurtful or ignorant, I want you to tell me."}, {"4b54": "Help me understand…"}, {"766d": "I’m asking that you listen to me and don’t assume I’m only what you see. Yes, I’m male and white but I’m also a lot of other things. It doesn’t take away from my privilege but the other parts of me are important to who I am and how I want to show up in the world."}, {"9db9": "He also need to challenge himself. Is he willing to speak out when he sees other people, especially people who look like him, abuse their privilege? The reality is that many young, white men don’t speak out when their white, male peers abuse their privilege. They stand by and laugh. They stand by and make excuses. They stand by and tell the person who is being dismissed to let it go and stop making such a big deal of it. If your son really wants people to see beyond his gender and race, that he needs to act out and speak against white male privilege when he sees it in his own life."}, {"a555": "Because the bottom line is real men, honorable men, are strong enough to be uncomfortable with their privilege, have the courage to stay in conversations with people who may be angry at what our sons represent, and have the confidence to speak out against bigotry in any form. It’s the only way he’s going to break out of the box he says he doesn’t want to be in."}, {"cbbb": "Read more on the Cultures of Dignity blog"}], "content": "White Boy Problems By: Rosalind Wiseman I’ve been working with teens and parents for over twenty years and lately I’ve been getting a lot of questions about how to talk about racism and privilege without people getting defensive and jumping to the worst of conclusions about each other. Here’s one question from a mother I recently received: My 16-year-old son is an open-minded person who sees people for what they do, not what they look like. I’m proud of his acceptance of people who are different than him. He’s politically savvy and we’ve had many discussions about the election. Out of the blue the other day he said that he feels hated because he is a white male. He doesn’t want to be defensive but it’s hard to know what to tell him when so many seem to be against the demographic that he fits into. I’m sure he’s not alone in feeling this way. Any thoughts? Here’s the truth: None of us are entirely open-minded. It’s like when people say, “I don’t see color” or “I don’t have a racist bone in my body.” Not possible. People only say that if they don’t know how racism and bigotry work. We have all been raised to judge people based on race, class, and how we conform to cultural rules about how we “should” look or act. The sooner we admit it, the sooner we can have more interesting, honest conversations. We are creating a reinforcing cycle; the more we cling to the belief that we are free of bias, the more defensive, blind, and deaf we are to our biases. What does this mean for your son? As the mother of two white boys myself, this is something I think about as well. Your son, like my boys, has the right to his experiences and his feelings about those experiences — just like everyone else has the right to theirs. And I’m sure it’s annoying for him to experience people making negative assumptions about him because he is a white male. But it’s also time for him to grow up. For example, black women put up with people’s negative assumptions about them on a regular basis. It’s exhausting choosing which battles to fight and how to fight them — without being stereotyped as an “angry black woman.” It’s part of their lived experience. So it’s good for your son to be uncomfortable. It’s good for him to feel what it’s like for people to make assumptions about him that he thinks are unfair and inaccurate. It’s good for him to feel what it’s like to be labeled. Then he can take those experiences, learn from them, and use them to increase his own understanding of the people who live around him. But how? Even well-intentioned people in his situation can be nervous about making “a mistake” and saying the wrong thing. But there’s also a lot of willful ignorance and callousness out there. I’ve had several teen boys say recently that they just wished people would stop talking about race and that if we did, it would stop racism from happening. It’s an illogical argument — the people who experience racism and discrimination have no choice but to think about it and talk about it because it’s part of their everyday experience. It’s only people who are not discriminated against that believe this argument makes sense because they can convince themselves that the problem doesn’t exist. But their response is motivated by fear — fear of not knowing how to be with people who have a different life experience, fear of facing a person’s anger, and fear that people who have been systematically disempowered will be given equal power and voice. If your son really wants to address this issue here are some responses he can use when the conversation makes him defensive or he wants to rage: I’m asking because I’m curious and I really want to know what you think and how you experienced x. If I say something that comes across as hurtful or ignorant, I want you to tell me. Help me understand… I’m asking that you listen to me and don’t assume I’m only what you see. Yes, I’m male and white but I’m also a lot of other things. It doesn’t take away from my privilege but the other parts of me are important to who I am and how I want to show up in the world. He also need to challenge himself. Is he willing to speak out when he sees other people, especially people who look like him, abuse their privilege? The reality is that many young, white men don’t speak out when their white, male peers abuse their privilege. They stand by and laugh. They stand by and make excuses. They stand by and tell the person who is being dismissed to let it go and stop making such a big deal of it. If your son really wants people to see beyond his gender and race, that he needs to act out and speak against white male privilege when he sees it in his own life. Because the bottom line is real men, honorable men, are strong enough to be uncomfortable with their privilege, have the courage to stay in conversations with people who may be angry at what our sons represent, and have the confidence to speak out against bigotry in any form. It’s the only way he’s going to break out of the box he says he doesn’t want to be in. Read more on the Cultures of Dignity blog ", "child": "534_1\t534_2\t534_3\t534_4\t534_5\t534_6\t534_7\t534_8\t534_9\t534_10\t534_11\t534_12\t534_13\t534_14\t534_15\t534_16\t534_17\t534_18\t534_19\t534_20\t534_21\t534_22\t534_23\t534_24\t534_25534_1\t534_2\t534_3\t534_4\t534_5\t534_6\t534_7\t534_8\t534_9\t534_10\t534_11\t534_12\t534_13\t534_14\t534_15\t534_16\t534_17\t534_18\t534_19\t534_20\t534_21\t534_22\t534_23\t534_24\t534_25"}