{"name": "538", "parent": "", "title": "5 red flags every woman should look for at her next startup job", "sentences": [{"c9a2": "5 red flags every woman should look for at her next startup job"}, {"6ad1": "There is a moment at every work place when you know time is up. There is a mental switch that looks a lot like that scene in Closer when Natalie Portman tells Jude Law that she doesn’t love him anymore."}, {"b6c7": "For me it’s just like that. I’ll be fine for a while, chugging along making effort, making excuses and then one day I’m just done."}, {"0479": "This is what happened last summer."}, {"373e": "It was a gift really. A job hunt is an excellent time to reassess what is important to you. What you can live with and what you can’t. The ideal makeup of your new workplace."}, {"54fd": "What I found in my search were 5 red flags — and there are more than 5 but I wanted to keep this to the point — that give me pause when I’m considering applying for or accepting an offer from a new company."}, {"9d65": "I want to begin by saying that just because these things are red flags for ME, it doesn’t mean that they are shitty companies or places where you couldn’t work. All I’m saying is I’ve been around the block and as an almost 33-year-old married lady with a 3-year-old daughter, there are some things I’m just not gonna put up with anymore."}, {"24d3": "So here’s my list."}, {"d180": "Companies that emphasize “culture”"}, {"ea6e": "Culture is great when it means an organization is committed to the health and growth of its employees. If it sponsors your gym membership or has flexible hours to support your or your family’s doctor’s appointments. If they are committed to regular reviews with well-defined career growth paths or have institutionalized ways to ensure every employee’s voice is heard. That is all great."}, {"7fa1": "Culture IS great when it is supported by the organization you are working for in order to bolster the employees and make their work-life balance better."}, {"1fe2": "Culture is NOT great when it is an undefined set of attributes used to determine whether or not someone is a “fit” for an organization."}, {"d2d5": "Or if it’s used in the same sentence as “snacks” and “ping pong” tables."}, {"bfa6": "Read next: Jerks and the Start-ups they Ruin."}, {"5262": "If a recruiter talks about “culture” in the second way, I push them for what that actually means. Because what it usually means is, “we’ve concocted an arbitrary set of attributes that define what a person who works here looks like.”"}, {"ab8f": "Which means their focus is on creating a homogeneous workforce of people who look the same, come from the same socio-economic backgrounds, have the same type of education, are healthy, able-bodied and most likely attractive, are probably either white or asian, and between the age of 23–30."}, {"7a9f": "It does not leave room for people who are different or diverse."}, {"8aaf": "It doesn’t even leave room for people who are introverted or nerdy or have interests outside of what the organization deems cool."}, {"a01d": "Workplaces like this can be fun, because if you fit within that culture it means you probably have a lot in common with your colleagues. But what it also means is, the minute something happens to you and you no longer fit (baby, health issues, mental health issues — or weight gain, GOD FORBID), the organization will become hostile. It isn’t built to support you."}, {"12e0": "Also, homogenous workplaces are BORING af. What are you going to learn from a bunch of people just like you? Not much."}, {"ef60": "Startups whose offices are EXTRA"}, {"886b": "Every start-up has a Crunchbase profile, and I highly recommend looking at it before interviewing anywhere. Think of yourself as an investor. You are investing your time and energy, and depending on the level of position you’re interviewing for, you will most likely get some equity."}, {"3f48": "When evaluating a start-up I want to know a) how much money this company has raised and b) how they spend it."}, {"c3d5": "Nice splashy offices are fun and do attract talent, but those things can come later in start-up life."}, {"71c4": "If the business is not profitable, if it seems like the are extravagant in their spending for the stage they are at, then I’m definitely suspicious."}, {"d1cc": "While having amenities are nice I much prefer an organization that is financially responsible. An organization that is investing their funds in the right things and focusing on growth. Amazon is notoriously frugal. As they put it, “Frugality breeds resourcefulness, self-sufficiency, and invention.”"}, {"ce23": "Read next: A peek inside Amazon’s Frugality."}, {"8c43": "It’s not as much fun, but neither is bankruptcy. To sum my point up in meme form:"}, {"09a6": "@sadmichaeljordan Instagram"}, {"7b97": "Bro CEO, i.e. a white man below 35"}, {"ccf2": "Especially if he is unmarried without kids, has little-to-no business experience, and has a super-inflated ego. You can throw a rock in Silicon Beach or Valley and hit like a 100 CEOs that fit this description, so maybe it’s a bit too exclusionary, BUT it goes back to what I said about culture above."}, {"3164": "Men who fit this description, unless their Mamas raised them right, lack the empathy required to be good managers at the CEO level. Their focus is going to be on aggressive growth, not on sustainable healthy workplaces. They won’t understand the importance of creating a workplace where human capital should be a priority, where little things like, valuing people’s ideas equally and making sure that women don’t get manterrupted in meetings, giving equal opportunities for stretch assignments that can grow women into leadership roles can make a substantive difference."}, {"c933": "Equity in the workplace isn’t something that just happens. An organization has to value it and put in place systemic checks to make it happen."}, {"16af": "See next: Kapor Capital’s Founders Commitment initiative"}, {"e706": "CEOs that fit the description I mentioned above usually don’t think about it because the world is built for them."}, {"d9f3": "Rebecca Solnit says it best in her essay “Men Explain Lolita to Me,” and honestly I could quote her entire essay so please go read it yourself."}, {"682e": "The essay is in reference to men mansplaining Lolita to her, but I think it’s relevant in a workplace scenario as well."}, {"f1fd": "This (men mistaking their opinions for facts) can happen if he’s been insufficiently exposed to the fact that there are also other people who have other experiences, and that they too were created equal, with certain inalienable rights, and that consciousness thing that is so interesting and troubling is also going on inside their heads. This is a problem straight white men suffer from especially, because the western world has held up a mirror to them for so long…"}, {"9ed9": "The rest of us get used to the transgendering and cross-racializing of our identities as we invest in protagonists like Ishmael or Dirty Harry or Holden Caulfield. But straight white men don’t, so much."}, {"326f": "I coined a term a while ago, privelobliviousness, to try to describe the way that being the advantaged one, the represented one, often means being the one who doesn’t need to be aware and, often, isn’t…."}, {"f449": "So much of feminism has been women speaking up about hitherto unacknowledged experiences, and so much of antifeminism has been men telling them these things don’t happen… Non-white people get much the same rubbish about how there isn’t racism and they don’t get treated differently and race doesn’t affect any of us, because who knows better than white people who are trying to silence people of color? And queer people too, but we all know all of that already, or should if we are paying attention."}, {"7f7c": "This paying attention is the foundational act of empathy, of listening, of seeing, of imagining experiences other than one’s own, of getting out of the boundaries of one’s own experience."}, {"be4d": "Most white male CEOs under 35 rarely consider other people’s experiences, because they haven’t had to."}, {"aef6": "ZERO women on the executive team"}, {"1dcd": "Do I need to explain this one? Okay, I will."}, {"be10": "If there are no women in positions of leadership or the ones that are there fill traditionally female occupations like Human Resources or Customer Care (the ones that deal with the soft side of business), then it shows an organization that doesn’t support the growth of women or believe that women can fill important decision-making roles."}, {"8436": "I’ve raised this question to management before (at a previous company) and got the “binders full of women,” explanation for trying to find women candidates to fill important executive level roles. I’ve even heard the, “we are going to hire the best candidate regardless of gender or race,” spiel."}, {"d66d": "Listen Bro, I’ve heard all this before."}, {"01e7": "What it means is there is systemic bias at the company that YOU share and propagate about women in leadership OR you just don’t want to listen to a woman telling you what to do. Just own it. It’s fine. Meanwhile I’ll take my vagina elsewhere."}, {"3c02": "You don’t interview with colleagues or people in more junior positions"}, {"6a12": "This is a huge one for me. If the organization won’t let me interview my potential peers it shows me that they don’t value their opinions. They are planning on bringing someone in without the buy-in of the people who will be working directly for or with them. Or they are afraid of what they will say."}, {"10b9": "Either way it a necessary part of the evaluation process and part of my due diligence."}, {"6cbc": "Pro tip: Reach out to people who have worked for the person who will be your new boss at previous companies AND reach out to people who have left the company you are considering. You will get the best unbiased data on how that employer fares in the categories that are important to you."}, {"d3e6": "So that is pretty much it. It seems pretty obvious, but I believe it is important to know that we have some control over the environments that we choose for ourselves. Happy hunting, ladies."}, {"6263": "More advice for working women from working women at www.women.work"}], "content": "5 red flags every woman should look for at her next startup job There is a moment at every work place when you know time is up. There is a mental switch that looks a lot like that scene in Closer when Natalie Portman tells Jude Law that she doesn’t love him anymore. For me it’s just like that. I’ll be fine for a while, chugging along making effort, making excuses and then one day I’m just done. This is what happened last summer. It was a gift really. A job hunt is an excellent time to reassess what is important to you. What you can live with and what you can’t. The ideal makeup of your new workplace. What I found in my search were 5 red flags — and there are more than 5 but I wanted to keep this to the point — that give me pause when I’m considering applying for or accepting an offer from a new company. I want to begin by saying that just because these things are red flags for ME, it doesn’t mean that they are shitty companies or places where you couldn’t work. All I’m saying is I’ve been around the block and as an almost 33-year-old married lady with a 3-year-old daughter, there are some things I’m just not gonna put up with anymore. So here’s my list. Companies that emphasize “culture” Culture is great when it means an organization is committed to the health and growth of its employees. If it sponsors your gym membership or has flexible hours to support your or your family’s doctor’s appointments. If they are committed to regular reviews with well-defined career growth paths or have institutionalized ways to ensure every employee’s voice is heard. That is all great. Culture IS great when it is supported by the organization you are working for in order to bolster the employees and make their work-life balance better. Culture is NOT great when it is an undefined set of attributes used to determine whether or not someone is a “fit” for an organization. Or if it’s used in the same sentence as “snacks” and “ping pong” tables. Read next: Jerks and the Start-ups they Ruin. If a recruiter talks about “culture” in the second way, I push them for what that actually means. Because what it usually means is, “we’ve concocted an arbitrary set of attributes that define what a person who works here looks like.” Which means their focus is on creating a homogeneous workforce of people who look the same, come from the same socio-economic backgrounds, have the same type of education, are healthy, able-bodied and most likely attractive, are probably either white or asian, and between the age of 23–30. It does not leave room for people who are different or diverse. It doesn’t even leave room for people who are introverted or nerdy or have interests outside of what the organization deems cool. Workplaces like this can be fun, because if you fit within that culture it means you probably have a lot in common with your colleagues. But what it also means is, the minute something happens to you and you no longer fit (baby, health issues, mental health issues — or weight gain, GOD FORBID), the organization will become hostile. It isn’t built to support you. Also, homogenous workplaces are BORING af. What are you going to learn from a bunch of people just like you? Not much. Startups whose offices are EXTRA Every start-up has a Crunchbase profile, and I highly recommend looking at it before interviewing anywhere. Think of yourself as an investor. You are investing your time and energy, and depending on the level of position you’re interviewing for, you will most likely get some equity. When evaluating a start-up I want to know a) how much money this company has raised and b) how they spend it. Nice splashy offices are fun and do attract talent, but those things can come later in start-up life. If the business is not profitable, if it seems like the are extravagant in their spending for the stage they are at, then I’m definitely suspicious. While having amenities are nice I much prefer an organization that is financially responsible. An organization that is investing their funds in the right things and focusing on growth. Amazon is notoriously frugal. As they put it, “Frugality breeds resourcefulness, self-sufficiency, and invention.” Read next: A peek inside Amazon’s Frugality. It’s not as much fun, but neither is bankruptcy. To sum my point up in meme form: @sadmichaeljordan Instagram Bro CEO, i.e. a white man below 35 Especially if he is unmarried without kids, has little-to-no business experience, and has a super-inflated ego. You can throw a rock in Silicon Beach or Valley and hit like a 100 CEOs that fit this description, so maybe it’s a bit too exclusionary, BUT it goes back to what I said about culture above. Men who fit this description, unless their Mamas raised them right, lack the empathy required to be good managers at the CEO level. Their focus is going to be on aggressive growth, not on sustainable healthy workplaces. They won’t understand the importance of creating a workplace where human capital should be a priority, where little things like, valuing people’s ideas equally and making sure that women don’t get manterrupted in meetings, giving equal opportunities for stretch assignments that can grow women into leadership roles can make a substantive difference. Equity in the workplace isn’t something that just happens. An organization has to value it and put in place systemic checks to make it happen. See next: Kapor Capital’s Founders Commitment initiative CEOs that fit the description I mentioned above usually don’t think about it because the world is built for them. Rebecca Solnit says it best in her essay “Men Explain Lolita to Me,” and honestly I could quote her entire essay so please go read it yourself. The essay is in reference to men mansplaining Lolita to her, but I think it’s relevant in a workplace scenario as well. This (men mistaking their opinions for facts) can happen if he’s been insufficiently exposed to the fact that there are also other people who have other experiences, and that they too were created equal, with certain inalienable rights, and that consciousness thing that is so interesting and troubling is also going on inside their heads. This is a problem straight white men suffer from especially, because the western world has held up a mirror to them for so long… The rest of us get used to the transgendering and cross-racializing of our identities as we invest in protagonists like Ishmael or Dirty Harry or Holden Caulfield. But straight white men don’t, so much. I coined a term a while ago, privelobliviousness, to try to describe the way that being the advantaged one, the represented one, often means being the one who doesn’t need to be aware and, often, isn’t…. So much of feminism has been women speaking up about hitherto unacknowledged experiences, and so much of antifeminism has been men telling them these things don’t happen… Non-white people get much the same rubbish about how there isn’t racism and they don’t get treated differently and race doesn’t affect any of us, because who knows better than white people who are trying to silence people of color? And queer people too, but we all know all of that already, or should if we are paying attention. This paying attention is the foundational act of empathy, of listening, of seeing, of imagining experiences other than one’s own, of getting out of the boundaries of one’s own experience. Most white male CEOs under 35 rarely consider other people’s experiences, because they haven’t had to. ZERO women on the executive team Do I need to explain this one? Okay, I will. If there are no women in positions of leadership or the ones that are there fill traditionally female occupations like Human Resources or Customer Care (the ones that deal with the soft side of business), then it shows an organization that doesn’t support the growth of women or believe that women can fill important decision-making roles. I’ve raised this question to management before (at a previous company) and got the “binders full of women,” explanation for trying to find women candidates to fill important executive level roles. I’ve even heard the, “we are going to hire the best candidate regardless of gender or race,” spiel. Listen Bro, I’ve heard all this before. What it means is there is systemic bias at the company that YOU share and propagate about women in leadership OR you just don’t want to listen to a woman telling you what to do. Just own it. It’s fine. Meanwhile I’ll take my vagina elsewhere. You don’t interview with colleagues or people in more junior positions This is a huge one for me. If the organization won’t let me interview my potential peers it shows me that they don’t value their opinions. They are planning on bringing someone in without the buy-in of the people who will be working directly for or with them. Or they are afraid of what they will say. Either way it a necessary part of the evaluation process and part of my due diligence. Pro tip: Reach out to people who have worked for the person who will be your new boss at previous companies AND reach out to people who have left the company you are considering. You will get the best unbiased data on how that employer fares in the categories that are important to you. So that is pretty much it. It seems pretty obvious, but I believe it is important to know that we have some control over the environments that we choose for ourselves. Happy hunting, ladies. More advice for working women from working women at www.women.work ", "child": "538_1\t538_2\t538_3\t538_4\t538_5\t538_6\t538_7\t538_8\t538_9\t538_10\t538_11\t538_12\t538_13\t538_14\t538_15\t538_16\t538_17\t538_18\t538_19\t538_20\t538_21\t538_22\t538_23\t538_24\t538_25"}