{"name": "542", "parent": "", "title": "Typography can make or break your design: a process for choosing type", "sentences": [{"38dd": "Typography can make or break your design: a process for choosing type"}, {"6d81": "One of the most important skills you can learn as a designer is how to choose type. This is because text is one of the primary ways designers can communicate with users. Typography can make or break a design."}, {"0751": "There’s a beauty and complexity to typography. Some people devote their entire careers to type. Thankfully, their work is well documented, so we have tons of online resources for typography."}, {"a4c3": "This article is designed to serve as a starting point for helping you learn how to choose type for your designs. It will encourage you to explore fonts and font combinations beyond those you’re familiar with."}, {"e133": "Identify your purpose"}, {"4748": "Before you do anything else, first identify the purpose of your design. What information do you want to convey? What is the medium for your design?"}, {"6119": "Good design aligns its typography with its purpose. This is because typography is key to setting mood, tone, and style in your designs."}, {"5028": "For example, if you are designing a greeting card that’s illustration heavy, choose a font that fits the style of your illustration. Harmonize your type with the rest of your design."}, {"e220": "If you’re designing an image-driven landing page, choose a simple font that doesn’t detract from your images. Use type as a way to emphasize information to communicate meaning."}, {"431d": "If images are the focus of your design, choose simple fonts so that the images stand out"}, {"fd75": "Identify your audience"}, {"c5fd": "After determining the purpose of your design, identify your audience. This step is crucial because age and interest will influence your font options."}, {"07ba": "After clarifying the purpose of your design, identify your audience. This step is crucial because information about your users such as age, interests, and cultural upbringing could influence the decisions you make for your type."}, {"b39f": "For example, some fonts are more appropriate for children. When learning to read, children need highly legible fonts with generous letter shapes. A good example of this is Sassoon Primary. Sassoon Primary was developed by Rosemary Sassoon and based on her research into what kind of letters children found easy to read."}, {"2818": "Sassoon Primary was developed Rosemary Sassoon"}, {"5819": "Other fonts are more appropriate for seniors. Senior-friendly fonts use readable sizes, high contrasting colors, and avoid scripts and decorative styles."}, {"74f5": "When choosing type, take into account your audience and their needs. Simply put, empathize with your users."}, {"6736": "Look for inspiration"}, {"5744": "Look at the work of other designers. Try understand how they made their decisions for type."}, {"a014": "Font Inspiration"}, {"3216": "For font inspiration, The 100 Best Free Fonts by CreativeBloq is a great article to put you in the right mindset for choosing type. In the article, CreativeBloq explains the motivations behind each font."}, {"4d1d": "Another useful resource is 100 Greatest Free Fonts Collection for 2015 by Awwwards."}, {"aef3": "Invision also compiled a giant repo of typography resources. You’ll find lots of sources for inspiration there."}, {"e63f": "For inspiration from actual websites, check out Typ.io. The site curates font inspiration from around the web. In addition, the site provides CSS font definitions at the bottom of each inspiration sample."}, {"904b": "Asides from looking at dedicated font inspiration websites, visit your favorite sites and check out what fonts they use. A good tool for this is WhatTheFont. WhatTheFont is a Chrome extension that lets you inspect web fonts by hovering over them."}, {"fd79": "Pairing Inspiration"}, {"1789": "Beyond just fonts, also look at font pairing inspiration. Font pairing is just as important as the fonts themselves. Good font pairing helps establish visual hierarchy and improve the readability of your designs."}, {"402c": "For inspiration, start with Typewolf. Typewolf curates font pairing inspiration from different sites. Beyond that, they also have font recommendations and in-depth typography guides. It’s a treasure trove for typographers."}, {"ce26": "FontPair also curates font pairing inspiration, specifically for Google Fonts. You can sort by type style combinations such as sans-serif and serif, or serif and serif."}, {"c103": "Lastly, there are tons of font pairing collections created by designers online. For example Typography: Google Fonts Combinations and Typography: Google Fonts Combinations Volume 2. Just search “font pairing” on sites like Behance and Dribbble."}, {"c642": "Choose your fonts"}, {"e7b1": "Armed with research and inspiration, you are ready to choose your type. When it comes to choosing type, keep the following principles in mind: readability, legibility, and purpose."}, {"407f": "Choose fonts that are conventional and easy to read. Avoid highly decorative fonts in favor of simple and practical fonts. Also, be mindful of the purpose of a font. For example, some fonts are more suited to be headers rather than body text."}, {"b01a": "For this reason, before choosing a font, research its intended purpose."}, {"3ec3": "In terms of font pairing, keep it simple with a maximum of three different fonts. In addition, pair fonts that contrast one another. Doing so will help guide the eyes of readers, first to headers and then to body texts. You can also create visual contrast using different font sizes, colors, and weights."}, {"3047": "For web fonts, you can use Google Fonts, Typekit, and Font Squirrel. Google Fonts is free, Typekit and Font Squirrel have free and paid fonts."}, {"9b77": "Determine font sizes"}, {"5304": "The next step after settling on a font combination is determining sizing. A great tool for this is Modular Scale by Tim Brown, the head of typography at Adobe. Modular Scale is a system for identifying historically pleasing ratios to create scales to determine type sizes."}, {"361b": "For example, you might use a scale based on the golden ratio. Here would be your first five computed font size options:"}, {"330d": "Golden Ratio (1:1.618)"}, {"de5d": "1.000 x 1.618     = 1.6181.618 x 1.618     = 2.6182.618 x 1.618     = 4.2364.236 x 1.618     = 6.8546.854 x 1.618     = 11.089"}, {"e647": "One issue that you might encounter is that your ratio is too large. Take a look at what happens to the later intervals of our scale based on the golden ratio."}, {"9b8b": "Golden Ratio (1:1.618)"}, {"64ec": "...11.089 x 1.618    = 17.94217.942 x 1.618    = 29.0329.030 x 1.618    = 46.97146.971 x 1.618    = 75.99975.999 x 1.618    = 122.966"}, {"c11f": "As you can see, the intervals between numbers start to become too large. For most interfaces, you need smaller intervals. Thankfully, Modular Scale has a variety of ratios based on geometry, nature, and music."}, {"610e": "Minor Second    15:16 Major Second    8:9Minor Third     5:6Major Third     4:5..."}, {"21bd": "So instead of using the golden ratio, you can use a ratios that yield smaller intervals like the Perfect Fourth."}, {"762b": "Perfect Fourth (3:4)"}, {"76cc": "...9.969  x 1.333     = 13.28813.288 x 1.333     = 17.71317.713 x 1.333     = 23.61223.612 x 1.333     = 31.47531.475 x 1.333     = 41.95641.956 x 1.333     = 55.927"}, {"b9a5": "Once you have settled on a scale, you can cherry pick font sizes from your list and round them to the nearest decimal."}, {"d7d6": "Font Sizes"}, {"23a5": "Header 1: 55pxHeader 2: 42pxHeader 3: 31pxHeader 4: 24pxHeader 5: 14px"}, {"30a7": "Body: 17pxCaption: 14px"}, {"9747": "The Modular Scale method uses mathematical precision in order to generate font sizes. However, it’s only a guide. Use this method as a starting point and then adjust sizes with your eye."}, {"2b08": "Create a typography styleguide"}, {"ff36": "The last step of the process is to create a styleguide for your typography to help standardize type across your designs."}, {"2051": "In programs like Sketch, you can create shared text styles to quickly insert text with styles already applied from your guideline."}, {"c7d0": "It’s during this step of the process that you can tweak and finalize your text attributes such as color, weight, and size."}, {"918a": "A word on color: when choosing color, take into account your color palette. Choose colors for your type that harmonize with your color palette."}, {"07a7": "In your styleguide, make sure to at least include the following things: font definitions, font sizes, font colors, and example usages."}, {"eb12": "Google’s Material Design typography guidelines is a good example of what to include in a styleguide. A couple of other examples includes the typography guides of Mailchimp, Apple, and Focus Labs."}, {"e5c3": "Typography is all about experimentation. It’s both a science and an art."}, {"4626": "I challenge you to break out of your comfort zone and explore type in your design."}, {"9584": "What are your favorite fonts? Leave me a note or send me a tweet on Twitter."}, {"cdba": "You can find me on Medium where I publish every week. Or you can follow me on Twitter, where I post non-sensical ramblings about design, front-end development, and virtual reality."}, {"8751": "P.S. If you enjoyed this article, it would mean a lot if you click the 💚 and share with friends."}], "content": "Typography can make or break your design: a process for choosing type One of the most important skills you can learn as a designer is how to choose type. This is because text is one of the primary ways designers can communicate with users. Typography can make or break a design. There’s a beauty and complexity to typography. Some people devote their entire careers to type. Thankfully, their work is well documented, so we have tons of online resources for typography. This article is designed to serve as a starting point for helping you learn how to choose type for your designs. It will encourage you to explore fonts and font combinations beyond those you’re familiar with. Identify your purpose Before you do anything else, first identify the purpose of your design. What information do you want to convey? What is the medium for your design? Good design aligns its typography with its purpose. This is because typography is key to setting mood, tone, and style in your designs. For example, if you are designing a greeting card that’s illustration heavy, choose a font that fits the style of your illustration. Harmonize your type with the rest of your design. If you’re designing an image-driven landing page, choose a simple font that doesn’t detract from your images. Use type as a way to emphasize information to communicate meaning. If images are the focus of your design, choose simple fonts so that the images stand out Identify your audience After determining the purpose of your design, identify your audience. This step is crucial because age and interest will influence your font options. After clarifying the purpose of your design, identify your audience. This step is crucial because information about your users such as age, interests, and cultural upbringing could influence the decisions you make for your type. For example, some fonts are more appropriate for children. When learning to read, children need highly legible fonts with generous letter shapes. A good example of this is Sassoon Primary. Sassoon Primary was developed by Rosemary Sassoon and based on her research into what kind of letters children found easy to read. Sassoon Primary was developed Rosemary Sassoon Other fonts are more appropriate for seniors. Senior-friendly fonts use readable sizes, high contrasting colors, and avoid scripts and decorative styles. When choosing type, take into account your audience and their needs. Simply put, empathize with your users. Look for inspiration Look at the work of other designers. Try understand how they made their decisions for type. Font Inspiration For font inspiration, The 100 Best Free Fonts by CreativeBloq is a great article to put you in the right mindset for choosing type. In the article, CreativeBloq explains the motivations behind each font. Another useful resource is 100 Greatest Free Fonts Collection for 2015 by Awwwards. Invision also compiled a giant repo of typography resources. You’ll find lots of sources for inspiration there. For inspiration from actual websites, check out Typ.io. The site curates font inspiration from around the web. In addition, the site provides CSS font definitions at the bottom of each inspiration sample. Asides from looking at dedicated font inspiration websites, visit your favorite sites and check out what fonts they use. A good tool for this is WhatTheFont. WhatTheFont is a Chrome extension that lets you inspect web fonts by hovering over them. Pairing Inspiration Beyond just fonts, also look at font pairing inspiration. Font pairing is just as important as the fonts themselves. Good font pairing helps establish visual hierarchy and improve the readability of your designs. For inspiration, start with Typewolf. Typewolf curates font pairing inspiration from different sites. Beyond that, they also have font recommendations and in-depth typography guides. It’s a treasure trove for typographers. FontPair also curates font pairing inspiration, specifically for Google Fonts. You can sort by type style combinations such as sans-serif and serif, or serif and serif. Lastly, there are tons of font pairing collections created by designers online. For example Typography: Google Fonts Combinations and Typography: Google Fonts Combinations Volume 2. Just search “font pairing” on sites like Behance and Dribbble. Choose your fonts Armed with research and inspiration, you are ready to choose your type. When it comes to choosing type, keep the following principles in mind: readability, legibility, and purpose. Choose fonts that are conventional and easy to read. Avoid highly decorative fonts in favor of simple and practical fonts. Also, be mindful of the purpose of a font. For example, some fonts are more suited to be headers rather than body text. For this reason, before choosing a font, research its intended purpose. In terms of font pairing, keep it simple with a maximum of three different fonts. In addition, pair fonts that contrast one another. Doing so will help guide the eyes of readers, first to headers and then to body texts. You can also create visual contrast using different font sizes, colors, and weights. For web fonts, you can use Google Fonts, Typekit, and Font Squirrel. Google Fonts is free, Typekit and Font Squirrel have free and paid fonts. Determine font sizes The next step after settling on a font combination is determining sizing. A great tool for this is Modular Scale by Tim Brown, the head of typography at Adobe. Modular Scale is a system for identifying historically pleasing ratios to create scales to determine type sizes. For example, you might use a scale based on the golden ratio. Here would be your first five computed font size options: Golden Ratio (1:1.618) 1.000 x 1.618     = 1.6181.618 x 1.618     = 2.6182.618 x 1.618     = 4.2364.236 x 1.618     = 6.8546.854 x 1.618     = 11.089 One issue that you might encounter is that your ratio is too large. Take a look at what happens to the later intervals of our scale based on the golden ratio. Golden Ratio (1:1.618) ...11.089 x 1.618    = 17.94217.942 x 1.618    = 29.0329.030 x 1.618    = 46.97146.971 x 1.618    = 75.99975.999 x 1.618    = 122.966 As you can see, the intervals between numbers start to become too large. For most interfaces, you need smaller intervals. Thankfully, Modular Scale has a variety of ratios based on geometry, nature, and music. Minor Second    15:16 Major Second    8:9Minor Third     5:6Major Third     4:5... So instead of using the golden ratio, you can use a ratios that yield smaller intervals like the Perfect Fourth. Perfect Fourth (3:4) ...9.969  x 1.333     = 13.28813.288 x 1.333     = 17.71317.713 x 1.333     = 23.61223.612 x 1.333     = 31.47531.475 x 1.333     = 41.95641.956 x 1.333     = 55.927 Once you have settled on a scale, you can cherry pick font sizes from your list and round them to the nearest decimal. Font Sizes Header 1: 55pxHeader 2: 42pxHeader 3: 31pxHeader 4: 24pxHeader 5: 14px Body: 17pxCaption: 14px The Modular Scale method uses mathematical precision in order to generate font sizes. However, it’s only a guide. Use this method as a starting point and then adjust sizes with your eye. Create a typography styleguide The last step of the process is to create a styleguide for your typography to help standardize type across your designs. In programs like Sketch, you can create shared text styles to quickly insert text with styles already applied from your guideline. It’s during this step of the process that you can tweak and finalize your text attributes such as color, weight, and size. A word on color: when choosing color, take into account your color palette. Choose colors for your type that harmonize with your color palette. In your styleguide, make sure to at least include the following things: font definitions, font sizes, font colors, and example usages. Google’s Material Design typography guidelines is a good example of what to include in a styleguide. A couple of other examples includes the typography guides of Mailchimp, Apple, and Focus Labs. Typography is all about experimentation. It’s both a science and an art. I challenge you to break out of your comfort zone and explore type in your design. What are your favorite fonts? Leave me a note or send me a tweet on Twitter. You can find me on Medium where I publish every week. Or you can follow me on Twitter, where I post non-sensical ramblings about design, front-end development, and virtual reality. P.S. If you enjoyed this article, it would mean a lot if you click the 💚 and share with friends. ", "child": "542_1\t542_2\t542_3\t542_4\t542_5\t542_6\t542_7\t542_8\t542_9\t542_10\t542_11\t542_12\t542_13\t542_14\t542_15\t542_16\t542_17\t542_18\t542_19\t542_20\t542_21\t542_22\t542_23\t542_24542_1\t542_2\t542_3\t542_4\t542_5\t542_6\t542_7\t542_8\t542_9\t542_10\t542_11\t542_12\t542_13\t542_14\t542_15\t542_16\t542_17\t542_18\t542_19\t542_20\t542_21\t542_22\t542_23\t542_24542_1\t542_2\t542_3\t542_4\t542_5\t542_6\t542_7\t542_8\t542_9\t542_10\t542_11\t542_12\t542_13\t542_14\t542_15\t542_16\t542_17\t542_18\t542_19\t542_20\t542_21\t542_22\t542_23\t542_24"}