{"name": "548", "parent": "", "title": "Love will find you", "sentences": [{"685c": "Love will find you"}, {"47e2": "Love will find you in the corridorfor sheer convenienceeven come knocking on your door(somewhere around half past four)love will not ask for anythinglove will just give you her corelove may leave trinkets in your drawerand clothes strewn all over the flooryou will look for love between the sheetsexhausted, you will fall into a soft snorelater, even when under the showerlove will be missing in the downpouryou will try to distract yourselfwith other choreswalk down to the nearby storeask for a sandwich and coffee you’ll sit to savour it indoorswhen somewhere a table in the cornerwhich catch your attentionremind you of a time beforerestless you’ll step awaylooking for escape in the outdoorsbut every step you takewill be one love has walked with you beforeeverywhere you goanything you dowill remind you of a love unspoken foruntil a realization will come to the foreof a love that never kept scoreof why and what fora love that was unaccounted fora love that has you yearning for more."}, {"5df0": "For more find me @Tasneem Kagalwalla on FB, Twitter and Instagram."}], "content": "Love will find you Love will find you in the corridorfor sheer convenienceeven come knocking on your door(somewhere around half past four)love will not ask for anythinglove will just give you her corelove may leave trinkets in your drawerand clothes strewn all over the flooryou will look for love between the sheetsexhausted, you will fall into a soft snorelater, even when under the showerlove will be missing in the downpouryou will try to distract yourselfwith other choreswalk down to the nearby storeask for a sandwich and coffee you’ll sit to savour it indoorswhen somewhere a table in the cornerwhich catch your attentionremind you of a time beforerestless you’ll step awaylooking for escape in the outdoorsbut every step you takewill be one love has walked with you beforeeverywhere you goanything you dowill remind you of a love unspoken foruntil a realization will come to the foreof a love that never kept scoreof why and what fora love that was unaccounted fora love that has you yearning for more. For more find me @Tasneem Kagalwalla on FB, Twitter and Instagram. ", "child": "548_1\t548_2\t548_3548_1\t548_2\t548_3"}