{"name": "552", "parent": "", "title": "I (once) Waited until Marriage to Have Sex — and That Was a Mistake", "sentences": [{"d747": "I (once) Waited until Marriage to Have Sex — and That Was a Mistake"}, {"90ab": "July 2000, Pasadena, California"}, {"ef73": "“I think we should wait.”   I announce this, breathless, as I walk in the door of my fiancée’s Craftsman bungalow. Elizabeth is baking zucchini bread, oven mitts on her hands. She cocks her head to one side, not sure what I mean.  “I mean we should stop having sex until after we’re married. I’ve rethought everything…. I’m ready to wait to do it right.”"}, {"4f33": "Elizabeth and I met on Matchmaker.com in February, 2000. We felt an immediate connection, perhaps because our family backgrounds were so similar. We were both academics."}, {"b762": "Before our first date I had trepidations. Elizabeth’s profile emphasized that she was a Christian. She attended an evangelical church. Over lunch at our first meeting, I asked delicately about her politics. She was reassuringly progressive, pro-choice, and pro-gay rights. I grinned at her. “That’s a relief.”   “I’m glad to put you at ease,” Elizabeth said, and softly kicked my shin under the table.   On our second date, we made out gently in the hammock in her backyard. Elizabeth whispered in my ear. “Is it okay if we wait to sleep together?”  I hesitated. Yes, I told her, I’m willing to wait a little while."}, {"c390": "But no, I told her before she asked, I’m not willing to wait until marriage. “I can’t be in a committed relationship if I’m not sleeping with you,” I said."}, {"3181": "Elizabeth was quiet for a few minutes. “Okay,” she said, nestling into me. “We can make that work.”"}, {"4d13": "Two nights later, we have sex for the first time.  Elizabeth was not a virgin. She had converted to Christianity her senior year of college. She’d had plenty of sexual experience before she joined the church, but had not had intercourse since. She’d been essentially celibate for seven years."}, {"2a8e": "The sex is awkward and mediocre from the start. What flows easily with others feels blocked and fumbling with Elizabeth. I attribute her reticence to to her long dry spell, and comfort myself that she and I have so many other points of tender compatibility. I’ve had a lot of great sex in my life, I tell myself, and it was mostly in toxic, destructive relationships. Time for something new. I also comfort myself with my mother’s romantic advice, which often boils down to quoting a translation from Medea: “Ask the gods for love like a little fire, just enough to warm the house. Don’t ask for love like a great fire, for that will burn the house down.” Divorced twice before I was 30, I’d seen plenty of houses burned down. Maybe mom was right. Elizabeth and I could have a lovely little house together, warmed not by the flames of sexual passion, but the electric blanket of deep tenderness, shared goals, and long walks through Altadena with her pit bull."}, {"ad2f": "Elizabeth and I get engaged in June, with a wedding planned for the following May."}, {"c254": "That same month, a friend and running partner of mine — who also had known Elizabeth when they’d attended the same church — broached a radical idea. “I’m sure you two are having sex. But now that you’re getting engaged, what if you two stopped until after the wedding?’ I’d hinted to this buddy that while Elizabeth and I sparkled everywhere else, our connection fizzled in the bedroom. Maybe, he suggested, that fizzle was a direct result of not following God’s plan.  I wasn’t sure I believed in a God who was against premarital sex. But I realized I sure loved a woman who did. I thought about how heroic I’d appear if I offered to give up sex for nearly a year. I thought about the chance that my friend might be right. Maybe on our wedding night, Jesus Christ himself would bestow the blessing of chemistry he’d so far withheld."}, {"4a26": "So I come home one day and make my declaration of no more sex until the wedding. Elizabeth leaps into my arms, oven mitts still on her hands. “Thank you,” she whispers in my ear. And then: “I’m so proud you’re gonna be my husband.”   Speaking of fires, the beam on my face could have burned down a city block."}, {"c41c": "For nearly 11 months, Elizabeth and I have no direct sexual contact. We agree on light kissing, lots of hugging. At first we are careful not to be naked in front of each other, but soon we are undressing in the other’s presence without a second thought.   After a few weeks, Elizabeth matter-of-factly suggests we start masturbating together. “I’d rather we do it together instead of by ourselves.” But even this is more practical than erotic. Whatever her hesitation about having sex with me, she concedes she herself has a strong libido. And Elizabeth knows I like porn, which she hates. Getting off together keeps me off the computer, and seems to alleviate her own ambivalence about the moral acceptability of masturbating.  Two or three nights a week, we brush teeth, climb into our PJs, and lie on our backs, side by side, staring at the ceiling. Our shoulders touch, and sometimes our hips. We don’t kiss or caress or watch each other. Elizabeth almost always comes first, with a single muffled cry and a small body spasm."}, {"10eb": "After she orgasms, Elizabeth lies still, waiting patiently for me to finish. When I finally come — invariably thinking of someone else from my past — she’ll often take an ankle and cross it over one of mine."}, {"8b4c": "“That sounded good,” I’ll say; “It was,” she’ll answer.   “I love you,” we each affirm aloud, and we fall asleep.   I am not worried. Everything will be different after we’re married.  We are married in May 2001. Our wedding night is at the Palace Hotel in San Francisco, the same hotel where my great-grandparents began their honeymoon.   I hope Stanley and Marian had a better time of it in 1905 than Elizabeth and I do."}, {"16be": "The first sex we’ve had in nearly a year is awkward as ever. Neither of us can get close to orgasm from intercourse, so we each finish ourselves with our fingers, just as we did before.   “We’re just tired,” we tell each other. “It was such an amazing day!”"}, {"8a5d": "We honeymoon in Scotland. The sights are glorious, the laughter is constant , and the sex continues to be tepid. We are bailed out by food poisoning, which we take turns contracting. Diarrhea and puking are welcome excuses to avoid lovemaking."}, {"a43e": "By the time we get home, I know. What I had attributed to Elizabeth’s guilt over premarital sex turned out to be old-fashioned sexual incompatibility. And even fidelity to Christ can’t create chemistry.  I love Elizabeth so much. She is so smart, so funny, and we are so… so sensible together. We like the same movies, the same books, share the same politics, we are adored by the other’s family. And yet.   I stay faithful, resigning myself to dull sex for the rest of my life. Before I met Elizabeth, I tell myself, I’d had so much more sex than most people. After more than my share, it is time for that sweet small fire my mother and Euripides recommended."}, {"160b": "To her everlasting credit, Elizabeth has different ideas. She hasn’t had a lot of sex in her life, and even less great sex, but as she enters her 30s, is pretty damn clear that tremendous chemistry is out there waiting for her. Waiting with someone else.  Fourteen months into our marriage, Elizabeth asks for a divorce. I try to argue. “I’m doing this for you too,” she say. “I deserve a man whose clothes I want to rip off. And you deserve a woman who gets wet when she looks at you.”  There is no arguing with that.  One night, shortly before I move out for good, I ask Elizabeth if she is sorry we’d stopped having sex before we were married. She thinks for a moment.   “Yes,” she says, “I really wish you hadn’t told me we could wait.”   I nod. I don’t need to ask why. Elizabeth smiles. “But it was so sweet of you to try,” she adds.  I will never underestimate the centrality of chemistry again."}], "content": "I (once) Waited until Marriage to Have Sex — and That Was a Mistake July 2000, Pasadena, California “I think we should wait.”   I announce this, breathless, as I walk in the door of my fiancée’s Craftsman bungalow. Elizabeth is baking zucchini bread, oven mitts on her hands. She cocks her head to one side, not sure what I mean.  “I mean we should stop having sex until after we’re married. I’ve rethought everything…. I’m ready to wait to do it right.” Elizabeth and I met on Matchmaker.com in February, 2000. We felt an immediate connection, perhaps because our family backgrounds were so similar. We were both academics. Before our first date I had trepidations. Elizabeth’s profile emphasized that she was a Christian. She attended an evangelical church. Over lunch at our first meeting, I asked delicately about her politics. She was reassuringly progressive, pro-choice, and pro-gay rights. I grinned at her. “That’s a relief.”   “I’m glad to put you at ease,” Elizabeth said, and softly kicked my shin under the table.   On our second date, we made out gently in the hammock in her backyard. Elizabeth whispered in my ear. “Is it okay if we wait to sleep together?”  I hesitated. Yes, I told her, I’m willing to wait a little while. But no, I told her before she asked, I’m not willing to wait until marriage. “I can’t be in a committed relationship if I’m not sleeping with you,” I said. Elizabeth was quiet for a few minutes. “Okay,” she said, nestling into me. “We can make that work.” Two nights later, we have sex for the first time.  Elizabeth was not a virgin. She had converted to Christianity her senior year of college. She’d had plenty of sexual experience before she joined the church, but had not had intercourse since. She’d been essentially celibate for seven years. The sex is awkward and mediocre from the start. What flows easily with others feels blocked and fumbling with Elizabeth. I attribute her reticence to to her long dry spell, and comfort myself that she and I have so many other points of tender compatibility. I’ve had a lot of great sex in my life, I tell myself, and it was mostly in toxic, destructive relationships. Time for something new. I also comfort myself with my mother’s romantic advice, which often boils down to quoting a translation from Medea: “Ask the gods for love like a little fire, just enough to warm the house. Don’t ask for love like a great fire, for that will burn the house down.” Divorced twice before I was 30, I’d seen plenty of houses burned down. Maybe mom was right. Elizabeth and I could have a lovely little house together, warmed not by the flames of sexual passion, but the electric blanket of deep tenderness, shared goals, and long walks through Altadena with her pit bull. Elizabeth and I get engaged in June, with a wedding planned for the following May. That same month, a friend and running partner of mine — who also had known Elizabeth when they’d attended the same church — broached a radical idea. “I’m sure you two are having sex. But now that you’re getting engaged, what if you two stopped until after the wedding?’ I’d hinted to this buddy that while Elizabeth and I sparkled everywhere else, our connection fizzled in the bedroom. Maybe, he suggested, that fizzle was a direct result of not following God’s plan.  I wasn’t sure I believed in a God who was against premarital sex. But I realized I sure loved a woman who did. I thought about how heroic I’d appear if I offered to give up sex for nearly a year. I thought about the chance that my friend might be right. Maybe on our wedding night, Jesus Christ himself would bestow the blessing of chemistry he’d so far withheld. So I come home one day and make my declaration of no more sex until the wedding. Elizabeth leaps into my arms, oven mitts still on her hands. “Thank you,” she whispers in my ear. And then: “I’m so proud you’re gonna be my husband.”   Speaking of fires, the beam on my face could have burned down a city block. For nearly 11 months, Elizabeth and I have no direct sexual contact. We agree on light kissing, lots of hugging. At first we are careful not to be naked in front of each other, but soon we are undressing in the other’s presence without a second thought.   After a few weeks, Elizabeth matter-of-factly suggests we start masturbating together. “I’d rather we do it together instead of by ourselves.” But even this is more practical than erotic. Whatever her hesitation about having sex with me, she concedes she herself has a strong libido. And Elizabeth knows I like porn, which she hates. Getting off together keeps me off the computer, and seems to alleviate her own ambivalence about the moral acceptability of masturbating.  Two or three nights a week, we brush teeth, climb into our PJs, and lie on our backs, side by side, staring at the ceiling. Our shoulders touch, and sometimes our hips. We don’t kiss or caress or watch each other. Elizabeth almost always comes first, with a single muffled cry and a small body spasm. After she orgasms, Elizabeth lies still, waiting patiently for me to finish. When I finally come — invariably thinking of someone else from my past — she’ll often take an ankle and cross it over one of mine. “That sounded good,” I’ll say; “It was,” she’ll answer.   “I love you,” we each affirm aloud, and we fall asleep.   I am not worried. Everything will be different after we’re married.  We are married in May 2001. Our wedding night is at the Palace Hotel in San Francisco, the same hotel where my great-grandparents began their honeymoon.   I hope Stanley and Marian had a better time of it in 1905 than Elizabeth and I do. The first sex we’ve had in nearly a year is awkward as ever. Neither of us can get close to orgasm from intercourse, so we each finish ourselves with our fingers, just as we did before.   “We’re just tired,” we tell each other. “It was such an amazing day!” We honeymoon in Scotland. The sights are glorious, the laughter is constant , and the sex continues to be tepid. We are bailed out by food poisoning, which we take turns contracting. Diarrhea and puking are welcome excuses to avoid lovemaking. By the time we get home, I know. What I had attributed to Elizabeth’s guilt over premarital sex turned out to be old-fashioned sexual incompatibility. And even fidelity to Christ can’t create chemistry.  I love Elizabeth so much. She is so smart, so funny, and we are so… so sensible together. We like the same movies, the same books, share the same politics, we are adored by the other’s family. And yet.   I stay faithful, resigning myself to dull sex for the rest of my life. Before I met Elizabeth, I tell myself, I’d had so much more sex than most people. After more than my share, it is time for that sweet small fire my mother and Euripides recommended. To her everlasting credit, Elizabeth has different ideas. She hasn’t had a lot of sex in her life, and even less great sex, but as she enters her 30s, is pretty damn clear that tremendous chemistry is out there waiting for her. Waiting with someone else.  Fourteen months into our marriage, Elizabeth asks for a divorce. I try to argue. “I’m doing this for you too,” she say. “I deserve a man whose clothes I want to rip off. And you deserve a woman who gets wet when she looks at you.”  There is no arguing with that.  One night, shortly before I move out for good, I ask Elizabeth if she is sorry we’d stopped having sex before we were married. She thinks for a moment.   “Yes,” she says, “I really wish you hadn’t told me we could wait.”   I nod. I don’t need to ask why. Elizabeth smiles. “But it was so sweet of you to try,” she adds.  I will never underestimate the centrality of chemistry again. ", "child": "552_1\t552_2"}