{"name": "559", "parent": "", "title": "Masked: meeting the Mistress… face covered, pussy exposed", "sentences": [{"038e": "Masked: meeting the Mistress… face covered, pussy exposed"}, {"c04d": "A masked ball, my first. No ordinary ball either, but a gathering of free spirits with carte blanche to give in to their wildest impulses."}, {"037a": "My mask conceals my expression, but lets me gaze at the revellers with frank desire. The costumes and music are intoxicating, a palpable buzz of excitement in the air as the night’s dramas of intrigue and seduction begin to unfold. I mingle, drinking in the scent of perfume, the giggles and murmurs of assignations being arranged, the clink of glasses."}, {"1832": "And then I see her; slender and statuesque in her heels, her fabulous figure more revealed than concealed by her flimsy, transparent dress. A mask covers part of her face, but I can see she is beautiful. I want her instantly."}, {"fd66": "Our eyes meet and she smiles. A barely perceptible tilt of her head in invitation, and I’m following her like a puppy, out of the crowded center of the ballroom and into a curtained alcove. She sits elegantly on a high-backed chair, and I take a seat opposite, too spellbound to speak."}, {"0f67": "“Do you like to watch?” she asks, her voice low and husky with a trace of an exotic accent."}, {"812f": "It takes me a second to comprehend what she means, and as realization floods through me I nod avidly. Slowly, teasingly, she inches her diaphanous dress up, sliding it over her silky thighs — pausing, until my heart is beating so hard I can feel its throbbing throughout my whole body — and then higher still, exposing herself to my gaze."}, {"482d": "She spreads her milky thighs apart, showing herself to me brazenly. Her pussy is bare and smooth, so pretty and pink it makes my mouth water. Her clitoris is big and puffy, peeping out from between her lips like a tempting morsel waiting to be tasted; and as she moves her legs wider I see her lips peel apart and spread like butterfly wings."}, {"7b17": "Nectar is already gathering in the shiny folds, and I shiver with lust as she dips her finger delicately into the wetness and raises it to her lips to taste. She dips her finger again, holding it out to me to lick; my tastebuds explode with her sweet flavor. Now we are connected, she and I, and it’s as if every time she touches herself I can feel her touch on my own flesh."}, {"94ab": "She moves her hand back down to her pussy, stroking her fingers across it gently at first, then with more purpose. Her thumb strums her clit as she thrusts a couple of fingers inside her creamed-up slot. I’m pulsing with desire, and my hand gravitates towards my crotch, but she shakes her head no. I understand; this is her show. Frustrated but flooded with adrenaline, I watch her fuck herself."}, {"4e72": "Her veneer of studied composure begins to slip as her fingers work their magic and her pleasure builds. Little moans escape her lips, and her chest is flushed as her frigging becomes more frantic. Finally she arches her back with a gasp of release, fingers plunged deep, her orgasm crashing through her brutally."}, {"66b2": "When she’s regained control enough to smooth down her dress, she smiles at my discomposure. She holds her fingers to my mouth to give me a little more of the taste I’m craving, then leans in and kisses me softly on the lips."}, {"f140": "“Enjoy your night,” she purrs, rising and sashaying away from me, back to the party."}, {"6e34": "I realize I didn’t even ask her name."}, {"5009": "This was the first time I met Angela, my girlfriend Isla’s strict and demanding Mistress. I’ve written about their relationship, in On display: orgasm denial for Angela’s slave and more recently in Dessert: Angela’s slave Isla is served up at the dinner party. Meeting Angela for the first time at the masked ball, I had no idea she would become a permanent fixture in my circle of friends; I just knew she fascinated me."}, {"a354": "Angela is the only person on the planet who genuinely intimidates me. Her eyes are so cold, which makes her the perfect Mistress. I never know what she’s thinking, or what she wants from me. I have played some very kinky power games with her from time to time — maybe I’ll even write about them some day — but she can tell I’m only doing it for cheap thrills. I’m not really committed to the sub/dom lifestyle, and we’ve already established that I have a big problem with respecting rules!"}, {"0018": "Isla makes a much better slave than me, she’s a very obedient girl. I like watching Angela torment her."}, {"7cbe": "If you enjoyed this story please click on the heart to recommend it to other readers. The more you like them, the more of my dirty little secrets I’ll share. Thank you!"}], "content": "Masked: meeting the Mistress… face covered, pussy exposed A masked ball, my first. No ordinary ball either, but a gathering of free spirits with carte blanche to give in to their wildest impulses. My mask conceals my expression, but lets me gaze at the revellers with frank desire. The costumes and music are intoxicating, a palpable buzz of excitement in the air as the night’s dramas of intrigue and seduction begin to unfold. I mingle, drinking in the scent of perfume, the giggles and murmurs of assignations being arranged, the clink of glasses. And then I see her; slender and statuesque in her heels, her fabulous figure more revealed than concealed by her flimsy, transparent dress. A mask covers part of her face, but I can see she is beautiful. I want her instantly. Our eyes meet and she smiles. A barely perceptible tilt of her head in invitation, and I’m following her like a puppy, out of the crowded center of the ballroom and into a curtained alcove. She sits elegantly on a high-backed chair, and I take a seat opposite, too spellbound to speak. “Do you like to watch?” she asks, her voice low and husky with a trace of an exotic accent. It takes me a second to comprehend what she means, and as realization floods through me I nod avidly. Slowly, teasingly, she inches her diaphanous dress up, sliding it over her silky thighs — pausing, until my heart is beating so hard I can feel its throbbing throughout my whole body — and then higher still, exposing herself to my gaze. She spreads her milky thighs apart, showing herself to me brazenly. Her pussy is bare and smooth, so pretty and pink it makes my mouth water. Her clitoris is big and puffy, peeping out from between her lips like a tempting morsel waiting to be tasted; and as she moves her legs wider I see her lips peel apart and spread like butterfly wings. Nectar is already gathering in the shiny folds, and I shiver with lust as she dips her finger delicately into the wetness and raises it to her lips to taste. She dips her finger again, holding it out to me to lick; my tastebuds explode with her sweet flavor. Now we are connected, she and I, and it’s as if every time she touches herself I can feel her touch on my own flesh. She moves her hand back down to her pussy, stroking her fingers across it gently at first, then with more purpose. Her thumb strums her clit as she thrusts a couple of fingers inside her creamed-up slot. I’m pulsing with desire, and my hand gravitates towards my crotch, but she shakes her head no. I understand; this is her show. Frustrated but flooded with adrenaline, I watch her fuck herself. Her veneer of studied composure begins to slip as her fingers work their magic and her pleasure builds. Little moans escape her lips, and her chest is flushed as her frigging becomes more frantic. Finally she arches her back with a gasp of release, fingers plunged deep, her orgasm crashing through her brutally. When she’s regained control enough to smooth down her dress, she smiles at my discomposure. She holds her fingers to my mouth to give me a little more of the taste I’m craving, then leans in and kisses me softly on the lips. “Enjoy your night,” she purrs, rising and sashaying away from me, back to the party. I realize I didn’t even ask her name. This was the first time I met Angela, my girlfriend Isla’s strict and demanding Mistress. I’ve written about their relationship, in On display: orgasm denial for Angela’s slave and more recently in Dessert: Angela’s slave Isla is served up at the dinner party. Meeting Angela for the first time at the masked ball, I had no idea she would become a permanent fixture in my circle of friends; I just knew she fascinated me. Angela is the only person on the planet who genuinely intimidates me. Her eyes are so cold, which makes her the perfect Mistress. I never know what she’s thinking, or what she wants from me. I have played some very kinky power games with her from time to time — maybe I’ll even write about them some day — but she can tell I’m only doing it for cheap thrills. I’m not really committed to the sub/dom lifestyle, and we’ve already established that I have a big problem with respecting rules! Isla makes a much better slave than me, she’s a very obedient girl. I like watching Angela torment her. If you enjoyed this story please click on the heart to recommend it to other readers. The more you like them, the more of my dirty little secrets I’ll share. Thank you! ", "child": "559_1559_1"}