{"name": "567", "parent": "", "title": "When the Lighthouse Burns Out: A Story of Suicide and Loss", "sentences": [{"2a25": "When the Lighthouse Burns Out: A Story of Suicide and Loss"}, {"5f62": "It was the steeple. A stupid, little cross built out of plywood stacked on top of a dusty roof. I needed to destroy it."}, {"921a": "I stood swaying back and forth while the arid night air whipped circles of dust around my feet. A single bead of sweat ran down my face, mixing with the clear liquid I pressed to my mouth. Silently, I continued to stare at the tiny plywood building surrounded by sandbags with the cross on top."}, {"9ea7": "“Fhauck you!”"}, {"ac19": "Another drink."}, {"21aa": "“FHAAUCCKKK THIS PLACE!!! HAHA!”"}, {"9854": "Finishing the bottle, I arch back to wind up for the pitch but end up stumbling."}, {"c231": "“Steady boy…..sthhheady.” I say chuckling."}, {"0960": "I wind up one more time and chunk the empty liquor bottle at the chapel."}, {"1520": "“Sledge! Come on man! What the shit!?”“IT’S ALL BULLSHIT AND FORTUNE COOKIES!” I yell, smiling as my boozy eyes meet the others."}, {"2bf2": "“If they find that we’re in trouble…”"}, {"2ad1": "I stumble a few more steps to urinate on the side of our shanty building, and finally, let out a large sigh."}, {"bb03": "“I’ll get it in the morning….”"}, {"5da0": "The next morning I keep my word and search for the empty bottle, finding it smashed in the tan dust surround by a few small pebbles at the back side of the chapel. I retrieve the logo and cap to discard of, making it look like just another broken bottle in the middle of a war zone."}, {"e76b": "Walking around the side of the building, curiosity gets the better of me, and I step into the chapel. Inside are tiny plywood pews with a cross at the front and an Iraqi rug stretching to the podium. Everything is covered in a thick layer of dust. I take a few more steps inside when a door to my left opens and an older man emerges in a Marine Corp uniform. We stare at one another for a few moments and say nothing."}, {"131b": "This will be the day I meet Father Dennis Rocheford."}, {"21b9": "It was the pause. Long contemplative pauses always let you know something is wrong."}, {"7703": "“Don’t Catholics believe suic…”"}, {"a3e0": "I’m cut off."}, {"b926": "“Let’s not worry about the eternal state of a soul…instead, let’s remember them as they were.”"}, {"2852": "Dennis Rocheford never made me call him “father,” instead he was just Dennis and sometimes “father” if I felt like it. I think part of it was that we both saw each other as wounded equals. Not just in the literal sense, but emotionally too. While we both had earned Purple Hearts in combat (Dennis had two), there was always an underlying melancholy we both sensed in the other."}, {"2cde": "“How did you become a priest?”"}, {"2ec8": "Dennis smiled warmly; his demeanor almost reminiscent of someone remembering they had been baking cookies. “It was after I survived the Tet Offensive in Vietnam. We went in with 150 in my company. Only six of us survived, and I was one of those six. When the fighting was at it’s fiercest, and I didn’t think I was going to make it, I asked God to spare me, and he did. Afterward, I wanted to dedicate my life to his service in thanks. That’s how I ended up a priest.”"}, {"6d5a": "I fidget and then ask, “Is it hard? Being a priest and all?”A simple shrug with a small frown. “It has it’s ups and downs. The hardest part has been the funerals recently.”"}, {"4c91": "I don’t press. Funerals are a sore spot for me. I quickly remember presenting medals to my best friend’s parents after he was killed in action and shake the memory."}, {"f57e": "“So you believe in all this?” I say looking around the chapel.“I do. And you?”“I grew up a Christian. Protestant.”“And now?”I pause. “I mean… I guess….sometimes I’m not sure.”"}, {"234e": "Over the months, Dennis and I will chat in his tiny chapel, and I will ask numerous questions, and he’ll do his best to answer. He’ll give me a book he loves from a Protestant minister and with a sly smile tell me to keep quiet that he’s reading Protestant literature. Eventually, he’ll introduce me to one of my favorite authors who happens to be a Jesuit Priest named Brennan Manning. Brennan is an alcoholic. So is Dennis. A fact he doesn’t shy away from."}, {"6dce": "Dennis’s tour will end a few months before mine is over. We will snap a photo (the one that’s featured), and he will give me a Bible, encouraging me to keep seeking answers to my questions."}, {"b9cb": "Sometimes we’re left to uncover the wreckageAt the mercy of another’s decision"}, {"f522": "“Don’t Catholics believe suicide….”"}, {"f3e4": "I’m cut off. But you already knew that."}, {"d587": "In December of 2010, I leave the military. After years of skepticism and searching, I’ve become a Christian and even begun volunteering with my church. The seeds Dennis planted have inspired me to want to love and serve others as he had. One evening as I’m organizing my old military gear, I find the Bible Father Rocheford had given me. Inside is a slip of paper with the contact information for his parish. I grin, knowing I have to contact him."}, {"4802": "But I’m a year too late."}, {"86c8": "On the morning of September 10th, 2009 Dennis donned a bright-yellow U.S. Navy T-shirt, combat boots, and jeans. He drove from his home in Narragansett, Rhode Island to the Newport Bridge, where he parked his car in the center lane. Then he walked to the rail, stood for a moment, and jumped over the side. He was pronounced dead at the scene, joining the other 22 veterans that kill themselves daily."}, {"e6aa": "My wife will be the one who finds me crying in my office."}, {"a803": "You left a hole in the hearts of those who treasured you the most. You may have left your mark, but you left us all in the dark."}, {"bf72": "It’s a lonely road taking on the burdens and hurts of others. I think Dennis knew that. Enough so that it drove him to alcoholism. The wars and loss of his men only fueled his despair, and I have to wonder, in the many years he cared for others, how many people took a moment to ask him, “Dennis….how are YOU doing?”"}, {"aa4c": "I didn’t."}, {"d2f1": "In the years since his death, I think about him often. His final words still holding a timeless echo in my mind:"}, {"74ae": "“Keep searching. You’ll grow stronger.”"}, {"e32d": "Even seven years after his death, I wish I could tell him how instrumental he was. How thankful I am that he took the time to love me while I was in despair. That I’m happy and growing because of the influence he had in my life."}, {"1b75": "I just wish I could have done the same for him."}, {"6e3b": "Perhaps the hardest part about suicide is that it doesn’t end the pain but instead, passes to the ones who loved you. I kept silent for many years about Dennis because of the pain I still feel over his loss (and out of fear of a silly comment war between Catholics and my clan — Protestants — about the state of his soul). Some days I’m mad at him. Other days I feel like he just forgot his way. Just maybe if someone had stopped to love him the way he loved others he’d be with us today. Being a priest and a veteran must have been really hard. Everyone expected him to be strong and carry their burdens. But who helped carry his?"}, {"1e38": "I guess the greatest lesson I’ve learned from his death is the importance of being a beacon of hope for others. Here he was, a lighthouse in the midst of a storm for me and so many others. But he needed that from other people too."}, {"b62e": "I have to wonder if maybe you’re the lighthouse in the storm someone else needs?"}, {"6a12": "If so…don’t wait like I did. Instead, step into the tempest and shine brightly for them."}, {"5b80": "I hope you know that you’re missedEven though your shell is gone in our hearts you still existI just wish you knew how much you meant. To everyone around you. To those you never met"}, {"312c": "*All blockquote italics taken from Wage War’s song “Youngblood”"}, {"c338": "If you enjoyed reading this, pass along to a friend you know is struggling, recommend to others, join our support wall, or check out our Restore Program"}, {"a337": "Press Inquiries | Speaking Inquiries"}], "content": "When the Lighthouse Burns Out: A Story of Suicide and Loss It was the steeple. A stupid, little cross built out of plywood stacked on top of a dusty roof. I needed to destroy it. I stood swaying back and forth while the arid night air whipped circles of dust around my feet. A single bead of sweat ran down my face, mixing with the clear liquid I pressed to my mouth. Silently, I continued to stare at the tiny plywood building surrounded by sandbags with the cross on top. “Fhauck you!” Another drink. “FHAAUCCKKK THIS PLACE!!! HAHA!” Finishing the bottle, I arch back to wind up for the pitch but end up stumbling. “Steady boy…..sthhheady.” I say chuckling. I wind up one more time and chunk the empty liquor bottle at the chapel. “Sledge! Come on man! What the shit!?”“IT’S ALL BULLSHIT AND FORTUNE COOKIES!” I yell, smiling as my boozy eyes meet the others. “If they find that we’re in trouble…” I stumble a few more steps to urinate on the side of our shanty building, and finally, let out a large sigh. “I’ll get it in the morning….” The next morning I keep my word and search for the empty bottle, finding it smashed in the tan dust surround by a few small pebbles at the back side of the chapel. I retrieve the logo and cap to discard of, making it look like just another broken bottle in the middle of a war zone. Walking around the side of the building, curiosity gets the better of me, and I step into the chapel. Inside are tiny plywood pews with a cross at the front and an Iraqi rug stretching to the podium. Everything is covered in a thick layer of dust. I take a few more steps inside when a door to my left opens and an older man emerges in a Marine Corp uniform. We stare at one another for a few moments and say nothing. This will be the day I meet Father Dennis Rocheford. It was the pause. Long contemplative pauses always let you know something is wrong. “Don’t Catholics believe suic…” I’m cut off. “Let’s not worry about the eternal state of a soul…instead, let’s remember them as they were.” Dennis Rocheford never made me call him “father,” instead he was just Dennis and sometimes “father” if I felt like it. I think part of it was that we both saw each other as wounded equals. Not just in the literal sense, but emotionally too. While we both had earned Purple Hearts in combat (Dennis had two), there was always an underlying melancholy we both sensed in the other. “How did you become a priest?” Dennis smiled warmly; his demeanor almost reminiscent of someone remembering they had been baking cookies. “It was after I survived the Tet Offensive in Vietnam. We went in with 150 in my company. Only six of us survived, and I was one of those six. When the fighting was at it’s fiercest, and I didn’t think I was going to make it, I asked God to spare me, and he did. Afterward, I wanted to dedicate my life to his service in thanks. That’s how I ended up a priest.” I fidget and then ask, “Is it hard? Being a priest and all?”A simple shrug with a small frown. “It has it’s ups and downs. The hardest part has been the funerals recently.” I don’t press. Funerals are a sore spot for me. I quickly remember presenting medals to my best friend’s parents after he was killed in action and shake the memory. “So you believe in all this?” I say looking around the chapel.“I do. And you?”“I grew up a Christian. Protestant.”“And now?”I pause. “I mean… I guess….sometimes I’m not sure.” Over the months, Dennis and I will chat in his tiny chapel, and I will ask numerous questions, and he’ll do his best to answer. He’ll give me a book he loves from a Protestant minister and with a sly smile tell me to keep quiet that he’s reading Protestant literature. Eventually, he’ll introduce me to one of my favorite authors who happens to be a Jesuit Priest named Brennan Manning. Brennan is an alcoholic. So is Dennis. A fact he doesn’t shy away from. Dennis’s tour will end a few months before mine is over. We will snap a photo (the one that’s featured), and he will give me a Bible, encouraging me to keep seeking answers to my questions. Sometimes we’re left to uncover the wreckageAt the mercy of another’s decision “Don’t Catholics believe suicide….” I’m cut off. But you already knew that. In December of 2010, I leave the military. After years of skepticism and searching, I’ve become a Christian and even begun volunteering with my church. The seeds Dennis planted have inspired me to want to love and serve others as he had. One evening as I’m organizing my old military gear, I find the Bible Father Rocheford had given me. Inside is a slip of paper with the contact information for his parish. I grin, knowing I have to contact him. But I’m a year too late. On the morning of September 10th, 2009 Dennis donned a bright-yellow U.S. Navy T-shirt, combat boots, and jeans. He drove from his home in Narragansett, Rhode Island to the Newport Bridge, where he parked his car in the center lane. Then he walked to the rail, stood for a moment, and jumped over the side. He was pronounced dead at the scene, joining the other 22 veterans that kill themselves daily. My wife will be the one who finds me crying in my office. You left a hole in the hearts of those who treasured you the most. You may have left your mark, but you left us all in the dark. It’s a lonely road taking on the burdens and hurts of others. I think Dennis knew that. Enough so that it drove him to alcoholism. The wars and loss of his men only fueled his despair, and I have to wonder, in the many years he cared for others, how many people took a moment to ask him, “Dennis….how are YOU doing?” I didn’t. In the years since his death, I think about him often. His final words still holding a timeless echo in my mind: “Keep searching. You’ll grow stronger.” Even seven years after his death, I wish I could tell him how instrumental he was. How thankful I am that he took the time to love me while I was in despair. That I’m happy and growing because of the influence he had in my life. I just wish I could have done the same for him. Perhaps the hardest part about suicide is that it doesn’t end the pain but instead, passes to the ones who loved you. I kept silent for many years about Dennis because of the pain I still feel over his loss (and out of fear of a silly comment war between Catholics and my clan — Protestants — about the state of his soul). Some days I’m mad at him. Other days I feel like he just forgot his way. Just maybe if someone had stopped to love him the way he loved others he’d be with us today. Being a priest and a veteran must have been really hard. Everyone expected him to be strong and carry their burdens. But who helped carry his? I guess the greatest lesson I’ve learned from his death is the importance of being a beacon of hope for others. Here he was, a lighthouse in the midst of a storm for me and so many others. But he needed that from other people too. I have to wonder if maybe you’re the lighthouse in the storm someone else needs? If so…don’t wait like I did. Instead, step into the tempest and shine brightly for them. I hope you know that you’re missedEven though your shell is gone in our hearts you still existI just wish you knew how much you meant. To everyone around you. To those you never met *All blockquote italics taken from Wage War’s song “Youngblood” If you enjoyed reading this, pass along to a friend you know is struggling, recommend to others, join our support wall, or check out our Restore Program Press Inquiries | Speaking Inquiries ", "child": "567_1\t567_2\t567_3\t567_4\t567_5\t567_6567_1\t567_2\t567_3\t567_4\t567_5\t567_6567_1\t567_2\t567_3\t567_4\t567_5\t567_6567_1\t567_2\t567_3\t567_4\t567_5\t567_6567_1\t567_2\t567_3\t567_4\t567_5\t567_6"}