{"name": "568", "parent": "", "title": "“Don’t be you. Be who I want you to be.”", "sentences": [{"b5e1": "photo by Jason Blackeye"}, {"b1fa": "“Don’t be you. Be who I want you to be.”"}, {"db53": "Like always, after I click the “publish” button on something vulnerable, I held my breath. The RSS feed came along, scooped up my story, “Good Friday. Bad Decision,” and sent it out to my email list later that night."}, {"8911": "I quickly got several supportive replies that eased my angst over having put myself out there- again. I went to sleep feeling a little exposed but also courageous for having written honestly and from my own experience."}, {"a4ac": "I got up early the next morning in hopes to join the sun as it peaked over the tree line. It’s spring where I live, so the birds and frogs and turkeys and roosters all have something to say to one another."}, {"547e": "I grabbed my phone- mostly to check the time. But kinda like my lower leg kicks when tapped below my kneecap, I checked my gmail without planning to."}, {"ca30": "The intro line of his email said,"}, {"3951": "I have a little problem with something in your writings…"}, {"cb74": "I winced, wishing I hadn’t seen it. The fresh innocence of the morning disappeared. It was too late to backtrack. I could either worry about what it “might” say all morning or go ahead and eat the frog."}, {"a1ad": "I touched my finger to the screen and opened the full note. It read,"}, {"4212": "I have a little problem with something in some of your writings, but first I want to let you know that I really do enjoy reading your work. You write with a lot of wisdom and insight. I especially love how you share your heart with us all and encourage us with the way you grow through your life’s experiences, including as well the stories from other people you sometimes share."}, {"df18": "What I feel compelled, as your brother in Christ, to point out, is the occasional use of improper language. I know that’s how almost everyone speaks these days and it’s “relatable” and very expressive, but it can make some Christians feel quite uncomfortable — that’s not really the right word. Hurt or disappointed is probably a better way to put it. God tells us in Colossians 3:8 to stop using filthy language. And he says in Ephesians 4:29 to not use unwholesome words, but only say stuff that builds others up."}, {"b81a": "I really hope I don’t make you upset by this confrontation because that totally isn’t my intention. You refer to yourself as a “misfit”, but I don’t think you are at all, unless of course you’re referring to how all of us Christians are misfits to those who aren’t trying to know and love God."}, {"29d0": "Again, I love reading your articles and I hope you keep including me in your mailing list, but I also hope to not see the kind of words I was referring to in future articles."}, {"7db1": "Thanks for being a good friend to all of us who have gotten to know you through your writings."}, {"95f8": "Hot shame flooded my chest and made my neck all red and splotchy."}, {"ad46": "This was a reflex too. I’ve spent my life playing by the other people’s rules, feeling humiliated when I let them down. And somehow I’d constantly managed to let people down."}, {"f4c0": "Over time, I’ve learned the only way not to live in constant shame over being an ongoing disappointment to people is to live for God instead. To be in a real life relationship with my personal Higher Power and take my cues from a There."}, {"7725": "This email was a double whammy though. I’d clearly disappointed this guy and he was, in a way, saying I’d disappointed God, too. He said it kindly of course, as a good Christian Brother will do when he’s smiting you."}, {"e4bc": "Encouragement and kudos were mixed in with his judgment."}, {"ba00": "Which made his criticism a paradox and extra difficult for a recovering people pleaser like me to process."}, {"081b": "But there it was punching me in my vulnerable face, demanding I sort it out."}, {"e1f9": "I talked to both myself and to God out loud and on paper about it. It went like this-"}, {"8275": "Did I do something wrong? Am I hurting people? God, did I mishear you when I wrote that story? Is being me “bad?” Should I censor who I am?"}, {"a1af": "My stomach felt like I’d just been spun in nauseating circles on the Tilt-A-Whirl at the carnival. I tried to move forward with my morning quiet time, but embarrassment was banging around and making way too much noise inside me."}, {"48e4": "I was racked with uncertainty."}, {"9697": "I began reciting my morning texts in hopes they would bring comfort and clarity."}, {"e7c7": "I will not make for myself an idol of any kind…"}, {"0321": "And as soon as I said it out loud, another sentence followed,"}, {"51a1": "Including man’s opinion."}, {"3b01": "And I suddenly realized what was wrong."}, {"5805": "This gentleman thought it was his place to reach out and correct me without being invited to do so. Rather than simply unsubscribe from my list he reached out to tell me how he wants me to be. How he wants me to write. He wants me to keep kinda being me with my “wisdom and insight,” with my “life experience,” but be a little less, please."}, {"8eba": "He reached out to say, “Don’t be you, be who I want you to be.”"}, {"e40c": "He wants me filtered. Cleaned up. Buttoned down. Dialed back. But that’s not me. So which is it?"}, {"0222": "I’m over here in my lane, doing my thing and someone says, “No. You’re doing you wrong.”"}, {"a65b": "It’s his opinion. I didn’t ask for it. But he felt emboldened enough to offer it. Okay. Whatever."}, {"1c88": "But if I began to question who I am through his lens, or any other person’s lens, instead of God’s lens- I’ll lose myself again."}, {"ae1d": "And honestly, I’ve worked way too long and hard to find me."}, {"a49e": "Dammit."}], "content": "photo by Jason Blackeye “Don’t be you. Be who I want you to be.” Like always, after I click the “publish” button on something vulnerable, I held my breath. The RSS feed came along, scooped up my story, “Good Friday. Bad Decision,” and sent it out to my email list later that night. I quickly got several supportive replies that eased my angst over having put myself out there- again. I went to sleep feeling a little exposed but also courageous for having written honestly and from my own experience. I got up early the next morning in hopes to join the sun as it peaked over the tree line. It’s spring where I live, so the birds and frogs and turkeys and roosters all have something to say to one another. I grabbed my phone- mostly to check the time. But kinda like my lower leg kicks when tapped below my kneecap, I checked my gmail without planning to. The intro line of his email said, I have a little problem with something in your writings… I winced, wishing I hadn’t seen it. The fresh innocence of the morning disappeared. It was too late to backtrack. I could either worry about what it “might” say all morning or go ahead and eat the frog. I touched my finger to the screen and opened the full note. It read, I have a little problem with something in some of your writings, but first I want to let you know that I really do enjoy reading your work. You write with a lot of wisdom and insight. I especially love how you share your heart with us all and encourage us with the way you grow through your life’s experiences, including as well the stories from other people you sometimes share. What I feel compelled, as your brother in Christ, to point out, is the occasional use of improper language. I know that’s how almost everyone speaks these days and it’s “relatable” and very expressive, but it can make some Christians feel quite uncomfortable — that’s not really the right word. Hurt or disappointed is probably a better way to put it. God tells us in Colossians 3:8 to stop using filthy language. And he says in Ephesians 4:29 to not use unwholesome words, but only say stuff that builds others up. I really hope I don’t make you upset by this confrontation because that totally isn’t my intention. You refer to yourself as a “misfit”, but I don’t think you are at all, unless of course you’re referring to how all of us Christians are misfits to those who aren’t trying to know and love God. Again, I love reading your articles and I hope you keep including me in your mailing list, but I also hope to not see the kind of words I was referring to in future articles. Thanks for being a good friend to all of us who have gotten to know you through your writings. Hot shame flooded my chest and made my neck all red and splotchy. This was a reflex too. I’ve spent my life playing by the other people’s rules, feeling humiliated when I let them down. And somehow I’d constantly managed to let people down. Over time, I’ve learned the only way not to live in constant shame over being an ongoing disappointment to people is to live for God instead. To be in a real life relationship with my personal Higher Power and take my cues from a There. This email was a double whammy though. I’d clearly disappointed this guy and he was, in a way, saying I’d disappointed God, too. He said it kindly of course, as a good Christian Brother will do when he’s smiting you. Encouragement and kudos were mixed in with his judgment. Which made his criticism a paradox and extra difficult for a recovering people pleaser like me to process. But there it was punching me in my vulnerable face, demanding I sort it out. I talked to both myself and to God out loud and on paper about it. It went like this- Did I do something wrong? Am I hurting people? God, did I mishear you when I wrote that story? Is being me “bad?” Should I censor who I am? My stomach felt like I’d just been spun in nauseating circles on the Tilt-A-Whirl at the carnival. I tried to move forward with my morning quiet time, but embarrassment was banging around and making way too much noise inside me. I was racked with uncertainty. I began reciting my morning texts in hopes they would bring comfort and clarity. I will not make for myself an idol of any kind… And as soon as I said it out loud, another sentence followed, Including man’s opinion. And I suddenly realized what was wrong. This gentleman thought it was his place to reach out and correct me without being invited to do so. Rather than simply unsubscribe from my list he reached out to tell me how he wants me to be. How he wants me to write. He wants me to keep kinda being me with my “wisdom and insight,” with my “life experience,” but be a little less, please. He reached out to say, “Don’t be you, be who I want you to be.” He wants me filtered. Cleaned up. Buttoned down. Dialed back. But that’s not me. So which is it? I’m over here in my lane, doing my thing and someone says, “No. You’re doing you wrong.” It’s his opinion. I didn’t ask for it. But he felt emboldened enough to offer it. Okay. Whatever. But if I began to question who I am through his lens, or any other person’s lens, instead of God’s lens- I’ll lose myself again. And honestly, I’ve worked way too long and hard to find me. Dammit. ", "child": "568_1\t568_2\t568_3\t568_4\t568_5\t568_6\t568_7"}