{"name": "569", "parent": "", "title": "Jesus Was Crucified. But Why?", "sentences": [{"17cf": "Jesus Was Crucified. But Why?"}, {"e777": "The myth of redemptive violence is alive and well in Trump’s America"}, {"65bc": "Jesus died the humiliating death on a state sanctioned instrument of torture and shame with collusion of the religious elite."}, {"9f63": "We mark that tragedy this week we strangely call “Holy.” And then we get to Easter with its brunches and tulips and new white clothes."}, {"cad7": "olive wood carving, artist unknown || Ilana Goor Museum, Tel Aviv"}, {"df08": "Why did Jesus have to die?"}, {"2969": "Today if you pose that question to the average person on the street, even if they do not go to church or have any belief in the teachings of the Christian church, they will likely say “Jesus died for the sins of the world.” And, especially if they are a Christian, they may add “to appease the wrath of God.”"}, {"a93e": "But that’s not why Jesus died. And that’s not even what Jesus was about in the first place. And if this is news to you, then that’s why we just shrug our shoulders every time we bomb the shit out of some far off corner of the Middle East, or don’t pause to lament another man or woman executed on death row, or, hell, think it is ok to get into that flame war on the internet — a sort of cyber disembodied shouting match that OUR PRESIDENT LOVES TO DO ON SATURDAY MORNINGS WHEN HE SHOULD BE TAKING HIS GRANDCHILDREN ON A WALK IN THE PARK (always in all caps)."}, {"92ab": "It’s in Jesus death we are invited to give up the endless cycle of death and vengeance and choose the life that is truly life — lived in some sort of threefold chord of love, for the Divine, for our neighbors, and for ourselves."}, {"f6e5": "The earliest followers of Jesus’ wisdom teaching and transformational movement saw this hidden there in plain sight — which is why they so beautifully put to pen their collective memory of the horror of his public execution, coupled with the wondrous shock and awe of nature on full display. It was remembered that the moment he died on a Friday that the curtain separating the clean from the unclean in the Temple was torn asunder. A startling sign of an all inclusive God who would move mountains to display what the cost of love looks like in public — freely accessible to all. It’s reinforced in the Easter Sunday meditations you might hear if you sit in a chair or a pew long enough this weekend where some women come to the tomb in which Jesus body lay only to find that the stone had been rolled away and he was missing (cue Mumford & Sons and enjoy that cup of coffee in the fellowship hall while your kiddos look for painted eggs!)."}, {"944a": "We must put an end to the myth of redemptive violence — that deeply held story that we consciously and subconsciously put all our trust in and gets us nowhere."}, {"38c1": "The moment we decide to put an end to this dangerous, timeless view of life is the moment we might begin to turn the tide on that which truly ails us: the idea that there are winners and losers and that God is always on the side of the team with the mega bombs."}, {"a72a": "The US military dropped the largest ever non-nuclear bomb on series of tunnels in a far off corner of Afghanistan where terrorists were purportedly stationed— our media salivates at its nickname, “The Mother of All Bombs.”"}, {"e4db": "US drops largest non-nuclear bomb in AfghanistanA GBU-43/B Massive Ordnance Air Blast Bomb, nicknamed MOAB, was dropped at 7 p.m. local time Thursday, the sources said…www.cnn.com"}, {"85e6": "We dropped this bomb at 7pm local time Thursday in Afghanistan."}, {"1308": "At 7pm Portland time tonight, my pastor friend Amy and I will lead a Maundy Thursday worship gathering where we’ll hear the Passion story of Christ betrayed and nailed on that Roman cross. If we were using more conventional storytelling devices, we’d say that Jesus was wrongfully convicted and executed by lethal injection or the electrical chair."}, {"a8fa": "“Maundy” is a weird church word that no one else uses any more. But I think it is good that way, because it’s a weighty word to remember that calls us to wrestle with and forever do our best to master. “Maundy” is borrowed from the Latin word that essentially means mandate or commandment — which is the main thing to remember tonight above and beyond any two pieces of Roman wood and nails."}, {"30dd": "According to the Gospel of John, Jesus gave this final teaching, before he was betrayed: “I give you a new commandment, that you love one another. Just as I have loved you, you also should love one another. (John 13:34)”"}, {"15b7": "And he followed it immediately by saying — look, this is the only way people will know you are truly following my teaching."}, {"aec3": "But we betray this impossible logic of love every time we buy into the myth of redemptive violence."}, {"f859": "Walter Wink said this about this dangerous myth:"}, {"e5dd": "The belief that violence ”saves” is so successful because it doesn’t seem to be mythic in the least. Violence simply appears to be the nature of things. It’s what works. It seems inevitable, the last and, often, the first resort in conflicts. If a god is what you turn to when all else fails, violence certainly functions as a god. What people overlook, then, is the religious character of violence. It demands from its devotees an absolute obedience-unto-death. This Myth of Redemptive Violence is the real myth of the modern world. It, and not Judaism or Christianity or Islam, is the dominant religion in our society today."}, {"f472": "We see this in the cartoons our kids watch, the shows we watch on HBO and Amazon Prime (look, I’m excited about Game of Thrones and The Man In The High Castle, too) and the endless films with endless blockbuster sequels."}, {"0b6d": "But it’s not just Hollywood and Netflix that purport the myth of redemptive violence — it’s in the very structure of our daily lived lives."}, {"80e9": "What happened with United Airlines this week? Myth of redemptive violence. You could see it in the immediate reaction of the corporate structure — in cahoots with the Chicago Police Department. We are right, that passenger is wrong, he must be neutralized, by force if necessary."}, {"6a31": "The doctor was later accused of having a shady past. Look what the myth of redemptive violence does — it humiliates, shames, and inflicts suffering. The doctor had a concussion and a broken nose as a result."}, {"6a7f": "What happened with Tomahawk missiles and Syria a week ago? The myth of redemptive violence. The President threw $100m worth of American missiles before dessert with the Chinese President Xi Jinping. Wistfully remembering the “beautiful chocolate cake” but forgetting which country he authorized bombing — Fox Business host Maria Bartiromo chats the Commander-In-Chief up like they’re talking about how bad he beat Little Marco at golf."}, {"2afe": "The myth of redemptive violence shows its utter power when, in between memorable morsels of chocolate cake, we brag about our military might but forget which country we were trying to blow to hell."}, {"7e3a": "And if you don’t believe me, just look to the shooting this week at North Park Elementary in San Bernardino, California. An estranged husband, know for his violence, murders his wife in cold blood — before taking his own life."}, {"70e3": "But that’s not all. Jonathan Martinez, an eight year old overcoming a rare genetic disorder, was shot and killed as well. While this drama was unfolding on live television, I nearly missed the cable news hosts comment “moving on” as she pivoted to the next made-for-television drama with live video footage somewhere else in Trump’s America."}, {"84d8": "Say his name. Jonathan Martinez."}, {"fb36": "Jonathan Martinez died on Monday in a school shooting in San Berdardino"}, {"d2db": "Betsy DeVos, the nation’s top educator, when asked if we should have more limits on guns in schools, dodged the question, saying that some schools needed guns because of their bear problems."}, {"210a": "Last time I checked, San Bernardino does not have a major bear problem. But it does, like the rest of us, have a major myth of redemptive violence problem."}, {"7ed8": "Also for what it’s worth and in case you missed it, Sean Spicer doesn’t quite remember the story of WWII where Hitler murdered some 6 million Jews, many with Sarin gas. This is the myth of redemptive violence at work. Violence is so normal, we forget the intricacies and details."}, {"f2c4": "We never learn."}, {"168e": "But we can choose else wise. We can make a real lasting change — if we choose."}, {"e2f8": "As Cynthia Bourgeault writes: “As we get used to this new angle of vision [beyond the myth of redemptive violence and its twin compadres anger and guilt] we probably need to begin with some deconditioning…”"}, {"fbef": "That’s why I’ll be breaking bread and sharing wine and washing feet tonight to remember the Passion and the commandment to love. Because the more bread I break and the more feet I wash I think something might change in me, too. Because Jesus ain’t done with my commitment to the myth of redemptive violence yet, either. It’s hard."}, {"e737": "What’s happening with Sean Spicer and United and school shootings in San Bernardino and even most definitely Syria and Afghanistan is that the world has largely bought into the myth of redemptive violence. Jesus offers us a pathway to the life that is truly life, and spoiler alert since it’s Holy Week, God was never angry with us and never sent Him to die on that cross. We did. And we get to look at it and make some serious fucking decisions about how to choose love, light & justice."}], "content": "Jesus Was Crucified. But Why? The myth of redemptive violence is alive and well in Trump’s America Jesus died the humiliating death on a state sanctioned instrument of torture and shame with collusion of the religious elite. We mark that tragedy this week we strangely call “Holy.” And then we get to Easter with its brunches and tulips and new white clothes. olive wood carving, artist unknown || Ilana Goor Museum, Tel Aviv Why did Jesus have to die? Today if you pose that question to the average person on the street, even if they do not go to church or have any belief in the teachings of the Christian church, they will likely say “Jesus died for the sins of the world.” And, especially if they are a Christian, they may add “to appease the wrath of God.” But that’s not why Jesus died. And that’s not even what Jesus was about in the first place. And if this is news to you, then that’s why we just shrug our shoulders every time we bomb the shit out of some far off corner of the Middle East, or don’t pause to lament another man or woman executed on death row, or, hell, think it is ok to get into that flame war on the internet — a sort of cyber disembodied shouting match that OUR PRESIDENT LOVES TO DO ON SATURDAY MORNINGS WHEN HE SHOULD BE TAKING HIS GRANDCHILDREN ON A WALK IN THE PARK (always in all caps). It’s in Jesus death we are invited to give up the endless cycle of death and vengeance and choose the life that is truly life — lived in some sort of threefold chord of love, for the Divine, for our neighbors, and for ourselves. The earliest followers of Jesus’ wisdom teaching and transformational movement saw this hidden there in plain sight — which is why they so beautifully put to pen their collective memory of the horror of his public execution, coupled with the wondrous shock and awe of nature on full display. It was remembered that the moment he died on a Friday that the curtain separating the clean from the unclean in the Temple was torn asunder. A startling sign of an all inclusive God who would move mountains to display what the cost of love looks like in public — freely accessible to all. It’s reinforced in the Easter Sunday meditations you might hear if you sit in a chair or a pew long enough this weekend where some women come to the tomb in which Jesus body lay only to find that the stone had been rolled away and he was missing (cue Mumford & Sons and enjoy that cup of coffee in the fellowship hall while your kiddos look for painted eggs!). We must put an end to the myth of redemptive violence — that deeply held story that we consciously and subconsciously put all our trust in and gets us nowhere. The moment we decide to put an end to this dangerous, timeless view of life is the moment we might begin to turn the tide on that which truly ails us: the idea that there are winners and losers and that God is always on the side of the team with the mega bombs. The US military dropped the largest ever non-nuclear bomb on series of tunnels in a far off corner of Afghanistan where terrorists were purportedly stationed— our media salivates at its nickname, “The Mother of All Bombs.” US drops largest non-nuclear bomb in AfghanistanA GBU-43/B Massive Ordnance Air Blast Bomb, nicknamed MOAB, was dropped at 7 p.m. local time Thursday, the sources said…www.cnn.com We dropped this bomb at 7pm local time Thursday in Afghanistan. At 7pm Portland time tonight, my pastor friend Amy and I will lead a Maundy Thursday worship gathering where we’ll hear the Passion story of Christ betrayed and nailed on that Roman cross. If we were using more conventional storytelling devices, we’d say that Jesus was wrongfully convicted and executed by lethal injection or the electrical chair. “Maundy” is a weird church word that no one else uses any more. But I think it is good that way, because it’s a weighty word to remember that calls us to wrestle with and forever do our best to master. “Maundy” is borrowed from the Latin word that essentially means mandate or commandment — which is the main thing to remember tonight above and beyond any two pieces of Roman wood and nails. According to the Gospel of John, Jesus gave this final teaching, before he was betrayed: “I give you a new commandment, that you love one another. Just as I have loved you, you also should love one another. (John 13:34)” And he followed it immediately by saying — look, this is the only way people will know you are truly following my teaching. But we betray this impossible logic of love every time we buy into the myth of redemptive violence. Walter Wink said this about this dangerous myth: The belief that violence ”saves” is so successful because it doesn’t seem to be mythic in the least. Violence simply appears to be the nature of things. It’s what works. It seems inevitable, the last and, often, the first resort in conflicts. If a god is what you turn to when all else fails, violence certainly functions as a god. What people overlook, then, is the religious character of violence. It demands from its devotees an absolute obedience-unto-death. This Myth of Redemptive Violence is the real myth of the modern world. It, and not Judaism or Christianity or Islam, is the dominant religion in our society today. We see this in the cartoons our kids watch, the shows we watch on HBO and Amazon Prime (look, I’m excited about Game of Thrones and The Man In The High Castle, too) and the endless films with endless blockbuster sequels. But it’s not just Hollywood and Netflix that purport the myth of redemptive violence — it’s in the very structure of our daily lived lives. What happened with United Airlines this week? Myth of redemptive violence. You could see it in the immediate reaction of the corporate structure — in cahoots with the Chicago Police Department. We are right, that passenger is wrong, he must be neutralized, by force if necessary. The doctor was later accused of having a shady past. Look what the myth of redemptive violence does — it humiliates, shames, and inflicts suffering. The doctor had a concussion and a broken nose as a result. What happened with Tomahawk missiles and Syria a week ago? The myth of redemptive violence. The President threw $100m worth of American missiles before dessert with the Chinese President Xi Jinping. Wistfully remembering the “beautiful chocolate cake” but forgetting which country he authorized bombing — Fox Business host Maria Bartiromo chats the Commander-In-Chief up like they’re talking about how bad he beat Little Marco at golf. The myth of redemptive violence shows its utter power when, in between memorable morsels of chocolate cake, we brag about our military might but forget which country we were trying to blow to hell. And if you don’t believe me, just look to the shooting this week at North Park Elementary in San Bernardino, California. An estranged husband, know for his violence, murders his wife in cold blood — before taking his own life. But that’s not all. Jonathan Martinez, an eight year old overcoming a rare genetic disorder, was shot and killed as well. While this drama was unfolding on live television, I nearly missed the cable news hosts comment “moving on” as she pivoted to the next made-for-television drama with live video footage somewhere else in Trump’s America. Say his name. Jonathan Martinez. Jonathan Martinez died on Monday in a school shooting in San Berdardino Betsy DeVos, the nation’s top educator, when asked if we should have more limits on guns in schools, dodged the question, saying that some schools needed guns because of their bear problems. Last time I checked, San Bernardino does not have a major bear problem. But it does, like the rest of us, have a major myth of redemptive violence problem. Also for what it’s worth and in case you missed it, Sean Spicer doesn’t quite remember the story of WWII where Hitler murdered some 6 million Jews, many with Sarin gas. This is the myth of redemptive violence at work. Violence is so normal, we forget the intricacies and details. We never learn. But we can choose else wise. We can make a real lasting change — if we choose. As Cynthia Bourgeault writes: “As we get used to this new angle of vision [beyond the myth of redemptive violence and its twin compadres anger and guilt] we probably need to begin with some deconditioning…” That’s why I’ll be breaking bread and sharing wine and washing feet tonight to remember the Passion and the commandment to love. Because the more bread I break and the more feet I wash I think something might change in me, too. Because Jesus ain’t done with my commitment to the myth of redemptive violence yet, either. It’s hard. What’s happening with Sean Spicer and United and school shootings in San Bernardino and even most definitely Syria and Afghanistan is that the world has largely bought into the myth of redemptive violence. Jesus offers us a pathway to the life that is truly life, and spoiler alert since it’s Holy Week, God was never angry with us and never sent Him to die on that cross. We did. And we get to look at it and make some serious fucking decisions about how to choose love, light & justice. ", "child": "569_1\t569_2\t569_3\t569_4\t569_5\t569_6\t569_7\t569_8\t569_9\t569_10\t569_11\t569_12\t569_13\t569_14\t569_15\t569_16\t569_17\t569_18\t569_19\t569_20\t569_21\t569_22\t569_23\t569_24"}