{"name": "577", "parent": "", "title": "Holy Week Around the World", "sentences": [{"0a0d": "Holy Week Around the World"}, {"c2bc": "An alfombra made from fruit"}, {"f300": "Holy Week marks the most important time of the Church’s year. During this week, which culminates in the Lord’s Passion and Resurrection, Catholics around the world participate in customs that have developed over the years to commemorate this most important event of salvation. Below are some of the most unique traditions of Holy Week."}, {"0690": "1. Alfombras (Guatemala)"}, {"5608": "During Holy Week, Catholics process with holy images through the streets of Guatemala. Just as cloaks were laid down for Jesus’s entrance into Jerusalem days before the Passion, Guatemalans prepare an honorable procession for the holy images and statues. The faithful create beautiful “carpets” known as alfombras, which are designs made from sawdust, leaves, flower petals, grasses, and other materials. The alfombras cover the streets and form the path for the procession of the images."}, {"060c": "2. Drums’ Wednesday (Malta)"}, {"f481": "Wednesday of Holy Week is sometimes called Spy Wednesday, a reference to Judas’s betrayal of Jesus. On Spy Wednesday in Malta, children have traditionally gone to church and drummed on the chairs, simulating the sound of thunder."}, {"0856": "3. Green Thursday (Germany)"}, {"18bb": "The custom of calling Holy Thursday “Green Thursday” in Germany developed because the German word for “grief” is similar to the word for “green.” On this day, Germans often eat green vegetables, especially spinach. In other parts of the world, Holy Thursday is known as “Maundy Thursday,” which comes from the Latin mandatum, meaning “commandment.”"}, {"bd04": "4. The Seven Churches (Rome)"}, {"e311": "The tradition of visiting seven churches after the Mass of Lord’s Supper on Holy Thursday began with St. Philip Neri in Rome. He and his companions would visit seven Roman churches during Holy Week. Today, people all over the world continue the tradition of visiting seven churches after Mass on Holy Thursday. In each church, they spend time with the Blessed Sacrament in its place on the Altar of Repose, where it remains until Holy Saturday."}, {"b8d8": "5. Tenebrae (United States)"}, {"19bf": "The Tenebrae services take place on Holy Thursday, Good Friday, and Holy Saturday in the United States and all over the world. In this tradition, Catholics sing the somber Matins and Lauds of the Divine Office. During the Matins of Good Friday, a triangular candlestick with fifteen candles is placed near the altar. The candles are extinguished one by one until a single candle remains lit. The darkness of this service reflects its mournfulness, which its name also represents — “tenebrae” means “shadows.”"}, {"73f4": "6. Good Friday Penance (Philippines)"}, {"702f": "In the Philippines, some Catholics go to great length to share in Jesus’s pain during Holy Week. Particularly in the city of San Pedro, people willingly get whipped, carry a cross, or even experience crucifixion for a short time (not long enough to cause serious injury or death). The purpose of this intentional suffering is not only to share in Jesus’s suffering, but also to do penance."}, {"5b4d": "7. Processions (Spain)"}, {"1161": "Processions during Holy Week are common all over the world, but they have particular importance in Spain. Nearly every city and town in Spain holds processions during Holy Week, commemorating Palm Sunday, the Way of the Cross, and more. The Spanish processions are carefully orchestrated and have beautiful decorations, statues, and images."}, {"8c46": "8. Kites (Bermuda)"}, {"d11a": "Every Good Friday, Catholics in Bermuda have a tradition of flying kites. The custom is said to represent the Ascension. The wooden sticks that are used to build the kites represent the cross. As the kite takes flight, participants are reminded of Jesus’s Ascension into heaven."}, {"d7c4": "Many of these traditions have crossed cultures and are observed all over the world. Do you follow another custom? We would love to hear about it in the comments!"}], "content": "Holy Week Around the World An alfombra made from fruit Holy Week marks the most important time of the Church’s year. During this week, which culminates in the Lord’s Passion and Resurrection, Catholics around the world participate in customs that have developed over the years to commemorate this most important event of salvation. Below are some of the most unique traditions of Holy Week. 1. Alfombras (Guatemala) During Holy Week, Catholics process with holy images through the streets of Guatemala. Just as cloaks were laid down for Jesus’s entrance into Jerusalem days before the Passion, Guatemalans prepare an honorable procession for the holy images and statues. The faithful create beautiful “carpets” known as alfombras, which are designs made from sawdust, leaves, flower petals, grasses, and other materials. The alfombras cover the streets and form the path for the procession of the images. 2. Drums’ Wednesday (Malta) Wednesday of Holy Week is sometimes called Spy Wednesday, a reference to Judas’s betrayal of Jesus. On Spy Wednesday in Malta, children have traditionally gone to church and drummed on the chairs, simulating the sound of thunder. 3. Green Thursday (Germany) The custom of calling Holy Thursday “Green Thursday” in Germany developed because the German word for “grief” is similar to the word for “green.” On this day, Germans often eat green vegetables, especially spinach. In other parts of the world, Holy Thursday is known as “Maundy Thursday,” which comes from the Latin mandatum, meaning “commandment.” 4. The Seven Churches (Rome) The tradition of visiting seven churches after the Mass of Lord’s Supper on Holy Thursday began with St. Philip Neri in Rome. He and his companions would visit seven Roman churches during Holy Week. Today, people all over the world continue the tradition of visiting seven churches after Mass on Holy Thursday. In each church, they spend time with the Blessed Sacrament in its place on the Altar of Repose, where it remains until Holy Saturday. 5. Tenebrae (United States) The Tenebrae services take place on Holy Thursday, Good Friday, and Holy Saturday in the United States and all over the world. In this tradition, Catholics sing the somber Matins and Lauds of the Divine Office. During the Matins of Good Friday, a triangular candlestick with fifteen candles is placed near the altar. The candles are extinguished one by one until a single candle remains lit. The darkness of this service reflects its mournfulness, which its name also represents — “tenebrae” means “shadows.” 6. Good Friday Penance (Philippines) In the Philippines, some Catholics go to great length to share in Jesus’s pain during Holy Week. Particularly in the city of San Pedro, people willingly get whipped, carry a cross, or even experience crucifixion for a short time (not long enough to cause serious injury or death). The purpose of this intentional suffering is not only to share in Jesus’s suffering, but also to do penance. 7. Processions (Spain) Processions during Holy Week are common all over the world, but they have particular importance in Spain. Nearly every city and town in Spain holds processions during Holy Week, commemorating Palm Sunday, the Way of the Cross, and more. The Spanish processions are carefully orchestrated and have beautiful decorations, statues, and images. 8. Kites (Bermuda) Every Good Friday, Catholics in Bermuda have a tradition of flying kites. The custom is said to represent the Ascension. The wooden sticks that are used to build the kites represent the cross. As the kite takes flight, participants are reminded of Jesus’s Ascension into heaven. Many of these traditions have crossed cultures and are observed all over the world. Do you follow another custom? We would love to hear about it in the comments! ", "child": "577_1"}