{"name": "583", "parent": "", "title": "How are those New Year’s Resolutions Coming Along?", "sentences": [{"bbdf": "How are those New Year’s Resolutions Coming Along?"}, {"a04a": "5 Things Stopping you from Achieving your Goals."}, {"8593": "Ok, so nobody panic, but just in case you hadn’t realised, it’s April. Yup, a quarter of the year has already flown past — so how are those grand plans and intentions that had you feeling all motivated and super-charged at the start of the year progressing?"}, {"f4cf": "How many times have you set a New Year’s resolution to ‘get fit’ or ‘take control of my finances’ only to find that come April you’re still in exactly the same place you started. All the desire to achieve the goal is still burning away, but you’re just not getting any closer to the finish line."}, {"79ae": "So what’s getting in the way?"}, {"bc71": "No matter what your goal — personal, financial, business — if you’re not making any progress it probably comes down to of one of the ‘5 S’s’ — Specific, Soulful, Self-Sabotage, Should and Small Steps."}, {"1fe3": "Specific"}, {"7263": "As they say, a goal without a plan is just a wish, and you can’t wish yourself into a better financial position or a fitter bod’. You need a plan for how you’re going to get there; and you can’t start to develop your plan when your goal is generic and wishy-washy."}, {"9fee": "What does ‘get fit’ actually mean? It’s going to be different for every person you ask, and if you don’t have a clear idea of what ‘fit’ is to you, how the heck are you going to achieve it?"}, {"5bc6": "Having a very clear and precise goal is the first place you need to start. You’ve got to know exactly what you’re trying to achieve so you can work out what you need to do to reach it, so BE SPECIFIC."}, {"2d9b": "How far do you want to be able to run and what is your deadline?"}, {"a36f": "How much money do you want to save and by when?"}, {"8c08": "Having a clear definition of what you want means you can actually work out whether you’ve been successful or not and it allows you to keep track of your progress along the way."}, {"b767": "Soulful"}, {"e328": "Getting really specific when setting your goals is powerful, but after a while they can start to feel empty. You lose all that initial determination and it slips down your priority list."}, {"a8ab": "What you need is a goal that’s going to keep you feeling excited and inspired so you’re motivated to keep working towards it, even when it becomes a bit of a slog."}, {"1ced": "Soulful goals take the specifics of what you want to achieve and add in why you want to achieve it. And if you really want to take your goals up a notch then the why will be linked with your ‘Why’."}, {"f3a0": "Your ‘Why’ is your bigger reason for doing what you do. Your ‘Why’ gives you purpose, it gives you focus. As Frederick Nietzsche said, “He who has a why can endure any how.”"}, {"16ca": "How do you know what your bigger ‘Why’ is?"}, {"7bc0": "Think about what is most important to you in life? What lights you up? Fuels the fire in your belly? Keeps you motivated, moving forward even when things are really tough? What do you see when you envisage your ideal life? When do you feel most alive? And, most importantly, how do you want to feel?"}, {"22f3": "Your ‘Why’ is like your North Star; the guiding light that keeps you on track, living in alignment with your personal values and heading in the direction that will help you to feel the way you want to feel."}, {"81ce": "When you set a goal that taps into your ‘Why’ it’s infused with passion and purpose, making it the kind of goal you’ll want to dedicate yourself to."}, {"d849": "Self-sabotage"}, {"ca5a": "Are you actively preventing yourself from reaching your goals?"}, {"5556": "So many of us are guilty of self-sabotage without even realising it. I know it sounds crazy. Why would we undermine our own progress and achievement? Because of a subconscious limiting belief that you are not enough."}, {"6467": "Whether it’s not good enough, deserving enough, smart enough… fill-in-the-blank enough, often the biggest thing standing in the way of our success is ourselves."}, {"d572": "So how do you stop the self-sabotage? By becoming aware of the limiting beliefs that are impacting your progress and calling ‘bullshit’. Anytime you realise a limiting belief is causing you to block your own path call it out. Acknowledge that it’s there and then do exactly what it is trying to prevent you from doing."}, {"611e": "Should"}, {"63a2": "A surprising reason you might not be reaching your goals is because you don’t actually want to."}, {"269a": "Is that goal something you really want to achieve, or is it something you think you ‘should’ want? Does your goal come from a place of authentic desire, or is it driven by external perceptions and expectations?"}, {"f56d": "The best way to avoid ‘should-ing’ all over yourself is to come back to your ‘Why’. Setting soulful goals will ensure you’re being driven by purpose, not by perception."}, {"dc18": "Small steps"}, {"56f1": "What’s the best way to eat an elephant? One bite at a time."}, {"77f4": "Setting a great goal is all well and good, but you then need to follow through with making it happen. We often say the first step in any journey is the hardest, and that’s because that first moment, before you’ve started, you’re furtherest away from your goal. The huge leap from where you are to where you want to be can feel so overwhelming that many people quit before they’ve even begun."}, {"00fa": "That’s why you need to break it down into small, easy to action steps."}, {"722d": "Set your goal, then write yourself a plan. The secret sauce in achieving any goal is small, consistent progress."}, {"7197": "It’s like taking the stairs versus jumping up the elevator shaft. If all you can see is the final floor you want to get to, reaching it can seem impossible. But if you can see the first step right in front of your toes it’s easy to start climbing."}], "content": "How are those New Year’s Resolutions Coming Along? 5 Things Stopping you from Achieving your Goals. Ok, so nobody panic, but just in case you hadn’t realised, it’s April. Yup, a quarter of the year has already flown past — so how are those grand plans and intentions that had you feeling all motivated and super-charged at the start of the year progressing? How many times have you set a New Year’s resolution to ‘get fit’ or ‘take control of my finances’ only to find that come April you’re still in exactly the same place you started. All the desire to achieve the goal is still burning away, but you’re just not getting any closer to the finish line. So what’s getting in the way? No matter what your goal — personal, financial, business — if you’re not making any progress it probably comes down to of one of the ‘5 S’s’ — Specific, Soulful, Self-Sabotage, Should and Small Steps. Specific As they say, a goal without a plan is just a wish, and you can’t wish yourself into a better financial position or a fitter bod’. You need a plan for how you’re going to get there; and you can’t start to develop your plan when your goal is generic and wishy-washy. What does ‘get fit’ actually mean? It’s going to be different for every person you ask, and if you don’t have a clear idea of what ‘fit’ is to you, how the heck are you going to achieve it? Having a very clear and precise goal is the first place you need to start. You’ve got to know exactly what you’re trying to achieve so you can work out what you need to do to reach it, so BE SPECIFIC. How far do you want to be able to run and what is your deadline? How much money do you want to save and by when? Having a clear definition of what you want means you can actually work out whether you’ve been successful or not and it allows you to keep track of your progress along the way. Soulful Getting really specific when setting your goals is powerful, but after a while they can start to feel empty. You lose all that initial determination and it slips down your priority list. What you need is a goal that’s going to keep you feeling excited and inspired so you’re motivated to keep working towards it, even when it becomes a bit of a slog. Soulful goals take the specifics of what you want to achieve and add in why you want to achieve it. And if you really want to take your goals up a notch then the why will be linked with your ‘Why’. Your ‘Why’ is your bigger reason for doing what you do. Your ‘Why’ gives you purpose, it gives you focus. As Frederick Nietzsche said, “He who has a why can endure any how.” How do you know what your bigger ‘Why’ is? Think about what is most important to you in life? What lights you up? Fuels the fire in your belly? Keeps you motivated, moving forward even when things are really tough? What do you see when you envisage your ideal life? When do you feel most alive? And, most importantly, how do you want to feel? Your ‘Why’ is like your North Star; the guiding light that keeps you on track, living in alignment with your personal values and heading in the direction that will help you to feel the way you want to feel. When you set a goal that taps into your ‘Why’ it’s infused with passion and purpose, making it the kind of goal you’ll want to dedicate yourself to. Self-sabotage Are you actively preventing yourself from reaching your goals? So many of us are guilty of self-sabotage without even realising it. I know it sounds crazy. Why would we undermine our own progress and achievement? Because of a subconscious limiting belief that you are not enough. Whether it’s not good enough, deserving enough, smart enough… fill-in-the-blank enough, often the biggest thing standing in the way of our success is ourselves. So how do you stop the self-sabotage? By becoming aware of the limiting beliefs that are impacting your progress and calling ‘bullshit’. Anytime you realise a limiting belief is causing you to block your own path call it out. Acknowledge that it’s there and then do exactly what it is trying to prevent you from doing. Should A surprising reason you might not be reaching your goals is because you don’t actually want to. Is that goal something you really want to achieve, or is it something you think you ‘should’ want? Does your goal come from a place of authentic desire, or is it driven by external perceptions and expectations? The best way to avoid ‘should-ing’ all over yourself is to come back to your ‘Why’. Setting soulful goals will ensure you’re being driven by purpose, not by perception. Small steps What’s the best way to eat an elephant? One bite at a time. Setting a great goal is all well and good, but you then need to follow through with making it happen. We often say the first step in any journey is the hardest, and that’s because that first moment, before you’ve started, you’re furtherest away from your goal. The huge leap from where you are to where you want to be can feel so overwhelming that many people quit before they’ve even begun. That’s why you need to break it down into small, easy to action steps. Set your goal, then write yourself a plan. The secret sauce in achieving any goal is small, consistent progress. It’s like taking the stairs versus jumping up the elevator shaft. If all you can see is the final floor you want to get to, reaching it can seem impossible. But if you can see the first step right in front of your toes it’s easy to start climbing. ", "child": "583_1\t583_2"}