{"name": "587", "parent": "", "title": "The One Habit Every Writer Needs. Right now.", "sentences": [{"1d63": "The One Habit Every Writer Needs. Right now."}, {"ddc2": "It only takes ten minutes a day."}, {"7ced": "Make a teeny, tiny goal and keep it."}, {"fc1b": "Lookie there. I didn’t even make you wade through the whole post to get to the meat of the thing."}, {"d01c": "I cannot overstate how life changing this one habit can be. It’s so powerful that it can take you from wanting to be a writer to actually being a writer. Really. I swear. It works like magic."}, {"75f4": "Here are the steps:"}, {"0f86": "Choose a goal."}, {"6880": "When I say teeny, tiny, I’m not kidding."}, {"e97c": "You want a goal so small that it would actually be more difficult, psychologically, to skip it than it would be to just sit down and do the damn thing."}, {"c665": "My go to teeny, tiny writing goal is ten minutes. No matter what, even on my worst day, even when I’m sick, even when I’m travelling, even when I have a million other things to wedge into 24 hours, I write for ten minutes."}, {"37c8": "If for some reason ten minutes became something I could skip — if it lost it’s status as the goal that’s so small I’d rather do it than skip it — I’d shrink it."}, {"b72b": "Five minutes."}, {"08da": "One minute."}, {"5627": "One page."}, {"bd86": "One paragraph."}, {"9075": "Hell, one word. Seriously. If that’s what it takes, set a goal of writing one new word on your manuscript everyday."}, {"f1fa": "The secret of the teeny, tiny goal is that it’s not the finish of it that matters. It’s the start. The magic is in the way that little bitty goal gets you from NOT writing to writing."}, {"0613": "I would say that 90 percent of the time, I write considerably more than ten minutes a day. The other ten percent of the time (and every single day of my life) I allow myself to write just those few minutes without guilt."}, {"65e5": "Figure out where your goal fits in your day."}, {"f1ea": "Once you have your teeny, tiny goal set, take it seriously."}, {"b142": "Schedule those few minutes like you’d schedule your day job. Write it in your planner or on your calendar. Tell Siri to remind you. Whatever it is you do to keep track of important appointments, do it."}, {"a934": "You have ten minutes. I know it might not feel like you do. But you do."}, {"5a12": "Write in a notebook during your kid’s soccer practice."}, {"588a": "Get one of those folding TV tables and turn your toilet into a mini-office. (This sounds like I’m being silly, but I live with my husband, two kids (one has autism), and my parents-in-law who both have dementia. Sometimes the bathroom is my sanctuary. The only room with a door I can lock.)"}, {"5269": "Wake up minutes early. Go to bed ten minutes late. Write during your lunch break. It’s ten minutes. Find the time and then guard it jealously."}, {"361a": "I made this analog tool I call a FRED (Folder for Reaching the End of your Draft.) If you click here, you can download it free. It’s the one thing that’s increased my ability to stick to a daily goal."}, {"1115": "Keep that goal, like it was a goal to breathe on the regular."}, {"f534": "Your goal is sacrosanct."}, {"b115": "It matters as much as a day job. As much as any other appointment on your schedule. It matters as much as watching the new episode of Big Little Lies or having dinner on the table on time or finishing your homework."}, {"751a": "This is where I might end up sounding like an unfeeling lunatic, but stick with me here. Your little teeny tiny goal matters as much as family time, even."}, {"04e0": "Let me tell you a story."}, {"6cb1": "My mother died young. She was forty-eight, I was twenty-four, and my youngest brother was just eighteen. She died within months of his high school graduation."}, {"b7b9": "In the ensuing twenty-one years, I’ve never once found myself wishing that my mom spent more time cooking or cleaning."}, {"7c2a": "But I do, sometimes, wish that I’d been able to experience her living her passion. I wish that I’d woken up in the morning to her typing at a novel or a poem. Or that I’d heard her plinking away at a guitar or working a pottery wheel late into the night."}, {"ea8a": "Putting off her passion until she was done raising her kids didn’t work out well for her. Or, frankly, for us. She was a fantastic mom, but it would have been awesome if she’d let herself be a fantastic mom who also spent ten minutes a day (minimum) painting landscapes or developing photographs in a closet darkroom."}, {"aa39": "After my mom died, I found a notebook where she’d kept ideas for romance novels. They were cheesy (one that sticks in my memory involved a pool boy), but holy shit, I wish that she’d given herself the time and space to write them. I wish that my sister and brother and I had grown up with that."}, {"4bd2": "What I’m saying is that living in your passion, even ten minutes a day, is a gift you give your family. Set that teeny, tiny goal and protect it. Meet it, every day."}, {"6a8d": ">>Sign up for the Ninja Writers Newsletter here. >>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}, {"292e": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}], "content": "The One Habit Every Writer Needs. Right now. It only takes ten minutes a day. Make a teeny, tiny goal and keep it. Lookie there. I didn’t even make you wade through the whole post to get to the meat of the thing. I cannot overstate how life changing this one habit can be. It’s so powerful that it can take you from wanting to be a writer to actually being a writer. Really. I swear. It works like magic. Here are the steps: Choose a goal. When I say teeny, tiny, I’m not kidding. You want a goal so small that it would actually be more difficult, psychologically, to skip it than it would be to just sit down and do the damn thing. My go to teeny, tiny writing goal is ten minutes. No matter what, even on my worst day, even when I’m sick, even when I’m travelling, even when I have a million other things to wedge into 24 hours, I write for ten minutes. If for some reason ten minutes became something I could skip — if it lost it’s status as the goal that’s so small I’d rather do it than skip it — I’d shrink it. Five minutes. One minute. One page. One paragraph. Hell, one word. Seriously. If that’s what it takes, set a goal of writing one new word on your manuscript everyday. The secret of the teeny, tiny goal is that it’s not the finish of it that matters. It’s the start. The magic is in the way that little bitty goal gets you from NOT writing to writing. I would say that 90 percent of the time, I write considerably more than ten minutes a day. The other ten percent of the time (and every single day of my life) I allow myself to write just those few minutes without guilt. Figure out where your goal fits in your day. Once you have your teeny, tiny goal set, take it seriously. Schedule those few minutes like you’d schedule your day job. Write it in your planner or on your calendar. Tell Siri to remind you. Whatever it is you do to keep track of important appointments, do it. You have ten minutes. I know it might not feel like you do. But you do. Write in a notebook during your kid’s soccer practice. Get one of those folding TV tables and turn your toilet into a mini-office. (This sounds like I’m being silly, but I live with my husband, two kids (one has autism), and my parents-in-law who both have dementia. Sometimes the bathroom is my sanctuary. The only room with a door I can lock.) Wake up minutes early. Go to bed ten minutes late. Write during your lunch break. It’s ten minutes. Find the time and then guard it jealously. I made this analog tool I call a FRED (Folder for Reaching the End of your Draft.) If you click here, you can download it free. It’s the one thing that’s increased my ability to stick to a daily goal. Keep that goal, like it was a goal to breathe on the regular. Your goal is sacrosanct. It matters as much as a day job. As much as any other appointment on your schedule. It matters as much as watching the new episode of Big Little Lies or having dinner on the table on time or finishing your homework. This is where I might end up sounding like an unfeeling lunatic, but stick with me here. Your little teeny tiny goal matters as much as family time, even. Let me tell you a story. My mother died young. She was forty-eight, I was twenty-four, and my youngest brother was just eighteen. She died within months of his high school graduation. In the ensuing twenty-one years, I’ve never once found myself wishing that my mom spent more time cooking or cleaning. But I do, sometimes, wish that I’d been able to experience her living her passion. I wish that I’d woken up in the morning to her typing at a novel or a poem. Or that I’d heard her plinking away at a guitar or working a pottery wheel late into the night. Putting off her passion until she was done raising her kids didn’t work out well for her. Or, frankly, for us. She was a fantastic mom, but it would have been awesome if she’d let herself be a fantastic mom who also spent ten minutes a day (minimum) painting landscapes or developing photographs in a closet darkroom. After my mom died, I found a notebook where she’d kept ideas for romance novels. They were cheesy (one that sticks in my memory involved a pool boy), but holy shit, I wish that she’d given herself the time and space to write them. I wish that my sister and brother and I had grown up with that. What I’m saying is that living in your passion, even ten minutes a day, is a gift you give your family. Set that teeny, tiny goal and protect it. Meet it, every day. >>Sign up for the Ninja Writers Newsletter here. >>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "child": "587_1\t587_2\t587_3\t587_4\t587_5\t587_6\t587_7\t587_8\t587_9\t587_10\t587_11\t587_12\t587_13\t587_14\t587_15\t587_16\t587_17\t587_18\t587_19\t587_20\t587_21\t587_22\t587_23\t587_24\t587_25587_1\t587_2\t587_3\t587_4\t587_5\t587_6\t587_7\t587_8\t587_9\t587_10\t587_11\t587_12\t587_13\t587_14\t587_15\t587_16\t587_17\t587_18\t587_19\t587_20\t587_21\t587_22\t587_23\t587_24\t587_25587_1\t587_2\t587_3\t587_4\t587_5\t587_6\t587_7\t587_8\t587_9\t587_10\t587_11\t587_12\t587_13\t587_14\t587_15\t587_16\t587_17\t587_18\t587_19\t587_20\t587_21\t587_22\t587_23\t587_24\t587_25"}