{"name": "594", "parent": "", "title": "I Had No Idea We Were Poor in The Beginning…", "sentences": [{"9f5f": "I Had No Idea We Were Poor in The Beginning…"}, {"eb76": "When you are young, it’s just life. The concept of money means nothing."}, {"61cc": "Every day I heard how it was fruitless to buy this, useless to purchase that. We don’t need “those kind of things.”"}, {"9413": "(At the time, I didn’t realize where 2 teachers’ salaries landed us on the economic totem pole.)"}, {"0a8b": "Many nights I remember eating beanie weanies for dinner. Not as a snack — that was dinner. That was all we had."}, {"21eb": "In 6th grade, I tried out for and made the golf team. Imagine me, a scrawny kid with Goodwill clothes walking next to country club kids. They had the latest Nike gear. I had 4 hand-me-down clubs: 3 wood, mid-iron, sand wedge, putter."}, {"ae96": "For the most part, I can’t remember buying or owning many new things."}, {"bfdf": "Then one day:"}, {"3915": "“Todd, come back here. I want you to see something.”"}, {"bf06": "My dad sat in his office with 4 sweaters and a space heater (central heat was expensive). He smiled when I walked in."}, {"cb39": "“I think it’s about time I told you. Your mom and I have been saving for you to go to college.”"}, {"ee96": "I tiptoed over the scattered documents on the floor and around the far side of his desk. I stood behind his chair. I followed his finger to the number he’d been pointing at on the screen."}, {"65e2": "My jaw dropped. He said “it’s not much. But it should get you started.”"}, {"b94e": "I heard recently that love is sacrifice. Going by that definition, my parents loved me more than I can possibly imagine."}, {"401d": "They sacrificed instant gratification for long-term gain."}, {"8483": "They sacrificed higher paying jobs for more time with their children."}, {"0895": "They sacrificed comfort for quality."}, {"201d": "They sacrificed wealth so I could be rich."}, {"10ea": "Thank your parents today. They made you who you are."}, {"6b63": "See also this other story featuring one of my parents:"}, {"c2a0": "And to get the best stuff in your inbox, join my newsletter right here."}], "content": "I Had No Idea We Were Poor in The Beginning… When you are young, it’s just life. The concept of money means nothing. Every day I heard how it was fruitless to buy this, useless to purchase that. We don’t need “those kind of things.” (At the time, I didn’t realize where 2 teachers’ salaries landed us on the economic totem pole.) Many nights I remember eating beanie weanies for dinner. Not as a snack — that was dinner. That was all we had. In 6th grade, I tried out for and made the golf team. Imagine me, a scrawny kid with Goodwill clothes walking next to country club kids. They had the latest Nike gear. I had 4 hand-me-down clubs: 3 wood, mid-iron, sand wedge, putter. For the most part, I can’t remember buying or owning many new things. Then one day: “Todd, come back here. I want you to see something.” My dad sat in his office with 4 sweaters and a space heater (central heat was expensive). He smiled when I walked in. “I think it’s about time I told you. Your mom and I have been saving for you to go to college.” I tiptoed over the scattered documents on the floor and around the far side of his desk. I stood behind his chair. I followed his finger to the number he’d been pointing at on the screen. My jaw dropped. He said “it’s not much. But it should get you started.” I heard recently that love is sacrifice. Going by that definition, my parents loved me more than I can possibly imagine. They sacrificed instant gratification for long-term gain. They sacrificed higher paying jobs for more time with their children. They sacrificed comfort for quality. They sacrificed wealth so I could be rich. Thank your parents today. They made you who you are. See also this other story featuring one of my parents: And to get the best stuff in your inbox, join my newsletter right here. ", "child": "594_1\t594_2\t594_3\t594_4\t594_5594_1\t594_2\t594_3\t594_4\t594_5594_1\t594_2\t594_3\t594_4\t594_5"}