{"name": "596", "parent": "", "title": "Good General Advice for All College Students (8 Tips)", "sentences": [{"4c35": "Good General Advice for All College Students (8 Tips)"}, {"9d64": "Alright, I’ll start with the obvious one:"}, {"f389": "#1: You are allowed to make money now — I remember having this strange mindset when I was in college. “Once I get my degree, then I’ll start making money.”"}, {"7356": "Wrong. You don’t have to wait. There is no age limit on earning an income."}, {"e8c7": "#2: Learn how to learn — this skill is one of the most intangible, but probably the most valuable."}, {"d5a8": "#3: Sit with the old people — When I was in school, there was always “that guy.” The one who always showed up early, put his butt in the front row, and asked the teacher a million questions. He was always very uncool. I’m ashamed to say we made plenty of jokes at his expense."}, {"d623": "“That guy” who was in my class went from a public university in Johnson City, TN to the headquarters at IBM , so I guess he figured some things out."}, {"eb50": "#4: Make friends with your teachers — Because if you get a job in their industry, they become your peers. Peers give you good advice, connections, and jobs."}, {"8cbc": "#5: Debt = bad — That’s a little oversimplified, but that’s how I have to think. I don’t think I am mature enough to handle debt. There aren’t many choices you can make at 18 which chain you to a direction for life, but signing up for $100,000 NONBANKRUPTABLE debt is one of them."}, {"98a9": "#6: Please, for the love of God, follow your interests — This will be the only time in your life the whole world will excuse you to kick back and learn whatever you please. At no other time is it socially acceptable to think and not work."}, {"1e51": "Take advantage of this haven. Chase curiosity, not cash."}, {"967d": "(This rule even trumps #1 since you have few expenses right now)"}, {"7482": "#7: The 30 x 30 x 30 Rule —"}, {"ad4c": "This is important."}, {"2635": "Spend 30 seconds more per day doing what interests you and 30 seconds less of the things you don’t like."}, {"642b": "Spend 30 days in a row chasing a potential career path. If you don’t hate it, you might be onto something. If you do, at least you only spent 30 days."}, {"0de9": "Spend your time like you are going to follow a path for 30 years. Do you realize how patient you would be? Do you realize how much you would grow? Do you understand you would have another 30 years to do what you wanted?"}, {"c7e8": "(See also: What Life Advice Would You Give to a 17-year Old?)"}, {"f758": "#8: Build good habits now — You likely have the most freedom you will ever have over your time right now. Learn how to get up in the morning. Learn what you care about. Learn how to be valuable."}, {"2ef5": "The truth is, if you don’t figure how to spend your time, someone else will spend it for you."}, {"13f2": "Get the jump start"}, {"d58c": "After college, I thought I had all the right tools. I had the skills. I had ambition. I had connections."}, {"9c73": "Yet, I wound up in a job I hated, doing boring work and considering a leap out the 3rd story window at least every couple of days. I worked hard. But working hard got me nothing."}, {"f764": "Then — I found the way out. It wasn’t hustle."}, {"22b9": "It was ideas."}, {"6583": "One idea rocketed me to a new position, a new boss, new responsibilities, and double my salary."}, {"c7a7": "My idea process is everything, and I’ve captured that process in The Ultimate Guide to Infinite Ideas, which I’m giving away for the price of an email address."}, {"e8fd": "Get your copy right now."}], "content": "Good General Advice for All College Students (8 Tips) Alright, I’ll start with the obvious one: #1: You are allowed to make money now — I remember having this strange mindset when I was in college. “Once I get my degree, then I’ll start making money.” Wrong. You don’t have to wait. There is no age limit on earning an income. #2: Learn how to learn — this skill is one of the most intangible, but probably the most valuable. #3: Sit with the old people — When I was in school, there was always “that guy.” The one who always showed up early, put his butt in the front row, and asked the teacher a million questions. He was always very uncool. I’m ashamed to say we made plenty of jokes at his expense. “That guy” who was in my class went from a public university in Johnson City, TN to the headquarters at IBM , so I guess he figured some things out. #4: Make friends with your teachers — Because if you get a job in their industry, they become your peers. Peers give you good advice, connections, and jobs. #5: Debt = bad — That’s a little oversimplified, but that’s how I have to think. I don’t think I am mature enough to handle debt. There aren’t many choices you can make at 18 which chain you to a direction for life, but signing up for $100,000 NONBANKRUPTABLE debt is one of them. #6: Please, for the love of God, follow your interests — This will be the only time in your life the whole world will excuse you to kick back and learn whatever you please. At no other time is it socially acceptable to think and not work. Take advantage of this haven. Chase curiosity, not cash. (This rule even trumps #1 since you have few expenses right now) #7: The 30 x 30 x 30 Rule — This is important. Spend 30 seconds more per day doing what interests you and 30 seconds less of the things you don’t like. Spend 30 days in a row chasing a potential career path. If you don’t hate it, you might be onto something. If you do, at least you only spent 30 days. Spend your time like you are going to follow a path for 30 years. Do you realize how patient you would be? Do you realize how much you would grow? Do you understand you would have another 30 years to do what you wanted? (See also: What Life Advice Would You Give to a 17-year Old?) #8: Build good habits now — You likely have the most freedom you will ever have over your time right now. Learn how to get up in the morning. Learn what you care about. Learn how to be valuable. The truth is, if you don’t figure how to spend your time, someone else will spend it for you. Get the jump start After college, I thought I had all the right tools. I had the skills. I had ambition. I had connections. Yet, I wound up in a job I hated, doing boring work and considering a leap out the 3rd story window at least every couple of days. I worked hard. But working hard got me nothing. Then — I found the way out. It wasn’t hustle. It was ideas. One idea rocketed me to a new position, a new boss, new responsibilities, and double my salary. My idea process is everything, and I’ve captured that process in The Ultimate Guide to Infinite Ideas, which I’m giving away for the price of an email address. Get your copy right now. ", "child": "596_1596_1"}