{"name": "598", "parent": "", "title": "From Graphic Designer to Product Designer", "sentences": [{"6d78": "From Graphic Designer to Product Designer"}, {"39ab": "I’m sure that at least at one point in your life you stopped for a moment and looked back at where you started, as a professional, and what you have achieved so far. I had and still have a lot of those moments, they are good to reflect on everything good and bad, and make sure you don’t make the same mistakes again. That inspired me to write this article to tell you the story of my professional career, how I started as a graphic designer and moved to be a product designer."}, {"e61b": "I have always loved technology, art, design and architecture, so for me to choose a field when I was in school was very hard. At first I wanted to be an IT Engineer because of my love for computers and being really interested in learning about programming, even though at that point I had never written a single line of code, but that world fascinated me. Well, I was only an above average student at school, which meant that a lot of the disciplines I had to learn on my way to become an engineer were too much for me which led me to the artistic side, my second option."}, {"e0d7": "During the last three years of secondary school my love for design grew exponentially. After secondary school I did not go to University, I just went for a one year professional course with another semester of internship part of the course. At this course I had my first contact with web programming, including technologies like HTML, CSS, PHP and ActionScript. Even though I loved learning how to program, how to build websites and web applications I was still more interested in graphic design, I truly believed and still believe that companies need to pay more attention to their image out there and I wanted to be a part of a world where I could help some companies get easily recognised and boost their levels of trustworthiness."}, {"0a9a": "I started working for a small design agency in early 2009 in Portugal (where I’m from) and on my day to day basis I would design everything a business needs, from business cards to entirely new logos. We also created websites for those businesses, I would design them and build the HTML structure of the website, and another member of the team would integrate other technologies and build the rest of the functionality. I was a glorified graphic designer at that time. Makes me laugh now because nowadays it’s almost a given, that a designer should know the basics of front-end development."}, {"4a00": "Designed by me: http://amais.pt/"}, {"38a1": "The more websites I created and observing how fast the web and smartphones were growing into our lives, I started to really getting into web design and started to feel a bigger love for the interaction design than the love for graphic design. Keep in mind that this was early 2009, many frameworks that we know today didn’t even exist. I was inexperienced, it was my first job, and everyone was still trying to figure out how to create beautiful, yet functional, websites."}, {"657e": "There was something about designing and then turn that into a thing that people could “touch” and engage with at any time on their computers, that kept me invested and a passion for it started to grow. I was also that kind of kid that when I got a new toy I would spend a week playing with it, until I would eventually open it up to see how it was made and built, and sometimes even to see how it would work. Always have been very curious and that curiosity led me to want to know how websites worked and how they were built."}, {"e4a9": "From here I started to pay more attention to what was out there, to websites and events that would award best design prizes to other websites, and try to figure it out on my own what makes that website a good website."}, {"53f8": "I must confess that the early years of my, still young, career were based on trying to figure out my style, and what makes a good website, completely ignoring UX."}, {"e567": "A few years after starting my first job I decided to move to London in pursuit of a better career. I initially started working as a freelance designer, I did a few project, mostly websites, but still having some graphic design projects too. That was an interesting year and a half of my life, I learned that don’t be a freelance designer unless you really have a plan, which I didn’t, but in the interest of time I’m just going to say that if you want to be a freelance, keep in mind that you’ll need to be CEO, Designer, Developer, Customer Success and Sales team all at once, every single day. I found the experience very interesting, enlightening and I definitely learned new skills not only as professional, but as a person too."}, {"deb4": "After having one of those moments of reflection, trying to decide what to do next and what I wanted for my career, I decided to look for something challenging, something new to me, and something that could make a difference."}, {"bb47": "I joined Fliplet in 2014, just a couple of months after deciding not to be a freelance anymore. In the beginning I was a junior designer, I did a little bit of graphic design, but I was mostly working on the company’s new product. Fliplet Studio is the product, an enterprise app building platform."}, {"5101": "Before joining Fliplet I had some notions of what good UX was, but was only after starting working at Fliplet that I really understood the importance of it, mainly because we our users would create apps with our product without needing to know how to code or design, the product had to be easy to use and understand, and above all keep users coming back to build even more apps."}, {"869b": "So you must be thinking “wait, he started his career in 2009 and only 5 years later he noticed how important UX was? What was he doing during that time?”."}, {"4d69": "Well, I like to think that those early years set the base for what I am today, were the years that the love for digital design grew, the years that made me passionate and care about what I do. That said, it made sense that the next step for me was to pay attention to the user experience with the things I designed and try to improve someone’s (professional) life with something I created."}, {"78df": "With the help of my colleagues, and of course the processes we have for each project, I was becoming better at what I do, paying more attention to little details, started looking into app design, started understanding how people interact with apps and what was considered a standard in the eyes of the users. I must admit that in the beginning it was a bit difficult because I wasn’t used to have a process to follow, and I wasn’t definitely used to think too much about the user, I was only used to design pretty things that would look good on a screen."}, {"70d7": "Fliplet Studio v2"}, {"b4aa": "My first major project at Fliplet was to design and create a theme, that ended up containing nine different layouts, this project took us roughly two months to complete, and I’m still proud of creating that theme, because after two years it’s the theme we were still using. Of course we have a lot more layouts now, hell, we even have a new version of the product now, but that initial set of layouts set the rules for the next to come and also for the look and feel of the apps produced by it."}, {"67e8": "After that theme was launched to the public we started working on new features. Working on features added a little bit more complexity to the process, because every feature have two sides of it — The one that the app creator interacts with when creating the app in the platform, and the app side, the side the end users will interact with. Building a feature it’s not just about making it look great, and position everything correctly for a great experience, is also about the wording, how you explain each option of the feature, the responsiveness of each action the user makes, and in the beginning was difficult to test this with real users because we were still small and we didn’t have many clients using the product."}, {"b169": "So how did we get it right? You may ask. Well, we didn’t. We did research, we followed our process and we released it to the public, and only after feedback from clients we would change things when appropriate. Basically what I’m saying is that we learned from our own mistakes, but we didn’t shy way from releasing it anyway."}, {"86ea": "We would always follow the same process — do research, sketch and wireframes ideas, design and prototyping, and at the end implementing in the system. This process still holds today on every project.I must say that it is fundamental that you have a good work process for a project, otherwise you’ll end up wasting time and not deliver great features, websites or anything."}, {"623f": "Of course that sometimes, and depending on the project, you can cut a few corners and shorten each process, but you must be completely certain you can do that, because some team colleagues must depend on that for them to be able to do their work properly."}, {"90d5": "I was becoming better at what I do, with a lot more knowledge about good UX design, and now fully engrossed by it."}, {"358e": "I can’t thank enough the people in the team that helped and believed in me, and still do, because I feel I have never grown so much as professional in the first 5 years as I did in the past 3 years. It really is an awesome team."}, {"2e9c": "As a Product Designer now, I have to come up with new ideas for the product, new way for our users to interact with, and experience the apps they create, and spark some internal discussions about new features. A designer’s job is not only to create beautiful things, it is also, and mainly, to solve problems, sometimes even problems that the user doesn’t know yet."}, {"1d46": "I was hungry for learning more, for creating experiences, for evolving as a professional. I still think graphic designers are very important for any business, but I wanted more than that, and I achieved some of my objectives by going down the route of becoming a product designer, where I can touch a lot more people with the product that I’m working on now. It’s never dull, always challenging, always fun. I’m happy to be a part of a team that helped users creating more than 2000 apps."}, {"d30b": "I hope you liked my story and I would love to read your stories. Respond to this article with your professional stories!"}, {"3b23": "Until next time, keep on solving problems!"}, {"cf64": "Like this? Please click the little heart and share with others."}], "content": "From Graphic Designer to Product Designer I’m sure that at least at one point in your life you stopped for a moment and looked back at where you started, as a professional, and what you have achieved so far. I had and still have a lot of those moments, they are good to reflect on everything good and bad, and make sure you don’t make the same mistakes again. That inspired me to write this article to tell you the story of my professional career, how I started as a graphic designer and moved to be a product designer. I have always loved technology, art, design and architecture, so for me to choose a field when I was in school was very hard. At first I wanted to be an IT Engineer because of my love for computers and being really interested in learning about programming, even though at that point I had never written a single line of code, but that world fascinated me. Well, I was only an above average student at school, which meant that a lot of the disciplines I had to learn on my way to become an engineer were too much for me which led me to the artistic side, my second option. During the last three years of secondary school my love for design grew exponentially. After secondary school I did not go to University, I just went for a one year professional course with another semester of internship part of the course. At this course I had my first contact with web programming, including technologies like HTML, CSS, PHP and ActionScript. Even though I loved learning how to program, how to build websites and web applications I was still more interested in graphic design, I truly believed and still believe that companies need to pay more attention to their image out there and I wanted to be a part of a world where I could help some companies get easily recognised and boost their levels of trustworthiness. I started working for a small design agency in early 2009 in Portugal (where I’m from) and on my day to day basis I would design everything a business needs, from business cards to entirely new logos. We also created websites for those businesses, I would design them and build the HTML structure of the website, and another member of the team would integrate other technologies and build the rest of the functionality. I was a glorified graphic designer at that time. Makes me laugh now because nowadays it’s almost a given, that a designer should know the basics of front-end development. Designed by me: http://amais.pt/ The more websites I created and observing how fast the web and smartphones were growing into our lives, I started to really getting into web design and started to feel a bigger love for the interaction design than the love for graphic design. Keep in mind that this was early 2009, many frameworks that we know today didn’t even exist. I was inexperienced, it was my first job, and everyone was still trying to figure out how to create beautiful, yet functional, websites. There was something about designing and then turn that into a thing that people could “touch” and engage with at any time on their computers, that kept me invested and a passion for it started to grow. I was also that kind of kid that when I got a new toy I would spend a week playing with it, until I would eventually open it up to see how it was made and built, and sometimes even to see how it would work. Always have been very curious and that curiosity led me to want to know how websites worked and how they were built. From here I started to pay more attention to what was out there, to websites and events that would award best design prizes to other websites, and try to figure it out on my own what makes that website a good website. I must confess that the early years of my, still young, career were based on trying to figure out my style, and what makes a good website, completely ignoring UX. A few years after starting my first job I decided to move to London in pursuit of a better career. I initially started working as a freelance designer, I did a few project, mostly websites, but still having some graphic design projects too. That was an interesting year and a half of my life, I learned that don’t be a freelance designer unless you really have a plan, which I didn’t, but in the interest of time I’m just going to say that if you want to be a freelance, keep in mind that you’ll need to be CEO, Designer, Developer, Customer Success and Sales team all at once, every single day. I found the experience very interesting, enlightening and I definitely learned new skills not only as professional, but as a person too. After having one of those moments of reflection, trying to decide what to do next and what I wanted for my career, I decided to look for something challenging, something new to me, and something that could make a difference. I joined Fliplet in 2014, just a couple of months after deciding not to be a freelance anymore. In the beginning I was a junior designer, I did a little bit of graphic design, but I was mostly working on the company’s new product. Fliplet Studio is the product, an enterprise app building platform. Before joining Fliplet I had some notions of what good UX was, but was only after starting working at Fliplet that I really understood the importance of it, mainly because we our users would create apps with our product without needing to know how to code or design, the product had to be easy to use and understand, and above all keep users coming back to build even more apps. So you must be thinking “wait, he started his career in 2009 and only 5 years later he noticed how important UX was? What was he doing during that time?”. Well, I like to think that those early years set the base for what I am today, were the years that the love for digital design grew, the years that made me passionate and care about what I do. That said, it made sense that the next step for me was to pay attention to the user experience with the things I designed and try to improve someone’s (professional) life with something I created. With the help of my colleagues, and of course the processes we have for each project, I was becoming better at what I do, paying more attention to little details, started looking into app design, started understanding how people interact with apps and what was considered a standard in the eyes of the users. I must admit that in the beginning it was a bit difficult because I wasn’t used to have a process to follow, and I wasn’t definitely used to think too much about the user, I was only used to design pretty things that would look good on a screen. Fliplet Studio v2 My first major project at Fliplet was to design and create a theme, that ended up containing nine different layouts, this project took us roughly two months to complete, and I’m still proud of creating that theme, because after two years it’s the theme we were still using. Of course we have a lot more layouts now, hell, we even have a new version of the product now, but that initial set of layouts set the rules for the next to come and also for the look and feel of the apps produced by it. After that theme was launched to the public we started working on new features. Working on features added a little bit more complexity to the process, because every feature have two sides of it — The one that the app creator interacts with when creating the app in the platform, and the app side, the side the end users will interact with. Building a feature it’s not just about making it look great, and position everything correctly for a great experience, is also about the wording, how you explain each option of the feature, the responsiveness of each action the user makes, and in the beginning was difficult to test this with real users because we were still small and we didn’t have many clients using the product. So how did we get it right? You may ask. Well, we didn’t. We did research, we followed our process and we released it to the public, and only after feedback from clients we would change things when appropriate. Basically what I’m saying is that we learned from our own mistakes, but we didn’t shy way from releasing it anyway. We would always follow the same process — do research, sketch and wireframes ideas, design and prototyping, and at the end implementing in the system. This process still holds today on every project.I must say that it is fundamental that you have a good work process for a project, otherwise you’ll end up wasting time and not deliver great features, websites or anything. Of course that sometimes, and depending on the project, you can cut a few corners and shorten each process, but you must be completely certain you can do that, because some team colleagues must depend on that for them to be able to do their work properly. I was becoming better at what I do, with a lot more knowledge about good UX design, and now fully engrossed by it. I can’t thank enough the people in the team that helped and believed in me, and still do, because I feel I have never grown so much as professional in the first 5 years as I did in the past 3 years. It really is an awesome team. As a Product Designer now, I have to come up with new ideas for the product, new way for our users to interact with, and experience the apps they create, and spark some internal discussions about new features. A designer’s job is not only to create beautiful things, it is also, and mainly, to solve problems, sometimes even problems that the user doesn’t know yet. I was hungry for learning more, for creating experiences, for evolving as a professional. I still think graphic designers are very important for any business, but I wanted more than that, and I achieved some of my objectives by going down the route of becoming a product designer, where I can touch a lot more people with the product that I’m working on now. It’s never dull, always challenging, always fun. I’m happy to be a part of a team that helped users creating more than 2000 apps. I hope you liked my story and I would love to read your stories. Respond to this article with your professional stories! Until next time, keep on solving problems! Like this? Please click the little heart and share with others. ", "child": "598_1\t598_2"}