{"name": "599", "parent": "", "title": "Getting Rejected", "sentences": [{"a044": "Getting Rejected"}, {"85cc": "I wrote a book. A good book. Actually, a great book. About how and why we are all so distracted, and what to do about."}, {"7780": "That’s great, right? The tens of thousands of words are written, rewritten, and rewritten again. Chapters have been moved, refined, and moved back. Themes clarified, and footnotes added. After hundreds of hours of work, the manuscript is polished. Gleaming, really. And I rejoiced!"}, {"b1b0": "How it feels when you finish a manuscript"}, {"08b8": "Unfortunately for me, none of the traditional publishers want to release it to the world. Each one has passed, often without the courtesy of an explanation."}, {"685e": "My agent — who read the entire thing the first time he saw it — is confused, but optimistic. He wants to find the right publisher, and he knows it can be a long process."}, {"f228": "But that isn’t how I feel. I’m crushed. Deflated. My heart feels tight every time I think about the massive investment I made in this book, and the very real possibility that it won’t ever be published."}, {"3b8a": "How it feels when that manuscript is rejected"}, {"51ea": "There are many ways to reject a book"}, {"0c97": "Being rejected hurts. I’m sure the publishers are all nice people, but that doesn’t help me deal with my pain and frustration."}, {"4d87": "They all have a different excuse. I actually wish they were more consistent, or more critical. Instead I received a shotgun blast of rubber pellets to the chest. A wide shot group of non-lethal wounds. Here is a taste of the responses:"}, {"744d": "I liked this project quite a bit, but unfortunately its content overlaps somewhat with a few other books on our list."}, {"2d8a": "This is an interesting project, but I’m afraid I didn’t catch a strong enough vision to make an offer."}, {"c908": "Even though I like this, I think we are going to have a hard time making it stand out."}, {"c5eb": "William is definitely on to something but I think it’s a little too early in his platform development around the [book’s] message for me to pursue."}, {"6ee1": "And there were many more."}, {"a36c": "How many of you can identify with the feeling I have as I reread these? Can you feel the same deep anxiety and fear? The nagging feeling that each of them is right? That the book just isn’t that good? That I’m just not that good?"}, {"d54d": "(http://gauthereaugroup.com/not-good-enough-big-lie/)"}, {"b006": "That I should just give up?"}, {"f49c": "A Great Work"}, {"1c0c": "Imagine there is a thing that you really care about. This beautiful, delicate thing that connects to your heart in a deep and profound way."}, {"1bf7": "You want to see this thing grow and thrive. Not for your sake, but simply because you love it. You know it can be a blessing to others, to the world."}, {"8a41": "You see people struggling: lost, overwhelmed, and afraid. The thing you made can help them."}, {"11a9": "“Take it!” you want to shout. “This is what you’re looking for! This is what you need!”"}, {"66d3": "But it’s not so simple. Some other people need to agree with you first. The gatekeepers."}, {"c00c": "You have to take your thing — your precious thing — and hand it over to these gatekeepers. It’s so delicate, so fragile. You don’t want to leave it in their rough hands. You’re afraid of what they will do to it, and what that will mean to you."}, {"7e21": "Protecting your dream (https://rowanjanuary.wordpress.com/tag/theme/)"}, {"aeed": "And the worst happens. These other people do not love the thing you made. They would prefer something else. Perhaps they want a smaller thing, or a bigger thing. Or a louder thing, or a quieter thing. Darker, or lighter. Longer. Shorter."}, {"f2d8": "So what do these other people do while you stand there clenching your fists? They slowly — surgically — kill your thing. They lift it up and point out its flaws. They poke its most vulnerable spots, and you shudder."}, {"deb2": "I love how timely and thoughtful this project is, but in the end I didn’t feel the approach was accessible for the average reader as I would like to see, for our list. So despite everything going for it (and how much I personally need it!) I’m going to have to bow out for us."}, {"c618": "They poke you again."}, {"706f": "It felt to me like there was an article’s worth of sharp ideas tucked inside a book’s worth of material, and even that set of sharp ideas didn’t feel to me to be transformative in their power."}, {"2d28": "You feel physically sick. You want to curl up in a ball. But you just stand there and listen, a pale smile on your stupid face."}, {"3971": "They keep talking, carelessly handling your thing. It’s an afterthought now, something they won’t ever use. The thing is dead to them, and so are you."}, {"4807": "Layers of Pain"}, {"e502": "You have a wise friend, and thank God you do. She is there to offer you advice. To let your tears darken her clothes. Be patient and stubborn, your wise friend says."}, {"6ff9": "She would know. She’s been here before and seen this happen many times. She knows how painful it is for you, but she also knows that the pain is yours alone. She doesn’t try to take it away from you. That wouldn’t be right, or fair."}, {"bdcf": "Now you start to feel a little better. After all, that was just one other person, right? There are many other people who could help you spread your thing to the rest of the world."}, {"9fc3": "So you find more of them with the help of your friend. And each of them — every single one of them — doesn’t like your thing."}, {"1b9a": "I’m not sure that the audience for the prescriptive program will sign on for the bulk of the narrative/background information chapters, and the overall tone is rather more dramatic and negative than many may want."}, {"7629": "Sometimes they have the same criticisms of your thing, but occasionally you hear something new. Your thing needs dots. Or an extra arm. Or a different tone of voice. Each time they say something, it feels like you are drinking from a bottle of poison."}, {"ee44": "Yes, this manuscript is reminiscent of [famous author’s] work, but unfortunately I don’t think the writing here is at the same high level as [famous author]."}, {"9cd7": "Eventually it hurts less. You barely notice it at first, but soon you can’t deny it. You nod along as yet another gatekeeper slowly pulls off the arms and legs of your thing and it lies, bleeding and writing on the floor."}, {"79ff": "You start to resent your thing. The uncomplicated love is gone, replaced by an growing anger. You don’t allow yourself to think back to the early days before the pain, and the pain, and the pain."}, {"2996": "Me and my manuscript? (http://nextchapteraddiction.com/working-through-resentment/)"}, {"10a5": "You were so naive to think that your thing was special. Of course it wasn’t. Of course it was doomed to fail."}, {"070d": "Be patient and stubborn, your wise friend reminds you."}, {"ec3f": "You finally learn to protect your thing. You do not let the criticism affect your love for it."}, {"8167": "Scar Tissue"}, {"0acb": "Another important lesson emerges. Falling in love is easy. Anyone can do that. But it’s also easy to keep falling all the way through love and out the other end when things get tough. So you work hard to evolve your original perspective into something more robust that can withstand some solid blows."}, {"7b81": "You learn to ignore the small-minded comments. You learn to exploit each criticism as an opportunity to remind yourself why you created the thing in the first place. You try to picture its beauty as you once saw it. Like clean sheets or fresh snow."}, {"c30b": "Still, no one likes your thing. There is no opportunity to celebrate, no big check or fancy approval letter. No happy ending."}, {"545c": "Why are you smiling, then? Because you own rejection. Rejection doesn’t own you. Now you live the mantra of your wise friend."}, {"51ae": "Be patient and stubborn."}], "content": "Getting Rejected I wrote a book. A good book. Actually, a great book. About how and why we are all so distracted, and what to do about. That’s great, right? The tens of thousands of words are written, rewritten, and rewritten again. Chapters have been moved, refined, and moved back. Themes clarified, and footnotes added. After hundreds of hours of work, the manuscript is polished. Gleaming, really. And I rejoiced! How it feels when you finish a manuscript Unfortunately for me, none of the traditional publishers want to release it to the world. Each one has passed, often without the courtesy of an explanation. My agent — who read the entire thing the first time he saw it — is confused, but optimistic. He wants to find the right publisher, and he knows it can be a long process. But that isn’t how I feel. I’m crushed. Deflated. My heart feels tight every time I think about the massive investment I made in this book, and the very real possibility that it won’t ever be published. How it feels when that manuscript is rejected There are many ways to reject a book Being rejected hurts. I’m sure the publishers are all nice people, but that doesn’t help me deal with my pain and frustration. They all have a different excuse. I actually wish they were more consistent, or more critical. Instead I received a shotgun blast of rubber pellets to the chest. A wide shot group of non-lethal wounds. Here is a taste of the responses: I liked this project quite a bit, but unfortunately its content overlaps somewhat with a few other books on our list. This is an interesting project, but I’m afraid I didn’t catch a strong enough vision to make an offer. Even though I like this, I think we are going to have a hard time making it stand out. William is definitely on to something but I think it’s a little too early in his platform development around the [book’s] message for me to pursue. And there were many more. How many of you can identify with the feeling I have as I reread these? Can you feel the same deep anxiety and fear? The nagging feeling that each of them is right? That the book just isn’t that good? That I’m just not that good? (http://gauthereaugroup.com/not-good-enough-big-lie/) That I should just give up? A Great Work Imagine there is a thing that you really care about. This beautiful, delicate thing that connects to your heart in a deep and profound way. You want to see this thing grow and thrive. Not for your sake, but simply because you love it. You know it can be a blessing to others, to the world. You see people struggling: lost, overwhelmed, and afraid. The thing you made can help them. “Take it!” you want to shout. “This is what you’re looking for! This is what you need!” But it’s not so simple. Some other people need to agree with you first. The gatekeepers. You have to take your thing — your precious thing — and hand it over to these gatekeepers. It’s so delicate, so fragile. You don’t want to leave it in their rough hands. You’re afraid of what they will do to it, and what that will mean to you. Protecting your dream (https://rowanjanuary.wordpress.com/tag/theme/) And the worst happens. These other people do not love the thing you made. They would prefer something else. Perhaps they want a smaller thing, or a bigger thing. Or a louder thing, or a quieter thing. Darker, or lighter. Longer. Shorter. So what do these other people do while you stand there clenching your fists? They slowly — surgically — kill your thing. They lift it up and point out its flaws. They poke its most vulnerable spots, and you shudder. I love how timely and thoughtful this project is, but in the end I didn’t feel the approach was accessible for the average reader as I would like to see, for our list. So despite everything going for it (and how much I personally need it!) I’m going to have to bow out for us. They poke you again. It felt to me like there was an article’s worth of sharp ideas tucked inside a book’s worth of material, and even that set of sharp ideas didn’t feel to me to be transformative in their power. You feel physically sick. You want to curl up in a ball. But you just stand there and listen, a pale smile on your stupid face. They keep talking, carelessly handling your thing. It’s an afterthought now, something they won’t ever use. The thing is dead to them, and so are you. Layers of Pain You have a wise friend, and thank God you do. She is there to offer you advice. To let your tears darken her clothes. Be patient and stubborn, your wise friend says. She would know. She’s been here before and seen this happen many times. She knows how painful it is for you, but she also knows that the pain is yours alone. She doesn’t try to take it away from you. That wouldn’t be right, or fair. Now you start to feel a little better. After all, that was just one other person, right? There are many other people who could help you spread your thing to the rest of the world. So you find more of them with the help of your friend. And each of them — every single one of them — doesn’t like your thing. I’m not sure that the audience for the prescriptive program will sign on for the bulk of the narrative/background information chapters, and the overall tone is rather more dramatic and negative than many may want. Sometimes they have the same criticisms of your thing, but occasionally you hear something new. Your thing needs dots. Or an extra arm. Or a different tone of voice. Each time they say something, it feels like you are drinking from a bottle of poison. Yes, this manuscript is reminiscent of [famous author’s] work, but unfortunately I don’t think the writing here is at the same high level as [famous author]. Eventually it hurts less. You barely notice it at first, but soon you can’t deny it. You nod along as yet another gatekeeper slowly pulls off the arms and legs of your thing and it lies, bleeding and writing on the floor. You start to resent your thing. The uncomplicated love is gone, replaced by an growing anger. You don’t allow yourself to think back to the early days before the pain, and the pain, and the pain. Me and my manuscript? (http://nextchapteraddiction.com/working-through-resentment/) You were so naive to think that your thing was special. Of course it wasn’t. Of course it was doomed to fail. Be patient and stubborn, your wise friend reminds you. You finally learn to protect your thing. You do not let the criticism affect your love for it. Scar Tissue Another important lesson emerges. Falling in love is easy. Anyone can do that. But it’s also easy to keep falling all the way through love and out the other end when things get tough. So you work hard to evolve your original perspective into something more robust that can withstand some solid blows. You learn to ignore the small-minded comments. You learn to exploit each criticism as an opportunity to remind yourself why you created the thing in the first place. You try to picture its beauty as you once saw it. Like clean sheets or fresh snow. Still, no one likes your thing. There is no opportunity to celebrate, no big check or fancy approval letter. No happy ending. Why are you smiling, then? Because you own rejection. Rejection doesn’t own you. Now you live the mantra of your wise friend. Be patient and stubborn. ", "child": "599_1\t599_2\t599_3\t599_4"}