{"name": "600", "parent": "", "title": "The Secret To Your Self-Motivation Lies In This Surprising Science-Backed Habit", "sentences": [{"ed78": "The Secret To Your Self-Motivation Lies In This Surprising Science-Backed Habit"}, {"c45f": "Neuroscience has discovered the remarkably simple source for endless self-motivation."}, {"5c1b": "We can do anything we set our minds to. But sometimes it can feel like our brains are working against us when it comes to achieving our goals."}, {"079d": "Plans to learn a new skill, get in shape, or to save money and start a business, keep getting pushed back in the hopes that Future You will handle it “someday.”"}, {"8994": "It’s a crippling behavioral cycle. In fact, in psychology, procrastination is classified as a form of self-sabotage."}, {"416f": "But there’s good news. While learning how to become self-motivated may feel difficult or nebulous, the potential solution is remarkably simple, according to Psychology Today and cognitive neuroscience."}, {"24de": "In their findings, a psychology professor at Harvard University, Ron Siegel, suggested that the key to following through on motivation boils down to this: bring optimism and fun back into the picture."}, {"6846": "This sounds a little hokey, right? After all, completing a term paper or your taxes isn’t exactly fun."}, {"0f6b": "While this habit seems anything but scientific, the neurological reasons behind it aren’t."}, {"493b": "According to the research, the reason we procrastinate on our ambitions lies in our primal psychology:"}, {"b004": "“Our modern brains are still wired up for the ancient evolutionary purpose of surviving in a dangerous environment. Over a million years or so, we developed specialized neural structures that selectively tuned in to danger signals.”"}, {"7d54": "So when the time comes for us to create and be productive, instead of focusing on the pleasurable and rewarding aspects of obtaining our goals, our brains dwell on the anxiety and fear that comes along with doing something new or putting ourselves out there, or daring to fail."}, {"cbf0": "We go into survival mode and push away potentially uncomfortable situations. In fact, optimism and fun are relatively new concepts for our brain, evolutionarily speaking."}, {"54ee": "However, there are a few extremely easy methods you can do to make creating and achieving your dreams feel effortless and fulfilling:"}, {"dab0": "Tip the scale in your favor"}, {"b1d2": "Siegel suggests one simple way to snap out of a self-motivation rut is to write out a list and get the joys of doing something to outweigh the initial pangs of getting started."}, {"b4aa": "A simple two-columned pros and cons list will do just the trick. Yep, while doing that Excel spreadsheet at work might not be fun, you’ll realize that being able to enjoy your weekend without it hanging over your head is well worth it."}, {"6062": "While this method is effective in itself, the next step is what really drives this technique home:"}, {"edb5": "Visualize a full-body experience"}, {"9747": "As you write out your list, really try to visualize and conjure up the precise feelings and sensations that meeting your goal will bring you."}, {"fb1e": "If your goal is to follow a healthier diet, for example, try to viscerally picture how you will feel from the results. Think about how you’ll have more energy, or better skin, or how you’ll protect yourself from heart disease."}, {"2f11": "Mentally walking yourself through the process of success and the joys and benefits it brings can teach your brain to be motivated by something other than fear."}, {"adfb": "Visualization is scientifically proven to increase your odds of successfully reaching your goals. In another article, Psychology Today reports that “research has revealed that mental practices are almost effective as true physical practice, and that doing both is more effective than either alone.”"}, {"00e3": "Reward your progress"}, {"05cc": "For this one you might be thinking, “But I’m not a kid. I don’t need to be rewarded every time I do something.”"}, {"52b7": "However, going back to Professor Siegel’s point, one of the most critical aspects of sustainable self-motivation is pleasure and joy, and a reward system is a fantastic way to help accomplish this."}, {"fd71": "Not only is rewarding yourself for reaching goals a good self-care technique, it also changes the chemistry of our brains and can make us more motivated."}, {"c313": "In a study that compared motivated people’s brains to lazy people’s brains, dopamine levels in a certain area of the brain played a large role in people’s ability to be self-motivated. Turns out dopamine is released in anticipation of a reward, and rewarding yourself for accomplishments can help you stay on track."}, {"1805": "Choose the right rewards"}, {"77fc": "Just because positive motivation works, don’t make the mistake of self-sabotaging your wins with counter-productive prizes, like spending lavishly. As LifeHacker put it, “if the rewards you give yourself undermine the goal itself, it only serves to set you back.”"}, {"12d5": "Remember, investing in yourself is the greatest gift you can give yourself. The new “I deserve it” should be something that continues to reward you for years, rather than punishing you after the novelty wears off."}, {"f9b7": "Everything from taking an exciting class to setting money aside for future endeavors can be fun — yet productive — ways to stay self-motivated. You’re doing something great for yourself by investing in your future. That is something to feel fantastic about!"}, {"fd73": "Celebrate the tiny wins"}, {"b360": "Like most people on the pathway to success, you probably have major — hopefully audacious — long-term goals that you’re tackling. But as you probably know, these huge aspirations won’t get accomplished overnight."}, {"a2f2": "That’s why you should find the time to make a symbolic fist pump every day. As Tech.Co co-founder Frank Gruber put it, “This is a journey — a hard one — and the only way to make it sustainable and bearable is if you actually acknowledge your small successes along the way.”"}, {"361e": "By celebrating those tiny wins, you’ll find a much-needed daily dose of self-motivation."}, {"36aa": "As long as you’re focusing on the fun, rewarding, sensory experiences of accomplishing your goals, you will get through the hard work eventually."}, {"77f7": "Call to action"}, {"42fa": "If you liked these tips, check out my website for more, and follow me on Medium."}, {"07ab": "If you have any tips on self-motivation, I’d love to hear them."}], "content": "The Secret To Your Self-Motivation Lies In This Surprising Science-Backed Habit Neuroscience has discovered the remarkably simple source for endless self-motivation. We can do anything we set our minds to. But sometimes it can feel like our brains are working against us when it comes to achieving our goals. Plans to learn a new skill, get in shape, or to save money and start a business, keep getting pushed back in the hopes that Future You will handle it “someday.” It’s a crippling behavioral cycle. In fact, in psychology, procrastination is classified as a form of self-sabotage. But there’s good news. While learning how to become self-motivated may feel difficult or nebulous, the potential solution is remarkably simple, according to Psychology Today and cognitive neuroscience. In their findings, a psychology professor at Harvard University, Ron Siegel, suggested that the key to following through on motivation boils down to this: bring optimism and fun back into the picture. This sounds a little hokey, right? After all, completing a term paper or your taxes isn’t exactly fun. While this habit seems anything but scientific, the neurological reasons behind it aren’t. According to the research, the reason we procrastinate on our ambitions lies in our primal psychology: “Our modern brains are still wired up for the ancient evolutionary purpose of surviving in a dangerous environment. Over a million years or so, we developed specialized neural structures that selectively tuned in to danger signals.” So when the time comes for us to create and be productive, instead of focusing on the pleasurable and rewarding aspects of obtaining our goals, our brains dwell on the anxiety and fear that comes along with doing something new or putting ourselves out there, or daring to fail. We go into survival mode and push away potentially uncomfortable situations. In fact, optimism and fun are relatively new concepts for our brain, evolutionarily speaking. However, there are a few extremely easy methods you can do to make creating and achieving your dreams feel effortless and fulfilling: Tip the scale in your favor Siegel suggests one simple way to snap out of a self-motivation rut is to write out a list and get the joys of doing something to outweigh the initial pangs of getting started. A simple two-columned pros and cons list will do just the trick. Yep, while doing that Excel spreadsheet at work might not be fun, you’ll realize that being able to enjoy your weekend without it hanging over your head is well worth it. While this method is effective in itself, the next step is what really drives this technique home: Visualize a full-body experience As you write out your list, really try to visualize and conjure up the precise feelings and sensations that meeting your goal will bring you. If your goal is to follow a healthier diet, for example, try to viscerally picture how you will feel from the results. Think about how you’ll have more energy, or better skin, or how you’ll protect yourself from heart disease. Mentally walking yourself through the process of success and the joys and benefits it brings can teach your brain to be motivated by something other than fear. Visualization is scientifically proven to increase your odds of successfully reaching your goals. In another article, Psychology Today reports that “research has revealed that mental practices are almost effective as true physical practice, and that doing both is more effective than either alone.” Reward your progress For this one you might be thinking, “But I’m not a kid. I don’t need to be rewarded every time I do something.” However, going back to Professor Siegel’s point, one of the most critical aspects of sustainable self-motivation is pleasure and joy, and a reward system is a fantastic way to help accomplish this. Not only is rewarding yourself for reaching goals a good self-care technique, it also changes the chemistry of our brains and can make us more motivated. In a study that compared motivated people’s brains to lazy people’s brains, dopamine levels in a certain area of the brain played a large role in people’s ability to be self-motivated. Turns out dopamine is released in anticipation of a reward, and rewarding yourself for accomplishments can help you stay on track. Choose the right rewards Just because positive motivation works, don’t make the mistake of self-sabotaging your wins with counter-productive prizes, like spending lavishly. As LifeHacker put it, “if the rewards you give yourself undermine the goal itself, it only serves to set you back.” Remember, investing in yourself is the greatest gift you can give yourself. The new “I deserve it” should be something that continues to reward you for years, rather than punishing you after the novelty wears off. Everything from taking an exciting class to setting money aside for future endeavors can be fun — yet productive — ways to stay self-motivated. You’re doing something great for yourself by investing in your future. That is something to feel fantastic about! Celebrate the tiny wins Like most people on the pathway to success, you probably have major — hopefully audacious — long-term goals that you’re tackling. But as you probably know, these huge aspirations won’t get accomplished overnight. That’s why you should find the time to make a symbolic fist pump every day. As Tech.Co co-founder Frank Gruber put it, “This is a journey — a hard one — and the only way to make it sustainable and bearable is if you actually acknowledge your small successes along the way.” By celebrating those tiny wins, you’ll find a much-needed daily dose of self-motivation. As long as you’re focusing on the fun, rewarding, sensory experiences of accomplishing your goals, you will get through the hard work eventually. Call to action If you liked these tips, check out my website for more, and follow me on Medium. If you have any tips on self-motivation, I’d love to hear them. ", "child": "600_1\t600_2\t600_3\t600_4\t600_5\t600_6\t600_7\t600_8\t600_9\t600_10\t600_11\t600_12\t600_13\t600_14\t600_15\t600_16\t600_17\t600_18\t600_19\t600_20\t600_21\t600_22\t600_23\t600_24\t600_25"}