{"name": "612", "parent": "", "title": "Fraude", "sentences": [{"b1f7": "Fraude"}, {"1a38": "Rara vez me arrepiento de lo que escribo. A veces pienso, sí, que no escribiría tal o cual cosa de nuevo, pero comprendo que cada texto es producto de sus circunstancias. Mis circunstancias."}, {"a312": "Aún así, hay ciertos textos que me persiguen. Uno de ellos es este que escribí en 2014. Básicamente, narra una experiencia que tuve con un fraude en Facebook. Recibí un mensaje de una amiga de la universidad, con quien tenía tiempo de hablar, pidiéndome dinero para una emergencia. Sin chistar, le deposité. Fueron 300 pesos, nada oneroso en realidad."}, {"01f3": "Más tarde, descubrí que el perfil había sido clonado y que me habían estafado. Seguí mi lógica y conseguí el nombre del defraudador (solo tuve que depositar diez pesos en su cuenta y leer el nombre en el recibo). Lo busqué por Facebook y, después de un par de días buscando, di con su paradero. Al final, terminamos conversando y él me devolvió el dinero. Yo, ufano de mi hazaña, lo compartí al mundo en un blog que leen un millón de personas al mes."}, {"c7bf": "Grave error."}, {"a7b0": "Aunque mi intención era exponer el modus operandi de mi estafador, el artículo es uno de los primero resultados en Google al buscar “fraude Facebook”. Eso hace que cada semana o dos, me llegue un mensaje privado en mis redes sociales pidiéndome ayuda, desde gente que ha sido estafada comprando un teléfono en Facebook hasta ropa de Forever 21. Debo haber recibido ya medio centenar en estos años."}, {"37fd": "(Hoy, claro está, me llegó otro de esos mensajes.)"}, {"3d6e": "Lo que me frustra es que no hay mucho que yo pueda hacer, salvo recomendarles a las personas afectadas acudir a la Policía Cibernética de su localidad y levantar una denuncia ante el Ministerio Público."}, {"9896": "(Lo recordé también cuando leí cómo defraudaron a la gente de Animal Político cuando quiso comprar tamales en línea para el Día de la Candelaria. Supongo que todos somos susceptibles de caer en el engaño.)"}, {"d531": "No me gustaría borrar ese texto; tan solo, que hubiera mejores mecanismos para reportar un fraude en línea, que hubiera más información disponible, que hubiera menos vivos dispuestos a fregarse al prójimo. Quisiera, tal vez, que me dejara de perseguir esa sensación de síndrome de sobreviviente: porque por cada uno como yo, con un final relativamente feliz, no sé –no quiero pensar– cuántas historias terminan en agobio, en dinero esfumado y en un palmo de narices."}, {"0661": "Carajo."}], "content": "Fraude Rara vez me arrepiento de lo que escribo. A veces pienso, sí, que no escribiría tal o cual cosa de nuevo, pero comprendo que cada texto es producto de sus circunstancias. Mis circunstancias. Aún así, hay ciertos textos que me persiguen. Uno de ellos es este que escribí en 2014. Básicamente, narra una experiencia que tuve con un fraude en Facebook. Recibí un mensaje de una amiga de la universidad, con quien tenía tiempo de hablar, pidiéndome dinero para una emergencia. Sin chistar, le deposité. Fueron 300 pesos, nada oneroso en realidad. Más tarde, descubrí que el perfil había sido clonado y que me habían estafado. Seguí mi lógica y conseguí el nombre del defraudador (solo tuve que depositar diez pesos en su cuenta y leer el nombre en el recibo). Lo busqué por Facebook y, después de un par de días buscando, di con su paradero. Al final, terminamos conversando y él me devolvió el dinero. Yo, ufano de mi hazaña, lo compartí al mundo en un blog que leen un millón de personas al mes. Grave error. Aunque mi intención era exponer el modus operandi de mi estafador, el artículo es uno de los primero resultados en Google al buscar “fraude Facebook”. Eso hace que cada semana o dos, me llegue un mensaje privado en mis redes sociales pidiéndome ayuda, desde gente que ha sido estafada comprando un teléfono en Facebook hasta ropa de Forever 21. Debo haber recibido ya medio centenar en estos años. (Hoy, claro está, me llegó otro de esos mensajes.) Lo que me frustra es que no hay mucho que yo pueda hacer, salvo recomendarles a las personas afectadas acudir a la Policía Cibernética de su localidad y levantar una denuncia ante el Ministerio Público. (Lo recordé también cuando leí cómo defraudaron a la gente de Animal Político cuando quiso comprar tamales en línea para el Día de la Candelaria. Supongo que todos somos susceptibles de caer en el engaño.) No me gustaría borrar ese texto; tan solo, que hubiera mejores mecanismos para reportar un fraude en línea, que hubiera más información disponible, que hubiera menos vivos dispuestos a fregarse al prójimo. Quisiera, tal vez, que me dejara de perseguir esa sensación de síndrome de sobreviviente: porque por cada uno como yo, con un final relativamente feliz, no sé –no quiero pensar– cuántas historias terminan en agobio, en dinero esfumado y en un palmo de narices. Carajo. ", "child": "612_1"}