{"name": "614", "parent": "", "title": "11 Ways to Hack the LinkedIn Pulse Algorithm", "sentences": [{"be53": "11 Ways to Hack the LinkedIn Pulse Algorithm"}, {"6f60": "Why do you blog? You want your content to be discovered and read by as many people as possible, right?"}, {"dd99": "But often your reach is limited. You’re limited by the size of your existing audience."}, {"c9a8": "Every day, people are bombarded with more content than they will ever have time to read. Most people are both incredibly busy and have the attention span of a goldfish (guilty on both counts!)."}, {"252b": "So how do you make your content go further and make sure lots of people read your stuff?"}, {"eb0e": "LinkedIn Pulse can help you do just that."}, {"9840": "What Is LinkedIn Pulse?"}, {"48d0": "LinkedIn Pulse is LinkedIn’s version of a personalized newsfeed. It is also available as a standalone app. Pulse allows users to see the biggest headlines and read top industry news of the day."}, {"6f1e": "According to recent figures, LinkedIn has more than 1 million publishers; more than 150,000 posts are published every week; and the average post reaches LinkedIn members in 21 industries and nine countries."}, {"3dcb": "You’ll see a mix of curated content on LinkedIn Pulse:"}, {"8371": "We’ll focus on the third type of content for the remainder of this post."}, {"f286": "Why You Should Use LinkedIn Pulse"}, {"c02c": "You should publish posts on LinkedIn for the same reason you publish content on your own site as well as third-party publications and blogs like Medium."}, {"ce13": "Exposure."}, {"61f7": "If you’re going to invest time and money in creating content, you want it to be consumed."}, {"5daa": "By publishing content on LinkedIn, you’re increasing the odds that more people will discover and read your content."}, {"f2c1": "However, finding success on LinkedIn Pulse, like any other channel, requires a strategy."}, {"a3d5": "You’ll also have to put in the needed time and effort to make your investment worthwhile."}, {"2406": "Depending on how many connections you have, the posts you publish on LinkedIn can easily get anywhere from a few hundred to a few thousands views, on average."}, {"23c5": "But sometimes LinkedIn articles become unicorns — they can get 50,000, 100,000, or even millions of views."}, {"31a0": "Wish you could get that many views? You can!"}, {"6a4b": "Here are 11 hacks to help your content blast off like a rocket on LinkedIn Pulse."}, {"2f9c": "1. Keep Your Titles Short"}, {"c93e": "If your headline is too long, LinkedIn might truncate your title. That means people who are scrolling through the app or their newsfeeds will see only part of your headline."}, {"9305": "Make your headline as concise as possible without neglecting important headline elements that increase clicks — such as using the right keywords, an emotional hook, and a promise (i.e., telling readers what they’ll get out of reading your post)."}, {"1026": "2. Use an Eye-Catching Image"}, {"70db": "If your headline fails to do the trick, the second most important element that can persuade readers to click is your article image."}, {"9f9c": "Definitely avoid using boring images in your content, such as:"}, {"7e34": "Here’s a great example of an eye-catching image:"}, {"40a9": "Now that’s an image that stands out from the rest and makes we want to click!"}, {"4010": "3. Grow Your LinkedIn Connections"}, {"6e8a": "Every time you publish a post on LinkedIn, your connections will see an alert in their notifications."}, {"dd69": "But to really make ripples, you need a large audience of first-level connections."}, {"beee": "For any of the stuff we’re talking about throughout this post to really work, you’ll need to make as many connections as you possibly can."}, {"9028": "This means improving your LinkedIn profile (to sell yourself to potential connections) and expanding your LinkedIn network (this includes connecting to people you know as well as people you don’t yet know)."}, {"af51": "Here’s how to write the perfect LinkedIn connection request."}, {"5ac7": "4. Publish Frequently"}, {"d787": "LinkedIn is a bit of a numbers game. You can’t just publish a post once every six months. That won’t help you."}, {"6490": "I publish at least twice a week, usually on Tuesdays and Thursdays. You should probably only publish on weekdays during work hours — LinkedIn is a professional network, so not much happens after hours or on the weekends."}, {"7b97": "My whole LinkedIn Pulse strategy is powered 100 percent by republished and syndicated content. I’ve never once originated a single piece just for LinkedIn."}, {"7006": "Don’t worry about duplicate content issues or the potential impact on organic search rankings if you pursue a content repurposing strategy. As long as you make it clear the article has been published before with a note that links to the original article, Google is good at figuring out which is the original source and which is the copy."}, {"726c": "5. Get Featured on Channels"}, {"4b0d": "LinkedIn Pulse has more than 100 individual channels. Some of the most popular channels are for Leadership & Management, Big Ideas & Innovation, Technology, Entrepreneurship, and Social Media."}, {"5b26": "Getting your posts featured in one of these channels is essential to success. Pulse exposes your content to a massive audience."}, {"8ca5": "At most, you can have 25,000 connections on LinkedIn (though most people don’t come anywhere close to this number). But these Pulse channels have millions of followers."}, {"ad99": "If you want a post you’re writing to get featured in Social Media (and potentially be read by those 14 million channel followers), then spend some time looking at what types of stories get featured. Figure out what types of article you need to publish if you want a shot at being featured."}, {"d35d": "6. Do Some Old-School SEO"}, {"fecf": "Content optimization is one super simple way to help get your content featured on a Pulse Channel."}, {"5770": "To categorize your content, LinkedIn Pulse does an analysis of the text of your article."}, {"d62a": "This is like SEO tactics of the dark ages, when all you had to do was include your keyword in the title and use the right words a few times throughout the post."}, {"a44d": "7. Ask a Pulse Editor to Feature Your Story"}, {"ba1b": "Want to get a story featured on LinkedIn Pulse? Then you’ll have to tweet at them."}, {"6c99": "Yes, seriously, you’ll need to head to Twitter to get something featured on LinkedIn."}, {"0e6c": "All you have to do is send a friendly tweet to @LinkedInPulse. Like so:"}, {"2402": "8. Give Your Post a Paid Boost"}, {"c0e6": "Although getting your post featured on a Channel is awesome, it isn’t enough. You need to help your post go red hot."}, {"2d2a": "After your content gets attached to the channel, you need to quickly drive lots of traffic to it. This will help push your post to top of channel, as opposed to being just listed on the channel in fifth position (or wherever it ends up being shown)."}, {"a016": "You have to get to the top spot. How?"}, {"296e": "Spend a few bucks (no more than $50) on Facebook and Twitter promoted posts. This will help quickly drive lots of traffic to your LinkedIn post."}, {"984b": "The LinkedIn Pulse algorithm will reward your content if your post generates a bunch of traffic and engagement within a few minutes."}, {"61ec": "The best part? You don’t have to pay to drive traffic for long. The social media ads will simply act as a catalyst."}, {"1234": "Once your social media ads have helped your article get to the top, the traffic will be self-sustaining for a while as LinkedIn’s users go to their favorite Channel to see what’s trending."}, {"249c": "9. Promote Your LinkedIn Page"}, {"25df": "Although you’re limited to having 25,000 connections on LinkedIn, there is no limit on how many followers you can have."}, {"4ea1": "What you should do is promote your LinkedIn page from other pieces of content."}, {"b933": "For example, are you linking to your LinkedIn profile from your Twitter profile? That’s just one way you can help amplify your LinkedIn presence."}, {"3a85": "Think about it: you’re getting thousands of profile visits on Twitter every month. Even if only a small percentage of those click on the link to your LinkedIn profile, it increase the odds of further amplification on the network."}, {"d2be": "10. Repost Content"}, {"4f8a": "LinkedIn won’t penalize you for reusing the same content you’ve already published on their platform. There are no duplicate content filters."}, {"503e": "If a post you published didn’t generate any engagement a few months ago, and you think it should have done much better, why not publish it again?"}, {"4c1c": "There are two things you should change, however: your title and image. Most likely, your old headline was too boring or your image wasn’t interesting. Now you know better!"}, {"6e7b": "11. Only Syndicate Your Unicorns"}, {"9416": "Not every piece of content you write belongs on LinkedIn. So don’t syndicate everything — especially if you’re publishing more than two articles per week around the web."}, {"dffd": "Focus on your best stuff. Only use content that performed remarkably well elsewhere, whether it generated a lot of traffic for your blog or engagement on another social network."}, {"5848": "Your best content has already proven itself on one platform. That means it has a higher probability of doing well on LinkedIn as well."}, {"d12b": "TL;DR"}, {"f157": "If you aren’t yet using LinkedIn as part of your content strategy, you definitely should. Use these 11 hacks to use the LinkedIn Pulse algorithm to your advantage and send your content into outer space."}, {"d7f4": "By the way, one other platform that will help your content go further is Medium. The strategy for getting your content to trend is kind of the same for both places. However, one thing I like a little more about Medium is that it’s more of meritocracy — there are no anointed Influencers."}, {"4f64": "Have you tried LinkedIn Pulse yet? If not, what are you waiting for?!"}], "content": "11 Ways to Hack the LinkedIn Pulse Algorithm Why do you blog? You want your content to be discovered and read by as many people as possible, right? But often your reach is limited. You’re limited by the size of your existing audience. Every day, people are bombarded with more content than they will ever have time to read. Most people are both incredibly busy and have the attention span of a goldfish (guilty on both counts!). So how do you make your content go further and make sure lots of people read your stuff? LinkedIn Pulse can help you do just that. What Is LinkedIn Pulse? LinkedIn Pulse is LinkedIn’s version of a personalized newsfeed. It is also available as a standalone app. Pulse allows users to see the biggest headlines and read top industry news of the day. According to recent figures, LinkedIn has more than 1 million publishers; more than 150,000 posts are published every week; and the average post reaches LinkedIn members in 21 industries and nine countries. You’ll see a mix of curated content on LinkedIn Pulse: We’ll focus on the third type of content for the remainder of this post. Why You Should Use LinkedIn Pulse You should publish posts on LinkedIn for the same reason you publish content on your own site as well as third-party publications and blogs like Medium. Exposure. If you’re going to invest time and money in creating content, you want it to be consumed. By publishing content on LinkedIn, you’re increasing the odds that more people will discover and read your content. However, finding success on LinkedIn Pulse, like any other channel, requires a strategy. You’ll also have to put in the needed time and effort to make your investment worthwhile. Depending on how many connections you have, the posts you publish on LinkedIn can easily get anywhere from a few hundred to a few thousands views, on average. But sometimes LinkedIn articles become unicorns — they can get 50,000, 100,000, or even millions of views. Wish you could get that many views? You can! Here are 11 hacks to help your content blast off like a rocket on LinkedIn Pulse. 1. Keep Your Titles Short If your headline is too long, LinkedIn might truncate your title. That means people who are scrolling through the app or their newsfeeds will see only part of your headline. Make your headline as concise as possible without neglecting important headline elements that increase clicks — such as using the right keywords, an emotional hook, and a promise (i.e., telling readers what they’ll get out of reading your post). 2. Use an Eye-Catching Image If your headline fails to do the trick, the second most important element that can persuade readers to click is your article image. Definitely avoid using boring images in your content, such as: Here’s a great example of an eye-catching image: Now that’s an image that stands out from the rest and makes we want to click! 3. Grow Your LinkedIn Connections Every time you publish a post on LinkedIn, your connections will see an alert in their notifications. But to really make ripples, you need a large audience of first-level connections. For any of the stuff we’re talking about throughout this post to really work, you’ll need to make as many connections as you possibly can. This means improving your LinkedIn profile (to sell yourself to potential connections) and expanding your LinkedIn network (this includes connecting to people you know as well as people you don’t yet know). Here’s how to write the perfect LinkedIn connection request. 4. Publish Frequently LinkedIn is a bit of a numbers game. You can’t just publish a post once every six months. That won’t help you. I publish at least twice a week, usually on Tuesdays and Thursdays. You should probably only publish on weekdays during work hours — LinkedIn is a professional network, so not much happens after hours or on the weekends. My whole LinkedIn Pulse strategy is powered 100 percent by republished and syndicated content. I’ve never once originated a single piece just for LinkedIn. Don’t worry about duplicate content issues or the potential impact on organic search rankings if you pursue a content repurposing strategy. As long as you make it clear the article has been published before with a note that links to the original article, Google is good at figuring out which is the original source and which is the copy. 5. Get Featured on Channels LinkedIn Pulse has more than 100 individual channels. Some of the most popular channels are for Leadership & Management, Big Ideas & Innovation, Technology, Entrepreneurship, and Social Media. Getting your posts featured in one of these channels is essential to success. Pulse exposes your content to a massive audience. At most, you can have 25,000 connections on LinkedIn (though most people don’t come anywhere close to this number). But these Pulse channels have millions of followers. If you want a post you’re writing to get featured in Social Media (and potentially be read by those 14 million channel followers), then spend some time looking at what types of stories get featured. Figure out what types of article you need to publish if you want a shot at being featured. 6. Do Some Old-School SEO Content optimization is one super simple way to help get your content featured on a Pulse Channel. To categorize your content, LinkedIn Pulse does an analysis of the text of your article. This is like SEO tactics of the dark ages, when all you had to do was include your keyword in the title and use the right words a few times throughout the post. 7. Ask a Pulse Editor to Feature Your Story Want to get a story featured on LinkedIn Pulse? Then you’ll have to tweet at them. Yes, seriously, you’ll need to head to Twitter to get something featured on LinkedIn. All you have to do is send a friendly tweet to @LinkedInPulse. Like so: 8. Give Your Post a Paid Boost Although getting your post featured on a Channel is awesome, it isn’t enough. You need to help your post go red hot. After your content gets attached to the channel, you need to quickly drive lots of traffic to it. This will help push your post to top of channel, as opposed to being just listed on the channel in fifth position (or wherever it ends up being shown). You have to get to the top spot. How? Spend a few bucks (no more than $50) on Facebook and Twitter promoted posts. This will help quickly drive lots of traffic to your LinkedIn post. The LinkedIn Pulse algorithm will reward your content if your post generates a bunch of traffic and engagement within a few minutes. The best part? You don’t have to pay to drive traffic for long. The social media ads will simply act as a catalyst. Once your social media ads have helped your article get to the top, the traffic will be self-sustaining for a while as LinkedIn’s users go to their favorite Channel to see what’s trending. 9. Promote Your LinkedIn Page Although you’re limited to having 25,000 connections on LinkedIn, there is no limit on how many followers you can have. What you should do is promote your LinkedIn page from other pieces of content. For example, are you linking to your LinkedIn profile from your Twitter profile? That’s just one way you can help amplify your LinkedIn presence. Think about it: you’re getting thousands of profile visits on Twitter every month. Even if only a small percentage of those click on the link to your LinkedIn profile, it increase the odds of further amplification on the network. 10. Repost Content LinkedIn won’t penalize you for reusing the same content you’ve already published on their platform. There are no duplicate content filters. If a post you published didn’t generate any engagement a few months ago, and you think it should have done much better, why not publish it again? There are two things you should change, however: your title and image. Most likely, your old headline was too boring or your image wasn’t interesting. Now you know better! 11. Only Syndicate Your Unicorns Not every piece of content you write belongs on LinkedIn. So don’t syndicate everything — especially if you’re publishing more than two articles per week around the web. Focus on your best stuff. Only use content that performed remarkably well elsewhere, whether it generated a lot of traffic for your blog or engagement on another social network. Your best content has already proven itself on one platform. That means it has a higher probability of doing well on LinkedIn as well. TL;DR If you aren’t yet using LinkedIn as part of your content strategy, you definitely should. Use these 11 hacks to use the LinkedIn Pulse algorithm to your advantage and send your content into outer space. By the way, one other platform that will help your content go further is Medium. The strategy for getting your content to trend is kind of the same for both places. However, one thing I like a little more about Medium is that it’s more of meritocracy — there are no anointed Influencers. Have you tried LinkedIn Pulse yet? If not, what are you waiting for?! ", "child": "614_1\t614_2\t614_3\t614_4\t614_5\t614_6\t614_7\t614_8\t614_9\t614_10\t614_11\t614_12"}