{"name": "615", "parent": "", "title": "Why swearing isn’t always profanity", "sentences": [{"fe37": "Why swearing isn’t always profanity"}, {"38b9": "Occasionally, I’ll get an email from someone (I’ve been talking about my emails a lot lately, do forgive me) who wishes I’d clean up my rhetoric."}, {"32cd": "I used to get angry at these people. I mean, they don’t HAVE to read my work. So why do they take the time out of their day to draft me an email? There’s a million more things they could read at any given moment online. Why anyone would consume any piece of content they don’t like is beyond me in today’s content-infested world."}, {"a536": "But now I’m seeing that many of them are well-intentioned folks who really like what I have to say and want to share it with a wider audience, but they deem it inappropriate to do so. This frustrates them, so they tell me about it. Which I actually appreciate. Because it means they care. (Or so I think.)"}, {"e4ea": "I let these emails go by until they reach a critical mass where I feel the need to address the topic again here for those who haven’t seen me address it before, as my thoughts about swearing evolve over time."}, {"1646": "So, what the hell? It’s a nice, slow day (besides the fact that we may have a nuclear holocaust over this Easter weekend), so let’s talk about the literary power tool of cussing."}, {"7ad5": "Note: To read a couple pieces about swearing that I love, check out this one from Mark Manson and this one from Dear Coquette."}, {"3300": "Here’s my three and a half cents on swearing, why I do it (sometimes), and why I believe it to not always be the same thing as ‘profanity’."}, {"7b75": "1. This is a blog"}, {"9883": "I know… Statement of the obvious, right? Well, I’m not sure if a lot of people realize that a blog post is far different than an article in USA Today or a piece on FOX News."}, {"de10": "I’m not a Bill O’Reilly or even a Matt Lauer — thankfully. I don’t have a PR team. I’m not polished by a committee or censored by shareholders."}, {"fa3c": "I’m a blog-writer guy. Blogs are real. They’re written by real people with real thoughts, stories, emotions, and musings."}, {"e93d": "My blog is me. I am my blog. This is the art form of blogging. We should realize and embrace this so we know what we’re getting into when we read blogs."}, {"0589": "2. Swearing and I go way back"}, {"0356": "I have a deep background in swearing. My dad was an artist at it. He could string together a sentence, 80% of which was composed of swear words, and it would somehow make sense."}, {"3faa": "I don’t come from a refined, scholarly family. My parents were a couple of farm kids. It’s in my cultural marrow, this swearing thing."}, {"4bfa": "That said, not that I have to (or want to) apologize, but I really don’t cuss much. I’m probably one of the more mild people in my friend group."}, {"d314": "As a writer, I strongly believe one should always use the right word, whatever that may be. And in some instances, there’s nothing better or more fitting than a swear word."}, {"7369": "‘Shit’ is my favorite word"}, {"7a17": "It just is. Always has been. Nothing brightens up a room like the word ‘shit’. It’s just mild enough to be smooth, but direct enough to have an impact. ‘Shit’ is beautiful."}, {"1782": "I write for an adult audience"}, {"b15f": "I really hope no 6-year olds are reading my work. If they are, they shouldn’t be."}, {"a923": "If I was talking to a kindergarten classroom, I’d respect that audience. Same as if I were talking to my late grandmother across the dinner table."}, {"9748": "But this is the internet. Although I could very well be talking to anyone and everyone — if I wrote like that was the case, I’d be writing myself into obscurity."}, {"5b1e": "So I get to/have to choose who I write for here. And that person is either myself or one of my friends (yes, ‘one of’, who will remain unnamed, but it doesn’t matter, because you don’t know them anyways). We enjoy mild to mid-level profanity."}, {"964b": "However, I get that, if used too liberally, there’s a certain point where swearing gets sloppy. Which leads me to my next point…"}, {"1ab3": "Swearing is not always ‘profanity’"}, {"8e79": "Let’s unpack this a little, shall we?"}, {"be53": "Profanity is the quality of being ‘profane’."}, {"e6d7": "‘Profane’ means ‘vulgar’, ‘obscene’, ‘lewd’, and ‘lacking good taste’."}, {"ae04": "There are certain times when anything BUT a swear word is profane, obscene, and lacking good taste."}, {"0ab3": "If I walked up and slapped your kid in front of you for no reason, it would be inappropriate to say anything but, “Hey, fucker” (or some version of that)."}, {"7ba4": "On the other side of that coin, if you told me that you’re having a baby, I’m going to grab you by the shoulders and greet you with an emphatically unapologetic, “Holy shit, that’s fantastic!” (unless your other kid was around, then I’d censor myself)."}, {"8704": "I think what’s more profane than swearing is fakery. I’d rather be faced with someone who swears authentically rather than sensors himself in a fake, ungenuine, self-stifling way."}, {"0191": "I’m not saying you HAVE to swear. I know a small handful of people who’ve seemed to get by without it. But that’s who they are. They’re totally genuine, not putting on a show as a way of manipulating those around them to think that they’re righteous, perfect, God-fearing people."}, {"2c03": "Profanity to me is a disconnection with Self. Whether that results in swearing or not swearing is merely a byproduct of that misalignment."}, {"fb11": "I think what’s more profane than an honest, genuine, well-placed swear word is the nonsense spewing out of most mainstream media channels today. Just saying…"}, {"02d2": "But you’re going to be a minister. And you’re a dad. How COULD you?"}, {"b561": "Don’t worry. I’m not about to get up in front of a congregation and make an ass out of myself. I’m not a total buffoon. Again, there’s the whole ‘understanding your audience’ thing. But after service, at the pub or the coffee shop, all bets are off."}, {"e046": "As far as my fatherhood status goes, I’m treading softly around her now until the concrete dries, but Rory will eventually hear me cuss (she already has, but I’m reeeally careful now because she’s a little sponge). Which is fine with me because I want my daughter to know that I’m not an emotionally empty being."}, {"ce9c": "Here’s something I’ve witnessed: Some of the most spiritual people I’ve ever met use swear words (but are hardly ever profane). Some of the best dads do too."}, {"51e7": "So, here’s to swearing. But profanity can go fuck itself."}, {"64e4": "Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below."}], "content": "Why swearing isn’t always profanity Occasionally, I’ll get an email from someone (I’ve been talking about my emails a lot lately, do forgive me) who wishes I’d clean up my rhetoric. I used to get angry at these people. I mean, they don’t HAVE to read my work. So why do they take the time out of their day to draft me an email? There’s a million more things they could read at any given moment online. Why anyone would consume any piece of content they don’t like is beyond me in today’s content-infested world. But now I’m seeing that many of them are well-intentioned folks who really like what I have to say and want to share it with a wider audience, but they deem it inappropriate to do so. This frustrates them, so they tell me about it. Which I actually appreciate. Because it means they care. (Or so I think.) I let these emails go by until they reach a critical mass where I feel the need to address the topic again here for those who haven’t seen me address it before, as my thoughts about swearing evolve over time. So, what the hell? It’s a nice, slow day (besides the fact that we may have a nuclear holocaust over this Easter weekend), so let’s talk about the literary power tool of cussing. Note: To read a couple pieces about swearing that I love, check out this one from Mark Manson and this one from Dear Coquette. Here’s my three and a half cents on swearing, why I do it (sometimes), and why I believe it to not always be the same thing as ‘profanity’. 1. This is a blog I know… Statement of the obvious, right? Well, I’m not sure if a lot of people realize that a blog post is far different than an article in USA Today or a piece on FOX News. I’m not a Bill O’Reilly or even a Matt Lauer — thankfully. I don’t have a PR team. I’m not polished by a committee or censored by shareholders. I’m a blog-writer guy. Blogs are real. They’re written by real people with real thoughts, stories, emotions, and musings. My blog is me. I am my blog. This is the art form of blogging. We should realize and embrace this so we know what we’re getting into when we read blogs. 2. Swearing and I go way back I have a deep background in swearing. My dad was an artist at it. He could string together a sentence, 80% of which was composed of swear words, and it would somehow make sense. I don’t come from a refined, scholarly family. My parents were a couple of farm kids. It’s in my cultural marrow, this swearing thing. That said, not that I have to (or want to) apologize, but I really don’t cuss much. I’m probably one of the more mild people in my friend group. As a writer, I strongly believe one should always use the right word, whatever that may be. And in some instances, there’s nothing better or more fitting than a swear word. ‘Shit’ is my favorite word It just is. Always has been. Nothing brightens up a room like the word ‘shit’. It’s just mild enough to be smooth, but direct enough to have an impact. ‘Shit’ is beautiful. I write for an adult audience I really hope no 6-year olds are reading my work. If they are, they shouldn’t be. If I was talking to a kindergarten classroom, I’d respect that audience. Same as if I were talking to my late grandmother across the dinner table. But this is the internet. Although I could very well be talking to anyone and everyone — if I wrote like that was the case, I’d be writing myself into obscurity. So I get to/have to choose who I write for here. And that person is either myself or one of my friends (yes, ‘one of’, who will remain unnamed, but it doesn’t matter, because you don’t know them anyways). We enjoy mild to mid-level profanity. However, I get that, if used too liberally, there’s a certain point where swearing gets sloppy. Which leads me to my next point… Swearing is not always ‘profanity’ Let’s unpack this a little, shall we? Profanity is the quality of being ‘profane’. ‘Profane’ means ‘vulgar’, ‘obscene’, ‘lewd’, and ‘lacking good taste’. There are certain times when anything BUT a swear word is profane, obscene, and lacking good taste. If I walked up and slapped your kid in front of you for no reason, it would be inappropriate to say anything but, “Hey, fucker” (or some version of that). On the other side of that coin, if you told me that you’re having a baby, I’m going to grab you by the shoulders and greet you with an emphatically unapologetic, “Holy shit, that’s fantastic!” (unless your other kid was around, then I’d censor myself). I think what’s more profane than swearing is fakery. I’d rather be faced with someone who swears authentically rather than sensors himself in a fake, ungenuine, self-stifling way. I’m not saying you HAVE to swear. I know a small handful of people who’ve seemed to get by without it. But that’s who they are. They’re totally genuine, not putting on a show as a way of manipulating those around them to think that they’re righteous, perfect, God-fearing people. Profanity to me is a disconnection with Self. Whether that results in swearing or not swearing is merely a byproduct of that misalignment. I think what’s more profane than an honest, genuine, well-placed swear word is the nonsense spewing out of most mainstream media channels today. Just saying… But you’re going to be a minister. And you’re a dad. How COULD you? Don’t worry. I’m not about to get up in front of a congregation and make an ass out of myself. I’m not a total buffoon. Again, there’s the whole ‘understanding your audience’ thing. But after service, at the pub or the coffee shop, all bets are off. As far as my fatherhood status goes, I’m treading softly around her now until the concrete dries, but Rory will eventually hear me cuss (she already has, but I’m reeeally careful now because she’s a little sponge). Which is fine with me because I want my daughter to know that I’m not an emotionally empty being. Here’s something I’ve witnessed: Some of the most spiritual people I’ve ever met use swear words (but are hardly ever profane). Some of the best dads do too. So, here’s to swearing. But profanity can go fuck itself. Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below. ", "child": "615_1\t615_2\t615_3\t615_4\t615_5\t615_6\t615_7\t615_8615_1\t615_2\t615_3\t615_4\t615_5\t615_6\t615_7\t615_8"}