{"name": "620", "parent": "", "title": "Improving Political Discourse On Medium Through Membership.", "sentences": [{"4d15": "Improving Political Discourse On Medium Through Membership."}, {"dba2": "Explaining My Reasons For Becoming A Member And The Ideas I Have For Improvement."}, {"0a58": "There is a lot to love about Medium. The platform is functional yet also sleek in it’s design, new yet familiar, and so intuitive that anyone with a new account can begin writing and publishing in a manner of minutes."}, {"c420": "Writing"}, {"2a0b": "The UI for the editor is easily the best I’ve used (aside from Ulysses for Mac and iOS), and is so simple to learn that even my 88 year old grandmother could be writing if she wanted to. Embedded content works seamlessly, and the actual process of publishing and sharing to social media is practically idiot proof."}, {"4259": "Readability"}, {"9f0c": "In addition to excelling when it comes to writing/publishing posts, reading various articles and posts on Medium is an extremely enjoyable experience all on it’s own. The minimalistic magazine-esqe formatting makes articles a pleasure to read. The fonts are gorgeous to look at no matter what the subject matter of a post happens to be about, and the white background is super crisp and clear."}, {"dddf": "Those who criticize the platform oftentimes cite the lack of customization for fonts and whatnot, but I actually think this uniformity in typographical style is actually one of the best decisions ever made by an online writing platform. The new editions layout on the homepage makes the navigation experience exciting without being overwhelming, and will serve the general user population well."}, {"d636": "Criticisms"}, {"278f": "Medium is becoming another political echo chamber for the left, and in the process, has alienated a large segment of potential users"}, {"a951": "Despite all of the great features that Medium has to offer, my biggest criticism of Medium still revolves heavily around the fairly obvious promotion of Anti-Trump and far left wing slanted posts from the staff."}, {"461c": "Look, I understand that Medium is a private company and that the staff can choose to promote what they want. With that being said, this seemingly blatant promotion/put down of one political ideology over another depending on how you look at it, seems to be counterproductive to Medium’s vision for a publishing platform and community with diverse viewpoints on any and every given subject."}, {"05f1": "The truth is that those of us on Medium with even slightly right of center political views oftentimes feel alienated."}, {"2f96": "As a conservative blogger, I don’t often publish original content on here because I honestly don’t see the point in publishing exclusively on a platform that tends to overly promote posts from the opposition. Hopefully that will change soon."}, {"7497": "Making Medium Better Through My Membership"}, {"ec38": "When The Medium Membership Program was first announced back in December of last year, I was fearful that it would turn out to be an overpriced gimmick like YouTube Red. However, upon reading the recent email sent out by Ev Williams, I was inclined to sign up and give it a shot. What changed my mind? Well, it was two specific things that I discovered when reading more about the future of Membership: the affordable subscription cost, and the ability to give direct feedback to the company, thereby improving Medium as both a product and platform. I believe that Membership is a great opportunity for users to put their money where their mouth is, and be a key part of the future of the platform."}, {"b299": "Read Ev’s announcement from January here:"}, {"1b34": "Renewing Medium’s focusWe’ve decided to make some major changes at Medium.blog.medium.com"}, {"fcfd": "My Idea For Improving Political Discourse on Medium And The Truth About Fake News."}, {"be06": "The term “Fake News” has become a major buzzword in our vocabulary since the beginning of the 2016 election cycle. What’s interesting to me is the fact that both political parties have used the term to describe each other’s preferred media outlets. Conservatives label CNN, The New York Times, and The Huffington Post as fake news while liberals simultaneously label Breitbart, InfoWars, Drudge, and Fox News as fake news."}, {"c8ba": "Yet the truth is often somewhere in the middle of both sides."}, {"84ce": "Revamping Medium’s Political Section."}, {"01cf": "Medium can help break through the fake news noise by promoting views from both sides of the political spectrum and allowing readers to make up their own minds on issues. My idea for revamping Medium’s political section includes having a topic listed with links to posts from both conservative and liberal authors clearly labeled. This in turn would help create a dialogue between both sides of the political isle, instead of an endless echo chamber."}, {"86dc": "Other Suggestions For Improving Medium."}, {"fa9f": "Medium is a great platform, and being a contributing Member is the best way to keep improvements coming for years to come. These are just a few ideas that I have so let me know what you think of them."}, {"18ba": "Thanks for reading!"}], "content": "Improving Political Discourse On Medium Through Membership. Explaining My Reasons For Becoming A Member And The Ideas I Have For Improvement. There is a lot to love about Medium. The platform is functional yet also sleek in it’s design, new yet familiar, and so intuitive that anyone with a new account can begin writing and publishing in a manner of minutes. Writing The UI for the editor is easily the best I’ve used (aside from Ulysses for Mac and iOS), and is so simple to learn that even my 88 year old grandmother could be writing if she wanted to. Embedded content works seamlessly, and the actual process of publishing and sharing to social media is practically idiot proof. Readability In addition to excelling when it comes to writing/publishing posts, reading various articles and posts on Medium is an extremely enjoyable experience all on it’s own. The minimalistic magazine-esqe formatting makes articles a pleasure to read. The fonts are gorgeous to look at no matter what the subject matter of a post happens to be about, and the white background is super crisp and clear. Those who criticize the platform oftentimes cite the lack of customization for fonts and whatnot, but I actually think this uniformity in typographical style is actually one of the best decisions ever made by an online writing platform. The new editions layout on the homepage makes the navigation experience exciting without being overwhelming, and will serve the general user population well. Criticisms Medium is becoming another political echo chamber for the left, and in the process, has alienated a large segment of potential users Despite all of the great features that Medium has to offer, my biggest criticism of Medium still revolves heavily around the fairly obvious promotion of Anti-Trump and far left wing slanted posts from the staff. Look, I understand that Medium is a private company and that the staff can choose to promote what they want. With that being said, this seemingly blatant promotion/put down of one political ideology over another depending on how you look at it, seems to be counterproductive to Medium’s vision for a publishing platform and community with diverse viewpoints on any and every given subject. The truth is that those of us on Medium with even slightly right of center political views oftentimes feel alienated. As a conservative blogger, I don’t often publish original content on here because I honestly don’t see the point in publishing exclusively on a platform that tends to overly promote posts from the opposition. Hopefully that will change soon. Making Medium Better Through My Membership When The Medium Membership Program was first announced back in December of last year, I was fearful that it would turn out to be an overpriced gimmick like YouTube Red. However, upon reading the recent email sent out by Ev Williams, I was inclined to sign up and give it a shot. What changed my mind? Well, it was two specific things that I discovered when reading more about the future of Membership: the affordable subscription cost, and the ability to give direct feedback to the company, thereby improving Medium as both a product and platform. I believe that Membership is a great opportunity for users to put their money where their mouth is, and be a key part of the future of the platform. Read Ev’s announcement from January here: Renewing Medium’s focusWe’ve decided to make some major changes at Medium.blog.medium.com My Idea For Improving Political Discourse on Medium And The Truth About Fake News. The term “Fake News” has become a major buzzword in our vocabulary since the beginning of the 2016 election cycle. What’s interesting to me is the fact that both political parties have used the term to describe each other’s preferred media outlets. Conservatives label CNN, The New York Times, and The Huffington Post as fake news while liberals simultaneously label Breitbart, InfoWars, Drudge, and Fox News as fake news. Yet the truth is often somewhere in the middle of both sides. Revamping Medium’s Political Section. Medium can help break through the fake news noise by promoting views from both sides of the political spectrum and allowing readers to make up their own minds on issues. My idea for revamping Medium’s political section includes having a topic listed with links to posts from both conservative and liberal authors clearly labeled. This in turn would help create a dialogue between both sides of the political isle, instead of an endless echo chamber. Other Suggestions For Improving Medium. Medium is a great platform, and being a contributing Member is the best way to keep improvements coming for years to come. These are just a few ideas that I have so let me know what you think of them. Thanks for reading! ", "child": "620_1\t620_2\t620_3\t620_4\t620_5\t620_6620_1\t620_2\t620_3\t620_4\t620_5\t620_6620_1\t620_2\t620_3\t620_4\t620_5\t620_6620_1\t620_2\t620_3\t620_4\t620_5\t620_6620_1\t620_2\t620_3\t620_4\t620_5\t620_6"}