{"name": "625", "parent": "", "title": "These are the world’s most popular websites", "sentences": [{"d92a": "These are the world’s most popular websites"}, {"af5f": "Google isn’t No 1 everywhere in the world. Image: Vodien"}, {"2ef1": "Alex Gray, Formative Content"}, {"e691": "When we surf the web — what are we looking at? Does it change according to where we live?"}, {"d33b": "Alexa.com tracks millions of internet users and compiles lists of the most-visited websites by country, and globally. Unsurprisingly, Google shows up as the most popular site in many parts of the world — but not everywhere."}, {"016f": "Where Google isn’t number 1"}, {"20bd": "If you’re in China, for instance, you’re probably using the leading Chinese search engine Baidu or the most popular messaging platform QQ."}, {"4636": "Or you’re likely to be shopping. The increasingly powerful role of e-commerce in China is reflected in the popularity of Taobao and Tmall (Taobao Mall), both retail sites. They have so many users, in fact, that Taobao also appears in the global top 10 — in 10th place."}, {"e061": "The internet is heavily policed in China, so it’s no surprise that most of the top sites are Chinese. While Google does appear at number 10, it’s a version most in the West wouldn’t recognize."}, {"cd3f": "If you’re in Russia, then you’re most likely to be on VK, a social networking site dubbed “Russia’s Facebook”."}, {"5a16": "In Kazakhstan, Georgia, Cambodia and Algeria, however, YouTube is the most popular site."}, {"cad6": "In the Balkans it’s GazetaExpress, an online media portal. GazetaExpress is not just a news site for locals though, it’s also a trusted source for world media, according to Alexa. It is often referenced as a source of information in reports by the New York Times, Time, the Economist, Associated Press and Reuters."}, {"a336": "Some countries, such as China, have their own search engine that makes the top of their list. Vietnam’s browser, Coc Coc, was set up by a “bunch of geeks”, who say that searching in the Vietnamese language requires a particular kind of search engine. They want to “win over internet users”, and it appears they already have — it’s the country’s top performer."}, {"efe6": "Image: indy100"}, {"0929": "The top 10 most visited sites in the world"}, {"d445": "As the map above shows, Google is easily the world’s most popular site: ranked number 1 across North and South America, Europe, the Middle East and in parts of Africa and Asia."}, {"ad06": "YouTube and Facebook are the next most popular sites."}, {"e482": "China’s Baidu is placed fourth. That’s because, according to the website, China has the world’s largest internet user population — 731 million as of December 2016."}, {"ed52": "Wikipedia and Yahoo are next, and the Indian version of Google is in seventh place. This highlights the fact that the majority of internet use is driven by the search for information."}, {"963b": "We’re also interested in news. Reddit, the American social news aggregator, is in eighth place. While over half of its users are from the US, the British, Canadians, Australians and Germans like it too."}, {"6c51": "Chinese instant messaging site QQ is in ninth place and Taobao in 10th. While most visitors are in China (89.3%), the sites also attract users from Japan, South Korea, the US and Hong Kong."}, {"4371": "Among the top 10, people spend the most time (14 minutes and five seconds) on Reddit, and the least amount on Wikipedia, at four minutes 26 seconds per day."}, {"6875": "Image: Alexa.com"}, {"b2c6": "The top sites lists are calculated using a combination of average daily visitors and pageviews over the past month. The site with the highest combination of visitors and pageviews is ranked in first place."}, {"af9f": "The picture in the US"}, {"a686": "Cloud hosting company Vodien has taken the top 100 sites for the US and colour-coded them."}, {"13c0": "Bright yellow, for instance, represents search engines, bright blue is games and light green retail and e-commerce."}, {"f534": "It shows that, like the global top 10, Google is ever popular. As are Facebook, YouTube, Reddit, Wikipedia and Yahoo."}, {"f890": "Amazon, Twitter, eBay and Netflix, which don’t feature in the global top 10, also appear in the US list."}, {"c2fd": "Image: Vodien"}, {"4997": "Originally published at www.weforum.org."}], "content": "These are the world’s most popular websites Google isn’t No 1 everywhere in the world. Image: Vodien Alex Gray, Formative Content When we surf the web — what are we looking at? Does it change according to where we live? Alexa.com tracks millions of internet users and compiles lists of the most-visited websites by country, and globally. Unsurprisingly, Google shows up as the most popular site in many parts of the world — but not everywhere. Where Google isn’t number 1 If you’re in China, for instance, you’re probably using the leading Chinese search engine Baidu or the most popular messaging platform QQ. Or you’re likely to be shopping. The increasingly powerful role of e-commerce in China is reflected in the popularity of Taobao and Tmall (Taobao Mall), both retail sites. They have so many users, in fact, that Taobao also appears in the global top 10 — in 10th place. The internet is heavily policed in China, so it’s no surprise that most of the top sites are Chinese. While Google does appear at number 10, it’s a version most in the West wouldn’t recognize. If you’re in Russia, then you’re most likely to be on VK, a social networking site dubbed “Russia’s Facebook”. In Kazakhstan, Georgia, Cambodia and Algeria, however, YouTube is the most popular site. In the Balkans it’s GazetaExpress, an online media portal. GazetaExpress is not just a news site for locals though, it’s also a trusted source for world media, according to Alexa. It is often referenced as a source of information in reports by the New York Times, Time, the Economist, Associated Press and Reuters. Some countries, such as China, have their own search engine that makes the top of their list. Vietnam’s browser, Coc Coc, was set up by a “bunch of geeks”, who say that searching in the Vietnamese language requires a particular kind of search engine. They want to “win over internet users”, and it appears they already have — it’s the country’s top performer. Image: indy100 The top 10 most visited sites in the world As the map above shows, Google is easily the world’s most popular site: ranked number 1 across North and South America, Europe, the Middle East and in parts of Africa and Asia. YouTube and Facebook are the next most popular sites. China’s Baidu is placed fourth. That’s because, according to the website, China has the world’s largest internet user population — 731 million as of December 2016. Wikipedia and Yahoo are next, and the Indian version of Google is in seventh place. This highlights the fact that the majority of internet use is driven by the search for information. We’re also interested in news. Reddit, the American social news aggregator, is in eighth place. While over half of its users are from the US, the British, Canadians, Australians and Germans like it too. Chinese instant messaging site QQ is in ninth place and Taobao in 10th. While most visitors are in China (89.3%), the sites also attract users from Japan, South Korea, the US and Hong Kong. Among the top 10, people spend the most time (14 minutes and five seconds) on Reddit, and the least amount on Wikipedia, at four minutes 26 seconds per day. Image: Alexa.com The top sites lists are calculated using a combination of average daily visitors and pageviews over the past month. The site with the highest combination of visitors and pageviews is ranked in first place. The picture in the US Cloud hosting company Vodien has taken the top 100 sites for the US and colour-coded them. Bright yellow, for instance, represents search engines, bright blue is games and light green retail and e-commerce. It shows that, like the global top 10, Google is ever popular. As are Facebook, YouTube, Reddit, Wikipedia and Yahoo. Amazon, Twitter, eBay and Netflix, which don’t feature in the global top 10, also appear in the US list. Image: Vodien Originally published at www.weforum.org. ", "child": "625_1625_1625_1"}