{"name": "627", "parent": "", "title": "Pushing the Black Hat or just Overdoing it", "sentences": [{"f856": "Pushing the Black Hat or just Overdoing it"}, {"e9eb": "Competition is good to a point, until we want success too badly, then unethical behavior or strategies turn “good intentions” into something else."}, {"5881": "So many claims. Big promises made. So much money to be made if only we can get potential customers to believe our offer is the best."}, {"23c6": "YOU’LL NEVER FIND A BETTER OFFER ANYWHERE!!!"}, {"428b": "Lets not forget the chase!"}, {"5909": "What or who are we chasing?"}, {"2208": "People of course! You know, the ones using those keywords in search."}, {"ff3a": "We have tools to help us find those “longtail” keywords, analytics and more search engine optimization or SEO tricks. The Growth Hackers tell us this is crucial to getting visitors to our website and ultimately sales."}, {"7081": "Now, Social Media has become the focus of “Big Data”. Let’s find our potential customer and learn their behaviors, so that we can capitalise on their habits."}, {"060c": "Now, lets convince them that not only do we have just what they need, but that what we have is the best anywhere."}, {"40b8": "Desperate Measures"}, {"77ea": "NO! NO! NO!"}, {"7afc": "Now there’s talk that even the President of the United States can get elected by MANIPULATING SOCIAL MEDIA!!!"}, {"b665": "Frankly, this turns my stomach and crushes my faith in our political system."}, {"694c": "Do we really want “Company Control” of our lives?"}, {"8b4c": "Is this push for “Big Data”, trying to gain a PROFIT doing more harm than good?"}, {"1424": "Where do we draw the line?"}, {"5e14": "Should we separate Social Media from State?"}, {"23f7": "It gets harder and harder for online marketers, with growing competition every day. People using “Black Hat” or unethical means to cheat their way to the top of search results, in hopes of getting the BUCKS. Yes, new “algorithms” are out there to prevent this in search. They aren’t perfect."}, {"e126": "Now, not only search results, but SOCIAL MEDIA."}, {"e72e": "Many times we get discouraged (I know I am), just trying to figure out the game. Even if we don’t practice Black Hat, or think what we do is unethical, consider all the things we do, trying to manipulate people to visit our site and ultimately make that purchase."}, {"89d7": "This is yet another reason I no longer try to promote products and services. It is too easy to get caught up in all the push…push…push, getting someone to that “call to action”."}, {"d792": "I love researching the promises and claims the online offers make, creating questions to match them, then putting those questions in polls. It breaks down all the BS. No email capturing or list building. No need to gather contact information. No “call to action”. I don’t even worry about the polls being scammed because the providers stop repeat voting by blocking tracking cookies and IP addresses."}, {"b625": "Users get to vote “yes” or “no” on any question they feel is appropriate, contribute to helping others make an informed choice, all without sharing any information or logging in. Users can even check the current results using a button that is part of the poll screen."}, {"7b37": "Stop Chasing and Start Producing"}, {"d942": "So what do I recommend you produce?"}, {"2048": "Build trust by staying positive and helpful. Stop trying to manipulate and start looking for ways to help the people in your niche. If you are motivated by doing what you love, are forthright in your conversations and dealings and are transparent, even to the point of owning an embarrassing mistake, you will be seen as trustworthy."}, {"f479": "NOW BE TRUSTWORTHY!"}, {"7b8e": "Learning what your audience needs and helping them meet those needs, while staying consistent may not seem easier, but works just as well as chasing those keywords. It can be hard and trying to understand other people’s interests isn’t easy. I’ve never really mastered it either."}, {"f1d5": "If you feel that using “Big Data” will help, without being too manipulative of your audience and can help you understand what you need to do better, by all means do so. Just don’t expect miracles or big profits, happening “overnight”. Try a little interaction when you see someone needing help, or connect with that positive influencer."}, {"27bf": "Concentrate on Doing Good First!"}, {"fd44": "You may need to learn through failing (tough classes I know). Fear of failing keeps a huge majority of us from success. We just have to keep trying, in business and life. After all, we can’t appreciate joy without first experiencing sorrow. Yes, life is tough and so is Internet Marketing."}, {"20ed": "I haven’t tried to keep track of the number of years spent trying to succeed earning money online. No, I’m not successful at it (yet). But, I’m getting smarter and won’t lose too much money at it (again), chasing something “too good to be true” or spending money on offers that end up not helping any, in spite of the big promises."}, {"706e": "When you finally hear your “inner voice” telling you “this is it”, I hope it matches your heart and that your reason can help you work it out."}, {"b75e": "No, I’m not sorry for all the mistakes made getting me to the point of understanding my niche through going through my own “Heart Break Hotel” (Love Elvis!). When my hard work and faith finally works, I’ll let you know here."}, {"20fd": "It won’t be through using Black Hat or Overdoing promoting an offer on social media. Will I advertise my polls? You Bet!"}, {"aa5e": "I hope this helps bring some focus to your efforts and calls attention to what I see as a very dangerous road we are currently on in politics. No, I’m not a political activist, just a simple “Maniac”, who wants equal rights and equal opportunity for everyone, at the expense of none."}, {"b198": "So, please play fair! Don’t let greed be your first motivation when attempting to earn money online (or get the vote)."}, {"c22e": "My Best to YouArth"}], "content": "Pushing the Black Hat or just Overdoing it Competition is good to a point, until we want success too badly, then unethical behavior or strategies turn “good intentions” into something else. So many claims. Big promises made. So much money to be made if only we can get potential customers to believe our offer is the best. YOU’LL NEVER FIND A BETTER OFFER ANYWHERE!!! Lets not forget the chase! What or who are we chasing? People of course! You know, the ones using those keywords in search. We have tools to help us find those “longtail” keywords, analytics and more search engine optimization or SEO tricks. The Growth Hackers tell us this is crucial to getting visitors to our website and ultimately sales. Now, Social Media has become the focus of “Big Data”. Let’s find our potential customer and learn their behaviors, so that we can capitalise on their habits. Now, lets convince them that not only do we have just what they need, but that what we have is the best anywhere. Desperate Measures NO! NO! NO! Now there’s talk that even the President of the United States can get elected by MANIPULATING SOCIAL MEDIA!!! Frankly, this turns my stomach and crushes my faith in our political system. Do we really want “Company Control” of our lives? Is this push for “Big Data”, trying to gain a PROFIT doing more harm than good? Where do we draw the line? Should we separate Social Media from State? It gets harder and harder for online marketers, with growing competition every day. People using “Black Hat” or unethical means to cheat their way to the top of search results, in hopes of getting the BUCKS. Yes, new “algorithms” are out there to prevent this in search. They aren’t perfect. Now, not only search results, but SOCIAL MEDIA. Many times we get discouraged (I know I am), just trying to figure out the game. Even if we don’t practice Black Hat, or think what we do is unethical, consider all the things we do, trying to manipulate people to visit our site and ultimately make that purchase. This is yet another reason I no longer try to promote products and services. It is too easy to get caught up in all the push…push…push, getting someone to that “call to action”. I love researching the promises and claims the online offers make, creating questions to match them, then putting those questions in polls. It breaks down all the BS. No email capturing or list building. No need to gather contact information. No “call to action”. I don’t even worry about the polls being scammed because the providers stop repeat voting by blocking tracking cookies and IP addresses. Users get to vote “yes” or “no” on any question they feel is appropriate, contribute to helping others make an informed choice, all without sharing any information or logging in. Users can even check the current results using a button that is part of the poll screen. Stop Chasing and Start Producing So what do I recommend you produce? Build trust by staying positive and helpful. Stop trying to manipulate and start looking for ways to help the people in your niche. If you are motivated by doing what you love, are forthright in your conversations and dealings and are transparent, even to the point of owning an embarrassing mistake, you will be seen as trustworthy. NOW BE TRUSTWORTHY! Learning what your audience needs and helping them meet those needs, while staying consistent may not seem easier, but works just as well as chasing those keywords. It can be hard and trying to understand other people’s interests isn’t easy. I’ve never really mastered it either. If you feel that using “Big Data” will help, without being too manipulative of your audience and can help you understand what you need to do better, by all means do so. Just don’t expect miracles or big profits, happening “overnight”. Try a little interaction when you see someone needing help, or connect with that positive influencer. Concentrate on Doing Good First! You may need to learn through failing (tough classes I know). Fear of failing keeps a huge majority of us from success. We just have to keep trying, in business and life. After all, we can’t appreciate joy without first experiencing sorrow. Yes, life is tough and so is Internet Marketing. I haven’t tried to keep track of the number of years spent trying to succeed earning money online. No, I’m not successful at it (yet). But, I’m getting smarter and won’t lose too much money at it (again), chasing something “too good to be true” or spending money on offers that end up not helping any, in spite of the big promises. When you finally hear your “inner voice” telling you “this is it”, I hope it matches your heart and that your reason can help you work it out. No, I’m not sorry for all the mistakes made getting me to the point of understanding my niche through going through my own “Heart Break Hotel” (Love Elvis!). When my hard work and faith finally works, I’ll let you know here. It won’t be through using Black Hat or Overdoing promoting an offer on social media. Will I advertise my polls? You Bet! I hope this helps bring some focus to your efforts and calls attention to what I see as a very dangerous road we are currently on in politics. No, I’m not a political activist, just a simple “Maniac”, who wants equal rights and equal opportunity for everyone, at the expense of none. So, please play fair! Don’t let greed be your first motivation when attempting to earn money online (or get the vote). My Best to YouArth ", "child": "627_1\t627_2"}