{"name": "634", "parent": "", "title": "Google’s Advanced Search Techniques: Search Just Got Easier!", "sentences": [{"a4e2": "Google’s Advanced Search Techniques: Search Just Got Easier!"}, {"06f1": "For digital marketers, there’s magic in numbers."}, {"21c2": "Google has the largest database of user-generated search queries, with a staggering amount of data waiting to be crawled. Google’s advanced search techniques enable us to break up and translate this data into useable information and valuable insight, which we can use to learn about trending topics, successful campaigns, and killer content."}, {"04d5": "As an SEO tech, being able to analyze this data in order to get the pulse of a marketplace is key to managing time, resources, and expectations. Insight as a Service is becoming popular for businesses large and small, so now is a great time to learn more about digging deep into search techniques and data. Let’s dive into some of these advanced techniques, and learn more about the magic behind the numbers that drive SEO."}, {"53a0": "Punctuation & Operators"}, {"ce48": "Advanced search techniques are the methods used to search catalogs, databases and search engines to find information. Within Google’s framework, we can utilize punctuation, or search operators, to get more specific search results. Google has provided a breakdown of some of these advanced search operations. You’re probably already familiar with some of them, but there are several lesser-known ones that have great utility and will make your searches much more productive."}, {"6253": "Punctuation"}, {"fc20": "Boolean Operators: AND & OR"}, {"a3fb": "If you search several words, by default, Google will return results that match both or all of the words in the query. This is referred to as an AND operation, and is automatic when searching multiple words. If you want to search multiple words and would like results that contain any of the words in the query, but not necessarily all of them, you can use an OR operation. For example, you could search “Dr. Jekyll” OR “Mr. Hyde”, and the search results will pull either the phrase Dr. Jekyll or Mr. Hyde. We can even break this down further by using parenthesis. (“Dr. Jekyll” OR “Mr. Hyde”) (“Robert Louis Stevenson”). This means that the search engine will provide search results for either Dr. Jekyll or Mr. Hyde and Robert Louis Stevenson."}, {"c5c5": "Page Title, Content, Site and URL"}, {"b9a0": "Savvy SEOs know how to incorporate popular keywords into a website’s title, content and URL. We use Google Search to look for patterns, popularity and industry trends around targeted keywords."}, {"e7bb": "intitle:"}, {"318b": "This operator restricts results to a website or document title. This is a great method for analyzing popular keywords used in headlines. For example, if you are looking for popular articles on the latest iPhone, you could perform an intitle search like this:"}, {"213f": "intitle:”iPhone” OR “Apple iPhone”"}, {"d60e": "intext:"}, {"3c3d": "If you are not concerned about the title, you can analyze a web page’s content. Staying with the iPhone example, an intext search would look like this:"}, {"3cba": "intext:iPhone"}, {"db44": "site:"}, {"48e9": "We can limit our search results by top level domain or by a website. Here are a couple of examples:"}, {"28a7": "“iPhone 7” site:apple.com — to search the Apple website for the latest iPhone model"}, {"0783": "“hunting permit” site:.gov — to limit our search to a top level domain (.gov, .com, .edu, .net, etc.)."}, {"f5bd": "inurl:"}, {"a5df": "We can also just limit our searches to the URL by analyzing the Domain, Domain extension, folders or file name."}, {"7824": "inurl:iPhone"}, {"e970": "“One of the great responsibilities that I have is to manage my assets wisely, so that they create value.” — Alice Walton"}, {"ca67": "Managing your assets to create value is a difficult task in the world of keywords. Honing in on your audience and cutting out irrelevant, coincidentally-related terms will help you to better define your brand and market. For example, A “conductor” has multiple meanings depending on the context. “Conductor” could refer to an electrical conductor, a musical conductor, a train conductor, and more."}, {"183d": "Seven Competitor Prospecting Query Types"}, {"109e": "Thinking about how a keyword is used in your marketplace is key to finding relevant keywords. Our digital marketing team at Checkmate employs a seven-keyword prospecting analysis for analyzing competition in a marketplace. Let’s use Green Tea as an example illustrate Competitor Prospecting Queries. Below are the seven elements with examples:"}, {"4c9d": "1 — Marketing-Defining Keywords (MDKWs)"}, {"a9a3": "Accurate keywords that describe the search queries that your target market or keywords that describe your industry are MDKWs."}, {"0ec2": "2 — Customer-Defining Keywords (CDKWs)"}, {"821c": "Knowing how your customers refer to themselves will help you discover relevant keywords your target market may identify with, e.g. I do Yoga so I am a Yogi and Yogis love Green Tea."}, {"e3f0": "3- Product/Category Keywords (PCKWs)"}, {"fa99": "These are high-level terms that describe what you sell."}, {"7bfb": "4- Industry Thought Leaders (ITLs)"}, {"6d73": "By analyzing influencers in an industry, we will get insight into who who industry leaders are, public relation topics, and interview opportunities in your marketplace."}, {"01c6": "5- Competing Company Names (CCN)"}, {"85ec": "Competing companies' names give us insight into how reporters, bloggers and customers view leading companies in your industry"}, {"bb0d": "6- GEO Keywords (GKWs)"}, {"186d": "Geo keywords can help find local prospects and complementary products or services that may have an impact on your local market. Always consider your local market; people are more aware than ever of shopping locally."}, {"4bdf": "7- Related Vertical Keywords (RVKWs)"}, {"554b": "Think of your industry as an “ecosystem” that could potentially aid in your research. Thinking along the lines of Green Tea, we could include these keywords that refer to similar products:"}, {"00b6": "When conducting research, be sure to approach it systematically and thoroughly. Alter your queries, research keywords, and figure out what works and what doesn’t within your industry."}, {"85be": "Sources and further reading:"}, {"f246": "The Ultimate Guide to Link Building — by Eric Ward"}, {"beec": "Search Operators — Google"}, {"37f6": "How to find anything Online with Advance Techniques — Bob Flisser"}], "content": "Google’s Advanced Search Techniques: Search Just Got Easier! For digital marketers, there’s magic in numbers. Google has the largest database of user-generated search queries, with a staggering amount of data waiting to be crawled. Google’s advanced search techniques enable us to break up and translate this data into useable information and valuable insight, which we can use to learn about trending topics, successful campaigns, and killer content. As an SEO tech, being able to analyze this data in order to get the pulse of a marketplace is key to managing time, resources, and expectations. Insight as a Service is becoming popular for businesses large and small, so now is a great time to learn more about digging deep into search techniques and data. Let’s dive into some of these advanced techniques, and learn more about the magic behind the numbers that drive SEO. Punctuation & Operators Advanced search techniques are the methods used to search catalogs, databases and search engines to find information. Within Google’s framework, we can utilize punctuation, or search operators, to get more specific search results. Google has provided a breakdown of some of these advanced search operations. You’re probably already familiar with some of them, but there are several lesser-known ones that have great utility and will make your searches much more productive. Punctuation Boolean Operators: AND & OR If you search several words, by default, Google will return results that match both or all of the words in the query. This is referred to as an AND operation, and is automatic when searching multiple words. If you want to search multiple words and would like results that contain any of the words in the query, but not necessarily all of them, you can use an OR operation. For example, you could search “Dr. Jekyll” OR “Mr. Hyde”, and the search results will pull either the phrase Dr. Jekyll or Mr. Hyde. We can even break this down further by using parenthesis. (“Dr. Jekyll” OR “Mr. Hyde”) (“Robert Louis Stevenson”). This means that the search engine will provide search results for either Dr. Jekyll or Mr. Hyde and Robert Louis Stevenson. Page Title, Content, Site and URL Savvy SEOs know how to incorporate popular keywords into a website’s title, content and URL. We use Google Search to look for patterns, popularity and industry trends around targeted keywords. intitle: This operator restricts results to a website or document title. This is a great method for analyzing popular keywords used in headlines. For example, if you are looking for popular articles on the latest iPhone, you could perform an intitle search like this: intitle:”iPhone” OR “Apple iPhone” intext: If you are not concerned about the title, you can analyze a web page’s content. Staying with the iPhone example, an intext search would look like this: intext:iPhone site: We can limit our search results by top level domain or by a website. Here are a couple of examples: “iPhone 7” site:apple.com — to search the Apple website for the latest iPhone model “hunting permit” site:.gov — to limit our search to a top level domain (.gov, .com, .edu, .net, etc.). inurl: We can also just limit our searches to the URL by analyzing the Domain, Domain extension, folders or file name. inurl:iPhone “One of the great responsibilities that I have is to manage my assets wisely, so that they create value.” — Alice Walton Managing your assets to create value is a difficult task in the world of keywords. Honing in on your audience and cutting out irrelevant, coincidentally-related terms will help you to better define your brand and market. For example, A “conductor” has multiple meanings depending on the context. “Conductor” could refer to an electrical conductor, a musical conductor, a train conductor, and more. Seven Competitor Prospecting Query Types Thinking about how a keyword is used in your marketplace is key to finding relevant keywords. Our digital marketing team at Checkmate employs a seven-keyword prospecting analysis for analyzing competition in a marketplace. Let’s use Green Tea as an example illustrate Competitor Prospecting Queries. Below are the seven elements with examples: 1 — Marketing-Defining Keywords (MDKWs) Accurate keywords that describe the search queries that your target market or keywords that describe your industry are MDKWs. 2 — Customer-Defining Keywords (CDKWs) Knowing how your customers refer to themselves will help you discover relevant keywords your target market may identify with, e.g. I do Yoga so I am a Yogi and Yogis love Green Tea. 3- Product/Category Keywords (PCKWs) These are high-level terms that describe what you sell. 4- Industry Thought Leaders (ITLs) By analyzing influencers in an industry, we will get insight into who who industry leaders are, public relation topics, and interview opportunities in your marketplace. 5- Competing Company Names (CCN) Competing companies' names give us insight into how reporters, bloggers and customers view leading companies in your industry 6- GEO Keywords (GKWs) Geo keywords can help find local prospects and complementary products or services that may have an impact on your local market. Always consider your local market; people are more aware than ever of shopping locally. 7- Related Vertical Keywords (RVKWs) Think of your industry as an “ecosystem” that could potentially aid in your research. Thinking along the lines of Green Tea, we could include these keywords that refer to similar products: When conducting research, be sure to approach it systematically and thoroughly. Alter your queries, research keywords, and figure out what works and what doesn’t within your industry. Sources and further reading: The Ultimate Guide to Link Building — by Eric Ward Search Operators — Google How to find anything Online with Advance Techniques — Bob Flisser ", "child": "634_1"}