{"name": "660", "parent": "", "title": "C4 Studio Alpha", "sentences": [{"0dfb": "C4 Studio Alpha"}, {"8061": "We’re very proud to announce that C4 Studio Alpha."}, {"2557": "Despite the many prototyping tools, design systems and processes for communication, the design-development gap remains vast. Over the last few years we’ve seen a number of prototyping tools pop up on the design stage, some dwindling out of our perception, and others — like Flinto, Framer, Principle, and Pixate — growing strong by the quarter. And, while newer products are continuing to pop up on the market — Adobe XD — it’s clear that the market is still ripe for innovation… and the gap remains wide open."}, {"701a": "What is C4 Studio?"}, {"03c6": "C4 Studio is a new class of motion design for mobile. Built for Designers and Developers, C4 Studio lets you easily animate designs and generate production-ready code that a developer can use right away."}, {"847b": "As a designer, you can work in Sketch, animate in C4 Studio and export production-ready code."}, {"6246": "As a developer, you can customize the kind of code you need to make it easy to integrate into your already existing projects. If you only want to cherry-pick the animations you can do so using the code preview window."}, {"15b8": "Sketch Integration"}, {"a150": "C4 Studio taps straight into a designer’s Sketch file. After creating a new project the user simply links to their Sketch file and chooses a start / end point for a transition."}, {"847e": "If you make changes to your design file they appear immediately in C4 Studio. Unlike other prototyping tools whose sketch plugins create a 1-way street (i.e. changes in the prototype are lost on the original design file), ours does not."}, {"2f88": "Start / End States"}, {"d644": "The fundamental paradigm behind C4 Studio is to design start and end states that you can then animate between. A case example is like this: a designer creates a closed and open state for a menu, then is able to create transitions between those states in C4 Studio."}, {"6829": "Transitions"}, {"a995": "After linking two artboards, C4 Studio automatically creates a default set of animations between the two states. The user can open the transition and start editing the timelines, durations, and easing right away."}, {"0bb7": "Multiple Transitions"}, {"9f60": "You can also make multiple transitions in a single project. If you want to see two different timing possibilities for the same animation you can do so."}, {"9e6a": "Alternatively, you can create transitions that animate from the same start state to different end states."}, {"aff8": "Familiar Timelines"}, {"d2c8": "Our approach to animation is very familiar. C4 Studio uses sliding timelines to control animation. You can adjust the timing and easing of groups, objects and even individual properties of each object."}, {"46b8": "Exporting"}, {"b16a": "This is where C4 Studio shines. We have created a sophisticated code export system that allows you to generate views, controllers and even full Xcode projects."}, {"8436": "The code generated by C4 Studio is well-architected, light, and pretty easy to integrate into existing projects. If you’re interested, you can have a look at our Custom Button (7.5 mins) and our Custom Menu (10min) tutorials to see how quickly you can integrate things from C4 Studio into projects that use Interface Builder."}, {"5089": "Code Preview"}, {"6e92": "If all you want to do is cherry-pick a few pieces of an animation, you can select an object from the timeline and then copy from the code preview window."}, {"c913": "Movies too"}, {"91db": "If you need to show someone what your transition looks like you can easily export a movie to get approval and signoff."}, {"64af": "Want to try C4 Studio?"}, {"1dfa": "As we already mentioned, we’re currently offering a closed alpha. We’re actively looking for people who work at the cross-section of design and development and would love for you to try C4 Studio out."}, {"9359": "After 7 days, and over 1000 subscribers…SIGN UP FOR THE ALPHA IS NOW CLOSED!"}, {"e661": "For more information, features, and tutorials please visit:"}, {"0993": "www.c4studio.co"}], "content": "C4 Studio Alpha We’re very proud to announce that C4 Studio Alpha. Despite the many prototyping tools, design systems and processes for communication, the design-development gap remains vast. Over the last few years we’ve seen a number of prototyping tools pop up on the design stage, some dwindling out of our perception, and others — like Flinto, Framer, Principle, and Pixate — growing strong by the quarter. And, while newer products are continuing to pop up on the market — Adobe XD — it’s clear that the market is still ripe for innovation… and the gap remains wide open. What is C4 Studio? C4 Studio is a new class of motion design for mobile. Built for Designers and Developers, C4 Studio lets you easily animate designs and generate production-ready code that a developer can use right away. As a designer, you can work in Sketch, animate in C4 Studio and export production-ready code. As a developer, you can customize the kind of code you need to make it easy to integrate into your already existing projects. If you only want to cherry-pick the animations you can do so using the code preview window. Sketch Integration C4 Studio taps straight into a designer’s Sketch file. After creating a new project the user simply links to their Sketch file and chooses a start / end point for a transition. If you make changes to your design file they appear immediately in C4 Studio. Unlike other prototyping tools whose sketch plugins create a 1-way street (i.e. changes in the prototype are lost on the original design file), ours does not. Start / End States The fundamental paradigm behind C4 Studio is to design start and end states that you can then animate between. A case example is like this: a designer creates a closed and open state for a menu, then is able to create transitions between those states in C4 Studio. Transitions After linking two artboards, C4 Studio automatically creates a default set of animations between the two states. The user can open the transition and start editing the timelines, durations, and easing right away. Multiple Transitions You can also make multiple transitions in a single project. If you want to see two different timing possibilities for the same animation you can do so. Alternatively, you can create transitions that animate from the same start state to different end states. Familiar Timelines Our approach to animation is very familiar. C4 Studio uses sliding timelines to control animation. You can adjust the timing and easing of groups, objects and even individual properties of each object. Exporting This is where C4 Studio shines. We have created a sophisticated code export system that allows you to generate views, controllers and even full Xcode projects. The code generated by C4 Studio is well-architected, light, and pretty easy to integrate into existing projects. If you’re interested, you can have a look at our Custom Button (7.5 mins) and our Custom Menu (10min) tutorials to see how quickly you can integrate things from C4 Studio into projects that use Interface Builder. Code Preview If all you want to do is cherry-pick a few pieces of an animation, you can select an object from the timeline and then copy from the code preview window. Movies too If you need to show someone what your transition looks like you can easily export a movie to get approval and signoff. Want to try C4 Studio? As we already mentioned, we’re currently offering a closed alpha. We’re actively looking for people who work at the cross-section of design and development and would love for you to try C4 Studio out. After 7 days, and over 1000 subscribers…SIGN UP FOR THE ALPHA IS NOW CLOSED! For more information, features, and tutorials please visit: www.c4studio.co ", "child": "660_1\t660_2\t660_3\t660_4\t660_5\t660_6\t660_7\t660_8\t660_9"}