{"name": "680", "parent": "", "title": "Introducing UniYo 🐣", "sentences": [{"5e72": "Introducing UniYo 🐣"}, {"4a0a": "UniYo is an easy and intuitive messaging app for education. Our mission is to reinvent how campuses work."}, {"cd6f": "👩‍💻👨‍💻 How do friends keep in touch today?Phone, Skype, Facebook groups, Messenger, WhatsApp, Snapchat, Instagram, YikYak, etc."}, {"708e": "👩🏽 With your mother?SMS (and it’s way enough)."}, {"bd75": "👵🏻 Grandma?Letters (and it’s cute!)."}, {"0ce3": "👨🏻👱🏻 Colleagues?LinkedIn."}, {"7481": "👩‍🎓👩‍🏫👨‍🎓👨‍🏫 But what about students, professors and admin staff on a same campus? EMAILS. Yes, emails! Emails to contact random students to study in groups; emails to ask a question to a professor; emails to get information from the administration (if by any chance you’re able to find the “Contact” button on the intranet website 🤓)."}, {"4b80": "90% of students don’t use emails as a primary means of communication, and close to 60% of them never actually open emails from the university."}, {"f180": "Emails are dead 💩. Let us introduce you to UniYo 👏."}, {"07ff": "We built UniYo to empower students and foster communities on campus. Education too often experienced as a competition. It should be collaborative and allow people to educate one another and grow."}, {"973d": "- UniYo? What is it for?- Interact with everybody on campus in a fun and easy way!- Why is it better than email?- Well, it’d be like asking why email is better than fax, or why fax is better than letters. Just try.- Ok, I’ll try but once again: why is it better than email?- Emails are super not efficient, they are boring and you have to wait for a week before getting a reply. Proof: When you contact a friend, you could send him an email but you will always use a messaging app. Why should this be any different with a classmate or with your professor?- Alright. But why is it better than WhatsApp or Facebook Messenger?Because students and profs are not necessarily your friends. You don’t want to chill out… you just want to chat!"}, {"a2c9": "Does this mean that communication on campus must be boring? Our answer is yo ✌️."}, {"7f64": "✊🏛 Help us turn campus communication into something easy, efficient and fun."}, {"ad62": "You must sign up on UniYo right now. But signing up is not enough. You must invite all your classmates and your professors to join. UniYo will be efficient if each of you guys invite at least one friend to join. Otherwise you will not be allowed to say something like “Well…. UniYo could be fun if the whole campus was online” 💦 🔫"}, {"054a": "Communication with a classmate, a prof or your campus administration should be as easy as chatting with a friend."}, {"bc45": "Do not forget: Be one of the first people to sign up and invite at least one friend to join because chatting alone is always embarrassing… 😳Tip: Share this article! 😜"}, {"15d6": "—"}, {"e403": "UniYo 😘"}], "content": "Introducing UniYo 🐣 UniYo is an easy and intuitive messaging app for education. Our mission is to reinvent how campuses work. 👩‍💻👨‍💻 How do friends keep in touch today?Phone, Skype, Facebook groups, Messenger, WhatsApp, Snapchat, Instagram, YikYak, etc. 👩🏽 With your mother?SMS (and it’s way enough). 👵🏻 Grandma?Letters (and it’s cute!). 👨🏻👱🏻 Colleagues?LinkedIn. 👩‍🎓👩‍🏫👨‍🎓👨‍🏫 But what about students, professors and admin staff on a same campus? EMAILS. Yes, emails! Emails to contact random students to study in groups; emails to ask a question to a professor; emails to get information from the administration (if by any chance you’re able to find the “Contact” button on the intranet website 🤓). 90% of students don’t use emails as a primary means of communication, and close to 60% of them never actually open emails from the university. Emails are dead 💩. Let us introduce you to UniYo 👏. We built UniYo to empower students and foster communities on campus. Education too often experienced as a competition. It should be collaborative and allow people to educate one another and grow. - UniYo? What is it for?- Interact with everybody on campus in a fun and easy way!- Why is it better than email?- Well, it’d be like asking why email is better than fax, or why fax is better than letters. Just try.- Ok, I’ll try but once again: why is it better than email?- Emails are super not efficient, they are boring and you have to wait for a week before getting a reply. Proof: When you contact a friend, you could send him an email but you will always use a messaging app. Why should this be any different with a classmate or with your professor?- Alright. But why is it better than WhatsApp or Facebook Messenger?Because students and profs are not necessarily your friends. You don’t want to chill out… you just want to chat! Does this mean that communication on campus must be boring? Our answer is yo ✌️. ✊🏛 Help us turn campus communication into something easy, efficient and fun. You must sign up on UniYo right now. But signing up is not enough. You must invite all your classmates and your professors to join. UniYo will be efficient if each of you guys invite at least one friend to join. Otherwise you will not be allowed to say something like “Well…. UniYo could be fun if the whole campus was online” 💦 🔫 Communication with a classmate, a prof or your campus administration should be as easy as chatting with a friend. Do not forget: Be one of the first people to sign up and invite at least one friend to join because chatting alone is always embarrassing… 😳Tip: Share this article! 😜 — UniYo 😘 ", "child": "680_1\t680_2\t680_3\t680_4\t680_5680_1\t680_2\t680_3\t680_4\t680_5"}