{"name": "684", "parent": "", "title": "What Bots Can Do, t", "sentences": [{"7269": "What Bots Can Do, that websites and apps can’t"}, {"e10e": "There’s a backlash against bots. The hype of 2016 is gone with Facebook Messenger’s move from chat to menus, Everlane rolling back to email and brands dropping bots as a marketing strategy."}, {"db6f": "2017 Bot news"}, {"0c36": "At Kip, we’re moving forward fearlessly. To combat naysayers, we have a radical proposition to all bot developers:"}, {"d07e": "Build something that *only* bots can doThat websites and apps can’t"}, {"c6a0": "Who Your Real Competitors Are"}, {"dc8c": "The truth is that your competitors aren’t just other bot companies, but what your users prefer to use instead of your product. This could mean a website they already visit, an app they’ve already installed or their own solution they’ve already come up with."}, {"9bab": "EXAMPLE: you build a FB Messenger chatbot that helps users keep track of their exercise called Fitzien. When people chat to Fitzien they find out how many hours of exercise they’ve done, how many calories burned and can create their own fitness plans. Sounds useful right?"}, {"aa2f": "EXCEPT THERE’S ALREADY:1. Apps that do the same thing, like MyFitnessPal 2. Online communities that recommend exercise plans, and also offer social support3. Gyms that offer personal trainers as part of their membership incentives4. Websites like Calorie Counter that DON’T require specific platforms to access them i.e. Facebook5. People who prefer to write things in journals"}, {"18d1": "Competition costs"}, {"5c45": "A relatively simple use-case is now fraught with high acquisition costs. You have huge competition from different products that offer similar value as your bot, and you also have the challenge of educating average users on what a bot is, and how to use it."}, {"e0f8": "Your Unique Value as a Bot"}, {"8070": "When we started developing for Kip Café we faced a huge dilemma. How could we offer more convenience to a user who could use a website or app instead?"}, {"ba27": "To duplicate this in a bot conversation, you’ll have to go through multiple steps like:"}, {"0c22": "‘Hi [user], how can I help you?’‘What’s your address?’‘Would you like to do delivery or pickup?’‘Is the delivery ASAP or scheduled later?’ ‘Would you like to start a new order or repeat previous order?’‘What would you like to eat?’‘What’s your budget?’‘How many stars rating?’, etc."}, {"620a": "Compared to a website or an app, which just takes a single click— fill out your address, tap search and you’ll instantly be shown a dazzling variety of food. Using a bot wasn’t fun or exciting, it was a hassle."}, {"62ac": "Value Add Experiences"}, {"81f1": "The mantra: “Build Something Only Bots Can Do” is a great pass/fail test for developing bots. Not only that, the value of your bot must be 20x greater than what is currently used for someone to change their habits."}, {"4ba8": "For instance, if you wanted to do a bot that delivers food, asking 16 questions before a user could pick food options was a surefire killer."}, {"2103": "This was a serious problem at Kip. We promised our customers that they could get lunch delivered with Kip, but doing it via conversation meant 16-steps of q&a and no one would do it."}, {"35cf": "In the end, we came up with a solution by re-focusing to our core mission of helping groups organize. We looked at what Kip could do, that neither an app, website or food delivery startup could."}, {"d430": "Group Search for Consensus Shopping"}, {"f48c": "If you break down food delivery, it consists of 2 experiences. The 1st is choosing a restaurant (search), the 2nd is ordering food from a menu (selection). As an individual, this is an easy process. You know what you like, what you feel that day and picking items off a menu is a piece of cake."}, {"1721": "What happens when it’s a group?What happens when a team wants to order lunch?Who chooses the restaurant? Who sends out the menu?"}, {"b9a8": "So we flipped the idea of search and selection for groups."}, {"42d2": "Instead of searching for your favorite food, Kip searches for a restaurant that has *all* your entire team’s favorite foods."}, {"c2e2": "Choices that suit a majority of tastes"}, {"995d": "Maybe you have a colleague that’s deathly allergic to peanuts, or a friend that’s vegetarian. Or gluten-free. Or paleo-diet. Or it’s been a long day and you just want some awesome diner breakfast food."}, {"a711": "No problem — Kip remembers your preferences, polls the team for their choices and automatically sends a personal menu to each person from the winning restaurant."}, {"d3d7": "Live: food votes"}, {"6ec2": "The Pass/Fail Test: Is this something only Kip can do? Could this be done via an alternative method?"}, {"1400": "If it was done on an app:There would be no communication because apps are gated and cut off. The beauty of bots is that they can access multiple platforms easily across. If Person 1 is on Slack, Person 2 on Messenger and Person 3 only uses email, Kip can ping all 3 members simultaneously the way that an app can’t."}, {"c39c": "If it was done on a website:It would take an extremely long time because websites are for individual viewing. When you create accounts on Seamless/Grubhub/DoorDash etc. it’s meant to be managed by a single user."}, {"81d4": "Get your own personal menu instantly"}, {"17a3": "Instead of polling and sending menus simultaneously, someone would have to ask each person what they want to eat one-by-one, count results, then take screen-caps of the menu, paste it on chat and take orders one-by-one. It’s waitressing."}, {"1e2c": "During testing for Café, we realized that we created something powerful and usable that could be applied across many industries. After much thought, we decided to patent the group search consensus engine."}, {"ecfd": "In the next post, we’ll be going in more detail how consensus works, and how it can be used from group travel planning to choosing the right health insurance policies, so stay tuned!"}, {"3b2f": "Kip is an AI penguin that helps you collect orders and coordinate purchases for teams. Try Kip for Slack by tapping the button below:"}, {"278b": "Push this button"}, {"0555": "If you enjoyed reading, please recommend 💚 or check out our other stories here!"}], "content": "What Bots Can Do, that websites and apps can’t There’s a backlash against bots. The hype of 2016 is gone with Facebook Messenger’s move from chat to menus, Everlane rolling back to email and brands dropping bots as a marketing strategy. 2017 Bot news At Kip, we’re moving forward fearlessly. To combat naysayers, we have a radical proposition to all bot developers: Build something that *only* bots can doThat websites and apps can’t Who Your Real Competitors Are The truth is that your competitors aren’t just other bot companies, but what your users prefer to use instead of your product. This could mean a website they already visit, an app they’ve already installed or their own solution they’ve already come up with. EXAMPLE: you build a FB Messenger chatbot that helps users keep track of their exercise called Fitzien. When people chat to Fitzien they find out how many hours of exercise they’ve done, how many calories burned and can create their own fitness plans. Sounds useful right? EXCEPT THERE’S ALREADY:1. Apps that do the same thing, like MyFitnessPal 2. Online communities that recommend exercise plans, and also offer social support3. Gyms that offer personal trainers as part of their membership incentives4. Websites like Calorie Counter that DON’T require specific platforms to access them i.e. Facebook5. People who prefer to write things in journals Competition costs A relatively simple use-case is now fraught with high acquisition costs. You have huge competition from different products that offer similar value as your bot, and you also have the challenge of educating average users on what a bot is, and how to use it. Your Unique Value as a Bot When we started developing for Kip Café we faced a huge dilemma. How could we offer more convenience to a user who could use a website or app instead? To duplicate this in a bot conversation, you’ll have to go through multiple steps like: ‘Hi [user], how can I help you?’‘What’s your address?’‘Would you like to do delivery or pickup?’‘Is the delivery ASAP or scheduled later?’ ‘Would you like to start a new order or repeat previous order?’‘What would you like to eat?’‘What’s your budget?’‘How many stars rating?’, etc. Compared to a website or an app, which just takes a single click— fill out your address, tap search and you’ll instantly be shown a dazzling variety of food. Using a bot wasn’t fun or exciting, it was a hassle. Value Add Experiences The mantra: “Build Something Only Bots Can Do” is a great pass/fail test for developing bots. Not only that, the value of your bot must be 20x greater than what is currently used for someone to change their habits. For instance, if you wanted to do a bot that delivers food, asking 16 questions before a user could pick food options was a surefire killer. This was a serious problem at Kip. We promised our customers that they could get lunch delivered with Kip, but doing it via conversation meant 16-steps of q&a and no one would do it. In the end, we came up with a solution by re-focusing to our core mission of helping groups organize. We looked at what Kip could do, that neither an app, website or food delivery startup could. Group Search for Consensus Shopping If you break down food delivery, it consists of 2 experiences. The 1st is choosing a restaurant (search), the 2nd is ordering food from a menu (selection). As an individual, this is an easy process. You know what you like, what you feel that day and picking items off a menu is a piece of cake. What happens when it’s a group?What happens when a team wants to order lunch?Who chooses the restaurant? Who sends out the menu? So we flipped the idea of search and selection for groups. Instead of searching for your favorite food, Kip searches for a restaurant that has *all* your entire team’s favorite foods. Choices that suit a majority of tastes Maybe you have a colleague that’s deathly allergic to peanuts, or a friend that’s vegetarian. Or gluten-free. Or paleo-diet. Or it’s been a long day and you just want some awesome diner breakfast food. No problem — Kip remembers your preferences, polls the team for their choices and automatically sends a personal menu to each person from the winning restaurant. Live: food votes The Pass/Fail Test: Is this something only Kip can do? Could this be done via an alternative method? If it was done on an app:There would be no communication because apps are gated and cut off. The beauty of bots is that they can access multiple platforms easily across. If Person 1 is on Slack, Person 2 on Messenger and Person 3 only uses email, Kip can ping all 3 members simultaneously the way that an app can’t. If it was done on a website:It would take an extremely long time because websites are for individual viewing. When you create accounts on Seamless/Grubhub/DoorDash etc. it’s meant to be managed by a single user. Get your own personal menu instantly Instead of polling and sending menus simultaneously, someone would have to ask each person what they want to eat one-by-one, count results, then take screen-caps of the menu, paste it on chat and take orders one-by-one. It’s waitressing. During testing for Café, we realized that we created something powerful and usable that could be applied across many industries. After much thought, we decided to patent the group search consensus engine. In the next post, we’ll be going in more detail how consensus works, and how it can be used from group travel planning to choosing the right health insurance policies, so stay tuned! Kip is an AI penguin that helps you collect orders and coordinate purchases for teams. Try Kip for Slack by tapping the button below: Push this button If you enjoyed reading, please recommend 💚 or check out our other stories here! ", "child": "684_1\t684_2\t684_3\t684_4684_1\t684_2\t684_3\t684_4"}