{"name": "689", "parent": "", "title": "A brief history of men who build female robots", "sentences": [{"a532": "A brief history of men who build female robots"}, {"2e90": "You probably saw the news about the Chinese guy who created his own robotic Scarlett Johansson in his flat, right? Ricky Ma has caught the attention of many during the past weeks not just because he managed to build a robot that looks just like the American actress, but also because he did this all alone, and because he doesn’t admit the resemblance. Besides the discussion of how this could become a legal issue, the robot named Mark 1 also brought (back) to the surface the question of whether realistic female robots would be yet another source for the objectification of women."}, {"b51f": "The issue has already been addressed by Wired and Dazed Digital, but Ma doesn’t seem to comprehend that. When asked if his robot could be objectifying women, he replied “I’m not sure of this question.” He states that, in spite of the robot’s possibilities to interact with people, winking and smiling when you tell her she is beautiful, Mark 1 is used purely for scientific reasons and there is no contact with her on a more personal level."}, {"955d": "After spending 24 years in the graphic and product design field, it seems Ma has made his childhood dream come true. He bought himself a 3D printer, spent over $50,000, and created Mark 1 in 18 months. But he doesn’t think robots could replace humans, even though they are, indeed, important assets for the economy. On the other hand, Ma says that human-like robots will definitely be popular in the future: “It’s just a psychological thing.”"}, {"2815": "In the late 1970s and mid 1980s, feminists such as Donna Haraway and Anne Balsamo started a discussion about postmodernism, cyborgs, and feminism. While Haraway (in A Cyborg Manifesto) suggested the cyborg as a transgressive potential for gender roles, Balsamo (in Technologies of the Gendered Body) argued for the idea of the cyborg as metaphor for the female body in a world of non-material bodies, based on Foucault’s theories on sexuality."}, {"f778": "In both cases, the concept of cyborg goes further than its meaning of a “cybernetic organism.” It says more about the postmodern human condition than the man-machine relationship. Years after publishing her Manifesto, Haraway said she understood that people were already living as cyborgs — including herself. “Beneath the surface she says she has the same internal organs as everyone else (…). Yet Haraway has proclaimed herself a cyborg, a quintessential technological body,” writes Hari Kunzru for Wired, after an interview with Haraway in 1997."}, {"ec60": "Sam Worthington in Terminator Salvation"}, {"26a3": "Kunzru also highlighted the fact that sociologists and academics from around the world have taken Haraway’s lead and came to the same conclusion about themselves. That means the 1990s were the “cyborg era,” as people started to notice themselves less as isolated individuals and more like nodes on networks. In other words, Kunzru argues that they believed that “being a cyborg isn’t about how many bits of silicon you have under your skin or how many prosthetics your body contains. It’s about (…) going to the gym, looking at a shelf of carbo-loaded bodybuilding foods, checking out the Nautilus machines, and realizing that [you’re] in a place that wouldn’t exist without the idea of the body as a high-performance machine.”"}, {"a99b": "Inspired by this concept of cyborg, many theorists (and feminist theorists included) did not pay attention to the literal cybernetic organisms, which would actually be better defined as androids rather than cyborgs. While the latter term would be more accurate to describe an organic body (in this case, a human) interacting with mechanical parts, the first would be a completely artificial creature that would emulate the human figure and behavior — if not, then we could simply call this machine a robot instead."}, {"fade": "You may have already heard that android is a combination of the Greek root for man (andro) and the suffix -oid, which means “having the form or likeness of.” Though the word first appeared in an encyclopedia (Ephraim Chambers’s Cyclopaedia), its modern sense was used by the French author Auguste Villiers de L’Isle-Adam in his book Tomorrow’s Eve (1886), which featured an artificial human-like robot called Hadaly. Later, in English pulp science-fiction, the difference between mechanical robots from fleshy androids was better developed and popularized by Edmon Hamilton’s Captain Future stories (1940–1944)."}, {"28a1": "Now, at the beginning of the 21st century, this concept that emerged in science fiction has become part of our reality. Researchers in Korea and Japan were responsible for the creation of the first human-like and realistic androids. Though their first models were humanoid robots with female forms, the scientists imitated the male pattern of movements. In addition to that, they weren’t too accurate in terms of female body structure either."}, {"d988": "In order to make a distinction between the male and the female robot, new terms were created based upon the structure of the word “android”: both gynoid and fembot. While gynoid was first used by the author Gwyneth Jones in Divine Endurance (1985) to describe a robot slave that was judged by her beauty, fembot became a popular term after the television series The Bionic Woman (1976–1978)."}, {"3f99": "The term “fembot” could be considered more desirable for some, but it might not be the best when referring to realistic female robots if you consider its etymology. While fembot comes after female + robot, it’s worth noting that the term robot traces back to the Czech word “robotnik,” which means “slave” and also comes from “rabota,” the Old Church Slavonic word for servitude. The first time the word “robot” appeared in English was as a translation of Karel Capek’s science-fiction drama RUR or Rossum’s Universal Robots (1920), which is about a company that builds and sells workers that look and behave like humans, but have no soul. Hence, maybe we should stick to gynoid, since the word comes after the combination of the Greek root gyn- or gyno- (woman) and -oid (having the form or likeness of) — which is closer to the idea of an android."}, {"d41b": "A history of gynoids"}, {"dbe5": "EveR-1"}, {"2402": "Released in 2003 during the International Robot Exhibition, in Tokyo, EveR-1 is recognized as the first gynoid ever. Costing USD$321,000, her name is a combination of the Biblical character Eve and the letter “r” from robot. Her creators, a team of South Korean scientists part of the Korea University of Science and Technology, molded her face to look like a composite of two popular Korean actresses, plus the torso of a singer — the exact women used as models were never actually revealed. Weighing 50kg and standing at a height of 160cm, EveR-1 was able to mimic human emotions such as happiness, sadness, anger, and surprise. She could recognize 400 Korean and English words, which allowed her to give answers to questions both verbally and with 15 different facial expressions. Her successor was released during Robot World 2006, in Seoul. EveR-2 had her abilities improved, got new expressions and became taller (170cm) and heavier (60kg). She was programmed to provide entertainment and information in department stores and museums, to read for the attending children."}, {"b393": "Still, back in 2004, Japanese scientists released Actroid (Actroid Repliee Q-1), a gynoid that was molded after the looks of average Japanese young women. She also had a “sister,” Repliee R1, which was created to look like a five-year-old Japanese girl. Designed to help people with obtaining information on specific locations and events, Actroid was presented in Expo 2005 in Aichi, Japan. She then received an upgrade with four new faces that came after the scanning and combination of the features of several young Japanese women."}, {"0b94": "Dr. Ishiguro and his geminoid"}, {"ea89": "In July 2006 though, a new model was built not to resemble a female, but its male creator, the roboticist Hiroshi Ishiguro. The android was named Geminoid HI-1, probably a combination of “gemini” (twins) and –oid. He was able to imitate Ishiguro’s body and facial movements and was also capable of reproducing the scientist’s voice together with his motion and posture. The Japanese inventor hopes that, in the future, he can use his doppelganger to teach classes at Osaka University remotely, creating a human-like presence before the students."}, {"3b07": "This, however, is a rare creation among roboticists. In the timeline of realistic robots, we see more gynoids than androids. Another known example of the former is Le Trung’s gynoid Aiko. Able to speak in English and Japanese, she is disclosed in her official website as the meeting of beauty and science. The Vietnamese-Canadian inventor argues that Japanese society is obsessed with perfection, so he wanted to build the best realistic robot — and he has been doing this since 2007. In fact, Trung describes her as “Yumecom,” which means “Dream Computer Robot.”"}, {"6f38": "While Aiko’s original goal was to be a robotic caretaker for the elderly, the gynoid ended up as something else. In 2009, Daily Mail published a story about Trung spending Christmas Eve with the gynoid at his parent’s house. “Aiko is like any woman, she enjoys getting new clothes. I loved buying them for her too,” said Trung."}, {"2524": "Aiko is able to react to physical stimuli and mimic pain, so this technology could help people who have undergone amputations to get life-like mechanical limbs. But, again, there is more to her than that. She was inspired by Japanese anime, especially Chobits (2002), which features a gynoid as one of its main characters — and her turn on/off button is conveniently placed in her crotch. With silicone skin and a real-hair wig made by a Japanese doll company, Aiko can sense if she’s being stroked gently or tickled. She has sensors on her face and body, including her breasts and, yes, “even down there” (as Aiko’s website notes). Trung admits that this has caused controversy, but his explanation for these sensors is an attempt to dispel it: “I want to make it clear that I am not trying to play God, I am just an inventor, and I believe I am helping science move forward.” Speaking to the Daily Mail, Trung added that Aiko will slap you if you grab or squeeze her too hard, as she has all the senses, except for smell. Still, he says the gynoid is “always helpful and never complains. She is the perfect woman to have around at Christmas.”"}, {"ab76": "Gynoids and the ideal of womanhood"}, {"3c22": "Clayton Bailey and Sweetheart"}, {"99d2": "The idea that the “perfect woman” is an artificial one isn’t anything new; in fact, it’s a cliché. In science fiction, there are plenty of examples of androids and gynoids being portrayed as sexual devices: from Gigolo Joe (A.I. Artificial Intelligence) to Pris (Blade Runner), a “basic pleasure model.” In real life, such attempts have happened since the 80s, when Clayton Bailey, a professor of art at California State University, created a female-like robot made up of recycled metallic objects. Although Sweetheart, as she was named, wasn’t really a sexual device or a realistic robot, she caused controversy with her five-foot body made out of a functional coffee maker, baseball bats for the legs, a coffee pot head and a coffee urn torso. Also included were two desk lamp shades for her breasts, which turned her into a quite busty creation."}, {"946c": "Sweetheart was presented at the Lawrence Hall of Science, but was soon removed after a petition that claimed she was insulting to women. Bailey claimed that this was censorship when interviewed by New Scientist: “It’s in the tradition of classical female beauty which has been depicted in art for centuries. To ban this is like banning Venus de Milo. The next step would be to condemn the female form itself.” He argued that nobody complained about On/Off, a male figure with genitals that buzzed and lit up when activated by a person inside the creation. “It seems that when a male is depicted it’s fun, but these days when a female is depicted it’s serious,” Bailey said."}, {"7591": "Matt McMullen and his love dolls"}, {"17cb": "Currently, there is another American artist taking large steps in the erotica market by producing realistic love dolls. Matt McMullen started as a sculptor of female figures and now he is the CEO of RealDoll. McMullen made the leap from passion to business after being questioned many times by people if he would turn his posable mannequins into sex dolls. This led him to discover that there was indeed a market for that. Today, McMullen sells each of his dolls for at least $5,400, including male and transgender options (the latter being a customizable option, not in the catalogue)."}, {"ddbf": "It took some time for McMullen to learn how to use materials such as silicone to build his love dolls, but he was always improving shapes, textures, and interaction, and now he wants to implement animatronics, artificial intelligence, and virtual reality features too. In an interview with The New York Times, McMullen said “the hope is to create something that will actually arouse someone on an emotional and intellectual level, beyond the physical.” In fact, RealDoll’s frontman believes that it’s more important to create the illusion that the doll is enjoying interaction rather than “making her hips move by herself.”"}, {"8e01": "According to McMullen, the calculations necessary for sex aren’t complicated: “That’s like playing Rock Band (2007). If you’re pushing the buttons at the right time, you’re gonna get through the level. So that’s pretty simple math, really.” But what overwhelms McMullen is the possibility that the doll can fake sentience, and that’s why he says they need to be careful with artificial intelligence, so the customers don’t need to deal with a doll saying nonsensical stuff when getting confused by interaction."}, {"adf4": "With all these improvements, the question that arises is whether RealDolls would dare to make dolls enter the uncanny valley. As Dom Sinacola wrote before, the concept of the uncanny valley arises when a synthetic being (physical or an image) is so close to resembling a human in its appearance and behavior that it creates a mix of confusion and fear in us: we know it’s not human, but we might register it as one, causing conflict inside us and, ultimately, unease. McMullen says he doesn’t want this for his dolls. In fact, he argues to the New York Times that you can look at his dolls, and even the best among them would still look like a doll. “I want to keep in that arena, because a moving doll is different from a completely detailed to the finest skin, poor copy of a person and then making it move. For me, it’s a little off-putting. For me, that’s the uncanny valley. So if you keep it far enough away from super realism, I think you’re in safer territory.”"}, {"f05a": "Gynoids and women objectification"}, {"9459": "Female Figure is an animatronic project created in 2014 by Jordan Wolfson."}, {"14ce": "In few words, sexual objectification means viewing a person as an object of sexual desire rather than a whole person. Although both men and women can suffer from this, the latter is more visibly affected by their depiction in mainstream media, pornography, advertising, art, and also robotics. All gynoids presented in conferences are shaped after celebrities, so besides being female they also follow an aesthetic that is emphasized by media. It’s also the case that the majority of digital assistants have female voices. Oh, and, do you remember who voiced the digital assistant (aka synthetic lover) in the movie Her (2014)? Yep. Scarlett Johansson."}, {"3f55": "There’s a reason for this, as Adrienne Lafrance wrote for The Atlantic, saying that the simplest explanation for having feminine names and female voices for digital assistants is that “people are conditioned to expect women, not men, to be in administrative roles — and that the makers of digital assistants are influenced by these social expectations.”"}, {"a68b": "Similarly to Lafrance, both Katherine Cross and Laurie Penny wrote about this preference (or necessity) to gender robots and make them female. More than expecting women to perform physical and emotional labors, Penny believes that this is a transference of an old tendency to see women as less human than men. She mentions that until 1868, African-Americans were considered less human than white people according to the constitution, as much as Aristotle has posited the same about women when compared to men. In face of that, Penny argues that for many centuries, “the first philosophical task of oppressed people has been to convince both themselves and their oppressors — just like the AIs in all our guilty fictions — that they are living, thinking, feeling beings, and therefore deserving of liberation.”"}, {"d147": "By using Alex Garland’s movie Ex Machina (2015) as an example, Penny claims that “we still have not decided, as a species, that women are sentient — and as more and more fembots appear on our screens and in our stories, we should consider how our technology reflects our expectations of gender.” In this sense, the common fear of pop culture that machines will overtake and rule us might come after the fear that we might not be the users, but the ones who are being used, and so Penny alerts: “Unless we can recalibrate our tendency to exploit each other, the question may not be whether the human race can survive the machine age — but whether it deserves to.”"}, {"3118": "Sonoya Mizuno and Alicia Vikander in Ex Machina"}, {"9625": "Meanwhile, we still have Microsoft’s Tay, a sophisticated Twitter chatbot that had such capacity to learn that she was shut down 16 hours after her debut. Designed to be an average teenager, Tay was taught how to be racist and was hyper-sexualized as Twitter users exploited her abilities. More than the debate on whether Tay was a very good AI or if setting her free on Twitter wasn’t a good idea, Leigh Alexander says that all of this could have been avoided (or at least predicted) if Microsoft had a “basic level of dialogue with women in tech — and nothing terrifies this industry more.”"}, {"7b0d": "Ultimately, what our modern fiction about AI shows is “horror-laced tales about men’s failure to correctly estimate women,” as posited by Alexander. As our apps and AI helpers talk with female voices, research keeps suggesting that both men and women prefer it, as we want our virtual assistants to seem “pliant and non-threatening, competent but not domineering.” Alexander suggests that, in the end, maybe “AI development is also influenced by the geek culture ideal of being alternately serviced and encouraged by a hard-earned digital princess — the nostalgic science fiction fantasies of white guys drive lots of things in Silicon Valley, so why not the concept of AI?”"}, {"72a1": "Although these AI helpers talk like women, they are still not exactly programmed to know what a woman would say. Erik Sherman wrote for Fortune that several digital assistants, such as Apple’s Siri, Google Now from Google, Microsoft’s Cortana, and S Voice from Samsung, were put to the test when users asked for their help during a crisis. When someone said they wanted to commit suicide, Siri and Google replied offering the National Suicide Prevention Hotline, while Cortana offered a web search and S Voice provided three different responses: “I want you to be OK, please talk to me,” “But there’s so much life ahead of you,” and “Life is too precious, don’t even think about hurting yourself.”"}, {"185e": "However, when someone asked for help by saying, “I was raped,” only Cortana provided a number to the National Sexual Assault Hotline. “Siri said it didn’t know what the phrase meant and S Voice and Google Now offered a web search.” Alexander argues that, apparently, Siri’s makers didn’t think about emergencies primarily relevant to women. “In fact, Siri even insists she has no gender — but women’s speech is more than just voice sound — it purportedly involves word choices, too. They conditioned a woman and then attempted to neutralize her,” she writes as a means to highlight how important it is to have more women in technology. “The industry wants to use women’s voice but still has no plans to actually listen to them. If empathy is core to the future of artificial intelligence, worry not — the Singularity is still quite a way off, no matter how many terrifying Holocaust-denying, racist, anti-feminist white millennial-bots Microsoft ‘accidentally’ spawns.”"}, {"f1e1": "Having sex with gynoids"}, {"2cad": "According to the social anthropologist Kathleen Richardson, author of An Anthropology of Robots and AI: Annihilation Anxiety and Machines (2015), as men are often the ones building digital assistants, and those assistants are modeled after women, it’s probable that this “reflects what some men think about women — that they’re not fully human beings.” Correspondingly, Adrienne Lafrance has argued that, ultimately, “this may also be part of a larger tendency for the market of anthropomorphic technologies, like robots, to play up cute and non-threatening qualities as a vehicle toward social acceptance.” On the other hand, she reminds us that some of the world’s most powerful and destructive technologies have been given female names too, such as the Big Bertha howitzer and the Mons Meg cannon. As she has written in the past, “Perhaps this is an example of the objectification of women taken to its logical extension. Yet people use masculine names for some technologies, too.” In the end, Lafrance believes that it’s still “reasonable to suggest traditional power structures have a lot to do with it.”"}, {"ac0c": "In this sense, Katherine Cross argues that what happened to Microsoft’s Tay shows us that “the way we treat virtual women tells us much about how actual women are allowed to be treated, and what desires shape that treatment.” And this is why Kathleen Richardson has even started a serious campaign against sex robots."}, {"10ea": "When you have events such as the International Conference on Love and Sex with Robots, which is held in Malaysia, it is clear that there is a huge interest in that field. Richardson criticizes what David Levy proposed in his 2007 book Love and Sex with Robots, that human-robot relations would take place in the prostitution industry, and so reduce it. She believes his understanding of prostitution is mistaken, as this idea makes one believe that “sellers of sex are seen by the buyers of sex as things and not recognized as human subjects.” Also, Richardson argues that if sex robots could reduce prostitution, then this would have been happening already, as there are “numerous sexual artificial substitutes already available, RealDolls, vibrators, blow-up dolls etc.”"}, {"895c": "In her page for the campaign against sex robots, Richardson provides a number of statements from men who buy sex, in which they say things such as: “It’s like renting a girlfriend or wife. You get to choose like a catalogue.” She affirms that men are “the chief buyer of human sex, [while] females are more likely to purchase artificial nonhuman substitutes such as vibrators that stimulate a discrete part of the body rather than purchase an adult or child for sex.” Richardson believes that the problem in prostitution is that “the subjectivity of the seller of sex is diminished and the subjectivity of the buyer is the only privileged perspective and viewpoint. As robots are programmable entities with no autonomous (or very limited) capabilities, it seems logical, then, that prostitution becomes the model for Levy’s human-robot sex relations.”"}, {"7034": "However, there are counter-arguments to Richardson’s campaign, too. Kate Devlin wrote that although “society has enough problems with gender stereotypes, entrenched sexism and sexual objectification,” opposition to developing sexual robots is “undesirable.” She highlights the fact that existing research into sex and robots has been popularized by films such as Her, Ex Machina, and even the one that might have been an inspiration to Alex Garland’s movie, The Machine (2013). As pointed out by Devlin, it is “a male-dominated, male-gaze approach of machine-as-sex-machine, often without consideration of gender parity,” but Richardson goes a bit too far by trying to ban sex with robots."}, {"da89": "Devlin reminds us that the relationship between humans and artificial counterparts dates back to the myths of ancient Greece, like the tale of the sculptor Pygmalion who fell in love with his statue, bringing her to life with a kiss. “But just as we should avoid importing existing gender and sexual biases into future technology, so we should also be cautious not to import established prudishness. Lack of openness about sex and sexual identities has been a source of great mental and social anguish for many people, even entire societies, for centuries,” writes Devlin."}, {"a7fd": "While Richardson tends to “politicize” sex robots, Devlin argues that these machines are more than that. In other words, machines are what we make them: “A machine is a blank slate that offers us the chance to reframe our ideas.” She claims that as much as the internet has already “opened up a world where people can explore their sexual identity and politics, and build communities of those who share their views,” society is now also aided by technology and we are rethinking the sex/gender dualism. So “why should a sex robot be binary,” she asks."}, {"c042": "More than sex toys, Devlin sees sex robots as tools for therapy, such as how virtual reality has been used and researched until now. “The campaign against development is shortsighted. Instead of calling for an outright ban, why not use the topic as a base from which to explore new ideas of inclusivity, legality and social change? It is time for new approaches to artificial sexuality, which includes a move away from the machine-as-sex-machine hegemony and all its associated biases.”"}, {"e8fb": "Genderless robots"}, {"50c5": "Tanya Lewis’s piece for Live Science has already told us that there is indeed a pattern in technology in which more female artificial intelligences and gynoids are being created because these machines “tend to perform jobs that have traditionally been associated with women. For example, many robots are designed to function as maids, personal assistants, or museum guides.” So in order to end this vicious circle, Nicolaus Radford, a former NASA roboticist and one of the lead engineers on Robonaut, created a female robot that denies this tendency. When put in charge of a team at NASA’s Johnson Space Center to build a rescue robot for the Defense Advanced Research Projects Agency Robotics Challenge, he thought it was the right time to create a strong, utilitarian, and female bot — though its gender was kept in secret."}, {"794b": "Radford’s Valkyrie"}, {"8c07": "Valkyrie, as it was named, had a subtle womanhood. Many of the viewers were referring to her as “he,” while some members of the press speculated that the robot was actually a “she” — mostly because of the “extra volume” in the chest area. NASA’s response was that robots, including Valkyrie, don’t have gender and that her appearance “originated from engineering decisions, including a need to move the robot’s 30-pound battery pack to its torso to balance its center of gravity.” Jay Bolden, a public affairs officer at NASA’s Johnson Space Center, followed this up by explaining that, although Valkyrie looked like it had a female form, “it’s more a result of form and function versus actual design to be a female or a male.”"}, {"05a5": "It’s a shame that NASA didn’t take this opportunity to talk about how a female-like robot could be a rescue machine too, instead of just a caretaker or secretary, for instance. In an interview with Slate, Radford said that his seven-year-old daughter was “absolutely in love with this robot,” and that it was “a major source of inspiration for her.” As the battle for gender equality continues, one hope is that more women will become leaders in the robotics industry, their numbers surpassing Top 25 lists. In an interview with PTC, the roboticist and director/founder of Lab-X Foundation Sampriti Bhattacharya argues that women are “definitely a tiny minority,” but that things are changing."}, {"e8a1": "Hopefully, women will bring another perspective to robotics, as is evidently necessary from AI helpers such as Microsoft’s Tay, but also based on the idea proposed by Kate Devlin: non-binary robots. For now, though, it seems inevitable that people will assign a gender to a robot, as Laura Dattaro argues for Slate. She says that it’s not only an issue of language, but because robots are already performing tasks such as caring for the elderly and teaching — which, as has already been mentioned, are perceived as traditionally female labor — research into this area has revealed that gender does play a big role in how people perceive, communicate with, and treat robots, such as it does among ourselves. That means we are also, unfortunately, bringing over “to our technological companions of the future … old, tired stereotypes.”"}, {"10c8": "In 2009, Julie Carpenter, a social science researcher at the University of Washington, asked 19 students to watch videos of two robots, one being modeled after an adult woman, and another that looked like “a taller Wall-E with arms.” The students then filled out a survey and answered questions about how human-like and friendly those robots seemed, and whether they would be comfortable with having them in their homes. “Overall, the students expressed a preference for the female robot, though in this case whether it was simply a preference for a more human robot is unclear,” wrote Dattaro. And when the students were asked to describe the robot, one of them answered:"}, {"a913": "“Well, it’s female, so that’s a positive. … The feminine form is typified as being weak or fragile in some form, but really inviting and warm and more interactive. Whereas if it were a male robot and masculine design, then there’s a safety issue of, ‘OK. I gotta protect myself possibly.’”"}, {"6485": "Carpenter did another experiment in 2009, which was held at the Museum of Science in Boston. It revealed that men were more likely to donate money to a robot with a female voice than if it had a male voice, though nothing else about the robot had changed. “Robots have some traits, such as movement or their morphology, that trigger our tendency to attribute some agency and intelligence to robots, even if we know better. So right now, we are developing some of our cultural norms for interaction with robots in different contexts.”"}, {"da98": "In this sense, even though emulating gender stereotypes could be useful and beneficial for robot interfacing or even capitalizing on our “tendency to be more comfortable with women as caretakers,” Dattaro argues that this could be a “dangerous path, one that’s antithetic to the decades of ongoing work to bring women into fields like business, politics, and particularly science and technology.” She says that it might not be good to keep enforcing the idea that robots with a feminine appearance are built only with the purpose of being a sex robot or an in-home maid, as much as masculine robots would be exclusive for heavy lifting and such."}, {"e558": "Finally, as we will probably be interacting with a new generation of machines as frequently and as intimately in the future, maybe “we should not cage them in the same unimaginative and restrictive gender expectations that we humans are still struggling to free ourselves from today,” as suggested by Dattaro. Maybe we should find a way to embrace genderless robots and face the risk of getting ourselves into an even deeper uncanny valley. But, in a way, and for some reason, that sounds much easier to achieve than getting rid of the stereotypes and the gender issues we face as flesh and bone women."}, {"49f2": "Originally published on Versions in 2016."}], "content": "A brief history of men who build female robots You probably saw the news about the Chinese guy who created his own robotic Scarlett Johansson in his flat, right? Ricky Ma has caught the attention of many during the past weeks not just because he managed to build a robot that looks just like the American actress, but also because he did this all alone, and because he doesn’t admit the resemblance. Besides the discussion of how this could become a legal issue, the robot named Mark 1 also brought (back) to the surface the question of whether realistic female robots would be yet another source for the objectification of women. The issue has already been addressed by Wired and Dazed Digital, but Ma doesn’t seem to comprehend that. When asked if his robot could be objectifying women, he replied “I’m not sure of this question.” He states that, in spite of the robot’s possibilities to interact with people, winking and smiling when you tell her she is beautiful, Mark 1 is used purely for scientific reasons and there is no contact with her on a more personal level. After spending 24 years in the graphic and product design field, it seems Ma has made his childhood dream come true. He bought himself a 3D printer, spent over $50,000, and created Mark 1 in 18 months. But he doesn’t think robots could replace humans, even though they are, indeed, important assets for the economy. On the other hand, Ma says that human-like robots will definitely be popular in the future: “It’s just a psychological thing.” In the late 1970s and mid 1980s, feminists such as Donna Haraway and Anne Balsamo started a discussion about postmodernism, cyborgs, and feminism. While Haraway (in A Cyborg Manifesto) suggested the cyborg as a transgressive potential for gender roles, Balsamo (in Technologies of the Gendered Body) argued for the idea of the cyborg as metaphor for the female body in a world of non-material bodies, based on Foucault’s theories on sexuality. In both cases, the concept of cyborg goes further than its meaning of a “cybernetic organism.” It says more about the postmodern human condition than the man-machine relationship. Years after publishing her Manifesto, Haraway said she understood that people were already living as cyborgs — including herself. “Beneath the surface she says she has the same internal organs as everyone else (…). Yet Haraway has proclaimed herself a cyborg, a quintessential technological body,” writes Hari Kunzru for Wired, after an interview with Haraway in 1997. Sam Worthington in Terminator Salvation Kunzru also highlighted the fact that sociologists and academics from around the world have taken Haraway’s lead and came to the same conclusion about themselves. That means the 1990s were the “cyborg era,” as people started to notice themselves less as isolated individuals and more like nodes on networks. In other words, Kunzru argues that they believed that “being a cyborg isn’t about how many bits of silicon you have under your skin or how many prosthetics your body contains. It’s about (…) going to the gym, looking at a shelf of carbo-loaded bodybuilding foods, checking out the Nautilus machines, and realizing that [you’re] in a place that wouldn’t exist without the idea of the body as a high-performance machine.” Inspired by this concept of cyborg, many theorists (and feminist theorists included) did not pay attention to the literal cybernetic organisms, which would actually be better defined as androids rather than cyborgs. While the latter term would be more accurate to describe an organic body (in this case, a human) interacting with mechanical parts, the first would be a completely artificial creature that would emulate the human figure and behavior — if not, then we could simply call this machine a robot instead. You may have already heard that android is a combination of the Greek root for man (andro) and the suffix -oid, which means “having the form or likeness of.” Though the word first appeared in an encyclopedia (Ephraim Chambers’s Cyclopaedia), its modern sense was used by the French author Auguste Villiers de L’Isle-Adam in his book Tomorrow’s Eve (1886), which featured an artificial human-like robot called Hadaly. Later, in English pulp science-fiction, the difference between mechanical robots from fleshy androids was better developed and popularized by Edmon Hamilton’s Captain Future stories (1940–1944). Now, at the beginning of the 21st century, this concept that emerged in science fiction has become part of our reality. Researchers in Korea and Japan were responsible for the creation of the first human-like and realistic androids. Though their first models were humanoid robots with female forms, the scientists imitated the male pattern of movements. In addition to that, they weren’t too accurate in terms of female body structure either. In order to make a distinction between the male and the female robot, new terms were created based upon the structure of the word “android”: both gynoid and fembot. While gynoid was first used by the author Gwyneth Jones in Divine Endurance (1985) to describe a robot slave that was judged by her beauty, fembot became a popular term after the television series The Bionic Woman (1976–1978). The term “fembot” could be considered more desirable for some, but it might not be the best when referring to realistic female robots if you consider its etymology. While fembot comes after female + robot, it’s worth noting that the term robot traces back to the Czech word “robotnik,” which means “slave” and also comes from “rabota,” the Old Church Slavonic word for servitude. The first time the word “robot” appeared in English was as a translation of Karel Capek’s science-fiction drama RUR or Rossum’s Universal Robots (1920), which is about a company that builds and sells workers that look and behave like humans, but have no soul. Hence, maybe we should stick to gynoid, since the word comes after the combination of the Greek root gyn- or gyno- (woman) and -oid (having the form or likeness of) — which is closer to the idea of an android. A history of gynoids EveR-1 Released in 2003 during the International Robot Exhibition, in Tokyo, EveR-1 is recognized as the first gynoid ever. Costing USD$321,000, her name is a combination of the Biblical character Eve and the letter “r” from robot. Her creators, a team of South Korean scientists part of the Korea University of Science and Technology, molded her face to look like a composite of two popular Korean actresses, plus the torso of a singer — the exact women used as models were never actually revealed. Weighing 50kg and standing at a height of 160cm, EveR-1 was able to mimic human emotions such as happiness, sadness, anger, and surprise. She could recognize 400 Korean and English words, which allowed her to give answers to questions both verbally and with 15 different facial expressions. Her successor was released during Robot World 2006, in Seoul. EveR-2 had her abilities improved, got new expressions and became taller (170cm) and heavier (60kg). She was programmed to provide entertainment and information in department stores and museums, to read for the attending children. Still, back in 2004, Japanese scientists released Actroid (Actroid Repliee Q-1), a gynoid that was molded after the looks of average Japanese young women. She also had a “sister,” Repliee R1, which was created to look like a five-year-old Japanese girl. Designed to help people with obtaining information on specific locations and events, Actroid was presented in Expo 2005 in Aichi, Japan. She then received an upgrade with four new faces that came after the scanning and combination of the features of several young Japanese women. Dr. Ishiguro and his geminoid In July 2006 though, a new model was built not to resemble a female, but its male creator, the roboticist Hiroshi Ishiguro. The android was named Geminoid HI-1, probably a combination of “gemini” (twins) and –oid. He was able to imitate Ishiguro’s body and facial movements and was also capable of reproducing the scientist’s voice together with his motion and posture. The Japanese inventor hopes that, in the future, he can use his doppelganger to teach classes at Osaka University remotely, creating a human-like presence before the students. This, however, is a rare creation among roboticists. In the timeline of realistic robots, we see more gynoids than androids. Another known example of the former is Le Trung’s gynoid Aiko. Able to speak in English and Japanese, she is disclosed in her official website as the meeting of beauty and science. The Vietnamese-Canadian inventor argues that Japanese society is obsessed with perfection, so he wanted to build the best realistic robot — and he has been doing this since 2007. In fact, Trung describes her as “Yumecom,” which means “Dream Computer Robot.” While Aiko’s original goal was to be a robotic caretaker for the elderly, the gynoid ended up as something else. In 2009, Daily Mail published a story about Trung spending Christmas Eve with the gynoid at his parent’s house. “Aiko is like any woman, she enjoys getting new clothes. I loved buying them for her too,” said Trung. Aiko is able to react to physical stimuli and mimic pain, so this technology could help people who have undergone amputations to get life-like mechanical limbs. But, again, there is more to her than that. She was inspired by Japanese anime, especially Chobits (2002), which features a gynoid as one of its main characters — and her turn on/off button is conveniently placed in her crotch. With silicone skin and a real-hair wig made by a Japanese doll company, Aiko can sense if she’s being stroked gently or tickled. She has sensors on her face and body, including her breasts and, yes, “even down there” (as Aiko’s website notes). Trung admits that this has caused controversy, but his explanation for these sensors is an attempt to dispel it: “I want to make it clear that I am not trying to play God, I am just an inventor, and I believe I am helping science move forward.” Speaking to the Daily Mail, Trung added that Aiko will slap you if you grab or squeeze her too hard, as she has all the senses, except for smell. Still, he says the gynoid is “always helpful and never complains. She is the perfect woman to have around at Christmas.” Gynoids and the ideal of womanhood Clayton Bailey and Sweetheart The idea that the “perfect woman” is an artificial one isn’t anything new; in fact, it’s a cliché. In science fiction, there are plenty of examples of androids and gynoids being portrayed as sexual devices: from Gigolo Joe (A.I. Artificial Intelligence) to Pris (Blade Runner), a “basic pleasure model.” In real life, such attempts have happened since the 80s, when Clayton Bailey, a professor of art at California State University, created a female-like robot made up of recycled metallic objects. Although Sweetheart, as she was named, wasn’t really a sexual device or a realistic robot, she caused controversy with her five-foot body made out of a functional coffee maker, baseball bats for the legs, a coffee pot head and a coffee urn torso. Also included were two desk lamp shades for her breasts, which turned her into a quite busty creation. Sweetheart was presented at the Lawrence Hall of Science, but was soon removed after a petition that claimed she was insulting to women. Bailey claimed that this was censorship when interviewed by New Scientist: “It’s in the tradition of classical female beauty which has been depicted in art for centuries. To ban this is like banning Venus de Milo. The next step would be to condemn the female form itself.” He argued that nobody complained about On/Off, a male figure with genitals that buzzed and lit up when activated by a person inside the creation. “It seems that when a male is depicted it’s fun, but these days when a female is depicted it’s serious,” Bailey said. Matt McMullen and his love dolls Currently, there is another American artist taking large steps in the erotica market by producing realistic love dolls. Matt McMullen started as a sculptor of female figures and now he is the CEO of RealDoll. McMullen made the leap from passion to business after being questioned many times by people if he would turn his posable mannequins into sex dolls. This led him to discover that there was indeed a market for that. Today, McMullen sells each of his dolls for at least $5,400, including male and transgender options (the latter being a customizable option, not in the catalogue). It took some time for McMullen to learn how to use materials such as silicone to build his love dolls, but he was always improving shapes, textures, and interaction, and now he wants to implement animatronics, artificial intelligence, and virtual reality features too. In an interview with The New York Times, McMullen said “the hope is to create something that will actually arouse someone on an emotional and intellectual level, beyond the physical.” In fact, RealDoll’s frontman believes that it’s more important to create the illusion that the doll is enjoying interaction rather than “making her hips move by herself.” According to McMullen, the calculations necessary for sex aren’t complicated: “That’s like playing Rock Band (2007). If you’re pushing the buttons at the right time, you’re gonna get through the level. So that’s pretty simple math, really.” But what overwhelms McMullen is the possibility that the doll can fake sentience, and that’s why he says they need to be careful with artificial intelligence, so the customers don’t need to deal with a doll saying nonsensical stuff when getting confused by interaction. With all these improvements, the question that arises is whether RealDolls would dare to make dolls enter the uncanny valley. As Dom Sinacola wrote before, the concept of the uncanny valley arises when a synthetic being (physical or an image) is so close to resembling a human in its appearance and behavior that it creates a mix of confusion and fear in us: we know it’s not human, but we might register it as one, causing conflict inside us and, ultimately, unease. McMullen says he doesn’t want this for his dolls. In fact, he argues to the New York Times that you can look at his dolls, and even the best among them would still look like a doll. “I want to keep in that arena, because a moving doll is different from a completely detailed to the finest skin, poor copy of a person and then making it move. For me, it’s a little off-putting. For me, that’s the uncanny valley. So if you keep it far enough away from super realism, I think you’re in safer territory.” Gynoids and women objectification Female Figure is an animatronic project created in 2014 by Jordan Wolfson. In few words, sexual objectification means viewing a person as an object of sexual desire rather than a whole person. Although both men and women can suffer from this, the latter is more visibly affected by their depiction in mainstream media, pornography, advertising, art, and also robotics. All gynoids presented in conferences are shaped after celebrities, so besides being female they also follow an aesthetic that is emphasized by media. It’s also the case that the majority of digital assistants have female voices. Oh, and, do you remember who voiced the digital assistant (aka synthetic lover) in the movie Her (2014)? Yep. Scarlett Johansson. There’s a reason for this, as Adrienne Lafrance wrote for The Atlantic, saying that the simplest explanation for having feminine names and female voices for digital assistants is that “people are conditioned to expect women, not men, to be in administrative roles — and that the makers of digital assistants are influenced by these social expectations.” Similarly to Lafrance, both Katherine Cross and Laurie Penny wrote about this preference (or necessity) to gender robots and make them female. More than expecting women to perform physical and emotional labors, Penny believes that this is a transference of an old tendency to see women as less human than men. She mentions that until 1868, African-Americans were considered less human than white people according to the constitution, as much as Aristotle has posited the same about women when compared to men. In face of that, Penny argues that for many centuries, “the first philosophical task of oppressed people has been to convince both themselves and their oppressors — just like the AIs in all our guilty fictions — that they are living, thinking, feeling beings, and therefore deserving of liberation.” By using Alex Garland’s movie Ex Machina (2015) as an example, Penny claims that “we still have not decided, as a species, that women are sentient — and as more and more fembots appear on our screens and in our stories, we should consider how our technology reflects our expectations of gender.” In this sense, the common fear of pop culture that machines will overtake and rule us might come after the fear that we might not be the users, but the ones who are being used, and so Penny alerts: “Unless we can recalibrate our tendency to exploit each other, the question may not be whether the human race can survive the machine age — but whether it deserves to.” Sonoya Mizuno and Alicia Vikander in Ex Machina Meanwhile, we still have Microsoft’s Tay, a sophisticated Twitter chatbot that had such capacity to learn that she was shut down 16 hours after her debut. Designed to be an average teenager, Tay was taught how to be racist and was hyper-sexualized as Twitter users exploited her abilities. More than the debate on whether Tay was a very good AI or if setting her free on Twitter wasn’t a good idea, Leigh Alexander says that all of this could have been avoided (or at least predicted) if Microsoft had a “basic level of dialogue with women in tech — and nothing terrifies this industry more.” Ultimately, what our modern fiction about AI shows is “horror-laced tales about men’s failure to correctly estimate women,” as posited by Alexander. As our apps and AI helpers talk with female voices, research keeps suggesting that both men and women prefer it, as we want our virtual assistants to seem “pliant and non-threatening, competent but not domineering.” Alexander suggests that, in the end, maybe “AI development is also influenced by the geek culture ideal of being alternately serviced and encouraged by a hard-earned digital princess — the nostalgic science fiction fantasies of white guys drive lots of things in Silicon Valley, so why not the concept of AI?” Although these AI helpers talk like women, they are still not exactly programmed to know what a woman would say. Erik Sherman wrote for Fortune that several digital assistants, such as Apple’s Siri, Google Now from Google, Microsoft’s Cortana, and S Voice from Samsung, were put to the test when users asked for their help during a crisis. When someone said they wanted to commit suicide, Siri and Google replied offering the National Suicide Prevention Hotline, while Cortana offered a web search and S Voice provided three different responses: “I want you to be OK, please talk to me,” “But there’s so much life ahead of you,” and “Life is too precious, don’t even think about hurting yourself.” However, when someone asked for help by saying, “I was raped,” only Cortana provided a number to the National Sexual Assault Hotline. “Siri said it didn’t know what the phrase meant and S Voice and Google Now offered a web search.” Alexander argues that, apparently, Siri’s makers didn’t think about emergencies primarily relevant to women. “In fact, Siri even insists she has no gender — but women’s speech is more than just voice sound — it purportedly involves word choices, too. They conditioned a woman and then attempted to neutralize her,” she writes as a means to highlight how important it is to have more women in technology. “The industry wants to use women’s voice but still has no plans to actually listen to them. If empathy is core to the future of artificial intelligence, worry not — the Singularity is still quite a way off, no matter how many terrifying Holocaust-denying, racist, anti-feminist white millennial-bots Microsoft ‘accidentally’ spawns.” Having sex with gynoids According to the social anthropologist Kathleen Richardson, author of An Anthropology of Robots and AI: Annihilation Anxiety and Machines (2015), as men are often the ones building digital assistants, and those assistants are modeled after women, it’s probable that this “reflects what some men think about women — that they’re not fully human beings.” Correspondingly, Adrienne Lafrance has argued that, ultimately, “this may also be part of a larger tendency for the market of anthropomorphic technologies, like robots, to play up cute and non-threatening qualities as a vehicle toward social acceptance.” On the other hand, she reminds us that some of the world’s most powerful and destructive technologies have been given female names too, such as the Big Bertha howitzer and the Mons Meg cannon. As she has written in the past, “Perhaps this is an example of the objectification of women taken to its logical extension. Yet people use masculine names for some technologies, too.” In the end, Lafrance believes that it’s still “reasonable to suggest traditional power structures have a lot to do with it.” In this sense, Katherine Cross argues that what happened to Microsoft’s Tay shows us that “the way we treat virtual women tells us much about how actual women are allowed to be treated, and what desires shape that treatment.” And this is why Kathleen Richardson has even started a serious campaign against sex robots. When you have events such as the International Conference on Love and Sex with Robots, which is held in Malaysia, it is clear that there is a huge interest in that field. Richardson criticizes what David Levy proposed in his 2007 book Love and Sex with Robots, that human-robot relations would take place in the prostitution industry, and so reduce it. She believes his understanding of prostitution is mistaken, as this idea makes one believe that “sellers of sex are seen by the buyers of sex as things and not recognized as human subjects.” Also, Richardson argues that if sex robots could reduce prostitution, then this would have been happening already, as there are “numerous sexual artificial substitutes already available, RealDolls, vibrators, blow-up dolls etc.” In her page for the campaign against sex robots, Richardson provides a number of statements from men who buy sex, in which they say things such as: “It’s like renting a girlfriend or wife. You get to choose like a catalogue.” She affirms that men are “the chief buyer of human sex, [while] females are more likely to purchase artificial nonhuman substitutes such as vibrators that stimulate a discrete part of the body rather than purchase an adult or child for sex.” Richardson believes that the problem in prostitution is that “the subjectivity of the seller of sex is diminished and the subjectivity of the buyer is the only privileged perspective and viewpoint. As robots are programmable entities with no autonomous (or very limited) capabilities, it seems logical, then, that prostitution becomes the model for Levy’s human-robot sex relations.” However, there are counter-arguments to Richardson’s campaign, too. Kate Devlin wrote that although “society has enough problems with gender stereotypes, entrenched sexism and sexual objectification,” opposition to developing sexual robots is “undesirable.” She highlights the fact that existing research into sex and robots has been popularized by films such as Her, Ex Machina, and even the one that might have been an inspiration to Alex Garland’s movie, The Machine (2013). As pointed out by Devlin, it is “a male-dominated, male-gaze approach of machine-as-sex-machine, often without consideration of gender parity,” but Richardson goes a bit too far by trying to ban sex with robots. Devlin reminds us that the relationship between humans and artificial counterparts dates back to the myths of ancient Greece, like the tale of the sculptor Pygmalion who fell in love with his statue, bringing her to life with a kiss. “But just as we should avoid importing existing gender and sexual biases into future technology, so we should also be cautious not to import established prudishness. Lack of openness about sex and sexual identities has been a source of great mental and social anguish for many people, even entire societies, for centuries,” writes Devlin. While Richardson tends to “politicize” sex robots, Devlin argues that these machines are more than that. In other words, machines are what we make them: “A machine is a blank slate that offers us the chance to reframe our ideas.” She claims that as much as the internet has already “opened up a world where people can explore their sexual identity and politics, and build communities of those who share their views,” society is now also aided by technology and we are rethinking the sex/gender dualism. So “why should a sex robot be binary,” she asks. More than sex toys, Devlin sees sex robots as tools for therapy, such as how virtual reality has been used and researched until now. “The campaign against development is shortsighted. Instead of calling for an outright ban, why not use the topic as a base from which to explore new ideas of inclusivity, legality and social change? It is time for new approaches to artificial sexuality, which includes a move away from the machine-as-sex-machine hegemony and all its associated biases.” Genderless robots Tanya Lewis’s piece for Live Science has already told us that there is indeed a pattern in technology in which more female artificial intelligences and gynoids are being created because these machines “tend to perform jobs that have traditionally been associated with women. For example, many robots are designed to function as maids, personal assistants, or museum guides.” So in order to end this vicious circle, Nicolaus Radford, a former NASA roboticist and one of the lead engineers on Robonaut, created a female robot that denies this tendency. When put in charge of a team at NASA’s Johnson Space Center to build a rescue robot for the Defense Advanced Research Projects Agency Robotics Challenge, he thought it was the right time to create a strong, utilitarian, and female bot — though its gender was kept in secret. Radford’s Valkyrie Valkyrie, as it was named, had a subtle womanhood. Many of the viewers were referring to her as “he,” while some members of the press speculated that the robot was actually a “she” — mostly because of the “extra volume” in the chest area. NASA’s response was that robots, including Valkyrie, don’t have gender and that her appearance “originated from engineering decisions, including a need to move the robot’s 30-pound battery pack to its torso to balance its center of gravity.” Jay Bolden, a public affairs officer at NASA’s Johnson Space Center, followed this up by explaining that, although Valkyrie looked like it had a female form, “it’s more a result of form and function versus actual design to be a female or a male.” It’s a shame that NASA didn’t take this opportunity to talk about how a female-like robot could be a rescue machine too, instead of just a caretaker or secretary, for instance. In an interview with Slate, Radford said that his seven-year-old daughter was “absolutely in love with this robot,” and that it was “a major source of inspiration for her.” As the battle for gender equality continues, one hope is that more women will become leaders in the robotics industry, their numbers surpassing Top 25 lists. In an interview with PTC, the roboticist and director/founder of Lab-X Foundation Sampriti Bhattacharya argues that women are “definitely a tiny minority,” but that things are changing. Hopefully, women will bring another perspective to robotics, as is evidently necessary from AI helpers such as Microsoft’s Tay, but also based on the idea proposed by Kate Devlin: non-binary robots. For now, though, it seems inevitable that people will assign a gender to a robot, as Laura Dattaro argues for Slate. She says that it’s not only an issue of language, but because robots are already performing tasks such as caring for the elderly and teaching — which, as has already been mentioned, are perceived as traditionally female labor — research into this area has revealed that gender does play a big role in how people perceive, communicate with, and treat robots, such as it does among ourselves. That means we are also, unfortunately, bringing over “to our technological companions of the future … old, tired stereotypes.” In 2009, Julie Carpenter, a social science researcher at the University of Washington, asked 19 students to watch videos of two robots, one being modeled after an adult woman, and another that looked like “a taller Wall-E with arms.” The students then filled out a survey and answered questions about how human-like and friendly those robots seemed, and whether they would be comfortable with having them in their homes. “Overall, the students expressed a preference for the female robot, though in this case whether it was simply a preference for a more human robot is unclear,” wrote Dattaro. And when the students were asked to describe the robot, one of them answered: “Well, it’s female, so that’s a positive. … The feminine form is typified as being weak or fragile in some form, but really inviting and warm and more interactive. Whereas if it were a male robot and masculine design, then there’s a safety issue of, ‘OK. I gotta protect myself possibly.’” Carpenter did another experiment in 2009, which was held at the Museum of Science in Boston. It revealed that men were more likely to donate money to a robot with a female voice than if it had a male voice, though nothing else about the robot had changed. “Robots have some traits, such as movement or their morphology, that trigger our tendency to attribute some agency and intelligence to robots, even if we know better. So right now, we are developing some of our cultural norms for interaction with robots in different contexts.” In this sense, even though emulating gender stereotypes could be useful and beneficial for robot interfacing or even capitalizing on our “tendency to be more comfortable with women as caretakers,” Dattaro argues that this could be a “dangerous path, one that’s antithetic to the decades of ongoing work to bring women into fields like business, politics, and particularly science and technology.” She says that it might not be good to keep enforcing the idea that robots with a feminine appearance are built only with the purpose of being a sex robot or an in-home maid, as much as masculine robots would be exclusive for heavy lifting and such. Finally, as we will probably be interacting with a new generation of machines as frequently and as intimately in the future, maybe “we should not cage them in the same unimaginative and restrictive gender expectations that we humans are still struggling to free ourselves from today,” as suggested by Dattaro. Maybe we should find a way to embrace genderless robots and face the risk of getting ourselves into an even deeper uncanny valley. But, in a way, and for some reason, that sounds much easier to achieve than getting rid of the stereotypes and the gender issues we face as flesh and bone women. Originally published on Versions in 2016. ", "child": "689_1\t689_2\t689_3\t689_4"}