{"name": "691", "parent": "", "title": "Tests Results Are In", "sentences": [{"7f03": "Tests Results Are In"}, {"cc10": "Dunbar’s Number Blog 2"}, {"df19": "I swear by the supermassive black hole at the center of this universe, if I hear the word potential one more time, I am going to scream."}, {"e031": "For the last two days, it been maths potential this, and physics potential that, and “Oh, you have so much potential”. It’s enough to make me get a phase-disruptor and shoot holes in the forcefield of this dome. How’s that for potential?"}, {"6780": "According to Hallie that sentiment is “within acceptable expression of frustration”. So she doesn’t think I’m nebulized just yet, isn’t that great? I did see her put flag on my file though so she’s more disturbed than she wants me to know."}, {"79b7": "Of course I wouldn’t really compromise the dome. That’s stupid. Everyone dying isn’t going to solve my problem. You know what would solve my problem? One person dying. Just one. It is possible. Pre-atmospheric conditions aren’t exactly safe. And plenty of people venture outside of the dome every day. A lot can happen in two months."}, {"3c2a": "Now that I think about it, that thought probably got me flagged."}, {"6f76": "The flag is a load of wastebags. Just because I am aware that someone dying would solve my problem doesn’t mean I want someone to die. Or that I would do anything to cause a death. It’s just me acknowledging it would be beneficial to me, personally. And no, I’m not counting on that to happen. Honestly, I would probably be devastated if it did happen."}, {"05f2": "Those test they made me do are a load of wastebags too. The result is just “you can be whatever you want to be” with numbers attached. Nothing that obviously stands out. It did sort of rule something out. According to the tests I am not an ideal candidate for planet prospector. It feels like the best option, if I’m going to choose my future wrong, I might as well choose spectacularly wrong and go out supernova."}, {"2b8a": "Hallie suggested I start taking mood stabilizers."}, {"5271": "Forget her. I’m going to be a planet prospector, just to prove the tests are wastebags."}], "content": "Tests Results Are In Dunbar’s Number Blog 2 I swear by the supermassive black hole at the center of this universe, if I hear the word potential one more time, I am going to scream. For the last two days, it been maths potential this, and physics potential that, and “Oh, you have so much potential”. It’s enough to make me get a phase-disruptor and shoot holes in the forcefield of this dome. How’s that for potential? According to Hallie that sentiment is “within acceptable expression of frustration”. So she doesn’t think I’m nebulized just yet, isn’t that great? I did see her put flag on my file though so she’s more disturbed than she wants me to know. Of course I wouldn’t really compromise the dome. That’s stupid. Everyone dying isn’t going to solve my problem. You know what would solve my problem? One person dying. Just one. It is possible. Pre-atmospheric conditions aren’t exactly safe. And plenty of people venture outside of the dome every day. A lot can happen in two months. Now that I think about it, that thought probably got me flagged. The flag is a load of wastebags. Just because I am aware that someone dying would solve my problem doesn’t mean I want someone to die. Or that I would do anything to cause a death. It’s just me acknowledging it would be beneficial to me, personally. And no, I’m not counting on that to happen. Honestly, I would probably be devastated if it did happen. Those test they made me do are a load of wastebags too. The result is just “you can be whatever you want to be” with numbers attached. Nothing that obviously stands out. It did sort of rule something out. According to the tests I am not an ideal candidate for planet prospector. It feels like the best option, if I’m going to choose my future wrong, I might as well choose spectacularly wrong and go out supernova. Hallie suggested I start taking mood stabilizers. Forget her. I’m going to be a planet prospector, just to prove the tests are wastebags. ", "child": "691_1"}