{"name": "695", "parent": "", "title": "Trump Signs Deal With NBC For New TV Series: “The Real First Family of D.C.”", "sentences": [{"6dcf": "Truth In Satire"}, {"8cf6": "Trump Signs Deal With NBC For New TV Series: “The Real First Family of D.C.”"}, {"fd2b": "President says having cameras in White House for reality TV show will not affect “the unbelievable job I’m doing for our country”"}, {"6cde": "Among the many other things President Donald Trump has been focused on since his election, we now know that one of them was shopping around a reality TV show featuring his family’s eventful new life in Washington, titled, The Real First Family of D.C."}, {"ae91": "That news came yesterday when the White House announced that the president had signed a deal with NBC to co-produce and star in the series that will begin airing Memorial Day weekend, according to network sources. The show’s executive producer will be Mark Burnett, who worked with Mr. Trump in the past on The Apprentice, also an NBC program."}, {"d84a": "According to those who’ve seen test footage of the show, one segment features Ivanka, Don Jr., and Eric turning viciously on half-sister, Tiffany. (Credit: ABC News/US Weekly)"}, {"926a": "The official statement read: “President Donald J. Trump and the First Family are thrilled to be part of a new production from NBC titled The Real First Family of D.C."}, {"4c23": "The President has no doubt that this will be the greatest show in the history of television — much bigger than The Apprentice, The Celebrity Apprentice and Roots combined. This new ‘mega-hit in the making’ fuses the gripping family drama of HBO’s Game of Thrones with the sizzling political intrigue of the Netflix series, House of Cards.”"}, {"27dd": "President Trump, clearly excited by the launch of the show, tweeted at 3am: “Wow. Big news! America’s First Family coming to you in prime time starting in May! Must-see TV!”"}, {"13a3": "Several production assistants working closely with Mark Burnett, revealed that the first episode will open with television news footage taken at last summer’s Republican convention."}, {"fe19": "Asked later during a press conference how he planned to work the production demands of a television show into his already packed political schedule, Mr. Trump answered: “Look, from the very first moment I announced my candidacy, I was hoping that an election victory would result in a television experience giving every American an incredible peek into the workings of their government. Talk about transparency! I’m going to be the most transparent president ever, and The Real First Family of D.C., from Donald J. Trump Productions, is the proof.”"}, {"171e": "The revelation that Mr. Trump has been positioning the reality show for sale to a television network for more than a year may help explain why Jared Kushner and Ivanka Trump moved their family from New York to Washington so quickly after the election. Taking prominent positions within the administration from day one guarantees them both plenty of camera time when shooting begins later this month."}, {"56dd": "Sources close to Steve Bannon say he fully expected to be a major cast member of the show and went to war with Jared Kushner when the dimpled son-in-law lobbied the president for more prominent roles for himself and wife Ivanka."}, {"ed88": "One NBC television executive, who spoke off the record, added that Melania’s decision to live in New York City was actually a plot device suggested by Mark Burnett to create the appearance of tension between the President and First Lady. Burnett felt strongly that planting the seeds of a potential messy divorce, played out on a national stage, was a proven way to hook viewers in the first season."}, {"06b5": "Mr. Trump also proposed adding a “hot young mistress or a horny White House intern” to the plot line to give it more authenticity. Network sources would not say if a decision has been made on the president’s proposal, but did confirm that Mr. Trump has added a casting couch to the Oval Office."}, {"270e": "The unprecedented news of a reality show taking place within the White House has raised alarm bells in the intelligence community. One longtime FBI special agent, speaking anonymously, noted that President Trump’s well-documented love of television, along with his now confessed desire to turn his presidency into a major media event via reality TV, might shed light on his apparent willingness to collude with the Russians to win the election at any cost — including criminal interference."}, {"8fbf": "In 2010, businessman Trump was quoted as saying, “Television is the be-all and end-all of my life — I’d rather have a hit TV show than become the President of the United States.” It’s possible that with the launch of The Real First Family of D.C., he has figured out how to do both."}, {"c69f": "****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment."}, {"25a5": "And click here for my most popular post, or at least one I liked writing a whole lot."}, {"e537": "— AI"}], "content": "Truth In Satire Trump Signs Deal With NBC For New TV Series: “The Real First Family of D.C.” President says having cameras in White House for reality TV show will not affect “the unbelievable job I’m doing for our country” Among the many other things President Donald Trump has been focused on since his election, we now know that one of them was shopping around a reality TV show featuring his family’s eventful new life in Washington, titled, The Real First Family of D.C. That news came yesterday when the White House announced that the president had signed a deal with NBC to co-produce and star in the series that will begin airing Memorial Day weekend, according to network sources. The show’s executive producer will be Mark Burnett, who worked with Mr. Trump in the past on The Apprentice, also an NBC program. According to those who’ve seen test footage of the show, one segment features Ivanka, Don Jr., and Eric turning viciously on half-sister, Tiffany. (Credit: ABC News/US Weekly) The official statement read: “President Donald J. Trump and the First Family are thrilled to be part of a new production from NBC titled The Real First Family of D.C. The President has no doubt that this will be the greatest show in the history of television — much bigger than The Apprentice, The Celebrity Apprentice and Roots combined. This new ‘mega-hit in the making’ fuses the gripping family drama of HBO’s Game of Thrones with the sizzling political intrigue of the Netflix series, House of Cards.” President Trump, clearly excited by the launch of the show, tweeted at 3am: “Wow. Big news! America’s First Family coming to you in prime time starting in May! Must-see TV!” Several production assistants working closely with Mark Burnett, revealed that the first episode will open with television news footage taken at last summer’s Republican convention. Asked later during a press conference how he planned to work the production demands of a television show into his already packed political schedule, Mr. Trump answered: “Look, from the very first moment I announced my candidacy, I was hoping that an election victory would result in a television experience giving every American an incredible peek into the workings of their government. Talk about transparency! I’m going to be the most transparent president ever, and The Real First Family of D.C., from Donald J. Trump Productions, is the proof.” The revelation that Mr. Trump has been positioning the reality show for sale to a television network for more than a year may help explain why Jared Kushner and Ivanka Trump moved their family from New York to Washington so quickly after the election. Taking prominent positions within the administration from day one guarantees them both plenty of camera time when shooting begins later this month. Sources close to Steve Bannon say he fully expected to be a major cast member of the show and went to war with Jared Kushner when the dimpled son-in-law lobbied the president for more prominent roles for himself and wife Ivanka. One NBC television executive, who spoke off the record, added that Melania’s decision to live in New York City was actually a plot device suggested by Mark Burnett to create the appearance of tension between the President and First Lady. Burnett felt strongly that planting the seeds of a potential messy divorce, played out on a national stage, was a proven way to hook viewers in the first season. Mr. Trump also proposed adding a “hot young mistress or a horny White House intern” to the plot line to give it more authenticity. Network sources would not say if a decision has been made on the president’s proposal, but did confirm that Mr. Trump has added a casting couch to the Oval Office. The unprecedented news of a reality show taking place within the White House has raised alarm bells in the intelligence community. One longtime FBI special agent, speaking anonymously, noted that President Trump’s well-documented love of television, along with his now confessed desire to turn his presidency into a major media event via reality TV, might shed light on his apparent willingness to collude with the Russians to win the election at any cost — including criminal interference. In 2010, businessman Trump was quoted as saying, “Television is the be-all and end-all of my life — I’d rather have a hit TV show than become the President of the United States.” It’s possible that with the launch of The Real First Family of D.C., he has figured out how to do both. **** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post, or at least one I liked writing a whole lot. — AI ", "child": "695_1\t695_2\t695_3\t695_4\t695_5\t695_6\t695_7\t695_8\t695_9\t695_10\t695_11\t695_12\t695_13\t695_14\t695_15\t695_16\t695_17\t695_18\t695_19\t695_20\t695_21\t695_22\t695_23\t695_24"}