{"name": "696", "parent": "", "title": "Catharsis, Via Cartoons", "sentences": [{"d067": "Catharsis, Via Cartoons"}, {"a4d6": "How can a country process national grief through art? ‘Your Name,’ which has broken box-office records for an anime film, was inspired by the 2011 earthquake that devastated Japan. It’s not the first time the genre has provided an outlet for reconciliation."}, {"c218": "Your Name is the animated feature film that broke Japanese box-office records last summer before opening in North American theaters in April. It’s the saddest, most emotionally devastating body-swapping teen rom-com you’ll ever watch. Set in Japan, Your Name is the story of two distant strangers — a boy named Taki who lives in Tokyo and a girl named Mitsuha who lives in a far-off, fictional town called Itomori — who wake one day to find that they’ve swapped bodies. Naturally, Taki and Mitsuha freak out. The body-swap reverses each night, the process going on indefinitely, and so Taki and Mitsuha quickly develop a smartphone correspondence protocol that allows them to establish some ground rules (“no baths!”), boundaries, and feedback on one another’s behavior. The two teens are also separated by three years in time, a span that gives Taki an advance look at an unforeseen calamity that looms over Mitsuha’s hometown. And so the movie’s goofy meet-cute premise spirals into natural disaster."}, {"00e0": "The calamity at the heart of Your Name was inspired by the biggest tragedy that Japan has faced in this century. The director, Makoto Shinkai — one of the country’s most acclaimed animators of contemporary film — has said that he conceived the story and, yes, even the supernatural body-swapping conceit, in response to the March 2011 earthquake and tsunami that killed nearly 16,000 people and literally shifted Japan’s coastline and the Earth’s rotation with its tremendous 9.0 magnitude."}, {"bb97": "“It was the largest [earthquake] in a thousand years, and there was something similar 1,000 years ago, which we all forgot about,” Shinkai told Vice, referring to an earthquake that geologists say wrecked the Sendai coastline in 869. “We think they’re just dangers from the past.” For many filmgoers, the catastrophe that Taki and Mitsuha reckon with in Your Name represents a fresh hell that hasn’t quite subsided."}, {"b37a": "It’s only natural that anime would prove such a productive medium for processing national grief. The anime industry itself was largely born out of Japan’s great modern trauma, World War II."}, {"b456": "The war has inspired a great many works by Japanese illustrators and animators. The author Keiji Nakazawa, who survived the U.S. bombing of Hiroshima, created the manga series Barefoot Gen about a 6-year-old boy, Gen Nakaoka, who lives to recount the gruesome details of the bomb’s aftermath. In 1983, Nakazawa adapted Barefoot Gen into an animated feature film, which depicts poverty, disease, and death in great detail despite Nakazawa’s classically cute character designs."}, {"6bb6": "The most famous anime feature about Japan’s post-war period, Grave of the Fireflies — directed by Isao Takahata and released by Studio Ghibli in 1988 — follows two young siblings, Seita and Setsuko, who succumb to starvation in the rural wilderness at the close of the war after having survived the U.S. firebombing of Kobe in 1945. Grave of the Fireflies is an acutely stressful film to watch: Takahata renders PTSD symptoms on screen by slowly injecting scenes of rural calm with initially imperceptible hints of terror, as every happy thought and memory that the 14-year-old Seita has left degrades into vivid reenactment of aerial bombardment."}, {"2c17": "Why Do Anonymous Twitter Trolls Use Anime Avatars?Blame 4chantheringer.com"}, {"ba83": "The most recent anime film to engage with this history, In This Corner of the World, premiered in Japan last fall. Set in the port city of Kure near Hiroshima in the final stages of the war, the film examines the bombing at a greater distance than Gen or Grave, focusing on civilian life at the outskirts of the war effort and Little Boy’s blast radius. Still, all three stories are set in the vicinity of that aftermath, their characters grappling with literal, if fictionalized, accounts. They are history lessons. That’s just one way to go about coping with horrors of the past through the freedom of cartoon motion."}, {"cfcf": "But Shinkai’s movie takes a different, whimsical approach. Your Name reimagines the 2011 earthquake as a different sort of disaster, in service of a supernatural character drama that defies realism all together. The film’s closest kin is the 2011 anime TV series Mawaru-Penguindrum, which reimagined the Aum Shinrikyo cult’s infamous 1995 sarin gas attack on the Tokyo subway as a tale of magical girls, penguin sidekicks, and time travel. Shinkai, too, weaves fact and fiction. As much as the imminent calamity at the heart of Your Name is clearly inspired by the Tōhoku earthquake, Shinkai cites an old Ono no Komachi poem about two strangers meeting in a dream as an inspiration for Taki and Mitsuha’s tragic adventure."}, {"c313": "Beyond Japan, there is no global shortage of sad cartoons. That sadness comes in however many forms and colors you like. Where Japan has the feature films of Shinkai, Takahata, and the cry-GIF master Mamoru Hosoda, the U.S. has Pixar movies such as Up and Inside Out, in which characters suffer acute grief and general depression, respectively."}, {"d714": "Among cartoons aimed at adult audiences, Netflix’s raunchy Hollywood satire BoJack Horseman is especially acclaimed for its take on depression, but even kid-friendly shows such as Steven Universe and Rick and Morty subject their characters to bouts of trauma and melancholia. Without upending its vulgar irreverence, Rick and Morty has carefully navigated abusive relationships and sexual assault. The heroes of Steven Universe battle their fair share of cartoon villains, but the titular character’s greatest ordeal is coping with the death of his mother, the superhero he never knew."}, {"1e1f": "Steven Universe Cures Superhero PessimismThe Cartoon Network series provides what other animated series are missingtheringer.com"}, {"95e0": "And yet, there’s no great American cartoon about 9/11, perhaps because our national traumas are too refracted through pluralism to translate so broadly in our cartoons. There’s a sense of escapism at the heart of all animated works — even in something as grim as Barefoot Gen — but Your Name is part of a robust tradition that re-fashions that escapism as a salve, not an out. Worldwide, Makoto Shinkai has topped the box-office success of every Studio Ghibli movie with a sad, gorgeous film about love and disaster, the latter inspired by actual devastation. Your Name is where adolescence meets the crush of human history, and where escapism meets catharsis. They belong together."}], "content": "Catharsis, Via Cartoons How can a country process national grief through art? ‘Your Name,’ which has broken box-office records for an anime film, was inspired by the 2011 earthquake that devastated Japan. It’s not the first time the genre has provided an outlet for reconciliation. Your Name is the animated feature film that broke Japanese box-office records last summer before opening in North American theaters in April. It’s the saddest, most emotionally devastating body-swapping teen rom-com you’ll ever watch. Set in Japan, Your Name is the story of two distant strangers — a boy named Taki who lives in Tokyo and a girl named Mitsuha who lives in a far-off, fictional town called Itomori — who wake one day to find that they’ve swapped bodies. Naturally, Taki and Mitsuha freak out. The body-swap reverses each night, the process going on indefinitely, and so Taki and Mitsuha quickly develop a smartphone correspondence protocol that allows them to establish some ground rules (“no baths!”), boundaries, and feedback on one another’s behavior. The two teens are also separated by three years in time, a span that gives Taki an advance look at an unforeseen calamity that looms over Mitsuha’s hometown. And so the movie’s goofy meet-cute premise spirals into natural disaster. The calamity at the heart of Your Name was inspired by the biggest tragedy that Japan has faced in this century. The director, Makoto Shinkai — one of the country’s most acclaimed animators of contemporary film — has said that he conceived the story and, yes, even the supernatural body-swapping conceit, in response to the March 2011 earthquake and tsunami that killed nearly 16,000 people and literally shifted Japan’s coastline and the Earth’s rotation with its tremendous 9.0 magnitude. “It was the largest [earthquake] in a thousand years, and there was something similar 1,000 years ago, which we all forgot about,” Shinkai told Vice, referring to an earthquake that geologists say wrecked the Sendai coastline in 869. “We think they’re just dangers from the past.” For many filmgoers, the catastrophe that Taki and Mitsuha reckon with in Your Name represents a fresh hell that hasn’t quite subsided. It’s only natural that anime would prove such a productive medium for processing national grief. The anime industry itself was largely born out of Japan’s great modern trauma, World War II. The war has inspired a great many works by Japanese illustrators and animators. The author Keiji Nakazawa, who survived the U.S. bombing of Hiroshima, created the manga series Barefoot Gen about a 6-year-old boy, Gen Nakaoka, who lives to recount the gruesome details of the bomb’s aftermath. In 1983, Nakazawa adapted Barefoot Gen into an animated feature film, which depicts poverty, disease, and death in great detail despite Nakazawa’s classically cute character designs. The most famous anime feature about Japan’s post-war period, Grave of the Fireflies — directed by Isao Takahata and released by Studio Ghibli in 1988 — follows two young siblings, Seita and Setsuko, who succumb to starvation in the rural wilderness at the close of the war after having survived the U.S. firebombing of Kobe in 1945. Grave of the Fireflies is an acutely stressful film to watch: Takahata renders PTSD symptoms on screen by slowly injecting scenes of rural calm with initially imperceptible hints of terror, as every happy thought and memory that the 14-year-old Seita has left degrades into vivid reenactment of aerial bombardment. Why Do Anonymous Twitter Trolls Use Anime Avatars?Blame 4chantheringer.com The most recent anime film to engage with this history, In This Corner of the World, premiered in Japan last fall. Set in the port city of Kure near Hiroshima in the final stages of the war, the film examines the bombing at a greater distance than Gen or Grave, focusing on civilian life at the outskirts of the war effort and Little Boy’s blast radius. Still, all three stories are set in the vicinity of that aftermath, their characters grappling with literal, if fictionalized, accounts. They are history lessons. That’s just one way to go about coping with horrors of the past through the freedom of cartoon motion. But Shinkai’s movie takes a different, whimsical approach. Your Name reimagines the 2011 earthquake as a different sort of disaster, in service of a supernatural character drama that defies realism all together. The film’s closest kin is the 2011 anime TV series Mawaru-Penguindrum, which reimagined the Aum Shinrikyo cult’s infamous 1995 sarin gas attack on the Tokyo subway as a tale of magical girls, penguin sidekicks, and time travel. Shinkai, too, weaves fact and fiction. As much as the imminent calamity at the heart of Your Name is clearly inspired by the Tōhoku earthquake, Shinkai cites an old Ono no Komachi poem about two strangers meeting in a dream as an inspiration for Taki and Mitsuha’s tragic adventure. Beyond Japan, there is no global shortage of sad cartoons. That sadness comes in however many forms and colors you like. Where Japan has the feature films of Shinkai, Takahata, and the cry-GIF master Mamoru Hosoda, the U.S. has Pixar movies such as Up and Inside Out, in which characters suffer acute grief and general depression, respectively. Among cartoons aimed at adult audiences, Netflix’s raunchy Hollywood satire BoJack Horseman is especially acclaimed for its take on depression, but even kid-friendly shows such as Steven Universe and Rick and Morty subject their characters to bouts of trauma and melancholia. Without upending its vulgar irreverence, Rick and Morty has carefully navigated abusive relationships and sexual assault. The heroes of Steven Universe battle their fair share of cartoon villains, but the titular character’s greatest ordeal is coping with the death of his mother, the superhero he never knew. Steven Universe Cures Superhero PessimismThe Cartoon Network series provides what other animated series are missingtheringer.com And yet, there’s no great American cartoon about 9/11, perhaps because our national traumas are too refracted through pluralism to translate so broadly in our cartoons. There’s a sense of escapism at the heart of all animated works — even in something as grim as Barefoot Gen — but Your Name is part of a robust tradition that re-fashions that escapism as a salve, not an out. Worldwide, Makoto Shinkai has topped the box-office success of every Studio Ghibli movie with a sad, gorgeous film about love and disaster, the latter inspired by actual devastation. Your Name is where adolescence meets the crush of human history, and where escapism meets catharsis. They belong together. ", "child": "696_1\t696_2\t696_3"}