{"name": "70", "parent": "", "title": "LeBron James and Paul George Played a Double-Overtime Game of One-on-One", "sentences": [{"508a": "LeBron James and Paul George Played a Double-Overtime Game of One-on-One"}, {"5953": "Pacers-Cavs was one of the clashes of the season"}, {"57d5": "That sound you hear is all the Cleveland and Indiana beat writers hitting control-alt-delete on their game stories and texting their loved ones: “JR SMITH FML.” The Pacers and Cavs had a double-overtime Mortal Kombat sesh in Ohio, with Cleveland winning, 135–130. Free basketball is free, but it always costs something."}, {"51f8": "With the Pacers fighting for their playoff-qualification lives and the Cavs fighting for the Eastern Conference 1-seed (and to shake off some of the louder mutterings about their cratering defense and slow team speed), this game mattered in a way few April clashes do. You can tell from looking at the box scores. LeBron James playing 52 minutes (LOL rest) and grabbing a triple-double with 41 points, 16 boards, and 11 assists; Paul George matching him blow-for-blow, scoring 43, nine, and nine in 48 minutes; Kyrie Irving scoring 23 in 46 minutes; Kevin Love with 20 points and 12 boards in 37 minutes. Numbers, numbers, numbers."}, {"87c0": "A game this long gives everyone involved a chance to be the hero or the goat. Lance Stephenson, who described his return to the Pacers as being “like Michael Jordan coming back to play in the NBA or something like that,” was back where we first fell in love with him: trying to troll LeBron and getting destroyed for it."}, {"20c9": "Seriously …"}, {"038f": "C.J. Miles had a Greatest Hits of C.J. Miles game, with 27 off the bench, and J.R. did his hero-we-need act to get us to overtime:"}, {"0dde": "And Kevin Love was a force in the second overtime, period."}, {"8fa5": "But the main event was LeBron James vs. Paul George. You so rarely get to see the two best players on the floor guarding one another; and it’s even more rare that that duel decides the entire game. But that’s what we got with LeBron and PG-13, who reignited their rivalry from earlier in the decade."}, {"bd25": "For stretches, even LeBron pushed himself to the unfathomable limits of his endurance, an aging prizefighter looking to slice enough points off his younger opponent, while George tried to buzz James’s tower with his athleticism and outside shooting (George had six 3s in the game). In the end, LeBron was victorious, but you could tell it took a toll to give so much in a late regular-season contest."}, {"1f2b": "That’s not the face of a dude who is psyched to play three more games this week, and I wouldn’t be surprised if he sat on Tuesday against Orlando. Indiana has had a meh season marked by its star player grumbling about the team’s identity. After this game, I think they found one: Cleveland’s bogey-team. I love Miami (who lost to Denver on Sunday), but I certainly wouldn’t sneeze at getting to see Indy test Cleveland in the first round."}], "content": "LeBron James and Paul George Played a Double-Overtime Game of One-on-One Pacers-Cavs was one of the clashes of the season That sound you hear is all the Cleveland and Indiana beat writers hitting control-alt-delete on their game stories and texting their loved ones: “JR SMITH FML.” The Pacers and Cavs had a double-overtime Mortal Kombat sesh in Ohio, with Cleveland winning, 135–130. Free basketball is free, but it always costs something. With the Pacers fighting for their playoff-qualification lives and the Cavs fighting for the Eastern Conference 1-seed (and to shake off some of the louder mutterings about their cratering defense and slow team speed), this game mattered in a way few April clashes do. You can tell from looking at the box scores. LeBron James playing 52 minutes (LOL rest) and grabbing a triple-double with 41 points, 16 boards, and 11 assists; Paul George matching him blow-for-blow, scoring 43, nine, and nine in 48 minutes; Kyrie Irving scoring 23 in 46 minutes; Kevin Love with 20 points and 12 boards in 37 minutes. Numbers, numbers, numbers. A game this long gives everyone involved a chance to be the hero or the goat. Lance Stephenson, who described his return to the Pacers as being “like Michael Jordan coming back to play in the NBA or something like that,” was back where we first fell in love with him: trying to troll LeBron and getting destroyed for it. Seriously … C.J. Miles had a Greatest Hits of C.J. Miles game, with 27 off the bench, and J.R. did his hero-we-need act to get us to overtime: And Kevin Love was a force in the second overtime, period. But the main event was LeBron James vs. Paul George. You so rarely get to see the two best players on the floor guarding one another; and it’s even more rare that that duel decides the entire game. But that’s what we got with LeBron and PG-13, who reignited their rivalry from earlier in the decade. For stretches, even LeBron pushed himself to the unfathomable limits of his endurance, an aging prizefighter looking to slice enough points off his younger opponent, while George tried to buzz James’s tower with his athleticism and outside shooting (George had six 3s in the game). In the end, LeBron was victorious, but you could tell it took a toll to give so much in a late regular-season contest. That’s not the face of a dude who is psyched to play three more games this week, and I wouldn’t be surprised if he sat on Tuesday against Orlando. Indiana has had a meh season marked by its star player grumbling about the team’s identity. After this game, I think they found one: Cleveland’s bogey-team. I love Miami (who lost to Denver on Sunday), but I certainly wouldn’t sneeze at getting to see Indy test Cleveland in the first round. ", "child": "70_1\t70_2\t70_3\t70_4"}