{"name": "701", "parent": "", "title": "News Coverage: The Awkward Slant", "sentences": [{"7014": "News Coverage: The Awkward Slant"}, {"bb19": "The March 15th story in the NY Times, coverage of The Rachel Maddow show the night before on MSNBC, is oddly slanted as a critique, almost a smear. Appearing in the Politics section, it points out that Maddow tweeted a tease that she had a Donald Trump tax return, and did so 84 minutes ahead of airtime. By referring to that time span as all but a lifetime in today’s news cycle, and referring to it as a “reveal,” it is evidence of the attitude the story poses."}, {"a4fa": "Here’s the tweet:"}, {"fa7b": "No use of the word “reveal,” no sensationalism. And (seriously) in parentheses could be construed as either, well, seriously, or a Maddow style jab at tweets written by Trump on his personal Twitter account. He’s been known to add a coda to his tweets to describe, emote, or to offer an etymological exclamation point."}, {"8488": "We who have broadcast experience refer to this as a tease, or a promo. An 84 minute lead on a promo is far from a lifetime. Even in this day and age of the 24 hour news cycle, leads, teases and promos still have their place. In an ever increasing competitive media environment they become even more important."}, {"76e7": "As the article continues there is discussion of how long it took for Maddow to get to the return itself, how she set up the delivery of the story, how she set up the guest — David Cay Johnston, who was the source of the return — and how some journalists complained and bemoaned the show and its content and method of presentation. Some journalists! Not a scientific analysis of the entire community of journalists, or those who cover the news or cover TV or TV News or politics. Just “some journalists.”"}, {"95f7": "Also left out: the fact that David Cay Johnston is a Pulitzer Prize winning journalist. Not left out: that he was a former NY Times tax reporter."}, {"5f56": "The article goes on to all but dismiss the tax return story as unimportant, not particularly informative or enlightening. Old, unimpressive as a news item, not of great import, no big deal."}, {"f98b": "The writer of the story is Michael Grynbaum. His role at the Times is perhaps an indication of change in how the paper chooses to report the news these days. Michael Grynbaum’s pieces often offer more of a columnist’s view than that of a correspondent or a reporter. His tone and opinion is no guessing game. In some other papers, like, say, the New York Post, this might be the usual, but in the NY Times one always expected, or was in fact assured, an objective and deftly clinical approach to news coverage."}, {"098f": "So is this coverage of Rachel Maddow’s March 14th program with the Trump 2005 tax return, in fact, a news story, or is it a critique?"}, {"c426": "Here’s how the NY Times describes the writer, Michael Grynbaum:"}, {"915e": "He is a media correspondent. Not a columnist. Not an OpEd page writer. This begs the question, why is this story so jam packed with opinion and attitude by inference?"}, {"06b7": "It would seem he is not a regular viewer of The Rachel Maddow Show, and is not aware that she has a format to which this show adhered, as it does each night. Nor would it seem apparent that he is aware of the fact that this format may be responsible for the increase in viewership the program has appreciated of late (covered in another NY Times story, more on that below). Rather, this article, in its lighthearted manner, pokes fun at the program, at Rachel Maddow’s method of presentation (aka, the format), and how some of the Twittersphere he happened to observe reacted to the program."}, {"d938": "The article begins by stating she had the scoop, and handled it her way. Later in the article it notes that her ratings have gone way up, and are particularly strong in the Adults 25–54 demographic. As he puts it, “the most coveted demographic in television news.”"}, {"22b8": "Or as the media ad people would say, “the money spot.”"}, {"fd59": "That’s good news for MSNBC. It’s also good news for Rachel Maddow, to be bringing in top numbers at 9PM, Prime Time, versus not only the usual TV network entertainment fare, but also CNN and Fox News."}, {"d2cc": "Grynbaum ends the article with a left-handed compliment:"}, {"ce2b": "Could it be I have this all wrong? Maybe Michael Grynbaum meant to be complimentary of Rachel Maddow, her program, even the format she follows. He does wrap up the article with the ratings increase and in the next (and final) paragraph, that nice quote from Politico’s Josh Dawsey."}, {"e2b5": "That’s not how it struck me on the first read. Or on the follow up reads before deciding to write this piece for Medium."}, {"7427": "After the very end of the article, despite the odd, somewhat off-putting tone, there was, however, one wry twist. A rather entertaining postscript to the article in that way the Times does to keep one reading, keep one clicking to other stories in the paper (albeit virtual, online), what does one see? Suggestions that one read more stories, related to the Rachel Maddow/Trump tax return article one had just finished reading."}, {"214f": "Look at what the Times suggests as RELATED COVERAGE (in bold,no less!). A story heralding the return in popularity and viewership of Liberal leaning TV programs, the likes of which The Rachel Maddow Show is a ratings leader. And then news coverage of the tax returns Rachel Maddow got the scoop on. The same tax returns Michael Grynbaum dismissed as less than newsworthy, not so impressive, a letdown."}, {"d286": "But not so much a letdown that the Times would ignore. Look at the suggested RELATED COVERAGE:"}, {"9827": "That first piece, the Solace and Solidarity one, was co-written by Grynbaum and Time writer John Koblin. It heralds not only the return of liberal program content and liberals finding solace in it, but also the tremendous gains and popularity of The Rachel Maddow Show."}, {"231f": "The Times describes Grynbaum’s co-writer, John Koblin, as a media reporter. But it adds that, “he reports on the companies and personalities behind the scripted TV boom, as well as the networks that broadcast the news.”"}, {"ed39": "The “Solace” piece was published on March 12th. The Maddow piece on March 15th. Perhaps Grynbaum’s exposure to Koblin influenced his writing style, and he chose to stress the personality aspect while covering the content."}, {"ebe9": "What do you think?"}], "content": "News Coverage: The Awkward Slant The March 15th story in the NY Times, coverage of The Rachel Maddow show the night before on MSNBC, is oddly slanted as a critique, almost a smear. Appearing in the Politics section, it points out that Maddow tweeted a tease that she had a Donald Trump tax return, and did so 84 minutes ahead of airtime. By referring to that time span as all but a lifetime in today’s news cycle, and referring to it as a “reveal,” it is evidence of the attitude the story poses. Here’s the tweet: No use of the word “reveal,” no sensationalism. And (seriously) in parentheses could be construed as either, well, seriously, or a Maddow style jab at tweets written by Trump on his personal Twitter account. He’s been known to add a coda to his tweets to describe, emote, or to offer an etymological exclamation point. We who have broadcast experience refer to this as a tease, or a promo. An 84 minute lead on a promo is far from a lifetime. Even in this day and age of the 24 hour news cycle, leads, teases and promos still have their place. In an ever increasing competitive media environment they become even more important. As the article continues there is discussion of how long it took for Maddow to get to the return itself, how she set up the delivery of the story, how she set up the guest — David Cay Johnston, who was the source of the return — and how some journalists complained and bemoaned the show and its content and method of presentation. Some journalists! Not a scientific analysis of the entire community of journalists, or those who cover the news or cover TV or TV News or politics. Just “some journalists.” Also left out: the fact that David Cay Johnston is a Pulitzer Prize winning journalist. Not left out: that he was a former NY Times tax reporter. The article goes on to all but dismiss the tax return story as unimportant, not particularly informative or enlightening. Old, unimpressive as a news item, not of great import, no big deal. The writer of the story is Michael Grynbaum. His role at the Times is perhaps an indication of change in how the paper chooses to report the news these days. Michael Grynbaum’s pieces often offer more of a columnist’s view than that of a correspondent or a reporter. His tone and opinion is no guessing game. In some other papers, like, say, the New York Post, this might be the usual, but in the NY Times one always expected, or was in fact assured, an objective and deftly clinical approach to news coverage. So is this coverage of Rachel Maddow’s March 14th program with the Trump 2005 tax return, in fact, a news story, or is it a critique? Here’s how the NY Times describes the writer, Michael Grynbaum: He is a media correspondent. Not a columnist. Not an OpEd page writer. This begs the question, why is this story so jam packed with opinion and attitude by inference? It would seem he is not a regular viewer of The Rachel Maddow Show, and is not aware that she has a format to which this show adhered, as it does each night. Nor would it seem apparent that he is aware of the fact that this format may be responsible for the increase in viewership the program has appreciated of late (covered in another NY Times story, more on that below). Rather, this article, in its lighthearted manner, pokes fun at the program, at Rachel Maddow’s method of presentation (aka, the format), and how some of the Twittersphere he happened to observe reacted to the program. The article begins by stating she had the scoop, and handled it her way. Later in the article it notes that her ratings have gone way up, and are particularly strong in the Adults 25–54 demographic. As he puts it, “the most coveted demographic in television news.” Or as the media ad people would say, “the money spot.” That’s good news for MSNBC. It’s also good news for Rachel Maddow, to be bringing in top numbers at 9PM, Prime Time, versus not only the usual TV network entertainment fare, but also CNN and Fox News. Grynbaum ends the article with a left-handed compliment: Could it be I have this all wrong? Maybe Michael Grynbaum meant to be complimentary of Rachel Maddow, her program, even the format she follows. He does wrap up the article with the ratings increase and in the next (and final) paragraph, that nice quote from Politico’s Josh Dawsey. That’s not how it struck me on the first read. Or on the follow up reads before deciding to write this piece for Medium. After the very end of the article, despite the odd, somewhat off-putting tone, there was, however, one wry twist. A rather entertaining postscript to the article in that way the Times does to keep one reading, keep one clicking to other stories in the paper (albeit virtual, online), what does one see? Suggestions that one read more stories, related to the Rachel Maddow/Trump tax return article one had just finished reading. Look at what the Times suggests as RELATED COVERAGE (in bold,no less!). A story heralding the return in popularity and viewership of Liberal leaning TV programs, the likes of which The Rachel Maddow Show is a ratings leader. And then news coverage of the tax returns Rachel Maddow got the scoop on. The same tax returns Michael Grynbaum dismissed as less than newsworthy, not so impressive, a letdown. But not so much a letdown that the Times would ignore. Look at the suggested RELATED COVERAGE: That first piece, the Solace and Solidarity one, was co-written by Grynbaum and Time writer John Koblin. It heralds not only the return of liberal program content and liberals finding solace in it, but also the tremendous gains and popularity of The Rachel Maddow Show. The Times describes Grynbaum’s co-writer, John Koblin, as a media reporter. But it adds that, “he reports on the companies and personalities behind the scripted TV boom, as well as the networks that broadcast the news.” The “Solace” piece was published on March 12th. The Maddow piece on March 15th. Perhaps Grynbaum’s exposure to Koblin influenced his writing style, and he chose to stress the personality aspect while covering the content. What do you think? ", "child": "701_1\t701_2"}