{"name": "706", "parent": "", "title": "April: LOL", "sentences": [{"edf7": "April: LOL"}, {"e320": "If the internet is remembered for anything — after the sun swallows the Earth and aliens find the Wayback Machine on a floating thumb drive in space — it will be comedy. The art of the LOL. Ever-evolving joke formulas that move our spit takes forward, one dank meme at a time. As humanity’s greatest incubator of comedic gems, the internet has birthed a thousand kittens and inner-monologuing dogs. Try peeling back the layers of irony and you’ll see: it’s jokes all the way down."}, {"f16c": "This month, in honor of April Fool’s Day, we’re featuring some of our favorite humor writing. Satire, parody, and wit. Punching up, sounding off, and speaking jokes to power. On each of the next four weekends, we’ll share a new selection of laughs:"}, {"1b7d": "We’ll unveil a new collection every Friday on our homepage. Got something funny? Drop us a line: tips@medium.com."}, {"78ff": "This is the third in a series of monthly themes — browse our Women’s Month and Love collections for more."}], "content": "April: LOL If the internet is remembered for anything — after the sun swallows the Earth and aliens find the Wayback Machine on a floating thumb drive in space — it will be comedy. The art of the LOL. Ever-evolving joke formulas that move our spit takes forward, one dank meme at a time. As humanity’s greatest incubator of comedic gems, the internet has birthed a thousand kittens and inner-monologuing dogs. Try peeling back the layers of irony and you’ll see: it’s jokes all the way down. This month, in honor of April Fool’s Day, we’re featuring some of our favorite humor writing. Satire, parody, and wit. Punching up, sounding off, and speaking jokes to power. On each of the next four weekends, we’ll share a new selection of laughs: We’ll unveil a new collection every Friday on our homepage. Got something funny? Drop us a line: tips@medium.com. This is the third in a series of monthly themes — browse our Women’s Month and Love collections for more. ", "child": "706_1\t706_2\t706_3\t706_4\t706_5\t706_6\t706_7\t706_8\t706_9\t706_10"}