{"name": "709", "parent": "", "title": "Apocalypse is Coming! (And it’s all Lena Dunham’s fault.)", "sentences": [{"032d": "Apocalypse is Coming! (And it’s all Lena Dunham’s fault.)"}, {"6003": "2017: the year that nuance finally died."}, {"313e": "On the morning of April 14th, Good Friday, I checked the news. America had dropped a huge bomb, North Korea was readying a nuclear test, and Manchester United had conceded a last-minute equaliser in their Europa League tie, proving all was not bad."}, {"4350": "On Twitter, I noticed a tweet from The New Yorker about the TV series Girls. I retweeted the message, adding my own comment."}, {"6598": "A follower replied:"}, {"2667": "Without mentioning me, the follower wrote in their own TL:"}, {"9785": "(What really hurt was that the second tweet received far more ‘likes’ than my original.)"}, {"ab45": "I’ve never watched Girls. Sure, it’s been on in my house. I’ve seen it. But I’ve never watched it, despite all the Guardian and NYT articles telling me how absolutely incredible the series is."}, {"d64e": "Life is whizzing by too quickly for TV. I’ve got tweets to write."}, {"de5c": "Hating on Girls wasn’t my intention. (I sound like a teenager again.) It may be objectively the best TV series made since Quantum Leap and my initial point would stand:"}, {"3a89": "The level of hyperbole employed by The New Yorker is criminal. No TV show can be so well directed/written that your ability to distinguish its fiction from your own reality is impaired*. Unless you’re psychotic. And I don’t think that was the reviewer’s angle."}, {"e1eb": "I have no problem with Girls. (I sound as if I’m in primary school.) But I did feel a bit hated on. I drank some coffee and thought a bit. I remembered a tweet that I’d seen in the last week."}, {"d404": "Kitty Empire’s last three albums of the week were all three-star reviews."}, {"c18d": "Reviewing in 2017: the best of times, the worst of times (and no room for Mr Inbetween). Everything’s great. And if it’s not great, it’s shit. And if it’s shit, there’ll be someone on Twitter accusing you of hating on it."}, {"f7de": "Of course, social media and clickbait headlines encourage such absolute judgment. In 2017, we can understand culture only in superlative terms. Even my dog knows this and he’s the stupidest dog that’s ever existed. Who’s going to read a film review if the headline emphasises its mediocrity?"}, {"74fe": "‘New Superhero Flick is OK’ won’t get attention."}, {"0c75": "But these will:"}, {"6219": "It’s not Twitter’s fault. It’s not even Buzzfeed’s. Whose is it? And then it hit me:"}, {"80e0": "The Gipper’s."}, {"8da0": "In Rick Perlstein’s Invisible Bridge, he describes the profound effect Ronald Reagan had on the language of politics. In framing the Cold War as a struggle between America, the shining city upon a hill, and the USSR’s ‘evil empire’, Reagan reduced not only this struggle to a good/evil binary, but also started the corrosive process that destroyed any form of nuance in politics. Ideologies became stringently left/right, them/us."}, {"41b9": "2017 is the apotheosis of this process. Other than reactions to The Great British Bake Off’s move to Channel 4, there’s no better example than Brexit. The hugely complicated question of Britain’s relationship to the EU, a relationship with costs as well as benefits, was reduced to the single sentence:"}, {"f9b9": "“Should the United Kingdom remain a member of the European Union or leave the European Union?”"}, {"fc45": "The majority of voters, being idiots, decided to leave. In our binary world, UK government policy, despite being a parliamentary democracy, was to treat this decision as sacrosanct. It was the will of the British people, we were told, an assertion that ignores the many millions of voters that either wanted to remain or didn’t bother casting a vote either way."}, {"6360": "Reducing the world to binaries leads inexorably to conflict. For your policy position to be correct, it must be contrasted against one that is incorrect. For your army to be the heroes, they must have defeated the enemy. Concillation and negotiation is weak because it acknowledges that the opposing party may have merit. F Scott Fitzgerald once noted that a mark of intelligence was to be able to consider two opposing points of view. But Fitzgerald is dead."}, {"3a42": "In the same way that my tweet was interpreted as an attack on a beloved TV show, myopic world leaders will interpret actions of foreign governments as acts of war. Therefore, in many ways, the Girls defender is a Donald Trump in miniature."}, {"0866": "And should world conflict explode over the coming year, you’ll know who to blame: Ronald Reagan, yes, but also The New Yorker."}, {"40b8": "And, indirectly, Lena Dunham."}, {"3c14": "(For the reference, I would give this post a 7/10. I was disappointed it wasn’t funnier.)"}, {"521f": "*Apart from Westworld."}], "content": "Apocalypse is Coming! (And it’s all Lena Dunham’s fault.) 2017: the year that nuance finally died. On the morning of April 14th, Good Friday, I checked the news. America had dropped a huge bomb, North Korea was readying a nuclear test, and Manchester United had conceded a last-minute equaliser in their Europa League tie, proving all was not bad. On Twitter, I noticed a tweet from The New Yorker about the TV series Girls. I retweeted the message, adding my own comment. A follower replied: Without mentioning me, the follower wrote in their own TL: (What really hurt was that the second tweet received far more ‘likes’ than my original.) I’ve never watched Girls. Sure, it’s been on in my house. I’ve seen it. But I’ve never watched it, despite all the Guardian and NYT articles telling me how absolutely incredible the series is. Life is whizzing by too quickly for TV. I’ve got tweets to write. Hating on Girls wasn’t my intention. (I sound like a teenager again.) It may be objectively the best TV series made since Quantum Leap and my initial point would stand: The level of hyperbole employed by The New Yorker is criminal. No TV show can be so well directed/written that your ability to distinguish its fiction from your own reality is impaired*. Unless you’re psychotic. And I don’t think that was the reviewer’s angle. I have no problem with Girls. (I sound as if I’m in primary school.) But I did feel a bit hated on. I drank some coffee and thought a bit. I remembered a tweet that I’d seen in the last week. Kitty Empire’s last three albums of the week were all three-star reviews. Reviewing in 2017: the best of times, the worst of times (and no room for Mr Inbetween). Everything’s great. And if it’s not great, it’s shit. And if it’s shit, there’ll be someone on Twitter accusing you of hating on it. Of course, social media and clickbait headlines encourage such absolute judgment. In 2017, we can understand culture only in superlative terms. Even my dog knows this and he’s the stupidest dog that’s ever existed. Who’s going to read a film review if the headline emphasises its mediocrity? ‘New Superhero Flick is OK’ won’t get attention. But these will: It’s not Twitter’s fault. It’s not even Buzzfeed’s. Whose is it? And then it hit me: The Gipper’s. In Rick Perlstein’s Invisible Bridge, he describes the profound effect Ronald Reagan had on the language of politics. In framing the Cold War as a struggle between America, the shining city upon a hill, and the USSR’s ‘evil empire’, Reagan reduced not only this struggle to a good/evil binary, but also started the corrosive process that destroyed any form of nuance in politics. Ideologies became stringently left/right, them/us. 2017 is the apotheosis of this process. Other than reactions to The Great British Bake Off’s move to Channel 4, there’s no better example than Brexit. The hugely complicated question of Britain’s relationship to the EU, a relationship with costs as well as benefits, was reduced to the single sentence: “Should the United Kingdom remain a member of the European Union or leave the European Union?” The majority of voters, being idiots, decided to leave. In our binary world, UK government policy, despite being a parliamentary democracy, was to treat this decision as sacrosanct. It was the will of the British people, we were told, an assertion that ignores the many millions of voters that either wanted to remain or didn’t bother casting a vote either way. Reducing the world to binaries leads inexorably to conflict. For your policy position to be correct, it must be contrasted against one that is incorrect. For your army to be the heroes, they must have defeated the enemy. Concillation and negotiation is weak because it acknowledges that the opposing party may have merit. F Scott Fitzgerald once noted that a mark of intelligence was to be able to consider two opposing points of view. But Fitzgerald is dead. In the same way that my tweet was interpreted as an attack on a beloved TV show, myopic world leaders will interpret actions of foreign governments as acts of war. Therefore, in many ways, the Girls defender is a Donald Trump in miniature. And should world conflict explode over the coming year, you’ll know who to blame: Ronald Reagan, yes, but also The New Yorker. And, indirectly, Lena Dunham. (For the reference, I would give this post a 7/10. I was disappointed it wasn’t funnier.) *Apart from Westworld. ", "child": "709_1\t709_2\t709_3\t709_4709_1\t709_2\t709_3\t709_4"}