{"name": "720", "parent": "", "title": "Seus conceitos sobre criança foram atualizados", "sentences": [{"8007": "Seus conceitos sobre criança foram atualizados"}, {"b389": "Nós criamos a infância, e vamos destruí-la"}, {"cb2f": "No último fim de semana assisti a um filme da Disney, muito bonito, emocionante, e para crianças: Pete’s Dragon. Extremamente bem feito e competente na realização. E uma coisa me chamou a atenção: o filme não se passa em época atual, mas sim em algum ponto não especificado dos anos 80, pelo que mostram os telefones, carros, e roupas."}, {"5551": "Esse tipo de escolha vem acontecendo com alguma frequência. O caso recente mais famoso é o do seriado da Netflix, Stranger Things."}, {"3d00": "Como sou uma criança dos anos 80, me sinto meio homenageado e repleto de nostalgia, mas suspeito que os motivos para que os diretores posicionem suas obras nesse período (ou até em épocas mais remotas), sejam outros."}, {"cc18": "A infância, e especialmente a adolescência, nos moldes que conhecemos atualmente é um fenômeno relativamente novo. Até antes da segunda guerra mundial, o foco da sociedade estava nos adultos. Mais especialmente no homem adulto, provedor e figura principal da casa. A grande maioria da publicidade, mídia e entretenimento era focada naquele que pagava e decidia as contas das casa."}, {"af90": "“Mostre a ela que este é um mundo de homens”"}, {"f3a4": "Anúncio da Coca. Sirene de fábrica. Homem. Mulher. Nenhuma criança."}, {"efff": "No começo do século, filho era aquela coisa que o casal tinha 13, e se conseguisse chegar à sua velhice com 8 vivos, você já podia se considerar um vencedor."}, {"56d1": "O resultado desse foco era que os jovens queriam deixar de sê-lo o quanto antes. Por isso quando você olha uma foto dos seus pais ou avós em seus vinte e poucos anos, eles pareciam tão mais velhos. As pessoas pulavam da infância para a era adulta em dois ou três anos, passando por uma adolescência cheia de regras. Meninos queriam ser homens logo, e casavam cedo afim de sair da casa dos pais, onde eram meros coadjuvantes e tinham que dividir a mesa com os outros 8 irmãos."}, {"c8e0": "Meninas então, não tinham vez nem dentro, nem fora da casa. Aos 15, 16 anos muitas já estavam noivas ou sonhando com isso. Era a chance de brincar de casinha, usando a própria casa como cobaia. Fora que, na sociedade da época, muitas coisas que os hormônios pediam desesperadamente para serem consumadas só eram permitidas depois do casamento."}, {"1a45": "A entrada no mundo adulto era o passaporte para a liberdade."}, {"834b": "Mas então veio a guerra."}, {"aa6b": "E não se esqueçam: quando falamos de tendência de comportamento e mídia, nós aqui sempre olhamos para o que acontece nos Estados Unidos e na Europa, e aproveitamos (nem sempre da forma mais sábia) aquilo que achamos bacana. E com hordas de homens de repente sumindo do mapa, coube às mulheres assumirem as rédeas das casas e provar que conseguiam administrar sozinhas o trabalho e a família."}, {"3c2b": "Os maridos voltaram (não todos), e no meio dos reencontros tão ternos, das histórias de terror do conflito e da súbita realização da importância do convívio com os entes queridos, não era de surpreender que a mídia e a publicidade tenham se transformado os anos 50 num paraíso idealizado, com mães que andavam de salto alto dentro de casa e faziam tortas para a prole, enquanto o marido cortava a grama e as crianças brincavam de caubói no quintal."}, {"e955": "O amor estava no ar, e isso foi chamado de baby-boom, pela quantidade massiva de crianças geradas após a volta dos maridos da guerra, e pelo otimismo com o futuro que marcou a época. Sem que se percebesse, o foco foi saindo do marido, e passou para a família."}, {"1bdc": "Muitas famílias e felicidade. Pouca criança na foto."}, {"1f9b": "Nem tudo eram flores. Por trás da utopia Capriana existia uma sociedade ainda muito machista, onde as mulheres tinham pouca voz. Os anos 60 chegaram com a pílula, com o divórcio e com a luta das minorias por espaço. Época conturbada, que culminou com, adivinhem, nova guerra."}, {"f7d8": "Por acaso ou não, no mesmo ano que a guerra do Vietnã terminou, o filme que marca o início dos chamados blockbusters de verão, estreou. Tubarão, de Steven Spielberg, levou milhões de pessoas ao cinema, e mudou o marketing da indústria. Mas o estrago realmente foi feito dois anos mais tarde, quando Star Wars, de George Lucas, chega às telas."}, {"3c39": "Estreia de Tubarão, em 1975"}, {"384e": "Até esse momento, os filmes eram lançados para a família. A partir daí, eram focados totalmente nos jovens. E nunca mais vieram separados de uma parafernália sem precedentes. Não bastava ver o filme. Era preciso ter os bonecos, as camisetas, os pôsteres, as canecas, os chinelos, as almofadas, os tapetes de banheiro, e os jogos (que no início, vejam só, eram de tabuleiro)."}, {"3f62": "O mundo nunca mais foi o mesmo."}, {"db53": "Tinha de tudo. Ainda tem. Muito mais."}, {"986c": "O foco nos mais jovens provou ser a galinha dos ovos de ouro para os produtores. Um filme podia ir mal de bilheteria, e ainda assim lucrar com a venda de produtos. De lá pra cá, é fácil entender e acompanhar o progresso dessa nova cultura em torno dos jovens."}, {"ab6e": "O ponto máximo desse modo de vida é o agora, onde as crianças e jovens são o ponto central da vida das famílias. Até mesmo novas subdivisões biológicas foram criadas para abarcar esses seres que subitamente estavam sendo notados. Agora eles uma tinham uma pré-adolescência para chamar de sua."}, {"a2aa": "Outro fato interessante: todos querem estender a juventude para além dos 30 anos. Vivendo como reis dentro de suas casas, era normal que a independência tenha deixado de ser um valor tão importante. Ainda mais dentro de casas onde os pais se sentem cada vez mais culpados por não ter tempo para conseguir dar toda a atenção merecida a seus maravilhosos e únicos flocos de neve."}, {"1583": "O importante é ser jovem, com a maior intensidade, e por quanto tempo for possível. E consumir. Consumir para existir."}, {"a75d": "O que nos leva ao primeiro parágrafo do texto. Porque o cinema e a mídia estão voltando suas lentes para os anos 80 de novo?"}, {"f5b5": "Um dos trabalhos mais árduos de um autor é chamado suspensão da descrença. É quando a pessoa entra num cinema, ou lê um quadrinho ou livro, e depois de 10 minutos de preparação psicológica de terreno, acha normal um indivíduo se vestir de morcego para combater um crime, ou que exista uma família de vampiros bonzinhos, que brilham sob o sol e que não chupam sangue humano. Quando o material não domina isso por completo, o espectador fica encontrando furos no material e achando tudo meio estranho."}, {"5082": "Por isso, em todo filme nacional, os policiais falam como malacos e são sempre moralmente dúbios. Por mais que saibamos que existem policiais sérios e cultos, nosso cérebro não consegue enxergar um policial brasileiro da mesma forma que vê um americano. Soa falso."}, {"0c6a": "Da mesma forma, quando um diretor precisa passar conceitos de pureza e ingenuidade, uma criança contemporânea não é a melhor escolha. Ele pode até conseguir, mas arrisca não criar empatia entre o público e o personagem, e tem que confiar muito em seu talento."}, {"0ee2": "A molecada dos anos 2010 não se encaixa no padrão mais relaxado e tranquilo que havia nos 80. Hoje elas não andam pela cidade em grupos, até porque os pais não permitem (consideremos as dificuldades de pensar em tramas passadas dentro de condomínios). Não acreditam em fadas. Não fazem pactos de amizade."}, {"98ec": "Um menino de 10 anos de hoje sabe a diferença entre uma Kalashnikov e uma AK-47, porque jogam Counter Strike ou algum similar, e isso não pega bem num filme com um dragão digital. Uma menina brinca com bonecas que tem coleções de roupas criadas por estilistas, e replica fielmente os movimentos da Nikki Minaj."}, {"21d1": "Ambos os sexos usam roupas de grife e aparelhos eletrônicos tão bons quanto o dos seus pais. Se você acha que estou exagerando, consulte a própria Disney, na sua outra linha de produtos. Produções para “tweens”, que é mais uma fase inventada pela publicidade, são pródigas em inventar novos ídolos pop e vender todo tipo de merchandising que um ser humano pode pensar."}, {"1e6b": "A cara dos “tweens” de hoje."}, {"697f": "De repente as crianças deixarem de ser influenciadas por adultos em roupas de palhaços, paquitas ou dinossauros fofinhos. Elas buscam validação para seu comportamento em vloggers e youtubers que supostamente são “como eles”. É claro que elas não têm maturidade para saber quem paga os influenciadores."}, {"55a9": "Eles não sonham mais em ser caubóis, astronautas ou princesas. Querem ser celebridades. Mas não fazem ideia do que os tornará célebres."}, {"b25b": "Enquanto isso, os filmes mais caros para a faixa etária tem coisas em comum. Veja: A Bela e a Fera, Cinderela, Mogli, e o já comentado Pete’s Dragon. Todos são filmes com atores reais, e nenhum deles se passa no mundo atual. Como eu disse, não é que seja impossível, é apenas mais difícil convencer as audiências que crianças atuais são seres puros e suportáveis."}, {"3b4d": "Ou seja, os jovens continuam a ser parte intrínseca das vidas dos adultos, mas o inverso não parece ser verdade. Mais do que nunca, tudo que um jovem menos quer ser na vida é um adulto."}, {"0de4": "Não é à toa que vivemos numa época em que tantos adultos são fissurados em brinquedos e temas pueris. Seja na forma de bonecos, carros, roupas ou conquistas amorosas, a vida juvenil (que não tem mais limite etário) parece seguir o padrão de álbum de figurinhas. Eu pego, eu coloco na coleção, eu parto pra próxima."}, {"cde8": "Não preciso pontuar que a mídia e a vida vivem uma relação simbiótica e cíclica. Uma alimenta e influencia a outra. O risco que estamos correndo é considerável. Principalmente porque metade do mundo ainda vive um dilema muito mais complexo, que é o de conquistar o direito de simplesmente EXISTIR."}, {"4802": "Felizes, puras e comprando muito."}, {"c3a6": "De tanto amor e proteção que dispensamos à nossos rebentos, estamos criando uma geração que não sabe lidar com os problemas mais elementares da vida. O que vai acontecer quando eles forem colocados frente a frente com os problemas mais complexos da história do planeta, como as grandes migrações, choques culturais, fome e colapso ambiental?"}, {"a067": "Como será o mundo liderado por meninos e meninas cujo maior desafio era arrumar espaço no armário para caber tanto sapato, trocar de celular uma vez por ano ou conseguir A selfie perfeita?"}, {"5487": "Posso estar errado. Pode ser apenas mais um soluço da história. E talvez a geração Snapchat, que já tinha post no Instagram antes de deixar a maternidade, saiba lidar com isso como uma facilidade e simplicidade, que surpreenda aqueles que tem mentes mais agitadas."}, {"abc2": "Mas caramba, não está parecendo mesmo."}], "content": "Seus conceitos sobre criança foram atualizados Nós criamos a infância, e vamos destruí-la No último fim de semana assisti a um filme da Disney, muito bonito, emocionante, e para crianças: Pete’s Dragon. Extremamente bem feito e competente na realização. E uma coisa me chamou a atenção: o filme não se passa em época atual, mas sim em algum ponto não especificado dos anos 80, pelo que mostram os telefones, carros, e roupas. Esse tipo de escolha vem acontecendo com alguma frequência. O caso recente mais famoso é o do seriado da Netflix, Stranger Things. Como sou uma criança dos anos 80, me sinto meio homenageado e repleto de nostalgia, mas suspeito que os motivos para que os diretores posicionem suas obras nesse período (ou até em épocas mais remotas), sejam outros. A infância, e especialmente a adolescência, nos moldes que conhecemos atualmente é um fenômeno relativamente novo. Até antes da segunda guerra mundial, o foco da sociedade estava nos adultos. Mais especialmente no homem adulto, provedor e figura principal da casa. A grande maioria da publicidade, mídia e entretenimento era focada naquele que pagava e decidia as contas das casa. “Mostre a ela que este é um mundo de homens” Anúncio da Coca. Sirene de fábrica. Homem. Mulher. Nenhuma criança. No começo do século, filho era aquela coisa que o casal tinha 13, e se conseguisse chegar à sua velhice com 8 vivos, você já podia se considerar um vencedor. O resultado desse foco era que os jovens queriam deixar de sê-lo o quanto antes. Por isso quando você olha uma foto dos seus pais ou avós em seus vinte e poucos anos, eles pareciam tão mais velhos. As pessoas pulavam da infância para a era adulta em dois ou três anos, passando por uma adolescência cheia de regras. Meninos queriam ser homens logo, e casavam cedo afim de sair da casa dos pais, onde eram meros coadjuvantes e tinham que dividir a mesa com os outros 8 irmãos. Meninas então, não tinham vez nem dentro, nem fora da casa. Aos 15, 16 anos muitas já estavam noivas ou sonhando com isso. Era a chance de brincar de casinha, usando a própria casa como cobaia. Fora que, na sociedade da época, muitas coisas que os hormônios pediam desesperadamente para serem consumadas só eram permitidas depois do casamento. A entrada no mundo adulto era o passaporte para a liberdade. Mas então veio a guerra. E não se esqueçam: quando falamos de tendência de comportamento e mídia, nós aqui sempre olhamos para o que acontece nos Estados Unidos e na Europa, e aproveitamos (nem sempre da forma mais sábia) aquilo que achamos bacana. E com hordas de homens de repente sumindo do mapa, coube às mulheres assumirem as rédeas das casas e provar que conseguiam administrar sozinhas o trabalho e a família. Os maridos voltaram (não todos), e no meio dos reencontros tão ternos, das histórias de terror do conflito e da súbita realização da importância do convívio com os entes queridos, não era de surpreender que a mídia e a publicidade tenham se transformado os anos 50 num paraíso idealizado, com mães que andavam de salto alto dentro de casa e faziam tortas para a prole, enquanto o marido cortava a grama e as crianças brincavam de caubói no quintal. O amor estava no ar, e isso foi chamado de baby-boom, pela quantidade massiva de crianças geradas após a volta dos maridos da guerra, e pelo otimismo com o futuro que marcou a época. Sem que se percebesse, o foco foi saindo do marido, e passou para a família. Muitas famílias e felicidade. Pouca criança na foto. Nem tudo eram flores. Por trás da utopia Capriana existia uma sociedade ainda muito machista, onde as mulheres tinham pouca voz. Os anos 60 chegaram com a pílula, com o divórcio e com a luta das minorias por espaço. Época conturbada, que culminou com, adivinhem, nova guerra. Por acaso ou não, no mesmo ano que a guerra do Vietnã terminou, o filme que marca o início dos chamados blockbusters de verão, estreou. Tubarão, de Steven Spielberg, levou milhões de pessoas ao cinema, e mudou o marketing da indústria. Mas o estrago realmente foi feito dois anos mais tarde, quando Star Wars, de George Lucas, chega às telas. Estreia de Tubarão, em 1975 Até esse momento, os filmes eram lançados para a família. A partir daí, eram focados totalmente nos jovens. E nunca mais vieram separados de uma parafernália sem precedentes. Não bastava ver o filme. Era preciso ter os bonecos, as camisetas, os pôsteres, as canecas, os chinelos, as almofadas, os tapetes de banheiro, e os jogos (que no início, vejam só, eram de tabuleiro). O mundo nunca mais foi o mesmo. Tinha de tudo. Ainda tem. Muito mais. O foco nos mais jovens provou ser a galinha dos ovos de ouro para os produtores. Um filme podia ir mal de bilheteria, e ainda assim lucrar com a venda de produtos. De lá pra cá, é fácil entender e acompanhar o progresso dessa nova cultura em torno dos jovens. O ponto máximo desse modo de vida é o agora, onde as crianças e jovens são o ponto central da vida das famílias. Até mesmo novas subdivisões biológicas foram criadas para abarcar esses seres que subitamente estavam sendo notados. Agora eles uma tinham uma pré-adolescência para chamar de sua. Outro fato interessante: todos querem estender a juventude para além dos 30 anos. Vivendo como reis dentro de suas casas, era normal que a independência tenha deixado de ser um valor tão importante. Ainda mais dentro de casas onde os pais se sentem cada vez mais culpados por não ter tempo para conseguir dar toda a atenção merecida a seus maravilhosos e únicos flocos de neve. O importante é ser jovem, com a maior intensidade, e por quanto tempo for possível. E consumir. Consumir para existir. O que nos leva ao primeiro parágrafo do texto. Porque o cinema e a mídia estão voltando suas lentes para os anos 80 de novo? Um dos trabalhos mais árduos de um autor é chamado suspensão da descrença. É quando a pessoa entra num cinema, ou lê um quadrinho ou livro, e depois de 10 minutos de preparação psicológica de terreno, acha normal um indivíduo se vestir de morcego para combater um crime, ou que exista uma família de vampiros bonzinhos, que brilham sob o sol e que não chupam sangue humano. Quando o material não domina isso por completo, o espectador fica encontrando furos no material e achando tudo meio estranho. Por isso, em todo filme nacional, os policiais falam como malacos e são sempre moralmente dúbios. Por mais que saibamos que existem policiais sérios e cultos, nosso cérebro não consegue enxergar um policial brasileiro da mesma forma que vê um americano. Soa falso. Da mesma forma, quando um diretor precisa passar conceitos de pureza e ingenuidade, uma criança contemporânea não é a melhor escolha. Ele pode até conseguir, mas arrisca não criar empatia entre o público e o personagem, e tem que confiar muito em seu talento. A molecada dos anos 2010 não se encaixa no padrão mais relaxado e tranquilo que havia nos 80. Hoje elas não andam pela cidade em grupos, até porque os pais não permitem (consideremos as dificuldades de pensar em tramas passadas dentro de condomínios). Não acreditam em fadas. Não fazem pactos de amizade. Um menino de 10 anos de hoje sabe a diferença entre uma Kalashnikov e uma AK-47, porque jogam Counter Strike ou algum similar, e isso não pega bem num filme com um dragão digital. Uma menina brinca com bonecas que tem coleções de roupas criadas por estilistas, e replica fielmente os movimentos da Nikki Minaj. Ambos os sexos usam roupas de grife e aparelhos eletrônicos tão bons quanto o dos seus pais. Se você acha que estou exagerando, consulte a própria Disney, na sua outra linha de produtos. Produções para “tweens”, que é mais uma fase inventada pela publicidade, são pródigas em inventar novos ídolos pop e vender todo tipo de merchandising que um ser humano pode pensar. A cara dos “tweens” de hoje. De repente as crianças deixarem de ser influenciadas por adultos em roupas de palhaços, paquitas ou dinossauros fofinhos. Elas buscam validação para seu comportamento em vloggers e youtubers que supostamente são “como eles”. É claro que elas não têm maturidade para saber quem paga os influenciadores. Eles não sonham mais em ser caubóis, astronautas ou princesas. Querem ser celebridades. Mas não fazem ideia do que os tornará célebres. Enquanto isso, os filmes mais caros para a faixa etária tem coisas em comum. Veja: A Bela e a Fera, Cinderela, Mogli, e o já comentado Pete’s Dragon. Todos são filmes com atores reais, e nenhum deles se passa no mundo atual. Como eu disse, não é que seja impossível, é apenas mais difícil convencer as audiências que crianças atuais são seres puros e suportáveis. Ou seja, os jovens continuam a ser parte intrínseca das vidas dos adultos, mas o inverso não parece ser verdade. Mais do que nunca, tudo que um jovem menos quer ser na vida é um adulto. Não é à toa que vivemos numa época em que tantos adultos são fissurados em brinquedos e temas pueris. Seja na forma de bonecos, carros, roupas ou conquistas amorosas, a vida juvenil (que não tem mais limite etário) parece seguir o padrão de álbum de figurinhas. Eu pego, eu coloco na coleção, eu parto pra próxima. Não preciso pontuar que a mídia e a vida vivem uma relação simbiótica e cíclica. Uma alimenta e influencia a outra. O risco que estamos correndo é considerável. Principalmente porque metade do mundo ainda vive um dilema muito mais complexo, que é o de conquistar o direito de simplesmente EXISTIR. Felizes, puras e comprando muito. De tanto amor e proteção que dispensamos à nossos rebentos, estamos criando uma geração que não sabe lidar com os problemas mais elementares da vida. O que vai acontecer quando eles forem colocados frente a frente com os problemas mais complexos da história do planeta, como as grandes migrações, choques culturais, fome e colapso ambiental? Como será o mundo liderado por meninos e meninas cujo maior desafio era arrumar espaço no armário para caber tanto sapato, trocar de celular uma vez por ano ou conseguir A selfie perfeita? Posso estar errado. Pode ser apenas mais um soluço da história. E talvez a geração Snapchat, que já tinha post no Instagram antes de deixar a maternidade, saiba lidar com isso como uma facilidade e simplicidade, que surpreenda aqueles que tem mentes mais agitadas. Mas caramba, não está parecendo mesmo. ", "child": "720_1\t720_2\t720_3\t720_4"}