{"name": "74", "parent": "", "title": "Recap Of The Most Ludicrous Moments Of 2016-17 NBA Season", "sentences": [{"b0ab": "Recap Of The Most Ludicrous Moments Of 2016-17 NBA Season"}, {"ebbe": "Because it’s the playoffs now, and that’s the only thing that matters."}, {"3f62": "Wikimedia Commons"}, {"5fe4": "If I’m ever commissioned to ghostwrite the LeBron James autobiography (hit me Bron, you know where to find me), I will stake my life on the line to make “I’m the wrong guy to ask about regular season” its opening phrase. Maybe even the title. Maybe I’ll just have the whole chapter say “I’m the wrong guy to ask about regular season” over and over and over again (I’d also throw in at least one or two different sentences at random points just to throw everyone off and make it a fun treasure hunting activity for the whole family). The point is, in the mind of LeBron James, the regular season doesn’t matter. And let’s be honest here, it kind of doesn’t."}, {"79dd": "Sure, it can determine whether or not your team gets a good lottery pick (unless your team is the Nets) or have an impact on the playoffs to come through standings. But, when the chips are down, the only thing that matters is the playoffs. Actually, the only thing that matters is the last four to sevengames of the playoffs taking place in late May/early June. If you think really hard about this, nothing really mattered until the Game 5 Draymond Green suspension, or the Steph Curry pass that sailed out of bounds or until LeBron James descended from the heavens and eliminated the basketball and Andre Iguodala from existence for about 15 seconds."}, {"df1e": "But, we’ve been through 82x30 games of basketball, and some pretty fantastic stuff happened in that stretch, so let’s review, shall we?"}, {"3815": "Trade Grades: Boogie Down, Pelicans WowDeMarcus Cousins is a Pelican. In a blockbuster deal, Buddy Hield and others become Kings. We give our verdict on the…16winsaring.com"}, {"892e": "Anthony Davis Sends a Distress Call"}, {"13e2": "I feel bad for Anthony Davis, marooned on Pelicans Island for all of his adult career so far, starved for help and left to fend for himself in this cruel world. Despite their best intentions, the Pelicans have been unable to give their superhero the necessary sidekicks for success. It’s like that time the Batman editorial team rotated through Robins, unable to decide which one to keep, eventually killing all of them off. No, Anthony Davis’ existence was that of the lone avenger."}, {"9958": "Not that he didn’t try to warn us."}, {"1ab0": "On October 26, 2016, in the year of our Lord, Savior and Patron Saint of basketball Michael Jordan, Anthony Davis descended onto NBA opening night like the Mongols did on nearly every unsuspecting nation in the Eurasian region. He put up 50 points, 16 rebounds, seven steals, five assists and four blocks. We thought this was the night of the apocalypse and Davis its first horseman. Unfortunately, it was just a complicated message delivered in Morse Code. When arranged properly, it reads “PLS HELP”… Probably."}, {"d04b": "Russell Westbrook’s Maverick Miracle A Microcosm Of Thunder’s SeasonRussell Westbrook adds another notch to his MVP season with a stunning comeback in Dallas.16winsaring.com"}, {"15ad": "Everything and Anything Russell Westbrook Touched"}, {"2ecd": "In September 2016, if you were to ask me which is more likely: a man stepping foot on Mars or someone beating the absurd Oscar Robertson record, I’d hedge my bets and go with the Mars thing. Actually, let’s give it until the end of the season, because I’m not entirely unconvinced that Russell Westbrook can’t do both. I’m saying, there’s a strong chance here."}, {"a079": "While writing this article, I tried to classify Westbrook’s season as anything else other than “mythological.” I can’t; there is no other term more appropriate to address what we’ve witnessed over the last 82 games. It still actually kind of feels like a daydream. Russell Westbrook is a modern-day Achilles, and we are all witnesses. The only thing that upsets me about him is how casually our kids will talk about this historic moment of achievement for Russ."}, {"d341": "Kawhi Leonard: The New Age MVPThe MVP is an award historically based on offensive brilliance. Kawhi Leonard may be about to flip that on it’s head.16winsaring.com"}, {"11cc": "The Absurd Amount Of Historic Seasons Actually"}, {"d36b": "I no longer wish to debate the MVP race and vote we abolish this award for 2016-17 altogether. Generally, the “participation model” is the cornerstone of American complacency (with “at least you tried” engraved on it), but this year, it seems incredibly fitting. James Harden has been injected with the D’Antoni Venom and shifted down a guard spot in the Great Era of Position-less Basketball. Kawhi Leonard has evolved into the monster from Cloverdale. LeBron James is still a human cyborg. DeMar DeRozan had an absurd points run. Isaiah Thomas is killing everything and everyone in the fourth quarter. Devin Booker dropped 70."}, {"0ab6": "When we plot this season on the NBA timeline and spend hours brainstorming on what icon to use for the infographic, I vote we just use a mushroom cloud with rainbows coming out of it and move on."}, {"35ad": "Vlade What Have You Done? Searching Through The Ruins In SacramentoDeMarcus Cousins has been freed like a bird to New Orleans. So what now for the disaster he seemingly leaves behind?16winsaring.com"}, {"5f52": "Sacramento Kings Implode"}, {"db59": "The U.S. bought Alaska for $7.2 million (kind of a good deal). The Dutch bought Manhattan for $24 (adjusted for inflation but still a pretty trash deal). The New Orleans Pelicans bought DeMarcus Cousins for spare change, pieces of lint and the next Step… for Buddy Hield. The whole trade was orchestrated to get Hield. Let me go on the record here and state that this was a ludicrously trash deal. I haven’t seen anyone get hustled so much since the episode of Fresh Prince where Uncle Phil intentionally loses a bunch of pool games before bringing out Lucille."}, {"b8b1": "It might not work out. Boogie might bail. Pairing two big men in the era when basketball is getting smaller and smaller seems counterintuitive. But you also get to pair Boogie and the Brow for an entire season, film a procedural for CBS, get cash and possibly make the playoffs while the Kings inherit abject sadness… for Buddy Hield."}, {"efc6": "Deciphering The Talent & Value Of Julius RandleThe Lakers have a decision ahead this summer. Julius Randle has undoubted talent, but how much is he worth to LA’s…16winsaring.com"}, {"6060": "The Lakers… Winning"}, {"5d39": "If the Lakers somehow drop out of their protected pick slot and lose it to the Sixers in a historically strong draft… someone has to get “The Process” tattooed across their knuckles because the Sixers will potentially end up with Fultz/Ball, Jackson, Ben Simmons, Dario Saric and JOEL EMBIID. That is not only comical; it is potentially hazardous to an entire Eastern Conference. It’s a stage-5 basketball level assault waiting to happen (and I can’t wait to watch every single bit of it)."}, {"21e8": "What makes this so ludicrous is the Lakers and the way they’ve handled their business. First, Jeannie Buss, after consulting with George R.R. Martin, orchestrated a seemingly non-violent, but actually quite bloody takeover by ripping the franchise from her brother’s cold, dead hands. She then made Magic Johnson, famous for such incredible basketball insights as “LeBron James is good at basketball” an important player on the team. Then, they started winning games."}, {"cba0": "To be fair, I don’t think that last one was intentional since on paper, they tried really hard to lose. They traded Lou Williams, one of only four competent offensive players for… well, for nothing. Then, they decided to give the artist formerly known as Ron Artest a chance to fight another day and torpedo their season. Finally, they started benching players in games they were winning with a clear mandate of “let’s just not.” Yet, here we are, with the Lakers’ pick not looking like a certainty anymore."}, {"75bd": "28 Days Later: Was This The Coming Out Party For Dion Waiters?Waiters Island is filling up with residents over the last month. Will this be a permanent thing, or will Dion send them…16winsaring.com"}, {"1d7f": "Dion Waiters Becomes the Patron Saint of Buckets"}, {"0f01": "Waiters Island, permanent population: 1. Current temporary residency: millions. If you watched Kong: Skull Island then you know that the island in the name is a particular well hidden geographical entity, behind a permanent cloud of storms that hides a deadly paradise. You have to really want to get there to get there. This is me saying that Kong: Skull Island isn’t just a movie about a giant primate battling giant lizards while also battling a normal-sized Samuel L. Jackson. This is me saying it is also a big metaphor for Waiters Island."}, {"0b91": "It is rife with dangerous creatures and unpredictable weather patterns. Your time here can change on a whim depending on which way the wind blows. On one hand, it’s a tropical paradise with palm trees and lakes as far as the eye can see. On the other hand, its fauna is always trying to kill you. That’s how I feel about Dion Waiters. On one hand, he’s sulking in the corner asking for the ball, for his chance to be heard. On the other hand, he gives you buckets and splashes daggers on the best team in the league. Waiters Island is a force of nature with his own ecosystem, and this season, we sent an expedition there."}, {"29de": "The NBA’s One of a Kind Most Valuable Player RaceWe’ve been given the best MVP Race in the modern era. A slew of candidates, worthy winners in most other seasons — but…16winsaring.com"}, {"f8ef": "The Guy Averaging a TRIPLE DOUBLE May Not Get MVP"}, {"8625": "I get it. He may be “stat-hunting” (even so, I don’t think I can get eight rebounds per game, I’ll get like .7 tops). He may have all of the physical properties of the black hole, including absorbing all visible light and pulling objects off their orbit towards them. He may not even be very likable to you (if so, who are you and what made you this way?)."}, {"5952": "But all of that said and done, Russell Westbrook is dragging a team that just lost a superstar — a team that is composed of five average NBA players, two D-League ballers and at least three guys you can find in your YMCA league — into the playoffs. He is responsible for over half of his team’s points. He has taken a team that historically has no place being where it is and willed it into the postseason, while also taking on a responsibility shared by no one else in the NBA as much as him. He annihilated the most absurd record in league history. And we still might give the MVP to that other guy who’s also just as as good. This is absurd."}, {"d081": "Masai Ujiri should be Executive of the YearMasai Ujiri is widely accepted as one of the best Executives of his generation, but he isn’t getting enough attention…16winsaring.com"}, {"94c9": "Masai Ujiri — Still a Warlock"}, {"7d38": "There’s a reason James Dolan screens his calls now, and that reason is Masai Ujiri. In the past, I have criticized Ujiri for being too smart for his own good, or more accurately, thinking that he has to make certain decisions just to be the smartest guy in the room. Last time I said that was when the Raptors drafted Bruno Caboclo. This time around, I will need some fine cutlery because Ujiri is about to serve my words right back to me."}, {"7874": "The sentiment around these offices (basically my desk, in my bedroom) is that the Raptors have peaked in their current form, not ready to challenge for the East, let alone for the championship. Apparently, Ujiri heard that because his response was a resounding “Watch. This. Shit. Right. Here.” He flipped a training pylon and some lint into Serge Ibaka for five cents on the dollar, while also bringing in PJ Tucker to boost the team’s chances of at least containing the runaway train that is LeBron James. It may not be enough, but Ujiri still got it."}, {"8016": "Shaqtin’ a Shaq: Because We Deserve Some New MaterialJaVale McGee has made some weird plays over the course of his career, but Shaq, my man, you starred in Kazaam, so that…16winsaring.com"}, {"fa52": "The Shaqtin’ a Fool Fiasco"}, {"7317": "Shaq is the uncle at the family cookout who asks you how your life is going, only to interrupt you two minutes in and start telling you about Chantal, his new girlfriend. His time away from the game is best described as “standing on the podium yelling ‘please look at me.’” The absurdity of picking on another basketball player with the intensity that Shaq has on JaVale McGee shouldn’t be understated. It’s in poor taste. While Shaqtin a Fool is at times funny and does call into attention various gaffes from players (both superstar and fringe), picking on one player consistently is bullying."}, {"3fef": "What makes this situation more ludicrous, however, is the Warriors’ response. I get they had to stand by their man, but this was the equivalent of a kindergartener coming back with his mom to show her the boy who bullied him. This was a bizarre situation on all fronts, and we’re all worse for having witnessed it (or worse, taken sides)."}, {"975a": "The Rising Riverwalk: A Deep Dive Into The San Antonio SpursDespite what was meant to be a transitional year, the Spurs are once again sitting pretty at the top of the Western…16winsaring.com"}, {"3b84": "Spurs Finish 50+ Wins for 18th Time"}, {"c846": "I get it. This is not news. This is sun coming up in the morning. This is you walking outside in the rain and finding out that you are suddenly damp. This is eating when hungry. Death. Taxes. Spurs winning 50 games in a season."}, {"3406": "But do not let the frequency with which Pop pulls 50 wins out of his hat overshadow the absurdity of the stat. Name something you’ve been this exceptional at for 18 years? You can’t. Even breathing is like “sure, acceptable, passable even, not exceptional,” and you do it every minute of your life. You’re just okay at something you’ve been doing since birth. Gregg Popovich and the San Antonio Spurs are consistently amazing at basketball. I stopped betting against them. Swap the Phoenix Suns for the Spurs’ roster, and they can still get 50 wins with Pop at the helm."}, {"0e0a": "James Dolan’s Comments Show Everything That’s Wrong With the New York KnicksIn light of the Charles Oakley incident on Wednesday night, Knicks CEO James Dolan attempted to clear things up on The…16winsaring.com"}, {"7eb9": "Everything New York Knicks"}, {"2d2c": "When I read that the Knicks traded for the Derrick Rose and signed Joakim Noah for a gargantuan amount of money, I checked the calendar to make sure it wasn’t 2011 (spoiler: it wasn’t)."}, {"7fd5": "There are two kinds of ludicrous events. One is Russell Westbrook cascading into explosion of pure basketball and statistical overload. That is the good kind. Then, there is everything that goes into the New York Knicks’ decision-making flow-chart. That is most certainly the bad kind of ludicrous. The worst kind. They gave out questionable contracts to Rose and Noah (spoiler: Derrick Rose gets injured)."}, {"6e92": "They kicked out Charles Oakley, basically a legend and also top-five person you most certainly never want to mess with. They stuck to the triangle offense, despite their best players and the league as a whole outgrowing the principle. The New York Knicks are just here to remind you that even when things are bad, they can still always get worse. Stay vigilant."}], "content": "Recap Of The Most Ludicrous Moments Of 2016-17 NBA Season Because it’s the playoffs now, and that’s the only thing that matters. Wikimedia Commons If I’m ever commissioned to ghostwrite the LeBron James autobiography (hit me Bron, you know where to find me), I will stake my life on the line to make “I’m the wrong guy to ask about regular season” its opening phrase. Maybe even the title. Maybe I’ll just have the whole chapter say “I’m the wrong guy to ask about regular season” over and over and over again (I’d also throw in at least one or two different sentences at random points just to throw everyone off and make it a fun treasure hunting activity for the whole family). The point is, in the mind of LeBron James, the regular season doesn’t matter. And let’s be honest here, it kind of doesn’t. Sure, it can determine whether or not your team gets a good lottery pick (unless your team is the Nets) or have an impact on the playoffs to come through standings. But, when the chips are down, the only thing that matters is the playoffs. Actually, the only thing that matters is the last four to sevengames of the playoffs taking place in late May/early June. If you think really hard about this, nothing really mattered until the Game 5 Draymond Green suspension, or the Steph Curry pass that sailed out of bounds or until LeBron James descended from the heavens and eliminated the basketball and Andre Iguodala from existence for about 15 seconds. But, we’ve been through 82x30 games of basketball, and some pretty fantastic stuff happened in that stretch, so let’s review, shall we? Trade Grades: Boogie Down, Pelicans WowDeMarcus Cousins is a Pelican. In a blockbuster deal, Buddy Hield and others become Kings. We give our verdict on the…16winsaring.com Anthony Davis Sends a Distress Call I feel bad for Anthony Davis, marooned on Pelicans Island for all of his adult career so far, starved for help and left to fend for himself in this cruel world. Despite their best intentions, the Pelicans have been unable to give their superhero the necessary sidekicks for success. It’s like that time the Batman editorial team rotated through Robins, unable to decide which one to keep, eventually killing all of them off. No, Anthony Davis’ existence was that of the lone avenger. Not that he didn’t try to warn us. On October 26, 2016, in the year of our Lord, Savior and Patron Saint of basketball Michael Jordan, Anthony Davis descended onto NBA opening night like the Mongols did on nearly every unsuspecting nation in the Eurasian region. He put up 50 points, 16 rebounds, seven steals, five assists and four blocks. We thought this was the night of the apocalypse and Davis its first horseman. Unfortunately, it was just a complicated message delivered in Morse Code. When arranged properly, it reads “PLS HELP”… Probably. Russell Westbrook’s Maverick Miracle A Microcosm Of Thunder’s SeasonRussell Westbrook adds another notch to his MVP season with a stunning comeback in Dallas.16winsaring.com Everything and Anything Russell Westbrook Touched In September 2016, if you were to ask me which is more likely: a man stepping foot on Mars or someone beating the absurd Oscar Robertson record, I’d hedge my bets and go with the Mars thing. Actually, let’s give it until the end of the season, because I’m not entirely unconvinced that Russell Westbrook can’t do both. I’m saying, there’s a strong chance here. While writing this article, I tried to classify Westbrook’s season as anything else other than “mythological.” I can’t; there is no other term more appropriate to address what we’ve witnessed over the last 82 games. It still actually kind of feels like a daydream. Russell Westbrook is a modern-day Achilles, and we are all witnesses. The only thing that upsets me about him is how casually our kids will talk about this historic moment of achievement for Russ. Kawhi Leonard: The New Age MVPThe MVP is an award historically based on offensive brilliance. Kawhi Leonard may be about to flip that on it’s head.16winsaring.com The Absurd Amount Of Historic Seasons Actually I no longer wish to debate the MVP race and vote we abolish this award for 2016-17 altogether. Generally, the “participation model” is the cornerstone of American complacency (with “at least you tried” engraved on it), but this year, it seems incredibly fitting. James Harden has been injected with the D’Antoni Venom and shifted down a guard spot in the Great Era of Position-less Basketball. Kawhi Leonard has evolved into the monster from Cloverdale. LeBron James is still a human cyborg. DeMar DeRozan had an absurd points run. Isaiah Thomas is killing everything and everyone in the fourth quarter. Devin Booker dropped 70. When we plot this season on the NBA timeline and spend hours brainstorming on what icon to use for the infographic, I vote we just use a mushroom cloud with rainbows coming out of it and move on. Vlade What Have You Done? Searching Through The Ruins In SacramentoDeMarcus Cousins has been freed like a bird to New Orleans. So what now for the disaster he seemingly leaves behind?16winsaring.com Sacramento Kings Implode The U.S. bought Alaska for $7.2 million (kind of a good deal). The Dutch bought Manhattan for $24 (adjusted for inflation but still a pretty trash deal). The New Orleans Pelicans bought DeMarcus Cousins for spare change, pieces of lint and the next Step… for Buddy Hield. The whole trade was orchestrated to get Hield. Let me go on the record here and state that this was a ludicrously trash deal. I haven’t seen anyone get hustled so much since the episode of Fresh Prince where Uncle Phil intentionally loses a bunch of pool games before bringing out Lucille. It might not work out. Boogie might bail. Pairing two big men in the era when basketball is getting smaller and smaller seems counterintuitive. But you also get to pair Boogie and the Brow for an entire season, film a procedural for CBS, get cash and possibly make the playoffs while the Kings inherit abject sadness… for Buddy Hield. Deciphering The Talent & Value Of Julius RandleThe Lakers have a decision ahead this summer. Julius Randle has undoubted talent, but how much is he worth to LA’s…16winsaring.com The Lakers… Winning If the Lakers somehow drop out of their protected pick slot and lose it to the Sixers in a historically strong draft… someone has to get “The Process” tattooed across their knuckles because the Sixers will potentially end up with Fultz/Ball, Jackson, Ben Simmons, Dario Saric and JOEL EMBIID. That is not only comical; it is potentially hazardous to an entire Eastern Conference. It’s a stage-5 basketball level assault waiting to happen (and I can’t wait to watch every single bit of it). What makes this so ludicrous is the Lakers and the way they’ve handled their business. First, Jeannie Buss, after consulting with George R.R. Martin, orchestrated a seemingly non-violent, but actually quite bloody takeover by ripping the franchise from her brother’s cold, dead hands. She then made Magic Johnson, famous for such incredible basketball insights as “LeBron James is good at basketball” an important player on the team. Then, they started winning games. To be fair, I don’t think that last one was intentional since on paper, they tried really hard to lose. They traded Lou Williams, one of only four competent offensive players for… well, for nothing. Then, they decided to give the artist formerly known as Ron Artest a chance to fight another day and torpedo their season. Finally, they started benching players in games they were winning with a clear mandate of “let’s just not.” Yet, here we are, with the Lakers’ pick not looking like a certainty anymore. 28 Days Later: Was This The Coming Out Party For Dion Waiters?Waiters Island is filling up with residents over the last month. Will this be a permanent thing, or will Dion send them…16winsaring.com Dion Waiters Becomes the Patron Saint of Buckets Waiters Island, permanent population: 1. Current temporary residency: millions. If you watched Kong: Skull Island then you know that the island in the name is a particular well hidden geographical entity, behind a permanent cloud of storms that hides a deadly paradise. You have to really want to get there to get there. This is me saying that Kong: Skull Island isn’t just a movie about a giant primate battling giant lizards while also battling a normal-sized Samuel L. Jackson. This is me saying it is also a big metaphor for Waiters Island. It is rife with dangerous creatures and unpredictable weather patterns. Your time here can change on a whim depending on which way the wind blows. On one hand, it’s a tropical paradise with palm trees and lakes as far as the eye can see. On the other hand, its fauna is always trying to kill you. That’s how I feel about Dion Waiters. On one hand, he’s sulking in the corner asking for the ball, for his chance to be heard. On the other hand, he gives you buckets and splashes daggers on the best team in the league. Waiters Island is a force of nature with his own ecosystem, and this season, we sent an expedition there. The NBA’s One of a Kind Most Valuable Player RaceWe’ve been given the best MVP Race in the modern era. A slew of candidates, worthy winners in most other seasons — but…16winsaring.com The Guy Averaging a TRIPLE DOUBLE May Not Get MVP I get it. He may be “stat-hunting” (even so, I don’t think I can get eight rebounds per game, I’ll get like .7 tops). He may have all of the physical properties of the black hole, including absorbing all visible light and pulling objects off their orbit towards them. He may not even be very likable to you (if so, who are you and what made you this way?). But all of that said and done, Russell Westbrook is dragging a team that just lost a superstar — a team that is composed of five average NBA players, two D-League ballers and at least three guys you can find in your YMCA league — into the playoffs. He is responsible for over half of his team’s points. He has taken a team that historically has no place being where it is and willed it into the postseason, while also taking on a responsibility shared by no one else in the NBA as much as him. He annihilated the most absurd record in league history. And we still might give the MVP to that other guy who’s also just as as good. This is absurd. Masai Ujiri should be Executive of the YearMasai Ujiri is widely accepted as one of the best Executives of his generation, but he isn’t getting enough attention…16winsaring.com Masai Ujiri — Still a Warlock There’s a reason James Dolan screens his calls now, and that reason is Masai Ujiri. In the past, I have criticized Ujiri for being too smart for his own good, or more accurately, thinking that he has to make certain decisions just to be the smartest guy in the room. Last time I said that was when the Raptors drafted Bruno Caboclo. This time around, I will need some fine cutlery because Ujiri is about to serve my words right back to me. The sentiment around these offices (basically my desk, in my bedroom) is that the Raptors have peaked in their current form, not ready to challenge for the East, let alone for the championship. Apparently, Ujiri heard that because his response was a resounding “Watch. This. Shit. Right. Here.” He flipped a training pylon and some lint into Serge Ibaka for five cents on the dollar, while also bringing in PJ Tucker to boost the team’s chances of at least containing the runaway train that is LeBron James. It may not be enough, but Ujiri still got it. Shaqtin’ a Shaq: Because We Deserve Some New MaterialJaVale McGee has made some weird plays over the course of his career, but Shaq, my man, you starred in Kazaam, so that…16winsaring.com The Shaqtin’ a Fool Fiasco Shaq is the uncle at the family cookout who asks you how your life is going, only to interrupt you two minutes in and start telling you about Chantal, his new girlfriend. His time away from the game is best described as “standing on the podium yelling ‘please look at me.’” The absurdity of picking on another basketball player with the intensity that Shaq has on JaVale McGee shouldn’t be understated. It’s in poor taste. While Shaqtin a Fool is at times funny and does call into attention various gaffes from players (both superstar and fringe), picking on one player consistently is bullying. What makes this situation more ludicrous, however, is the Warriors’ response. I get they had to stand by their man, but this was the equivalent of a kindergartener coming back with his mom to show her the boy who bullied him. This was a bizarre situation on all fronts, and we’re all worse for having witnessed it (or worse, taken sides). The Rising Riverwalk: A Deep Dive Into The San Antonio SpursDespite what was meant to be a transitional year, the Spurs are once again sitting pretty at the top of the Western…16winsaring.com Spurs Finish 50+ Wins for 18th Time I get it. This is not news. This is sun coming up in the morning. This is you walking outside in the rain and finding out that you are suddenly damp. This is eating when hungry. Death. Taxes. Spurs winning 50 games in a season. But do not let the frequency with which Pop pulls 50 wins out of his hat overshadow the absurdity of the stat. Name something you’ve been this exceptional at for 18 years? You can’t. Even breathing is like “sure, acceptable, passable even, not exceptional,” and you do it every minute of your life. You’re just okay at something you’ve been doing since birth. Gregg Popovich and the San Antonio Spurs are consistently amazing at basketball. I stopped betting against them. Swap the Phoenix Suns for the Spurs’ roster, and they can still get 50 wins with Pop at the helm. James Dolan’s Comments Show Everything That’s Wrong With the New York KnicksIn light of the Charles Oakley incident on Wednesday night, Knicks CEO James Dolan attempted to clear things up on The…16winsaring.com Everything New York Knicks When I read that the Knicks traded for the Derrick Rose and signed Joakim Noah for a gargantuan amount of money, I checked the calendar to make sure it wasn’t 2011 (spoiler: it wasn’t). There are two kinds of ludicrous events. One is Russell Westbrook cascading into explosion of pure basketball and statistical overload. That is the good kind. Then, there is everything that goes into the New York Knicks’ decision-making flow-chart. That is most certainly the bad kind of ludicrous. The worst kind. They gave out questionable contracts to Rose and Noah (spoiler: Derrick Rose gets injured). They kicked out Charles Oakley, basically a legend and also top-five person you most certainly never want to mess with. They stuck to the triangle offense, despite their best players and the league as a whole outgrowing the principle. The New York Knicks are just here to remind you that even when things are bad, they can still always get worse. Stay vigilant. ", "child": "74_1"}