{"name": "764", "parent": "", "title": "Think you know the top web browsers?", "sentences": [{"22c8": "Think you know the top web browsers?"}, {"d324": "Our traditional idea of the top five browsers may be over-simplified, outdated and skewed."}, {"4e3e": "If you attend web developer events in much of Europe and North America, inevitably you will see the same browser logos keep cropping up in the speakers’ slides:"}, {"e1e9": "You’ve probably seen lots of slides that look like this."}, {"ea3b": "Chrome, Firefox, Safari, IE/Edge, Opera… It is a common idea that these are the five “major browsers”. Our familiarity with them is comforting, but it might be a skewed and outdated view. Partly from our Western bubble and partly a hangover from the days of desktop dominance."}, {"0602": "Let’s take a look at some numbers so we can better represent the reality."}, {"5431": "All platforms"}, {"1449": "First, let’s go as broad as we can: all platforms (desktop, tablet, mobile), worldwide. Here’s the top five, in order, according to StatCounter:"}, {"b3b8": "Source: StatCounter, Feb 2017. Percentages rounded to nearest whole number. *Note: I’ve used the Edge logo, but these stats do not break out Edge and Internet Explorer."}, {"abc5": "Hey there’s a weird orange logo in the middle! That’s UC Browser — originated in China and owned by Alibaba Group — which has a notable market share, particularly in Asia."}, {"9ece": "This is an important point. The browser market share can vary a lot depending on location."}, {"3d2e": "For example, in Russia (population: 143 million), StatCounter suggests Chrome is on top as we would expect, but guess which comes second? It’s one we don’t tend to see mentioned much here: Yandex."}, {"4da8": "Yandex logo"}, {"282a": "Mobile"}, {"2c9f": "We know that mobile is “eating the world”. In fact, StatCounter recently announced that, according to their data, Android has now surpassed Windows as the world’s number one Internet platform. However, out of habit, we still tend to think about desktop by default!"}, {"ff80": "So let’s take a look at mobile browsers. StatCounter suggests a different set again:"}, {"6aa3": "Source: StatCounter, Feb 2016 to 2017. Percentages rounded to nearest whole number. *Note: I’ve used the Opera Mini logo, but these stats do not break out Opera Mini, Opera Mobile and Opera Coast."}, {"47c1": "Hey now there’s a strange purple logo - our Samsung Internet! StatCounter suggests it’s a top 3 mobile browser in Europe, with over 15% market share in some countries:"}, {"b75f": "Mobile browser market share in Germany. Source: StatCounter, Jan 2017 to Feb 2017"}, {"3595": "As for Opera on the right — in 2016 Opera shared that Opera Mini was Africa’s favourite browser, with an impressive 58% market share."}, {"68a3": "Challenging our assumptions"}, {"ab81": "Business coaches often teach us to recognise and challenge our own assumptions. Our assumptions about browser market share should be no different. The data may tell a different story."}, {"18c0": "I’ve referenced StatCounter above, but I would also suggest seeking multiple sources. Although StatCounter’s data are aggregated from over 3 million websites, it should still only be considered an approximate picture of reality. You may get some anomalies, especially when you narrow down on specific geographies and platforms."}, {"5c15": "Is the best data your own data?"}, {"54ae": "In general it’s probably best to pay most attention to your own analytics. However, this could be misleading too. Some analytics providers appear to be confused by the user agent strings and do not break out browsers like Samsung Internet (which is based on Chromium) correctly. For example, if you rely only on Google Analytics, you may not be seeing the whole story:"}, {"f3a4": "Also, if you simply focus on the browsers of your existing users, you might fail to spot the trends for your potential users. Bruce Lawson covers this brilliantly in “World Wide Web, Not Wealthy Western Web”:"}, {"936e": "When I speak at conferences in rich Western countries, I often ask people, “Where will your next customers come from?” You don’t know. In our truly worldwide web, you can’t know. — Bruce Lawson"}, {"63fa": "Browsers everywhere"}, {"4d9d": "So do you really know which are the top browsers, both amongst your existing customers and your potential audience? Perhaps it’s worth taking a closer look; it might just be time to check your site in some of the lesser-known, yet popular browsers like UC, Yandex and Samsung Internet."}, {"b9b1": "And next time you’re making a slide to share about browser support, or see someone else present one, please take a moment to consider: is this based on assumptions, or on data? Why not update it to include the top browsers globally, or — like Ada did recently in Bulgaria — for the location of your audience? You may find Cătălin Mariș’s browser-logos repository helpful!"}, {"173a": "Many browsers… Mobile browser logos from alraa/browser-logos. NB. The purple one is our new Samsung Internet logo, currently in beta and coming soon to stable!"}, {"a764": "There may be more browsers out there than we care to think, but as my colleague Diego shared, thankfully they are all based on our open web standards: Many browsers, one Web!"}, {"0f27": "Update: Peter Gasston made a great point that a very major “browser” (well, a WebView) I have not mentioned here is Facebook. Another example of the frequent omissions in the “browsers” we think and talk about!"}], "content": "Think you know the top web browsers? Our traditional idea of the top five browsers may be over-simplified, outdated and skewed. If you attend web developer events in much of Europe and North America, inevitably you will see the same browser logos keep cropping up in the speakers’ slides: You’ve probably seen lots of slides that look like this. Chrome, Firefox, Safari, IE/Edge, Opera… It is a common idea that these are the five “major browsers”. Our familiarity with them is comforting, but it might be a skewed and outdated view. Partly from our Western bubble and partly a hangover from the days of desktop dominance. Let’s take a look at some numbers so we can better represent the reality. All platforms First, let’s go as broad as we can: all platforms (desktop, tablet, mobile), worldwide. Here’s the top five, in order, according to StatCounter: Source: StatCounter, Feb 2017. Percentages rounded to nearest whole number. *Note: I’ve used the Edge logo, but these stats do not break out Edge and Internet Explorer. Hey there’s a weird orange logo in the middle! That’s UC Browser — originated in China and owned by Alibaba Group — which has a notable market share, particularly in Asia. This is an important point. The browser market share can vary a lot depending on location. For example, in Russia (population: 143 million), StatCounter suggests Chrome is on top as we would expect, but guess which comes second? It’s one we don’t tend to see mentioned much here: Yandex. Yandex logo Mobile We know that mobile is “eating the world”. In fact, StatCounter recently announced that, according to their data, Android has now surpassed Windows as the world’s number one Internet platform. However, out of habit, we still tend to think about desktop by default! So let’s take a look at mobile browsers. StatCounter suggests a different set again: Source: StatCounter, Feb 2016 to 2017. Percentages rounded to nearest whole number. *Note: I’ve used the Opera Mini logo, but these stats do not break out Opera Mini, Opera Mobile and Opera Coast. Hey now there’s a strange purple logo - our Samsung Internet! StatCounter suggests it’s a top 3 mobile browser in Europe, with over 15% market share in some countries: Mobile browser market share in Germany. Source: StatCounter, Jan 2017 to Feb 2017 As for Opera on the right — in 2016 Opera shared that Opera Mini was Africa’s favourite browser, with an impressive 58% market share. Challenging our assumptions Business coaches often teach us to recognise and challenge our own assumptions. Our assumptions about browser market share should be no different. The data may tell a different story. I’ve referenced StatCounter above, but I would also suggest seeking multiple sources. Although StatCounter’s data are aggregated from over 3 million websites, it should still only be considered an approximate picture of reality. You may get some anomalies, especially when you narrow down on specific geographies and platforms. Is the best data your own data? In general it’s probably best to pay most attention to your own analytics. However, this could be misleading too. Some analytics providers appear to be confused by the user agent strings and do not break out browsers like Samsung Internet (which is based on Chromium) correctly. For example, if you rely only on Google Analytics, you may not be seeing the whole story: Also, if you simply focus on the browsers of your existing users, you might fail to spot the trends for your potential users. Bruce Lawson covers this brilliantly in “World Wide Web, Not Wealthy Western Web”: When I speak at conferences in rich Western countries, I often ask people, “Where will your next customers come from?” You don’t know. In our truly worldwide web, you can’t know. — Bruce Lawson Browsers everywhere So do you really know which are the top browsers, both amongst your existing customers and your potential audience? Perhaps it’s worth taking a closer look; it might just be time to check your site in some of the lesser-known, yet popular browsers like UC, Yandex and Samsung Internet. And next time you’re making a slide to share about browser support, or see someone else present one, please take a moment to consider: is this based on assumptions, or on data? Why not update it to include the top browsers globally, or — like Ada did recently in Bulgaria — for the location of your audience? You may find Cătălin Mariș’s browser-logos repository helpful! Many browsers… Mobile browser logos from alraa/browser-logos. NB. The purple one is our new Samsung Internet logo, currently in beta and coming soon to stable! There may be more browsers out there than we care to think, but as my colleague Diego shared, thankfully they are all based on our open web standards: Many browsers, one Web! Update: Peter Gasston made a great point that a very major “browser” (well, a WebView) I have not mentioned here is Facebook. Another example of the frequent omissions in the “browsers” we think and talk about! ", "child": "764_1\t764_2\t764_3\t764_4\t764_5\t764_6\t764_7"}