{"name": "790", "parent": "", "title": "La Era de la Disrupción ha terminado.", "sentences": [{"5e66": "La Era de la Disrupción ha terminado."}, {"0e32": "Trabajar en publicidad es lo mejor y a la vez lo peor que me ha sucedido. Lo mejor, porque abrió mi mente de informático a un mundo en donde la creatividad, la innovación y la tecnología confluyen para crear cosas nuevas y diferentes. En dónde no hay barreras a las ideas y en dónde ser raro es prácticamente un requisito para funcionar. Algunas de las mentes más brillantes que he tenido oportunidad de encontrar fueron o actualmente son parte de una agencia de publicidad, disparando ideas al por mayor, buscando alguna que deje huella en los libros de historia. Es la industria que decidió brindar por los locos, es una industria que vive del potencial de su talento y aquellos que sobreviven, generalmente trascienden la industria misma."}, {"340a": "Sin embargo, también es una industria que me ha dejado ver lo peor de la especie humana. Una industria tan enfocada en algo subjetivo como la “creatividad” o “las ideas” da pie a verdaderos monstruos, esclavos de su propio ego y de su propio orgullo. Individuos que no se cansa de ver su imagen reflejados en un trofeo de bronce, plata u oro, que avala que efectivamente son los más creativos, los más innovadores, según su propio criterio, aún cuando este criterio esté sustentado en parámetros subjetivos y cambiantes, definidos por nadie y por nada, lo que significa que esos premios también están sustentados en nada, aunque su ego no los deje ver esa verdad."}, {"d9b7": "Trabajar entre sus filas, escucharlos cómo se expresan de los clientes, de los proyectos, de sus colegas y de ellos mismos es deprimente. Escucharlos regodearse en que entregar tarde, mal, sobre presupuestos, ideas que nunca cumplen las promesas ni las expectativas, repartiendo culpas a clientes, integrantes del equipo, crisis económicas, cumpliendo caprichos. Las agencias asignan un equipo a ganar un ‘pitch’ y luego contratan a gente con mucha menor experiencia a cumplir las expectativas de lo que se vendió. Las agencias preparan lo que sea con tal de vender el proyecto, porque lo que importa es impactar al cliente — que generalmente tiene su propio ego y ambición — sin importar si lo que se vende cumple o no con el presupuesto asignado (suponiendo que si quiera se habla de un presupuesto al hacer la solicitud)."}, {"cd33": "Las agencias viven de operar en la opacidad, de vender recursos que se sobre venden 200% o 300%, de operar con trainees, gente con poca experiencia y pretender que el cliente está recibiendo el mejor servicio y la mejor calidad. Las agencias no tienen rendición de cuentas porque no hay métricas reales que determinen la efectividad de las campañas, y eso asumiendo que las campañas si quiera tienen objetivos para medir. En esta industria no gana la mejor idea, no gana la idea que el cliente necesita, gana la idea que se sobre vende mejor, de manera más apantallante, que hace sentir al cliente que le está dando más aún cuando ese “más” sólo sea aire caliente."}, {"865d": "Décadas de clientes sin criterio, sin una idea clara de que esperar y agencias sin una idea clara de qué ofrecer, peleando por un hueso con estrategias que solo son refritos de otras agencias, de otros países y de otros mercados han dado como resultado una industria que brilla por lo peor que puede ofrecer. La gente innovadora, la gente visionaria encuentra lugar en otras industrias, en entretenimiento o tecnología, dónde pueda explotar mejor su talento sin tener que llegar a ninguna clase de compromiso, sin tener que estar sujeto a presupuestos y egos variables y volátiles, dónde su trabajo realmente sea trascendente a nivel cultural y reditúe algo más que una estéril estatuilla en un anaquel."}, {"4536": "El discurso con el que las agencias han vendido sus propuestas durante casi 30 años es “Con nuestra campaña, la gente sí te va a voltear a ver”. Vamos a ser tan intrusivos, tan escandalosos, tan “diferentes” que la gente no tendrá otra opción más que voltear a ver el anuncio. En algunas agencias se refieren a esta actividad como “Disrupción”. El problema es que 30 años, a nivel sociedad, es mucho tiempo. En 30 años es más que tiempo suficiente para que todo sea disruptivo, todo sea interruptivo, todo trate de llamar la atención cada vez de maneras más molestas y absurdas, contaminando ahora páginas de internet, juegos, tweets, hasta videos de YouTube. Todo es disruptivo y la gente se ha hecho inmune a la disrupción. La disrupción es la norma."}, {"2e33": "Esto es malo para las agencias de publicidad, que han pasado tanto tiempo viendo su reflejo en el espejo que han fallado en notar las arrugas en su envejecido y obsoleto modelo de negocio. Mientras admiran su creatividad e ingenio, el resto del mundo ha seguido adelante, sabiendo que la única constante es el cambio, sabiendo que las necesidades del consumidor cambian, que los entornos socio culturales cambian, que las herramientas que tenemos disponibles cambian. Ahora, mientras las agencias de publicidad quitan los ojos de su espejo por un breve instante ven con horror cómo el mundo los ha dejado atrás."}, {"4959": "Tratan de compensar su obsolescencia poniéndose una capa de maquillaje, pretendiendo hacer lo de “ahora”, tirando palabras como “Big Data” y “Analytics”, “Programatic” y “Digital”, comprando agencias de diseño y desarrollo web sin si quiera entender qué es HTML o IP, van a eventos de tecnología, toman nota en #SXSW, crean “Startups”, Instalan pantallas con gráficas que no saben leer ni interpretar, pero saben que es lo que los clientes ahora quieren comprar bajo la ilusión de que si les funcionó antes, puede funcionarles una vez más. Hasta abren categorías digitales en sus entregas de premios, categorías plagadas de anuncios de televisión operando en el paradigma digital y considerando que eso es suficientemente digno ahora de una estéril estatuilla, reconociendo su “creatividad” ahora en un nuevo entorno más."}, {"4a60": "Su falta de respeto a las nuevas plataformas es tal, que para ellos no es más que un nuevo medio, en el Internet ellos no ven más que un periódico electrónico o una televisión en la que los programas no necesitan durar 22 minutos. ¿Entender Internet? ¿Entender de Ingeniería, desarrollo, diseño, usabilidad, protocolos, mejores prácticas y todo un campo de ciencia y matemáticas que toma décadas en entender? ¿Para qué? Ellos tienen la creatividad de su lado, ellos no tienen tiempo de aprender qué es un lenguaje de programación o cómo funciona un casco de realidad virtual o el reto tecnológico que implican las redes neuronales que dan pié a la revolución actual de Machine Learning."}, {"7b95": "Pero esas son buenas noticias para todos los demás, porque mientras las agencias de publicidad celebran sus victorias fingidas, construidas sobre reconocimientos falsos y huecos, los clientes ahora más que nunca están desesperados por soluciones reales que se traduzcan en algún impacto de negocio. Las marcas ahora más que nunca, se han dado cuenta de que necesitan tener ojos y oídos pegados a sus consumidores. Ahora saben que cada punto de contacto está bajo constante supervisión de cientos de miles de usuarios interconectados, cada uno con la capacidad de hacer o deshacer un producto o una empresa completa. La caída de gigantes como Nokia, Motorla o Kodak ponen a temblar hasta la marca de consumo más sólida. Tesla logra ventas 300% más allá de su capacidad de producción mientras que General Motors se recupera de declararse en bancarrota hace menos de una década. En Internet no hay gigantes, en Internet no hay marcas inmunes a la furia de un consumidor insatisfecho, de un producto con baja calidad o que no cumple expectativas. Las marcas lo saben y ahora más que nunca están absoluta y completamente desesperadas."}, {"3115": "Buscaron apoyo en las agencias de publicidad. “Somos centros de innovación y creatividad” dijeron, mientras presentaban exactamente la misma idea que la competencia había implementado al otro lado del mundo un año antes. “Esto mantendrá a flote tu negocio un breve instante más” dicen, completamente conscientes de que no tienen la menor idea si lo que proponen es verdad o no. Ahora más que nunca necesitamos estrategias fundamentadas en evidencia, que garanticen resultados, que impacten a nivel social y cultural, porque ahora los consumidores no exigen disrupción, exigen transparencia, calidad, funcionalidad, servicio. Exigen ser tomados en cuenta, valorados y que las empresas tomen responsabilidad de sus productos y servicios."}, {"4cf9": "La era de la disrupción ha termiando. Abran paso a la era de la solución."}], "content": "La Era de la Disrupción ha terminado. Trabajar en publicidad es lo mejor y a la vez lo peor que me ha sucedido. Lo mejor, porque abrió mi mente de informático a un mundo en donde la creatividad, la innovación y la tecnología confluyen para crear cosas nuevas y diferentes. En dónde no hay barreras a las ideas y en dónde ser raro es prácticamente un requisito para funcionar. Algunas de las mentes más brillantes que he tenido oportunidad de encontrar fueron o actualmente son parte de una agencia de publicidad, disparando ideas al por mayor, buscando alguna que deje huella en los libros de historia. Es la industria que decidió brindar por los locos, es una industria que vive del potencial de su talento y aquellos que sobreviven, generalmente trascienden la industria misma. Sin embargo, también es una industria que me ha dejado ver lo peor de la especie humana. Una industria tan enfocada en algo subjetivo como la “creatividad” o “las ideas” da pie a verdaderos monstruos, esclavos de su propio ego y de su propio orgullo. Individuos que no se cansa de ver su imagen reflejados en un trofeo de bronce, plata u oro, que avala que efectivamente son los más creativos, los más innovadores, según su propio criterio, aún cuando este criterio esté sustentado en parámetros subjetivos y cambiantes, definidos por nadie y por nada, lo que significa que esos premios también están sustentados en nada, aunque su ego no los deje ver esa verdad. Trabajar entre sus filas, escucharlos cómo se expresan de los clientes, de los proyectos, de sus colegas y de ellos mismos es deprimente. Escucharlos regodearse en que entregar tarde, mal, sobre presupuestos, ideas que nunca cumplen las promesas ni las expectativas, repartiendo culpas a clientes, integrantes del equipo, crisis económicas, cumpliendo caprichos. Las agencias asignan un equipo a ganar un ‘pitch’ y luego contratan a gente con mucha menor experiencia a cumplir las expectativas de lo que se vendió. Las agencias preparan lo que sea con tal de vender el proyecto, porque lo que importa es impactar al cliente — que generalmente tiene su propio ego y ambición — sin importar si lo que se vende cumple o no con el presupuesto asignado (suponiendo que si quiera se habla de un presupuesto al hacer la solicitud). Las agencias viven de operar en la opacidad, de vender recursos que se sobre venden 200% o 300%, de operar con trainees, gente con poca experiencia y pretender que el cliente está recibiendo el mejor servicio y la mejor calidad. Las agencias no tienen rendición de cuentas porque no hay métricas reales que determinen la efectividad de las campañas, y eso asumiendo que las campañas si quiera tienen objetivos para medir. En esta industria no gana la mejor idea, no gana la idea que el cliente necesita, gana la idea que se sobre vende mejor, de manera más apantallante, que hace sentir al cliente que le está dando más aún cuando ese “más” sólo sea aire caliente. Décadas de clientes sin criterio, sin una idea clara de que esperar y agencias sin una idea clara de qué ofrecer, peleando por un hueso con estrategias que solo son refritos de otras agencias, de otros países y de otros mercados han dado como resultado una industria que brilla por lo peor que puede ofrecer. La gente innovadora, la gente visionaria encuentra lugar en otras industrias, en entretenimiento o tecnología, dónde pueda explotar mejor su talento sin tener que llegar a ninguna clase de compromiso, sin tener que estar sujeto a presupuestos y egos variables y volátiles, dónde su trabajo realmente sea trascendente a nivel cultural y reditúe algo más que una estéril estatuilla en un anaquel. El discurso con el que las agencias han vendido sus propuestas durante casi 30 años es “Con nuestra campaña, la gente sí te va a voltear a ver”. Vamos a ser tan intrusivos, tan escandalosos, tan “diferentes” que la gente no tendrá otra opción más que voltear a ver el anuncio. En algunas agencias se refieren a esta actividad como “Disrupción”. El problema es que 30 años, a nivel sociedad, es mucho tiempo. En 30 años es más que tiempo suficiente para que todo sea disruptivo, todo sea interruptivo, todo trate de llamar la atención cada vez de maneras más molestas y absurdas, contaminando ahora páginas de internet, juegos, tweets, hasta videos de YouTube. Todo es disruptivo y la gente se ha hecho inmune a la disrupción. La disrupción es la norma. Esto es malo para las agencias de publicidad, que han pasado tanto tiempo viendo su reflejo en el espejo que han fallado en notar las arrugas en su envejecido y obsoleto modelo de negocio. Mientras admiran su creatividad e ingenio, el resto del mundo ha seguido adelante, sabiendo que la única constante es el cambio, sabiendo que las necesidades del consumidor cambian, que los entornos socio culturales cambian, que las herramientas que tenemos disponibles cambian. Ahora, mientras las agencias de publicidad quitan los ojos de su espejo por un breve instante ven con horror cómo el mundo los ha dejado atrás. Tratan de compensar su obsolescencia poniéndose una capa de maquillaje, pretendiendo hacer lo de “ahora”, tirando palabras como “Big Data” y “Analytics”, “Programatic” y “Digital”, comprando agencias de diseño y desarrollo web sin si quiera entender qué es HTML o IP, van a eventos de tecnología, toman nota en #SXSW, crean “Startups”, Instalan pantallas con gráficas que no saben leer ni interpretar, pero saben que es lo que los clientes ahora quieren comprar bajo la ilusión de que si les funcionó antes, puede funcionarles una vez más. Hasta abren categorías digitales en sus entregas de premios, categorías plagadas de anuncios de televisión operando en el paradigma digital y considerando que eso es suficientemente digno ahora de una estéril estatuilla, reconociendo su “creatividad” ahora en un nuevo entorno más. Su falta de respeto a las nuevas plataformas es tal, que para ellos no es más que un nuevo medio, en el Internet ellos no ven más que un periódico electrónico o una televisión en la que los programas no necesitan durar 22 minutos. ¿Entender Internet? ¿Entender de Ingeniería, desarrollo, diseño, usabilidad, protocolos, mejores prácticas y todo un campo de ciencia y matemáticas que toma décadas en entender? ¿Para qué? Ellos tienen la creatividad de su lado, ellos no tienen tiempo de aprender qué es un lenguaje de programación o cómo funciona un casco de realidad virtual o el reto tecnológico que implican las redes neuronales que dan pié a la revolución actual de Machine Learning. Pero esas son buenas noticias para todos los demás, porque mientras las agencias de publicidad celebran sus victorias fingidas, construidas sobre reconocimientos falsos y huecos, los clientes ahora más que nunca están desesperados por soluciones reales que se traduzcan en algún impacto de negocio. Las marcas ahora más que nunca, se han dado cuenta de que necesitan tener ojos y oídos pegados a sus consumidores. Ahora saben que cada punto de contacto está bajo constante supervisión de cientos de miles de usuarios interconectados, cada uno con la capacidad de hacer o deshacer un producto o una empresa completa. La caída de gigantes como Nokia, Motorla o Kodak ponen a temblar hasta la marca de consumo más sólida. Tesla logra ventas 300% más allá de su capacidad de producción mientras que General Motors se recupera de declararse en bancarrota hace menos de una década. En Internet no hay gigantes, en Internet no hay marcas inmunes a la furia de un consumidor insatisfecho, de un producto con baja calidad o que no cumple expectativas. Las marcas lo saben y ahora más que nunca están absoluta y completamente desesperadas. Buscaron apoyo en las agencias de publicidad. “Somos centros de innovación y creatividad” dijeron, mientras presentaban exactamente la misma idea que la competencia había implementado al otro lado del mundo un año antes. “Esto mantendrá a flote tu negocio un breve instante más” dicen, completamente conscientes de que no tienen la menor idea si lo que proponen es verdad o no. Ahora más que nunca necesitamos estrategias fundamentadas en evidencia, que garanticen resultados, que impacten a nivel social y cultural, porque ahora los consumidores no exigen disrupción, exigen transparencia, calidad, funcionalidad, servicio. Exigen ser tomados en cuenta, valorados y que las empresas tomen responsabilidad de sus productos y servicios. La era de la disrupción ha termiando. Abran paso a la era de la solución. ", "child": "790_1\t790_2"}