{"name": "794", "parent": "", "title": "Why Geckoboard Picked Clubhouse Over JIRA & Trello", "sentences": [{"cfbd": "Why Geckoboard Picked Clubhouse Over JIRA & Trello"}, {"40d2": "This post was written by Tom Randle of Geckoboard and originally featured on the Geckoboard Dev Blog"}, {"bee1": "Six months ago we switched our project management tool from Trello to Clubhouse."}, {"02af": "As not many people have heard of Clubhouse yet, we thought we’d share why we took the plunge and why we’d recommend it to other agile development teams looking for more structure in their working days."}, {"ea13": "Trello"}, {"f600": "When Trello arrived on the scene, it was a complete revelation. Its simple approach and snappy UI were a welcome contrast to Atlassian’s JIRA and Thoughtworks’ Mingle. For those of us with light enough processes to give up the big tools, it was a game changer."}, {"254f": "We had a long honeymoon period and Trello remains a great product (we still use it in our other teams), but as the main tool for managing our development team’s workflow, it was beginning to drive us crazy."}, {"a6bf": "Our process and how we used Trello"}, {"e827": "At Geckoboard, we’ve been following a Kanban process for the past couple of years, splitting work into chunks of work that take less than a day to complete."}, {"5afa": "We have two development teams, usually working on different areas of the product. In Trello, each team had their own board with “Ready”, “Doing” and “Done” columns."}, {"3281": "One of our team’s Trello boards from last year"}, {"9643": "The team would update cards in these boards throughout the day. We had them up on TVs in the office and referred to them during our morning standups."}, {"82e0": "The “Ready” column was predominantly managed by the team’s product manager. It was deliberately kept short and only contained work that had been discussed and planned. “Doing” contained work in progress, and “Done” was everything that had shipped. We experimented with splitting “Doing” into more steps a few times but in the end, we always reverted back to the simple three columns."}, {"a763": "Not every card needed a “QA” or “Review” step, and we didn’t want to encourage people to pick up a new card until their previous one was fully complete. Our backlog was significantly more chaotic."}, {"4c56": "As with all development teams, it contains a huge variety of potential work. It ranges from tightly defined high-priority features, likely to be implemented within a couple of weeks, to loose idea dumps of high-level functionality that might never be built. Not to mention all the bugs, refactoring, and infrastructure work."}, {"599d": "We tried many different strategies to tame this mess. What we found worked best was using separate boards as holding areas, with columns to group together related cards and add a bit more structure."}, {"3092": "Outgrowing Trello"}, {"e689": "Despite these attempts to create order, as product managers we’d often be asked where something was, whether there was an existing card for something, or on which board a new card should be created."}, {"7ba3": "Trello Alternative for Software Teams | ClubhouseNeed a Trello alternative for your software team? See the big picture and manage software projects more effectively…clubhouse.io"}, {"9691": "We would often accidentally create duplicate cards. A big reason for this was Trello’s limited tagging and search features. As Trello boards are independent of each other, the behaviour of labels when moving cards between them is horrible."}, {"4d7e": "However, the two biggest issues were the absence of:"}, {"5ac1": "To illustrate this, imagine working on a big product feature that might take a couple of months to fully complete."}, {"6f9d": "In Trello, the best we could do to show that the cards related to each other was to prefix their titles with the feature or epic name, and paste links to other cards in the description. This was an inadequate, slow hack that still did nothing to help the team see the bigger picture. You can’t just click on a card and see everything that related to it, nor can you collapse all the detail and just see the headlines when you need to think longer term."}, {"64df": "Our journey to a better tool"}, {"82ce": "The problem with replacing Trello was that it had spoiled us. Once you’ve experienced how quick and easy it is to update cards, you can’t give that up."}, {"6d81": "We signed up for a trial of every project management tool out there practically every month for years, but Pivotal Tracker and JIRA were the only serious contenders until we stumbled across Clubhouse."}, {"c9f6": "Pivotal Tracker"}, {"0f23": "Pivotal Tracker’s much more of a middle ground between JIRA and Trello, but it’s very opinionated when it comes to workflow. We just couldn’t get it to fit our process, so never got very far with it!"}, {"604a": "JIRA"}, {"06a9": "JIRA’s the de-facto progression for most people needing more than Trello. Several of us at Geckoboard have used it in previous jobs, and it was the tool we wanted to move to. However, after three separate trial attempts over the course of several months, we couldn’t make the leap."}, {"5ca6": "There are lots of things to love about JIRA: JQL, swimlanes, proper relationships, and customizable metadata to name just a few, but they come at the cost of complexity."}, {"8e3a": "JIRA Alternative | ClubhouseLooking for a lightweight JIRA alternative? Clubhouse is easy and intuitive to use, without compromising on important…clubhouse.io"}, {"5755": "Ultimately, JIRA just felt slow and cumbersome compared to what we were used to — and when we only needed a fraction of the functionality — we couldn’t justify it to the team."}, {"e7a2": "We had problems with the OnDemand service being slow to load, which put us off as we didn’t really want the burden of self hosting. Other issues were the lack of native support for markdown and the difficulty associated with removing certain concepts that didn’t make sense for us — such as Releases."}, {"b936": "All that said, if we’d not found Clubhouse, I think by now we would have made the leap to JIRA."}, {"e279": "Clubhouse"}, {"2d38": "We stumbled across Clubhouse by chance when our QA Engineer was researching something else entirely. Intrigued, he signed up for a trial. Straight away we were impressed."}, {"c329": "Clubhouse’s Stories view with its powerful filtering controls"}, {"fb29": "On the great Trello-to-JIRA spectrum, Clubhouse sits close to Trello in terms of simplicity and ease of use. But unlike Trello, it’s designed specifically for agile development teams."}, {"5cca": "How to Use Story TypesClubhouse comes with three story types: features, bugs and chores. Using story types can tell you a lot about your…blog.clubhouse.io"}, {"7655": "That means it has the concept of Epics. Cards can be linked so you can flag a duplicate bug or a card that relates to, or blocks, another. Cards can be either a Feature, Bug or Chore. There are powerful labelling and filtering features."}, {"d66a": "A typical Clubhouse card!"}, {"216e": "You can also use story points if you’re into that kind of thing (we’re not!). Cards that hang around too long in the Doing column show their age. Cards can be bulk edited with ease. Tasks can be assigned to individuals. As a developer, it’s easy to see all the cards assigned to you in a single view."}, {"be16": "The new Milestone feature is a handy additional way of organizing more complex projects that involve multiple epics. Epics and Milestones have their own views which clearly show you how far you are through them — one of the key things we were missing in Trello. We also find these views very handy when planning as a team."}, {"9fe4": "An epic in Clubhouse"}, {"63a4": "One thing that will seem unfamiliar to someone moving from Trello is that’s there’s only one ‘real’ board, which contains all the cards you’ve ever made. However, you can create and save filtered ‘views’ called Workspaces. For instance, a ‘Standup board’ for each team or an overview of all the cards in a particular project. Once you’re used to it though, it makes perfect sense."}, {"de5e": "Another huge plus in Clubhouse’s favor is their pace of development. Milestones, Reporting and numerous other improvements have all launched in the past few months. Their support team is also excellent!"}, {"1ece": "Six months in we’re really happy with our decision to move to Clubhouse. No product will ever completely tame your backlog, but if it did then we product managers would be out of a job!"}, {"1c80": "If you’re on the lookout for a better tool — look at what Clubhouse has to offer."}], "content": "Why Geckoboard Picked Clubhouse Over JIRA & Trello This post was written by Tom Randle of Geckoboard and originally featured on the Geckoboard Dev Blog Six months ago we switched our project management tool from Trello to Clubhouse. As not many people have heard of Clubhouse yet, we thought we’d share why we took the plunge and why we’d recommend it to other agile development teams looking for more structure in their working days. Trello When Trello arrived on the scene, it was a complete revelation. Its simple approach and snappy UI were a welcome contrast to Atlassian’s JIRA and Thoughtworks’ Mingle. For those of us with light enough processes to give up the big tools, it was a game changer. We had a long honeymoon period and Trello remains a great product (we still use it in our other teams), but as the main tool for managing our development team’s workflow, it was beginning to drive us crazy. Our process and how we used Trello At Geckoboard, we’ve been following a Kanban process for the past couple of years, splitting work into chunks of work that take less than a day to complete. We have two development teams, usually working on different areas of the product. In Trello, each team had their own board with “Ready”, “Doing” and “Done” columns. One of our team’s Trello boards from last year The team would update cards in these boards throughout the day. We had them up on TVs in the office and referred to them during our morning standups. The “Ready” column was predominantly managed by the team’s product manager. It was deliberately kept short and only contained work that had been discussed and planned. “Doing” contained work in progress, and “Done” was everything that had shipped. We experimented with splitting “Doing” into more steps a few times but in the end, we always reverted back to the simple three columns. Not every card needed a “QA” or “Review” step, and we didn’t want to encourage people to pick up a new card until their previous one was fully complete. Our backlog was significantly more chaotic. As with all development teams, it contains a huge variety of potential work. It ranges from tightly defined high-priority features, likely to be implemented within a couple of weeks, to loose idea dumps of high-level functionality that might never be built. Not to mention all the bugs, refactoring, and infrastructure work. We tried many different strategies to tame this mess. What we found worked best was using separate boards as holding areas, with columns to group together related cards and add a bit more structure. Outgrowing Trello Despite these attempts to create order, as product managers we’d often be asked where something was, whether there was an existing card for something, or on which board a new card should be created. Trello Alternative for Software Teams | ClubhouseNeed a Trello alternative for your software team? See the big picture and manage software projects more effectively…clubhouse.io We would often accidentally create duplicate cards. A big reason for this was Trello’s limited tagging and search features. As Trello boards are independent of each other, the behaviour of labels when moving cards between them is horrible. However, the two biggest issues were the absence of: To illustrate this, imagine working on a big product feature that might take a couple of months to fully complete. In Trello, the best we could do to show that the cards related to each other was to prefix their titles with the feature or epic name, and paste links to other cards in the description. This was an inadequate, slow hack that still did nothing to help the team see the bigger picture. You can’t just click on a card and see everything that related to it, nor can you collapse all the detail and just see the headlines when you need to think longer term. Our journey to a better tool The problem with replacing Trello was that it had spoiled us. Once you’ve experienced how quick and easy it is to update cards, you can’t give that up. We signed up for a trial of every project management tool out there practically every month for years, but Pivotal Tracker and JIRA were the only serious contenders until we stumbled across Clubhouse. Pivotal Tracker Pivotal Tracker’s much more of a middle ground between JIRA and Trello, but it’s very opinionated when it comes to workflow. We just couldn’t get it to fit our process, so never got very far with it! JIRA JIRA’s the de-facto progression for most people needing more than Trello. Several of us at Geckoboard have used it in previous jobs, and it was the tool we wanted to move to. However, after three separate trial attempts over the course of several months, we couldn’t make the leap. There are lots of things to love about JIRA: JQL, swimlanes, proper relationships, and customizable metadata to name just a few, but they come at the cost of complexity. JIRA Alternative | ClubhouseLooking for a lightweight JIRA alternative? Clubhouse is easy and intuitive to use, without compromising on important…clubhouse.io Ultimately, JIRA just felt slow and cumbersome compared to what we were used to — and when we only needed a fraction of the functionality — we couldn’t justify it to the team. We had problems with the OnDemand service being slow to load, which put us off as we didn’t really want the burden of self hosting. Other issues were the lack of native support for markdown and the difficulty associated with removing certain concepts that didn’t make sense for us — such as Releases. All that said, if we’d not found Clubhouse, I think by now we would have made the leap to JIRA. Clubhouse We stumbled across Clubhouse by chance when our QA Engineer was researching something else entirely. Intrigued, he signed up for a trial. Straight away we were impressed. Clubhouse’s Stories view with its powerful filtering controls On the great Trello-to-JIRA spectrum, Clubhouse sits close to Trello in terms of simplicity and ease of use. But unlike Trello, it’s designed specifically for agile development teams. How to Use Story TypesClubhouse comes with three story types: features, bugs and chores. Using story types can tell you a lot about your…blog.clubhouse.io That means it has the concept of Epics. Cards can be linked so you can flag a duplicate bug or a card that relates to, or blocks, another. Cards can be either a Feature, Bug or Chore. There are powerful labelling and filtering features. A typical Clubhouse card! You can also use story points if you’re into that kind of thing (we’re not!). Cards that hang around too long in the Doing column show their age. Cards can be bulk edited with ease. Tasks can be assigned to individuals. As a developer, it’s easy to see all the cards assigned to you in a single view. The new Milestone feature is a handy additional way of organizing more complex projects that involve multiple epics. Epics and Milestones have their own views which clearly show you how far you are through them — one of the key things we were missing in Trello. We also find these views very handy when planning as a team. An epic in Clubhouse One thing that will seem unfamiliar to someone moving from Trello is that’s there’s only one ‘real’ board, which contains all the cards you’ve ever made. However, you can create and save filtered ‘views’ called Workspaces. For instance, a ‘Standup board’ for each team or an overview of all the cards in a particular project. Once you’re used to it though, it makes perfect sense. Another huge plus in Clubhouse’s favor is their pace of development. Milestones, Reporting and numerous other improvements have all launched in the past few months. Their support team is also excellent! Six months in we’re really happy with our decision to move to Clubhouse. No product will ever completely tame your backlog, but if it did then we product managers would be out of a job! If you’re on the lookout for a better tool — look at what Clubhouse has to offer. ", "child": "794_1\t794_2794_1\t794_2"}