{"name": "797", "parent": "", "title": "Welcoming JIRA Automation into the Code Barrel family of add-ons!", "sentences": [{"7f1e": "Welcoming JIRA Automation into the Code Barrel family of add-ons!"}, {"4067": "tl;dr — Code Barrel is taking ownership of the JIRA Automation add-on. See the FAQ at the bottom of this post about why you should care!"}, {"8bc2": "It’s no secret that we here at Code Barrel are quite passionate about Automation! We firmly believe in helping teams work smarter by automating as many mundane tasks in JIRA as possible. With this in mind we created Automation for JIRA just over 6 months ago!"}, {"365c": "This is a story that began much earlier though — about 4 years earlier in fact when I was still working for Atlassian in the Amsterdam office! Back then Atlassian support was getting busy and so a few of us set out to build an Automation tool in 20% time to help our support engineers help themselves by automating away many of the manual tasks in support."}, {"7001": "This became the Atlassian Labs JIRA Automation add-on which to this date has over 6000 active installations on the Atlassian Marketplace! For the past few years Matej Konecny from Atlassian has tirelessly maintained this add-on with his 20% time and as a side project. Huge thanks Matej! It was however never officially supported and hasn’t seen any substantial development in years. It’s UI and code base have become quite aged."}, {"0059": "Enter Automation for JIRA"}, {"0bb9": "When my co-founder Nick and I left Atlassian we felt this story was left unfinished — we could never get Automation high enough in the priority list at Atlassian. So when we founded Code Barrel, we wrote Automation for JIRA from scratch for Cloud first (and later added a server version)."}, {"96c5": "Our goals where simple:"}, {"5776": "The result:"}, {"2c88": "We feel that we’ve created something a little bit special here, that goes a long way towards meeting our goals. Don’t believe us though — believe one of our many customers and their reviews for Automation for JIRA!"}, {"0473": "Taking on JIRA Automation"}, {"e7e6": "We’ve now come full circle. A few weeks ago we started the conversation with Atlassian on taking on the Atlassian Labs ‘JIRA Automation’ add-on as we believe, that we can offer customers a better deal. They thought this was a great idea and agreed to license the marketplace listing to us. We based this agreement on:"}, {"866a": "To put it simply we agreed to not fuck existing customers of the JIRA Automation add-on. We worked at Atlassian for a long time and still hold all of Atlassian’s values close to our hearts."}, {"2be2": "So what’s the plan?"}, {"2cbb": "Over the coming weeks we’re going to release a brand spanking new version of the free server version of Automation Lite for JIRA as version 3.0.0."}, {"9f00": "This will upgrade current ‘JIRA Automation’ customers to the completely new code-base we developed with Automation for JIRA. The upgrade will be seamless, the lite version will still be free and all the same features will still be available. But there’s some goodies! You’ll get our brand new UI with improved usability and new actions (for example the much more powerful assign action shown above)."}, {"472b": "For a full feature comparison here’s the list:"}, {"8d68": "FAQ"}, {"cc93": "Q: What’s in it for me? Why is this a good deal?A: For starters you get a much improved user experience with a much more powerful rule builder than the old ‘JIRA Automation’ add-on offered for free. You will also get support and maintenance as well as some feature improvements from our paid offering will flow down to the free offering. We also provide a clear upgrade path to Cloud if you’re looking to switch."}, {"0a04": "Q: Do I need to switch to your paid add-on if I’m happy with the current version of JIRA Automation?A: No. The paid version does offer a number of awesome new features over the lite offering (like working with related issues for example — need to keep parent and sub-task issues in sync?!) but if you’re happy with the current features there’s no requirement to upgrade. The lite version will remain free, as stipulated by our agreement with Atlassian."}, {"c167": "Q: What’s in it for you? Why are you doing this?A: We feel passionate about helping teams automate as much of their process as possible. Having said that though, it’s no secret that we do hope that some customers will upgrade to our paid offering. There’s a huge amount of additional features available!We’re a tiny startup and have our bills to pay just like everyone else (those cloud servers don’t run themselves ;))."}, {"7637": "Q: Do I have to upgrade to version 3.0.0 and the new code base?A: You don’t, however we will not release any more compatibility updates to the old code base. At some stage this code will stop to work with the latest version of JIRA. Upgrading will be painless, come at no cost and provide you with all the same features. The existing JIRA Automation (Atlassian labs) source code will remain open source."}, {"43dc": "Q: When is this happening exactly?A: For now nothing’s changed other than the name of the Atlassian marketplace listing of JIRA Automation. We’re currently hard at work at making the upgrade task seamless and implementing a few more features. In about 3–4 weeks we’ll be looking at releasing the new version of Automation Lite for JIRA Server that will upgrade all customers to the new code-base"}, {"6acf": "Q: What about pluggable actions for JIRA Automation like the PDF Automation Plugin for JIRA?A: We have plans to continue to support integrations like these in our server offering. We’ve already started talking to a few of these vendors."}, {"2e9a": "Q: Are Atlassian support upgrading to your new version of Automation for JIRA on https://support.atlassian.com ? A: Yes — they are excited about upgrading and we hope you will be too!"}, {"0947": "We hope you’re as excited about this change as we are! If you have any questions or concerns, please get in touch via the comments below or https://codebarrel.io/support!"}], "content": "Welcoming JIRA Automation into the Code Barrel family of add-ons! tl;dr — Code Barrel is taking ownership of the JIRA Automation add-on. See the FAQ at the bottom of this post about why you should care! It’s no secret that we here at Code Barrel are quite passionate about Automation! We firmly believe in helping teams work smarter by automating as many mundane tasks in JIRA as possible. With this in mind we created Automation for JIRA just over 6 months ago! This is a story that began much earlier though — about 4 years earlier in fact when I was still working for Atlassian in the Amsterdam office! Back then Atlassian support was getting busy and so a few of us set out to build an Automation tool in 20% time to help our support engineers help themselves by automating away many of the manual tasks in support. This became the Atlassian Labs JIRA Automation add-on which to this date has over 6000 active installations on the Atlassian Marketplace! For the past few years Matej Konecny from Atlassian has tirelessly maintained this add-on with his 20% time and as a side project. Huge thanks Matej! It was however never officially supported and hasn’t seen any substantial development in years. It’s UI and code base have become quite aged. Enter Automation for JIRA When my co-founder Nick and I left Atlassian we felt this story was left unfinished — we could never get Automation high enough in the priority list at Atlassian. So when we founded Code Barrel, we wrote Automation for JIRA from scratch for Cloud first (and later added a server version). Our goals where simple: The result: We feel that we’ve created something a little bit special here, that goes a long way towards meeting our goals. Don’t believe us though — believe one of our many customers and their reviews for Automation for JIRA! Taking on JIRA Automation We’ve now come full circle. A few weeks ago we started the conversation with Atlassian on taking on the Atlassian Labs ‘JIRA Automation’ add-on as we believe, that we can offer customers a better deal. They thought this was a great idea and agreed to license the marketplace listing to us. We based this agreement on: To put it simply we agreed to not fuck existing customers of the JIRA Automation add-on. We worked at Atlassian for a long time and still hold all of Atlassian’s values close to our hearts. So what’s the plan? Over the coming weeks we’re going to release a brand spanking new version of the free server version of Automation Lite for JIRA as version 3.0.0. This will upgrade current ‘JIRA Automation’ customers to the completely new code-base we developed with Automation for JIRA. The upgrade will be seamless, the lite version will still be free and all the same features will still be available. But there’s some goodies! You’ll get our brand new UI with improved usability and new actions (for example the much more powerful assign action shown above). For a full feature comparison here’s the list: FAQ Q: What’s in it for me? Why is this a good deal?A: For starters you get a much improved user experience with a much more powerful rule builder than the old ‘JIRA Automation’ add-on offered for free. You will also get support and maintenance as well as some feature improvements from our paid offering will flow down to the free offering. We also provide a clear upgrade path to Cloud if you’re looking to switch. Q: Do I need to switch to your paid add-on if I’m happy with the current version of JIRA Automation?A: No. The paid version does offer a number of awesome new features over the lite offering (like working with related issues for example — need to keep parent and sub-task issues in sync?!) but if you’re happy with the current features there’s no requirement to upgrade. The lite version will remain free, as stipulated by our agreement with Atlassian. Q: What’s in it for you? Why are you doing this?A: We feel passionate about helping teams automate as much of their process as possible. Having said that though, it’s no secret that we do hope that some customers will upgrade to our paid offering. There’s a huge amount of additional features available!We’re a tiny startup and have our bills to pay just like everyone else (those cloud servers don’t run themselves ;)). Q: Do I have to upgrade to version 3.0.0 and the new code base?A: You don’t, however we will not release any more compatibility updates to the old code base. At some stage this code will stop to work with the latest version of JIRA. Upgrading will be painless, come at no cost and provide you with all the same features. The existing JIRA Automation (Atlassian labs) source code will remain open source. Q: When is this happening exactly?A: For now nothing’s changed other than the name of the Atlassian marketplace listing of JIRA Automation. We’re currently hard at work at making the upgrade task seamless and implementing a few more features. In about 3–4 weeks we’ll be looking at releasing the new version of Automation Lite for JIRA Server that will upgrade all customers to the new code-base Q: What about pluggable actions for JIRA Automation like the PDF Automation Plugin for JIRA?A: We have plans to continue to support integrations like these in our server offering. We’ve already started talking to a few of these vendors. Q: Are Atlassian support upgrading to your new version of Automation for JIRA on https://support.atlassian.com ? A: Yes — they are excited about upgrading and we hope you will be too! We hope you’re as excited about this change as we are! If you have any questions or concerns, please get in touch via the comments below or https://codebarrel.io/support! ", "child": "797_1"}