{"name": "799", "parent": "", "title": "40 Hours is Enough", "sentences": [{"5aa4": "40 Hours is Enough"}, {"35ff": "I recently read an article by Brian Knapp dismantling the idea that there’s a benefit to getting programmers to work more than 40 hours a week. The gist is that as the hours worked increase, so does burnout. Since there’s probably not enough work to fill more than 40 productive hours a week, what you get is a bunch of unhappy employees who try their best to look busy while quietly resenting the company they work for."}, {"fcf2": "If you’re an employer and you’re trying to get every last drop of productivity out of your developers, ask yourself (or even them!) if any of these things are stopping them from getting things done before you ask “how can I get them to work more hours?”"}, {"c745": "What’s currently getting in the way of their productivity?"}, {"4cbd": "How can I help them engage with and care about the product and its users?"}, {"ee08": "How can I show my employees that I care about them?"}, {"5656": "Unless they’re motivated purely by money (which almost nobody is), people work harder when they feel cared for. If you want someone to feel cared for, don’t ask “how can I get them to work 80 hours a week?”"}, {"ece2": "Let’s look at the numbers. There are 168 hours in a week. Let’s be optimistic and say that people get 8 hours of sleep a night. That leaves 112 waking hours. With an 80 hour work week, that leaves 32 hours. That’s about four and a half hours a day in which to travel, work, eat, and, y’know, live. Why would you want to do that to somebody you care about?"}, {"8d2c": "If you actually want your employees to feel cared for, identify and resolve current problems in their working lives. Or buy them beanbags or something. Just don’t chain them to their desks."}], "content": "40 Hours is Enough I recently read an article by Brian Knapp dismantling the idea that there’s a benefit to getting programmers to work more than 40 hours a week. The gist is that as the hours worked increase, so does burnout. Since there’s probably not enough work to fill more than 40 productive hours a week, what you get is a bunch of unhappy employees who try their best to look busy while quietly resenting the company they work for. If you’re an employer and you’re trying to get every last drop of productivity out of your developers, ask yourself (or even them!) if any of these things are stopping them from getting things done before you ask “how can I get them to work more hours?” What’s currently getting in the way of their productivity? How can I help them engage with and care about the product and its users? How can I show my employees that I care about them? Unless they’re motivated purely by money (which almost nobody is), people work harder when they feel cared for. If you want someone to feel cared for, don’t ask “how can I get them to work 80 hours a week?” Let’s look at the numbers. There are 168 hours in a week. Let’s be optimistic and say that people get 8 hours of sleep a night. That leaves 112 waking hours. With an 80 hour work week, that leaves 32 hours. That’s about four and a half hours a day in which to travel, work, eat, and, y’know, live. Why would you want to do that to somebody you care about? If you actually want your employees to feel cared for, identify and resolve current problems in their working lives. Or buy them beanbags or something. Just don’t chain them to their desks. ", "child": "799_1\t799_2\t799_3\t799_4\t799_5\t799_6\t799_7\t799_8\t799_9\t799_10\t799_11\t799_12\t799_13\t799_14\t799_15\t799_16"}