{"name": "816", "parent": "", "title": "All Problems Exist Only In Your Mind", "sentences": [{"1662": "All Problems Exist Only In Your Mind"}, {"471d": "I woke up this morning filled with anxiety."}, {"4299": "I spend most of my nights and mornings thinking about my present problems and my future obstacles."}, {"d6ed": "When I need to feel grounded, I read The Meditations by Marcus Aurelius."}, {"d88d": "It smacks reality and truth across my face each time I read it."}, {"954f": "Reading it creates a cathartic experience every time. While I’m reading it, my problems seem trivial, I’m brought back to earth, and I feel refreshed."}, {"ad91": "The book requires re reading, because the lessons in it take an entire lifetime to practice and master."}, {"8c4a": "I’m going to share some of the lessons from the book today to help bring you back to earth and put your problems into proper perspective."}, {"2340": "Again, these lessons are simple and profound, yet difficult to follow."}, {"6868": "Take time to think about these lessons and try to move forward according to them."}, {"42a8": "And buy the book. It’s one you can revisit on a daily basis if need be."}, {"ab62": "“How much time he saves who does not look to see what his neighbor says or does or thinks.”"}, {"2dce": "How much of our lives are robbed by focusing on other people?"}, {"f501": "We almost seem to enjoy and revel in it, even though it’s both a waste of time and causes nothing positive to happen in our lives."}, {"1063": "What does it accomplish? Have you ever — even once — gained anything of value whatsoever by prioritizing someone else’s actions over your own?"}, {"a737": "Can you change someone else’s thoughts, philosophy, and speech?"}, {"89f0": "Even if you can, is it worth the time you could’ve spent living your own life?"}, {"a3f7": "I see people sling mud at one another on the internet — with so much energy — why?"}, {"dead": "It never leads to anything good."}, {"d2cd": "Both sides are worse off and nothing gets resolved. We forget how fleeting life is and the fact we’ll all be dead sooner than we think."}, {"6cc7": "How much more grievous are the consequences of anger than the causes of it."}, {"0577": "This reminds me of the quote “being bitter is like drinking poison and waiting for the other person to die.”"}, {"2bd2": "It seems like we all have a masochistic relationship with anger."}, {"1a65": "Again, why?"}, {"3063": "This person has done something harmful to me. Ok. But it’s done. How does my being angry change what happened? It doesn’t. Why can’t I just let it go?"}, {"b16a": "“Because they should pay for what they’ve done.”"}, {"e13f": "Imagine a situation where they do pay for what they’ve done. Do you think it will give you peace? Is it worth is if it comes at the expense of your own character?"}, {"2199": "“Because they should feel bad for what they’ve done.”"}, {"ee5d": "Why? Because you said so?"}, {"f425": "As difficult as it is, we need to realize people live according to their own scripts. We can either accept them as they are or try to change them."}, {"60d1": "If you can change them with reason then by all means try, but if they’re unreasonable, why waste your precious time and energy attempting to fix what’s permanently broken?"}, {"4423": "“When another blames you or hates you, or people voice similar criticisms, go to their souls, penetrate inside and see what sort of people they are. You will realize that there is no need to be racked with anxiety that they should hold any particular opinion about you.”"}, {"ad8f": "Think of what type of person you have to be in order to unfairly criticize and troll someone."}, {"4b8d": "Think of what that person’s life is like."}, {"549d": "People leave negative comments on my writing all the time. I let it get to me. Why?"}, {"2b66": "If someone takes minutes out of a life that was graciously given to them and uses it to spread negativity, it speaks volumes about them."}, {"a3f8": "There’s no need to give them a second thought. I don’t respect those types of people, nor would I want to trade places with someone who has that type of soul."}, {"4f08": "Pity the people who need to take you down to bring themselves up."}, {"ccd2": "Something’s wrong in their life. Show them compassion. Their circumstances led to their negativity. They don’t like their life. That’s punishment enough."}, {"5ff4": "“If you are pained by external things, it is not they that disturb you, but your own judgement of them. And it is in your power to wipe out that judgement now.”"}, {"eb98": "This makes sense logically, but it’s so hard to practice each day of our lives."}, {"85a8": "My reality only exists in my mind."}, {"fec9": "Your reality only exists in yours. You could make the decision to simply stop letting circumstances bother you — you could."}, {"a137": "I make 72 times more money than the average citizen of my home country Nigeria."}, {"1716": "I’m sitting here typing on a keyboard of a $2,000 dollar machine capable of spreading my message around the entire world in less than one second."}, {"3d9e": "What the fuck do I really have to complain about all the time?"}, {"3de3": "What do you have to complain about in the grand scheme of life?"}, {"6c47": "Please know, I don’t intend this message to be judgmental in any way. I face all of these problems on a daily basis."}, {"3526": "The quotes mentioned in the piece are true. They’re absolutely true. We have a choice to determine what our reality means you us."}, {"a861": "When faced with problems, obstacles, and tragedy, remember you always have a choice."}, {"676e": "There is a correct way to live. Not based on money, status, power, lust, greed, envy, or any of the other poisons to our minds."}, {"d209": "Just to live out each day, do what we’re designed to do, and enjoy life."}, {"434b": "Because we’ll all soon be dust."}, {"4e8c": "Get 2 Free Chapters of My Book + a FREE 5 Day Course on Ideas From the Book Here. The free 5 day course includes ideas on finding passions, discovering a vocation, and transforming the way you view yourself and the world."}, {"9dda": "If you enjoyed this post, please click the little heart button, because it will help others find it who might benefit from reading it."}], "content": "All Problems Exist Only In Your Mind I woke up this morning filled with anxiety. I spend most of my nights and mornings thinking about my present problems and my future obstacles. When I need to feel grounded, I read The Meditations by Marcus Aurelius. It smacks reality and truth across my face each time I read it. Reading it creates a cathartic experience every time. While I’m reading it, my problems seem trivial, I’m brought back to earth, and I feel refreshed. The book requires re reading, because the lessons in it take an entire lifetime to practice and master. I’m going to share some of the lessons from the book today to help bring you back to earth and put your problems into proper perspective. Again, these lessons are simple and profound, yet difficult to follow. Take time to think about these lessons and try to move forward according to them. And buy the book. It’s one you can revisit on a daily basis if need be. “How much time he saves who does not look to see what his neighbor says or does or thinks.” How much of our lives are robbed by focusing on other people? We almost seem to enjoy and revel in it, even though it’s both a waste of time and causes nothing positive to happen in our lives. What does it accomplish? Have you ever — even once — gained anything of value whatsoever by prioritizing someone else’s actions over your own? Can you change someone else’s thoughts, philosophy, and speech? Even if you can, is it worth the time you could’ve spent living your own life? I see people sling mud at one another on the internet — with so much energy — why? It never leads to anything good. Both sides are worse off and nothing gets resolved. We forget how fleeting life is and the fact we’ll all be dead sooner than we think. How much more grievous are the consequences of anger than the causes of it. This reminds me of the quote “being bitter is like drinking poison and waiting for the other person to die.” It seems like we all have a masochistic relationship with anger. Again, why? This person has done something harmful to me. Ok. But it’s done. How does my being angry change what happened? It doesn’t. Why can’t I just let it go? “Because they should pay for what they’ve done.” Imagine a situation where they do pay for what they’ve done. Do you think it will give you peace? Is it worth is if it comes at the expense of your own character? “Because they should feel bad for what they’ve done.” Why? Because you said so? As difficult as it is, we need to realize people live according to their own scripts. We can either accept them as they are or try to change them. If you can change them with reason then by all means try, but if they’re unreasonable, why waste your precious time and energy attempting to fix what’s permanently broken? “When another blames you or hates you, or people voice similar criticisms, go to their souls, penetrate inside and see what sort of people they are. You will realize that there is no need to be racked with anxiety that they should hold any particular opinion about you.” Think of what type of person you have to be in order to unfairly criticize and troll someone. Think of what that person’s life is like. People leave negative comments on my writing all the time. I let it get to me. Why? If someone takes minutes out of a life that was graciously given to them and uses it to spread negativity, it speaks volumes about them. There’s no need to give them a second thought. I don’t respect those types of people, nor would I want to trade places with someone who has that type of soul. Pity the people who need to take you down to bring themselves up. Something’s wrong in their life. Show them compassion. Their circumstances led to their negativity. They don’t like their life. That’s punishment enough. “If you are pained by external things, it is not they that disturb you, but your own judgement of them. And it is in your power to wipe out that judgement now.” This makes sense logically, but it’s so hard to practice each day of our lives. My reality only exists in my mind. Your reality only exists in yours. You could make the decision to simply stop letting circumstances bother you — you could. I make 72 times more money than the average citizen of my home country Nigeria. I’m sitting here typing on a keyboard of a $2,000 dollar machine capable of spreading my message around the entire world in less than one second. What the fuck do I really have to complain about all the time? What do you have to complain about in the grand scheme of life? Please know, I don’t intend this message to be judgmental in any way. I face all of these problems on a daily basis. The quotes mentioned in the piece are true. They’re absolutely true. We have a choice to determine what our reality means you us. When faced with problems, obstacles, and tragedy, remember you always have a choice. There is a correct way to live. Not based on money, status, power, lust, greed, envy, or any of the other poisons to our minds. Just to live out each day, do what we’re designed to do, and enjoy life. Because we’ll all soon be dust. Get 2 Free Chapters of My Book + a FREE 5 Day Course on Ideas From the Book Here. The free 5 day course includes ideas on finding passions, discovering a vocation, and transforming the way you view yourself and the world. If you enjoyed this post, please click the little heart button, because it will help others find it who might benefit from reading it. ", "child": "816_1\t816_2\t816_3\t816_4\t816_5\t816_6\t816_7\t816_8\t816_9816_1\t816_2\t816_3\t816_4\t816_5\t816_6\t816_7\t816_8\t816_9816_1\t816_2\t816_3\t816_4\t816_5\t816_6\t816_7\t816_8\t816_9"}