{"name": "821", "parent": "", "title": "24 Ways to Look Like an Awesome UX Designer", "sentences": [{"f6fa": "24 Ways to Look Like an Awesome UX Designer"}, {"8a27": "Tips on pretending to be a top designer"}, {"9f13": "1. If a colleague asks you to look at a website, open it up and straight away inspect the element"}, {"2b76": "Whoaa…"}, {"3e31": "Boom! This makes you look like a ‘what’s under the hood’ kind of designer. You’re someone who wants to see the guts of a website. To go a step further resize to ipad and change something of the existing site , double boom!! Your colleague will leave your desk thinking you’re a bloody design wizard."}, {"25da": "2. Carry your Macbook open and do a few laps of the office, intently looking for someone"}, {"ca69": "Busy walking & working “can’t talk right now”"}, {"589c": "Do this at least once a day. Put a pen in your mouth and bring up your calendar and tap away on the move. This’ll make you visible and look like you’re too bloody busy to do work at your desk. A great tip is to be late for a meeting doing this, lots of visibility of your hectic work schedule!"}, {"d373": "3. Mention how your General Assembly teacher was from San Fran, and that she worked on IBM’s super computer in the 70’s"}, {"111e": "“Oh yeah”"}, {"4de2": "This is big. As one of her students this connects you to tech royalty. You can carry extra ammunition stating she was Steve’s Jobs era in San Fran. This makes your knowledge of the field seem authentic. If her name pops up in conversation you can add that the designers she taught have all been really successful!"}, {"3452": "4. ‘The new interface is no interface’"}, {"36bf": "Whoah, brain explosion"}, {"181b": "Throw this up at anytime in a design meeting, it’s so big and weird to understand that it works. The ‘less is more attitude’ of simple design backs up this lofty statement. Try it out, you’ll be surprised how good you look!"}, {"ee7d": "5. Talk jargon"}, {"26a3": "Blah, blah, blah blah, blahdy blah"}, {"a775": "This has to be daily habit. Lots of jargon, hybrid, native, hypothesis, design thinking, hex values, empathy mapping, heart framework, API call, double diamond, IA, quick win, eat your own dog food, synergy , gamify, unicorn, big data, mobile first, holistic approach, disruptive, holistic, heuristic etc."}, {"e70c": "The fact that you know so many of these words and you have the confidence to use them, says lots about your skills as a designer!"}, {"660e": "6. In meetings don’t take notes, take Sketch notes"}, {"2f04": "“I’m drawing your thinking”"}, {"52d2": "Sketch your notes make you look like you follow your own rules. Doodle if you can’t draw. Just do it all the way through a meeting and see the results. This kind of artistry is magical for a designer. Take a photo of the result, put it on twitter and add #designthinking."}, {"e311": "7. When someone is talking about a website, ask if the API is open source"}, {"09bb": "“Say what!”"}, {"5a27": "This’ll flip them right out and they’ll think you are bloody rock star! Not one to do too often as you’ll get caught out. If they ask why, say how some of the great businesses such as Twitter are open source and it says a lot about them. Open source is the way forward for technology!"}, {"bc4a": "8. Complain about the Wifi speed even if it’s fine"}, {"3f24": "This makes you look like you’ve got very high wifi standards. You’re someone who need to gets stuff done and this a bottleneck you don’t need. Bring this up in every retro, and roll your eyes at how crazy it is that in 2017 you can’t get good wifi in a tech company!"}, {"7e7e": "9. Complain how many recruiters are hassling you for Senior UX roles at $900 a day!"}, {"3080": "Arghhh, you’re so bloody desirable right now! Laugh at how many recruiters are on Linkedin these days. Let people know that you keep getting job offers in top businesses, but you’re not quite ready to move. Making yourself look desirable makes people think you must be!"}, {"1de8": "10. State that Agile is not all it’s cracked up to be"}, {"f8c7": "This is crackpot stuff in tech but worth a shout out. Argue that ‘Agile’s flawed as we do the MVP but never get back to BAU and iterate’. This’ll make you sound like someone who questions the status quo. You’re an enquiring mind who won’t settle for the bullshit of mainstream industry rules."}, {"bcb0": "11. In conversation add ‘yeah I’ve got to catch up with my mentee to go through their final project’"}, {"b4ea": "“You’re the man”"}, {"b89f": "There is no denying this is powerful stuff. Passing on your knowledge (albeit 6 months) of UX to the next generation is magic. People will see you as a real ‘value add compassionate kind of designer’. Doing it for free and giving back to the UX Community!"}, {"32a7": "12. Write Medium articles on UX, and put them on LinkedIn and in your Slack rooms"}, {"957a": "This is credibility personified! Read other articles on UX and find a pattern of good ones. Copy them and add you’re own twist, with a filthy click bait title. This makes you look like a fearless designer putting your stuff out there. People will think, Jesus this person knows so bloody much about the world of UX. You’re even kind enough to share the love!"}, {"c9d4": "13. Look interesting & authentic by buying a fancy hipster coffee maker"}, {"5593": "Slowly does it"}, {"25f9": "Rock this in the morning. As you grind the coffee beans with your hand grinder in the kitchen, people’ll be intrigued. Who is this person who goes through the full process of making his cup of Java? This type of nonsense hits lots of senses. The noise of the grinding, the smell of the coffee and the visual sight of the mad scientist designer. Ha, you look like someone who is not content to buy a coffee, but it is more interested in the genuine process of bean to cup. It also takes about 15 minutes out of your day, which is 1.5 weeks out of the year. A few big wins here!"}, {"7b85": "14. ‘Let’s park this and take it offline, we’ll do a knowledge transfer on Slack’"}, {"325a": "What’s even happening?"}, {"6610": "This is great in a meeting, when you don’t want to talk about something to a colleague, as you don’t know the answer. It sounds like pretty important info but best to talk in private. Others around you will be intrigued and it’ll make you look like a person who is getting things done behind the scenes."}, {"30c8": "15. When going for a team lunch say that ‘the service design of this place is terrible’"}, {"f9aa": "This gives you real breadth as a design thinker. It makes you look like you’re thinking outside the world of digital. Your colleagues thought you were a digital UX Designer! Turns out they were wrong and you’re someone who lives and breaths design. It’s not only a job for you, it’s more a way of life. You’re a problem solver, simple as that!"}, {"890c": "16. State that ‘the only way to effect real change in business is to have a a top down design approach. Look at Pinterest and Air BnB…’"}, {"86cd": "“I couldn’t agree more”"}, {"8ca2": "You’re a foot soldier. You mainly do what your told but this kind of opinion on the top dogs is powerful. It makes you look like you’ll do your best to win the war, but it won’t be your fault if you don’t. For added weight you can say how one of YouTube’s founders Chad Hurley was a designer as was Charles Adler of Kickstarter."}, {"5103": "17. Screw the mouse and use a Wacom Tablet"}, {"a2ff": "“Bloody hell this pen tablet is fiddly!”"}, {"1f95": "This is gold and non negotiable. Buy one and get used to it. This’ll take 4–5 days max. As you sit or stand at your desk you’ll look like you’ve been in the game for a while, and mean business. Whether it’s better or not is immaterial, this looks very Designery!"}, {"aee4": "18. Twitter and Facebook do it"}, {"196c": "Who can argue with the likes of these big hitters! When creating designs, follow patterns of the some of the big guns. Telling stakeholders that Twitter or Facebook follow this pattern is gold, and they’ll love it. They’ll love the re-assurance of big tech giants and will feel confident in your work. Do it, this one always works!"}, {"58f2": "19. At 7am post a design article on Slack, while having breakfast at home"}, {"d609": "This will make you look like you never bloody stop thinking about design. Who is this guy reading cool articles on design thinking at this time of the day! Make sure this goes in a room that has visibility across the team for maximum effect."}, {"f70c": "20. Shout out WYSIWYG while in a meeting"}, {"9441": "“WYSIWYG peeps”"}, {"1512": "Calling out the longest most ridiculous acronym in a meeting, will make you sound like a big bit of tech joker. You know your tech but you’re not afraid to have a light hearted play around."}, {"6f9e": "21. Talk about Frameworks you love"}, {"53f4": "You’ll sound like a big picture designer talking about bringing in a framework. ‘A new way of working’ of how you think the team should move forward. Throw it in that you wouldn’t build a home home without a structure, and the same goes for UX! Nice."}, {"cd58": "22. In Slack ask if anyone has a competitive statement teardown"}, {"8408": "This is a highly complicated way of asking for a competitor analysis. It makes looks you’ve been in this game for years. When someone squints and asks what it means, say it’s what Google calls researching competitors. Mention it’s in their Google Sprint book, which they can borrow if they want."}, {"ea64": "23. Mention that Dave (Kelley) of IDEO has a great book on Creative Confidence"}, {"6d29": "Note the word ‘Dave’, sounds like you and the Kelley brothers are old pals! IDEO hold lots of weight in the design world, so you’d be amiss not to drop their names about the place. Offer the book to people as you read it a while back and creative confidence is not a real problem these days!! Apologise for your cockiness, but laugh that it’s true."}, {"a7ac": "24. Tap your Macbook keys hard when in a meeting"}, {"960f": "While in a meeting and everyone has their Macbooks open. When you’re typing and have completed a sentence, whack your return key like you’re a bloody Pianist. It’s make a good noise and sounds like you’ve just finished an important sentence, to an important person. If someone comments laugh that you’ve broken a few keys in the past."}, {"2551": "If you enjoyed this, but want a more serious read have a look at my articles on Getting into UX Design at 40 With No Digital or Design Experience or 53 Tech Terms You Need to Know as a UX Designer"}, {"a669": "Thanks to Nick, Julio, Sam and Nathan for their feedback."}, {"794f": "Worth reading?"}, {"94a4": "Please click the 💚️ below to help others find it and leave a comment. Thanks for reading! 👍"}], "content": "24 Ways to Look Like an Awesome UX Designer Tips on pretending to be a top designer 1. If a colleague asks you to look at a website, open it up and straight away inspect the element Whoaa… Boom! This makes you look like a ‘what’s under the hood’ kind of designer. You’re someone who wants to see the guts of a website. To go a step further resize to ipad and change something of the existing site , double boom!! Your colleague will leave your desk thinking you’re a bloody design wizard. 2. Carry your Macbook open and do a few laps of the office, intently looking for someone Busy walking & working “can’t talk right now” Do this at least once a day. Put a pen in your mouth and bring up your calendar and tap away on the move. This’ll make you visible and look like you’re too bloody busy to do work at your desk. A great tip is to be late for a meeting doing this, lots of visibility of your hectic work schedule! 3. Mention how your General Assembly teacher was from San Fran, and that she worked on IBM’s super computer in the 70’s “Oh yeah” This is big. As one of her students this connects you to tech royalty. You can carry extra ammunition stating she was Steve’s Jobs era in San Fran. This makes your knowledge of the field seem authentic. If her name pops up in conversation you can add that the designers she taught have all been really successful! 4. ‘The new interface is no interface’ Whoah, brain explosion Throw this up at anytime in a design meeting, it’s so big and weird to understand that it works. The ‘less is more attitude’ of simple design backs up this lofty statement. Try it out, you’ll be surprised how good you look! 5. Talk jargon Blah, blah, blah blah, blahdy blah This has to be daily habit. Lots of jargon, hybrid, native, hypothesis, design thinking, hex values, empathy mapping, heart framework, API call, double diamond, IA, quick win, eat your own dog food, synergy , gamify, unicorn, big data, mobile first, holistic approach, disruptive, holistic, heuristic etc. The fact that you know so many of these words and you have the confidence to use them, says lots about your skills as a designer! 6. In meetings don’t take notes, take Sketch notes “I’m drawing your thinking” Sketch your notes make you look like you follow your own rules. Doodle if you can’t draw. Just do it all the way through a meeting and see the results. This kind of artistry is magical for a designer. Take a photo of the result, put it on twitter and add #designthinking. 7. When someone is talking about a website, ask if the API is open source “Say what!” This’ll flip them right out and they’ll think you are bloody rock star! Not one to do too often as you’ll get caught out. If they ask why, say how some of the great businesses such as Twitter are open source and it says a lot about them. Open source is the way forward for technology! 8. Complain about the Wifi speed even if it’s fine This makes you look like you’ve got very high wifi standards. You’re someone who need to gets stuff done and this a bottleneck you don’t need. Bring this up in every retro, and roll your eyes at how crazy it is that in 2017 you can’t get good wifi in a tech company! 9. Complain how many recruiters are hassling you for Senior UX roles at $900 a day! Arghhh, you’re so bloody desirable right now! Laugh at how many recruiters are on Linkedin these days. Let people know that you keep getting job offers in top businesses, but you’re not quite ready to move. Making yourself look desirable makes people think you must be! 10. State that Agile is not all it’s cracked up to be This is crackpot stuff in tech but worth a shout out. Argue that ‘Agile’s flawed as we do the MVP but never get back to BAU and iterate’. This’ll make you sound like someone who questions the status quo. You’re an enquiring mind who won’t settle for the bullshit of mainstream industry rules. 11. In conversation add ‘yeah I’ve got to catch up with my mentee to go through their final project’ “You’re the man” There is no denying this is powerful stuff. Passing on your knowledge (albeit 6 months) of UX to the next generation is magic. People will see you as a real ‘value add compassionate kind of designer’. Doing it for free and giving back to the UX Community! 12. Write Medium articles on UX, and put them on LinkedIn and in your Slack rooms This is credibility personified! Read other articles on UX and find a pattern of good ones. Copy them and add you’re own twist, with a filthy click bait title. This makes you look like a fearless designer putting your stuff out there. People will think, Jesus this person knows so bloody much about the world of UX. You’re even kind enough to share the love! 13. Look interesting & authentic by buying a fancy hipster coffee maker Slowly does it Rock this in the morning. As you grind the coffee beans with your hand grinder in the kitchen, people’ll be intrigued. Who is this person who goes through the full process of making his cup of Java? This type of nonsense hits lots of senses. The noise of the grinding, the smell of the coffee and the visual sight of the mad scientist designer. Ha, you look like someone who is not content to buy a coffee, but it is more interested in the genuine process of bean to cup. It also takes about 15 minutes out of your day, which is 1.5 weeks out of the year. A few big wins here! 14. ‘Let’s park this and take it offline, we’ll do a knowledge transfer on Slack’ What’s even happening? This is great in a meeting, when you don’t want to talk about something to a colleague, as you don’t know the answer. It sounds like pretty important info but best to talk in private. Others around you will be intrigued and it’ll make you look like a person who is getting things done behind the scenes. 15. When going for a team lunch say that ‘the service design of this place is terrible’ This gives you real breadth as a design thinker. It makes you look like you’re thinking outside the world of digital. Your colleagues thought you were a digital UX Designer! Turns out they were wrong and you’re someone who lives and breaths design. It’s not only a job for you, it’s more a way of life. You’re a problem solver, simple as that! 16. State that ‘the only way to effect real change in business is to have a a top down design approach. Look at Pinterest and Air BnB…’ “I couldn’t agree more” You’re a foot soldier. You mainly do what your told but this kind of opinion on the top dogs is powerful. It makes you look like you’ll do your best to win the war, but it won’t be your fault if you don’t. For added weight you can say how one of YouTube’s founders Chad Hurley was a designer as was Charles Adler of Kickstarter. 17. Screw the mouse and use a Wacom Tablet “Bloody hell this pen tablet is fiddly!” This is gold and non negotiable. Buy one and get used to it. This’ll take 4–5 days max. As you sit or stand at your desk you’ll look like you’ve been in the game for a while, and mean business. Whether it’s better or not is immaterial, this looks very Designery! 18. Twitter and Facebook do it Who can argue with the likes of these big hitters! When creating designs, follow patterns of the some of the big guns. Telling stakeholders that Twitter or Facebook follow this pattern is gold, and they’ll love it. They’ll love the re-assurance of big tech giants and will feel confident in your work. Do it, this one always works! 19. At 7am post a design article on Slack, while having breakfast at home This will make you look like you never bloody stop thinking about design. Who is this guy reading cool articles on design thinking at this time of the day! Make sure this goes in a room that has visibility across the team for maximum effect. 20. Shout out WYSIWYG while in a meeting “WYSIWYG peeps” Calling out the longest most ridiculous acronym in a meeting, will make you sound like a big bit of tech joker. You know your tech but you’re not afraid to have a light hearted play around. 21. Talk about Frameworks you love You’ll sound like a big picture designer talking about bringing in a framework. ‘A new way of working’ of how you think the team should move forward. Throw it in that you wouldn’t build a home home without a structure, and the same goes for UX! Nice. 22. In Slack ask if anyone has a competitive statement teardown This is a highly complicated way of asking for a competitor analysis. It makes looks you’ve been in this game for years. When someone squints and asks what it means, say it’s what Google calls researching competitors. Mention it’s in their Google Sprint book, which they can borrow if they want. 23. Mention that Dave (Kelley) of IDEO has a great book on Creative Confidence Note the word ‘Dave’, sounds like you and the Kelley brothers are old pals! IDEO hold lots of weight in the design world, so you’d be amiss not to drop their names about the place. Offer the book to people as you read it a while back and creative confidence is not a real problem these days!! Apologise for your cockiness, but laugh that it’s true. 24. Tap your Macbook keys hard when in a meeting While in a meeting and everyone has their Macbooks open. When you’re typing and have completed a sentence, whack your return key like you’re a bloody Pianist. It’s make a good noise and sounds like you’ve just finished an important sentence, to an important person. If someone comments laugh that you’ve broken a few keys in the past. If you enjoyed this, but want a more serious read have a look at my articles on Getting into UX Design at 40 With No Digital or Design Experience or 53 Tech Terms You Need to Know as a UX Designer Thanks to Nick, Julio, Sam and Nathan for their feedback. Worth reading? Please click the 💚️ below to help others find it and leave a comment. Thanks for reading! 👍 ", "child": "821_1\t821_2\t821_3\t821_4\t821_5\t821_6\t821_7\t821_8\t821_9\t821_10\t821_11\t821_12\t821_13\t821_14\t821_15\t821_16\t821_17\t821_18\t821_19\t821_20\t821_21\t821_22\t821_23\t821_24821_1\t821_2\t821_3\t821_4\t821_5\t821_6\t821_7\t821_8\t821_9\t821_10\t821_11\t821_12\t821_13\t821_14\t821_15\t821_16\t821_17\t821_18\t821_19\t821_20\t821_21\t821_22\t821_23\t821_24821_1\t821_2\t821_3\t821_4\t821_5\t821_6\t821_7\t821_8\t821_9\t821_10\t821_11\t821_12\t821_13\t821_14\t821_15\t821_16\t821_17\t821_18\t821_19\t821_20\t821_21\t821_22\t821_23\t821_24"}