{"name": "824", "parent": "", "title": "How to Become a UX Designer", "sentences": [{"45ee": "How to Become a UX Designer"}, {"4533": "If you have lots of motivation and a lack of experience"}, {"7895": "Practice"}, {"f38a": "Short how-to:"}, {"9205": "Detailed steps:"}, {"72f0": "Feel Good?And know what? Congratulations! You’re one of a few designers who actually test their prototypes. The duality of the profession is:"}, {"f472": "You’re on a steep learning curve now. See how it feels? What you feel now is the peace of mind that most UX designers never achieve."}, {"5e91": "Theory"}, {"b99c": "It’s not random that theory goes AFTER practice in this article. I recommended Alan Cooper’s book in the very beginning to “get taste of the field”, before you jump into action. But that’s not enough."}, {"466d": "Now that your first usability study is over you are ready to digest some theory. Otherwise, without practice theory just won’t stick in your head and will be as memorable as titles after a movie."}, {"0de1": "Experience without theory is blind, but theory without experience is mere intellectual play. -Immanuel Kant"}, {"b79b": "If you go right to googling “best books on UX” there will be a plenty of lists with books. It won’t hurt if you read them all. But if you’re looking for one that will drastically up your game…"}, {"4301": "I don’t know just one. I’m sorry. I know a few others, for starters:"}, {"a2d9": "Why these? Because I think in order to understand the “whys” behind other people’s choices, you first need to understand yours. That will make you a passive observer, a truth-seeker, rather than one more subjective opinion of someone, who tested a product with users."}, {"706c": "Conclusion"}, {"4842": "I’m sorry for repeating this phrase, but I think it’s paramount for becoming a successful UX designer:"}, {"f07f": "Experience without theory is blind, but theory without experience is mere intellectual play.-Immanuel Kant"}, {"bfa3": "For some it will be easy to read the books and hard to actually approach users and talk to them. For others it would be extremely difficult to exclude “I” or “my opinion” and become a “spectator”."}, {"99e4": "Some don’t like to read and ignore theory, fully relying on his/her intuition."}, {"2b1d": "All I can say is to use your strong sides, but develop the rest as well. For the convoy’s speed is the speed of its slowest part."}, {"17fb": "About the AuthorIvan is an UI/UX designer who made it his credo to test all prototypes before releasing them. Even when they are made not by him. Even when they are not made by Icons8 team."}, {"22d9": "This article was originally published at icons8.com"}, {"e415": "Follow Icons8: Twitter | Facebook | Dribbble"}], "content": "How to Become a UX Designer If you have lots of motivation and a lack of experience Practice Short how-to: Detailed steps: Feel Good?And know what? Congratulations! You’re one of a few designers who actually test their prototypes. The duality of the profession is: You’re on a steep learning curve now. See how it feels? What you feel now is the peace of mind that most UX designers never achieve. Theory It’s not random that theory goes AFTER practice in this article. I recommended Alan Cooper’s book in the very beginning to “get taste of the field”, before you jump into action. But that’s not enough. Now that your first usability study is over you are ready to digest some theory. Otherwise, without practice theory just won’t stick in your head and will be as memorable as titles after a movie. Experience without theory is blind, but theory without experience is mere intellectual play. -Immanuel Kant If you go right to googling “best books on UX” there will be a plenty of lists with books. It won’t hurt if you read them all. But if you’re looking for one that will drastically up your game… I don’t know just one. I’m sorry. I know a few others, for starters: Why these? Because I think in order to understand the “whys” behind other people’s choices, you first need to understand yours. That will make you a passive observer, a truth-seeker, rather than one more subjective opinion of someone, who tested a product with users. Conclusion I’m sorry for repeating this phrase, but I think it’s paramount for becoming a successful UX designer: Experience without theory is blind, but theory without experience is mere intellectual play.-Immanuel Kant For some it will be easy to read the books and hard to actually approach users and talk to them. For others it would be extremely difficult to exclude “I” or “my opinion” and become a “spectator”. Some don’t like to read and ignore theory, fully relying on his/her intuition. All I can say is to use your strong sides, but develop the rest as well. For the convoy’s speed is the speed of its slowest part. About the AuthorIvan is an UI/UX designer who made it his credo to test all prototypes before releasing them. Even when they are made not by him. Even when they are not made by Icons8 team. This article was originally published at icons8.com Follow Icons8: Twitter | Facebook | Dribbble ", "child": "824_1\t824_2824_1\t824_2"}