{"name": "850", "parent": "", "title": "F*ck impostor syndrome — I’m finally learning to code.", "sentences": [{"9f5c": "F*ck impostor syndrome — I’m finally learning to code."}, {"211b": "I’m really doing it: Starting next week, I will be a student at the Grace Hopper Program, an all-women’s branch of Fullstack Academy, one of the top coding bootcamps in NYC. If all goes well, by the end of 2017 I will be a full-time software developer."}, {"1962": "My friends are shocked, but to be honest, this has been a long time coming."}, {"a759": "My affinity for coding began when I was 11 years old, spending hours each day after school on the computer coding layouts for Xanga, Myspace, and Neopets user profiles and offering them free online to people around the world. I taught myself graphic design using early-Photoshop-alternatives Paint Shop Pro and Animation Shop 3, and my graphic tinkering quickly became an important creative outlet. What I loved most, however, was working with HTML and CSS, editing templates, figuring out the logic, and bringing my own ideas to life on the internet."}, {"b9ab": "As I entered high school, I quickly found myself busy with a large workload from my honors and AP classes, and I promptly forgot about my early forays into computer science and design … but when I sat down to choose classes for my senior year, I discovered an unadvertised Computer Science class and took it as an elective. It wasn’t an honors-level course, and most of my classmates were uninterested kids who were only taking it to to cover their math credit and avoid dropping out, but no matter — I quickly fell in love with the subject. We learned C++, creating basic functions and programs, and I frequently annoyed my teacher, as I asked dozens of questions each class, always trying to go beyond the instructions, create something bigger and better. There was no doubt that I loved programming — how logical it was, how black-and-white, and how it required one to be so detail-oriented, a state of mind I already inhabited."}, {"439c": "But despite what, in hindsight, was clearly a strong aptitude for computer science, I inexplicably didn’t feel “good enough” to pursue it. As I headed off to college, despite excelling in my CS class, I didn’t feel like I had “enough skills and knowledge” to apply for university-level engineering or computer science programs. What, exactly, constituted “enough skills and knowledge”? I had no idea, but I felt certain it must be more than what I possessed."}, {"5972": "After high school, I gained admission to Penn, at which I majored in economics. Economics was a safe major — a major that would lead to jobs, and a major that I felt didn’t have any major prerequisites, like I felt tech had. When I applied for housing my first year, despite my non-technical major, I was randomly (and ironically) placed in a residential program called the “Science & Technology Wing”, full of the nerdiest and most enthusiastic engineering students on campus."}, {"8491": "Living on “STWing”, as they affectionately called it, I felt acutely like Penny on the set of The Big Bang Theory — so alienated from my nerdy neighbors, but also secretly jealous of them. Most of them had been taking apart computers since they were twelve, and it was like they spoke another language. While I never admitted it, I wished more than anything that I could join their club. I wished I had the knowledge, the background, the je-ne-sais-quois that makes someone eligible to be a techie. But my mindset about it was inexplicably fixed, as if I could never learn. It was already too late. At the ripe old age of 18, the boat had already left, and I had missed it, forever doomed to the world of non-tech."}, {"85af": "My final year at Penn, I had extra space in my schedule, so I took my school’s famous CIS-110 introductory Computer Science course as an elective. It was quite a difficult intro course in Java, but I loved spending countless hours completing the assignments. During lectures, however, my self-doubt would creep back in. I looked around at all the people in my class, most of whom were male, and many of whom I assumed were like my STWing peers, coding since they were wee tots. I occasionally thought back to my HTML/CSS background — I guess I had been coding for a long time, too … but this seemed different. These were kids who had built robots, who understood how to make apps …they were “real coders”. My mind had created an impenetrable block that forever deemed myself “not a real coder”, and so no matter how many men I outperformed on the test curve or project scores, I always felt inferior."}, {"460e": "This isn’t meant to be a sob story about my own inferiority complex. The truth is, my experience reflects a widespread trend in the way women and minorities feel in the world of tech. The way I felt in that class mirrors the way many women (and men of color) feel even when they do make it through that initial self-doubt and enter the tech industry. And this impostor syndrome that plagues women in tech has a source — it is culturally instilled in us from a young age, seen in the gender-typing of childhood toys (robots for boys, art sets for girls) and in constant suggestions from media that women should be focusing their efforts on more superficial pursuits, like looking good (since that’s all we’re worth anyway, right?) These ideas, while obviously false, inevitably seep into our sense of self."}, {"8f87": "The cultural treatment of women also seeps into the way that men in tech think about us. For proof, one need only look at the never-ending stream of stories from women about the rampant misogyny they encounter in Silicon Valley (I’m looking at you, #Uber), and the sad statistics on female representation in tech."}, {"dbe7": "This is a problem with wide-reaching implications if something doesn’t give. Women comprise the majority of the world’s population, and yet are dangerously underrepresented in an industry that is soon going to completely reframe the power structure in the labor economy. While this underrepresentation is likely a combination of both pipeline shortages and company bias in hiring decisions, I firmly believe both of these effects stem back to the cultural messaging about women that pervades and alters our sense of our aptitudes and abilities."}, {"2fe4": "Of course, solving such deeply-rooted gender issues isn’t easy, and I certainly don’t believe it is the fault or sole responsibility of women to solve it. The idea of “impostor syndrome” can often be used as a way to gaslight women and minorities, to make them feel like it’s our own fault and we just need to overcome our own self-confidence issues. As Cate Huston writes,"}, {"b5bb": "“What we call imposter syndrome often reflects the reality of an environment that tells marginalized groups that we shouldn’t be confident, that our skills aren’t enough, that we won’t succeed — and when we do, our accomplishments won’t even be attributed to us. Yet imposter syndrome is treated as a personal problem to be overcome, a distortion in processing rather than a realistic reflection of the hostility, discrimination, and stereotyping that pervades tech culture.”"}, {"204b": "That said, while gender bias in tech is indeed a problem much larger than a single woman’s psyche, I do believe we women can do something profound to lessen it — we can start individually standing up, despite all of the culturally-induced doubt, and say: I am smart enough. I can do this. If we fight through the messaging and believe in ourselves in large enough numbers, I feel confident that we can begin to erode some of these barriers, and men will have no choice but to believe in us, too."}, {"578d": "So this is me, after three unhappy post-collegiate years in non-technical professions, finally standing up to be counted. I’ve felt left out of the tech world (and secretly wanting in) for too damn long, and I hope that by combating my self-doubt and pursuing what I authentically want to pursue, I can be part of the solution. Maybe I can even inspire another girl like myself, wanting to do tech but feeling unqualified, to apply to that engineering program. And if you’re reading this and are long-past college, please don’t think it’s too late. It is never too late. Just open a Codecademy account already."}, {"69de": "Since making the decision in December to get into tech, I’ve spent the last four months teaching myself JavaScript and gaining admission to the bootcamp I’m about to begin. As I’ve completed this prep-work, I’ve fallen absolutely in love with it. Some days, I can’t believe I ever thought that coding “wasn’t for me” …. and yet, most days, those doubts still hit me. I still harbor lingering fears that I’m not smart enough, not experienced enough, not “really coding”. I know that these doubts come from what our culture tells women about ourselves — about what we are, what we can do, what we can accomplish. Our unique power, however, comes from our ability to realize that the psychological cage we’re standing in has an open door. We can simply step out and do the things they always said we couldn’t."}, {"f14b": "Am I proud of myself for working hard enough to gain admission? Absolutely. Am I excited to be on a track to making significantly more money and having a job in which I get to challenge my brain and create cool things? Abso-freaking-lutely. But more than anything, I’m proud of myself for confronting my own fixed mindset — for deciding that I am good enough, and I do have the intelligence and potential to be a successful software developer."}, {"d6ad": "Wish me luck on bootcamp! See you on the other side, in the world I’ve wanted to be part of for so long."}, {"a648": "— — — — — — — — — — — If you enjoyed this piece, I’d love it if you hit the green heart 💚 so others might stumble upon it. You can find my code on GitHub or my other projects at http://www.sophiaciocca.me."}], "content": "F*ck impostor syndrome — I’m finally learning to code. I’m really doing it: Starting next week, I will be a student at the Grace Hopper Program, an all-women’s branch of Fullstack Academy, one of the top coding bootcamps in NYC. If all goes well, by the end of 2017 I will be a full-time software developer. My friends are shocked, but to be honest, this has been a long time coming. My affinity for coding began when I was 11 years old, spending hours each day after school on the computer coding layouts for Xanga, Myspace, and Neopets user profiles and offering them free online to people around the world. I taught myself graphic design using early-Photoshop-alternatives Paint Shop Pro and Animation Shop 3, and my graphic tinkering quickly became an important creative outlet. What I loved most, however, was working with HTML and CSS, editing templates, figuring out the logic, and bringing my own ideas to life on the internet. As I entered high school, I quickly found myself busy with a large workload from my honors and AP classes, and I promptly forgot about my early forays into computer science and design … but when I sat down to choose classes for my senior year, I discovered an unadvertised Computer Science class and took it as an elective. It wasn’t an honors-level course, and most of my classmates were uninterested kids who were only taking it to to cover their math credit and avoid dropping out, but no matter — I quickly fell in love with the subject. We learned C++, creating basic functions and programs, and I frequently annoyed my teacher, as I asked dozens of questions each class, always trying to go beyond the instructions, create something bigger and better. There was no doubt that I loved programming — how logical it was, how black-and-white, and how it required one to be so detail-oriented, a state of mind I already inhabited. But despite what, in hindsight, was clearly a strong aptitude for computer science, I inexplicably didn’t feel “good enough” to pursue it. As I headed off to college, despite excelling in my CS class, I didn’t feel like I had “enough skills and knowledge” to apply for university-level engineering or computer science programs. What, exactly, constituted “enough skills and knowledge”? I had no idea, but I felt certain it must be more than what I possessed. After high school, I gained admission to Penn, at which I majored in economics. Economics was a safe major — a major that would lead to jobs, and a major that I felt didn’t have any major prerequisites, like I felt tech had. When I applied for housing my first year, despite my non-technical major, I was randomly (and ironically) placed in a residential program called the “Science & Technology Wing”, full of the nerdiest and most enthusiastic engineering students on campus. Living on “STWing”, as they affectionately called it, I felt acutely like Penny on the set of The Big Bang Theory — so alienated from my nerdy neighbors, but also secretly jealous of them. Most of them had been taking apart computers since they were twelve, and it was like they spoke another language. While I never admitted it, I wished more than anything that I could join their club. I wished I had the knowledge, the background, the je-ne-sais-quois that makes someone eligible to be a techie. But my mindset about it was inexplicably fixed, as if I could never learn. It was already too late. At the ripe old age of 18, the boat had already left, and I had missed it, forever doomed to the world of non-tech. My final year at Penn, I had extra space in my schedule, so I took my school’s famous CIS-110 introductory Computer Science course as an elective. It was quite a difficult intro course in Java, but I loved spending countless hours completing the assignments. During lectures, however, my self-doubt would creep back in. I looked around at all the people in my class, most of whom were male, and many of whom I assumed were like my STWing peers, coding since they were wee tots. I occasionally thought back to my HTML/CSS background — I guess I had been coding for a long time, too … but this seemed different. These were kids who had built robots, who understood how to make apps …they were “real coders”. My mind had created an impenetrable block that forever deemed myself “not a real coder”, and so no matter how many men I outperformed on the test curve or project scores, I always felt inferior. This isn’t meant to be a sob story about my own inferiority complex. The truth is, my experience reflects a widespread trend in the way women and minorities feel in the world of tech. The way I felt in that class mirrors the way many women (and men of color) feel even when they do make it through that initial self-doubt and enter the tech industry. And this impostor syndrome that plagues women in tech has a source — it is culturally instilled in us from a young age, seen in the gender-typing of childhood toys (robots for boys, art sets for girls) and in constant suggestions from media that women should be focusing their efforts on more superficial pursuits, like looking good (since that’s all we’re worth anyway, right?) These ideas, while obviously false, inevitably seep into our sense of self. The cultural treatment of women also seeps into the way that men in tech think about us. For proof, one need only look at the never-ending stream of stories from women about the rampant misogyny they encounter in Silicon Valley (I’m looking at you, #Uber), and the sad statistics on female representation in tech. This is a problem with wide-reaching implications if something doesn’t give. Women comprise the majority of the world’s population, and yet are dangerously underrepresented in an industry that is soon going to completely reframe the power structure in the labor economy. While this underrepresentation is likely a combination of both pipeline shortages and company bias in hiring decisions, I firmly believe both of these effects stem back to the cultural messaging about women that pervades and alters our sense of our aptitudes and abilities. Of course, solving such deeply-rooted gender issues isn’t easy, and I certainly don’t believe it is the fault or sole responsibility of women to solve it. The idea of “impostor syndrome” can often be used as a way to gaslight women and minorities, to make them feel like it’s our own fault and we just need to overcome our own self-confidence issues. As Cate Huston writes, “What we call imposter syndrome often reflects the reality of an environment that tells marginalized groups that we shouldn’t be confident, that our skills aren’t enough, that we won’t succeed — and when we do, our accomplishments won’t even be attributed to us. Yet imposter syndrome is treated as a personal problem to be overcome, a distortion in processing rather than a realistic reflection of the hostility, discrimination, and stereotyping that pervades tech culture.” That said, while gender bias in tech is indeed a problem much larger than a single woman’s psyche, I do believe we women can do something profound to lessen it — we can start individually standing up, despite all of the culturally-induced doubt, and say: I am smart enough. I can do this. If we fight through the messaging and believe in ourselves in large enough numbers, I feel confident that we can begin to erode some of these barriers, and men will have no choice but to believe in us, too. So this is me, after three unhappy post-collegiate years in non-technical professions, finally standing up to be counted. I’ve felt left out of the tech world (and secretly wanting in) for too damn long, and I hope that by combating my self-doubt and pursuing what I authentically want to pursue, I can be part of the solution. Maybe I can even inspire another girl like myself, wanting to do tech but feeling unqualified, to apply to that engineering program. And if you’re reading this and are long-past college, please don’t think it’s too late. It is never too late. Just open a Codecademy account already. Since making the decision in December to get into tech, I’ve spent the last four months teaching myself JavaScript and gaining admission to the bootcamp I’m about to begin. As I’ve completed this prep-work, I’ve fallen absolutely in love with it. Some days, I can’t believe I ever thought that coding “wasn’t for me” …. and yet, most days, those doubts still hit me. I still harbor lingering fears that I’m not smart enough, not experienced enough, not “really coding”. I know that these doubts come from what our culture tells women about ourselves — about what we are, what we can do, what we can accomplish. Our unique power, however, comes from our ability to realize that the psychological cage we’re standing in has an open door. We can simply step out and do the things they always said we couldn’t. Am I proud of myself for working hard enough to gain admission? Absolutely. Am I excited to be on a track to making significantly more money and having a job in which I get to challenge my brain and create cool things? Abso-freaking-lutely. But more than anything, I’m proud of myself for confronting my own fixed mindset — for deciding that I am good enough, and I do have the intelligence and potential to be a successful software developer. Wish me luck on bootcamp! See you on the other side, in the world I’ve wanted to be part of for so long. — — — — — — — — — — — If you enjoyed this piece, I’d love it if you hit the green heart 💚 so others might stumble upon it. You can find my code on GitHub or my other projects at http://www.sophiaciocca.me. ", "child": "850_1\t850_2\t850_3\t850_4\t850_5\t850_6\t850_7\t850_8\t850_9\t850_10\t850_11\t850_12\t850_13\t850_14\t850_15\t850_16\t850_17\t850_18\t850_19\t850_20\t850_21\t850_22\t850_23\t850_24850_1\t850_2\t850_3\t850_4\t850_5\t850_6\t850_7\t850_8\t850_9\t850_10\t850_11\t850_12\t850_13\t850_14\t850_15\t850_16\t850_17\t850_18\t850_19\t850_20\t850_21\t850_22\t850_23\t850_24850_1\t850_2\t850_3\t850_4\t850_5\t850_6\t850_7\t850_8\t850_9\t850_10\t850_11\t850_12\t850_13\t850_14\t850_15\t850_16\t850_17\t850_18\t850_19\t850_20\t850_21\t850_22\t850_23\t850_24"}