{"name": "855", "parent": "", "title": "PSA: That kid you hate in CS class is not as smart as he tells you", "sentences": [{"123d": "PSA: That kid you hate in CS class is not as smart as he tells you"}, {"4018": "SPOILER: he does not have a bright future"}, {"ddba": "All hail Aggressive Nerd"}, {"c382": "Don’t pretend you don’t know who I’m talking about. There’s always one. The kid who interrupts the professor to correct them in front of hundreds of other students. The kid who asks questions about content WAY beyond the scope of class, that have NOTHING to do with anything, but the professor is then forced to answer because we are all now held captive by this idiot’s need to impress upon us how smart he is. I could pretend to use he/she but we all know we’ve never met one who didn’t identify as a “he”."}, {"3281": "While I was in school we called him the “aggressive nerd”. You lived in fear that he was in your quiz section because in a lecture hall he’s annoying but in a small setting he’s positively insufferable. Well you’re in luck kids, because I am now a teacher, and I can tell you FIRST HAND- that kid is not that smart."}, {"e75d": "While I was in school the aggressive nerd bothered me but somehow I always knew that kid sucked. However, it wasn’t until I was a TA and I would have students shyly tell me “well I don’t think I’m doing that well, I didn’t even understand what aggressive nerd was talking about in class”. DEAR GOD NO! Don’t compare yourself to that kid! TRUST ME- you’re going to be way more successful than that kid! I write this for YOU hard working insecure kid!"}, {"ca84": "Let me tell you what happens to aggressive nerds."}, {"5297": "Let me now try to actually answer your question as quickly as possible so we can get back to what this class is actually supposed to be about."}, {"1022": "3. Aggressive nerd turns in his first coding assignment. Turns out he does know enough coding to do this first assignment without paying any attention in class. He passes this assignment, but loses a couple points because HE DIDN’T PAY ATTENTION IN CLASS. He then sends teacher/TA a very angry email about how he deserves those points back. He does not get the points back."}, {"0ec7": "4. Class progresses and aggressive nerd’s prior experience is running out. Soon class is beyond him and he is barely getting half credit on assignments. He refuses to ask for help, continues to send angry emails in response to all lost points. Angry emails do not sway the person grading your assignment."}, {"cd8e": "5. The midterm comes around and aggressive nerd is starting to panic. This is when he is at his most annoying in lecture- beware. He manages a passing grade on the midterm because it’s not graded on style, he feels validated and ramps up his lecture posturing."}, {"294b": "6. We are deep enough in now that the aggressive nerd cannot keep up at all. He starts to miss assignments. He is finally starting to ask for help, but all requests are cloaked in “because you guys teach this all wrong I have to learn it YOUR way” rhetoric. Because teachers are living saints we agree to help him and try to coach him through the rest of the quarter. This is the cause of my first ulcer."}, {"6a64": "7. The class ends and aggressive nerd has made it through with a mediocre score. Despite overwhelming evidence that he is not in fact a coding genius sent down to earth by Alan Turing himself (who would have hated this fucker btw) he continues his computer science career, inflicting his insecurities on all future group project partners."}, {"f853": "8. It comes time for aggressive nerd to find a job. Guess what? He sucks! No one wants to hire him! He ends up finding some code monkey job working for a company he constantly complains “doesn’t have a high enough hiring bar”. You all move on with your lives and forget you had to ever deal with him."}, {"e8ee": "9. Eventually he resurfaces, posting obnoxiously critical things on reddit and 4chan about all the companies that wouldn’t have him. He cannot progress in his career because no one wants to work with him and his code quality sucks because he doesn’t respond to code review feedback. He complains to any coworker who mistakenly engages him that it’s because “everyone is jealous of his talent” or because “no one understands how good his code is” or the classic “management is a bunch of idiots”. You decide to unfollow him on facebook and you go on to live your life surrounded by smart, kind and collaborative people who actually make up the working world."}, {"7974": "ALTERNATIVE ENDING: Sometimes a hero recognizes that aggressive nerd’s actions come from a place of deep-seated insecurities and reaches out to them. This hero helps aggressive nerd feel validated and heard while giving them the vital feedback that they need to keep in mind how they affect those around them. Aggressive nerd responds to this kindness and directness and CALMS THE FUCK DOWN. He goes on to live his life as a wonderful colleagues and friend. Moral of the story: be a hero, be kind, you never know who could just use a kind, but firm, “you need to cut it the fuck out”."}, {"49a3": "Liked this? Hit the little ❤ so others can find this post. Keep an eye out for more posts from Kasey every other Tuesday as she tells stories from both the classroom and the tech industry. Next post coming 4/25/17"}], "content": "PSA: That kid you hate in CS class is not as smart as he tells you SPOILER: he does not have a bright future All hail Aggressive Nerd Don’t pretend you don’t know who I’m talking about. There’s always one. The kid who interrupts the professor to correct them in front of hundreds of other students. The kid who asks questions about content WAY beyond the scope of class, that have NOTHING to do with anything, but the professor is then forced to answer because we are all now held captive by this idiot’s need to impress upon us how smart he is. I could pretend to use he/she but we all know we’ve never met one who didn’t identify as a “he”. While I was in school we called him the “aggressive nerd”. You lived in fear that he was in your quiz section because in a lecture hall he’s annoying but in a small setting he’s positively insufferable. Well you’re in luck kids, because I am now a teacher, and I can tell you FIRST HAND- that kid is not that smart. While I was in school the aggressive nerd bothered me but somehow I always knew that kid sucked. However, it wasn’t until I was a TA and I would have students shyly tell me “well I don’t think I’m doing that well, I didn’t even understand what aggressive nerd was talking about in class”. DEAR GOD NO! Don’t compare yourself to that kid! TRUST ME- you’re going to be way more successful than that kid! I write this for YOU hard working insecure kid! Let me tell you what happens to aggressive nerds. Let me now try to actually answer your question as quickly as possible so we can get back to what this class is actually supposed to be about. 3. Aggressive nerd turns in his first coding assignment. Turns out he does know enough coding to do this first assignment without paying any attention in class. He passes this assignment, but loses a couple points because HE DIDN’T PAY ATTENTION IN CLASS. He then sends teacher/TA a very angry email about how he deserves those points back. He does not get the points back. 4. Class progresses and aggressive nerd’s prior experience is running out. Soon class is beyond him and he is barely getting half credit on assignments. He refuses to ask for help, continues to send angry emails in response to all lost points. Angry emails do not sway the person grading your assignment. 5. The midterm comes around and aggressive nerd is starting to panic. This is when he is at his most annoying in lecture- beware. He manages a passing grade on the midterm because it’s not graded on style, he feels validated and ramps up his lecture posturing. 6. We are deep enough in now that the aggressive nerd cannot keep up at all. He starts to miss assignments. He is finally starting to ask for help, but all requests are cloaked in “because you guys teach this all wrong I have to learn it YOUR way” rhetoric. Because teachers are living saints we agree to help him and try to coach him through the rest of the quarter. This is the cause of my first ulcer. 7. The class ends and aggressive nerd has made it through with a mediocre score. Despite overwhelming evidence that he is not in fact a coding genius sent down to earth by Alan Turing himself (who would have hated this fucker btw) he continues his computer science career, inflicting his insecurities on all future group project partners. 8. It comes time for aggressive nerd to find a job. Guess what? He sucks! No one wants to hire him! He ends up finding some code monkey job working for a company he constantly complains “doesn’t have a high enough hiring bar”. You all move on with your lives and forget you had to ever deal with him. 9. Eventually he resurfaces, posting obnoxiously critical things on reddit and 4chan about all the companies that wouldn’t have him. He cannot progress in his career because no one wants to work with him and his code quality sucks because he doesn’t respond to code review feedback. He complains to any coworker who mistakenly engages him that it’s because “everyone is jealous of his talent” or because “no one understands how good his code is” or the classic “management is a bunch of idiots”. You decide to unfollow him on facebook and you go on to live your life surrounded by smart, kind and collaborative people who actually make up the working world. ALTERNATIVE ENDING: Sometimes a hero recognizes that aggressive nerd’s actions come from a place of deep-seated insecurities and reaches out to them. This hero helps aggressive nerd feel validated and heard while giving them the vital feedback that they need to keep in mind how they affect those around them. Aggressive nerd responds to this kindness and directness and CALMS THE FUCK DOWN. He goes on to live his life as a wonderful colleagues and friend. Moral of the story: be a hero, be kind, you never know who could just use a kind, but firm, “you need to cut it the fuck out”. Liked this? Hit the little ❤ so others can find this post. Keep an eye out for more posts from Kasey every other Tuesday as she tells stories from both the classroom and the tech industry. Next post coming 4/25/17 ", "child": "855_1\t855_2\t855_3855_1\t855_2\t855_3855_1\t855_2\t855_3"}