{"name": "863", "parent": "", "title": "From Ec to Tech: How Harvard students are changing concentrations", "sentences": [{"da98": "From Ec to Tech: How Harvard students are changing concentrations"}, {"d0db": "And what this means for Harvard’s liberal arts education"}, {"ba28": "Professor David Malan lecturing in Sanders Theatre for CS50, one of Harvard’s largest classes. (Business Insider)"}, {"c54b": "Nationwide, STEM (science, technology, engineering, and math) fields are growing like crazy, often at the expense of the arts and humanities. We at the Harvard Open Data Project studied data on Harvard’s concentrations (yes, we know it’s pretentious, but our majors are called “concentrations”) to see if the same trend was playing out in Cambridge. We found that Harvard students are shifting from social sciences to more quantitative fields like applied math, statistics, and computer science to be more competitive on Wall Street, in Silicon Valley, and in data-driven fields."}, {"23a7": "The Harvard Open Data Project analyzed public datasets on the number of concentrators in each department, the number of degrees awarded in each concentration, and class enrollment across the university."}, {"f332": "To begin our analysis, we divided departments into four categories: the arts and humanities, natural sciences, social sciences, and SEAS (School of Engineering and Applied Sciences). We found that the number of concentrators in the natural sciences, arts, and humanities has remained relatively stable, while we saw a drop in social science concentrators and an increase in SEAS concentrators."}, {"3218": "Where are the social sciences concentrators going and where are the SEAS concentrators coming from?"}, {"d9cd": "We analyzed concentration data to find out. Here are the changes in the five largest concentrations at Harvard over the last five years for which data is available."}, {"3a5e": "This graph shows erratic jumps and drops in government; stability in psychology; but, more notably, a large drop in economics and large, steady increases in computer science and applied math. Computer science and applied math make up 73% of SEAS concentrators, and 75% of the growth in SEAS can be attributed to the rise CS and applied math. Economics concentrators make up 26% of social science concentrators and account for 23% of the fall in social science concentrators."}, {"d692": "We hypothesize that finance-oriented students who would have concentrated in economics are instead choosing to concentrate in applied math/economics or statistics because these fields involve more quantitative thinking suitable for careers in finance."}, {"1750": "Applied math/economics even has its own page on the economics department website, where it is advertised that “The AM/Ec ‘marriage’ is a rational one.” The statistics department caters to students interested in finance with a “quantitative finance track” in the statistics concentration, offering classes like STAT 123: Applied Quantitative Finance and STAT 170: Quantitative Analysis of Capital Markets. Other students who were previously attracted to finance for the earning potential and stable employment may see the tech industry as a more desirable alternative, stimulating growth in the computer science department."}, {"6b0d": "We found further evidence of a shift away from economics and other social sciences to more quantitative fields by graphing the fastest growing and shrinking concentrations:"}, {"ea48": "Statistics is the newest and fastest growing field, reflecting student interest in data science, quantitative finance, and, more generally, a quantitative approach to the social sciences. It is possible that the decrease in concentrators of social sciences like sociology, anthropology, government, and history are due to the rising popularity of statistics, since many of these fields rely heavily on statistical models for research. A statistics concentration would give these students a set of technical skills that might make them more employable and better equipped to do research in their fields of interest in the social sciences."}, {"6cfc": "This boom in statistics, computer science, and applied math indicates a shift to quantitative thinking that mirrors the rise of “big data” and the data-driven economy."}, {"5b15": "Artist’s rendition of the expanded SEAS campus in Allston, MA."}, {"5e1d": "The rising SEAS"}, {"cdc9": "Let’s take a closer look at change within SEAS. Growth in CS and AM is outpacing growth in the engineering concentrations, at 76% and 71% respectively. SEAS has changed from 31% to 28% engineering concentrators. While these numbers may seem insignificant at first glance, this downward trend is alarming given that Harvard is building a huge new campus in Allston, MA to house SEAS. This campus is designed to expand engineering facilities, labs, and maker spaces to compete with Stanford’s and MIT’s, but these sizable investments appear to be directed at a population of engineers that is growing slower than the rest of SEAS — with only 72 concentrators in 2015 compared with 219 concentrators in AM and CS."}, {"91ea": "The decrease in the proportion of engineering concentrators relative to AM/CS concentrators is concerning since most of the facilities Harvard is investing in, such as the Allston expansion, are geared toward engineers."}, {"22a5": "It’s very possible that Harvard can make great strides in growing the engineering concentrations in the next three years before the Allston campus opens, but it would be unfortunate if the new campus is underutilized with CS and AM growth continuing to overshadow engineering growth."}, {"9e56": "What do these shifts mean in the context of the Harvard undergraduate experience — the liberal arts education?"}, {"3b52": "We combined our data on the number of concentrators in each department with class enrollment in each department to get the average number of concentrators per person enrolled in classes in each area of study. This tells us which department’s classes most likely consist of concentrators. In other words, what proportion of the average class in each field are concentrators?"}, {"3bff": "For an average course in each of these fields, what proportion of students are concentrators? The lower this proportion, the more students take it as an elective."}, {"598c": "Unsurprisingly, SEAS and the natural sciences have the highest proportion of concentrators per class. This means a large percentage of students in your SEAS classes are concentrators, while a smaller proportion of students in your humanities and social sciences classes are concentrators (i.e. more of them are taking these classes as electives.)"}, {"d423": "We see a significant drop off of the concentrator to class enrollment ratio in natural sciences classes — probably due to pre-med requirements that cause many non-science concentrators to take science classes. Barely any students taking language and culture classes or math and statistics classes will end up concentrating in them. This makes sense since Harvard has a foreign language requirement, and many concentrations require math or statistics, so many non-concentrators have to take these classes."}, {"50a3": "This data suggests that SEAS and sciences classes might be less accessible to non-concentrators — but that’s also intuitive, as many of these classes have technical prerequisites where English, history, or social studies classes don’t."}, {"8fc2": "This data also reflects that many SEAS and science students take electives in the humanities and social sciences while fewer humanities and social sciences concentrators take SEAS or science classes, probably due to the prerequisite barrier to enrolling in STEM classes."}, {"c205": "When the new Allston campus opens, we can expect to see even less cross-enrollment between humanities/social science classes and SEAS classes since students would have to take a shuttle or walk roughly a mile to get to class. The geographic split between SEAS students and the rest of Harvard is problematic for the “liberal arts education” Harvard claims to value."}, {"0b61": "Emerson Hall, home of Harvard’s Philosophy Department."}, {"c9e2": "To briefly recap, SEAS is growing, but not how we’d expect it to as the new Allston campus for the engineering school is set to open in 2020. Instead of a growing population of engineers, we have a booming population of statistics, applied math, and computer science concentrators. This significant shift from social sciences to more quantitative fields is probably driven by would-be economics students interested in finance opting for applied math/economics or quantitative finance instead."}, {"ef23": "This growing pre-professionalism aimed at the finance and tech industries is problematic for the Harvard’s liberal arts education, especially since Harvard will be geographically split between the Allston SEAS campus and the Yard starting in 2020."}, {"51cf": "This article is one in a series of data analysis projects that the Harvard Open Data Project conducted in the Spring 2017 semester investigating Harvard’s open data sets."}, {"ee08": "The Harvard Open Data Project is dedicated to opening and analyzing Harvard’s data to empower members of our community to improve campus life."}, {"5916": "In the spirit of open data, we invite you to peruse the data used in our analysis on GitHub."}, {"d71e": "Thanks to Ethan Manninen for helping analyze data and Sathvik Sudireddy for pitching this project to HODP."}], "content": "From Ec to Tech: How Harvard students are changing concentrations And what this means for Harvard’s liberal arts education Professor David Malan lecturing in Sanders Theatre for CS50, one of Harvard’s largest classes. (Business Insider) Nationwide, STEM (science, technology, engineering, and math) fields are growing like crazy, often at the expense of the arts and humanities. We at the Harvard Open Data Project studied data on Harvard’s concentrations (yes, we know it’s pretentious, but our majors are called “concentrations”) to see if the same trend was playing out in Cambridge. We found that Harvard students are shifting from social sciences to more quantitative fields like applied math, statistics, and computer science to be more competitive on Wall Street, in Silicon Valley, and in data-driven fields. The Harvard Open Data Project analyzed public datasets on the number of concentrators in each department, the number of degrees awarded in each concentration, and class enrollment across the university. To begin our analysis, we divided departments into four categories: the arts and humanities, natural sciences, social sciences, and SEAS (School of Engineering and Applied Sciences). We found that the number of concentrators in the natural sciences, arts, and humanities has remained relatively stable, while we saw a drop in social science concentrators and an increase in SEAS concentrators. Where are the social sciences concentrators going and where are the SEAS concentrators coming from? We analyzed concentration data to find out. Here are the changes in the five largest concentrations at Harvard over the last five years for which data is available. This graph shows erratic jumps and drops in government; stability in psychology; but, more notably, a large drop in economics and large, steady increases in computer science and applied math. Computer science and applied math make up 73% of SEAS concentrators, and 75% of the growth in SEAS can be attributed to the rise CS and applied math. Economics concentrators make up 26% of social science concentrators and account for 23% of the fall in social science concentrators. We hypothesize that finance-oriented students who would have concentrated in economics are instead choosing to concentrate in applied math/economics or statistics because these fields involve more quantitative thinking suitable for careers in finance. Applied math/economics even has its own page on the economics department website, where it is advertised that “The AM/Ec ‘marriage’ is a rational one.” The statistics department caters to students interested in finance with a “quantitative finance track” in the statistics concentration, offering classes like STAT 123: Applied Quantitative Finance and STAT 170: Quantitative Analysis of Capital Markets. Other students who were previously attracted to finance for the earning potential and stable employment may see the tech industry as a more desirable alternative, stimulating growth in the computer science department. We found further evidence of a shift away from economics and other social sciences to more quantitative fields by graphing the fastest growing and shrinking concentrations: Statistics is the newest and fastest growing field, reflecting student interest in data science, quantitative finance, and, more generally, a quantitative approach to the social sciences. It is possible that the decrease in concentrators of social sciences like sociology, anthropology, government, and history are due to the rising popularity of statistics, since many of these fields rely heavily on statistical models for research. A statistics concentration would give these students a set of technical skills that might make them more employable and better equipped to do research in their fields of interest in the social sciences. This boom in statistics, computer science, and applied math indicates a shift to quantitative thinking that mirrors the rise of “big data” and the data-driven economy. Artist’s rendition of the expanded SEAS campus in Allston, MA. The rising SEAS Let’s take a closer look at change within SEAS. Growth in CS and AM is outpacing growth in the engineering concentrations, at 76% and 71% respectively. SEAS has changed from 31% to 28% engineering concentrators. While these numbers may seem insignificant at first glance, this downward trend is alarming given that Harvard is building a huge new campus in Allston, MA to house SEAS. This campus is designed to expand engineering facilities, labs, and maker spaces to compete with Stanford’s and MIT’s, but these sizable investments appear to be directed at a population of engineers that is growing slower than the rest of SEAS — with only 72 concentrators in 2015 compared with 219 concentrators in AM and CS. The decrease in the proportion of engineering concentrators relative to AM/CS concentrators is concerning since most of the facilities Harvard is investing in, such as the Allston expansion, are geared toward engineers. It’s very possible that Harvard can make great strides in growing the engineering concentrations in the next three years before the Allston campus opens, but it would be unfortunate if the new campus is underutilized with CS and AM growth continuing to overshadow engineering growth. What do these shifts mean in the context of the Harvard undergraduate experience — the liberal arts education? We combined our data on the number of concentrators in each department with class enrollment in each department to get the average number of concentrators per person enrolled in classes in each area of study. This tells us which department’s classes most likely consist of concentrators. In other words, what proportion of the average class in each field are concentrators? For an average course in each of these fields, what proportion of students are concentrators? The lower this proportion, the more students take it as an elective. Unsurprisingly, SEAS and the natural sciences have the highest proportion of concentrators per class. This means a large percentage of students in your SEAS classes are concentrators, while a smaller proportion of students in your humanities and social sciences classes are concentrators (i.e. more of them are taking these classes as electives.) We see a significant drop off of the concentrator to class enrollment ratio in natural sciences classes — probably due to pre-med requirements that cause many non-science concentrators to take science classes. Barely any students taking language and culture classes or math and statistics classes will end up concentrating in them. This makes sense since Harvard has a foreign language requirement, and many concentrations require math or statistics, so many non-concentrators have to take these classes. This data suggests that SEAS and sciences classes might be less accessible to non-concentrators — but that’s also intuitive, as many of these classes have technical prerequisites where English, history, or social studies classes don’t. This data also reflects that many SEAS and science students take electives in the humanities and social sciences while fewer humanities and social sciences concentrators take SEAS or science classes, probably due to the prerequisite barrier to enrolling in STEM classes. When the new Allston campus opens, we can expect to see even less cross-enrollment between humanities/social science classes and SEAS classes since students would have to take a shuttle or walk roughly a mile to get to class. The geographic split between SEAS students and the rest of Harvard is problematic for the “liberal arts education” Harvard claims to value. Emerson Hall, home of Harvard’s Philosophy Department. To briefly recap, SEAS is growing, but not how we’d expect it to as the new Allston campus for the engineering school is set to open in 2020. Instead of a growing population of engineers, we have a booming population of statistics, applied math, and computer science concentrators. This significant shift from social sciences to more quantitative fields is probably driven by would-be economics students interested in finance opting for applied math/economics or quantitative finance instead. This growing pre-professionalism aimed at the finance and tech industries is problematic for the Harvard’s liberal arts education, especially since Harvard will be geographically split between the Allston SEAS campus and the Yard starting in 2020. This article is one in a series of data analysis projects that the Harvard Open Data Project conducted in the Spring 2017 semester investigating Harvard’s open data sets. The Harvard Open Data Project is dedicated to opening and analyzing Harvard’s data to empower members of our community to improve campus life. In the spirit of open data, we invite you to peruse the data used in our analysis on GitHub. Thanks to Ethan Manninen for helping analyze data and Sathvik Sudireddy for pitching this project to HODP. ", "child": "863_1863_1"}