{"name": "866", "parent": "", "title": "Women Who Reign: Alexa Rockwell", "sentences": [{"dec9": "Women Who Reign: Alexa Rockwell"}, {"fd32": "“One of the most important things you need to do in your life is to recognize the people who made you who you are.” — Laura Butler"}, {"9a7d": "Tell us about yourself along with a fun fact! I am a Computer Science major at Stony Brook University. I was born in Brooklyn but my family immigrated from Georgia (the country). I am also a full stack developer for RSRCHR, the founder of EDUCodes, a non-profit whose initiative is to make an education in computer science available to every student in the nation, entrepreneur, an advocate for women in STEM, a campus leader, and a health enthusiast. This summer, I will work as a Product Manager for Softheon. For my fun fact, I come from an artistic family and my personal paintings have sold at auctions for charity."}, {"7146": "What made you want to go into development? Honestly, I thought my future would lie in architecture. I already completed the 4 year architecture track at high school within 2 years and worked as an estimator within a contracting firm when I was 16. But growing up, I would also work with photoshop for digital art projects."}, {"7e78": "The summer before my senior year, I was asked to help design a mobile app for an entrepreneurship program at MIT that my peer was part of. My mother was a mainframe programmer but she was fired after becoming disabled due to a botched herniated disk surgery. She would try her best to explain to me how code works, but it wasn’t until that experience with the MIT entrepreneurship program that I got to see code firsthand. In the following year, I was asked to be the co-founder of my high school’s robotics team, where we competed in the regional FRC competition."}, {"3045": "That was my first experience with coding and I really enjoyed it. I had no idea what was in store when I started to pursue my degree. Stony Brook is the type of environment where your experience is what you make of it. In my first few years, I felt a though I didn’t have any direction because I felt some imposter syndrome when I compared myself to my peers. It wasn’t until sophomore year that I realized that if I was serious about software development, I needed to recognize my potential and start working on projects of my own. That’s where I found my talent, the ability to take a vision and sift through documentation & constraints to make it a reality. That was the moment when I truly wanted to be a developer."}, {"9596": "What # would define your life journey? #resilience"}, {"ac53": "Favorite website / app: Anything created by Boston Dynamics MSI Laptops Apple Watch (because it tracks my resting and active calories)"}, {"f1b1": "Someone who inspires you and knowledge they have imparted: When I went to the first WECode conference, the Keynote speaker was Laura Butler, the first female Microsoft fellow and project manager of the Windows Phone product. Unlike any other corporate speaker, she was ushered to the podium, and she was wearing hiking attire and cute ballet flats with the straps wrapped around the ankle. What was striking, though, was that she refused to talk on the stage. Instead, she stepped down to the audience’s level."}, {"341a": "She spoke about her life, and how she was incredibly lucky to be where she was today because she dropped out of Harvard. There was something in specific that she said that stuck with me, and it hasn’t resonated with me as much until now. “One of the most important things you need to do in your life is to recognize the people who made you who you are.”"}, {"45b1": "Possibly the reason why I didn’t understand it then is because I was so new to the industry. But now that I look back on it, I wouldn’t have made it this far if I didn’t have Nemo, a dear friend within the department who constantly made me question myself and ultimately pushed me to dive into development, Chris, who encouraged me to “keep knocking on doors until they knock on yours”, and Zheni, a peer within our program & we still are each other’s cheerleaders. Additionally, Google’s IgniteCS managers, who have recognized my talents and helped me create EDUCodes, my team at EDUCodes, who have inspired me to become a better leader and in turn create a better community for them, and my parents, who always reminded me to prioritize myself because nobody else will."}, {"9dc3": "And it’s true, nobody succeeds or creates something great by themselves. Laura Butler was one of the first developers I had met that had such a humane and empathetic aura to them. She is an expert in her field but also genuinely cares about every person she meets, and she makes sure to give back to her community. She is honestly the type of person I hope to be."}, {"e403": "Song that makes you want to dance: “Q.U.E.E.N.” by Janelle Monae  “Shining” by DJ Khaled, Beyonce, Jay Z"}, {"aa90": "Challenge you’ve faced and how you overcame it: I have always struggled with my body image growing up. So much so that in my freshman year of college I suffered an eating disorder and weighed as low as 105 lbs. Struggling with depression at the same time, I quit the habits that contributed to the disorder and I ended up regaining weight to the point of excess. After much reflection, I realized that there was a healthier way to go about maintaining a healthy weight and getting fit that would last long-term."}, {"3c82": "This required me to take responsibility for the food I put into my body and to change my lifestyle in order to accommodate daily morning gym sessions. I now wake up before the sun rises and head to the gym before my classes start every day. I keep a streak of my progress and the number of days I have been going in my Google Calendar and I am currently on day 45. I also have my long term goals such as being able to do pull ups, splits, and three minute planks."}, {"17ad": "I can say that I have definitely come a long way from someone who felt as though they were worthless because of their body to someone who became proud of their skin and is committed to making it even better. This challenge was also the defining moment when I started to take my future into my own hands, instead of being content with how things were."}, {"4661": "Ideal Job: I am a very entrepreneurial person, and I definitely see myself as a business owner and developer. I could also answer the call to action going on in the nation as of now regarding the foreign relations, reproductive rights, protecting the LGBTQ+ community, cracking down on police brutality, and prioritizing education."}, {"8c5b": "At a conference I went to last February, I had the chance to meet Brianna Wu, the director of Giant Spacekat, a gaming studio, and the person at the center of the GamerGate scandal. She did her best to talk about sexism within the gaming industry, which led to her receiving death threats on Twitter. After last year’s presidential election, Brianna decided to run for congress, because she realized that she can’t sit by while rape culture and gender based crimes were being condoned by the upcoming administration. This is why a part of me wants to use my knowledge to protect the wellbeing of society, may it be as a senator or as someone on the front lines of the nation’s cyberdefense."}, {"a837": "What knowledge would you impart to women in order for them to REIGN their lives? I would say to take a look at what they are doing right now, and ask themselves: “Are you doing everything you possibly can to get to where you want to be?” If they are, then by all means continue persevering. If not, keep doing your research and reaching out to your network, and reign in the future you want."}, {"db40": "Learn more about Alexa: arkwl.github.io"}, {"83b2": "Originally published at reigningit.wordpress.com on April 2, 2017."}], "content": "Women Who Reign: Alexa Rockwell “One of the most important things you need to do in your life is to recognize the people who made you who you are.” — Laura Butler Tell us about yourself along with a fun fact! I am a Computer Science major at Stony Brook University. I was born in Brooklyn but my family immigrated from Georgia (the country). I am also a full stack developer for RSRCHR, the founder of EDUCodes, a non-profit whose initiative is to make an education in computer science available to every student in the nation, entrepreneur, an advocate for women in STEM, a campus leader, and a health enthusiast. This summer, I will work as a Product Manager for Softheon. For my fun fact, I come from an artistic family and my personal paintings have sold at auctions for charity. What made you want to go into development? Honestly, I thought my future would lie in architecture. I already completed the 4 year architecture track at high school within 2 years and worked as an estimator within a contracting firm when I was 16. But growing up, I would also work with photoshop for digital art projects. The summer before my senior year, I was asked to help design a mobile app for an entrepreneurship program at MIT that my peer was part of. My mother was a mainframe programmer but she was fired after becoming disabled due to a botched herniated disk surgery. She would try her best to explain to me how code works, but it wasn’t until that experience with the MIT entrepreneurship program that I got to see code firsthand. In the following year, I was asked to be the co-founder of my high school’s robotics team, where we competed in the regional FRC competition. That was my first experience with coding and I really enjoyed it. I had no idea what was in store when I started to pursue my degree. Stony Brook is the type of environment where your experience is what you make of it. In my first few years, I felt a though I didn’t have any direction because I felt some imposter syndrome when I compared myself to my peers. It wasn’t until sophomore year that I realized that if I was serious about software development, I needed to recognize my potential and start working on projects of my own. That’s where I found my talent, the ability to take a vision and sift through documentation & constraints to make it a reality. That was the moment when I truly wanted to be a developer. What # would define your life journey? #resilience Favorite website / app: Anything created by Boston Dynamics MSI Laptops Apple Watch (because it tracks my resting and active calories) Someone who inspires you and knowledge they have imparted: When I went to the first WECode conference, the Keynote speaker was Laura Butler, the first female Microsoft fellow and project manager of the Windows Phone product. Unlike any other corporate speaker, she was ushered to the podium, and she was wearing hiking attire and cute ballet flats with the straps wrapped around the ankle. What was striking, though, was that she refused to talk on the stage. Instead, she stepped down to the audience’s level. She spoke about her life, and how she was incredibly lucky to be where she was today because she dropped out of Harvard. There was something in specific that she said that stuck with me, and it hasn’t resonated with me as much until now. “One of the most important things you need to do in your life is to recognize the people who made you who you are.” Possibly the reason why I didn’t understand it then is because I was so new to the industry. But now that I look back on it, I wouldn’t have made it this far if I didn’t have Nemo, a dear friend within the department who constantly made me question myself and ultimately pushed me to dive into development, Chris, who encouraged me to “keep knocking on doors until they knock on yours”, and Zheni, a peer within our program & we still are each other’s cheerleaders. Additionally, Google’s IgniteCS managers, who have recognized my talents and helped me create EDUCodes, my team at EDUCodes, who have inspired me to become a better leader and in turn create a better community for them, and my parents, who always reminded me to prioritize myself because nobody else will. And it’s true, nobody succeeds or creates something great by themselves. Laura Butler was one of the first developers I had met that had such a humane and empathetic aura to them. She is an expert in her field but also genuinely cares about every person she meets, and she makes sure to give back to her community. She is honestly the type of person I hope to be. Song that makes you want to dance: “Q.U.E.E.N.” by Janelle Monae  “Shining” by DJ Khaled, Beyonce, Jay Z Challenge you’ve faced and how you overcame it: I have always struggled with my body image growing up. So much so that in my freshman year of college I suffered an eating disorder and weighed as low as 105 lbs. Struggling with depression at the same time, I quit the habits that contributed to the disorder and I ended up regaining weight to the point of excess. After much reflection, I realized that there was a healthier way to go about maintaining a healthy weight and getting fit that would last long-term. This required me to take responsibility for the food I put into my body and to change my lifestyle in order to accommodate daily morning gym sessions. I now wake up before the sun rises and head to the gym before my classes start every day. I keep a streak of my progress and the number of days I have been going in my Google Calendar and I am currently on day 45. I also have my long term goals such as being able to do pull ups, splits, and three minute planks. I can say that I have definitely come a long way from someone who felt as though they were worthless because of their body to someone who became proud of their skin and is committed to making it even better. This challenge was also the defining moment when I started to take my future into my own hands, instead of being content with how things were. Ideal Job: I am a very entrepreneurial person, and I definitely see myself as a business owner and developer. I could also answer the call to action going on in the nation as of now regarding the foreign relations, reproductive rights, protecting the LGBTQ+ community, cracking down on police brutality, and prioritizing education. At a conference I went to last February, I had the chance to meet Brianna Wu, the director of Giant Spacekat, a gaming studio, and the person at the center of the GamerGate scandal. She did her best to talk about sexism within the gaming industry, which led to her receiving death threats on Twitter. After last year’s presidential election, Brianna decided to run for congress, because she realized that she can’t sit by while rape culture and gender based crimes were being condoned by the upcoming administration. This is why a part of me wants to use my knowledge to protect the wellbeing of society, may it be as a senator or as someone on the front lines of the nation’s cyberdefense. What knowledge would you impart to women in order for them to REIGN their lives? I would say to take a look at what they are doing right now, and ask themselves: “Are you doing everything you possibly can to get to where you want to be?” If they are, then by all means continue persevering. If not, keep doing your research and reaching out to your network, and reign in the future you want. Learn more about Alexa: arkwl.github.io Originally published at reigningit.wordpress.com on April 2, 2017. ", "child": "866_1866_1866_1866_1"}