{"name": "869", "parent": "", "title": "How to set up a VPN in 10 minutes for free (and why you urgently need one)", "sentences": [{"f252": "How to set up a VPN in 10 minutes for free (and why you urgently need one)"}, {"ab99": "“A computer lets you make more mistakes faster than any other invention with the possible exceptions of handguns and Tequila.” — Mitch Ratcliffe"}, {"9e86": "Soon every mistake you’ve ever made online will not only be available to your internet service provider (ISP) — it will be available to any corporation or foreign government who wants to see those mistakes."}, {"e487": "Thanks to a decision by Congress, ISPs can sell your entire web browsing history to literally anyone without your permission. The only rules that prevented this are all being repealed, and won’t be reinstated any time soon (it would take an act of congress)."}, {"db99": "ISPs can also sell any information they want from your online activity and mobile app usage — financial information, medical information, your children’s information, your social security number — even the contents of your emails."}, {"e1a8": "They can even sell your geolocation information. That’s right, ISPs can take your exact physical location from minute to minute and sell it to a third party."}, {"34bb": "You might be wondering: who benefits from repealing these protections? Other than those four monopoly ISPs that control America’s “last mile” of internet cables and cell towers?"}, {"62cf": "No one. No one else benefits in any way. Our privacy — and our nation’s security — have been diminished, just so a few mega-corporations can make a little extra cash."}, {"2428": "In other words, these politicians — who have received millions of dollars in campaign contributions from the ISPs for decades — have sold us out."}, {"7f77": "How did this happen?"}, {"2f96": "The Congressional Review Act (CRA) was passed in 1996 to allow Congress to overrule regulations created by government agencies."}, {"2de9": "Prior to 2017, congress had only successfully used the CRA once. But since the new administration took over in January, it’s been successfully used 3 times — for things like overturning pesky environmental regulations."}, {"33b6": "Senator Jeff Flake — a Republican representing Arizona — led the effort to overturn the FCC’s privacy rules. He was already the most unpopular senator in the US. Now he may become the most unpopular senator in US history."}, {"8a3e": "Senator Flake"}, {"aadf": "Instead of just blaming Flake, though, let’s remember that every single senator who voted in favor of overturning these privacy rules was a Republican. Every single Democrat and Independent senator voted against this CRA resolution. The final vote was 50–48, with two Republicans abstaining."}, {"b37b": "You would think that the Senate would heavily discuss such the consequences of such an historic decision. Actually, they only spent 10 minutes debating it."}, {"1894": "“Relying on the government to protect your privacy is like asking a peeping tom to install your window blinds.” — John Perry Barlow"}, {"7c21": "VPN company Private Internet Access paid $600,000 to run this full-page ad in Sunday’s New York Times — even though they would make a ton of money if these rules were repealed. That’s how bad things have gotten with this CRA — even the VPN companies are campaigning against it."}, {"3d38": "The CRA resolution also passed in the House of Representatives, where 231 Republicans voted in favor of removing privacy protections against 189 Democrats who voted against it. (Again, not a single non-Republican voted to remove these privacy protections.)"}, {"4b24": "All that’s left is for the Republican president to sign the resolution, which he has said he plans to do."}, {"a314": "So what kind of messed-up things can ISPs now legally do with our data?"}, {"add7": "According to the Electronic Frontier Foundation, there are at least five creepy things the FCC regulations would have made illegal. But thanks to the Senate, ISPs can now continue doing these things as much as they want, and it will probably be years before we can do anything to stop them."}, {"1bc4": "So how do we have any hope of protecting our privacy now?"}, {"49c0": "According to a study by the Pew Research Center, 91% of adults agree or strongly agree that “consumers have lost control of how personal information is collected and used by companies.”"}, {"5457": "But we shouldn’t despair. But as the same British Prime Minister who cautioned us to “hope for the best and prepare for the worst” also said:"}, {"658e": "“Despair is the conclusion of fools.” — Benjamin Disraeli in 1883"}, {"9f80": "Well we are not fools. We’re going to take the actions necessary to secure our family’s privacy against the acts of reckless monopolies and their political puppets."}, {"6e78": "And we’re going to do this using the most effective tools for securing online communication: encryption and VPNs."}, {"f3e4": "Step 1: enable HTTPS Everywhere"}, {"5a94": "As I mentioned, ISPs can work around HTTPS if they are able to factory-install spyware on your phone’s operating system. As long as you can avoid buying those models of phones, HTTPS will give you a huge amount of additional protection."}, {"0995": "HTTPS works by encrypting traffic between destination websites and your device by using the secure TLS protocol."}, {"7984": "The problem is that, as of 2017, only about 10% of websites have enabled HTTPS, and even many of those websites haven’t properly configured their systems to disallow insecure non-HTTPS traffic (even though it’s free and easy to do using LetsEncrypt)."}, {"1392": "This is where the EFF’s HTTPS Everywhere extension comes in handy. It will make these websites default to HTTPS, and will alert you if you try and access a site that isn’t HTTPS. It’s free and you can install it here."}, {"29ea": "One thing we know for sure — thanks to the recent WikiLeaks release of the CIA’s hacking arsenal — is that encryption still works. As long as you’re using secure forms of encryption that haven’t yet been cracked — and as far as we know, HTTPS’s TLS encryption hasn’t been — your data will remain private."}, {"1f2f": "“The average busy professional in this country wakes up in the morning, goes to work, comes home, takes care of personal and family obligations, and then goes to sleep, unaware that he or she likely committed several federal crimes that day.” — Harvey Silverglate"}, {"0b8e": "By the way, if you haven’t already, I strongly recommend you read my article on how to encrypt your entire life in less than an hour."}, {"a5cf": "But even with HTTPS enabled, ISPs will still know — thanks to their role in actually connecting you to websites themselves — what websites you’re visiting, even if they don’t know what you’re doing there."}, {"eebc": "And just knowing where you’re going — the “metadata” of your web activity — gives ISPs a lot of information they can sell."}, {"9a47": "For example, someone visiting Cars.com may be in the market for a new car, and someone visiting BabyCenter.com may be pregnant."}, {"00a4": "That’s where using a VPN comes in."}, {"5aa9": "How VPNs can protect you"}, {"29c0": "VPN stands for Virtual Private Network."}, {"581d": "People have traditionally used VPNs as a way to get around websites that are blocked in their country (for example, Medium is blocked in Malaysia) or to watch movies that aren’t available in certain countries. But VPNs are extremely useful for privacy, too."}, {"1665": "There are several types of VPN options, with varying degrees of convenience and security."}, {"cef1": "Experts estimate that as many as 90% of VPNs are “hopelessly insecure” and this changes from time to time. So even if you use the tools I recommend here, I recommend you take the time to do your homework."}, {"6b13": "Browser-based VPNs"}, {"3457": "Most VPNs are services that cost money. But the first VPN option I’m going to tell you about is convenient and completely free."}, {"8bb9": "Opera is a popular web browser that comes with some excellent privacy features, like a free built-in VPN and a free ad blocker (and as you may know, ads can spy on you)."}, {"7ee9": "If you just want a secure way to browse the web without ISPs being able to easily snoop on you and sell your data, Opera is a great start. Let’s install and configure it real quick. This takes less than 5 minutes."}, {"b380": "Before you get started, note that this will only anonymize the things you do within the Opera browser. Also, I’m obligated to point out that even though Opera’s parent company is European, it was recently purchased by a consortium of Chinese tech companies, and there is a non-zero risk that it could be compromised by the Chinese government."}, {"68e3": "Having said that, here’s how to browse securely with Opera:"}, {"3f5c": "Step #1: Download the Opera browser"}, {"7de1": "Step #2: Turn on its ad blocker"}, {"6cd5": "Step #3: Turn on its VPN"}, {"20d8": "Step #4: Install HTTPS Everywhere"}, {"b491": "When you’re done, Opera should look like this:"}, {"e803": "Presto — you can now browse the web with reasonable confidence that your ISPs — or really anyone else —don’t know who you are or what you’re doing."}, {"6666": "You can even set your VPN to a different country. Here, I’ve set mine to Singapore so websites will think I’m in Singapore. To test this out, I visited ipleak.net and they did indeed think I was in Singapore."}, {"2958": "Since the internet is complex, and data passes through hundreds of providers through a system of peering and trading traffic, US-based ISPs shouldn’t be able to monitor my traffic when it emerges from Singapore."}, {"76ff": "If you want to take things next level, you can try Tor, which is extremely private, and extremely hard to de-anonymize (though it can be done, as depicted in the TV show Mr. Robot — though it would require incredible resources)."}, {"17d7": "Tor’s a bit more work to set up and use, and is slower than using a VPN. If you want to learn more, I have a getting-started guide for Tor here."}, {"e62b": "VPN Services"}, {"2971": "The most common way people get VPNs is through a monthly service. There are a ton of these. Ultimately, you must trust the company running the VPN, because there’s no way to know what they’re doing with your data."}, {"f3fe": "As I said, some VPNs are improperly configured, and may leak personally identifying data."}, {"a7a2": "Before you buy a VPN, read up on how it compares to others here. Once you buy a VPN, the best way to double check that it’s working properly is to visit ipleak.net while using the VPN."}, {"0d7d": "Even though most users of VPNs are companies with remote employees, the NSA will still put you on a list if you purchased a VPN. So I recommend using something anonymous to do so, like a pre-loaded Visa card. (By the way, Bitcoin is not anonymous.)"}, {"6197": "There are dozens of VPN services, and there’s no clear “winner.” I use Private Internet Access which costs about $40 per year and runs on my family’s computers and phones."}, {"1f43": "I also asked people on Twitter which VPNs they were using and got a variety of answers:"}, {"2b16": "Routers with built-in VPNs"}, {"3c71": "You can purchase a VPN-enabled router. Note that these aren’t specifically designed to protect you from snooping by your ISP. Instead, they’re designed so that companies’ satellite offices can share the same network as their headquarter offices. I haven’t used one before, so I can’t testify to their efficacy."}, {"a44a": "If you happen to have a second residence in a county outside the US, you can just tunnel through that home’s network. Otherwise, you’ll need to configure your router to work with one of the VPN services I mentioned earlier."}, {"7a65": "Some routers are designed to work with VPNs at higher speeds than others. If you want to use a VPN at the router level, and your internet connection is less than 100 mps, this router will probably suffice. Otherwise, you’ll need to pay a bit more for a router like this one."}, {"4e1f": "If you don’t trust the router companies, you can modify a router using Tomato USB. It’s an alternative open source Linux-based router firmware that’s compatible with some off-the-shelf routers."}, {"74d7": "Privacy is hard. But it’s worth it."}, {"beed": "Privacy is a fundamental human right, and has been declared so by the United Nations."}, {"f2b5": "Still, many people believe we live in a “post-privacy” era. For example, Mark Zuckerberg claims privacy isn’t that important any more. But look at his actions. He paid $30 million to buy the 4 houses adjacent to his Palo Alto home so he could have more privacy."}, {"c50a": "Other people are just too jaded and shell-shocked by all the data breaches around us to believe that privacy is still worth the fight."}, {"dc9e": "But most people who say they don’t care about their own privacy anymore just haven’t really given it much thought."}, {"c73d": "“Arguing that you don’t care about the right to privacy because you have nothing to hide is no different than saying you don’t care about free speech because you have nothing to say.” — Edward Snowden"}, {"cf8c": "Last week’s US Senate vote is just the latest in a series of events that show how we can’t trust governments to act in the interest of consumers when it comes to their privacy."}, {"a6b8": "We need stronger privacy protections enshrined in the law."}, {"a5ac": "In the meantime, we’ll just have to look out for ourselves, and educate other people to do the same."}, {"70ba": "I encourage you to read computer security expert Bruce Schneier’s book “Data and Goliath: The Hidden Battles to Collect Your Data and Control Your World.” I learned a ton from it, and am listening to it a second time."}, {"f1ba": "Data and Goliath: The Hidden Battles to Capture Your Data and Control Your WorldEdit descriptionamzn.to"}, {"4abe": "Thanks for reading, and for taking privacy seriously."}, {"cfd4": "If you liked this, click the 💚 below. Follow me and freeCodeCamp for more articles on technology."}], "content": "How to set up a VPN in 10 minutes for free (and why you urgently need one) “A computer lets you make more mistakes faster than any other invention with the possible exceptions of handguns and Tequila.” — Mitch Ratcliffe Soon every mistake you’ve ever made online will not only be available to your internet service provider (ISP) — it will be available to any corporation or foreign government who wants to see those mistakes. Thanks to a decision by Congress, ISPs can sell your entire web browsing history to literally anyone without your permission. The only rules that prevented this are all being repealed, and won’t be reinstated any time soon (it would take an act of congress). ISPs can also sell any information they want from your online activity and mobile app usage — financial information, medical information, your children’s information, your social security number — even the contents of your emails. They can even sell your geolocation information. That’s right, ISPs can take your exact physical location from minute to minute and sell it to a third party. You might be wondering: who benefits from repealing these protections? Other than those four monopoly ISPs that control America’s “last mile” of internet cables and cell towers? No one. No one else benefits in any way. Our privacy — and our nation’s security — have been diminished, just so a few mega-corporations can make a little extra cash. In other words, these politicians — who have received millions of dollars in campaign contributions from the ISPs for decades — have sold us out. How did this happen? The Congressional Review Act (CRA) was passed in 1996 to allow Congress to overrule regulations created by government agencies. Prior to 2017, congress had only successfully used the CRA once. But since the new administration took over in January, it’s been successfully used 3 times — for things like overturning pesky environmental regulations. Senator Jeff Flake — a Republican representing Arizona — led the effort to overturn the FCC’s privacy rules. He was already the most unpopular senator in the US. Now he may become the most unpopular senator in US history. Senator Flake Instead of just blaming Flake, though, let’s remember that every single senator who voted in favor of overturning these privacy rules was a Republican. Every single Democrat and Independent senator voted against this CRA resolution. The final vote was 50–48, with two Republicans abstaining. You would think that the Senate would heavily discuss such the consequences of such an historic decision. Actually, they only spent 10 minutes debating it. “Relying on the government to protect your privacy is like asking a peeping tom to install your window blinds.” — John Perry Barlow VPN company Private Internet Access paid $600,000 to run this full-page ad in Sunday’s New York Times — even though they would make a ton of money if these rules were repealed. That’s how bad things have gotten with this CRA — even the VPN companies are campaigning against it. The CRA resolution also passed in the House of Representatives, where 231 Republicans voted in favor of removing privacy protections against 189 Democrats who voted against it. (Again, not a single non-Republican voted to remove these privacy protections.) All that’s left is for the Republican president to sign the resolution, which he has said he plans to do. So what kind of messed-up things can ISPs now legally do with our data? According to the Electronic Frontier Foundation, there are at least five creepy things the FCC regulations would have made illegal. But thanks to the Senate, ISPs can now continue doing these things as much as they want, and it will probably be years before we can do anything to stop them. So how do we have any hope of protecting our privacy now? According to a study by the Pew Research Center, 91% of adults agree or strongly agree that “consumers have lost control of how personal information is collected and used by companies.” But we shouldn’t despair. But as the same British Prime Minister who cautioned us to “hope for the best and prepare for the worst” also said: “Despair is the conclusion of fools.” — Benjamin Disraeli in 1883 Well we are not fools. We’re going to take the actions necessary to secure our family’s privacy against the acts of reckless monopolies and their political puppets. And we’re going to do this using the most effective tools for securing online communication: encryption and VPNs. Step 1: enable HTTPS Everywhere As I mentioned, ISPs can work around HTTPS if they are able to factory-install spyware on your phone’s operating system. As long as you can avoid buying those models of phones, HTTPS will give you a huge amount of additional protection. HTTPS works by encrypting traffic between destination websites and your device by using the secure TLS protocol. The problem is that, as of 2017, only about 10% of websites have enabled HTTPS, and even many of those websites haven’t properly configured their systems to disallow insecure non-HTTPS traffic (even though it’s free and easy to do using LetsEncrypt). This is where the EFF’s HTTPS Everywhere extension comes in handy. It will make these websites default to HTTPS, and will alert you if you try and access a site that isn’t HTTPS. It’s free and you can install it here. One thing we know for sure — thanks to the recent WikiLeaks release of the CIA’s hacking arsenal — is that encryption still works. As long as you’re using secure forms of encryption that haven’t yet been cracked — and as far as we know, HTTPS’s TLS encryption hasn’t been — your data will remain private. “The average busy professional in this country wakes up in the morning, goes to work, comes home, takes care of personal and family obligations, and then goes to sleep, unaware that he or she likely committed several federal crimes that day.” — Harvey Silverglate By the way, if you haven’t already, I strongly recommend you read my article on how to encrypt your entire life in less than an hour. But even with HTTPS enabled, ISPs will still know — thanks to their role in actually connecting you to websites themselves — what websites you’re visiting, even if they don’t know what you’re doing there. And just knowing where you’re going — the “metadata” of your web activity — gives ISPs a lot of information they can sell. For example, someone visiting Cars.com may be in the market for a new car, and someone visiting BabyCenter.com may be pregnant. That’s where using a VPN comes in. How VPNs can protect you VPN stands for Virtual Private Network. People have traditionally used VPNs as a way to get around websites that are blocked in their country (for example, Medium is blocked in Malaysia) or to watch movies that aren’t available in certain countries. But VPNs are extremely useful for privacy, too. There are several types of VPN options, with varying degrees of convenience and security. Experts estimate that as many as 90% of VPNs are “hopelessly insecure” and this changes from time to time. So even if you use the tools I recommend here, I recommend you take the time to do your homework. Browser-based VPNs Most VPNs are services that cost money. But the first VPN option I’m going to tell you about is convenient and completely free. Opera is a popular web browser that comes with some excellent privacy features, like a free built-in VPN and a free ad blocker (and as you may know, ads can spy on you). If you just want a secure way to browse the web without ISPs being able to easily snoop on you and sell your data, Opera is a great start. Let’s install and configure it real quick. This takes less than 5 minutes. Before you get started, note that this will only anonymize the things you do within the Opera browser. Also, I’m obligated to point out that even though Opera’s parent company is European, it was recently purchased by a consortium of Chinese tech companies, and there is a non-zero risk that it could be compromised by the Chinese government. Having said that, here’s how to browse securely with Opera: Step #1: Download the Opera browser Step #2: Turn on its ad blocker Step #3: Turn on its VPN Step #4: Install HTTPS Everywhere When you’re done, Opera should look like this: Presto — you can now browse the web with reasonable confidence that your ISPs — or really anyone else —don’t know who you are or what you’re doing. You can even set your VPN to a different country. Here, I’ve set mine to Singapore so websites will think I’m in Singapore. To test this out, I visited ipleak.net and they did indeed think I was in Singapore. Since the internet is complex, and data passes through hundreds of providers through a system of peering and trading traffic, US-based ISPs shouldn’t be able to monitor my traffic when it emerges from Singapore. If you want to take things next level, you can try Tor, which is extremely private, and extremely hard to de-anonymize (though it can be done, as depicted in the TV show Mr. Robot — though it would require incredible resources). Tor’s a bit more work to set up and use, and is slower than using a VPN. If you want to learn more, I have a getting-started guide for Tor here. VPN Services The most common way people get VPNs is through a monthly service. There are a ton of these. Ultimately, you must trust the company running the VPN, because there’s no way to know what they’re doing with your data. As I said, some VPNs are improperly configured, and may leak personally identifying data. Before you buy a VPN, read up on how it compares to others here. Once you buy a VPN, the best way to double check that it’s working properly is to visit ipleak.net while using the VPN. Even though most users of VPNs are companies with remote employees, the NSA will still put you on a list if you purchased a VPN. So I recommend using something anonymous to do so, like a pre-loaded Visa card. (By the way, Bitcoin is not anonymous.) There are dozens of VPN services, and there’s no clear “winner.” I use Private Internet Access which costs about $40 per year and runs on my family’s computers and phones. I also asked people on Twitter which VPNs they were using and got a variety of answers: Routers with built-in VPNs You can purchase a VPN-enabled router. Note that these aren’t specifically designed to protect you from snooping by your ISP. Instead, they’re designed so that companies’ satellite offices can share the same network as their headquarter offices. I haven’t used one before, so I can’t testify to their efficacy. If you happen to have a second residence in a county outside the US, you can just tunnel through that home’s network. Otherwise, you’ll need to configure your router to work with one of the VPN services I mentioned earlier. Some routers are designed to work with VPNs at higher speeds than others. If you want to use a VPN at the router level, and your internet connection is less than 100 mps, this router will probably suffice. Otherwise, you’ll need to pay a bit more for a router like this one. If you don’t trust the router companies, you can modify a router using Tomato USB. It’s an alternative open source Linux-based router firmware that’s compatible with some off-the-shelf routers. Privacy is hard. But it’s worth it. Privacy is a fundamental human right, and has been declared so by the United Nations. Still, many people believe we live in a “post-privacy” era. For example, Mark Zuckerberg claims privacy isn’t that important any more. But look at his actions. He paid $30 million to buy the 4 houses adjacent to his Palo Alto home so he could have more privacy. Other people are just too jaded and shell-shocked by all the data breaches around us to believe that privacy is still worth the fight. But most people who say they don’t care about their own privacy anymore just haven’t really given it much thought. “Arguing that you don’t care about the right to privacy because you have nothing to hide is no different than saying you don’t care about free speech because you have nothing to say.” — Edward Snowden Last week’s US Senate vote is just the latest in a series of events that show how we can’t trust governments to act in the interest of consumers when it comes to their privacy. We need stronger privacy protections enshrined in the law. In the meantime, we’ll just have to look out for ourselves, and educate other people to do the same. I encourage you to read computer security expert Bruce Schneier’s book “Data and Goliath: The Hidden Battles to Collect Your Data and Control Your World.” I learned a ton from it, and am listening to it a second time. Data and Goliath: The Hidden Battles to Capture Your Data and Control Your WorldEdit descriptionamzn.to Thanks for reading, and for taking privacy seriously. If you liked this, click the 💚 below. Follow me and freeCodeCamp for more articles on technology. ", "child": "869_1\t869_2\t869_3\t869_4\t869_5\t869_6\t869_7\t869_8\t869_9\t869_10\t869_11\t869_12\t869_13\t869_14\t869_15\t869_16\t869_17\t869_18\t869_19\t869_20\t869_21\t869_22\t869_23\t869_24\t869_25"}