{"name": "874", "parent": "", "title": "The Last Good Day", "sentences": [{"46dc": "The Last Good Day"}, {"670e": "source"}, {"f214": "You sat on my bed — legs crossed, with your beanie clenched in hand — chest rising, and cheeks turning pink, while we debated politics. I sat on the floor, cradling the IKEA dog plushy you hated, and pushed all your buttons."}, {"64a1": "I was trying to pinpoint the moment when our perfect day turned for the worse, when I realized that I was trying to remember the last time we were happy."}, {"9fa8": "The truth is we were content, and that wasn’t enough."}, {"dc60": "It never is for me."}, {"562c": "They say that children who come from divorce love differently. We accept love that comes in big forms — giant hurricanes of energy that suck and destroy, leaving a wake of chaos for the making up."}, {"a3ca": "You terrified me, with your sure words and quiet actions. You always might."}, {"5dd4": "I’ve spent the last couple years in quiet limbo; head spinning from memories, trying to discern reality from dreams. The timbre of your voice, the warmth of your kisses, the weight of your arm across my shoulders: I try to remember and constantly fall short."}, {"735b": "In the quiet waking moments — the seconds that span when your mind is still dusty with dreams — you are the first full thought thrown up from my insides."}, {"4a67": "I have revisited this moment enough times to rewrite every last detail. From the plaid shirt you wore to the twisting of your fingers, my subconscious reaching… no longer able to tell memory from imagination."}, {"1a56": "I cannot recreate. Only vaguely recall."}, {"7552": "We are lying in bed, laughing. You need to get to class, but I won’t let you go. Wrapped around you like a koala, I pretend to bite you and you poke me, randomly yelling, “sectumsempra!”"}, {"0494": "I sit next to you as you drive down the street. Your eyebrows are furrowed in concentration even as we are driving with nowhere in mind. Your hand blindly reaches over to intertwine our fingers, and I notice your face smoothing out. That moment, it occurred to me that maybe, this is love."}, {"865f": "We are arguing in the hallway and as you angrily storm away, you yell, “I don’t know why I care so much about you when you clearly don’t!” I needed you then. I was just too afraid to admit it."}, {"8f97": "It is the day before I leave for Shanghai. You stare at me with a forlorn look upon your face. You mime words at me, “you rock my world” and I could’ve sworn I felt my heart break. I didn’t respond. You didn’t expect me to. I love you for that."}, {"1550": "These are the moments I will never get again. I remember with a fading clarity. The denseness of your feelings settling into my bones, tethering me, giving me weight."}, {"d8c6": "I want neither to recall nor recreate."}, {"1926": "I want merely to relive."}, {"c47e": "But try as I might, I can’t not create this:"}, {"eded": "Her eyes lighting up as you kneel before her. Your blinding smile as she says yes. The warmth of your arms as you spin her around in a circle. The orchestra of happy that starts up around you both as you create your happily ever after."}, {"c1de": "The notion of “enough” has never jived with me. I have never felt enough or loved enough or had enough. I have never wanted enough. There are no grey areas with me and that was our major point of contention."}, {"a9ae": "You were comfortable with happy. I wasn’t."}, {"8974": "They say that children with divorced parents are incapable of letting go, because we’ve seen what happens when people love each other. Have heard it from our parents — even as one of them is packing up and leaving — that deep down, they still really love each other."}, {"a241": "So we believe that love never dies. That destruction and chaos are a natural part of love."}, {"90c3": "You sat silent on the other side of the world saying the words I dreaded hearing, while I twist my fingers. The irony of this moment is not lost on me. I say the words that I know you want to hear, because I’ll always know you. We laugh when I say, “I’m so happy for you.”"}, {"2818": "We hang up and I wonder why the room feels so empty. This is no destruction, there is no chaos: I wonder why my chest aches and I realize that I want to cuddle that IKEA plushy…"}, {"5e34": "…But he’s taped inside a cardboard box in Vancouver with our memories."}], "content": "The Last Good Day source You sat on my bed — legs crossed, with your beanie clenched in hand — chest rising, and cheeks turning pink, while we debated politics. I sat on the floor, cradling the IKEA dog plushy you hated, and pushed all your buttons. I was trying to pinpoint the moment when our perfect day turned for the worse, when I realized that I was trying to remember the last time we were happy. The truth is we were content, and that wasn’t enough. It never is for me. They say that children who come from divorce love differently. We accept love that comes in big forms — giant hurricanes of energy that suck and destroy, leaving a wake of chaos for the making up. You terrified me, with your sure words and quiet actions. You always might. I’ve spent the last couple years in quiet limbo; head spinning from memories, trying to discern reality from dreams. The timbre of your voice, the warmth of your kisses, the weight of your arm across my shoulders: I try to remember and constantly fall short. In the quiet waking moments — the seconds that span when your mind is still dusty with dreams — you are the first full thought thrown up from my insides. I have revisited this moment enough times to rewrite every last detail. From the plaid shirt you wore to the twisting of your fingers, my subconscious reaching… no longer able to tell memory from imagination. I cannot recreate. Only vaguely recall. We are lying in bed, laughing. You need to get to class, but I won’t let you go. Wrapped around you like a koala, I pretend to bite you and you poke me, randomly yelling, “sectumsempra!” I sit next to you as you drive down the street. Your eyebrows are furrowed in concentration even as we are driving with nowhere in mind. Your hand blindly reaches over to intertwine our fingers, and I notice your face smoothing out. That moment, it occurred to me that maybe, this is love. We are arguing in the hallway and as you angrily storm away, you yell, “I don’t know why I care so much about you when you clearly don’t!” I needed you then. I was just too afraid to admit it. It is the day before I leave for Shanghai. You stare at me with a forlorn look upon your face. You mime words at me, “you rock my world” and I could’ve sworn I felt my heart break. I didn’t respond. You didn’t expect me to. I love you for that. These are the moments I will never get again. I remember with a fading clarity. The denseness of your feelings settling into my bones, tethering me, giving me weight. I want neither to recall nor recreate. I want merely to relive. But try as I might, I can’t not create this: Her eyes lighting up as you kneel before her. Your blinding smile as she says yes. The warmth of your arms as you spin her around in a circle. The orchestra of happy that starts up around you both as you create your happily ever after. The notion of “enough” has never jived with me. I have never felt enough or loved enough or had enough. I have never wanted enough. There are no grey areas with me and that was our major point of contention. You were comfortable with happy. I wasn’t. They say that children with divorced parents are incapable of letting go, because we’ve seen what happens when people love each other. Have heard it from our parents — even as one of them is packing up and leaving — that deep down, they still really love each other. So we believe that love never dies. That destruction and chaos are a natural part of love. You sat silent on the other side of the world saying the words I dreaded hearing, while I twist my fingers. The irony of this moment is not lost on me. I say the words that I know you want to hear, because I’ll always know you. We laugh when I say, “I’m so happy for you.” We hang up and I wonder why the room feels so empty. This is no destruction, there is no chaos: I wonder why my chest aches and I realize that I want to cuddle that IKEA plushy… …But he’s taped inside a cardboard box in Vancouver with our memories. ", "child": "874_1\t874_2\t874_3\t874_4\t874_5\t874_6\t874_7\t874_8874_1\t874_2\t874_3\t874_4\t874_5\t874_6\t874_7\t874_8874_1\t874_2\t874_3\t874_4\t874_5\t874_6\t874_7\t874_8874_1\t874_2\t874_3\t874_4\t874_5\t874_6\t874_7\t874_8874_1\t874_2\t874_3\t874_4\t874_5\t874_6\t874_7\t874_8874_1\t874_2\t874_3\t874_4\t874_5\t874_6\t874_7\t874_8874_1\t874_2\t874_3\t874_4\t874_5\t874_6\t874_7\t874_8874_1\t874_2\t874_3\t874_4\t874_5\t874_6\t874_7\t874_8"}