{"name": "877", "parent": "", "title": "The devil will tear you down,", "sentences": [{"6351": "The devil will tear you down,"}, {"0913": "but he will also build you up."}, {"5e9f": "Everyone knows destruction is the highlight of his playbook. Wreaking havoc and chaos come second nature. When one thinks of the fallen angel, it is almost natural to envision flame and rubble."}, {"dde5": "It’s easy to forget — no — easy to be distracted from the more devious of his tricks. He would like you to miss the construction going on all around you."}, {"aa61": "Construction of false beliefs, false identities and false callings. An elaborate set of half truths designed to keep you from the truth of who you really are and what you were really meant to do."}, {"8dee": "See, that’s it. His greatest work of deception is keeping you distracted and deterred; stumbling through a carefully constructed version of reality that is everything but that which you were called to."}, {"ced5": "Just enough to keep you content, but never quite enough to fulfill and deeply satisfy your soul. The ideas whispered in your ear likely not even inherently wrong much less insidious in nature. They are simply wrong for you."}, {"9d44": "So, be careful. Just because things are not falling down around you does not mean things are perfectly fine."}], "content": "The devil will tear you down, but he will also build you up. Everyone knows destruction is the highlight of his playbook. Wreaking havoc and chaos come second nature. When one thinks of the fallen angel, it is almost natural to envision flame and rubble. It’s easy to forget — no — easy to be distracted from the more devious of his tricks. He would like you to miss the construction going on all around you. Construction of false beliefs, false identities and false callings. An elaborate set of half truths designed to keep you from the truth of who you really are and what you were really meant to do. See, that’s it. His greatest work of deception is keeping you distracted and deterred; stumbling through a carefully constructed version of reality that is everything but that which you were called to. Just enough to keep you content, but never quite enough to fulfill and deeply satisfy your soul. The ideas whispered in your ear likely not even inherently wrong much less insidious in nature. They are simply wrong for you. So, be careful. Just because things are not falling down around you does not mean things are perfectly fine. ", "child": "877_1"}