{"name": "884", "parent": "", "title": "My Heart And Me", "sentences": [{"537c": "My Heart And Me"}, {"86ff": "Photographer Uknown"}, {"a7e9": "I am currently not in possession of my heart. I gave it away. It resides on the other side of the Atlantic Ocean. In return, I hold his heart. There are still moments when I am just stunned by the madness of the situation."}, {"531e": "MutualAssuredDestruction"}, {"bba8": "Madness? This is my life!"}, {"31d3": "I never met this man who holds my heart. Never gazed into his eyes. Never breathed in his scent. Never felt my heart speed up from his touch. The longing ache for these things is the background noise of everyday."}, {"1a47": "Had you told me five years ago I would end up where I am now, I would have laughed in your face. There are things, I was sure, I would never do. Number one among them; something as foolish as falling in love with a man half a world away without ever sharing as much as a kiss."}, {"5549": "With all the ways this could go horribly, devastatingly wrong, something happened I had not seen coming. Since giving up control of my heart to someone conventional wisdom tells me should be a stranger, it has been expanding and growing stronger. There are parts I hardly recognize. Five years younger me would not recognize the woman I am today. She would have a list of reasons — valid reasons, to her way of thinking — why I could not become the woman I am today."}, {"6d41": "Pon Farr"}, {"8297": "He writes to me in the tongue of the enemyni kar’tayli gar darasuumagainst all logicI swoon"}, {"3742": "I’ve copied this from an old notebook. I never really meant to make it public. And for those who are not hardcore geeks it will need some explanation to make sense."}, {"fde5": "The Vulcans are a race from Star Trek. They are known for suppressing all emotions in favor for logic. The Pon Farr is part of their reproductive cycle. Every seven years they become aroused and are no longer in control of their emotions. During that time they are completely irrational. The phrase “ni kar’tayli gar darasuum” means “I love you” in Mando‘a; the primary language spoken by the Mandalorian, a race in Star Wars.The word ‘enemy’ is a hyperbole for the rivalry that exists between the Star Trek and Star Wars fandoms. The poem could be read as flippant, but to me it perfectly summarizes something much bigger at play."}, {"cc87": "As a Trekkie I had been conditioned to look down on Star Wars fans. Any Star Trek fan, regardless of how vocal they are about it, will feel their fandom is far superior to Star Wars. This will go double for The Next Generation fans, who can boast superior actors on top of more social awareness and more noble underlying ideology. With stories like the first interracial kiss on television, and Martin Luther King himself encouraging Nichelle Nichols to keep playing the role of Uhura, can you really blame Trekkies for their smug arrogance? I never thought I could take someone who prefers Star Wars over Star Trek serious."}, {"3480": "He challenges me to look at my convictions. Do they come from a place inside myself, or were they dictated by others? It is strange finding parts of yourself without ever realizing they had been lost. It’s like being tapped on the back and when you look around, someone is holding part of you and asks: “Excuse me, it this yours?” Your first reaction is more startled than happy. And confused because you can’t quite remember where this piece fit in. You have to expand your sense of self in order to include it again."}, {"6ae9": "In the case of Star Wars, I was reminded I have always loved fairy tales. Even modern fairy tales, with sounds in the vacuum of space. And that dismissing them as simple or childish is an unfair, close-minded thing to do. (Despite Disney’s best efforts to ruin them) The only reason I had started dismissing fairy tales, was because I had been paying too much attention to unfair, close-minded people."}, {"da90": "I opened my heart back up for something I had discarded decades ago with the strange notion it was undesirable. As soon as I did that, the void seemed a little smaller. You know that void. It’s that place that feels like someone used to be there and is now gone. I thought that someone was a former loved one. In a way, it’s correct. But that former loved one was me. I had been cutting off pieces of myself to fit into a shape I felt others wanted me to be. The idea was much like cutting a rough diamond in order to reveal its shine. In reality I was simply slicing up my wholeness, leaving a void."}, {"3a66": "I’m not just finding parts of myself I’d lost. There are parts of me I knew were there, but went ignored and neglected. Parts I either didn’t think were worth developing, or didn’t have to courage to develop. Parts I thought were weak, that I tried to cover up and hide. Now my heart is in hands that treat it with more care and kindness I allowed myself to give it. It’s these parts that are now exposed. But instead of the injuries I feared, I feel them growing strong and proud. I am now wondering why I ever tried to hide those away."}, {"e3f9": "Giving away my heart put me in a very vulnerable position. I like to think I was smart about it, but the truth is I got extremely lucky. I gave my heart to a trustworthy man. No matter what sort of precautions you try to take, the only way to find out if that trust is justified is by taking that leap of faith. It was a terrifying gamble which paid off beyond anything I hoped for. The irony is, by the time I decided I would take this gamble he already held my heart. It was just a matter of my mind catching up."}, {"9ab4": "I am aware it can still all go horribly, devastatingly wrong. From the point of view of potential hurt, all this wonderful growth merely raises the stakes. There’s more of me to smash to pieces. Looking at overall odds, we’re much more likely to crash and burn than we are to live happily ever after. I have to believe that somehow we are different. Even if it seems illogical to believe that."}, {"b40d": "Turns out, I would rather not be Vulcan."}], "content": "My Heart And Me Photographer Uknown I am currently not in possession of my heart. I gave it away. It resides on the other side of the Atlantic Ocean. In return, I hold his heart. There are still moments when I am just stunned by the madness of the situation. MutualAssuredDestruction Madness? This is my life! I never met this man who holds my heart. Never gazed into his eyes. Never breathed in his scent. Never felt my heart speed up from his touch. The longing ache for these things is the background noise of everyday. Had you told me five years ago I would end up where I am now, I would have laughed in your face. There are things, I was sure, I would never do. Number one among them; something as foolish as falling in love with a man half a world away without ever sharing as much as a kiss. With all the ways this could go horribly, devastatingly wrong, something happened I had not seen coming. Since giving up control of my heart to someone conventional wisdom tells me should be a stranger, it has been expanding and growing stronger. There are parts I hardly recognize. Five years younger me would not recognize the woman I am today. She would have a list of reasons — valid reasons, to her way of thinking — why I could not become the woman I am today. Pon Farr He writes to me in the tongue of the enemyni kar’tayli gar darasuumagainst all logicI swoon I’ve copied this from an old notebook. I never really meant to make it public. And for those who are not hardcore geeks it will need some explanation to make sense. The Vulcans are a race from Star Trek. They are known for suppressing all emotions in favor for logic. The Pon Farr is part of their reproductive cycle. Every seven years they become aroused and are no longer in control of their emotions. During that time they are completely irrational. The phrase “ni kar’tayli gar darasuum” means “I love you” in Mando‘a; the primary language spoken by the Mandalorian, a race in Star Wars.The word ‘enemy’ is a hyperbole for the rivalry that exists between the Star Trek and Star Wars fandoms. The poem could be read as flippant, but to me it perfectly summarizes something much bigger at play. As a Trekkie I had been conditioned to look down on Star Wars fans. Any Star Trek fan, regardless of how vocal they are about it, will feel their fandom is far superior to Star Wars. This will go double for The Next Generation fans, who can boast superior actors on top of more social awareness and more noble underlying ideology. With stories like the first interracial kiss on television, and Martin Luther King himself encouraging Nichelle Nichols to keep playing the role of Uhura, can you really blame Trekkies for their smug arrogance? I never thought I could take someone who prefers Star Wars over Star Trek serious. He challenges me to look at my convictions. Do they come from a place inside myself, or were they dictated by others? It is strange finding parts of yourself without ever realizing they had been lost. It’s like being tapped on the back and when you look around, someone is holding part of you and asks: “Excuse me, it this yours?” Your first reaction is more startled than happy. And confused because you can’t quite remember where this piece fit in. You have to expand your sense of self in order to include it again. In the case of Star Wars, I was reminded I have always loved fairy tales. Even modern fairy tales, with sounds in the vacuum of space. And that dismissing them as simple or childish is an unfair, close-minded thing to do. (Despite Disney’s best efforts to ruin them) The only reason I had started dismissing fairy tales, was because I had been paying too much attention to unfair, close-minded people. I opened my heart back up for something I had discarded decades ago with the strange notion it was undesirable. As soon as I did that, the void seemed a little smaller. You know that void. It’s that place that feels like someone used to be there and is now gone. I thought that someone was a former loved one. In a way, it’s correct. But that former loved one was me. I had been cutting off pieces of myself to fit into a shape I felt others wanted me to be. The idea was much like cutting a rough diamond in order to reveal its shine. In reality I was simply slicing up my wholeness, leaving a void. I’m not just finding parts of myself I’d lost. There are parts of me I knew were there, but went ignored and neglected. Parts I either didn’t think were worth developing, or didn’t have to courage to develop. Parts I thought were weak, that I tried to cover up and hide. Now my heart is in hands that treat it with more care and kindness I allowed myself to give it. It’s these parts that are now exposed. But instead of the injuries I feared, I feel them growing strong and proud. I am now wondering why I ever tried to hide those away. Giving away my heart put me in a very vulnerable position. I like to think I was smart about it, but the truth is I got extremely lucky. I gave my heart to a trustworthy man. No matter what sort of precautions you try to take, the only way to find out if that trust is justified is by taking that leap of faith. It was a terrifying gamble which paid off beyond anything I hoped for. The irony is, by the time I decided I would take this gamble he already held my heart. It was just a matter of my mind catching up. I am aware it can still all go horribly, devastatingly wrong. From the point of view of potential hurt, all this wonderful growth merely raises the stakes. There’s more of me to smash to pieces. Looking at overall odds, we’re much more likely to crash and burn than we are to live happily ever after. I have to believe that somehow we are different. Even if it seems illogical to believe that. Turns out, I would rather not be Vulcan. ", "child": "884_1\t884_2\t884_3\t884_4\t884_5\t884_6\t884_7\t884_8\t884_9\t884_10\t884_11884_1\t884_2\t884_3\t884_4\t884_5\t884_6\t884_7\t884_8\t884_9\t884_10\t884_11884_1\t884_2\t884_3\t884_4\t884_5\t884_6\t884_7\t884_8\t884_9\t884_10\t884_11"}