{"name": "889", "parent": "", "title": "Real Talk", "sentences": [{"c171": "Real Talk"}, {"abaf": "You know when you hit that threshold — that tipping point where “Fuck You” is burning the tip of your tongue?"}, {"2e40": "And then you stop for a minute (more like lots of minutes across many days, and weeks, and months — possibly years), and you realize that feeling this way is completely unproductive."}, {"e906": "We’re all just traversing this messed up space to the best of our abilities. Whether we’re aware of what ‘our best’ looks like or not. You can’t possibly know my intentions. You’re not the one listening to my internal dialogue. You’ve got your own intentions, your own perspectives, and your own internal dialogue to work with. I won’t pretend to know what any of those are."}, {"0d31": "Quite frankly, I don’t care."}, {"9037": "To suggest that I was disingenuous undermines my character. Do not be short-sighted when you look back. If you take the time to look back carefully, I hope that you’ll recognize that I exerted my efforts in an attempt to build something. But nothing can be built with a faulty foundation — most certainly not a friendship, which requires roots deep enough to withstand the unpredictability of life."}, {"ce76": "We grossly undermine and misunderstand trauma, both within ourselves and in others. In truth, any situation that leaves one feeling overwhelmed and isolated can be considered traumatic, even when those situations are void of any physical harm or legitimate threats. It is a subjective emotional experience to an event in your own life that determines whether or not you are experiencing trauma."}, {"b04a": "When you are enveloped in the pain of trauma, life and life events are distorted by an ever-present cloud of helplessness, a numbness and a disconnect that skews your distant sense of self."}, {"a0aa": "The fact that I have to explain my behaviour is deeply upsetting. I feel a visceral resistance to addressing any aspect of this mess, but I also know that moving from resistance to acceptance requires a constant acknowledgement of each thought related to that internal pull of repulsion. In other words, it’s not about pretending things didn’t happen, and it’s not about trying to just ‘let it go’. Quite the contrary, moving from resistance to acceptance requires the repeated act of sitting with the emotional and mental chaos, meeting each retaliation head on, and giving each thought space to express itself."}, {"08c0": "So I acknowledge that I have made mistakes — I’ve said things, done things, and made choices that do not feel like me. It’s taken me a long time to start differentiating what it means when these things do not feel like me. I have lived in such a disconnect and misalignment that I am only now starting to learn what me and not me feel like."}, {"3a82": "I’ve come to learn what feels like me in the quiet, solitary moments in which I’ve organically stumbled upon feelings of sureness and the incomparable contentedness and wellness that accompanies these experiences. When I find the right words, whether in my writing, in my conversations, or simply in my thoughts, and my body is left shivering with an unexplained warmth, I recognize that I do have an authentic voice inside this shell."}, {"30c4": "I am the only one who will ever know my own intentions. I have my own demons to wrestle and I am searching for my own awareness. It is not selfish of me to want to focus on my internal journey. It is not selfish of me to make mistakes. It is not strange or unusual or uncommon to act in ways that do not reflect who we know ourselves to be."}, {"9b52": "I am embarrassed, hurt and ashamed, but I know that sinking from the weight of this will not serve me well. I do not need your judging eyes or the hate that you radiate to remind me of how awful it feels to live a life so far removed from authenticity."}, {"308d": "Since I can’t take anything back and living in the past will only lead to greater depression, I’m choosing, from a place of authenticity, to move forward. As I continue to explore the deeper layers of myself, I continue to recognize why I act the way I do and why I fail to act in the ways that reflect my authentic self."}, {"9623": "In light of the honesty of my words, I’ll admit that it is hard not to hate you right now. It is hard not to jump up on a table and profess a deep apology for my behaviour at a time when my sense of self was skewed and my experience of life was distorted. I was (am) in pain. Pain is unpleasant, and I don’t know about you, but I’ll do just about anything I can to reduce pain, especially when that pain is attached to the very deepest parts of myself — the parts that I’m already too afraid to look at clearly."}, {"0971": "I am sorry for the distress, pain, and confusion my words, choices, and behaviour have caused you. I hope that one day you might be able to realize that the way I acted does not represent who I am — those words, choices and behaviours represent the very worst of me, and are in no way reflective of person I am when I am living authentically."}], "content": "Real Talk You know when you hit that threshold — that tipping point where “Fuck You” is burning the tip of your tongue? And then you stop for a minute (more like lots of minutes across many days, and weeks, and months — possibly years), and you realize that feeling this way is completely unproductive. We’re all just traversing this messed up space to the best of our abilities. Whether we’re aware of what ‘our best’ looks like or not. You can’t possibly know my intentions. You’re not the one listening to my internal dialogue. You’ve got your own intentions, your own perspectives, and your own internal dialogue to work with. I won’t pretend to know what any of those are. Quite frankly, I don’t care. To suggest that I was disingenuous undermines my character. Do not be short-sighted when you look back. If you take the time to look back carefully, I hope that you’ll recognize that I exerted my efforts in an attempt to build something. But nothing can be built with a faulty foundation — most certainly not a friendship, which requires roots deep enough to withstand the unpredictability of life. We grossly undermine and misunderstand trauma, both within ourselves and in others. In truth, any situation that leaves one feeling overwhelmed and isolated can be considered traumatic, even when those situations are void of any physical harm or legitimate threats. It is a subjective emotional experience to an event in your own life that determines whether or not you are experiencing trauma. When you are enveloped in the pain of trauma, life and life events are distorted by an ever-present cloud of helplessness, a numbness and a disconnect that skews your distant sense of self. The fact that I have to explain my behaviour is deeply upsetting. I feel a visceral resistance to addressing any aspect of this mess, but I also know that moving from resistance to acceptance requires a constant acknowledgement of each thought related to that internal pull of repulsion. In other words, it’s not about pretending things didn’t happen, and it’s not about trying to just ‘let it go’. Quite the contrary, moving from resistance to acceptance requires the repeated act of sitting with the emotional and mental chaos, meeting each retaliation head on, and giving each thought space to express itself. So I acknowledge that I have made mistakes — I’ve said things, done things, and made choices that do not feel like me. It’s taken me a long time to start differentiating what it means when these things do not feel like me. I have lived in such a disconnect and misalignment that I am only now starting to learn what me and not me feel like. I’ve come to learn what feels like me in the quiet, solitary moments in which I’ve organically stumbled upon feelings of sureness and the incomparable contentedness and wellness that accompanies these experiences. When I find the right words, whether in my writing, in my conversations, or simply in my thoughts, and my body is left shivering with an unexplained warmth, I recognize that I do have an authentic voice inside this shell. I am the only one who will ever know my own intentions. I have my own demons to wrestle and I am searching for my own awareness. It is not selfish of me to want to focus on my internal journey. It is not selfish of me to make mistakes. It is not strange or unusual or uncommon to act in ways that do not reflect who we know ourselves to be. I am embarrassed, hurt and ashamed, but I know that sinking from the weight of this will not serve me well. I do not need your judging eyes or the hate that you radiate to remind me of how awful it feels to live a life so far removed from authenticity. Since I can’t take anything back and living in the past will only lead to greater depression, I’m choosing, from a place of authenticity, to move forward. As I continue to explore the deeper layers of myself, I continue to recognize why I act the way I do and why I fail to act in the ways that reflect my authentic self. In light of the honesty of my words, I’ll admit that it is hard not to hate you right now. It is hard not to jump up on a table and profess a deep apology for my behaviour at a time when my sense of self was skewed and my experience of life was distorted. I was (am) in pain. Pain is unpleasant, and I don’t know about you, but I’ll do just about anything I can to reduce pain, especially when that pain is attached to the very deepest parts of myself — the parts that I’m already too afraid to look at clearly. I am sorry for the distress, pain, and confusion my words, choices, and behaviour have caused you. I hope that one day you might be able to realize that the way I acted does not represent who I am — those words, choices and behaviours represent the very worst of me, and are in no way reflective of person I am when I am living authentically. ", "child": "889_1\t889_2\t889_3\t889_4\t889_5\t889_6\t889_7\t889_8\t889_9\t889_10\t889_11\t889_12"}