{"name": "893", "parent": "", "title": "Pre-Op", "sentences": [{"7e1b": "Pre-Op"}, {"0be1": "The fascinating world of the inner and middle ear"}, {"e2e5": "I go back to the V.A. this morning for a pre-op appointment. I have no idea what that entails. I just know they want me there at 7:30 a.m. The operation will be in eleven days, on the 21st of the month. The operation I’ll be getting is two-fold — they’ll be going in through my ear to take a piece of cartilege from somewhere on my ear, and placing it back behind my ear drum, to help keep my ear drum from collapsing. The other procedure they’ll be doing is going in through my nose with a balloon, all the way back to the eustachean tube, where they’ll inflate the balloon, then pull it back out. That, I believe, is to help open up my eustachean tube, to hopefully help it to do a better job with pressure regulation in there."}, {"6739": "I was not too happy about getting these procedures done, when Dr. Hoa first presented them to me. However, after a couple of more vertigo episodes, following my last flight to Minneapolis and back, and all the vestibular migraines I’ve experienced in the past couple weeks, I’m ready!"}, {"14e8": "I believe Dr. Hoa thinks this will alleviate a lot of these symptoms I’ve been experiencing. So far, he’s been pretty much right on the money with everything he’s done (or not done), so if he’s suggesting it, I’m doing it."}, {"bc9a": "That’s the other thing I like about him. He doesn’t say, “We have to do this, or else…” like some doctors do to you. He puts it out there in the form of a suggestion, or almost a question, e.g. “I’m thinking we could do this, which will help with this. What do you think?” I think if you’re for it, I’m for it."}, {"9abe": "He then cautions about the risks — a one percent chance I lose my hearing altogether in that ear, and a one percent chance that the tympanoplasty (the cartilege one) could damage my facial nerve. I like those odds, and am willing to take that risk."}, {"6f79": "What’s going on now is still not optimal health, and messes with my quality of living. This is a chance to improve it, so I’ll take the chance. I don’t like the alternative. If the worst happens, well, at least I tried. For me, doing nothing is not an option."}, {"c810": "I’m really grateful that I have access to the V.A. to get all of this done. I’ve said it before and I’ll say it again. My experience there, these past couple of years, does not square with everything you hear on the news. I have had nothing but quality care throughout this journey through the inner ear. The V.A. is okay, in my book. Plus, I can’t even imagine what all of this would have cost, if I had to do it on my own. I know my private insurance wouldn’t even cover my hearing aid. They only would have covered a small portion of the rest of this."}, {"fe17": "The way it works is, the V.A. submits the bill to them first, they pick up whatever part of it they will, then the V.A. picks up the rest. The only thing I’ve had to come out of pocket for is $25.00 a quarter, my co-pay for the medication I’m on for the migraines."}, {"3e8c": "I’m also grateful that I still have a place where I can write about things like this, and have people who care enough to read about it, and offer support. This means a lot to me."}, {"7158": "I know I sometimes pine for Cowbird, and write about things not being the same without it, and that is true, I do miss it; but on the other hand, I do appreciate and value what we have going on Medium, with the Story Hall, and building a new community, here. It’s a real comfort to have this, and to be here with all of you."}, {"89a4": "It’s just going through them changes we all gots to go through. We don’t have to like it, but if we’re smart, we keep moving through them, and know that all will be well, in fact, ultimately, all will be better, because things always change for the better, when we let them. They really do. We just have to stay awake, be a part of the change, and make it ours. Participate in the process, and trust that what we need will be there, is actually right here, right now. We just have to trust."}, {"8fbc": "Well, that’s about it for the morning health update/pep talk. Time to get ready to drive across the district to get to the V.A."}], "content": "Pre-Op The fascinating world of the inner and middle ear I go back to the V.A. this morning for a pre-op appointment. I have no idea what that entails. I just know they want me there at 7:30 a.m. The operation will be in eleven days, on the 21st of the month. The operation I’ll be getting is two-fold — they’ll be going in through my ear to take a piece of cartilege from somewhere on my ear, and placing it back behind my ear drum, to help keep my ear drum from collapsing. The other procedure they’ll be doing is going in through my nose with a balloon, all the way back to the eustachean tube, where they’ll inflate the balloon, then pull it back out. That, I believe, is to help open up my eustachean tube, to hopefully help it to do a better job with pressure regulation in there. I was not too happy about getting these procedures done, when Dr. Hoa first presented them to me. However, after a couple of more vertigo episodes, following my last flight to Minneapolis and back, and all the vestibular migraines I’ve experienced in the past couple weeks, I’m ready! I believe Dr. Hoa thinks this will alleviate a lot of these symptoms I’ve been experiencing. So far, he’s been pretty much right on the money with everything he’s done (or not done), so if he’s suggesting it, I’m doing it. That’s the other thing I like about him. He doesn’t say, “We have to do this, or else…” like some doctors do to you. He puts it out there in the form of a suggestion, or almost a question, e.g. “I’m thinking we could do this, which will help with this. What do you think?” I think if you’re for it, I’m for it. He then cautions about the risks — a one percent chance I lose my hearing altogether in that ear, and a one percent chance that the tympanoplasty (the cartilege one) could damage my facial nerve. I like those odds, and am willing to take that risk. What’s going on now is still not optimal health, and messes with my quality of living. This is a chance to improve it, so I’ll take the chance. I don’t like the alternative. If the worst happens, well, at least I tried. For me, doing nothing is not an option. I’m really grateful that I have access to the V.A. to get all of this done. I’ve said it before and I’ll say it again. My experience there, these past couple of years, does not square with everything you hear on the news. I have had nothing but quality care throughout this journey through the inner ear. The V.A. is okay, in my book. Plus, I can’t even imagine what all of this would have cost, if I had to do it on my own. I know my private insurance wouldn’t even cover my hearing aid. They only would have covered a small portion of the rest of this. The way it works is, the V.A. submits the bill to them first, they pick up whatever part of it they will, then the V.A. picks up the rest. The only thing I’ve had to come out of pocket for is $25.00 a quarter, my co-pay for the medication I’m on for the migraines. I’m also grateful that I still have a place where I can write about things like this, and have people who care enough to read about it, and offer support. This means a lot to me. I know I sometimes pine for Cowbird, and write about things not being the same without it, and that is true, I do miss it; but on the other hand, I do appreciate and value what we have going on Medium, with the Story Hall, and building a new community, here. It’s a real comfort to have this, and to be here with all of you. It’s just going through them changes we all gots to go through. We don’t have to like it, but if we’re smart, we keep moving through them, and know that all will be well, in fact, ultimately, all will be better, because things always change for the better, when we let them. They really do. We just have to stay awake, be a part of the change, and make it ours. Participate in the process, and trust that what we need will be there, is actually right here, right now. We just have to trust. Well, that’s about it for the morning health update/pep talk. Time to get ready to drive across the district to get to the V.A. ", "child": "893_1\t893_2"}