{"name": "896", "parent": "", "title": "Nous ne sommes pas des numéros", "sentences": [{"18f6": "Nous ne sommes pas des numéros"}, {"0c4b": "Il est 18h, il fait nuit, nous sommes en Thaïlande sur une île. Ma carte bancaire a été bloquée il y a deux semaines suite à une utilisation frauduleuse (probablement piratée sur un réseau wifi en carton, je n’ai pas la 4G ici donc obligé de faire des paiements en ligne sur des réseaux pas fréquentables), nous vivons donc sur la carte de Flavie, mon amie. En Thaïlande, pas la peine d’espérer pouvoir payer par carte bancaire : c’est le royaume du cash, tout ou presque se paie en liquide. Autrement dit, ça fait deux semaines que nous retirons pas mal d’argent sur sa carte."}, {"db19": "Il nous reste un peu de liquide (de quoi tenir une journée), mais nous anticipons et allons à un ATM retirer de quoi payer les billets de bus pour retourner à Bangkok choper notre vol retour. Première tentative : le retrait est refusé. Je vois le message “Insufficient funds” sur l’écran, mais nous nous disons que c’est peut être la machine qui déconne : il y a largement de quoi retirer sur le compte. Nous tentons sur un deuxième : même erreur. Sur un troisième : idem. Nous essayons de retirer de plus petites sommes, toujours pareil."}, {"7ebf": "La tension monte d’un cran. Quand vous êtes au milieu de nulle part, la nuit, et sans argent, je vous assure que tout d’un coup tout prend une autre dimension. Je ne comprends pas : nous avions prévenu notre banque, la Caisse d’Epargne, que nous ne tournions plus que sur une seule carte bancaire suite au bloquage de la mienne. Avant le voyage, nous leur avions envoyé un email pour nous assurer que nous n’aurions pas de souci pour retirer à l’étranger, et il y a trois jours mon amie avant renvoyé un email à notre conseillère lui demandant de vérifier que nous étions encore dans les clous. Email resté sans réponse."}, {"9d63": "Ici, les coups de fil en France sont hors de prix : 2,30€ par minute d’appel, et 1€ par minute pour les appels reçus. Pas le choix, je dois appeler ma conseillère, on ne peut pas rester comme ça. S’en suit une scène hallucinante."}, {"ef46": "Premier coup de fil, répondeur. Je laisse un message et attends dix minutes. Je rappelle, l’accueil de mon agence cette fois. Je tombe sur ma conseillère, et lui explique la situation (en lui précisant bien que je paye très cher le coup de téléphone et que je vais donc aller à l’essentiel). Je lui demande d’augmenter le plafond de retrait de la carte de mon amie temporairement, afin que nous puissions au moins payer notre bus pour choper notre avion. Le compte est largement provisionné, il n’y a que le problème du plafond de retrait. Sa première réponse (sans même m’avoir écouté jusqu’au bout) est cinglante :"}, {"6e96": "“Monsieur, ce n’est pas possible, nous ne pouvons plus modifier votre plafond temporairement”."}, {"fc04": "Je reste bouche bée. Depuis quand changer une putain de variable n’est pas possible ? Je gueule. Lui ré-explique la situation et le fait qu’elle était prévenue, et que si elle ne fait rien nous ne pouvons même pas rentrer chez nous."}, {"3f4f": "“Monsieur, si vous vouliez être tranquille, il fallait prendre une carte Gold”"}, {"1de5": "Voilà ce qu’elle m’a répondu. Après un email envoyé deux semaines avant le voyage, après des échanges par email à ce sujet lors du blocage de ma carte, après un second mail envoyé afin justement d’anticiper cette situation, et alors qu’elle sait qu’à ce moment précis me dire ça ne résoudra absolument rien, c’est la seule chose qu’elle est capable de me répondre. Je ne peux m’empêcher de l’imaginer, le cul posé dans son petit fauteuil confortable, agacée par mon ton un peu sec, à attendre que je raccroche le plus vite possible afin de passer au client suivant. Je suis ébahi."}, {"ed58": "Moi, je travaille dans une boite pour qui le support client est fondamental. Je travaille dans une boite qui ne laissera jamais un de ses clients dans la merde et remuera ciel et terre pour arriver à le débloquer. C’est déjà arrivé, et ça fait partie de notre ADN : nous aimons nos utilisateurs et clients, et nous faisons preuve d’empathie. Parce qu’ils le méritent, parce que ça nous semble naturel, parce que nous sommes des êtres humains. J’y pense à ce moment précis, en imaginant mes collègues s’ils avaient été confrontés à une situation de ce type, et à quel point ils se seraient défoncés pour la résoudre."}, {"dd63": "Mais voilà, pour la Caisse d’Epargne, pour cette chargée de clientèle, je suis juste un numéro. Un numéro qui, à ce moment précis, pose problème. Et ce genre de problème, ça les fait chier parce que ça leur fait perdre du temps, et que ça ne rapporte pas d’argent."}, {"e66b": "Après des échanges un peu secs, elle finit par me dire qu’elle va demander à son responsable l’autorisation “cet après-midi”, mais que ça nous coûtera 18 euros. Dix-huit putains d’euros, pour une opération qui va prendre 5 secondes. Et il faut encore attendre, parce que bon, faut pas déconner, c’est l’heure de la pause déjeuner en France."}, {"e82c": "Trois longues heures après (il est minuit passé en Thaïlande), elle me rappellera pour me dire que c’est bon."}, {"722e": "Messieurs dames des banques, et de toutes les entreprises pour qui le service client n’est qu’une charge, je n’ai pas l’impression que vous mesuriez ce qui est en train de se passer, et à quel point vous vous plantez : les gens ne veulent pas être des numéros. Les gens veulent être respectés, considérés, et aidés lorsqu’ils en ont besoin en l’échange de l’argent qu’ils vous donnent. Ça ne peut pas aller que dans un sens."}, {"5db6": "Ça, toute une génération d’entrepreneurs l’a compris, et je suis persuadé que cette génération va vous bouffer."}, {"a537": "En rentrant en France, je me suis créé un compte sur N26 (qui venait de ré-ouvrir les inscriptions en dehors de l’Allemagne). Ca m’a pris 10 minutes, vérification de mon identité comprise pour obtenir mon RIB et commander une carte bancaire gratuitement. Et vous savez quoi ?"}, {"8616": "Sur N26, pour changer le plafond de retrait, il suffit de bouger un curseur sur leur application. Voilà."}, {"3cf4": "Au final, après plusieurs mails envoyés, deux tweets, un message Facebook, et un déplacement en agence, les 18 euros de frais vont nous être remboursés. Mais évidemment pas les 40 euros de facture de téléphone, il ne faut pas pousser."}], "content": "Nous ne sommes pas des numéros Il est 18h, il fait nuit, nous sommes en Thaïlande sur une île. Ma carte bancaire a été bloquée il y a deux semaines suite à une utilisation frauduleuse (probablement piratée sur un réseau wifi en carton, je n’ai pas la 4G ici donc obligé de faire des paiements en ligne sur des réseaux pas fréquentables), nous vivons donc sur la carte de Flavie, mon amie. En Thaïlande, pas la peine d’espérer pouvoir payer par carte bancaire : c’est le royaume du cash, tout ou presque se paie en liquide. Autrement dit, ça fait deux semaines que nous retirons pas mal d’argent sur sa carte. Il nous reste un peu de liquide (de quoi tenir une journée), mais nous anticipons et allons à un ATM retirer de quoi payer les billets de bus pour retourner à Bangkok choper notre vol retour. Première tentative : le retrait est refusé. Je vois le message “Insufficient funds” sur l’écran, mais nous nous disons que c’est peut être la machine qui déconne : il y a largement de quoi retirer sur le compte. Nous tentons sur un deuxième : même erreur. Sur un troisième : idem. Nous essayons de retirer de plus petites sommes, toujours pareil. La tension monte d’un cran. Quand vous êtes au milieu de nulle part, la nuit, et sans argent, je vous assure que tout d’un coup tout prend une autre dimension. Je ne comprends pas : nous avions prévenu notre banque, la Caisse d’Epargne, que nous ne tournions plus que sur une seule carte bancaire suite au bloquage de la mienne. Avant le voyage, nous leur avions envoyé un email pour nous assurer que nous n’aurions pas de souci pour retirer à l’étranger, et il y a trois jours mon amie avant renvoyé un email à notre conseillère lui demandant de vérifier que nous étions encore dans les clous. Email resté sans réponse. Ici, les coups de fil en France sont hors de prix : 2,30€ par minute d’appel, et 1€ par minute pour les appels reçus. Pas le choix, je dois appeler ma conseillère, on ne peut pas rester comme ça. S’en suit une scène hallucinante. Premier coup de fil, répondeur. Je laisse un message et attends dix minutes. Je rappelle, l’accueil de mon agence cette fois. Je tombe sur ma conseillère, et lui explique la situation (en lui précisant bien que je paye très cher le coup de téléphone et que je vais donc aller à l’essentiel). Je lui demande d’augmenter le plafond de retrait de la carte de mon amie temporairement, afin que nous puissions au moins payer notre bus pour choper notre avion. Le compte est largement provisionné, il n’y a que le problème du plafond de retrait. Sa première réponse (sans même m’avoir écouté jusqu’au bout) est cinglante : “Monsieur, ce n’est pas possible, nous ne pouvons plus modifier votre plafond temporairement”. Je reste bouche bée. Depuis quand changer une putain de variable n’est pas possible ? Je gueule. Lui ré-explique la situation et le fait qu’elle était prévenue, et que si elle ne fait rien nous ne pouvons même pas rentrer chez nous. “Monsieur, si vous vouliez être tranquille, il fallait prendre une carte Gold” Voilà ce qu’elle m’a répondu. Après un email envoyé deux semaines avant le voyage, après des échanges par email à ce sujet lors du blocage de ma carte, après un second mail envoyé afin justement d’anticiper cette situation, et alors qu’elle sait qu’à ce moment précis me dire ça ne résoudra absolument rien, c’est la seule chose qu’elle est capable de me répondre. Je ne peux m’empêcher de l’imaginer, le cul posé dans son petit fauteuil confortable, agacée par mon ton un peu sec, à attendre que je raccroche le plus vite possible afin de passer au client suivant. Je suis ébahi. Moi, je travaille dans une boite pour qui le support client est fondamental. Je travaille dans une boite qui ne laissera jamais un de ses clients dans la merde et remuera ciel et terre pour arriver à le débloquer. C’est déjà arrivé, et ça fait partie de notre ADN : nous aimons nos utilisateurs et clients, et nous faisons preuve d’empathie. Parce qu’ils le méritent, parce que ça nous semble naturel, parce que nous sommes des êtres humains. J’y pense à ce moment précis, en imaginant mes collègues s’ils avaient été confrontés à une situation de ce type, et à quel point ils se seraient défoncés pour la résoudre. Mais voilà, pour la Caisse d’Epargne, pour cette chargée de clientèle, je suis juste un numéro. Un numéro qui, à ce moment précis, pose problème. Et ce genre de problème, ça les fait chier parce que ça leur fait perdre du temps, et que ça ne rapporte pas d’argent. Après des échanges un peu secs, elle finit par me dire qu’elle va demander à son responsable l’autorisation “cet après-midi”, mais que ça nous coûtera 18 euros. Dix-huit putains d’euros, pour une opération qui va prendre 5 secondes. Et il faut encore attendre, parce que bon, faut pas déconner, c’est l’heure de la pause déjeuner en France. Trois longues heures après (il est minuit passé en Thaïlande), elle me rappellera pour me dire que c’est bon. Messieurs dames des banques, et de toutes les entreprises pour qui le service client n’est qu’une charge, je n’ai pas l’impression que vous mesuriez ce qui est en train de se passer, et à quel point vous vous plantez : les gens ne veulent pas être des numéros. Les gens veulent être respectés, considérés, et aidés lorsqu’ils en ont besoin en l’échange de l’argent qu’ils vous donnent. Ça ne peut pas aller que dans un sens. Ça, toute une génération d’entrepreneurs l’a compris, et je suis persuadé que cette génération va vous bouffer. En rentrant en France, je me suis créé un compte sur N26 (qui venait de ré-ouvrir les inscriptions en dehors de l’Allemagne). Ca m’a pris 10 minutes, vérification de mon identité comprise pour obtenir mon RIB et commander une carte bancaire gratuitement. Et vous savez quoi ? Sur N26, pour changer le plafond de retrait, il suffit de bouger un curseur sur leur application. Voilà. Au final, après plusieurs mails envoyés, deux tweets, un message Facebook, et un déplacement en agence, les 18 euros de frais vont nous être remboursés. Mais évidemment pas les 40 euros de facture de téléphone, il ne faut pas pousser. ", "child": "896_1"}