{"name": "904", "parent": "", "title": "3 Shortcuts to Success Every High Achiever Uses (That You Don’t)", "sentences": [{"5a53": "3 Shortcuts to Success Every High Achiever Uses (That You Don’t)"}, {"0b54": "Yes, there is a shortcut to success, and it’s not working harder — it’s working smarter."}, {"b42d": "The other day, someone commented on a Facebook post of mine in which I promised them a “shortcut” to success. They said, there’s no such thing. That made me wonder."}, {"3c86": "Really? There are no shortcuts in life? Only the hardest working people in the world win? It’s a popular belief, which should be reason enough to question its validity. But let’s explore this idea."}, {"69cf": "Let’s say there are no shortcuts and everyone is as successful as they absolutely deserve to be. Does that mean Bill Gates, who makes about $11 billion per year (or $1.3 million per hour!) works 54,000 times harder than the average American worker who earns $50,000 per year?"}, {"ae5b": "How is that even possible?"}, {"adde": "Look. We all want to believe hard work pays off. And it does. But at a certain point, you can’t work any harder. You have no more time than anyone else. So what do you do? You have to learn how to work smarter. And that means learning from someone who’s already been there."}, {"724a": "1. Don’t Go It Alone — Get a Guide"}, {"0d80": "“Tell me and I forget, teach me and I may remember, involve me and I learn.” — Benjamin Franklin"}, {"2f18": "For years as a writer, I struggled to get noticed. I blogged and nobody cared, tried to write books no one would read, and failed to motivate myself to work. I wanted a publisher but didn’t know anyone in the industry and didn’t have any readers to show for my work. I was stuck."}, {"ec4f": "What I needed was someone to show me another path. It didn’t have to be a shortcut. I was just tired of the long road to success — because it was leading nowhere — desperately wanted to know what was missing."}, {"4351": "In any great story, there is a point in the journey when the hero meets an obstacle he cannot overcome. This is the moment when the guide arrives. This is the essence of Joseph Campbell’s Hero’s Journey: you cannot succeed without someone wiser to show you the way. Frodo needed Gandalf. Luke needed Obi-wan. And you and I need a mentor."}, {"1ca6": "Sure enough, in my own journey, that’s what happened. I met a handful of people who acted as guides in helping me become an author, speaker, and entrepreneur. My dream became a reality within a matter of 18 months. But this wasn’t because I hustled — it’s because I found a guide."}, {"e342": "“I didn’t succeed because I hustled any harder. I succeeded because I found a guide.”"}, {"d3da": "And you know what? I didn’t work any harder in those 18 months than I did in the previous seven years. But I did work smarter — not because I was any smarter, but because someone showed me a better way. I met the right people, connected with the right networks, and practiced my craft in the right way. In other words, I found a shortcut."}, {"100b": "But maybe you don’t like thinking of success this way. I certainly don’t. It’s embarrassing to admit I got a little lucky, that I was in the right place at the right time, that it wasn’t just about the hustle. But that’s the truth. And I think we need to acknowledge this reality."}, {"486b": "2. Don’t Reinvent the Wheel — Learn from Others’ Experiences"}, {"c203": "“True education does not consist merely in the acquiring of a few facts of science, history, literature, or art, but in thedevelopment of character.” ―David O. McKay"}, {"a9bb": "How do you find a guide, or in today’s terms, a mentor? It’s not as easy as we’d like."}, {"cbd9": "First of all, mentors tend to be busy people. So getting in front of one will take work. People move around so much these days, and so many things, including our careers, are constantly changing. It stands to reason, then, that your mentor will not just be one person, but a team of people."}, {"c3e5": "In my book, The Art of Work, I call this an “accidental apprenticeship.” The idea here is that if you pay attention to your life and the people who are in it, you will find there are those around you right now whom you can learn from. In that sense, the best mentor is the one that’s right in front of you."}, {"93f3": "“The best mentor is the one that’s right in front of you.”"}, {"893d": "Still, you’ll want to be intentional about getting into relationship with this person. So there are a few steps I recommend following that have worked well for me and that I’ve seen others emulate, as well:"}, {"bc2b": "Make your first ask a small one. In other words, don’t lead with, “Will you mentor me?” Instead, ask for a few minutes of their time, offer to buy them lunch/coffee/whatever."}, {"76a5": "Make it all about them. Ask them to tell their story. Ask specific questions about choices they made in their own success journey and why. In other words, flatter them to death. Nobody is immune to this kind of treatment, and it certainly beats the awkward alternative. Come prepared with questions, and try to talk as little as possible. If you show up informed and interested, you will be both engaging and memorable."}, {"20e5": "Take notes. When you meet with this person, write down everything they say. Honor their wisdom by capturing as much of it as possible. I recommend using a notebook and pen over a phone, just so that it’s clear you’re not checking your email or texting your buddies."}, {"3d5f": "Follow up. This is perhaps the most important and most often overlooked secret to getting into relationship with influencers who can eventually become part of your team of mentors. I meet with a lot of people and even tell them how important this is and still see on average about 80% of people never follow up. What I mean by this is a simple thank-you email for the person’s time, or even better: a copy of the notes you took to show that you really did listen and take to heart their wisdom."}, {"15b1": "Become a case study. Hands down, this is the best thing you can do to earn the attention of an influencer. And if you do this consistently over time, you will get people interested in mentoring you. Take some piece of advice this person has given you (or published in a book, blog post, etc.) and apply it. Demonstrate that this stuff works and tell the world about it. The reason this works is fairly obvious: you’re making the mentor look good."}, {"9139": "Again, this goes back to making it about them. Don’t offer empty flattery; just show that you’re someone worth investing in. Do this enough times, and people will be lining up to give you their time, attention, and ideas. Because the truth is nearly everyone wants to help someone who is going places, so they can feel responsible for that person’s success."}, {"f9d2": "For more on this, check out this article: How to Find a Mentor in 10 Not-so-easy Steps."}, {"add1": "3. Don’t Succumb to Scarcity — Embrace Abundance"}, {"3afe": "“True success is overcoming the fear of being unsuccessful.” — Paul Sweeney"}, {"f51a": "My friend Mary told me when she was first starting out as a writer, she asked an author out to lunch. “How do you get published?” she asked. The person wouldn’t tell her. She said those were her secrets and that Mary would have to find out for herself."}, {"3593": "That day, Mary vowed that if she ever made it as a writer, she’d share everything she learned with other aspiring authors. A few years later, I called her asking for advice, and she made good on her promise."}, {"1c4f": "Shawn Coyne, long-time New York editor, told me a similar story. Back in the day, nobody in publishing shared anything. There were no guidebooks on how to be an editor. He had to figure it out all on his own. Once he did, instead of hoarding his knowledge, he decided to share it in a book, blog, and podcast."}, {"9561": "This refusal to succumb to the scarcity mindset changes everything. When we let go of our perceived scarcity and embrace our actual abundance, it changes so many things:"}, {"5254": "It can feel a little risky to embrace this mindset, this idea that there are guides out there who will help you and opportunities for success yet to be uncovered. But it is a much better way to live than to assume the alternative, that everyone is out to get you and there is no way you’ll succeed."}, {"07a0": "Once you do experience this abundance, you will have an opportunity to help others, which is one of the greatest rewards of success."}, {"8174": "This is why I feel so responsible for helping other writers make their own journey towards getting published. Of course, I tell them it will take hard work. But I also teach them the rules of the game and how to improve their chances of success."}, {"2404": "You can’t just work harder. You have to work smarter. Stop trying to manage your time, as my friend Rory Vaden says, and instead learn how to multiply it.Finding the right guides to help you is an integral part of that process."}, {"d8dd": "“Don’t manage time. Multiply it.” — Rory Vaden"}, {"4fff": "Is This Really How It Works?"}, {"928b": "I realize this may come off as manipulative or even sound a little unsavory. So allow me to address a few potential objections:"}, {"5772": "Objection #1: Don’t influencers just want to help people out of the kindness of their hearts?"}, {"cfd1": "Well, maybe. But they’re busy. And so when push comes to shove, they’re going to invest in people with promise, not takers who seem to make everything about themselves. Your best bet is to be remembered as the ambitious person with lots of questions who was eager to learn, not the know-it-all who was more interested in herself than the person with experience."}, {"a1a7": "Objection #2: Are mentors so egotistical that the whole thing has to be about them?"}, {"42e4": "No, they’re probably not all ego. But we all love to feel important and valued once in a while. And when seeking someone’s help or advice, appeal to this side of them, not their more noble generous side. As you earn their trust, you will see more of this side. But in the beginning, assume they are only interested in helping themselves. And make it worth their while. I’m sure many influencers are very kind and generous people. But it’s better to lead with humility than arrogance."}, {"764a": "Objection #3: Do I have to be so strategic?"}, {"8ebe": "Can relationship be an end in itself, and not a means to get something out of people? Of course, relationship can be an end in itself. But the truth is most of us, whether we admit it or not, want something out of a relationship. And that something could just be love or acceptance or maybe even guidance. Just because you want something from someone doesn’t necessarily cheapen how you approach them."}, {"7c58": "In that regard, yes, I do think you have to be strategic. Many of us are extremely busy. So if you don’t make intentional space for people to guide you, then you will likely drift through life, disappointed and disillusioned as you watch others succeed in things you wish you could achieve."}, {"9c3a": "My advice? Don’t be so strategic it stifles the relationship. But be intentional with your time and focus it on those who will give you a return on your investment. I guarantee you this is how your would-be mentors are thinking."}, {"ea2d": "Here’s What It All Boils Down to"}, {"ccfe": "“Success is simple. Do what’s right, the right way, at the right time.” — Arnold H. Glasow"}, {"abae": "So how does this work? Well, let’s recap the above in a few important lessons to remember:"}, {"3d90": "Lesson #1: You can get where you want faster if you follow in someone else’s footsteps."}, {"d3a1": "Find a guide or mentor you can learn from and emulate, even from afar. This is the difference between those who continuously struggle and those who find a faster way to succeed. Humble yourself and trust that there are those out there who want to help you."}, {"9c23": "Lesson #2: Learn from other people’s experiences to grow your own capacity."}, {"a03d": "In other words, don’t waste years trying to figure things out. Instead, sacrifice time and money to accelerate your learning. Invest in opportunities that allow you to learn from the successes and failures of others. That might mean taking a course, hiring a coach, or working for free for a certain period of time in exchange for experience."}, {"3ec7": "Lesson #3: When opportunity seems limited, change your mind."}, {"aa1a": "It might mean moving across town to a co-working space. It might mean ponying up to go to an industry conference where all your peers are. Or it might just mean realizing there are plenty of chances for success right where you are."}, {"3539": "Geography matters, but mindset matters more. And chances are, there’s an opportunity closer than you realize. You just might have to move towards it before it will come closer to you."}, {"f1fc": "“You have to move towards opportunity before it will come closer to you.”"}, {"83f7": "Do these things, and you will see your luck increase. I promise. You can’t just sit around and wait for things to happen — for mentors to come find you and for opportunities to fall in your lap. Luck, of course does happen on occasion,but it’s better to look for luck than wait for it."}, {"f80e": "Because luck is often hiding in the hard-to-reach places that most people are too timid to approach."}, {"adc9": "“It’s better to look for luck than wait for it.”"}, {"4561": "Who knows? Maybe as you scan the horizon for the right opportunities, you just might see a shortcut."}, {"122f": "Call to Action"}, {"3b46": "Want to become a professional writer in less than 18 months? If so, get my free strategy-guide where I teach everything I know."}, {"d6b3": "Get your strategy-guide right now."}], "content": "3 Shortcuts to Success Every High Achiever Uses (That You Don’t) Yes, there is a shortcut to success, and it’s not working harder — it’s working smarter. The other day, someone commented on a Facebook post of mine in which I promised them a “shortcut” to success. They said, there’s no such thing. That made me wonder. Really? There are no shortcuts in life? Only the hardest working people in the world win? It’s a popular belief, which should be reason enough to question its validity. But let’s explore this idea. Let’s say there are no shortcuts and everyone is as successful as they absolutely deserve to be. Does that mean Bill Gates, who makes about $11 billion per year (or $1.3 million per hour!) works 54,000 times harder than the average American worker who earns $50,000 per year? How is that even possible? Look. We all want to believe hard work pays off. And it does. But at a certain point, you can’t work any harder. You have no more time than anyone else. So what do you do? You have to learn how to work smarter. And that means learning from someone who’s already been there. 1. Don’t Go It Alone — Get a Guide “Tell me and I forget, teach me and I may remember, involve me and I learn.” — Benjamin Franklin For years as a writer, I struggled to get noticed. I blogged and nobody cared, tried to write books no one would read, and failed to motivate myself to work. I wanted a publisher but didn’t know anyone in the industry and didn’t have any readers to show for my work. I was stuck. What I needed was someone to show me another path. It didn’t have to be a shortcut. I was just tired of the long road to success — because it was leading nowhere — desperately wanted to know what was missing. In any great story, there is a point in the journey when the hero meets an obstacle he cannot overcome. This is the moment when the guide arrives. This is the essence of Joseph Campbell’s Hero’s Journey: you cannot succeed without someone wiser to show you the way. Frodo needed Gandalf. Luke needed Obi-wan. And you and I need a mentor. Sure enough, in my own journey, that’s what happened. I met a handful of people who acted as guides in helping me become an author, speaker, and entrepreneur. My dream became a reality within a matter of 18 months. But this wasn’t because I hustled — it’s because I found a guide. “I didn’t succeed because I hustled any harder. I succeeded because I found a guide.” And you know what? I didn’t work any harder in those 18 months than I did in the previous seven years. But I did work smarter — not because I was any smarter, but because someone showed me a better way. I met the right people, connected with the right networks, and practiced my craft in the right way. In other words, I found a shortcut. But maybe you don’t like thinking of success this way. I certainly don’t. It’s embarrassing to admit I got a little lucky, that I was in the right place at the right time, that it wasn’t just about the hustle. But that’s the truth. And I think we need to acknowledge this reality. 2. Don’t Reinvent the Wheel — Learn from Others’ Experiences “True education does not consist merely in the acquiring of a few facts of science, history, literature, or art, but in thedevelopment of character.” ―David O. McKay How do you find a guide, or in today’s terms, a mentor? It’s not as easy as we’d like. First of all, mentors tend to be busy people. So getting in front of one will take work. People move around so much these days, and so many things, including our careers, are constantly changing. It stands to reason, then, that your mentor will not just be one person, but a team of people. In my book, The Art of Work, I call this an “accidental apprenticeship.” The idea here is that if you pay attention to your life and the people who are in it, you will find there are those around you right now whom you can learn from. In that sense, the best mentor is the one that’s right in front of you. “The best mentor is the one that’s right in front of you.” Still, you’ll want to be intentional about getting into relationship with this person. So there are a few steps I recommend following that have worked well for me and that I’ve seen others emulate, as well: Make your first ask a small one. In other words, don’t lead with, “Will you mentor me?” Instead, ask for a few minutes of their time, offer to buy them lunch/coffee/whatever. Make it all about them. Ask them to tell their story. Ask specific questions about choices they made in their own success journey and why. In other words, flatter them to death. Nobody is immune to this kind of treatment, and it certainly beats the awkward alternative. Come prepared with questions, and try to talk as little as possible. If you show up informed and interested, you will be both engaging and memorable. Take notes. When you meet with this person, write down everything they say. Honor their wisdom by capturing as much of it as possible. I recommend using a notebook and pen over a phone, just so that it’s clear you’re not checking your email or texting your buddies. Follow up. This is perhaps the most important and most often overlooked secret to getting into relationship with influencers who can eventually become part of your team of mentors. I meet with a lot of people and even tell them how important this is and still see on average about 80% of people never follow up. What I mean by this is a simple thank-you email for the person’s time, or even better: a copy of the notes you took to show that you really did listen and take to heart their wisdom. Become a case study. Hands down, this is the best thing you can do to earn the attention of an influencer. And if you do this consistently over time, you will get people interested in mentoring you. Take some piece of advice this person has given you (or published in a book, blog post, etc.) and apply it. Demonstrate that this stuff works and tell the world about it. The reason this works is fairly obvious: you’re making the mentor look good. Again, this goes back to making it about them. Don’t offer empty flattery; just show that you’re someone worth investing in. Do this enough times, and people will be lining up to give you their time, attention, and ideas. Because the truth is nearly everyone wants to help someone who is going places, so they can feel responsible for that person’s success. For more on this, check out this article: How to Find a Mentor in 10 Not-so-easy Steps. 3. Don’t Succumb to Scarcity — Embrace Abundance “True success is overcoming the fear of being unsuccessful.” — Paul Sweeney My friend Mary told me when she was first starting out as a writer, she asked an author out to lunch. “How do you get published?” she asked. The person wouldn’t tell her. She said those were her secrets and that Mary would have to find out for herself. That day, Mary vowed that if she ever made it as a writer, she’d share everything she learned with other aspiring authors. A few years later, I called her asking for advice, and she made good on her promise. Shawn Coyne, long-time New York editor, told me a similar story. Back in the day, nobody in publishing shared anything. There were no guidebooks on how to be an editor. He had to figure it out all on his own. Once he did, instead of hoarding his knowledge, he decided to share it in a book, blog, and podcast. This refusal to succumb to the scarcity mindset changes everything. When we let go of our perceived scarcity and embrace our actual abundance, it changes so many things: It can feel a little risky to embrace this mindset, this idea that there are guides out there who will help you and opportunities for success yet to be uncovered. But it is a much better way to live than to assume the alternative, that everyone is out to get you and there is no way you’ll succeed. Once you do experience this abundance, you will have an opportunity to help others, which is one of the greatest rewards of success. This is why I feel so responsible for helping other writers make their own journey towards getting published. Of course, I tell them it will take hard work. But I also teach them the rules of the game and how to improve their chances of success. You can’t just work harder. You have to work smarter. Stop trying to manage your time, as my friend Rory Vaden says, and instead learn how to multiply it.Finding the right guides to help you is an integral part of that process. “Don’t manage time. Multiply it.” — Rory Vaden Is This Really How It Works? I realize this may come off as manipulative or even sound a little unsavory. So allow me to address a few potential objections: Objection #1: Don’t influencers just want to help people out of the kindness of their hearts? Well, maybe. But they’re busy. And so when push comes to shove, they’re going to invest in people with promise, not takers who seem to make everything about themselves. Your best bet is to be remembered as the ambitious person with lots of questions who was eager to learn, not the know-it-all who was more interested in herself than the person with experience. Objection #2: Are mentors so egotistical that the whole thing has to be about them? No, they’re probably not all ego. But we all love to feel important and valued once in a while. And when seeking someone’s help or advice, appeal to this side of them, not their more noble generous side. As you earn their trust, you will see more of this side. But in the beginning, assume they are only interested in helping themselves. And make it worth their while. I’m sure many influencers are very kind and generous people. But it’s better to lead with humility than arrogance. Objection #3: Do I have to be so strategic? Can relationship be an end in itself, and not a means to get something out of people? Of course, relationship can be an end in itself. But the truth is most of us, whether we admit it or not, want something out of a relationship. And that something could just be love or acceptance or maybe even guidance. Just because you want something from someone doesn’t necessarily cheapen how you approach them. In that regard, yes, I do think you have to be strategic. Many of us are extremely busy. So if you don’t make intentional space for people to guide you, then you will likely drift through life, disappointed and disillusioned as you watch others succeed in things you wish you could achieve. My advice? Don’t be so strategic it stifles the relationship. But be intentional with your time and focus it on those who will give you a return on your investment. I guarantee you this is how your would-be mentors are thinking. Here’s What It All Boils Down to “Success is simple. Do what’s right, the right way, at the right time.” — Arnold H. Glasow So how does this work? Well, let’s recap the above in a few important lessons to remember: Lesson #1: You can get where you want faster if you follow in someone else’s footsteps. Find a guide or mentor you can learn from and emulate, even from afar. This is the difference between those who continuously struggle and those who find a faster way to succeed. Humble yourself and trust that there are those out there who want to help you. Lesson #2: Learn from other people’s experiences to grow your own capacity. In other words, don’t waste years trying to figure things out. Instead, sacrifice time and money to accelerate your learning. Invest in opportunities that allow you to learn from the successes and failures of others. That might mean taking a course, hiring a coach, or working for free for a certain period of time in exchange for experience. Lesson #3: When opportunity seems limited, change your mind. It might mean moving across town to a co-working space. It might mean ponying up to go to an industry conference where all your peers are. Or it might just mean realizing there are plenty of chances for success right where you are. Geography matters, but mindset matters more. And chances are, there’s an opportunity closer than you realize. You just might have to move towards it before it will come closer to you. “You have to move towards opportunity before it will come closer to you.” Do these things, and you will see your luck increase. I promise. You can’t just sit around and wait for things to happen — for mentors to come find you and for opportunities to fall in your lap. Luck, of course does happen on occasion,but it’s better to look for luck than wait for it. Because luck is often hiding in the hard-to-reach places that most people are too timid to approach. “It’s better to look for luck than wait for it.” Who knows? Maybe as you scan the horizon for the right opportunities, you just might see a shortcut. Call to Action Want to become a professional writer in less than 18 months? If so, get my free strategy-guide where I teach everything I know. Get your strategy-guide right now. ", "child": "904_1\t904_2\t904_3\t904_4\t904_5\t904_6\t904_7\t904_8\t904_9\t904_10\t904_11"}