{"name": "908", "parent": "", "title": "This is How to Do Things You Don’t Want to Do", "sentences": [{"5063": "This is How to Do Things You Don’t Want to Do"}, {"743e": "The common denominator of success — the secret of success of every person who has ever been successful — lies in the fact that they formed the habit of doing things that failures don’t like to do. — Albert E.N. Grey"}, {"8fc1": "No matter what you want to accomplish in life, it’s going to involve discomfort:"}, {"5793": "A great career or business requires hard work."}, {"76f2": "A healthy body needs exercise and foods you don’t necessarily like."}, {"29f0": "Meaningful relationships need vulnerability and compromises."}, {"a3cd": "In fact, anything worthwhile often requires that you do what you don’t want to do."}, {"3285": "And that can be hard."}, {"3757": "But it doesn’t have to be."}, {"b866": "You Are Not Your Thoughts"}, {"874b": "I used to take my thoughts very seriously. Whenever one of them popped into my head, I’d immediately identify with it and perceive it as the “truth.”"}, {"0118": "If a thought told me I was tired and bored, I’d immediately look for a way out."}, {"588a": "But I’ve since learned that I am not my thoughts and that my mind is nothing more than a suggestion box."}, {"9355": "Because of that, I don’t take my thoughts as seriously as I used to."}, {"1f1d": "And that, in turn, has made a huge difference in my subsequent behavior and the results I get."}, {"6078": "These days, when my mind tells me I’m restless and should do something else, I simply thank it for the suggestion and then get back to the task at hand."}, {"f876": "Stimulus –> Perception –> Response"}, {"62b5": "It’s never the discomfort that stops you; it’s how you perceive the discomfort."}, {"1fb2": "Your beliefs determine your response, and what you choose to believe is within your control."}, {"3020": "You can assign whatever meaning you want to discomfort."}, {"0306": "I used to believe it was a signal that I should stop."}, {"9657": "These days, I believe it’s a signal that I should keep going."}, {"cfc1": "I’ve decided that anytime I feel discomfort, that just means I’ve stepped into my mental gym and that it’s time for my mental resistance training."}, {"f06a": "Exercise Your Willpower Muscle"}, {"2f61": "Willpower is a lot like muscle power. The more you exercise it, the stronger it will get."}, {"13f3": "If you practice it for an extended period of time, you can change your behavior around completely."}, {"aff0": "You’ll be able to do what others dread doing and to stay away from things that others can’t resist doing."}, {"c3fa": "That level of self-control is exactly what’s needed to become a remarkable person and create extraordinary results."}, {"7687": "So, how do you get started?"}, {"0294": "Practice Voluntary Discomfort"}, {"2e72": "He who sweats more in training bleeds less in war. — Spartan Warrior Creed"}, {"fad5": "The best way to practice mental resistance training is through voluntary hardship. Here are a few examples:"}, {"b68c": "These are just a few ideas to help you come up with your personal mental resistance training."}, {"dddc": "The important thing is that you choose one and commit to it."}, {"84a2": "And just like in a physical gym, you don’t want to use the heaviest weights right away."}, {"6fc7": "There’s no point getting overwhelmed or injured."}, {"823f": "So, start small and then get a little bit every day."}, {"79c5": "If your willpower muscle is weak right now, it’s perfectly fine to start by making your bed each morning. Or reading one page in a book. Or flossing one tooth."}, {"212b": "How to Do What You Don’t Want to Do"}, {"c72a": "If you’re thinking to yourself right now; “I’m not the kind of person who practices voluntary discomfort,” be very mindful of the fact that this is the same voice you want to take control over."}, {"5f0c": "Don’t take it as literal truth. Remember — it’s just a suggestion. And it’s entirely within your power what you do with that suggestion."}, {"c144": "If you choose to take action despite what your mind is telling you, it holds no power over you."}, {"9679": "You can decide to perceive discomfort as mental resistance training from this moment forward."}, {"5979": "And each time you push through the resistance, you’ll notice that you’ll get a little bit stronger."}, {"f329": "If you stick to the practice consistently, with time, it’ll become second nature to do what you don’t want to do."}, {"944e": "You’ll become a relentless action-taker."}, {"2556": "And that’s when you can turn your most desired goals into reality."}, {"15de": "If you enjoyed this article, please click the heart so others can learn from it as well!"}, {"5928": "Patrik Edblad is a certified mental trainer and writer. He helps people use research-backed strategies to become healthier, happier and more productive at Selfication.com. Grab your free copy of his book The Science of Willpower: Proven Strategies to Beat Procrastination & Get Big Things Done."}, {"725d": "This article was originally posted on www.selfication.com."}, {"6289": "Picture by Dominik Martin."}], "content": "This is How to Do Things You Don’t Want to Do The common denominator of success — the secret of success of every person who has ever been successful — lies in the fact that they formed the habit of doing things that failures don’t like to do. — Albert E.N. Grey No matter what you want to accomplish in life, it’s going to involve discomfort: A great career or business requires hard work. A healthy body needs exercise and foods you don’t necessarily like. Meaningful relationships need vulnerability and compromises. In fact, anything worthwhile often requires that you do what you don’t want to do. And that can be hard. But it doesn’t have to be. You Are Not Your Thoughts I used to take my thoughts very seriously. Whenever one of them popped into my head, I’d immediately identify with it and perceive it as the “truth.” If a thought told me I was tired and bored, I’d immediately look for a way out. But I’ve since learned that I am not my thoughts and that my mind is nothing more than a suggestion box. Because of that, I don’t take my thoughts as seriously as I used to. And that, in turn, has made a huge difference in my subsequent behavior and the results I get. These days, when my mind tells me I’m restless and should do something else, I simply thank it for the suggestion and then get back to the task at hand. Stimulus –> Perception –> Response It’s never the discomfort that stops you; it’s how you perceive the discomfort. Your beliefs determine your response, and what you choose to believe is within your control. You can assign whatever meaning you want to discomfort. I used to believe it was a signal that I should stop. These days, I believe it’s a signal that I should keep going. I’ve decided that anytime I feel discomfort, that just means I’ve stepped into my mental gym and that it’s time for my mental resistance training. Exercise Your Willpower Muscle Willpower is a lot like muscle power. The more you exercise it, the stronger it will get. If you practice it for an extended period of time, you can change your behavior around completely. You’ll be able to do what others dread doing and to stay away from things that others can’t resist doing. That level of self-control is exactly what’s needed to become a remarkable person and create extraordinary results. So, how do you get started? Practice Voluntary Discomfort He who sweats more in training bleeds less in war. — Spartan Warrior Creed The best way to practice mental resistance training is through voluntary hardship. Here are a few examples: These are just a few ideas to help you come up with your personal mental resistance training. The important thing is that you choose one and commit to it. And just like in a physical gym, you don’t want to use the heaviest weights right away. There’s no point getting overwhelmed or injured. So, start small and then get a little bit every day. If your willpower muscle is weak right now, it’s perfectly fine to start by making your bed each morning. Or reading one page in a book. Or flossing one tooth. How to Do What You Don’t Want to Do If you’re thinking to yourself right now; “I’m not the kind of person who practices voluntary discomfort,” be very mindful of the fact that this is the same voice you want to take control over. Don’t take it as literal truth. Remember — it’s just a suggestion. And it’s entirely within your power what you do with that suggestion. If you choose to take action despite what your mind is telling you, it holds no power over you. You can decide to perceive discomfort as mental resistance training from this moment forward. And each time you push through the resistance, you’ll notice that you’ll get a little bit stronger. If you stick to the practice consistently, with time, it’ll become second nature to do what you don’t want to do. You’ll become a relentless action-taker. And that’s when you can turn your most desired goals into reality. If you enjoyed this article, please click the heart so others can learn from it as well! Patrik Edblad is a certified mental trainer and writer. He helps people use research-backed strategies to become healthier, happier and more productive at Selfication.com. Grab your free copy of his book The Science of Willpower: Proven Strategies to Beat Procrastination & Get Big Things Done. This article was originally posted on www.selfication.com. Picture by Dominik Martin. ", "child": "908_1\t908_2\t908_3\t908_4\t908_5\t908_6\t908_7\t908_8\t908_9\t908_10\t908_11\t908_12\t908_13\t908_14\t908_15\t908_16\t908_17\t908_18\t908_19\t908_20\t908_21\t908_22\t908_23\t908_24\t908_25"}