{"name": "913", "parent": "", "title": "Has the West Lost Its Mind?", "sentences": [{"0215": "Has the West Lost Its Mind?"}, {"54ec": "Pundits, Paralysis, and the Point of Societies"}, {"7339": "Surveying the daily wreckage of Trump and Brexit, it’s only natural to wonder: has the West lost its goddamned mind?"}, {"e3b4": "I think the answer is the opposite: the West is too much mind. And too little…everything else. Eyes, hands, action, soul, heart. I don’t say that for Slate-style contrarianism’s sake. But because it’s simple reality."}, {"0312": "Let me give you an analogy. You meet someone. You’re excited. But they don’t call, text you back. You begin obsessing. Is it my hair? My clothes? My lack of witty repartee? What gives? The answer is blindingly simple. There’s probably just no spark, no magic, as the saying goes: they’re just not that into you."}, {"de78": "You’re overthinking it. You’re too much in mind, and not enough in reality."}, {"27a0": "Now let’s consider the West. It’s in obviously stark disrepair, decline, decay. The average person has been conned, fleeced, hoodwinked, cheated — to the point that their life expectancy is beginning to fall, they have no emergency savings, and their kids essentially have no futures. Please, if you need to debate that, do yourself a favour and go check the statistics on all the above."}, {"8879": "And what happens next? An endless parade of pundits hemming and hawing. “Well, Bob”, one says, “maybe a tax break here…”. “But Steve — “, the next interjects, “what about an earned income plan there?!”. And on and on it goes endlessly."}, {"98a1": "The answers are very simple, aren’t they? Copy what successful societies have done. Give people public healthcare, education, transport, finance. Rewrite this broken social contract. Craft one that genuinely improves people’s lives. It’s not rocket science, is it?"}, {"b314": "But the West is trapped in this weird place: overthinking it. It’s stuck in analysis paralysis — and even then, only incremental, piecemeal analysis at best. Endlessly, consistently, predictably. As if the problems of growing poverty, stagnation, and desperation are insoluble. They are not. They are easy enough to fix."}, {"2fa1": "That brings us to the question. How did the West get here? To this point of intractable analysis paralysis?"}, {"3f08": "I think there are three intertwining answers, and they have to do a great deal with punditry."}, {"e758": "First, pundits approach social problems with the intellectual maturity of a pimply fourteen year old nerd. That is: there are two kinds of data, aren’t there? Qualitative and quantitative. What do you notice about Western public discourse, though? Qualitative data is never considered at all. Only quantitative data is. Qualitative data is reduced to “anecdata”. And so we miss 90% of the human story, the lived reality, the experience of the numbers."}, {"d8a9": "Let me put that another way. Pundits love flipping through charts. But they will not consider fully the meaning of “the numbers”. Thus denuded, public discourse has become self-referential, empty of reality to the degree that it’s utterly detached from the lived experience of the average person. We’ll debate the GDP effects of tax codes forever — but never once question whether GDP growth is actually benefitting people in the first place."}, {"833a": "Second, by rejecting qualitative data, punditry is left in a bubble. Qualitative data is important in social science for a simple reason: it buttresses and informs theory with real world experience. Quantitative data cannot do that. It can abstract — but only abstract. Thus, pundits are trapped in a bubble: they simply quote the same old numbers over and over again — but those numbers are too abstract to hold any real meaning. As a simple example, GDP grows even while the average person begins to die sooner. So what the eff does GDP growth mean? Not a great deal."}, {"0b0d": "Numbers can tell us everything but the point, can’t they? The point of a society is very simple: to expand people’s possibilities. We can try to put that in numbers — but we must never only look at numbers to judge whether we are succeeding. We must reality check the purpose, point, reason for, meaning of the numbers with lived human experience. But because there is nothing to challenge “the numbers” with, pundits just go on robotically recite the same old foolish non-arguments like broken androids on the Titanic."}, {"d8a6": "Third, and most urgent to me at least, by fetishizing quantitative data, pundits have turned social science, social problems, social understanding, into something like freshman level engineering classes. They are left unable to even see the simple reality: most of the rich world has working societies. There’s no need to Uberize public schools or whatever the latest brain-meltingly crap idea du jour may be. But why can’t we see that? Because that reality doesn’t show up on a national chart of unemployment or GDP. Here’s another example: the decline of the American middle class should have been obvious to anyone who took a train from Washington to New York at any time in the past decade…and bothered to look out of the window. But again, because punditry has trained us to reject what is front of our own eyes in favour of “the numbers”, which are tendentious extrapolations to begin with, we have become the blind led by the blind. Straight into the dark ages."}, {"0c24": "So: has the West lost its goddamned mind? Analysis paralysis. Overthinking it. The West is too much mind. And too little heart, eyes, hands, soul, action. It’s like a guy who keeps thinking up half-baked pickup lines…but never asks their crush out on a date."}, {"b37b": "Unless it can break this vicious cycle of mind over action, insight, reality, truth, the West probably is condemned to more of…this. You know: an endless cycle of daily headlines, absurd spectacles, and laughable leaders, that outrage us, each day worse than the last. Outrage is easy. Overthinking it is the natural consequence — because what outrages us also leaves us grasping, breathless, for reason. What is genuinely hard in this little life is taking the future into one’s hands and molding it with a little bit of love, a lot of courage, and a spoonful of wisdom."}, {"2718": "UmairApril 2017"}], "content": "Has the West Lost Its Mind? Pundits, Paralysis, and the Point of Societies Surveying the daily wreckage of Trump and Brexit, it’s only natural to wonder: has the West lost its goddamned mind? I think the answer is the opposite: the West is too much mind. And too little…everything else. Eyes, hands, action, soul, heart. I don’t say that for Slate-style contrarianism’s sake. But because it’s simple reality. Let me give you an analogy. You meet someone. You’re excited. But they don’t call, text you back. You begin obsessing. Is it my hair? My clothes? My lack of witty repartee? What gives? The answer is blindingly simple. There’s probably just no spark, no magic, as the saying goes: they’re just not that into you. You’re overthinking it. You’re too much in mind, and not enough in reality. Now let’s consider the West. It’s in obviously stark disrepair, decline, decay. The average person has been conned, fleeced, hoodwinked, cheated — to the point that their life expectancy is beginning to fall, they have no emergency savings, and their kids essentially have no futures. Please, if you need to debate that, do yourself a favour and go check the statistics on all the above. And what happens next? An endless parade of pundits hemming and hawing. “Well, Bob”, one says, “maybe a tax break here…”. “But Steve — “, the next interjects, “what about an earned income plan there?!”. And on and on it goes endlessly. The answers are very simple, aren’t they? Copy what successful societies have done. Give people public healthcare, education, transport, finance. Rewrite this broken social contract. Craft one that genuinely improves people’s lives. It’s not rocket science, is it? But the West is trapped in this weird place: overthinking it. It’s stuck in analysis paralysis — and even then, only incremental, piecemeal analysis at best. Endlessly, consistently, predictably. As if the problems of growing poverty, stagnation, and desperation are insoluble. They are not. They are easy enough to fix. That brings us to the question. How did the West get here? To this point of intractable analysis paralysis? I think there are three intertwining answers, and they have to do a great deal with punditry. First, pundits approach social problems with the intellectual maturity of a pimply fourteen year old nerd. That is: there are two kinds of data, aren’t there? Qualitative and quantitative. What do you notice about Western public discourse, though? Qualitative data is never considered at all. Only quantitative data is. Qualitative data is reduced to “anecdata”. And so we miss 90% of the human story, the lived reality, the experience of the numbers. Let me put that another way. Pundits love flipping through charts. But they will not consider fully the meaning of “the numbers”. Thus denuded, public discourse has become self-referential, empty of reality to the degree that it’s utterly detached from the lived experience of the average person. We’ll debate the GDP effects of tax codes forever — but never once question whether GDP growth is actually benefitting people in the first place. Second, by rejecting qualitative data, punditry is left in a bubble. Qualitative data is important in social science for a simple reason: it buttresses and informs theory with real world experience. Quantitative data cannot do that. It can abstract — but only abstract. Thus, pundits are trapped in a bubble: they simply quote the same old numbers over and over again — but those numbers are too abstract to hold any real meaning. As a simple example, GDP grows even while the average person begins to die sooner. So what the eff does GDP growth mean? Not a great deal. Numbers can tell us everything but the point, can’t they? The point of a society is very simple: to expand people’s possibilities. We can try to put that in numbers — but we must never only look at numbers to judge whether we are succeeding. We must reality check the purpose, point, reason for, meaning of the numbers with lived human experience. But because there is nothing to challenge “the numbers” with, pundits just go on robotically recite the same old foolish non-arguments like broken androids on the Titanic. Third, and most urgent to me at least, by fetishizing quantitative data, pundits have turned social science, social problems, social understanding, into something like freshman level engineering classes. They are left unable to even see the simple reality: most of the rich world has working societies. There’s no need to Uberize public schools or whatever the latest brain-meltingly crap idea du jour may be. But why can’t we see that? Because that reality doesn’t show up on a national chart of unemployment or GDP. Here’s another example: the decline of the American middle class should have been obvious to anyone who took a train from Washington to New York at any time in the past decade…and bothered to look out of the window. But again, because punditry has trained us to reject what is front of our own eyes in favour of “the numbers”, which are tendentious extrapolations to begin with, we have become the blind led by the blind. Straight into the dark ages. So: has the West lost its goddamned mind? Analysis paralysis. Overthinking it. The West is too much mind. And too little heart, eyes, hands, soul, action. It’s like a guy who keeps thinking up half-baked pickup lines…but never asks their crush out on a date. Unless it can break this vicious cycle of mind over action, insight, reality, truth, the West probably is condemned to more of…this. You know: an endless cycle of daily headlines, absurd spectacles, and laughable leaders, that outrage us, each day worse than the last. Outrage is easy. Overthinking it is the natural consequence — because what outrages us also leaves us grasping, breathless, for reason. What is genuinely hard in this little life is taking the future into one’s hands and molding it with a little bit of love, a lot of courage, and a spoonful of wisdom. UmairApril 2017 ", "child": "913_1\t913_2\t913_3\t913_4\t913_5\t913_6\t913_7\t913_8\t913_9\t913_10\t913_11\t913_12\t913_13\t913_14\t913_15\t913_16\t913_17"}