{"name": "915", "parent": "", "title": "Why Some Startups Win", "sentences": [{"9455": "Why Some Startups Win"}, {"8774": "I was having a second coffee with an ex student, now the head of a marketing inside a rapidly growing startup. His company had marched through customer discovery, learned about the customer problem, validated solutions, and was now scaling sales and marketing. All good news."}, {"dcd6": "But he was getting uneasy that as his headcount was growing the productivity of his marketing department seemed to be rapidly declining."}, {"746b": "I wasn’t surprised. When organizations are small (startups, small teams in companies, and government agencies) early employees share a mission — why they come to work, what they need to do while they are at work, and how they will know they have succeeded. But as these organizations grow, what was once a shared mission and intent gets buried under HR process and Key Performance Indicators."}, {"740a": "I told him that I had learned long ago that to keep that from happening, you need to on-board/train your team about mission and intent."}, {"37bf": "Why do you work here?"}, {"75da": "I had taken the job of VP of Marketing in a company emerging from bankruptcy. We’d managed to secure another infusion of cash, but it wasn’t going to last long."}, {"258f": "During my first week on the job, I asked each of my department heads what they did for marketing and for the company. When I asked our trade show manager, she looked surprised and said, “Steve, don’t you know that my job is to take our booth to trade shows and set it up?” The other departments gave the same type of logistical answers — the product-marketing department, for example, said their job was to get the product specs from Engineering and write data sheets. But my favorite was when the public relations manager told me, “We’re here to summarize the data sheets and put them in press releases and then answer the phone in case the press calls.”"}, {"d945": "If these sound like reasonable answers to you, and you are in a startup, update your resume."}, {"eb2e": "Titles are not your job"}, {"6d01": "When I pressed my staff to explain why marketing did trade shows or wrote press releases or penned data sheets, the best response I could get was, “Why that’s our job.” In their heads their titles were a link back to a Human Resources job spec that came from a 10,000-person company (i.e., listing duties and responsibilities, skills and competencies, reporting relationships)"}, {"9212": "It dawned on me that we had a department full of people with titles describing process-centric execution while we were in environment that required relentless agility and speed with urgency."}, {"c628": "While their titles might be what their business cards said, titles were not their job — and being a slave to process lost the sight of the forest for the trees. This was the last thing we needed in a company where every day could be our last."}, {"3645": "Titles in a startup are not the same as what your job is. This is a big idea."}, {"3921": "Department mission statements: What am I supposed to do today?"}, {"7aec": "It wasn’t that I had somehow inherited dumb employees. What I was hearing was a failure of management."}, {"dbc3": "No one had on-boarded these people. No one had differentiated a startup job description from a large company job. They were all doing what they thought they were supposed to."}, {"51f7": "But most importantly, no one had sat the marketing department down and defined our department Mission (with a capital “M”)."}, {"7496": "Most startups put together a corporate mission statement because the CEO remembered seeing one at his last job or the investors said they needed one. Most companies spend an inordinate amount of time crafting a finely honed corporate mission statement for external consumption and then do nothing internally to make it happen. What I’m about to describe here is quite different."}, {"9598": "What our marketing department was missing was anything that gave the marketing staff daily guidance about what they should be doing. The first reaction from my CEO was, “That’s why you’re running the department.” And yes, we could have built a top-down, command-and-control hierarchy, but what I wanted was an agile marketing team capable of operating independently without day-to-day direction."}, {"0533": "We needed to craft a Departmental Mission Statement that told everyone:"}, {"9827": "And it was going to mention the two words that marketing needed to live and breathe: revenue and profit."}, {"1900": "Five easy pieces: The marketing mission"}, {"b6da": "After a few months of talking to customers and working with sales, we defined the marketing Mission (our job) as:"}, {"e4a1": "Help Sales deliver $25 million in sales with a 45% gross margin. To do that we will create end-user demand and drive it into the sales channel, educate the channel and customers about why our products are superior, and help Engineering understand customer needs and desires. We will accomplish this through demand-creation activities (advertising, PR, tradeshows, seminars, web sites, etc.), competitive analyses, channel and customer collateral (white papers, data sheets, product reviews), customer surveys, and customer discovery findings."}, {"2901": "This year, marketing needs to provide sales with 40,000 active and accepted leads, company and product name recognition over 65% in our target market, and five positive product reviews per quarter. We will reach 35% market share in year one of sales with a headcount of twenty people, spending less than $4,000,000."}, {"f6e1": "— Generate end-user demand (to match our revenue goals)"}, {"c04a": "— Drive that demand into our sales channels"}, {"5d99": "— Value price our products to achieve our revenue and margin goals (create high-value)"}, {"17c5": "— Educate our sales channel(s)"}, {"41cd": "— Help Engineering understand customer needs"}, {"eb74": "That was it. Two paragraphs, Five bullets. It didn’t take more."}, {"66b9": "Building a mission-focused team"}, {"9c1e": "Having the mission in place meant that our team could see that what mattered wasn’t what was on their business card, but how much closer their work moved our department to completing the mission. Period."}, {"6228": "It wasn’t an easy concept for everyone to understand."}, {"5aef": "My new Director of Marketing Communications turned the Marcom departments into a mission-focused organization. Her new tradeshow manager quickly came to understand that his job was not to set up booths — we hired union laborers to do that — a trade show was where our company went to create awareness and/or leads. And if you ran the tradeshow department, you owned the responsibility for awareness and leads. The booth was incidental. I couldn’t care less if we had a booth or not if we could generate the same amount of leads and awareness by skydiving naked into a coffee cup."}, {"b49f": "The same was true for PR. My new head of Public Relations quickly learned that my admin could answer calls from the press. The job of Public Relations wasn’t a passive “write a press release and wait for something to happen” activity. It wasn’t measured by how busy you were, it was measured by results. And the results weren’t the traditional PR metrics of number of articles or inches of ink. I couldn’t care less about those. I wanted our PR department to map the sales process, figure out where getting awareness and interest could be done with PR, then get close and personal with the press and use it to generate end-user demand and then drive that demand into our sales channel. We were constantly doing internal and external audits and creating metrics to see the effects of different PR messages, channels and audiences on customer awareness, purchase intent and end-user sales."}, {"682b": "The same was true for the Product Marketing group. I hired a Director of Product Marketing who in his last company had ran its marketing and then went out into the field and became its national sales director. He got the job when I asked him how much of his own marketing material his sales team actually used in the field. When he said, “about ten percent,” I knew by the embarrassed look on his face I had found the right guy. And our Director of Technical Marketing was superb at understanding customer needs and communicating them to Engineering."}, {"49eb": "Mission intent: What’s really important"}, {"b218": "With a great team in place, the next step was recognizing that our Mission statement might change on the fly. “Hey, we just all bought into this Mission idea and now you’re telling us it can change?!” The mission might change if we pivot, competitors might announce new products, we might learn something new about our customers, etc."}, {"c4d7": "So we introduced the notion of Mission Intent. Intent answered the question, “What is the company thinking and goal behind the mission?” In our case, the mission of the company was to sell $25 million of product with 45% gross margin."}, {"53ca": "The idea of teaching intention is that if employees understand what we intended behind the mission, they can work collaboratively to achieve it."}, {"3855": "We recognized that there would be a time marketing would screw up or something out of our control would happen, making the marketing mission obsolete (i.e. we might fail to deliver 40,000 leads.). Think of intention as the answer to the adage, “When you are up to your neck in alligators it’s hard to remember you were supposed to drain the swamp.” For example, our mission intent said that the reason why marketing needed to deliver 40,000 leads and 35% market share, etc., was so that Sales could sell $25 million of products at 45% gross margin."}, {"9d3d": "What we taught everyone is that the intention is more enduring than the mission — “Let’s see, the company is trying to sell $25 million in product with 45% gross margin. If marketing can’t deliver the 40,000 leads, what else can we do for sales to still achieve our revenue and profitability?” The mission was our goal, but based on circumstances, it might change. However, the Intent was immovable."}, {"6778": "When faced with the time pressures of a startup, too many demands and too few people, we began to teach our staff to refer back to the five Mission goals and the Intent of the department. When stuff started piling up on their desks, they learned to ask themselves, “Is what I’m working on furthering these goals? If so, which one? If not, why am I doing it?”"}, {"b836": "They understood the mission intent was our corporate revenue and profit goals."}, {"466d": "Why do it"}, {"6b76": "By the end of the first year, our team had jelled. (Over time, we added the No Excuses culture to solve accountability.) It was a department willing to exercise initiative, with the judgment to act wisely and an eagerness to accept responsibility."}, {"9963": "I remember at the end of a hard week my direct reports came into my office just to talk about the week’s little victories. And there was a moment as they shared their stories when they all began to realize that our company, one that had just come off of life support, was beginning to kick the rear of our better-funded and bigger competitors. We all marveled in the moment."}, {"c5ad": "Lessons Learned"}, {"9864": "If you learned something, click the 💚 to help others find this article."}, {"3ac0": "Read more Steve Blank posts on www.steveblank.com."}], "content": "Why Some Startups Win I was having a second coffee with an ex student, now the head of a marketing inside a rapidly growing startup. His company had marched through customer discovery, learned about the customer problem, validated solutions, and was now scaling sales and marketing. All good news. But he was getting uneasy that as his headcount was growing the productivity of his marketing department seemed to be rapidly declining. I wasn’t surprised. When organizations are small (startups, small teams in companies, and government agencies) early employees share a mission — why they come to work, what they need to do while they are at work, and how they will know they have succeeded. But as these organizations grow, what was once a shared mission and intent gets buried under HR process and Key Performance Indicators. I told him that I had learned long ago that to keep that from happening, you need to on-board/train your team about mission and intent. Why do you work here? I had taken the job of VP of Marketing in a company emerging from bankruptcy. We’d managed to secure another infusion of cash, but it wasn’t going to last long. During my first week on the job, I asked each of my department heads what they did for marketing and for the company. When I asked our trade show manager, she looked surprised and said, “Steve, don’t you know that my job is to take our booth to trade shows and set it up?” The other departments gave the same type of logistical answers — the product-marketing department, for example, said their job was to get the product specs from Engineering and write data sheets. But my favorite was when the public relations manager told me, “We’re here to summarize the data sheets and put them in press releases and then answer the phone in case the press calls.” If these sound like reasonable answers to you, and you are in a startup, update your resume. Titles are not your job When I pressed my staff to explain why marketing did trade shows or wrote press releases or penned data sheets, the best response I could get was, “Why that’s our job.” In their heads their titles were a link back to a Human Resources job spec that came from a 10,000-person company (i.e., listing duties and responsibilities, skills and competencies, reporting relationships) It dawned on me that we had a department full of people with titles describing process-centric execution while we were in environment that required relentless agility and speed with urgency. While their titles might be what their business cards said, titles were not their job — and being a slave to process lost the sight of the forest for the trees. This was the last thing we needed in a company where every day could be our last. Titles in a startup are not the same as what your job is. This is a big idea. Department mission statements: What am I supposed to do today? It wasn’t that I had somehow inherited dumb employees. What I was hearing was a failure of management. No one had on-boarded these people. No one had differentiated a startup job description from a large company job. They were all doing what they thought they were supposed to. But most importantly, no one had sat the marketing department down and defined our department Mission (with a capital “M”). Most startups put together a corporate mission statement because the CEO remembered seeing one at his last job or the investors said they needed one. Most companies spend an inordinate amount of time crafting a finely honed corporate mission statement for external consumption and then do nothing internally to make it happen. What I’m about to describe here is quite different. What our marketing department was missing was anything that gave the marketing staff daily guidance about what they should be doing. The first reaction from my CEO was, “That’s why you’re running the department.” And yes, we could have built a top-down, command-and-control hierarchy, but what I wanted was an agile marketing team capable of operating independently without day-to-day direction. We needed to craft a Departmental Mission Statement that told everyone: And it was going to mention the two words that marketing needed to live and breathe: revenue and profit. Five easy pieces: The marketing mission After a few months of talking to customers and working with sales, we defined the marketing Mission (our job) as: Help Sales deliver $25 million in sales with a 45% gross margin. To do that we will create end-user demand and drive it into the sales channel, educate the channel and customers about why our products are superior, and help Engineering understand customer needs and desires. We will accomplish this through demand-creation activities (advertising, PR, tradeshows, seminars, web sites, etc.), competitive analyses, channel and customer collateral (white papers, data sheets, product reviews), customer surveys, and customer discovery findings. This year, marketing needs to provide sales with 40,000 active and accepted leads, company and product name recognition over 65% in our target market, and five positive product reviews per quarter. We will reach 35% market share in year one of sales with a headcount of twenty people, spending less than $4,000,000. — Generate end-user demand (to match our revenue goals) — Drive that demand into our sales channels — Value price our products to achieve our revenue and margin goals (create high-value) — Educate our sales channel(s) — Help Engineering understand customer needs That was it. Two paragraphs, Five bullets. It didn’t take more. Building a mission-focused team Having the mission in place meant that our team could see that what mattered wasn’t what was on their business card, but how much closer their work moved our department to completing the mission. Period. It wasn’t an easy concept for everyone to understand. My new Director of Marketing Communications turned the Marcom departments into a mission-focused organization. Her new tradeshow manager quickly came to understand that his job was not to set up booths — we hired union laborers to do that — a trade show was where our company went to create awareness and/or leads. And if you ran the tradeshow department, you owned the responsibility for awareness and leads. The booth was incidental. I couldn’t care less if we had a booth or not if we could generate the same amount of leads and awareness by skydiving naked into a coffee cup. The same was true for PR. My new head of Public Relations quickly learned that my admin could answer calls from the press. The job of Public Relations wasn’t a passive “write a press release and wait for something to happen” activity. It wasn’t measured by how busy you were, it was measured by results. And the results weren’t the traditional PR metrics of number of articles or inches of ink. I couldn’t care less about those. I wanted our PR department to map the sales process, figure out where getting awareness and interest could be done with PR, then get close and personal with the press and use it to generate end-user demand and then drive that demand into our sales channel. We were constantly doing internal and external audits and creating metrics to see the effects of different PR messages, channels and audiences on customer awareness, purchase intent and end-user sales. The same was true for the Product Marketing group. I hired a Director of Product Marketing who in his last company had ran its marketing and then went out into the field and became its national sales director. He got the job when I asked him how much of his own marketing material his sales team actually used in the field. When he said, “about ten percent,” I knew by the embarrassed look on his face I had found the right guy. And our Director of Technical Marketing was superb at understanding customer needs and communicating them to Engineering. Mission intent: What’s really important With a great team in place, the next step was recognizing that our Mission statement might change on the fly. “Hey, we just all bought into this Mission idea and now you’re telling us it can change?!” The mission might change if we pivot, competitors might announce new products, we might learn something new about our customers, etc. So we introduced the notion of Mission Intent. Intent answered the question, “What is the company thinking and goal behind the mission?” In our case, the mission of the company was to sell $25 million of product with 45% gross margin. The idea of teaching intention is that if employees understand what we intended behind the mission, they can work collaboratively to achieve it. We recognized that there would be a time marketing would screw up or something out of our control would happen, making the marketing mission obsolete (i.e. we might fail to deliver 40,000 leads.). Think of intention as the answer to the adage, “When you are up to your neck in alligators it’s hard to remember you were supposed to drain the swamp.” For example, our mission intent said that the reason why marketing needed to deliver 40,000 leads and 35% market share, etc., was so that Sales could sell $25 million of products at 45% gross margin. What we taught everyone is that the intention is more enduring than the mission — “Let’s see, the company is trying to sell $25 million in product with 45% gross margin. If marketing can’t deliver the 40,000 leads, what else can we do for sales to still achieve our revenue and profitability?” The mission was our goal, but based on circumstances, it might change. However, the Intent was immovable. When faced with the time pressures of a startup, too many demands and too few people, we began to teach our staff to refer back to the five Mission goals and the Intent of the department. When stuff started piling up on their desks, they learned to ask themselves, “Is what I’m working on furthering these goals? If so, which one? If not, why am I doing it?” They understood the mission intent was our corporate revenue and profit goals. Why do it By the end of the first year, our team had jelled. (Over time, we added the No Excuses culture to solve accountability.) It was a department willing to exercise initiative, with the judgment to act wisely and an eagerness to accept responsibility. I remember at the end of a hard week my direct reports came into my office just to talk about the week’s little victories. And there was a moment as they shared their stories when they all began to realize that our company, one that had just come off of life support, was beginning to kick the rear of our better-funded and bigger competitors. We all marveled in the moment. Lessons Learned If you learned something, click the 💚 to help others find this article. Read more Steve Blank posts on www.steveblank.com. ", "child": "915_1\t915_2\t915_3\t915_4\t915_5\t915_6\t915_7\t915_8\t915_9\t915_10\t915_11\t915_12\t915_13\t915_14\t915_15\t915_16\t915_17\t915_18\t915_19\t915_20\t915_21\t915_22\t915_23\t915_24915_1\t915_2\t915_3\t915_4\t915_5\t915_6\t915_7\t915_8\t915_9\t915_10\t915_11\t915_12\t915_13\t915_14\t915_15\t915_16\t915_17\t915_18\t915_19\t915_20\t915_21\t915_22\t915_23\t915_24"}