{"name": "917", "parent": "", "title": "The New Rules About Politics and Work", "sentences": [{"7e8f": "The New Rules About Politics and Work"}, {"8d02": "I recently found myself in unchartered waters."}, {"1fe4": "Employees at my company were sending around group emails discussing the outcome of the election. Unbeknownst to them, there were a couple of employees in the mix that held opposing views and took offense to the emails. One of the folks with an opposing view spoke with me about it and I found myself giving the old rule of “don’t mix politics and work” some new consideration."}, {"b595": "And I’m not alone."}, {"ff16": "CEOs everywhere are trying to figure out the new rules around politics and work, some with dramatic consequences:"}, {"a581": "It’s fair to say at this point that the rule of “no politics in the workplace” isn’t quite robust enough. This can create conflict for teams and coworkers working under the same roof who need to get along and work toward the same goal."}, {"8f0a": "As I wasn’t entirely sure how to handle the matter in my own business, I felt it deserved some exploration."}, {"eb92": "What’s a leader’s role when a divisive political climate enters the workplace?"}, {"a1ef": "I’m still very much in the process of figuring this one out, but here are a few areas of thought I’m exploring."}, {"21f5": "1. To show your hand or not"}, {"8ed0": "Some CEOs have come out in support of the current administration and some have come out to denounce it. Your company’s image will be affected on either side of the coin."}, {"2030": "Whether you choose to show your hand or not, you need to weigh the risks and ensure that it’s in the best interest of your people and your company versus your own interests. Taking sides can have an alienating impact on some and an ameliorative impact on others. If a demand for your voice isn’t requested, then your voice might be best served in a bipartisan fashion."}, {"d4c7": "Howard Schultz, the CEO of Starbucks, publicly endorsed Hillary Clinton, but also sent a thoughtful letter to the entire company after Trump was elected, urging everyone to choose compassion and understanding as we moved forward as a country."}, {"c57c": "Bernie Marcus, co-founder of Home Depot, published a pro-Trump letter prior to the election, confident that Trump would be positive for business growth."}, {"d81b": "Amazon’s CEO, Jeff Bezos, was an outspoken critic of Trump during the election process, but continued to sell Trump-related products on Amazon. Post-election, Bezos offered a conciliatory tweet wishing Trump success."}, {"15ec": "If you do speak out, personalize your story to clarify your motivation. It’s easier to empathize and relate when the narrative is more personal rather than political."}, {"908b": "Here’s some great reading on this topic:"}, {"5f33": "Navigating Political Talk at Work We know that work is one of the leading causes of stress for American adults. But in the aftermath of a heated…hbr.org"}, {"f612": "2. See it as a strange opportunity"}, {"92b3": "The current political climate — if it is leaking into your workplace — is a perfect excuse to confront conscious and unconscious biases: biases of which we are unaware but are responsible for interfering with good decision-making, clear thinking, effective problem solving, healthy relationships, and even creativity."}, {"0c39": "It’s imperative for biases to be identified so everyone can spot them when they rear their ugly heads. If we can better understand our biases, we can better counteract them. Use this as an opportunity to teach and train."}, {"e9f8": "You can implement training and workshops that focus on developing self-awareness around biases, and tools to counteract them. This will only make your workforce stronger in the future."}, {"4e01": "3. Use it as a chance to flex your empathy muscle"}, {"dd45": "The bottom line is this is rough for both sides. Perhaps too much time has passed at this point but other divisive issues will surely arise in the future, whether political or other."}, {"5678": "Use these times to acknowledge and validate the feelings of others. When you acknowledge and validate, it makes people feel heard and understood. It creates a foundation of safety knowing that it’s okay to have differing opinions, as long as respect permeates the culture. As a leader you have an opportunity to set the climate and to model empathetic behavior."}, {"040f": "4. Focus on your shared ideology"}, {"b324": "Everyone who works together needs to realize that one’s political affiliation does not make them a bad person nor professionally incompetent. Ultimately, the diversity can only help, both the company and the employees of the company."}, {"a752": "After all, why would we want everyone to think the same in our organization anyway? That just leads to groupthink, status quo, and the acceptance of the group’s version of “common knowledge.”"}, {"917f": "A variety of beliefs in a cooperative culture is what you want; it’s what we all want for our society. You can create a microcosm of the perfect society within your organization where diversity is cultivated and respected."}, {"6210": "Doing this is no easy task. It requires willingness on the part of the leader and the employees. It requires an open mind, compassion, and ultimately a time commitment to understand opposing views. But if politics are bleeding into your workplace and causing chasms, this is an opportunity to dig deeper. This is an opportunity to create a cooperative culture that values diversity in opinion, challenges bias, and strengthens ties."}, {"06ed": "Whether this is done through a workshop or conversations, leaders and coworkers can come together in a safe space to elucidate how their views were shaped and what the background causes and conditions were that shaped them."}, {"eec7": "One person’s collective life experience leads them down the road to becoming a staunch 2nd amendment supporter while another person’s life experience leads them down the road to a becoming a staunch 2nd amendment antagonist. There are reasons for their views and they exist somewhere in the murky past."}, {"9471": "When you start to see why Person X believes what they do the tempers can hopefully soften, understanding can increase and some powerful progress can be made toward cooperation."}, {"6f06": "The reasons may not seem justified or sound to either person but the feelings behind them will be human and relatable. It is here where cooperation and humanness starts. The more you challenge your workers to be open, flex their empathy muscles and challenge their own biases, the more likely this behavior is to trickle down to your customers (and to their lives outside of work)."}, {"2fdb": "This is no easy task for anyone. This is psychology and psychology is messy. A leader’s challenges during this politically divisive time is to bring everyone together, to validate the realities felt by all, and see it as an opportunity for the company to become something more expansive than it was prior."}, {"7ead": "I recognize this is a utopian workspace I am painting. I don’t think we’re there yet but you can start somewhere with this utopian goal in mind. We make progress with baby steps."}, {"4723": "If you have tried certain things in your own company or have ideas about this, please share, as this is uncharted territory that we can all learn from!"}, {"9ccb": "If you enjoyed this article, please click the heart! ❤"}, {"1848": "Follow Nicole on Twitter, Facebook, LinkedIn, and Instagram."}, {"3f50": "Nicole Lipkin, Psy.D., MBA is an organizational psychologist and the CEO of Equilibria Leadership Consulting. She is the author of “What Keeps Leaders Up At Night” and the co-author of “Y in the Workplace: Managing the ‘Me First’ Generation.”"}], "content": "The New Rules About Politics and Work I recently found myself in unchartered waters. Employees at my company were sending around group emails discussing the outcome of the election. Unbeknownst to them, there were a couple of employees in the mix that held opposing views and took offense to the emails. One of the folks with an opposing view spoke with me about it and I found myself giving the old rule of “don’t mix politics and work” some new consideration. And I’m not alone. CEOs everywhere are trying to figure out the new rules around politics and work, some with dramatic consequences: It’s fair to say at this point that the rule of “no politics in the workplace” isn’t quite robust enough. This can create conflict for teams and coworkers working under the same roof who need to get along and work toward the same goal. As I wasn’t entirely sure how to handle the matter in my own business, I felt it deserved some exploration. What’s a leader’s role when a divisive political climate enters the workplace? I’m still very much in the process of figuring this one out, but here are a few areas of thought I’m exploring. 1. To show your hand or not Some CEOs have come out in support of the current administration and some have come out to denounce it. Your company’s image will be affected on either side of the coin. Whether you choose to show your hand or not, you need to weigh the risks and ensure that it’s in the best interest of your people and your company versus your own interests. Taking sides can have an alienating impact on some and an ameliorative impact on others. If a demand for your voice isn’t requested, then your voice might be best served in a bipartisan fashion. Howard Schultz, the CEO of Starbucks, publicly endorsed Hillary Clinton, but also sent a thoughtful letter to the entire company after Trump was elected, urging everyone to choose compassion and understanding as we moved forward as a country. Bernie Marcus, co-founder of Home Depot, published a pro-Trump letter prior to the election, confident that Trump would be positive for business growth. Amazon’s CEO, Jeff Bezos, was an outspoken critic of Trump during the election process, but continued to sell Trump-related products on Amazon. Post-election, Bezos offered a conciliatory tweet wishing Trump success. If you do speak out, personalize your story to clarify your motivation. It’s easier to empathize and relate when the narrative is more personal rather than political. Here’s some great reading on this topic: Navigating Political Talk at Work We know that work is one of the leading causes of stress for American adults. But in the aftermath of a heated…hbr.org 2. See it as a strange opportunity The current political climate — if it is leaking into your workplace — is a perfect excuse to confront conscious and unconscious biases: biases of which we are unaware but are responsible for interfering with good decision-making, clear thinking, effective problem solving, healthy relationships, and even creativity. It’s imperative for biases to be identified so everyone can spot them when they rear their ugly heads. If we can better understand our biases, we can better counteract them. Use this as an opportunity to teach and train. You can implement training and workshops that focus on developing self-awareness around biases, and tools to counteract them. This will only make your workforce stronger in the future. 3. Use it as a chance to flex your empathy muscle The bottom line is this is rough for both sides. Perhaps too much time has passed at this point but other divisive issues will surely arise in the future, whether political or other. Use these times to acknowledge and validate the feelings of others. When you acknowledge and validate, it makes people feel heard and understood. It creates a foundation of safety knowing that it’s okay to have differing opinions, as long as respect permeates the culture. As a leader you have an opportunity to set the climate and to model empathetic behavior. 4. Focus on your shared ideology Everyone who works together needs to realize that one’s political affiliation does not make them a bad person nor professionally incompetent. Ultimately, the diversity can only help, both the company and the employees of the company. After all, why would we want everyone to think the same in our organization anyway? That just leads to groupthink, status quo, and the acceptance of the group’s version of “common knowledge.” A variety of beliefs in a cooperative culture is what you want; it’s what we all want for our society. You can create a microcosm of the perfect society within your organization where diversity is cultivated and respected. Doing this is no easy task. It requires willingness on the part of the leader and the employees. It requires an open mind, compassion, and ultimately a time commitment to understand opposing views. But if politics are bleeding into your workplace and causing chasms, this is an opportunity to dig deeper. This is an opportunity to create a cooperative culture that values diversity in opinion, challenges bias, and strengthens ties. Whether this is done through a workshop or conversations, leaders and coworkers can come together in a safe space to elucidate how their views were shaped and what the background causes and conditions were that shaped them. One person’s collective life experience leads them down the road to becoming a staunch 2nd amendment supporter while another person’s life experience leads them down the road to a becoming a staunch 2nd amendment antagonist. There are reasons for their views and they exist somewhere in the murky past. When you start to see why Person X believes what they do the tempers can hopefully soften, understanding can increase and some powerful progress can be made toward cooperation. The reasons may not seem justified or sound to either person but the feelings behind them will be human and relatable. It is here where cooperation and humanness starts. The more you challenge your workers to be open, flex their empathy muscles and challenge their own biases, the more likely this behavior is to trickle down to your customers (and to their lives outside of work). This is no easy task for anyone. This is psychology and psychology is messy. A leader’s challenges during this politically divisive time is to bring everyone together, to validate the realities felt by all, and see it as an opportunity for the company to become something more expansive than it was prior. I recognize this is a utopian workspace I am painting. I don’t think we’re there yet but you can start somewhere with this utopian goal in mind. We make progress with baby steps. If you have tried certain things in your own company or have ideas about this, please share, as this is uncharted territory that we can all learn from! If you enjoyed this article, please click the heart! ❤ Follow Nicole on Twitter, Facebook, LinkedIn, and Instagram. Nicole Lipkin, Psy.D., MBA is an organizational psychologist and the CEO of Equilibria Leadership Consulting. She is the author of “What Keeps Leaders Up At Night” and the co-author of “Y in the Workplace: Managing the ‘Me First’ Generation.” ", "child": "917_1\t917_2\t917_3\t917_4\t917_5\t917_6917_1\t917_2\t917_3\t917_4\t917_5\t917_6"}