{"name": "922", "parent": "", "title": "Tips for Beginner’s Mind: Starting Fresh 20 Years Into My Career", "sentences": [{"81d3": "Tips for Beginner’s Mind: Starting Fresh 20 Years Into My Career"}, {"5c32": "Starting something new can be scary. And, I’d like to say that this gets easier with age, but I’d be lying."}, {"aa82": "Joining a new organization as a senior newbie (aka “snewbie”) can be equally as challenging as starting straight out of school. It’s just that the challenges are different."}, {"5090": "Companies hire senior employees, like me, for who we are and for our experience. As a senior hire, part of my experience is having demonstrated that I’ve learned to learn, and adapted to adapting. But, I’ve also learned particular ways of doing things. I’ve got an extensive databank of what I’ve seen succeed and fail, and an innate knowledge of potential options when our company is faced with difficult decisions."}, {"e341": "And yet, when I’ve tried forcing what I’ve learned from Job N onto Job N+1, especially in the earliest days of a new job, it’s typically backfired."}, {"1969": "Organizations are unique. Companies have unique, thriving, and admired cultures, and a set of effective engineering and business practices that have evolved over years of learning. Despite my gray hair, I am still a beginner here, a snewbie in this context."}, {"8de5": "My advice to snewbies everywhere? Approach a new job with radical openness, and a radical lack of preconceptions."}, {"e029": "This is what Zen Buddhists call shoshin, or “Beginner’s Mind.” But, don’t be fooled: shoshin is hard. It consumes the same level of mental energy needed to break a bad habit or build a healthy one. If, however, you are able to go back to basics and truly cultivate your “Beginner’s Mind,” you will be able to gain the perspective you need to focus on driving future change in the company."}, {"9214": "Let’s explore how to become a shoshin master with these five tips…"}, {"8af7": "1.Be a sponge. Start by listening and learning. Set aside what you know, just for a bit. Immerse yourself. Take the time to understand how things are done and why they are done that way."}, {"569d": "There will be a time and place to bring experiences to bear, but first, absorb. Later, remember to fold in those precious past experiences. You can do some serious alchemy with that. Don’t try it too quickly. Don’t forego the opportunity to first integrate into your new world."}, {"983f": "Ironically, this is where junior hires have it a little easier: they don’t have much to forget. They don’t have habits to unlearn."}, {"63b7": "Experience is a double edged sword: wielded properly, experiences can make one more powerful. Wielded improperly, experiences can incur self-inflicted wounds. Recovery may be painful."}, {"4520": "2. Assume truth, seek understanding. You must be smart: that’s why you were hired. But the same is true for everyone else at your company. One might assume that, by default, smart people generally have good reasons for doing what they do. I still find, however, that when I run into something unfamiliar my reflex is to challenge it when, instead, it would be better to react with genuine questions and sincerely pursue the “why.”"}, {"11f3": "Curiosity, unburdened by the baggage of judgement, is the universal solvent."}, {"b574": "When I encounter something I don’t understand (a technology choice, our culture, business processes), there are two paths to travel:"}, {"f4b6": "3. Earn respect. As a senior new hire, it may be natural to believe that given your years of experience, people should respect you on your first day here. Natural perhaps, but unrealistic."}, {"b528": "We are all due respect in the sense of courtesy, but respect in the reputation sense can’t be imported off one’s resume."}, {"884e": "While my experience helped me get hired, it doesn’t create respect. I must earn it. I can do this by producing great results. Great results earn one the right to challenge the status quo. That’s true here at HubSpot, and almost everywhere as well."}, {"0c73": "If you have a lot of experience, but don’t feel like you are getting the respect you deserve, ask yourself what could I do to better succeed here? Have I committed to earning respect? Ask people what they think of your ideas or why people aren’t agreeing with them and gird yourself for some real feedback. Yes, feedback can be tough. But it’s tough love. It’s the breakfast of champions."}, {"7502": "4. Build relationships. What I’ve learned slowly and late in my career is that building strong relationships is a strategic investment. Effective relationships are a platform on which everything else rests, but they take time and care to cultivate."}, {"ec4f": "Building good relationships begins on the first day. This has 10–100X the value of importing best practices from your last job. In fact, it’s almost impossible to effectively bring in best practices until you build the relationships. People at any company have a collection of shared experiences accumulated over time that don’t include you. This is for no other reason than you weren’t here."}, {"fb53": "But now that you are here, those shared experiences can start to include you if you take a hands-on approach to making it happen. It’s hard, and it’s brutally hard for introverts like me. But hard things often have a big payoff. Just as a 1,000 mile journey begins with a single step, relationships begin one conversation at a time. Start small: if you don’t want to invite someone to lunch, ask instead what they did over the weekend, or what they worked on this morning."}, {"9b65": "5. Be confident. Once you are hired as a snewbie, your reputation is no longer built on all of the amazing things you know, but rather on your ability. And moving forward, your reputation must be built on that ability, not on your knowledge. This takes considerable self-confidence. As C.S. Lewis wrote, “Humility is not thinking less of yourself; it is thinking of yourself less.”"}, {"987f": "Yes, my knowledge can be extremely useful to my new company. It will probably help me change the company for the better…but only after I first learn and understand how the organization works, and why it works that way. That’s my platform. With that underneath me, the alchemy of mixing in all of the good stuff I brought with me from past places can create some real magic."}, {"6ec2": "OK, how hard is it to be gray, really?"}, {"5cc6": "As I consider my experience here at HubSpot, and earlier snewbie experiences in my career, I acknowledge that it may not be natural to blossom as a snewbie. But, when one adopts Beginner’s Mind, it’s actually easier for a snewbie to adapt quickly to life at any new organization."}, {"055e": "When you choose to accept shoshin, your efforts come alive with an element of flow and speed. Friction melts into the ether, the wind’s at your back, the road feels wide open. Without shoshin, however, it’s a painstaking slog, gummed up by resistance, frustration, and the nagging mental refrain that everyone else is the problem, and they’re just not getting it."}, {"4943": "Choose shoshin, snewbie."}, {"0bd2": "Epilogue: Everyone can benefit from beginner’s mind. This post isn’t just for snewbies. Been-there-done-that thinking is an equal opportunity pothole we can all fall into."}, {"f206": "Beginner’s Mind is a homebase to which we can all return from time to time, to see the world with fresh eyes."}, {"eb2f": "That rings true for every member of a team: co-ops, fresh grads, early careerists, snewbies, ex-snewbies who think they have graduated, managers, VPs, founders, board members, stockholders, and even customers."}, {"3ee5": "Let’s remember that we have so much to learn from snewbies. They’ve picked up some battle scars out there, and that’s not only worth of respect, but it’s a monster asset. Snewbies can really help us scale. While they are cultivating shoshin in learning the ropes of a new organization, we can all cultivate shoshin in welcoming and learning from them."}, {"585e": "So the next time a snewbie offers you an opening bid of shoshin, see their shoshin, and raise the bid. As Confucius said, “Real knowledge is to know the extent of one’s ignorance.” Einstein, in typical fashion, used a formula: Ego = 1 / Knowledge."}, {"17c7": "Inspired? Click the 💚 to help other people find this article."}], "content": "Tips for Beginner’s Mind: Starting Fresh 20 Years Into My Career Starting something new can be scary. And, I’d like to say that this gets easier with age, but I’d be lying. Joining a new organization as a senior newbie (aka “snewbie”) can be equally as challenging as starting straight out of school. It’s just that the challenges are different. Companies hire senior employees, like me, for who we are and for our experience. As a senior hire, part of my experience is having demonstrated that I’ve learned to learn, and adapted to adapting. But, I’ve also learned particular ways of doing things. I’ve got an extensive databank of what I’ve seen succeed and fail, and an innate knowledge of potential options when our company is faced with difficult decisions. And yet, when I’ve tried forcing what I’ve learned from Job N onto Job N+1, especially in the earliest days of a new job, it’s typically backfired. Organizations are unique. Companies have unique, thriving, and admired cultures, and a set of effective engineering and business practices that have evolved over years of learning. Despite my gray hair, I am still a beginner here, a snewbie in this context. My advice to snewbies everywhere? Approach a new job with radical openness, and a radical lack of preconceptions. This is what Zen Buddhists call shoshin, or “Beginner’s Mind.” But, don’t be fooled: shoshin is hard. It consumes the same level of mental energy needed to break a bad habit or build a healthy one. If, however, you are able to go back to basics and truly cultivate your “Beginner’s Mind,” you will be able to gain the perspective you need to focus on driving future change in the company. Let’s explore how to become a shoshin master with these five tips… 1.Be a sponge. Start by listening and learning. Set aside what you know, just for a bit. Immerse yourself. Take the time to understand how things are done and why they are done that way. There will be a time and place to bring experiences to bear, but first, absorb. Later, remember to fold in those precious past experiences. You can do some serious alchemy with that. Don’t try it too quickly. Don’t forego the opportunity to first integrate into your new world. Ironically, this is where junior hires have it a little easier: they don’t have much to forget. They don’t have habits to unlearn. Experience is a double edged sword: wielded properly, experiences can make one more powerful. Wielded improperly, experiences can incur self-inflicted wounds. Recovery may be painful. 2. Assume truth, seek understanding. You must be smart: that’s why you were hired. But the same is true for everyone else at your company. One might assume that, by default, smart people generally have good reasons for doing what they do. I still find, however, that when I run into something unfamiliar my reflex is to challenge it when, instead, it would be better to react with genuine questions and sincerely pursue the “why.” Curiosity, unburdened by the baggage of judgement, is the universal solvent. When I encounter something I don’t understand (a technology choice, our culture, business processes), there are two paths to travel: 3. Earn respect. As a senior new hire, it may be natural to believe that given your years of experience, people should respect you on your first day here. Natural perhaps, but unrealistic. We are all due respect in the sense of courtesy, but respect in the reputation sense can’t be imported off one’s resume. While my experience helped me get hired, it doesn’t create respect. I must earn it. I can do this by producing great results. Great results earn one the right to challenge the status quo. That’s true here at HubSpot, and almost everywhere as well. If you have a lot of experience, but don’t feel like you are getting the respect you deserve, ask yourself what could I do to better succeed here? Have I committed to earning respect? Ask people what they think of your ideas or why people aren’t agreeing with them and gird yourself for some real feedback. Yes, feedback can be tough. But it’s tough love. It’s the breakfast of champions. 4. Build relationships. What I’ve learned slowly and late in my career is that building strong relationships is a strategic investment. Effective relationships are a platform on which everything else rests, but they take time and care to cultivate. Building good relationships begins on the first day. This has 10–100X the value of importing best practices from your last job. In fact, it’s almost impossible to effectively bring in best practices until you build the relationships. People at any company have a collection of shared experiences accumulated over time that don’t include you. This is for no other reason than you weren’t here. But now that you are here, those shared experiences can start to include you if you take a hands-on approach to making it happen. It’s hard, and it’s brutally hard for introverts like me. But hard things often have a big payoff. Just as a 1,000 mile journey begins with a single step, relationships begin one conversation at a time. Start small: if you don’t want to invite someone to lunch, ask instead what they did over the weekend, or what they worked on this morning. 5. Be confident. Once you are hired as a snewbie, your reputation is no longer built on all of the amazing things you know, but rather on your ability. And moving forward, your reputation must be built on that ability, not on your knowledge. This takes considerable self-confidence. As C.S. Lewis wrote, “Humility is not thinking less of yourself; it is thinking of yourself less.” Yes, my knowledge can be extremely useful to my new company. It will probably help me change the company for the better…but only after I first learn and understand how the organization works, and why it works that way. That’s my platform. With that underneath me, the alchemy of mixing in all of the good stuff I brought with me from past places can create some real magic. OK, how hard is it to be gray, really? As I consider my experience here at HubSpot, and earlier snewbie experiences in my career, I acknowledge that it may not be natural to blossom as a snewbie. But, when one adopts Beginner’s Mind, it’s actually easier for a snewbie to adapt quickly to life at any new organization. When you choose to accept shoshin, your efforts come alive with an element of flow and speed. Friction melts into the ether, the wind’s at your back, the road feels wide open. Without shoshin, however, it’s a painstaking slog, gummed up by resistance, frustration, and the nagging mental refrain that everyone else is the problem, and they’re just not getting it. Choose shoshin, snewbie. Epilogue: Everyone can benefit from beginner’s mind. This post isn’t just for snewbies. Been-there-done-that thinking is an equal opportunity pothole we can all fall into. Beginner’s Mind is a homebase to which we can all return from time to time, to see the world with fresh eyes. That rings true for every member of a team: co-ops, fresh grads, early careerists, snewbies, ex-snewbies who think they have graduated, managers, VPs, founders, board members, stockholders, and even customers. Let’s remember that we have so much to learn from snewbies. They’ve picked up some battle scars out there, and that’s not only worth of respect, but it’s a monster asset. Snewbies can really help us scale. While they are cultivating shoshin in learning the ropes of a new organization, we can all cultivate shoshin in welcoming and learning from them. So the next time a snewbie offers you an opening bid of shoshin, see their shoshin, and raise the bid. As Confucius said, “Real knowledge is to know the extent of one’s ignorance.” Einstein, in typical fashion, used a formula: Ego = 1 / Knowledge. Inspired? Click the 💚 to help other people find this article. ", "child": "922_1\t922_2"}