{"name": "923", "parent": "", "title": "Fostering Transparency And Community With A Public Roadmap", "sentences": [{"32f2": "Fostering Transparency And Community With A Public Roadmap"}, {"6618": "Effective communication between a product and its users is tricky. Gaining insights and feedback is important, but how do you then convey your plan back to the users?"}, {"a833": "Public roadmapping for a product can be a transparent way to respond to users and communicate realistic plans for your product."}, {"a50e": "Last year at Front we decided to make our product roadmap public. Everyone can see which features we’ve been working on, where they are in development, as well as future ideas. Everyone can vote for the features they want to see implemented in Front."}, {"2b4c": "Our roadmap is built entirely with Trello."}, {"35e5": "Trello already had all the capabilities we needed to strike the correct balance between transparency and control: cards are visible by everyone and everyone has the ability to vote on them, but only members of the team can push new idea cards. Should you want to build your own, here are the detailed instructions."}, {"4a12": "When we launched this public roadmap, we didn’t think much of it. A year later, we can give a definitive answer: the public roadmap is a huge success!"}, {"508e": "Here’s why, despite some misconceptions, your company may benefit from a public roadmap too."}, {"8371": "Dispelling The Competitor Myth"}, {"b48c": "Some people think we are crazy to launch a public roadmap. Their main concern is that our plans are visible to our competitors, thus making it easy for the other guys to see what we are up to and beat us at our own game. We disagree; instead we are taking a page out of Elon Musk’s book."}, {"2884": "In late 2015, Musk’s company SpaceX finally managed to land the first stage of its space rocket, opening the possibility of reusable parts and much cheaper launches in the future. This initiative has been on the SpaceX roadmap for many years. Were they concerned that a competitor might come along, see this brilliant idea, and start landing rockets? Not so much. They knew the difficult, yet valuable aspect was not the idea of reusable rocket stages, but to actually implement it in the real world."}, {"0e01": "Of course, I’m not saying we’re doing rocket science here, but we also don’t plan on winning with ideas alone: we know execution is everything."}, {"df13": "If we can’t beat our competition on execution, we can’t win."}, {"3574": "Why Transparency Builds A Community"}, {"402a": "Building a community of users around a B2B product is not easy. There are not a lot of people sharing a pre-existing passion for customer support, or email clients, so we didn’t expect our users to spontaneously start talking about Front."}, {"b190": "To encourage them to open up and discuss what we were making, we had to meet them halfway and give them things to talk about. The public roadmap is a huge part of this effort. When users send us feedback, instead of telling them that “we’re adding it the roadmap,” we literally add it to the public roadmap for them to see. From then on, they can vote on the feature, see how other users receive the suggestion, and influence the rest of the roadmap. They get a sense of ownership on a product they use every day, and we get good suggestions to improve that product: win-win!"}, {"7e33": "In return, the community motivates us to make better decisions, and faster. We know what to build, and how to prioritize each feature. Big companies spend huge amounts of money on market research to make up for this broken link between their community of users and their decision-making process. We hope that by being transparent, we’ll be able to maintain a durable connection with ours, so that we will always know what they expect from us."}, {"69e7": "All those product-related benefits are expected — after all, they are the reason why we built a public roadmap in the first place. But we also got much more surprising, positive results in areas we didn’t really expect."}, {"2817": "Benefitting Internally: A Surprise Finding"}, {"3885": "Product management can give the impression that it operates in a vacuum: someone comes up with a feature idea, and all of a sudden everybody must work to ship it as fast as possible. But with a public roadmap reflecting the opinions of the users, company priorities are much more relatable."}, {"2aa9": "Knowing that people will be genuinely happy to see a feature shipped makes a big difference. You’re no longer just working for your boss; you now have a direct connection with the users, and you know your work makes a difference for them."}, {"94f3": "Attracting Top Talent"}, {"7a16": "Ever since we released the roadmap, almost all candidates brought it up during their interviews, mentioning it as an important factor in their decision to apply. As it turns out, the transparency of a company is one of the most important criteria by which people judge a prospective employer."}, {"3376": "Often candidates are willing to forgive huge “household name” companies for their lack of transparency because their brand name makes up for it. Startups, however, sit at the exact opposite: with very little brand recognition, they cannot just claim to be transparent (as they all do), they actually have to prove it."}, {"ecd7": "Added Bonus Of Social Proof"}, {"ec13": "Comparing and contrasting B2B tools isn’t exactly riveting fodder for water cooler discussion. And even fewer users mention these tools on their social networks. When was the last time a friend of yours tweeted about the awesome accounting software their company uses?"}, {"4565": "That was the best surprise about the release of our public roadmap: people actually talked about it on social media!"}, {"24b5": "A community is not a natural occurrence; you have to consciously build it. It’s a game of give and take."}, {"4358": "In our case at Front being transparent with our users meant they felt comfortable engaging with our product, and ultimately providing us with valuable feedback."}, {"4d15": "Was this post valuable? Click the 💚 so other people can find it."}, {"c8b5": "This article was initially published on Trello’s blog."}], "content": "Fostering Transparency And Community With A Public Roadmap Effective communication between a product and its users is tricky. Gaining insights and feedback is important, but how do you then convey your plan back to the users? Public roadmapping for a product can be a transparent way to respond to users and communicate realistic plans for your product. Last year at Front we decided to make our product roadmap public. Everyone can see which features we’ve been working on, where they are in development, as well as future ideas. Everyone can vote for the features they want to see implemented in Front. Our roadmap is built entirely with Trello. Trello already had all the capabilities we needed to strike the correct balance between transparency and control: cards are visible by everyone and everyone has the ability to vote on them, but only members of the team can push new idea cards. Should you want to build your own, here are the detailed instructions. When we launched this public roadmap, we didn’t think much of it. A year later, we can give a definitive answer: the public roadmap is a huge success! Here’s why, despite some misconceptions, your company may benefit from a public roadmap too. Dispelling The Competitor Myth Some people think we are crazy to launch a public roadmap. Their main concern is that our plans are visible to our competitors, thus making it easy for the other guys to see what we are up to and beat us at our own game. We disagree; instead we are taking a page out of Elon Musk’s book. In late 2015, Musk’s company SpaceX finally managed to land the first stage of its space rocket, opening the possibility of reusable parts and much cheaper launches in the future. This initiative has been on the SpaceX roadmap for many years. Were they concerned that a competitor might come along, see this brilliant idea, and start landing rockets? Not so much. They knew the difficult, yet valuable aspect was not the idea of reusable rocket stages, but to actually implement it in the real world. Of course, I’m not saying we’re doing rocket science here, but we also don’t plan on winning with ideas alone: we know execution is everything. If we can’t beat our competition on execution, we can’t win. Why Transparency Builds A Community Building a community of users around a B2B product is not easy. There are not a lot of people sharing a pre-existing passion for customer support, or email clients, so we didn’t expect our users to spontaneously start talking about Front. To encourage them to open up and discuss what we were making, we had to meet them halfway and give them things to talk about. The public roadmap is a huge part of this effort. When users send us feedback, instead of telling them that “we’re adding it the roadmap,” we literally add it to the public roadmap for them to see. From then on, they can vote on the feature, see how other users receive the suggestion, and influence the rest of the roadmap. They get a sense of ownership on a product they use every day, and we get good suggestions to improve that product: win-win! In return, the community motivates us to make better decisions, and faster. We know what to build, and how to prioritize each feature. Big companies spend huge amounts of money on market research to make up for this broken link between their community of users and their decision-making process. We hope that by being transparent, we’ll be able to maintain a durable connection with ours, so that we will always know what they expect from us. All those product-related benefits are expected — after all, they are the reason why we built a public roadmap in the first place. But we also got much more surprising, positive results in areas we didn’t really expect. Benefitting Internally: A Surprise Finding Product management can give the impression that it operates in a vacuum: someone comes up with a feature idea, and all of a sudden everybody must work to ship it as fast as possible. But with a public roadmap reflecting the opinions of the users, company priorities are much more relatable. Knowing that people will be genuinely happy to see a feature shipped makes a big difference. You’re no longer just working for your boss; you now have a direct connection with the users, and you know your work makes a difference for them. Attracting Top Talent Ever since we released the roadmap, almost all candidates brought it up during their interviews, mentioning it as an important factor in their decision to apply. As it turns out, the transparency of a company is one of the most important criteria by which people judge a prospective employer. Often candidates are willing to forgive huge “household name” companies for their lack of transparency because their brand name makes up for it. Startups, however, sit at the exact opposite: with very little brand recognition, they cannot just claim to be transparent (as they all do), they actually have to prove it. Added Bonus Of Social Proof Comparing and contrasting B2B tools isn’t exactly riveting fodder for water cooler discussion. And even fewer users mention these tools on their social networks. When was the last time a friend of yours tweeted about the awesome accounting software their company uses? That was the best surprise about the release of our public roadmap: people actually talked about it on social media! A community is not a natural occurrence; you have to consciously build it. It’s a game of give and take. In our case at Front being transparent with our users meant they felt comfortable engaging with our product, and ultimately providing us with valuable feedback. Was this post valuable? Click the 💚 so other people can find it. This article was initially published on Trello’s blog. ", "child": "923_1\t923_2"}