{"name": "926", "parent": "", "title": "30,469 Sales Calls Reveal Women Violate The Rules of Selling, Yet Still Close More Deals Than Men", "sentences": [{"4e46": "30,469 Sales Calls Reveal Women Violate The Rules of Selling, Yet Still Close More Deals Than Men"}, {"b8a7": "Help me unpack this data with your personal observations"}, {"4e9a": "Women “listen” less than men."}, {"f52d": "Women interrupt their customers more than men."}, {"b516": "In fact, by every measure so far, men follow “the rules of selling” better than women do…"}, {"79e0": "… at least on paper."}, {"69a2": "Recently, our data science team at Gong.io sat down to analyze how men and women sell differently. And I must admit, I’m a bit stumped by the results so far."}, {"70e3": "Despite the “sins of selling” listed above, women are still managing to close deals at a higher rate. Keep reading to learn more. After you check out the results, I’d love for you to help me figure out why this is happening in the comments below."}, {"8f36": "How we got the data: analyzing 30,469 segmented sales calls with AI"}, {"6134": "Before I jump into the results, let me outline how we did this."}, {"e79d": "30,469 B2B sales calls were recorded, speaker-separated, transcribed, and analyzed using Gong’s self-learning conversation analytics engine."}, {"13e9": "All of the calls that were analyzed were pulled from companies that are highly similar to each other — same industry, similar sales cycle lengths and deal sizes, etc."}, {"aeea": "Further, while we couldn’t guarantee all of the sales reps had similar backgrounds and experience (realizing that’s a key part to this story), the analysis was done on fully on-boarded reps rather than new sellers."}, {"f992": "Here are the patterns we’ve found (so far)."}, {"c831": "Who “listens” better: men or women?"}, {"4858": "If you look at the data (and nothing else), you would conclude that men listen better than women."}, {"6de8": "In the analysis, men, on average had a 42:58 talk-to-listen ratio, while women averaged 46:54, talking 9% more often than men."}, {"a6c0": "Not a huge difference. But wait, there’s more. . ."}, {"7adc": "Men interrupt their prospect an average of 4.2x per hour. Women? 6.3x per hour — about 50% more often."}, {"bd1e": "Men also pause before responding longer than women on average: 1.5 seconds vs. 1.3 seconds."}, {"c681": "And finally, women tend to go on “monologues” longer (and more often) than men do. By “monologue,” I mean an uninterrupted streak of talking without the customer chiming in."}, {"a2f5": "When men go off on a monologue, they average 116 seconds. Women average 130 seconds."}, {"d0fc": "If you’ve spent much time in the sales profession, you’d start to conclude that men are the superior salespeople after looking at this data."}, {"87ee": "Which is why the next data point wracked my brain…"}, {"eabd": "Despite these “broken rules,” women are closing more deals"}, {"2b48": "Even though the above data paints women as lousy listeners, women progress deals to the next opportunity stage at a higher rate than men do."}, {"58a2": "They also close deals at a higher and faster rate than men."}, {"99cd": "In our dataset, men had a 49% likelihood of moving opportunities to the next stage, while women boasted 54%."}, {"da01": "And women’s win-rates were 11% higher than men’s (on average)."}, {"395a": "Let’s unpack what this could mean"}, {"ad80": "Now that I just data-dumped you, let’s think about what this could mean…"}, {"349b": "Science consists of both the quantitative (data), and qualitative aspects of a problem. One without the other doesn’t tell the full story."}, {"ee18": "In this case, the quantitative side of the story is looking at sales conversation analytics."}, {"6824": "The qualitative side of the story is listening to sales call recordings or observing them live to investigate what’s going on to flesh out the rest of the story."}, {"d094": "So, how are women breaking some of the traditional rules of selling, yet still getting more deals done?"}, {"3eb3": "Despite the fact that the data paints men as better listeners than women, for all we know, men could be twiddling their thumbs, thinking about something else entirely while they’re supposed to be listening to their customer."}, {"dd75": "Silence is not the same thing as listening."}, {"b77f": "Rambling versus persuading"}, {"ba73": "Tonni Bennett, VP Sales at Terminus had an interesting observation to offer. She provided an example that highlights how quantitative data only tells half of the story. It’s important to also understand the quality of the call."}, {"7610": "She once had two reps that both talked too much on calls: a male and a female."}, {"a15b": "When the male talked too much, he rambled on in a way that derailed the conversation and hurt his credibility. He would often answer simple “yes/no questions” with a long winded response that sparked more questions from the prospect."}, {"98e5": "While the woman also talked too much, she was usually making persuasive, strong selling points or sharing a customer story instead of rambling and going off on tangents."}, {"c08a": "Tossing nerf balls around the office"}, {"fc59": "Another female sales leader I know made the observation that she often sees men tossing around nerf footballs while on the phone with their customers."}, {"bc08": "How often do you see women doing something like that?"}, {"0193": "Your observations"}, {"38d5": "While there could be hundreds of other qualitative explanations of this, I’d like to save them for the comments. Help me unpack this. What are your qualitative explanations of this data?"}, {"1ec9": "Write your observations or thoughts below."}, {"5aea": "And if you thought this analysis was interesting, please hit the ❤-shaped button and share this so other sales pros may stumble upon this research."}], "content": "30,469 Sales Calls Reveal Women Violate The Rules of Selling, Yet Still Close More Deals Than Men Help me unpack this data with your personal observations Women “listen” less than men. Women interrupt their customers more than men. In fact, by every measure so far, men follow “the rules of selling” better than women do… … at least on paper. Recently, our data science team at Gong.io sat down to analyze how men and women sell differently. And I must admit, I’m a bit stumped by the results so far. Despite the “sins of selling” listed above, women are still managing to close deals at a higher rate. Keep reading to learn more. After you check out the results, I’d love for you to help me figure out why this is happening in the comments below. How we got the data: analyzing 30,469 segmented sales calls with AI Before I jump into the results, let me outline how we did this. 30,469 B2B sales calls were recorded, speaker-separated, transcribed, and analyzed using Gong’s self-learning conversation analytics engine. All of the calls that were analyzed were pulled from companies that are highly similar to each other — same industry, similar sales cycle lengths and deal sizes, etc. Further, while we couldn’t guarantee all of the sales reps had similar backgrounds and experience (realizing that’s a key part to this story), the analysis was done on fully on-boarded reps rather than new sellers. Here are the patterns we’ve found (so far). Who “listens” better: men or women? If you look at the data (and nothing else), you would conclude that men listen better than women. In the analysis, men, on average had a 42:58 talk-to-listen ratio, while women averaged 46:54, talking 9% more often than men. Not a huge difference. But wait, there’s more. . . Men interrupt their prospect an average of 4.2x per hour. Women? 6.3x per hour — about 50% more often. Men also pause before responding longer than women on average: 1.5 seconds vs. 1.3 seconds. And finally, women tend to go on “monologues” longer (and more often) than men do. By “monologue,” I mean an uninterrupted streak of talking without the customer chiming in. When men go off on a monologue, they average 116 seconds. Women average 130 seconds. If you’ve spent much time in the sales profession, you’d start to conclude that men are the superior salespeople after looking at this data. Which is why the next data point wracked my brain… Despite these “broken rules,” women are closing more deals Even though the above data paints women as lousy listeners, women progress deals to the next opportunity stage at a higher rate than men do. They also close deals at a higher and faster rate than men. In our dataset, men had a 49% likelihood of moving opportunities to the next stage, while women boasted 54%. And women’s win-rates were 11% higher than men’s (on average). Let’s unpack what this could mean Now that I just data-dumped you, let’s think about what this could mean… Science consists of both the quantitative (data), and qualitative aspects of a problem. One without the other doesn’t tell the full story. In this case, the quantitative side of the story is looking at sales conversation analytics. The qualitative side of the story is listening to sales call recordings or observing them live to investigate what’s going on to flesh out the rest of the story. So, how are women breaking some of the traditional rules of selling, yet still getting more deals done? Despite the fact that the data paints men as better listeners than women, for all we know, men could be twiddling their thumbs, thinking about something else entirely while they’re supposed to be listening to their customer. Silence is not the same thing as listening. Rambling versus persuading Tonni Bennett, VP Sales at Terminus had an interesting observation to offer. She provided an example that highlights how quantitative data only tells half of the story. It’s important to also understand the quality of the call. She once had two reps that both talked too much on calls: a male and a female. When the male talked too much, he rambled on in a way that derailed the conversation and hurt his credibility. He would often answer simple “yes/no questions” with a long winded response that sparked more questions from the prospect. While the woman also talked too much, she was usually making persuasive, strong selling points or sharing a customer story instead of rambling and going off on tangents. Tossing nerf balls around the office Another female sales leader I know made the observation that she often sees men tossing around nerf footballs while on the phone with their customers. How often do you see women doing something like that? Your observations While there could be hundreds of other qualitative explanations of this, I’d like to save them for the comments. Help me unpack this. What are your qualitative explanations of this data? Write your observations or thoughts below. And if you thought this analysis was interesting, please hit the ❤-shaped button and share this so other sales pros may stumble upon this research. ", "child": "926_1\t926_2\t926_3\t926_4\t926_5\t926_6\t926_7\t926_8\t926_9\t926_10\t926_11\t926_12\t926_13\t926_14\t926_15\t926_16\t926_17\t926_18\t926_19\t926_20\t926_21\t926_22\t926_23\t926_24\t926_25"}