{"name": "931", "parent": "", "title": "3 lessons I wish I knew when I started as a PM", "sentences": [{"53ee": "3 lessons I wish I knew when I started as a PM"}, {"d848": "There’s a lot of literature on product management, but it’s still a fairly new and evolving role. Some topics are uncovered and public, while others are taboo. Why?"}, {"236c": "My first couple of years as a PM were challenging. I had the impression that I’m the only one facing these hurdles."}, {"3ced": "For example, based on stories, tweets, Youtube videos, all companies seem to have comprehensive, reliable, ready-to-use data setups. But the more people I talk to, the more I find out that this is still far from reality. More on this later."}, {"25bb": "I realised that even though our role is different in every team, we’re facing similar problems. So when I read stories from people who do hands-on work, I’m happy to see we’re all in the same boat, but also intrigued to find out how others deal with these problems. Which is why I’m sharing three short, specific learnings."}, {"61a8": "1. Don’t become the team’s trashcan"}, {"323a": "The comparison of the PM being the magic, shape-shifting glue that fills the gaps certainly sounds cool. And while it is true that a PM covers a wide variety of tasks and does whatever is needed to get the job done, it’s easy to end up being the team’s garbage can where everyone just drops in their not-so-fun tasks."}, {"7c21": "A good example is QA. If you’re low on resources, the team might need to do manual testing. I’m not talking about acceptance tests, but the kind of tests where you open 3 different browsers and look for edge cases."}, {"a94c": "If you’re a fresh and enthusiastic PM, you’re likely to pick up this type of tasks and do them all by yourself. It sends a good message to the team, right? They can rely on you, you’re doing tedious work!"}, {"6e04": "Wrong."}, {"a439": "While doing things that nobody else wants to do is part of our job, if you don’t share non-core tasks across the whole team, you‘ll become a bottleneck. And what’s even worse is that this reduces the time spent on your core tasks."}, {"edb5": "A good team distributes responsibility across all members, it’s everyone’s duty to pick up tasks that would otherwise fall off the table."}, {"fae9": "2. Data-driven decision making"}, {"5277": "All companies became data-driven. And it happened overnight. They hired a data scientist, built up a data warehouse, fired up some Geckoboards and voilà, the big transformation happened."}, {"0982": "This is a dangerous place to be in, especially for product managers who are the main consumers of data."}, {"267a": "Taking decisions based on data is awesome. If you feel confident that it is reliable, you should go for it 24/7. But there are two common problems."}, {"b093": "First, collecting data is still experimental in most companies. There’s usually no clear strategy and the tagging plan is always work in progress. To everyone’s defense, it’s hard to decide what to measure and how. Even the fancy tools like Google Analytics 360, Mixpanel, Fabric or Hotjar are new. They don’t show the “beta” label anymore because we’re past the Web 2.0 days, but they change features and looks every other day."}, {"da08": "Second, converting data into insights is at least as hard as collecting. There are so many things going on that could affect your data! Seasonality, marketing campaigns, feature releases, bugs, the data gets easily skewed and understanding what happened becomes very hard."}, {"6154": "My tip: improve your tools and setup (some tend to skip this one. don’t!), try to make hypotheses, validate them, think of several effects, causation vs. correlation, but before all: do a sanity check."}, {"74f1": "Making decisions on incorrect data and false assumptions is worse than deciding on a healthy gut feeling."}, {"188b": "3. One-to-ones with team-members"}, {"fdf8": "As a new PM you might think that bilateral meetings are only for line managers."}, {"c99d": "Although the “official” version of these meetings happens with their direct superiors, you can and should have regular bilaterals with everyone you work with."}, {"fcfa": "By having one-to-ones, you can give & receive feedback to catch possible issues early and get insights into each individual’s life."}, {"a0f4": "The goal is to listen more and talk less. Use these meetings as a private retrospective where you decide together how to improve day to day work. An easy format that gets the talking going is the well-known “Keep, Develop, Drop”."}, {"f143": "So go on, open up your calendar and start scheduling. I’m sure you’ll find a good format for these meetings and you’ll see the benefits from day 1."}, {"7f27": "What did you learn during your first year as a PM? Happy to hear your responses."}], "content": "3 lessons I wish I knew when I started as a PM There’s a lot of literature on product management, but it’s still a fairly new and evolving role. Some topics are uncovered and public, while others are taboo. Why? My first couple of years as a PM were challenging. I had the impression that I’m the only one facing these hurdles. For example, based on stories, tweets, Youtube videos, all companies seem to have comprehensive, reliable, ready-to-use data setups. But the more people I talk to, the more I find out that this is still far from reality. More on this later. I realised that even though our role is different in every team, we’re facing similar problems. So when I read stories from people who do hands-on work, I’m happy to see we’re all in the same boat, but also intrigued to find out how others deal with these problems. Which is why I’m sharing three short, specific learnings. 1. Don’t become the team’s trashcan The comparison of the PM being the magic, shape-shifting glue that fills the gaps certainly sounds cool. And while it is true that a PM covers a wide variety of tasks and does whatever is needed to get the job done, it’s easy to end up being the team’s garbage can where everyone just drops in their not-so-fun tasks. A good example is QA. If you’re low on resources, the team might need to do manual testing. I’m not talking about acceptance tests, but the kind of tests where you open 3 different browsers and look for edge cases. If you’re a fresh and enthusiastic PM, you’re likely to pick up this type of tasks and do them all by yourself. It sends a good message to the team, right? They can rely on you, you’re doing tedious work! Wrong. While doing things that nobody else wants to do is part of our job, if you don’t share non-core tasks across the whole team, you‘ll become a bottleneck. And what’s even worse is that this reduces the time spent on your core tasks. A good team distributes responsibility across all members, it’s everyone’s duty to pick up tasks that would otherwise fall off the table. 2. Data-driven decision making All companies became data-driven. And it happened overnight. They hired a data scientist, built up a data warehouse, fired up some Geckoboards and voilà, the big transformation happened. This is a dangerous place to be in, especially for product managers who are the main consumers of data. Taking decisions based on data is awesome. If you feel confident that it is reliable, you should go for it 24/7. But there are two common problems. First, collecting data is still experimental in most companies. There’s usually no clear strategy and the tagging plan is always work in progress. To everyone’s defense, it’s hard to decide what to measure and how. Even the fancy tools like Google Analytics 360, Mixpanel, Fabric or Hotjar are new. They don’t show the “beta” label anymore because we’re past the Web 2.0 days, but they change features and looks every other day. Second, converting data into insights is at least as hard as collecting. There are so many things going on that could affect your data! Seasonality, marketing campaigns, feature releases, bugs, the data gets easily skewed and understanding what happened becomes very hard. My tip: improve your tools and setup (some tend to skip this one. don’t!), try to make hypotheses, validate them, think of several effects, causation vs. correlation, but before all: do a sanity check. Making decisions on incorrect data and false assumptions is worse than deciding on a healthy gut feeling. 3. One-to-ones with team-members As a new PM you might think that bilateral meetings are only for line managers. Although the “official” version of these meetings happens with their direct superiors, you can and should have regular bilaterals with everyone you work with. By having one-to-ones, you can give & receive feedback to catch possible issues early and get insights into each individual’s life. The goal is to listen more and talk less. Use these meetings as a private retrospective where you decide together how to improve day to day work. An easy format that gets the talking going is the well-known “Keep, Develop, Drop”. So go on, open up your calendar and start scheduling. I’m sure you’ll find a good format for these meetings and you’ll see the benefits from day 1. What did you learn during your first year as a PM? Happy to hear your responses. ", "child": "931_1"}