{"name": "936", "parent": "", "title": "Unlock honest feedback with this one word", "sentences": [{"4584": "Unlock honest feedback with this one word"}, {"a98a": "This one little word makes all the difference…"}, {"515b": "A few years ago, a CEO told me how she was struggling to get honest feedback from her board."}, {"08c1": "No one seemed willing to be critical or give her pointers on things she could improve. After every board meeting, she would turn to them and ask directly:"}, {"f8c5": "“What feedback does anyone have for me?”"}, {"4142": "She’d hear crickets. Every single time."}, {"4945": "No one would speak up. Even though they were board members — people who are supposed to hold her accountable as the CEO of the company — they shied away from offering their honest input."}, {"d7b1": "This was so perplexing to the CEO. She felt like she was being very clear with what she wanted… Why weren’t they just giving her the feedback she was asking for?"}, {"4ba1": "One day, she decided to try something different."}, {"736a": "Instead of asking, “What feedback does anyone have for me?”… she asked this:"}, {"1727": "“What advice does anyone have for me?”"}, {"77b9": "All of sudden, everyone started weighing in. “Well I might try this…” and “The way you brought up this point could’ve been better…” and “You could try structuring the meeting like this…”"}, {"212e": "The word “advice” unlocked all the honest feedback that CEO needed."}, {"2def": "Why? The word “feedback’” carries a lot of baggage. To some, they automatically associate it with a “critique” or something negative. It can seem scary and formal."}, {"a0c0": "But “advice” is a much more welcoming word. Advice is about lending someone a hand. When someone gives you advice, they’re just looking out for you."}, {"b414": "And when you ask for advice, it’s an invitation. You’re signaling that another person has expertise or knowledge that you find interesting and valuable. That person is often flattered you even asked for advice in the first place."}, {"3125": "Who doesn’t love to give advice? :-)"}, {"c93a": "The next time you’d like to get honest feedback, try asking for advice instead. Notice how much more people open up to you. See how swapping that one word makes a difference."}, {"dec6": "Curious what other tactics work to unlock honest feedback, as a manager or CEO? Good news, I recently launched a new hands-on workshop called “Don’t Be the Last to Know” on March 30th that reveals techniques and tactics to unlock honest feedback, based on almost 300 business owners and 15,000 employees who use Know Your Company. Get your ticket here today."}, {"3559": "Lastly, if you found this post useful, please feel free to share + give it ❤️ so others can find it too! Thanks 😊 (And you can always say hi at @cjlew23!)"}], "content": "Unlock honest feedback with this one word This one little word makes all the difference… A few years ago, a CEO told me how she was struggling to get honest feedback from her board. No one seemed willing to be critical or give her pointers on things she could improve. After every board meeting, she would turn to them and ask directly: “What feedback does anyone have for me?” She’d hear crickets. Every single time. No one would speak up. Even though they were board members — people who are supposed to hold her accountable as the CEO of the company — they shied away from offering their honest input. This was so perplexing to the CEO. She felt like she was being very clear with what she wanted… Why weren’t they just giving her the feedback she was asking for? One day, she decided to try something different. Instead of asking, “What feedback does anyone have for me?”… she asked this: “What advice does anyone have for me?” All of sudden, everyone started weighing in. “Well I might try this…” and “The way you brought up this point could’ve been better…” and “You could try structuring the meeting like this…” The word “advice” unlocked all the honest feedback that CEO needed. Why? The word “feedback’” carries a lot of baggage. To some, they automatically associate it with a “critique” or something negative. It can seem scary and formal. But “advice” is a much more welcoming word. Advice is about lending someone a hand. When someone gives you advice, they’re just looking out for you. And when you ask for advice, it’s an invitation. You’re signaling that another person has expertise or knowledge that you find interesting and valuable. That person is often flattered you even asked for advice in the first place. Who doesn’t love to give advice? :-) The next time you’d like to get honest feedback, try asking for advice instead. Notice how much more people open up to you. See how swapping that one word makes a difference. Curious what other tactics work to unlock honest feedback, as a manager or CEO? Good news, I recently launched a new hands-on workshop called “Don’t Be the Last to Know” on March 30th that reveals techniques and tactics to unlock honest feedback, based on almost 300 business owners and 15,000 employees who use Know Your Company. Get your ticket here today. Lastly, if you found this post useful, please feel free to share + give it ❤️ so others can find it too! Thanks 😊 (And you can always say hi at @cjlew23!) ", "child": "936_1\t936_2\t936_3\t936_4\t936_5\t936_6\t936_7\t936_8\t936_9\t936_10\t936_11\t936_12\t936_13\t936_14\t936_15\t936_16\t936_17\t936_18\t936_19\t936_20\t936_21\t936_22\t936_23\t936_24\t936_25936_1\t936_2\t936_3\t936_4\t936_5\t936_6\t936_7\t936_8\t936_9\t936_10\t936_11\t936_12\t936_13\t936_14\t936_15\t936_16\t936_17\t936_18\t936_19\t936_20\t936_21\t936_22\t936_23\t936_24\t936_25"}