{"name": "941", "parent": "", "title": "Makin’ Love at Work, whaaaaaat?", "sentences": [{"add7": "Makin’ Love at Work, whaaaaaat?"}, {"7028": "There’s a new business in town centered around making love at work. And it’s not the work version of a brothel. It’s called PropFuel and it’s simple, inexpensive and effective employee recognition software to turbocharge your team’s performance. Super easy and super fun. You totally get it, right? What does this have to do with sex at work? nothing, d’uh!!!"}, {"5e8d": "Ok, here’s the longer version for those of you wondering what it is we’re building here…"}, {"957e": "Did you know only 13% of people love their job? You may be one of them but good grief, that’s a lot of people unhappy about going into work on Monday. Happy people make everything better, even at work. Happy people at work are… happier. And more productive. 14% actually, according to some study somewhere… I should reference that sometime. But, you don’t need numbers to tell you that people that are more emotionally invested in their work will go well beyond their job description."}, {"d130": "That’s what PropFuel is designed to do… it’s an employee recognition platform that sits in your email or wherever you work most often and encourages you to slap someone on that back and tell them when they did something well. Tell them you like them. Tell them they helped you today and you appreciate it or simply say “Thank you!”. That goes a long way towards putting a smile on a face or two."}, {"ca3f": "The PropFuel platform offers a hyper simple solution to giving props to your peers, customers, vendors, even the boss occasionally… but not too often. It might go to their head."}, {"d8aa": "And for the boss, or admin? Analytics showing who’s getting recognized and who’s doing the recognizing. AND, which of your company values are standing out… or not."}, {"3387": "So don’t get all upset. We’re not making happy people at work just to make the company more money. We’re making happy people at work because it’s awesome being happy."}, {"0185": "We’re working with our Alpha test group. We’ll be out with the beta soon for everyone else… keep your eyes peeled in Q2 for some smiles."}, {"372d": "www.propfuel.com to learn more."}, {"25a4": "Spread the love!!!"}], "content": "Makin’ Love at Work, whaaaaaat? There’s a new business in town centered around making love at work. And it’s not the work version of a brothel. It’s called PropFuel and it’s simple, inexpensive and effective employee recognition software to turbocharge your team’s performance. Super easy and super fun. You totally get it, right? What does this have to do with sex at work? nothing, d’uh!!! Ok, here’s the longer version for those of you wondering what it is we’re building here… Did you know only 13% of people love their job? You may be one of them but good grief, that’s a lot of people unhappy about going into work on Monday. Happy people make everything better, even at work. Happy people at work are… happier. And more productive. 14% actually, according to some study somewhere… I should reference that sometime. But, you don’t need numbers to tell you that people that are more emotionally invested in their work will go well beyond their job description. That’s what PropFuel is designed to do… it’s an employee recognition platform that sits in your email or wherever you work most often and encourages you to slap someone on that back and tell them when they did something well. Tell them you like them. Tell them they helped you today and you appreciate it or simply say “Thank you!”. That goes a long way towards putting a smile on a face or two. The PropFuel platform offers a hyper simple solution to giving props to your peers, customers, vendors, even the boss occasionally… but not too often. It might go to their head. And for the boss, or admin? Analytics showing who’s getting recognized and who’s doing the recognizing. AND, which of your company values are standing out… or not. So don’t get all upset. We’re not making happy people at work just to make the company more money. We’re making happy people at work because it’s awesome being happy. We’re working with our Alpha test group. We’ll be out with the beta soon for everyone else… keep your eyes peeled in Q2 for some smiles. www.propfuel.com to learn more. Spread the love!!! ", "child": "941_1\t941_2\t941_3\t941_4"}