{"name": "95", "parent": "", "title": "The Old Man and the Jokic", "sentences": [{"c753": "The Old Man and the Jokic"}, {"7d31": "The Nuggets are not supposed to be in the playoff race, Jameer Nelson is not supposed to be a starting NBA point guard, and Nikola Jokic is not supposed to be a Dirk-like offensive beast who passes like a psychic. But here we are."}, {"43fc": "Less than 12 hours after beating the Pacers in Indiana, Jameer Nelson, Kenneth Faried, and some other Nuggets were rattling around the Pepsi Center in Denver early this past Saturday morning. They were off that day. Technically. Except the season is funneling to a close and the playoffs are near enough on the horizon now that they were off, but not really — not the kind of off where you relax and enjoy."}, {"9c22": "The Nuggets are creeping. Crawling. Inching along on their bellies and forearms. They might as well wear ghillie suits these days instead of uniforms. They’ve been underestimated for much of the season, but here they are, pressed up against the postseason. They won’t win it all, of course. They might even miss the playoffs if they crater and Portland cruises. But given the various preseason expectations — the predictions were all over the place, ranging from back of the NBA pack and Northwest Division afterthought, to somewhere around .500, to a coin flip to make the postseason — the mere fact that we’re discussing the Nuggets and the playoffs in late March is itself a signal of success."}, {"71d5": "They’ve won six of their past 10. That includes a surprising 13-point victory over the Cavs at home last week (in which Nikola Jokic double-doubled and then jokingly (?) suggested that LeBron couldn’t handle him in the post), but also a disappointing defeat at home to the Boogie-less Pelicans on Sunday. The New Orleans loss couldn’t have come at a worse time. It dropped Denver into a tie with the Trail Blazers for the final playoff slot in the Western Conference. There are nine games left for the Nuggets, and as the savage schedule makers would have it, they’re in Portland on Tuesday for a critical clash."}, {"d2ac": "“It’s the first time in years I’ve played in meaningful games at the end of the year,” Nelson said on Saturday. He was seated on a small couch in a small lounge just across the hall from the Nuggets locker room. He had all black workout clothes on, and he fiddled with the earbuds in his hand while we talked. He looked like a guy who was eager and excited about an opportunity he hasn’t had since his Orlando days."}, {"6827": "Like Nelson — who, at 35, is easily the oldest regular contributor on the team — it’s been a minute since the Nuggets did anything that mattered this late in the calendar. The last time they reached the playoffs was 2012–13, and they haven’t made it out of the first round since 2008–09. If there’s any attendant stress due to that, Nelson wouldn’t cop to it. He easily parried questions about postseason pressure with the usual rejoinders about the necessity of handling day-to-day business. Which doesn’t mean he isn’t enjoying the hell out of this run. “It’s fun,” Nelson said. “Right now we’re doing pretty good.”"}, {"c9a3": "Pelicans loss aside, that’s largely true. Which makes this playoff push all the more remarkable because, earlier this year, they did a lot of things, but good was rarely among them."}, {"96b9": "The Nuggets caught a whole lot of L’s to begin the season — in the standings, but also in terms of trying to figure out a team identity. They lost seven of their first 10 games to start the year. There was an understandable experimentation period when they paired Jokic and Jusuf Nurkic — who was later bundled off to Portland in a move that benefited both teams in ways no one could have anticipated — to see how it would go."}, {"3aad": "“We tried the two-big thing early on in the season,” Nelson said. “It didn’t work for us. Obviously.”"}, {"e23d": "Obviously. When they were on the floor together, Jokic and Nurkic had a net rating of minus-15.6, per NBA.com. Mike Malone scrapped the lineup pretty quickly, but he didn’t immediately stumble on the solution. For parts of November, it was Nurkic who started and Jokic who was a reserve. That seems staggering in retrospect, given everything we’ve seen from Jokic of late, but we shouldn’t forget that for all his talent the 22-year-old Serbian was consistently overlooked until recently. Before morphing into an NBA obsession and a household name around the league (though that name is easier for some to say than others), Jokic was a second-round pick, summer league chum, a test balloon at power forward, and a member of the second unit."}, {"ad4a": "Everything changed in mid-December for Jokic and the Nuggets when he was installed as the starting center. Since then, Denver has the best offensive rating in the league. The Nuggets scored 100 or more points in 13 consecutive outings before failing to do so against New Orleans. It was the first time they didn’t eclipse the century mark in a month. (The unintended byproduct of their go-go-gadget offense is that the defense regularly short-circuits; the Nuggets are last in defensive rating over the same span.)"}, {"1644": "In the process, Jokic became a monster who happily stomped on his opposition. From December 15 on, his averages have been silly: 19.1 points, 10.8 rebounds, 5.6 assists, and close to a 3-pointer, steal, and block per game. And all that while shooting 59.3 percent from the floor (on 13.2 shots per game) and 82.7 percent from the line (3.3 attempts per game). In the team’s past 48 games, he has 32 double-doubles and five triple-doubles. Not surprisingly, the Nuggets are excellent when he’s in the game and something south of awful when he’s not. Denver’s plus-minus plummets from plus-4.2 when Jokic is on the floor to minus-3.4 when he’s off, according to NBA.com. (He also leads the league in CER — candy efficiency rating.)"}, {"c0f0": "The Nuggets Have Finally Identified Their CornerstoneAfter a rough start, Denver has unleashed Nikola Jokic and is suddenly looking like one of the most exciting teams in…theringer.com"}, {"0a47": "Jokic isn’t athletic — Malone charitably described him as a “below-the-rim player” — but he compensates for his lack of lift and speed with deceptive shots and footwork. He can hit from distance, he has nifty post moves with either hand, and he’s added an almost-one-leg fadeaway. His game has naturally invited comparisons to Dirk Nowitzki’s as a result, but Utah head coach Quin Snyder had the best evaluation when he bizarrely said Jokic reminded him of a water polo player. (Jokic was fine with it: “I like water polo a lot. Whenever it’s on TV, I’m going to watch it.”)"}, {"c9db": "Considering the 22-year-old is owed an average annual salary of just $1.5 million over the next two years, he probably has the most valuable contract in the NBA. But beyond that, he’s simply a delight. The man gives you something to marvel at nearly every game, like when he pulled the ball off the glass and decided to go full-court unicorn against the poor (poor, poor) Knicks."}, {"23d8": "As recently as January, Jokic openly admitted that he believes he “can do anything on the court.” But for all his inside-outside scoring ability, the passing is what makes him special. There are times, lots of them lately, when Jokic will push the ball up himself and make a pass that someone who’s 6-foot-10 and 250 pounds shouldn’t be able to make."}, {"2ad3": "“He’s the best passing big I’ve ever played with. At any level,” Nelson said. “Like, [against Indiana] the other night, I was like, ‘What the hell is he doing?’ And then he’s throwing it backwards. There’s not too many guys in the NBA who can do that and complete it.”"}, {"254c": "“He’s fun to be around and watch,” Nelson said. “We call him the GOAT. Jok the GOAT.”"}, {"6b40": "With or without the GOAT, Denver would probably be in the mix, fighting for the final playoff spot each evening and checking the standings every morning. Not because of talent. It has quite a bit as last-teams-in go. But health and reliable rotations have been in shorter supply."}, {"7a43": "Gary Harris has missed 24 games this season. Danilo Gallinari has been unavailable for 17. Will Barton 14. Wilson Chandler 10. Jokic nine. Emmanuel Mudiay has disappeared so many times this season (first his bad back worked against him, then his bad game did) that it’s fair to wonder if there’s some sort of witness protection program for players that we’re not yet aware of. The only guy who’s checked into every game is rookie Jamal Murray. (The Nuggets clearly would have preferred to avoid the injuries, but as Murray joked while messing around on his phone in the Denver locker room the other day, “It’s worked out for me.”) After that, Jameer Nelson — who played his first college contest for Saint Joe’s four years after Murray was born — has appeared in the most games for the team, playing in all but one. That’s nearly as many games as Nelson played for the Nuggets in the previous two seasons combined. He’s also second on the team in total minutes this year. The only reason Nelson missed a game at all is because he got food poisoning. He recommends you skip the late-night hotel chicken fingers if you’re passing through Milwaukee."}, {"ea82": "Tinkering with the frontcourt and not having a full complement of able-bodied players has resulted in the Nuggets rolling out a lot of different lineups. According to Basketball-Reference, Malone has tried 529 different five-man combinations (including 29 starting lineups) — and, remarkably, only two of those have logged more than 150 minutes together (the second passing the mark only Sunday night)."}, {"8023": "Considering the instability, maybe we shouldn’t be surprised that Nelson has re-emerged as a key component in Malone’s increasingly most-trusted five-man group. Just when you think he’s reached his NBA expiration date, Nelson reminds you that he’s still good. He’s had a longer shelf life than Twinkies or ramen noodles, and he’s just as comforting to teams hungry for veteran leadership."}, {"1e1d": "(Getty Images)"}, {"50c6": "Nelson, who turned 35 in February, has logged more than 23,000 regular-season minutes for four teams in 13 seasons. He’s coming up fast on 10,000 regular-season career points, and he’s 88th in league history in total assists. But when the Nuggets put him in the starting lineup in late January, it was supposed to be a short-term patch. They were 18–24 at the time. They’re 17–14 since, and he’s still the starter. If that comes as a shock, it had to be one for Nelson and the Nuggets, too. The team obviously didn’t draft Mudiay with the intention of regularly slapping him with a DNP-CD. Not to mention that Nelson’s career with the Nuggets looked grim this time a year ago. He played in only 39 games last season and he hardly saw the floor in the team’s final 25 contests."}, {"e514": "“To be honest, and the organization knows how I feel, but I feel like I wasn’t given a fair shot last year in certain situations,” Nelson said. “I told them this summer I was coming back, but not to sit the bench. I don’t know if they thought I was joking or what.”"}, {"59cb": "Nelson spent the offseason working out at EvoUltraFit in Phoenix in an attempt to get in better shape and snag one more opportunity, should it present itself. That’s exactly what happened when Mudiay struggled this season; his 47.4 true shooting percentage and well-below-league-average 10.3 PER made Malone go looking for better options. Or at least more experienced ones. While Nelson’s counting stats are hardly eye-popping (8.9 PPG, 5.1 APG), they don’t need to be. As Malone pointed out, the Nuggets have plenty of scorers. What they needed was a steady presence to play a role, distribute, and hit an open 3 now and then (which Nelson is doing at a nearly 38 percent clip)."}, {"8664": "“He’s really kind of sacrificed his game,” Malone said. “He’s a scoring guard. He’s a pick-and-roll player. But he understands with this team, he needs to be a facilitator, get us organized, cut, guard on the other end, and finish games.”"}, {"7e10": "Indeed, when Nelson is off the court the Nuggets have a minus-3.3 net rating, per NBA.com. Conversely, the Nuggets are plus-2.2 when Mudiay sits. Mudiay is so marginalized at this point that the best he can hope for is one of those dreaded public attaboys from his coach for working hard and some garbage-time sympathy minutes now and again. The NBA gives no quarter for any reason, especially in a playoff race."}, {"7c27": "About that last part: The Pelicans loss was a blow. There was no denying it. Mike Malone called it “embarrassing,” though he insisted he wouldn’t overreact. Step back, he said, and you’d see the Nuggets have “played some great basketball and beaten some of the NBA’s best teams” lately. While Jokic and some other Nuggets fled the arena after the loss without talking to the media, the players who remained behind in the locker room didn’t seem too shook. Gary Harris teased Jamal Murray about an unrelated matter. Will Barton combed his beard while explaining how eager he was to face the Blazers next. Wilson Chandler said aloud to no one in particular that the loss occurred at a bad time, then headed off to dinner with some of his teammates. Jameer Nelson just shrugged and admitted, “It happens.”"}, {"e27a": "It does, though they probably wish it happened at some other point in the season. Tuesday’s game in Portland marks the beginning of a brutal final slog for the Nuggets. They’ll play five straight on the road, flying from the Pacific Northwest across the country to Charlotte in the process. There are two rematches with the Pelicans in there, and a game at Houston against the red-hot Rockets before they close out against full-tilt Russell Westbrook in OKC. Of the remaining nine games, only two are in Denver. As a result, FiveThirtyEight gives the Nuggets a 16 percent chance to secure the last postseason spot, while Portland is projected at 83 percent. If the Nuggets make the playoffs, it certainly won’t be because the schedule makers made it easy. But then, as Malone conceded in an understatement the other night, “It’s never easy in the NBA.”"}], "content": "The Old Man and the Jokic The Nuggets are not supposed to be in the playoff race, Jameer Nelson is not supposed to be a starting NBA point guard, and Nikola Jokic is not supposed to be a Dirk-like offensive beast who passes like a psychic. But here we are. Less than 12 hours after beating the Pacers in Indiana, Jameer Nelson, Kenneth Faried, and some other Nuggets were rattling around the Pepsi Center in Denver early this past Saturday morning. They were off that day. Technically. Except the season is funneling to a close and the playoffs are near enough on the horizon now that they were off, but not really — not the kind of off where you relax and enjoy. The Nuggets are creeping. Crawling. Inching along on their bellies and forearms. They might as well wear ghillie suits these days instead of uniforms. They’ve been underestimated for much of the season, but here they are, pressed up against the postseason. They won’t win it all, of course. They might even miss the playoffs if they crater and Portland cruises. But given the various preseason expectations — the predictions were all over the place, ranging from back of the NBA pack and Northwest Division afterthought, to somewhere around .500, to a coin flip to make the postseason — the mere fact that we’re discussing the Nuggets and the playoffs in late March is itself a signal of success. They’ve won six of their past 10. That includes a surprising 13-point victory over the Cavs at home last week (in which Nikola Jokic double-doubled and then jokingly (?) suggested that LeBron couldn’t handle him in the post), but also a disappointing defeat at home to the Boogie-less Pelicans on Sunday. The New Orleans loss couldn’t have come at a worse time. It dropped Denver into a tie with the Trail Blazers for the final playoff slot in the Western Conference. There are nine games left for the Nuggets, and as the savage schedule makers would have it, they’re in Portland on Tuesday for a critical clash. “It’s the first time in years I’ve played in meaningful games at the end of the year,” Nelson said on Saturday. He was seated on a small couch in a small lounge just across the hall from the Nuggets locker room. He had all black workout clothes on, and he fiddled with the earbuds in his hand while we talked. He looked like a guy who was eager and excited about an opportunity he hasn’t had since his Orlando days. Like Nelson — who, at 35, is easily the oldest regular contributor on the team — it’s been a minute since the Nuggets did anything that mattered this late in the calendar. The last time they reached the playoffs was 2012–13, and they haven’t made it out of the first round since 2008–09. If there’s any attendant stress due to that, Nelson wouldn’t cop to it. He easily parried questions about postseason pressure with the usual rejoinders about the necessity of handling day-to-day business. Which doesn’t mean he isn’t enjoying the hell out of this run. “It’s fun,” Nelson said. “Right now we’re doing pretty good.” Pelicans loss aside, that’s largely true. Which makes this playoff push all the more remarkable because, earlier this year, they did a lot of things, but good was rarely among them. The Nuggets caught a whole lot of L’s to begin the season — in the standings, but also in terms of trying to figure out a team identity. They lost seven of their first 10 games to start the year. There was an understandable experimentation period when they paired Jokic and Jusuf Nurkic — who was later bundled off to Portland in a move that benefited both teams in ways no one could have anticipated — to see how it would go. “We tried the two-big thing early on in the season,” Nelson said. “It didn’t work for us. Obviously.” Obviously. When they were on the floor together, Jokic and Nurkic had a net rating of minus-15.6, per NBA.com. Mike Malone scrapped the lineup pretty quickly, but he didn’t immediately stumble on the solution. For parts of November, it was Nurkic who started and Jokic who was a reserve. That seems staggering in retrospect, given everything we’ve seen from Jokic of late, but we shouldn’t forget that for all his talent the 22-year-old Serbian was consistently overlooked until recently. Before morphing into an NBA obsession and a household name around the league (though that name is easier for some to say than others), Jokic was a second-round pick, summer league chum, a test balloon at power forward, and a member of the second unit. Everything changed in mid-December for Jokic and the Nuggets when he was installed as the starting center. Since then, Denver has the best offensive rating in the league. The Nuggets scored 100 or more points in 13 consecutive outings before failing to do so against New Orleans. It was the first time they didn’t eclipse the century mark in a month. (The unintended byproduct of their go-go-gadget offense is that the defense regularly short-circuits; the Nuggets are last in defensive rating over the same span.) In the process, Jokic became a monster who happily stomped on his opposition. From December 15 on, his averages have been silly: 19.1 points, 10.8 rebounds, 5.6 assists, and close to a 3-pointer, steal, and block per game. And all that while shooting 59.3 percent from the floor (on 13.2 shots per game) and 82.7 percent from the line (3.3 attempts per game). In the team’s past 48 games, he has 32 double-doubles and five triple-doubles. Not surprisingly, the Nuggets are excellent when he’s in the game and something south of awful when he’s not. Denver’s plus-minus plummets from plus-4.2 when Jokic is on the floor to minus-3.4 when he’s off, according to NBA.com. (He also leads the league in CER — candy efficiency rating.) The Nuggets Have Finally Identified Their CornerstoneAfter a rough start, Denver has unleashed Nikola Jokic and is suddenly looking like one of the most exciting teams in…theringer.com Jokic isn’t athletic — Malone charitably described him as a “below-the-rim player” — but he compensates for his lack of lift and speed with deceptive shots and footwork. He can hit from distance, he has nifty post moves with either hand, and he’s added an almost-one-leg fadeaway. His game has naturally invited comparisons to Dirk Nowitzki’s as a result, but Utah head coach Quin Snyder had the best evaluation when he bizarrely said Jokic reminded him of a water polo player. (Jokic was fine with it: “I like water polo a lot. Whenever it’s on TV, I’m going to watch it.”) Considering the 22-year-old is owed an average annual salary of just $1.5 million over the next two years, he probably has the most valuable contract in the NBA. But beyond that, he’s simply a delight. The man gives you something to marvel at nearly every game, like when he pulled the ball off the glass and decided to go full-court unicorn against the poor (poor, poor) Knicks. As recently as January, Jokic openly admitted that he believes he “can do anything on the court.” But for all his inside-outside scoring ability, the passing is what makes him special. There are times, lots of them lately, when Jokic will push the ball up himself and make a pass that someone who’s 6-foot-10 and 250 pounds shouldn’t be able to make. “He’s the best passing big I’ve ever played with. At any level,” Nelson said. “Like, [against Indiana] the other night, I was like, ‘What the hell is he doing?’ And then he’s throwing it backwards. There’s not too many guys in the NBA who can do that and complete it.” “He’s fun to be around and watch,” Nelson said. “We call him the GOAT. Jok the GOAT.” With or without the GOAT, Denver would probably be in the mix, fighting for the final playoff spot each evening and checking the standings every morning. Not because of talent. It has quite a bit as last-teams-in go. But health and reliable rotations have been in shorter supply. Gary Harris has missed 24 games this season. Danilo Gallinari has been unavailable for 17. Will Barton 14. Wilson Chandler 10. Jokic nine. Emmanuel Mudiay has disappeared so many times this season (first his bad back worked against him, then his bad game did) that it’s fair to wonder if there’s some sort of witness protection program for players that we’re not yet aware of. The only guy who’s checked into every game is rookie Jamal Murray. (The Nuggets clearly would have preferred to avoid the injuries, but as Murray joked while messing around on his phone in the Denver locker room the other day, “It’s worked out for me.”) After that, Jameer Nelson — who played his first college contest for Saint Joe’s four years after Murray was born — has appeared in the most games for the team, playing in all but one. That’s nearly as many games as Nelson played for the Nuggets in the previous two seasons combined. He’s also second on the team in total minutes this year. The only reason Nelson missed a game at all is because he got food poisoning. He recommends you skip the late-night hotel chicken fingers if you’re passing through Milwaukee. Tinkering with the frontcourt and not having a full complement of able-bodied players has resulted in the Nuggets rolling out a lot of different lineups. According to Basketball-Reference, Malone has tried 529 different five-man combinations (including 29 starting lineups) — and, remarkably, only two of those have logged more than 150 minutes together (the second passing the mark only Sunday night). Considering the instability, maybe we shouldn’t be surprised that Nelson has re-emerged as a key component in Malone’s increasingly most-trusted five-man group. Just when you think he’s reached his NBA expiration date, Nelson reminds you that he’s still good. He’s had a longer shelf life than Twinkies or ramen noodles, and he’s just as comforting to teams hungry for veteran leadership. (Getty Images) Nelson, who turned 35 in February, has logged more than 23,000 regular-season minutes for four teams in 13 seasons. He’s coming up fast on 10,000 regular-season career points, and he’s 88th in league history in total assists. But when the Nuggets put him in the starting lineup in late January, it was supposed to be a short-term patch. They were 18–24 at the time. They’re 17–14 since, and he’s still the starter. If that comes as a shock, it had to be one for Nelson and the Nuggets, too. The team obviously didn’t draft Mudiay with the intention of regularly slapping him with a DNP-CD. Not to mention that Nelson’s career with the Nuggets looked grim this time a year ago. He played in only 39 games last season and he hardly saw the floor in the team’s final 25 contests. “To be honest, and the organization knows how I feel, but I feel like I wasn’t given a fair shot last year in certain situations,” Nelson said. “I told them this summer I was coming back, but not to sit the bench. I don’t know if they thought I was joking or what.” Nelson spent the offseason working out at EvoUltraFit in Phoenix in an attempt to get in better shape and snag one more opportunity, should it present itself. That’s exactly what happened when Mudiay struggled this season; his 47.4 true shooting percentage and well-below-league-average 10.3 PER made Malone go looking for better options. Or at least more experienced ones. While Nelson’s counting stats are hardly eye-popping (8.9 PPG, 5.1 APG), they don’t need to be. As Malone pointed out, the Nuggets have plenty of scorers. What they needed was a steady presence to play a role, distribute, and hit an open 3 now and then (which Nelson is doing at a nearly 38 percent clip). “He’s really kind of sacrificed his game,” Malone said. “He’s a scoring guard. He’s a pick-and-roll player. But he understands with this team, he needs to be a facilitator, get us organized, cut, guard on the other end, and finish games.” Indeed, when Nelson is off the court the Nuggets have a minus-3.3 net rating, per NBA.com. Conversely, the Nuggets are plus-2.2 when Mudiay sits. Mudiay is so marginalized at this point that the best he can hope for is one of those dreaded public attaboys from his coach for working hard and some garbage-time sympathy minutes now and again. The NBA gives no quarter for any reason, especially in a playoff race. About that last part: The Pelicans loss was a blow. There was no denying it. Mike Malone called it “embarrassing,” though he insisted he wouldn’t overreact. Step back, he said, and you’d see the Nuggets have “played some great basketball and beaten some of the NBA’s best teams” lately. While Jokic and some other Nuggets fled the arena after the loss without talking to the media, the players who remained behind in the locker room didn’t seem too shook. Gary Harris teased Jamal Murray about an unrelated matter. Will Barton combed his beard while explaining how eager he was to face the Blazers next. Wilson Chandler said aloud to no one in particular that the loss occurred at a bad time, then headed off to dinner with some of his teammates. Jameer Nelson just shrugged and admitted, “It happens.” It does, though they probably wish it happened at some other point in the season. Tuesday’s game in Portland marks the beginning of a brutal final slog for the Nuggets. They’ll play five straight on the road, flying from the Pacific Northwest across the country to Charlotte in the process. There are two rematches with the Pelicans in there, and a game at Houston against the red-hot Rockets before they close out against full-tilt Russell Westbrook in OKC. Of the remaining nine games, only two are in Denver. As a result, FiveThirtyEight gives the Nuggets a 16 percent chance to secure the last postseason spot, while Portland is projected at 83 percent. If the Nuggets make the playoffs, it certainly won’t be because the schedule makers made it easy. But then, as Malone conceded in an understatement the other night, “It’s never easy in the NBA.” ", "child": "95_1\t95_2\t95_3\t95_4\t95_5\t95_6\t95_7\t95_8\t95_9\t95_10\t95_11\t95_12"}