{"name": "96", "parent": "", "title": "What Happens When We Get the NBA MVP Wrong?", "sentences": [{"13d3": "What Happens When We Get the NBA MVP Wrong?"}, {"1346": "A quick history lesson may stop us from screwing this one up…"}, {"fd5d": "The NBA season ends today, and perhaps the MVP debate along with it. What was supposed to be a boring season en route to Warriors-Cavs III became a showcase for a slew of rising stars and some of the greatest stats we’ve ever seen, night after night all season long. Giannis Antetokounmpo, Isaiah Thomas, John Wall, Jimmy Butler, and Rudy Gobert all had spectacular seasons, and most ballots won’t include a single one of them."}, {"19d2": "It’s time to cast our MVP vote and settle this thing once and for all, and by once and for all I mean we’ll continue to debate it for ten weeks until it’s announced on June 26th. Sometimes we get the MVP wrong, and with so many incredible candidates this year, it’s possible we’ll do it again."}, {"d933": "Which MVPs did we get wrong, and what can the last three decades of history teach us to stop us from screwing up again?"}, {"2a73": "The Absurdity of Triple-Doubles and the Incredible 2017 NBA SeasonWhat happens when five or ten NBA players all have historic seasons at once?"}, {"0e96": "2011 — Derrick Rose"}, {"d2f5": "LeBron left for South Beach, and everyone hated him. The Bulls beat the Cavs by four wins to take the East 1-seed, and we rewarded Rose’s 25/4/8 on wretched shooting with an MVP and breathed a sigh of relief that we didn’t have to give it to LeBron again. We even voted Dwight Howard ahead of LeBron that year. Dwight Howard!"}, {"5628": "LeBron put up 27/8/7, adjusted to a new team, and led them to the league’s third best record. The Spurs won 61 without any great individual seasons and we found out why when they lost to the 8-seed Grizzlies in the first round. It was a weak MVP year, but LeBron was the best candidate in a bad field."}, {"ccd3": "Who should’ve won: LeBron James"}, {"238f": "2008 — Kobe Bryant"}, {"c0f0": "‘05 to ‘08 was a weak stretch. Nash had won two MVPs followed by Dirk, and we were sick of our MVPs choking in the playoffs. Kobe had 28/6/5 for a Lakers team that had the best record in the West but was three losses away from being the 6-seed, so we gave him a career award."}, {"7fb4": "There was only one great team in 2008, and it was the 66–16 Celtics. KG was the best player on both ends of the court for the league’s best team, but his 19/9/3 left you wanting. LeBron had 30/8/7 but the Cavs won only 45 games. The Suns were as good as the year before and so was Nash, but we had realized our idiocy by then. Instead voters turned to Chris “Karl Malone as a point guard” Paul, whose 21/4/12 was far better than anything Nash ever did."}, {"a691": "CP3 finished second but should’ve won if you think the Nash MVPs are valid. Garnett was the best player on the best team and should’ve won if you overvalue heart and intangibles. But in the absence of a clear choice, you just have to go with the numbers, and 30/8/7 speaks for itself."}, {"d299": "Who should’ve won: LeBron James"}, {"7918": "2006 — Steve Nash"}, {"471e": "Nash was the defending winner in the worst MVP race in decades. The Suns won 54 and Nash had 19/4/10. The defending champion Pistons had the league’s best record at 64–18 but were a team without a superstar. Voters didn’t know what to do, so 15 of them voted for Chauncey Billups with his 19/3/9. That’s not an MVP line but he equaled Nash’s stats, won 10 more games, and was the defending champ so there’s that."}, {"fa90": "The other best teams in the league were the Spurs and Mavs. Duncan’s 19/11/3 was nice enough, and Dirk’s 27/9/3 gave him a third place finish. Wade’s 27/6/7 was completely overlooked on a 52-win Heat team that ended up winning the title. LeBron put up 31/7/7 on a 50-win Cavs team in a horrible East, while Kobe hero-balled his way to 35/5/5 to carry an abysmal Lakers roster whose third best player was Smush Parker (no, seriously) to 45 wins and the playoffs."}, {"81ba": "Nash was not the 2006 MVP, but no one else was either. It’s hindsight to give it to Wade after his title run, but it’s a regular season award. This hurts, but it should’ve been Kobe. He was incredible with absolutely nothing around him. Smush Parker makes Victor Oladipo look like MJ. What Kobe did without Shaq or any help was great, and he gets the career achievement bump too."}, {"c520": "Who should’ve won: Kobe Bryant"}, {"cb5a": "2005 — Steve Nash"}, {"882e": "In Nash’s first MVP season, the Suns led the league with 62 wins behind 15.5/3/11.5 from Nash. Shaq joined the Heat and put up 23/10/3, finishing second in an MVP race he shouldn’t have been part of. Dirk and Duncan were better for better teams that didn’t have the luxury of playing in the East. Defending MVP Kevin Garnett was the best player with 22/14/6 but the Timberwolves missed the playoffs because Minnesota."}, {"ddcc": "Truthfully, there wasn’t an MVP this season. The best two players were KG and LeBron but both missed the playoffs. When there’s no other worthy candidate, MVP goes to the best player on the best team."}, {"25c2": "Who should’ve won: Steve Nash, I guess"}, {"314f": "Joel Embiid is Definitely Your NBA Rookie of the YearSo what if he lapped the entire field in only half a season?"}, {"66e0": "2001 — Allen Iverson"}, {"d46e": "The ‘99-00 Shaqobe Lakers went 67–15 and clobbered everyone, then coasted to 56 wins this year, still only two games off the league’s best record in a year without a great team. Except there was a great team — it was the Lakers, but they didn’t bother showing up until the playoffs and then murdered everyone."}, {"67b9": "The Spurs were the West 1-seed and Duncan had a lovely 22/12/3 line, while plucky Philadelphia was the East 1-seed behind Iverson’s inefficient 31/4/5 and a bunch of defenders. Iverson was tiny and fun but this would be like giving Isaiah Thomas the MVP this year because the Celtics won a crappy East regular season. Isaiah is not the MVP, and Iverson wasn’t either. Shaq put up 29/13/4 without even trying and was still the MVP, even if it felt a little icky with him mailing in the season."}, {"0161": "Who should’ve won: Shaquille O’Neal"}, {"f5fc": "1997 — Karl Malone"}, {"3d21": "Let’s not belabor this one. Malone had finished top-8 in the MVP voting nine consecutive seasons without breaking through. Jordan was top-3 his last eight full seasons and we took him for granted. The Jazz won 64 games and Malone was really good. The Bulls were the defending champ and went 69–13 and Jordan was even better. We blew it."}, {"9734": "Who should’ve won: Michael Jordan"}, {"1b7a": "1990 — Magic Johnson"}, {"3caf": "This was one of the closest MVP races ever. Magic won with the fewest first-place votes ever, just 27. Barkley had more first-place votes with 38 but finished second in total voting. Jordan got 21 firsts and finished third."}, {"27ef": "The Pistons were the defending champs and the East 1-seed but had no real MVP candidate. The Bulls were second best in the East but Jordan hadn’t escaped the Pistons yet and though his 34/7/6 line was absurd as always, people were starting to wonder if MJ could win the big one. Barkley’s 25/12/4 was terrific but the Sixers had only the eighth best record, and Malone and Robinson were just as good. He shouldn’t have been a top candidate."}, {"04e4": "Magic’s Lakers rolled through the West again, earning the 1-seed for an absurd ninth straight season with 63 wins and the best record in the league. Magic had 22/7/12. The MVP should have been either him or Jordan, and tie probably goes to Magic on momentum and the best-player-best-team criteria."}, {"1d3a": "Who should’ve won: Magic Johnson?"}, {"b2f0": "1989 — Magic Johnson"}, {"1acf": "The Pistons had the best record in the league at 63–19 and were about to win it all after losing in the Finals the year before — but they were a rounded team with no real MVP candidate. Dumars and Isiah each got one last-place vote and, really, Rodman may have been their MVP."}, {"b053": "The Lakers were back-to-back champs and the West 1-seed again, though they went only 57–25. The Bulls dropped from the 3- to the 6-seed in the East, finishing fifth of six teams in an impossible division. Jordan had an absurd season with 33/8/8, the closest line we’ve seen to Westbrook this year. Magic had 23/8/13 himself, probably his best all-around individual numbers."}, {"6870": "Magic got exactly half of the first-place votes, literally 42.5 of 85 votes because one voter chose co-MVPs with Magic and Jordan. Jordan was a close second. In hindsight, perhaps it should’ve been the other way around. It feels like Magic and MJ could’ve been co-MVPs in ‘89 and ‘90 so it seems fair to give them each one."}, {"7714": "Who should’ve won: Michael Jordan?"}, {"bc54": "The 2016–17 Tim Duncan All StarsWho are the best bargain players in the NBA this season?"}, {"896b": "So what have we learned?"}, {"b5e9": "We got six MVPs wrong the last three decades. Six out of thirty ain’t bad. That’s 80% accuracy. There seem to be three main things that cause us to screw up the MVP vote."}, {"8ff8": "1. Voter fatigue"}, {"c3c9": "We get bored of greatness. Our eyes wander. This was a problem in 2011, 2001, and 1997."}, {"d614": "2. Ignoring individual greatness on otherwise average teams"}, {"c5b1": "We think MVPs should win a lot, even when they have average or bad rosters. A problem in 2008, 2006, and 1989."}, {"06e1": "3. The one clear best team is too well-rounded"}, {"af4c": "A team head and shoulders better than everyone else should have the MVP, but how can someone be most valuable when there’s 2–3 someones to pick from? A problem in 2008, 2006, 1990, and 1989."}, {"6a5f": "The Golden State Warriors are a great team. They’re going to win 67 games, tied for the seventh-best regular season ever. Only twelve teams in history have won 67. Nine had the MVP, one had Kawhi last year, and one stupidly lost the MVP to Malone. The last was an all-time great 1972 Lakers squad that saw Wilt and West split the vote and finish behind an admittedly-deserving 35/17/5 season from Kareem."}, {"41d2": "History says the best team should have the MVP, especially if they are this much the best team. And the Warriors just happen to have two former MVPs in their prime in Curry and Durant. So why isn’t one of them the MVP? Maybe this is a case of the great team being too well-rounded and the candidates cancel each other out."}, {"32e2": "There’s no voter fatigue for Kawhi or Harden. If anything, we ought to be careful trying to elevate what may be their one best season to MVP status. History says Steve Nash was a fun player that should have won one or no MVP awards. If we give this to Harden, will we look back in five years and feel just as dumb as we do about Nash?"}, {"7e13": "You might point to voter fatigue and individual greatness for LeBron, but he has the third best stats on the fifth best team. That’s never been a winning MVP formula. Kawhi isn’t the MVP either. Plenty of MVPs have gone to the best player on the best team, but the Spurs aren’t the best team, and Kawhi’s numbers just don’t measure up to the other three. Kawhi winning MVP is a win for advanced metrics but a loss for history and common sense."}, {"98b2": "That leaves Russell Westbrook. We’ve ignored individual greatness in the past in the name of wins. It cost LeBron and Jordan at least one MVP, it cost Kobe, and you can debate a few others. Russell Westbrook just completed one of the all-time individual NBA seasons, one we will remember forever. Will his team’s average record cost him too?"}, {"0841": "Maybe the MVP is actually none of the above. Perhaps voter fatigue is not the problem for LeBron James but rather for the leader of the new superteam everyone turned against. That would be the defending two-time MVP, the one who went 204–34 the last three seasons and just put up another 25/4.5/6.5 on 63% true shooting, the best player on by far the best team. Is Steph Curry the MVP yet again, voter fatigue and all?"}, {"fc78": "He’s not going to win it, but maybe he should. Maybe the Warriors are about to rampage through the playoffs and win another title, and maybe Curry continues to rack up records and wins and MVPs. Maybe we’ll look back at this season a decade from now and wonder how we ever thought it was the Westbrook or Harden season when it was the Warriors season all along, and Chef Curry was cooking up another MVP season without us even noticing."}, {"6c60": "If you enjoyed this, please recommend by clicking the ❤ so others can too. Follow Brandon on Medium or @wheatonbrando for more sports, humor, pop culture, & life musings. Visit the rest of Brandon’s writing archives here."}], "content": "What Happens When We Get the NBA MVP Wrong? A quick history lesson may stop us from screwing this one up… The NBA season ends today, and perhaps the MVP debate along with it. What was supposed to be a boring season en route to Warriors-Cavs III became a showcase for a slew of rising stars and some of the greatest stats we’ve ever seen, night after night all season long. Giannis Antetokounmpo, Isaiah Thomas, John Wall, Jimmy Butler, and Rudy Gobert all had spectacular seasons, and most ballots won’t include a single one of them. It’s time to cast our MVP vote and settle this thing once and for all, and by once and for all I mean we’ll continue to debate it for ten weeks until it’s announced on June 26th. Sometimes we get the MVP wrong, and with so many incredible candidates this year, it’s possible we’ll do it again. Which MVPs did we get wrong, and what can the last three decades of history teach us to stop us from screwing up again? The Absurdity of Triple-Doubles and the Incredible 2017 NBA SeasonWhat happens when five or ten NBA players all have historic seasons at once? 2011 — Derrick Rose LeBron left for South Beach, and everyone hated him. The Bulls beat the Cavs by four wins to take the East 1-seed, and we rewarded Rose’s 25/4/8 on wretched shooting with an MVP and breathed a sigh of relief that we didn’t have to give it to LeBron again. We even voted Dwight Howard ahead of LeBron that year. Dwight Howard! LeBron put up 27/8/7, adjusted to a new team, and led them to the league’s third best record. The Spurs won 61 without any great individual seasons and we found out why when they lost to the 8-seed Grizzlies in the first round. It was a weak MVP year, but LeBron was the best candidate in a bad field. Who should’ve won: LeBron James 2008 — Kobe Bryant ‘05 to ‘08 was a weak stretch. Nash had won two MVPs followed by Dirk, and we were sick of our MVPs choking in the playoffs. Kobe had 28/6/5 for a Lakers team that had the best record in the West but was three losses away from being the 6-seed, so we gave him a career award. There was only one great team in 2008, and it was the 66–16 Celtics. KG was the best player on both ends of the court for the league’s best team, but his 19/9/3 left you wanting. LeBron had 30/8/7 but the Cavs won only 45 games. The Suns were as good as the year before and so was Nash, but we had realized our idiocy by then. Instead voters turned to Chris “Karl Malone as a point guard” Paul, whose 21/4/12 was far better than anything Nash ever did. CP3 finished second but should’ve won if you think the Nash MVPs are valid. Garnett was the best player on the best team and should’ve won if you overvalue heart and intangibles. But in the absence of a clear choice, you just have to go with the numbers, and 30/8/7 speaks for itself. Who should’ve won: LeBron James 2006 — Steve Nash Nash was the defending winner in the worst MVP race in decades. The Suns won 54 and Nash had 19/4/10. The defending champion Pistons had the league’s best record at 64–18 but were a team without a superstar. Voters didn’t know what to do, so 15 of them voted for Chauncey Billups with his 19/3/9. That’s not an MVP line but he equaled Nash’s stats, won 10 more games, and was the defending champ so there’s that. The other best teams in the league were the Spurs and Mavs. Duncan’s 19/11/3 was nice enough, and Dirk’s 27/9/3 gave him a third place finish. Wade’s 27/6/7 was completely overlooked on a 52-win Heat team that ended up winning the title. LeBron put up 31/7/7 on a 50-win Cavs team in a horrible East, while Kobe hero-balled his way to 35/5/5 to carry an abysmal Lakers roster whose third best player was Smush Parker (no, seriously) to 45 wins and the playoffs. Nash was not the 2006 MVP, but no one else was either. It’s hindsight to give it to Wade after his title run, but it’s a regular season award. This hurts, but it should’ve been Kobe. He was incredible with absolutely nothing around him. Smush Parker makes Victor Oladipo look like MJ. What Kobe did without Shaq or any help was great, and he gets the career achievement bump too. Who should’ve won: Kobe Bryant 2005 — Steve Nash In Nash’s first MVP season, the Suns led the league with 62 wins behind 15.5/3/11.5 from Nash. Shaq joined the Heat and put up 23/10/3, finishing second in an MVP race he shouldn’t have been part of. Dirk and Duncan were better for better teams that didn’t have the luxury of playing in the East. Defending MVP Kevin Garnett was the best player with 22/14/6 but the Timberwolves missed the playoffs because Minnesota. Truthfully, there wasn’t an MVP this season. The best two players were KG and LeBron but both missed the playoffs. When there’s no other worthy candidate, MVP goes to the best player on the best team. Who should’ve won: Steve Nash, I guess Joel Embiid is Definitely Your NBA Rookie of the YearSo what if he lapped the entire field in only half a season? 2001 — Allen Iverson The ‘99-00 Shaqobe Lakers went 67–15 and clobbered everyone, then coasted to 56 wins this year, still only two games off the league’s best record in a year without a great team. Except there was a great team — it was the Lakers, but they didn’t bother showing up until the playoffs and then murdered everyone. The Spurs were the West 1-seed and Duncan had a lovely 22/12/3 line, while plucky Philadelphia was the East 1-seed behind Iverson’s inefficient 31/4/5 and a bunch of defenders. Iverson was tiny and fun but this would be like giving Isaiah Thomas the MVP this year because the Celtics won a crappy East regular season. Isaiah is not the MVP, and Iverson wasn’t either. Shaq put up 29/13/4 without even trying and was still the MVP, even if it felt a little icky with him mailing in the season. Who should’ve won: Shaquille O’Neal 1997 — Karl Malone Let’s not belabor this one. Malone had finished top-8 in the MVP voting nine consecutive seasons without breaking through. Jordan was top-3 his last eight full seasons and we took him for granted. The Jazz won 64 games and Malone was really good. The Bulls were the defending champ and went 69–13 and Jordan was even better. We blew it. Who should’ve won: Michael Jordan 1990 — Magic Johnson This was one of the closest MVP races ever. Magic won with the fewest first-place votes ever, just 27. Barkley had more first-place votes with 38 but finished second in total voting. Jordan got 21 firsts and finished third. The Pistons were the defending champs and the East 1-seed but had no real MVP candidate. The Bulls were second best in the East but Jordan hadn’t escaped the Pistons yet and though his 34/7/6 line was absurd as always, people were starting to wonder if MJ could win the big one. Barkley’s 25/12/4 was terrific but the Sixers had only the eighth best record, and Malone and Robinson were just as good. He shouldn’t have been a top candidate. Magic’s Lakers rolled through the West again, earning the 1-seed for an absurd ninth straight season with 63 wins and the best record in the league. Magic had 22/7/12. The MVP should have been either him or Jordan, and tie probably goes to Magic on momentum and the best-player-best-team criteria. Who should’ve won: Magic Johnson? 1989 — Magic Johnson The Pistons had the best record in the league at 63–19 and were about to win it all after losing in the Finals the year before — but they were a rounded team with no real MVP candidate. Dumars and Isiah each got one last-place vote and, really, Rodman may have been their MVP. The Lakers were back-to-back champs and the West 1-seed again, though they went only 57–25. The Bulls dropped from the 3- to the 6-seed in the East, finishing fifth of six teams in an impossible division. Jordan had an absurd season with 33/8/8, the closest line we’ve seen to Westbrook this year. Magic had 23/8/13 himself, probably his best all-around individual numbers. Magic got exactly half of the first-place votes, literally 42.5 of 85 votes because one voter chose co-MVPs with Magic and Jordan. Jordan was a close second. In hindsight, perhaps it should’ve been the other way around. It feels like Magic and MJ could’ve been co-MVPs in ‘89 and ‘90 so it seems fair to give them each one. Who should’ve won: Michael Jordan? The 2016–17 Tim Duncan All StarsWho are the best bargain players in the NBA this season? So what have we learned? We got six MVPs wrong the last three decades. Six out of thirty ain’t bad. That’s 80% accuracy. There seem to be three main things that cause us to screw up the MVP vote. 1. Voter fatigue We get bored of greatness. Our eyes wander. This was a problem in 2011, 2001, and 1997. 2. Ignoring individual greatness on otherwise average teams We think MVPs should win a lot, even when they have average or bad rosters. A problem in 2008, 2006, and 1989. 3. The one clear best team is too well-rounded A team head and shoulders better than everyone else should have the MVP, but how can someone be most valuable when there’s 2–3 someones to pick from? A problem in 2008, 2006, 1990, and 1989. The Golden State Warriors are a great team. They’re going to win 67 games, tied for the seventh-best regular season ever. Only twelve teams in history have won 67. Nine had the MVP, one had Kawhi last year, and one stupidly lost the MVP to Malone. The last was an all-time great 1972 Lakers squad that saw Wilt and West split the vote and finish behind an admittedly-deserving 35/17/5 season from Kareem. History says the best team should have the MVP, especially if they are this much the best team. And the Warriors just happen to have two former MVPs in their prime in Curry and Durant. So why isn’t one of them the MVP? Maybe this is a case of the great team being too well-rounded and the candidates cancel each other out. There’s no voter fatigue for Kawhi or Harden. If anything, we ought to be careful trying to elevate what may be their one best season to MVP status. History says Steve Nash was a fun player that should have won one or no MVP awards. If we give this to Harden, will we look back in five years and feel just as dumb as we do about Nash? You might point to voter fatigue and individual greatness for LeBron, but he has the third best stats on the fifth best team. That’s never been a winning MVP formula. Kawhi isn’t the MVP either. Plenty of MVPs have gone to the best player on the best team, but the Spurs aren’t the best team, and Kawhi’s numbers just don’t measure up to the other three. Kawhi winning MVP is a win for advanced metrics but a loss for history and common sense. That leaves Russell Westbrook. We’ve ignored individual greatness in the past in the name of wins. It cost LeBron and Jordan at least one MVP, it cost Kobe, and you can debate a few others. Russell Westbrook just completed one of the all-time individual NBA seasons, one we will remember forever. Will his team’s average record cost him too? Maybe the MVP is actually none of the above. Perhaps voter fatigue is not the problem for LeBron James but rather for the leader of the new superteam everyone turned against. That would be the defending two-time MVP, the one who went 204–34 the last three seasons and just put up another 25/4.5/6.5 on 63% true shooting, the best player on by far the best team. Is Steph Curry the MVP yet again, voter fatigue and all? He’s not going to win it, but maybe he should. Maybe the Warriors are about to rampage through the playoffs and win another title, and maybe Curry continues to rack up records and wins and MVPs. Maybe we’ll look back at this season a decade from now and wonder how we ever thought it was the Westbrook or Harden season when it was the Warriors season all along, and Chef Curry was cooking up another MVP season without us even noticing. If you enjoyed this, please recommend by clicking the ❤ so others can too. Follow Brandon on Medium or @wheatonbrando for more sports, humor, pop culture, & life musings. Visit the rest of Brandon’s writing archives here. ", "child": "96_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_996_1\t96_2\t96_3\t96_4\t96_5\t96_6\t96_7\t96_8\t96_9"}