{"name": "970", "parent": "", "title": "Save development hours and simplify mobile app testing with Applivery", "sentences": [{"4a88": "Save development hours and simplify mobile app testing with Applivery"}, {"a75f": "Originally published at siftery.com."}, {"4b20": "Applivery is the definitive and easiest way to distribute iOS and Android applications for beta testing or enterprise purposes. Your clients always will have an updated version wherever they are. You can create white label distribution sites customizing the distribution method (open, registration or password protection). Manage your applications and who will be able to download your app (clients, developers, admins), customize look & feel of your sites, analyze App installations and much more."}, {"c09b": "Kevin William David interviewed César Trigo, Founder & CEO of Applivery to learn more about what they are doing."}, {"a639": "Can you tell us about what you are working on ? What is Applivery?"}, {"8d0d": "Applivery is a Mobile App distribution system for Continuous deployment, Beta testing, Feedback, Bug reporting & Enterprise App distribution with the aim of saving development hours and the simplify testing of iOS and Android native Apps."}, {"9fd1": "It is integrated with the most popular continuous integration and deployment systems like Bitrise.io, Fastlane, Jenkins and Travis but also provides a powerful API to have full control over your development cycle."}, {"2b06": "Applivery brings a new way the distribute native Apps, in an easier and elegant way, by creating beautiful and fully customizable landing sites to distribute your App. Different security levels can be applied to protect the site or make it public."}, {"53b5": "Along with that, Applivery also provides an iOS and Android native SDK that bring additional useful features like in-app updates, forced updates, feedback and bug reporting."}, {"25e7": "Why are you building this? What problem are you trying to solve?"}, {"4ea4": "We started creating Applivery 1 year and a half ago after detecting a very common business need not covered by any other product before. It was the need of a tool to easily distribute iOS and Android Apps both under the same link, with high level of customization: logos, images, colors, messages to the users and even the domain name. Since we couldn’t find anything like that in the market, we decided to build our own product and everything started with a very basic landing site creation tool to customize the user experience while downloading the Apps. We focused all our efforts into making it as easy as possible for the ones receiving the links to the landing sites to download and install the App."}, {"b21a": "Who are your top competitors & how is Applivery different from what’s already exists in the market? What’s unique about what you are building & why do you think companies should use Applivery?"}, {"8a70": "Well, actually we have lot of competitors in the market but no one of them is doing exactly the same thing as we do. I would say that we have two different kind of competitors: Beta testing platforms and Mobile Device Management Systems (MDMs)."}, {"2f5a": "From the Beta testing perspective I can highlight HockeyApp (acquired by Microsoft), Testflight (acquired by Apple), Crashlytics (acquired by Twitter and now Google), Testfairy and Buddybuild. Surely they sound familiar for the ones reading this. From the MDMs and Private Stores side: AirWatch (acquired by VMWare) or MobileIron, Appaloosa beside others."}, {"4006": "As you can see, plenty of them, but there are two main differences between them and us: first is the fact that we are somewhere in the middle, providing beta testing features but also enterprise services. This is the perfect mix for big corporations that actually have MDMs in place but need something more straightaway. It’s also very useful for development agencies that need something agile to deliver the Apps they build to their customers. Second, and most important, that we provide a very friendly and fully customizable user experience for the end users so anyone can use it. They don’t need to have any technical knowledge or even understand the process itself since it’s as normal as downloading an App from the App Store or Google Play, something everyone does on daily basis."}, {"9c4a": "Who uses Applivery? Can you tell us a bit about the different customer segments using Applivery? What types of roles do your customers have at their companies (Sales, Marketing, Devops, etc.)?"}, {"f277": "Nowadays the platform has been adopted by lot of big corporations like Repsol, McDonalds or Coca-Cola thanks to local development companies that started using the service. Nowadays they use the service for different purposes from sharing beta versions between them and their development agencies to enterprise / in-house distribution. The roles adopting it are mainly marketing and operations managers."}, {"3ed0": "On the other hand, we have many other medium size development companies from Europe, USA and LATAM that use the service as a repository of versions but also, beta testing and simple way of exchanging versions of their App with their customers to receive feedback, bug reports or just have the final approval to go live. In this case, we usually talk to CTOs, development managers or technical leads."}, {"2a65": "Have there been unique use cases for Applivery that you hadn’t thought of or expected?"}, {"d781": "Yes! We have never expected to have gaming and betting companies using our service as an alternative option to the official App Stores. They use our service for those cases where they are not allowed to publish their Apps in the official App Stores (Google Play and Apple App Store), for instance because of the payment method used in the App. We are having a huge adoption."}, {"f934": "Were there any early ‘growth hacks’ or tactics that have contributed to your current success?"}, {"9c6d": "I would say that we had a great success at the very beginning since we released the service just for a reduced group of people and companies across the world, like a private beta. The only way to join the service was being invited by someone else with a registered account. I think that provides a feeling of exclusivity to the early adopters. Once released the public version we really focused our efforts on the SEO optimization and social media. We are having very good results."}, {"f0ad": "What were some of the biggest challenges while building the product early on and how did you solve them?"}, {"4567": "It will sound like a joke for the ones reading this outside Spain but creating a company here is a nightmare. There are thousands of tedious and boring processes and lot of regulations you must follow. On top of that, it takes more than one month to legally be allowed to start your business. Trust me, sometimes you really want to throw the towel before start! Actually, the easiest part was to build the service or even starting having some customers."}, {"d4e5": "What have been some of the most interesting integrations you’ve added? Are there any that have been particularly impactful for you?From the very beginning we noticed that main ones recommending our product are the App development companies so we always try to do their lives easier from the onboarding process point of view but also when they really need to speed up their processes. That’s why we decided to integrate Applivery with almost all the existing continuous Integration, Deployment and Delivery platforms (CI, CD) like Bitrise.io, Fastlane Tools, Jenkins and Travis. These were the main drivers of our success since they really help our users to effortless deploy their Apps in Applivery and then, with some minimal configurations, have everything working in a matter of minutes."}, {"9e02": "In addition, Applivery is also integrated with the main Issue tracking systems (JIRA and Trello) and messaging platforms like Slack or HipChat that not only notifies the users about what is going on, but also allows the installation of the App without leaving the messaging platform."}, {"12eb": "What are top 5–10 products that you depend to run the company & how do you use them?"}, {"8839": "I’d say that all of this wouldn’t be possible without products and technologies like MongoDB (our main business logic storage system), AWS S3 and CloudFront (for the storage and distribution of the builds), NodeJS (webserver and backend technology), Mailchimp and Mandrill (for the transactional emails, mainly notifications of new versions and invitations) and Stripe (for everything related with payments, recurring billing and fraud control)."}, {"df15": "Do you use Applivery and recommend them? You can do it here https://siftery.com/applivery?recommend."}], "content": "Save development hours and simplify mobile app testing with Applivery Originally published at siftery.com. Applivery is the definitive and easiest way to distribute iOS and Android applications for beta testing or enterprise purposes. Your clients always will have an updated version wherever they are. You can create white label distribution sites customizing the distribution method (open, registration or password protection). Manage your applications and who will be able to download your app (clients, developers, admins), customize look & feel of your sites, analyze App installations and much more. Kevin William David interviewed César Trigo, Founder & CEO of Applivery to learn more about what they are doing. Can you tell us about what you are working on ? What is Applivery? Applivery is a Mobile App distribution system for Continuous deployment, Beta testing, Feedback, Bug reporting & Enterprise App distribution with the aim of saving development hours and the simplify testing of iOS and Android native Apps. It is integrated with the most popular continuous integration and deployment systems like Bitrise.io, Fastlane, Jenkins and Travis but also provides a powerful API to have full control over your development cycle. Applivery brings a new way the distribute native Apps, in an easier and elegant way, by creating beautiful and fully customizable landing sites to distribute your App. Different security levels can be applied to protect the site or make it public. Along with that, Applivery also provides an iOS and Android native SDK that bring additional useful features like in-app updates, forced updates, feedback and bug reporting. Why are you building this? What problem are you trying to solve? We started creating Applivery 1 year and a half ago after detecting a very common business need not covered by any other product before. It was the need of a tool to easily distribute iOS and Android Apps both under the same link, with high level of customization: logos, images, colors, messages to the users and even the domain name. Since we couldn’t find anything like that in the market, we decided to build our own product and everything started with a very basic landing site creation tool to customize the user experience while downloading the Apps. We focused all our efforts into making it as easy as possible for the ones receiving the links to the landing sites to download and install the App. Who are your top competitors & how is Applivery different from what’s already exists in the market? What’s unique about what you are building & why do you think companies should use Applivery? Well, actually we have lot of competitors in the market but no one of them is doing exactly the same thing as we do. I would say that we have two different kind of competitors: Beta testing platforms and Mobile Device Management Systems (MDMs). From the Beta testing perspective I can highlight HockeyApp (acquired by Microsoft), Testflight (acquired by Apple), Crashlytics (acquired by Twitter and now Google), Testfairy and Buddybuild. Surely they sound familiar for the ones reading this. From the MDMs and Private Stores side: AirWatch (acquired by VMWare) or MobileIron, Appaloosa beside others. As you can see, plenty of them, but there are two main differences between them and us: first is the fact that we are somewhere in the middle, providing beta testing features but also enterprise services. This is the perfect mix for big corporations that actually have MDMs in place but need something more straightaway. It’s also very useful for development agencies that need something agile to deliver the Apps they build to their customers. Second, and most important, that we provide a very friendly and fully customizable user experience for the end users so anyone can use it. They don’t need to have any technical knowledge or even understand the process itself since it’s as normal as downloading an App from the App Store or Google Play, something everyone does on daily basis. Who uses Applivery? Can you tell us a bit about the different customer segments using Applivery? What types of roles do your customers have at their companies (Sales, Marketing, Devops, etc.)? Nowadays the platform has been adopted by lot of big corporations like Repsol, McDonalds or Coca-Cola thanks to local development companies that started using the service. Nowadays they use the service for different purposes from sharing beta versions between them and their development agencies to enterprise / in-house distribution. The roles adopting it are mainly marketing and operations managers. On the other hand, we have many other medium size development companies from Europe, USA and LATAM that use the service as a repository of versions but also, beta testing and simple way of exchanging versions of their App with their customers to receive feedback, bug reports or just have the final approval to go live. In this case, we usually talk to CTOs, development managers or technical leads. Have there been unique use cases for Applivery that you hadn’t thought of or expected? Yes! We have never expected to have gaming and betting companies using our service as an alternative option to the official App Stores. They use our service for those cases where they are not allowed to publish their Apps in the official App Stores (Google Play and Apple App Store), for instance because of the payment method used in the App. We are having a huge adoption. Were there any early ‘growth hacks’ or tactics that have contributed to your current success? I would say that we had a great success at the very beginning since we released the service just for a reduced group of people and companies across the world, like a private beta. The only way to join the service was being invited by someone else with a registered account. I think that provides a feeling of exclusivity to the early adopters. Once released the public version we really focused our efforts on the SEO optimization and social media. We are having very good results. What were some of the biggest challenges while building the product early on and how did you solve them? It will sound like a joke for the ones reading this outside Spain but creating a company here is a nightmare. There are thousands of tedious and boring processes and lot of regulations you must follow. On top of that, it takes more than one month to legally be allowed to start your business. Trust me, sometimes you really want to throw the towel before start! Actually, the easiest part was to build the service or even starting having some customers. What have been some of the most interesting integrations you’ve added? Are there any that have been particularly impactful for you?From the very beginning we noticed that main ones recommending our product are the App development companies so we always try to do their lives easier from the onboarding process point of view but also when they really need to speed up their processes. That’s why we decided to integrate Applivery with almost all the existing continuous Integration, Deployment and Delivery platforms (CI, CD) like Bitrise.io, Fastlane Tools, Jenkins and Travis. These were the main drivers of our success since they really help our users to effortless deploy their Apps in Applivery and then, with some minimal configurations, have everything working in a matter of minutes. In addition, Applivery is also integrated with the main Issue tracking systems (JIRA and Trello) and messaging platforms like Slack or HipChat that not only notifies the users about what is going on, but also allows the installation of the App without leaving the messaging platform. What are top 5–10 products that you depend to run the company & how do you use them? I’d say that all of this wouldn’t be possible without products and technologies like MongoDB (our main business logic storage system), AWS S3 and CloudFront (for the storage and distribution of the builds), NodeJS (webserver and backend technology), Mailchimp and Mandrill (for the transactional emails, mainly notifications of new versions and invitations) and Stripe (for everything related with payments, recurring billing and fraud control). Do you use Applivery and recommend them? You can do it here https://siftery.com/applivery?recommend. ", "child": "970_1970_1"}