{"name": "978", "parent": "", "title": "My Inbox to Yours 002 | DailyVee Changed My Life", "sentences": [{"eea6": "My Inbox to Yours 002 | DailyVee Changed My Life"}, {"4775": "Sometimes it’s better to hear from each other, I want to use Medium for a few months to start trying that, hope you enjoy this second installment of My Inbox to Yours …"}, {"cb74": "From: Christopher Date: Thu, Mar 9, 2017Subject: Re: Daily V changed my life. Thanks!To: Gary Vaynerchuk"}, {"2429": "Gary,"}, {"983f": "Daily V changed my life. I started watching your content back in 2010. I loved the energy pizazz etc. I was working at a start up and found it entertaining."}, {"db2e": "Your video on self-awareness kicked me in the soul. I wanted to be an entrepreneur so bad but I was stuck in a strategy and leadership role. So I started a side hustle. Worked from 9pm-2am for a few months, you know how it goes."}, {"6b3a": "Then it hit me. Fuck it. I’m a sales leader, not an entrepreneur. I LOVE sales. I had spent five years helping grow a business from 1–50m a year in net new sales. I wanted more. So I pushed my chips in, all of them. Inspired by the Daily V and seeing how hard you went I scheduled a blitz trip to Austin. 36 hours, 5 meetings, 2 dinners, one happy hour, $150 bucks in Uber fairs. 3 job offers."}, {"c0bb": "8 months later, I’ve watched maybe an hour of your content. But the company I run sales at is killing it and the rest of my life “marriage, fatherhood, friends” is in a much better place."}, {"3d90": "I’m not coming to your SXSW keynote, even though it’s a 5 min walk from my office. Frankly, it’s not the best use of my time and money."}, {"b901": "That said enjoy SXSW. If you find yourself with 5 mins and want to shoot some coffee when you’re in Austin txt me. I’m right around the corner at 5th and congress, I’ll walk down and meet you, or you could escape to our office for a break from the crowds."}, {"db75": "Thanks for what you do. Know that the work you’ve done has helped inspire the rocketing of a 30 person company and changed the life of a small family of 4 for the better."}, {"d040": "Chris"}, {"9b94": "Thanks for reading my new series! If you enjoyed it, hit that heart button below ;)"}], "content": "My Inbox to Yours 002 | DailyVee Changed My Life Sometimes it’s better to hear from each other, I want to use Medium for a few months to start trying that, hope you enjoy this second installment of My Inbox to Yours … From: Christopher Date: Thu, Mar 9, 2017Subject: Re: Daily V changed my life. Thanks!To: Gary Vaynerchuk Gary, Daily V changed my life. I started watching your content back in 2010. I loved the energy pizazz etc. I was working at a start up and found it entertaining. Your video on self-awareness kicked me in the soul. I wanted to be an entrepreneur so bad but I was stuck in a strategy and leadership role. So I started a side hustle. Worked from 9pm-2am for a few months, you know how it goes. Then it hit me. Fuck it. I’m a sales leader, not an entrepreneur. I LOVE sales. I had spent five years helping grow a business from 1–50m a year in net new sales. I wanted more. So I pushed my chips in, all of them. Inspired by the Daily V and seeing how hard you went I scheduled a blitz trip to Austin. 36 hours, 5 meetings, 2 dinners, one happy hour, $150 bucks in Uber fairs. 3 job offers. 8 months later, I’ve watched maybe an hour of your content. But the company I run sales at is killing it and the rest of my life “marriage, fatherhood, friends” is in a much better place. I’m not coming to your SXSW keynote, even though it’s a 5 min walk from my office. Frankly, it’s not the best use of my time and money. That said enjoy SXSW. If you find yourself with 5 mins and want to shoot some coffee when you’re in Austin txt me. I’m right around the corner at 5th and congress, I’ll walk down and meet you, or you could escape to our office for a break from the crowds. Thanks for what you do. Know that the work you’ve done has helped inspire the rocketing of a 30 person company and changed the life of a small family of 4 for the better. Chris Thanks for reading my new series! If you enjoyed it, hit that heart button below ;) ", "child": "978_1\t978_2\t978_3\t978_4\t978_5\t978_6\t978_7\t978_8\t978_9\t978_10\t978_11\t978_12\t978_13\t978_14\t978_15\t978_16\t978_17\t978_18\t978_19\t978_20\t978_21\t978_22\t978_23\t978_24\t978_25978_1\t978_2\t978_3\t978_4\t978_5\t978_6\t978_7\t978_8\t978_9\t978_10\t978_11\t978_12\t978_13\t978_14\t978_15\t978_16\t978_17\t978_18\t978_19\t978_20\t978_21\t978_22\t978_23\t978_24\t978_25"}