{"name": "98", "parent": "", "title": "The NBA Playoffs Fear Index", "sentences": [{"249f": "NBShea"}, {"6c00": "The NBA Playoffs Fear Index"}, {"4536": "Are the Cavs “Playoff Scary”? You know, “I don’t want to play them” scary? What about the Warriors, or the Celtics? Let’s figure it out."}, {"f097": "A term that I’m going to use a lot in this column is “Playoff Scary,” which, by way of a short explanation, simply means, “a team that is scary in the playoffs.” By way of a long explanation, it means:"}, {"743c": "A team that’s Playoff Scary is one where, OK, imagine this: Imagine it’s a week ago and you’re walking home from work or school or wherever. It’s nice out and you have on your best headphones and you’re listening to your best song and things in your life at that exact moment are just generally going great. But then, tragedy: You step out into the street and, out of nowhere, BLAMM-O! You get hit by a truck."}, {"2f99": "Here’s the thing, though: You, being the strong and wonderful and beautiful and talented and cosmically-protected-by-the-universe person that you are, survive the hit. Matter of fact, it barely even hurts you. The only thing of consequence that happens is you end up getting knocked unconscious, and you actually stay unconscious all the way up until today, April 12, 2017. (Since we are imagining this situation, let’s go ahead and bake into it that your coma is somehow viewed in an entirely positive light by everyone. During hospital rounds, doctors approach your bed with groups of residents and say things like, “This person is experiencing a new phenomenon called the Affirmative Coma, which, truth be told, is pretty much like taking a very good nap. This person will wake up and be happier and smarter and more attractive, and also will have considerably more followers on social media than before the accident. We should all be so lucky.”)"}, {"afcf": "OK, so all that happened, and today is the day that you wake up. You open your eyes, you squint a bit, you do a couple of those heavy movie blinks. It takes you a moment to gather your wits about you, but only a small one, given that you’re so much smarter now. You fish on the side of your bed for the call button. You find it. You click it. A nurse walks over, and he smiles at you. “Well, good morning, Mr. Sleepy Head,” he says, and it’s somehow not even annoying. In fact, it’s charming. “We’ve been waiting for you.”"}, {"b338": "You do your best to smile back at him, and guess what: It’s a perfect smile, because somehow the truck knocked your teeth into perfect alignment. “What day is it,” you ask. “April 12th,” the nurse says. “Wow,” you say, startled. “I was out for a whole week?” The nurse answers back, “Yes.” “Cool,” you say. You blink a few more of those blinks, and then you, an avid NBA fan, go, “Hey. I know this is dumb that I’m even asking this right now, but who’d we get in the first round of the playoffs?”"}, {"6e3a": "Now, if the nurse says a team name and your first response is, “Oh, nice,” then that team is not Playoff Scary. If the nurse says a team name and your first response is, “Well, shit,” then yes, that team is Playoff Scary."}, {"b6e4": "(Getty Images)"}, {"4c0b": "To be clear, a team is not Playoff Scary simply because it is in the playoffs. That’s not how it works. And while a good record is an OK indicator of how Playoff Scary a team can be, it certainly is not the only indicator, nor is it the most important one."}, {"8d78": "I’ll give you an easy example: As I am writing this on Tuesday, the Boston Celtics, beneficiaries of Cleveland stumbling over its own feet since last Friday, are the no. 1 seed in the Eastern Conference, and were I to guess, they’ll hold that same standing after Wednesday night’s Celtics-Bucks game. The people most excited about this are the teams playing for the eighth seed, and the people least excited about it are the Raptors, currently in the third spot, because they know that that means that rather than facing the Celtics in the second round of the playoffs, they’re going to have to face the Cavs. The Celtics are a little bit Playoff Scary, sure, but the Cavs, despite having a worse record, are considerably more Playoff Scary."}, {"63b1": "Let’s go over each of the teams in the playoffs."}, {"a072": "(Getty Images)"}, {"5771": "Group I: The Halloween Haunted Houses"}, {"727c": "You know when Halloween haunted houses stopped being scary to me? Never, actually, because I am a coward. But do you know when they should’ve stopped being scary to me? When I found out that the fake monsters in them weren’t allowed to touch you. All they can do is jump out and yell at you, which, if you have to choose, that’s definitely way better than them jumping out and mauling you, you know what I’m saying? Teams that fall in this category can jump out and yell at you, but that’s about where their level of threat ends."}, {"f91f": "The Portland Trail Blazers: They mostly end up here because, as the eighth seed, they’re going to have to play Golden State in the first round, and probably the only thing you need to know here is that Golden State won its past four games against Portland by a combined 78 points. Swap them over to the Eastern Conference against the Celtics and the Blazers grade out at least a full level higher on the Fear Index. (The Warriors will win this series 4–1, but actually probably 4–0.)"}, {"ab3d": "The Miami Heat: There are three different ways that a team can be Playoff Scary: (1) They can be a decent team, but have someone who’s capable of going bonkers for a series and winning it by himself. (The Blazers have Damian Lillard and they also have C.J. McCollum, who has been the more surprising powerhouse this season, with 15 30-plus-point games this year, nearly double the amount he had in his three seasons prior. But both of those guys are neutralized by Steph + Klay + KD.) (2) They can be a very good team. (3) They can be a very good team while also having someone (or a few someones) who can go bonkers. The Heat just don’t check off any of those boxes. (If you want to build some kind of argument around how the Heat have the fifth-highest-rated defensive efficiency in the league, then that’s fine, but if you do that then I’m going to point out that the Celtics averaged nearly 10 points more per game against the Heat than the Heat gave up to everyone else this season, so don’t do that.)"}, {"a141": "(Getty Images)"}, {"1877": "Group II: The Rickety Roller Coasters"}, {"bd5c": "I’m not sure if this happens in other parts of the country, but in Texas people will just set up a bunch of carnival rides in a furniture store parking lot or whatever and have an insta-carnival for a weekend. Mostly it’s midway games, but they also always have three or four actual serious rides; rides that, if everything goes the way it’s supposed to go, then everything turns out OK, but if nuts and bolts and beams and shit start falling off because they weren’t put together right or screwed down right, then someone could get seriously hurt. Playing against these teams is like riding one of those rides. You’ll likely be fine, but there’s a chance it can go horribly, horribly wrong."}, {"6c30": "The Chicago Bulls: The only reasons they snuck out of that first group and into this one is because (a) Jimmy Butler is absolutely capable of stitching together six games in a row where he plays like a basketball demon, and (b) despite the fact that he’s had about the same effect as a very pretty mist this season, betting against Playoff Dwyane Wade is not a thing I am in the business of doing."}, {"f5eb": "The Atlanta Hawks/Washington Wizards/Toronto Raptors: They are exactly the same amount of dangerous to each other that they are not dangerous to anyone else.*"}, {"f7b5": "*The one exception here would be that the Raptors are probably a little bit scary to the Bucks."}, {"8de8": "The Memphis Grizzlies: The Spurs played the Grizzlies in the playoffs in 2016 and it was a total blitzing (4–0, Spurs). And, really, when they play again this postseason, there’s no true and concrete reason to expect this year’s version of that movie to be any different (the Spurs have a better offensive rating than the Grizzlies this season, a better defensive rating, a better starting lineup, a better bench, a better coach, a better superstar, a better overall seeding, etc.). But, aside from a few tenths of a percentage point, that was all true when the teams met in 2011, too, and it took a desperation 3 at the buzzer to even let the Spurs survive past Game 5 (they ultimately lost the series in Memphis that next game). I am terrified of this Spurs-Grizzlies matchup. I’m terrified of the Grizz — the real-life Suicide Squad, truly — tricking all of my beloved Spurs into getting on the Zipper, starting it up, then pulling out a pin and watching it crash down into a heap of sharp metal and terror.*"}, {"8f69": "*Coincidentally, “sharp metal and terror” is, I assume, the meal that Zach Randolph orders when he eats dinner at whatever junkyard he happens to enjoy spending his time in during his summers off."}, {"f79e": "The Indiana Pacers/Milwaukee Bucks/Oklahoma City Thunder: Three reasons: PLAYOFF PAUL GEORGE* and PLAYOFF GIANNIS** and PLAYOFF RUSSY WESTBROOK.***"}, {"6002": "*Of all the potential 1–8 seed matchups, a Celtics-Pacers series is the most interesting, because it is the most treacherous. I’m just super-duper curious to see how the Celtics react when, in Game 1 or Game 2 in Boston, Paul George exorcises someone at the rim, then breathes fire from his nose."}, {"2a4d": "**Let’s assume that the Cavs finish the season as the 2-seed. That’d be great because that would mean we get to have not only a (likely) Celtics-Cavs matchup in the conference finals, but also a Cavs-Raptors matchup in the second round. I would like to see that because the Raptors seem like they’re good and fed up with the Cavs beating them in the playoffs. THAT SAID, I don’t hate the idea of Giannis going yo-yo against the Raptors to stretch that series out, putting up something like 31–14–6 on the road in Game 7 for the upset, and then watching him try to stare down LeBron. I definitely do not hate that idea."}, {"1b4a": "***It is a testament to the unending individual greatness of Russell Westbrook that there will be, I would estimate, several thousand conversations among basketball fans prior to the start of the Rockets-Thunder series where one person is like, “The only way the Thunder get past the Rockets is if Westbrook averages something like 60–20–15 for the series,” and the other person is like, “I mean … let’s not rule it out, is all I’m saying.”"}, {"8538": "The Utah Jazz: [Closes eyes so tightly that they almost fuse together.] Gordon Hayward averages 29.6 points in the Jazz-Clippers series in his playoffs coming-out party. → The Jazz beat the Clippers in six. → Hayward’s confidence skyrockets. → The Jazz lose to the Warriors in the second round, but Hayward is devastating in the series, and becomes a national sensation. → Rudy Gobert averages eight blocks a game for both series. → He starts calling himself “The French Mark Eaton” in interviews. → He, too, becomes a national sensation. → Sensing the team is about to make the jump, Hayward opts to sign an extension early to stay in Utah. → As a result, Utah signs a very solid, championship-pedigree free agent after the season (Andre Iguodala, perhaps). → They make it again to the second round of the playoffs, this time losing a heartbreaker Game 7 to the Spurs. → Chris Paul, an unrestricted free agent the following summer, goes to Utah. → And now it’s a fucking problem for the rest of the league. → 2019 Western Conference finals: Utah Jazz vs. Golden State Warriors."}, {"be86": "Group III: The Stranger"}, {"514e": "You’re walking home. It’s late at night. The streets are cold and dark and mostly empty. Mostly. There’s a figure that you think has been following you. You cross the street to see what happens. Seconds later, the figure crosses, too. You can’t say for certain it’s following you and that it’s going to hurt you, but you got a feeling. That’s this team."}, {"a805": "The Los Angeles Clippers: Three things here: (1) All that I want is to see Chris Paul, the greatest point guard of his generation and also one of the greatest point guards of all time, play in a couple of capital-H, capital-S High-Stakes playoff games. That’s it. It really doesn’t seem like so much to ask. (2) What do you think is going to be the insane, bizarre, terrible, devastating way that the Clippers are going to fall apart in the playoffs this year? Some sort of fluke game (“BORIS DIAW SCORED 54 IN GAME 6?????”)? A freak injury (“BLAKE GRIFFIN GOT TEMPORARY AMNESIA????”)? The team plane flies to the wrong city? (3) Despite the universe’s apparent joy in dicking over the Clippers, I just can’t find it in myself to put a team with Chris Paul, Blake Griffin, DeAndre Jordan, and J.J. Redick any lower than Group III in this index. They won 50 games this season. That’s not a small number.*"}, {"474e": "*And yet, somehow it just feels so tiny."}, {"e5b4": "(Getty Images)"}, {"5702": "Group IV: “Hello? 911! There’s Someone in My House!”"}, {"58e0": "You’re at home. Alone. It’s the middle of the night. You’re asleep. There’s a noise. You’re awoken. You hear another noise. Then several noises. You do that thing where you scrunch up your face because you’re trying to be super good at hearing. You hear steps. There’s definitely someone out there who shouldn’t be out there. That’s these teams."}, {"02c6": "The Houston Rockets: The Rockets are one of the three most interesting teams in the playoffs this year for four different reasons: (1) The Rockets are making 3s at a historic clip (over 14 per game), and we’ve already seen the Warriors shred the “jump-shooting teams can’t win championships” thing, so who’s to say the Rockets can’t do it, too, what with them being even more jump-shoot-y than the Warriors have ever been. (2) James Harden, who was a human walking sigh by the end of last season, has been exquisite this season (averaging 29–8–11). And he’s already mad that he’s going to lose the MVP to Russell Westbrook, which means you can expect him to be at his absolute destruct-o-pettiest during the Rockets-Thunder first-round matchup. (3) Mike D’Antoni is headed toward a second-round matchup against Gregg Popovich, and I just want to point that out in case you forgot that behind just about every great war is two wealthy white men trying to poke each other in the eye. And (4) THAT SAID, is anyone really afraid of the Rockets past the second round?*"}, {"a8f4": "*I really like the Rockets As Punching-Up Underdogs story line in the playoffs this year. I think it fits them perfectly. Seems like I remember another Rockets team in that same exact role about 20-some-odd years ago …"}, {"7a8b": "The Boston Celtics: Just take the Rockets blurb, add in whatever you want for the first three points, and then end it with that same final point: Is anyone really afraid of the Celtics past the second round?"}, {"8edc": "The San Antonio Spurs: This breaks my heart, but … just take the Celtics blurb from above that was a redo of the Rockets blurb, add in whatever you want for the first three points, and then end it with that same final point: Is anyone really afraid of the Spurs past the second round?"}, {"10b7": "(Getty Images)"}, {"4d11": "Group V: The Angry, Rabid Dog That Has You Trapped in Your Car"}, {"a256": "Have you ever seen Cujo? That’s this group. That’s this team."}, {"798d": "The Cleveland Cavaliers: They have lost 12 of their past 21 games, including the past three in a row, which they were very clearly trying to win so they could lock up the no. 1 seed, and so that’s at least a little bit troubling. They have the ninth-worst defensive rating in the league. They are fighting with each other during games. It’s all a mess. And yet, here they sit. Because they have LeBron James, the single most terrifying player in the league, and nobody else has LeBron James, the single most terrifying player in the league."}, {"d0a2": "(Getty Images)"}, {"fa00": "Group VI: The Texas Chain Saw Massacre"}, {"ae61": "Let’s check in with the narrator of a documentary about the Golden State Warriors: “The film which you are about to see is an account of the tragedy which befell a group of five youths, in particular Sally Hardesty and her invalid brother, Franklin. It is all the more tragic in that they were young. But, had they lived very, very long lives, they could not have expected nor would they have wished to see as much of the mad and macabre as they were to see that day. For them, an idyllic summer-afternoon drive became a nightmare. The events of that day were to lead to the discovery of one of the most bizarre crimes in the annals of American history, the Texas Chain Saw Massacre.” That’s this team."}, {"8873": "The Golden State Warriors: Your 2016–17 NBA champions."}], "content": "NBShea The NBA Playoffs Fear Index Are the Cavs “Playoff Scary”? You know, “I don’t want to play them” scary? What about the Warriors, or the Celtics? Let’s figure it out. A term that I’m going to use a lot in this column is “Playoff Scary,” which, by way of a short explanation, simply means, “a team that is scary in the playoffs.” By way of a long explanation, it means: A team that’s Playoff Scary is one where, OK, imagine this: Imagine it’s a week ago and you’re walking home from work or school or wherever. It’s nice out and you have on your best headphones and you’re listening to your best song and things in your life at that exact moment are just generally going great. But then, tragedy: You step out into the street and, out of nowhere, BLAMM-O! You get hit by a truck. Here’s the thing, though: You, being the strong and wonderful and beautiful and talented and cosmically-protected-by-the-universe person that you are, survive the hit. Matter of fact, it barely even hurts you. The only thing of consequence that happens is you end up getting knocked unconscious, and you actually stay unconscious all the way up until today, April 12, 2017. (Since we are imagining this situation, let’s go ahead and bake into it that your coma is somehow viewed in an entirely positive light by everyone. During hospital rounds, doctors approach your bed with groups of residents and say things like, “This person is experiencing a new phenomenon called the Affirmative Coma, which, truth be told, is pretty much like taking a very good nap. This person will wake up and be happier and smarter and more attractive, and also will have considerably more followers on social media than before the accident. We should all be so lucky.”) OK, so all that happened, and today is the day that you wake up. You open your eyes, you squint a bit, you do a couple of those heavy movie blinks. It takes you a moment to gather your wits about you, but only a small one, given that you’re so much smarter now. You fish on the side of your bed for the call button. You find it. You click it. A nurse walks over, and he smiles at you. “Well, good morning, Mr. Sleepy Head,” he says, and it’s somehow not even annoying. In fact, it’s charming. “We’ve been waiting for you.” You do your best to smile back at him, and guess what: It’s a perfect smile, because somehow the truck knocked your teeth into perfect alignment. “What day is it,” you ask. “April 12th,” the nurse says. “Wow,” you say, startled. “I was out for a whole week?” The nurse answers back, “Yes.” “Cool,” you say. You blink a few more of those blinks, and then you, an avid NBA fan, go, “Hey. I know this is dumb that I’m even asking this right now, but who’d we get in the first round of the playoffs?” Now, if the nurse says a team name and your first response is, “Oh, nice,” then that team is not Playoff Scary. If the nurse says a team name and your first response is, “Well, shit,” then yes, that team is Playoff Scary. (Getty Images) To be clear, a team is not Playoff Scary simply because it is in the playoffs. That’s not how it works. And while a good record is an OK indicator of how Playoff Scary a team can be, it certainly is not the only indicator, nor is it the most important one. I’ll give you an easy example: As I am writing this on Tuesday, the Boston Celtics, beneficiaries of Cleveland stumbling over its own feet since last Friday, are the no. 1 seed in the Eastern Conference, and were I to guess, they’ll hold that same standing after Wednesday night’s Celtics-Bucks game. The people most excited about this are the teams playing for the eighth seed, and the people least excited about it are the Raptors, currently in the third spot, because they know that that means that rather than facing the Celtics in the second round of the playoffs, they’re going to have to face the Cavs. The Celtics are a little bit Playoff Scary, sure, but the Cavs, despite having a worse record, are considerably more Playoff Scary. Let’s go over each of the teams in the playoffs. (Getty Images) Group I: The Halloween Haunted Houses You know when Halloween haunted houses stopped being scary to me? Never, actually, because I am a coward. But do you know when they should’ve stopped being scary to me? When I found out that the fake monsters in them weren’t allowed to touch you. All they can do is jump out and yell at you, which, if you have to choose, that’s definitely way better than them jumping out and mauling you, you know what I’m saying? Teams that fall in this category can jump out and yell at you, but that’s about where their level of threat ends. The Portland Trail Blazers: They mostly end up here because, as the eighth seed, they’re going to have to play Golden State in the first round, and probably the only thing you need to know here is that Golden State won its past four games against Portland by a combined 78 points. Swap them over to the Eastern Conference against the Celtics and the Blazers grade out at least a full level higher on the Fear Index. (The Warriors will win this series 4–1, but actually probably 4–0.) The Miami Heat: There are three different ways that a team can be Playoff Scary: (1) They can be a decent team, but have someone who’s capable of going bonkers for a series and winning it by himself. (The Blazers have Damian Lillard and they also have C.J. McCollum, who has been the more surprising powerhouse this season, with 15 30-plus-point games this year, nearly double the amount he had in his three seasons prior. But both of those guys are neutralized by Steph + Klay + KD.) (2) They can be a very good team. (3) They can be a very good team while also having someone (or a few someones) who can go bonkers. The Heat just don’t check off any of those boxes. (If you want to build some kind of argument around how the Heat have the fifth-highest-rated defensive efficiency in the league, then that’s fine, but if you do that then I’m going to point out that the Celtics averaged nearly 10 points more per game against the Heat than the Heat gave up to everyone else this season, so don’t do that.) (Getty Images) Group II: The Rickety Roller Coasters I’m not sure if this happens in other parts of the country, but in Texas people will just set up a bunch of carnival rides in a furniture store parking lot or whatever and have an insta-carnival for a weekend. Mostly it’s midway games, but they also always have three or four actual serious rides; rides that, if everything goes the way it’s supposed to go, then everything turns out OK, but if nuts and bolts and beams and shit start falling off because they weren’t put together right or screwed down right, then someone could get seriously hurt. Playing against these teams is like riding one of those rides. You’ll likely be fine, but there’s a chance it can go horribly, horribly wrong. The Chicago Bulls: The only reasons they snuck out of that first group and into this one is because (a) Jimmy Butler is absolutely capable of stitching together six games in a row where he plays like a basketball demon, and (b) despite the fact that he’s had about the same effect as a very pretty mist this season, betting against Playoff Dwyane Wade is not a thing I am in the business of doing. The Atlanta Hawks/Washington Wizards/Toronto Raptors: They are exactly the same amount of dangerous to each other that they are not dangerous to anyone else.* *The one exception here would be that the Raptors are probably a little bit scary to the Bucks. The Memphis Grizzlies: The Spurs played the Grizzlies in the playoffs in 2016 and it was a total blitzing (4–0, Spurs). And, really, when they play again this postseason, there’s no true and concrete reason to expect this year’s version of that movie to be any different (the Spurs have a better offensive rating than the Grizzlies this season, a better defensive rating, a better starting lineup, a better bench, a better coach, a better superstar, a better overall seeding, etc.). But, aside from a few tenths of a percentage point, that was all true when the teams met in 2011, too, and it took a desperation 3 at the buzzer to even let the Spurs survive past Game 5 (they ultimately lost the series in Memphis that next game). I am terrified of this Spurs-Grizzlies matchup. I’m terrified of the Grizz — the real-life Suicide Squad, truly — tricking all of my beloved Spurs into getting on the Zipper, starting it up, then pulling out a pin and watching it crash down into a heap of sharp metal and terror.* *Coincidentally, “sharp metal and terror” is, I assume, the meal that Zach Randolph orders when he eats dinner at whatever junkyard he happens to enjoy spending his time in during his summers off. The Indiana Pacers/Milwaukee Bucks/Oklahoma City Thunder: Three reasons: PLAYOFF PAUL GEORGE* and PLAYOFF GIANNIS** and PLAYOFF RUSSY WESTBROOK.*** *Of all the potential 1–8 seed matchups, a Celtics-Pacers series is the most interesting, because it is the most treacherous. I’m just super-duper curious to see how the Celtics react when, in Game 1 or Game 2 in Boston, Paul George exorcises someone at the rim, then breathes fire from his nose. **Let’s assume that the Cavs finish the season as the 2-seed. That’d be great because that would mean we get to have not only a (likely) Celtics-Cavs matchup in the conference finals, but also a Cavs-Raptors matchup in the second round. I would like to see that because the Raptors seem like they’re good and fed up with the Cavs beating them in the playoffs. THAT SAID, I don’t hate the idea of Giannis going yo-yo against the Raptors to stretch that series out, putting up something like 31–14–6 on the road in Game 7 for the upset, and then watching him try to stare down LeBron. I definitely do not hate that idea. ***It is a testament to the unending individual greatness of Russell Westbrook that there will be, I would estimate, several thousand conversations among basketball fans prior to the start of the Rockets-Thunder series where one person is like, “The only way the Thunder get past the Rockets is if Westbrook averages something like 60–20–15 for the series,” and the other person is like, “I mean … let’s not rule it out, is all I’m saying.” The Utah Jazz: [Closes eyes so tightly that they almost fuse together.] Gordon Hayward averages 29.6 points in the Jazz-Clippers series in his playoffs coming-out party. → The Jazz beat the Clippers in six. → Hayward’s confidence skyrockets. → The Jazz lose to the Warriors in the second round, but Hayward is devastating in the series, and becomes a national sensation. → Rudy Gobert averages eight blocks a game for both series. → He starts calling himself “The French Mark Eaton” in interviews. → He, too, becomes a national sensation. → Sensing the team is about to make the jump, Hayward opts to sign an extension early to stay in Utah. → As a result, Utah signs a very solid, championship-pedigree free agent after the season (Andre Iguodala, perhaps). → They make it again to the second round of the playoffs, this time losing a heartbreaker Game 7 to the Spurs. → Chris Paul, an unrestricted free agent the following summer, goes to Utah. → And now it’s a fucking problem for the rest of the league. → 2019 Western Conference finals: Utah Jazz vs. Golden State Warriors. Group III: The Stranger You’re walking home. It’s late at night. The streets are cold and dark and mostly empty. Mostly. There’s a figure that you think has been following you. You cross the street to see what happens. Seconds later, the figure crosses, too. You can’t say for certain it’s following you and that it’s going to hurt you, but you got a feeling. That’s this team. The Los Angeles Clippers: Three things here: (1) All that I want is to see Chris Paul, the greatest point guard of his generation and also one of the greatest point guards of all time, play in a couple of capital-H, capital-S High-Stakes playoff games. That’s it. It really doesn’t seem like so much to ask. (2) What do you think is going to be the insane, bizarre, terrible, devastating way that the Clippers are going to fall apart in the playoffs this year? Some sort of fluke game (“BORIS DIAW SCORED 54 IN GAME 6?????”)? A freak injury (“BLAKE GRIFFIN GOT TEMPORARY AMNESIA????”)? The team plane flies to the wrong city? (3) Despite the universe’s apparent joy in dicking over the Clippers, I just can’t find it in myself to put a team with Chris Paul, Blake Griffin, DeAndre Jordan, and J.J. Redick any lower than Group III in this index. They won 50 games this season. That’s not a small number.* *And yet, somehow it just feels so tiny. (Getty Images) Group IV: “Hello? 911! There’s Someone in My House!” You’re at home. Alone. It’s the middle of the night. You’re asleep. There’s a noise. You’re awoken. You hear another noise. Then several noises. You do that thing where you scrunch up your face because you’re trying to be super good at hearing. You hear steps. There’s definitely someone out there who shouldn’t be out there. That’s these teams. The Houston Rockets: The Rockets are one of the three most interesting teams in the playoffs this year for four different reasons: (1) The Rockets are making 3s at a historic clip (over 14 per game), and we’ve already seen the Warriors shred the “jump-shooting teams can’t win championships” thing, so who’s to say the Rockets can’t do it, too, what with them being even more jump-shoot-y than the Warriors have ever been. (2) James Harden, who was a human walking sigh by the end of last season, has been exquisite this season (averaging 29–8–11). And he’s already mad that he’s going to lose the MVP to Russell Westbrook, which means you can expect him to be at his absolute destruct-o-pettiest during the Rockets-Thunder first-round matchup. (3) Mike D’Antoni is headed toward a second-round matchup against Gregg Popovich, and I just want to point that out in case you forgot that behind just about every great war is two wealthy white men trying to poke each other in the eye. And (4) THAT SAID, is anyone really afraid of the Rockets past the second round?* *I really like the Rockets As Punching-Up Underdogs story line in the playoffs this year. I think it fits them perfectly. Seems like I remember another Rockets team in that same exact role about 20-some-odd years ago … The Boston Celtics: Just take the Rockets blurb, add in whatever you want for the first three points, and then end it with that same final point: Is anyone really afraid of the Celtics past the second round? The San Antonio Spurs: This breaks my heart, but … just take the Celtics blurb from above that was a redo of the Rockets blurb, add in whatever you want for the first three points, and then end it with that same final point: Is anyone really afraid of the Spurs past the second round? (Getty Images) Group V: The Angry, Rabid Dog That Has You Trapped in Your Car Have you ever seen Cujo? That’s this group. That’s this team. The Cleveland Cavaliers: They have lost 12 of their past 21 games, including the past three in a row, which they were very clearly trying to win so they could lock up the no. 1 seed, and so that’s at least a little bit troubling. They have the ninth-worst defensive rating in the league. They are fighting with each other during games. It’s all a mess. And yet, here they sit. Because they have LeBron James, the single most terrifying player in the league, and nobody else has LeBron James, the single most terrifying player in the league. (Getty Images) Group VI: The Texas Chain Saw Massacre Let’s check in with the narrator of a documentary about the Golden State Warriors: “The film which you are about to see is an account of the tragedy which befell a group of five youths, in particular Sally Hardesty and her invalid brother, Franklin. It is all the more tragic in that they were young. But, had they lived very, very long lives, they could not have expected nor would they have wished to see as much of the mad and macabre as they were to see that day. For them, an idyllic summer-afternoon drive became a nightmare. The events of that day were to lead to the discovery of one of the most bizarre crimes in the annals of American history, the Texas Chain Saw Massacre.” That’s this team. The Golden State Warriors: Your 2016–17 NBA champions. ", "child": "98_1\t98_2\t98_3\t98_4\t98_5\t98_6\t98_7\t98_8\t98_9\t98_10\t98_11\t98_12\t98_13\t98_14\t98_15\t98_16\t98_17\t98_18\t98_19\t98_20\t98_21\t98_22\t98_23\t98_24\t98_25"}