{"name": "983", "parent": "", "title": "How to Use a CRM to Close the Gap Between Sales & Service", "sentences": [{"3094": "How to Use a CRM to Close the Gap Between Sales & Service"}, {"f02e": "By Tony Rodoni"}, {"5410": "For me, the importance of having connected sales and service teams can be summed up in one frustrating experience I had as a consumer. I was a long-time loyal customer of a particular company and called for assistance with a relatively routine issue. The service rep did not have access to my sales record and had no clue that I was a high-value customer. In fact, he made me jump through every conceivable hoop to get my issue resolved. And, right in the middle of that annoying rigmarole, one of the company’s sales reps called to sell me a new product. The timing could not have been worse."}, {"28dc": "Failed Connections are Costly"}, {"71c3": "When there’s a lack of coordination between sales and service, it is not just a problem for the customer, it can also be quite costly for the business. American Express found that 78% of consumers have changed their minds about an intended purchase because of a poor service experience. Moreover, the consequences do not end there. American Express has also found that people are 2x more likely to talk about a bad experience to their friends (vs. a good experience.) Consider that your business operates in a hyper-connected digital marketplace, and it is clear that any customer experience can have a long-lasting ripple effect."}, {"5123": "The upside is that a positive sales and service combination can help put your business on the map. In an Aberdeen Group study on the financial impact of customer service, 38% of businesses said recipients of good service promoted the company’s brand, 37% said they bring in new customers, and 35% said satisfied customers spent more on products and services."}, {"41ed": "New Technology, New Expectations"}, {"f088": "Many smart companies have already connected their sales and service teams through the single platform known as customer relationship management, or CRM."}, {"d6a6": "Because CRM is available in the cloud, it allows sales and service teams to access and work with the exact same customer information at all times and from any device. This enables both sales and service reps to expand their roles and provide the connected experience customers expect."}, {"c3d8": "For sales reps, it is about achieving the “marketing mindset” they need to be successful with modern customers. The focus should be on helping customers find the best solutions to their problems rather than simply making a sale. Service records provide a unique perspective on customer pain points that can arm sales reps with the additional insights they need to be of maximum value to each customer."}, {"735c": "Service insights can also help sales reps perfect their timing. For example, if a customer has a support ticket open, it is probably not the best moment to try to make a sale. However, when that ticket is resolved quickly and competently, it is a great opportunity for sales to ride the coat tail of the goodwill that was just created."}, {"34a0": "A connected system also empowers service reps to act as another sales or marketing channel. Say a customer asks your service rep about a new product. Which outcome would you prefer: The service rep provides product information on the spot, or the customer is redirected to a sales rep who may or may not be immediately available? Without a doubt, customers prefer the first scenario."}, {"042c": "How a CRM can bridge the gap between #sales and #customerservce for your #smallbiz. (CLICK TO TWEET)"}, {"79b1": "Connect Before, During, and After the Sale"}, {"05b0": "One of the most appealing features of CRM is that it can automate routine tasks such as logging service requests or capturing data from sales meetings, emails, and even phone calls. This information gives your company a complete 360-degree of customers that sales and service teams can use to provide the ideal customer experience before, during, and after the sale. Here’s how:"}, {"7995": "Before the Sale"}, {"b9d4": "Customers switching from a competitor due to poor service usually tell your sales rep why they were disappointed and what kind of support they need. Your sales reps should enter these details into the CRM for each customer, so your service team is prepared in advance to avoid the mistakes competitors are making."}, {"db66": "On the flip side, your sales team should stay up to date on the most common types of issues the service team is handling for existing customers. This allows sales reps to create a smoother experience for new customers by advising them in advance of potential pitfalls or obstacles. It also lets sales reps provide informed answers, should a customer raise questions about common issues."}, {"186c": "During the Sale"}, {"a4af": "If a customer decides to buy, the last thing you want to do is give them a reason to change their minds. If sales need information from service to close the deal, any delay or uncertainty could cause the customer to choose a competitor instead. Therefore, it is crucial that your service team always respond quickly and accurately if their expertise is needed. CRM makes this easy by providing a current status of all deals in progress along with all critical information — and it allows the service team to add requested documentation directly to the record in real time."}, {"1b4c": "After the Sale"}, {"2893": "The ultimate goal with any customer is to build a long-term relationship. Happy customers are loyal customers, so sales should enter into the CRM any customer information that will facilitate smooth, proactive, and personalized service once the initial deal is done."}, {"9404": "Likewise, customer service should make sure the CRM records reflect any problems a customer is trying to solve as well as their needs and preferences. This will alert sales of potential upsell and cross-sell opportunities, and also help them make sure customers are satisfied with their purchases."}, {"3596": "Any interaction with any customer has the potential to turn into a valuable, long-term relationship. You never know where or when it is going to happen, so be sure your sales and service teams are always connected and in sync. It is the best way to deliver seamless experiences, increase loyalty and create “customers for life.”"}, {"84be": "— — -"}, {"4463": "Originally published on Smart Hustle Magazine."}], "content": "How to Use a CRM to Close the Gap Between Sales & Service By Tony Rodoni For me, the importance of having connected sales and service teams can be summed up in one frustrating experience I had as a consumer. I was a long-time loyal customer of a particular company and called for assistance with a relatively routine issue. The service rep did not have access to my sales record and had no clue that I was a high-value customer. In fact, he made me jump through every conceivable hoop to get my issue resolved. And, right in the middle of that annoying rigmarole, one of the company’s sales reps called to sell me a new product. The timing could not have been worse. Failed Connections are Costly When there’s a lack of coordination between sales and service, it is not just a problem for the customer, it can also be quite costly for the business. American Express found that 78% of consumers have changed their minds about an intended purchase because of a poor service experience. Moreover, the consequences do not end there. American Express has also found that people are 2x more likely to talk about a bad experience to their friends (vs. a good experience.) Consider that your business operates in a hyper-connected digital marketplace, and it is clear that any customer experience can have a long-lasting ripple effect. The upside is that a positive sales and service combination can help put your business on the map. In an Aberdeen Group study on the financial impact of customer service, 38% of businesses said recipients of good service promoted the company’s brand, 37% said they bring in new customers, and 35% said satisfied customers spent more on products and services. New Technology, New Expectations Many smart companies have already connected their sales and service teams through the single platform known as customer relationship management, or CRM. Because CRM is available in the cloud, it allows sales and service teams to access and work with the exact same customer information at all times and from any device. This enables both sales and service reps to expand their roles and provide the connected experience customers expect. For sales reps, it is about achieving the “marketing mindset” they need to be successful with modern customers. The focus should be on helping customers find the best solutions to their problems rather than simply making a sale. Service records provide a unique perspective on customer pain points that can arm sales reps with the additional insights they need to be of maximum value to each customer. Service insights can also help sales reps perfect their timing. For example, if a customer has a support ticket open, it is probably not the best moment to try to make a sale. However, when that ticket is resolved quickly and competently, it is a great opportunity for sales to ride the coat tail of the goodwill that was just created. A connected system also empowers service reps to act as another sales or marketing channel. Say a customer asks your service rep about a new product. Which outcome would you prefer: The service rep provides product information on the spot, or the customer is redirected to a sales rep who may or may not be immediately available? Without a doubt, customers prefer the first scenario. How a CRM can bridge the gap between #sales and #customerservce for your #smallbiz. (CLICK TO TWEET) Connect Before, During, and After the Sale One of the most appealing features of CRM is that it can automate routine tasks such as logging service requests or capturing data from sales meetings, emails, and even phone calls. This information gives your company a complete 360-degree of customers that sales and service teams can use to provide the ideal customer experience before, during, and after the sale. Here’s how: Before the Sale Customers switching from a competitor due to poor service usually tell your sales rep why they were disappointed and what kind of support they need. Your sales reps should enter these details into the CRM for each customer, so your service team is prepared in advance to avoid the mistakes competitors are making. On the flip side, your sales team should stay up to date on the most common types of issues the service team is handling for existing customers. This allows sales reps to create a smoother experience for new customers by advising them in advance of potential pitfalls or obstacles. It also lets sales reps provide informed answers, should a customer raise questions about common issues. During the Sale If a customer decides to buy, the last thing you want to do is give them a reason to change their minds. If sales need information from service to close the deal, any delay or uncertainty could cause the customer to choose a competitor instead. Therefore, it is crucial that your service team always respond quickly and accurately if their expertise is needed. CRM makes this easy by providing a current status of all deals in progress along with all critical information — and it allows the service team to add requested documentation directly to the record in real time. After the Sale The ultimate goal with any customer is to build a long-term relationship. Happy customers are loyal customers, so sales should enter into the CRM any customer information that will facilitate smooth, proactive, and personalized service once the initial deal is done. Likewise, customer service should make sure the CRM records reflect any problems a customer is trying to solve as well as their needs and preferences. This will alert sales of potential upsell and cross-sell opportunities, and also help them make sure customers are satisfied with their purchases. Any interaction with any customer has the potential to turn into a valuable, long-term relationship. You never know where or when it is going to happen, so be sure your sales and service teams are always connected and in sync. It is the best way to deliver seamless experiences, increase loyalty and create “customers for life.” — — - Originally published on Smart Hustle Magazine. ", "child": "983_1"}