{"name": "988", "parent": "", "title": "Radius Establishes Philanthropic Initiative and Raises $50MM from Founders Fund and Salesforce Ventures", "sentences": [{"ac4a": "Radius Establishes Philanthropic Initiative and Raises $50MM from Founders Fund and Salesforce Ventures"}, {"515f": "We’ve reached an amazing tipping point in our business at Radius. In the past year, Radius has scaled at an astronomical rate: we’ve grown revenue 400%, headcount by 100%, opened our second major office in Austin, and added a number of key Fortune 500 customers. Our pace of innovation is now supported by over $125MM from firms like Founders Fund, who transformed industries with investments in companies like Facebook, SpaceX, and Palantir. We’ve helped the most creative and accomplished CMOs acquire customers more intelligently and live up to the expectation of the new economy. Most of the press you’ll see over the next week will focus on our new capital raise and this momentum, which is a fantastic vote of confidence for our company vision. However, we’re equally excited about how we plan on building a great company that contributes to the communities where we work and live."}, {"1ca3": "Part of today’s announcement includes significant financial and strategic support from a company we’re aspiring to be as great as: Salesforce.com. Over the past few quarters, we’ve had the pleasure of spending time with Marc Benioff, an inspiring entrepreneur that has built not just a great company, but a fantastic community. On top of our funding, we’re announcing a new philanthropic initiative devoted to improving our community, this initiative includes the following:"}, {"0cb7": "We want to further build on this community as well: a community of fantastic customers that trusts us and an employee base that gives back to those less fortunate. Over the course of the next year, we’ll establish and achieve key goals to add our own level of positive uniqueness to our community and build on top of Salesforce’s dedication. We’re going to engage our community in new ways, through social media, customer collaboration, and staff events. This is a big deal to me as CEO and a big deal to all of our employees. It means we can work hard and be compassionate at the same time–a difficult feat, but rewarding."}, {"bdd8": "We’re excited for the years to come and excited to build a great company with the support of our community, our new partners, and our amazing staff!"}, {"4f97": "Darian"}], "content": "Radius Establishes Philanthropic Initiative and Raises $50MM from Founders Fund and Salesforce Ventures We’ve reached an amazing tipping point in our business at Radius. In the past year, Radius has scaled at an astronomical rate: we’ve grown revenue 400%, headcount by 100%, opened our second major office in Austin, and added a number of key Fortune 500 customers. Our pace of innovation is now supported by over $125MM from firms like Founders Fund, who transformed industries with investments in companies like Facebook, SpaceX, and Palantir. We’ve helped the most creative and accomplished CMOs acquire customers more intelligently and live up to the expectation of the new economy. Most of the press you’ll see over the next week will focus on our new capital raise and this momentum, which is a fantastic vote of confidence for our company vision. However, we’re equally excited about how we plan on building a great company that contributes to the communities where we work and live. Part of today’s announcement includes significant financial and strategic support from a company we’re aspiring to be as great as: Salesforce.com. Over the past few quarters, we’ve had the pleasure of spending time with Marc Benioff, an inspiring entrepreneur that has built not just a great company, but a fantastic community. On top of our funding, we’re announcing a new philanthropic initiative devoted to improving our community, this initiative includes the following: We want to further build on this community as well: a community of fantastic customers that trusts us and an employee base that gives back to those less fortunate. Over the course of the next year, we’ll establish and achieve key goals to add our own level of positive uniqueness to our community and build on top of Salesforce’s dedication. We’re going to engage our community in new ways, through social media, customer collaboration, and staff events. This is a big deal to me as CEO and a big deal to all of our employees. It means we can work hard and be compassionate at the same time–a difficult feat, but rewarding. We’re excited for the years to come and excited to build a great company with the support of our community, our new partners, and our amazing staff! Darian ", "child": "988_1\t988_2"}