{"name": "571_2", "child": "", "content": "I haven’t been writing as much, lately. When I do write, I’m afraid to share. I used to be brazen with a pen. I sometimes possess an amazing capacity to speak without inhibition — and to do it with conviction, despite my insecurities. But not lately. Lately, I filter everything through the part of my head that anticipates reactions and counter reactions and then reactions to counter reactions. I’ve been letting the comments get to me. The comments, the tweets, the emails, the mentions, the blog posts, the abuse. I say let, but it doesn’t feel much like a choice. People tell me it’s a choice. They say: look at all the nice things people are saying. Think about that. Don’t think about that. Don’t let them win. Don’t let it get to you. That’s what they want. \n \n I’ve been trying to think about what I want. I guess what I’ve always sought is the ability to be at home in myself — to not feel like I am sitting in a chair surrounded by the fortress of my body, living a life that no one is willing to connect with. I write to not feel like a ghost. Or, to tell the other ghosts that there is someone else haunting her couch, and sometimes the world, wailing a tune that harmonizes with theirs. I am vulnerable. I am not some Strong Black Woman archetype who has made peace with the bad parts of her life and is trying to save the world with them, now. I am just a person with a borrowed laptop, trying to prove to myself that I am real, that the things that have happened to me are real. \n \nI am spilling my guts here. I am unearthing buried things. I do not have a lot of this shit processed. I don’t know that I ever will. I am in a lifelong struggle with an inner voice that is cruel and degrading and destructive. It is lofty enough to shut that part of me out. It is doubly difficult to shut out the voices of strangers echoing the awfulness. An angry mob arrives in my inbox like an alarm blaring: You are not real. Your suffering is not real. All the bad things were good. You should be grateful for your trauma. Shut up. You are too broken to function. We feel sorry for the people who know you. You have fucked up your life. We do not care. We do not care.", "title": "", "parent": "571", "creatorid": "c0d0bb41517e", "sentenceid": "7bee", "commentid": "f36ce0fb28f3"}