{"name": "1004_12", "child": "", "content": "… constrói imensos blocos tendenciosos na Internet contra a qualidade — mas também significa uma profunda traição da diversidade que a World Wide Web originalmente vislumbrou. Esse trecho tá incomodando. Sim, está fazendo isso. Mas é a curiosidade pelo mais que pode quebrar esses blocos. O inconformismo com a mesmice. O stream trouxe o link pra esse texto, mas foi a curiosidade que me fez lê-lo e, depois, seguir o perfil do autor no Twitter. Pronto menos um tijolo no muro, mais diverso ficou meu universo. O algoritmo terá que se reorganizar pra mim, agora que, pela segunda vez, fui parar no Irã (antes pelo site http://gravity.ir/ do fotógrafo Mohammad Reza Domiri). A mesma curiosidade me fez entrar num texto tuitado pelo Daniel Galera @ranchocarne. Tratava do quê? China crescendo pelos lados da Austrália! Como? Comprando terras. Uai, mas já não é o 3º maior do mundo em terras e querem mais? Bom, só com o parágrafo acima, já tirei mais uns dois tijolos. Vi cerejeiras florirem no Japão, por seguir um Twitter de lá, que descobri com o jornal japonês Asahi Shimbun- em inglês(o bling tá aí pra ajudar com kanji, hiragana e katakana, hebraico, árabe, persa, cirílico). O mesmo que me mostrou, em primeira mão, o segundo terremoto em uma semana. No Equador a terra também tremeu e deixou mais de duas centenas de mortos, tragédia que eu soube pelo sítio de turismo deles, apresentado a mim numa pesquisa sobre turismo colaborativo; tudo isso enquanto eu lia sobre o impeachment no Brasil. E daí? Daí que quanto mais eu clicava num link sugerido pela “matrix”, mais aguçava minha curiosidade pra ir a outros lugares, ver outras opiniões, ler outros textos, e mais eu me afastava da indução ao que eu deveria ou não ler. Tá, podemos ficar nos queixando dos algoritmos, ou tentar fazer nossa própria guerrilha contra eles e viver numa fantástica babel sem fronteiras. Não há limite, o mundo é grande, magnífico, e o tempo é pouco pra tanto. Ah 1. Desculpa aí pelo textão. Fuga da gaiola dos 140. Ah 2. Não dá pra seguir meio mundo, mas dá pra driblar a bolha. É tipo a Arca de Noé: um par de cada espécie. :) ", "title": "", "parent": "1004", "creatorid": "e89945321f25", "id": "4f18545ff98b"}