{"name": "1004_4", "child": "", "content": "Texto importante do Hossein. Eu não levava muito a sério sobre o poder de classificação das redes sociais, até ler este parágrafo. Depois que li, me lembrei de um episódio que passei no Facebook, recentemente. Eu sou um desenhista. Concentro minhas obras em uma conta no Tumblr. Geralmente, eu postava lá no blog e compartilhava para o Facebook, com o recurso de “Share” no tumblr. No Facebook, não recebia muito destaque. Mas, uma vez, eu postei uma imagem diretamente na rede do Mark Zuckerberg. O desenho ganhou quase 20 likes. E o desenho era um rascunho. Quando eu li este texto, fiquei revoltado. Ao mesmo tempo, me trouxe para a realidade. O mundo capitalista é controlado por grandes corporações, e por que seria diferente na Internet. Como perceberam que redes sociais podem ser lucrativas, farão de tudo para que direcionem o fluxo para o que realmente dá vantagens para suas redes. Mas, tenho fé de que o Facebook e seus donos são humanos, e que seus poderosos algoritmos de classificação foram feitos por humanos também. Basta reaprendermos como podemos burlar suas regras de exclusão para conseguimos ter sucesso na nossa vida virtual.Uma coisa que estou pensando, sobre a questão da minha postagem, seria criar algum programa que lesse as minhas postagens no tumblr e postasse para mim no Facebook e em outras redes sociais. Estas redes, felizmente, possuem APIs, pontos de acesso para que sistemas desenvolvidos por terceiros possam acessar suas funcionalidades (você pode criar um programinha para contar os seus likes, por exemplo.). Isto é algo que tenho que pensar, mas uma coisa é certa: A Internet sempre vai mudar, e temos que aprender a ver estas mudanças à tempo, ou vamos ficar para trás. Obrigado pelo texto. ", "title": "", "parent": "1004", "creatorid": "3336eb7359f3", "id": "8ab785361ef9"}