{"name": "1044_6", "child": "", "content": "Thank you for this. Your first paragraph really resonated with me (I’m also a female minority/mixed-ethnicity though it was all about angelfire + dead/greatest/livejournal + neopets for me). But where you took CS courses, I… didn’t. I never strayed away from photoshop and tech and I was that kid classmates would ask to help them design digital posters for student government, projects, custom journal layouts & wallpapers etc, but despite growing up a stone’s throw from Silicon Valley, ‘computers’ just never clicked as a future career opportunity for me and I never sought it out. I got a degree in Poli/Econ from Berkeley and ended up working admin at various non-profits. I felt listless. The question “Where do you see yourself in 5 years” was nearly unanswerable for me because I had no idea. It wasn’t until a coworker at a mental health clinic I worked at asked why I was always volunteering for what they considered the shitty jobs: data entry and teaching ‘prefers-hand-written-documentation’ psychotherapists to use our new electronic records system (which always turned into teaching them how to use a computer/internet), that I realized my answer was simply ‘because I like working with computers’. It dawned on me that I had gone from being the classmate people turned to for photoshop to the coworker everyone used as the unofficial IT tech; the person they went to for troubleshooting and who would ultimately decide whether or not it required escalation to our actual IT guy (offsite, on-call). Last spring I got a new job at a big non-profit with a 5k reimbursement benefit for extracurricular courses for professional development and over summer I said “why not?” & finally took an intro to CS course that taught command-line and Python. Last Fall I officially enrolled in a second bachelors program in the Java language track and I LOVE it. I can’t stop thinking about homework, I’ll submit assignments and then keep working on them, I have a list of side projects I can pull out during lulls at work. It feels right and part of me feels so ashamed that it took me so long, that now I’m not only a female minority, but one who‘ll be looking for her first programming job at 30 years old with zero industry experience. It’s terrifying, but now when I think “where do you see yourself in 5-10 years” I feel excitement and hope. Again, thank you. ", "title": "", "parent": "1044", "creatorid": "755fdf14f009", "id": "721f91c5e77b"}