{"name": "1071_21", "child": "", "content": "I’ll post the same thing here that I did on the Reddit thread where this dude plugged his book in the comments: This article lays out many good but very basic SEO techniques. There is no doubt that beginner on-site SEO, keyword research, and basic link building are going to benefit your site — by all means, do them. You can find all the info you’d ever need for free online (Moz, Reddit, BHW, wherever). But if you’re a small business owner and think that you can “do your SEO in one day,” you’ll be left in the dust by those who hired a legitimate search consultant / agency. Actual SEOs also optimize for CTR, site performance, and site architecture. The real trifecta of ranking factors are links (authority), content (context), and your website (performance and on-site factors). Links have an entire industry built around them (digital PR). Content has several billion-dollar industries built around it (digital publishing, content marketing, modern journalism lol). And “the website” has all of web development behind it. Many technical tasks fall onto the shoulders of a good SEO — things like: SSLSite speedServer speed/ setupResponsivenessAMPStructured Data + microdatahreflangrobots.txtSitemap architecting30x redirectsURL structure+Many many others But you’ll never see any of these mentioned in any ‘SEO is ABC, 123’ guides because they require actual comp sci knowledge. Also, some suggestions like “keyword density” and “positioning your keyword in your title tag” are so stupidly dated and bunk, it makes me upset that people are still peddling them as fact. We aren’t in a 2005 internet anymore — Google is smarter than that ;). So PLEASE, do yourself a favor — as a small business owner, yes, learn SEO basics via simple guides, and certainly apply them. But don’t brush off the importance of an entire industry or you will lose a quintessential competitive edge. There’s a reason all big firms hire in-house SEO and SEM teams :). ", "title": "", "parent": "1071", "creatorid": "55c381408ca2", "id": "24e9c39691a3"}