{"name": "1103_2", "child": "", "content": "Revelation 9:11 reads: “And they had as king over them the angel of the bottomless pit, whose name in Hebrew is Abaddon, but in Greek he has the name Apollyon.” The AntiChrist as it has been preached by some churches is a conflation of a number of different figures from a wide array of prophetic passages in the Bible, including the one referenced in Revelation 9:11, the man whose number is 666, the Beast, the Dragon, etc. Here, context is crucial. If you look at all of the references to antichrist (which are all contained in the two Epistles of John) it is clear that John is talking about a spirit of antichrist that is, as he says, “already in the world.” Let’s look at the context of this passage in 1 John 4:1–8: Beloved, believe not every spirit, but prove the spirits, whether they are from God; because many false prophets have gone forth into the world. 2 In this know you the Spirit of God: every spirit that confesses that Jesus Christ is come in the flesh is of God, 3 and every spirit that confesses not Jesus is not of God; and this is the spirit of antichrist, of which you have heard that it comes, and now is in the world already. 4 You are of God, little children, and have overcome them, because greater is he that is in you than he that is in the world. 5 They are of the world: therefore they speak of the world, and the world hears them. 6 We are of God: he that knows God hears us, he that is not of God hears not us. By this we know the spirit of truth and the spirit of error. 7 Beloved, let us love one another, because love is of God, and every one that loves has been begotten of God, and knows God. 8 He that loves not has not known God, for God is love. In 2 John 1:5–9, the Apostle writes: And now I beseech thee, lady, not as writing to thee a new commandment, but that which we had from the beginning, that we love one another. 6 And this is love, that we walk according to his commandments: the commandment is this: as you heard from the beginning, that you walk in it. 7 For many deceivers have gone out into the world, who confess not that Jesus Christ is come in the flesh: this is the deceiver and the antichrist. First, John is not speaking of some future usurper of Christ’s authority, he is speaking of a spirit manifested by human beings that is the antithesis of Christ’s teachings. Notice that in both of these passages, John speaks specifically of the teaching to love one another. So then, if Christ teaches us to love, what will these deceivers and antichrists teach? You say that “anti” in this case means “instead” and you are right, for if we listen to the spirit of antichrist and practice hatred and division instead of love hasn’t that spirit and teaching of division taken Christ’s place in our hearts and in our world? ", "title": "", "parent": "1103", "creatorid": "2f563a20ac26", "id": "66ef74dc8770"}