{"name": "1104_25", "child": "", "content": "Well Michelle you are so right. The Anti Christ lives in the White House. But always remember there will many imposters of the Antichrist to protect the real one. I do not know why you are worried. You believe in the Rapture. You under your logic will not even be here anymore. Only the sinners will be left behain. Fine Leave me behaind. I would rather die then go anyplace with you people who at the least are BONKERS. Trump is NOT made to run America. You weren’t either. I’d like to talf to those foster children of yours. I bet there is no love lost there. Oh and how did your fraud case go? You had some sort of “money” omission. You are a fruit cake Michelle. The imposter is in Office. He is the WORST PRESIDENT IN HISTORY. He will be impeached and have all of our most sensitive information ever. Things that none know except the Trump. He is no President. He is a Barker at the side show. I see his crowds are getting smaller. You people who trust this man to do what he said are fools. THere will be NO damn Wall. Do you want to pay for it. Mexico will never pay. Besides who is going to pick our crops. We need them more than they need us. Ask Georgia. They lost all their crops because no one would pick his crop. We need Migrate workers. Even Rockefeller Center says we need them more then ever now. Ameirca is a FREE COUNTRY. One by One GOP/BREXIT is taking over. Paul Ryan is still in love with a teenage fantasy. Ayn Rand drew he Social Security too. She wrote a FICTIONAL BOOK> BASED IN THE 1960’s. God would you people just F>O> Paul Ryan is wealthy. He is all about PUNISHMENT of the POOR. Paul Ryan and his so call conservatives are a freaking joke. ALL the GOP does is TAKE,TAKE,TAKE. They never say hey we want to make your lives better. Instead, it is a Political CRY to never give the people anything. You are the only entitled. Wake up RED AMERICA> They are using disinformation now as they did during the Election. IT IS NO ONE’S BUSINESS what I DO with my BODY. Screw all you brainwashed women. You are the worst enemy of freedom for women. You can have all the babies you want. Go and procreate. I will do what I see fit for my lifestyle. Screw every right winged fool that thinks they can force women to do their bidding. Be careful all of you. THe whole issue will bite your ass. I hope you need lots of stiches. All of you and your FRACKING religiion. I know all about your practices. I am a free woman. YOU are under the thumb of your Husband or by stupid women who believe they know it all. You people are so wacked out and twisted with religion. Follow the top 10 commandment's . All of you believing God said this. Boy are you gullibile. That is how we eneded up with a poser. TRUMP. He is a interloper. No new coal jobs. The pipeline went in because TRUMP IS a INVESTOR. He will not be using American steel either. You few that? That is us all getting screwed by the Senate and the House. They do not rule democraticall. They want to be dictators. Mostly they are all just dicks. We are all being SCREWED BY A MAN WHO KNOWS NOTHING. he is the biggest TOOL being used. He probably thinks everything is his idea. WRONG. ", "title": "", "parent": "1104", "creatorid": "47802e91c644", "id": "30353cbed51c"}