{"name": "1108_6", "child": "", "content": "Prayer in school is always a thorny issue, especially in Texas. The OAG’s faux outrage is totally disingenuous considering this just happened: US appeals court makes ruling on Texas school's meetings starting with prayerMarch 20 (Reuters) - A federal appeals court on Monday said a Texas school board may open its meetings with student-led…www.aol.com At my public high school in Texas, before every single soccer game we joined hands in a circle and said the Lord’s Prayer. There was a lot of controversy around prayer in school when I was in school and even if it wasn’t led by teachers, coaches, or administrators, but was “student-led” and therefore apparently constitutionally acceptable, the sheer majority of Christians in the student body put undue social pressure on students to join. I hated being in that circle. I’m not a Christian and the fact that I had to choose between social ostracism or joining in the praise of someone else’s god, made me feel like an outsider right at the moment when I should have been bonding with my team. This case is substantially different because Islam is not the majority religion in that school and doesn’t have the same social weight Christianity would have to pressure students to join, which changes the dynamic considerably. Could there be a case of the less religious Muslim student who would feel pressured to pray with his/her fellow Muslim students, even if he/she didn’t wish to? I don’t know, but this possibility would concern me. It’s clearly got to be all prayer or no prayer and as a non-religious person who felt the negative impacts of group prayer in a government institution, I think there should be no Bible study and no group prayer whatsoever, whether it’s in a classroom, around a flagpole, or on a soccer field. On the other hand, if schools were able to offer quiet rooms where students could pray, meditate, or read, privately and individually, I would be wholly supportive of that. ", "title": "", "parent": "1108", "creatorid": "7bd3f8862293", "id": "9088d31e9fa4"}