{"name": "1112_13", "child": "", "content": "These are the sentiments of David Duke, but to make your headline say that Trump is suggesting that Jews are behind these threats is incendiary and flat out untrue. He said that some of the people who have made these threats may be people who don’t like him, to make him and his supporters look bad. Nowhere in what he said did he ever mention Jews, unless you just assume that all those who don’t like him and want him to fail are Jewish. Clearly there’s a lot more people who don’t like Trump that are not of Jewish descent than are. You’re baiting people. Cut that bullshit out. There’s enough you can write about that’s bad about Trump without ever having to lie. When you do shit like this, you start to plant in some Trump supporters’ heads that Jewish people are behind the anti Trump movement. Those people may then become vulnerable to rhetoric like David Duke’s and other white supremacists. Those people may then commit acts of violence against Jewish people or symbols, creating the violence you say you want to call out. Seriously, why are you publicizing David Duke’s tweets and exposing his views to more people? Most of us don’t have Twitter and don’t follow KKK members online. There are more articles online about how Trump and his supporters are KKK members than there are actual KKK members. I’m sure they and the alt right feel great from everyone thinking they are such a large and influential group, but they aren’t. They have thousands, not millions, that support their views and follow their ideology. Quit inflating their importance, their egos are large enough already. All you are doing is helping to make that recruitment number higher. For people that are Jewish or friends and family of them, you also fueling fear and making them feel more threatened. When people feel threatened they will lash out. I don’t know if you doing this to shore up their support for your party or preying on their fear for click bait to help your own Medium stats. Either way, stop it. ", "title": "", "parent": "1112", "creatorid": "77b53a0587d8", "id": "7c0ea41a470a"}