{"name": "1115_6", "child": "", "content": "I am trying to determine what Representative King said that was racist? The Gist of his comments, according to Israel, focused around what a remarkable nation we have developed, and that like the EU, The primary peoples that founded the USA, and made this nation what she is, are primarily from Western and Northern Europe and that, on the whole, we are not replacing ourselves with births. Was that the racist statement Israel wants King to grovel for? As the son of immigrants, and one who carries dual citizenship with both the US and the EU, exactly what race to Europeans and US citizens belong too? My home in Ludwigslust in German has as many races as their factually are. so does my home in San Antonio, Texas. I suspect Mr. Israel is using the word for race in a divisive way. he is not speaking of those who founded America as being multicultural, multi-religious, and multi-tongued. He is using it like so many Jews of late use the term in a political sense. Jews have decided they are not white. I can agree that the Ethiopian Jews are not white, however my branch, the Ashkenazim would take great offence if you called them black , my grandmutti would say ‘schwarz’ and spit. As would the Sephardi Jews(also white). Mr. Israel is speaking not in factual terms, but on political movement terms. I can trace my family back slightly over a 1,000 years. Every last one of them German, Latvian, Polish and Norwegian. hair colors in my family are red, blonde or dyed. Eyes, all blue, green or hazel. Genetically (according to 2 3 & Me) I am 99.5% northern European and Jewish to boot. My mother and sisters are all DAR members, and we don’t yap about pop culture, movements of the moment or use any language we might speak, incorrectly. Remember the next time you see his name on an article, the content will be based almost entirely on feelings and emotions as opposed to objective truth. example, ‘261 “documented” incidents of hate direct towards Jews. To date, one man has been charged with making 8 separate threats , claiming synagogues and community centers were to be blown up. This man, a black journalist, was trying to regain a departed girl friend. In NYC, less then 15 tombstones were found to be laying on their face or back. After investigation by the JDL, the NYC police and the antisemitism law group, it was discovered the old, top heavy memorials had toppled due to lack of care over the years, between rain, wind, freezing and warming, they fell. No human action was required, other then neglect. If you are a progressive Jew, you see hate, hurt and harm being everywhere, always directed at the Jews. One of the worlds oldest victim class. Those before him, sat in a kitchen and kvetched about it over tea and strudel. Today, they all get on their blogs, or write an article. Mr Israel is part of the chattering Jewish class of professional victims. This is part of the victimization of the Semitic tribes, be they Jewish or Muslim. This is not how Americans act today, not how we will act in future, and representative King is right, to keep this glorious republic our founders defined and gave to us, we must be willing to fight to keep it. Cicero told us to beware of the enemy within. Josh Israel is just that sort of enemy. ", "title": "", "parent": "1115", "creatorid": "359534c34dbf", "id": "e0495e65844c"}