{"name": "1127_3", "child": "", "content": "Donald J. Trump reminds me of a classic “Twilight Zone” episode titled, “It’s a Good Life.” In this episode, we see an adorable 6-year-old boy named Anthony Freemont. Anthony lives in a farmhouse with his parents in a small village named Peaksville in what used to be rural Ohio. In the beginning, everything seems peaceful on the quiet farm until we realize Anthony has special powers that are causing quite a bit of disturbance within the community. Anthony has the ability to cause a blizzard on a summer day, ruining the crops. He has the ability to turn a gopher into a beast with three heads, turn pigs into monsters and wish playmates who challenge him into the corn field. He took away the cars, electricity, machines and soap, because he doesn’t like them, flinging the Village back into the Dark Ages. He can command anything he wants by simply thinking it. He knows everyone’s thoughts and can feel everyone’s emotions. He hates anybody who doesn’t like him or thinks bad thoughts about him. Anthony has destroyed the rest of the world as he holds the few remaining residents of Peaksville imprisoned with his demands. His parents and neighbors are so terrorized they cater to his every whim and must CONSTANTLY reassure him his monstrous deeds are “Good, they’re REAL Good.” They must express their unconditional love for him, because they don’t want to be his next victim. One evening a surprise birthday party is held for one of the few remaining neighbors, Dan. Dan receives a bottle of peach schnapps (one of the last bottles of liquor in the Village) and a Perry Como album. He desperately wants to listen to the record but Anthony doesn’t like music with singing. Dan starts to get drunk from the schnapps and is fed up with the control Anthony has over them. He begs someone, ANYONE to kill the child, put a lamp or a bottle over his head when he’s not looking, ANYTHING to end this nightmare once and for all. The adults in the room are begging him to stop talking but it’s too late. With a scowl on his face, Anthony turns to Dan and transforms him into a hideous Jack-in-the Box, his head bobbing up and down on a spring as his wife watches, SCREAMING in horror. Anthony’s father tells him to wish it into the corn field, so the grotesque image disappears and the room returns to normal, everyone desperately trying to control their emotions so as not to upset little Anthony as he continues his reign of terror. Anthony’s father looks out the window and sees snow falling. He looks at Anthony and says, “It’s snowing outside. Antony, are you makin’ it snow? Why that’ll ruin half the crops, ya’ know that, don’tcha, half of the crops!!!” Anthony looks back with a scowl and his father replies, “But, it’s good that you’re makin’ it snow, Anthony, it’s REAL good and tomorrow, tomorrow, is gonna’ be a REAL GOOD DAY!” A monster is about to move into the White House. A childish, ignorant, illiterate, petty, vindictive, out-of-control, mentally unstable, emotionally damaged, destructive, psychopathic monster with no filter, no conscience, no discipline and no restraint. The weak and the ignorant put him there. ", "title": "", "parent": "1127", "creatorid": "b636d89779c6", "id": "5df2ef01c6a8"}