{"name": "1130_6", "child": "", "content": "Your experiences are similar to that of many women, no doubt, and I’m really glad you’ve survived thus far. Thank you for sharing. Please keep on keepin on, don’t stop. We all need you to keep winning and we’re in your corner! The point about what female socialization is supposed to be is controversial, though I don’t think that’s the point you’re making here at all. The point is that you’ve always been a woman. The point is that you share experiences that an uncountable number of women have had. Those points are not up for debate or disagreement. Pure fact. But I think when we talk about socialization we’re talking about grooming people (of any role or gender) to perform certain roles for society (the benefit of cis white men most usually). I don’t say this to argue or deny your experiences, or identity, or to revoke membership into any group, but rather to engage with the complexity of the topic with you. You’re exactly right that many women experience this. But we call this abuse when women experience it, not socialization (in fact, abuse is for the socialization of men, to teach them that their violence is legitimate). And if we abstract “woman” down to “subversive object”, there are many groups that fall into that category as targets: children, blacks, LGBTQ …its a long list when the only non-subversive category is cis AND white AND male at the same time. These groups are all systematically abused as part of the socialization of white males. Blacks are legitimate targets for abuse. Women are legitimate targets. Children are. And on and on. I hope I’m making sense. Your thoughts? For me, the idea that you may not have been groomed for the role of woman does NOT diminish the fact that you’ve always been a woman. I see a lot of trans women (and men) say this and I understand where they’re coming from. But you know who you have always been. There’s a lot of powerful individuals out there who reject socialization, and who determine who they are and will be for themselves. The goal of socialization has been to avoid creating people like you and I, really. “Everyone stay inside your box and no one gets hurt.” I believe you’re a woman because you’re a woman. Not because you were abused, but because you are gloriously subversive. You would still be a woman if you never experienced any of it. ", "title": "", "parent": "1130", "creatorid": "c9757305b31e", "id": "aedb4ae8842a"}