{"name": "1147_21", "child": "", "content": "I am experiencing a set of conversations similar in tone to what you are reporting on Medium ( the F word has yet to be hauled out, but some pretty eyebrow-raising gratuitous insults are in play) and am trying to figure it out. Yeah, I know that there are trolls roaming about, but I actually think that somebody perfectly nice could turn into a troll online through inexpert arguing. I’ve got years of schoolteaching under my belt and I know that crabby kids often can be turned around. Surely that’s the case with adults? Usually? So I want to find a solution in my own online conversation. At first draft, it seems like there are indeed “triggers” out there that mean something far more to the reader than to me as writer. In my case, there have been two. I seem to have crossed paths with a few people who are very angry at feminists. Now, I would call myself a feminist because I would like to see women be able to go on a date or walk down the street or work late at the office without fear of rape, and I would like to see women be able to bear children and maybe stay at home for a time to raise them without then finding themselves in poverty. There are a few other things I bring to my idea of being a feminist, but those are up there at the top. As I should have known, though, the word “feminist” is a flash point. It means something very, very bad to some people, and because I used that word, or phrases associated with that word, now I have provided a fresh target on which to vent all the rage that my interlocutors have against … women? feminists in particular? Not really sure what’s going on there.I also crossed paths with a person who wrote a very interesting article about white privilege and obliviousness. I asked to be considered as an ally, regardless of my whiteness. This led to a pretty angry set of responses that I ended up thinking it was better to merely withdraw from. Same as with feminism, there is a set of trigger words or phrases that are so embedded in the subject itself, that productive conversation seems to be rare. It would be a pleasure to be able to talk about difficult issues as they are expressed, without explosive side-rants piggy-backing into the conversation. I am currently reading “The Righteous Mind, Why Good People are Divided by Politics and Religion” by Jonathan Haidt as a way of exploring this question. He distinguishes several ways of seeing the world. Autonomy, Harm, and Fairness. Most college-educated people in the West look at the effect on individuals: whether there is harm being done and whether it is fair.Community. The personal is subsumed into the larger community goal. Japan’s predominant ethic springs to mind.Divinity. People have a divine soul and they shouldn’t pollute it by hedonism, association with sinful stuff, and so on. When people approach problems using a different way from their interlocutor, then it can not only be confusing but enraging. So, as part of my solution-finding, I’m going to try to meet people where they’re standing instead of just staying in the “is there harm being done to an individual” stance that I usually have. A related problem is the one you talk about, that some people jump to conclusions about who you are from a few isolated features of your biography. For example, I am a white feminist, case closed, we now know everything there is to say about me. You are an Appalachian beer drinker, we’re done here. Really? It would be nice to find a way to talk to each other than allows us to expand into our full selves. ", "title": "", "parent": "1147", "creatorid": "73911894180e", "id": "9922a8fefe43"}