{"name": "1147_17", "child": "", "content": "Hi Michael, (Michael Ramsburg ) It seems to me that in the relativity of the fairly close-knit community built up within the circle of ‘literary’ writers, poets and publishers, we experience an ‘intimacy’ of a familiar circle wherein personal attention is paid and individuals are listened to by one another, and we project this onto administrators who oversee the broader infrastructure, which we assume, from that perspective, are equally receptive and ‘invested’ in that close-knittedness. We thereby go by an assumption they are equally protective of the quality of the community environment. I think you just crashed through the illusion. Medium is not the landscape of which we have shaped but a corner. Currently, we’re effectively a community of ‘little princes’ awakening to the barrenness of an isolated satellite orbiting the larger disinterested corporate orb driven more with the functional propensity of LinkedIn to provide investor value, than be the artistic home we created in isolation of the rest of it. Your experience speaks directly to the now enlarging fissure between form and function. We came here valuing each other and have held that standard to those who created the architecture upon which such a landscape might be construed in the misbelief there was somehow an organic reciprocity. What we have created was not in their vision of outcomes and as such taking to task injurious behaviour as you have done, by the nature of the beast could only have the standardised enforcement of blanket ‘policy’, rather than the custodial engagement that we expect of an invested, personalised public space. If I might use the analogy of a library: this writing community created a library and in taking on a rude user, you expected the admonishment of a concerned librarian; instead, the divested corporate voice of the monolith who owns the entire block effectively came back at you with the disengaged rule book that could only bring with it, the distasteful distortion that reveals the reality of where we all now find ourselves; a very foreign, very large and disengaged space. And who we are? user statistics. ", "title": "", "parent": "1147", "creatorid": "3db3f248685a", "id": "b12f69fe286f"}