{"name": "1150_4", "child": "", "content": "I appreciate the posts you have written, Kari…we need to let people know that folks like us (I have Bipolar I) are yes — productive, contributing members of society, and not just our diagnosis. Which is why it bothers me if someone says “I am bipolar”. No you aren’t! You are a fantastic mother or father, son or daughter, friend or caring co-worker…don’t allow this illness to define you, because you are so much more. I’ve yet to meet a person who has told me “I am cancer”. I also happen to be rapid cycling, very rapid in fact; 12 cycles per year, one each month. Which means that many people meet me in a normal mood (I haven’t had mania since the early days, hypomania, which I refer to as “as close to human potential as possible”, happens at times however), when they see me the next time, sometimes just a few days or weeks later, they see me acting quite differently towards them, and they simply cannot understand it. They think “Wow this guy is a Fing jerk! How on Earth could there be something going on that would make him be one of the most friendly and compassionate people I’ve met, and now suddenly act as if he wants nothing to do with me?” When you see someone in a wheelchair, you “get it”. This person has a clear issue that needs to be addressed. When it’s in your head, quite honestly I think many people (at least, at first) believe I’m faking it, just because I don’t feel like expending the energy to be bothered by them or similar. Even significant others, who I spent so much time with…it took them time to come to the correct conclusion that no — I’m not doing this because I don’t want to see your family (or whatever). I’m not “doing” anything, actually. I’d love nothing more than to be the person who you love spending time with every minute of the day. But I can’t be. My meds have certainly helped, therapy too. I’ve learned coping mechanisms over the years that help smooth out some of the roughest edges. But there will always be a part of me that has this condition…I’m going to have to address this for the rest of my life. One reason why people tend to deny their diagnosis I think… Not only is there a heavy stigma attached, it’s also a life sentence. It’s hard to come face to face with that reality, it takes time. Which means my health insurance is ALWAYS going to be CRITICAL to my overall health and ability to function well in society. I understand that healthcare is an absolute vital necessity for lots of folks, with all different types of needs. But for someone with BP I’ve managed to move my life forward in a good number of ways, and I don’t want to lose all the progress I’ve made over really the last 2 decades in total. When I hear that the GOP wants to take away healthcare from millions to provide a tax cut for the uber rich, my blood almost literally starts to boil. How could this even be in the realm of possibility I ask myself. There has to be a way to stop such a galactic injustice I think. But in reality, if the President decides to defund the ACA, and Congress does whatever it can to make it implode, there is precious little that the average Joe can do about it. Except throw every Republican out on their a**es when election time comes. But even then it’s no sure thing. My question to the President would be How many yachts can you ski behind at the same time? The upper 1% have an unsatiatable desire for more money; they literally can never have enough. How much should the rest of us suffer for them to have more, Mr. President? ", "title": "", "parent": "1150", "creatorid": "ad100d23971b", "id": "b7027eacee47"}