{"name": "1163_1", "child": "", "content": "What I Did With My Me Time It was actually six weeks, but same same Almost two years ago, my husband and I decided to make the jump back to our native east coast after having lived in San Francisco for eight years. I accepted a job offer and, having lived through a cross country move for a job once before when I was younger and stupider, I built in a significant buffer between my acceptance and start date. And so began my six weeks of me time. Now, some of this “me” time wasn’t really for me. I packed our house (well, 90% of it) by myself. I found our new apartment. I vetted and hired movers and arranged the route of our cross country drive and booked all the hotels we’d need. My husband was working and I’m the planner of our family unit, though, so I don’t really count this as a job. And besides, a massive clean out of our house was probably something I’d have wanted to do with my “me” time, anyway. So, beyond move, what else did I do? Worked out like crazy Husband and I already went to an evening boot camp in Golden Gate Park every Tuesday and Thursday. I increased my membership and went five days a week. Became obsessed with an augmented reality game called Ingress Before Pokémon Go, Niantic made a game called Ingress. I’d already been obsessed with the game, but had a lot of life that got in the way of playing it. Without life to bother me anymore, I walked (often with my minature dachshund) for hours and became the reigning Ingress queen of my neighborhood. Wrote a (pretty bad) book My six weeks started just before NaNoWriMo and I promised one of my best friends I’d participate with her. Every morning, I woke up with my husband, drove him to work, parked the car, and went to a coffee shop nearby. I spent at least three hours every day in that coffee shop, clacking away at my vampire novel (it’s been in my head for over a decade and my father was totally right that day on the beach in 2005 when I told him about it and he said I should write it — I have no idea how he knew vampires would become a thing because it was still weird I was obsessed with them back then and, damnit dad, I bet you don’t even remember that but you were right). Hiked My best friend also had time off during my bout of “me” time, so we hiked to the top of a mountain at least four times with our dogs. Since he was also obsessed with Ingress, we submitted the top of the mountain as a portal, got it accepted, and then made sure we always owned it. (If you don’t know what any of that last sentence means, consider yourself lucky). Cooked complicated stuff I love to cook, and I make our meals more often than we eat out or order in. With more time, however, I was able to experiment more, linger in groceries longer, and think about sous vide, slow cooking, and how amazing my Le Creuset dutch over really was and how I really should use it more. Here’s the most important part of my me time: I never did nothing. If I were to do it all over again, I wouldn’t change a single thing. I woke up at my “regular” work time every day. I kept a routine, albeit a modified one, filled solely with tasks I determined. Yes, I did more fun things, but I stayed active, I kept my life in order, I bettered myself and my relationships. If someone gave me another six weeks to do whatever I wanted, I would spend it being as active as possible, because exercise and being outdoors makes me feel wonderful, I would write a read like a demon, I would play games that I love, cook fancy food, and I would bee line to my friends and family and spend every single moment I could with them until I, perhaps, drove them crazy. And now you also know the things I live for. In my opinion, that’s what our free time should always be about. ", "title": "", "parent": "1163", "creatorid": "e25c8fde5cbc", "id": "b5bfef4539d"}