{"name": "1165_9", "child": "", "content": "I really appreciate finding such a great essay about Time; the issues with processing time, marking it’s passing, and trying to estimate how long things take. This is a Big Topic in our household and so far discussions of the time-related obliviousness has never come up at any of several Traumatic Brain Injury group meetings or even as a topic during the less common telephone discussions among caregivers to those who have sustained a brain injury. Time out. I am in no way implying a recognition of brain damage Sherry. Quite the contrary. Everyone has their own quirks. I’ve found that if my mom (an artist who mostly works with paint and texture) is really in her creative zone and isn’t disturbed she will continue to work late into the night, sometimes inspired enough that she forgets the basic care and feeding ritual that’s been going on with her husband (my dad) of over 50 years. He’ll pop in and throw out a fairly good-natured prompt. “Dinner?” she’ll repeat back without recognition of why he’s mentioning it. “Um… no thanks.” she quickly responds and returns to her work. This is not part of how their marriage works. Despite having owned a fairly significant number of restaurants over the years, at home my Dad still seems incapable of throwing together sustenance for himself alone, let alone considering making food for he and his wife. My point is that lots of people have trouble noticing the passing of time. There are lots of emerging “experts” in the field of brain injury who can generally agree that if a person had a hard time with something… let’s say math. If before the brain injury Sam struggled to calculate the proper amount to tip his waiter, following the injury that task may seem impossible. Let’s go back in time… ahem. Your article that provides examples of how this timelessness feature affects your life made me feel so much better about what’s possible in our home. You’ve provided the first (and subsequently learned — the best) insight I’ve been able to find that explains what it’s like for yourself and my adult daughter who also has no appreciation of time passing. This is something I can work with to make my daughter’s life better. And possibly lower my blood pressure as well. I’m glad you have a good-natured husband who understands. I have to admit I used to frequently get frustrated by my daughters tardiness or cancelled appointments before finally coming to understand how her brain had changed. Alex literally has lost the ability to estimate how much time has passed between one task and another. In her case this was a sudden development following two auto accidents and a senseless act of random violence that resulted in concussions and what was later diagnosed as a “Mild Traumatic Brain Injury”. The “Mild” part is most often used to designate a serious brain injury that did not immediately result in coma or a prolonged loss of consciousness. Alex also is incapable of estimating how much time things take, like gathering the towels and clothes she will need prior to taking a shower, the amount of time she’s been in the shower (often nearly an hour), the time needed for dressing, makeup, eating and whatever else is needed before she actually gets into the car. She is easily distracted and I thought for quite awhile the issue might be due to a lack of organization, focus and possibly motivation. Other times it appeared she was experiencing small, silent seizures while trying to focus. So many tests, questions, observations, sleeping while hooked up to electrodes that might capture and identify “problem areas” within the brain that lead to abnormal processing. Finally getting a reasonable understanding of what’s happening in her mind allowed us to find some helpful tools. * Alex’s condition may be more or less an issue than yours. So I write the following tips for perhaps another reader who might benefit. The large variations in suggested amount of time each step should take is due to the fact that Alex has a number of types of debilitating head pains. Besides the garden variety migraines, she also can be floored by the “ice pick attack” head pains and plain old sinus/allergy headaches. When these hit there are a number of actions that can be taken, though cancelling and rescheduling a doctor’s appointment is rarely one of those options as this happens so frequently. Even the most compassionate doctor’s office can’t run efficiently or profitably when a patient misses more scheduled appointments than she’s able to keep. When we hit a particularly rough patch of not being able to show up on time for appointments the only reasonable accommodation we’ve found is to schedule Alex as the last patient of the day whenever possible so if she’s unable to make it everyone can leave on time for a change. When the doctor’s office is unable to do that they’ll double-book the appointment time allocated for Alex and the doctor will scramble between exam rooms. That’s still not a popular option with her doctors, so more often what happens is an almost immediate warm coffee drink along with the doctor’s recommended medication for the specific type pain, a quick relaxation meditation and softly talking it out. We’re fortunate that the dialogue can change yet still be pretty effective as long as the patient loving words are spoken softly and encouragingly. A mild sedative (for me to fight the urge to scream and fly into a targetless rage) is often needed as well. Regarding time management we’ve found it helps to have clear and simple tasks listed in chronological order with generous allocations of time for each step. So for getting ready to go to the doctor it’s like this: Gather towels for shower — may take between 10 and 45 minutes, so try to do the night before.Find out if it will be raining, or hot or cold. Gather clothes you’ve decided to wear to the doctors — 20 minutesGather shoes and purse. — 10 minutesMake sure you have shampoo, conditioner, soap, leg shavers, etc you’ll need to shower — 10 to 30 minutesTake out any hair bands and brush out your hair — 6 minutes.Start the shower running and turn the temperature knob to where we made the red mark using fingernail polish. 3 minutes before getting in.Take off all dirty clothes and place them in the hamper after emptying pockets. 5 minutes. and on and on. To go to a doctors appointment it usually takes anywhere from 2 to 4 hours before we can get out the door. So now instead of me shouting “How much longer til you’re ready?” I ask “What step are you on?” and can figure out how late we’ll likely be based on that. (Someday we may actually be on-time but I’m not holding my breath.) Another hack that helps is to write appointments on the calendar that take into consideration travel time since that part is usually over looked. So her 2pm appointment is listed as starting at 12:30pm if travel time is expected to be about 30 minutes. Over the years (nearly 15 now) she’s improved greatly in nearly all executive functions except this and the frequent migraine-like head pains. And of course the number one reported problem among those who have sustained multiple concussive injuries or the full-blown TBI (traumatic brain injury). The number one most obvious to spot complaint — is for my daughter Alex a double-edged sword. That is, the all too common — short term memory problems that can be both horribly disabling and a wonderful feature. Wonderful because with the lack of time perception and short term memory retention skills she is able to wake each morning cheerful and loving. It’s simply not possible for her to report accurately how many debilitating headaches she experienced over the last few days/weeks/months. She truly does exist in present time. Again, thank you. Your article gave me a nice thought provoking stretch. Hopefully another reader will get some use out of this as well. I must admit; When I finally understood the mechanics, neurology and the mind’s attempts to adapt and make accommodation for these little neuronal synaptic mis-firings I felt like such an awful mother! As a “systems person” there are things my training and experience should have sorted and aligned into an obviously recognizable pattern that could have provided insight and a lot less anxiety. ", "title": "", "parent": "1165", "creatorid": "5fb9ce60cdd8", "id": "1924241cfa25"}