{"name": "1176_7", "child": "", "content": "Hiring Tree Farm Workers This is a totally different tack. There aren’t many container based tree nurseries in my part of Canada. There is no pool of experience workers. So I am hiring inexperienced workers. Most tree farm tasks are dull as dishwater. Transplanting is a 4 stage process taking 10–25 seconds per stage. Weeding? Well everyone knows what weeding is. Moving pots, pulling out winter kill, checking that drip lines drip. Most jobs take 5 minutes to learn, fifteen minutes to practice, one hour to master, half a day to develop some speed. So what do I look for in an employee: Interest. Are they curious about what’s happening. Do they ask questions. There are two reasons I favour this kind of person: Asking questions will sometimes spark me to come up with a new way of doing things. It makes me question my own routine. Plus a person who understands the ‘why’ behind the action generally will better spot when conditions change. I do a lot of explaining of ‘why’ during each task’s introductory period. A worker that doesn’t ask questions doesn’t last.Attitude. Are they positive? Do they arrive bright eyed and bushy tailed. Are they quick with a joke, a laugh, a smile. These people are just more pleasant to work with.On time. I don’t like employees who are constantly late. It means I have to make multiple explanations if we’re working on a common project, or I have to break what I’m doing to if we are dispersed. Stuff happens. But if you text me, “Running late. Be there about 8:15” I will deal with it.Self starter. If they finish a task, will they look around for something that needs doing.Story teller. I dearly love a worker who can tell stories about their life, who can talk with some knowledge about a variety of subjects. One of my questions is, “What books besides school books have you read this year? A blank answer or an answer limited to a micro-genre is a disqualification. Another question, “What do you know enough about to teach an old fart; What can you talk about for an hour?” Now much of this doesn’t show up in a resume, and most of it won’t show up in an interview. So my practice now is to invite them out to work with me for a couple hours. I pay them for that time. At the end of that time I either say, “Can you start tomorrow” or I explain why I think they are a bad fit. ", "title": "", "parent": "1176", "creatorid": "95e9f0015abe", "id": "14c27ad3ff8b"}