{"name": "1178_11", "child": "", "content": "Hi Peter, I love your article about entrepreneurs being magicians. It is so interesting that this article is showing up on my desk because I basically wrote the same sentiment down for an exam question in a course I was doing two years ago on entrepreneurship. The question was “What is an entrepreneur?” for 10 marks….. I am putting my answer down here because I think you will like it. It was way over the examiners head and I only got 6 out of 10. I felt misunderstood! Do not take me for granted. I am a precious commodity and I need to be valued I am the lifeblood of the community I have an indomitable spirit And from my strength others draw value for themselves. Sometimes necessity has birthed me. Sometimes opportunities have thrown me into this state. But my real value comes from when I, armed with vision and passion, place myself on the chessboard. With strategy and clear thinking I weigh up all the pros and cons and make my move. I am not hotheaded and do not rush headlong into wild adventures. I take myself seriously and I know I have great value to offer the world at large. I am like a conjuror that can pull a rabbit from a hat; a living, breathing entity from a mere idea. My imagination and inexhaustible energy are the ingredients of the potion I use to cast my spells. I create something out of nothing. I pull life from the ether and fashion it into concrete forms and I allow money to flow through my creations like the blood through your body. I am at your service, and I provide that which you need, and it gives me great satisfaction and pleasure to be of use to those around me. But I am also just me, and although I express a lot of who I am through what I do for you, I do not lose sight of the fact that all I build can evaporate in the twinkling of an eye and that my ventures are rooted in the fickle demand of those I serve. Therefore, I am careful to protect my own interests from the vicissitudes of life, and do not allow my ventures to hijack my heart. I can let go and not look back for always ahead I see there are new horizons and new challenges. And a magician such as I can always conjure up new tricks when the old ones have lost their charm. [An entrepreneur is a person of imagination and energy that seeks to make the world a better place by providing solutions to the problems that beset the communities in which he operates. He generally has a joy for living and zest for life that brings a positive vibration to the areas in which he operates and more often than not raises the happiness level in the people he interacts with.] You have outlined some really salient points in your article, especially about storytelling and allowing the clients to believe in themselves through believing in a dream you create for them. It is all at once mystical, practical and transformational and sometimes even the magician has no idea that he is doing such magical things. Here’s to being the magicians of the world, Beryl ", "title": "", "parent": "1178", "creatorid": "88685780ced3", "id": "ffc5b4bc65f9"}