{"name": "1188_2", "child": "", "content": "I have worked at a lot of software startups, and all of them Internet startups since late 1990s. You have a pretty good list here. I don’t agree with all your points, but then I am a white male and likely priveloblivious. Mos’ def: Who you interview with: if it’s not your team, and at a startup not your whole team, then what are they hiding? Or just as important, who do they think they are? I have been at companies who think that an interview is like getting accepted into a club — if we choose you, then you’ll be lucky to be the first to accept our shitty salary. Interview is for fit, and good ones help both parties decide if this is a place and job that works for them.Bro CEO. Agreed, and cuts across all genders. Bro could be replaced with “recent MBA”. But yeah, the really cocky ones have … are men.No women in leadership. Absolutely: all things in all ways are reflections of the recognized leaders in the company — their culture and ideas and notions and behaviors become inherently ingrained in the way things are done, no matter how “open” they are. However, I believe with the right attitude it is possible to build a balanced company even if the founding team does not include women, partly because I have seen it happen twice (and yes, not happen way more times than that). Not sure: Culture. I haven’t counted recently but let’s say in my 30 years of working for money I have worked at 15 companies, and since some of them were in consulting positions I have probably worked with 30 or 40. Of those, two had really excellent cultures, and not just for me (and happily, I report that one of those is the company I am at now). We sell the hell out of our culture, and that includes that we are geeks and nerds, including the typical “soft” positions, and that yes we have ping-pong and beers on Friday. And while most people are in their earlier careers, there are more than a few people like me (old farts) and all different sizes, shapes, colors, genders, orientations, and so on. We were, like many software companies, heavily male in the engineering side, so we now pursue the best and brightest women by 1) going to the best and brightest women and asking them to join us, and 2) really supporting and honoring (celebrating!) differences independent of gender or whatever. We’re not diverse-diverse yet, but we’re really trying, and you really have to try because the default is sameness == fit. So culture as a selling point is not always a bad thing. ", "title": "", "parent": "1188", "creatorid": "1fba4038dcff", "id": "ae2121ad4cf4"}