{"name": "1213_12", "child": "", "content": "I am so pleased by your strength, and your confidence to remain who you are! I am now a 66 year old American female, with a B.A. and two master’s degrees. I have been married,(at 23, still too young), separated (walked away at 40), divorced (FINALLY, at 44, and lost everything, even in a “joint property” state)… spent nearly five years independent (different from “alone”, and NOT lonely). …I repartnered (at 46) and was widowed (at 59) after three years of his cancer and 2 months of hospice (all financially devastating)… repartnered again (at 60)…with a much younger man, with much deeper thought, and more insight. We are still blissfully happy; I retired from family counseling and teaching, and now operate a historic B&B part time. Now, He keeps his “day job” so we can afford for me to be the Innkeeper. I will tell you that formal marriage is highly overrated even now, and my informal partnerships were far more rewarding, moral and “solid” than that sham of a 22-year marriage I had… Like you, I am intelligent and well-educated, and worked hard to get where I am. I too am busty, and a bit overweight by standards of beauty at the moment, but I will tell you that this third man, Partnership #2, is the most wonderful of all. He is not a college graduate, is from an immigrant family much less established than mine was, yet is very intelligent, hard working, very secure in himself, and so, loves me well for who I am. If I had not stumbled upon him though, I was ready to remain unmarried and unpartnered. I can be just fine that way, and here, I know many, many women AND men, who feel the same way. Marriage, even long term partnerships, are not for everyone. Nor do they “make us whole” …nor does a marriage certificate ensure our safety or that the guy will remain faithful or physically with us, or our children… A relationship is only as good and honorable as the two who make a pledge. It is my view that, if it must be put in writing, the trust is shaky already. Not to be entirely naiive here though, I have had to agree with MYSELF that what I give here is “without strings”, and that I will walk away, with my cat, cash, clothes and computer, essentially, under the following conditions: domestic violence (no one ever lays a hand on me in violence again)… no cheating or intimate, private relations with other women (or men, in my case)..no lies, even of omission (and stealingor embezzlement from the partnership is a form of lying)… no hard drugs. I promise the same. If I find proof of this, there will be no need for recourse, no excuses, no apologies, no counseling, and no trying again…also no lawsuit or retribution. I just go away, no more contact permitted (we have no children together). It’s pretty peaceful, actually, and much cheaper and less complicated than divorce…been there, done that, lost everything except spousal support from his Navy retirement. I have not seen or tried to reach him in any way in 23 years. My now-partner and I renew this agreement on our anniversary each year. No one can claim entrapment. If one becomes dissatisfied with any part of this clear and simple agreement (since humans are dynamic, not static creatures), they can renegotiate. If that fails, we shake hands and go away friends… going on 8 years now, and have had no serious disagreements or cheating on any part of the agreement. So I guess the long and short is, do NOT let Anyone goad you into marriage--or even long term partnership, if your very gut does not see it to be right. Do not compromise on the basics of what are “deal-breakers” for you. Obviously, if a potential match does not agree, it would have you both miserable in the end anyway, so do not start. Just stay amicable. Best of luck in your life and career, as WHO you know you ARE! Congratulations! Gillian ", "title": "", "parent": "1213", "creatorid": "833975d45c29", "id": "1252dc481da0"}