{"name": "1220_1", "child": "", "content": "There’s so much here I can relate to right now I might just go puke. It’s also pretty nice to not feel so alone at the moment so I thank you for that gift. The only thing here I wonder about is if you actually were who you are in those moments you think you weren’t. I only say that because recently, I had my own insides questioned by someone who was dealing with their own thing. Something I said felt wrong to this person, but inside me it felt right. I still think it’s right from my perspective. I won’t be apologizing for feeling what I felt. I can apologize if those feelings I expressed came out to the wrong individual at a bad time for them because the intent of those words were to help, not to hurt. And since they didn’t, I CAN be sorry for that fact. But that doesn’t mean I wasn’t speaking MY truth. I was. I should have chosen a better time or a different person to speak it to is all. I realized this as I was questioning myself after learning my words had been dismissed as some kind of lie. They were given that treatment because they were painful for the receiver. There are certainly times I have lied in my life, but given the seriousness of the topic we were discussing at that time — well, there’s just no fucking way I’d have chosen the dishonest path. What I learned this week is that sometimes people have tried to put THEIR baggage on MY back. Doing that does not make ME inauthentic— instead the inauthenticity is being thrust upon me from inside of THEM. And I don’t owe anyone an apology for their own mess. My hope for you is that you have not allowed the insides of others to smear you, that you stay well protected from anyone who cannot own their own stuff and that you continue to grow on your path to healing. I LOVE this piece so much. -Cyborg 🌺 ", "title": "", "parent": "1220", "creatorid": "72168947bef4", "id": "ebd92301994e"}