{"name": "1346_23", "child": "", "content": "Medium “Now let me holler at ya partner, spit this gameIn you ear for a minute, quit complaining‘Bout how you can’t spend it cause you ain’t got itYou got what it takes but not enough to get started”-Too Short Too $hort (Ft. Funkadelic & Parliament) - Gettin' ItLyrics and meaning of \"Gettin' It\" by Too $hort on Genius. That's right, album number ten, Short Dawg's in the house …genius.com  5 years ago, I thought that I might have something to say about how companies should be built and run, so I decided to start writing. Living in the age of the web, I was super excited that I didn’t have to write a book or get a job at the New York Times to get my point of view out there. I couldn’t wait to get started. But in 2010 the blogosphere felt a lot less modern than I had imagined. The tools were clunkier, harder-to-use versions of the ancient, bloated desktop software that preceded them. While it was possible to get beyond the poor tools, once you did there was no easy way to find your audience. If I had not had a super sophisticated marketing team and big brand behind me, my blog would have been a tree falling in the forest. Mercifully, I didn’t need to make money from my writing, because there was definitely no way to do that. It seemed like there had to be a better way. So when Ev Williams, co-founder of Blogger and Twitter, began developing a new platform, I followed it closely. Could Ev somehow combine his expertise in blogging and social networking to create a platform that really worked for new authors? To answer this question, I ran two experiments. First, I simply grabbed a blog post that I’d written a couple of years earlier called When Smart People Are Bad Employees and reposted it on Medium with no other promotion. No tweets, no email blasts, no Facebook posts, no nothing. If I’d done that on a conventional platform, I would probably get no more than a hundred views. Let’s see if Ev’s platform could really find an audience. The post generated 20,000 views. But that was for a well-known writer. How would Medium do with a brand new author? And what if that person had zero technical skills? My wife Felicia had never published anything in any form in her life, but wanted to post a piece that she’d written entitled Somewhere In-Between. I suggested that she try writing and distributing it on Medium. She had no trouble quickly writing down her thoughts and adding relevant photos in Medium and the post received 29,000 views. One thing is for sure, we know who the best author in the family is. After spending time with the platform, I believe that there are 3 things that make Medium special. 1. Medium is modern software with basic features you expect but other tools don’t support — drag and drop, WYSIWYG, autosave, responsive design etc. This probably sounds trivial to non-bloggers, but if you blog it sounds miraculous. 2. Blogging on Medium feels like a new media format native to the web and that could only come post social. The best Medium posts are a combination of collaging and blogging. You include tweets, gifs, pull quotes, graphics, and videos along with your text. The social era fragmented the networks by media type. Medium gives you a way to pull it back together. 3. Starting out blogging today is very intimidating because you have no audience. You can write something great and literally no one will read it. Basically there are incumbent bloggers with an audience and then everyone else. Medium gives those newbies a change to reach an audience since it it is a blogging tool + fairly meritocratic distribution. Perhaps more importantly than any of this, Ev and the team have a vision to make Medium a medium where independent authors can not only work with great tools and find their audience, but also earn a living thus finally fulfilling the true promise of blogging. That’s why I am excited to announce Andreessen Horowitz has invested in Medium. ", "title": "", "parent": "1346", "creatorid": "926899f38323", "id": "70435c14e3d7"}