{"name": "1346_16", "child": "", "content": "Where I’d love to see Medium headed I’m super excited to see where Medium is headed with its objective to be the publishing platform for everyone. And so I thought I’d take this opportunity to also share a few of my thoughts on what I like best about Medium and where I’d like to see it headed. Medium started its journey about the same time as when I started my journey in the US as a freshman at USC. I’ve been a fan of its clean design and reading experience, and over the past few years — have fallen in love with the content that I find on it. What I like… While Facebook provides me with a cluttered and false/filtered view into other peoples lives, Medium provides me with a more genuine and deeper dive into the minds of the people I follow.“Marketers ruin everything” — we’ve all heard that before and I love that there isn’t any direct advertising on the platform. Most of the content marketing we see is actually quite interesting and sometimes good learning material too.Previously, I would almost always head straight to the ‘Top Stories’ but after I started following some more interesting and active Medium users (like Ev himself), I’ve found my ‘Home’ feed to be more interesting as it shows what others have recommended. Where I’d like to see Medium headed… I’ve been on the platform for a few years now but I’m yet to publish my first post. I’m constantly sharing my thoughts/photos on Facebook, but that’s only because that’s where my audience is. I read Ev describe his vision for Medium as a publishing platform for everyone, but majority of those people are people who’ll be posting on Medium for the first time. Many of the most interesting posts I’ve read on Medium were by people who were using the platform for the first time to announce something pretty big that happened in their lives. I wish there was a feature to discover “first posts” by Medium users. Or a way to not only find good content, but also find good content creators or recommenders. I understand that I’m talking only from a writer’s perspective but if it can somehow be linked into the ‘Home’ feed, the possibility of being discovered will likely be an incentive for people to start sharing their thoughts on Medium.I wish there was a nice way to ‘invite friends’ to try Medium. I love Medium and I actively recommend my friends to get on it, but that doesn’t really end up happening (but please don’t make it something annoying like LinkedIn’s “invite your friends”).I have an almost love/hate relationship with the ‘Top Stories’ section because that’s usually where I find some of my favorite material but I also refresh it twice a day to check if there’s anything new — and most of the time, the content pretty much stays the same for about 3–4 days. I’m not sure how the ranking works but I’m assuming it’s based on the number of new ‘recommends per day.’ It would be awesome to see if the ranking algorithm could be improved by including metrics like how many people finished reading it (registered users + non-registered), how many non-registered users clicked “recommend” but then didn’t log in/sign up and other metrics that might give an indication to the quality.Let’s not get carried away trying to add more features, but I’d love to be able to browse through my ‘Bookmarks’ page and see my highlights pull-up beside the article preview and also a way for me to write private notes beside the bookmark (inspired by my favorite feature on the kindle). Something like this… Medium, to me, seems like the only platform out there right now which is focused on quality of content and provides promise of reach. While I may cross-post whatever I end up writing on Medium to Facebook notes also, I’d rather not have to do that. p.s. stoked to meet Ev Williams at the Kairos Global Summit next month! If you enjoyed this article, make sure to hit the recommend button :) Update: Just created a publication named First Posts, I’m thinking it could be used to publish whatever’s on your mind without worrying much about who’s going to read or recommend it :) First PostsSkip the anxiety, hit the publish buttonmedium.com ", "title": "", "parent": "1346", "creatorid": "7286e7580e8f", "id": "cee074d79d2a"}