{"name": "1346_21", "child": "", "content": "Why I Love Using Medium As A Political Blogger Conservative or Liberal, Right or Left, Medium provides the opprotunity for everyone to contribute to political discourse. All without the complex UI’s found on other platforms. By Sam Whitfield A truly unique yet intuitive experience in so many ways. When I first heard of Medium via Stephen Perkins on Facebook, I was at first perplexed as to how the site even worked. The lack of a traditional formatting bar was honestly a bit un-nerving at first. “How the hell could these guys forget to include the most basic tool in a blogging platform”? I didn’t like it at first and was scared away. Then I found some of the instruction articles on the website and watched a few how to videos on YouTube and decided to give it another shot. Once I got a firm grasp on using the composition tool, I found that I actually throughly enjoy using Medium as a platform. The fonts are large, legible, and easy to read which makes writing and proofreading a pleasurable experiece. The recent addition of the instruction bar at the bottom of the editor page is extremely helpful with tips and tricks on how to use Medium’s formatting and media embed tools. Another feature that I absolutely love is the import story widget. As a blogger, I sincerely appreciate the fact that Medium’s management understands the value of blogging on multiple websites or platforms. By having the import story button, they’re not discouraging Wordpress or Blogger users from using those platforms, but are rather inviting them to share their already great content with the Medium Community. A platform for inteligent writing and civil discussion In today's world of growing social media and blogging, the average user is able to comment on just about any given subject or topic. With the birth of this marvelous ability, also came it’s evil sibling from Hell known as “trolling”. We all know a troll when we spot one. They're the ones who ruin the Internet for the rest of us by either of offending everyone in sight or on the flipside, acting overly offended and immature about a viewpoint they disagree with. Both sides of the political isle have them and they can be a real drag for the rest of us. When I first published on Medium, I was worried that “the trolls” would show up almost immediately to try and get my account banned or something like that. Instead, I've repeatedly encountered several individuals who are all very respectful. Some of them disagree with my Conservative viewpoints, just as I disagree with the more Liberal ones but overall, everyone is very respectful and courteous. Things to Improve A very limited mobile blogging experience. Overall, I find Medium to be one of the best blogging experiences ever. However, when it comes to writing on the go, Medium is unfortunately very restricted. I'm constantly on my iPhone or my iPad checking Facebook, Twitter, and several other news and social media outlets at any given time. I'll get a great idea for a Medium post when I'm on the go but dislike using the mobile app to post content. The iOS app lacks the full Medium experience in terms of editing the different types of headers, inserting full length “featured image” photos, and embedding content flawlessly. The ability to manage publications is nonexistent and finding them in the mobile app isn't that much easier. I'm sure that I’m not the first person to bring these issues up, but I can guarantee that they'll need to be addressed to ensure the future success of Medium as we move towards a more “Mobile Age” in personal computing. Keep up the good work guys! Minus it's few flaws, Medium has been a lifesaver for me as a blogger. Thank you for all you guys do. ", "title": "", "parent": "1346", "creatorid": "835c0b629d1f", "id": "21ea2e3f8e08"}