{"name": "1346_20", "child": "", "content": "I’m usually wrong about this sort of stuff, but I’ll say it anyway. ‘It’s just a frigging blogging platform! $57 million… seriously? I mean is this dot com 2.0?’ Okay, I said it. Here’s how horrible I am at assessing value. I remember when Google came out, I thought, ‘why another search engine?’ I even remember thinking, ‘what a stupid name!’ And you know the rest of that story. I’m an idiot with this stuff. Seriously though, I don’t know how much you are capitalized, but even at this stage of the game you are highly leveraged (I really don’t know what I’m talking about). Meaning, the VCs who poured the money into this venture either drank your cool-aid (no disrespect intended), or more likely, hopefully for them and Medium, really are onto something big. Either way they’re looking for a minimum 5X — 10X return within 5 years (I read that somewhere) so without any more financing you guys need to be acquired (because let’s face it, this will never make money) for a zillion bucks. And the folks who will buy you work at Microsoft, Google, Yahoo or Some Big Dot Com to make their product better. That’s the game. It’s all kinda nuts, really. I mean, in this age of health concerns, poverty, social issues, environmental distress, you’d think VCs would buy into something like a new imaging technology or diagnostic platform. Or maybe a Bullet Train that could employ thousands of people. Or a new chocolate technology that can be made from a 3D printer (okay, maybe not). But, I get it, this is capitalism and creativity joined at the hip, straddling that fence between staying true to ones mission and capitulating entirely to the money gods. This is a beautiful platform, I have only used it a few times; you guys did a really great job designing it. I only hope (for your soul’s sake) that when you make your kajillions of dollars on the backs of people who write great content and drive lots of traffic to your site (increasing your valuation, or something like that) that you’ll throw them a bone. I mean, it would only be fair. At the very least… enjoy life, don’t let the money and success go to your head, and be nice to people, animals and the earth. Best wishes to the folks at Medium. CdE ", "title": "", "parent": "1346", "creatorid": "4e8e27cd5475", "id": "ccd081bb4b47"}