{"name": "1346_18", "child": "", "content": " The Medium and The Message Just over a decade ago, I remember having so much to say and nowhere to say it. The year was 2004, I had just moved to Los Angeles by myself without knowing another soul in the city. I was bored. One night, I decided to write. But where? I was fairly well-versed in HTML at the time. And yet, I decided that a tool like Blogger, having just been acquired by Google a year earlier, would probably be the best way to be heard. And so it began… …and continues. In the most perfect bookend imaginable, I’m thrilled to announce that Google Ventures is today making a substantial new investment in Medium, the content and conversation platform founded by the same person who co-founded the aforementioned Blogger and led it through its sale to Google, sparking my own writing experience on the web, Ev Williams. The new round of financing, being led by our friends at Andreessen Horowitz alongside Greylock Partners, Obvious Ventures, The Chernin Group, and Ev himself, continues Medium down the path set out by the company a couple years ago when they first raised money, and we invested. Since then, with each passing day, it feels like an ever-increasing number of links I click on throughout the internet take me to stories written and shared on Medium. There are big stories and stories that deserve to be big stories. The latter is particularly compelling since Medium is becoming such a good home to content on the web that would otherwise not be shared. If Blogger was step one in this journey, and Twitter was step two, Medium is the logical continuation. The team has managed to create a home on the web so inviting that not only do people want to post their thoughts on Medium, people find their voice here. Of course, great-looking writing tools and a nice presentation do not good writing make. But that’s where the community comes in, to highlight, recommend, or respond to what they read. While I’m continually finding interesting things shared from Medium, it’s the content that the Medium community surfaces on the platform that has started to really shine. Content like this. I could not be more excited for GV to be extending its commitment to this platform and to be getting more involved myself. Medium is the best… well, medium, I’ve come across at getting thoughts from brain to web. And now with more resources to do so, I know Medium will continue that cause. Today, some eleven years after I began writing on the web, I often wonder how different it would be to start now. We have Twitter. We have Facebook. We have the iPhone! One thing I know for sure: my journey would obviously begin on Medium. In fact, that’s where it continues.  ", "title": "", "parent": "1346", "creatorid": "5c6977d2a94f", "id": "8ac0b29219d"}