{"name": "1351_15", "child": "", "content": "While I agree that it would be great if for social reasons the investors supported the movement, THEY’RE INVESTORS. They’re job is to help guide your business to a level where they see a return on investment. Alienating certain clients doesn’t do that. On my personal account I supported the Women’s March. I would never post something about it on one of the official accounts I manage.We must must must stop casually suggesting something is misogynist because a woman doesn’t agree with it. In this particular case, they tried to give advice relative to her business which they became a part of through investment. It wasn’t like it was illogical advice. They simply had philosophical differences and unfortunately, it hadn’t previously been discussed before engaging in a business relationship with one another.There’s now the possibility that other investors will shy away from her and her business period. They provided sound advice and while again, disagreeing for philosophical reasons is reasonable, I wonder if other investors would feel like they could help guide the business in a direction that helps it grow so that they can make a return on investment. Also, what happens the next time that she has a disagreement with an investor. Because while we don’t know the guy’s names, people in the community know who she’s talking about and now you’re talking about reputations which are a large part of what an investor lives on.To complete the article, what’s the percentage of men who receive VC funding? And then what’s the relative percentage (if both were 50/50)?The general sentiment of the article is great. I think that the writer did a good job of making valid points that help the feminist movement (and not the radical feminist movement) that I’m a part of and support as a male. I just think that some of the views from the subjects seemed to make light of certain issues such as misogyny ", "title": "", "parent": "1351", "creatorid": "954ffed5cc88", "id": "8183d50b98a1"}