{"name": "1352_4", "child": "", "content": "Some of the questions you ask are fair, we need transparency and scientific data and we should be wary of greenwashing. But parts of your article are dishonest and that kills the fair questions. You are making some generalisations. I know that you are not stating that all the producers of animal-less meat use GMOs, but that’s what people will understand. And that is not true, some of them do not.“it would seem that non-GMO, organic, plant-based meat alternatives that carry less inherent risks are a wiser direction.” Why? Based on what?One of your premisses is that GMOs are inherently less safe than, well, I am not exactly sure what. I do also have a bias against GMOs because of the crops that have been developed so far and the behaviour of the companies producing them. But we have to move away from that.“Do we really want to produce our food with patented, gene-edited fungi or algae, fed with chemical-intensive, environmentally destructive feedstocks such as GMO corn or sugarcane, and made in labs?”Again, dishonest generalisation. You are only selecting the worst examples and mixing them together as if they were the only possible option that arise from these production techniques when it’s not the case. E.g. those fungi, bacteria, algae, cells, etc could well be fed with open source, organic sugars obtained from regenerative permaculture farms.“fed with chemical-intensive” That doesn’t mean anything. Everything is chemical. Water, air, apples, cows, poop. Everything.“Do we really want to produce our food with patented, gene-edited fungi or algae, fed with chemical-intensive, environmentally destructive feedstocks such as GMO corn or sugarcane, and made in labs? Or do we want to move towards a food system based on transparency and truly regenerative, organic agriculture that is sustainable and healthy for farmers, farmworkers, our planet, and consumers?” is a false dilemma fallacy. Having some companies developing some animal-free meat or milk does not prevent in any way the development of a regenerative agriculture nor any other of the many ethical alternatives in between. ", "title": "", "parent": "1352", "creatorid": "f4492104d2ad", "id": "14124a11a40e"}