{"name": "1352_14", "child": "", "content": "Nobel Prize Laureates have signed a letter: To the Leaders of Greenpeace, the United Nations and Governments around the world The United Nations Food & Agriculture Program has noted that global production of food, feed and fiber will need approximately to double by 2050 to meet the demands of a growing global population. Organizations opposed to modern plant breeding, with Greenpeace at their lead, have repeatedly denied these facts and opposed biotechnological innovations in agriculture. They have misrepresented their risks, benefits, and impacts, and supported the criminal destruction of approved field trials and research projects. We urge Greenpeace and its supporters to re-examine the experience of farmers and consumers worldwide with crops and foods improved through biotechnology, recognize the findings of authoritative scientific bodies and regulatory agencies, and abandon their campaign against \"GMOs\" in general and Golden Rice in particular. Scientific and regulatory agencies around the world have repeatedly and consistently found crops and foods improved through biotechnology to be as safe as, if not safer than those derived from any other method of production. There has never been a single confirmed case of a negative health outcome for humans or animals from their consumption. Their environmental impacts have been shown repeatedly to be less damaging to the environment, and a boon to global biodiversity. Greenpeace has spearheaded opposition to Golden Rice, which has the potential to reduce or eliminate much of the death and disease caused by a vitamin A deficiency (VAD), which has the greatest impact on the poorest people in Africa and Southeast Asia. The World Health Organization estimates that 250 million people, suffer from VAD, including 40 percent of the children under five in the developing world. Based on UNICEF statistics, a total of one to two million preventable deaths occur annually as a result of VAD, because it compromises the immune system, putting babies and children at great risk. VAD itself is the leading cause of childhood blindness globally affecting 250,000 - 500,000 children each year. Half die within 12 months of losing their eyesight. WE CALL UPON GREENPEACE to cease and desist in its campaign against Golden Rice specifically, and crops and foods improved through biotechnology in general; WE CALL UPON GOVERNMENTS OF THE WORLD to reject Greenpeace's campaign against Golden Rice specifically, and crops and foods improved through biotechnology in general; and to do everything in their power to oppose Greenpeace's actions and accelerate the access of farmers to all the tools of modern biology, especially seeds improved through biotechnology. Opposition based on emotion and dogma contradicted by data must be stopped. How many poor people in the world must die before we consider this a \"crime against humanity\"? Sincerely, Peter Agre 2003 ChemistryZhores I. Alferov 2000 PhysicsSidney Altman 1989 ChemistryHiroshi Amano 2014 PhysicsWerner Arber 1978 MedicineRichard Axel 2004 MedicineDavid Baltimore 1975 MedicinePaul Berg 1980 ChemistryBruce A. Beutler 2011 MedicineElizabeth H. Blackburn 2009 MedicineGunter Blobel 1999 MedicinePaul D. Boyer 1997 ChemistrySydney Brenner 2002 MedicineMario R. Capecchi 2007 MedicineThomas R. Cech 1989 ChemistryMartin Chalfie 2008 ChemistrySteven Chu 1997 PhysicsAaron Ciechanover 2004 ChemistryClaude Cohen-Tannoudji 1997 PhysicsLeon N. Cooper 1972 PhysicsElias James Corey 1990 ChemistryRobert F. Curl Jr. 1996 ChemistryJohann Deisenhofer 1988 ChemistryPeter C. Doherty 1996 MedicineRichard R. Ernst 1991 ChemistrySir Martin J. Evans 2007 MedicineEugene F. Fama 2013 EconomicsEdmond H. Fischer 1992 MedicineJerome I. Friedman 1990 PhysicsAndre Geim 2010 PhysicsIvar Giaever 1973 PhysicsWalter Gilbert 1980 ChemistryAlfred G. Gilman * 1994 MedicineSheldon Glashow 1979 PhysicsRoy J. Glauber 2005 PhysicsJoseph L. Goldstein 1985 MedicineDavid J. Gross 2004 PhysicsRobert H. Grubbs 2005 ChemistryRoger Guillemin 1977 MedicineSir John B. Gurdon 2012 MedicineJohn L. Hall 2005 PhysicsLars Peter Hansen 2013 EconomicsSerge Haroche 2012 PhysicsLeland H. Hartwell 2001 MedicineHarald zur Hausen 2008 MedicineJames J. Heckman 2000 EconomicsDudley R. Herschbach 1986 ChemistryAvram Hershko 2004 ChemistryGerardus 't Hooft 1999 PhysicsH. Robert Horvitz 2002 MedicineRobert Huber 1988 ChemistryTim Hunt 2001 MedicineLouis J. Ignarro 1998 MedicineElfriede Jelinek 2004 LiteratureDaniel Kahneman 2002 EconomicsEric R. Kandel 2000 MedicineWolfgang Ketterle 2001 PhysicsKlaus von Klitzing 1985 PhysicsAaron Klug 1982 ChemistryBrian K. Kobilka 2012 ChemistryRoger D. Kornberg 2006 ChemistryHerbert Kroemer 2000 PhysicsFinn E. Kydland 2004 EconomicsLeon M. Lederman 1988 PhysicsYuan T. Lee 1986 ChemistryRobert J. Lefkowitz 2012 ChemistryAnthony J. Leggett 2003 PhysicsJean-Marie Lehn 1987 ChemistryMichael Levitt 2013 ChemistryTomas Lindahl 2015 ChemistryRudolph A. Marcus 1992 ChemistryBarry J. Marshall 2005 MedicineEric S. Maskin 2007 EconomicsJohn C. Mather 2006 PhysicsCraig C. Mello 2006 MedicineRobert C. Merton 1997 EconomicsHartmut Michel 1988 ChemistryJames A. Mirrlees 1996 EconomicsPaul L. Modrich 2015 ChemistryWilliam E. Moerner 2014 ChemistryMario J. Molina 1995 ChemistryEdvard Moser 2014 MedicineMay-Britt Moser 2014 MedicineKary B. Mullis 1993 ChemistryFerid Murad 1998 MedicineErwin Neher 1991 MedicineRyoji Noyori 2001 ChemistrySir Paul Nurse 2001 MedicineChristiane Nusslein-Volhard 1995 MedicineArno Penzias 1978 PhysicsEdward C. Prescott 2004 EconomicsStanley B. Prusiner 1997 MedicineJose Ramos-Horta 1996 PeaceSir Richard J. Roberts 1993 MedicineBert Sakmann 1991 MedicineBengt I. Samuelsson 1982 MedicineJean-Pierre Sauvage 2016 ChemistryRandy W. Schekman 2013 MedicineThomas C. Schelling * 2005 EconomicsBrian P. Schmidt 2011 PhysicsRichard R. Schrock 2005 ChemistryPhillip A. Sharp 1993 MedicineDan Shechtman 2011 ChemistryVernon L. Smith 2002 EconomicsHamilton O. Smith 1978 MedicineOliver Smithies * 2007 MedicineGeorge F. Smoot 2006 PhysicsThomas A. Steitz 2009 ChemistryJ. Fraser Stoddart 2016 ChemistryJack W. Szostak 2009 MedicineJoseph H. Taylor Jr. 1993 PhysicsDaniel C. Tsui 1998 PhysicsHarold E. Varmus 1989 MedicineSir John E. Walker 1997 ChemistryJ. Robin Warren 2005 MedicineArieh Warshel 2013 ChemistryJames Watson 1962 MedicineEric F. Wieschaus 1995 MedicineTorsten N. Wiesel 1981 MedicineFrank Wilczek 2004 PhysicsRobert Woodrow Wilson 1978 PhysicsAda E. Yonath 2009 ChemistryRolf M. Zinkernagel 1996 Medicine ", "title": "", "parent": "1352", "creatorid": "48b205375ac4", "id": "18130b6248df"}