{"name": "1359_1", "child": "", "content": " Distract and Confuse These are the tools of manipulative forces with unpleasant agendas. This isn’t a right wing problem. It’s a societal problem. Fake news is the perversion of facts, in the same way our current neoliberal capitalism is a perversion of a potentially productive framework. If this is all too much to take in, I find it depressing when I get mired in the meta arguments, you can think of it another way…perhaps even persevere out of the mire by focusing on the climate, not the weather. I’ve borrowed the climate phrase from an emerging new kind of news source, de Correspondent. It’s an approach that is much more difficult to pervert, because it focuses on trends instead of news blips. To answer your question, No – it’s not you. I try to focus on the climate across the spectrum, avoiding the barbs of either extreme of the political spectrum. Those who would believe these barbs will not stop believing them when confronted with alternative barbs (facts!). Instead, they will double down on their own fears and insecurities. The right and the left. I often point to a FGM study that was done in Africa. This study provides a potential key to undoing the social dichotomy being created by the nefarious forces of the left and the right. That key? It’s all about beliefs. If we can show those at the extremes (that’s currently a lot of people) two beliefs which they hold dear, but are in conflict, they will have to choose one. The important parts of this are (1) the beliefs are theirs and (2) they are doing the choosing…not you or us. In the FGM study, the fathers were presented with the belief the FGM was culturally necessary and their belief that their daughters should lead healthy productive lives in order to build strong families. The majority of fathers chose to support their own daughters, shunning a strong cultural belief. Those practicing harmful behaviours are helped to choose a positive solution that is not based on coercion or fear, but there own desire and beliefs. Beliefs are the climate. Fake news is the weather. Peace. ", "title": "", "parent": "1359", "creatorid": "ae3eb2eea5d4", "id": "9c8319b2a356"}