{"name": "1363_2", "child": "", "content": "Probably not, but without citizens trying to be more involved FIRST we are talking straight up revolution now that we have one party control. Remember what the Libertarians orchestrated when the Democrats had one party control (the majority) under Mr. Obama? That was some amazing fake news, Death Panels, yeah, they completely derailed single payer healthcare. Job one is to use peaceful means to work on this broken system. What peaceful means still exist? Voting, and getting involved in party politics at the local level. Outside of using the system to fix itself, you have collapsing strategies of state dissolutionment. For the generations that lived through WWI, and 2 there was a groundswell prior to the war to change the system. After the war the groundswell still existed. It’s why we got Taft-Hartley. The late 40’s through early 60’s came about because the government was doing its job by effectively using collective resources. But we also had the McCarthy era, blacklisting, the birth of civil rights movement, feminism gaining a bigger voice, but the problem soon became a need for more imperialism by specific powerful factions. We made it through to the 80’s and then a group of Republicans laid out the long plan to attack the work that had been done during the previous era to create a better social safety net. It appears that was a game plan in other countries. So, if we don’t want quick and violent we have to buckle down for the long game. One of our choosing. One that recognizes that fighting dirty is the new norm because the rules have been set by the dirtiest players in the game. Fake news and propaganda are the new norm because corporate news is no longer regulated. “When they go low, we go high”, is just not going to cut it, not as a single strategy. I like the strategy, love is going to have to be abundant, but we must be compassionate and strategic. The Democrats have to be pushed to use all of their resources to prevent the Republican long game from succeeding. We have to be realistic and use the resources we have in place. The Democratic party must also wake up to coalition building, and the future of multi-party politics. ", "title": "", "parent": "1363", "creatorid": "e215c0f86ae6", "id": "995ceda3b9d1"}