{"name": "1363_1", "child": "", "content": "I agree, I agree, I agree! People must get involved and the local level is where the last election was lost. All versions of democratically, representative government are predicated on a conscientious citizenry that is also committed to acting on the basis of objectively verifiable facts. You can organize to hell and back but without the characteristics listed in the previous sentence you end up with a herd of trolls. Or, more accurately in this country now, two herds of trolls. And facts be damned along with everyone else. Is this an aberration? An accident? If so how could anyone acting as a conscientious citizen support someone without credentials or ability to any public office. That even minority of the population did indicates there is no longer even the hint of the minimum ethical standards to allow the operation of a democratic representative system of government. This should never have happened. But that’s the way it is so get over it? Accept that fact that a national election was won by a minority party that was able to take over enough state governments in the poorest and least educated parts of the country to, by every means, deny representation to the majority of the citizens allowing a demagogue to slip in by the barest margin in the electoral college? Yes, that’s how the system works so lets try to do the same thing. Damn, they pulled one over on us so lets see if we can do the same thing? Let’s just ignore that this is morally and ethically wrong cause that’s how it works now. Bullshit. No one can study the failure of government in the US, the oldest representative democracy, as it has accelerated over the last thirty years without the sickening feeling that the system is now unworkable. The brutal reality is that ignorance allowed the illusion of democracy. People are ok as long as they can hustle some kind of living and the levels of violence are partially contained and officially sanctioned or officially ignored. The people of Germany watched their neighbors loaded on trains. We have in the US the highest murder rate of any country that is not a “failed” state. People in the USSR watched steadily for seventy years as people disappeared. Most didn’t come back. Teachers in schools in eastern cities have classes that are made up totally of black children everyone of which by the age 12 has either been shot or knew someone who was murdered. Oh yeah that’s not good but that’s their own fault and we’re mostly ok. That means we can just usually ignore it. And so let’s get out there and organize for the next election. Maybe we can get the courts to do something about the blatantly illegal gerrymandering. But that’s really not illegal, we’ve decided by precedent, we just have to organize better. No where does it say that everyone should have a vote and that all the votes should be equal. It doesn’t, right? And wage slavery is essential for the stock market economy. We don’t want to mess that up. But if we can get people to spend all of their time and most of their money running for local office maybe we can make the next census redistricting better somehow? While the only concern of the emerging fascist state is to load the courts and see if they can make these problem people die a little faster. Mostly by natural causes and no health service, mind you, expert for the large number that are given as many guns as possible so they will kill each other and then themselves. And the aging white master race who have to support this are killing themselves almost as fast but we won’t need them anymore except for show votes. Tell me I’m wrong. Tell me that Mr. Smith is now rising from the grave and will make his way to Washington to speak for the small town business owner, who represents now almost no part of the country, and understands the basic issues by reading his home town newspaper everyday and speaking to all of his white neighbors. It was nice when we could pretend that was real and I’m old enough to remember being proud of that. Not only is that gone but we know it never existed except for one part of the people in this country. Not only is it gone but pretending that it still exists poisons another generation, marginalizes millions, and ignores the world and planet on which we now live. We can count our future decades on our fingers and we’ll never make it to our toes. But we should pretend it will be ok if we just do some canvassing and wait for Trump to go away. Bullshit. ", "title": "", "parent": "1363", "creatorid": "ae38d08917ca", "id": "163bb9b1700a"}