{"name": "1376_3", "child": "", "content": "Rachel, I have admired and enjoyed every bit of your content to date, and make a practice on Medium of reading it all when I see it. I am a fan, but not as one who always agrees with you. So I’ll do you the truthful honor, as I can see that you believe in truthfulness, of telling you what I think. Ask anyone here: I do that. Bluntly put, you are being naive in the extreme. That said, I continue to admire the integrity you bring, and that you demand. But these people, both in politics and in media, don’t care what you think. I don’t know that they ever did. They see their jobs, each in their disreputable roles, as telling you what to think, and telling you what you already do think, with their stats and studies and cross-sections and charts and graphs. They hate you, fear you, disrespect you, and have anything BUT serving you in mind. They are your enemy. Your beliefs in democracy or justice or rule of law notwithstanding, these values are regarded as anathema to the daily agenda of politicians and media. They are laughing at you for having them at all, and I happen to think always were. In its way this election and its aftermath are the ultimate age of truth. For once a president has been elected that is simply and unabashedly working his personal brand and not apologizing for it, when that is precisely what the presidency itself has been for generations, only cynically disguised as a public servant’s post. For once the media is shamelessly indulging in self-declared opinioneering and the manufacturing of dissent, rather than pretending to be practicing factual journalism, which I doubt it ever really wanted to be bothered with. Both these outcomes are the result in my view of a grade of technology that makes obsolete the idea of a news cycle or an electorate with cohesive agenda based on issues. The news cycle is every minute the earth spins, and the agenda is whatever sells the most advertising. That, like it or not, is the age we live in. And as much as I admire and believe in the demand for truthfulness you are expressing here, you are shouting down the wind with it. And I say, more power to you, sister. You keep being you. Real people with real lives and real priorities are the human future, whether those mutants in politics or media like it or not (they don’t), and no more than you can make them tell the truth or go away (you can’t and won’t), neither can they make you believe their lies and get in line (you can’t, and thank God, won’t). America already IS great, and has been all along, because you are. Not some duplicitous clown in a red hat intoning how he personally will make it so again. The truth already DOES rule, because you believe in it and live by it, not because Fox or Breitbart tells a little more of it than MSNBC or Al-Jazeera or NPR does. And maybe look to the log in your own eye, before obsessing overmuch on the multiple specks in those of the powerful and influential, just for some balance’s sake. Does not a woman need her husband not to think her butt looks big in that dress? Does not her husband need his beloved to believe that what he really does all day, is work and provide and not shoot the breeze with his buddies a good deal of that time? We indulge in and rely on a million little acts of self-deception continually, and work little ruses and subterfuges and ploys on one another just as much, and just as crucially. Do you always tell your friends what you think of how they live and make decisions and raise their kids? Do they? Would that be within the confines of decency and decorum, to be blunt and absolute and uncompromising for its own sake on every little thing? Try it sometime, that is if you want to spend your life alone and unloved. No, they aren’t the same thing, the lies we tell ourselves and our loved ones for coexistence’s sake, and the lies and deceptions indulged in by politicians and media. But they are as human as you are, and at least in their own opinions have far more to lose than you do, so they lie. Personally I just assume it, and don’t take it personally. How do you know when a politician is lying? Their lips are moving. How do you know the media is lying? The earth is spinning. It is the way of things. Your man there, the one you want fired, was basically just calling them as he sees them. I can find that a tad refreshing, to tell you the truth. It might be as truthful in its way as anyone has been in journalism for ages, to tell you it’s all a pack of lies. ", "title": "", "parent": "1376", "creatorid": "bdc93f756837", "id": "95ee15ac759a"}