{"name": "1383_2", "child": "", "content": "“So why are psychologists breaking with tradition now?” They are not; they are breaking the Law, for political reasons, not clinical ones. They should all be ashamed of themselves, and clearly America would be better off is all 58,000 were disbarred from practising psychology. Psychologists so lacking in ethics cannot be doing their patients much good. All politicians are malignant Narcissists. So are all psychologists, as is borne out by the following true joke. “What’s the difference between God and a psychologist?” “God doesn’t think He’s a psychologist!” This isn’t 100% True, but it is as true as the above smear campaign by left-wing psychologists, and as I am not a psychologist, I can say so without losing my licence to practice. Psychologists cannot; and the President should invoke the “ Goldwater Rule” in their ethics handbook that forbids diagnosing public figures. “In Judaism, there is a principle called “Pikuach Nefesh” which says that it’s okay to break a rule in order to save a human life.” That’s true but, Not all mental health professionals are Jewish,“Pikuach Nefesh” has no standing in US Law, andThere is no evidence that breaking their own ethics rule by publicly slandering the President will “save a human life.” It is evidence of extreme paranoia to think that the President intends any harm to any individual. NewsFlash! Only DEMOCRAT psychologists think this.Trump is a counter-puncher rather than a bully. He has learned that when a bully sets upon you, get at least one good counter-punch in. You may still taking a beating, but he will think twice about attacking you again. All the supposed “Agressions” you accuse Trump of, are Tweets responding to earlier attacks on him. A tweet is about the most harmless thing one person can do: if you don’t like it, no-one forces you to read it. note too that his counter-punch is always proportional to the original attack: he responds, he doesn’t escalate. My conclusion is that Trump is not insane, he is a businessman, and he is learning the Presidency on the fly. He has learnt that to excel at anything you have to try new things, be prepared to Fail Fast to Learn Fast. To honour his election promises, he knows he will have to act decisively, something that the political elites haven’t done in the last few decades, to get things done. That to me sounds like what the American people voted for, and a sane man knows that “The definition of insanity is doing the same thing over and over and expecting something to change.” That is what Hillary Clinton promised more of the same thing over and over, as had failed in the Obama era. These Psychologists should consider the ancient adage: “Physician, heal thyself!” Nearly 60,000 mental health professionals have been diagnosed with a type of insanity that is often compared to an alcoholic’s lack of honesty and impulse control: attacking President Donald Trump. ", "title": "", "parent": "1383", "creatorid": "55c90c9ea6af", "id": "283cbc9ba14e"}