{"name": "1383_13", "child": "", "content": "Is It Time to Call Trump Mentally Ill? When psychiatrists give diagnoses about the mental health of politicians, it’s not just unethical — it’s intellectually suspect. By Richard A. Friedman “This is all to say that when mental health professionals label public figures with mental illnesses, it is not just unethical — it’s intellectually suspect. We don’t have the requisite clinical data to know what we are talking about.”  Please read the article in the New York Times by Richard A. Friedman. I am offended by all of this talk about Trump being mentally ill, and I’ll tell you why. Let me get this clear first — I am NOT a Trump supporter. I can’t stand the man, and I think he’s taking our country in a very, very dangerous direction. I voted for Hillary and actively campaigned for her. Sorry Hillary haters. What I AM is a person who actually IS diagnosed with mental illness and all of this armchair talk about Trump being mentally ill is deeply offensive to me. A mental illness diagnosis is NOTHING to cavalierly throw around. I urge you to read my posts on here for an intensely deep insight into what a mental illness diagnosis is really like. I am not offended because I fundamentally disagree with you and others about Trump’s fitness to be president. Clearly Mr. Trump does not appear to be the most stable of individuals— he wavers up and down on almost a daily basis. Maybe he’s just a deeply unhappy and pissed off person. And I agree, this is a person who is deeply unfit to be our president. However, you can exhibit instability, have mood swings, intense emotions and a shitty attitude towards others without being mentally ill. And since when are we GUESSING at DSM criteria without actually having SEEN the patient?? Now we are diagnosing people with mental illness based on what we SEE? This is dangerous. The point is — without a full psychiatric exam, which is a type of medical exam performed by a DOCTOR — WE DON’T KNOW what’s wrong with him. A deep dive into the diagnosis? The first time in history so many mental health professionals have COLLECTIVELY DIAGNOSED a living individual? Excuse me? Are you serious? How did they all fit into the examination room?? YOU CANNOT DIAGNOSE SOMEONE WITH MENTAL ILLNESS WITHOUT A FULL PSYCHIATRIC ASSESSMENT WHICH INCLUDES A LIFETIME HISTORY OF BEHAVIORS, SIGNS, SYMPTOMS, AND ALMOST ALWAYS SOME DEGREE OF CHILDHOOD TRAUMA. I know. I’ve been through it. My 70 year old father-in-law can be an angry old grump, and cannot handle being in a public place for more than ten minutes without anxiety setting in. He can appear to be “unstable” to others who only observe him in public for a few minutes. He’s not mentally ill, he’s just an old man who had a very hard life and came from the generation where men were not taught the coping skills required to manage difficult emotions. He’s also a Vietnam vet and by God is he allowed to be a little unstable, or sometimes a lot. It is dangerous to be throwing around the words mental illness (again, see my posts if you’d like to learn more about that). First of all, armchair diagnosis has no business in our society, PERIOD. We’ll all be diagnosing each other soon — if not already (ex.: Oh my god you’re so depressed all the time, snap out of it). I would argue it’s waxing Orwellian if we are going to become a society who points the finger at people we think might be mentally ill. This also makes me think of the famous Stanford Prison Experiment, except the roles are slightly different. The Guards are those pointing the finger and making armchair diagnoses about who is mentally ill — even if they are not. These so-called diagnoses create Prisoners, whether they actually have a medical diagnosis or not. And trust me, living with an ACTUAL diagnosis is much like living in a prison (asylum) anyway, it’s just invisible. I know this all too well. Lastly, I’d like to refer to what Mr. Friedman writes about Mr. Trump, mental illness and morality — he nails it: “There is one last reason we should avoid psychiatrically labeling our leaders: It lets them off the moral hook. Not all misbehavior reflects psychopathology; the fact is that ordinary human meanness and incompetence are far more common than mental illness. We should not be in the business of medicalizing bad actors.” Kari Ann Meding ", "title": "", "parent": "1383", "creatorid": "86238cd3bc1c", "id": "39182d469c2c"}