{"name": "1383_9", "child": "", "content": "Nice methodically analysed post Shane. I consider myself to be a fair person, that balanced judgment should be passed on everything, for example Silicon Valley Tech companies like Google, Apple and Seattle based Amazon are taking a lawsuite against a President fulfilling is campiagn manifesto was too rich for me. These companies DO NOT PAY ANY TAX or have sweetheart deals, they have used globalisation to drive down living standards for middle class people — so we are expected to applaud them in this so called gesture of morals. Now of those 3 companies I mentioned, tell me which one of their CEO’s has not acted vindictively, immorally, told lies, made telling comments about others. But no one it seems had bothered to look at how Larry Ellison, Steve Jobs and Bill Gates behaved, towards their own workforce and rivals?? Why all of a sudden this diagnosis — they could have made this diagnosis during the primaries, the election campaign, there was certianly enough footage then — so I ask myself is tis a fair unbiased and non motive based diagnosis? Winston Churchill considered one of the greatest war time leaders had a mental illness, he was terrible as a leader in peacetimes — but yet he is regarded as a hero and no one wants t give Trump a chance. After all, we’ve had Bill Clinton who has problems keeping is hands and other body parts off interns, but no globals women’s march happened then, but Trump says something (not done something) and there is a March. You mentioned Clinton’s psychology in your post, but he too behaved below the dignity of his office, betraying people he loved, hurting an innocent employee, lying, evading using his well reknowned guille for his own purposes — surely he too warranted a living diagnosis, but that did not happen — why? Then you have Obama — the only President to have legisated more laws against free speech and shamelessly hug the Saudis who fund IS/DAESH to the tune of $2.2 BN as reported by CNN & BBC. No one marched, no one protested to that? That too is a VERY mentally unhealthy person. My conclusion is that, please don’t get me wrong, in America there is an unhealthy mental attitude to discgracing your own leader, so why would it be expected that the world respects the USA if this is how porfessional behave towards their own leader — perhaps it’s the 300 million citizens who all should line up for a living diagnosis — the US healthcare system would love that as would the USA GDP reports. Bottom line is that EVERY CEO of a thriving company has a mental issue, including present, past and future CEO’s of the USA. Perhaps this mental physicians have not understood REAL life, you hang around mentally ill people all day, you too might end up delusional — that is my hypothesis and banaced opinion ", "title": "", "parent": "1383", "creatorid": "809c9ada110b", "id": "b14340954554"}