{"name": "1404_9", "child": "", "content": "I didn’t really create this with digital marketing in mind per se, but off the top of my head I could think of using this to define the various ways brand engage online regardless of platforms and refine customer experiences online. I could also see this being applied as a way to check the overall marketing efforts to make sure they are operating in most quadrants (like a portfolio approach). I’ll definitely give it some more thought. Tribes — this is very aspirational for many brands, and I think the ultimate goal. It’s why you hear so many brands talking about “building movements and communities.” Two examples that I’m currently researching are Marie Furleo’s B-School and Kayla Itsine’s #bbgGirls. They both include users who are heavily engaged, know each other, and have built relationships around the brand values. Flocks — this is mainly brand exposure and awareness campaigns. Good examples would be Oreo’s #dunkinthedark campaign during the Super Bowl, and even the more recent #damndaniel viral snapchat video that was then used by brands to communicate. Both recognize the quick, time-sensitive nature of an online reaction to something. Single Servings — This for me is where customer service lives. This is about reviews and messaging for help in solving an issue. Twitter is great for this, as I’ve personally gotten help from airlines, banks, cable providers, when I’ve had a question or problem. Ecosystems — are about general presence, about anchoring a brand in the places where consumers frequent, even if that engagement is more passive, like scrolling in my Instagram Feed. Thank you for your comment! You’ve given me some more things to mull over and I’ll be thinking of how to incorporate this angle into future uses of this framework. :) ", "title": "", "parent": "1404", "creatorid": "cd7d303d1f95", "id": "db5c68d4149f"}