{"name": "1419_19", "child": "", "content": "Translate that to the UK in the mid to late sixties and that’s my experience as well! My Dad was a butcher but I didn’t like meat and I couldn’t eat anything green. To this day cauliflower (yes I know it’s white!) comes with cheese sauce or is not eaten. School meals in the UK at that time are redolent of a horror that is still whispered about by us 50-somethings and 60-somethings because it WAS British food. Everything boiled until it was white (though the cauliflower was grey), meat stewed but fibrous and full of gristle and gravy with everything writhing over your plate like some stygian swamp. At home I fared better. Dad provided goodish quality meat at home and Mum was a brilliant cook when time allowed, but since she worked as well the evening meal would be a one pot prior to her starting evening housework. One pot cooking at that time in that place (North West England) consisted of minced meat, potatoes and onions in varying ratios. Ash was eaten on Monday evening. This was the simplest variant — minced skirt of beef, chopped onion and chunks of potato boiled together. That’s it, that’s all. Oh with salt and pepper. Tuesday Mum would have a bit more time it not being a washing night so we had meat cake — mince and onions sans potatoes but in a pastry case. And then there was of course the stuff of legends — Meat and Potato Pie (it does deserve the capitalisation). This is mince, onions and potato under a pastry crust and is still regarded as the height of Lancashire cooking. These where the three meals I would eat at home. The meat was minced and anonymous and everything had a stodginess that I still crave much to my partners dismay. Everything else was a dead loss and I refused to eat. Ours was a house of not only eating what was put in front of you but eating ALL that was put in front of you. No token bite and an excuse that you’d had enough. War time and post war austerity where only a few years behind — my eldest sister had had a ration book — and food was not to be wasted. If only there hadn’t been so much of it! My own vegetarianism began in the eighties as friends became veggie for various ethical reasons. First came the cheese. Then came the lentils. Then came the meat substitutes which were initially awful and included various soybean protein concoctions but also Sosmix. I pray and hope that whatever befalls you in life it does not involve Sosmix. Sosmix came in a red checked paper bag. It vaguely resembled pink breadcrumbs studded with pea sized lumps of fat. You mixed it with water and squished it into turd shaped “sausages” which then had to be fried. There was lots of stuff written on the bag as to why frying was healthier than not frying and I seem to remember there being further proof in diagram form. However, the truth was if you tried to cook Sosmix any other way it simply reverted to its constituent components. Mmm, good eating! And now I am piscatarian through having to eat oily fish for my joints, which are damaged from being overweight through most of my life because of my mother’s voice still spectrally insisting that I eat everything put in front of me. Well, that’s my excuse. Austerity made me fat! ", "title": "", "parent": "1419", "creatorid": "2321660e25bb", "id": "3b278e433019"}