{"name": "1434_4", "child": "", "content": "Bonjour Laetitia et félicitations pour cet article bien écrit et bien renseigné.Etant très lié au domaine du soutien scolaire, je me permet de laisser un commentaire pour souligner les nombreux points importants de votre article et nuancer ou m’opposer aux quelques éléments de votre argumentaire vis à vis desquels je suis moins d’accord. L’éducation nationale connait effectivement de vraies difficultés comme en témoigne le déséquilibre que vous citez entre le nombre de candidats et les places aux concours. Les classes continuent de se remplir avec de plus en plus d’élèves se trouvant là par défaut ce qui entraîne une plus grande difficulté d’impliquer un groupe et rend le travail des enseignants plus lié à la discipline et moins… à l’enseignement. L’évaluation par les notes est loin d’être idéale. En fonction des contrôles proposés il est régulièrement demandé aux élèves d’apprendre et de savoir plutôt que de comprendre et de s’adapter. Quand c’est le cas, ce ne sont pas les qualités essentielles au développement de la personne qui sont liées à la “réussite scolaire”. Ce sont en effet les parents qui ont un rôle important à jouer. Ce sont eux qui influencent le plus les élèves et ce sont eux qui doivent savoir ce qui est vraiment important entre avoir de bonnes notes et avoir compris/progressé. Ces deux objectifs n’étant pas incompatibles. Bien que dans le cadre d’une première approche économique cette approche ne fasse pas sens pour les acteurs présents sur le marché, l’objectif premier des organismes de soutien scolaire devrait être de se rendre dispensables le plus rapidement possible. L’entreprise qui réussira à rendre la majorité de ses élèves autonomes le plus rapidement possible (bon produit) et à le faire savoir (bonne communication) prendra l’avantage! Il arrive de nouveaux élèves chaque année, et en grand nombre. Il ne faut pas emprisonner ses clients, il faut en faire ses premiers commerciaux. Je suis moins en accord avec vous sur les points suivants. Vous ne mentionnez pas dans votre article la raison de l’existence des avantages fiscaux ni leurs champs d’action. Ces avantages fiscaux sont liés aux services à la personne en général (pas uniquement au soutien scolaire mais également à la garde d’enfants à domicile, aux petits travaux ménagers, jardinage, bricolage, etc.) et ont pour vocation de limiter le travail non déclaré. Alors oui, ce sont nos impôts qui les financent mais si ce système n’existait pas, il y aurait encore plus de travail au noir et donc plus de gens sans couverture sociale notamment. “ Pire encore, elles coûtent moins cher aux parents les plus riches puisque l’avantage fiscal ne profite qu’à la moitié de foyers qui payent l’impôt sur le revenu. Or de nombreux ménages moins aisés sont également consommateurs de soutien scolaire. Ils le payent à un prix plus élevé que les parents les plus aisés.”Cette remarque est fausse. Les avantages fiscaux sont une réduction d’impôts (pour ceux qui en paient) ou un crédit d’impôts (pour les autres). L’obtention du crédit d’impôts imposait quelques critères supplémentaires mais depuis le 1er janvier 2017 il est ouvert à tout le monde. “ on doit faire appel à des vacataires au niveau approximatif, dont le travail n’est jamais évalué.”Ceci n’est pas vrai non plus. Le travail des vacataires/contractuels (n’ayant pas de concours de l’éducation national) est évalué par des inspecteurs d’académie. Je le sais car j’ai été inspecté lors de mon année en tant que contractuel. En résumé je trouve votre article très intéressant. Il est très agressif vis à vis de l’éducation nationale et des organismes de soutien scolaire à raison pour la plupart de vos arguments mais à tort pour une minorité d’entre eux.Je suis convaincu que le soutien scolaire mérite d’exister mais probablement pas pour les raisons pour lesquels il est utilisé en majorité. Le soutien scolaire à domicile c’est de l’aide personnalisée et un peu de mentorat, deux avantages difficiles à trouver ailleurs. Je pense également que ce domaine va subir une mutation logique liée aux outils d’aujourd’hui. Va-t-il pouvoir se passer des subventions de l’état pour survivre face au travail non déclaré? Pas dans un futur proche à mon avis même si le gap économique va se réduire avec l’uberisation de l’économie. Et si elles ne réagissent pas, les entreprises que vous citez dès la première ligne de votre article vont énormément souffrir. Il y a beaucoup à faire dans le domaine de l’éducation et j’espère que votre article sera une pierre à cet édifice.J’ai mon propre projet par rapport à ça également. Peut être pourrons nous en discuter prochainement… Cordialement,Alexandre ", "title": "", "parent": "1434", "creatorid": "db47a85325d5", "id": "8e9624846000"}