{"name": "1435_10", "child": "", "content": "You almost struck a chord with me. Almost. Ironically, I quit smoking 15 years ago next month. I smoked cigarettes for 42 years blissful years — all my life to that point if you count the second-hand smoke in my home from my parents who both smoked. Then I started working at the world famous Mayo Clinic where smoking was frowned on/upon by the clinic and the city. It was getting so bad that the only way you could smoke was to go outside a building, stay at least 25 feet from any building entrance, and avoid city-posted No Smoking areas such as parks and designated public sidewalks. I lit up and kept walking like a moving target that is harder to hit. But, all the while I was formulating a plan to quit. The cost of cigarettes had gone up to more than $2 a pack and I was smoking a little more then a pack a day. Of course, I didn’t smoke every cigarette down to the filter so maybe I was only smoking 15 total cigarettes a day. And there was a bigger incentive. My Pops who was already gone 26 years (from a non-smoke related cause) quit smoking when he was 57 years old and I wanted to do the same. I have to tell you I really, really enjoyed smoking when I was left alone to my own devices. So I stopped buying the carton and concentrated on purchasing one pack at a time of the worst tasting cigarettes I could find. It was a chore to smoke half a cigarette. My birthday rolls around and I quit cold turkey and have never looked back. Except, I sometimes think to myself would I start smoking again if I was diagnosed with a terminal illness. The answer always comes up YES. The best tasting tobacco I could afford even if I had to roll the cigs myself. What the hell. When my Moms had a stroke she said to me when we were alone she only wanted a dish of vanilla ice cream and a cigarette. I couldn’t grant her wish because she couldn’t swallow. She died 18 days later. Many times I wish I had tried. There are regrets. Smoke ‘em if you got ‘em. I’d walk a mile for a Camel. ", "title": "", "parent": "1435", "creatorid": "b2d8da833642", "id": "fd4de46a2749"}