{"name": "1449_5", "child": "", "content": "This writing is quite on point, yes, thanks for sharing and I’m in total agreement. However…Did you know that smiling can affect your neurochemistry in a positive way? Studies have shown… Think of it this way, there are well acknowledged general benefits of physical exercise, endorphins, dopamine, all that stuff. No arguments there, right? The smiley face thing, think of it as a gym for your brain. All those years being down in the mouth, that’s your brain lying on the couch eating pork rinds; one of those self-reinforcing spirals of dysfunction. What I’m suggesting some of you might want to try is way harder than most of the other regimens you might have attempted, at least for me it is. I googled “how to smile” how f’in’ ridiculous is that?!! Yeah I want to spend ten minutes a day looking in the mirror smiling at myself. How depressing is that! How far are you willing to go to “get better”. Ha! Is this you: tried this tried that, nothing works or does much good at all, therapy sucks, meds suck more, exercise, diet, alternate nostril breathing(just kidding;-). Its such a personal journey to try to find something(s) that makes enough of a difference to make it part of your regimen. For me, and maybe you, it is a multi pronged approach. Amassing the will power to follow through, hoo-boy isn’t that the big nut that needs cracking. All those friends of ours…who can’t be bothered or can’t understand or who we don’t want to burden, the paid professionals who I find to be a waste of time, money or they turn out to be shitheads saying things like: “well you aren’t depressed”(now I really want to go home and kill myself) or: “who says you’re supposed to be happy?” How do these guys get to be mental health practitioners? No openings at the proctology clinic? Anyway, I hope some of this put at least a hint of a grin or glimmer of a smile on your face, and you felt better for a fleeting millisecond. Now what was my point? Right, smiling and neurochemistry, it’s a closed loop of feedback, each reinforcing the other. Tyra Banks wrote about smiling, that the best smiles involve the mouth and eyes. Get your whole face in on the act. You don’t exercise just your biceps, right? My favorite ‘cause it gets me out doing one of my favorite activities, is mostly a solitary endeavor, and is undercover, is to hike or walk in nature holding a piece of grass between my teeth with lips parted. Probably look like a hayseed, but with no one around, who gives a flock. At home a pencil or anything similar. Feels kinda unnatural, remember those muscles haven’t gotten much regular exercise for, I don’t know, a lifetime? PS I’ve tried many many of the usual suspects, 40 years worth of trying. My go to’s are meditation, lots of exercise(but not on purpose(no gym for me)just a lifestyle), supplements: Tyrosine, fishflaxborage oil pills, multi- B vitamin. And a steady income seems to help now, didn’t before. even when I “had it all”, likely related to stress. ", "title": "", "parent": "1449", "creatorid": "abad7f4b723d", "id": "8c1ef2c391cb"}