{"name": "1486_3", "child": "", "content": "Whenever I see the losers name I remember back when he first came on the air.. My wife and I went to a dinner party with some conservative folks (meaning they call themselves conservative when they disagree with something they deem politically liberal like PBS; issues related to race that’s never effected them like Katrina flooding the 9th Ward; and of course those high taxes while they incessantly bitch and complain about potholes in the road and the state of public schools) and this woman we know named Mindy, was going on about how great she thought Bill O’Reilly was! And I do mean going on and on and on. Since I was sitting next to her I finally had enough and turned to her and said these words with a discrete, yet direct and rather blunt intention: “He’s a jackass.” She looked at me with surprise and loudly asked “What!?” As if to make this an opportunity to put team tactics in play for anyone like her redneck husband to jump in the fray against me in defense of her favorite tv celebrity. So I repeated it so she couldn’t miss my meaning — “He’s a jackass.” But this time I made it loud enough so everyone heard me. Silence. Nobody made a peep. My best guess is because they were probably sick of her drivel, and she could sense that so she shut the fuck up about Bill O’Reilly. I could feel the heat rise in the room. Mindy was a raging inferno inside because I closed her down in such an embarrassing way. That, and the fact none of her like minded cohorts had rushed to her defense to take me on. But they didn’t have anything to stand on. I mean they can’t bash a guy like Sean Penn for taking a photo tour looking for those invisible weapons of mass destruction, and also defend a celebrity pundit that’s never done shit but get paid talking to a tv camera with the schtick of publically belittling anyone who views the world differently than him. Thinking back, I’ve probably never watched more than few minutes of Bill O’Reilly’s program. I knew by seeing and hearing his pompous tone that he was a jackass before I’d change start surfing the channels again. That was more than enough to draw my conclusion. But I’d see articles from time to time about how he lied about being a football star, or he’s inflate his ego selling fictional opinion books he’d argue were factual, and I’d see him lampooned o the Colbert Report. That was more than enough to know he was a genuine jackass long before the secret pay-outs of millions to women he suppossedly didn’t do anything wrong to. I also never liked Mindy. She treated me like shit. She was my wife’s friend and they had horses in common, so I tolerated her at dinner parties. But for the most part I successfully avoided interacting with her in any way, shape, or form aside from the occasional sighting at the grocery store (it’s a small town) where we would exchange fake pleasantries. Although it might seem petty, looking back on that night I considered it as a small victory of defiance against people with shit-for-brains out here in middle America, and in a weird way I must credit Bill O’Reilly for opening that door for me. I didn’t hold my tongue like I usually do to make nice with people I don’t like. I let her and everyone there know that I didn’t care for their perverted brand of ideological driven conservatism fed to them by the likes of O’Reilly, Hannity, Rush, The Koch’s and the rest. I was on solid ground for any political debate they wanted to undertake and I was up for the fight. I stood my ground and I must tell you, it was a great feeling seeing them back down like cowering dogs with their tails between their legs. So these days, with that “jackass” in the news cycle daily for his disgusting abuse of women? I have to chuckle to myself thinking I hope everyone at that dinner party remembers me, and exactly what I had to said about old Bill.. He’s a jackass! Ha! Although, the skeptic in me would accurately predict —since most (not all) of these same people have no shame — and they are more than likely digging in and smearing his accusers because they can’t ever admit when they are fucking wrong. They’re precisely the reason his ratings have increased. As for BO getting the boot at Faux News? Well.. um.. I’ll have to see it to believe it. If the news cycle stays present and more women come forward — and there’s even more shocking details than there’s been already; as if common decency even matters to some people who claim they have the moral majority. Obviously, I can see the head honchos that sign the checks making a change and canning his lying ass purely for public relations because they’re smart enough to know this won’t be the last time it happens. But if the story dies down in a few short weeks? Which my bet is that it will.. and it’s the very reason he’s announced he’s going on a vacation in mid-April. The front page news will be replaced with another scandalous headline out of the White House, or the media is entrenched to reporting the next march to war. Then I can see O’Reilly re-taking his seat on tv and every single advertiser coming back to his show — as if nothing ever happened. Why? It’s simple. MONEY rules the world. Moreover, advertising is as fake as Bill O’Reilly. It’s mostly about eyeballs, and they all know that they can craft their own images around just about anything to sell to stupid people. That’s my take. ", "title": "", "parent": "1486", "creatorid": "2df3a5ce8269", "id": "8428831969c5"}