{"content": "How about trust none of them and just watch a movie. Given that there are as many opinions about a movie as there as people watching them, what one person/site says shouldn’t change your opinion. “Cult Classics” generally get bad reviews, people still enjoy them. Game of Thrones catches a lot of criticism for not being true to the books despite even the AUTHOR saying time and again not to compare the two. Ghost in the Shell recently released to what I’ve seen as pretty mixed reviews, but again most people that have enjoyed it said to view it as a Stand Alone (Complex) and not compare it to the original. What I see a lot is that people don’t understand that the majority of ‘big name’ reviews are paid for in at least some manner. Either they got the product for free, or they were outright paid to do the review. Because people are human, this colors their perception. Hard to take a review seriously when truly bad products are given “6/10” scores. Numbers mean nothing… I know especially for game reviews/reviewers there are a lot of good videos on why you should take every review with a huge grain of salt. There’s also a lot of undisclosed sponsored reviews as well — which while illegal, is also irresponsible of the reviewer. It’s gotten to the point where the sarcasm is palpable in the video when some of them do a sponsored review, just staring at the camera saying “This. was. paid. for.” It’s all good data, but when you’re trying to quantify a subjective opinion, you’ve already lost. I tend to trust reviews based on more technical aspects of something rather than whether they believe a movie/game/book was “good”. Poor writing can often be excused for a good story. Remember — Harry Potter was written for pre-teens, adults still enjoyed the story. EDIT: As an example: http://deadline.com/2016/12/will-smith-collateral-beauty-lowest-box-office-opening-rotten-tomatoes-1201873153/ This article lists a few problems with the review system. Further information can be attained by looking at Steam game reviews and how negative PR from a Developer unrelated to the game itself can kill a product’s sales. Just because a critic thinks the movie is bad, doesn’t mean YOU will. I enjoyed the Matrix Movies, I know a lot of people that think I’m wrong. ", "child": "", "parent": "14", "title": "", "creatorid": "99e275b02da6", "name": "14_15", "id": "2d0ce6b5e5cd"}