{"name": "1512_2", "child": "", "content": "Stop being so selfish. Being white, straight, and healthy is irrelevant here. The real privilege you have is the one that lets you say “men should do things for me because of how I feel” with any kind of straight face. How many people get to cherrypick from their subjective, personal experiences and then demand reality conforms to that? You don’t seek to understand or even find out who your ideological opponents are or why they believe the things they do because you don’t have to. That’s class, social, political, and even legal privilege. And a lot of those opponents are women. A lot of them are not white. Do you think the patriarchy brainwashed them so they experiences are not valid? Why do you think your personal beliefs are universal to all women? That state congressman suffers from a delusion that’s currently in outbreak status in Republican circles: an utter distrust of women. Unlike feminists, who distrust both women and men that don’t think like them? First, that “women’s issues” is a false label. These are human issues No, they are feminist issues. Second, that the overwhelmingly male executive branch of our government is currently waging a war on women Which demographic comprises the majority of the electorate? Are you saying women are waging a war on women? Lastly, that the resistance to Tr*mp’s white-dude coalition needs male ally-warriors for the counter-attack. Fantasy novels are called “fantasy” for a reason. The real, adult war is a bit more nuanced than total good vs. total evil. Because the way many Republicans currently in office would have it is for women to have a simple choice: either abstain from sex or put your health, your ambitions, and your plans on the line, because if you get pregnant, tough luck. And that’s not a choice at all. You mean the same exact choice men have to make? I have yet to personally meet a man who has stated that he is against abortion. But I’ve met several women who are. By the way, that riddle? You’re right in that its old. The first time I heard it was before 2010 in high school. It took me about three seconds to solve the first time. ", "title": "", "parent": "1512", "creatorid": "99878d9f0eb8", "id": "e156e1087569"}