{"name": "1523_18", "child": "", "content": "Is there a connection between the romanticized view of the Civil War (excuse me, the “War of Northern Aggression”) and Spicer’s statements about Hitler gassing his own people? Maybe it’s just me, but it seems like the people who believe the first are also much more likely to believe the second. Small problem with that: we do not have any actual eyewitnesses to the War Between the States. And while they are dying out, there ARE witnesses to Hitler and his ovens. But let’s ignore the witnesses for both, we don’t actually need them. We have these amazing things called photographs. Kids, they were brand new in 1860; photoshop did NOT exist. What went into the camera lens came out on the developed film. So creating a specific photo required setting the scene, posing the subjects and taking that photo. It was a thing to take pictures of dead people (don’t judge them, this was before reality TV); in order to make cadavers look…more, um…life-like, eyes would be painted on the lids. They could be posed sitting, even standing…just hide those ropes holding them up with a shawl or a family member’s arm around them. Now, understanding photographic limitations during the Civil War, you can feel the power of this new medium. Many of the battlefields were photographed after the fighting finished but before the bodies were cleared off. There is simply no way to deny the dead. Jump ahead to the 1940’s. Photoshop still hasn’t been invented. They could take a series of photographs, creating moving pictures and yes, in Hollywood, they were creating special effects. However, in the battlefields, there was neither time nor ability to fake anything on a grand and glorious scale — you know, like walking up to a camp and filming all of the people watching you arrive, looking at you like you’re a god. There are no special effects, even today, that match the very real, VERY obvious, starvation and deprivation those people had suffered. The Nazis themselves knew that they had crossed a line and once they realized that the war was not going to end in victory for them, they began with the damage control. Artwork and money, gold and gemstones were sent out of the country (possibly to South America) or hidden. Treblinka, a camp built in Poland SPECIFICALLY to kill large numbers — there were no long-term accommodations for prisoners, no local contracts for prisoner labor — was razed to the ground, all buildings torn to pieces and a forest planted over it. That could not have all been done in the last week of the war… so the Nazis had already developed a plan for covering their asses and in this instance, had used it. That there are still people who believe (not even just “willing to believe”!) that the Holocaust never happened is mind-boggling. History lesson: Sarin gas was invented BY THE NAZIS. But Hitler chose not to use it, possibly from his own experiences with chemical warfare in WWI, but more likely because he knew that Churchill would retaliate with his own chemicals. In addition, if Germany used sarin, their own troops would be coming into the affected areas before the gas had dissipated enough to not be fatal to them. Addendum: Hitler made a huge (YUUGE) mistake: when you are creating a super race, make sure that you are a member of that race — especially if part of your plan involves getting rid of anyone who is not a superman. ", "title": "", "parent": "1523", "creatorid": "d3d6ddfb69fd", "id": "b264e4353cc5"}