{"name": "1526_1", "child": "", "content": "In brevity, a brief explanation for the Trump/Russian connection. Trump’s business relationships with Russia far predates his campaign so you would expect traffic between him and Russia, however, it does not prove Trump himself went to great lengths to win from a Russian conspiracy. He ran a campaign for popularity and not to win which is why he tried to hide his motive for losing by the “election is rigged” rhetoric. If you desire or think you will win you do not repeatedly claim the election is rigged, as it would undermine your victory. Trumponomics has always relied on broken promises so just like Trump University, he was making deals with Russia through promises he never intended to keep. Last month it was quietly noted when the Mercer family yacht and a Russian oligarch’s yacht were recorded in close proximity in Florida: Yachts of Trump financial backer, Russian oligarch seen close togetherThe coincidences are piling up. Russian oligarch Dmitry Rybolovlev last week disavowed any contact with President…www.mypalmbeachpost.com They initially funded the Cruz campaign with $13,000,000 but after he lost they immediately approached the Trump campaign and essentially bought not just the campaign, but the Presidency. They shifted Kelly Conway from the Cruz campaign to Trump and as owners of Breitbart inserted Bannon to the highest possible access in the Executive branch. Bannon and the Mercers are not just compatriots in white supremacy, but also want to destroy the GOP. They also own Cambridge Analytica, a company focused on manipulating polling data and were a key part of ensuring Brexit passed and has influenced elections in over 20 nations and over 40 federal elections although they only entered the US market in 2013. With all of their experience they failed in Cruz’s campaign and he had every possible advantage over Trump. A basic question is this: why did Trump bring on a team to run his campaign when he already beat that team? Simple. The Mercers paid him a shit bunch of money. How is it Cambridge Analytica failed with Cruz but succeeded with Trump? The only difference between the two is a Russian connection. The Mercers knew all of this was just a bit too convenient so their pr strategy immediately after the election was to put distance between themselves and Trump by propping up a different firm responsible for campaign strategy. On November 15th, 2016 Megyn Kelly introduced a guest as: “The man behind the digital operation now credited with helping find and turn out the voters who made the difference.” Brad Parscale owns a small marketing firm and had never worked on or directed any political campaign for any candidate in any election in any State in the US or any nation in the world. He has no interest in politics by his own proclamation. Yet the Trump campaign paid him $20,000,000 to run strategy even though they already had Cambridge Analytica. In that interview he took full credit and never uttered a word about Cambridge Analytica. Santa Fe mayor defies Trump on sanctuary cities; Trump's digital guru details winning campaign…Watch the latest video at video.foxnews.com This is a rush transcript from \"The Kelly File,\" November 15, 2016. This…www.foxnews.com The deciding numbers for the winner came down to a difference of just .o82% 0f over 120,000,000 votes. There seems to be all kinds of smoke between Trump and Russia on the campaign yet it is foggy, but not without a fairly simple explanation. Three factors need to be combined as Trump had no relationship with Bannon (so why did he choose him for the highest levels of access and why is Bannon still there given the infighting?), Russia attempted to influence elections prior to 2016, and Trump’s pre campaign business ties to Russia. Here is what happened: Trump made promises to Russia he never intended to keep thus creating a smoke screen for the Mercers to come in and behind Trump’s back, buy the election with Russia’s help. This is why it does and does not look like he made deals to steal the election. The people who bought him bought the election while he was completely in the dark. If you want to understand what is happening with all the contradictions and confusion coming from the White House then simply look at how the GOP is fighting the Mercers (thus Trump) without simultaneously alienating their base. The Mercers had Trump drop the missiles on Syria because one way to destroy the GOP is to divide them not simply from their base, but each other. This is also why the GOP pulled Trumpcare from the floor for a vote. ", "title": "", "parent": "1526", "creatorid": "6c7745fabde7", "id": "c7f2c7ff7af3"}