{"name": "1537_3", "child": "", "content": "Thank you! I missed that in the Daily Beast but had only heard Devin’s personal statement and was wondering about the so-called outside groups. Namely if it was moveon which had a petition for him to step down. Do you know, by any chance, if there is any truth to the rumor that it wasn’t Flynn/Rice unmasking that Nunes went to the WH to receive/research and reveal/distract to offer Trump cover, but instead, possibly Bannon? The Hill, LA Times, Chicago Tribune as well as the Independent in the UK all have reporting on either FBI investigations into far right media outlets or FBI investigations into Breitbart. So, it would make a lot of sense if Bannon’s name came up in those reports. If you watched the televised open meeting with Comey and Rogers, a lot of time was spent by Republicans on the HPSCI grilling them on leak sources, but they were, between the lines, trying to trip them up as well, using standard cross-examination techniques, into revealing more about their investigations than they wanted to, or had previously done under oath. I don’t believe Bannon’s name came up during that testimony, it certainly wasn’t a focus, like Flynn, if it did. But aside from all the distraction/Kabuki with super Jared, the timing of Bannon moving out of the spotlight, being distanced, coordinated with that bizarre Nunes week culminating in him cancelling the open hearing, to me, raises flags. If the FBI has an open investigation into allegations that Breitbart somehow coordinated with the Trump campaign and the Russian FSB and if they already believe that the FSB played an active roll, how the fuck could Bannon’s name not come up? Why am I not reading about that anywhere? No one else is even suggesting this, as far as I know. And doesn’t it seem sort of plainly obvious? If you draw a Venn diagram of Trump and Breitbart… ", "title": "", "parent": "1537", "creatorid": "cc5d4496add6", "id": "77583aa7b9f4"}