{"name": "1537_1", "child": "", "content": "Trump/Russia debate has fallen victim to a false dilemma because there are more than two options. Trump could be telling the truth in denying he had a deal with Putin to steal the election, yet his campaign, paid for largely by the Mercer family, could have been playing that role without Trump being in the know. Trump has been dealing with Russia for at least a decade and in 2008 one of his kids bragged about the financial out pouring from Russia into Trump projects. This is the meat of the connection between the two and it does not, nor ever, been based on elections. By not including Trump, they also prevented the ability to have one of his kids or another person being glued in on the already established communications between Russia and Trump. Anyways, here is the first part of why I think Trump himself did not have an election rigging deal with Russia: Trump/Russia debate has fallen victim to a false dilemma because there are more than two options. Trump could be telling the truth in denying he had a deal with Putin to steal the election, yet his campaign, paid for largely by the Mercer family, could have been playing that role without Trump being in the know. On November 15th, 2016 Megyn Kelly introduced a guest as: “The man behind the digital operation now credited with helping find and turn out the voters who made the difference.” Brad Parscale told her Trump’s victory came from his data mining expertise on utilizing the information to give Trump the edge. He is the co-owner of a small marketing firm in San Antonio, Texas with a 2015 total revenue of $3.5 million dollars. He was announced in June 2016 as Trump’s campaign digital director and he was not a cheap date because for the month of July alone the Trump campaign paid him $8.3 million dollars. For the next month of August Trump paid him $11 million dollars, as stated in FEC filings. http://docquery.fec.gov/pres/2016/M9/C00580100.html Did Trump recruit him and pay those huge sums based on Mr. Parscale’s proven record of running political campaigns? Was Mr. Parscale in such high demand the earliest he could work for Mr. Trump was June 2016 after the Primaries ended? No. and Hell no. Mr. Parscale had never worked on or directed any political campaign for any candidate in any election in any State in the US or any nation in the world. He has no interest in politics by his own proclamation. His entire purpose for that interview was explaining how Trump won, but he never said anything about Cambridge Analytica and claimed only his firm, and nothing and nobody else was responsible for the upset. His only previous contact with Trump was to do some small scale web design, and all of it for Trump’s businesses, never for any election. http://www.foxnews.com/transcript/2016/11/15/santa-fe-mayor-defies-trump-on-sanctuary-cities-trump-digital-guru-details.html Mr. Parscale has also stated he never heard of the Mercer family and his first contact with Cambridge Analytica happened after they cold called him. Cambridge Analytica first worked for the Cruz campaign when the Mercer family dropped $13,000,000 into a pro Cruz PAC, “Keep the Promise 1”, but switched to Trump, now known as “Make America Number 1”. CA and Cruz worked closely for over a year but after Cruz lost the Primary, CA hustled the Trump campaign to bring them on and Trump agreed. It is doubtful he is aware CA’s contributions to Cruz were so ineffective the campaign stopped using all CA data after the South Carolina primary. On strategy for supporting a neophyte over the Clinton machine, Alexander Nix from Cambridge Analytica gave an interview on October 27th and said: “The key is a psychological model for identifying voters that can “determine the personality of every single adult in the United States of America,” said Alexander Nix,” Trump’s plan for a comeback includes building a ‘psychographic’ profile of every voterIn a Fifth Avenue office near Trump Tower, a company being paid millions of dollars by Donald Trump’s presidential…www.washingtonpost.com He credits psychographics as the key factor for why they will be successful over Clinton. On November 11th Cambridge Analytica issued a press release celebrating themselves by claiming nobody else saw it coming (completely false as The Young Turks not only predicted a Trump win, but predicted on election night he would get 279 EC votes.) Mr. Nix reiterated from his claims from the October 27th interview: “[CA’s] analysis was based not on punditry or the art of politics, but on data science and a rigorously scientific approach to research and polling,” says Cambridge Analytica CEO Alexander Nix.” {{ metatags.fb_title }}metatags.fb_description }}cambridgeanalytica.org December 2016, CA’s data manager for the Trump campaign stated: “Actually, there was very little psychographics in what he did for Trump. There wasn’t time: they’d had to set up the entire data operation ‘from scratch’.” https://www.spectator.co.uk/2016/12/the-british-data-crunchers-who-say-they-helped-donald-trump-to-win/ Last month the NYT had another article on Mr. Nix and CA where he again touted the “secret sauce” psychographic advantage but the article continues with: “Cambridge executives now concede that the company never used psychographics in the Trump campaign.” https://www.nytimes.com/2017/03/06/us/politics/cambridge-analytica.html Approximately 137,000,000 Americans voted but the margin for victory was decided by only 107,000 votes in just three states. How Trump won the presidency with razor-thin margins in swing statesOf the more than 120 million votes cast in the 2016 election, 107,000 votes in three states effectively decided the…www.washingtonpost.com There are many nonsensical actions by numerous players but to summarize thus far, we gotta have a supernova pretzel party. The Mercers backed Cruz by investing over a year of energy for his campaign, at least one whopper check of $13,000,000 and giving and him exclusive access to Cambridge Analytica during the Primaries. They worked against Trump throughout the entire Primary campaign until Cruz lost. That is where the Russian story begins. After Cruz conceded to Trump on May 3rd, the following timeline of events are comical, sobering, spinning, frustrating, and boosted liquor and weed sales by 897%. May 18, 2016: Clapper states signs of attempted hacking on 2016 elections have been noticed. https://www.washingtonpost.com/world/national-security/national-intelligence-director-hackers-have-tried-to-spy-on-2016-presidential-campaigns/2016/05/18/2b1745c0-1d0d-11e6-b6e0-c53b7ef63b45_story.html June: Trump hires a small marketing firm that had never participated in any election, announcing Parscale as the digital director and pays them over $20 million dollars. June: Cambridge Analytica petitioned Trump to take over his campaign to beat Hilary. The same company that could not get Cruz elected over Trump. June: Cambridge Analytica cold calls Parscale regarding Trump’s campaign. As noted, Parscale had never worked on any political campaign, so why did Cambridge Analytica reach out to him on running Trump’s campaign after CA petitions and wins patronage from Trump? They have experience and track records from elections in over 20 nations, 44 US federal elections for the 2014 mid terms alone, and was significant in giving Brexit a victory. June: It is announced hackers breached voter databases in Arizona and Illinois, acquiring detailed data on hundreds of thousands of American voters. July: DNC email leaks August: Bannon is made chief of Trump campaign. October: Cambridge Analytica proclaims their unique psychograph data program is how Trump will beat Clinton. November 11th: Cambridge Analytica, just 4 days before Parscale is interviewed on Fox, announces they are the reason for Trump’s victory by using their secret sauce called psychographs. November 15th: Parscale on Fox claims he was responsible for the data operations for the Trump campaign. December 3rd: Matt Oczkowski is credited for running the data operation, (contradicting Parscale’s claim in the Fox interview on November 15th.) And att 29 he is a veteran of eight years of political campaigns and he ran Cambridge Analytica’s Trump data operation. He made one hell of an impression: “Actually, there was very little psychographics in what he did for Trump. There wasn’t time: they’d had to set up the entire data operation ‘from scratch’.” Cambridge Analytic claimed before and after the election Trump would win based on their unique data frames, the psychographs. Without them, CA is just like any other political group crunching same groups of information. March 6th, 2017: Cambridge Analytica claim again their special sauce of psychographs got Trump elected. March 6th, 2017: Cambridge Analytica admits again they did not use psychographs for Trump’s campaign. (shit hits the fan on Trump/Russian investigations) March 15, 2017: Bannon, who is Cheney’s twin and Satan’s envy hates the press but took some time to say Kelly Anne Conway saved the Trump campaign after the H/Access tape was aired. The Mercer family spent over a year with significant energy and money propping up Cruz, who they thought at the time was the best shot for beating Hilary. If they believed all of that was necessary to have Cruz beat Hilary, why did they jump on Trump with only 5 months to go and no preparations? If they could not succeed with Cruz over Trump, what made them buy into Trump beating Hilary? They underestimated the bonds of bigotry, corporate greed, racism, and fear. Without doubt from the beginning they were much more in line with Trump’s hateful views over Cruz. The short but spiked patterns of intersections help clear the picture. They own Breitbart, where Bannon was the editor and they own Cambridge Analytica where Bannon was a chairman (or VP) on their board. April 4th: Bannon is announced as removed from his post, but can still participate in all NSC activities. Just as the Mercer family mandated Bannon as chief campaign for assburp Trump, they made Bannon clear out a direct path to Trump, put him on the NSC, and has now removed him because of the election and heat of the Trump/Russian investigations. They are simply trying to reshape the image of the White House as a normal Presidential palace of abuse. Cambridge Analytica has never produced evidence for their claims on creating and using “psychographs.” That is because it is pure, steamy bullshit. It is a term to hide behind to justify mystical election results without the need for war. That is why in this cycle CA repeatedly claimed psychographs is the secret weapon to destroy all. Unfortunately, questioning the legitimacy of the election results created pressure for CA to actually explain the science of psychographs. I truly believe Trump when he claims he had no personal collusion in progress with Russia to steal the election and will expand on that in the next section. One reason the math is not adding up for some people is the gap between Clinton and Trump for the popular vote. It was pretty big. Over 120,000,000 people voted, but the results on who won came down to just 107,000 votes in three states. It should not be dismissed from the realm of possibility the Mercer family, after losing tens of millions in Cruz, doubled down on the money aspect to go just a hair beyond the program of disinformation. If they realized or were shown a method for adding or altering just a handful of votes, it makes perfect sense why they invested so much in Trump as it was not much of a gamble. Does anyone really believe it is not possible to alter votes on a minute and spread scale to prevent any pattern from being noticed? How could they pinpoint? Probably from the hundreds of thousands of stole voter data. ", "title": "", "parent": "1537", "creatorid": "6c7745fabde7", "id": "143dd9b0baf2"}