{"name": "1553_3", "child": "", "content": "If you never show ID, how do you know if a citizen cast that ballot? Some States like California allow people without ID to sign an affidavit saying they are citizens and are allowed to register under that “honor system”. This has been the policy in California and many other States for generations, so it is just logical that at least some illegal aliens have taken advantage of that “honor system”. The same illegals using fake SSN’s; to work (some estimates show 75% of all working age illegal aliens use fake SSN’s) can use that to register to vote and being as the penalties for working with forged papers are higher than voting illegally, why not? Also, everyone has ID. It is a lie that there are millions of only Liberal voters live in the woods and only come out on voting day. All people have to have ID. You can’t open a bank account without Government issued ID. Those Government benefits and SSI benefits etc all mandate direct deposit, deposit into bank accounts you had to show ID to open. You have to have ID to have a job, you have to have ID to cash a check, especially a Government check. You have to have ID to use your Obamacare insurance, to use your medicare and medicaid benefits. Everyone has ID. Let’s consider the biggest group Liberals love to cry about, college kids. They claim they never have any form of ID and can’t vote and they are all far left Liberal supporters. But that does not make any sense. Consider the fact that unless their parents are super rich, the college aged adult is having to work to at least a part time job to cover some expenses. Even rich kids will sometimes have jobs because their parents do not give them enough money to cover their beer and pot costs. So if most are working some sort of job, then they have ID, because the first thing you have to fill out with your new employer is your I-9. Care to guess what you need to have to fill out an I-9? ", "title": "", "parent": "1553", "creatorid": "8f86e30254bf", "id": "ab76dcd60ac0"}