{"name": "1553_10", "child": "", "content": "It’s very telling that the republicans claim the existence of large scale voter freud, but are not aggressively investigating it. They don’t want to investigate it. The president almost daily exclaims that he would have won the popular vote if it wasn’t for voter freud and that it’s fake news if the media says otherwise. As long as there is no definitive proof, the republicans will use that doubt to push through more voter suppression laws. Voter freud is rare. As an individual, you are more likely to die in a horrible accident looking for voter freud than you are of actually witnessing it. To claim the existence of such wide spread voter freud, you would need to be completely detached from reality (huh, that could explain a few things…) Here’s something I wrote just before the election to emphasize how rare it is. These are actual statistics and not alternative statistics, so you’re milage may vary depending on what version of reality you’re currently subscribing to. Some Helpful Advice It has come to my attention that there is a high level of concern over In-Person Voter Fraud. It has been suggested that patriotic citizens should take action and go to the polling locations and be on the look out for any individual that looks like they may be about to commit voter fraud. I commend these citizens for their commitment to the democratic process! These brave souls are risking life and limb to insure that the voting process is not tainted by malicious ne’er do wells! I wish these brave citizens the very best in their efforts to keep suspicious looking people away from the polls! To help in their efforts, I’ve compiled a helpful list of threats that may keep them from succeeding in their efforts. Be very careful while sleeping during the night before the election, as you are 56 times more likely to suffocate in bed than to witness voter fraud. Keep a firm grip on that soap while taking a shower as you are 40 times more likely to slip and kill yourself than witnessing voter fraud. You are also 177 times more likely to be killed by tripping down the stairs to breakfast. While eating breakfast, be sure to chew carefully as you are 91 times more likely to choke on food and die. Be careful as you walk out to your car as you are twice as likely to be killed by your neighbor’s dog (Bad Fluffy! No Kibble for You!) and 6 times more likely to be killed in a bee attack. Oh, it’s probably a good thing you took the day off from work for this, as you’re 112 times more likely to have a work related fatal accident than to witness voter fraud. Actually, maybe you should walk to the polling place. You have a 680 times greater chance of dying in a car accident than seeing voter fraud. But than you’d have to watch out for being killed by lightening (3 times more likely than voter fraud!) And once you get to the polling place, you better locate the nearest tornado shelter (533 times more likely to be killed by a tornado than to witness voter fraud.) One last thing, I hope you remembered to bring your shark repellant as you are about 3 times more likely to be attacked by sharks than to witness voter fraud. So, once again I commend these brave citizens as they are more likely to die a horrible death while looking for voter fraud than actually finding it. ", "title": "", "parent": "1553", "creatorid": "42bcb7639947", "id": "30ba8361a4df"}