{"name": "1559_16", "child": "", "content": "Where were the “9 terrible things”? Terrible is seeing your two toddler daughters gassed. Terrible is seeing your daughter’s arms and leg amputated because she got a disease. Terrible is dropping a drone on a wedding party of innocents. Terrible is telling Americans that their president was killed with a magic bullet. Terrible is nuking two cities full of women and children and old men in Japan when the country was ready to surrender. Terrible has nothing to do with what was mentioned above. But if you don’t like what this Trump and his minions are doing then STOP funding them. Stop financially supporting the Federal Government. Stop paying income taxes. I stopped 38 years ago because I refused to support the evils of the Federal government way back then. And the Federal government has only gotten worse. But a lot of you Snowflakes don’t have the guts to put your money where your beliefs are like us old time hippies. So you beg the government to do it your way and if they don’t you go to your safe places and color nice pictures instead of FIGHTING back. You can’t win if you are financially supporting your enemy. But you Snowflakes are in a catch-22. You want the Federal government to have the power and money force folks that may love liberty and despise tyranny to do it your way so YOUR religion of LGBTQ and government schools and unions and abortion on demand must be paid for by people that believe those things are morally wrong. And of course you Snowflakes also financially support the drone bombing of wedding parties and Doctors Without Borders and even 240 Iraqi civilians in Mosel recently and do it by paying those taxes. But what does that matter to you as long as a convicted murderer in California can have the government pay to change him from a rooster to a hen. And that illegals can have a college education funded by people you hate. You demand that other people pay for you and things you want. You want Federally funded schools. You want Federally funded medical care. You want Federally funded education clear through to the universities. You can’t stand to have your feelings hurt and so you want laws to silence people that may say that eating pizza on Thursday is evil…or whatever new insult to your religion has in vogue this week. You want the Federal government to force me to serve Socialists or aliens or Nazis that are also transgenders in my Coffee Shop no matter how it may offend me. You want the Federal government to close down stores like Hobby Lobby and Chick-fil-a. You want the Federal government to FORCE people to shop at Target or for the Federal government to make up their losses when Target is boycotted by folks that don’t want a man using the lady’s changing rooms. You want the Federal government to FORCE me to join a union so I can get a job. And you want the Federal government to FORCE people to have Social Security Numbers to work, but not one to vote. Well I don’t have a Social Security Number. I don’t pay Federal income Taxes. I don’t file 1040s. I haven’t filed in 38 years come April 15th. Why? Because I cannot support government evil. I cannot face God when I die and tell Him that I HAD to pay those taxes. If I did that, He would look at me and say: “But child, you lived in America, a country that was founded on the principle of Live Free or Die. A Country founded on rebellion against taxes. A Country that was founded on the principle that ‘voluntary slavery’ was so dreadful that no free man could tolerate it even if he had to take up arms against it. Therefore, my child, I must condemn you because you did not fight for liberty but you choose to be a voluntary slave to the IRS and the Federal government. And besides that, you APPLIED ‘voluntarily’ for a Social Security Number and you freely used to so that you could buy and sell. I told you that was the Mark of the Beast and you took it anyway. I am sorry child, but you chose evil and you paid for it by paying income taxes. Good bye.” Before you Snowflakes condemn me for being a whatever name or phobia you pick this week, know this. My brother-in-law used to be my sister-in-law. My daughter is married to a lovely young lady. This same gay daughter is my business partner. My grandkids are mixed including Black, Chinese, Polynesian and every European country you can think of. I am a former Vietnam war protester. President Kennedy is my favorite President and Dr. Martin Luther King Jr. is a hero to me as is Malcolm X. My adopted Special Needs daughter is Hispanic. I am not a racist or I would have to hate the very grandchildren I would die for. I am not homophobic as I have never been afraid or a homosexual and I don’t hate them either. Hate is a waste of time and besides…I love my daughter and her wife. In my business I gladly sell to anyone that walks through the door (except for known IRS agents…I can’t bring myself to serve such scum.) What I am is a man that loves and adores his wife (also a former Vietnam war protester that convinced me to stop filing a 1040 38 years ago), who believes in paying for himself and not having the Federal government pay for him. I believe in personal responsibility and that responsibility comes before a claim to any rights. Who believes that if you don’t like what a business does then you boycott that business but you don’t get the government to force that business to serve dogs or purple people or people that don’t dress appropriately or for whatever dang reason that the business wants to REFUSE SERVICE TO ANYONE. I support free enterprise not government force. So Snowflakes. If you don’t like the service you are getting from your government SERVANTS then stop paying them and take the consequences. Live Free Or Die! ", "title": "", "parent": "1559", "creatorid": "532615f15d7b", "id": "2aebeb39f6b6"}