{"name": "1560_7", "child": "", "content": "The “revolution” requires persons to be awake, and this “awareness” must be focused on “primary causes” not the effects of them, and YOU are 253 YEARS past, what caused this. The people that revolted back then, wanted to be “included” by those that gained CONTROL of the “then” colonies in 1763…..and the “colonies” has contributed “little” to the “victory”, and such things cost money and was for all intents and purposes, a world war fought by an aspiring “empire” who, while victorious, hither and yon, found themselves a bit pressed for “money”, back when money WAS MONEY. Some “colonists” had it good, after all those initial “thrusts”……and they managed to secure “holdings” that were “inherited”….and those “families” felt they deserved “inclusion” in the “aristocracy” that was “the empire”. Not only that BUT, this new and upstart “aristocracy” had been built on “slavery, land grabbing and speculation, and smuggling” and after this “consolidation” of the eastern seaboard of North America….they were looking westward and DROOLING!!!! BUT….the way west, did not belong to the “empire”, the mississippi and Ohio were its limits….spain was in florida and west, as were the french, and then spain again…..and it was a mess. Not there was not LAND available WEST of the colonies, and it was calling…..but it was occupied by the “indigenous occupants” and “the empire” chose to allow them to continue to occupy it, as a buffer…..it was exhausted and broke and it needed time…so Franklin failed in his petition for Pennsylvania, and reps from Virginia also failed. “The empire” also had no need for “slaves”, they had a sufficiently impoverished labor class to meet their needs….and they had already figured out that wage slavery worked, even with africans, so they began employing them as “soldiers” in the caribbean. ( and would do so after 1776 ) That left smuggling, and now that “the empire” had won, this too was threatened in that the costs of victory needed to be recovered, and smuggling hindered that…..so ultimately, the “ambitions” of the colonists were blocked across the board….so the revolution was not fought for the nobel cause of freedom, but for the thwarted ambitions of those who had been excluded from the “aristocracy” of empire, and the tyranny it imposed. The “tyranny” that threatened “slavery”. The “tyranny” that prevented western land grabs, land speculation and the genocide required to make it REAL. The “tyranny” that made smuggling of goods and slaves riskier. In short the thwarted ambitions of an excluded “aristocracy”, who….after victory, constructed a “government” to preserve it, while it pretended to be “something else”….and whose history is a continual effort to preserve that ambition. The “revolution” did not succeed…it simply passed control to “others” who sought the same result….they are now “the empire” and you are its victims. ", "title": "", "parent": "1560", "creatorid": "724b67f4ee2", "id": "69942db03d80"}