{"name": "1563_4", "child": "", "content": "I would agree about the corruption and if we go on past history the consequences of no accountability will lead to destruction, disintegration and even lower standards of everything we hold dear. When we talk about climate change it does not give the even bigger picture of pollution as a whole. The world is interactive. Most of us see it, hear it, smell it, taste it, breath it and feel it everyday. The majority of us had no choice but to survive. We know better now and should stay our path to correct and clean the earth. We have an underlying depression from attempting to understand it, accept it and our hand in it. This is the machine of the past that was built for destruction and war out of fear. We have become our own worst enemies. We are being poisoned on a large scale and even the healthiest of us cannot tolerate it. This is of our own self destruction and the costs are to high to even measure or be ignored. To replace the natural with artificial is not sustainable. The priorities and powers of the past must end if life is to survive on this planet. The greed and sadistic power that is being inflicted here has no concept of life and has no respect for it. I attempted to have an open mind and not judge out of respect, but have no way to be politically correct and state the facts. The political powers inability to understand that we see and hear them have already gone to far in their attempts to control the planet and when our lives are on the line the $$$ does not matter. We need the basics to survive. It is time to put the brakes on this insanity. The research should not be ignored and we should move forward as we do know better now and have better ways. We look at what has been done all over the world. Now here in this state of Arizona we see and feel this is an attack on our State and Country. The president of the united states does not own the State of Arizona nor do the representatives of this state. The people have the right to say and do something about it. The people and consumers have the power to redirect the actions being taken here. Hold this administration accountable for their actions of bad business and judgement. Take it upon yourself to contact your local representatives and let them know you will pull your support. Your local communities are being affected directly. Our business of the existing infrastructure that needs to be replaced or repaired is our priority. Rip or vote these people out of office who have filled their pockets and not taken care of the peoples business that they were paid for. They have filled their pensions and pockets and our courts with distractions away from the real issues. The lives of you and your children and the generations to come are still paying the price from the past. Let us move forward, listen and work together with what we had already started ten years ago. A better path for us and our children. We have the tools and in one voice the world had spoken to save and change the world. ", "title": "", "parent": "1563", "creatorid": "48eeb4a1bea9", "id": "a443f2393a50"}