{"name": "1567_10", "child": "", "content": "Does your math account for the number of eligible voters. Those who voted against those Senator’s elections? Abstentions? No. It does not. Here are some numbers for California. In 2016, they didn’t have a Republican on the ticket. California’s Senate primaries can have that result. The result was 61.60 to 38.54 with a turnout a little higher at 12,244,170 from 19,411,771 eligible voters. And the state population was 39,250,017. Harris won with 61.60%, but how many votes was that? 7,542,753. Out of only 12,2 million who showed up, out of a state of some 39.2 million people. That’s not even half. Not even close. And 7,167,601 didn’t even care enough to vote though they could have. Almost as many eligibles abstained as voted for the winner. Add the number of non-eligibles who could have registered and it’s a majority. And in 2012 Feinstein (D) and Emken (R) had similar results. 2012 was 62.5 to 37.5 with a turnout a little higher at 12,578,511 from 18,245,970 eligible voters. And the state population was about a million people lower at 38.6 million. Here’s the math. Feinstein’s number of voters was 7,864,624. That’s who chose her. 8 million of 38 million rounded up. That’s who she “represents.” That and her campaign donors not matter where they are. (And that goes for the entire Senate.) Of course using that method that will make the GOP’s numbers across the nation smaller as well. That doesn’t bother me a bit. And it will be a hell of a lot more accurate than this shitshow you’ve thrown together. Why should we count Harris and Feinstein as Senators with all of the state’s population behind them? When they only recieved about 8 million out of 39 million? The answer you must give while you all tuck in your chin and frown is this. “Well no, in our system the Senators represent the whole state. Based on who wins according to state law, so they have a right to count the whole population once they win. Right?” Right? Yes, right! Absolutely right. They do represent the whole state. The legitimacy of the system that you use to give them representation of the entire population of their state? It’s the same legitimacy that underpins the legislative system of the US Federal Governement, including the Great Compromise. All those numbers up there? They’re bullshit. The same crap you are trying to shovel. Exactly the same. In the system we have, 2 Senators elected from each state make up one house of a bi-cameral legislature. Little states get some protection against big states in the Senate. And big states take their advantage in the House where they get more members. It’s a compromise. Forgot what that means? Look it up. Hint: it’s the oil that makes the machinery of government possible. Those numbers you thew in Google Spreadsheet? The disparity they show? It’s on purpose. It’s a working compromise as old as the country. Stop passing off one of the greatest features of the US legislature as a bug. It’s a feature. And you know it is. Which is why you pretending to have discovered a discrepancy is so disingenuous. Thinkprogress? Sure. Yes. I love progress. But for Effs’ effing sake. THINK first. ", "title": "", "parent": "1567", "creatorid": "9d55db1a5b59", "id": "71ca57e06685"}