{"name": "1568_3", "child": "", "content": "I find it fascinating, that with all the current attention regarding the judicial branch…the fact that two of the authorized types of law permitted by Article 3, those of “law and equity” which were altered completely (in 1939 ) and effectively removed ( in 1958 ) seems to have escaped the notice of EVERYONE who claims a pretense of “expertise” regarding the “laws” that now govern and oppress us. ( rendering any references to ‘constitutionality” of this or that law or action as meaningful as references to “democracy” when alluding to the type of government that was originally intended or in describing what presently exists. ) While the ignorance of this fraud is understandable since great pains have been made to deflect and distract from it, its initiation and maintenance would not be possible without the direct complicity and SILENCE of the “judicial” branch…..those entrusted with the protection of YOUR “rights” and the integrity of the “constitution” itself…..whose present condition even when compared to the possible extreme interpretations of the text, that only a complete “willfully ignorant, functional illiterate”, would not note the glaring inconsistencies that surface immediately as well as the complete in-congruence of “precedent” pre vs post 1939, as well as the complete disregard of the former rights in favor of the latter fraudulently induced, voluntary acceptance of the “benefits, privileges and immunities” you now enjoy. The naked emperor has been in place and in full force for everyone to see for almost six decades and its victims remain completely oblivious that they are one document away from the complete dismantling of the facade the ‘corrupt and corrupted” have built, whose final solution is the disposing of those who no longer serve a useful purpose in the exploitation that civilization has made possible since it first took root 8 to 12 thousand years ago and whose future is limited to a couple of centuries or less, unless the evolution of the moral arc of the living takes hold and replaces the biological imperatives that still drive and control our existence as well as occupy our minds in ever more creative forms of denial, to escape the simply inevitable logically reasoned and inescapable conclusion. This IS the point of it all. ", "title": "", "parent": "1568", "creatorid": "724b67f4ee2", "id": "38c0395c8249"}