{"name": "1570_5", "child": "", "content": "Democrats and our esteemed liberal thought leaders are going to have to rethink outsourced trickle down environmentalism for the next four to eight years. Under Trump the best case scenario is that environmental nonprofits as NGOs for first world countries will be flush with cash for legal fights and communication pushes. Clean and green technology will keep up with economic growth and curb emissions along with keeping our land, water and air clean enough to be habitable. The worst case scenario is environmental nonprofits will be flush with cash for legal fights and further communications. Clean and green tech will probably do pretty darn well under Trump. Given Trump’s growth demands of 4%/yr, it will pretty much do nothing but move green tech units. Land, water and air (and global temperature) will degrade further and further and we’ll be kept deeper and deeper in the dark about it. Clean and green technology, as marketed now, is really just about wind, solar, EVs and vehicles autonomization. Land, air and water quality, the stuff EPA and state agency did, never seemed to interest our tech titans and esteemed interest groups. Except when poor folks of color were needed for an outreach and marketing effort. Then we heard all about environmental justice as a means to sell more units of clean and green technology as mentioned above. Like when Environmental Progress of Illinois helped get Exelon a taxpayer and ratepayer bailout of its nuclear plants. We heard all about climate change and poor folks getting electricity regularly. Folks of Illinois didn’t like the third bailout of nuclear in 40 years so that’s where other environmental NGOs and nonprofits came in to sweeten the deal and attach wind and solar on the bill as a rider. The bill went through and rates are going up. Many folks will blame environmentalists before blaming Exelon. Governor Rauner will cut Illinois EPA’s budget even further — justifying it by saying environmental nonprofits will pick up the work for free. We might want to get the interest groups interested in pulling us out of the environmental protection ditch to explain why we ran into the ditch in the first place. Then work to back us out of the ditch. Daily blog posts from environmental and liberal leaning groups on how screwed we are under Trump will eventually get tiresome. Especially when there will be a whole host of other things reminding us how screwed we might be. It’ll become issue triage going forward. ", "title": "", "parent": "1570", "creatorid": "ed8af1058fe7", "id": "17984119bc7b"}