{"name": "1612_3", "child": "", "content": "“It’s clear who the majority of the public would blame for an Obamacare meltdown. According to a Kaiser Family Foundation poll released this month, 61 percent of the public say President Trump and Republicans in Congress are to blame for future problems with the ACA, since they are in control of the government.” Considering that the slimy GOP blocked a national healthcare insurance program for 60 years and tried every trick in the book from over 60 bills to shutting down the federal government so their healthcare benefactors could continue to gouge and cheat customers as they did under Bush-Cheney when healthcare costs rose by 63% and insurers and healthcare provided cheated customers and padded bills. We saw what the GOP came up with while they lied, lied, lied about keeping and expanding coverage, lowering costs but in reality would have cut 24 million off healthcare, vastly increased costs while reducing coverage just to give their rich healthcare benefactors over $664 billion in tax breaks while cutting $880 billion from Medicaid for the poor. The GOP are truly evil who sold their souls for money and are the pro-rich, anti-poor, anti-worker, anti-consumer, anti-environment, anti-science, pro-war-mongering, war-profiteering GOP that have historically NEVER represented the working class. The GOP have created most of the problems that Americans face today: the crippling National Debt (which was below $800 billion through Carter); the Wall St. banksters’ subprime mortgage loan fraud caused by GOP-created and passed deregulation; the endless Middle East oil wars; the shipping of jobs overseas or to Mexico from corporate greed and GOP tax incentives, automation, the GOP’s corporate “inversions,” and NAFTA crafted, promoted and passed by the GOP NOT Democrats. Hypocritically, the GOP have shipped more middle-income jobs to Hispanics in Mexico than undocumented immigrants have ever taken. It is the GOP who are the enemy of the people and mankind having killed more innocents than terrorists while promoting fossil fuel pollution of the planet all for profit. The GOP will drag down their supporters with them in the end. Good riddance. ", "title": "", "parent": "1612", "creatorid": "1172df96f278", "id": "15208eb5aaa0"}