{"name": "1617_13", "child": "", "content": "The worst thing about this was the rejection of your son as a donor. That needs to change. I cannot believe they wouldn’t allow an adult to be a donor in any capacity. He can vote. He is a legal adult. Why , oh why, could he not save his mothers life? This was heartbreaking . Thank you for sharing . As a Nurse, I’ve known our healthcare system is broken for a long time. It’s a system based on greed, just like every other major industry in America. If you don’t have money , you probably won’t stay alive when you get sick. I really believe that every problem with the Healthcare industry can be traced back to greed. Somewhere, somehow. The insurance companies make it so hard for so many people. It just doesn’t make sense. For example. Needing to be 21 to be a living donor. In my head I’m thinking that’s about lawsuits . But who knows? I am so so sorry. I don’t feel like my country cares about us. The people, the families. The lives. Individual lives that are living with the systems they created. It’s not just our healthcare system that is broke. It’s every system that is here to service the people. Isn’t that weird? Healthcare is supposed to be for us. It’s to take care of us. It’s for us. Easy to forget. Because I can talk to anyone that’s ever been sick or had to try to take care of the sick, and we could all swear we were here for them. It was about us meeting their standards. Us playing by their rules. Us having to work for them. Not the other way around, which it should be. I hope that one day , America won’t be broken anymore. I hope that one day, businesses and industries serve the people, not the people serve them. I hope that one day people wake up and fight , fight to abolish the policies that allowed the machines ( businesses) to take over. That we take our country back, and create systems that work for us. My heart goes out to all of you. She was a beautiful woman. We lost a light. ", "title": "", "parent": "1617", "creatorid": "6b0195a1ac60", "id": "2c0f81468dac"}