{"name": "1617_4", "child": "", "content": "First, sorry for your family’s loss, Brian. I too lost my wife while waiting for an experimental liver transplant in Illinois. She was 40 when she passed away leaving two young daughters. My wife had the same pancreatic cancer that Steve Jobs had and he received a liver transplant during the time my wife was diagnosed. As a result, we had hope because cancer patients rarely are permitted to get organ transplants. Our emotional roller coaster of false hope while while watching my wife’s health decline eerily parallels your experience, Brian. Your post brought me right back to those emotions I hadn’t felt (because I tried to forget) since 2009. Your article is a gift of guidance to those contemplating an organ transplant. The key is to move quickly and speak to as many medical specialists as possible to get tips on how the system works. Read as much as you can. The organ transplant system needs to be “worked” by virtue of it’s byzantine rules and opacity of the process. As you point out, the system is fraught with delay. Keep in mind, it is not the medical staff to blame. The system is broken based on regulation and a very real fact that there are too few donors. Changing the System: Every several years or so, the national media will report on the broken transplant system. Little change results. Why? First, the system is fragmented mostly by state or region. Second, non-medically trained laymen like you and me can be overwhelmed and intimidated with medical and legal minutiae (often intentional) to keep us out of the system. Finally, the constituency to work for change is small and fragmented. Once you’ve lost of loved one waiting for an organ transplant we move on to work on our grief and emotional exhaustion from the experience. I am far enough along in guiding my family and working on my own grief that I am ready to join the fight for change. If someone reading Brian’s post can share information on groups lobbying for change please share contact information in the comments. ", "title": "", "parent": "1617", "creatorid": "55473ee582d0", "id": "daedb06e773c"}