{"name": "1619_3", "child": "", "content": "First, great that you’re doing that — what’s the organization? If you’re part of an advocacy organization I assume you have experience in persuading candidates and elected officials. As such, most of my advice is probably old news, hopefully with some new insights. Campaigns are about accumulating votes. If something will help accumulate votes, candidates will consider it, if something risks costing votes candidates will reject it. Like most of the rest of us, candidates overweight immediate risk and underweight potential long-term gains. It is also true that one cannot be “more” elected — once a candidate feels like s/he is in a good spot politically the instinct is to not do anything at all out fear that any action will cost votes. If all this is right then your best play is to make bipartisan Medicaid expansion politically safe. Which votes will a candidate lose by not agreeing with you? Which constituency or group that the person needs would be threatened by not supporting your position? Find those people and their reasons for supporting the position (those might not be your reasons, that’s fine, let people agree with your conclusions even if they don’t agree with how you came to them). Then get that group to reach out to the candidate. Which ones could be gained by supporting you? Do the same. If your group is only interested in activating millennials, then you somehow need to persuade candidates (I’m guessing mostly Republicans) that you will vote for them if and only if they support Medicaid expansion. That’s a heavy lift. It is broadly true that youth don’t vote, and every few years a new cohort of politically active younger voters will show up and say “this time it’s different” and it almost never is. It might be different this time, I hope it is, but historically the youth vote is far more smoke than fire. An added bit that builds on the last point — As you know, your demographic (or as those of us a bit older shout from our porches “kids today”) doesn’t have a great reputation. It’s an unfair stereotype that I don’t buy, but I’m not the one you have to persuade. By defining yourselves as millennials you have said “this is us, we are not you” (one function of group identification is to clearly identify everyone not in the group — those not in the group “just don’t get it”). By saying that you are different than, or other than, the candidates and other voters you are marginalizing yourselves from the start. If you aren’t already, you might try to bring your group together with others, add a little extra oomph to an effort or group that could use it. In the case of Medicaid expansion it might be interesting to work with seniors groups for example. Makes an interesting political story, they vote, you have energy and tech savvy, they give you credibility, etc. Would Medicaid expansion help combat the opioid epidemic? If so, find groups working on that and coordinate with them (law enforcement, parents’ groups, first responders, etc.). Finally, don’t rant. Don’t threaten. Don’t dress up like a rat and stop traffic. All that stuff just pisses people off and defines you as an irritant. You want to be an ally, someone who can deliver good policy and good politics. Be an extension of their team, not sand in their shoe. Finally finally, if you haven’t already you should reach out to Chris Hurst’s campaign in Roanoke, I think he could be a supporter and could use the help to get elected. This is a bit of a long rant, hopefully more useful than not. I’m at ploge@peterloge.com if you want to talk more. Good luck. Peter ", "title": "", "parent": "1619", "creatorid": "b40cc9e00858", "id": "b6de9726508e"}