{"name": "1621_4", "child": "", "content": "Cara, que texto! Eu cheguei a rascunhar alguma coisa assim logo após a polêmica do PewDiePie, mas acho que seu artigo é mais direto e, consequentemente, agressivo. Como você, eu acho super positivo e oportuno o Youtube ser responsabilizado por aquilo que viabiliza na sua plataforma. E o fato das empresas começarem a tirar seu dinheiro de influenciadores instáveis ou que tem um conteúdo duvido (para crianças) significa que eles estão, no mínimo, olhando para os produtores. Eu vejo isso apenas como consequência do amadurecimento da plataforma e de seus produtores. Já li alguns livros sobre mídias tradicionais e seus conflitos com as digitais, e quase sempre os autores falam sobre um ciclo comum entre as mídias1. Primeiro, alguma tecnologia recém-desenvolvida facilita a divulgação de determinada mídia. 2. Depois, os detentores da atenção popular negam a popularidade da nova tecnologia, afirmando que isso não vai pegar (normalmente apostando em comportamentos anteriores à entrada dessa mídia). 3. Os primeiros usuários criam uma relação forte com a mídia, a tecnologia e seus produtores de conteúdo. Acho que tem a ver com o fato de que os recém-chegados tendem a ser mais abertos e transparentes (devido a ausência de empresas). 4. Finalmente a mídia é aceita pelo mainstream (e assim entram os patrocinadores) 5. Há um embate entre os primeiros produtores (seus costumes/linguagem/técnicas) e os novos. As possibilidades se expandem — graças ao dinheiro — e aqueles incapazes de se manterem relevantes e populares caem. 6. Por fim, os limites da mídia são testados, alguns padrões são estabelecidos, o dinheiro infinito (vindo da promessa de que essa tecnologia do futuro acabaria com todas as outras) acaba e um equilíbrio entre produtores populares e de nicho se estabelece. 7. Entra uma nova tecnologia….. Claro que isso foi BEM resumido, até porque essa resposta está ficando muito longa e vaga. Mas, ao que me parece/espero, estamos dando os primeiros passos para o equilíbrio entre conteúdo popular e conteúdo de nicho. Por outro lado, ainda me questiono: e se esse tipo de conteúdo continuar fazendo todo esse “sucesso” com os jovens, o que as marcar e o Youtube farão? Tipo, e se o que as crianças realmente querem ver o TazerCraft jogando um bilhão de mods de Minecraft ou vendo o Lucas Netto se empanturrando de comida ou vendo essa galerinha aceitando desafios (como uma maneira de ver adolescente e adultos realizando desejos infantis) — independente do incentivo em produções mais responsáveis como o CrashCourse? Eu quero pensar que o público eventualmente perceberá as limitações destes conteúdos, mas e se eu estiver errado? A plataforma e as empresas vão ignorar as possibilidades de lucro pela ética? E como os pais farão, ou fazem, para voltar para o jogo? Proibindo? Educando? Como? Puts, acabou saindo um textão….Foi mal. hahaha Parabéns pela análise. Onde eu assino? ", "title": "", "parent": "1621", "creatorid": "11e243d8b172", "id": "904702917577"}