{"name": "1639_20", "child": "", "content": "If you guys think that “Fake News”, or anything besides Hillary being horrible candidate, caused Donald Trump’s win, you’re missing the point behind the election. Consider: ) Trump couldn’t have won without converting Obama voters.Trump couldn’t have won without the support of women.Trump couldn’t have won without the support of Blacks and Hispanics.Trump couldn’t have won without the support of young people.Any mention of WikiLeaks is strangely absent in all of these “Fake News” discussions. It wasn’t fake news that killed Hillary. It was a peek behind the curtain at a person who was clearly in bed with the banks, seemed like she wanted to start a war with Russia for some reason, was openly and proudly two-faced (us regular folks just call it lying), and was taking money from the same people that are back ISIS. The only reason this was surprising to a number of people is because you were watching MSNBC and CNN, and Fox. All the pundits were inside the Washington echo chamber saying, “Yup, this one’s in the bag”. I even heard CNN talking about Hillary’s post election plans when the election was 2 weeks out. We need look no further than CNN for “Fake News”, I saw: ) A CNN anchor coaching a focus group to give pro-Hillary comments on a live mike) A CNN anchor say openly that they were Hillary’s “best supporters” and gave her a “free ride”) A CNN Camera man pose as a protestor until the anchor, who wasn’t in on the joke, threw him under the bus) The New York times publish a glowing review of a Hillary town hall, where a little girl with a Red Ribbon in her hair commented how devastated she was at Donald Trump remarks, neglecting to mention that she was the daughter of a Democratic Congressman and major Hillary Supporter. In the NYT opinion, The little girl’s question just “…seemed to speak to her strengths as a candidate”. It did. Because it was STAGED. So now the media is claiming it’s the Apocalypse, and that there is a fake news problem. There actually is, if by “Fake”, you mean that the content is getting to people without a major media company controlling it. Boo Hoo. ", "title": "", "parent": "1639", "creatorid": "4f2b7d387d1d", "id": "ca3c7e60b5c"}