{"name": "1639_11", "child": "", "content": "This is great thank you! The problem I am seeing is that my friends and acquaintances on both the left and the right believe that their beloved “alternative” news sources are being attacked. For years I drank the liberal cool aid and believed any information source that confirmed my biases. In trying to defend my biases I began educating myself and doing more investigation and learned that we are being deceived and manipulated on all sides (for me this began with examining the supplement industry and the anti-vaxers). The same people that argue against the science behind vaccination and the fight against disease vectors such as mosquitoes, argue vehemently for the science of climate change yet don’t see the contradiction! I have a friend that tells me there is no point in trying to discuss it but I feel like it is imperative to keep working on these media and information literacy issues in order to heal these divisions in our political world and in our philosophical beliefs. These issues are as dangerous to an individual's health as they are to our political and cultural health. I am currently working towards a Masters in Library and Information Science, focusing on data archiving/management and health/medical librarianship. Last night a friend, who has just been diagnosed with early stage breast cancer, was telling me about the treatment research she is doing on the internet. To clarify my concern: her other internet research has led her to scientific “evidence” of creationism that she uses to supplement the education of her elementary school class. I told her to please send me anything she finds and that I can research it for her, especially since it is exactly what I am working on in my classes this semester. She seemed doubtful, probably remembering our conflict over the science behind creationism a couple of years ago…I’m frightened for her and I’m frightened for our country. Yet, I am also concerned that by filtering for false news, we just feed into the censoring claim. How can we both fight the fake news sources and teach people to trust authority again and who’s authority do we trust? If each individual has to define authority and learn what is “real” and what is “fake” for herself, how can we come to any agreement on the nature of our reality in general… ", "title": "", "parent": "1639", "creatorid": "2a6bbb493e03", "id": "183cca36ad6a"}