{"name": "1639_5", "child": "", "content": "If you have a problem with SNOPES then you have committed yourself to a cynical world that is probably just as insular as someone who doesn’t care about the truth at all. The issue with the valididy of a given atricle or meme (journalistic or otherwise) is not bias, per se; rather, the problems lies with those who deliberately hide their bias. When you pretend that a distorted version of reality is objective realty so to create interest it is wrong. That’s why we cite sources and further reading. Honest people want others to know our bias when expressing our opinion. We support our opinions by deliveing facts. We readily offer these facts up to scrutiny. One can find out if SNOPES is biased simply by researching their sources. They offer the facts that they can provide up to scrutiny. Why would someone need to go to SNOPES to research a well-documented article? Because the item you are researching isn’t making the same offer. I’ll speculate further… the item that you are researching is probably making a somewhat outrageous claim and it probably contradicts your values and beliefs. Even if it is outrageous, if it doesn’t contadict your beliefs you won’t research it. By this rationale, those who claim here that SNOPES is biased are charged not only with providing evidece of such bias but a well-documentd analysis of the nature of that bias (What are they for? What are they against?) and you would need to provide a well reasoned account of why you think this is a problem. Such an investigation, if valid and relevant, would lead to replication. Others would agree and publish their own well-documented support of your findings. Ultimately this would lead to debate and possibly some reform… that is, if these problems that you point out about SNOPES turns out to be valid and relavent. A couple years ago I shared a meme that was supposed to be a quote about true friendship by Robin Williams. A couple days later I saw a meme warning against the possibility that many memes are mis-quoting those whom they appear to reference. I immediately researched my Robin Williams meme and found that it was, in fact, Williams who said the words in the quote; however, he was performing in a film that was written and directed by Bobcat Goldthwaite. I still don’t think it’s fair that Goldthwaite doesn’t get the credit he deserves for this insightful statement. Am I biased in revealing the “truth” or “the whole story?” Is the meme in question “true”, “mostly true” “mostly false” or “pants on fire?” It really doesn’t matter. Once you realize what’s going on everything resolves quite nicely and you are free to alter your opinion if need be. Is the Robin Williams meme relevant? Probably not. But when confronted with information like the “electorate vs. crime rate” map above being misinformed can have serious consequences. This is a story about how I engaged the material (i.e. a silly Robin Williams meme). If material is important to you it deserves to be engaged. There is no machine that can do critical thinking and form opinions for you there are only devices that can help you. This article is a great place to start. ", "title": "", "parent": "1639", "creatorid": "b9843649a253", "id": "e8396906f075"}