{"name": "1639_13", "child": "", "content": "Great post, Tim. For a while, Facebook did flag stories that were likely hoaxes, and would post a “Recommended story” underneath that linked out to Snopes. I haven’t seen one of those in a while, so they may have ceased doing it…or I just don’t have enough hoaxes in my personal feed. (See: here, from Jan 2015, with screenshot— a tacit acknowledgement that there was a “fake news” problem almost 2 years ago; here, 2014, specifically focusing on “satire”) But you said something else interesting in here, that I think needs to be further examined in the context of this topic: “Most people would find the FBI to be an authoritative source.” In our examinations of the social media behavior of conspiracist groups focused on individual policies (rather than partisan politics), what we find time and time again is that fundamental distrust in the authority of “mainstream” or “government” sources is precisely the driving force behind their impetus to share these types of propaganda. The anti-vax movement, for example, firmly believes that there is a vast conspiracy at the CDC to cover up the smoking gun linking vaccines to autism ; any CDC or related government-health data saying otherwise is lies. The mainstream perception that the CDC is an authoritative voice is exactly what they are trying to dispel in their extensive “citizen journalism” social-media efforts on Twitter and Facebook. We’ve seen this in other groups as well, focused on the EPA, the IRS, the Federal Reserve, etc. Levels of trust in institutions are at record lows. The idea that there can be an authoritative source is what is under attack by the groups that are mostly likely to share this type of content — the media is biased, the government is lying, “they don’t want you to see this!’, etc. Google has an advantage over Facebook and Twitter because they can authoritatively rank content in such a way that does not feel like someone is being personally “censored” when the algorithm choses not to amplify their share; on Facebook and Twitter the experience is much more firsthand and direct. So this is why we need to push back more when Facebook and Twitter say things like “What is truth?”, even if the idea of being an ‘arbiter of truth’ is initially uncomfortable, there are better ways to address the issue of propaganda than what we have now. ", "title": "", "parent": "1639", "creatorid": "306b74344e83", "id": "66846ed4615d"}