{"name": "1670_20", "child": "", "content": "Being dissatisfied with the day-to-day is a gift. It is your intuition telling you something needs to change. I’ve enjoyed your writing Preethi. I also have made some transitions in my career that others around me found hard to understand. So I found myself nodding reading your piece here. I have also just initiated my first startup. It’s an exciting time but also with plenty of opportunities to fail. I lost my job a few years ago. Despite strong credentials and lots of experience as a chemical/environmental engineer, the job market was poor and it took me 12 months to find another position. As the sole earner in our family and with the bank balance diminishing every day, I know now what it feels like to fail repeatedly. But the experience of failure has taught me some valuable lessons. Unlike in school or university, where failure is an unqualified bad thing, failure in life often comes with many positives. Like lifting weights makes your muscles stronger, failure strengthens your courage. You soon realise failure isn’t that bad. You realise you can take chances and that the cliff you’re leaping from isn’t as high as it looks. And let’s face it – even if a new project or company fails, you got to do some cool work, broaden and deepen your skills and have an opportunity to make a living along the way. These all stand you in good stead later on. How often do you hear of success rising from the ashes of a failed venture? I think that’s because of failure, not despite it. I learnt to do freelance consulting during my 12 months out of work. I liked it so much I now am now self employed with my own consultancy. It’s something I never would have done if I’d taken the conventional job path. And now thanks to the lessons of failing, I have the determination to found a new business, using big data and machine learning to increase the energy efficiency of big industry. It’s not high stakes and the consequences of failure are fairly low. I’m so fortunate to have been through the ringer so I can see the opportunities around me rather than the pitfalls. Keep up the great writing Preethi. I look forward to reading about your startup and perhaps one day reading your book when it comes out. ", "title": "", "parent": "1670", "creatorid": "636525b2bd7c", "id": "9a06d358de84"}