{"name": "1670_6", "child": "", "content": "I graduated with a degree of Electronics and Communication. I didn’t put myself through pursuits of ideas (the subjects were made so tedious by the bland methods and passion of teaching, that it felt naturally hard to feel inspired to make something). I had a proclivity for mathematics and physics, but I gave in to the engineering race that is omnipresent in India. I didn’t explore options, I didn’t take my own time to decide upon what I could be good at doing (and only now I realise that it doesn’t have to be one thing for life, I could get good in multiple things). Problem is, as I’ve only recognised after this Paul Graham’s essay, that high school students all around the word give in to What do I dream of, what am I passionate about, when they should be thinking about what hard problem should/could I solve. I left my front end engineering job a couple of months back. It was my first job. I wasn’t paid as much the entry industry average, no fresher in the company was. But the open desk, open minded culture, took me in, and I was all up for learning things. I met stupendous people, people I’d cherish for life of what they’ve given me, chance to learn at my own pace, even under project deadlines. This was really really rare! But because of my personal inclinations and purposes, about what is important and what is not, I realised for myself that there was just too much importance given to pretensions that embellished working for clients as problem solving. Most of the days, it was people trying to cover their work up, trying to get out as soon as possible, except some (half of which were driven by peer appreciation and promotions). Only a hand full of people were actually keen on solving problems (and not just pursue ideas for the sake of how fancy doing it sounds, which is sometimes fun by the way). I’ve never been a problem solver. The fact that I wouldn’t dare discuss questions with my friends after exams was a testament for me. I’d run away from hard problems. This all changed when I had to leave job partly due to some family obligations, and partly because of the above mentioned realisations. I’m giving myself deadline challenges (it’s so fun to not answer calls, and attend meaningless meetings, and be answerable for that test template that ran in production). Not to get me wrong, working on big projects like you told in your medium article, helps learn so much about infrastructure, deployment and build jobs and cycles and the like. But let’s just say things were a little weird (and I can’t stop repeating the fact that working on the project that I did, was the greatest thing that could happen to a aimless, hopeless person with no skills at all. I was given a chance to work on cutting edge technologies, solve small problems). My current deadlines include making a google extension for curating links from people for my weekly literary/arty newsletter, the details of which are in the following small talk. The google extension uses firebase auth, database for storing links, people would share of the tab that is opened when they hit a send button. LOL: Weekly (List of Lit) Links, A Curated Literary NewsletterLOL ( Weekly (List of Lit) Things ) is a weekly curated newsletter containing literary articles, poems, spoken word…medium.com 2. Make a portfolio website with funky performant animations for a graphics designer. 3. Solve the alumni problem for my college (I’m thinking Vulcan.js is the fastest fit for it, but I don’t know yet) [Also it’s amazing how every college has so so so many and diverse problems just waiting to be solved by software engineers] [Rant Over] ", "title": "", "parent": "1670", "creatorid": "1c75f287d357", "id": "131b6d7cf235"}