{"content": "I just saw the comment asking for evidence that we’re conditioned to hate our bodies. Though Google is your bff in this situation, I just did research on this last year so what the heck, I’ll give you some resources. Common Sense Media conducted a research study in 2015 entitled “Children, Teens, Media, and Body Image” that revealed disturbing things like children as young as 5 being dissatisfied with their bodies. Here’s a link to their full report that’s free and ready to download: https://www.commonsensemedia.org/research/children-teens-media-and-body-image Here’s a link to their highlights, though these won’t tell you their methods of research if you’re skeptical about them: Children, Teens, Media, and Body Image Infographic | Common Sense MediaJanuary 20, 2015 Children, Teens, Media, and Body Image is a research brief from Common Sense Media. In this report, we…www.commonsensemedia.org Also: “Body Dysmorphic Disorder affects 1.7% to 2.4% of the general population — about 1 in 50 people. This means that more than 5 million people to about 7.5 million people in the United States alone have BDD.” — International OCD Foundation. If you don’t know what BDD is: Body dysmorphic disorder (BDD) is a complex disorder characterized by extreme concern about one or more perceived defects in one’s physical appearance. Due to the belief that they look “hideous,” individuals with BDD suffer from overwhelming distress and can have trouble focusing on anything besides their perceived defect(s). This contributes to a severely diminished quality of life, and in extreme cases, BDD may lead to social isolation, repeated hospitalization, and suicide. Here’s a link to the info: https://bdd.iocdf.org/professionals/prevalence/ Here’s a cool article about it: http://www.concept-magazine.com/master-posts/2016/9/26/body-dysmorphic-disorder So, even though you are in control of your body to an extent (syndromes, diseases, disorders, and simply genes play a large role with weight gain and loss), there is money to be made in fat shaming and general body shaming so there is conditioning. When we’re told body hair on femme individuals isn’t sexy, we buy razors and shaving cream. When people of color are told that European beauty standards are ideal, they buy skin lightening cream (It’s an epidemic: http://boldandfearless.me/is-beauty-really-only-skin-deep-exploring-the-skin-bleaching-epidemic-in-africa/). When people are told that being fat is awful and will lead to the worst life ever, they decide they would rather be hit by a truck than fat (Tri Delta report: http://www.cnn.com/2010/LIVING/10/21/no.fat.talk.week/) and will do anything/buy anything to avoid it. Also, this article is fab! ", "child": "", "parent": "16", "title": "", "creatorid": "97164de956af", "name": "16_7", "id": "879e2805c148"}