{"content": "NO! No! nO! no! “We’re all conditioned to hate our bodies. “ — what empirical evidence can you show me to prove this statement? What complete and utter rubbish you spout. It would be difficult to envisage a statement that is any more incorrect that the one above. You have your body and you have your mind and the two are interconnected. If you take the time and effort to look after, to nurture, to train, then you are better placed understand just how spectacular the bodies. If you throw complete rubbish and junk down it, if you poured salt and diesel into a petrol engine would you expect to be setting a new land speed record? The same principle applies. Junk in — Junk out. To be quite honest I am furious that you would publically talk such tripe. Can you link to me empirical evidence that tells us that we are conditioned to hate our bodies? That is such an nonsense statement. We are in our bodies and sometimes they are not manufactured very well, most of the time it works just fine yet as was with any piece of machinery if you look after it, then it will last you exceptionally well for many years to come. Furthermore, if you expect more from your machine, and “feed” it correctly and give it the training and conditioning it needs it will take you places that you never envisage you might have gone, and that is a testament to the effort you put in and can thus take out. Mia Culpa. And if you think age is barrier, you only have to look at professional sports people, typically the older they get the more focused they become about looking after and maintaining and training the machine such that they can keep reaping the benefits and the performance and the joy into an older age that might not otherwise be expected. This takes effort. This takes you taking an active interest and understanding that your car does not take diesel but petrol and does not appreciate having salt poured into it feel tank. We are born with it pretty much a clean slate such that ones’ environment and DNA fashion how your body developed over the years. Stop making nonsense excuses for “hating” your body, you are your bod. To state that: “We’re all conditioned to hate our bodies” is so fundamentally incorrect as to be almost laughable. ", "child": "", "parent": "16", "title": "", "creatorid": "117796e06b4a", "name": "16_9", "id": "ba3780fa552a"}