{"name": "1735_3", "child": "", "content": "Ben, Long time fan here. I appreciate the general vibe of this article from you, but I wanted to voice some counterpoints from my own experience. I’m very curious to hear your perspective on them. For much of my life (27 years to be exact), I spent my entire being loving everything except that which was myself. The concept of Self-Love did not even register into my psyche; I had no idea it was a thing. I devoted my life to loving my family, my friends, my passions, my “purpose”… everything except me. Throughout those 27 years of my life, I would continue to go through cycles of joy and pain, glory and tragedy, inspiration and apathy, ups and downs, but always ending at the same point — “I don’t know”. It was driving me crazy, and I would beat myself up endlessly over it. I love all these people, all these things, and I devote myself to them, but I wasn’t happy, wasn’t content, and I didn’t know why. Why, why, why…?! It wasn’t until I read the book “Love Yourself Like Your Life Depends On It” by Kamal Ravikant, and practicing the methods written within, that my life began transforming into its full manifestation. Life began moving in fast forward (Slipstream Time Hack!), and over time I finally realized what my true purpose is, my Personal Legend (as per “The Alchemist”). And through those realizations, the entire context of my life finally came into full clarity and now every move I make falls into alignment with why I’m truly here. I’m no longer searching, no longer doing… I am now being. I would never have reached this point had I not decided to Love Myself unconditionally, as realizing my Personal Legend was the result of ruthless self-exploration stemming from Self-Love, and achieving my Personal Legend will be the final manifestation of Loving Myself. Now there’s no doubt as to why I love my family, my friends, my passions, my purpose.. It’s because I Love Myself. It is simultaneously the most hedonistic and most altruistic thing you could do. To me, Love is like the Sun. From our point of view, all we can see and feel is the Love and Light that resonates from its very being, giving us life. However, at its core, the reaction is consistent, undying, and very much internally focused. Love invigorates all, including the Self. In fact, without true Self Love, you are but a shadow of who you can really be. This is my experience, and I’m curious to hear your thoughts. Self Love is not to be confused with Selfishness, Narcissism, Egotism, and Self Absorption (which you may be hinting at in your article), because those caught up within those concepts remain attached to the drama that is associated with them. When you truly Love Yourself, you refuse to consciously expose yourself to the cycles of drama and pain, which is the result of attachment to those concepts. True Love of Self consequently leads to full acceptance and surrender to that which is, which includes not only the self, but the entire universe and everyone/everything within it. Love is love is love is love… Hope to hear from you brotha! Victor ", "title": "", "parent": "1735", "creatorid": "ad2c645914dd", "id": "9d476c5eb62d"}