{"name": "1767_5", "child": "", "content": "“What do we do when tools founded on openness and freedom are used by straight-up bad actors? … Creating online communities where all groups can speak may mean scaling back on some of the idealism of the early internet in favor of pragmatism. The diagnosis here — that bad-actors are co-opting the language of the left and of free speech defenders while making online spaces toxic — is spot-on. So is the sentiment that we want to encourage marginalized peoples’ voices and provide for their safety. However, we can call for limits to hate speech and harassment without bashing the values of freedom and openness. That’s why this article’s call for ‘pragmatism’ is so shallow, if not outright dangerous. If we’re going to stand for inclusivity, we should be advocating for openness and transparency, not deriding those values and handing over the regulatory reigns to technocrats. Now, free speech and progressive ideas have always co-existed uneasily. Have they? This statement is some lazy historicizing. It misses how key free speech cases like NYT v Sullivan enabled civil rights leaders to speak truth to power. It’s woefully U.S.-centric, not taking into account a global context where free speech is the driving force for dissent. I found this article’s leitmotif that suggests a free internet is somehow at odds with progressive ideas to be really concerning. Silicon Valley may have co-opted the rhetoric into their corporate logic, but the idea to empower people with the ability to speak is certainly progressive. Well, that’s all well and good, but Reddit is not a government. It is a corporation. In the US, the right to free speech applies only when the government attempts to limit what people say … Content moderation by private technology companies is not a First Amendment violation; in most cases, it’s just a matter of enforcing pre-existing Terms of Service.” On any given day, more than a billion people access Facebook. Activists and protesters use Facebook to assemble and people around the world create affinity groups. Facebook has become a public space, so much so that many people only know the internet as Facebook. Given these circumstances, isn’t it a little dismissive to 1) think of free speech rights in a U.S. context only and 2) treat free speech concerns as a matter only relevant to government intrusion? What gives you the confidence that the social media technocrats know how to handle harassment and hate speech? Similar to how government, with its “series of tubes” mindset has been shown to be a poor regulator of the internet, these websites handle matters of public importance poorly. Facebook was “just enforcing Terms of Service” when it blocked historic Vietnam images and when it supported pro-Kremlin trolls in suspending Ukrainian users for their political views. And do I really need to bring up Instagram’s censorship of nudity? Unfortunately, the public doesn’t know how ToS are applied. Ditto for Twitter and Reddit. The early internet idealism you suggest people move away from is the same guiding force that would advocate for transparency in how content is moderated so the people can work towards holding these websites accountable. I don’t see Twitter et al coming solely from a hacker lineage, especially given that hackers dislike proprietary access to information and the centralization/corporatization of the internet. Much like white supremacists have co-opted the language of the left, libertarian entrepreneurs have co-opted early internet idealism to suit their own goals. We agree that internet companies need to be doing more to deal with online hate speech and harassment. Tech communities need to be doing more to proactively intervene and address sexism and racism. But we should hold on to open and free values when calling for change. Regulating speech isn’t giving in, it’s changing the rhetoric. Because in not addressing harassment, these websites are ultimately ignoring the free speech rights of thousands of people who’d otherwise join the conversation. ", "title": "", "parent": "1767", "creatorid": "ee6c973c914c", "id": "2918772a2e4e"}