{"name": "1767_24", "child": "", "content": "Yes, there are limits to free speech, online or off. There always have been, and always will be. Current developments, and in particular concern from many quarters about the consequences of the sweeping provisions of Section 230 of the CDA, have produced a debate about whether the current legal/regulatory environment serves the needs of society. This is not a question of whether limits to free speech should be introduced, but rather an examination of how we define freedom in the internet age that recognizes the rights of both speaker and audience and promotes accountability in the internet ecosystem. This is not a binary question, and, as the author of this piece notes, solutions will require nuance and care rather than ideological absolutism that ignores reality. I should note that there were a couple of factual errors in the piece. The first is this: “This was furthered by CDA 230: the so-called “safe harbor” provision of the Digital Millennium Copyright Act. CDA 230 holds that “online intermediaries” — originally ISPs, but now including social media platforms — aren’t responsible for the content that their users produce.” Section 230 is not the “so-called safe harbor” of the DMCA. The DMCA and CDA are separate pieces of legislation, and copyright is specifically addressed in the DMCA rather than under the CDA. The second error relates to this: “And in the US, the Digital Millennium Copyright Act prevents virtually all internet users from using copyrighted content of any kind.” This is highly misleading. The DMCA created no new rights associated with copyright, and did not expand its scope. Any rights to prevent (or authorize) the use of copyrighted materials stem from the Constitutionally mandated Copyright Act, not from the DMCA. The DMCA created limitations on liability for passive intermediaries for third party content, provided that intermediaries met certain conditions, the most well-known of which is the commonsense notion that they should stop disseminating infringing materials once they became aware of such materials (at which point they would no longer be innocent and passive parties). The law governing the ability of users to use copyrighted materials was not affected by the DMCA. I hope this is helpful in securing an understanding of a complicated legal environment that informs how we think about, and shape, continuing efforts to carefully balance rights and responsibilities that advance fundamental, and sometimes competing, goals. I close with a simple observation: freedom and responsibility are not unrelated. ", "title": "", "parent": "1767", "creatorid": "89807c3fc929", "id": "597f66044ca5"}