{"name": "1767_17", "child": "", "content": "From my perspective, the problem is the exact opposite. We need to quit pretending that private censorship is permissible. If someone claimed the right of private property allowed him to refuse to rent to minorities or gays, he’d be flamed relentlessly, by many of the same people who insist that “private property” gives a blog or site owner the right to censor content. The real problem is the places that relegate moderation to readers, who can downvote or flag content. There have been cases of authoritarian regimes enlisting cadres of trolls who create multiple dummy accounts for the specific purpose of driving hostile comment off the web. (http://www.theverge.com/2014/9/2/6083647/facebook-s-report-abuse-button-has-become-a-tool-of-global-oppression). All too often there is no due process afforded to writers who get flagged, and no accountability for people who flag items maliciously or frivolously. And you don’t have to look terribly far in comments sections to find people complaining that their posts mysteriously disappear. In many cases, the posts probably disappear not because of hate or violent speech, but merely because someone disliked their ideas. If the alt-right started hammering sites and taking down liberal comments, I suspect the attitude toward private censorship would change. Even organizations that do their own moderation screw up badly. Fark.com had its ad revenue cut off for five weeks because an image was flagged as child pornography, solely because it included the “pedo-bear” symbol. The person pictured was legally an adult and fully clothed. Even though Google admitted it made an error, they still haven’t fully corrected the problem or refunded the money. The problem here seems to be use of automated filters. The rule should be: if you want to moderate, do it by hand. And make the moderator accountable. If a site is entirely private, it can do what it likes. And choosing not to host comments at all is fine. But especially if a site earns advertising revenue, or relies on paid subscriptions, it has assumed the status of a common carrier and a public utility. There needs to be a requirement for due process. Anyone whose comment is deleted must be told specifically why in detail, and have the chance to rebut any claims of objectionable speech. Anyone who maliciously, carelessly or frivolously flags content needs to be held accountable. Actually, nobody should be allowed to downvote or flag content at all until they’ve established a track record of responsible behavior. Two things that need to be absolutely prohibited. First, any physical obstruction of someone’s ability to speak, or others’ ability to hear them, is a civil rights violation and needs to be prosecuted as such. If it’s an organized effort, use RICO, just like we did when people held sit-ins to block abortion clinics. Second, peoples’ expression outside of the workplace should be absolutely protected. It should be flatly illegal for employers to penalize workers for what they say on social media, with the sole exception of posts that specifically identify the employer. The city dog catcher posts a racist rant in civilian clothes and away from the job? Tough. Your son’s English teacher posted some risque pictures years back? Lucky kid. We wouldn’t tolerate firing someone for a letter to the editor, why should Facebook be any different? More at http://stevedutch.blogspot.com/2017/01/time-to-call-bs-on-private-censorship.html ", "title": "", "parent": "1767", "creatorid": "e9f3d681469a", "id": "b049737ad68a"}