{"name": "1767_19", "child": "", "content": "To quote a subReddit, Explain it to me like I’m five. How is any media website different than a TV channel, newspaper or magazine? If I don’t like what’s on TV, I change the channel or turn it off. There are thousands of newspapers and magazines that I don’t buy. Why should anyone feel compelled to surf to a site that they complain is junk, then take it seriously? We knew 20 years ago that most of what was on the Web wasn’t real, what’s changed? Most of the Internet traffic these days is porn, Netflix and Amazon. And we complain that what’s left should be safe for everyone. What is safe? Who is everyone? I’ve been “online” since the 80’s. I still believe in Open Source and “the hacker ethic”. The Internet, specifically the World Wide Web, grew because of people who wanted to see it grow more than they wanted to make millions of dollars. If it weren’t for those unselfish hackers in the beginning, the Web would be owned by just a handful of media conglomerates, like most other media industries. In my half-century on this planet I’ve learned the obvious: If you don’t like a media source, don’t watch it. If you don’t like what’s on Twitter, don’t use it. I don’t. If you don’t want to listen to “Scared Whiteys” (alt-right) crap, don’t. It’s that simple. Just walk away… Social media is just that, media. They are private enterprises looking to make money by trying to scare, I’m sorry, entertain us. If you don’t like it, don’t buy into it. Now, I know the retort, “well, you can’t just go live under a rock and not be social.” Really? So you’d rather let the bullies get to you just so you can hang out with the “in” crowd.. that’s sad. And what’s worse is that when the current “in” group feels threatened, they want the government to fix it. Too many think the media make-believe is real. I remember when The Onion was only on paper. It wasn’t non-fiction then and it isn’t now. Too many can’t see that. And now there are those that blame other “fake news” sites for being so believable. Are they really that believable? Or has our society become that gullible? Don’t shoot the messenger, just ignore him. Trolls will do anything for attention, don’t give them any. It was a good thing Leslie Jones left Twitter, it’s too bad she came back. The trolls won. When enough people leave a platform, the trolls will too. And the same goes for any journalism site that gets their news from a social network site; screw them. Do real work and you’ll get my attention. It will be easy to tell when any media source has gone too far, they go out of business because people left. Twitter is still as popular as it is because people like using it, in spite of the whining. When all of the current social media addicts grow up and realize that their life doesn’t really depend on the whole world seeing what they had for breakfast, and how they felt about it, they won’t give any audience to the loud-mouth idiots either. Tired of “sharing” online and getting bullied for it. Then don’t. Share with real people you feel comfortable with. It’s better to keep your mouth shut and be thought a fool, than to open it and remove all doubt. Don’t want you feelings hurt? Don’t surf, surf smarter, or don’t let it get to you. No one can emotionally hurt you without your permission. Want a safe space to just hang out with people you like to be with? Find one, and stay away from the places you don’t feel safe in. Just like real life. Follow your instincts. When you get sick of trying to fix the world (Web), you’ll find your safe space. Or better yet, create it. Just like in real life. I’ll take six friends in real life over six thousand on Facebook any day. ", "title": "", "parent": "1767", "creatorid": "57777b81d723", "id": "1098b8cea80d"}