{"name": "1768_1", "child": "", "content": "Here’s The Simple Hacker Solution You Asked For Problem described herein is like having Schrodinger’s box. Everyone has their attention glued to the box speculating and arguing about what is or isn’t in the box and why they reached those conclusions. It’s goddam waste of time and energy! Make a new box or device to see inside. Simply put, our print derived, medieval design of a political system has become so mystifyingly absurd (Schrodinger’s box) no one can grasp how to make sense of it and what it’s doing. It’s become a quantum conundrum. Make a new box or device to see inside. The options are simple — as now waste good intentions trying to isolate a particle or wave (though even success leaves you no better off) — or take a scientific approach and build something that can use general knowledge about quantum physics. Make a new box or device to see inside. Cut to the chase — what is needed is to use digital technologies to create new institutions. Institutions that exist outside of the formal, official system. Intent is to act as a independent, non-partisan, truly multi-dimensional representative service in goal and agenda setting, issue discussion and policy decisions. Then to garner enough trust and credibility to leverage official system and erode power of money and careerists. Make a new box or device to see inside. As you said, “As a developer, I always loved the notion of “extensibility” because it was an ideal of building a system that could take unimagined future development into consideration….The masters of software engineering extensibility are inspiring because they don’t just hold onto the task at hand, but have a vision for all sorts of different future directions that may never come into fruition. That thinking is so key to building anything….And yet, it’s not a muscle that we train people to develop.” So the solution is to build the new institution to develop the muscle. There is NO alternative but to hack the system. Make a new box or device to see inside. On my Medium publication, A Passion to Evolve, there are numerous articles on these topics you might find of interest and or useful. For example: A New Process to Fix Our Political SystemReducing Education & Knowledge GapsOne Story the Media Ignores CompletelyWe Don’t Need Another HeroOur Twilight Zone & What Comes NextDoc Says — Our Emotions, Institutions and Technological Capabilities Are MismatchedThe Next Battleground for the Soul of CivilizationMacroscopic Evolutionary Paradigm Doc Huston ", "title": "", "parent": "1768", "creatorid": "4561ce40d387", "id": "2840ed252e67"}