{"name": "1768_14", "child": "", "content": "Great move on creating these essays. We need to discuss how to create a better society and software to serve us in the process. Good intentions + Plan ahead 10 chess moves of an unknown player = need more prior research + Plan for ‘patches’. (The chess pieces are humans: avoid collateral damage). We doubt information from a distrusted source. Sometimes, although trusting the source and being directed by a developer/ environment with ‘side fences’ — some individuals will find a way to divert form and expected behaviour. Even Orwell’s Big Brother couldn't contain all individuals, despite restricting their natural needs for family love, meaningful individual interactions, and their need for freedom of speech, thinking and random actions. A ‘collective Utopia”, a one reader commented, is too generic. Utopia according to whom? Would such environment nurture creativity and new ideas, or even consider diverse individual needs? Would it equally serve an indigenous tribe as a metropolis society? We should address local issues with local knowledge, using the global technology and ‘best practice’ models from other communities and countries as guidelines, then find our way. Perhaps Asimov’s “Second Foundation” with ‘mathematical historians’ working in the background would be a better solution. They would gently guide the “First Foundation” (politicians, entrepreneurs, teachers, journalists), and mitigate extremely negative actions, to ensure that the large masses move toward a desired direction — being kind to one another and living in a balanced harmony with animals, plants and our planet. So while discussing whether we can replace human teachers, journalist, doctors and drivers with technology — we often forget how many inventors through the history had no very good education (not classroom based). Simply reading everything (undirected, unsupervised) didn’t help all of them to invent things. It was often prompted by a personalized support / mentoring from a family member or someone close, or by observing and learning from an artist, physician or a scientist. Developing software extensibility should be done by including diverse individual users (non-experts too) in research and testing phases. Machines and software cannot replace all human skills, nor (together with their developers) predict how we would use them. Human creativity will find unpredictable methods and uses, which are not always positive. So we need to expect ‘patches’ to new systems, and an axiom I believe in is — Perfection doesn’t exist as an absolute truth. ", "title": "", "parent": "1768", "creatorid": "1702e2d4f2ea", "id": "33d36b0f8cc2"}