{"name": "1768_13", "child": "", "content": "Unvoluntary evil doings with good intentions is common. People with good intentions fail to question themselves. Here is an example easy to relate with: Take this Nature Gaïa Lover that feeds the birds or squirrels and teach his kids to love Nature and be compassionate about animals. Every time you feed a pigeon* (a rat with wing to be honest) you contribute to actually harm the nature in many ways: unbalancing the resources and getting rid of smaller local species, harming the pigeon population that will get weak when food seasonality (winter) will make most of the population underfed, and spreading infections because of a weakened population(see precedent point)…. (and other side effects) *also works with swans, ducks, cats and dogs The pattern here is looking at the first order. Some stuff that seem goods are evils on the long run. And as stated in very smart Nasrudin stories the opposite can be true. Thanks to f***ing Nature lovers, the red squirrels, the beavers, the poule d’eau have almost got extinct in my vicinity…and we have all the non local species that were released by Nature compassionates that are literally killing the local wildlife. And believe me american crawfish are tasteless compared to the local one we used to have. And when I say a thing, Nature lovers are telling me I am a heartless person that cannot understand the importance of being good to the Nature…or what they think is the Nature. Yes I have done my share of being a poacher. I fished endemic species illegally. I am evil to their standards, but truly, I did far more good to the Nature, than they did evil with their good intentions. So the fable says, that people convinced good is on their side tends to be so blinded by their opinions and ignoring their perception/the facts that they lose their capacity of a truly enlightened judgement and evolve in fanatics when confronted to a reality clearly contradicting their beliefs. When faced with uncomfortable facts they prefer to twist their mind in denial. PS next time you see someone feeding wide or urban animals I propose you challenge them politely and experiment first hand in real life what this article try to describe in a quite abstract way. ", "title": "", "parent": "1768", "creatorid": "695dec6d7a24", "id": "aac88d7ca970"}