{"name": "1769_1", "child": "", "content": "With respect to fake news, I wonder where I can find an analysis of false information about the Bernie Sanders campaign from the likes of David Brock. How is David Brock’s SuperPac “Correct the Record” paying Internet Trolls to smear Bernie Sanders different from Russians using social media and fake news to influence the election? Is it ok for David Brock to damage democracy because he is not a foreigner? I also wonder if Putin had to personally direct anything for his underlings to carry out what probably were his wishes (if in fact there is actually any truth to Russians “hacking” the DNC). I still have only seen documentation of phishing, not hacking. Maybe, as the english language evolves, the definition of hacking is being changed. Phishing is pretending to be someone you are not in order to trick someone into, e.g. telling you their password. Hacking, as I have always understood it, is e.g. finding a vulnerability in the code on a server and exploiting that vulnerability in order to break in. Another very different definition of hacking is to quickly throw together some code for a demo that might need debugging and a lot of future refactoring. Analogies for phishing vs hacking might be something like this: Phishing: I show up at your job dressed in a gas company uniform and ask for the keys to your house.Hacking: I pick the lock in the back door of your house. I’m afraid that all the hype about Russians hacking the DNC has led to people being less informed about how to protect themselves. It is a lot more complicated for the average person to protect themselves from hacking than it is to protect themselves from phishing. I would not be surprised if all sorts of Russians from official to unofficial had hacked the DNC. For decades I have blocked IP addresses from Russia, China and India to protect web sites I have hosted for myself and clients. But, it concerns me that all the recent news reporting leads the general public to believe that you had to be a foreign super power to be able to hack the DNC. At the core of the problem to solve cybersecurity issues is the culture clash between business leaders and politicians, who are clueless, and tech people, who can offer advice about how to be secure. When I was a Delegate to the DNC in Philadelphia, the DNC gave us a calendar mobile app to use and they emailed us the password we had entered. Here is a screenshot of the email where the DNC included passwords.http://groups4us.org/wp-content/uploads/2017/01/hack-dnc-password.jpgA smart 12 year old could hack the DNC. In addition to the coordinated efforts of the Hillary campaign, there are countless instances of media who did not need to take direction from Hillary, e.g. all the false stories about Bernie Bros being violent and throwing chairs at the Nevada State Delegation meeting. One of the biggest dangers of fascism (or oligarchy) is not that a fascist (or oligarch) leader directs people to individually do specific bad things. It is that many humans work out in their head what that fascist (or oligarch) leader might want them to do and then they behave in that manner. If nothing else, the revelations in Wikileaks have shown us this. Hillary didn’t need to personally call Donna Brazil and ask her for advance information about the content of the CNN debate questions. Donna, most likely, just did this on her own initiative. I’ve witnessed this phenomenon looking at the organizational behavior of executives in Fortune 50 companies, that I had as clients back in the 1990’s. Rival camps formed reporting to different “leaders” within the same company and engaged in unethical behavior to sabotage the projects of others, in a way that was detrimental to the company as a whole. One of the most disheartening results for me of having been a Delegate for Bernie Sanders was that I used to enjoy listening to NPR while eating breakfast and watching PBS Newshour while eating dinner. After everything I learned from my firsthand experience on the inside of the grassroots Sanders campaign and being inside the DNC in Philadelphia, I can no longer trust or enjoy what had been bright points for my day. Read this post and watch the video of the Democratic Party, New York State Delegation meeting that I attended on June 21, 2016. A Hillary supporter hit a 25 year old muslim woman twice with his cane and Nomiki Konst had her microphone turned off when she tried to raise a motion. The Democratic Party leaders chose to ignore Roberts Rules of Order and they packed the room with people who had not been elected as Delegates, while all the Bernie Sanders supporters in the room were officially elected Delegates. A reporter from the New York Times was in the room, but nothing was reported about this in the NY Times. Nomiki Konst, was a Delegate like me, and is now joining The Young Turks team as an investigative reporter. ", "title": "", "parent": "1769", "creatorid": "918ab80f50cd", "id": "a939d9b34724"}