{"name": "1771_10", "child": "", "content": "There was recently a post by Melinda Byerly, a San Francisco CEO, who criticized Middle America by saying “ “no educated person wants to live in a s***hole with stupid people.” (http://heatst.com/culture-wars/liberal-ceo-slams-middle-america-no-educated-person-wants-to-live-in-a-shthole-with-stupid-people/) Well, if she values diversity so much, she can move out of her safe space in SF where she’s surrounded by people who think and act the same, and go across the Bay to Oakland or Richmond or San Leandro where there’s tons of diversity. And if she’s looking to open businesses in diverse cities, Cleveland and Detroit can use a little help. Or Flint, Michigan. The military is actually very much self-segregated. Ethnically it’s diverse, but everyone has a shared experience of military activities. In the 1950’s, you could count on a large fraction of the male population having military experience. Even during Vietnam and the draft, it was common enough. Now, with 40 years of a volunteer force, only a per cent or so of civilians have military experience and many of those are aging vets from past wars. Full-time military people live in post housing, shop at a PX and commissary, and rarely need to venture off post. I’ve heard of people spending three year tours in Germany and never going off post on their own. (No commander has authority to punish a soldier that way — but they do it themselves.) The ultimate self-segregation is the gated subdivision. People who live in those places want neighbors with neat lawns, no rummage sales, no clotheslines, in a word, decorum. And that brings out a very much overlooked point. Class is not race or money, class is behavior. Now I know maybe a dozen people who are worth seven or more figures, and they definitely have different tastes than I do, but we all share some fundamental core values: keep your home properly maintained, obey the law, save, get an education, pay your bills. ", "title": "", "parent": "1771", "creatorid": "e9f3d681469a", "id": "bf8b4257a02"}