{"name": "1771_19", "child": "", "content": "What does it mean to go outside our comfort zone? My work and interests require me to constantly try to solve problems with people that speak, act, and think in different languages, culturally and linguistically. Recently, I took a break to visit Standing Rock. This opportunity, along with discussions around the future of humanitarian aid being one where we empower leaders within refugee camps, has given me a sense of motivation to build and support new ways of thinking and also new systems that enhance our old business and societal models of existence. What will it look like to solve the issues that Dana addresses in this article? “Rather than focusing on what media enterprises can and should do, we need to focus on building new infrastructures for connection where people have a purpose for coming together across divisions.” — danah boyd Facebook has been a major source of our information in the USA. Majority of people in my age group and below, depend on Facebook as their source of media. However, as this article pointed out, the “American public is self-segregating”. I think a lot of that shift has to come from our individual choice to deal with differences even differently. I think we are also very much an object oriented society that has flattened our relationships by for too long looking at our preferences as “good or bad”, “right or wrong”, and even “pure or evil”. We need to create new infrastructures in our own personal lives that allow to have more complex vocabulary and properties and traits of our interests. Our tendency to view all people supporting X as all being Y, also has polarized and created a false narrative of why people choose certain things. The tolerance and interest in diverse friend group has been somewhat self segregating because of a lot of the fear and insecurities that numerous media posts (at times fake stories that have high growth hacking content creators behind them) concoct as the general “reality”. The current breakdown of things in our lives on Facebook are a great view to me around the way we are within all systems. In many ways, as citizens of the USA, although a democratic nation, we police each other heavily and tend to scold or unfriend those with different political views. If our leaders also held themselves to promote diversity in their views more, showed tolerance and guided the majority views for inclusion of minority groups, then the conversations around diversity could truly change to work for the betterment of people, rather than showcase the exclusive nature of most of the population. Yet, new media does point to the ways that mainstream media has shared limited stories around issues by minority populations in the USA. Standing Rock, and the social media led movement of indigenous people and everyday citizens, to come to North Dakota to fight for the rights of the Dakota pipeline, were an excellent opportunity for me to see how live stream videos, drones, Facebook mentions, and movement building leaders, could use social media to show the mistreatment of the people at the front lines of the Dakota access pipeline battle. The way social media live streams led many of us to be aware of this lengthy battle, and led 100s and soon thousands of people to come to the main camp of Oceti Sakowin Camp, was a testimony for me that, people were ready to build new infrastructures. To build new systems we also need to physically be able to build new models of reality of the world is for ourself. I have now first hand experience of seeing this pivotal time in the USA. As I finished reading the last sentences of Danah’s article, I was aware, 2017 is truly about the responsive and responsible leadership that World Economic Forum is addressing, it is about the actual openness from non violent communication of discussion by people for and against drilling as I saw numerous people take on at #StandingRock, and it is also around building new infrastructures as what I have been seeing and watching happening in numerous makers paces and community groups of builders seeking a purpose that is outside their comfort zone. Standing Rock was uncomfortable for me, it required me to put aside my judgment, and listen to the issues faced by many people from a different socioeconomic background. Our country does not teach us much about the struggles of Indigenous people of the United States, nor does it go into detail around the treaties and laws that separate them from the rest of our nation. By visiting the Oceti Sakowin camp at Standing Rock, I was able to physically see the ways that a particular group of people are isolated and excluded from at times basic human rights. As the world is filled with more conflicts online and offline, I think a lot of the growth and positive change will come from individual citizens “rising up” to the occasion as leaders who are willing to address the ways to be bridges of differing views and perhaps differing resources for solving problems. To answer my own question, I think to address the problems that Danah points to in her article, we will have to take more responsibility for what we put out in the internet, be more aware of the skewed data we attract and are comforted by, and be courageous enough to sacrifice our safety nets to widen the broader gains of stability of our nation, by trying to keep working to reconnect our social fabrics in ways that lead to healthier debates around our differences. A lot of 2017 will be about staying active participants in building our tomorrow. As the fourth industrial revolution paves our way into more access to information, staying open to each other and also staying active leaders in building more roads of access for not just the loudest voices, but keeping access for the voices that are constrained and deprived of being heard. Let us not let fear drive our future. I couldn’t agree more with this particular quote by Mohatma Gandhi, “The enemy is fear, we think it is hate, But, it is fear.” Let’s be open to each other and listen before letting fear take over an opportunity to truly rebuild a better social fabric of the USA, one where we are open to various great traits of people with differing views.  ", "title": "", "parent": "1771", "creatorid": "7be39e6df6cd", "id": "a32040ec3f7"}