{"name": "1772_24", "child": "", "content": "Has revering danah boyd as a media literacy leader backfired? Much like her article, I don’t think I will persuade anyone who values danah boyd’s contributions to the cultural studies of media (as I do) that they are wrongheaded due to her small, though perhaps significant, role in devaluing media literacy by asking “Did Media Literacy Backfire?” at a rare time when the public is talking about and calling for more and better media literacy education. I can’t tell if it’s ironic or strategically manipulative that boyd uses straw man arguments and red herring examples, classic propaganda techniques, to provoke her audience of media literacy advocates, educators, sympathizers, and researchers to either agree with their prior beliefs or double down on their contradictory beliefs — the very behaviors she demonizes as society’s ills. So, while I see this article as a shortsighted and shallow critique of media literacy for lots of obvious reasons that others point out in this comment thread (offering decontextualized examples of the most shallow versions of a narrow part of information literacy — i.e., fact-checking and source credibility — as representative of media literacy practice; suggesting that media literacy, which struggles always, failing for decades to find a prominent place in formal and informal education, could possibly be a significant factor in major abuses in contemporary media communication like sharing/believing/acting-on fake news; etc.), I also think boyd’s article provokes a few useful reflections on shortcomings of the media literacy education field and points to one possible way forward. With regard to the latter way forward for media literacy, a solution danah boyd offers is the notion that our goal should be to encourage people to want to understand more diverse perspectives. While this is not new to media literacy as concept, practice, or movement, perhaps it is not at the forefront of public perception of media literacy. However this is certainly, precisely what Jordi Torrent (ML for cross-cultural understanding and peace), Elizaveta Friesem (ML for empathy), Carrie James (ML for sustained civil online discourse across diverse communities), Laurel Felt (ML for socio-emotional development through play), and I’d guess a third or more of the media literacy leaders and researchers and teachers that I am most interested in, are working on; and, I’d guess that at least two thirds of our field would list “developing media literacy approaches for understanding diverse perspectives” as a current top priority. The idea has been a core concept in U.S. media literacy, one of the five core concepts (imported and distilled from Canada’s 8, imported and distilled from Masterman’s/UK’s 18) for nearly three decades. “How do different people understand media messages differently?” is a core question and concept in media literacy, and has been since Liz Thoman tacked her ninety five minus ninety media literacy theses to door of the Center for Media Literacy in L.A. in 1989 (CML’s 5 Core Concepts of Media Literacy, 1989). Although this article suggests it, I don’t believe for a minute that danah boyd wants anyone to stop asking questions or taking personal responsibility for their role in knowledge creation and sharing online. I think that she thinks she is pointing to the greater importance of understanding the structures and trends of social communication and identity as compared to the individual practices of doubting validity and credibility of information. However, I doubt (whoops!) that she is reaching people who care about media literacy with the way she crafts this message, and people who don’t care aren’t in the target audience. Maybe this post is effective for reinforcing beliefs of those who are dissatisfied with the old school negative nellie style of media literacy that has bashed “the media” (or social media, or digital screen time), and now bashes the “stupid users of media”… but for decades that has not been most media literacy educators, nor most of the field. In fact, the mainstream of the field had a highly public divorce from that element around the turn of the century (ACME/AMLA) and found a way to compromise, come together and contribute across their communities in the past decade (NAMLE, DML). This either/or that the article sets up between either seeking to understand others’ views or doubting/questioning information/others is a dangerous false dichotomy to create. We should always question and doubt ourselves and others and the world (and therefore information about each) as part of our effort to understand and act in good faith with each other and ourselves. Theologians welcome doubt and questioning as a path to faith and compassion in most religions, so don’t think this is some leftist progressive elitism. Our work to encourage understanding others, rather than demonizing doubt and questioning, should strive to make social communication contexts safe for using doubt and questioning to achieve common understandings. At base I think media literacy makes life more enjoyable, in large part because it leads to greater understanding of others, new perspectives, new ways of seeing ourselves, and new ways of fortifying our current views, all at once. My research on the history of media literacy turned up the figure of the media literacy educator as provocateur, inciting the learning community to problematize, analyze, reflect and act as a group to affect relationships with and through media. Perhaps danah boyd’s article can productively play this role of provocateur for us. Anyhow, thanks for a fun thing to think about; I’ll make something good of it, though I don’t know if this article will do more harm or good for media literacy or for the effort to create cultural contexts for understanding others, which I see as part of the same project. Depends on how most respond. I hope, with boyd (I think), that we respond with an attempt to understand each other and improve our practices and cultural contexts to promote more thoughtful and empathetic communication across diverse communities. ", "title": "", "parent": "1772", "creatorid": "3eb88beec296", "id": "f3a3229fe56e"}