{"name": "1772_14", "child": "", "content": "So you think media literacy is responsible for the culture of tribalization and polarization that has been caused by a culture of critique, a mistrust of authority, where experience is valued over expertise and personal responsibility is valorized? Seems like a straw man argument to me. Media literacy educators are not responsible for the decline in trust in authority and expertise: of course, the postmodernists among us might feel a twinge of guilt, but even they were just recognizing and describing the epistemological shifts resulting from the changing shape of information and knowledge due to the rise of the Internet. Neither are media literacy educators to be held responsible for the culture of critique, which has been rising since the Vietnam Era when we learned that experts abuse their power in ways that require people to “ask critical questions about what they see, watch, read and listen to.” And media literacy educators did not lead people to trust their experience over expertise: actually this social phenomenon is at least partly a response to the glut of information, as Rushkoff and other critics have explained. It’s a cheap shot of sorts to claim that kids who trust Google over Wikipedia have learned to do so from their teachers. But that headline, “Did Media Literacy Backfire?” sure creates a buzz. You got my attention, danah. By using that time-honored device of bashing ideas to call attention to oneself, you suggest an “us-or-them” framing that unfairly places the blame on those grassroots souls, working individually and collaboratively under impossible conditions (like K12 schools and underfunded public universities and non-profit organizations) to create experiences for people to critically analyze and create media through media literacy education. To me, there are better ways to build coalitions and advance new ideas than this. But, to your credit, you provoked a response. So that’s what polarizers do. We in the media literacy education communication are trying for genuine dialogue about these ideas here: https://flipgrid.com/5f64ba ", "title": "", "parent": "1772", "creatorid": "96bb081b540e", "id": "a071e79e87b4"}