{"name": "1772_3", "child": "", "content": "John Pilger’s “The War You Don’t See” covers medias’ complicity in acts of war by subjecting their publications to bias due to influence by the rich and powerful. It used to be good enough to just open the NYTimes and assume you were getting a trusted source and in fact, they WERE the source. But like politicians, they are in fact prey to the hand that feeds them..ALWAYS. Will the NYTimes be running any stories against Carlos Slim? No. Is Carlos Slim in bed with anyone in politics? Absolutely. Does anyone even know who the f%$# he is? How much media time does Eva Bartlett get? How much did UN Weapons Inspector Scott Ritter get in the run up to the second Iraq invasion? As one journalist who was fired from a paper tweeted “Now I’m free to write anything I want”. How does he survive? Donations & selling articles. Facebook’s move to censor “Fake News” which before November was the typical story about a child celebrity who looks sexy now “You won’t believe how she looks now!” (with a altered picture). Now Facebook has its branding sights on anything that goes against the narrative set forth by the rich and powerful. Recently, major publications gave us a rare opportunity to identify how compromised they actually are by trying to blame Russia (while politicians enact laws for the use of military force in retaliation for hacking) for the DNC Leaks and Podesta’s email release. Those who repeated the incredibly weak, unfounded assertion that we should blame Russia for the words of Podesta and other very powerful players instead of focusing on the content of the emails illustrated that they are truly the guardians of powerful interests. WikiLeaks gave journalists AND average citizens access and the results were crowdsourced giving millions an opportunity to be themselves labeled Fake News by MSM. We are never going back to “Trust Us” and we are never going to allow a Ministry of Truth to control information. Nasim Taleb’s IYI covers “academico-bureaucrats” who would love nothing more than a license or accreditation for journalists/media companies so they can explain to us what truth is, but it’s too late, they’re bleeding to death from foot wounds and we’ve moved on. ", "title": "", "parent": "1772", "creatorid": "97329297ccaa", "id": "49763c2d8fba"}