{"name": "1774_10", "child": "", "content": "The news media is the fiddler, not the fiddle. Otherwise I loved everything else about “Hacking the Attention Economy.” I just don’t see the 2016 election as a sign the media were being played; that would suggest they’re bystanders, or somehow victims. No, the big media is exposed: their bias is collusion. The media are so often reliable for the Democratic party, such that they undermine their own credibility. For example, which network was it that gave Hillary’s team a list of debate or interview questions in advance? Whether that’s fair play or not, Trump’s team succeeded in smearing her and the media with that. They own their bias now. How many times did the media — the morning talk shows, the cable comedy hosts and evening talk shows — basically say, Ooh, please Trump, please run, because you’re an idiot and you’ll show the world what morons the conservatives are? Then Hillary can win and this two party charade where we pretend to listen to both sides can be over for another four years. The media owns Trump. They weren’t played. From the vantage point of hacking, they tried to hack the election, setting up a podium for Trump to give Hillary an easy win. Well, they failed and it’s democracy that got played because now we have Trump in the executive branch for four years. Remember the TV media pundits on election night? Their mouths agape over Hillary’s “blue wall” crumbling as blue states turned red for Trump. What crumbled much earlier was her party’s and the TV network’s credibility: the decay only became starkly visible on election night. You don’t have to be a Trump supporter (I’m not one) to see what he did there and continues to use Twitter and his YouTube-first media briefings to do. He’s not giving the media any legs. But whom do we trust now? An algorithm? Facebook and Google? Their biases were also exposed during the 2016 election: Facebook’s algorithm for hiding real conservative news is arguably worse than Facebook’s algorithm that is the dry grass fueling the next fake news wildfire. And Google is no better; Schmidt as an openly supporting Hillary is fair game, he’s a person with an opinion, but when Google Search hid negative search results about Hillary’s health or scandal du jour, well that smells like media collusion. So people, like Dana Boyd, the author of this Medium post, are going to credit Trump as being a master media attention hacker. Whether it’s that or that the right succeeded in exposing media and tech company bias. Either way the TV networks and big newspapers have a lot of credibility to earn back. I’m hoping this is a good thing. I’m hoping journalism goes back to reporting facts and exposing corruption of any party or corporation or government instead of protecting one political ideology from another. ", "title": "", "parent": "1774", "creatorid": "2b9738356858", "id": "9dc7be73fa71"}