{"id": "d97a83d8c34a", "content": "Some traits of conspiracy theorists I have observed. There is a cult of these people who believe in virtually all the conspiracy theories. From faked Moon landings to chemtrails to shape shifting alien lizard people, absolutely no conspiracy theory is too stupid for them.The cult exists because once you take the step that the shadowy people in our government are so evil as to do something like kill thousands by plowing airliners into buildings, it’s a much smaller step to believe the same people are poisoning our water with fluoride and poisoning our skies with “chemtrails.” Thus, succumbing to one conspiracy theory often leads to a cascade effect of buying into many more. That they would also be poisoning themselves, their families and loved ones, never gives these people a moment’s pause because they just don’t think stuff through. Which leads to the next point.Any evidence against the conspiracy theory becomes part of the conspiracy theory. Evidence against the conspiracy theory is not only dismissed and ignored, it actually is turned around as evidence of the conspiracy. So if, for example, a group of imminently qualified engineers explain how the twin towers fell from airplane attacks, the conspiracy theorists just claim in the engineers are in on it, which proves the conspiracy. This is perhaps most notable in global warming skepticism which is ultimately a conspiracy theory in which the vast bulk of climate scientists from countries across the world are all colluding to push some evil global warming agenda.Conspiracy theorists claim the whole world is dishonest, that nobody can be trusted, except (of course) them. Yet they largely peddle in nothing but absurd and verifiable lies (think of the “Birthers”).When some fact they present as critical is ultimately proven wrong conspiracy theorists just switch to a different conspiracy or question. They make something else up. “Okay, so the twin towers were not brought down by controlled demolitions, what about WTC7?” It’s a constant game of conspiracy whack-a-mole with these clowns and just as you beat one down they will pop up another. It would be worth it if the original mole stayed down, and others as you smack those down too, but that’s not what happens with these people. They will happily return to a previously debunked claim knowing full well that it was previously debunked. They are not honest people. ", "creatorid": "cb24d147353", "title": "", "parent": "17", "child": "", "name": "17_10"}