{"content": "If you love your Surface Studio, why are you sad it’s not an Apple? My first PC was an Apple IIe. Every machine since has been Microsoft compatible. I didn’t leave Apple because of the machine, At the time, you couldn’t connect a non-Apple peripheral to an Apple machine, and Apple hardware was insanely expensive by comparison. But that’s not why I left. What drove me away was the level of mind blowing hypocrisy displayed in their brilliant 1984 super bowl commercial, and what that position foretold for the future of personal computers. At the time, I owned a small video store, and had a close up view of the VHS versus Betamax wars. Sony had a technically superior design and product, but was slow to license the design to other manufacturers. JVC on the other hand, aggressively pursued licensing agreements with dozens of manufacturers, and as we all know, won the format war. When I was making my first MAC versus PC decision back in 1985, I chose the PC world’s open architecture, and more importantly, realized that Apple’s R&D budget could never really compete against the combined dollars and brainpower of the rest of the industry combined. Apple in their 1984 commercial portrayed themselves as individuals against a mindless state with suited lemmings following each other off a cliff. Reality was the polar opposite. Apple ran a closed, take it or leave it system while the PC business allowed virtually unlimited customization. The result was that industry innovators were locked out of the Apple business. Anyone who wanted into the PC business was forced to invest their capital and their brains into the IMB PC side, funding innovation on a massive scale. Silicon Valley owes it’s roots to anyone but Apple. It was an insanely stupid tactical error which almost killed Apple as a going concern. Only the ipod, the iPhone, and the iPad saved Apple. You mentioned the “vibrant” third party Apple software marketplace. You neglected to mention every one of those companies must have prior approval (or restraint) from Apple, and Apple also demands a cut from all those companies sales. We’re seeing the impact of that in the MacPro/MS Surface war. Apple didn’t have the money to upgrade the MacPro because they were forced to invest their R&D budget elsewhere. The only major problem with the Surface Studio is that it doesn’t have an Apple label. By the time Apple gets around to upgrading the MacPro, Microsoft will be out with their second iteration, and eat Apple’s lunch again. To give you an idea just how far off the rails Apple has gone, Petapixel (photography site) ran an article yesterday comparing a $5,660 Mac Pro running 8 cores at 3.0 GHz with 64GB RAM against a $1,530 PC with Ryzen 1700 running 8 cores at 3.0 GHz running 16GB RAM. In tests running some processor intensive photoshop actions, the $1500 Ryzen CPU PC was TWICE as fast as the $5,600 Apple. That’s downright embarrassing. No wonder Apple stopped selling the eight core machine, but it’s still on their product page. https://petapixel.com/2017/04/08/5660-mac-pro-crushed-photoshop-test-1530-pc-amd-ryzen/ ", "child": "", "parent": "17", "title": "", "creatorid": "a4e0ac0c181d", "name": "17_13", "id": "27d09d2dca97"}