{"id": "e0490f0aabde", "content": "The problem I’ve seen with conspiracy theories is that it is based on observable information, connecting it to what we think and how we believe that information matches what we think we know about how reality works (which may or may not actually be the case) and finally we decide if those two pieces fit with the actual narrative. If they don’t, then a conspiracy theory is born. The problem comes from the second variable, what we think we know about how reality works. For example, when two vehicles traveling in opposite directions towards each other crash, what is the speed of the crash? Based on what we think we know about reality and how it works, we assume that the speed of the crash is the sum of the speeds of the vehicles. Thus, two cars going 55 miles per hour collide, the crash is a 110 mile per hour crash. However, the actual speed of the crash, in reality, is not 110, but 55. Why? Because each vehicle has to share the impact equally. (If you want to know more, watch Mythbusters Episode 143: Mythssion Control). So what does that mean for events like JFK, 9/11, and the moon landing (and yes, even flat earthers)? Is their observation of an event correct? Absolutely. It’s the interpretation of what is seen and how that fits into what they believe they know about how reality works that may not be. Take the moon landing: one of the arguments about why they know it was staged is that the men walking on the moon looked exactly like they would were they on the earth. Their interpretation of reality is incorrect, however, as those suits would make it nearly impossible for astronauts to go as high as the did into the atmosphere on earth because the suit alone is 110 pounds on earth, with the life support pack adding another 130 pounds. On earth, that is a lot of weight for an astronaut to jump feet into the air. But in the 1/8th gravity of the moon, that weight becomes manageable, making high jumps possible (try walking around with 310 pounds, then try jumping and see how high you get). But what do we do when the “conspiracy” is true.? That’s the real issue, and the reason why this research will be important. During her run for president, Hillary Clinton was found to have a private email server in her home that she used for work emails. That’s never been denied, and even Hillary herself said that it was a mistake and regrets having done it (my honest thought wasn’t that she had regretted doing it, but regretted getting caught, but that’s beside the point here). Then the question arose as to whether she used that email server to send and receive confidential government information. An investigation revealed that she had, but the key element to the decision to not prosecute was her intent: did she mean to do it? For one group of people, the conspiracy theory was that the government, and Comey specifically, used the investigation as a tool to cause her problems getting elected. For another group, the conspiracy theory was that she had committed a crime, and as such, should be prosecuted for it. Is it possible for both theories to be true in this case? Absolutely, because their contexts come from different places, and focus on two separate aspect of the same issue. Comey is one, Clinton is the other. Of course, for the side favoring the Comey conspiracy, the email question itself wasn’t a big deal to them because, in their minds, the conspiracy wasn’t the emails as they felt sh3 had done nothing wrong (or others had done it, so why couldn’t she, etc.?) For the other side, the conspiracy was the emails. It is our responsibility as consumers of mass media and news (fake, alternative, or mainstream) to be discerning when it comes to our consumption. Just like it would for any other product, hamburgers, salad bars, gasoline, hair care products, dentists, cars, etc., we need to be informed about what we read or watch for news. It is up to us to be critical of that news to determine if it is informing us of an event or trying to sensationalize an event for ratings. If that news is attempting to sensationalize for ratings, that is when we need to be most critical about the information we are given. That sensationalism has to include how that event fits into what we think we know about how the world works, and throw that piece out if it tries to get in the way. ", "creatorid": "578abdf01946", "title": "", "parent": "17", "child": "", "name": "17_1"}