{"name": "1879_10", "child": "", "content": "My story is just one of thousands that exemplify how Canada’s welcoming approach to immigration spurs innovation and prosperity for the nation. Canada does not have a wide open immigration approach. Certainly not compared to the USA’s huge numbers and I believe we are considered behind the UK and many other European countries. Something that would ‘exemplify’ Canada’s predatory approach would be ‘Pay to Play’ and the 1000’s of ‘Fuer Dai’, Chinese rich kids/anchors all over Vancouver and Toronto. And anyone (including my wife who’s not rich) will be treated like criminals until they prove themselves innocent. And they still won’t get so much as a 3-month visitor visa. Indeed, Canada will take in the cream of other people’s crops. It takes a village and millions of man-hours to finally produce one doctor or engineer of their own. Canada will steal him or her in a minute. In fact, immigrating to Canada is so insulting, so bureaucratic, such an outdated system, so condescending, so long, so expensive, so full of arrogant immigration officers that I cannot comprehend why in the living fuck anyone normal human being would even bother trying? To compensate for their ‘Buy a House and Win a Passport’ greedy highest-bidder approach they go dead-opposite on immigrants taking in Somalian Pirates, Venezuelan Killer and take cash from Germany to take Bosnians. All of whom will laugh and savage the weak Canadians who don’t even fight back when you punch them in the face “Here watch …. I can fuck him up and he won’t even fight back…” and this before they murder each other, stab each other and secretly ‘fist pump’ when a Jihadist terror attack is reported. we were given forged Italian passports, and this reminds me why you aren’t anything but the near ‘opposite example’ of what has happened around the West. And I quote that part because just a few weeks ago we were talking about the ‘Italian’ Iranians. Everyone in New York or Edmonton over 40 knew exactly what that was. The 70s era wave of Muslim immigrants. They were (like your parents) the opponents of the Islamic Revolution. They were often doctors, engineers or academics of some sort. Often the more modern types. They quickly integrated and were usually just assumed to be ‘Italians’. Because Italian was the most ‘Middle-Eastern’ thing we sorta knew, they had black hair, dark eyes, olive-skin tones and most Canadians in the 70s just sorta figured the names sounded Italian. Najatti, Bablatti, Yabbassi, Cobretti.. I dunno, like Italian or Greek maybe? They almost always took ‘Anglicized names’ like Joey or the famous ‘Moe’. Every neighbourhood had a ‘Moe’. Possibly a Greek restaurant that served Persian food. indeed, the 70s era (the pre-islamic revolution) era Muslims really did seem to have a thing for Camaros, Firebirds, gold chains and we recently had a laugh at an old uncle who, for 20 years insisted he had a rivalry with the ‘Wops’ when growing up in Edmonton. The other uncles, [at least 20 year later] finally realized that none of the neighbourhood rivals were Italians but were instead, Iranians, Iraqis or ‘Persians’. My own dad had a long-time friend who my father kept telling people was a ‘Greek or something like that’ and it wasn’t until they were adults he found out the guy was an Albanian. My dad doesn’t know what (or where) Albania is so he decided Reb is still ‘Greek or something’. And these are the people I grew up with. The neighbours. They put on amazing meals at the Summer ethnic food fairs and I can tell you right now — I cannot think of a single problem. There was no such term (nor would it be imagine) as ‘Islamophobia’ and to be honest I don’t think we knew what Islam was. Alladin and flying carpets or something? Not a single bad word, not a problem in any sense from anyone ever. Not from those Muslims or anyone ever in my entire upbringing and early life until.. ..the ‘Post-Islamic’ 2000+ Muslims show up. It’s not even that they have more ‘Islamic Extremists’. Or are more militant. Its almost more of a hatred, an arrogance, and then seeing the world through a ‘clash of civilizations’ mentality. Now add the post-modern obsession with identity politics that is poisoning the West. Now add Islamic terror attacks. And if you need to know, this isn’t going well for our 70s era secular Persian “Italian” immigrants either. Now, they find themselves walking past a mosque full of the same people who killed your dad. And there is now more of them than you. And you might not even be considered a true Muslim by some of them. You represent something that was just fine. You definitely do not represent any example of what is happening now though. And Canada Immigration is a Predator. ", "title": "", "parent": "1879", "creatorid": "e85e4aa990f9", "id": "25931fc153ba"}