{"name": "1883_16", "child": "", "content": "I am so sorry about the troubles you had at DoSomething.org. You deserve to work for an organization that values your contributions. As a Vietnamese-American, female journalist, who grew up in a predominately white suburb, I understand your pain with racial discrimination. I did a feature about the former CEO, Nancy Lublin, ages ago and she ran it like a lean start-up more so than a bureaucratic non-profit crippled by red tape. If you felt discriminated against, you could have/should have talked to her about it. She prided herself in transparency, having an open door policy and structuring it as flat organization with little hierarchy. She also created an open floor plan so that everyone could see what everyone else was doing and for everyone to share ideas openly. She had interns and new hires shadow her for a few months when they started. I obviously don’t know how Nancy’s replacement runs the show. But anyone who feels discriminated against or wronged at work, should share their grievances with their supervisor, human resources manager, the CEO, etc. at work — not social media or the blogosphere. Bad-mouthing a former employer anywhere — in a job interview, online — looks very unprofessional and errodes trustworthiness. People don’t want to with someone who airs their dirty laundry in public because they assume you’ll do it to them. What I learned from Hillary Clinton, who learned this from Michelle Obama, is when “they go low, we go high.” By embarassing an organization online, you are acting no better than the people who mistreated you. I agree with Human-ish and Veritas Walker. I don’t see how you suffered discrimination based on what you shared in your post. You wrote a rap song and someone asked you to perform it. How is that bias, stereotyping, etc.! The 2016 Presidential Election saga showed the world how the most qualified person can get passed up for the last qualified person with no experience in public service. It happens to everyone regardless of race, age, position. You are very fortunate to get severance after holding a job for only six months. No place I know would do that. Employement laws may be very different in New York than California, where I live. California law allows employers to fire anyone for anything except the protected classes such as race, sexual orientation, etc. Most employers hire you on a three-month trial period and can renew or extend that trial period. They don’t have to give you severance at all let alone after only six months. Regardless, if you weren’t happy at DoSomething.org, you are better off and will find a better opportunity. When one door closes, another always opens. Only people who get you, deserve you. ", "title": "", "parent": "1883", "creatorid": "b1130631791f", "id": "fc8da2609a76"}