{"name": "1883_7", "child": "", "content": "I admit I didn’t get through your entire post so I will only comment on what I read. Why did you getting passed up have to do with race? Some people have stronger personalities and bosses don’t want those people on their teams. I’m white and I KNOW I have not gotten jobs because I have a strong personality. Heck, I’m pretty certain that I never get asked out because of this, and my personality isn’t THAT strong. I’m just bold, passionate and have opinions which I usually keep to myself. You also talked specifically about your anger at getting passed when you were the most qualified for the job. Welcome to the real world. This happens ALL the time in GOVERNMENT jobs. I applied for MANY jobs where I was perfectly qualified, happy and always smiling in the interview, had great recommendations and then I see or hear from others who they hire and I’m shocked. This is just personal bias, not racial. Maybe even the person had an in and was someone’s family member or close friend. I’m in an arts related field and one of the biggest things they say in this industry is it’s not about your skill level but “Are you the best fit for the team?” People need to be able to work together and if a supervisor doesn’t think someone will be the best fit, it doesn’t matter what reviews, recommendations or skill levels are. I suspect that once you began hearing things then you started seeing racism and mistreatment everywhere. This happens to all of us. Someone points something out and all of a sudden IT’S EVERYWHERE. And it doesn’t mean that there wasn’t some racism, I just find that when people, including myself, start to look for something, we find it in spades. The bottom line is, give people the benefit of the doubt. Don’t start judging everyone in the same corner. And always remember, people have their reasons for doing what they do and saying what they say. We all have experienced different things in our lives, raised by different parents with different rules under different roofs in different countries or states with different amounts of love and abuse and access to money and God. No, it doesn’t make mistreatment right, but it should hopefully help you take a step back and put things into perspective. And when you do come upon someone that is racist, prove them wrong by showing them that you are not the stereotype they have created in their head. Good luck. ", "title": "", "parent": "1883", "creatorid": "f8b95309fd9f", "id": "6069eee00f65"}