{"name": "1885_6", "child": "", "content": "What the hell is a minority? Who goes around calling themselves a “minority”, seriously? Is that how YC refer to you guys as “minorities” and you accepted the moniker? I’m a black man and if I want to apply to the YC or they want me to apply, then they need to ask me as a black man to apply, not referring to me as a minority. That’s weird you would even refer to yourself or anybody as a “minority” — that is a white privilege phrase that has a bit of condescending and inferiority-perspective attached to it. Praising or name-dropping YC is just you saying you didn’t know how to approach your customer base directly and grow a business relationship with your customer base. All of the examples you provided, I seriously doubt they truly needed YC and could have just called the actual customer, industry trade groups and found more inroads than diverting over to YC that sound like an off-chain distraction. YC walked with you into a black barbershop or any barbershop? YC understand the background of why barbers choose their profession? Actually, the only thing you mentioned in your model was the “client” needing an appointment and that’s all I see in your offering — another scheduling workflow used to book an oil change is just ported to barbers. I doubt YC done much of anything to help your operation or business model or target base except prop up a “minority” like you to write a piece like this. No “minority” need to apply to YC because YC don’t even know “minorities” or even tried to immerse with “minorities” to know what to offer “minorities” in the marketplace, let’s be honest. Update: I just realize you wrote this “well-timed” article at the same time when other “minorities” like Ellen Pao and many women tech entrepreneurs are pulling out of YC due to Peter Thiel involvement with Trump. You wrote this bullshit as the token black to defend YC while they are being scrutinized by other “minorities”…shame on you. ", "title": "", "parent": "1885", "creatorid": "5a77c7abdf08", "id": "64ae6ee4fc22"}