{"name": "1894_1", "child": "", "content": "I’m sorry, Ré, it is true. Look at what happened to the community when Hurricane Katrina hit. Three days passed before anything was done. Why? Lack of compassion and unfounded fear about the black community. When I took my Diversity of Sociology class, we investigated racism as not so much a concept of color, but more of economics. It took the color concept out of it, and only dealt with statistics. It was then one found the correlation between marginalized groups and the gap of wealth, or lack of. My class consisted of many POC, with one or two white folk. One question was put forth to the students as to how one could help the black community out of poverty, with the perspective of the constant narrative of being poor and bring them up to the same level as their white counterparts. One woman spoke up, who was white and declared she knew how to fix the systemic problem of poverty. All of us students of color looked at one another, waiting for the magical cure. She stood up and said.. “ If we just got rid of all the apartments, it would help them out of poverty.” My instructor looked at her in a slightly strange way, while the rest of us just looked at each other, thinking “ how does getting rid of apartments help the black community?” And my instructor asked how this would help them. And she replied, “Well, it would force them to buy houses like us.” Of course, we all were stunned at the lack of comprehension this woman had as to the complexity of being poor, in addition to being a person of color. My instructor asked, how this would help in a sense of economics. She replied that it would force the black people to be responsible home owners and not waste their money on an apartment. Then the discussion opened up with EVERYONE involved. She just didn’t get it. She had dropped the class eventually. She told the instructor that she felt everyone in the class was blaming her for what has happened in the black community. We didn’t blame her. My instructor was good, too. Every time someone wanted to give their personal story from a discrimination standpoint, he wouldn’t allow it. Reasons being that those of the dominant group would cease to LISTEN once race came into play. And its TRUE. ", "title": "", "parent": "1894", "creatorid": "51c4ac2f46ba", "id": "43b252d3c87e"}