{"child": "", "title": "", "id": "6523f8f15f3e", "content": "Adams didn’t get much better or more involved in pick and rolls like Capela because, if you bothered to actually watch enough thunder games this year, they start the 2 worst offensive starters in the league (most of the year) in Roberson and Sabonis or a non shooter (Taj). Capela shares the floor with 3 knockdown shooters and harden. Kanter and Dre didn’t get better because no matter what Westbrook does, he can’t change the kinetic profile of Enes Kanter to transform him into something more than a chair on D. Or teach him how to shoot wide open 3s. As for Roberson, he can’t dribble, he can’t shoot and he is extremely shaky in contested finishes at the rim. He is a good cutter and that’s the only thing he does in offense on a level above YMCA. What did you expect from him? I’m honestly baffled by this. As for Oladipo, he’s not a good enough shooter (never was, not even on open 3s) to take the step forward. He’s not Bradley Beal and he never was profiled to be. His true calling card was his D, which was merely good this year all while guarding the second best wing. And he is undersized which forbids him from truly bothering guys like Klay, Harden or small forwards. As for his driving game, again it comes down to spacing. He is not an elite ball handler and he is not that big, so to try and operate around Dre, Taj and Russ isn’t even better than his situation in Orlando. The thing with okc that you keep forgetting is that all those breakout guys “shone” around two very good shooting forwards with an excellent defensive profile in Durant and Ibaka. That’s a totally different ecosystem and it’s ignorant to expect a leap from clearly flawed players in new surroundings that don’t even come close to a good fit. I can get behind the narrative that the Thunder were built to win with defense but their rating wasn’t anywhere close to elite. They weren’t like a top-3 defense and definitely had horrendous stretches against bad teams. Plus, thanks for greatly taking into account the late game dominance of Russ other than one mention in the first 3 paragraphs. ", "creatorid": "dca7619f1d8b", "name": "1917_17", "parent": "1917"}