{"child": "", "title": "", "id": "b7dfd17d7a85", "content": "Bill… just no. I fear that too many media members are going to overthink this award and give it to the wrong person. This is Westbrook’s season at the end of the day. He is the MVP. First of all, Harden should not get credit for Vegas being more wrong with their win prediction for the Rockets than for the Thunder. Especially when the reason for the low prediction was due to the fact Harden came into last year out of shape and the Rockets got off to a slow start and he couldn’t build chemistry with Dwight. This is just an anchoring effect and should not be taken into account. The only reason to vote for Harden at this point is because his team won 8 more games. If OKC finished with about 52 or 53 wins I feel like this wouldn’t even be a discussion. Now when you consider the fact that Houston has a legitimate COTY candidate, probably 2 of the top 3 sixth man candidates, and as you pointed out, every roster move was tailor made to fit Harden’s game, that is more than enough to account for the 8 game difference between Houston and OKC’s win total. Harden was put in a much better position to succeed this season which is primarily the reason his team won more. Also, Harden doesn’t get more credit for switching positions because it was the coach’s idea. In reality, Harden’s role didn’t change that much but with the coach designating him as the PG, it caused him to change his mindset, which is really great coaching in all honesty. Harden still had to execute, but a lot of the credit goes to D’Antoni here. Next point. Westbrook didn’t have D-League level players around him but you are overselling the talent he had. Again you are going off the basis that because the media hyped up some of these players because they had a few good games in the playoffs they should have been better this year. I’m not sure how he could have made Roberson better. Nobody even bothers getting within 10 feet of him and he still can’t hit anything. Oladipo became more efficient and is in over his head as a second option anyway. Enes actually played worse in the playoffs than the regular season last year and Adams played about the same. They played a couple good games against the Warriors last year and everybody thought they were ready to take a big leap when it really wasn’t the case. Adams and Kanter are what they are; just because they got big contracts doesn’t make them much better players. And seriously you are going to dismiss Sabonis as a wasted season? He’s a rookie what are you expecting? Lastly, as a Sixers fan, yes Ilyasova did suck. Why do you think he was traded another time before the deadline. He started off a little hot in Philly, but by the time the trade deadline came around we were happy for him to move on. At the end of the day, Westbrook averaged a triple double AND led the league in scoring at over 30 points a game, in less than 35 minutes per game! I don’t think we will ever see something like this again (unless it’s Westbrook) due to the pace the league is played at now and the fact that nobody plays 38+ minutes anymore. For all the talk about how Harden was more efficient, he only shot 1.5% better from the field overall, .003% better from three, and .002% better from the line on half an attempt more per game, and averaged more turnovers. Harden was much better in two point field goals due to the fact that Westbrook shoots a lot more midrange jumpers but that difference is not enough to overcome all of the other factors, imo. I don’t want to take away anything from James Harden. He had an incredible season that was historical in its own right, but there just happened to be one player who had a better year. ", "creatorid": "4b2779fdd0f5", "name": "1917_14", "parent": "1917"}