{"child": "", "title": "", "id": "995d6d068541", "content": "So I checked ASJA, and I’m not even sure if I can apply as an international writer and then even if I could, yearly membership comes $239, plus $50 initiation fee, plus $25 application fee. So that would be $314 for this one membership alone. I didn’t even look at SPJ, NASW, and IRE, since I guess that would be something similar. But I did look at the statistics and wrote about it in Do NOT Start Your Writing Career By Building a Website and it’s clear that most freelance writers today cannot earn a decent wage with one third of them living below the treshold of poverty. So such membership are beyond their reach and I’m not sure how they could solve our situation or change the previously mentioned statistics either. Can you please elaborate on that, for it seems that freelance career is fraught with expenses and extremely hard earned dollars. Please, do not tell me that this can all be attributed to poor work, lack of memberships, or incompetence. It’s not because we would choose to work for so little and be happy to work for peanuts, it’s because such is the market. The publishing market has been severely damaged and still threatens to destroy many publication in this time of online free everything for all. Major outlets, such as the Guardian, have to beg their readers to pay for subscription and reading. I find it a bit ‘not knowing what to say’ when you present your solution as ‘simply do not accept lower fees’ as if editors would then come begging to pay me more. Do please give me a working recipe on how to become one of those 9% of all freelance writers that make a good money and then explain how is it possible that there are less than 10% of them. And please, do not charge me thousands of dollars for a course on how to get there, since such courses have been around for years, yet the percentage in questions seem to keep getting down and not up… I sometimes wonder, it’s selling such courses to desperate newcomers the answer to how some writers manage to make a good living wage nowadays? Sorry for a bit of a rant, but lets not look away from the reality, numbers, and facts as well. It’s not all the bed of roses. If you can give an answer and good advice on how to change this, I’d be most glad to take it. ", "creatorid": "1dcd8c955ae9", "name": "1957_5", "parent": "1957"}