{"child": "", "title": "", "id": "b3f87cea5622", "content": "Composants de présentation et conteneurs Lien vers l’article original : https://medium.com/@dan_abramov/smart-and-dumb-components-7ca2f9a7c7d0#.flsaax995 Bismuth Il existe un modèle de conception simple que je trouve très utile quand il s’agit d’écrire des applications React. Si vous utilisez React depuis un moment, vous l’avez déjà probablement découvert. Cet article l’explique bien mais je veux ajouter quelques points supplémentaires. Vous trouverez vos composants plus facile à réutiliser et à conceptualiser si vous les classez en deux catégories. Je les appelle composants de Présentation et Conteneur* mais j’ai aussi entendu Gros et Maigre, Intelligent et Idiot, Stateful et Pur, Écrans et Composants, etc… Ce n’est pas exactement la même chose mais l’idée de base est la même. Mes composants de présentation : s’intéressent à quoi les choses ressemblent,peuvent contenir à la fois des composants de présentation et des conteneurs** et, généralement, possèdent des balises DOM et des styles qui leur sont propres,offrent souvent de l’intégration via this.props.children,sont indépendants du reste de l’application comme les actions Flux ou le stockage,ne spécifient pas comment les données sont chargées ou modifiées,reçoivent des données et des fonction de rappel exclusivement par props,ont rarement leur propre état (quand c’est le cas, il s’agit d’un état d’interface plutôt que de données),sont écrits en tant que composants fonctionnels à moins qu’ils ne nécessitent un état, des actions lors d’un cycle de vie ou des optimisations de performances.Exemples : Page, Sidebar, Story, UserInfo, List Mes composants conteneurs : se préoccupent de comment les choses fonctionnent,peuvent contenir à la fois des composants de présentations et conteneurs** mais ne possèdent généralement pas de balises DOM propres à l’exception des balises div qui les entourent, et ils n’ont jamais de styles,fournissent les données et le comportement aux composants de présentation ou aux autres composants de contenu,appellent des actions Flux et les fournissent aux composants idiots en tant que callbacks,sont souvent d’état car ils tendent à servir de source de données,sont habituellement générés en utilisant des composants de plus haut niveau comme connect() de React Redux, createContainer() de Relay ou Container.create() de Flux Utils plutôt qu’écrits à la main.Exemples : UserPage, FollowersSidebar, StoryContainer, FollowedUserList Je les mets dans des répertoires différents pour en faire une distinction claire. Bénéfices de cette approche Une meilleure séparation des problèmes. Vous comprenez mieux votre application et votre interface en écrivant les composants de cette manière.Une meilleure réutilisabilité. Vous pouvez utiliser le même composant de présentation avec des sources de données complètement différentes, et transformer celles-ci en différents composants de contenus pouvant être réutilisés ultérieurement.Les composants de présentation sont essentiellement la “palette” de votre app. Vous pouvez les mettre sur une simple page et laisser le designer y apporter ses variations sans toucher à la logique de l’application. Vous pouvez lancer des tests de régression à base de copies d’écrans sur cette page.Cela vous force à extraire les composants de mise en page tels que SideBar, Page, ContextMenu et utiliser this.props.children au lieu de dupliquer les mêmes balises et mise en page sur plusieurs composants conteneurs. Souvenez vous, les composants n’ont pas à émettre du DOM. Ils ont seulement besoin de fournir les limites de compositions entre les UI concernées. Tirez profit de ça. Quand introduire des conteneurs ? Je vous suggère de commencer par construire votre application juste avec des composants de présentation. Vous allez bientôt réaliser que vous passez trop de props à travers les composants intermédiaires. Quand vous remarquez que certains composants n’utilisent pas les props qu’ils reçoivent mais les font suivre simplement en dessous et que vous devez refaire tous ces composants intermédiaires chaque fois qu’un composant enfant à besoin de plus de données, c’est le bon moment pour introduire quelques composants conteneurs. De cette manière vous pourrez obtenir les props de données et de comportements depuis les composants feuilles sans toucher aux composants qui n’ont rien à voir. C’est un processus continu de refactorisation donc n’essayez pas d’atteindre la perfection dès la première tentative. En appliquant ce modèle vous développerez un instinct pour identifier quand extraire certains conteneurs, tout comme vous savez repérer quand abstraire un traitement en fonction. Ma série d’article gratuits à propos de Redux sur Egghead peut aussi vous aidez à ça ! Autres dichotomies Il est important de comprendre que la distinction entre les composants de présentation et les conteneurs n’est pas technique. Il s’agit plutôt de distinguer leur fonction. En revanche, voici quelques distinctions techniques reliées (mais différentes !) : Stateful et Stateless. Certains composants utilisent la méthode setState() de React et d’autres non. Vu que les composants conteneurs tendent à être stateful et que les composants de présentation stateless, ce n’est pas une règle difficile. Les composants de présentation peuvent être stateful et les conteneurs peuvent être stateless aussi.Classes et Fonctions. Depuis React 0.14, les composants peuvent être à la fois déclarés en classes et en fonctions. Les composants fonctionnels sont plus simples à définir mais il leur manque certaines fonctionnalités disponibles seulement avec les composants de classes. Certaines de ces restrictions pourront disparaître dans le futur mais elles existent aujourd’hui. Parce que les composants fonctionnels sont plus simples à comprendre, je vous suggère de les utiliser à moins que vous ayez besoin de spécifier un état, d’intervenir sur le cycle de vie ou faire de l’optimisation de performance, ce qui n’est disponible que dans les composants de classes pour le moment.Pur et Impur. Les gens disent qu’un composant est pur s’il garantit de retourner le même résultat en ayant les mêmes props et le même état. Les composants purs peuvent être définis à la fois comme des classes ou des fonctions, et peuvent être stateful ou stateless. Un autre aspect important des composants purs c’est qu’ils ne reposent pas sur des changements profonds dans les props ou l’état, aussi leur performance de rendu peut être optimisée par une comparaison superficielle dans le hook shouldComponentUpdate(). Actuellement, seules les classes peuvent définir shouldComponentUpdate() mais cela pourrait changer à l’avenir. Les composants de présentation et les conteneurs peuvent tomber dans l’une ou l’autre de ces catégories. Selon mon expérience, les composants de présentation ont tendance à être des fonctions pures et sans état, et les conteneurs des classes pures et avec un état. Toutefois c’est juste une observation et non une règle, et j’ai vu des situations où le contraire était adapté. Ne suivez pas la séparation des composants de présentation et les conteneurs comme un dogme. Parfois cela n’a pas d’importance ou bien il est difficile de dessiner la ligne de séparation. Si vous ne savez pas si un composant spécifique doit être de présentation ou conteneur, il est peut-être trop tôt pour décider. Ne vous faites pas suer. Exemple Ce gist par Michael Chan l’illustre très bien. Lectures complémentaires Getting Started with ReduxMixins are Dead, Long Live CompositionContainer ComponentsAtomic Web DesignBuilding the Facebook News Feed with Relay Notes * Dans une précédente version de cet article je les ai appelés “intelligent” et “idiot” mais c’était excessivement sévère pour les composants de présentation et plus important encore, cela n’expliquait pas vraiment la différence de leurs objectifs. Je préfère les nouveaux termes et j’espère que vous aussi ! ** Dans une précédente version de cet article, j’ai affirmé que les composants de présentation ne devaient contenir que d’autres composants de présentation. Je ne pense plus que ce soit le cas. Qu’un composant soit de présentation ou un conteneur n’est qu’un détail d’implémentation. Vous devez être capable de substituer un composant de présentation par un conteneur sans modifier aucun appel. Par conséquent, les composants de présentation ou les conteneurs peuvent contenir d’autre composants de présentation ou conteneur sans problème. Traduction : Brice Favre Relecteurs : Frank Taillandier et Goulven Champenois ", "creatorid": "5fc528d86144", "name": "1996_25", "parent": "1996"}