{"content": "The total transformation and consciously control the way we think will offer the philosophical foundation for the observations referred to in this excellent article. The Ten Steps for total Transformation to a Blissful and Joyous Existence. By Mahmoud Nafousi It’s time to conquer the world with inclusiveness, creativity and generosity. Joy is our nature, misery is our own failings. Attitude should not be confused with consciousness. Changing our thoughts or thinking is not the same as changing our consciousness. Positive thinking leads to change but not transformational. The latter happens only if we realise that we need to be in harmony or unity with the Cosmic or Divine conscious. To understand what Cosmic conscious we need to understand or rationalize the best we can the nature and purpose of life. Let us assume that there is an Intelligent Designer behind creation. If we utilize the current evolutionary and genetic knowledge, we can rationally assume that the Great Designer could have created the “Seeds of Life” and planted in the genetic code the full maths and scientific knowledge to guide the evolutionary process to end up with the human intellect. Let us also assume that the purpose of creating the human intellect with almost a perfect machine to support it is to enable humans to work as group to advance knowledge to control the physical environment necessary for securing joyous living. From these two assumptions then we can deduce that Cosmic conscious is the equivalent of an operational manual to guide the human family to think joyfully and work harmoniously in a group setting to be creative for the betterment of our planet and. ultimately the universe. We experience cosmic consciousness only when we manage our intellect, emotions, activities and energies in the correct proportions to experience inner joy. On the other hand “positive change” alone leaves a residue of the past and undoubtedly will influence future thinking no matter how small that may be. The personal transformation, which we must all seek, means that nothing of the cloudy past will remain, as a new approach to thinking and looking at things takes hold. If one wants to be a successful doctor he needs to study for almost 10 years including rigorous training plus continuous update……. ", "child": "", "parent": "19", "title": "", "creatorid": "ae1d78f4a9a0", "name": "19_22", "id": "3f2e567124fb"}