{"id": "84b774aa03dc", "name": "1_5", "parent": "1", "title": "", "creatorid": "b5053511cc00", "child": "", "content": "“It should be clear to anyone who’s paying attention that this story is not about customer service. It’s about income inequality. When you get down to it, like everything else in America today, this is about the haves and the have-nots.” Clearly you are the one not paying attention — to anything, ever, in history — which is dominated by have vs. have-not rhetoric and how various civilizations dealt with inequality. For centuries, it was largely based on royalty and nobility — to be wealthy, you must be born into a noble family. The advent of free-market capitalism, and rise of America, spat in the face of that idea. Here you are given the freedom to pursue your own success and happiness, not born into a pre-determined caste. True, income inequality is rising, and the U.S. is starting to too closely resemble the “few at the top” models it originally broke away from, but to indicate that this is an American/today problem is so incredibly naive it detracts from any other valid points you may have made. This has been a central issue every society has had to deal with ever, and it’s not easily solved or going away. But I digress, as you should, because you are also wrong in your first point— this isn’t about income inequality at all. It is, in fact, about terrible customer service (in this case that phrase is indeed too light, more like blatant disregard for human decency). Your title claims it isn’t about customer service, but the entire second half of your post is quite literally a description of bad customer service (big corporation prioritizing profit over common decency to customer) not income inequality. If United gave a shit about any of their customers, this would never happen to one of them. The fact that it happened to anyone is horrific, regardless of that person’s income (which, I would imagine/hope, is above the national average, given that he’s a doctor, so why the hell are we still entertaining this premise?). Companies offer incentives for loyalty and employ product/class differentiation all the time. Most are just able to do so without busting a guy’s face on their product and dragging him out of their store. Some companies (in plenty of cases airlines and almost always United) are just shitty and have terrible customer service track records (which United certainly does) and deserve all the ridicule they are getting and more. Not because this guy didn’t have status, but because they are a terrible company. Not everything is about “Class Warfare”, despite what the Obama coalition will have you believe. "}