{"child": "", "title": "", "id": "4e1d11836f26", "content": "Good grief, are we even talking about the same Led Zeppelin? “Most flamboyant” would easily go to groups like KISS or even The Rolling Stones (the former, onstage and the latter, off), while “best band ever” is a fightin’-words tossup between The Beatles, Pink Floyd and The Allman Brothers Band, with a lot of other contenders topping out Led Zeppelin, magnificent as they were. “Expensive”? WTF???? In what sense, on what planet, under the influence of what hallucinogens, could the music of Zeppelin ever be described meaningfully as “expensive”? What does this even mean? This is a mismatch of adjective and noun like “arid swamp” or “tolerant liberalism” (couldn’t resist…) Go back and listen to their early performances on BBC in the sixties, and you find that their music was way more tightly-composed and thoroughly-rehearsed than their megahits of the seventies let on, and that their instrumentations and voicings hardly changed at all from the fundamental jazz/blues structure of, guitar, bass and drums (with occasional Fender-Rhodes or Hammond B3) throughout their career. While Yes was filling the stage with schmancy keyboards, and Pink Floyd filling whole stadiums with pyrotechnics and special effects and flying pigs, Led Zeppelin was playing a slightly-modified updating of Chicago blues hybridized with the folk sounds of the British Isles. One might argue that Jimmy Page’s double guitar or John Henry Bonham’s outsized drumkit plus tympani were “expensive”, but the music itself was as straight-ahead in rock terms as Count Basie’s was to jazz. I just got done lacerating another FSR author who posted a list of great films about Texas which left me wondering if he’d ever been there; this millennial absurdism above makes me assume, similarly, that its author was born decades after sex, drugs and rock and roll were the ethos of a generation, and has not an earthly clue what he is talking about. ", "creatorid": "bdc93f756837", "name": "2025_7", "parent": "2025"}