{"child": "", "title": "", "id": "16b525e569f6", "content": "Thank you Lawrence for a thoughtful and well written article. Thought provoking articles are why I love Medium and the writers that contribute here. “Whereas the craftsman mindset focuses on what you can offer the world, the passion mindset focuses instead on what the world can offer you.” This is probably the one quote in your article that sums up what I disagree with. I do not believe that a “passion mindset” focuses on what the world can offer one. I believe the passion mindset is simply following what matters to you most. What you cannot stop thinking about. A true craftsman only becomes a master of his craft because he has a passion for doing it. Any one of us that does not love what they do, is not passionate about it, will not put in the massive amount of time and effort to become that master craftsman. I don’t believe that the craftsman mindset or the passion mindset are separable but they are reliant on each other for one to become a master at what they are passionate about. I do not believe that “what you can offer the world” or “what the world can offer you” enters into the equation at all for what we are passionate about. This is simply a state of human nature. Does one care more about others or themselves? Are they more giver or more taker? Are they more provider or more consumer? One may be passionate about helping others less fortunate than themselves or making beautiful music. Both actions will take an immense amount of work to accomplish and a substantial amount of love to create as well as passion to stick with the endeavor through the hard times that will inevitably come one’s way. Helping others is driven by love of others. This is the outward mindset. This drives the thought “What can I offer the world?” Love of self over others drives the mindset of “What can the world offer me?” This is just plain selfishness. Making music is driven by a love for music and a desire to create. An artist creating a painting is their desire to put on canvas what they see in their mind’s eye. A sculptor sees the beautiful statue in the block of marble and removes the rocks that shouldn’t be there to release the beauty within. This applies to wood carvers or pottery makers as well. None of these creative artists take into account, at the time of creation, anyone that will see or hear their creation in the future. Mind you, this does not make them selfish or giving in their art or creation or passion. When the creation is done, whether they share it with the world or keep it to themselves shows whether they have a greater love for others or themselves. That was about 5 minutes longer than I intended so to summarize; The Craftsman and passion mindsets are reliant on each other. One MUST have passion for their craft in order to put in the long hard work of becoming a master of their craft. The ideas of “What can I offer the world” and “What can the world offer me” reflect the mindsets of a loving giver or a selfish taker respectively. They are the basic drivers of every human on the planet. Which one we allow dominance is up to each of us. I for one will be part of the former group. Peace! Phillip Dorris Founder, Freedom Life Solutions. ", "creatorid": "439b958521a8", "name": "2026_6", "parent": "2026"}