{"child": "", "title": "", "id": "8a864d10a1ce", "content": "Hi, Jon, thanks for sharing your perspective on this issue, which I have struggled with for a long, long time. I don’t remember ever thinking I was not a creative person. I left college, my home, family, and friends, and bought a one-way ticket to Los Angeles to cut my chops as an aspiring singer-songwriter, multi-intrumentalist, performing musician, and recording artist. I worked hard every day, gaining skills I never knew I would need (Photoshop, DreamWeaver, et al) with the goal of attaining the elusive Major label Recording Contract, but it never happened. Even then, starting in the mid-90s, audiences hated paying a ridiculously low $5 to see a live music act. Coincidentally, CDs and MP3s were rapidly replacing analog recordings, which lead to illegal file sharing, Napster, and so on, while wages for typical workers stagnated at 1989 levels (they still have not risen) and everything else went up astronomically in price. My husband is a master guitarist who played in bands in the late 70s and early 80s, a time when he could work five nights a week and make enough money to rent an apartment, buy a car, pay all his bills, and still have plenty of party money — playing mostly original rock and roll. The last two superstar rock bands to come out of L.A. were Guns ’n’ Roses and the Red Hot Chili Peppers. Since then, all the newer major music stars are rappers, R&B artists, and pop acts, all of whom are picked, primed, prepared, produced, and productized to the whims of an ever-broadening “music” industry that makes bazillions of dollars each year while even these highly paid celebrities must grub and grind for every 0.00084 cents they can get. Inside the industry, female artists are actually termed “short-term person-brands” because they are considered more high-risk than male artists (but don’t take my word for it, check out Kristen Lieb’s 2013 book). It is a token, winner-take-all industry that mimics the rest of capitalist America, and these tokens might actually believe that because they’re the richest and the most famous artists, they are the most talented. Furthermore, they know they are role models to upstart artists and those who have been slogging it out for, yes, decades. These hopefuls, as I once was, live on couches, eat food that is cheap and low in nutrition, and work crappy jobs they hate just so every dollar they earn can be spent on making music and products to pitch themselves to an industry that, in essence, only needs them to keep paying to prop up their dreams so they prolong the mythical notion that stardom is within their reach. As the veil was lifted from my eyes — slowly, painfully — I realized that I was never going to be the kind of musician or songwriter that the music business wants. I drew my line in the sand: my creations are for me and my soul’s expression, not for some “sex sells,” bottom-line executive to manipulate note by note, word by word, chord by chord. To be fair to myself, I do enjoy sex when I’m not bound by contract to strut it live and on film to the masses for their “why do I have to pay for this?” pleasure. If that makes any sense. Eventually, my husband and I moved out of L.A. when he graduated from college and got a job as a board certified music therapist. I started teaching private music lessons and doing photo editing and graphic design to make a living, and my life was transformed into a beautiful cycle of giving and receiving. These days, my husband and I have two bands; we write, record, and perform music purely to please ourselves. Okay, I’ll admit: we sometimes make music just to piss off the music industry, bwahahahaha! After all, we irreverently named our rock band We Play For Cash — and you and I both know, that ain’t really happenin’ so much. For what it’s worth, you can hear (but not download) our entire recent CD for free on our website music page. That way, you and I will be closing in on being even since I will have read at least 40 minutes of your articles on Medium.com by the end of May this year. We won’t bother to discuss how long it takes to write a five-minute article versus writing and recording a five-minute song, because, frankly, creating good stuff simply takes as long as it takes :-) If you are interested in reading about my Rhetorical Criticism perspective on the music industry, here’s another freebie for you that I wrote as my college senior project (yeah, I went back!) prior to graduating in March 2016: https://works.bepress.com/sharine-borslien/1/. This BePress site has all my longer works of scholarship, most of which include music as the main topic (as in my Led Zeppelin projects) or an important component (as in my Calling All Rebels paper). Thank you for your contribution to creativity, Jon, and keep up the fab work/play. ", "creatorid": "521c304e720c", "name": "2029_18", "parent": "2029"}