{"child": "", "title": "", "id": "9311a0e907b5", "content": "Creatives are fucked. And it may be too late. You could say this about anyone. How many people will get automated out of a job this year? Probably a lot. We’re probably fucked because of capitalism and won’t be unfucked until income is divorced from labor. It’s also becoming increasingly difficult to look at publishing online or being an artist or recording music or starting a publication as a full time career. Wasn’t it harder in times past, when you had to clear more hurdles and pass more gatekeepers? If you do want to get into creative work, you’re going to have to see it as a side hustle. Not your main gig. That’s just the way it is. It could become your main gig — if you’re very, very lucky — but the chances are slim. It’s hard to make it work. But that’s the case for most content creators. Film makers. Artists. Writers. Musicians. We’ve made it easier than ever to make stuff, and harder than ever to make enough money to live. And every day, there’s a new “disruptive” startup that does more damage. But, is that really true? How many people made a living writing in 2000 compared to now? How many people made a living as a YouTuber in 2000 compared to now? What they “disrupt” is creator’s profits, most of the time. That’s what music streaming did. They chiefly disrupted the distributor’s profits. These disruptive technologies are, more often than not, just new forms of distribution. We don’t see new record company moguls like David Geffen appearing anymore, but we do see generic media distribution and tech moguls on the rise. To put it on a macro scale. Nicki Minaj, for example, has 77,000,000 Instagram followers consuming her free social content. 77,000,000 followers, and her last album sold 800,000 copies. That means that barely 1% of her followers actually purchased an album. The rest? Streaming it, YouTubing it, just following without buying. If a mega star like Nicki Minaj has a conversion rate that low for actual sales, what does that mean for indie creators? Some folks are going to point out that people don’t buy albums anymore, they stream them. Sure. In 2015, Drake made $15,000,000 from Spotify streaming. Nice cash right? Yes, but it took close to 2 billion streams to make that. This is the old paradigm being worn away. Maybe Nicki Minaj can’t monetize like Madonna could, but has the total mount of money for all musicians everywhere gone up or down? For every megastar, how many musicians are able to collect a few hundred or thousand here or there that couldn’t have made one thin dime in previous eras? Maybe it’s better, or maybe it’s worse. I don’t know. And let me tell you, people spend a lot less on writing than they do on music. How does a writer live, on the money we’re talking right now? To bring this thread back home, we’re basically abolishing the full time musician/writer/filmmaker. We’re abolishing the full time creative. That’s what’s happening. I’m not convinced that’s true for musicians. You just can’t rely on album sales anymore. Musicians have to get out and put on shows. People still line up to go see live shows. Nicki Minaj was pulling $250,000 a show in 2014–2015. Drake was over $350,000. Even if you can only make a tiny fraction of that, say $250 or $350 a show, you are off and running. Three shows a week at a mean of $350/show puts you ahead of the average American in terms of weekly income. That’s not easy to pull off, but it’s not impossible, either, and with the ability to manage and market yourself via YouTube and social media, and with music production costs having dropped through the floor starting in the 1990s and onward, it’s something people can do today that wasn’t as easy in the past. All that said, I’m just saying I’m not convinced. I’m not saying you’re wrong, but I do not believe you have presented enough evidence to make this a convincing argument. We’re giving money to tech platforms to become “Unicorns” off the backs of creatives, and driving creatives out of business. We were always doing that. The “unicorns” were just called things like EMI or Random House or Simon & Schuster or Columbia Pictures. Creators could expect a tiny fraction of total sales. For authors, it has long hovered around 10%. Established authors could also expect an advance, but we’re talking about a tiny fraction of sales. If you grew up dreaming of being an artist, a writer, a musician, honing your craft, putting in your “10,000” hours, you may not even have the necessary skills to get a full time job to support your creative work. So what happens then? I guess you would have to ask someone like Lindsey Stirling. I would rate her success as a musician as basically impossible before YouTube, whereas now it is merely improbable. The thing is, it’s hard to do great creative work at the end of the day when you’re tired and worn down by trying to make a living in a day job, in a business that you’ve founded to bring in income etc. Couldn’t agree more. And then when you do get to create something, and you put it out for the world to see, if it’s free you’ll get a bunch of people who hate it, and if it’s not you’ll be called money hungry. Sure, these same people blast LeBron James for being terrible at basketball because he missed a shot or complained about a call. You really can’t take what the Comments Section says too seriously. We’ve screwed creative people over. We started doing that years ago, and I’m worried that it’s now too late to change it. My point is just that it has always been that way. Creatives have always been getting screwed over. A majority of people in a majority of places have always been getting screwed over. Capitalism is the screw-over methodology of the day, and it applies to creatives just like it applies to laborers. So the next time someone tells me about their disruptive music startup or publishing startup or filmmaking platform, you’ll forgive me if I look like I’m going to punch their teeth down their throat. It almost has to be philanthropic to have any hope. If Bill Gates came out and told you the Bill Gates Foundation was investing billions of dollars into making a content distribution platform that gave 100% of revenue to content creators and workers for purposes of the betterment of humanity, with no profit motive for him, maybe you’d be interested. Until then, you’re right to be skeptical. ", "creatorid": "13b39719d612", "name": "2029_10", "parent": "2029"}