{"creatorid": "7a9a9e0e72e1", "parent": "2093", "name": "2093_3", "content": "Wow. I went though a similar thing. Ending in a “lay off” though at my last employer, a broadcast TV station. I remember being young applying for a job there as a news photog. So so very much wanted to work there. They had a swimming pool! I didn’t get it. I’d have to work in the area for over 15 years before I got in there as an engineer. I loved it! And then the world started going to shit in 2008. I started to see my job and everything about “the media” as a poison to our democracy and society. The place I aspired to work in the 90s later revealed itself as just another churn of bread and circuses. “News.” Whatever. Its local TV like this place and every other that keep criminals in office. Instead of really investigating these maniacs we now call “leaders,” they only ask softball questions so they can keep “access” to these monsters. If reporters don’t play nice, the competition will. “Access denied” if you have a rep for hardball. You won’t get past the gatekeepers. Never watch local news if you want the real story. Unless it’s a story about how legitimate protesters are “rioting.” The People are always an easy target. We have no gate keepers to worry about. We’re all dime a dozen in their lens. They work for The Power. Not the constitution. So yeah, be careful what you wish for in a career. Put it into the universe long enough, it will show up for you. Whether it’s what you really want when it does, though, can either be joy or absolute dissolution. I don’t even attempt long term career goals anymore. Right now I write. I’m going to until I can no longer afford to or it starts paying me. Very few of us stay the same person decade to decade. I’m no where near the same man I was 20 years ago. Nothing lasts forever. Certainly not philosophy or worldview for those paying attention and making necessary survival adjustments from the zeitgeist. We all compromise to our conditions. Sometimes it's a compromise toward what’s better for our souls instead of what pays the bills. Whichever direction alleviates the most pain usually wins. We spend a lot of time at “jobs” or the work we choose. Our time is something no one can give us back. Our work must have rewards other than a paycheck. What is the point otherwise? ", "child": "", "id": "7842df9fd7f5", "title": ""}