{"creatorid": "24521b06ed51", "parent": "2096", "name": "2096_17", "content": "Over the recent holiday weekend, four dozen people were shot in Chicago. Many died. Do you think the families of those people are more concerned with stopping the criminals or with disarming the law abiding? they aren’t the same thing, after all. All the studies show the same thing: most of the gun violence is caused by a small number of men. And the police have a very good idea who those men are — drug dealers, gang members, thugs, thieves, neighborhood toughs, career criminals. In NYC, Giuliani instituted the stop-question-frisk policy against these kinds of men. Stop them on the street, ask some questions; if there is a suspicious bulge, frisk them. If their answers are suspicious, frisk them. Many guns were confiscated; gun crimes declined; lives, mostly black lives, were saved. Very few men were inconvenienced. Now here’s the essential paradox that people like Abby Norman won’t deal with. Giuliani’s policy was deliberately rescinded, even though the certain result was more illegal guns on the street, more gun crime, more deaths. Why so? Because the policy was judged to infringe on the rights of these men to not be stopped without probable cause. That’s it; that right was judged superior to the right of the community to have less gun crime and fewer deaths. So here we have a relatively few men subjected to a minor inconvenience for a few minutes, with the huge payoff of less gun crime and fewer deaths; but that benefit is judged not to be worth that small infringement of their rights. Yet, yet, those same people who make that judgement consider the large and permanent infringement of the second amendment rights of tens of millions of people, with zero impact on gun crime and deaths (as shown by US statistics wherever gun laws are most strict), is acceptable to them. Let’s say it again. The minor infringement of rights of a small number of career criminals in having their illegally carried guns confiscated, resulting in fewer dead victims, is too much for the Liberal psyche to endure. The permanent infringement by gun control on tens of millions of law abiding people, resulting in zero impact on gun crime, suits them just fine. If you are willing to infringe the Bill of Rights, Abby, why not go right to the problem — make membership in a gang illegal. Make having a string of arrests and convictions be sufficient probable cause for future frisking. Make illegal immigrant membership in the MS-13 gang grounds for immediate deportation. Make it illegal for any person residing in the US illegally to own a gun. There are many things we could do that would certainly decrease gun crime, once we agree that infringing the Bill of Rights to some degree is worth the price. So tell us all: why is it only permissible in the Liberal mind to infringe the rights of the law abiding, but not the career criminal? ", "child": "", "id": "39cf8d83fc1e", "title": ""}