{"creatorid": "dda585aca75d", "parent": "2096", "name": "2096_6", "content": "Problem with gun control is the criminally minded though. Mind you, I’ve been shot. And gun control sounds like a good thing. However. Gun control laws are only followed by those who currently follow rules and regulations. You still have a criminal element in the world. If there weren’t, there wouldn’t be prisons. The law says not to steal, but we still have shoplifters. The law says assault is illegal, yet we still have this who assault others (including rapists). There is one way, truly, to stop gun violence, but no one mentions it, and even if they did, no one would advocate for it. And that is to make any firearm, person specific. By this, I mean, that when a person chooses to purchase a firearm, they must be hand printed, this will then be used to make a firearm useless, unless you are the person it is designed for. A person can still purchase a firearm at Walmart, the local mom and pop gun shop or at a trade show. It still allows (and actually gives a longer period) for background checks of mental instability, violent behavior, terrorism plots, etc. And it still allows those you speak of, the normal american, the ability to purchase a firearm. It eliminates the possibility of a home invader from breaking into a house and stealing someone’s guns. It eliminates a person from being able to buy a weapon on the “black market” to commit mass murder (as all firearms with the exception of antiques, would have to be destroyed). And it helps to further prevent mass murders by those of criminal intent. Of course, Omar Mateen, had been cleared from the FBI watch list, and this is what enabled him to buy an AR-15 in less than an hour. However, if he’d been required to have his hand printed, and wait for the manufacturer to make a firearm for him, we would not have had to mourn the death of 50 more people. And then there’s the problem of 3D printers, which can print enough firearms for a small army, that is small enough and light enough to carry multiple firearms at one time, not to mention that they’d made from plastic which is undetectable by a metal detector. So, with each printed handgun, a person can fire 3 shots before they melt currently. There were 50 people killed in Orlando. That means a person would only need to print approximately 15 small handguns to do the same damage — to create the same carnage. I understand your anger. I probably understand your anger better than you understand your anger. These tragedies should have us angry. But more gun control laws is not the solution. Weeding out the criminally minded from getting a firearm is the solution. However, since we don’t have any kind of “test” which would tell us who the criminally minded are. So the solution boils down to making firearms that human specific. And by doing this, it would also eliminate senseless accidental child home deaths in the process. ", "child": "", "id": "d20aaefb538d", "title": ""}