{"content": "We must support middle-out policies like higher wages for everyone, higher taxes for corporations and the wealthy, and sensible regulations on business. Yea, that’s not going to work. Higher wages are great, but when exporting jobs and importing cheap labor is so easy, it’s not going to happen. You won’t get higher wages in America by promoting globalist economic policies, you get a leveling of wages in which Americans will always lose. We currently have the highest corporate tax rate in the world, and it’s only made things worse. Larger corporations can just locate elsewhere, anywhere outside the US will give them a tax break, so why stay? Smaller corporations cannot compete as well, cannot pay high wages, and get bludgeoned by the tax man. It’s almost like the US tax policy is designed to drive businesses out of the country or out of business. The self-employed and sole proprietors are hit the hardest. I hear everyone ask for higher taxes on the wealthy, and yet the top 1% pay about 40% of the total federal income tax collected, and the top 5% pay 60% of that revenue. You won’t improve revenue without taxing the middle class even more (like that guy that was dragged off the plane). So the entire argument for taxing the wealthy is really just the elites trying to squeeze the middle class, which has already lost much of its inflation-adjusted earnings, even more. THAT is class warfare, dressed up in populist clothing. If you really want to tax the wealthy, you would be talking about instituting a wealth tax. Assets minus debts = wealth. We don’t tax that, because then you cut into the elite’s stock, but you could. You can exempt enough so nobody is threatened with the sale of their primary home to pay the tax, and you would be ACTUALLY taxing the wealthy, instead of just dumbing-down “wealthy” to mean an income over $70,000/year because that’s how you get lots of revenue when you’re only taxing income. The other thing that is in the way of higher incomes is federal regulations. You’re going in the same direction it’s been going for a couple of decades now (more and more regulations), and it’s making things worse. All those mandates cost money. The paperwork alone required to comply with the mountains of regulations is very high. Of course, if you’re a large multinational corporation you can absorb those costs easily. So, again, they fall on the small businesses, which are then less able to compete, less able to pay better wages, and more likely to go out of business. ", "child": "", "parent": "20", "title": "", "creatorid": "bc292738095f", "name": "20_9", "id": "4d83d80ade36"}