{"title": "", "child": "", "parent": "2116", "creatorid": "6589e7fc9d9d", "content": "Having turned down an invitation from Miles to join his band (it happened to arrive simultaneously with Wayne Shorter’s invitation to join Weather Report, which I preferred to do!), I’ve often talked with Herbie about the dynamics of performing with The Chief. A recurring theme, aside from the truly bizarre lifestyle that he maintained, was the fact that he (almost) constantly led one to grow by throwing obstacles in your path. Herbie told me about a time when Miles saw/sensed/heard/felt that Herbie’s ideas were not flowing comfortably during one gig. Silently, he slipped around behind and ventriloquized for him to emphasize a different note in the bottom register of the keyboard — a note that had nothing to do with the composition’s key at all. Nobody in their right musical mind would have done that during a solo, but a suggestion from The Chief (as us jazz cats used to refer to Miles as…) was not to be ignored. Therefore, Herbie went for the note and it immediately clashed with the entire event, pulling the rug out from under the band’s feet! As the band-members were forced to shift from “comfort” to “survival”, Herbie was then inspired to somehow “turn that poison into medicine” and create a musical contingency plan/solo which took the composition and band to altogether another dimension of brilliance which the audience (and colleagues!) had never experienced before. Once the song was over, Miles looked at Herbie and silently said, “See?” On the road in Europe with The Manhattan Transfer during the summer of ’89, we often opened festival concerts for The Chief’s band. His band consisted mostly of top New York City players, so we would all hang out at the festival hotels, during sound-check and, personally, I wouldn’t miss any of their performances! After one really cool show came to an end, I noticed Miles talking to Adam Holzman, keyboardist and musical director, before he left the stage. The conversation was short and Miles left the stage laughing, after their brief exchange. As Adam walked towards the stage exit, where I happened to be, he, however, did not look happy. “Dude…slammin’ show, man!”, I told him… “What’s up?” He looked at me in the eyes and said, “He came over and said, ‘Adam, you’re playing it wrong!’” When adam, sincerely concerned, had asked him, “Which part, Miles?”…The Chief had immediately replied, “Everything!”…and, then, burst into raucous laughter all the way off the stage. Between that night and the next show, Adam completely re-formulated the band’s concept, writing fresh arrangements for every musician, including himself. This new concept wasn’t rehearsed before the subsequent show, but rather, launched mercilessly point-blank, in front of the live audience. Typical of a slick New York band, the cats went for it, pulling no punches… and slayed it! I witnessed this show, and can attest to the fact that it was awesome! And, I also caught The Chief sending a couple of one-second smiles over to my friend, Adam. A mentor helps you to perceive your own weaknesses and confront them with courage. The bond between mentor and protégé enables us to stay true to our chosen path until the very end. Daisaku Ikeda Between a Master and a disciple the question is not of knowledge but of being. Osho ", "name": "2116_1", "id": "ddb87d98963e"}