{"title": "", "child": "", "parent": "2133", "creatorid": "733947a13db5", "content": "5 easy & practical things men can do for their women It is rare to read something which makes you meditate for long. This write-up (‘Depression Is An Illness, Not A Weakness’) has been one such instance in a long time. 3 aspects about it are commendable in specific: 1. It talks from direct experiencing 2. It talks of social reaction 3. It talks about a scientific treatment. On top of it all, it shares the insight on a difficult subject from the perspective of a woman. Certainly, the two genders may react very differently to a similar looking problem. This is something everyone, essentially we men, must know. Further, specifically in this context I believe I have something significant to share and this is essentially for all men. 5 practical things men can do to support their wives, mothers, daughters, sisters, and friends suffering from stress situations or a mental illness. Listen: This is very important, though difficult for most men. In fact it is the most important thing to be done. Just simply learn to listen without offering any solution. Men either completely ignore this idea or tend to forget it totally. Please don’t. Learn to listen quietly, without looking away and you will see the lady making 90% recovery by herself. 2. Take them shopping: Yes, they all love it without distinction. It’s their preferred stress-buster. Sure, it may damage your wallet, nevertheless, a temporary damage is certainly much better than a permanent one which a mental illness or persistent stress may cause. 3. Cook them something to eat: Man! This is ultimate. It could be anything. Soup, butter-toast, juice or something truly special from your cook book if you have one. I tell you… they will adore it. You will see how quickly they bounce back. Remember that this little gesture of yours will sure touch them within. Plus the taste of the cooking would be a non-issue; so that should be the motivation enough for you to indulge into this. From the morning kitchen. 4. Give them your time: Take them swimming, go out for a drive, watch a movie of their choice, get them some gifts, go dinning, take a vacation — in nutshell, depending on your budget, other conditions and situation permitting, choose something in which you give them your time — the whole of it. This tells them, you care and that’s something extremely important for women. 5. Give them strength: Now here you will have to find the methods that work. Thus you may have to experiment. I have seen, gently massaging the forehead or running your fingers through their hair is liked by most. Plus I have seen elderly ladies, Moms essentially, as they age, they like foot massages as well as tender rubbing of the palms. So do young women post pregnancy! In case of Daughters, they expect you to be the role model, so be one. Besides, such situations may be good opportunities for introducing youngsters essentially to new activities like sports, outdoor events or hobbies like dance, music, painting etc. While wives/lovers may rejoice indulgence into soft romantic options. So, select as per the need of the hour and deliver. Now since we talked all this, let’s also talk… 5 things to SURELY AVOID while supporting wives, lovers, moms, sisters, daughters, female friends under stress or undergoing recovery from mental illness: 1. Advice 2. Argument 3. Alcohol 4. In case of wife / lover — Sex — Ideal conduct: Let the lady decide. 5. Expectations (CAUTION: This will be the most difficult one) — And Beware this one element if not handled carefully may in turn land you in depression or into a burn-out. Though you can easily safeguard yourself here with healthy practices like yoga, meditation, etc. Thus if needed, seek guidance from a good teacher / qualified physician as this may require some training. Yes, finally one last bit. The points mentioned above are strictly in reference to family members and close friends. In a work place situation, while one must always be empathetic towards a suffering colleague, yet any help offered must come only through the formal channels. These are the simple things all men can do for their women and in turn for themselves. I hope these points add as a top-up to the wonderful inputs already shared by Lisa Gallagher in the original write-up. Possibly, these may go under the category home-care, which will be besides the clinical-care that Lisa has talked about in her column. So, let’s fight Stress, Depression & all Mental illnesses together. ", "name": "2133_3", "id": "12b82cbd2f3b"}