{"title": "", "child": "", "parent": "2133", "creatorid": "733947a13db5", "content": "5 things women can do for themselves This series began with Lisa Gallagher publishing a deeply thoughtful write-up: ‘Depression Is An Illness, Not A Weakness’ In reply, I was motivated to write from my side — 5 easy & practical things men can do for their women. In between, something very interesting happened this morning. One of my friend, a wonderful lady and an immensely successful professional, who I have known for almost twenty years now and who’s a spinster, must have read the two write-ups this morning and thereafter texted me: what can women do by themselves? On that point the first question that hit me was — what authority would I have to speak on the subject? I have no educational qualification to show myself as an expert in the matter. Besides, I would barely know anything about women. Thus I began feeling I was incapable of responding back on her query. Yet this question took me into this morning’s meditation and then it was there, when I realized that I may actually have something interesting with me in this context. To an extent, by the time I got up, I was sure, yes, I can share with all women of the world at least a few points on what women can do for themselves to improve their mental health, gain mental strength and recover from mental illnesses. How would I know this stuff? Well, check the photo below. In the middle you will see our revered teacher. He is a distinguished monk and among the students you will see people of both genders. In India we call ourselves: Guru-brothers and Guru-sisters. A teacher and the students. This is a small group and all people present in it are well qualified successful professionals. Interestingly, most of the girl students are doctors. I have another teacher in Germany; also a revered monk and there as well the students from both the genders in matching strength — teachers, entrepreneurs, bankers, pilots and people of such background. It is from this association of over 15 years I can share with everyone some valuable insights. So, here I present to you 5 things women can do for themselves as support through loneliness, stress, anxiety, depression and any sort of mental trauma or illness: Learn to pray: Incidentally, prayer has become a deeply neglected, highly underestimated and much misunderstood tool in the modern population; when in fact it is the most powerful method of self-rejuvenation. To an extent what we call meditation is nothing but continuous and uninterrupted prayer. Thus prayer is one mechanism which can start at the most rudimentary level and can go right up to the highest level; that is the level of transcendence. Plus one can join into it at any level and make progress naturally. Further, things like religion, scriptures, rituals, etc. are merely auxiliaries to the process of prayer. In truth a prayer is the call that rises from the heart. In physical context there are 3 types of prayers. The first, which is verbally spoken out loudly; the second, which though make the lips move, yet the words remain inaudible to anyone except the seeker. Finally, the third which is relayed completely in the heart of heart of the seeker. Further on the qualitative level, the rudimentary prayer is that in which a seeker is asking for something in return. The intermediate level of prayer is that in which the seeker asks only for knowledge, illumination and salvation. Finally, the most refined prayer is that which is performed merely for the sake of praying. This simple mechanism, with a little perseverance can be very easily mastered by anyone, essentially women. It is self-sanctifying, independent and complete in itself. Besides it is the most natural way to heal every disorder. This is the basic essential, thereafter… 2. Support yourself with professional help: This is because you can’t be absolutely pure in your prayers from the day zero; hence you must support yourself with professional help from the best qualified experts. For most people good yoga teachers, physical trainers, sports coaches, etc. shall do the needful. However for severe cases of anxiety disorders, depression or mental health, duly qualified physicians must be consulted. Mental health must not be neglected at any cost. 3. Engage yourself in some meaningful work other than your occupation: So, if you are a working lady who stays busy most of the time with her professional life; once in a while, take a break and do something voluntarily. This will break the monotone which often sets silently in life. Likewise homemakers may choose to do something in the world outside. This is very important. The monotone must not set in life, essentially for you, women. It’s not your natural orientation. 4. Pamper yourself occasionally: You know what makes you feel good; so do that to yourself. Just one recommendation — Avoid alcohol. To an extent avoid any kind of substance abuse. Rest everything would be just fine. 5. Occasionally contemplate on your spiritual truth: I will not write anything on this, since this is a subject of self-discovery. The only recommendation being that you may learn about this subject via the lives of people like — Akka Mahadevi, Meera, Maa Sharada, Sister Nivedita, Florence Nightingale, Mother Teresa and Maya Angelou. So go ahead and explore for yourself. In the end the quest of life is all about finding your own truth. The moment you find it, you are healed forever and unless that happens, you must keep moving tying one option after another. Lastly, a YouTube link to a wonderful Brazilian Movie: Central Station. Check this out sometime. This is all I have to say on the subject. If you found what you read as relevant, please press the like button. ", "name": "2133_9", "id": "8cb59bc4ae55"}