{"title": "", "child": "", "parent": "2133", "creatorid": "8d60fde6774f", "content": "Agree with your article and recognized many of your concerns as I went through depression myself. It came out of nowhere (so I thought) with severe vertigo (including vomiting) I was unable to eat, to get up and take care of myself — my luck or better yet my savior, was a doctor/friend who came to my house and saw the state I was in and literally got me up and going again. This was 13 years ago. I was medically treated for months with the usual drugs and when I felt wonderful again I went off the medication without telling my doctor/friend, so one day, I started crying out of nothing, not understanding what the heck was happening — I had no idea I was feeling like that because I was off the drugs — to make the story short — instead of going back and take the medication, I started taking St. John’s Wart for a while, then slowly weaned it off, as I should have done (in the first place) with the medication, and have been fine ever since then. Do I feel depressed sometimes? Of course! That’s totally normal! One cannot be on top of the world at all times…I do not like to hear people confusing being depressed to having a depression though… but not everyone is well informed about everything either. I am a true believer that each experience is different because we are all different and after my own, I have been reading a lot about depression, where the medical authorities have not been able to arrive to a consensus, as to whether depression is an illness, a disorder or a condition. The easy way is to categorize it as an illness in order to justify keeping people on drugs for years…people become happy again and the “drug industry” stay forever happy! This is very sad! After all these years, after reading and hearing so many different opinions, it is my understanding depression is a condition that can lead to illness. This condition functions as an alarm the body sends to let us know we have to change something we are doing wrong. To wrap it up: I do believe my problems are not bigger than yours — they are just different. I do believe everyone has problems and stress — how to minimize or solve them is a capacity we have to learn, within us, in order to have a better life. Thank you for sharing your experience Lisa! Be happy :) ", "name": "2133_1", "id": "7e520fef01e7"}