{"title": "", "child": "", "parent": "2134", "creatorid": "93dbda31b0d1", "content": "Oye….so much misinformation here. Why Diets Don’t Work Let’s start at the top. This title is misleading. You’re not talking about “diets,” and, in fact, you recommend three diets at the end. You’re talking about one specific diet and claiming “it doesn’t work” on next to no evidence. “How is a diet that limits many of the foods you love like pasta, crusty French bread, alcohol, etc. going to work long term?” I ask them. “Isn’t enjoying good food with family and friends one of the things you enjoy in life?” False dichotomy. First, you can enjoy good food, without it being overloaded with carbohydrates. There are thousands of recipes that are phenomenal, and don’t have so much as a crumb of bread in them. A personal favorite of mine, which is always a hit at parties, is a cheesy spaghetti squash casserole (20g of net carbs per serving, with 5g of fiber, according to my MFP recipe builder, which is perfectly fine on a lower carb diet, outside of Phase 1 Atkins). Second, you can (and can learn to) enjoy the company of friends and family without it revolving around food. Given that “enjoying good food with friends and family” very often includes a lot of food, it’s arguably the amount that is the problem more than the experience, itself. Also, you’re assuming that alcohol is not allowed on Atkins/low carb. It actually is, though like DASH, MIND, and Mediterranean, it recommends moderation and certain kinds. Spirits are the alcohol of choice on low carb — Scotch, vodka, gin, etc. — provided they are not mixed with sweetened mixers. So, a good single malt Scotch after dinner is fair game. I don’t know about you but if I had to limit my carbs to below 20 grams a day (an Atkins Diet requirement in the first few weeks) and 12 to15 of them could only come from certain vegetables, I’d quit! I’d probably be constipated, dizzy, weak and mentally fatigued. So…what you’re saying is, you’re judging a way of eating on at least zero personal experience (and from the looks of it, not even second-hand experience), and what appears to be very little, if any, actual research on the subject. As long as you’re not trying to live off of skinless chicken and you keep your electrolytes and water intake up, you’re no more likely to get constipated than on any other eating framework. Even on low fiber, low carb diets, fat takes on the role of…lubrication. Dizziness, weakness, and mental fatigue on a low carb diet is nearly always caused by lack of sodium. The process of ketogenesis is naturetic. That is, it prompts the release of sodium from the body (as sodium binds with the waste byproducts). One of the most common rookie mistakes is continuing to restrict sodium while also restricting carbohydrates. By increasing sodium intake, you can avoid all of those symptoms. The way to lose weight is not from mostly water loss, which happens in the first two weeks in this type of diet. Instead, you should do it through eating a balanced diet, including all food groups and one that restricts calories, at least in the short term. While you’re correct that water loss accounts for the “lose 15 pounds in 15 days” marketing, that is only the case for the first couple of weeks. Beyond that initial phase, weight loss comes from caloric deficit, just like any other weight loss eating framework. Low carb diets, such as Atkins, aren’t magical, though that initial water weight loss does look like it and can overcome a lot of the initial inertia that often comes with changing one’s diet. Where people find the most long term success is the role of carbohydrate reduction on the glucose-insulin and leptin-ghrelin cycles. Fat does not prompt insulin secretion at all, and protein does not prompt as much as carbohydrates (for the most part). This keeps insulin levels stable, and reduces the amount of externally-sourced glucose that enters the bloodstream (switching it to a demand-driven supply, instead of supplying regardless of demand). The result is that they’re not constantly hungry, they don’t get that shaky, must-eat-now hunger that comes from blood sugar dropping too fast (which can happen to people even without Diabetes, it’s about the drop, itself, not whether the levels are “too high” or “too low”), and cravings tend to diminish or go away entirely. It also “retrains” the body to use fat as its primary fuel, instead of constantly feeding it what ultimately breaks down to sugar, allowing the body to more easily switch to burning body fat when the food is gone (again, reducing the need to eat constantly and the adverse physical effects of fasting for periods of time). This allows them to naturally eat fewer calories, without being miserable. On the “balanced diet” front. Define “balanced.” You say “from all the food groups,” but food groups are arbitrary groupings based on rather arbitrary (and politically motivated) determinations. For example, tomatoes (and its other Nightshade cousins of eggplant and bell pepper) are considered “vegetables,” even though they’re, botanically speaking, fruits, and it’s solely because they’re not as sweet as, say, strawberries (and where do avocados fall?). I’d argue that a “balanced diet” is one that is nutritionally sound, where you obtain all of the nutrients required. In that context, a diet heavy in grains (what the USDA recommends) is heavily unbalanced. Vegetables beat out grains for nearly every nutrient, both by weight (per 100g) and by calorie. There is nothing in grains that you can’t get, many times over, from other foods. And those nutrients don’t come from fortification when you get them from vegetables and meat, making them more bioavailable. “But Atkins doesn’t allow vegetables!” you may say (and, in fact, kind of did, with your comment of “only certain vegetables”). That’s flat-out untrue. In fact, the “foundation vegetables” list is quite long, and you can eat a lot of vegetables even during Phase 1, if you do a little planning, since Atkins uses “net carbs” (carbs minus fiber). That means 10 cups of (“average”) lettuce, or 10 dill pickles, or nearly 40 cups of raw spinach. A diet that has too much fat, mostly from animal sources, and too few carbs is not healthy. Not true. First, carbohydrates are not an essential nutrient. The body can make enough to supply the demand for the few things that need some amount of glucose, through a process known as gluconeogenesis, and that demand decreases when ketone bodies are available (the brain is a common “but carbs!” example; it needs the equivalent of 150g of glucose per day, but somewhere around 3/4 of that energy need can be supplied through ketones, reducing the need to about 40g, which can be obtained entirely from GNC if needbe). The ketogenic diet has long been studied for its role in improving or even reversing a number of neurological disorders, most commonly epilepsy, but also migraines, Alzheimer’s, and Parkinson’s, as well as non-neurological issues, such as inflammatory and cell death disorders. It also shows promise as an adjuvant therapy for cancer patients. There have also historically been some doctors who helped people get healthy not just through a ketogenic diet, but one consisting entirely of red meat (I highly recommend checking out Elma Stuart’s book What Must I Do To Get Well? And How Can I Keep It So? It tells of how she went from bedridden for 9 years with what would today be fibromyalgia or chronic fatigue syndrome to healthy in roughly a year of Dr. Salisbury’s ground beef and hot water protocol (a diet which she maintained for over a decade). These cases are arguably fringe, but further evidences the falseness of your assertion. NOTE: In a recent study conducted by U.S. News & World Report of the 38 best diets, The Atkins diet ranked #35. First, that is a fallacious appeal to authority, especially since US News doesn’t appear to reveal anything about the process for their ranking. Second, the foundation is still on flawed logic and research, which has ingrained the favoring of low fat (or perceived low fat), low sodium, and grain-heavy. Such flaws include the conflation of naturally occurring saturated fats and man-made trans fats (and no, not because one’s natural and one’s man-made, but because of the structure difference between saturated fats and trans fats), as well as the mistaking of LDL particle concentration (what the standard tests measure) with particle count and size and the ignoring of the different effects of particle size on CVD risk factors (not to mention the fact that LDL isn’t even directly measured most of the time, and the standard formula used starts breaking down when Triglycerides are either very high or very low). The top three best diets were the Dash, Mediterranean and MIND diet. With these you get long-term weight loss, and they are easy to follow without having to buy shakes and bars. First, “easy to follow” is highly subjective. I actually find the low carb diets to be quite easy to follow, and things like DASH difficult to follow (I’m not a volume eater, so a giant salad sans some fat and more protein than DASH/MIND allow would leave me nauseous long before I ever feel full or satiated). Second, your comment on “shakes and bars” is a false dichotomy. The implication is that in order to follow Atkins or other low carb programs, one must buy “shakes and bars.” This is patently false. Such things are available, but they are by no means required. One can spend their whole life following a low carb diet and never touch a shake or bar, and fairly easily, too. Just focus on real food. Now, before I finish this up, let me be clear — I don’t believe that low carb (particularly Atkins-style) is for everyone. While I think most people would be at least as healthy, if not moreso, by reducing their grain consumption (which would naturally generally reduce their carbohydrate intake unless they replaced it all with root vegetables) and not being so afraid of fat, I do believe that there are a number of things that factor into what is the optimal diet for each of us. As a result, you may be able to tolerate more carbohydrates than I can, and you may be able to thrive off a plant-centered diet, whereas I do better with a meat-centered diet that keeps carbohydrate intake on the lower end, and as long as nutritional needs are met, that’s okay. ", "name": "2134_1", "id": "ffbb4dae717f"}