{"name": "219_21", "child": "", "content": "I wrote about this in a piece called About You, Me, and Us and in it, I called this the “Me, Me, Me Generation.” In his beautiful, hilarious novel, To Rise Again at a Decent Hour, Joshua Ferris has a character, rather a Luddite, who refers to his phone as his “me machine.” As the family “photographer,” I find that behind the lens, capturing the moments, you are also missing them. So I do a perfunctory few snaps, then put the camera away. When I have gone on Facebook, I see photos from a friend’s “day out with the kids” or one time, a friend who went to Europe last fall, and she had “selfies” of her and her husband as they toured all the best cities. She asked her Facebook friends: “Those of you who have been to Paris, help me! Where should we go/what should we do next?” I have never been to Europe — Paris is a dream of mine that might not ever be realized. As everyone told her the “best places” to go, I commented with: “Put your phone away and experience the city. Smell it. Feel how different the air is on your face. You don’t need “us” to be there with you. Touch the cold metal of the Eiffel Tower. Walk historical paths. Run your hand along the stone at Notre Dame Cathedral. That’s what I think you should do.” No “likes” on my post. Imagine that. :) You can’t “be in the moment” when you are objectively recording the moment for an audience, presenting it as your own personal reality show. Needles to say, I’m not on FB much, (only for author duties and such). When I spend time with my granddaughter, I am the only one of her grandparents who doesn’t have a zillion photos of her with me, enjoying our adventures on social media. But that’s not why we go on adventures, she and I. We go on them to create memories in the most important places — within each other. Forgive the SSP links, but it’s nice to find a thoughtful writer, and it’s even nicer when they find me. Thank you for writing this — Peace ", "title": "", "parent": "219", "creatorid": "19d8ca62571f", "id": "be930bd7630b"}