{"title": "", "child": "", "parent": "2204", "creatorid": "77ccdadb4f31", "content": "Ha, bang on. As if you read my diary :P In the ‘old’ days (eighties and nineties), … there was no internet, you bought a book, but.. mostly, you fiddled something together. That had disadvantages also, because… you made something, and… then what, showed it to your friends or… it was just a ‘nice thing you made’ … Look at photography, most photo’s in the ‘ old’ days, stayed in your (real) photo album, only to show perhaps on birthdays or show it to family who where already trying to escape another ‘he’s gonna show his photo’s of his journeys again…’ Now,… you can pick up every information, can join hundreds of groups of ‘people who think or do the same’, which can give you way more opportunities to go ahead, share stuff, ask stuff … but indeed, it’s also overwhelming, perhaps so overwhelming, you block out. There is offcourse a uge advantage too… you can reach more people, share it with all the world, and.. you can look what other people are doing…. new ideas spread way faster then 30 years ago. THis has offcourse a downside that it goes so fast, some ideas don’t get enough time to develop. You see this with Kickstarter projects. I’m into VR and 360 degree video lately… on Kickstarter you see a bunch of 360 camera’s popping up… I backed some, but… the development takes ‘too long’, since, the ‘normal companies’ producing those too already, most kickstarter project are over run with bigger companies very fast, making their design already ‘ancient’ the time the kickstarter project is ready.You see that in drones also. Most kickstarter projects failed. 2 years ago, some small companies where on kickstarter, with ‘object avoiding systems’, ‘ follow me’ options… now, DJI has those standard on drones, way cheaper and way better. This fast technological progression, is nice, but… can enhance procrastination, because, the moment you start with something, a newer tech or method is already out there! So… you hardly get the time to learn stuff the ‘normal’ way. While most new stuff, if you never used it before, will have a steep learning curve, meaning, you need a lot of time to master it, or… you have to find a way to discover which parts of are only good for you. Example: I want to learn 3D animation again. In the nineties, you had 2–3 programs, which … did the basic animation stuff. Programs like 3D Studio where relatively small. That ment that you hit the maximum potential of the program, quit fast. nowadays…. programs are uge, massive amount of option and possibilities, which, makes it daunding to start. To much possibilities and options enhance procrastination. ", "name": "2204_16", "id": "cb3671d31f5c"}