{"title": "", "child": "", "parent": "2268", "creatorid": "7093ff1752fc", "content": "I learned from the Tartine Bread Cookbook that you don’t need to kneed bread. Here’s my recipe. Great bread consists of five things: flour, water, salt, yeast and time. The time ingredient has been forgotten in bread in the US until the resurgence in artisan bread. The time element is also what takes getting used to. You can’t just decide to make good bread and do it that day. This recipe is for what I call French bread. Bread made with baker’s yeast. I also make sourdough, but a lot of people who have not grown up in the San Francisco Bay Area don’t like sour dough as much. What you need: — Unbleached all purpose flour. The best kind is King Arthur, but other brands like Gold Medal work fine. — Bakers yeast — this is just the stuff in the little packets. Never use “quick rise”. You just want standard yeast. I use Fleischmann's  — Salt — Water (I just use tap water) I’ll assume that you want to bake on Sunday (which is what I do). Friday night Take 200 ml (milliliters) of water and heat it a little in the microwave so it's like hot bath water Put the water in a big bowl with a teaspoon of yeast (one of those little yeast packages is good for several batches of bread — store the yeast in the refrigerator). Add enough flour to make a sticky dough. I just do it by feel, but the amount is about 200 grams of flour (e.g., about the same as the water). Mix the flour, yeast and water until it’s a sticky dough. This is a starter for your bread. Leave it out over night. Saturday The starter (flour, yeast and water) should be bubbly. When you add water to make the bread, it should float. — Add 700 ml of water (1 ml = 1 gram by definition, so this is 700 grams of water). The water should be room temperature (tap water is fine).- Add four teaspoons of salt. I use Sea Salt from Costco. I’m not sure if it matters much — Add 1 Kg (kilogram) or 2.2 lbs of flour. Stir the flour in to the water and starter mix. It will start to get pretty thick at the end. I sometimes mix it by hand. The dough will be pretty sticky at this point. Sometimes I add a little more flour. Make sure that all the flour is mixed in. Cover the bowl with plastic wrap. It will start to rise. Give the dough a “turn”. You do this by grabbing the dough, stretching it and turning it. Do this five or six times. This will tamp down the rise. I just cruise by every half hour or so and turn the dough and re-cover it. You will find that the dough becomes less sticky and more compact. What’s happening is that the gluten in the flour is starting to “develop”. After two or three hours the dough should be rising faster and should be less sticky. It now needs to be refrigerated overnight in a plastic wrap covered bowl. This is the time part. By refrigerating the dough you are, as the French say, retarding it and slowing the fermentation. This allows the dough to develop flavor. This time period is the difference between good bread and supermarket bakery bread. If I know that I’m going to be in a rush the next day I will make the dough into loaves on “parchment paper” on a cookie sheet and cover completely with plastic wrap and store it overnight. You can also leave the dough in the bowl and make loaves on Sunday when you bake. Probably the easiest way to bake the bread is in a Dutch oven. This is a big cast iron pot with a tight lid that can take the baking temperature (450 F). The Dutch oven needs to be big enough to hold half of the bread dough, with space to rise. Mine is enameled. I’ve never tried a pure cast iron one. The other way to bake bread, especially if you want French style loaves is on a baking stone. Sunday Take the bread out of the refrigerator and form it into loaves. Divide the bread into two halves. If you’re using a dutch oven these will be balls of dough. If you want classic loaves you can work the dough in your hands until it’s about the right length and it’s stretched out. Then you roll it up on a floured surface to make the loaf. Let the dough rise on a cookie sheet with parchment paper. If I’m baking in a dutch oven I let the dough rise in two plastic bowls that I have lined with smooth kitchen towels. You form the dough into balls flour them well and just plop them into the bowls that have the kitchen towels. Cover the dough with plastic wrap. The dough will double in size over a few hours (about four or five hours — it has to warm up from the refrigerator). Heat the oven to 450. If you don’t have a baking (pizza) stone you can bake the loaves on the cookie sheet. If you are using a dutch oven, put the dutch oven in the oven while it preheats. When you take it out you need to handle with care. I’ve burned through one set of oven mitts. Uncover the loaves when they are fully risen. Slash the loaves with a sharp knife (as you see done with bakery loaves). This gives them a way to expand and provides that cool professional look. Spray the dough with water until the dough looks sweaty. Professional bakers have steam injected ovens. This is an attempt to simulate this. If you have loaves on a baking sheet, put them in the oven with the parchment paper. Even with my baking stone I do this since the loaves are bigger than my stone. I bake them for ten minutes and then take then off using a bread “peel” (this is a big paddle looking piece of wood for handling bread or pizza). Or you can just leave it on the baking sheet. Bake for about 30 to 45 minutes. In a dry climate like New Mexico or Arizona you can get somewhat better results if you bake the bread under parchment paper. This traps the moisture and gives the bread a nicer crust. The crust of the bread should be golden brown to dark brown. In California there is a trend for darker crusts. It’s a matter of taste. If you decide to bake in a dutch oven take the preheated dutch oven out of the oven onto the stove top and remove the lid. Tip the bread into the pot, spray with water, cover and put in the oven. It will bake for about 45 minutes. Uncover for the last five minutes. This bread recipe is inspired by the Tartine bakery in San Francisco. It’s a great recipe and I love the fact that you can get great bread without the mess of using a Kitchenaid mixer. ", "name": "2268_12", "id": "d0d3aa8e31f0"}