{"title": "", "child": "", "parent": "2268", "creatorid": "d3d6ddfb69fd", "content": "Bread of Life I have this theory that because bread is global and historic, one of the first things we learned to make, it is enthroned within the most primitive parts of our modern brains. No matter where we are from, no matter our social status, our job, our family or friends…the smell of warm bread, just out of the oven, will make us salivate, look for the butter and proceed to eat it as if we were starving. At least, that’s what happens to me and the husband. He is actually in charge of the bread making in the house — and we do cheat, we use a breadmaker. He doesn’t know about the time and knead parts. I can’t do the kneading any more because of my disabilities. So we have found a modern solution to preparing our soul food — the food of the soul. We are also fortunate that we live in a place where there are all kinds of bakeries and fresh breads of many types and flavors. Just yesterday, I bought a fresh foccacia. Think a square loaf, only about 3 inches high. Foccacia is an Italian (duh) bread that uses this thin loaf to create a bit of bread heaven. It requires the bread, a gentle and minimal amount of olive oil spread on top, and then spices: oregano, basil, garlic and onion powders (or fresh, chopped fine), then a thin, sufficient but not overmuch, sprinkling of Parmesan cheese (grated or shreds or even thin slices). It is then put under the broiler until it is hot through and the cheese has melted. As with any other hot bread, it is ripped apart and eaten at once. It’s generally served as an appetizer or a snack. You can also put thin slices of Roma tomatoes on it. Sort of a REALLY thick crust pizza. (You don’t have to use an “official” foccacia loaf; any thin bread will work — heck, you could even do this on slices of bread.) It’s fast and it’s easy — even if you have to make the bread first. The inside of the bread (that I bought) is very much an Italian-style bread, with soft and tender texture and the large, frequent holes associated with Italian loaves of bread. (Italian bread is water, yeast and salt, not much more. Makes a different texture than say, French bread or rye.) Good for you, discovering that there is something that will help with the monster (demon?) that sits in your chest. “A loaf of bread, a jug of wine and thou” said the poet Omar Khayyim (spelling?). Sounds like a party to me. Even if it is just me, stuffing bread almost too hot to eat and dripping with butter into my mouth! ", "name": "2268_17", "id": "74b469362ece"}