{"title": "", "child": "", "parent": "2294", "creatorid": "7cae3a0cf11f", "content": "Td Walter Segall, I humbly disagree with you, seeing that I am a six year pancreatic cancer survivor. Was progressed to Stage IV, doctors sent me home to die. I had been taking laetrile unbeknownst to my conventional western doctors. Yes, I had radiation and chemo — had to stop chemo because of allergic reactions to it. Despite conventional treatment, I am convinced it was NOT what led to my surgeon wondering why when she went to do a whipple procedure, she could find no cancer and even sent the tissue back 3 times to confirm, then finally requested my original tests confirming pancreatic cancer diagnosis. This was a shock to my docs and I even had a prior doctor come to my recovery room in amazement because she could not fathom that I would even still be alive — much less have made it back to the operating room as a surgical candidate. They didn’t understand it because I didn’t tell them I was taking laetrile on my own. My surgeon said she pulled the original tumor tissue away from the mesenteric artery (which is the reason I could not have the surgery to begin with) and it just sloughed off — no cutting required — just pulled away and it just all looked like dead tissue. It WAS dead tissue! Having been the wife of a doctor of conventional medicine, the reason why doctors choose conventional medicine for their own family members is they can’t get past their years and years of training and indoctrination. There are very few doctors who can humble themselves and look at the real facts and follow the trail of the humongous amount of money being made by drug companies and emboldened by the CDC. Cancer is an enormous money-making business. My oral chemo which I shortly had to stop taking had a co-pay of over $800 for just two weeks of treatment! While I am not advising everyone who has cancer to do what I did, I would encourage every cancer patient to do extensive research and just because one doctor says something, doesn’t mean it’s right for you. My first oncologist told me, “you do know that you’ll never be a surgical candidate, right?” That was the day I fired his ass and found someone who was more open minded. Make wise choices and don’t just accept what a doctor tells you as fact. Miracles happen — and you might very well BE that miracle if you make your own decisions. ", "name": "2294_18", "id": "e323f6b1337e"}