{"name": "238_2", "child": "", "content": "Hey Kevin, in case you are still trying to make your voting decision, I thought I’d offer you two things I worked on this week. I actually haven’t made my MVP decision yet either. I thought I had after this piece I wrote about the absurd stats and triple doubles, but then I dug through the last few decades of MVP history. I honestly started writing the stats piece thinking I’d show that Harden was the MVP and after all the time deep in the numbers, I was convinced Westbrook’s numbers were a stone cold argument combined with his narrative. Then I started thinking about the missed MVPs in the past, the stains on the award like Kobe (that year) and Rose and Nash that are so embarrassing in hindsight. So I started researching thinking I was going to show that not giving the MVP to Russ would be a mistake, and lo and behold that’s not what I found there either. I do strongly feel that Kawhi and LeBron don’t fit any historic MVP profile, and Harden fits one I don’t love (though he’s better), but my conclusion is that this has been a Warriors season all along and they ought to have the MVP. In my article I concluded that as hinting toward Steph. I think my final conclusion is that Kevin Durant was supposed to be the MVP. He was my midseason pick, and he basically fits every argument Kawhi has — two-way player, efficient numbers, impact defender, great # of wins — but better… except of course he missed 20 games, and MVPs can’t play 62 games. So. That didn’t help. I only know now who I think the MVP should have been. In the world we got, I don’t think I can talk myself into Steph or Draymond because that feels silly, so I think my vote will end up being Russ. He doesn’t fit a historic MVP profile either, but he does fit the profile of several players I think we all think should’ve won in hindsight, and what he did after losing Durant/Ibaka is completely unprecedented. But of course, I don’t have a vote, and you do. So since I know you care about this as much as I have, and since I seem to have a unique perspective based on what I’ve read on MVP stuff around the interwebs, thought I’d share it. You don’t have to respond, or read my stuff, or whatever else, obviously. This MVP thing has consumed my brain this week so since you’re still deciding for another 30 hours, thought I’d share my thoughts. The end. PS. I’ll probably still read your stuff even if you vote for LeBron. LeBron is a pretty good basketball player. ", "title": "", "parent": "238", "creatorid": "7973075212bc", "id": "d605534b138"}