{"id": "3ff02ad919c7", "child": "", "parent": "2400", "title": "", "creatorid": "f1414f5932c7", "content": "I have a bit of a silly question: We have had more than 20 “boom boom bang bang here we come” JS-environments (I fear calling it a framework :-), where it was announced as the generic solution to everything from bad breath to a cure for hangovers:-). Yet — give it 9, 12 or 18 months — and it was all dead, gone, buried. I would LOVE to use newer frameworks (environments) such as REACT, but, I and thousands with me, have burned our fingers seriously, in that — when we have worked with the framework for some time, then it stops being there. It simply stops! We are then left at the mercy of coincidence — and nobody in professional software development wants scenarios where they create something for their clients — only to have to add bills of USD 5,000+ simply because of that the framework you delivered under, no longer exists. So questions: WHAT IS YOUR TAKE — I am starting (!) using frameworks when they have grown some molds (18+ months of age on the market and still supported). We have seen so so so many frameworks, which each of them had very good functionality, each of them solving certain problems — but — they never survived the tooth of time. WHAT IS YOUR TAKE — how shall we go about this problem? We have hundreds if not thousands of contributors of code — but they never receive the credit for their work, thus they simply die off before they can even raise to stardom. WHAT IS YOUR TAKE — WHAT shall we do? I have been successfully sticking to the older stuff (18+ months of age), but surely I would want to put in the newer stuff — if I had a guarantee that it would be developed on, improved on, supported. I would not even mind paying for it. Advertising it. But — provided that the author actually does something about it. Love David Svarrer Chief Solutions Architect, Apps Development ApS ", "name": "2400_1"}