{"name": "249_6", "child": "", "content": "Coach (in character, as sarcasm from a unsuccessful coaching applicant{: “Keith Dambrot … definitely didn’t take the Duquesne job just so he could make a bunch of money and promptly retire” (written in character as I’m not here suggesting that Coach has the wrong angle on why Flyers coach Keith Dambrot left Dayton to take (steal?) the Duquesne job (At the same time, nor do I seek to justify Dambrot’s choice to turn on a fellow coach & literally take the food from the mouths of his colleague’s as yet impending children as some tortured ‘two wrongs make a right’ thing.). But in all fairness to Dambrot, it probably should be noted that Dambrot was egregiously wrongly attacked, was blackballed from CBB coaching jobs during half the 1990s, & that therefore & thereafter both he & his reputation suffered unjustly for some time. All that involved an online fooferah over something he said to his players while coaching at Central Michigan, which them was unjustly distorted into an accusation of overt ethnic bias. It also should be noted that Dambrot’s personal saviorfrom CBB coaching purgatory was an angel of mercy who, by coincidence, is also named “Labron”, who happened to play under Dambrot in high school. That other Labron (last name Williams or James or something), who went on to make something of a name for himself in the pro game. That measure of success led to Other Labron being urged to “write” a reasonably popular quasi-autobiographical memoir (self-described as a “book”), which OL proceeded to do. And in that “book” is an extended (for the genre, at least) passage in which OL (who I envision as having donned a black robe & powdered wig) confronted Dambrot over the Incident at Central Michigan, and, after due deliberation of all known facts & forensic pleas, arrived at his unanimous judgment of Dambrot being “Not Racist”. That judgment paved the way for Dambrot’s re-entry into decent coaching society, and thus Dayton’s Dambrot Era of eleven (11) years of unparalleled success in the raw currency of big time CBB: players making shots, the program winning games, and Dayton being selected for NCAA tournaments. So Coach: Dambrot gaming you out of the Duquesne job may well be some kind cosmic payback — to Dambrot at least. Which leads me to my own regular feature, My Free Advice And Worth Every Nickel Back: It might be worth a shot for you, Coach, to consider what you might have done in this or some past live to earn this clear mistreatment.If you can get someone, Tait maybe (He’ll say anything.), to contort & twist one of your jokes into an appearance of bias against, say, the entire run of CBB power bigs from the Baltics nations, then invite Lauri Markkanen, or even better, Przem Karnowski, to sit in judgment on that & render a decision of you being “Not Guilty” of Baltics bias, I think the next coaching job will find YOU, Coach. ", "title": "", "parent": "249", "creatorid": "ae4e4e4b5573", "id": "abf0255779d9"}