{"content": "Question 1: Replacement player: Why does Harden take this question? Yes, while Jordan Clarkson may drive Houston into a wall, the offense apparently runs fine without Harden on the court. Bill provides exactly no evidence to support his pick on this question, while there is actually data to show how well a team does with players on or off the court. Using on/off splits Harden is a mediocre +3, Leonard actually fairs worse at +2. While Lebron and Westbrook are +16 and +12 respectively. This simply shows that Harden and Leonard while great are partly system players, which improve their team’s record and stats. For Question 1 the only rationale and data driven choice can be Lebron or Westbrook. Question 2: Best player in a pickup game: Irrelevant argument. If this mattered Lebron would win MVP every year. Question 3: Friends opinion: Again a strange irrelevant argument. All four have their pros and cons…which is what Bill claimed was so interesting about this MVP race in the first place. This argument actually contradicts that original point. But whatever, Lebron’s team performance and only winning 50 games is a bit ridiculous, but his efficiency numbers and on/off numbers are great and btw his efficiency numbers are better than Harden’s who people want to praise for his efficiency. Leonard on the other hand while being great hasn't put up the all time…historic…numbers like Harden or Westbrook, and his on/off numbers are really mediocre. Harden and Westbrook have owned the season and the narrative, but the only case against Westbrook is his style of play allows people to claim he is a ball hog (something claimed of Jordan and Kobe) and they simply don't like it….even when that ball hog behavior actually led to a better record (see record when he got a triple double). The other more common argument is that his team didn't pass a wins threshold (which is essentially question 4). The case against Harden is largely his weak on/off numbers and the fact he is worse than Westbrook in traditional and per-36 stats (and honestly most advanced stats) and his main argument efficiency is actually less efficient than Lebron. Question 4: Team Wins: This is somewhat related to Question 1, so it is a little redundant. Again you can easily find out the value of a player to that actual team, on/off, but aghast Bill simply wont go there. Instead he presents ad hoc arguments. But lets lay out a few of them. OKC team simply didnt develop. Well is that really true? Adams and Oladipo are having career years, and have taken moderate steps forward, but they aren't all-stars and no one ever thought they would be all-stars. Remember Orlando gave up on Oladipo for a reason. Illyasova btw was not the fault of Westbrook, but of Presti and Donovan for not playing him and then trading him. Sabonis is the 11th pick in a draft which will likely announce Brogdon, a player putting up a measly 10ppg or Saric, a player drafted two years ago as the rookie of the year. So lets not act as if Sabonis should be this rookie putting up 15 and 8. Roberson is essentially tony allen, as he is a great defender yet a career 26% shooter from 3 and a career 49% shooter from the line. So acting like Russell should have turned him into scottie pippen or trevor ariza is a bit ridiculous. It again should be noted the on/off numbers of Westbrook is +12, he also moves the offense from the worst in the league to a top 10 in the league when he is on the court. Meanwhile the argument for Harden that Bill presents is that Harden led the rockets to a top 10 offensive season. While he should get considerable credit for that, he shouldnt get all the credit. This is seen again in his paltry on/off numbers, the fact that the team remains one of the top offenses (Yet not all time great) when he isn't on the floor. The only other argument is the stupid argumetn of expectations. If this season happened after 2014–2015 when Harden finished second in MVP voting and the team finished second in a loaded western conference, people wouldnt be so surprised. Instead 2015–2016 happened, which saw the Rockets crap the bed, underperforming by the same amount they are “overperforming” today. For example the Vegas line for 2015–2016 was 54.5 wins. The Rockets are exactly on that mark this year, but the line was 41 this year because Harden and the rockets underperformed to a crazy extent. In other words, you are essentially rewarding Harden for not caring for one season and then caring again. Harden has a decent case for MVP, but the arguments presented in this article are easily refutable and take into consideration very little evidence or rationale thinking. If you go by historic statistics and narrative it is Westbrook. If you go by advanced stats its Westbrook or Lebron…and to a lesser extent Harden. Efficiency it is Lebron…even if people make the argument for Harden. If it is two way player it is Lebron or Kawhi, and if it is wins it is Kawhi or a Warrior. ", "child": "", "parent": "24", "title": "", "creatorid": "22ad4a0bd7d7", "name": "24_2", "id": "1a9d53ca5061"}