{"content": "Simmons is Sports on Meth. He comes at it from a peculiar direction, but there are insights to glean from him. Basketball is a team sport. It’s a little odd for us to even be thinking about electing a single player as the MVP in the first place — really, the only meaningful metric is championships, getting the job done as a team. That said, at least Simmons cares about the team aspect and looks for his MVP candidate’s accomplishments in elevating the other players around him. That’s positive. For those of us who care about elevating team performance, not individual performance, Westbrook’s amazing individual performance this season carries no weight. Harden definitely beat him. But it’s troubling that the Rockets’ court performances as a team didn’t yield better results. He lifted them, but he didn’t lift them far enough to matter. That opinion will be born out, or disproved, during the playoffs. We’ll see if Harden can get the Rockets into the finals. The smart money says he won’t. Leonard is an awfully-skilled player, but the Spurs are looking a wee bit tired and old at this juncture. I don’t think they have the stamina to get to the finals, and Leonard isn’t the guy to lift them past their limits. LeBron is still the best basketball player on the planet, when he’s rested, and when his teammates are plugged in. When he isn’t, or they aren’t, he’s just mildly good. His MVP candidacy is damaged, badly, by the Cav’s anemic performance post-All Stars break. It’s not even certain LeBron and the Cavs have enough left in the tank to make it to the finals. In any one game, LeBron can put on his superman cape and dominate, but he can’t do it game after game. It’s a long slog to the finals. I don’t think the Cavs can get there this year. The best player on the best team this year is… Steph Curry. Again. His individual performance numbers dipped from last year with the arrival of Durant, but his plus-minus lifts his team to success in a way no other player in the league has managed. He doesn’t chase stats, he chases wins, and he caught more than anyone else, again. Curry also has a talent for demoralizing opposing teams. He doesn’t just beat them, he assassinates their hopes and dreams and takes the fight right out of them, then sits on the bench to watch their final destruction. And he’s doing that on a team that lives and breathes teamwork; he’s the obvious leader in making the team work well together. During Durant’s injury period, Curry showed us that as sublime a talent as Durant represents, Curry is still the motivating force on the Warriors. He doesn’t just pull them up with his effort; he unites them and makes them dangerous. Basketball is a team sport. If we have to pick an MVP at all, we ought to pick the one guy who is most effectively turning his franchise into winners. This season, that’s Curry. In the backs of our minds, of course, we are remembering Curry’s no-show in the playoffs last year after a transcendent and unprecedented campaign to grab MVP honors for the second time. We’d like to hold it against him this year; no MVP should fade like that! Retrospectively, his MVP award feels like a mistake. His team got beat down in the championship. We don’t want to make that same mistake again, and as his numbers are down from last year, dropping him from consideration this year feels like a no-brainer. But he’s the one player in this league who has best embraced basketball’s team ethic and made it work. Golden State without Curry would be a completely different team. Even with Green, Durant and Thompson, even with a great coach and a well-managed bench, GSW could not have stood atop the league again without him. Much of the fun GSW has on the court would drain out of their game, too. Oracle Arena would be a whole lot grimmer, and other instincts would kick in, like Green’s quick temper, Zaza’s fatigue, Durant’s fragility, Thompson’s cold streaks. The glue would be gone. How valuable is Curry? Player metrics alone don’t tell the story. But wins do. This year, Curry avoided chasing metrics. This year, Curry focused on keeping the tank full, for himself and for his team. This year, Curry has but one goal: the championship. Are there any MVP candidates on teams who can stop him from getting it this year? No. There really are not. That’s the MVP story, and I’ll stick to it until the playoffs prove me right or wrong. ", "child": "", "parent": "24", "title": "", "creatorid": "177a943771e7", "name": "24_23", "id": "855197a81cda"}