{"content": "I don’t know why people are so overly passionate about this — it’s definitely a close race. Just a couple of points to throw out there, based on the article, comments, and otherwise: For the sake of the MVP argument, I wish Westbrook hadn’t averaged a triple-double — or that they both had. It’s hard to figure out how much the singular fascination with that feat (v. someone putting up historic shooting splits in another season or setting points+points via assists records, or whatever) influences the argument. If you’re looking at points/rebounds/assist averages between two point guards (Russ & Harden) I can understand looking at the difference in each category between the two players, but somehow determining that the difference between 10 rebounds and 8 rebounds per game is somehow massively more important than 9 and 7 or 12 and 10 would be is arbitrary.Yes, Harden had a system tailor-made to fit him. But you might argue that Westbrook ran a system tailor-made to win him the MVP (basically give Russ the car keys and never ask for them back). I think those two arguments basically nullify each other. Besides, when has someone won MVP who WASN’T in a situation that would allow them to spotlight their talents?Anyone who says an MVP has to be from a 50-win team is drawing as arbitrary of a line as someone who thinks a triple-double average calls for an automatic MVP. Wins are absolutely part of the criteria in basketball, where an individual player (especially one who has the ball a lot) can make such an outsized impact, but drawing a line at a shiny number like 50 to determine who can and can’t be MVP is too simplistic.All of those things said, Westbrook is going to win the MVP and that should be absolutely acceptable to anyone who wouldn’t vote for him. In a season full of big stories, he was the top one. That’s usually the case with MVP and we’ve seen MVP selections based MUCH more on a narrative than Westbrook’s triple-double season will be. ", "child": "", "parent": "24", "title": "", "creatorid": "a6b9a540cee8", "name": "24_9", "id": "960d0ece66f0"}