{"name": "254_4", "child": "", "content": "How lovely. I am aware (and grateful) that my father found it in his heart and wallet to keep me in high school two more years. My stepmother (who was, in the end, to prove herself wicked) just wanted to see me out of school and into the workforce — in any industry. My brother had done exactly that, but then: he hated school and school hated him. He’s still a fitter & turner. So I persevered, and left school with almost the highest honour possible; Dux (there were two of us that year) and a ‘A Bursary’. Off to university — and an A+ in physics. But I declined their offer of an honours degree and went to Architecture School instead. Where I gradually failed. You see — my parents made me who I was. They were working class through and through, and their parents were, too. There were no books in the house. We never discussed art, movies, culture, history or politics. I’m still learning words and expanding my vocabulary, because none of them ever got past about Grade 9. None of them read Shakespeare, let alone saw it. I first entered a library at 11; saw my first theatre at 16. And most crucially — they knew nobody in the professions. None. They made me who I was -the genius who failed. I left school barely educated, and left home with the cheap cardboard suitcase they bought me and the gaping hole where hope, expectation and confidence in my professional future should have been. At university I was surrounded by those that did have those crucial things — and they never faltered. You took flight from the shoulders of two giants (as modest as they were) who gave you all the essential stuff: faith in yourself; the expectation of success in a professional field, and (presumably, as teachers) an education built on conversation, books, art, and the encouragement to stretch your wings. (And maybe of equal importance: that money.) Don’t assume we all enjoyed the same things, and are equally thankful. ", "title": "", "parent": "254", "creatorid": "ba5509650d9", "id": "e8a38d63fb97"}