{"name": "298_2", "child": "", "content": "I think the fears you listed are how I would define insecurity. At the bottom of each is a sense that you might not be worthy. Yea? I think that there are a lot of problems with American society overall. (Like the other commenter before you has pointed out.) For a long time in human history, there’s been persecution and shaming and gossip and cruelty. The Bible has plenty of that in it, if you believe any of those stories are true. Maybe the Internet just makes it easier to become a bully. I have a feeling many who make cutting remarks via screens wouldn’t have the guts to do it face-to-face. But I also worry that we have just become really unhealthy humans, and maybe that has magnified what seems to be a natural human tendency to sometimes harm others. Or more specifically, to harm those somehow different from us. When we watch the news, it really looks like the end of the world. There are so many storms and wars and acts of violence — what happened to the good old days? Well, we have a bigger population on the same-sized Earth. There’s the unsustainable frantic struggle year-on-year to increase profits, which in turn ruins our planet from pollution. We feed ourselves unhealthy foods, which I’m fairly sure contributes to unhealthy moods and irritability. We don’t move much. We sit. And we worry. I wonder: If we could go back in time and give our environment and bodies the health we seemed to have lost over time, but kept the same technology, would people say fewer toxic things online? What if we had less work and more time to play? More space to run around outside? What if eating well was the world’s default lifestyle, not an Instagram competition for the young and the beautiful? What if we took care of the world? What if we slowed down the insane pace of capitalism? What if we got out there and made the land and sea cleaner again? What if we didn’t have to feel so crazy jealous of other people’s financial success because financial success just didn’t matter so much? What if we were all healthier and so was our environment — would some of this anger, hate and fear abate? I don’t think it would ever be eliminated, but maybe just maybe we could stop spewing poison if we were less poisonous to begin with. I don’t have the answers. I just have a lot of questions. :) ", "title": "", "parent": "298", "creatorid": "e4fe03c90d4f", "id": "1f5895acccc6"}