{"name": "308_8", "child": "", "content": "TEACH YOUR CHILDREN Thanks to my dad who had instilled a passion for literature in me from the age of six , I never needed to be told I should read. All I ask from the world is to be left in peace so I can indeed read to my heart’s desire. I was fortunate to have grown up in a house with a library of 1000 + books. Every occasion when presents are given — like birthdays, X-mas and such , I would get a carefully selected book from my dad. I loved to read from the very moment I had learned my alphabet. But that was not all. There was a string attached . It was less popular with me in the early years — though I was immensely grateful for it later in life , especially during my formal education . I was namely obliged to write a little essay on every book I had read. My father had a lot of faults. I forgive them easily and completely. I understand he did the best he could and knew how. That was good enough for me. His gift to me — the love of books — is the best and the most valuable one I could have ever wished for. It is a gift that lasts a lifetime . No expiry date. For that I am eternally grateful to him. I am writing this not to boast or anything like that . It is to give a message to all of you who are parents. Teach your children to read . Teach them to write. Teach your children to be friends with Tolstoy, with Dostoyevski, with Dickens, Jane Austin, sisters Bronte, Victor Hugo, Honore de Balzac, Pearl Buck, Bernard Shaw , Selma Lagerlof , Robert Louis Stevenson, Aldous Huxley, John Dos Passos, Hemingwey, William Faulkner ,Mark Twain… Jack London… go back in time : Shakespeare Dante Alighieri, I can go on and on. Go forward? Jorge Luis Borges , Salman Rushdie, Isabel Allende … Ah what is the point , I can never name them all. Favorite books? Impossible ard to reduce my reading to a short list . So many at different ages and different stages in life. It can never be too early to start giving them books . A four , five year old child is ready to learn how to read . When their minds are like thirsty sponges and the imagination is rearing to soar, feed them. You will set them up for life. Do it before they start school. Do not rely on their luck with the teachers. If you are only now learning to read and appreciate books , it means you have lost the chance to enjoy a whole library of valuable children’s books that are there to help form a character of a person that a child is to become. This applies to all the books for every age before a kid becomes a mature human being. Just saying. We can’t turn back the time. It is never too late of course. Most important, it is never to soon to start reading. ", "title": "", "parent": "308", "creatorid": "9d956a9b2b57", "id": "26717f0747f2"}