{"name": "315_21", "child": "", "content": "Great advice! This should be required reading for anyone entering the workforce. The concept of “work hard and it will pay off” is unfortunately not applicable in many corporate jobs. Those who “appear” to be the smartest and hardest working will typically be the winners. The only job where this doesn’t apply is if you are a producer. If you are in some type of sales role where your contribution can be directly attributed to making money for the company, you don’t have to spend wasted time on self promotion. If you aren’t directly contributing to the bottom line, appearances are everything. Here’s a few specific behaviors I observed to be practiced by natural (successful) self-promoters (some I learned from school of hard knocks): Send detailed emails to your boss at least once per week outlining how you are spending your time and accomplishments for the week. Don’t sound boastful, state facts, i.e. Project on schedule, met with key stakeholders to discuss x, etc.Figure out what makes your boss look good and make every decision based on how it will affect them. Make sure they know, without being too obvious, that you have their back.Show you are a team player by complimenting co-workers in meetings and give credit when due. It will show you are secure and confident about your contribution.Be willing to admit mistakes and take advice, shows you aren’t perfect thereby boosting your overall credibility.Never get defensive or emotional. Those who are naturals at self promotion are masters at self control. Emotional people come across as weak and unreasonable even if they are right.Never leave the office before 6pm if regular business hours are 8–5. Executives and managers typically work late and you will automatically be perceived as a hard worker if you are doing the same. Bottom line, you will often feel disingenuous because your goal is to look good vs do good. If you can’t stomach it, go into sales or become an entrepreneur. ", "title": "", "parent": "315", "creatorid": "9a45f35a005d", "id": "21cf60c92ec"}