{"content": "The thing is, year after year, when there is no clear candidate, we sumerge in the debate of what “valuable” means. Depending on what you consider valuable in a basketball player, is your MVP. Does it means the best player in the league? It’s Lebron. Does it means the best player on the best team? It’s Leonard. Does it means the player who you trust to win you the game on both sides of the court? It’s either Lebron or Leonard. Does it means the player whos impact is the most important is his team? Harden or Westbrook. Does it means the player who has scored at any moment, at any time, all season long? It’s Harden. Does it means the player with the best statistical season? It’s Westbrook. Does it mean the player whos team will be crap if he gets injured? Westbrook. Does it mean the player who would improve any team at his arrival? Leonard. So, the MVP is really the narrative. The last two years, the Warriors have dominated the narrative and Curry dominated the Warriors story with his 3-point shattering record. (Funny how the current 2-time MVP is outside of the conversation despite having a good-not-great statiscal year). The MVP is a statment. The recepient tells us what the league and the media values about the game, and where they want it to go. Curry’s MVP were an endorsement to the 3-point revolution. What is this year endorsement? If Lebron is named the MVP, it will mean championships, pedigree, and consistency is the key. Pure talent and resilence will be valued. If it is Leonard who wins, it will mean that 2-way players are the epitome of the game. That the two sides of the court are equal important. A Harden win will be a double endorsement, a reinforce, to the offense revolution. Westbrook’s win will be a recognition to the statistical facet of the game (and a subpreticious endorsement to stars staying in their teams). My fictional vote would be to Westbrook, mainly, because all other narratives can be duplicate in the future, but a season average triple-double and (possible) breaking The Big O’s record, is something I don’t think we are going to see in the near future. We can’t deny the peculiarity of Westbrook’s season and his excellence should be compensated. His season will pop out in the history books, how are going to explain that we didn’t acknowledge it when we have the chance? ", "child": "", "parent": "31", "title": "", "creatorid": "f4eaff8f357e", "name": "31_8", "id": "558461147396"}