{"name": "33_10", "child": "", "content": "Edit: per comment suggestion [my own attempt to not be patronizing] I really enjoyed your rhetorical style. There have been a lot of articles written on this topic, but yours was probably one of the most fun I’ve read. I’ve done a lot of time researching on this topic. I didn’t want to put in this response, this was supposed to be more fun with only a few facts. I have more of those facts in a response to a response of this article. I’ll post that link at the end of this one in case one wants to keep following along with more thoughts, e.g. athleticism over time. Back to the post I wrote: For fun and gesturing, I’d like to flip this on it’s head, that is transport Westbrook back to 1962 and the Big O to today. A few tongue in cheek things on traveling Westbrook would have 8–12 travels called per game. Well, it’s Westbrook, nevermind, he might only have 8–10 possessions that aren’t called traveling. He barely even dribbles when getting inbound passes. I’m kidding…kinda. But seriously, traveling… This is today’s NBA in terms of what’s allowed for traveling:  And even last night, Steph Curry’s double dribble traveling call is “lauded” instead of called:  Here’s some Westbrook if you will, one that was actually called. He’s had another just like it that was NOT called.  Had enough of the fun of traveling. Let’s now travel in time…(see what I did there? Sorry, I couldn’t resist.) But taking Westbrook back to 1962, he’d actually earn some of those “free” rebounds his big men are giving him. He’d probably average perhaps 12 rebounds. But assists, oo00f, today’s game is very generous by comparison. He’d probably average only 6–7 apg. Westbrook shoots 42.5% today in a game where the average is 45.7%. Oscar shot 47.8% when the league average was 42.6%. Westbrook would probably shoot about 38% when adjusted. Robertson, if transported forward would shoot about 55%. Westbrook would also lose just over 2 ppg as 3pt’s only count for two in 1962. Ouch. The Big O coming to 2017 would get more assists in today’s NBA. He’d probably average 11–13 without breaking a sweat. He would still get a lot of possessions as during the “break neck” pace possessions were spread around more than they are today where teams make sure their stars have a high “usage rate (%)” of possessions. As far as scoring goes, if you take out the super outlier, Wilt Chamberlain, scoring averages of the top players from the 60’s to today is about the same. 28–33 ppg. Jordan, possibly another outlier, got to 37 ppg. So I wouldn’t add any more points to Robertson’s total. Robertson would lose rebounds if he came to 2017, probably would still average 7–8 rpg tho. Maybe, he too, like Westbrook, would have teammates who yielded him 2.2 rpg to tack onto his average to get a triple-double season. My 1962 prediction for Westrbrook with the adjusted FG%, no 3pt’ers, would probably average 26–28 ppg, 10–12 rpg, and 6–7.5 apg while shooting 36–40% year over year. Not bad at all. Robertson would probably look more like LeBron’s numbers, but maybe a little drop in scoring with those 10–12 apg year over year. Maybe peak 13+ as Stockton did for a number of years. 24–27 ppg, 6–8 rpg, 11–13 apg. As far as video highlights go, it’s unfortunate we have so little from the 1960’s. It’s estimated we have at most about 6% of Wilt Chamberlain’s games. None of his 40 point games. Chamberlain played 1045 games. He had 271 games in which he scored 40+…over 25% of his games. None, yes, none are available (or exist at all) to fans. And most of those 6% are when Chamberlain was, by comparison, in the twilight of his career. Much of the same it is with the Big O. For much of the 1960s, ABC only televised Sunday afternoon games, including during the NBA Playoffs, per Wikipedia. And yes, Oscar could most definitely dunk, he had a major spill at one point, so he didn’t. Plus those Chuck Taylors!?! Damn! Here’s him jumping for a block.  here’s an article on those Chuck Taylor’s….awful awful shoes [for basketball]. Basketball Diaries: I Balled in Converse Chuck Taylors and Lived To Tell About ItWe played basketball in Converse Chuck Taylor All-Stars to see how well they&#39;d hold up on the court.www.complex.com Here’s the continuation of thoughts as mentioned at the top of this post: https://medium.com/@PaulDeVos7/did-you-know-he-gets-more-possessions-per-minute-than-anyone-in-history-right-now-2af3e9aaa04 It was prompted by a response to this post. Apologize for any choppiness in thought. ", "title": "", "parent": "33", "creatorid": "608456fc7b77", "id": "75e4e0dc7111"}