{"name": "33_22", "child": "", "content": "First of all, Kareem has repeatedly said that The Big O was arguably the greatest player he had ever seen or played with. This is Kareem of the Showtime Lakers we’re talking about, not some random guy in a bar; I think his opinion has merit. And, well, players missed a crap ton of shots back in the day. In 1961–62, the average team shot 42.6 percent from the field and missed 61.8 shots per game. This year, the average team has missed 46.4 shots per game. For the few players ridiculous enough to approach triple-double-dom since Robertson, the rebounds have been the holdup: Jason Kidd averaged a points-assists double-double with at least seven rebounds twice; Magic Johnson did it four times; no player has averaged a points-rebounds double-double with at least seven assists since Wilt Chamberlain. It’s generally said that assists weren’t given as generously in the early NBA, but the sheer amount of missed shots back in the day made a versatile player achieving 10 rebounds more feasible. These are points that prop up the argument for Oscar Robertson’s greatness. It is much harder to get assists in a league where people shoot worse. This is doubly the case when officials also don’t score assists as generously. It is interesting to note, for instance, that Oscar Robertson didn’t only average a triple-double for an entire season, but he was also the first player in NBA history to average over 10 assists per game over the course of a season. Prior to Robertson, Bob Cousy led the league in assists per game for eight straight years, but never cracked double digits. He also came a hair’s breadth shy of a triple-double in two other seasons, both times because he fell barely short in assists. Contrasting rebounds with assists is also inaccurate. The league leader for rebounds per game has always been above 10. Dwight Howard had the lowest ever rebounds per game for the league leader in a season with 12.43 in 2012–13. In other words, it has never been as difficult for a good rebounder to get 10 rebounds as it has been for a good assister to get 10 assists, and it still isn’t, even though rebounds have trended down since the 1960s and assists have trended up (though assists per game peaked with John Stockton). This isn’t even getting into the other aspects of officiating and the various rules changes with respect to illegal defense and hand-checking that went in over the years that have favored offense. For instance, how many Shaqtin a Fools do you need to see before you start to figure that increased shooting percentages for the entire league could have something to do with travels not being called? It’s a lot easier to get a higher shooting percentage when you can travel more liberally. Of course Westbrook is a phenomenon, and if you put the 1960s Robertson on the court against Westbrook under modern rules, it stands to reason Westbrook would come out ahead. My point is that isn’t the whole story. ", "title": "", "parent": "33", "creatorid": "13b39719d612", "id": "18e5c68d200b"}