{"name": "33_9", "child": "", "content": "I appreciate the honest analysis — you are going to get killed for it. What is crazy is that even MJ would be better if he played today. He is still the best player (within his cohort) I’ve ever seen. He was as explosive as Westbrook and had Kyrie’s creativeness and touch around the basket (perhaps even better). At 6'6\" he was the best penetrator in NBA history… his highlights hold up in a way Oscar Robertson’s do not (although the team defenses look pretty unsophisticated in some Jordan clips). Nonetheless, if he had played today he would be a better — perhaps even excellent — three point shooter, he’d probably be the best euro-stepper in the NBA (in his day, they used the now practically outlawed jump-stop to get around defenders and Jordan was the best practitioner of the jump-stop in NBA history), he’d have embraced the competitive advantages of analytics and found people for the corner three, etc. Hell, Kobe just retired and he would’ve been better (more efficient) had he been born later. Guess what, this expected. Scientists are doing better science today than Newton ever did but Newton is still probably the greatest scientist of all time (I prefer Francis Crick). That’s why I have taken to trying to distinguish the terms great and good. Greatness is about transcending your era. Oscar, Wilt, and Russell were great but they weren’t that good by today’s standards. Wilt’s highlights are just as disappointing as The Big O’s. Because his contemporaries could not challenge his physical advantages, I cannot find a single clip of him making a legitimate move. Wilt still would be ok on talent alone. In fact, his game looks exactly like Andre Drummond’s. Although, low-post offense is the one area of the game (that I can think of) that was better during another era (Olajuwon, Ewing, Robinson, Shaq, Barkley, McHale, Malone, Duncan) than it is in this era (rule changes have hurt that skill) Wilt did not play in that era and was not as good as these guys at basketball. This was a rather long way to say that I agree wholeheartedly with this article. ", "title": "", "parent": "33", "creatorid": "17700c413015", "id": "7aa54737d34f"}