{"name": "340_6", "child": "", "content": "This is an odd one… There is a common saying 80% of the results come from “showing up”. If you combined that with a track record of successes showing up to a decent college or rigorous previous job you can get to a very solid indicator of future performance, even in a system built on archaic measures of success such as gmat,gre ect.. So in that case the employer is not the target consumer, the applicant is? So you’re trying to find out what that person might be good at doing, assuming there is a high (and valuable) correlation between what you are good at doing, and what you actually want to be doing? and using this solves that. I know there is a lot of ground up, pent up, change trying to work its way up into the the education system. But there are some massive, immovable bottlenecks supported by multiple layers of dependant and independent stakeholders. You can change what is taught and how, but it will be measured against a near global standard which is firmly locked into place and can not be — by design — disturbed unless a mass number of schools choose to abandon or supplement this as a measurement tool of success. Schools and the staff that make these decisions simply don’t work this way. When people talk about fact memorization vs being able to solve real world problems and the differences between 1960’s education and what is required going forward, the system is already adapting in an organic and natural way. 10 years ago how many schools taught entrepreneurship — as a subject? Now you have Masters level courses, no wait entire Degrees on the subject matter. You have “maker labs” in kindergarten classrooms and have weekly public speaking as part of change in the way children communicate. I guess I am missing something here, potentially. Which is why I don’t cut checks, I mop floors. :) ", "title": "", "parent": "340", "creatorid": "b43814bf4909", "id": "895246f3bee8"}