{"name": "35_11", "child": "", "content": "Your whole analysis is wrong. Your extrapolation of stats is laughable. Apparently you have never heard of the word “defense”. Westbrook is accomplishing his triple doubles while going against other freak athletes every single night. On a game filled with monsters, Westbrook might be the faster and more athletic of them all. Now put Oscar Robertson in today’s NBA. As some said, he would probably train his body to 2017 standards. He would eat better. He would use good shoes. But from what we have seen, nothing on him screams freak athlete. He looks like an average (at best) athlete in 2017. Oscar feasted against unathletic guys that you could barely call professionals. How many freaks did he face? Wilt, Rusell..and? Your average frontcourt player in today’s NBA would obliterate those layups and midrange shots into the 5th row. Now put Westbrook in 1962. No one would be even close to stop him. He is so stupidily fast (even for 2017 standards) and now you are putting him against a bunch of slow footed-short dudes? Its like Westbrook going against college players. He would obliterate them. The lack of 3pt rule actually helps Westbrook, who jacks a ton of stupid 3’s (by necesity, its what defenses give him). He is not a good 3pt shooter, altough he gets hot from time to time. Rusell feasts on FT’s and the restricted area. The midrange is another strong part of his game. About the traveling: he travels because the refs allow it. All NBA players do it, because the NBA rules completely suck and need to be overhauled using FIBA rules. NOW, when NBA players go to play in FIBA, they adapt very well to the traveling rules. What makes you think that Rusell Westbrook wouldnt adapt in 1962 to said rules? In synthesis, Rusell Westbrook is a MILES better athlete than Oscar ever was. Even if you argue that maybe OScar would get better with 2017 training, that’s only a mere potential possibility. Rusell IN REALITY is a freak athlete. If you really think that any 1962 team would not get completely blown out of the gym by the Sixers or Lakers of 2017, then you are on drugs. The sport has evolved, and the players have evolved with it. What Oscar Robertson and other legends did was amazing in their context. Im not taking away from that. But they CANNOT hold a candle to 2017 athletes. Such is the nature of evolution. ", "title": "", "parent": "35", "creatorid": "403525a18925", "id": "73c7e5e42eda"}