{"name": "35_5", "child": "", "content": "Did you know he gets more possessions per minute than anyone in history right now? So in taking Westbrook back to 1962, you’re taking back everything around Westbrook — all medical, same coach, etc. And totally forgetting how he’s performing relative to that environment (and yet, somehow it’s going back with him to ALSO give him an advantage in 1962). Outliers, in their own season and/or generation Does Oscar, an outlier for over 50 years, not also still be an outlier? Westbrook has 41 triple doubles, but at a time when there’s the most triple doubles in history. He’s barely double the 2nd place player (Harden, 20) and 3rd (LeBron, 12) and so on. Today there have been 110 triple doubles. Westbrook has 41. Do you know how many of the triple doubles Oscar had in 1962? How much of an outlier was Oscar year over year of his career? How much is Westbrook? Basketball Training We can then talk about how good Oscar got without even having a functional gym in high school, as the original author noted. Take an NBA player from today and put him in 1995 would be an equivalent amount of ‘extra’ training Oscar would have gotten with just basic training necessities afforded to him. I’m fine with or without the handcheck rule, but giving the transported player the ‘environmental’ benefits you are attributing to the era of the more advanced player, to the player in question, or in this case, Oscar. The Evolution of Human Size Per the health/nutrition angle. If you’re giving Westbrook to 1962 you’d probably have to take away those things. This is gesturing, which is harder to do than say statistical comparisons of a player in their era where vastly more variables are equal and can be accounted for. But let’s try it. Let’s look at what would become of Oscar, if you gave Oscar today’s training, today’s nutrition. Let’s look at weight. A typical 15-year-old boy weighed 135.5 1966 and 150.3 pounds by 2002, an increase of 10.9%. The average weight for men rose “dramatically,” in the CDC’s words, from 166.3 pounds in 1960 to 191 pounds in 2002, or 14.9%. Should we give Oscar 15% increase? Let’s look at NBA players, specifically chosen (not true samples of population) over time. Let’s take a look at height. The average height for men increased from just over 5-foot-8 in 1960 to 5–9 in 2002. One inch. 68 inches to 69 inches, or 1.4% taller. Not much. We’ll get to NBA players in a second, just trying to establish as much apples to apples as we can. src: http://www.livescience.com/49-decade-study-americans-taller-fatter.html If you look at this study on heights of players on NBA rosters (doesn’t mean they played that much, I took a study on height by mins played as to get a more ‘true’ height of height on the court). The average increase in height over time of NBA players from 1962 to 2015? 3.3% Oscar was 77 inches, he’d get 2 inches. Westbrook is 75 inches, he’d lose 2 inches. Oscar is now 6'7 in 2017, Westbrook is 6'1 in 1962. If you look at the same chart for weight from 1962 to 2015, the average goes from 200 pounds to 216 pounds, an increase of 8%. Oscar was 6'5 and from rookie year to later in his career somewhere between 205-225 pounds. So he’d be 221 to 243 pounds if he came to today, just giving him the ‘average’ increase. Although, we should probably pro-rate how much of an outlier he was in 1962 to his fellow player and add that too. That would give Oscar a 12.5% increase [his outlier to his generation] * avg increase of all players, which comes to 13.5%. So in weight Oscar’s weight has a range of 227–255 lbs. So we’d see Oscar rolling on the court at 6'7 253 pounds. Is there such an athlete today? Yes, his name is LeBron James. So physically, today, Oscar would be LeBron. But Oscar was also well above average in terms of shooting for his era. He even led the league in FT% twice. Players of this generation who led the league in FT% twice? Steve Nash, Reggie Miller, Peja Stojakovic. His FG% is 55% now mind you. His FT% would be around 90.4%. We can do some projections for his 3PT shot, but I don’t have the data with me, it’s on my database at home tho. I’ll see if I can pull up some numbers if this picture isn’t already apparent to you. If your curious on an actual study on bodies of athletes. You’ll see it’s more about selection and technology. So yes, as a whole, most players have progressed. But outliers, which most of these stars were — have no increased much. If fact, Wilt Chamberlain would still be more athletic than 99.9% of the athletes of today. Don’t forget, he trained for the triple jump, the high jump (without advances of the “Fosbury Flop”), the 400 meters, etc. Here’s an actual study on athletes over time:  This is only a teaser, I suggest, if this topic interests you at all [whole basis of your argument], you should read the book. I have a few others I’ll have to see if I can dig up. [I’m trying to disprove my ignorance — how am I doing so far?] He’s some closer looks at the super athletes training for a specific event and only 1–3 events total. How far they got with ALL the knowledge of what Oscar and Wilt had (plus much more, e.g. Fosbury Flop) plus nutrition, plus training, etc. World Record High Jump Progression: World High Jump Record ProgressionImage World High Jump Record Progression in Paul DeVos's images albumibb.co World Record Long Jump Progression: World Record Progression Long JumpImage World Record Progression Long Jump in Paul DeVos's images albumibb.co World Record Triple Jump Progression: World Record Progression Triple JumpImage World Record Progression Triple Jump in Paul DeVos's images albumibb.co Encouraged or discouraged? These are the best of the best getting all the advances in technologies used [hope you watched the TedTalk video, especially when today’s athletes had to use the technologies of yesterday, e.g. 1962], advances in nutrition [no longer drinking rat poison and booze as “performance boosters”], etc. Oscar only gets about a 2\" increase on his vertical, Westbrook loses about 2\" without the outlier respective to their generations kick in. My guess is Oscar gets a bigger boost than 2\" and Westbrook, even in a generation where many jump very well, still gets an increase vs a decrease. But to sum it up. Oscar is 6'7 255 lbs in 2017. Oscar shoots 55% FG and 90.5% FT. If I remember right, his projected annual 3PT% would be 36–42% annually. Westbrook is 6'1 185 lbs in 1962. His FG% is 38%, his FT% is 87.5%. I won’t give you the rate statistics for PPG, RPG, APG as before — not sure you’d believe them any more now. This is all without factoring in these environmental changes. I think they’re pretty hard to prove. But, as you can see, if we did factor in the physical things, they would be way more beneficial to Oscar than they would to Russell. ", "title": "", "parent": "35", "creatorid": "608456fc7b77", "id": "2af3e9aaa04f"}