{"name": "35_9", "child": "", "content": "Where would Westbrook take his shots without the 3pt shot helping him space? If you take Westbrook back to 1962, he’s only 6'1. Yes, he’s still an outlier for speed. He shoots 38% if you give him shots. In the area where most of the shots were taken (3–10 feet) in 1962 Westbrook has a career shooting percentage of 32.6%. Russell Westbrook Stats | Basketball-Reference.comRussell Westbrook - Career stats, game logs, biographical info, awards, and achievements for the NBA and NCAA.www.basketball-reference.com In 1961–62, Oscar played Bill Russell 8 times, Walt Bellamy 10 times, Wilt Chamberlain 8 times, Red Kerr 9 times, and Bob Pettit 12 times. It’s been noted in taking the listed heights of NBA players vs actual heights that beginning in the early 1980’s heights have been exaggerated by 1.18 inches on average. I took a sample of 921 players. You can get this data as well from from nba.com and draftexpress.com and do your own analysis. Average Height IncreaseImage Average Height Increase in Paul DeVos's images albumibb.co Who are the perimeter defenders at the center position in the NBA since 2000? What height were they and how do they compare to say, the likes of Bill Russell (you know, on the shorter side of the great Centers of 1962 btw). Would 3-time Defensive Player of the Year, Dwight Howard, be considered a good defender? Here’s Bill Russell, standing toe to toe with Dwight Howard: Russell Dwight HowardImage Russell Dwight Howard in Paul DeVos's images albumibb.co How about Bill Russell standing next to one of the highest rated D-Rtg (Dean Oliver’s defensive metric) of all time in Kevin Garnett? Bill Russell Kevin Garnett3Image Bill Russell Kevin Garnett3 in Paul DeVos's images albumibb.co How about Bill Russell next to “6–9” Ben Wallace? Even with the afro…(height of the width of Ben’s hand) e.g. another 4–5 inches. Bill Russell and Ben WallaceImage Bill Russell and Ben Wallace in Paul DeVos's images albumibb.co Walt Bellamy and Wilt Chamberlain were both bigger than Russell. As far as athletic ability, how many 6'10 players, centers that you mention can jump over a 6'2 player on the fly? You, mean, like Bill Russell. Again, with limited film available vs today, where EVERYTHING is on video. There is roughly 200 million more chances to find such an instance. Can you please give me the example of such a center in today’s game or last 30 years, doing the same.  If you want to get an idea on the actual progression of athletes (spoiler: more sampling choice than great improvements). I have another response that outlines some of those things. Did you know he gets more possessions per minute than anyone in history right now?So in taking Westbrook back to 1962, you’re taking back everything around Westbrook — all medical, same coach, etc. And…medium.com ", "title": "", "parent": "35", "creatorid": "608456fc7b77", "id": "eacfe87a8423"}