{"name": "392_14", "child": "", "content": "I came across this research when I was training to teach and applied it a lot in my earlier years of teaching. Of course it works. Why wouldn’t it? After all, it is how children first start to learn, so stuffing grades and levels in when they go to school is nothing more than an arbitrary act that serves the teacher (system) more than the child. The problem I found what that I knew the children were learning, THEY knew they were learning — it was self-evident in their work and their confidence, et al. I was a drama teacher and found — with no melodrama in my example — that my children in youth theatre where they would receive focused feedback, criticism and encouragement, and would far outperform students at school. 8–10 year olds in youth theatres were producing work of the same theatrical and cognitive level as GCSE (15/16 yrs) students in school. Eventually I had to leave teaching because I could no longer stomach selling the lie that students were achieving the high grades I was instructed to give them (despite them never showing sustained ability at that level). I resented the fact that the system actually doesn’t care at all about learning: it cares about grades. Children are statistics, not individuals. They are statistics used for school league tables and — perhaps worst of all — the market forces that command the grading system. Admittedly, I have always been bitter about it. I cared very much for what I believed was valuable education. I supported all types of learning, whether in my own Drama subject, or maths, history, English: all learning, and the goal to achieve it, is valuable. If we sow the seeds for that when children are young we give them the ability to pursue it their whole lives. The irony is that schools have been forced to remove competition for years. Sports days not being allowed medals; competitions rewarding involvement; “winning” being discouraged dirty, and “losing” being denied. And yet, the pressure that schools are placed under in order to “get the grades” requires them to put students under to “get the grades.” The concept of peer assessment has been stolen by quangos all wanting to claim it as their own idea. Students being considered highly achieving if they can take a highlighter pen to grade descriptors and show that they understand what they must learn next. It has become a world where being seen to achieve matters more than the achievement itself. That’s why I left teaching — when the profession placed greater value on my accountability than it did on genuine learning. Learning is fluid, it ebs and flows which changes in the season and tides of the mind. It is inextricably linked to both the bottom and the top of the hierarchy of needs. But their is no point aiming for the dizzying heights of the top of that pyramid if the foundations are presumed to be of less importance. You see — you got me rambling! I miss teaching…children. I don’t miss being a “teacher.” ", "title": "", "parent": "392", "creatorid": "85173043333", "id": "9cf281e4eb25"}