{"name": "394_21", "child": "", "content": "The 1971 Supreme Court decision, Griggs v. Duke Power Company, remains largely unknown, but no ruling of the past forty-five years (except for Roe v. Wade) has done more harm to the American way of life. It changed the way companies hire, pay, and promote workers, ensuring that America would be a country defined by credentials rather than merit. Griggs is why we’re wasting money and time on a dubious good like a B.S. degree — pun intended.The saga began in 1969 when Willie Griggs, a black man born in the segregated South, decided he was overdue for a promotion. In order to get one, per Duke Power Electric Company rules, he had to pass two aptitude tests and possess a high school diploma. Griggs smelled racism. The tests surveyed employees on basic math and intelligence questions. None of Duke’s fourteen black workers passed. Griggs and twelve others sued the company for discrimination. A district court and federal appeals court accepted Duke’s claim that the tests were designed to ensure that the plant operated safely. Duke bolstered its case by pointing out that it offered to pay for employees to obtain high school diplomas and that white applicants who failed to meet the requirements were also denied promotions.The Supreme Court wasn’t buying it. This was North Carolina after all. The court compared the tests to Aesop’s fable of the Fox and the Stork, in which a fox offers a dish full of milk to a stork, whose beak prevents it from satisfying its thirst. The implication that black and white workers were of a different species did not strike any of the justices as racist, unlike the objective tests. Griggs found that if blacks failed to meet a standard at a higher rate than whites the standard itself was racist — a legal doctrine known as disparate impact.“What is required by Congress is the removal of artificial, arbitrary, and unnecessary barriers to employment when the barriers operate invidiously to discriminate on the basis of racial or other impermissible classification,” Chief Justice Warren Burger wrote in Griggs. “Diplomas and tests are useful servants, but Congress has mandated the common sense proposition that they are not to become masters of reality.” Burger may have intended to free America of bureaucracy, but his decision in fact bestowed that title — “masters of reality” — on college administrators.Diplomas do little to alter the dynamics of innate ability and intelligence — even less so now that institutions have lowered standards. The knowledge gap between college seniors and freshmen is negligible . Other studies have found that class ranks at graduation closely mirror testing ranks upon matriculation. If businesses could recruit and screen candidates using testing metrics, it would allow workers to begin their careers earlier, advance quicker, and do it debt-free.The lie that props up our Big Education regime is that the GI Bill, which paid for World War II veterans to attend college, produced the upward mobility and economic boom of the postwar period. It’s a heartwarming story, the veteran who would have been a dust farmer but for the grace of government generosity. But it just isn’t true. Only one out of every eight returning veterans attended college. The rest, the vast majority, benefited from something even more egalitarian: aptitude testing. The format favors raw talent above all else, allowing companies to hire high-potential candidates from any background and groom them to fit the job. Also check out Academically Adrift: Limited Learning on College Campuses ", "title": "", "parent": "394", "creatorid": "1dc1e35179a8", "id": "d19ccd0f725e"}