{"name": "403_1", "child": "", "content": "I agree with much of what you’ve said here. I’ve doled out some of the same advice myself. However, what this line of thought always misses is that kids can and will often cheat nearly as easily even when given assignments with no “right” answer, or PBL-style assignments. Say you and a colleague have developed an essay prompt that asks for a personal literary response that ties the meanings of a given text to one’s own life. That topic is not Googlable. Still, Miriam might write that essay in the fall trimester and then pass it off to her best friend Janet taking the same course in the Spring trimester. They’re good friends. They share many of the same life experiences, and they know each other well enough to flub the rest. They’ve successfully cheated on an “authentic” assignment. What’s more, they’ve done it in a way that is grossly unethical but still might pass the “not cheating in the real world” test, since Miriam is knowingly and willingly acting as Janet’s ghost writer. Still, at the end of the day Janet has been robbed of the learning experience and has in no way demonstrated her own ability to analyze a text successfully or write coherently. The same sorts of things can happen with any sort of PBL project that doesn’t require students to generate their own question (and even then, you better be checking “their” question and subsequent project against the ones submitted to the other teachers in your building last term). Cheating in the sense of students grabbing answers to low DOK tasks off the internet is not really the issue anymore for educators who are paying attention. When you need students to demonstrate that level of knowledge to you (and you definitely still sometimes DO as part of the learning process despite what the Edtech reps tell you) you require it be demonstrated in a time-constrained tech-less environment. It’s not hard. The bigger problem is that 1:1 environments increase the ease, likelihood and prevalence of students cheating even on more authentic assignment types by passing work to one another. This ease is further exasperated by a learning environment that expects students to find answers to their own questions via the internet and via collaboration with their peers (approaches I wholeheartedly support, btw) in that it blurs the lines between acceptable and unacceptable “sharing.” ", "title": "", "parent": "403", "creatorid": "7b0a89bf81de", "id": "7794ac03b2dd"}