{"name": "407_19", "child": "", "content": "This isn’t true. Net Neutrality is a simple framework that means internet service providers (ISPs) — who are basically a handful of regional monopolies like Comcast and AT&T — are not able to: block websitesslow down websitesor accept money in exchange for speeding up (read: not slowing down) specific websites That is literally all Net Neutrality is. As long as these monopolies follow those 3 basic rules, they are allowed to innovate in any way they want. But they don’t. Because they have no incentive to innovate. Because they’re monopolies, and are extracting monopoly rents. Net Neutrality doesn’t hurt anything. It helps content providers — basically anyone who has a website or online service — ensure they’re able to reach their customers without harassment from these monopolies. Getting rid of Net Neutrality would only harm consumers and content providers. ISPs wouldn’t re-invest any of the rent they’re able to extract in a post-Net Neutrality scenario. These monopolies already make tens of billions of dollars in after-tax profits each year. The only people who would benefit from killing Net Neutrality would be people who hold stock in ISPs. The real problem is that over the past few decades, the ISPs were able to capture the regulators, and use these regulators (mainly the Federal Communication Commission) to help them establish uncontested monopolies. So yes — government was the problem here. Otherwise these monopolies never would have gotten so big. But now they’re so big and powerful that we have no hope of making these markets competitive again without at least some level or regulation. (For perspective on how hard it is to compete with ISPs in the current climate, even Google — the second largest corporation on earth — couldn’t compete with ISPs, and is abandoning their Google Fiber initiative.) The answer is not getting rid of Net Neutrality — that would be extremely stupid. The answer is creating more competition in the ISP industry. I just spent 3 months researching the economics of the internet, its architecture, and the history of communications monopolies like AT&T. If you genuinely believe that Net Neutrality is somehow bad, I recommend you read this resulting article with an open mind: The future of the open internet — and our way of life — is in your handsThere are a lot of scary things happening these days, but here’s what keeps me up late at night. A handful of…medium.freecodecamp.com Not all regulation is bad. Some of it is necessary. Net Neutrality is one of the best examples of a simple, necessary form of regulation that really works. I urge you not to think dogmatically about this, and instead to look at the facts. ", "title": "", "parent": "407", "creatorid": "17756313f41a", "id": "f0bccf8dd437"}