{"name": "412_8", "child": "", "content": "Ex-Zomato here, lived and worked in India in the boom years for food tech, so gonna chime in here quickly. I’d say that the others died because they chose to go madly after growth with very bad unit economics, because investment was cheap and accessible at the time (Q1 2015 saw more money invested in Food Tech in India than all of 2014), and they seemed to believe that they would be able to secure the customers later down the road after acquiring them with heavy discounting. As Zomato has put forth in one of their blog posts (here: http://blog.zomato.com/post/142067240706/two-million-meals-on-heres-what-weve-learned), customers whose first order is low value, tend to maintain that low order value throughout their lifetime as a customer. Couple that fact, with really inefficient operations, in the specific case of Food Panda at least (many of their orders needed callcenter / human interaction), and a lot of fraud happening on the platform due to their heavy discounting strategy, and you don’t really have a case for investors to continue to back your venture. When the money dried up (as it did), TinyOwl and Foodpanda understood that they didn’t have a leg to stand on because they had simply focused on expensive, non-sustainable growth. Swiggy’s model is interesting in the sense that their delivery network allows them to get additional restaurants that don’t have their own delivery networks (About 35% of restaurants in Delhi for instance), although Zomato was (unsure if they still are) doing this as well, through a logistics partner. What was presented in the article makes some sense, but I’d be interested to understand where the author gets the info that Swiggy is handling more volume than Zomato. It will be interesting to understand what happens going forward as the market becomes more competitive, as Swiggy’s commission to restaurants is significantly higher (about 25% to 35% higher, in relative terms) to Zomato’s, because they also have higher costs (delivery). There may come a time where Zomato might want to squeeze Swiggy out by lowering commissions (which it can do because it has very few costs in the operation), whilst Swiggy will have to cover their logistics costs, or push them onto the customer. Another interesting point to consider is scalability of the model to other markets. Swiggy’s is scalable pretty much anywhere where there are restaurants, but I have serious doubts that it will work in countries where salary levels are higher, as delivery costs will also be higher (perhaps drone / robot deliveries as pioneered by Just Eat will be a game changer here). Costs to expand will be higher for Swiggy, and speed of execution much slower, because they have to setup not only the marketing network of restaurants, but also the logistics part, whereas Zomato only has to setup the marketing (if they’re not already present in that market already). I would say that in the long run, Zomato will win the race, as their cheap (or free) influx of users through their alternative business verticals will start beating the “word-of-mouth” that Swiggy is banking on. Let’s see… As for Swiggy entering the discovery space, it’s definitely possible, but it’ll be though. It’s much easier to do it the other way around. ", "title": "", "parent": "412", "creatorid": "2d4bfd0ba60d", "id": "34faa4daf445"}