{"name": "415_14", "child": "", "content": "If you take this a few steps further, I think you get to some really interesting places. Flying anti-G cars, the Cold War, the Napoleonic Code, Bismarck realpolitik, the dot com bust- you can’t predict the future. Evolution happens, genetically, culturally, electronicly, when there are really quick changes in a disruptive environment or really slowly in a positive one. And by definition you can’t predict the log-jams Frank Herbert writes about, or the Jobsian innovations only he could see/predict create. So imagine Flynn flips, Trump is dumped, we are years into a new benevolent world order. Still no flying cars, no manned mission to Mars, but Sears went bankrupt, followed by K-Mart, Barnes & Noble and then Macy’s, Amazon is the first trillion dollar market capitalization company, and there are physical stores and grocery stores coast to coast. Imagine further a next wave of 3D printers, Apple has figured out the special sauce, you print your new iPhone every quarter. The hub-node system of airport and destination applies to airmail, garbage sanitation and p2p nonhierarchical decentralized networks. So Wired had a pretty good rundown on the history of modularization in design in the past couple of years. Take peanut butter, partial protein, add wheat bread, toasted, complete protein, add delicious jelly, scarf down with whole milk. Whole greater than. This plus that. Take Amazon drone delivery, a nationwide network of warehouses, under five pound individual drone delivery, IKEA-style modularization DIY construction, a hub-node system of delivery and a 3D-printing revolution. What do you get? Do you see it? In other words, forget Amazon as the originator. What if I, you know, create something in my mind, maybe literally dream it, then I take it to a local CAD shop, maybe a co-op in a retrofit factory, or maybe I design and print it up myself, at home. Then it gets broken down into its modular components, not just delivered but also picked up by Amazon drone. Part of it goes to New Mexico, another part into Canada, it all gets routed and ends up in New York a few hours later. Then it arrives within say an hour after that in several packages at the customer’s doorstep, and maybe there are some technical gears or widgets or circuit boards that they simply get emailed or texted or tweeted and they print themselves, then construct the whatever it is. Sure, the components are there to do all this now, but does it become a reality? Is there only one Alpha dog at a time that gets to impose its will on the American/global economy/psyche? IBM, Microsoft, Netscape, Cisco, Oracle, Apple, Google, Amazon, Andreessen Horowitz Angel Unicorn Start-up Investors Inc (aka Jim Clark’s Gates Grudge-machine Part III), Snap or Uber or who knows what next? In other words, in order to get to this spot does Amazon have to say best Tesla with solar, does Sears have to go bankrupt, do we have to avoid a monetary collapse due to Trump Mnuchin deciding to default and so forth. Meanwhile, with Musk looking into Crichton Terminal Man territory, mind-computer interface, and Bezos experimenting with AR & VR in physical stores, how many steps does it take now to get from concept, to reality, to effect a user’s perception? In other words from one person’s consciousness to another’s? A lot of steps in the vertically-integrated supply chain service economy. This certainly reduces it by an order of magnitude. The interesting thing, though, will be to see if Bezos overplays his hand and this, along with 3D-printing ends up more a novelty in the dustbin. Maybe those Sears stores real estate create a temporary drop in square-foot retail rent, giving some start-up room to grow. ", "title": "", "parent": "415", "creatorid": "cc5d4496add6", "id": "3d4be9fb003f"}