{"name": "417_4", "child": "", "content": "There are likely a lot of reasons Microsoft bought LinkedIn, but I’m sure you know that. This made a better headline for pulling in traffic. The best reason to buy LinkedIn is their customer file -- the largest asset of any social network is their client data and metadata. This shouldn’t be a secret by now. These services are free because our personal data, behaviors, and attention to advertisements are the actual product. There isn’t a week that goes by that LinkedIn doesn’t ask me to pay for a premium membership or their equivalent of Google AdWords. But as a privacy advocate, I have been critical of their permissive privacy policy for years. It allows for private and governmental abuse of users' personal information, and some of the language has been laughably slack. https://plus.google.com/+ShavaNerad/posts/B9inRB5tPt1 You just can’t get by a privacy policy that has plausible deniability clauses in it that translate to something like, “or if we feel like it.” So, if Microsoft bought them, they bought a database of intelligence on international professionals likely unrivaled in their field -- prospects to market to, to recruit. Rivals. Indicators of emerging technologies. Professionals in transition. You could not do better engaging the equivalent of the NSA of business intelligence, than to buy LinkedIn as a private company. I think that might have just a bit more to do with it than the affability of the CEO on Microsoft’s board. He is there to help them to understand how to use this amazing asset to turn their company around. God knows, if you praised a woman CEO who had achieved so much for her assets as Ms Cordiality, people would be up in arms. He’s not worth that many zeroes for his smile, even with a bunch of phone calls thrown in. He’s built an amazing Big Data asset, for good or ill, whose (over)shared data could be the salvation of a tech giant. The shape of the devil in those details will be something for privacy mavens and users to watch over time. ", "title": "", "parent": "417", "creatorid": "345459ed5a9", "id": "696c28e69210"}