{"name": "418_3", "child": "", "content": "The state of North Carolina has had at least two competing companies laying fiber far and wide for about a year. Yards and streets and sidewalks have been drawn on with bright spray paint — yellows, reds, oranges, blues — to mark service lines. Grass gets dug up. Things get damaged unexpectedly. This has been happening repeatedly. In my county and nearby counties, the demolition and digging, and subsequent cable installation underground has been the most disruptive part of the process. And from what I’ve heard — and seen firsthand — an inconvenient and costly part of the process especially when water, electric, and gas lines get cut, or more commonly TV and internet lines sliced. That damage has happened frequently, and not only does it cost money, but it also costs time, slowing down the installation process. The company laying the fiber, or their contractor, has to pay for repairs. Unforeseen expenses, you ask? Yes, most certainly. These service disruptions and demolished yards may have caused a small commotion — or when gas lines get cut, a big one. Silver lining? All along, there was the hope — the promise! — of Google Fiber. But a rumor has been spreading that they may not install in every county we’d hoped for, so some of us will be left out. How bad would that really be? It wouldn’t be bad bad, as in We have lost or a dramatic posturing of Poor, poor us. Honestly, we’d all move on and be okay. It wouldn’t be a loss, but rather, a letdown. We’ve had hope in one company’s marketing and promise, but they may not follow through — emphasis on may because it’s still early in the process (or late, considering that digging has been happening for nearly a year) and moreover, it’s just rumors that we’ve been hearing about not getting the service. In terms of letdowns, we’ve seen this before when services we come to value and trust, such as Google’s Reader, come and go. But in this case, and with Google Fiber, some of us won’t even have the chance to at least try it before it disappears since it may not arrive at all. ", "title": "", "parent": "418", "creatorid": "9f840dad352b", "id": "b66836f07d9a"}