{"name": "418_18", "child": "", "content": "Having been involved in the efforts to get improved bandwidth and municipal fiber efforts in three progressive cities, since 1994, it is a conundrum. And the issues are many: even when fiber passes a commercial or residential building, getting access to, and vertically up, buildings is difficult without a number of customers pushing the building owner.access to poles can be tricky and slow, thus the “one touch” approach that Louisville is fighting for (and would help promote competition), but non-discriminatory access is enshrined in law. In underground wired areas, access to conduit is far more difficult and expensive to install. There have been many innovative technologies tried, but have proved to be economic only at a utility scale.even where dark fiber is available for lease, most broadband providers do not want to rely on a third party for infrastructure, and the timely repair of the infrastructure, nor forgo the depreciation on their books.the Utility model has a potential cross-subsidy problem; where the electric utility has put in a lot of fiber, generally it cannot subsidize a separate broadband utility. But even if allowed, power utilities have huge infrastructure challenges themselvesand often are already squeezed for debt coverage and bonding capacity given the resistance against rate increases.Somewhere there has to be a revenue stream to support the infrastructure bonding…if other providers are reluctant to share infrastructure, by either a dark fiber, lambda, or MPLS approach, then it becomes a retail issue. The uncertainty in the market, especially as more Internet based video services (Sling, DirecTV Now, etc.) erodes the previous economic engine of cable fees, will make capitalize a pure fiber play more difficult. In one City a number of years ago, our data showed that for good coverage of the build debt, at municipal bond rates, we would need to take 40–50% of the market share from the existing cable providers, and have a significant portion of customers spend in excess of $100/month.It can be solved, but subsidization will be required in many circumstances. The Owens Valley of California, where 3 counties partnered on federal and state grants, with the cooperation of the utility that owned a lot of property and right of way, brought fiber to a region where a t-1 was as good as it could get before the fiber was lit. ", "title": "", "parent": "418", "creatorid": "65cb83e7bf78", "id": "d50d776f942c"}