{"name": "418_16", "child": "", "content": "This article came close to the answer but was a bit off at the end. See the following for a more detailed analysis of why GoogleFiber stalled. UBB2020 - Why Google Fiber Has Stumbled, the Lessons to Learn & Why Moving to Fixed Wireless Won't…From its inception, Google Fiber has owned the gigabit narrative in the media and took on a mythic aura of providing…www.ubb2020.com Also, statements such as “ The only business model for fiber” …are presumptuous to say the least. I KNOW a number of other business models for Fiber that work quite well and solve ALL the macro issues Ms. Crawford highlighted. In the long run Communities owning the physical infrastructure is ideal. But, the Cities IT director isn’t a broadband expert and the big issue is they move too slow. The biggest bottleneck to innovation and thereby broad economic success for the USA are the incumbents. As noted, Google Fiber wasn’t innovative, the merely offered the exact same services that the incumbents did. Waiting for cities and towns to act and fend off the barrage of incumbent law suits will only give the incumbents time to invest “just enough” to give American’s “just good enough” services. This will appease Congress and give the incumbents 10–20 more years of monopoly sloth and will throttle innovation and the US Economy for even longer. Lastly, it was unclear whether the author was arguing for the City to lease dark fiber. Leasing dark fiber is the worst possible scenario for municipal owned fiber. You’ll be worse off than surrendering to the incumbents. The ONLY answer for America’s broadband problem is Open Broadband Access. The entity (s) that own and light the fiber do not offer ANY services. Everyone can be a service provider and lease Layer 2 network tunnels. With dark fiber all you end up with is one service provider leasing the dark fiber strand and having a monopoly for that house. In Open Broadband Access, Comcast, Verizon, AT&T and Charter could all offer services to the same consumer over the same piece of glass at the same time. ", "title": "", "parent": "418", "creatorid": "74daee0e2c3b", "id": "657b2babe7be"}