{"name": "418_22", "child": "", "content": "Well, this is a nice story, but it doesn’t account for a number of things that has Google at this point today. While labor was mentioned, it’s not just that labor costs are high. The mere fact of running these networks is high. What Google attempted to do was to foster a service that cost more than they were charging. They could do this with the extreme profits they get from the Ad network, and the selling of our data. But even with that, they attempted to get around the carry rules, which say that cable and fiber networks offering Tv services must carry local stations in addition to the ones they are carrying, and that they have to pay those local stations to to make up for the revenue these stations would be losing. Google insisted that they shouldn’t have to follow those rules, though it would be ok to have their competitors do so. Most communities Google entered decided that they had to follow those rules just like anyone else. Then we saw the argument about pole rights where poles are used. Traditionally, telephone poles are used to carry not only telephone signals and wires, but also power lines. Over the decades, additional services have been added to those poles. For the sake of safety, among other needs, services are placed as far away from the ground as possible. When a company with a new service proposes to use the pole, a series of actions needs to be done. The current services need to be moved higher on the pole, and the new service usually then sits below. The new company pays for the movement of the services on the pole, and the addition of their own. Unsurprisingly, Google, while demanding access to the pole, refused to pay for the privilege. This caused some fights in a number of service areas. Of course, the incumbents didn’t help matters by slowing the access down. We often read about how some countries have much faster internet service at lower cost, and we’re then stated to be inferior over that. In those articles, it’s rarely pointed out that these countries are far smaller, in physical size, and have much smaller populations. It isn’t pointed out that most of those populations live in a few cities, and that rural areas have small populations, and are fairly close to the cities. Here, in the USA, we have a large population, and even though most resides in the east and west coat corridors, with large populations around Chicago and a couple of places in the south, even that population is spread out over thousands of miles. We also have clusters of population far away from each other. The small cities Google chose were fairly isolated. The costs to deliver cable, fiber and telephone is horrendous. Google apparently didn’t properly account for this, it thought they would get preferential treatment. I'm not surprised at this development. Their wireless scheme is ridiculous. I doubt it’s going to go anywhere other than the experimental nature of most of their projects, and then fail, as most of their projects. If something doesn’t give Google enough information on its users, then it’s deemed a failure. It doesn’t get much simpler than that. For all it’s talk, Google, and its holding company, Alphabet, isn’t much more than an advertising company and a data collection service. The measure of a projects’ success is how much advertising it can add, and how much more data it can collect. If that is kept in mind, everything Google does will become transparent and obvious. ", "title": "", "parent": "418", "creatorid": "ddd6d27533ed", "id": "7ee6f53f38a5"}