{"name": "419_19", "child": "", "content": "Apparently, Google agrees with you. I’ve been a customer of their Google Fiber service for the past four months, and they’ve done something pretty ingenious with the home network: integrated it into the TV infrastructure. Each TV, naturally, has a set-top box (STB) that gets it’s signal via our home’s coaxial cable wires directly from the fiber termination point on the side of the house. The primary WiFi router is their network box – which is an all-in-one device that acts as DVR, network storage appliance, Ethernet hub, and WiFi router. Each STB, however, is a ubiquitous WiFi access point, too. Each uses the same network name and settings, and the system even monitors the signal each box receives and turns them on and off based on signal strength, transmission quality, and available bandwidth. The STBs also each have an Ethernet port on them, allowing either a single device (such as a gaming system, Apple TV, or digital assistant) or an Ethernet hub (permitting multiple devices) to be wired directly into the network – extremely helpful for bandwidth-intensive applications like video streaming or gaming. Finally, as you’ve suggested, nothing is managed at the device anymore. The only option I get when I punch in one of the Google Fiber devices’ IP addresses is the option to reboot that device. All the settings and administration is done on the Google website – which took me quite by surprise since I’ve not tried Eero, Plume, or their brethren prior to this. From left to right, my Google Fiber Network box, Telephone Interface, and a Set-Top Box As you indicate, this trend seems to be the next logical step, and after living with it for several months now, it’s actually nice to see the WiFi network fade into the managed background. I haven’t had to worry about signal strength, a dead spot, or bandwidth problems since Fiber’s installation. In fact, the only time I have to think about WiFi is when friends visit and I need to share the network deets – and Google’s even managed to simplify that experience: I supply the system their Google ID (email address) and how long I want them to have access, and Google sends them a temporary network identifier and password that expires when I indicated, with no further thought on my part. (And to address the worries of those oddly concerned about the net neutrality war within their own walls: my iPhones and MacBooks work amazingly on my Google network.) Having seen this emerging trend in WiFi firsthand, I’m pleased with the experience. I can’t wait until future devices connect themselves without user intervention to a network whose name is simply an unintelligible system-generated string of characters that I need have no direct influence or control over. ", "title": "", "parent": "419", "creatorid": "f5860c4e1532", "id": "ef98af5c274e"}