{"name": "419_2", "child": "", "content": "For this much money you can wire your house. We’ve tried in-home wifi with a Comcast modem with it’s internal antenna (internal antennas are a really bad design) and if either of us are not within 5 feet of the thing the wifi is spotty at best or stops altogether. So I wired cable along walls and up by the ceiling and Ethernet into the computers and signal strength is truly a blessing. Neither of us use our computers on our laps like some folks do tho on rare occasion we might show off a vid or discuss a place to eat looking that up on a laptop not wired in for purely the convenience. For smartphones wifi is fine until that signal weakens and then it switches automatically to a nearby antenna outside the building to the contract service. The reviews of these wifi extender devices pretty much suck for what is being spent on them with little consistent operational return. The other problem is not having enough open plugs or not enough of them located such that they can pull in a decent signal unless it’s from the power line. The bottom line is that routers with antennas on the outside are better (in part because they are also longer than the short stubbies found inside boxes) if you must be wireless such as on T-Link or Netgear routers, but if one does not want a multi-antenna router in their house then the stronger option is spending far more (instead of an Eero or Plume or similar) to get an actual business-standard access point device to mount on a wall or in the ceiling with wiring in the wall or ceiling, but then again those cost a small fortune. However, about the only viable wireless option that does actually work pretty well as an access point is using an Apple iPhone. I’ve been in some coffee shops where the shop’s iPhone is where everyone in the place is accessing it to get to the Internet. Seriously, read the reviews of these devices before you go out and buy them. Better….go and experience someone who has them setup and see how well (or poorly) they work with your devices….because these extenders work differently pending which devices you use. What really needs to happen is for modems and routers to have far better signal strength and quality strength and more robust external antenna design along with chips inside and associated software to optimally manage different devices. That might not meet up with the cute box designs available currently, but it sure beats being frustrated with poor performance. ", "title": "", "parent": "419", "creatorid": "cc7897264e8f", "id": "d68b74fbb8da"}