{"name": "422_3", "child": "", "content": "There are meta-issues that frame the construct which are often ignored. Deindustrialization is a consequence of better distribution, more efficient transportation and high yield protein diets from fewer labour hours. These imply a shift from production/export to service and consumerism. We haven’t seen a caste system ever in the U.S. but we have the legacies of both slavery and indentured servitude and these both imply race and class distinction. Further, as part of a more broad Anglo-Western white empire we have a heritage and history which involved white man’s burden, manifest destiny and were born as a nation out of a British Imperialism which included elements of caste not just in the East Indies with plantation farming but also in what used to be referred to as the British West Indies and what we now simply call the Caribbean (from the native Carib people) or the Virgin Islands. We have white-washed the history and ignore the brutality from which our current economies were derived. But without Keynesian aggregate demand buying of commodities by the gov’t to lower price to then fuel infrastructure gov’t spending for both deficit spending GNP growth as well as long-term investment, Trump style mish-mashes of populist rhetoric with voodoo economic supply-side tax cuts probably won’t do much to combat long term inherent trends. We are shifting to the information age, out of the service economy, as the tail end of the Age of Enlightenment with the scientific revolution gave way to the colonial age of empire industrial revolution and moved us out of the parochial and agrarian. In one possible future, we as consumers gain control of our data lives, regain our personal privacy and get paid for the information we generate, which has proven to have value. This model would go hand-in-hand with reduced employment opportunities due to mechanization and machine-learning. But in another possible future, we move into a nightmare scenario in which the class distinction present at the founding, where Locke’s pursuit of property refers to land owning white males over 35 not in debt and property refers to not just land but people, gets morphed with the corporations as people private prison military industrial complex in a plutocratic kleptocracy driven by soldier of fortune mercenary carbon extraction and nepotistic greed. All of our worst impulses on steroids. With golf. Sort of, like, where we currently stand. In this world the notion of creating economies based upon what would look like, in other contexts, indentured servitude, with low-income, no property owning, high debt servents ironing, watching kids, driving starts to get tarnished by our past history as a nation. I get that there is no whip, it is a false equivalency to compare and it denies the harsh reality of where we came from. But historicity is so important for just that reason. ", "title": "", "parent": "422", "creatorid": "cc5d4496add6", "id": "c25d462c3961"}