{"name": "423_25", "child": "", "content": "Great stuff. I haven’t felt cognitive dissonance since the dot com crash, seems like everyday now with Trump. The NYT article this past weekend did a great job of exposing the bro culture aspect. But then you read Tesla has surpassed Ford in market cap, and that Uber, though private is bigger than both by some measures, with funding at $70b. I know, apples and oranges. Still. Strange. Prior to the dot com bubble, many were saying we had left the traditional business cycle. Others said that the p/e ratios were out of whack, and that companies that didn’t have a product were Ponzi schemes. (Even CharPon had Florida swampland, redeemable stamps and German Second Weimar Republic bunds.) Burned investors thirsted for blood. Pets dot com, purchased by Amazon prior to Greenspan bursting the bubble (by raising rates, tightening credit, forcing margin calls to be called in) symbolized the egregious waste. (Little known fact: Bezos’s other questionable bet that same quarter, purchase of Alexa.) So it feels like there is a current culture waiting for the shoe to drop, for Uber to get its comeuppance. It conflates their culture, their business practices. And adds in a degree of wishful thinking. [Full disclosure: I do not use Uber and in truth would love to see them get their comeuppance.] I don’t know how to express this exactly: imagine the dot com crash never happened. And we’re getting pot delivered by drone, cats have their own FB profiles, AOL Time Warner NBC Microsoft owns the world, the Nasdaq is at 100,000 and you can send latte gifts to Mars on AIM. Now imagine it is 10 years from now, Uber still hasn’t grown up, they’re worth $1 trillion but still lose money, they have self-driving water taxis, own Ford & GM and kids ask what taxis are in school. (Ha! Just kidding. They aren’t allowed to ask questions in Amway sweatshops!) People say: well, when the market eventually crashes and they don’t have a working business model… ", "title": "", "parent": "423", "creatorid": "cc5d4496add6", "id": "d31c534cdb07"}