{"name": "425_5", "child": "", "content": "Funny how the internet that was supposed to change the world and make things faster and less expensive has actually become the opposite. I live in California and Uber has made getting a taxi cheaper and faster but now Jerry Brown wants to raise taxes on gas again to an additional .12 a gallon on top of some of the most expensive gas in the country. Why does he need to do this? Roads. Billions of dollars are needed to repair our roads. Did anyone think that maybe having enough Uber cars on the road to get you are taxi in less than 2 minutes might mean extra wear and tear on the roads? Drivers are coming from as far as Sacramento to San Francisco to work for Uber. That is over 2 hours one way. Maybe Jerry should start taxing Uber for all the wear and tear the thousands of extra cars on the road are causing. All “Disrupters” do is eventually cost Americans more money elsewhere. Think of Amazon-cheaper with free shipping. How did they do it? By not paying taxes. The outcome? Hundreds of brick and mortar stores like Macy’s, Target and JC Penney can’t compete and lay off 10’s of thousands of employees. Do we really think these “conveniences” of online travel, online shopping, and getting a taxi with an app is a convenience without a true cost? There is always a cost and every action has a reaction. I stopped using aggregators for travel years ago as I have been in sales for over 20 years and know that the more people involved, the more hands out looking for a slice of the pie. Always better to deal direct. The internet is not direct. There are way to many layers so you never know who you are actually dealing with. It only takes one bad experience with an aggregator to find out there is NO customer service when 3+ parties are involved. Old school means dealing with companies that are upfront, transparent and actually pay their fair share of taxes. If not, then the only person to blame for “conveniences” costing you more, is looking back at you in the mirror. ", "title": "", "parent": "425", "creatorid": "1789df616ba6", "id": "2a38c37b57df"}