{"name": "427_5", "child": "", "content": "Alexis, a really effective contribution to the raft of well-articulated arguments and coverage on the mechanics of change, finally. I’m in Boulder today at a conscious leadership CEO camp put on by MergeLane, a tech accelerator for companies with inclusive leadership at the helm. As a tech company founder, long-time entrepreneur with interests in highly male-dominated fields of lumber and technology and a smattering of big jobs under my belt in the public and nonprofit sectors, I know firsthand how insidious bias can be of all kinds. I’m 50, and only now experiencing the height of my career opportunity in a world that historically doesn’t want me to be in it. I chose machine learning and changing the venture-capital landscape — two of the most impossibly biased sectors to play in. I’m involved in the launching of a new tech accelerator in Sacramento, one that is also focusing on tech companies that are women-led, but not women only. We’re working double-time to make sure that what we’re really doing is developing conscious leaders to grow companies with conscious and inclusive cultures, which includes having an impact on shaping the culture and values of our own start-up ecosystem. Sacramento is a city that is as diverse as any in the world, but without an intentional engineering eye towards a conscious and equitable spine, it could well become yet another Silicon Valley-esque story for the books that we now know has perilous implications for corporate and investment performance, for communities, for peoples real lives, and for society as a whole. I’m done apologizing or explaining to others why this is necessary, and calling pieces like your’s courageous, when what they really are are simply the truthful coverage of real human stories that left unsaid perpetuate a no longer acceptable status quo. For the benefit of every gender and every culture, that is as it should be. ", "title": "", "parent": "427", "creatorid": "19050f573463", "id": "590bd117890e"}