{"name": "438_9", "child": "", "content": "Great to read this. I may be a dystopian pessimist that expects a future probably closer to “Mad Max”, simply because Homo sapiens is such an inexhaustible source of disappointment for me — but I still love to surround myself with optimists and mostly the work of optimists. So kudos to this great article. On a more winkingly note: you´ve dodged the question of religion in your itemization (aside from a parenthetic reference in context of “organ trade” — although you probably mean more something like the artificial growth of organs from stem-cells, especially through 3D-printing, which is probably where the future is going). But there is a general question if an enlightened society is ever possible while at the same time a large portion of the people believes in “sky gods” delivering their wisdom through ancient, badly translated books. But I do understand that this is a sore point at this time in history. For me the more intrinsic item is “money”, which you included in your list. I would make an argument, that all the other points and remarks can actually be melded behind this one point, since our civilization has reached a state where basically all aspects of life are foremost submitted to the mechanics of monetarism. Everything else comes later. We even give power to billionaires because we believe that they are “good people” since they were capable to accumulate an incredible wealth. Which is a train of thought that doesn´t really make any sense and might in the future be a matter of laughter for eight-year-old children. At this point we are assigning an incredible importance to some printed paper (or even worse: to endless columns of numbers running through some obscure servers) — acting like money is somewhat part of the natural laws, with the same value as the air to breath and water to drink. Which could indeed be regarded as a definition of insanity in the future. So if we are not capable to solve this almost “meta-religious” problem of money against the rather bizarre priesthood of “economists” and their political lackeys, we will not solve any of the other points. The overcoming of monetarism is the one big key to the question, whether our future will be dystopian or if humankind can achieve any kind of balance with the existing and dwindling capacities of this planet. ", "title": "", "parent": "438", "creatorid": "634a4efa7569", "id": "4565fb699ae"}