{"name": "438_14", "child": "", "content": "1) Universal basic income – or societal dividends. Our current leading economic system – free markets / capitalism – were designed in a time before we could fundamentally and measure collective contributions. For an age of resource scarcity, where society needed to somehow select winners and losers. In the future, there will be a societal dividend paid to all members of society for the collective economic gains of the society itself. Recognising that all participants contribute to a society’s performance. We have technology geniuses and amazing athletes because other people keep the lights on, the water flowing, collect the garbage, and comfort the dying. There will be no unsung heroes. There will still be incentives to perform and achieve, however nobody will know poverty. A time of such tremendous wealth inequality will seem murderous and barbaric. 2) There will be a society – singular. One global world and a world government. Too many problems are global in nature. Nuclear pollution from Japan doesn’t stop at the border. Air pollution in China doesn’t stay in China. Droughts in California affect Mexico. Zeka doesn’t stop at the Brazilian border. To deal with global problems and threats, we will adopt global governance. We will use a single currency and have global standards. That process will kick off the greatest economic boom the world has ever seen as all companies compete for billions of customers. Human rights will be universal as will justice. Currently nationalities and currencies serve as both firebreaks and arbitrage opportunities. Likely global society comes as a result of an existential human threat. Something the world cannot address as individual nations. Something which finally and simultaneously ends nationalism, racism, sexism, etc. The rise of true humanism. It will be inconceivable to differentiate people based on subtle and irrelevant genetic differences. 3) Space. We will leap from the earth into space and become a spacefaring species. Transformation into a single world government comes first as the challenge of space requires humanity. Space begins a renaissance age on earth due to the materials and technologies developed. Rather than the solution to Earth’s problems, space will be the reward for solving Earth’s problems. Once we are there, the future people will look back on the wastes of war. They will calculate how much sooner humanity could have achieved planetary independence if the world had acted in a coordinated effort for human achievements, as opposed to the very base safety drivers of things like nationalism. Their answer for why we went to the moon and didn’t go back for 75 years will be how long it took us to realise the transition of economic systems from scarcity to abundance. ", "title": "", "parent": "438", "creatorid": "fc42db706ff1", "id": "e0f16b271a71"}