{"name": "443_17", "child": "", "content": "“…he tried to work out line slope between Order & #Chaos”. #Feynman & #Wolfram #Rule30? It’s an #Asynsis angle.As an architect and designer I’ve been following the relationships between CAs and the Golden Ratio since my student dissertations back in London at the Computer Science and Engineering faculty of the University of Westminster in the mid-90s. I speculated then that there was a likely relationship between the “sensitively dependant” CA regimes on the “edge of chaos” and the Golden Ratio, which I published in AD Magazine in 1994 and now develop on in the following blog: http://asynsis.wordpress.com #Asynsis is a neologism meaning “asymmetrical creation” (more on http://www.quora.com/Asynsis). I believe that Conway, Langton, Kauffman, Bak and Wolfram are all on the same track when they describe CAs in this transitional domain. That the “edge of chaos” or “poised realm” regime is the most creative and persistent for a very simple, elegant reason — one that links a law of beauty with one of optimisation. There is I believe, also a strong link with the new universal #Constructal design law of nature and culture as well, where nature evolves to flow currents of energy, matter and information more easily, with greater power over time. The geometrical signature of these behaviours can also be expressed as the Golden Ratio iterated over time. In the Asynsis blog, I also cite a 2006 proof of my further speculation that the Golden Ratio, or Phi for short is embedded in the Feigenbaum diagram or Logistic map of bifurcations modelling systems expressing both chaotic and ordered regimes. I also show the relationship with the E8 Exceptionally Simple Theory of Everything of Garrett Lisi and classical scale computational complexity #Universality. So what we have is a new classical-scale theory of everything based on the geometric constant of Phi, where nature self-organises itself and builds complexity via quantum criticality in numerous permutations that can be traced back to the Golden Ratio — the archetypal fractal. We begin to see how nature allows design to emerge analogically, recursively and optimally from entropy. References:http://www.scoop.it/t/asynsis-principle-constructal-lawhttps://medium.com/@ASYNSIS https://www.facebook.com/pages/AsynSo%CF%86ia/202383966558282 https://www.physicsforums.com/threads/rule-30-and-the-golden-ratio.659580/ ", "title": "", "parent": "443", "creatorid": "95e3ea6026aa", "id": "2c4e1cd31bc5"}