{"name": "505_10", "child": "", "content": "I love the idea of a proto-strategy! I haven’t necessarily tried a “smaller process” in the past, but I think it makes perfect sense and I can very much empathize with the circumstance. I think the main underlying point that a “proto-strategy” really gets across is this: whatever strategy you have is a hypothesis. As soon as that is understood, people tend to not treat it with such preciousness. Through that lens, it’s easy to see that rewording and editing a hypothesis is huge waste of time. :) There are three things I think is also relevant here: In my experience, the best strategies are the ones that, once articulated, most people respond with “wow, why aren’t we already doing this…?” Which is to say they are usually non-obvious ideas that seem obvious in retrospect (that’s how good they are). Being able to strike this here tends to make buy-in a bit easier.Strategy, just like any good hypothesis, is an educated guess. That guess is typically accompanied by either intuition, data, or both. If there is data, then presenting the data is the best way to get buy-in on a strategy.If no data is available, the “Agile” approach should be to try it fast, gather data, then validate/invalidate and continue to iterate as necessary. That doesn’t address one of the bigger human problems in strategy development, which I think is what you are alluding to: everyone wants to be (or thinks they are) strategic. Everyone wants to be part of the strategic conversation because they think they need to be (sometimes for political/power reasons). Especially as a consulting firm, I’m sure you run into a lot of “not invented here” mentality as well. The best approach in those situation may actually be staying away from the word “strategy” altogether (proto- or otherwise) as there is a ton of baggage and emotional triggers associated with it. The other approach may be to simply have the discussion to make folks feel like they came up with the idea themselves — always an effective upward management strategy. :) Would love to hear what you think! ", "title": "", "parent": "505", "creatorid": "65b4c1c5563e", "id": "84b53228531d"}