{"name": "524_2", "child": "", "content": "Buffer, Formulas are for chemists and mathematicians, blueprints are for architects and engineers, and recipes are for bakers and chefs. There is no outline that writes itself, that constructs sentences with robotic precision and builds paragraphs with the efficiency of the assembly line; as if the gears and presses — and the conveyor belts, pumps, valves and systems — of the writer’s warehouse should sort and connect materials — in this case, the words and sayings, and the proverbs and phrases, and the psalms and songs of the author’s voice — with the plug and play ease of flipping a switch, greasing some parts and monitoring the gauges in this industrialized exercise; since no outline, never mind one with the breadth and depth of your signature, can, through a surplus of details alone, enable any person to put pen to paper (or letters to laptop), and have a finished product that is as methodical as it is logical, and as powerful and persuasive as it is eloquent and elegant.  A recipe has no directorial cues for passion, no space for improvisation and no room for interpretation. For, unless a writer composes text for an audience immune from triumph and tragedy, and resistant to the trumpet sounds of moral duty and personal responsibility, unless a writer creates “punchcard prose” — instructions for some global supercomputer, which reduces humanity to a series of transistors and coils — even the most seemingly lifeless man or woman, a mere functionary in some enormous bureaucracy or giant corporation, cannot help but feel the pangs of greatness; sundering the black-and-white conformity of the office and the monochromatic “thinking” of the workplace, an environment overrun by paper — from various messages and memorandums to a torrent of tickets and invoices — that, because of the emphasis on formatting over form itself, makes these documents read like the ingredients for a box of cereal. Where, if you will pardon my asking and excuse my transition from the metaphor of the factory floor to the controlled chaos of the kitchen, is the artistry and flair? Where is the love of language, and the statements of resolve and purpose? How, in other words, can that scrivener inspire us when we try to prevent him from releasing the beauty and energy of every loop and curve of his cursive writing? How can we savor the dish when everything is bland and generic? Give us a festival with a feast of poetry and prose. Give us the writer in all of his glory.  ", "title": "", "parent": "524", "creatorid": "837a2cecfaf1", "id": "9b1256126701"}