{"name": "535_20", "child": "", "content": "Do you know Into The Woods? this is so reminiscent of Sondheim lyrics to me: I love love love his sense of word play: Son, We’ve no time to sit and ditherWhile her withers wither with her — Jack’s Mother It’s your father’s fault that the curse got placed and the place got cursed in the first place. — The Witch Next Door And then, of course, there are daddy issues running rampant all over the place: BAKERNo more questions,Please.No more tests.Comes the day you say, “What for?”Please- no more. MYSTERIOUS MANThey disappoint,They disappear,They die but they don’t… BAKERWhat? MYSTERIOUS MANThey disappointIn turn, I fear.Forgive, though, they won’t… BAKERNo more riddles.No more jests.No more curses you can’t undo,Left by fathers you never knew.No more quests. No more feelings.Time to shut the door.Just- no more. MYSTERIOUS MANRunning away- let’s do it,Free from the ties that bind.No more depairOr burdens to bearOut there in the yonder. Running away- go to it.Where did you have in mind?Have to take care:Unless there’s a “where,”You’ll only be wandering blind.Just more questions.Different kind. Where are we to go?Where are we ever to go? Running away- we’ll do it.Why sit around, resugned?Trouble is, son,The farther you run,The more you feel undefinedFor what you’ve left undoneAnd, nore, what you’ve left behind. We disappoint,We leave a mess,We die but we don’t… BAKERWe disappointIn turn, I guess.Forget, though, we won’t… BOTHLike father, like son. BAKERNo more giantsWaging war.Can’t we just pursue out livesWith out children and our wives?‘Till that happy day arrives,How do you ignoreAll the witches,All the curses,All the wolves, all the lies,The false hopes, the goodbyes,The reverses,All the wondering what even worse isStill in store? The 1989 broadway disc of Into The Woods always makes me feel better. Sorry about the off topic but I find Sondheim a brilliant lyricist and so to compare you to him is a huge YAY from me to you. ❤ ", "title": "", "parent": "535", "creatorid": "9519d329cb15", "id": "ee426f68baa4"}