{"name": "545_1", "child": "", "content": "Well, dear, I think I did a pretty good job dissecting your little diatribe. You obviously are needing the attention. Let me help you out here. Crisis Services/Mental Health NYC Well Mobile Crisis Teams Child & Adolescent Mental Health Emergency/Crisis Services A “crisis” situation is one that requires prompt attention, but is not immediately life threatening. That is, a “crisis” occurrence is one that can be improved or resolved by a visit from a mobile crisis team, who generally responds within 48 hours, or by telephone counseling and referral by NYC Well, the Health Department’s 24 hour information and referral hotline operated by the Mental Health Association of New York City, Inc. 1–888-NYC-WELL (1–888–692–9355) is a free, confidential help line for New York City residents. You can call 24 hours per day/7 days a week. The staff of trained mental health professionals help callers find mental health and substance abuse services. NYC Well is multilingual and multicultural: 1–888-NYC-WELL (1–888–692–9355) 1–888–692–9355 (Español) 1–888–692–9355 (中文) 711 (TTY for hearing impaired) You can also text WELL to 65173 or go to NYC Well, an online resource for individuals, families and agencies in need of help and information. Additional Resources The SAMHSA Behavioral Health Treatment Services Locator is an on-line source of information for persons seeking treatment facilities in the United States or U.S. Territories for mental health and/or substance abuse/addiction problems. Now, these places will see you, but if you aren’t quite sure of your nationality or heritage, here are some other places to help you out.. NYCAAMH New York Coalition for Asian American Mental Health This is their website… NY Coalition for Asian American Mental HealthMarch 3, 2017 Dear members and friends of the Coalition, As you are well aware, there has been an increased sense of…www.asianmentalhealth.org And this is a Latino mental health site… NAMI: National Alliance on Mental Illness | LatinosLatinos are no different when it comes to prevalence of mental health conditions when compared to the rest of the…www.nami.org Caleb can’t help you out right now, he doesn’t believe in imaginary things, either. But I’m more than willing. Contact me again if you get stuck. ", "title": "", "parent": "545", "creatorid": "51c4ac2f46ba", "id": "6bfe2da9c927"}