{"name": "545_6", "child": "", "content": "So since you want to lurk let me clarify somethings. I went through that person’s account, looking for tell tale signs…there were several, different historical references out of place, like they thought Mothers Day had been passed by, when we hadn’t even celebrated it yet, I suspect they aren’t even from here in the states, I just couldn’t believe someone would be THAT OBTUSE?!? Mother’s day was celebrated in England last month. A whole bunch of American’s though did not remember Mother’s day was in may. My tweet was poking fun at all the people at all the people who forgot. I am a mother. I know when mother’s day is. Another clue was they had identified themselves as Spanish. Most people identify as Brazilian, Argentinian, those from Spain don’t say Spanish, they would say Castilian or another part of the country. I am Latina. Is that better? I do not come from Spain, but I am still Spanish as Spain did have control over my grandparents country. But I have different types of Spanish in me which is why I say I am Spanish. Same with my Asian half. Many countries have had control or occupied my mother’s country in some way, So I am not any one type of Asian either. And then they complained that nobody is giving them anything for being Spanish? Learn to read. What I said was I do not WANT a hand out FOR being SPANISH. I would rather work for what I want just like everyone else. They were obviously referring to scholarships, which one knows you just don’t get those unless you have a high grade point average, in addition to civic work..their story didn’t add up. So I graduated in the Top ten percent of my high school. A school with only 250 students. Yes I am talking about scholarships. They were many scholarships that I did not apply for simply because one of the requirements was being Spanish or some type of Spanish. I am not saying this is a bad thing but upon further research I saw how many more scholarships Minorities have access to simply because of there race while other races were offered little to nothing. So I took my own stand and stayed away from those. They kept blaming everything wrong in their life to the “ ghetto”…honestly, that term in itself is outdated. NOT ONCE DID I SAY MY LIFE WAS TERRIBLE BECAUSE OF LIVING IN THE GHETTO. Sure it has made things harder. There are people who have come from worse and made it further then me. and see the fight against the crime mentality I was talking about, It happens here. It’s slow, but things that were once protected and seen as an ok way of living, are becoming seen for what they really are. SO Violet, Caleb Ramsby. Gonna dissect this too? ", "title": "", "parent": "545", "creatorid": "b32a51ba8b52", "id": "e9e39075481d"}