{"name": "571_6", "child": "", "content": "Good grief! Thaddeus Howze, I have been devouring your words the last few days. I look and read and I gotta say you are a person with an integrity the likes I have never seen. I wish I could have articulated my desire to support the writer you addressed here, half as well as you have done. This is what I wanted to say — well, minus the superhero references, because I’m learning that stuff from you — which you make that interesting and I can’t figure that out either. But my goodness, I must say thank you! Thank you for putting this into words, for writing this support I hope others want to offer here too. Because the words I had in my mind seemed so damn empty as I thought them. When I read your response I felt so relieved that the truth here was so eloquently expressed and so lovingly too. I couldn’t have approached this level of offering as you have, but I wanted to so much. Because you are right. I hope these death throws we are witnessing lay the foundation for dust to become the soil to be tilled. That will become the land the tag line promises it will be…finally. For everyone. Those who resist the change will not have the longevity they hope to achieve. There are five personality factors that can predict a person’s resilience. One of them is their ability to embrace change. When I see writers here like you and Dominique Matti I see that resilience, that factor. This trait you both have will definitely keep you moving forward. And I hope knowing that those making those death throw shouts lack this trait, lets you both know that their volume will get turned down as they continue to attempt to turn back the hands of time. I will join in with the choir of voices to embrace our collective forward motion with hope that one more sound off further quiets the ones without resilience. You are the movers, the Warriors upon which time depends. We do indeed need you both. Desperately.  ", "title": "", "parent": "571", "creatorid": "72168947bef4", "id": "56d38996af8"}