{"name": "571_22", "child": "", "content": "Get Yourself a Justice League Never let them see you sweat.  Dominique, You are still brazen. You are still magnificent. You are still angry. You are still vulnerable. You are still invincible. You are what YOU choose to be. The comments of people who have issues with the nature of the world today not meeting their expectations of privilege, of power, of feigned prestige, are all ranting with their dying breaths. They are recognizing their opportunities stolen by force by their ancestors who used fear, terror, abuse, legality, brutality and the ability to manipulate people weaker than themselves to join up and chasten the Other, into submission are fading. We no longer have to accept the Status Quo. Those Status Quo Warriors, who are quick to defend the way things were are looking desperate. See those followers of Mr. Trump? Feel their desperation? It’s about time they remember how things really work. We are the Other that made this nation rich, economically, technologically, culturally, musically. When you look in the mirror, you are looking at the face that built this nation. Never forget that. You have nothing to fear. You have nothing to be ashamed of. All that this nation has to offer the world has come from the Other. No matter how oppressed, we rose. No matter how beaten, we strove for equality. No matter how many times they took all we had, we came back and invented something new they wanted. You are descended from that person who stood against the stream and said: No More. Today, is your No More day. You have experienced challenges in this Medium and found yourself doubting whether you should keep doing this. I tell you: three thousand people have come to hear your words. You have an audience larger than Plato or Socrates ever did. You have the audience the ancient griots of Africa or the shamans of North America never did. You have the power to affect the minds of three thousand people with your brazen audacity and your belief we all deserve to be heard, to be felt, to be loved indiscriminately of any other aspect of ourselves. But those three thousand may be depending on you, now. For their bit of inspiration in a world seemingly gone mad. Like it or not, wanted or not, you are needed. Rest up. There are days greater than all of us, no matter how strong we like to think we are. But the secret of winning is always getting back up one more time than you’ve been knocked down. Life isn’t fair. That’s real talk. The difference is you and I have the potential to find people who are in need, in pain, in loss, and say to them the opposite of what the world wants you to: Let me help. Whenever you feel the need, I am here for you. You are not alone. Block those assholes and keep your beautiful head up. Those people are on their way out. They rail against the rising power of people like you who refuse to be silent. Sing, my dear. Sing your heart out. Let them feel your power. Your readers are waiting. ", "title": "", "parent": "571", "creatorid": "24d30f7311a2", "id": "215c6475368c"}