{"name": "593_10", "child": "", "content": "I think the main problem is precisely what you argued a couple of paragraphs before, that the app paradigm is wrong on a watch. I use my Apple Watch extensively. What for? Fitness, complications, Siri. Fitness is self-explanatory. Complications and Siri are kind of the same thing as they are both direct interfaces not for apps, but for specific functions. I don’t want to open an app and navigate around it to do stuff; I just want to do that stuff without the extra baggage. As fast and as simple as possible. One of my complications shows the current outside temperature, so I don’t have to open a weather app. Another complication lets me access the heart rate monitor. On another watch face I have a complication for music control. Singular tasks, for which I don’t need apps. I could imagine complications for calling a taxi or Uber, and other things. What I would love are context-aware complications, and a way to display more complications at once. Similarly, I use Siri to set timers and alarms (frankly even after one and a half years I can’t really distinguish the timer/alarms/stopwatch icons in the dashboard), to ask for the time in other times zones, and to control my lights. The latter is a great example: I could open the Hue app. I’d press the crown button, hunt through the small icons for the app, tap it. Wait until it has finally loaded. That takes what feels like minutes, and then all I’m presented with is a primitive widget that lets me turn favorited lights on or off — nothing more. Or I could tell Siri to turn the lights on or off at a desired brightness. She does need a moment to react, but it feels much faster and is much more intuitive and straight forward. These are single tasks; complications are the visual and Siri the aud..aural? interfaces to them. I believe the success of Alexa is based on Amazon having a head start on this idea. ", "title": "", "parent": "593", "creatorid": "2975aea3e765", "id": "a4b1891334d5"}