{"name": "594_6", "child": "", "content": "Will Apple be around in 50 years time? The simple answer is no. Where is Eastman-Kodak? Kodak film used to be as ubiquitous as a Coke. Now not seen. Killed overnight by digital cameras. Small digital compact cameras have almost disappeared, replaced by the smartphone. High end digital SLR cameras still exist. But if you have invested in a top end DSLR, it is likely to be a lifetime investment. Nokia? When did anyone last see a Nokia phone, or for that matter a Sony-Ericsson phone? Nokia dominated the mobile phone market. Finally given the kiss of death by Microsoft. MySpace? Anyone remember MySpace? Intel dominated the desktop and laptop market. Not smartphones. Smartphones use Qualcomm. The innovation by Steve Jobs, and I emphasise Steve Jobs not Apple, was the iPhone. A revolution that changed the mobile phone market. All the more surprising, when Apple were not in this market. But then we are seeing the same with electric cars. These are new entrants to the market, not the traditional car manufacturers. Steve Jobs was an innovator. Apple computer, Apple Mac, digital music, iPod, iPad. Who knew they needed a tablet? When Steve Jobs was kicked out of Apple, the company collapsed. It took Steve Jobs to bring Apple back from the dead. Since the sad demise of Steve Jobs, there has been no innovation by Apple. Removing the headphone socket from a smartphone is not innovation. What we are now seeing is improvement rather than innovation, classic Moore’s Law, halving of price, doubling of power, every 18 months. Larger screens, quad core processors, higher resolution screens, higher resolution cameras, faster processors, larger memory capacity. But not with battery technology. Apple dismissed the idea of a larger screen smartphone, pioneered by Google and Samsung. Google, a newcomer, is the only one with innovation. It was Amazon who brought us the e-reader and e-books. Apple has now only has a tiny share of the smartphone market. They retain their high profit margin, through Draconian intellectual property rights, lawyers, politicians, near-monopoly practices, Foxconn their manufacturing facility heavily subsided by the Chinese government, tax dodging. Information has a tendency to flow. The cost of information is zero. It can be freely copied, does not wear out. Classic Marxism, cost is land, labour and capital. We now have a fourth factor, information. Information products, those with a high information content, the cost is tending to zero. What maintains the high price, is what maintains the Apple high profit margin. Karl Marx foresaw machines whose cost was zero, that never wear out. Information does not wear out, costs nothing to reproduce. If information flows, we have innovation. Fairphone, easy to repair. Contrast with Apple, deliberately made nigh impossible to repair. Contrast the price and specifications of smartphones from OnePlus with the specification and price of Apple smartphones, OnePlus One, OnePlus Two, OnePlus Three, One Plus 3T. The downside of the smartphone is the impact on social behaviour. Everyone is interconnected with everyone else via their smartphone, and yet they fail to interact socially with those in their immediate vicinity. Capitalism is an adaptive system, innovation drives the next upturn of the 50-year long Kondratieff capitalist cycle. It is not happening. We should be seeing automation and robots replacing jobs. An Oxford University study has forecast a loss of nearly half of all jobs. It is not happening because the cost of information is tending to zero. It is not happening because of what David Graeber calls the creation of bullshit jobs, half a dozen migrants with dirty rags and a bucket of water replacing a car wash. It is not happening because of neo-liberalism, serfs working for apps, atomised workers bidding against each other in negative auctions to drive down wages, precarious, part-time, low-paid, zero-hours, temporary, McShit, soul destroying jobs. Post-2008 banking crisis, which led to an economic crisis and now a geo-political crisis, has seen no upturn of the next 50 year cycle, it has not happened. The post-capitalism future is sharing, Open Source, collaborative commons, open coops. Where is Apple in that future? Falling price of information goodsInformation, if allowed, flows freely. Classic Marxist theory, cost consists of capital, land and labour. We now have a…keithpp.wordpress.com Why bots will kill neither websites nor appsTry calling a business and a robot answers, nothing pisses off a caller more, than calling a business, robot answers…medium.com Phil Schiller on iPhone’s Launch, How It Changed Apple, and Why It Will Keep Going for 50 YearsA reporter there for the creation gets Apple’s exclusive take on the “Jesus Phone”’s 10th birthday.backchannel.com Paul Mason discussing PostCapitalismhttps://www.youtube.com/watch?v=0r6fV9okL2w Что будет после капитализма? -- Paul Mason What will come after capitalism…keithpp.wordpress.com ", "title": "", "parent": "594", "creatorid": "ae7d40b3ba6b", "id": "4a0e5d8cbffa"}