{"name": "594_11", "child": "", "content": "If AirPods are a successful innovation like the iPhone & iPod and the Walkman & microwave & PC and not just an interesting gimmick like an N64 disk drive, or Google Glass, or XBox Kinect then it could signal an interesting new phase analogous to, at the least, the introduction of the Walkman and at the greatest, as impactful as the TV. I secretly hope they fail. But, that said [full disclosure: droid user, plugged in jack] the interesting thing I haven’t heard too much about is shared pairing. Scene: open on, 50’s Diner, INT — Day dappled soft light falls on countertop of brightly colored fast food joint. Cut to: clock shows 3:15 Pan — empty room Cut to: door with school kids rushing in, waitresses on skates reminiscent of American Graffiti bustling You get the picture, a young couple dating sharing a shake or a malted in a vintage ice cream glass with big juicy burgers leans over to sip out of duel straws, and we Cue music as We are suddenly ushered into the sanctity of their shared existence and we Zoom in on Their matching pairs of AirPods only then to pull out to Reveal — they only have one iPhone on the table and we Fade to black Music still playing off camera as they cover their hands together over the iPhone Did I say malted? I meant schmaltz, sorry. But one thing the TV did was to start to create these (by now) hyper-insulated bubble worlds, though at first it created the shared existence supermarket mad men white flight suburban construct. Will AirPods create multi-layered shared existences, something VR promised (but has yet, in the latest iteration, to deliver on)? Of course, the real issue is that ideally they are “paired” to go along with the (jury still out) perhaps flopped IoT iWatches, such that notifications could still 'stream' to your separate watches, moving away from the fetish object phone. I don’t doubt Apple’s relevance nor their unique ability to both recreate themselves and their mythos but to shape that future and those ill-defined spaces. But after 50 years the physical phone would shrink and disappear, our 'desktop' in the cloud, utilizing smart objects and interacting with them. Probably long before that if behavior changes or is modified by social engineering. An interesting dynamic by then would be the way we’d project ourselves out into reality, the internet, the cloud or virtual worlds, instead of the dynamic of it imprinting on us, we absorbing it. Basic I/O when there is no one device, mainframe, PC, laptop, phone will be an interesting challenge- keyboard, trackball, mouse, pop-up keyboard, voice, magic wand? As DaaS desktop as a service morphs with corporate into PaaS profile as a service, maybe we’ll get PaaS person as a service? It is dystopian, but from a cost/benefit analysis ratio, a business exec might look for hiring an AI PaaS instead. From there, you might not only have a driverless Uber, but could request to download into it your favorite AI PaaS driver. Maybe that would be extra, charged to a corporate account and there would be a cheaper generic Johnny Cab model. But. But I secretly hope AirPods fail. And Uber. I’d actually prefer a more ordinary, less dystopic future to live in, though by then, presumably, it will be the present, and most everything will be, like, ‘zounds, President Trump, normalized, and we will all (or perhaps somewhat less than all) have adjusted. ", "title": "", "parent": "594", "creatorid": "cc5d4496add6", "id": "ec184b51e4c9"}