{"name": "597_12", "child": "", "content": "The Ridiculous Irony Of Online Dating It’s crazy that we use these “apps” to meet perfect strangers (and yes they are perfect strangers). We bestow upon them a certain level of trust, trust that in any other circumstance we probably would never extend. Then all too frequently, we’re confused when things don’t work out, when we’re not compatible or when they don’t turn out to be who we think they are. What I don’t get, is why we don’t cut to the heart of the matter: who are you as a unique individual? What makes you tick? What do you really fucking care about? Technology could allow us to really cut out all of the bullshit that makes finding someone so hard and yet we use it to discuss the same trivialities and let all of the really big shit go unanswered. Do you know what’s funny about Medium? If people read my posts, (not responses or the stupid trivial ones) the ones that really matter, they’ll know who I am as a person much more than they would through Tinder or any other dating app. However, if I approached someone on Medium that I really liked as -a person- based on their writing, they’d probably say something to the effect of: “You’re crazy, you don’t know me at all”. Yet they’d have no problem matching with someone on a dating site based on utterly irrelevant information. People often reveal the big shit about themselves on a site like Medium, and what they mean when they say “you don’t know me” is really “you don’t know the little things”, “you don’t know specifics”, “you don’t know what shows I like on Netflix”, “you don’t know what my first dogs name is”. Wouldn’t it make more sense for people to want to date you based on that important stuff? Wouldn’t it make more sense for people to know that stuff upfront and then learn about the little things, the details as you go? I’d rather find out that we don’t have the same taste in Netflix shows down the road than I would to roll the dice and hope than our core beliefs matchup in the end. Dating should be reversed, it should be a long read upfront and then the little shit as you get to know each other. In studies, this is why they found that couples whose marriages were arranged were much happier five and ten years down the road than romantic love couples from the west. I’m not suggesting taking away choice here, but what I am suggesting is that we should look at it the way the parents arranging the marriages do. They look at things like; background, beliefs, core values and life goals. The idea is that you make sure that big stuff is matched up and then you have time as you grow together to learn the small shit. I love when people say “but it’s the little things that matter” which is complete crap. When our core beliefs match up with someone else’s, we can look beyond the little things. If your core beliefs don’t match, then the little shit is going to tear you apart. Someone needs to sit down and literally come up with a new way to online date. Something that focuses on the shit that matters and can brutally smack you in the face with it. I’d rather scare someone off upfront than a year down the road to be honest. In the meantime, maybe I’ll just post my number on Medium and see what I get (that was sarcasm people). ", "title": "", "parent": "597", "creatorid": "2c2b85238b3e", "id": "6c9d0d127c5b"}