{"name": "597_7", "child": "", "content": "And this is why dating apps and dating sites don’t work. Human ADD/ADHD is rampant. When you don’t get or find what you want in one app/site, you move onto the next one. I don’t care who wrote the app, what questions you ask, attributes you check, etc… We live in a culture of I want it and I want it NOW. That’s not how dating works. It takes time to get to know someone and no one is willing to keep up the constant exchange of communication in order to even make a fair attempt to get to know the other person. As someone else commented, put the phone down and talk to the person next to you. Sadly, we all sit behind a screen hoping, dreaming, praying, that we’ll find the ONE. What this ONE entails is beyond me because everyone wants something different and the ONE is nothing more than a fallacy. Everyone has their list that needs to be checked off and X,Y,Z needs to be met before they even consider that other person. Step away from the phone, the app, the site, the computer, and go figure out what you desire in another person. Ask yourself what you bring to the table, what you offer, and what you expect in return. Those expectations help you understand your needs/wants better. Once you’ve taken some time getting to know yourself, you’ve definitely narrowed the dating pool down. Trust me, you’ll see this as you get older and/or more self-aware. Knowing precisely what you want and what you don’t want makes dating that much more difficult. Sad, I know. But the endless dates can cease and when you least expect it (cliche, I know this as well) the person you want may be standing right there because you went through the process of getting to know yourself, your wants, desires, expectations, and deal breakers. Stop the human ADD where you think you see something shiny and in reality, it’s only a mirage of what you thought you wanted. Get to know you, app or no app, you’ll find someone you want to be with instead of lifting up every single rock only to put it back down in disappointment. Perhaps people should start to learn to be alone and like being alone then spending countless hours worrying if you’re going to find someone. ", "title": "", "parent": "597", "creatorid": "4cfebd701e7b", "id": "92a1fd90cee"}