{"id": "879af8c6e7bc", "content": "Thanks a lot for taking the time to write the critique, Naythaniel! I was really looking forward to more critical responses. As far as I could understand, what you are saying boils down to this reasoning:1. if a movie is average, it means it is “barely above watchable”;2. most movies are not average, but rather they are “fine”;3. given (1) and (2), my criterion is flawed;4. given(3), my whole reasoning for the recommendation collapses; My answer is that you commit a straw man fallacy with (1), because I don’t say anywhere in the article that average means “barely above watchable” or anything similar. I rather clarify the term “average” by quantifying it as somewhere in the interval 3–7. I indeed say that for most of the average movies I can’t even remember the plot anymore. But this doesn’t mean that I say that they are “barely above watchable”. I just want to point out that they didn’t made an impression strong enough to get encoded in my long-term memory, and this is a good reason to consider them average. Now addressing (2), unless you define precisely what “fine” means, I can easily say that “fine” movies belong to the higher-rating half of the average area. And this means that my reasoning holds against the critique. Let me clarify things further. I am aware that my whole reasoning rests on the belief that most people consider most movies average. For me, this is intuitively common-sense, and I have a lot of confidence that it is true. But you have to consider that is impossible to prove this belief as true or false, because it’s impossible to access other people’s minds to find out for sure that they indeed had/have such an experience. You either go with your intuition, either trust their word, but neither can be used for evidence to establish the truth value of the statement. That’s the reason I wrote in the article “I believe”, not “I think”. It was not a word thrown by at random. ", "creatorid": "205c2f307347", "title": "", "parent": "5", "child": "", "name": "5_3"}