{"name": "602_18", "child": "", "content": "There are so many things about this article that are beautiful — both nostalgic and inspiring. Radio Shack certainly was a place where walking the aisles actually generated the possibility that anyone with the desire to learn could create something potentially useful. I remember in early high school, before even knowing that there was such a thing as “electrical engineering” I was building circuit boards for families with deaf parents that needed audio-activated flashing light monitoring systems — thanks to Radio Shack. Today, one equivalent source of technology inspiration is the giant sea of open source software and nearly free access to computational resources never imagined to be available at the “hobbyist” level. Unlike Radio Shack, they are available in the furthest corners of our world, and innovation is everywhere. Another thing that was so nice to see was the polycom process slide at the beginning. The simple motivators of “user need”, “competitive pressure” and the so nicely understated “revenue desire” sum up what is often actually poorly defined in many startups, particularly those generated from university technology where “solutions” often precede the “problem.” Lastly, the overall theme of starting small and ignoring the distortions of mega-investment is such a critically important piece of wisdom. If the need is real, it will be found both in the small and the large. What differentiates nowadays seems to be identifying the difference between those needs that are fleeting and those that are deep and lasting. Polycom clearly hit upon one such need, and is now deeply rooted into our society. Millions more are searching for equivalent “deep” needs that can generate similar lasting value. Thanks to Jeff for reminding us that all big trees start with a seed. ", "title": "", "parent": "602", "creatorid": "b39954f5e2f5", "id": "cdc200106446"}