{"name": "605_5", "child": "", "content": "Jason, I read your post with some disappointment. I have worked in the Imaging industry for the last four years, as VP Marketing of a global photo accessories company so, like you, I did business through the most turbulent years of this sector. I am also a passionate photographer, always in search of useful hardware and software to enhance what I do. I was intrigued by Lytro’s possibilities from the start, despite the execution issues of the first iteration, which was not even recognizable as a camera. I thought your second iteration was much better, it looked like you designed it for a more engaged photographer, more likely to want to find new creativity avenues vs. a casual phone or point-and-shoot photographer. It also had better optical features, was looking like a camera and had very good ergonomics. When I tried to access your booth at the last Photokina it was so packed with people that I could not even handle the camera — a sure sign of interest from the photo crowds! I bought two more cameras since then but not a Lytro, because it was still quite unclear to me, aside from its great new technology, what the camera was really useful for. I think like most in the camera business, you where too focused on the technical features, i.e. on what the camera did, and not on what the customer could do with it. Using Prof. Christensen terms, it was very unclear what the customer’s “job to be done” was that the camera addressed. Besides it was not clear who the best customer was: a Pro looking for extra creativity avenues, or an Amateur looking for more freedom to shoot without worry about critical settings? I was waiting the next iteration, where hopefully you would have addressed more clearly the consumer benefit and communicated the real use of the Lytro. Sadly you now are converting the technology to join the VR bandwagon. Clearly a trend to exploit. But I sense you lost an opportunity to bring to photographers — amateurs or pro — the first really new imaging solution after the digital conversion. Probably not a substitute of the traditional shooting mode, but certainly a further weapon in the creativity arsenal of the people who care about expressing themselves through photography. I wonder if you are just abandoning the idea or maybe trying to sell the technology to companies still interested in the photographic consumer business. ", "title": "", "parent": "605", "creatorid": "6178c88a54e7", "id": "71a18df20f8"}