{"name": "606_6", "child": "", "content": "Doing the Impossible Maxime Beaudoin I understand your story. I was an exec director for a medium size game back in the day. The company hired me because they had plateaued at 20 people for 6 years and wanted to be 200 people. The group of 20 was burned out, tired of 12X7 weeks and living on coke and chips. The only people making decent money were the two founders and the president. I’m writing to challenge your observation that “good communication is, simply put, impossible” on large-scale games. It CAN be done. It’s all about the environment and the communications champion. For years, gaming was up against a labor wall trying to do 3-D games with 2-D art. Then, one genius entered the world with the idea of “solid modeling”. From that point, modeling codes like Maya were developed, and the work became manageable. The communication issue has the same problem. In 1820, the limiting speed of messages was the speed of the horse. That all changed in 1837 with the telegraph. But, in 2016, Stone Age human brain instincts still dominate how we interact. You repeatedly talk about the need for “decisions”. “With specialization often comes tunnel vision… It makes decision making a lot more complicated… Inevitably, at some point, someone who should have been consulted before making a decision will be forgotten… You don’t usually want to make a decision in a meeting with 20 people. That’s inefficient.” This is 2-D (Stone Age) thinking. Is it any wonder that modern society hasn’t got a clue how to coordinate a true democracy with millions of viewpoints! I know how to deal with massive communication. My barrier, however, is the same: STONE AGE BRAINS! Even with a staff of 20, the dominant issue was POWER and CONTROL. Even with just 20 workers, they didn’t know who was doing what. When I gave them tools to do it, they UN-intentionally subverted the tools by keeping some information private. When I confronted them about it, they denied any intention to do it on purpose, always coming up with excuses: “I forgot… too much work… I was going to get to it.” But the subconscious reason was clear: it allowed them to maintain CONTROL of their domain. It allowed them to control their JOB SECURITY. So, if you ever feel your new endeavor is in need of “better” communication, let me know. P.S. As an example of the extent of the damage wreaked by our Stone Age brains inter-personal competition, just think about the Dark Ages. I mentioned the horse being the limiting speed of communication in 1820. That, of course, was for “modern” western society. The ancient Greeks and Romans were way ahead of this. They had continent spanning systems of military fire beacons on mountain tops from Rome to England. ", "title": "", "parent": "606", "creatorid": "e665cd32ab6c", "id": "a87541b08a78"}