{"name": "606_7", "child": "", "content": "I think the real challenge is to identify where the maximum is, not the goldilocks zone. Because there is a reason why AAA projects require so many people — there’s a crapload of work that goes into those games. Earlier in this piece you wrote that a 75 man team was stretching the limits, but still seemed acceptable — workable — to you. That seems likely. While we are all different and have different capacities, sociologists have determined that humans really relate to about ~150 people closest and best in our lives. Everyone else beyond that apparent cognitive limit — not so much. Take away the numbers required to support your family, non-work friends, and other close acquaintances, and the 75-man team starts to sound like a pretty good approximation of what that supposed cognitive limit could enable us to handle. An aside: one of my favorite game studios of all time — Dynamix — seemed to roll with about ~20 person in-house teams (this was in the 90s, so content creation expectations were not so insane as they are now). Dynamix didn’t really make “AAA” titles in the way we think of them now, but they were definitely not “indie” — they were professionally made games: Tribes, Starsiege, Cyberstorm, The Incredible Machine, Outpost II, Red Baron sum up some of their most notable titles. Consistently fun, consistently well-crafted titles, some of which had a lasting effect on the industry (others, like cyberstorm, remaining relatively undiscovered gems). Team size was undoubtedly a part of that magic. I think another part was probably that they had this hierarchy, implicit or otherwise — where a single creative (a writer with software engineering experience, basically) was project lead, and he had final say not only in art direction and plot, but also game mechanics, marketing, etc. That lead to a series of titles where the mechanics of the game, intentional at first or happily discovered during iterative testing (I’m looking at you, Tribes) — reinforced the plot, the art, the whole package. Their games are coherent experiences as a result of that multifaceted tyranny. Just as important, however, was where that director chose NOT to exert his power — the soundtracks, the texture maps, the quicktime events — these were sometimes produced outside or not under direct supervision. I strongly suspect that good development for large projects begins at the initial stages when planning division of labor — you need to come up with a coherent vision, distribute that to smaller teams, some of which will not be under direct control — and be happy with the results you get. The art of it would be figuring out what to delegate and what to retain control over. ", "title": "", "parent": "606", "creatorid": "e5c90d66ddb4", "id": "34ab25fc9982"}