{"name": "607_4", "child": "", "content": "Brilliant. To break with the other comments, this is extremely inspiring! Fascinating to see some of the most effective known ways of painting quickly, and how economies of scale can bring more people what they want, including things that were popularly thought to be impossible to mass produce. This doesn’t devalue art, it adds: it makes the difference between unique, creative art and copies clearer. It makes it possible for more people to appreciate fine art, and makes oil paintings become within reach of the poor. It provides jobs for artists in China, who may otherwise not be able to pursue art due to having to make a living. It makes everyone’s lives better. It raises the standard of living for everyone. This is a beautiful thing. Some percent of those poor people or their children will follow up this interest of art, helped by having their own real (mass produced) oil painting, and go on to become collectors of high end/unique/commissioned art. People who may not otherwise have had enough exposure to art to appreciate it enough to buy it. People who remember a painting in their childhood home and want something like that themselves. It provides a gateway for poor people who become wealthy. And it bridges the gap between the poor and the wealthy – it makes the poor richer. As for artists who are scared of art becoming less valuable: art that’s possible to mass produce was always less valuable. The value doesn’t lie in the parts that are possible to do mechanically, it lies in the creative parts. (Or the human element, the connection to or personality of the artist – depending on the kind of art and how it’s sold.) This is actually super neat to me as an artist, because I can think about what in my creation process is mechanical and could be done more efficiently; and seeing how this mass production works helps focus on what really matters in a painting. (To say nothing of the fact that these people in China seem bloody high-skilled.) So, on all levels – artistic, technological, and humanitarian: thank you for this post and your work! ", "title": "", "parent": "607", "creatorid": "99814545590a", "id": "8c5e9c86c445"}