{"name": "610_4", "child": "", "content": "Shark Navigator Vacuum NV22L reviews 2015 Shark Navigator Vacuum NV22L is an upright and bag-less vacuum cleaner manufactured by the Euro-Pro Corp  vacuum cleaner manufacturing company. The NV22L model is an excellent device when it comes to cleaning with minimum efforts as all the cleaning is done with the vacuum itself by just hovering it over the area to be cleaned. The machine works on the latest Never Loss Suction Technology that allows it to pull out maximum dirt. As a result, the product is able to function continuously without losing its suction power over time. It has been designed in an innovative manner which helps it to produce serious power required for cleaning. It is equipped with a two-motor system having unique qualities compared to other vacuum cleaners. What makes the product even better is that it is a lightweight machine as it does not have a bag. This lightweight and appropriate built structure of the NV22L makes it possible to remove dirt easily from the hard-to-reach areas as well. The product is a joyful device to use as it requires minimum maintenance and easy storage. It is also capable of removing pet hairs efficiently and comes with a sufficient warranty period to cover the damaged parts. The overall review and specific features of the NV22L are as follows: SPECIFICATIONS  – The Shark Navigator Vacuum NV22L comes in a purple color variant with an overall weight of around 20 pounds.– It runs on electric supply which can be supplied with the help of a long cord.– Hence, the product does not contain batteries for its functioning.– The cord length is around 30 feet, which is sufficient enough to cover the maximum possible area for cleaning.– As the NV22L is an upright model it does have a bag to store waste materials.– It comes with a container for collecting the waste materials which can be emptied after cleaning.– The vacuum cleaner consumes a maximum power of 1200 Watts when working on a 120 Volts, 60 Hz supply.– The rated current measurement of the device is 10 Amperes.– There is a suction control available with the device to help in thorough cleaning.– The product has electrate filters for filtration purpose.– The overall dimensions of the machine are 35.5″ x 13.2″ x 10.8″.– There is a limited warranty period of 5 years for the parts and another 5 years of labor warranty. FEATURES - The NV22L model is capable of pulling out 99% of the dirt without losing suction power over the course of time. This allows the product to function continuously for years.  - The device has a unique two motor cyclonic system to help in superior bare floor and deep carpet cleaning.– The lightweight and compact design of the product allows it to be carried easily.– The glide wheels in the product are smooth and allow effortless cleaning by reaching every corner.– The hard to reach areas can also be cleaned efficiently with the help of a crevice tool which is around 24 inches in length.– The device also features a power nozzle and a Turbo power hair brush for the ease of grabbing pet hairs from the surfaces.– It is easy to maintain the device. The filters can last for a lifetime and only a couple of rinsing is needed each year.– The NV22L is appropriately priced. It costs nearly half of the other branded vacuums, having similar features.– The device consists of an indicator to indicate the fulfillment of the waste collector.– Additional tools can be attached to the device. There is a hose for the tools.– There is an on/off switch for the brushes. This is helpful while cleaning the carpet floors. PROS 1. The Shark Navigator NV22L is an excellent device for cleaning bare floors and carpets.2. It has a smooth and quiet functioning. The motors are almost noiseless and bring about a joyful cleaning exercise.3. There is an anti-tip hook that prevents tipping when the hose is pulled from the rear or the front of the device.4. The filters in the device are washable and have high durability.5. The cord comes with a holder clip on the handle so that it does not need to be held all the time.  CONS The cord does not have an auto-retractable function. Hence, it takes some time to wind up the cord after the cleaning process is done.2. There is no adjustment for the height of the NV22L vacuum cleaner.3. There is no transmission and drive system available for pulling and pushing the device. As a result, the self-propelling feature is absent on this device.4. The NV22L vacuum does not have HEPA-High Efficiency Particulate Air filters for filtration.5. The device cannot be folded while storing. It has to be stored in one piece as available. IN-THE-BOX TOOLS AND ACCESSORIES The Shark Navigator NV22L vacuum cleaner comes with a set of powerful tools which help in effortless cleaning.  This includes a Turbo power pet hair brush, an extension wand, dusting brush, two types of crevice tool and cord. The pet hair brush is capable of lifting and grabbing pet hairs in a quick and easy manner. It also helps in cleaning other types of ground-in and sticky dirt from upholstery, carpeted stairs and other such surfaces. The extension wand comes inbuilt with the device and is coupled with a stretch hose of the deluxe quality. This helps in providing an extended reach for cleaning above floors and surfaces at height. Along with all these, the product also contains two types of crevice tools of 5.5″ and 24″ respectively. The dusting and pet hair brushes are of premium quality which assure a long life usage. A bunch of other replacements parts and accessories can also be purchased additionally for getting additional help while cleaning. This can bring about a better cleaning process. CONCLUSION On the whole, the Shark Navigator Vacuum NV22L is a pretty good product. It is full of nice features and specifications that every vacuum cleaner must possess. Its compact yet elegant design has attracted many customers worldwide and this has made this device a success in the international market. Many reviewers have given great reviews about the excellent features that the device has. This product is definitely a worthy product to invest in to get effortless and efficient cleaning. It is a complete package and is worth every penny spent on it. The NV22L vacuum has received high ratings from all those who have used it. They cannot stop praising the product and are still using it joyfully. ", "title": "", "parent": "610", "creatorid": "3b321db2f432", "id": "a3da3dc88104"}