{"id": "a7ee66ccbed9", "content": "Hi, Terren. Thanks for your post. Wow, I am even more impressed than ever at the lengths to which music students will go to not pay a qualified instructor for the invaluable human element of learning (/snark). Confession: I am a music instructor and musician, so my opinion is biased that way. I don’t blame you for trying to create and use technology to learn. I just think that, first, humanity in general has advanced faster technologically than we have evolved emotionally and spiritually. I think that we have devolved. This seems especially true when discussing music and music artists: we have come to expect to consume music for free, and at the same time, the music being produced by the multi-billion-dollar entertainment industry relies ever more on technology and visual appeal than on artistry and skill. Consider this: auto-tune has been around for two decades, and now there even are apps to write songs for “artists”! What are they creating? That doesn’t seem to matter, because in today’s culture, performance itself is considered the “artistry.” As a musician, I love performing, but I also love having the technical chops to play several instruments, sing, and write songs — otherwise, I’d feel like a fraud. And I regard myself as a perpetual student of music, not a master. Second, I think that our culture has degraded to a point where in order for people to feel good about themselves, they put down those who have become very good at what they do, while lauding “token” celebrities. All we need to do is look at how little we pay our public school teachers for the amazing amount and quality of work they do. I won’t even go into detail about music teachers and the thousands of hours they spend learning their instrument(s) in addition to study college curriculum (but I will say that music teachers can’t get into music school without substantial musical ability.) For myself as a private music instructor, people have scoffed at my hourly rate, yet if we consider other skilled tradespeople — say, plumbers — I charge far less for my specialty, even though I am actually sharing my knowledge and skill with my students, not simply fixing a problem and walking out with a check. These are just two foundational concerns of mine about relying on technology for learning to play any instrument, but especially a non-linear, polyphonic, asymmetric instrument like the guitar. I wish you luck in your studies, Terren, and I hope that at some point you seek out a human instructor who will provide the instantaneous feedback you may need before developing poor playing habits that can result in improper and inefficient technique, or even physical problems such as carpal tunnel syndrome or misalignments in the upper body. Undoing bad habits is way harder than doing it right in the first place. I learned from a master musician, and I tell my own students this: Practice doesn’t make perfect; perfect practice makes perfect. I sincerely hope that your Alexa technology cares about your perfect practice as much as I do. ", "creatorid": "521c304e720c", "title": "", "parent": "61", "child": "", "name": "61_10"}