{"content": "There were a few disturbing details in the news reports released over the past few days. Susan Rice was the national security advisor. Any collusion between Trump’s people and Russia would rightly be investigated by the Justice Department. The National Security Advisor has no law enforcement role whatsoever, so why was she ordering up intelligence reports and requesting that the names of Trump staffers be unmasked?Other than partisan political purposes, what would she want them for? The fact that she denied even knowing about it (To NPR) when her name is on the White House/NSA communications logs is interesting as well. According to reports, Ms Rice began asking for incidental intelligence data on Trump’s team more than a year before the election, and the pace of her requests accelerated as the election got closer. The smoking gun however is Evelyn Farkas, the Former Deputy Assistant Secretary of Defense for Russia/Ukraine/Eurasia. So far, two videos have surfaced, one of an interview a month ago on MSNBC,and the second, a recording of her comments during a panel discussion at the Warsaw Security Forum on October 26, 2016, twelve days before the election. In the MSNBC interview Ms Farkas appeared convinced that Trump and or his team had committed unsavory or criminal acts, and discussed her efforts to convince senior Obama staff to disseminate intelligence reports on Trump as widely as possible within the US intelligence agencies. Farkas said this was because “they were afraid those reports would disappear once Trump assumed office.There’s one big problem with those statements.Ms Farkas left the Defense Department in 2015. In 2016 she was serving as a foreign policy advisor to HRC. If Farkas wasn’t employed within the government, how would she know intelligence on Trump staffers even existed? How would she know whether Trump or his staff did, or didn’t do anything wrong? Three days before leaving office, and possibly at the urging of Evelyn Farkas, Obama issued an executive order instructing the NSA to share raw signals intelligence with the 16 other US intelligence agencies. Today someone dug up a video of a panel discussion at the Warsaw Security Forum held n October 26th 2016, twelve days before the election. Asked at the event to address the priorities of a future Hillary Clinton administration, Farkas stated: “It’s not a done deal, as you said. And so, to the Americans in the audience please vote. And not only vote but get everybody to vote. Because I really believe we need a landslide. We need an absolute repudiation of everything. All of the policies that Donald Trump has put out there. I am not afraid to be political. I am not hiding who I am rooting for. And I think it’s very important that we continue to press forward until election day and through election day to make sure that we have the right results. I do agree however with General Breedlove that even if we have the wrong results from my perspective America is resilient. We have a lot of presidential historians who have put forward very coherent the argument — they have given us examples of all of our horrible presidents in the past and the fact that we have endured. And we do have a strong system of checks and balances. And actually, if Donald Trump were elected I believe he would be impeached pretty quickly or somebody else would have to take over government. And I am not even joking. Farkas was referring to General Philip Mark Breedlove, another panelist at the conference who served as Supreme Allied Commander Europe (SACEUR) of NATO Allied Command Operations. The panel discussion was about what to expect following the Nov. 8 presidential election.” So what information did Farkas have about Trump before the election, who leaked it to her, and what did she know was so bad that she wasn’t joking that Trump will be impeached or somehow removed from office? A reminder, at the time of these remarks, Farkas was a private citizen. Obviously there was a serious amount of leaking going on. Obviously there was some level of conspiracy if there were people both within and outside the Obama administration actively working to disseminate incidental intelligence collected on, at the time, private US citizens. If Trump or members of his staff committed crimes, by all means, charge and try those individuals. That said, no crimes possibly committed by any of them justify the criminal conspiracy that formed within the Obama administration to undermine a newly elected president, nor the collection of intelligence reports for the purposes of partisan political gain. At this point, there is far more evidence of a criminal conspiracy and felony leaking of NSA intelligence by the Obama administration than there is evidence of criminal or unsavory acts committed by members of the Trump team. Farkas’ apparent convictions about Trump appear to mirror many of the absolutely outlandish essays over the past two months here in Medium by writers convinced Trump intends to be a fascist dictator. There is a degree of mass hysteria happening among progressives. Hysteria that would cause some to rationalize criminal acts in support of what they consider a just cause, removing Trump from office by any means necessary. Sorry, I forgot to include the video links;  And the Warsaw Security Conference, Scroll to 7:50;  ", "child": "", "parent": "61", "title": "", "creatorid": "a4e0ac0c181d", "name": "61_5", "id": "a753f376a536"}