{"content": "In some ways it is refreshing to read your views about the current state of feminism, and how your are trying to formulate a response. But it is troubling to read how you how your struggle to justify that women should aspire to find a man to protect them. If that is the role you wish to pursue, I feel you are certainly free to go that way. If you look anything like the pictures on your posts, you shouldn’t have any difficulty finding a man who thinks he can do that for you. I’m sure you know that protection like that comes at a price. You become dependent. It eliminates many choices you would have if you decided that you wished to depend more upon yourself. I don’t accept the idea that men and women are equally victimized by violence. Yes, men go to war more, battle each other more, and are responsible for almost all of the physical violence in the world. But women experience violence mostly as victims. You also seem to find the current level of domestic violence as acceptable. Perhaps I’ve worked with too many women who have suffered both physically and emotionally at the hands of the men who are “protecting” them. I don’t pretend to be someone who is at all versed in the literature or theory of feminism. I am a man who has been married to a early feminist for years. I have a daughter and two granddaughters. All of these women have learned to feel that they can run every aspect of their own lives, with or without the protection of men. They all have very strong successful relationships with men, and these men treat them as equals in every aspect of their lives. I have been in business for many years and have seen how men still fill 83% of the power positions, and that they rarely consider “protecting women” in their decision making. The regular procedures of deal making, promotion, and other decisions are still structured to exclude women. That doesn’t seem to concern you, as that is not the role you wish to play. If you strive to be the kind of wife that Mike Pence would love, then go for it. If you feel using your supportive, manipulative and sexual powers to get what you want is the most functional way to be a woman, that’s for you to choose. I know many women who feel that the life it gives them is much easier than having to battle it out forging their own identity and their own place in the world, especially if they latch on to a nice man with lots of money. However, I have seen too many women, who after several years of such a life, feel depressed, diminished, limited, bored and unfulfilled. Also, you should realize, that your taking that role, hinders those who wish to be more independent, as many men still hope for the ideal “woman-girl” who will love, cherish and support them, without too many direct opinions. If there are enough of those women out there, then the ones who are assertive, powerful and very capable, will be demeaned and pushed aside, especially now that “political incorrectness” is the new order of the day. ", "child": "", "parent": "63", "title": "", "creatorid": "98cfca204427", "name": "63_13", "id": "9ff77c00e035"}