{"content": "Perhaps I over-generalized from what you said, to what I thought you said. but you did say: “Today my impression of feminism is more along the lines of seeing it as an ideology that is dead set on ruining the lives of men while celebrating only the women who support this ideology.” This I feel is inaccurate and provocative, and you offer no evidence. and “However, it has been my experience and I have been witness to far more examples of this leadership being one of protection and concern for the well-being of others than one that oppresses and seeks to harm women.” I don’t know where you live, work and play, but perhaps you are better than many at getting men to be concerned about you. And : “Men’s violent tendencies are expressed, primarily, on other men. In most cases, a man uses his physical prowess, power and even violent aggression to protect women.” My experiences in working with thousands of people, have left me with a very different impression, but I could see how my experiences would be different than yours. And: I believe women have other powers, that of cunning and manipulation, emotional capacity and their sexuality that they can use to overpower, control, harm and abuse men.” Do you see this as a healthy way of acting, or more of an adaptive remedy to a bad situation? AND “While acts of violence occur against women they are not standard or even common.” Again, we see the world differently. And: The threat of physical violence and rape on women appears to be about equal to the threat of emotional violence, emasculation, sexual manipulation and mental abuse targeted at men. Examples of this are the threat of false rape claims, the power to alienate divorced men from their children, the femme fatale who seduces and robs a man of his resources or dignity. I see this as blaming the victim. It’s one step away from saying “she asked for it.” I could go on, but I think I can see why I said some of the things I said. We clearly have had very different experience and see the world differently. It has been true for centuries that men have used the threat of physical control to get women to “stay in their place.” It continues, to a great extent today. But today, in many ways, men’s roles and power is being undermined because many of the skills necessary to survive and thrive in today’s world are the kinds of skills that more women possess. I have seen this lead to anger towards women and attempts to put them “back in their place.” Perhaps you have not experienced this much. Anyway, if you mean to be provocative, people will get provoked. I hope no major damage was done. I leave you with this old hippy musical tribute to women such as yourself. Please push on the link and enjoy: “She’s got everything delightful, she’s got everything I need, Takes the wheel when I’m seeing double, pays my ticket when I speed” ", "child": "", "parent": "63", "title": "", "creatorid": "98cfca204427", "name": "63_21", "id": "17ac0218dc16"}