{"content": "And of course the whole charade is only really viable in affluent populations where we are in fact all spoiled to hell and back. For many years back in the 80s-90s I made a living mostly framing McMansions in suburban Boulder County, just outside Denver. In one sense, one can hardly imagine a more “male-dominated” work environment. But things are far from being what they seem, it seems. What I began to grasp about what goes on between men and women during those times, changed me forever. Yes, one could look up and down any street where half a dozen at a time of those big boxes of enslaving mortgage liability were under construction, and see nothing but men. I can still hear that lovely composite racket in my head of men at work: backup beepers on heavy equipment, worm-drive Skilsaws (any framer with a shred of self-respect uses a worm drive), framing nailers, half-inch staple guns being deployed rapid-fire to nail off a wall, a cacophony of classic rock and mariachi on multiple cheap boom-boxes… Ah, life among men who do man things. BUT Scratch the surface a bit, and you find easily that every one of those guys is either owned and operated by a wife whom he fears and obeys, or else the whole reason he is out there working overtime and doing side jobs on the weekends to boot, is to pay his child support and court costs while living in a travel trailer. The term “the boss” was most likely not being used to mean either a guy running a jobsite or Bruce Springsteen either one, but some guy’s wife back home, whom one would never meet because it was beneath Herself ever to stop out for a visit with the guys or Goddess-forbid she should ever bring lunch or some beers or a friendly stack of pizzas to the creatures making her cushy life of fake leveraged luxury possible at all. And among the owner-buyers of these man-killing semi-luxury prisons? The fear of wives by their husbands, was palpable, obvious, shameless, universal, and embarrassing to witness. Never, ever, as in never, was the man of the house the go-to that the contractors and realtors dealt with. Never. This was Her thing, it was to be the way She wanted it, everybody pandered to that and took it as the norm, and it was not at all rare to see some clean-handed, Docker-clad chubby hubby literally following Herself around the site at three obedient paces behind his Mistress and waiting obediently to speak when spoken to. This dynamic was so consistent, and such an everyday topic of bittersweet humor among the workin’ guys, each of us as p-whipped in our own blue-collar way as the pathetic yuppie half-men we saw oozing around trying to be approved of by their women by investing their entire life’s work into a semi-custom palace for her, (which by intent and design would never, ever be fully paid for) that to this day when somebody says “The Patriarchy”, I have to restrain myself from going off on a rant at them, about what a stupid and misinformed, or just malicious, opposite of the truth that phrase really is. ", "child": "", "parent": "63", "title": "", "creatorid": "bdc93f756837", "name": "63_3", "id": "d3c7e2219bb3"}