{"name": "660_5", "child": "", "content": "I realize as I write these things, and have been teasingly called on it already, that a lot of my uppity claims of “what’s wrong with you people” are a sort of Keilloresque “news from Americana”. I’m quite pleased with myself, thank you, that after living in nine States and upward of fifty domiciles, into and out of a collection of cohabitances and lifestyles, that I have arrived at a formula and in a place, that work for me. It’s all about me. I like being among people who co-exist well with each other, and treat strangers with easy dignity. I like having that hard of a time to get people to speak bluntly of their judgments, when they have been raised to believe it isn’t polite to. I like being greeted at the egg lady’s door by her six-year-old, who without a thought orders me quite imperiously to “wait here” while she retrieves her mommy, and then once she sees that mommy approves of me, act more like a little kid around me. I like seeing well-ordered homes and disciplined, polite children, whose man of the house is every bit of that and is no tyrant. I like it when “let me check with my wife” is the proud expression of the legitimacy of a partnership, and not the cowering whisper of a “groomed, soft thing” as you put it so well. I love it all, I thank God every day I have found such a place, and grieve every minute over the price I have paid for it. The only other way I would have it, would be with my kids here alongside these nice, solid neighbors of mine, seeing through their own eyes the magnificent value of a simple and orderly little podunk town in a boring, somewhat stodgy part of the country. And I doubt that part of the dream come true, ever will. But I stopped feeling sorry for myself over what may have been done to me, or what I might think I could manipulate anyone into doing about it. It isn’t, as it turns out, very polite or neighborly, to live that way. ", "title": "", "parent": "660", "creatorid": "bdc93f756837", "id": "a56d16e2488a"}