{"name": "660_3", "child": "", "content": "Ideologies are belief systems. I would argue, belief systems are a form of programming e.g. Any of the ‘Thou shalt nots” are an instruction set, designed to produce specific results. If we examine our beliefs, we may find to our chagrin, ideas, thoughts, and entire systems that we accept without question. Here’s the rub, we also are not the author of most of them. Who gave you the thoughts? Who told you this was the way things should be? Your priest? Your pundit? Your parent? Do you agree with this exhortation? This commandment? This view of the world? In many ways these beliefs are the underlying operating system to our lives. Christians behave in generally the same ways. As do Muslims, Hindus et al. Belief systems/ideologies are the precursors to thought, in the same way thought precedes action. That’s why I suggest questioning the belief systems that program us. I don’t subscribe to manipulation though this is entirely how our society would have us behave. Buy this, use that. This is how the good live should be lived. We are inundated by social programming. Manipulation is not a neighborly thing to do, in this I agree. Telling a story is different. Telling a story requires engagement, participation. Recognition of the characters in the piece, what is the conflict, who are the villains and what the protagonists should do. If we agree feminism has power to hurt people, just as it has power to help, we have already begun our tale. If we identify the villains, your very apt, inbred cross eyed cousins of discord, we establish conflict. The arc of discovery outlines the change of feminism to humanism, and our narrative may conclude with ‘they found a way to live happily every after.’ I know, it’s a fairy tale. But it resonates with truth. It gives hope to the human condition. Within the bones of the story we can find ourselves. Along the way if we pay attention, we may discover our beliefs have changed. The ideologies we have been force fed no longer sustain us because we have known better, and we hunger for more. A better place, a better world. We may even want to be better human beings. That’s the power of story. That’s the basis of every TED talk, every novel, every movie — the resonance truth can bring to ordinary lives. This my motivation for writing on Medium. We desperately need better stories. Thus far we have only heard tales of horror from rabid feminists. How about more stories from your neck of the woods. Where women love men and six year olds can hold their own against a pentagenarian. And where men and women can show everyone else what a little slice of paradise looks like? I’ll listen. ", "title": "", "parent": "660", "creatorid": "32b605cf84cd", "id": "1e2e304c07f1"}