{"name": "660_4", "child": "", "content": "How gracious of you, and I’ve been rough with you, I know. It is a man’s roughness given a worthy adversary: I have not spared you in disagreement, because I think highly enough of you not to think I need to. This game between us, is not rigged. Neither player, has privilege. So rather than argue with you (this once?), much as we have so much fun at it, I’ll grant your request, for stories. I wrote this one just today, a true one, as an addition to my ongoing sermons on the value and power, of mansplaining. I’m a big believer in it. Around where I live, the fall corn harvest is a huge and inescapable undertaking, year after year. City folks might read a Greenpeace article or two and sum this up as “factory farming”, and indeed it is as reliant on technology as it is on human labor. As few as three people, can harvest an entire circle of corn, within a quarter-section square of some 160 acres, in a single, albeit very, very long, day: one drives the combine, one drives a big tractor pulling a grain cart beside it, and one drives the semi-truck to the elevator each time it is loaded from the grain cart. Also involved, is field repairs and maintenance to these several pieces of heavy equipment during such a day, which is pure non-production and little more than “burning daylight” while the endless rows of corn await unforgivingly. By tradition, and by mutual preference, this is men’s work. But plenty of gals do it. Among the Mennonites in the neighborhood, who are both as harmoniously patriarchal and as enthusiastically high-tech a community as can be found anywhere, it is more common than among the other farm families for the gals, handmade dresses, hair-snoods and all, to drive the equipment during the harvest. And they do it as well as any man. One year a farmer I know, whom I had done some other work for more in keeping with my own skill sets (I am NO FARMER and everyone knows it), asked me to come along and drive the grain cart when he was short-handed. I didn’t want to. I hate driving heavy equipment, am no damn good at it, I am a carpenter and not an operator, and I told him as much. “Well, I reckon a guy can learn”, I was told. Right. The man, who had been doing his kind of work since knee-high to the milo patch, spent all of five minutes showing me once, all the controls and mechanisms on a rig worth as much as most of the semi-upscale homes I ever worked on, and pointed me to the corn. It was a disaster. I made every stupid mistake a guy can make and even invented, city-boy-like, a few of my own, dumped corn on the ground instead of into the truck, got yelled at on the two-way for twelve hours on end over the two days it took him not to decide to call me back for a third. And I walked away from the experience not embarrassed but angry. If the man had shown the common courtesy, to spend a little more time explaining the mistakes he knew I might make so I wouldn’t make them, showing a tad more respect for my not being stupid just because he grew up a farmer and I didn’t, reckoning within himself that I could as easily make as big an ass of him up trying to deck a steep roof in a high wind, maybe his couple hundred dollars’ in corn out of a harvest worth a high six figures, wouldn’t have ended up on the ground instead of down at the elevator where it belonged. Mansplaining. DON’T KNOCK IT. https://medium.com/@framersqool/ill-take-the-liberty-of-commenting-on-my-own-comments-to-add-more-anecdotal-entirely-86be7804ea67#.40io4djau ", "title": "", "parent": "660", "creatorid": "bdc93f756837", "id": "f71f22a936cb"}