{"name": "674_6", "child": "", "content": "Dear Tracy, my husband Dave has asked me to pass his thoughts on to you (he is not much into social media): Hi Tracy, A very eloquent piece from the heart — thank you. Having had a couple of days to recover from what was indeed a shock, I’ve had time to think. And I’d like to offer a view from the other end of the career span: I’m an Oxford graduate in modern languages now approaching retirement, having worked for the UK and Canadian governments, in German industry and latterly in self-employment in Germany. I’ve spent four decades in the EEC/EU, working with and in many countries around the world. Like you, Andy and no doubt thousands or millions of others, I see myself as a British European, and I believe I have in some small part contributed to representing that dual culture outside the UK. One thing I’ve concluded from all that time is that your identity is fluid; it develops as you yourself develop and absorb more inspirations you can relate to. The identity we have now is not something we need feel to be torn apart. We’ll never lose our Britishness. How often have I heard it said over here that we Brits are much liked for our humour, pragmatism and resilient optimism. That won’t change. Our Europeanness won’t just erode either. We’re not going to suddenly succumb to isolationism deterring us from overseas business, holidays and residence, or from remaining open to Europe and the world. What we need now is just to be ourselves, retain those likeable characteristics and build on them to cope sensibly with the rantings of emotionalized polarization prevalent in politics and the media. We have to come to terms with the fact that the UK is in turmoil, threatening to come apart at the seams very soon, and in fact Europe isn’t in a much better state. Let’s be honest, there are legitimate reasons for British discontent with the EU: stifling red tape, stiff fees, failure to conceive a humane but practicable refugee policy, wariness of ambitions towards a United States of Europe. Yes, we could have influenced all those much better from inside the club, but the Brexit shockwave is also a salutary wake-up call for the EU, which I hope it responds to. OK, so now what? We cope, that’s what. We push for a new referendum including more of the country’s youth, we stay connected outside the borders of England and Wales, we carry on with business as usual and never mind those who still tell us that life was better without the EU — and while we’re at it, the internet, mobile phones and continental food. Yeah yeah, it was the same fifty years ago with television, pop music and long hair. Talking of which, we can take heart from a quote often attributed to John Lennon: “It’ll be okay in the end. And if it’s not okay, it’s not the end.” Dave (via Anny) ", "title": "", "parent": "674", "creatorid": "e3a09543d891", "id": "4fe08a7d0a45"}