{"name": "684_8", "child": "", "content": "The Myth of the Individual Most (I’ve yet to find an exception) philosophers and students of theology, regardless of the brand, seek to explain the joy or futility of existence as something that isolates the individual from the group. I suggest we examine our experience as a member of a group (humans) and not as a separate entity. Once this new way of self examination is understood, then the futility of our existence will cease to be a distraction from the business of living. Here’s why. When an individual fails or succeeds, the group always benefits. Think of it this way. If we imagine humans as a hive of bees, or as a cluster of individual bacterium, then an attempt at any task benefits the group regardless of the outcome of the attempt for the individual. If a lone bee ventures in a direction from the hive, others have not yet pursued, and finds flowers, tomorrow the other nectar gathering bees will benefit and have a new place to forage. If, however, the lone bee finds a garden with too much poison (think Roundup) and becomes ill, the group of foraging bees will benefit, because they’ll know not to fly in the direction of death. Likewise, if a bacterium ventures out and finds a nutrient source, the group benefits. If, however, if that same bacterium found vinegar (a poison to bacteria), though the bacterium might die, the group would benefit by knowing which direction not to grow. Rethinking our lives as members of a group, seeing the big picture of our expansion, and finally knowing our activities, whether successful or not, benefit the group now and tomorrow, comes close to the feeling Camus ascribed to Sisyphus’ feeling of satisfaction. Sisyphus continued the activity, regardless of not knowing whether or not, he would someday be allowed to stop. Remember, the gods grew weary of Sisyphus’ determination and rewarded him in the end. Over the course of our lives, we’ll be rewarded for our efforts over and over again, until we’re not. We’ll be rewarded for our efforts with food, shelter, and in many cases, leisure. We’ll be rewarded for our efforts from the effort of others who heal us when we’re sick. We’ll be rewarded for our efforts with each step we take, even if its a wrong step. And so on. For some, the end of rewards comes sooner than later. And, unless homo sapiens are nothing more than a cancer, one that will consume all resources in its path until nothing is left to feed the mass, the group will live on. ", "title": "", "parent": "684", "creatorid": "146ea91aed8c", "id": "4896e08e9c2e"}