{"name": "691_6", "child": "", "content": "The most important thing we need to achieve is to overcome Dunning-Kruger club. Actually it is funny how this reverse strikes here — I see that as an indication for how ridicoulus this effect is. Because I think it will not be possible to make work visible with everyone feeling comfortable whilst people do not trust each other. In various aspects. Its always about external comparison. Great system we invented. Harder, faster, higher … and make the most out of you. We have a zeitgeist of over self-improving egoists … and now we realize that this is, well, probably not the best of ideas. Ok, but enough meta: What we startet was kind of a weekly message to the team what we want to focus on this week and a short resume of the week before. Spoiler: It didn’t really work out — two third simply didn’t do it. But to me — initially being skeptic because of the monitoring and control aspect — it is a really great tool: I can decide what to focus on and everyone knows that. So they also know what I won’t(!) do or am not focused on. Expectations are so crazy explosive when not met — and still people keep them secret or believe whatever THEY expect should be obvious. And by writing down each week a short resume, I also get a list of things that didn’t work — which in itself is not so interesting — but also the causes which prevented them. By just reading the plans of someone I could drop them ideas or links or warnings or whatever … I’m actually still wondering what prevented most to do that. I’ll go ask them. Maybe it is boring and clear to me what I’m going to do — yeah, but it is actually not for me but the others. Or they maybe think, others find they do or aim for to less — although such a comment never should imply “And I will under no circumstances do anything else”. I don’t know. ", "title": "", "parent": "691", "creatorid": "d3b45f62aeea", "id": "4e8405a739cc"}