{"content": "A source of dysfunction in life is to focus on factors that do not matter. “What of they don’t like me?” “What if they say no?” are the factors that many overcame in their first job, first team, first day of Kindergarten. A second source of dysfunction in life is to focus on factors we cannot change. I recall an elementary school story about a boy who wanted to be a basketball player and hung upside down with weights to make himself grow taller. When that did not work, he decised to become a horse jockey and wore tight clothes to keep himself from getting bigger. Both failed and at least he accepted himself thereafter. What sorts of dysfunction can come from this misguided focus? A good example is the German people after World War One. They HAD suffered a terrible defeat which had caught them by surprise since Russia had collapsed, and their own leaders had concealed the precarious condition of their own situation. An explanation that seemed appealing was the “stab-in-the-back” theory which deflected the blame on to Jews and liberal elements in German society (to be sure, there were Communist uprisings in several German states following the war). This lie which placed the responsibility on others who could be scape-goated (i.e., punished) led to the election of folks like Hitler who fervently believed this and were willing to act upon it. The rest as they say, is history. There are Blacks in America who, as Black psychologist Kenneth Clark observed, two generations ago, are burdened with great sensitivity to racial factors. This was because racial condition made such a difference in everyday life. Arguably, race today is not as great a determiner of condition as it was two generations ago; what was once a functional factor is no longer so much. Certainly the experience of Hatians and Nigerians who have a higher standard of living in America than do whites, would bear this out. To think of life in terms of the Black/White divide (and what do we do with Hospanic, Asian, etc.?) is dysfunctional. One of my heroes is Booker T. Washington, born in slavery, freed to face a world of resentful whites in a war-torn deep South. He did not focus on what others owed him, but rather on what he could do for himself; he further realized the necessity for community, mutual help including mutual accountability. Self-respect and the pursuit of education, not credentials which depend on what other people say they are worth, but practical skills like reading and math which frees a man to think for himself, evaluate others’ opinions and compare, and recognize what can be done to put food on the table. “Be the best carpenter you can be,” he told his students, “and even the prejudiced with want to pay you to build their houses.” Rather than envy the white women who holds everybody up with her asking for more (I don’t have to tell you what the other white people in line thought of her- it would be unprintable), I encourage you to pursue the good. St. Paul puts it this way, “Whatever is god, right, lovely, worthy of praise, think on these things, and the God of peace will bless you.” Look for the opportunity to do good, instead of opportunity to blame, and the tone of life can change, along with its perspective. ", "child": "", "parent": "6", "title": "", "creatorid": "6503a4fa79ac", "name": "6_20", "id": "dad742953eb7"}