{"id": "ede38ebdd3d2", "content": "This is a good piece of writing and a reminder to be kind (to ourselves and others). But there are deeper aspects too, imo. We so often co-relate concepts of fat and thin with competency and success, which is illogical if we but spent 2 seconds thinking about it. For the commenter who went on a rant about the body and fuel and petrol and diesel and what not, I see what you are trying to say: but understand this, you are just as obsessed in your pursuit of bodily perfection with your concern about the fuel and machine analogy of the body. Ultimately your perfectly-fueled body will end in the same place as the decrepit body. The only difference is that likely you’ve pissed off more people by lecturing them throughout your kale-juiced lifespan. Check out subliminal messaging of the ad industry, dietary supplements and fashion…what do you think they are talking about and what message are they trying to drive? Hint: It’s not one of acceptance of the body you were born with. Regarding those who talk about being concerned for sick fat friends, etc…understand too that the Farm Subsidy Bill which makes wheat, corn and soy super cheap to produce and all sorts of combinations of flour and sugar cheaply purveyed is a gigantic part of the problem. And those combinations are deadly in their addictive qualities. Google this if you need more info. There is an ingrained structure at govt level making us fatter and keeping us fatter. It may not be on purpose, but it certainly requires modification. Fruits, vegetables, whole grains, nuts and seeds (yes, I know Dr. Fuhrman and have done the Eat to Live thing…excellent but requires money and time commitment, please note) are more expensive and just not easily found in poorer areas. In Queens, NY where I live near one of the largest public housing projects in the US, there is NOT ONE SINGLE grocer/source on the entire one-mile strip from where you can pick up healthy food for the same price as unhealthy ones. In Manhattan, fruit and veg carts are every few blocks. But the poor people have cheap pizzerias, fried chicken, donuts and fast food lining that strip. I see tired fat mothers coming home, bearing boxes of pizza for dinner. You think I’m going to go and tell her to detour half a mile to pick up salmon and vegetables to feed her family (which she can’t even afford, btw). And this is NYC. While driving through a good bit of Indiana last summer, there were a couple of hours where no amount of Yelping would find us anything other than fast food. TWO HOURS worth of a state. Dr. Fuhrman will have to grow a kitchen garden there before he preaches his gospel. And finally…we think too much about the body. Sorry, modern Western culture, this is on you. I’m of both West and East, and I favor the East on this one. Less display of the body is a good thing. Why does everything have to be displayed? Usually it’s the woman doing the displaying (and I’m a woman and a feminist before you jump on me for that). Who said it’s a display of feminine power to let it all hang out? Who sold this Kool-Aid and why is everyone buying it? There’s a happy medium between burkhas and bikinis. In short, this is a multi-faceted issue, and I’ve necessarily telescoped some of the thoughts I’m offering. We need to move beyond superficialities of body shape to deeper acts of kindness. Kindness to the individual body and the community is kindness to the earth and other animals too. There are unhappy thin people, and unhappy fat people. Unhappiness is really not in the body. Unkindness is not either. ", "creatorid": "e946ca4f7dda", "title": "", "parent": "6", "child": "", "name": "6_23"}