{"content": "This is an epiphany. It may finally explain what has bothered me most since the election. I still wake up in the middle of the night wondering how anyone of Mexican heritage, anyone who is or knows a person with disabilities, anyone who is or has an LGBTQ friend, or any woman who saw the Access Hollywood tape could possibly have cast a vote for the unfit, arrogant and offensive man in The White House. And yet they did. Enough did that he won. He won. You’re right. He — and #presidentbannon — had no problem asking for and getting our most precious currency…. our votes. And it may be they had no problem asking the Russians and Julian Assange for help either. They certainly had no problem taking it. When I saw your headline I thought, “white men.” When I got to the part about the woman in the line at Chipotle I thought, no, that can’t be right. But it is. Perhaps this, this no-problem-asking-for-more (and as you point out, no problem taking more) and probably no-problem-expecting-more, may be the defining characteristic that split women and Latinos and so many groups that actually voted for POTUS45. While I agree with the theory that the “unheard” white voters were the ones who were the surprise, I still think what put him over the top were the people whose identity groups he offended who voted for him anyway. Your observations and insights may explain that the “No Fear in Asking for More” identification trumped traditional identify groups. As hard as it is to accept, there probably is a race aspect to this but to me, it’s even worse. Such a precise and dangerous combination of fear, greed and self-protection that is strong enough to let them see past it and cast that vote anyway, despite literally seeing the video of this guy insult big groups of people and brag about sexual assault. Wow. Just wow. Makes me want to crawl under the covers because that is a really ugly but powerful truth. OK, so I won’t go back to bed. I will think — more — about this, but thanks to you in a slightly different way. The challenge is in the balance. How do the decent people take back this country? How do people who have been taken from for so long learn to ask and receive in return? Or at least lay claim or hold on to what is theirs. How do the people who take and take and take learn to hold back a little? How do we prove the greatness of America is that there is enough for everyone if everyone can ask for just a little less and give a little more? ", "child": "", "parent": "6", "title": "", "creatorid": "974340d3bcfa", "name": "6_5", "id": "b8d754e0e474"}