{"name": "706_4", "child": "", "content": "I really don’t think that the changes introduced to the .sketch file type mean that you will see ‘design to front-end’ handoff automated any time soon. I do believe it’s a step in the right direction in terms of version control and plugin development (specially for import/export plugins). But for handoff automation I think a lot of the fundamentals of how you actually design in sketch would have to be completely rethought from the ground up. Look at webflow for example, it’s the only app that I know of that really automates this process. But then, as you mention, what’s going on there is not exactly a translation. The actual design process is conceptually very similar to the front development process, it’s just done in a (somewhat more) visual fashion than with sketch, illustrator, etc. While symbols, group resizing options and shared styles allow a designer using sketch to think more like her (front-end) developer counterpart, I believe we are still very far from the day where “the responsibility for all-things-UI is back in the hands of designers”. And that’s probably a good thing. Again, look at webflow for example (because it really puts all-things-UI in the hands of designers). While it certainly has its merits, it’s clearly geared towards one of two scenarios: freelance designers who’s code skills aren’t apt for live production websites;very small design agencies doing simple institutional websites or blogs with very few interactive functionalities besides content publishing. If you fit in one of those categories, you’d probably be very happy with webflow. If you don’t, I don’t think you should even want to automate ‘design to front end’ handoff. Specially not with the myriad of backend technologies, screen sizes, type of devices and input methods that is only growing to grow in the future. I don’t think bohemian even has that goal in mind for sketch. If they do, they’ve clearly taken the wrong approach. I do believe that designers should learn how to code (at least HTML and CSS), and they absolutely must begin to think more in terms of modular components and relationships between those components than in static elements and absolute positioning. That’s where I see sketch going, introducing ways to let the designer think as a developer while not trying to substitute one by the other. ", "title": "", "parent": "706", "creatorid": "b67e624c5931", "id": "af545618898b"}