{"name": "719_12", "child": "", "content": "In some sense, I agree with you, I mean as a designer; we should understand that designing is a means to a solution — thus all designers should be able to design a great user experience. With that said though, I believe that the title UX Designer should refer to the seniority of the designer. Case in point: In some marketing companies, you’ll usually find different levels of Sales Representatives. Someone fresh out of college will start as a Junior Sales Representative, then with some experience a Sales Representative and eventually that person may become an Executive Sales Representative. Now even though they all serve a similar role, the decisions gets made by seniority. In the company I work for, the same rules apply to user experience design. Grunt work is usually done by a Designer, the Web Designers have a little bit more of responsibility when it comes to idealization and creation. Lastly, the UX Designer in some cases build the solutions, they take part in stakeholder meetings, approve designs etc. In my case, I work as a User Experience Specialist, which is a step above the UX Designer, it includes all the functions of a UX designer and the role also includes user research and usability testing. But I believe these roles mostly apply to large corporations and teams. I think the true problem is that most companies jumps on the band wagon of naming they’re designer a UX Designer, hoping that the person would fulfill all the above mentioned roles. That’s really hard to do. I’ve spoken to quite a few UX Designers lately, and I was surprised that most of them did not really understand human centered design, user research or anything related to usability testing. To my point, I don’t believe the title of UX Designer is wrong, I think it is the application there of that is wrong. If a person calls themselves a UX Designer, and have no knowledge on the complete UX process, then it is fair to say that this person is not a UX Designer. ", "title": "", "parent": "719", "creatorid": "81781e3a68d9", "id": "171e6b3e8258"}