{"name": "721_6", "child": "", "content": "Hi Nina, thank you for your very thoughtful feedback! You’re right in that my assumptions largely influenced my research and solutions. So that’s something I definitely need to work on! I’m curious about what your definition of a pain point is. You mention a lot of things you believe it is not, so I would love to hear what you think an example of what a true pain point might be. In my opinion, user’s emotional reactions, interests, and behaviors are just as likely to be the root of a usability issue. Confusion and emotional behavior can’t be as accurately tracked with A/B testing or click-through rate, but can definitely be observed in person. That’s why I believe they can be legitimate pain points. You’re also right in that I describe my pain points very vaguely. I will address them here: Pain Point 1: Users are confused about how search results are ordered and displayed. Users explicitly mentioned that they hesitated and scrolled back and forth because they saw lower-rated and farther options before seeing higher-rated and closer options. The sorting method is not labeled by default causing users to question how results are ranked. Each user explained that they look for specific things while browsing: some top-rated, some most number of reviews, and others distance. The results that they saw did not match the mental model that they had (which was top-rated, most number of reviews, and closest being shown first), which caused them to question the ranking system. Pain Point 2: Users did not find the current sort bar helpful. The users that could not make sense of the results tried tapping on “Top Rated”. However, the results did not change (which led me to believe that results are already defaultly ranked by rating). But this caused users to believe that the sort filter didn’t work. The other sort filters are “Distance”, “Newest”, and “Minimum”. Some users mentioned that they weren’t interested in the newest restaurants near them and would not use that filter. Most users were confused by the wording of “Minimum” and weren’t sure if it referred to delivery fee or amount they had to order. Through my testing of my prototype that incorporated a filter bar similar to the one in the main Yelp app, I found that many users used the “Open Now” and price ($, $$, $$$, or $$$$) filters (because they use them frequently in Yelp), suggesting that they would be good additions to Eat24. Pain Point 3: Users expressed that they were most interested in reviews and ratings but did not navigate to the restaurant information page (where the full reviews are in Eat24). Many users mentioned their Yelp browsing habits (of looking at reviews and ratings to help them make decisions). However, in Eat24, they are taken to the menu page first, and not shown full reviews unless they click on a small, yellow button in the top right corner of the menu page. My thought around this is that because users already have established Yelp browsing habits that help them make better and more informed decisions, why not utilize them in Eat24 as well? You bring up very good points and I hope I addressed most of them in this response. Please let me know if you disagree and thanks again for giving my article a read through! ", "title": "", "parent": "721", "creatorid": "385d72c3876e", "id": "3eaf8b56451d"}