{"name": "721_2", "child": "", "content": "Good work. Just a suggestion. It’s very important to figure out the “why” and the real “pain points” behind users’ reactions and behaviors. For example: “Pain point 1: Users are confused about how search results are ordered and displayed.” This is not really “pain point” but users’ reactions. What made users confused? It is because the results shown in a way that doesn’t match their mental model (and what’s their “mental model”)? Or it doesn’t label the sorting method (distance, price etc) so that users don’t know how it is displayed. And very important, what is the exact user needs for “search results”? What are the most important information for users? How can we help users find the most valuable information and make the right decisions fast? “Pain point 2: Users did not find the current sort bar helpful” Why not helpful? What are not helpful to users? What do users need? “Pain point 3: Users expressed that they were most interested in reviews and rating but did not navigate to the “restaurant information” page” “Expressed interest” is not “pain point”, “did not navigate to a page” is not a “pain point” but a behavior which was observed by you. What made them “did not navigate to…”? The way it placed (in a not obvious location)? Or restaurant information is not important to users. What are the “restaurant information”? How about “phone number” or “open hour” or other information that might be useful? Why do users say they are most interested in reviews and rating? What the value of “reviews and rating” for them? Obviously can help them make better and faster decision, right? What else they care about? Ask Why, a lot of Whys, until you really figure out the “pain points”, not user response, not user behaviors, not your observations, not your assumptions, or even not “usability” issues. Good luck! ", "title": "", "parent": "721", "creatorid": "a273e478902", "id": "6bd95e3bec63"}