{"name": "723_22", "child": "", "content": "Interesting exercise! Given that it sounds like your testing was simple and quick, I’d be interested to hear the results of the same tests for people that aren’t new to VSCO. I am a veteran VSCO user, and I admit my experience with the app at first was wonky, but as soon as I transcended beyond the learning curve, using the app became a breeze. Until they redesigned it; I had a bit of relearning to do, but still found myself easily reaching a point of full comprehension. One thing VSCO also intends to achieve with the app, I believe, may be to provide a creative environment intently designed within which users may blissfully endeavor photographic work. As seen here with your tests, that isn’t best for new users. But the difference of visual and UX environment between using VSCO and other photography apps is striking, and to me, that lasts longer than the frustrations upon using the app for the first time. Your solutions are great for the first time user, but it fails to provide the creative environment VSCO intends as well – granted, whether VSCO’s intended environment is actually creatively inspiring is up for debate. I personally prefer the existing app design over yours, but I am a power VSCO user, and I’ve learned its language. I’ve seen similar case studies for Snapchat, that its hard to use and should be redesigned. VSCO and Snapchat are both easy targets, for sure. But I think its cheap and unwarranted – the extreme example of this is that difficulty from using a brand new tool does not mean the tool is bad. It means the user needs time to learn it first. I have been following VSCO for a long time, and I believe that creative environment is a high priority for them with their app. I have my own personal qualms with the app, too – namely, did you even know you could reorder the filters? If you long press one of them, you can reorder them, but its a painstaking ordeal that is in dire need of a redesign. After all this is said, this case study is awesome, and you have valuable insights about an industry leading tool. I’m interested to hear other stuff you have to say! I would certainly like to hear a VSCO employee’s POV on this conversation, for sure, too. ", "title": "", "parent": "723", "creatorid": "aeddf4e573ba", "id": "3d7895774890"}