{"name": "73_6", "child": "", "content": "People overlook that paternalism and even racism can be found — a lot — even among the hippies and zen-buddhists. People overlook that LeBron is dialing down, but still playing three minutes more per game than Russell Westbrook(!). People shouldn’t overlook that if LeBron quit today, he would have proven everyone wrong who criticised him as a player, person or businessman. People shouldn’t misinterpret Oscar Robertson’s and Austin Carr’s admiration for LeBron during yesterday’s game as d***-riding. While they were marvelling at this or that performance in his career, he delivered additional reasons for admiration. Big O said the game slows down for LeBron now, perception-wise. Guess what, it also slows down for the viewers: after the 2016 Finals, we can truly say that we are witnessing history. It’s officially in the air now. And that doesn’t mean that LeBron looks older or less spry — just a tad more deliberate, patient, and all the more influential on the court. It’s come to the point that LeBron has reached truly rarefied air of success and he keeps rising. You can call me a fan, but it’s more fitting to say that I am just in awe — don’t let anyone tell you that the Pyramids couldn’t have been built by man! And we should never take it for granted: for every LeBron, there is countless of Grant Hills, Derrick Roses and Greg Odens and we should be thankful for every player whose body doesn’t shorten his career. And while the Warriors have traded in some of their hydra’s heads for the Hercules that is Kevin Durant, the Cavs have size, rebounding, loads of threes, experience and swagger — and, maybe most importantly — a Kevin Love that is finally finding his groove. Right now, they are the team to beat. ", "title": "", "parent": "73", "creatorid": "6dcfc1dbb2fa", "id": "54500f9632e0"}