{"name": "805_8", "child": "", "content": "That all depends. The ones that brag about getting some stupidly obscene amount of signups/customers/sales for seemingly little or no effort or just by using this “one trick”? You betcha. 100%. The ones that throw “teasers” out at their audiences that are basically along the lines of “Well, if you knew about my secret approach to blah blah blah, you’d be getting awesome results like this too! Just sign up for my limited seat webinar NOW before it sells out!” Yeah. Them too. The ones that brag about how they’re #1 in Google and how much business it brings them and if you just paid them for what they knew, you could be too? Sure. Or how about the ones that humblebrag about how they don’t have to do hardly any work at their online business and spend all of their time rotating between their five houses around the world or that they made $4 million last year in their pajamas? Yeah, fuck them too. And let’s not forget the numerous startups out there pandering this type of shit (“We built our startup with no advertising, no marketing, no sales, no nothing! We just put it online and it went viral!”) just to get PR and signups from people who want to “be like them” or because of the word of mouth it created. You can build a legit audience, add value, and even ask them to buy stuff you make. Nothing wrong with that. That doesn’t offend me. So long as you’re honest and transparent about it, deliver the goods, and you make sure it actually gives your audience the results you promised them. The problem is there are far too many people out there getting everyone’s attention with these crazy build a startup/info product/freelancing business and get rich quick without doing any real work messages. Or, they admit there’s some work, but they’ll only tell you about it if you fork over big money for it. They’re all over social media, all over search results. People that legitimately want to build a business get sucked into their fantastic story full of shiny baubles, spend shit tons of time and money doing things that don’t work and give up, feeling bad about themselves. “It must be me. After all, it worked for that expert and he’s living the life, right?” Meanwhile, the audience builder is laughing his ass off all the way to the bank. So yeah. I’m calling bullshit on all those motherfuckers. Sorry if that offends you. ", "title": "", "parent": "805", "creatorid": "55e9fd9a459", "id": "14151692c45d"}