{"name": "805_1", "child": "", "content": "Hi Saeed! Pricing is a “fun” topic and I should probably write in-depth about it. Ideally, you should strive to have value-based pricing. What this means is that you price things according to the value that someone would get as a result of using your product — and for how long they would receive that benefit. If you can find a way to measure any of the following, it’ll give you a good idea for the value your customers get as a result of using your product: How many new sales do they get as a result of using your product, over what time period, and how much are those sales worth?How much money does using your product save them, and over what period of time?If your product “productizes” a service, how much would that service usually cost them — and how often do they use that service? Once you have identified these metrics, you want to make it a “no-brainer” for your customer — your service/product should cost less than the alternatives. People need to perceive three things when they make a purchasing decision: 1) the value I get is tangible, 2) the value I get is far greater than what this costs me, and 3) it costs less than other alternatives. So for example if your customers typically spend let’s say $1,000 to hire a designer or marketing agency to get cross-platform email templates designed and developed, if you can offer that same service with quicker delivery, less headache, and at a fraction of the price, you’re onto a good start. If you could (economically) do this same thing for $100, that would perceivably be a steal for your customers (assuming the quality is equivalent). But make no mistake — your customers will be the ones to tell you whether or not 1) your product fulfills those promises and 2) whether or not they feel the price is a “steal”. Ultimately you have to play with pricing for a number of reasons. First, if you price it too low, you could be leaving money on the table. Or, if you price it too high, you could be missing out on a larger part of the market. Second, your pricing determines how many customers (and how much traffic) you need in order to hit specific revenue targets. Price too low, and you might never get the traffic and orders you need to make a living at it. I hope this is a helpful start and I’ll queue this topic up as something I should dig into more. In terms of coming up with ideas/guesses/hunches, etc. — they’re everywhere — you just have to keep a lookout for them. Anytime you hear someone complain about something, that’s usually a good sign — but don’t just jump in. Always validate that there is a (larger) market than just one person that is genuinely interested in what you’re looking to offer. Thanks for reading the article and for the great questions! ", "title": "", "parent": "805", "creatorid": "55e9fd9a459", "id": "f421f2a38a45"}