{"name": "805_14", "child": "", "content": "Okay dude. I don’t even know why I’m entertaining this but here it goes. I’m going to come out and say that you and I are probably never going to see eye to eye, at least if you keep looking at my writing from your current perspective (not to mention if you keep taking hyperboles literally). So I’m going to ask you to switch gears and put yourself into the shoes of a developer (marketers are supposed to be good at empathy, right?). This guy — let’s call him Dave — loves writing code. LOVES IT. So much so that — even after years of frustrating experimentation and potentially a quarter of a million dollars in student loans — he still spends all of his free time practicing his craft and learning how to get better at it. When he gets his first job writing code, he thinks “I’ve made it! I get to do what I love every day!” And things go well for a while. But after about 5–10 years, the burnout sets in. His company makes him work nights, weekends, and even sometimes holidays to keep up with whatever stupid whimsies they come up with. His personal life is a mess. He’s overweight, out of shape, and feels guilty about the relationships he does (or doesn’t) have. One day after Dave just pulled another all-nighter his boss tears him a new one for something that isn’t even his fault. Dave’s had enough of sacrifing his life for this company. Dave decides that he’d like to write a web app or something that lots of people (meaning, ideally more than one) might find useful and that he could (hopefully) sell enough copies of to make a decent living off of so he doesn’t have to continue on this never ending nightmare of sacrificing his life for the whims of these crazed maniacs who he never sees working past four o’clock in the afternoon and who seem to have infinite free time (and money) at (presumably) his expense. Being a developer and not being good at “people skills” or “business”, Dave does what developers do — he googles for information. And there before his weary eyes appear to be the answers he’s been searching for. Dave spends even more of his nights and weekends trying to do what these “successful” people tell him he should be doing. And being a good developer, he’s always comparing his results to what the experts say should be “standard” results. Years go by. Dave is in worse shape than before. He’s been unsuccessful in getting any sizable traction for his software business. He tried building a launch list but couldn’t get more than a few signups. He tried starting a blog but no one read his articles or signed up for his newsletters. He tried doing social media but never got any “real” followers — just a bunch of bots. Dave decides he’s no good at this whole “marketing” thing. He throws the towel in. He gives up. He accepts the fate that awaits him — of his neckbeard growing grey and of him growing old — in that dull beige cubicle of his that will someday become his tomb. * * * This shit happens every day. Savvy (unethical) marketers prey on people like Dave. They convince Dave to pay for an “exclusive” and “limited” $3,000 webinar seat that he can’t afford but is convinced he needs. Startups that Dave admires brag about massively successful results with unintuitive and clever marketing tricks — just so Dave will take notice of them and their offering — and spread the word about them. Dave listens to podcasts where the hosts (non-challantly) talk about how they “only” got 10,000 signups when they went to launch their product and how they “only” got to $50K MRR that first year. The guys running the podcast run a conference that Dave is pretty sure he needs to go to. Oh! And they’ve also got this exclusive membership site that Dave is signing up for as we speak where the podcast hosts and their friends “talk shop” so their secrets can stay safe from the prying eyes of the public. And so on (as I’ve covered before). Now — read very carefully here. I am not saying that marketing is evil, nor am I saying that marketers are evil. In fact, none of this is a criticism of marketing or of marketers. Anyone who promotes a business is a marketer. By that very definition, I am a marketer. (And no, I don’t hate myself.) So, sorry if you think I’m knocking on the marketing profession — I’m not. What I am saying is that there are marketers who sell marketing. And most of what they’re selling is total shit. I’m sorry, but if you’re a “marketer” and “marketing” is your product, chances are you’re probably a hustler (in the bad sense). Real marketers make real dollars marketing real products. If someone who’s a marketer wants to sell some insights they’ve had about marketing, that’s perfectly fine — it’s called write a book and sell it for $35 — not go hustle people into spending thousands of dollars for your “exclusive” webinar/community/video series/whatever the fuck. Unfortunately for Dave and many other developers out there who want to learn about things like “sales” and “marketing”, the true path is often hidden from the light. I wrote these articles to help developers (like me) get their businesses off the ground and to avoid falling victim to fad marketing trends that really only work under very certain circumstances or for very specific types of personalities. Can you build an email list/build an audience/write a blog/whatever the fuck and make money off of it? Of course you can. I never said you couldn’t. Should developers expect to get 100,000 signups/$250K MRR/whatever the fuck from those activities? Fuck no. But that’s what a lot of them are being told to do and told to expect if they do those activities. Oh, and conveniently enough, the person telling them to do that just so happens to have a super exclusive webinar/community/conference they should totally sign up for so they can learn all of their secrets — not just the ones they make public! The only reliable way to get your shit up and running is to pound the pavement, talk with people one-on-one, and to very narrowly and intentionally target where you are promoting your product/service. Dave and friends are trying to get a handful of people to try out and pay for their software. They’re not trying to be the next 37Signals (although they wouldn’t complain if that were the case, I’m sure.) Trying to use a growth marketing strategy early on is not a guaranteed recipe for success — it’s often a guaranteed recipe for failure. Sure, some people do it, get lucky, and then blog all about it. And then everyone thinks that’s how it’s done. I’m coming from a practical, pragmatic, this shit works — no luck required perspective to try and help my developer bretheren get something off the ground. This isn’t a game. This isn’t funny. This is people’s LIVES. I really do hope you take the time to read this, think about it, and stop getting defensive about me shredding a bunch of unethical ass clowns by using some pretty standard rhetorical devices. I took the time to write this response, but I won’t be writing any others. Best of luck. ", "title": "", "parent": "805", "creatorid": "55e9fd9a459", "id": "5b9a9cb4972b"}