{"name": "805_15", "child": "", "content": "Well, going back to the specific points you called out in the article (I had to go back and see exactly what they were): “Just collect emails!” In and of itself, there is not really a strategy there. So yes, this would be pretty useless advice if it didn’t state anything more. However, I’ve built a sizable email list, and have made a decent (albeit not 7-figures) living because of it.“Just build an audience!” Again, in and of itself that means nothing and teaches nothing. But I’ve built a sizable audience from nothing, launched a SaaS business that related to that audience and the business has done phenomenally well, experiencing month-over-month growth for over 2 years because of it.“Just do integration marketing!” Honestly, I have no idea what that is — never heard of it before.“Just make your product epic!” Yes, the Field of Dreams is a lie. You can’t just build it and “they will come”. I get that. I don’t think anyone sincerely believes that all you have to do is build something and let it sit there without doing any work to market, promote or otherwise draw attention to it. So my real problem with this is you’ve painted this polarized, sleazy caricature of those who are teaching honest marketing principles that have, in fact, worked and making a blanket judgement about them like they’re all some sort of snake oil salesmen. If you have specific examples, give them. If you’ve not tried any of that kind of advice and paved your own way, good for you — say that. If you have tried taking this advice, talk specifically about it and say why it failed. Don’t paint everyone teaching online with this gross caricature you’ve created. Especially considering the product you’ve built is something the legitimate ones would have been highly interested in if they weren’t otherwise insulted by your generalizations. I mean, you’re free to do so if it makes you feel good. But it’s not going to make your business any more successful pissing off marketers. ", "title": "", "parent": "805", "creatorid": "57bc81c526e9", "id": "7785efab6e08"}