{"id": "1b76e2f1dcd", "content": "The danger lies in the area of good enough. When software becomes good enough to replace human labor that would be the tipping point. Here is na interesting piece of using AI to imitate human labor, and it was good enough. It was 2005. http://news.mit.edu/2015/how-three-mit-students-fooled-scientific-journals-0414 It wrote a scientific paper by itself, realistic graphs included. It was good enough… I am certain of the dystopian future, and that our generations are just guinea pigs of digital era. It will take quite some time before we are back to analog world an appreciate it again, using digital sphere just as tool that helps us and not replace us. Before that we will experience chat software that will make support staff obsolete(help desks, customer care), that will easily pass the Touring test, Social network will be flooded with ai profiles and accounts that will chat with you and give you good enough answers to your inquiries. Marketing managers will put out of business many employees who have repetitive marketing jobs. Google already has automated website analysis, creating marketing search campaigns and designing display banners virtually by itself with very small human effort. You have a site called fakespot that recognizes fake reviews on Amazon, and I could go on. The industry of sex robots is in its infant stage, but as VR progresses and robots are more and more human like, you will soon be able to have a robot assisted masturbation called human to robot sex. We are now entering the digital apocalypse, so hold on tight and be ready for the worst case scenario. This especially goes to those who are engaged in repetitive jobs. However, I am sure that the emotional dimension will always be a no-fly zone for AI. We cannot even fully describe our emotions verbally, thus we cannot digitalize them. And there is an unsolvable problem of consciousness. Check out the duble slit experiment. Thank you for your post. ", "creatorid": "9b96abde5489", "title": "", "parent": "81", "child": "", "name": "81_16"}