{"name": "913_25", "child": "", "content": "First of all, I recognize you from a response to one of my other posts. I respect your expertise, and your efforts to spread programming know-how and best practices. Thanks for helping us spread word about our open source community. I assure you that we are not intentionally spreading misinformation about the field. There’s already so much misinformation out there driven by marketers. Our nonprofit seeks to be a reliable, reasonable and resource for people new to the field. As you pointed out, there’s definitely value in the anecdotal observations of developers who’ve been around long enough to see some patterns emerge. I love catching up with these devs at conferences, and reading their day-to-day insights on Twitter. This said, those are one-off opinions. Stack Overflow’s annual surveys are rigorously put together by experienced researchers and data scientists. And Stack Overflow’s user base is pretty representative of developers as a whole. They get about 55 million unique visitors each month. Considering that there are currently only about 19 million professional developers on Earth, it’s probably safe to say that most developers visit Stack Overflow at some point each month. I personally took the time to fill out their survey last year, and I imagine a lot of people reading this filled it out, too. We’ve already had more than 13,000 people fill out freeCodeCamp’s 2017 New Coder Survey so far this month, and I don’t think those people are just people who have nothing better to do than fill out surveys. I think they’re busy, but willing to take the time to answer a few questions for the benefit of furthering public understanding of the field through open data. Like with our survey, Stack Overflow plans to release the full result dataset under the Open Database License. So yes, I think this survey represents a pretty representative cross-section of software development as a whole. If you can point to other similarly rigorous studies with large sample sizes, I’d be interested in exploring those findings, too. ", "title": "", "parent": "913", "creatorid": "17756313f41a", "id": "7dceef39949d"}