{"name": "945_1", "child": "", "content": "Basic Income can be understood as democratic seed funding for humanity. It invests in human potential in an unprecedented way, and the returns of such investment can help Basic Income not only pay for itself, but also potentially bring about much prosperity. This is 100%, absolutely, unequivocally, the wrong way to understand basic income. What is surprising in enterprises like Y Combinator though, is their investment failure rate. According to Koltai & Company: “93 percent of the 511 companies accepted by Y-Combinator have failed”. However, this doesn’t really hurt the investment company, because according to a post in Quora: “nearly 75% of the total value of companies they have funded is accounted for in two big players (Dropbox and Airbnb)”. Simply put, in order to be successful and bring in profit, Y Combinator just needs a hand full of companies that they invested in to be remarkably successful in order to come up ahead and make much more profit than what was invested. No. No. No. No. No. Think about that. Y Combinator is a privately held group that has chosen to invest their own money of their own free will and has invested in 511 companies — over an 11 year period. That would be 46 companies per year. That is because Y Combinator only takes 3% of the businesses that apply to them to begin with. You have to submit an application, have it reviewed to meet whatever criteria they have and be accepted. And from that, as you stated, 93% of those fail. When they fail, Y Combinator doesn’t continue to give them more funding. Failure = cut off. Done. If you are going to use Y Combinator as your comparison, that turns Basic Income into the government identifying all of the “poor”, randomly selecting 3% of them each month, giving each of those selected $1 and telling them they have to buy a lottery ticket with that $1. If they win the lottery they owe back 7% in taxes. If they don’t win, they go back to their life in poverty and are ineligible to play again. As a seed investment in humanity, any great economic success would produce revenue that would return to its investors and fund Basic Income. The revenue produced wouldn’t be anywhere near enough to make a dent in the cost of the program. To lift everyone currently in just the U.S. out of poverty you are looking at an annual cost of about $200 Billion (and that is after you offset by eliminating other welfare programs) . To get that as a return at our highest current tax rates you’d need those people to produce a minimum of $5.7 Trillion in annual profits. (profits — not revenue!) To put that in perspective — the total profits for all existing businesses in the U.S. for 2016 is estimated to be right about $15.6 trillion. So, keeping in mind that those in poverty generally have low educational levels, mental health issues, severe/crippling illnesses, are infants and children, etc… and yet your idea suggests that they could manage to produce over 1/3rd of what ALL of the existing businesses manage to produce? Considering Basic Income’s potential to eradicate poverty and the costs associated with poverty and its investment potential, to think that Basic Income will not end up as a positive sum game, we need to have a really dark vision of humanity. Or we’d just need to have some basic common sense and some basic math skills. There are currently some 8.8 million people on the U.S. Social Security Disability rolls. They are collecting SSDI because they are incapable of earning a living. Converting SSDI to Basic Income (Or adding Basic Income on top of SSDI) isn’t going to suddenly allow them to to get a job or start their own business and produce taxable income. ", "title": "", "parent": "945", "creatorid": "590eac58b603", "id": "ed30ea7cba2f"}