{"name": "945_3", "child": "", "content": "As we move into the next quantum shift of our economy one thing becomes glaringly obvious. Employment, as we know it, will never be 100% again. The model of people working for a company manufacturing goods and service in return for wages will be obsolete, if it isn’t already. The new paradigm will involve people earning their living, but mostly in self employment and value added functions for society, not manufacturing or even service. The best way to facilitate this economic shift is to backstop the individual/family against catastrophic failure by setting a floor under them that doesn’t go away, regardless of situations. I would also like to see our government establish itself as the employer of last resort that would offer wages in return for labor performed in community/public service. Not everyone will become their own boss, nor even want to. By offering meaningful employment with normal expectations of the employee a labor pool can be maintained for business without the personal erosion that is inherent in unemployment. Business simply needs to up the ante sufficiently to attract employees from the labor pool and would no longer have the blackmail of poverty at its disposal when negotiating wages and working conditions. The typical argument against such measures will surely arise. “How do we pay for it”? The truth is that we can pay for it by simply paying for it. We don’t have to pre-collect funding for any program that is funded at the federal level. The federal government is the sole issuer of our currency and can “pay for” whatever it deems desirable. Having left the gold standard over forty five years ago our government is no longer constrained in the amount of currency it can create above the tax and fees it collects. In fact, taxes are now a drain on the economy that only serve to guard against inflation, give value to the currency, and “DON’T” fund the government. The sole issuer of dollars doesn’t need your dollars to fund its spending and can never “go broke” as long as its debt is denominated in the same currency. It’s past time that we demand that our representatives come up to speed on the “economy”, and not be obsessed with the budget, which is not the same. Deficit spending by government represents private sector reserves and not some evil that threatens our nation. Paying the debt is no more complicated than paying for anything else for the issuer of the currency, so our disgraceful infrastructure and the misery the present economy is causing is only evidence of the incompetence of our representation, not an economic reality we must accept. The day we balance the “budget” will be the beginning of another unnecessary recession, and the idiots in Washington are getting perilously close to doing just that with their austerity policies. ", "title": "", "parent": "945", "creatorid": "76950183e90d", "id": "9b37136328e1"}