{"name": "954_4", "child": "", "content": "It’s a shame that folks have to write articles like this outlining what should be utterly obvious to anyone who pays any more than minimal attention to politics. Politics = building voting coalitions. One doesn’t allow, say, racists to write their racism into a party’s platform but if mating a liberal economic message that benefits them to an overall liberal agenda gets their vote, who gives a damn about the rest? Racism is a thing to be corrected — the irredeemables are the exception not the rule. Are the salvageable among the bigots going to better learn the folly of their bigotry in a liberal democratic society that frowns upon such things or while living under a protofascist wannabe dictator who exploits their absolute worst instincts at every turn as an integral part of his own political playbook? Trump arose for a number of reason; one was the Democratic party’s embrace of “neoliberalism,” which kept the liberal social views while abandoning that liberal economic message in favor of a destructive rightist one not that different from that advocated for decades by Republicans. Clinton may make the right kind of noise against police brutality aimed at minorities and say she thinks gay people should be allowed to marry — if one (foolishly) believes her on such matters—but she’s definitely going to back multilateral trade deals that export your job and destroy your community. On the other side, there’s Trump, who doesn’t give a damn about social justice but who does rather vehemently promise to stand against the latter, to fund infrastructure projects to create jobs, etc. Voters for whom those economic issues were important could have just as easily been lured to a Democratic candidate but they were given no Democratic option in the general last year. In the Midwest, Trump flipped many of them but many more simply stayed home or voted third-party. And that’s how he won. Sanders would have rolled right over him. ", "title": "", "parent": "954", "creatorid": "5142f1dcd459", "id": "f61f23b2bbfe"}