{"name": "957_3", "child": "", "content": "Danielle, I get what you are saying. I could not march because this is my busiest work time and I am logging in 70+ hours a week, but even if I could have, I don’t know that I would have marched. I love the solidarity. I love the masses all over the world coming together for a cause, but I truly wonder what good it will do. So many of those who marched in the USA could have stopped this situation from happening if they had voted or had gotten over what issues they had with Clinton and her emails and not wasted their votes on minor party candidates who had no chance of winning. I was a Bernie person myself and I am, honestly, not a huge Clinton fan, but I didn’t need to be. I saw that she was the answer to one of the most despicable men on earth becoming the most powerful man on earth. I did not need to be her best bud or agree with everything she said or has ever done. I just needed to weigh my concerns about her against my concerns about him and the choice was crystal clear. I just needed to see the alternative and to acknowledge that everything she proposed was better than anything he proposed. Marching after you were part of the reason we now have such an obscene person as president seems disingenuous. And, I cynically believe that most of the marching women will go home and get bogged down with childcare, eldercare, work, housework, laundry, etc., etc. and will not do one more thing for the cause. I am not dissing those women and their obligations. I know how hard it is to be a working woman, wife, mother, grandmother, caregiver. Truth is we barely have enough time to do what we must do in our daily lives. And, I know that it is wrong we are in these positions. As long as we allow men to have their cake and eat it too, we will be the ones who carry the workload. Why are we always the caregivers for everyone — our kids, our parents, his kids, his parents? Until women stop accepting that they are destined to be the workhorses of domestic life, they will not have the time and energy to be effective in the political world. The revolution must be in our homes and workplaces, not in the streets. ", "title": "", "parent": "957", "creatorid": "e220a80c3389", "id": "e43c6943ff9b"}