{"name": "957_2", "child": "", "content": "GOSH, DO I RESONATE with I’ve already marched. Let me tell you? I marched in state after state for passage of the Equal Rights Amendment to the US Constitution that would make sex discrimination suffered widely by us American females, a Violation of that Constitution. I was faculty at Adelphi University, NY. I would throw my stacked exams under my desk for someone to proctor my students’ work on them and fly out to N Carolina and elsewhere. I did it because, tho just a young professor, I sensed the ERA was The Answer to the indignities, salary losses that I and my female friends experienced. It was hard to do Then. And, it Barely Missed Passing..by just 3 states! 17 years ago, I pitched in for ERA again. THIS time I took ERA on full-time by launching a non-profit named the National Equal Rights Amendment Alliance, 501c3 to get ERA IN the Constitution, for Sure. Only now, it’s MUCH MUCH harder to get activists to call or visit their legislators in 5 states and before Congress (where our own co-created new speedup bill is filed and Sponsored). They’ve been numbed by GWBush’s stance, they’ve all started working 2 or 3 jobs, have children, and my friends from the First Round of ERA — half of them have died ! Strange, because I am definitely NOT a patient person, I spearhead ERA ratification before the Florida legislature (now mostly GOP — they are stubbornly against even allowing a public hearing on it. why? Because they know it WILL pass when they do). Annually, I heavily mentor and assist 5–7 state ERA organizations as we advocate for theirs to pass, too. I have arranged and write the yearly ERA talks in each of Florida’s 67 counties before their legislators. It’s at the same time, both inspiring work AND daunting work. Now, it’s much harder to rouse others to go with me to lawmakers’ offices, or even call them to urge that ERA have a hearing. Even much harder now than before, when the political climate was much better for ERA passage AND now SO, I KNOW what you went through. I did too. And DO it too. At 82 years old now, I handle all the email, our 2PassERA.org site and Pass the Equal Rights Amendment fbk pages, pay all bills via 7 home garden sales/yr, do most of the speaking out in the Southeast USA, DC and NY, and the lobbying/advocating before legislators in Florida’s capitol 6 hours away, sleeping on the floor and eating outta’ my car. BUT IT DOES GET THE WORK DONE..almost ALL our Dem lawmakers cosponsor our ERA ratification bill each year…almost NONE of the GOP lawmakers ever do, politics I can explain if you reply. What I’m getting at is at my ripe old age, healthy and determined, I have repeatedly found that PERSISTENCE WORKS ! Are you interested in checking us out? to see whether you’d be willing to make just 2 phone calls (we give you 2 sentences to say to the legislative aide, and the ph#. couldn’t be any Easier nor quicker). I want to invite you to our evolving site, 2PassERA.org, and send an email to me from there. Would you enjoy considering making Her-story by getting ERA passed into the Constitution that way, or other? to put an end to Sex discrimination? We assist you all the way. I was “just” a housewife and mom when I took the ERA up again, didn’t even know I was supposed to get an ERA bill filed! Do you want to avoid being what you used to abhor (we don’t), that others did not walk with you much? Don’t Go there. Go With US. Please reply with an email from our site, 2passERA.org — it’s evolving. Appreciate your suggestions greatly. Cheers! Sandy Oestreich, founder-president of National Equal Rights Amendment Alliance Inc, 501c3Prof. Emerita, Adelphi U., NYFmr. elected officialCo-author, internationally distributed pharmacology reference textsNationally certified Nurse Practitioner of 35 years; and Clinical Nurse SpecialistMember, 3 Nurse Practitioner professional organizationsHeaded a Free Clinic for Seniors; worked for a NY City Hospital clinicBiographied in Feminists Who Changed AmericaNat’l ERA Alliance, Inc, is a Lead Organization of the nat’l ERA Coalition,Member, national ERA ActionMember, Vision2020, Advisory Board-for women’s empowerment2016 Nominee, “WOMEN’S SUMMIT”, DC2015 Finalist, St Petersburg FL “Best Nonprofit Business”2014 Recipient, AAUW/FL “Woman of Distinction”2012 Recipient, County LWVoters Susan B. Anthony “Failure is Impossible” awardWife and momwww.2PassERA.org (renovation nearly complete — Go See!)  Fbk: Pass the Equal Rights Amendment Twitter: @SandyO ", "title": "", "parent": "957", "creatorid": "1d280ed23f98", "id": "5db0fd54d94e"}