{"name": "957_7", "child": "", "content": "Thank you for this. My heart goes out to you for all the mean comments people are posting. I think it’s mostly that they just don’t understand exactly what you’re saying. Or guilt. As a black woman who has been having the EXACT SAME conversation (literally, same convo, same words) with white women (mostly women) about the reality of racism, discrimination, and privilege for 20 years, I understand exactly what you are saying. In my daily “march” I take a more in-depth, person-centered approach. Explaining to each interested individual 1) the exact nature of the discontent that minorities and other disenfranchised groups have with them, 2) exactly how and why these disparities started, 3) who was at the helm of starting and promulgating them, and 4) what we (ALL) are to become if we don’t (ALL) work — and I mean WORK to change them. At best it would end with “oh, ok, I see. But what am I supposed to do about it?” And as I explained how these things are a mindset that must be changed over time on a person-to-person level by choosing a stance and consistently calling out those things that aren’t right — every. single. time. — I watch their eyes glaze over and realize that their brain has left the conversation and that we won’t get any farther in that moment. I can understand how it angers you. It would anger me if I hadn’t seen firsthand the psycho-emotional torment of having to accept these ghastly truths as truth, recognizing their part in it and realizing what they may have to give up to get what they want. That’s hard for anybody. So I deal with them (and anyone who simply doesn’t know something) with compassion and patience. In all my conversations about this election’s issues, I knew they weren’t hearing me, and that too many would passively allow this to happen, and that after it happened it would be too late to change it. Sometimes it takes more than your voice for people to hear you. I knew that it would take this happening for them to hear. So I let it alone. And it happened. And they’ve heard. While it’s too late to change the presidency, it’s not too late to change the hearts and minds of people. I wasn’t going to march either. Then I did. And I’m glad I did. It was a beautiful showing. But until we do some real work it was just that — a showing. So, you, lovely, you rest. Real work, like winter, is coming. And we will need your energy, strength, compassion, and love for the tough times ahead, Warrior Goddess. To fight ignorance and injustice with understanding and unity. ", "title": "", "parent": "957", "creatorid": "185919c39b19", "id": "45892b4ee26a"}