{"name": "968_10", "child": "", "content": "Resistance is an Act of Hate People resist things they hate. They are more likely to resist green beans, asparagus and broccoli (I love Veggies) than resist Ice Cream, cake & cookies. People resist things out of hate. They resist cleaning & working. When you turn on the phone or the news or open the paper to take in the Media telling you about a perceived assault on US and ignore reality, you continue to grow that hatred that you have come to need (like a junkie in West Baltimore). You have no need for the morning coffee, you are working off of the adrenaline of hate. You look at the nominees for the President’s Cabinet and see what you despise about them rather than what they may bring to the Administration and to US. Then you continue your day listening, reading & watching the same media that has been lying to you the whole election cycle. You work yourself into such a lather that there is no room left in your soul for reasoning, logic or good sense. The call for Impeachment started before Pres. Trump became President. Pres. Trump’s so-called failures are similar in merit as items of other Presidents, yet Pres. Trump is evil. For eight years I heard how the world was going to end under Pres. Obama. For eight (actually about 6) years, I heard how Pres. Bush was bringing about WW III. Under both administrations we saw the Hitler references. The nooses. The Kill, Impeach, and the worst President Ever mantras. I expect we will see the same for the next 4 (or 8) years. I completely understand your points and how you came to them. Unfortunately, you are saying what you are saying based upon lies and misinformation that is constantly in our ears. Not only are there multiple 24x7 news channels, there are 24x7 hate sites, there are 24x7 misinformation/partisan sites, there is Facebook, Twitter & a slew of other Social Media that people are constantly glued to. I love how so many in MSM and Social media were in love when Pres. Obama took to YouTube for his weekly message, were in love when he started using Twitter and Hate how Pres. Trump uses Twitter to produce daily messages. The content could have been near identical yet the spin-meisters are lying to the folks who are too lazy to find the truth. ", "title": "", "parent": "968", "creatorid": "dce92b3c1d1", "id": "ccb378db058"}