{"name": "995_1", "child": "", "content": "imagem: ensiguarda.pt O aprendizado da escrita Uma volta no tempo Despertou a minha atenção os textos diários que subiam na página principal do Medium, sempre padronizados, com um design limpo e sofisticado. Ali os textos eram diversos, sem nenhuma linha editorial específica, escritos \"da forma que se fala\". Então fui ver quem era o autor: Lucas Ramos, e descobri sua resolução para 2016: um texto por dia. Ler os textos dele têm uma função didática: você saberá linearmente em qual dia do ano de 2016 está! Além disso, tive uma boa regressão e talvez seja a experiência de várias pessoas. Cursei História e a carga de leitura é alta. São textos diversos, sempre macambúzios e sorumbáticos. Os dois primeiros anos geraram uma sensação horrível, porque era necessário um dicionário do lado para que pudesse compreender as palavras. Minha produtividade de leitura era baixa, pois não entendia os textos. Eu usava aquela adição \"completa\" do Aurélio, tamanho gigante, capa dura. Até hoje não dispenso a companhia do dicionário, mas uso o dicio.com.br (mesmo assim, algo escapa). Mas ainda lá percebi como me fez bem essa rotina. Sempre gostei de escrever crônicas, e não tinha dificuldades na escrita. Mas o efeito colateral da leitura acadêmica acabou comigo. Não conseguia escrever, meus textos perderam coerência e coesão, algo central na escrita. Até eu mesmo não acredito como meus professores entendiam minhas respostas. As provas em um curso de história são horríveis. Geralmente são duas ou quatro perguntas e você tem que escrever no mínimo duas laudas de papel pautado — lembram dele? Os historiadores escrevem muito mal e muito (dá para perceber, né!). Vejam o grande Eric Hobsbawm: sua escrita é numa espiral, o assunto não progride. E este é o padrão. Para piorar, os profissionais da área não reconhecem isso — provavelmente serei massacrado por criticar a escrita do bom Hobsbawm. Quanto terminei o curso, em 2000, tinha um problema: meus textos. Como ser um profissional desta área sem escrever bem? Não há sobrevivência. No meu caso era essencial, porque me tornei consultor em um nicho da Comunicação Corporativa, pesquisando para escrever livros institucionais e para montar museus corporativos — também conhecidos como centros de memória. Assim, tive que contratar um profissional das Letras e pedir para me ensinar a nossa língua. Colocar tudo em ordem, explicar o sentido das palavras e da construção de textos. Os resultados vieram, mas levou um tempo. Na verdade, anos. Aprendi muito com a Camila Dalvi, que teve paciência comigo e desenvolveu um curso sob medida. Depois, com os redatores com quem trabalhei, aprendendo os macetes de textos longos, vendo-os escrever. Fazia uma base (pauta) e eles trabalhavam por cima dela. Foi interessante o retorno deles, dizendo que era fácil produzir com o roteiro que criava. Além disso, era com a minha base de informação que os designers desenvolveriam o projeto gráfico, logo, precisava ser preciso para interagir com profissionais de outra área. Só mais tarde me lancei aos meus próprios textos. Por último, depois que saí do Brasil, resolvi escrever para um público indeterminado, aqui no Medium. Uma nova experiência, ainda em processo de aprendizado. Se você quer escrever, recomendo uma iniciativa como a do Lucas. Se o seu problema for grave, como era o meu, busque suporte com um profissional das Letras. Esteja aberto às críticas, pois elas ajudam muito. Claro, busque leitura de qualidade e diversificada. Pratique, pratique e pratique. No mais, deixe o tempo e a criatividade fazerem seu trabalho. ", "title": "", "parent": "995", "creatorid": "a2288f576d16", "id": "353be5ba3d86"}