{"name": "997_4", "child": "", "content": "Normally, I really like and more than appreciate your content, Larry. Alas, in this instance, I’m afraid it is misleading. LinkedIn data you provided is at least a year old (a re-post, perhaps?). About a year ago, LinkedIn radically ruined their already faulty algorithm. (Not that it ever reflected accurate numbers of post views and likes. It’s a long, sad story; suffice it to say there’s plenty of proof, albeit scattered over hundreds of posts by Pulse power users, better known as Unfluencers™, focused on that issue at the time. Unfluencers promptly created a LI Group to combat that sudden and appalling lack of mutual notifications among the 1st level connections, but to no avail). Other Pulse authors too soon started noticing that their metrics dropped by a factor of ten on average, although they hadn’t changed their writing styles or their use of blogging techniques that — SEO-conscious — you opt to call “hacks”. To cut the long story short (as it is going to be laid out in an upcoming book, called “Linkedin Lost”, for those who want to know more) no person should waste any more time on Pulse as a blogging channel. The actual window to achieve some visibility on Pulse was brief and it has ended. As of December, LinkedIn worsened the situation with a new user interface, which is detested by most regular users, as evidenced by thousands of negative comments they keep posting about it. The general mood of late has been: “LinkedIn, I’ll pay you to give me back the old interface.!” It’s a real pity, but such are the times we live in. Panta rei, and with a head-spinning speed, I might ad. Medium is the new Pulse, and on merit. And you might want to try beBee, a Spanish social delight, with a superb publishing platform and indescribable camaraderie among its fast growing user base. You’ll never look back. Kind regards. ", "title": "", "parent": "997", "creatorid": "abad06ef5ed1", "id": "a19706f52170"}