{"name": "998_23", "child": "", "content": "Very interesting piece. I have been writing on Quora for a bit over 2 years : https://www.quora.com/profile/Robert-Lopez-39 I have about a million views, and about 4000 upvotes. I started small, just answering a question here and there, not even trying to write, just sort of answering what I knew or giving my opinion on certain topics. I remember getting mostly one or two upvotes per answer for months until one particular one got like 20, eventually growing to about 40. I was pleased someone had liked what I had written, especially since my answer was against the grain. The second time that happened I was also the one who wrote a completely different answer than most, and it became my most popular answer for a while. I had no plans to start writing, in fact, although I had flirted with writing once in a while, I don’t think I was very good at it. Somehow years of practice messaging with friends, telling stories in emails, and answering customer service emails must have changed something. I started answering questions about how I liked certain movies on Quora, and that turned into an idea to try and write movie reviews on things I see. I did that for about 6 months on Quora, then started to copy those reviews over to Medium. I had already commented on various stories here as well. Eventually I decided to start a movie blog, since a lot of what I see is weird and not common, so I knew I would sometimes be one of only a few people reviewing some odd film from years ago, or just released. The first 6 months on my blog I ended up with over 10,000 views on about 70 reviews, which wasn’t bad in my mind (I have no clue what success looks like in blogging). On Quora my top upvoted answer is about weird animals with cute pictures, so I almost don’t count that one even though out of 100 or so answers mine is in the top 10 with 600 upvotes. My top viewed answer, with the second biggest upvotes, is this one :  I have about 40,000 views on it and I am getting close to 200 upvotes. I am especially happy with this one as it is basically the kind of question that you can answer in a couple lines, but I added some very personal experiences in it and people really seemed to enjoy it, even though it is overly long. Plus it depicts a really nice moment in my life. Most of the other Quora answers may have some good view counts in the tens of thousands, and upvotes in the ranges of 5–150. I tend to look at each one as a success if I end up in the upper half of the upvotes, meaning if there are 20 answers and my answer is at least in the top 10, I feel like I am doing ok. On Medium it is a complete different story. I get little traffic there, next to none. I tend to get about 100 views a month, every month. Granted, I know I do not write as much here, but somehow my views here are much much smaller than my blog and on Quora. The one exception was this piece which I wrote exclusively on Medium : An open letter to Drake, DJ Khaled, and the rap worldIn some ways I am an old fashioned kinda guy. Being in a car has always meant listening to the radio for me. In fact…festivalpeak.com I NEVER expected this to be read by anymore than a few people at most, and I literally wrote it to stop myself from obsessing over something small that annoyed me. I thought it was mildly amusing when I wrote it, but since I have no real writing background or understanding of what constitutes a good piece, I basically wrote it like everything else I write, just for me. A few days went by and someone approached me about putting it in their publication on Medium, and that had happened once before, so I knew how that went. Other publications do that when a story is new because only one publication can get the right to do that on Medium, though you can swap to another publication if you want at any time. I checked on my stats, and saw that about 40 people had read it. I was surprised, but happy. A bit later I checked to see if he had posted it, and if others had read it, and it was up to 80. A few minutes later, 150. Then 300, and so on. Within a couple hours it had 1000 views. I was shocked! Meanwhile, the publication had not even posted it! So I went out searching for why people were reading this and I found the referrers link in the Medium stats. Turns out some popular twitter guy linked my story and urged people to read it all the way to the end. I also found it posted on a few websites as well, including one that was specifically for articles on music that people thought were horrible, which amused me to no end. It seems like some people did not understand the tone of the article and took it WAY too seriously, when the whole thing was written tongue in cheek. A couple days later, after the views died down, I saw another uptick. Checked my referrers, and found out that complex.com wrote an article on MY piece! Same day or so bet.com did the same. Amazingly 2 other writers most likely got paid to write an article about my piece which I wrote for free! But such is life. I ended up with over 4000 views and over 2000 reads, which is success for me on Medium. I have yet to see anything near that on Medium, though I have slowed down on the writing at the moment, as real life sometimes takes over and requires me to work and take care of myself. All in all I found your article to be very interesting and shows me how much more there is to writing, since there are a few pieces of information you mentioned I have never even heard of. I look forward to hearing about your 3 month results. ", "title": "", "parent": "998", "creatorid": "267263b55cfb", "id": "62bc3dd47ba2"}