{"id": "743e2f1deeeb", "content": "Great Article Sebastiaan, you know — it’s your and Bjorn’s total Apple fanboyism (for lack of a better word right now) that finally got me into Macs. Having been an avid PC user (and builder) for years before that. Although I joined the party a little late, it seems. After having purchased an iMac and buying the ill-fated Mac Pro halfway through 2014 when signs were there this machine wasn’t going to be what its predecessors were. Still. I actually like the small form. Yet, the lack of updates had got me scratching my head. I jumped on the bandwagon a little bit too late, though I love the Apple universe (I have one of almost every device) it just doesn’t come near to the raw power of a PC (of which I also still have one). My six-year-old PC-beast has a new GTX 1070 and is purring like a kitten fully stocked with RAM, even though the CPU and mobo are ageing. The case they’re in is large and roomy and the power supply is so massive I worry I’ll pop a plug when I turn it on. Still. It runs Windows 7 because it had been mothballed too long and I missed the free update to Win 10 window (haha, Windows-window, get it? Yeah.) And it has always felt… clunky. Cobbled together and barely hanging on, somehow. Although you can fiddle with just about everything, everything can break it, too. At friends’ places who do have Win 10 I can’t help but go “egh, Windows” how I do not miss that temperamental thing. The blue screens of death and inexplicable hangups when a deadline was looming drove me towards Apple. And I ain’t going back to the insecurity of my Winblows machine. I loved it to bits and it’s a fantastic games console, but too much is at stake right now for me to switch back to it. I do wish the new Mac Pro will be freaking awesome. An amazingly modular system that can grow along with hardware trends and look good — but pragmatic — whilst sitting proud on or under my desk. My trashcan puts up a good fight, though. Luckily I focus on 2d illustration and animation — nothing too processor or GPU intense. However expandability is something I’ve started to crave more and more. If Apple does not deliver in 2018 I’m afraid I might just have to jump off the bandwagon. And go back to fearing the BSoD, frantically backing up everything and renewing my virus scanner subscription. Egh, Windows. ", "creatorid": "d2b7c6ea4832", "title": "", "parent": "9", "child": "", "name": "9_1"}