{"id": "a35f99ea4b44", "content": "May I bring up the giant penguin in the room that no one’s talking about? I was a devoted Mac-based graphics and media pro for decades. I even had a Macintosh clone during the Gil Amilio days. Remeber “Power Computing?” the Mac clone with better hardware than Apple was selling at the time? Yeah, good times.  I had a G4 with it’s AMAZING mother-board-on-the-door design. And I got one of the first 100 G5’s off the assembly line. They included a note in the box saying so and a humongous poster of the type they hung at Macworld Expo. Then.. I bought an iMac in 2009 with a > $300 ApplCare plan for roughly $2000. After less than a year, the OEM Video card died as the result of bad manufacturing and Apple announced a recall. I took my iMac in and they declined to replace the recalled card and voided my AppleCare plan because of a scratch and tiny ding on the aluminum body. The Video card, woefully out of date even when the iMac was brand new could only be obtained from Apple via an authorized service center and only installed by them for a total of $700. Screw Apple. Back to Windows? Oh hell no. A friend of mine had a 15 year old PC at home that despite being a dinosaur, ran surprisingly well running… wait for it… Linux. Specifically Ubuntu 14.04 I think. After a little googling, I decided I had nothing to lose trying it. I bought a $120 motherboard, an intel i5 CPU, 16 GB of DDR4 RAM, a power supply and an ATI R9 GPU. The GPU was by far the most expensive part at about $300. So for around $600 I built a machine light-years ahead of Apple’s current iMac offerings. Having never built my own PC before, i was a little apprehensive. The instructions supplied by Asus with the motherboard were clear and easy to understand. (pictures. Lots of pictures) Other than socketing a CPU being easy but never the less a little nerve-wracking, it was assembled and I had it in the BIOS menu inside of 20 minutes. So. I popped in the Ubuntu “Live CD” and booted into it. (actually Kubuntu, but more on that in a second) One of the beautiful things about Linux distros with “Live CD”s means that you can boot into it and actually use the OS right off the optical disc or thumb drive to try it out without even installing it or altering one sector of your hard drive. It’s a great feature that doubles as the best “rescue disc” there is. Can you imagine running your Windows PC off JUST a DVD (no hard drive need even be mounted?) As if. I was sold on performance, stability and price. The question was, “What about my pro-graphics workflow?” This took a little adjusting, but once over the hump, i’m in all the way. Creative pros, can we talk for a minute about our unhealthy and co-dependent addiction to Adobe products? Anytime a Linux person mentions GIMP, Inkscape, Blender (and to a lesser degree Kdenlive and Lightworks) Adobe addicts invariably roll their eyes and drone on about “but everyone in the industry always…” or “I don’t have a choice, I’m a pro” . Just stop. I used to say in interviews without a shred of insincerity that Photoshop and Illustrator were like “extensions of my left arm.” Except that Inkscape .92 has surpassed Illustrator in features. SVG is web standard and the .svg file are also valid human-readable xml. That’s right you can create vector illustrations and animations in Inkscape’s native format with a text editor. I moderate Google+’s Inkscape group. Not only is the software Free (as in freedom and beer) but learning it is free too. The community is overflowing with talent an innovation and the door’s always open. Try showing up at Adobe to discuss features and bugs and see how far that gets you. Withy Inkscape you can add yourself to the dev mailing list and get involved. Cost.. $0 GIMP get’s dissed a lot by people … who don’t use it. But everything that applies to Inkscape applies here too. GIMP is even using advanced GPU accelerated add-ons now too and as a result the plug-in library for GIMP would make Adobe jealous. I used Photoshop in it most advance capacity which is manual stripping of color separations for more than CMYK. GIMP has achieved feature parity in this regard. Again all of it free. Blender. Oh Blender. Steep learning curve, right? Sort of. Blender is a great package and the pace of development is brisk to say the least. Head on over to the G+ Blender group and have a look-see. I’m a convert from Cinema 4D (which, I’m told runs on Linux via WINE) Blender is growing on me rapidly. The low bar to entry and the sheer volume of incredible free (as in beer) learning resources are truly inspiring even just on their own. LibreOffice. ‘Member when Microsoft poached a bunch of Apple devs and released the Mac version of Office that was by Microsoft’s own admission better than the Windows version? It seems that Office is one of those rare Microsoft things that even Mac people like. Well, OpenOffice became an alternative for Linux (and other OS’s) but when Oracle acquired it along with Sun Microsystems, they neglected it. So, FLOSS being FLOSS a group of devs forked it and began developing LibreOffice from the same codebase. Fast forward a couple of years and LibreOffice is a fearsome and qualified drop-in replacement for Office. Try it. It’s the one thing that surprises new people the most about FLOSS. Video editing is still lagging a bit. There are, however, NON-free/libre pro editors like Lightworks. And FLOSS ones like Kdenlive. Kdenlive was almost orphaned a couple of years ago. Apple’s neglect of their pro line is partly responsible for breathing new life into the Kdenlive project which now exists expressly to provide pro-level alternatives to commercial solutions like Avid, Apple and Adobe. And they are driven. In conclusion. Windows is not the only or even best alternative to Macintosh. There are distrobutions of linux to suit nearly every style, experience level and use-case. Ubuntu GNOME (Ubuntu + Gnome desktop)Kubuntu (Ubuntu with KDE desktop) Linux Mint (We like to say “mint for your mom”) — good distro for really really non-techies. No need to fret over which one.. try em on their Live CD without installing and see which one suits you. Take the leap to Linux ", "creatorid": "21c582dbfd32", "title": "", "parent": "9", "child": "", "name": "9_10"}