{"parent": "1032", "title": "", "id": "30e122585139", "name": "1032_9", "content": "To developers using pixels because it makes their life easier, the web would be a more inclusive place if your decisions prioritized user experience over whether or not you, or your preprocessor, fancy some division. Yes modern browsers now scale type that is set in pixels. But why? Because so many developers set type declaratively with pixels that it basically broke the internet. So yet again, we collectively as an industry made poor decisions that forced browsers to change for the worse. (You can now no longer declaratively set type to *always* be a certain pixel size, which was the whole point). I’d encourage you to look into WCAG 2.1 success criteria. Sites need to remain legible when scaled at 400%. And I think you may have overlooked one solution for how people scale and alter text on websites: user agent sheets. It is very easy to scale a site’s type with a user agent sheet if the site uses relative units for sizing type, etc. Just body { font-size: 400% !important; } > It assumes that you want to increase/decrease all text on your site at the same time for a given breakpoint. That is exactly what a user using a user agent sheet could be trying to achieve. Again, we’re thinking about ourselves over the user here and this is problematic. Maybe they don’t want to zoom their website everytime they visit a new website. Maybe they prefer user agent sheets over browser preferences because they have all their browsers mapped to the same sheet, where they also are overriding things like font-family and colors, maybe removing transitions, to further accessibility for them. > #2 Breakpoints scale when you use rems/ems Exactly. This is the expected behavoir if you want your site to scale in accordance with WCAG when users increate font-size as another means of zooming in their sheets. ", "creatorid": "b5cd7146107", "timestamp": 1491507906214, "child": "", "username": "jpdevries"}