{"parent": "1050", "title": "", "id": "e5ee2257fa8f", "name": "1050_2", "content": "I say this as someone who has been a JavaScript developer for about 10 years so please keep that in mind… The JS community mind-set is f**ked. Everyone seems to be obsessed with creating new JS tools and frameworks and libraries. However, these don’t help us solve Business or Domain problems, they only create new ones for US to solve. What was wrong with Backbone? Nothing, but now you’ll get laughed out of the conference room if you suggest going with that. Want to go with Angular? Great! Which one? Because 2 means that you need to know Typescript. What’s Typescript you ask? Well some people thought that JavaScript being dynamically typed wasn’t good enough so they needed it to be statically typed (sort of). I get that in every profession you always need to keep up with new technologies and you have to keep learning, but in the JS community it’s not the right kind of learning and keeping up. If you compare it to being a Doctor, it wouldn’t be like they’re learning new ways to treat cancer it would be like they are having to learn how to use a new kind of scalpel and if they prefer the old one then they are a quack. Furthermore, our over-reliance on gigantic toolchains only hurt us in the long run. Our goal as Programmers are to manage and minimize dependencies, not create unnecessary ones. This isn’t specific to the JS community either, I’ve seen Gemfiles that require multiple mouse wheel scrolls to get through. What we get are applications that we don’t really understand and can’t reason about. I’m not bashing the author of this article and I applaud her efforts in learning JS. My point is that as a Developer community, we shouldn’t be just accepting that we have to learn all of these new tools just because they are the “hip” thing to learn. The work of Developers are always in service to other communities and to society in general. Our work shouldn’t be just creating new frameworks for the sake of creating them. ", "creatorid": "19c2723c6f61", "timestamp": 1490890986710, "child": "", "username": "donniemarges"}