{"parent": "1059", "title": "", "id": "b995692991e3", "name": "1059_9", "content": "Interestingly, Don Rickles was where I first noticed the ‘PC culture’ had taken over. No, seriously. He hadn’t been doing much TV for a while but appeared on (of all things) a daytime television chat show. It must have been around 1990 He had a solid welcome but it seemed to me most of the people in the audience were too young to know who he was apart from maybe his name. “Look at all these beautiful faces” and soon a joke about Frank Sinatra and the mob gets a few laughs. A few zingers about Las Vegas and some good laughs return. A minute in and “Oh, I see one black guy up there in the audience… oh no, I forgot to lock down my hubcaps!”. Audience seems confused. “Great, I just gotta make sure I get to the parking lot before he does!”. Audience quiets down substantially. Except one person is beyond thrilled and its the black guy. He’s roaring. “is that your wife sir.. or is she your ‘look out’ while you steal the cameras from the studio?”. Now the black couple is folding over in laughter. And notably, the one thing outstanding to me is the ‘Yuppies’, the young white urban professionals, the suburban folks in the audience haven’t just stopped laughing but are folding arms across the chests and expressing disapproval. Rickles moves on. “Oh look some Orientals.. are you here for the show or just delivery the flied lice?”. The Asian couple isn’t just laughing but the husband is delighted with this! “Hey, do you know any good laundrymats?”. They love it and… now almost every other white person in that audience is showing active disapproval and even ‘outrage’ on their faces, arms folded even tighter. Who else have we got here today? An Indian man is literally trying to wave and stand and point at himself and Indian friends as if pleading to be next. The black guy is almost crying from laughter, the Asians are still recovering from laughs. The ‘politically correct’ yuppies were absolutely silent and showing displeasure. I don’t think I ever saw Rickles on a daytime show again. It was the first time I realized something had changed. I also sensed this was going to be a problem. ", "creatorid": "e85e4aa990f9", "timestamp": 1492334415648, "child": "", "username": "trumpthepanda"}