{"parent": "1069", "title": "", "id": "380eeb24b593", "name": "1069_9", "content": "These protests are nothing compared to the thousands of residents who came out to town halls to protest the Obamacare law Democrats were pushing. And the difference is shocking too. Today we have Liberals just screaming to scream, not even trying to listen to the explanations offered, they are just filled with hate and refuse to see anything other than their hate. Back when it was Democrats getting an earful from residents there was no explanation, people were told we had to pass the law to find out what was in it, and all of the early promises were broken. Obama and Democrats did not keep a single promise they made in reference to passing Obamacare. You can keep your doctor is you like them.You can keep your insurance if you like it.The average family will see a $2,500 per year reduction in policy costs.Medical care costs will go down.Nothing will change with your existing employer based healthcare.No family making less than $2500,000 a year will see any form of tax increase.Will not add a single dime to the deficit now or in the future.Protect Medicare.Cover every American.More choice, more competition, lower costs. There are a lot more but I decided an even 10 was optically pleasing. The cold hard reality is, Obamacare failed in their number 1 objective, to get everyone into the game. Obama said all along the success of Obamacare and exchanges depended on getting the young and healthy into the insurance pools to help subsidize the sick people. Today most of the voluntarily uninsured is still about the same as it was before Obama took office, and that is because the penalties are much cheaper than the insurance and if you make sure you never overpay your taxes, there is no mechanism for the IRS to actually collect the fine. All of the things Americans actually like about Obamacare can be accomplished with simpler and less costly measures. But the exchanges are done, they will die even if Republicans and Trump take no action at all. We have to face facts, the exchanged were doomed to failure before they were started. ", "creatorid": "8f86e30254bf", "timestamp": 1487858011335, "child": "", "username": "louisweeks_16301"}