{"parent": "1088", "title": "", "id": "e76aefca24ed", "name": "1088_10", "content": "While I think the proposed Republican healthcare bill is as bad as the ACA, the arguments in this article seem flawed. There are so many variables that influence mortality rates year over year including the weather that I don’t know how a study was able to isolate the variance and attribute it to the pre ACA Massachusetts health care program. It reminds me of the study that showed health care costs were increasing at a slower rate after the ACA was initially passed. Those same studies failed to note that blockbuster drugs coming off patent accounted for 100% of the decline in health care costs and had nothing to do with the ACA. Yet ignoring other factors, one could say that health care costs did go down in the initial years and that would be true. If one said, the ACA accounted for health care costs going down, that would be a lie. I sense a similar problem with this study. But studies like this go to a deeper problem. I am very distressed to see Democrats clinging to a flawed health care reform effort and Republicans embracing an equally flawed alternative. If the goal is to make health care available and affordable, there are two different sets of issues that need to be addressed. The first set of issues relate to how do we reduce the amount of health care Americans consume and the price they pay for it without adversely impacting outcomes. I am talking real costs, not the shell game played by the ACA that hides costs through a complex maze of taxes and subsidies. Lower health care costs could free up a lot of money that could be used to solve the second set of issues. The second set of issues relate to how do we make health care affordable to those that cannot afford it and available to those that would not normally qualify for health insurance based on a pre-existing condition. No matter how you dice it, if you want to achieve the goals of affordability and accessibility, there will be “subsidies” involved. The ACA really targeted these issues, but by doing so little with respect to the first set, health care costs skyrocketed and the price of subsidies skyrocketed so much that what was sold as “budget” neutral is now expected to cost more than $1 trillion dollars over the next 10 years. I ask you to demand health care reform deal with costs and not just affordability and accessibility or eventually you won’t have either. Don’t let the Republicans and Democrats play a “shell” game with health care costs. Instead demand legislation which drives the “real” costs down. For solutions check out my other articles on health care. ", "creatorid": "c9bf264df1b4", "timestamp": 1489538882066, "child": "", "username": "michael.schundler"}