{"parent": "1120", "title": "", "id": "aef07fed338f", "name": "1120_13", "content": "Maybe it’s time for you to actually do real charity work my friend. With people not having internet and regular hot meals. It’s not about buying somebody a house, it’s about doing the simplest of things like sitting down with a welfare couple and simply listening to them. With them, stock broking fees and your miserable money troubles is something abstract that don’t exist. They don’t want your money. I was feeling miserable as well the minute I started to make more money than needed, and I stumbled on a welfare couple I didn’t knew. I don’t know why, but I gave my number to the guy and since then I help them with very simple task, like repairing their old TV, faxing stuff, buying them some food once in a while, seeing them at hospital just to say hello, etc. You’ll find out it’s never about the money, but about being a human helping another human. The important thing is to just let go of social “cast” — like forget to think “oh, she doesn’t know I have millions, that I’m that important”. Your money doesn’t mean shit if your unable to leverage your altruism, for free, without any return of investment in time. Poor people also want to help, but just not with money. Let them help you. This welfare people bought me spaghetti pasta and a Duncan Hine cake to say thank you for helping them fixing Christmas lights and showing them how to make a budget (they were drown in phone bills and eventually got out by themselves) — just say thank you, even if you feel it’s dumb, it’s not. This is the real redistribution of wealth, helping your neighbors without them asking, just a little bit at a time. You’ll grow even richer on the human side. And don’t need to do this all the time, a simple hour from now and then. A drop in the ocean that makes a difference for both you and them ;) Cheers ", "creatorid": "312a205c14fa", "timestamp": 1488035051507, "child": "", "username": "king.demoiselle"}