{"parent": "1133", "title": "", "id": "da4d6efa6532", "name": "1133_3", "content": "I’ve been thinking about this since the first post last week. I think there might be two different levels to the “debt vs liquidity” question. One level is the one you’ve been grappling with on Billfold: the level where someone already has some wealth accumulated and is looking at different options for building it, which might include taking on new and more debt. As you’ve pointed out, that perspective may not necessarily feel relevant to a lot of typical people. There’s another level, though, for people who are on that pathway of having some debt and thinking about how to structure paying it off — like people may age who have some student loan debt, maybe a car loan, maybe some credit card debt, and maybe a mortgage (in certain markets and for some people, it’s still within reach!), and also maybe starting out with saving in a 401(k) or an IRA. We have the question of what our monthly spending & saving should look like, and then what to do with any extra cash we may have. Emergency fund? More retirement savings? Pay off debt faster? One piece of the equation is how to make your money work for you — I have a really low interest rate on my car loan, so that I’m better off saving extra money elsewhere and just paying off the loan on the regular schedule. But the other piece of the equation is liquidity — how to make it through lean times by not having spent/stashed money in ways where you can’t get it back. If I threw all my extra cash each month into my car loan, or into my mortgage, but then I get laid off, they’re not going to let me take a break and skip some payments (depending on the terms of a specific loan). If I’d saved it in an emergency fund instead, then I have it on hand. I might end up using it to pay off the same loan I would have, anyway, but I’ve got flexibility. So the benefit of liquidity isn’t only when taking on an entire mortgage or using it as a wealth-building strategy. It’s not only for the rich. It can be applicable to an extra hundred bucks a month. ", "creatorid": "5ab317582854", "timestamp": 1490632302589, "child": "", "username": "amartin10"}