{"parent": "1138", "title": "", "id": "f3b799024cf2", "name": "1138_12", "content": "There’s no one right answer to the eternal question of joint vs. individual finances when you are in a long-term relationship / marriage. The best advice is to work all this out before you entangle your finances. Discovering after you’ve joined your financial households that you treat money differently is messy and contentious. If you are open with each other, and have similar spending styles? Joint all the way; it’s more convenient and flexible, and reduces the amount of things to keep track of. Having differing spending styles isn’t a dealbreaker if you work out how finances are going to be handled and who is going to be responsible for what ahead of time. How do my wife and I do it? Necessities like monthly bills, utilities, gas, groceries, etc. no discussion necessary. For discretionary spending, we agree to get the other’s buy-in on anything over $50. Of note here that not once, in seventeen years of marriage, has either one of us ever said “no”. Are we mind readers? Nope. Permissive just to avoid disagreement? Wrong again. Instead, the very act of getting permission to buy something leads to self-filtering when you can’t come up with a good way to ask that doesn’t sound stupid. (And this $50 limit hasn’t actually changed this entire time, even through inflation and increases in household income. And yes, it would be possible to work around that limit by buying a bunch of little things, like clothes, that quickly add up, but if that’s the way either spouse treats rules they’ve set up for each other, there are bigger problems than finances.) And beyond spending? I’ve always handled the investments (I’m good at it, she has absolutely no interest in it), she’s always handled the household bills (she owned a house before we were married, and she’s continued this role even though we now own a house we bought together), credit cards are informally split. We have separate checking accounts out of sheer inertia, but freely pass money between them as needed, and the statements are an open book, so they might as well be joint. All major assets are joint. Individual accounts for protection aren’t necessary if you are open with each other. (But yes, if you can afford it, each spouse should have sufficient insurance to handle the death/disability of the other. Even a non-working spouse should have life insurance if there are kids involved, because expenses like child care will go up if the non-working spouse dies.) ", "creatorid": "cc82d0a49a22", "timestamp": 1483092912920, "child": "", "username": "p.mescher"}