{"parent": "1138", "title": "", "id": "baf69f4d021e", "name": "1138_4", "content": "My wife and I trust that our marriage will last forever. I certainly don’t have any inclination on leaving her and one of the first things I showed her after we got engaged was my credit history. An analogy to this might be the full blood checkups I demanded before becoming serious and moving in with each other. She also can’t imagine a scenario in which she would ever leave me due to my No Secrets policy in our relationship, we have no prenup, and 90% of everything we make goes into the family bucket. That said, I encourage my wife every single month to maintain and check the health of her personal account. I show her my “off limits to you!” bank statements, she shows me hers, and in a way it gamifies our radical transparency to see who’s a better saver or who’s better at enjoying life. No judgements. No secrets. Your money is yours. No control over each other’s decisions. Who am I to tell my wife that spending on a spa session is stupid when I know she’s stressed? Who is she to judge me for buying the expensive tech or food when I work so hard? But we’re in this together so family money still needs to exist. Simple rules have kept us sane: No secrets. None.No passing judgment on each other’s spending unless it’s in good fun. “Gosh you saved so much this month! Go get a massage! Go buy a $50 meal! Buy a few movies. Come onnn!” are much better than “Wow you’re bad at money.”Assume we’ll part due to death and/or divorce and/or alien abduction and have personal safety nets in place.NO secrets. NONE. If I’m unable to attain radical transparency with my wife then it’s an indication that we have trust issues we need to sort out. Your terrible experience warrants your response. You must protect yourself and I applaud you for being so raw and open about it. Better safe than sorry. There’s little worse than a person who feels powerless due to the reckless financial behavior and lies of their spouse. My hunch is that you’re not the type of person who wants or assumes that things will fail. You’re simply someone who’s learned an incredibly important and uncomfortable lesson and who has adapted to her reality. As a man I say all women should have a Plan B or Plan C. Whether or not you choose to share that is up to you, but to ignorantly and blissfully pretend that Plan A will never go south is a horrible mistake. Kudos to you for having your ducks lined up. Thanks for sharing your story. ", "creatorid": "bf68ef6c58f1", "timestamp": 1483068427005, "child": "", "username": "philip_arthur"}