{"parent": "1144", "title": "", "id": "24c7db3ba785", "name": "1144_1", "content": "Dear Gabe, Thanks for casting some fact-based light on this shady episode. I — and I am sure I am not alone — was shocked and outraged by the police officers’ servile compliance with United’s employees call for removal and their senseless handling of the situation. But in the same time, as an on the spot video is seldom complete, therefore may be biased, I was not 100 % sure of my objective appreciation of the situation. It’s a relief to know that the passenger was right. I hope he heals quickly. Emotionally, in particular. However, in my opinion, there is at least one fundamental aspect that has not been thoroughly examined. As a Business Communicator, I am equally outraged at the way United’s staff and executives and airport police authorities behaved after the fact. They ducked and hid instead of coming up in the open and making a clear and sincere apology. In the end, United bought the peace. They should be ashamed! From their behavior, I get a pretty good idea of the profile of PR Vice-Pres they hire: it’s the type who only checks the stock market ticker before giving an advice. The type who basically does not care if his/her fat pay-check basically comes from real flesh & bone (& mind) people relying on their company for a service they are unable to provide for themselves, as long as it shows 6 digits, is way above the average passenger’s pay-check, and the Pres rewards them with a good annual evaluation because of their own servile compliance. For as long as airlines continue hiring or relying on such blind, foolish and coward PR counsellors and execs, we will continue witnessing after the fact damage control instead of intelligent, sincere and proactive human relations. We will continue to see artists compensated for their broken guitars only after they release a hit protest song. We will continue to be greeted with: “The weather prevented the incoming aircraft from landing yesterday afternoon, and we are not responsible for the weather. No, sir, we are not required to advise passengers ASAP so they can look for alternative transportation. You have to be in Montreal tomorrow and can’t wait for the next flight in 24 hrs? Too bad! Are you serious? You really want me to check if it is possible for you to depart on the American Airline flight, or from El Paso or another nearby airport later today? No, we are not required to pay for the bus ride from Chihuahua to El Paso.” We will continue to be greeted with: “No, we are not required to advise passengers that their flight makes it possible for them to gate check their suitcase and therefore avoid paying the 26 $US extra we rush to charge at the registration counter.” Basically, as long as the airline industry execs keep hiding their dust under the rug, we, as passengers, will hear more and more: “No we are not required to…” and less and less: “Sorry, now let me see how I can help you…” And that spells bad news for us, and airlines as well. Thanks again. All the best, Pierre ", "creatorid": "d63e59775068", "timestamp": 1492273836482, "child": "", "username": "gpo2115"}