{"parent": "1171", "title": "", "id": "b64e250d4eb4", "name": "1171_6", "content": "I’ve been hand-drawing planners in notebooks for years and years, so I’m absolutely delighted by the proliferation of bullet journaling and BuJos this last few years. I spend a LOT of time in my notebooks, and I constantly assess how it’s working for me. I’m constantly fine-tuning my system. Right now, I’m working out of two notebooks, one — a Leuchtturm1917 dot grid — is my planner/self-development journal. That covers a season, so I’m in my spring notebook right now. I have my routines, goals and plans, a daily reading section, and then daily planner and reflection pages that I draw out ahead of time each week. The other — a lined Moleskine — is a general notebook/journal where I capture everything not related to specific projects that have already earned their own notebook. For projects that I’m taking just past the initial page or two idea stage in my general notebook, I buy $1 8x5 notebooks at the local dollar store, a couple dozen at a time, and each project gets its own notebook. If the project is a novel, character notes, plot notes, scenelets, and bits of dialog that come to me will go in there, as well as dated notes on progress and intended direction as I’m writing the novel. For other projects like business planning and creating courses and such, the notebooks hold plans, research, etc. for those, as well as the dated entries so I can pick up where I left off. I’ve got a raging case of ADHD and I’ve found that keeping copious notes about what I’ve done and where I intend to go on a project means that if my interest trails off and a project gets left for months, I can come back to it, read through my notes, and pick up where I left off as if almost no time went by. ", "creatorid": "e3b53e00819e", "timestamp": 1491167720356, "child": "", "username": "gwynnemichele"}