{"parent": "1214", "name": "1214_18", "timestamp": 1491919549927, "username": "muyuan51", "content": "Hi Allan, I love your pieces, you know it, but I just want to condens this one to my favorite numbers … So let’s go: My No 1 favorite, but I’d never tell you (for incestuous reasons). I marked the carrot for later No 20,The No 2 would’ve been my Runner Up if it hadn’t been the naked truth, just to complete: including interest he owes the Kushners the exact amount of $ 3 ,885,967,421.84 (current state April 11, 2017).So, my Runner Up is, of course, Anatoly Putnnnnn ! I marked him for No 19 …My bronze medal goes to No 14, ya know 1 (ONE) semester Matriculation doesn’t say nothing, but in hindsight to the rest of the pack you’re right: Indispensable expert !And now MY Highlight No 19, for I see you are not aware that Anatoly Putnnnnn was the producer AND director of the “Golden Shower” videotape, and btw, also not known to the public, there exists an entire series: “Golden Rinse 1”, “Golden Splash 2”, “Golden Shower 3”, “Golden River 4”, “Golden Retriever 5” and “Golden Sea 6” !! All sponsored and directed by Anatoly Putnnnnn ! MY ABSOLUTE ALL TIME FAVORITE !For No 20 you know that the Kushner’s are renaming “The Devil’s Dildo” to 660 Fifth Avenue, furthermore the demolition will start in 2019 (once the project is sanctioned) and the planned construction will be complete in 2025 …… where will The GreLaT be in 2025 after impeachment and next bankruptcy ? You know, First when I read about Lyin’ Donnie Twitler’s new contract with the devil, I know 666 … I thought you were speaking of “The Dakota”, 1 West 72nd Street, first for “Polanskis baby” and second for the co-op BOD of this building rejected in 2011 for racial reasons (Orange skin !) The GreLaT’s plans to buy an 5th floor appartment … Lyin’ Donnie sued, board members fought back, saying in depositions they had rejected Mr. Donnie T. because “he had only § 50,000 in liquid assets, millions in debt and mounting losses in his businesses …”! In 2015 a judge finally sided with the board saying there was not enough evidence of discrimination of Orange Donnie … So …. but that’s a story for its own ! p.s. you know this already ? https://www.wired.com/2017/03/the-comedy-of-politics/ Karallan p.p.s. Avatar coming ! ", "creatorid": "bae3973264bd", "id": "d5c612086658", "child": "", "title": ""}