{"parent": "1268", "name": "1268_10", "timestamp": 1484898943745, "username": "jussi_ha", "content": "“There’s no reason to expect that anything will ever exist again” This ‘one-way trip universe’ theory is very, very, very unlikely to be true. Why? Because if the universe came to be once, there is no reason to assume it could not do it twice. Or three times. Or — most likely — infinite times. This can almost be demonstrated through simple logic: the fact that the universe (apparently) exists means that the probability of universe popping into existence under some special conditions must be non-zero. This means that if those special conditions were to occur again, the universe will have a chance to pop into existence again. If those special conditions were NOT to occur ever again, then the philosophical question arises: why did they occur just once? The fact that a given state of the universe occurs exactly once hints towards some ‘algorithmic’-behavior. There is no ‘happens just once’ if the universe is nothing but random quantum-scale vibrations. Given truly random quantum-vibrations, all possible states of the universe will occur infinite times. The whole notion of getting forever stuck in some local minimum is ridiculous if the fabric of the universe is truly random. No matter how deep the local minimum is the universe will eventually spring out from there. Thus the state that pops the universe into existence will also occur again. This will inevitably happen (given enough time) through some quantum-tunneling shit and what not. If the fabric of the universe is not truly random, then you have to import in a God or something. Cause and effect make no sense without external interpreter. In that case surely the same God who launched our universe can do it again. The whole idea of ‘one-trip universe’ seems to be nothing but a desperate attempt to avoid the inevitable fact that all our deepest sorrows will be replayed infinite times. Human, all too human… (I think I went a bit overboard with this reply…) ", "creatorid": "ea94271855d7", "id": "7120adf92f00", "child": "", "title": ""}