{"parent": "1309", "name": "1309_2", "timestamp": 1479495352307, "username": "capagris", "content": "Muy buena pregunta. Yo pensé lo mismo cuando se anunció la plataforma. Pero el asunto no es tan sencillo y creo que lo que vas a leer puede ser reconfortante. Yo no manejo ningún tipo de información secreta pero tengo una opinión tras mucho darle vueltas al asunto. Como bien dices, no se le puede poner puertas al campo y aunque PlayStation solo añade a la Store juegos que cumplen con ciertas regulaciones, y una de ellas será que tiene que ser compatible en ambas plataformas, no se puede exigir cual va a ser la plataforma objetivo. Ambas plataformas son iguales al desarrollador, con lo que el desarrollo del juego es paralelo. Lo que funciona para una lo hace para la otra consola. Pero es cierto que importa si utilizan la Pro como objetivo, y luego aplican «recortes» al modelo base. Sin embargo, bien podría ser, y parece lógico que la PS base fuese la que se utilice como objetivo, y por tanto no habría problema. ¿Por qué? Dos razones. ¿Cuántas PS Pro hay en el mercado? Miles por ahora. ¿Y cuántas PS4 base? Casi ya 50 millones según Wikipedia. La mayor parte de los juegos serán vendidos para la base y esta tendencia no revertirá pronto. Es incluso posible que Pro no venda más que la original, algo que no deberías descartar. Con lo que reforzaría aún más la idea de cualquier estudio d juegos mantenga como plataforma objetivo la PS base. Aquí es donde el ejemplo del teléfono no funciona. Así como la gente cambia de smartphone con frecuencia, está por ver que vaya a ser así con la PS4. Mucho dependerá de esto. La segunda razón de peso es que la PS4 Pro va a utilizar el incremento de potencia para obtener una resolución de 4K. Es decir, que potencialmente un juego para la PS4 Pro es el mismo que en la base pero con una resolución mayor. Similar framerate, animaciones, contenido… Como ves, que la PS4 base se quede desfasada, no es un pensamiento realista de momento. ", "creatorid": "f7f3a3c602f6", "id": "c4f079e1e29a", "child": "", "title": ""}