{"parent": "1345", "name": "1345_2", "timestamp": 1445577487363, "username": "yungrama", "content": "Is Mars Man’s Midlife Crisis? “Is trying to colonize Mars, at a cost in the billions of dollars, actually the right direction for future space exploration and scientific research?” — Amanda Schaffer, Tech’s Enduring Great-Man Myth In around 500CE, Indian mathematician Aryabhata laid out his principles for the diurnal motion of Earth, proofs which were expanded by others from Iran to Greece. His students would later provide calculations for the parallax, eclipses and the instantaneous motion of planets, precise ancient study that greatly influenced European astronomy, only to be later disregarded by British magisterial as clever fabrication during The Raj. Heliocentric planetary models were implied by mathematicians from the Kerala School of Astronomy to Copernicus, challenged the prevailing religious dogma of geocentrism. It seems space exploration — mathematical, philosophical or physical — have always been fraught with a cultural danger, whether Mars colonization or geocentrism. The Catholic Church did not repeal its condemnation of Galileo for centuries and recently Pope Francis commented on a rather kind of geocentrism when he issued his encyclical on climate change, challenging the dogma of capitalism. “The earth, our home, is beginning to look more and more like an immense pile of filth. In many parts of the planet, the elderly lament that once beautiful landscapes are now covered with rubbish. Industrial waste and chemical products utilized in cities and agricultural areas can lead to bioaccumulation in the organisms of the local population, even when levels of toxins in those places are low. Frequently no measures are taken until after people’s health has been irreversibly affected.”  If We Can Put A Man On Mars We’ve always looked to the stars for inspiration and for answers to our precarity, whether about harvest seasons or ominous calamities. Even ignoring Acts of God like a catastrophic asteroid or a collapsing magnetic field, man made dystopia often seems the future we imagine, of wastelands and the walking dead. Not that I’d deny climate change but I’m very suspicious about our impending extinction as a reason for colonizing other planets or moons. Still, perhaps better to start over just to be safe. We could start with a bang, like a nuclear explosion on Mars to liberate water like Elon Musk suggests. A mission to Mars could ensure that mankind survives beyond an angry God or worse, ourselves. Perhaps we could also save a handful of other species from our biodiverse planet, but not too many. Strong claims were also made about putting a man on the Moon. If we can put a man on the Moon, then we can cure cancer, build mass transit, end world hunger, stop climate change? Folly for not doing those things after we landed. Man, have we simply been going round in circles through low Earth orbit since? Not quite. I don’t doubt scientific progress and I have plenty of support for space research, especially the transfer of technologies that led to widespread GPS and satellites use. But I couldn’t tell you when or how exactly humanity will become a Type II space faring species anymore than seers. I know that we have another 600 million years before our brightening Sun evaporates our oceans, after which life on Earth is calculated to end, well before the Sun engulfs the planet. And though climate models show that things will get uncomfortable much sooner than that, space isn’t any more conducive to longterm human habitation. Obama believes he will live to see man land on Mars just as other late term American presidencies swore on the stars. Other presidencies also promised new human missions to the Moon that lasted as long as their waning terms.  “It is not enough to go to Mars; it is necessary to be able to do something useful when you get there. Zero capability missions have no value.” — Robert M. Zubrin, Mars Society Exurbs On Exoplanets Not everyone is so keen on human travel to other planets. While NASA contemplates a journey to Mars and China plans on puttting man on the moon, India only just became the fourth nation to successfully reach Mars orbit. There have only been 4 Mars missions this decade, and this last attempt by the ISRO was intended to showcase technological capacity and cost control more than significantly novel science exploration. Several other Mars missions are either planned or being studied for this decade, mostly of an atmospheric or meteorological nature. And with interest in Space X soaring, Elon Musk is expected to unveil his concepts for human colonization of Mars anytime this decade. But in a competitive space exploration market, are we still in need of grandstand Manned plans over practical scientific progress? Inspiring as projections of humans into space are, most planetary advancements have little to do with landing a crew on another planet. And while a rescue mission of an American astronaut on Mars makes for a blockbuster, even Andy Weir of The Martian contends that “it’s hard to justify the additional costs and risk,” of sending humans to the surface. Rovers and satellites simply provide far more utility in space. With colonization in the news, I wonder if we’ve learned anything from history. Yet the Robert Zurbin, founder of the Mars Society, usually points to Columbus in discussing interplanetary frontiers. Troubled history aside, current scientific protocols, call for leaving Mars untainted, returning astronauts safely and decontaminating them for possibly deadly alien microbial agents. The leap to settle on Marstropolis seems premature not solely because of the projected $40B-140B cost for early missions, but because Mars is a fucking freezing, dry, irradiated desert with an uninhabitable atmosphere. It is likely that any Human mission would be led by nation(s) first and would have to be executable within a decade. Unlike the Kerbal Space Program, a popular game for rocket enthusiasts like Musk, human space programs rely on funding, research and public support.  “The human exploration of new worlds may well be important, as inspiration and even, eventually, as something more. But it is not urgent in the same way as understanding and monitoring the Earth system.” — Nature Editorial Whitey On The Moon The marketing of space colonization seems nothing more than an Americanism of “frontier pioneering, continual progress, manifest destiny, free enterprise, rugged individualism, and a right to life without limits.” In much the same way that this planet’s resources are extracted for wealth — at an ongoing human and environmental cost — so too must exploitative free market capitalism be applied to planets, moons and asteroids. As history repeats itself, multinational mining seems far more likely than a civic space society. Of all the middle aged billionaire’s vying for space fame, few like Naveen Jain of Moon Express, have expressed their mining intent. And though I thoroughly enjoyed science fiction as a teenager, like Weir, I’m more willing to believe we’ll be manning planetary mining rovers from space orbit than colonizing Mars in my lifetime. “Taxes takin’ my whole damn check, the junkies make me a nervous wreck, the price of food is goin up, and if all that crap wasn’t enough, a rat done bit my sister Nell, with whitey on the moon.” — Gil Scott Heron, Whitey On The Moon As we confront the cost of climate change here on Earth — drought, flooding, air quality, water pollution and crop failure — we’ll have to deal with our hubris by studying the planet closer. Yes, there are billions of good reasons to explore how humans can inhabit dry, airless, irradiated deserts 140 million miles away, but the scientific discoveries will be more useful on Earth than elsewhere. Despite the hype, frozen water on Mars is of little importance to us. Much of the technology transfer from the public sector into our private lives had little to do with landing on the moon but with space exploration programs instead. Given the extraordinary precision required for unmanned launches alone, a six to nine month long manned trip to Mars would require coordination on an unprecedented scale, never mind broadcasting the reality show proposed by Mars One. The risks of extended periods of low gravity, isolation and irradiation, combined with jet propulsion, means that a hasty approach would assure that the first wave of interplanetary settlers would be doomed or at best, one way guinea space pigs. Considerations of space constitutions and planetary independence are best left as science fiction.  “The romanticism of space that is being sold must be looked at with objectivity and clarity. Hopefully through a more rational lens, those with the power to make decisions about settling in outer space will go forth with the least possible negative impact, while respecting the safety of human lives.” — Rayna Elizabeth Slobodian, Selling Space Colonization and Immortality Electric Cars On Mars NASAs highly regulated, methodical and bulky approach to exploration, presents space as a standoff between unimaginative bureaucrats and cowboy entrepreneurs to the technocrati. For astronaut Scott Kelly, every single hour his year in space will be accounted for, as NASA attempts to contrast the effects of weightlessness, space radiation and other stressors, against his grounded twin, astronaut Mike Kelley. But it is proposed, that for the next wave of affluent space explorers, space will be a lifestyle of comfortable suits and colony suites. I wonder if all this space chatter isn’t just the midlife crises of wealthy men seeking immortality—imaginations based on aggrandized histories and distorted visions and not the sort of science suited for space exploration. When expensive electric vehicles do arrive on Mars, they’ll likely be drones. So what do you think — as NASA contemplates Mars, should we strive for human exploration of space and colonization of planets OR should we prioritize scientific research of space in ways that benefit Earth sciences and the humans here? “From the start, advocates constructed a narrative of spaceflight that made it a necessary, even biologically driven, enterprise. But, as Pyne has pointed out, spaceflight and other modes of exploration are not in our genes but in our culture.” — Linda Billings, Ideology, Advocacy, and Spaceflight Thanks to Vijit Hassar for edits and to Laurent Hrybyk for illustrations. Also, while I’m glad Matt Damon went to Mars, I’m not sure it worth billions bringing him back? ", "creatorid": "7cfd3c76218d", "id": "cab4723c611d", "child": "", "title": ""}