{"parent": "1347", "name": "1347_8", "timestamp": 1491780905885, "username": "moonwaves", "content": "All but the first: Excellent! In particular, the Fixed Mindset. Toxic on both ends, at least to math students. (I’m studying to be a high school math teacher. Student teaching this coming fall.) Students who think they just aren’t math people have the obvious obstacles, but students (especially girls, for some reason) who think they are natural math geniuses tend to fall apart when they get to a level of math that isn’t easy for them. This usually happens in middle or high school. They apparently feel that they have reached the end of their abilities. Current research indicates that just about anyone can learn math, at least through undergraduate level, if they keep working at it. And almost nobody can get that far in math without some struggle. There is no “math gene.” Students who understand that tend to do very well. But that first… Imposter symdrome isn’t something we indulge in. It isn’t something we can just ditch. I tried. Eventually, I overcame it. But it wasn’t a matter of “ditching it.” I was a successful industrial software programmer for years. I was in constant fear that somebody would realize I was faking it, that I really didn’t know what I was doing. I tried really hard to convince myself that I was the real thing. I had the degree, I had the experience, I worked hard and smart, I produced results. Results I was proud of, and my boss and his customers backed that pride. I am not a particularly humble man. I knew on a rational concious level that I wasn’t faking it, but on another level, I couldn’t convince myself. Felt absolutely bizarre, trying to convince myself of someting obviously true, and failing. Over and over. I managed to keep going by reminding myself that my “faking it” was producing results as good as anybody I considered “real.” I don’t know exactly how I overcame imposter syndrome. I left the software business for other reasons, and went into a career with well-defined training and licensing. I can’t see myself being convinced by a license when I wasn’t convinced by results. But it probably helped. I think being able to see people’s lives improved by my work was probably more important. And I went through a family tragedy (daughter died of leukemia) which knocked a lot of the bullshit out of me. But the main point — imposter syndrome was not (at least in my case) some kind of attitude or self-deprecating afectation. I think it is as likely (or more) to have been caused by an undiagnosed alergy or something as to anything reasonably related to my abilities or the work. It certainly wasn’t (in my case) caused by any discounting of my successes. ", "creatorid": "fc1937ae1a19", "id": "af05e1ba6ab6", "child": "", "title": ""}