{"parent": "1361", "name": "1361_15", "timestamp": 1473860866701, "username": "rickfischer", "content": "This is such a tired and corrupt Progressive tactic: anyone who speaks against the abuse of a social aid program gets accused of hating and wanting to disenfranchise those who legitimately need that program. And weren’t your heart’s cockles simply torn by that staged photo? No sooner say one doesn’t like that some people who are well off use food stamps fraudulently, and out come the anecdotes about the truly poor who need food stamps; the implication being that one can’t eliminate fraud because some people truly need the safety net. Does ThinkProgress believe that welfare fraud does not exist? Seems so. Does ThinkProgress believe that opposing welfare fraud makes one a bad person? Guess so. Since ThinkProgress considers it legitimate to argue from anecdotes, that cuts both ways. Here are a few of mine. When my wife and I lived and worked near a state University, we did our food shopping there. We got in the checkout line with our few items, carefully selected for the cheapest meats and store brand items. Ahead of us were three young men, athletic, muscled, well clothed, obviously students, and their cart overflowing — literally with items sliding off — with the best meats, steaks, top foods of all sorts. They paid with food stamps and loaded them into their late model car and drove off. While visiting our oldest friends in a Florida resort town, we accompanied them food shopping. He related that the couple in front of them had a full cart of top foods, and presented food stamps as payment. The clerk declined them, and the manager explained that since they were from another state, they couldn’t use that state’s stamps in Florida. So the man pulled a large roll of bills out of his pocket, peeled off three hundreds, and proceeded to load their items into a new king cab pickup and drive off. A couple of years ago, there was a media kerfluffle about a woman who had won the state’s lottery, many millions of dollars, and was building a second home, but was still receiving and using food stamps. Of course, everyone thought that was wrong and should end. But the state’s official ruled that since she in fact did not work and therefore had no income recognized by the food stamp definitions, she was therefore qualified to continue to receive food stamps. Her millions notwithstanding. Welfare fraud exists. Medicare fraud exists. Disability fraud exists. Vote fraud exists. Political corruption exists (except at the Clinton Foundation, right, ThinkProgress?). Fraud wastes our money and corrupts our government. It is entirely right to oppose fraud. I wish the Democrats could get on board with that idea, but they benefit so much from it all, they must deny it exists at every opportunity. ", "creatorid": "24521b06ed51", "id": "76d6ca2ed76c", "child": "", "title": ""}