{"parent": "1375", "name": "1375_7", "timestamp": 1491657896647, "username": "zandercutt", "content": "Wow, Brett. This was fantastic, and really well-written. Quick response — I’ve taken trips throughout the world and used apps that capitalize on the sharing economy, specifically in places like Iceland, where most of the places you stay are someone’s home, and I actually had the opposite experience of what you describe. My dad and I had conversations with the people we stayed with, learned about the local flavor and got ideas for what to do or see next, and got to experience interactions that would have never happened had there not been a system in place that commoditized trust, in the way that AirBnB and Uber have. I’ve also had some hilarious interactions with Uber drivers, and learned their stories, and while that doesn’t mean that Uber’s system doesn’t have its issues, those interactions have made me more of a person than I would’ve been had I never had them (and I hope the same is true for the driver). The sharing economy can remove friction from transactions that used to be predicated on friendship and true, rather than commoditized, trust, but if we choose to engage with the people we are transacting with (as you mention with having political conversations with your barber, or flirting with the bartender), we can help aid this loss of human connection that you allude to in your article. You point out, aptly, that my point has been made before, and that it is sad to consider some Icelandic hostel owner neglecting to have friends over because they have AirBnB guests, which would, of course, only further the divide between close friends and move us further towards a world that acts only in the interest of financial gain. This, however, seems unlikely. It’s an easy argument to make, but to say that friendships are a zero sum game is not true. My relationships with my closest friends have been bolstered by the relationships I’ve built with others, and the conversations and things I’ve learned from people I’ve met through the sharing economy, regardless of whether or not the relationships were based on commoditized trust, or a PayPal statement in my inbox at the end of my stay. Also, Uber rides and AirBnB stays do feel somewhat empty with engaging with the people helping you make the transaction, just like ordering a drink at a bar or getting a haircut would. Again, thanks for your article. Your writing is incredible, and your ideas are powerful. ", "creatorid": "b5ade703c581", "id": "74750e5f7ee", "child": "", "title": ""}