{"parent": "1446", "name": "1446_5", "timestamp": 1491236370011, "username": "stevebryant", "content": "Thanks for reading Dianne, and for taking the time to comment. I can understand how you could be upset by that sentence. I don’t believe that all suburban Republicans fondly recall a less integrated lifestyle and want that lifestyle again. Just as I don’t believe that all coal miners remember the halcyon days of coal mining and want to live those days again. Just as I don’t believe all Christians fondly recall a time when Christianity was unquestioned and pine for that time again. Some/many Republicans don’t care about integrated schools, some/many coal miners would rather work in solar, and some/many Christians think the idea that Christians are persecuted is bunk. But IF a person wants all-white schools again, or coal mining again, or a Christ-fearing nation again, THEN “Make America Great Again” works for that person’s predilection or prejudice. But that’s not the point. Even if I only impugned *some* suburban Republicans, “some” could mean *any*, and “any” could mean *all*. By suggesting that some suburban Republicans might make decisions because they fondly remember a less integrated lifestyle, I may as well have said all of them were like that. I wouldn’t be surprised if that were your conclusion. Why should you assume I don’t mean any malice? After all, it’s the internet. We don’t know each other. There’s nothing in our relationship to temper negative assumptions. And I think that’s really the point. We’re not neighbors. We’re not friends. We’re just temporary acquaintances in a brief moment of time, connected by screen names and a topic in common. We’re not even in the same temporal space: you commented hours ago, and now you’re doing who knows what. I’m commenting now, typing from who knows where. On the internet, everyone is a ship in the night. We’re all ghosts to each other. And so, with so little at stake, the internet makes it easy to see other people’s lifestyles and judge them. It so easily moves us to binary and antipodal positions. It removes the “skin in the game” of arguments. By simply opening a browser, one judges and feels judged. So if you felt like I was unjustly attacking a group of people, or attacking you, I understand, and I am sorry. I hope to see you again soon :) ", "creatorid": "251b58260c76", "id": "b3ed00c824aa", "child": "", "title": ""}