{"parent": "1448", "name": "1448_24", "timestamp": 1481232761912, "username": "kenneth.rudich", "content": "This post contradicts itself. Early on you use the business/marketing language of developing a “personal brand.” Later you suggest: ‘I believe that the people who are willing to discuss their journeys instead of trying to front themselves as the “next big thing” are going to win.’ Discussing a personal journey and developing a “personal brand” are radically different quests, both in substance and form. The marketing intent of building a brand is to stand apart as more attractive or appealing. A good brand does this by being perceived as uniquely relevant to the consumer. Creation is the mechanism for plying the work in a manner that smartly packages your perspective to reflect and extend their perspective — like stepping outside of your skin and briefly climbing into theirs. Doing this well translates into being authentic (the opposite of “trying to front”). Simply documenting one’s personal journey is less likely to fulfill this mission for several reasons. For one, the average journey of the average person is apt to be mostly mundane. In unskilled hands, it’s also prone to come across as self-indulgent rather than audience-centered — and the more you do it the more underwhelming it gets. After all, how many people want to entertain someone else’s proclivity for constantly talking about themselves or listening to their ho-hum stream of consciousness? Frequently documenting a personal journey for public consumption — as opposed to keeping a private diary — simply adds to the din that already clutters our current communications. When you’re forcing or rushing the work in this manner it does a disservice to everyone, including the author. Converting your personal journey into something genuinely thoughtful, meaningful and unique, on the other hand, stands a better chance of imparting the kind of value that promotes a signature voice. This doesn’t necessarily mean one must wait until it’s perfect — but that you invest in a process of creating and refining the work until you’ve got something worthy of gaining a toehold (creating promotes personal growth by converting information into knowledge; documenting merely amounts to keeping a historical record). Perhaps you can release the content in shorter, less frequent but stronger increments — and use the shorter increments to develop momentum for a longer term rhythm and flow. If you do this well, the accumulation of content over time will leave a meaningful footprint instead of more din. Finally, notice I earlier said “signature voice.” I actually hate the idea of turning oneself into a “personal brand.” It implies that a person be viewed as a commodity — or worse, a disposable commodity. Nothing robs us of our common humanity faster than being treated like an insentient thing, such as a commodity. From a societal standpoint, this is truly dangerous territory — among other things, it threatens to breed an indifference toward one another (if it hasn’t already). Strive to develop your presence through a signature voice — recognizing it takes time, work and, above all else, creating one. ", "creatorid": "17c2c845161f", "id": "febeb222d8d0", "child": "", "title": ""}