{"parent": "1452", "name": "1452_9", "timestamp": 1487757826319, "username": "lloydtl_", "content": "For better or worse, many of the “clickbait” headlines around (and there are a lot of them) are, sadly, the new normal for gaining attention for even the best-intentioned pieces. For example, 10 Questions You’ll be Asked in a UX Interview (as seen on the UX Clickbait Headlines site you link to), could be a genuinely useful and informative article for someone looking to further their UX career — the key here is to judge the value of the content contained within, and not just the structure of the headline, because analysing content in this manner is no different than the “shallow” approach you condemn in the article. As others (and yourself) have pointed out, this very article both “sells an idea” (shouldn’t all persuasive writing?) and has been produced with an objective of furthering your personal brand. As such, the takeaway comes across slightly confused as you both distance yourself from the perceived issue of content marketing, but essentially admit that you embrace it (albeit from the stance of “doing it right”, which I for the most part agree with). What you don’t tackle is the crux of your argument, which is less around quality of content and more the provenenace of its creation, an issue which seems to revolve around transparency over quality. Following this argument to its logical conclusion (and based on your checklist for criteria to be aware of), the best content to consume would: Not have a “catchy headline”Ignore SEOExclusively prioritise fact over experienceNever have a convincing argument Etc, etc. Hyperbolic, I know, but looking at content through this lens would, I believe, totally miss the point of writing to begin with. As this publication shows, you can give value back to a community whilst furthering other objectives and maintaining an optimised approach to your content that helps spread the reach of your mission more. ", "creatorid": "d5d0f638cec9", "id": "c4d08669a9f6", "child": "", "title": ""}