{"parent": "1548", "name": "1548_6", "timestamp": 1491856688593, "username": "enviroenforcer", "content": "By saying this…. >>>>”Drinking water is largely protected by the Environmental Protection Agency under the Clean Water Act and the Safe Drinking Water Act, two keystone pieces of environmental legislation. But fracking, a water-intensive oil and gas extraction method, has been exempt from many of the requirements of the two acts.” The author of the article is repeating nonsense and false statements about hydraulic fracturing being “exempt” from environmental laws from the claims of Josh Fox and the Gasland movies, which contain false claims about the statutory obligations of the oil and gas industry. The Safe Drinking Water Act regulates potable groundwater. Under the general duties of this Act, hydraulic fracturing operations and all other oil/gas industry operations must prevent contamination of potable groundwater. SDWA has a requirement for underground injection well permits for discharges to groundwater, but a UIC permit is not required to conduct hydraulic fracturing of an underground hydrocarbon-bearing rock strata in a hydrocarbon recovery well. That a permit is not required for underground injection for hydraulic fracturing is not a permission to allow contamination of groundwater or discharge of waste to potable/treatable underground aquifers. The Clean Water Act regulates discharges to waters of the United States and requires adoption of federally approved state water quality standards to protect existing uses of such federal jurisdictional waters. The oil/gas industry is not exempt from the requirement that petroleum pollution, hydraulic fracturing fluids, flowback and oil/gas production waste can only be discharged pursuant to a CWA-required permit. Josh Fox’s claims to the contrary are dramatic lies and performance art that are part of his entertainment films, which cannot be deemed documentaries or legitimate scientific and engineering statements of physical realities addressing the operations of the oil/gas industry. Accordingly, the reader should regard this statement in your article….. >>>>But fracking, a water-intensive oil and gas extraction method, has been exempt from many of the requirements of the two acts.” …..as being false and erroneous reporting on the part of ThinkProgress. ", "creatorid": "7a09aa9595b8", "id": "b55c1ce7295c", "child": "", "title": ""}