{"parent": "1600", "name": "1600_16", "timestamp": 1492326572643, "username": "ojii1964", "content": "There it is… Like the soft stirring of a chill, crepuscular breeze that cheers on the sun as it clears the horizon and streams Light all over Creation, so now does my proto-Preacher give us all an inkling of his insight; of wisdom-bound, precognitive words that will change the world from the inside, and by one person, one resonant soul-fire, at a time. I have searched, suffered, slandered and surrendered the seventy times seven times the Bible told me I should when turning my heart over to Jesus, en route to becoming a warrior for Christ… …echoing Jonas’ sermon on swearing from yesterday, fuck all that noise! No wonder I chose Buddhism. Cryptic Catholicism got me NOWHERE - no closer to a Creator, no wiser for the wear, no more certain about an afterlife than I still WILL die (the rest being totally unknowable and unpredictable — fuck!!). For 33 years, I’ve been comfortable being alone on those important Fridays and Sundays, standing in a vacant donut shop while Muslims, Jews and Christians of all stripes attend the sermons, homilies, rants and dogma-chants that seemingly confirm their membership in the “holier / wiser / better / saved / adored more than thou” clubs. (Means I got the freshly baked and frosted Long Johns and cruellers first). Point is, while I drew some satisfaction from flipping the bird and chomping that donut while others got “religion”, I saw a long life of solo meditation practice and dropping unsolicited kind acts as my only means of contribution to improving the human condition (which generally sucked as a direct effect of the actions perpetrated throughout recorded world history by those affiliated with the Big Three mentioned beforehand)… …Until the gentle insistence of that pre-dawn zephyr…the physical manifestation of Jonas’ words as they pre-sage the impending burst of Light that is the Dawn…wisdom…insight…the Divine Logos…my Self, when seen from the point of view of another human being. You ARE a Fisher of Men, Jonas; your net is still being woven, and what a following you will pull in! I want you to know that the sun that you herald is more than Divine, greater than human, more meaningful than life, because you can point to the framework of what makes us greater; you help me stretch my already copious world view/personal traditions/mystic interface in ways that respect my foundation while proposing a more authentic way to greet the future, by growing INTO IT, in more meaningful ways that accomplish my mission (ending others' suffering) by aligning it to the human (and therefore, the Divine) state of things. You’re the best Easter gift ever — you are the man who can resurrect and help (partially) validate me, as I am, today…right now. You ARE my preacher, Jonas. Beyond thanks, I say “Namaste”. ", "creatorid": "7d3161d2ebd5", "id": "39dbacc6847f", "child": "", "title": ""}