{"parent": "1623", "name": "1623_5", "timestamp": 1463407894953, "username": "metrorachel", "content": "Estimated $55, then revised my estimate down to $24.67. Should not have done that. Dinner with Husband-elect’s friend and his fiancee was actually just drinks (I thought it was a restaurant, but it skews much more bar-ish and they didn’t have meal-level food), so we stopped and got Arby’s on the way home. I paid, because I was starving after my thrift adventures ($6.27.) Then on Saturday morning we lazed around until I decided I wanted pancakes. We used a Yelp deal for a local breakfast place — breakfast for two cost $6 on top of the deal value. It was gross and cold and rainy, so we decided to go see Deadpool at noon at the cheap theater($3.50) before heading to the library to pick up Ant-Man on reserve. It remained gross outside, so we kept up the Marvel movie theme for the day and watched that too (I really liked it — it filled in some blanks in my MCU knowledge.) Sunday I talked to mom, then we went to the gym. Hit up the grocery store on the way home, $31.36. Went home, did some cleaning and took a shower with my new rose-jam scented shampoo bar(I want a food that tastes like this shampoo smells), then went back out so Husband-elect could look for cheap boat shoes at DSW and Kohl’s. There’s a new Panda Express in the same shopping center as those two, so we went there for lunch because we’ve never tried it before. I am not at all sure what the big deal is, it was underwhelming at best and cost $18.32. We went home and I did more cleaning, plus for dinner we FINALLY made the buffalo chicken and potatoes we’ve been planning for like three weeks, plus a cucumber/tomato salad with tahini dressing and cilantro. Ate while watching Bob’s Burgers, went to bed before 9:30. Estimate: $55/24.67. Actual: $90.12. At least I kept it under $100? ", "creatorid": "62c4360d2775", "id": "4a77dd25805a", "child": "", "title": ""}