{"parent": "1623", "name": "1623_11", "timestamp": 1463407544012, "username": "atf1979", "content": "Estimated under $100 and spent about $180. Friday: after estimate wound up going out to lunch with coworkers ($11) and then I stopped and got some gum (needed) and cash back ($22 in total). Then I did just go home, went for a slow run (it’s amazing how one little injury and a mandated six weeks off made my time go from just over 9min miles to nearly 12 min miles. /weeps), and then made and ate dinner at home. Saturday: thought about sleeping in but the cat had other ideas that involved a lot of walking on our heads and meowing at us. So we got up fairly early and ate some delicious breakfast sandwiches that zee husband made. Then we took a long, slow walk across town (stopping to buy some powdered makeup because I dropped my compact early in the week and shattered it, $26, and some sunscreen because helllllloooo sunshine, $36 because husband got some cash as well). Then we hopped on a harbor ferry ($34) and spent the afternoon at George’s Island wandering around the fort that’s there. It was very cool. They let you basically go anywhere and climb on anything you want. Spent an additional $10 on snacks while we were there. Then husband went to Revs game ($7 on McDonalds) and I spent $10 on take out Thai and $25 on new pillows from TJ Maxx because lately I keep waking up with a stiff neck and it is driving me nuts. Sunday: I made pancakes and we cleaned the joint. Then we went to LS house to do her english essay. She had actually done the visual portion of it and worked on the essay part on her own as she was asked to do. So then we only had to spend about an hour and a half there tightening up her thoughts and correcting grammar. Then we came home, husband biked to grocery store to get stuff to make cabonara with and a few more things for dinner this week ($30), and we had a relaxing evening. ", "creatorid": "19f183a31f65", "id": "caffecdb3032", "child": "", "title": ""}