{"parent": "1656", "name": "1656_4", "timestamp": 1473456018264, "username": "ajchandler92", "content": "Alabama is amazing. We can’t argue that. But remove them and what does the SEC honestly have that is better and more special than other conferences? ESPN and sports writers in general seem unable to let go of this notion of the SEC being a level above the rest. The SEC has some great teams, but it was never the “Top-to-bottom” best. Its best teams are certainly phenomenal, but the bottom is just as bad, if not worse, than most other power-5 conferences throughout. Every year, teams within it like Georgia, Tennessee, South Carolina and even LSU for the most part are for some reason spoken of as if they will be unstoppable, and yet every year it seems they close out the year with around four or five losses each. I’m excited for Josh Dobbs to graduate so I can stop hearing that this is his Heisman year. Tennessee is, like most SEC teams, super whatever. Auburn has had some great years, sure, but excluding unearthly quarterback play or back-to-back miracles, their seasons have been relatively whatever. Ole Miss was pretty good a few years back, but then they proved that it was all a sad lie in the Peach Bowl. The SEC is also the most boring conference. I know that analysts and more traditional football fans still believe that “Power football is the only real football” but did anyone actually watch the LSU/Alabama national championship? What about LSU/Wisconsin last weekend? I bought the rights to that game so I never have to take a sleep aid again. Furthermore, if anyone can look me in the eye and honestly tell me that A&M, Vanderbilt*, Kentucky**, Missouri are consistently good enough to hold the rest of the conference up, I’d have a lot of follow-up questions. *Vanderbilt is not a football school. But still, it shouldn’t excuse them in the discussion of the entire football conference. **Kentucky is a basketball school, I get that. But this is about the SEC as the best football conference. ", "creatorid": "101f4bad7d2", "id": "9634472bb597", "child": "", "title": ""}