{"parent": "1665", "name": "1665_14", "timestamp": 1481052390088, "username": "jakefgreen", "content": "Interesting read, but I ultimately disagree. While it is generally true that conference championships and head-to-head match-ups serve merely as a tie-breakers for comparable teams, the selection committee has a different standard for comparing a conference champion with a non-conference champion. In that scenario, the non-conference champion is supposed to be “unequivocally better” — a very high standard that I don’t think Ohio State meets. You are right that just because a team wins head-to-head, that doesn’t necessarily mean that they are the better team. But, with regard to your point that the OSU-PSU game resulted in a “ridiculous result,” how so? It was certainly an unexpected outcome, but I don’t think that renders the result “ridiculous.” There’s certainly a distinction between not expecting a result, on the one hand, and a team not deserving a result, on the other. Moreover, I don’t think it’s fair to write off a game just because it involved a big special teams play. When Marcus Allen jumped in the air on that field goal play, he was trying to block the kick…and he was successful. That’s not lucky — that’s a great play. And J.T. Barrett had plenty of time to respond, but he was sacked twice on Ohio State’s last drive. That certainly wasn’t luck — that’s great defense. After that game, Penn State played all of the same conference teams that Ohio State did and won them, ultimately allowing them to win the same division and conference that Ohio State plays in. In some of those match-ups, Penn State dominated teams Ohio State barely scraped by (e.g., Michigan State). So, even if you think Ohio State is probably better, is its’ superiority “unequivocal”? I don’t think so. ", "creatorid": "d6d70adbf582", "id": "ef901100bbc6", "child": "", "title": ""}