{"parent": "1691", "name": "1691_1", "timestamp": 1458601785280, "username": "andyhre", "content": "I’m not sure we’re disagreeing about cause and effect so much as disagreeing about whether the cause is having an effect. I read your piece as arguing that we can’t help but feel empathy, and so we know, deep down inside that college basketball is exploitative. But I’m saying that many, many people, however much they love themselves some March Madness, don’t feel empathy. Instead, they buy into the idea that unlike everyone else, college basketball players shouldn’t get what they are worth, they should get what we say is “enough” and if competition among schools would result in them getting more, then by all means, we should stop that. When high tech firms got together and (as alleged) agreed not to recruit each other’s employees in order to keep their costs down, the DOJ stepped in and got them to stop. The Court approved a large settlement to the affected workers. But when college get together and do the same thing, and worse, even when the Courts say it’s illegal, no one has the stomach to change the system. I’m saying that if there were empathy, as a society we’d have long since demand change. The fact that you and I see the exploitation, but that we’re in the minority, tells me that we have a long road to travel to reach antyhing close to empathy. Try this — go to a party and ask people “should college athletes be paid” and count how many people give you some reason why they can’t or shouldn’t. Then ask them if they can think of any other large industry where they feel that way, where the consumers should be able to demand the labor get paid less than their worth. I think you’ll find your awareness of these men’s humanity isn’t typical. To my regret, yes, but it’s what I have observed. ", "creatorid": "88d5eeed93a7", "id": "132b488ddeca", "child": "", "title": ""}