{"parent": "1717", "name": "1717_8", "timestamp": 1492188117892, "username": "theabigail", "content": "I’ve found that a lot of “body positivity” is a desperate response to a perceived lack of control. Loved this piece. It was even-handed, and attempted to take the “body shaming” out of the equation (FOR ONCE). You partly accomplish that by coming at it from a very narrowly self-focused position and do not stray far to admonish others to do any particular thing (you also have not had a lot of body self-delusion, it sounds like, which is AWESOME and I wish it were the case for all people). Honestly, though, I think admonishment is in order to society at large. A great start to living more comfortably in your own body (whether comfort is measured by fitness, markers of health, BMI, a ridiculously tiny waist, a faster mile, heavier lifting, whatever) is to be actively honest about your goals. Even the “happier being fat” woman has since reneged, at least partially, on that stance. I feel like we’re told regularly that A) We need to use mysterious magic to lose weight, and B) It’s actually impossible (cause it’s, like, magic). It’s a delusional stance, saying that we need to attain an impossible goal. A) Losing weight is science, and we basically understand it. B) It’s science. We basically understand it. People need to realize these things. It can be difficult to put the science into action when there are mental issues simultaneously on board, but just because I’ve got mental issues with food does not mean that the science we know is wrong! If anything, the science is my saving grace, allowing me to put into perspective any eating issues I may have and to question questionable eating habits. I’ve been painfully thin (emaciated) and I’ve been round-n-squishy fat (morbidly obese), and at the end of the day (I’m a solid medium currently), body shaming is the least of my concerns. I had to strive to reach that perspective, but if I can, so can other people. What I want from my own body is for it to thrive and accomplish my physical goals in a powerful, comfortable way. I have to work to make that happen. Goals are different from person to person, but it’s really, really important to honestly set and strive for them, not just day, not just tomorrow, not just for that dress you want to wear on New Years, but as a permanent understanding with yourself forevvvvverrrrrrrr. And wow, sorry, I went a little overboard with the response. I really liked this article. ", "creatorid": "6ec051e1e0f4", "id": "a181369094da", "child": "", "title": ""}