{"parent": "1717", "name": "1717_12", "timestamp": 1492214381275, "username": "brookecolwell", "content": "Lol. Me too! That, or Trump covers most every problem I see in modern society. I’ve never gone on a “diet” as an athletic healthy person with comparatively few body issues (Typical self-talk: I see you cellulite, you’re damn delicious, don’t you forget it. Big ears, don’t start, you’re adorable. The rest of you? AKA, Bam Bang Boom? Yah, don’t hurt 'em. I manage to not sexually harass myself, usually.) But I like to be aware, seriously considered going vegan and still might once I try something new: letting someone else give me a shopping list and detailed meal plan. So I don’t have to think about it, scan ingredient lists in the super market trying to remember if wheat flour is okay, etc, too much time and work. So far started to read about glutens in Grain Brain, and I stopped fast food and drinking soda long ago. (Common sense asked, a brown beverage? Where is that produced in nature? The sewer? Hello lovely water, babbling brooks are calling my name. Apple and orange juice have zero nutritional value but are packed with cocaine-level loads of sugar.) I’m good with water, seriously, that’s it. Rarely, coffee or Gatorade. Entire aisles devoted to various beverages? Capitalism. I’m thirsty, I’m not … was gonna say clothes shopping. Consumerist comparisons are all I can think of, damn. Oh. Got it. I’m thirsty, I’m not surveying the U.N. for solutions to poverty and violence against women. It’s simple: water. So, speaking of keeping it simple, meant to just mention “diet right for your personality type\" because I like the author, seems relatable. I’m gonna go with HER food choices for a month, to start, see how it goes. Looking forward to it though. Hope you always enjoy wealth ~ in love, health and life. And sometimes truly awesome ice cream too. ", "creatorid": "87596bbe1763", "id": "325b4a0f6b8c", "child": "", "title": ""}