{"parent": "1717", "name": "1717_6", "timestamp": 1492224183497, "username": "tomharrisonjr", "content": "Dear Emma, Your writing is brilliant. Your pieces are honest and gritty. Everything I have learned about attempts to lose weight suggest that weight, or eating is not what you need to lose. My genes (yep) make me and my whole family especially talented, capable, and adept at becoming addicted to various things. Some of us are specialists (e.g. food, exercise), and I play the field. What works for me is figuring out what I can do that scratches my self-destructive itches in a healthier self-destructive way. Writing is fun! Alternatively, you can figure out what is causing the behavior, but that involves people charging $200 and think an hour is 50 minutes (it’s like fucking Mr. Coffee who decided a cup was 6 oz. WTF!) and requires self-discipline. I know about addiction. Someday I’ll write about what I know. Until then… Capitalism I Capitalism is to blame merely for creating things called “marketers” who are a subspecies of humanity that realized that if you put powdered cheese on popcorn and call it “Smart Food” which is delicious and plentiful and comes in those single-serving sizes (sometimes labelled “Family Size”) people will buy lots of it and think they are smart. Or that it’s food. Why Put off Until Today that which You Can Put Off Until Tomorrow All humanity has the “only deal with it when it’s a crisis” issue. Consider all bad things that happened that we have survived or not (Wars, Atlantis, Rome, Trump, etc). Then count the years that it was obvious it was going to be bad. Now count the number of minutes before it exploded that we clever humans decided now was the right time to act. It’s not you, girl, it’s all of us. So you should feel better (and buy more ice cream). Global Warming Sounds Nice To wit: global warming. To be blunt, you’ll probably drown, burn up in a forest fire, or get caught in a twister all yellow-brick-road-style well before your exponential weight gain really becomes debilitating. In 1988, a smart guy (James Hansen) had balls enough said to Congress “Hey, global warming is bad and we should stop it before 2000”. Pshaw, said the multiple corpeople who would have their quarterly results slightly disrupted by this inconvenience. Memo to congress-person: global warming is nothing to worry your little head about. Daddy Says OK, but Mommy Says It’s Not Three decades pass and we’re either saying “No, global warming is not real because Exxon says so, and pay no attention to the new North Pole Beach Resort (An Exxon Property), praise God / Free Markets!” or “Whoa, it’s too hard and annoying to cool the planet now, plus it would totally harsh my buzz, so let’s burn more coal!” First Off the Mark In All Exponential Races Wins So to tie it all together: the whole planetary exponential self-immolation has been racing us towards doom for much longer, while you’re just in the early phases of exponential weight gain, why bother trying to stop it since we’re all going to die of global warming any day now? Denial of Bacon Remember, losing weight will very likely involves less Smart Food (or Phish Food). Unless you buy the diet book that says you should eat more, which was created by a great marketer. In general, weight loss will require more denial of the few remaining pleasures of life on earth like bacon. The big one’s a-comin’ faster and faster anyway so what the fuck, right? And don’t forget those tits, or for that matter, booty, which is now all the rage. Capitalism II So, yeah, capitalism is just the aspect of humanity that has formalized the notion that greed is a good thing, deferral of gratitude is morally wrong, and all of this is self regulating (it’ll be fine, no really). This is what they taught me in Economics at Princeton in the early 80’s, so it must be true. ", "creatorid": "1fba4038dcff", "id": "43284bc70687", "child": "", "title": ""}