{"parent": "1724", "name": "1724_2", "timestamp": 1491223147430, "username": "darklywise", "content": "I often like what you write, even when I don’t agree. I always like how you write, agree or not. This… was brilliant on a whole different level. The plague of reality tv has been vastly underestimated. It has taught an entire generation that certain behavior is not only acceptable, but should be rewarded. I am “unfair” for reminding people that Kim has been married twice before, once to someone unable to boost her image enough to satisfy her mother’s lust for fame, and again to a victim. Yes, I said it. A man who had no idea that his entire courtship and marriage was nothing but a publicity stunt never intended to actually become a marriage. How she hooked Kanye, I’ll never know. But I’m not sure she got what she bargained for. The truth is, I pity her. Her rewritten history has forgotten a little known and less remembered appearance on a failed reality tv show that was really no more than a collection of socialite kids taken from the city to a dude ranch. During that show, Kim was packaged as struggling in New York along with her sisters to help her (as yet unmarried to Jenner) mother with a retail business. In fact, she was on the show with Jenner’s son, and that was how Kris and Bruce met. I do feel for Caitlyn, I can’t imagine living with that woman. The rest has been television gold and cultural hell. While not a regular viewer, every exposure to the franchise has left me feeling dirty at how Kris was willing and able to exploit every aspect of her children’s lives. They are less people than creations. Manufactured to sell to the consumer that is “us”. None of them have any kind of private life, personal life, sanity… and yes, in some ways they have done it to themselves, but this all started when they were too young to really know the difference. Just like the Jenner girls grew up feeling like they had to sell themselves if they wanted their family to pay them any attention. It is criminal, and in our own ways, we are all guilty. Something has to change. ", "creatorid": "c388ab7a25ac", "id": "98e6d8a47bd9", "child": "", "title": ""}