{"parent": "1761", "name": "1761_2", "timestamp": 1491594505868, "username": "noisemachine3001", "content": "I couldn’t agree more. Never feel guilty or apologize for the things you personally have not done. Group identity/tribalism in modern society is a means for plutocrats and technocratic politicians to indoctrinate the weak minded to believe that they are “educated” and that they possess a profound understanding of justice based on the emotional distress of others outside of sound logic and reasoning. Without a sense of irony they will redefine words like racism and sexism to exclude their own prejudices and bigotry while suggesting that their opposition will usher in an Orwellian future. They’ve redefined fascism to mean anyone that support freedom of speech and that violence is a justified measure to prevent opposition. They will call liberals and conservatives Nazis while doing exactly what the Nazi brown shirts did to those that spoke out against them. The U.S. Dept. of Education needs to end federal funding to all schools and universities that teach ideological based thinking. Teaching about various ideologies is different than teaching/endorsing an ideology and its practices. Students should never be graded on their activism skills. That’s insane. Social justice is a cancerous cult. They have every right to believe what they wish but they do not have a right to act out in violence. They do not have a right to indoctrinate children and young minds. I have no issue with professors teaching intersectional, gender or black studies along with other ideologies, but it must be from an objective, impassive and skeptical position. The scientific method requires objective and critical thinking. Even none scientific subjects should be taught with the scientific method in mind if it is to receive tax pay funding. And for christ’s sakes, sexual assault and rape accusation should be handled by law enforcement and the justice system not school officials. I can’t even see how that’s legal. That’s like saying you found a murdered body at work but your employer didn’t want to call the police and would handle it internally. It makes not goddamned sense. ", "creatorid": "5aac5900e591", "id": "834149bc20a4", "child": "", "title": ""}