{"title": "", "name": "1827_2", "id": "eedab0d8a687", "creatorid": "9e849a2b5cd8", "timestamp": 1490299321166, "child": "", "content": "Resolving to co-evolve Interweaving inner work, inter-personal work and social change practices. I hope its not to late to say… thanks for sharing Sam! I really appreciate the opportunity to engage in this kind of dialogue with you. It’s the first time I’ve ever received a thoughtful long form response in medium — and it really highlights what’s possible with technology when it’s used in a contributive way! Firstly, I also must apologise. It’s been 5 months, and I’m sorry for taking so long to respond. But a long summer holiday adventure was calling. Now I’m back and I have some thoughts I’d like to share. “Essentially I’m proffering that I believe we must fit the change strategy to the needs of the change we want to see, rather than always relying on deep personal change as the means to shift all systems.” “I’m now becoming increasingly excited about the role of doing this inner work through good Design practice, thus creating a fusion of inner & outer work in parallel.” I love how elegantly you have articulated something I feel like I and our Benefit Mindset team have been trying to find the words for — about the power of purposeful groups and social labs to create systems change. Your work with Lifehack is a real inspiration, thanks for being so open and transparent with your experiences, connections and resources. It’s really helped our team form a richer appreciation of the many pathways we can use to create flourishing cultures. We have a number of schools we hope to work with this year and have decided to use Social Labs as our preferred approach! We have a long way to go, but it’s exciting to be able to put these ideas into practice. “As I used to say — too much time sitting on a cushion in a circle isn’t going to answer the immediacy of the challenges which face us. Yet without this work, we’re building on poor foundations.” While I like your idea of creating fusion, for example in a lab type context — it also makes me wonder. Is it the only way? Is there also value in taking a pause in our social change work and deliberately removing ourselves from our particular context to gain perspective? Perspective that is informed by our soul and who we are? A quite space to retreat and reflect and connect with our inner ways of knowing and allow its wisdom to emerge? Connecting with the deeper essence of what life is about? When I think of people like Thurlow and Mandela — they are examples of people who managed to make an impact in part because they spent extended periods of time doing inner work in effective isolation and solitude. They were probably also doing design work in their minds, but they did it outside the contexts they were trying to change. So I feel, while there is value in doing inner work in fusion with outer work — in say, a social lab — there is also a time and a place for pausing — and removing ourselves from our contexts to do inner work as well. I don’t have any answers, but it’s something I’m exploring. There is a great On Being Podcast that explores this idea, featuring Parker Palmer and Cortney Martin. Perhaps this is something you integrate into your social labs? “There is no power for change greater than a community discovering what it cares about.” — Margaret Wheatley One final thing your comments inspired over my holiday break was some reading. In particular, I loved Walk Out Walk On by Margaret Wheatley and Deborah Frieze. It’s a collection of stories about communities who are interweaving inner work, interpersonal work and social change practices to take control of their own future. Communities that came together to walk out of limiting beliefs and assumptions and walked on to a healthy and resilient future. I can really see many synergies between the Social Labs / design work you’re doing and theirs. It’s really exciting to read about so many people doing this important work, and it’s awesome to be part of it. Thanks again for sharing — I’m also really excited about seeing where this adventure will take us :-)  ", "username": "ashbuchanan", "parent": "1827"}