{"title": "", "name": "1869_1", "id": "e0c6d9a399b0", "creatorid": "25cd1cc62d2c", "timestamp": 1483308906758, "child": "", "content": "Thanks for this, Justin Cox 🍩! Like you, I’m a minister, but don’t broadcast it (there are stigmas too often attached to it). To be honest, I enjoy writing from a different perspective that’s outside the weird ideals of American Christendom or on subjects that have nothing to do with faith. My challenge to you would not even necessarily be to write stories exploring faith. Tons and tons of those already exist, and if we’re honest, the writing sucks and only attracts hoards of the faithful followers (I want to drop the names of blogs I hate in Christianity that are quite dopey, but I shall refrain). Instead, I would challenge you with a quote I once read by C.S. Lewis that forever changed the way in which I write. He states: “What we want is not more little books about Christianity, but more little books by Christians on other subjects — with their Christianity latent.” You and I both know the church in America is in free-fall and rapid decline due to hoards of people adopting cultural Christianity as opposed to adamant followers of Jesus who love people graciously and without borders. I believe the future of the church will be small, but influential through people like yourself. Part of what I love about you as a writer (and simply as a human being) is that you’re kind and compassionate and engage with people outside your regular circles here on Medium. You speak your feelings in a manner that’s not condescending or shame inducing, while encouraging others to think a little deeper. Funny enough, I’m about to release a piece on my favorite things this last year and one of the sections happens to be writers I love on medium and you’re one of them. It’s because you have that gonzo journalism style of writing that’s unapologetic, but fun and gives intense perspective. Honestly, if you wrote stories on eating donuts while running into a friend you met, and drawing out a life lesson in the process in a fun and imaginative way, I’d read it! Lastly, this is something I do that may help you find topics to write on (from one Christian to another). Most often I write about things God is teaching me in my life, areas where I’m falling short, or things that are inspiring me. If you did that in your own voice, I know the people here at medium would also enjoy reading that. Best of luck to you brother! I enjoy reading your work and look forward to your future articles! ", "username": "benjaminsledge", "parent": "1869"}