{"title": "", "name": "1869_17", "id": "8cd1cb92f11b", "creatorid": "ff009a5e3196", "timestamp": 1486670466691, "child": "", "content": "52 Week Writing Challenge In 2017, I will publish something every week! But what will it be? Last week, in my Predictions for 2017, I predicted that I’d publish something every week of 2017. Granted, I had insider-trading knowledge that Stella J. was launching the 52-Week Writing Challenge the next day. I included the challenge in my predictions because it’s a challenge that I’m very excited about and one that I am ready to participate in. The problem? I have no idea what to commit to for 52-weeks! I’ve been stewing on this for awhile now and have been completely stumped. I’ve been reading through all the responses to Stella’s announcement and people’s ideas on the Writing Cooperative Membership Slack (the what?! you should totally join!). And it seems like everyone has some amazing ideas! Everyone but me. Perhaps I should attempt to write: a weekly story about something I’ve recently eaten. After all, I do edit chow🍴down, Medium’s premier food and travel publication. But food reviews aren’t the focus of chow🍴down, personal stories about food and travel are — kind of like what Jing Jing is doing with Ramen Ramblings. There is potential here, because practically every meal I eat has a story surrounding it.a weekly short story, about anything. In Slack, Vishnu Parakkal said he will be writing a short story each week about a picture, and those weekly stories will be chapters of a 3- or 4-part over-arching story. I love that idea! After all, I did attempt NaNoWriMo this year. But here’s the thing: I can’t write fiction. I’ve tried. It doesn’t flow. Maybe writing really bad fiction every week for a year will help me get better — which is kind of the point of this challenge — but can I stand to make you, dear reader, suffer through bad fiction for a year?a weekly combination of the two. Hayli Nicole explained on Slack (why haven’t you joined yet?) that her challenge will be to take a picture from her travels and tell the story behind it. I love this idea, and I do have hundreds of photos from years of travel with so many stories to tell…a weekly exploration of faith in our currently reality. When I’m not trolling the Medium waters, I’m a Minister to Youth and Families in Orlando. I write about faith a lot in that world, but only ever publish the sermons I give. Perhaps I could follow in the footsteps of Benjamin Sledge and Dave Boice, and tell stories about exploring faith.a weekly look at what is bringing me joy. So there’s that other publication that I manage, Happiness Weekly. I don’t know why I didn’t think about it originally, considering it has weekly right there in the title. It’s kind of primed for this whole weekly challenge thing. Telling stories about joy and gratitude each week would really make me focus on those things. Given current geo-political situations, that’s often difficult. The central theme of all of these ideas is storytelling. Whether it’s a story about past travels, exploring faith, fictional characters, or a moment of joy — the common denominator is telling a story. A story that wants to be told. A story that needs to be told. A story that someone (hopefully many someones) will enjoy reading. I don’t know why this was such a difficult realization, considering Medium has been prompting me all along…  So in 2017, I am going to tell stories. One a week. For 52 weeks.¹ I hope you will join me in this endeavor by reading and highlighting things that stand out to you, sharing and recommending the stories I tell. And if you’d like to participate yourself, read Stella’s announcement or join us in the Writing Cooperative’s Slack community. There are dozens of people joining this challenge and I couldn’t be more excited. Happy New Year! 52 Weeks of Stories52 Week Writing Challengejustincox.com ¹ Well, techincally 51 weeks. This is week one. This week I told you the story of how I decided to tell stories. It counts. Deal with it. Justin Cox tells stories and eats donuts. Follow him on Twitter or buy him a donut. More stories at JustinCox.com. ", "username": "justincox", "parent": "1869"}