{"title": "", "name": "1972_3", "id": "3cecbc8985e5", "creatorid": "cb55958ea3bb", "timestamp": 1492264538309, "child": "", "content": "Hi Kai. Firstly, recognize that those derivatives (df_t/dc_(t-1) as you mentioned and the two others) contain the sigmoid or tanh derivative in them. When we backpropagate from one cell state to the previous, they obviously won’t vanish, as the output of the sigmoid/tanh derivatives aren’t that small. Where they do vanish is when we start having multiple of these tanh/sigmoid derivatives multiplying together. During BPTT—where we need to backprop the error to all timesteps—that’s exactly what happens. Very few timesteps (the latest ones) will receive significant contributions from these terms. Why? Let’s say we backprop the error all the way from the end of the LSTM (the final output) to the very first timestep; the error will propagate through to the final output, which will propagate through to the final cell state, which will propagate to the second last cell state, etc. until it propagates through to the first cell state. When I say “propagate”, I mathematically mean that we apply the chain rule. For example, when we propagate the error to the final output, that would be dJ/dy_final. Let’s assume our sequence is of length 100. Then, the distance between the final cell state and the first cell state is 100 timesteps. When we backpropagate down 100 timesteps, with chain rule, this is basically 100 dc_t/dc_(t-1) derivatives multiplied together — dc_100/dc_99 * dc_99/dc_98 * … * dc_2/dc_1 — and thus a bunch of df_t/dc_(t-1) terms multiplied together — along with the other gate w.r.t. cell state derivatives. That’s 100 of the sigmoid/tanh derivatives for each gate → cell state deriv, and thus you could get gradients on the order of like 0.25¹⁰⁰. Do you understand? I’ve updated the post in that area to make it a bit more clear. ", "username": "mckapur", "parent": "1972"}