{
  "content": "Books that Changed My Perspective This was first published on my mailing list The Looking Glass. Every week, I answer a reader’s question. Photo by Austin Kirk I was wondering if you had any suggestions for books you’ve read that really impacted your life/career? I need to show some restraint in answering this because I could go on for hours talking about books. As I said a few weeks ago, I’m learning to shift my perspective on the value of reading from How many books did I finish? to How much do I retain from each book? Towards that goal, here are my top reads as measured by how often I recall or reference something from that book. (Of course, there is definitely some recency bias here!) Mindset: The New Psychology of Success by Carol Dweck: oh look, another reference to Mindset! Didn’t I talk about this last week? And the week before that? And the month before that? I read this about two years ago and I credit this book with completely changing my relationship with feedback and my personal level of confidence. We humans are capable of extraordinary things, but the biggest blocker we must overcome is our own mindset. Sapiens: A Brief History of Humankind by Yuval Harari: growing up, I always thought history was a boring and useless subject. There were names and dates to recite, events to put in order, and people to do long reports about. Sapiens is the history textbook I wish I had instead — rich, fascinating, thought-provoking, and a love letter to why understanding the past helps us better understand our present and future. There are a thousand wonderful things I learned from this book, but the one I think about every day is the power of narratives and how our collective ability as humans to invent and believe these narratives made us the powerhouse species we are today. The Design of Everyday Things by Don Norman: This is the first design book I ever read and its approachable, funny, and pragmatic lessons have deeply shaped my beliefs on what it means to be a designer. I wrote an ode to design last year where the lessons from this book featured prominently. It was through Don Norman that I first realized design was foremost about function. Whether you have a good or bad experience interacting with anything made by human hands, blame it (or credit it) on the designer. It is our responsibility. Thinking, Fast and Slow by Daniel Kahneman: This one technically shouldn’t be on my list because I haven’t finished it yet — I’m about two-thirds done. But I have been reading it on and off for the past year and every time I graze a few pages, I learn something new. If you want a deep look into human psychology in all its wonders and irrationalities, look no further. I often find myself thinking about some of the implications in my day-to-day — do I only believe this because the narrative is solid in my mind, or do we actually have enough evidence? Can this hard decision actually can be made with expertise, or are we trying to give ourselves too much credit for our ability to sway the future? Are we sticking with the status quo because we are averse to risk or is the better decision to bite the bullet on this change? This book is a bit of a denser read (hence my slow progress) but I’ve loved every bit so far. The Life-Changing Magic of Tidying Up by Marie Kondo: I love this book for its practical advice — how to fold socks! How to think about what books and documents you actually need! How to deal with sentimental items! — but what I truly appreciate about it are the principles behind the advice which apply to more than just tidying. Surround yourself with what you love. Get rid of everything that doesn’t bring you joy. Appreciate things. Every January for the past two years, friends know I embark on a yearly “Cleanuary” to declutter our home and it’s a ritual that feels just right in ushering in the new year. High Output Management by Andy Grove: my favorite management book. I first read it four years ago. Last year I re-read it and got more out of it the second time around. Andy Grove lays out the principles behind good management and they are timeless: How do you measure a manager’s success? How should you approach org-building? What, exactly, is management? The wisdom per page in this short book is remarkable. Lean In by Sheryl Sandberg: to be honest, I didn’t think much about my gender before reading this book. Despite being a rare female in my computer science department and in my workplace, I purposefully tried to ignore the fact that I was in the minority in order to not draw attention to myself. Reading Lean In and learning of all the research around women and leadership in regards to ambition and likability was incredibly sobering. But it made me realize the importance of a few things: I should aim higher; I should surround myself with female role models, and I should do what I can to help other women because the odds are currently stacked against us. Fiction Bonus! Six of Crows by Leigh Bardugo: I’m unabashedly a part of a young adult fiction book club, so if there’s a fantasy, sci-fi, dystopian, or historical novel that features teen protagonists called to save the world under extraordinary circumstances, I’m there. This is my favorite series in recent memory. It’s two books long and features the most lovable band of crooked thieves you will ever meet attempting a heist that is equal parts madness, redemption and glory. Just pure, wonderful storytelling and a rollicking good time. ",
  "title": "Books that Changed My Perspective",
  "timestamp": "Apr 6",
  "tag": [
    "Books",
    "Startup",
    "Design",
    "Product",
    "Learning"
  ],
  "sentences": [{
    "f8df": "Books that Changed My Perspective"
  }, {
    "fdd0": "This was first published on my mailing list The Looking Glass. Every week, I answer a reader’s question."
  }, {
    "a1c1": "Photo by Austin Kirk"
  }, {
    "0b7f": "I was wondering if you had any suggestions for books you’ve read that really impacted your life/career?"
  }, {
    "001e": "I need to show some restraint in answering this because I could go on for hours talking about books. As I said a few weeks ago, I’m learning to shift my perspective on the value of reading from How many books did I finish? to How much do I retain from each book? Towards that goal, here are my top reads as measured by how often I recall or reference something from that book. (Of course, there is definitely some recency bias here!)"
  }, {
    "653b": "Mindset: The New Psychology of Success by Carol Dweck: oh look, another reference to Mindset! Didn’t I talk about this last week? And the week before that? And the month before that? I read this about two years ago and I credit this book with completely changing my relationship with feedback and my personal level of confidence. We humans are capable of extraordinary things, but the biggest blocker we must overcome is our own mindset."
  }, {
    "6c66": "Sapiens: A Brief History of Humankind by Yuval Harari: growing up, I always thought history was a boring and useless subject. There were names and dates to recite, events to put in order, and people to do long reports about. Sapiens is the history textbook I wish I had instead — rich, fascinating, thought-provoking, and a love letter to why understanding the past helps us better understand our present and future. There are a thousand wonderful things I learned from this book, but the one I think about every day is the power of narratives and how our collective ability as humans to invent and believe these narratives made us the powerhouse species we are today."
  }, {
    "253c": "The Design of Everyday Things by Don Norman: This is the first design book I ever read and its approachable, funny, and pragmatic lessons have deeply shaped my beliefs on what it means to be a designer. I wrote an ode to design last year where the lessons from this book featured prominently. It was through Don Norman that I first realized design was foremost about function. Whether you have a good or bad experience interacting with anything made by human hands, blame it (or credit it) on the designer. It is our responsibility."
  }, {
    "4652": "Thinking, Fast and Slow by Daniel Kahneman: This one technically shouldn’t be on my list because I haven’t finished it yet — I’m about two-thirds done. But I have been reading it on and off for the past year and every time I graze a few pages, I learn something new. If you want a deep look into human psychology in all its wonders and irrationalities, look no further. I often find myself thinking about some of the implications in my day-to-day — do I only believe this because the narrative is solid in my mind, or do we actually have enough evidence? Can this hard decision actually can be made with expertise, or are we trying to give ourselves too much credit for our ability to sway the future? Are we sticking with the status quo because we are averse to risk or is the better decision to bite the bullet on this change? This book is a bit of a denser read (hence my slow progress) but I’ve loved every bit so far."
  }, {
    "03c4": "The Life-Changing Magic of Tidying Up by Marie Kondo: I love this book for its practical advice — how to fold socks! How to think about what books and documents you actually need! How to deal with sentimental items! — but what I truly appreciate about it are the principles behind the advice which apply to more than just tidying. Surround yourself with what you love. Get rid of everything that doesn’t bring you joy. Appreciate things. Every January for the past two years, friends know I embark on a yearly “Cleanuary” to declutter our home and it’s a ritual that feels just right in ushering in the new year."
  }, {
    "1d0a": "High Output Management by Andy Grove: my favorite management book. I first read it four years ago. Last year I re-read it and got more out of it the second time around. Andy Grove lays out the principles behind good management and they are timeless: How do you measure a manager’s success? How should you approach org-building? What, exactly, is management? The wisdom per page in this short book is remarkable."
  }, {
    "f6e5": "Lean In by Sheryl Sandberg: to be honest, I didn’t think much about my gender before reading this book. Despite being a rare female in my computer science department and in my workplace, I purposefully tried to ignore the fact that I was in the minority in order to not draw attention to myself. Reading Lean In and learning of all the research around women and leadership in regards to ambition and likability was incredibly sobering. But it made me realize the importance of a few things: I should aim higher; I should surround myself with female role models, and I should do what I can to help other women because the odds are currently stacked against us."
  }, {
    "41c6": "Fiction Bonus! Six of Crows by Leigh Bardugo: I’m unabashedly a part of a young adult fiction book club, so if there’s a fantasy, sci-fi, dystopian, or historical novel that features teen protagonists called to save the world under extraordinary circumstances, I’m there. This is my favorite series in recent memory. It’s two books long and features the most lovable band of crooked thieves you will ever meet attempting a heist that is equal parts madness, redemption and glory. Just pure, wonderful storytelling and a rollicking good time."
  }],
  "author": "Julie Zhuo",
  "child": "0_1\t0_2\t0_3\t0_4\t0_5\t0_6\t0_7\t0_8\t0_9\t0_10\t0_11\t0_12\t0_13\t0_14\t0_15\t0_16\t0_17\t0_18\t0_19\t0_20\t0_21\t0_22\t0_23\t0_24",
  "parent": "",
  "name": "0"
}
