{"parent": "", "title": "Chinese Tour Groups Suck", "author": "Panpan Wang", "sentences": [{"e5db": "Typical Chinese tour group. Photo Credit: Unknown."}, {"06eb": "Chinese Tour Groups Suck"}, {"ddf9": "(In Defense of Chinese Tour Groups)"}, {"e5af": "Chinese Tour Groups Suck."}, {"fd36": "I know this because I’m a Chinese tourist who has traveled in many Chinese tour groups."}, {"f096": "I also think you know this."}, {"ef06": "You’ve seen them around town, haven’t you? In San Francisco. Or Cairo. Or Hong Kong."}, {"b138": "They’re in your way just as you’re walking home on Market St. from your startup. You have Bose wireless on, tuning out the city that you *love* but never want to hear at 6PM on a Wednesday. You’re carrying your MacBook Pro inside of a neutral-colored Herschel bag, which are made by artisans (a few thousand factory workers) practicing their traditional Saskatchewan (Guangzhou, Chinese) craftsmanship (of hipster fabric manipulation). These tourists are not wearing any of these things."}, {"f34c": "Chinese tour groups are large."}, {"f551": "Always a Greyhound’s worth, at a minimum."}, {"0aac": "They’re loud. I mean, just listen to them shout so… foreignly. Especially in restaurants. They wave little flags. They wear those red, or blue, or otherwise brightly colored hats. They pile on chartered busses and take over hotels."}, {"1d0c": "Why do they spend so much of their time in the Apple Store? Why aren’t they exploring? Don’t they have Lonely Planets in China? God, I really admire Anthony Bourdain. I love how he always eats at local spots. That’s what I try to do. That’s my kind of travel."}, {"092b": "Ugh. Why do Chinese tourists suck so much?"}, {"876f": "Who Is A Chinese Tourist?"}, {"f171": "You were born in 1954. The People’s Liberation Army and your comrades north of the Yalu River just defeated the Evil Empire in the War of Korean Liberation."}, {"0ec4": "You’re named Ping, which means Peace. Millions born in your time are also homages to peace."}, {"539d": "It’s 1960. You’re six years old and the eldest of four. The family learns that your mom’s cousin in the nearby village just died. Mom and Dad told you that he got sick. Later you learn that he died of starvation along with 50 million other comrades in what was the largest man-made disaster in history."}, {"6c61": "A famine of more-than-biblical proportions."}, {"c47b": "As an adult you calculate that this would be like everyone in California and Illinois dying in four short — yet unimaginably long — years."}, {"6458": "You and your brothers get one egg each to eat as your protein for the week. Your parents’ protein intake is de-prioritized. This is because you live in the provincial capital of Henan and because your family is prosperous. You guiltily savor your friends’ jealousy of your single egg. Even though The Great Famine rages in the country-side — which is to say most of China — you get animal protein."}, {"5176": "You feel like an emperor when you see that precious yolk every Sunday evening."}, {"4792": "You never leave a kernel of rice on your plate, and it never occurs to you to complain about dinner."}, {"2815": "It’s 1970. You’re 16 years old. You’re regularly bullied because your mother was a teacher, and your father was a principal. They shut down all schools except for elementary ones four years ago at the start of the Cultural Revolution, so the spit on the back of your head is from the neighborhood children and adults, not your classmates."}, {"c3dc": "Your family is considered part of the intelligentsia class. Your peers are part of the Red Guard. They spy on families and tell the local Communist Party members which neighbors are not adhering to the thousands of dictates and philosophies described in the Chairman’s Red Book."}, {"0c21": "You never know when you might run afoul of The Little Red Book."}, {"5044": "There’s no such thing as civil society any more. Family members barely trust one another. Let alone neighbors. Let alone strangers."}, {"6304": "One day, they come for you."}, {"b3a0": "You’re sent to a labor camp. Like your appreciation of your Sunday eggs, you’re thankful for how lucky you are! You only have to go 50 miles away from home. But you’ve never been more than five miles away from the apartment block, so it might as well be the Gobi."}, {"3c4b": "You’re taught that every spade shoveled from the earth helps liberate people of the Earth. You learn that every brick you lay is one step closer to a palatial communist paradise."}, {"3f03": "You believe it. You believe it with all your heart."}, {"ebc4": "Photo taken by my dad of me and my mom at his labor camp in 1986, 10 years after leaving it. I’m sucking on a sugar cane."}, {"2a23": "For some reason you decide to use the little free time you have to study. For what purpose you’re not sure, but you decide to study English. You find a tattered textbook. The only other comrade in your battalion who reads is a Uighur; a Muslim minority group from central Asia and China. While you practice your vowels and consonants, he reads and recites the Quran. He does this in secret since religion is banned. You say nothing to others in the camp. Both of you struggle to see below the flickering 40 watt street lamp, which is the only one in a two mile radius."}, {"c5a9": "You do this every night for six years."}, {"23ef": "It’s 1976. The Great Chairman is dead. You weep. Everyone you know weeps. You seem to weep forever. The Revolution has finished revolving."}, {"10a3": "But hark! The Party is always looking out for The People!"}, {"284f": "They’ve re-started the universities. You haven’t gone to school in 7 years, but you take the entrance exam. Miraculously, out of the tens of millions of applicants, you are one of the <10% who get accepted. Because you got an impressive 32% on the English section, your major is pre-determined."}, {"0dc5": "You begin what will be a five year career as an interpreter in the provincial Foreign Affairs office."}, {"d33f": "You’re 31. For the first time in your life you escape the grip of terrestrial gravity, and the numbers 7–4–7 will never be just numerals to you again."}, {"00ab": "You’re on a mission to the land of Corruption and Capitalism. And possibly baby-killers. You don’t know for sure, but you’ve heard rumors."}, {"3bf8": "Your first stop is Old Gold Mountain. Your dictionary says it’s called San Fran Sisco. You’re supposed to be a diplomat, but really, you have this inkling of desire."}, {"48d0": "This urge."}, {"7666": "Like you want to be a tourist."}, {"3aef": "My Dad is a Chinese Tourist."}, {"c9b8": "This was my father’s story."}, {"24de": "Two years ago I picked up Dad from SFO on one of his frequent trips to the US, and we were driving down Portola. A view that can be appreciated by anyone of any culture."}, {"874e": "“I remember this drive,” He said to me in the car."}, {"81d5": "“Oh?”"}, {"e5cf": "“This was my first drive in a Ford, and the first view of an American city that I ever had.”"}, {"7118": "“What else do you remember about your first time in the US?”"}, {"3ec7": "I remember there being a lot of cars. Everywhere there were cars. That was impressive. And I remember the grocery store. So many choices! My first impression of America was that it was a land of cars. The second, that it was a land of consumer products."}, {"cd36": "Dad wasn’t in a tour group back then. But his story is not unique. With 1.4 billion people, hardly anything or anyone is unique in China. And if that statement strikes you as callous or strange, because you believe that we are all unique, or whatever…, then you may not appreciate the communal/Confucian ethics of The Orient and how it contrasts with the individual/Aristotelian ethics that we adhere to in the Greco-Roman tradition."}, {"b23e": "I Am A Chinese Tourist."}, {"f851": "I used to live in Hong Kong, but I was there recently on vacation. While at the top of The Peak having a coffee I struck up a conversation with woman who had been living in Central for over a decade but is from Australia."}, {"dc05": "She had a dog and was very kind to him."}, {"4bf4": "Given her cosmopolitan persona and fondness for canines I was optimistic about the exchange. I asked about the changes she’s seen in Hong Kong since being a resident. We spoke of political evolution, freedom of speech, and real estate prices."}, {"a014": "Then the conversation turned, as it usually does with Hong Kong residents, towards The Mainland Chinese."}, {"d9f0": "“There’s just so many of them”, she said. “They do all their luxury shopping here because it’s cheaper than on the mainland. Busloads of them. And it’s just getting worse.”"}, {"7b36": "I had already told her that I was born in mainland China in the same town as my father. I do not recall professing a deep self-loathing or otherwise invite this malice."}, {"4261": "But yet she very matter-of-factly said this with little self-awareness and even less empathy for millions of humans than she showed to her dog."}, {"9b44": "The generalization was personal, and her disgust towards mainlanders was unmistakable. It was an automatic, unconscious response to the infestation of mainlanders descending on her adopted home. Her sentiment is common: in Hong Kong many citizens literally refer to mainlanders as locusts."}, {"16f4": "A plague of imperial proportions."}, {"1d0b": "When SARS hit China it hit Hong Kong the hardest. Tourism and real estate, twin pillars of Hong Kong’s economy, cratered. Chinese tourism and money from the public and private sectors poured in and effectively staved off an even greater recession.*"}, {"4f55": "Now that China has opened up its borders, the message from many Hong Kong residents to mainlanders — not just the government, but the people themselves — is simple: STAY OUT."}, {"9145": "Parisians, Vancouverites, and San Franciscans may feel similarly. But Louis Vitton, Gucci and Apple (AAPL: 143.34) don’t seem to care. I’ve talked to many local businesses all over the world who complain about the Chinese, but who readily accept their cash."}, {"6d5e": "*I’m glossing over complex economic interconnectedness and political realities and addressing merely the sentiment of one people towards another people, not their governments or policies."}, {"cc92": "We Are All Chinese Tourists"}, {"a0ca": "Nowadays there’s a fetishization of the “traditional”, and a premium placed on the authentic. Readers on Medium, especially, extoll the “authentic”."}, {"6f85": "Authentic local food. Authentic connections. Authentic experiences. And none more exhausting and self-defeating than Authentic Travel."}, {"2527": "Perhaps you’ve read the same articles that I have. Like the one by a traveler who visited Cuba c. Nov 2016 who wanted to get their “before it’s ruined” by everyone who comes after her."}, {"ad94": "Or the solo backpacker who lived in a village in Togo and made bracelets with the female ‘villagers’. (They refer to themselves as ‘people’, btw). Now he sells the bracelets online, 100% of every purchase going back to that village!"}, {"9665": "OK, now I’m just being cynical and mean."}, {"5388": "But the point is this:"}, {"4591": "Along the false dichotomy of Authentic vs. Inauthentic, who is to judge which is which? And why are we judging others’ experiences in the first place?"}, {"f204": "If a historian two hundred years from now were to document the “authentic” China and the “authentic” America of today, I suspect they would dedicate more paragraphs to the Nike and Foxconn factories of Guangzhou — pistons of a global economic engine — than they would the Forbidden City or old Hutong alleyways of Beijing. More footnotes on the decline of Detroit and our failing inner city public schools than on the Grand Canyon and Lady Liberty."}, {"7e56": "On my last trip to Thailand I hired a private driver and his Land Cruiser to chauffeur me and my partner a couple hundred kilometers. We stayed at a four star boutique hotel (staffed by traditional local villagers/vegans, of course!), but also slept on the floor of an orphanage one night."}, {"9e74": "How do you think we netted out on our travel authenticity index?"}, {"cb40": "Mark Twain said,"}, {"99f6": "Travel is fatal to prejudice, bigotry, and narrow-mindedness, and many of our people need it sorely on these accounts. Broad, wholesome, charitable views of men and things cannot be acquired by vegetating in one little corner of the earth all one’s lifetime."}, {"a8bb": "Isn’t this part of why we all travel and want others to travel? To expand our horizons? To come back a little different than when we left?"}, {"c682": "We should certainly neither applaud nor forgive littering on the streets and rudeness to wait-staff by anyone."}, {"91d1": "At the same time, how should we judge those who don’t like to queue up in your country when food rationing was still thing until 1996 in theirs? For whom bumping into you on the street is typical behavior in their congested home town of 11 million people with a sink-or-swim daily reality and where ‘personal space’ is a contradiction in terms?"}, {"402b": "Should we reprimand those who quite possibly spent a lifetime under oppression and have only recently eeked out the means to see a world that they’ve been told is the enemy for traveling by bus with a group of friends?"}, {"fec9": "Who wear colored hats because getting lost in a country where they don’t speak the language would cause a panic attack?"}, {"dd48": "Source: World Bank"}, {"e848": "Americans have a carbon footprint of 16 metric tons per person per year."}, {"3f0e": "Chinese citizens generated one metric ton per year in 1960. Today Chinese folks produce seven metric tons per year per person on average.*"}, {"2176": "If you do a couple of LAX-JFK trips a year plus an international work trip or two like I do, you blow either of these country’s averages out of the water."}, {"a8a5": "Who, then, is a bigger drain on our collective resources? Me and my fellow global citizens savoring our avocado toast and rosé with brunch, burning high octane jet fuel on eco-friendly Dreamliners like it’s our job — because it sort of is?"}, {"013a": "Or the family of three visiting Las Vegas for the first and only time? Who will talk about — for the rest of their lives — their stay at Circus! Circus! with fond memories and “tacky” paraphernalia."}, {"d6b5": "Whose lives are changed more and, potentially, for the better?"}, {"4ec3": "I’m not suggesting Blackjack Bobby Chen is a better traveler than me. Or vice versa."}, {"566b": "I’m suggesting it’s not my place to judge."}, {"e85d": "My Mom Is A Chinese Tourist"}, {"24f1": "My mom is effervescent and charming. She’s spent the second half of her life in Kansas and California. She will never live in China again because she says, “The people are rude, and it’s too dirty and crowded.”"}, {"ebaf": "When I lived in Saudi Arabia and the UAE she came by herself and visited me for a week. During my days at work she explored the souks and chatted with men, which I told her was a tad out of the ordinary, but awesome."}, {"ef03": "My mom with slightly confused but happy shopkeepers in Dubai. Complete with awkward arm wrap."}, {"7471": "Despite her Dora-like penchant for exploration, she still craves Chinese food if she doesn’t have it for more than two days. It turns out, she’s also not a big fan of chickpeas."}, {"351a": "“Do we have to eat this ‘hoommus’ again? It’s sort of like mud.”"}, {"d510": "When we were in Jerusalem I Yelped a Chinese restaurant for lunch one day. It was pretty terrible, but it was exactly what she and I both wanted."}, {"14a6": "Mom is still more comfortable speaking Chinese even though she’s medium-fluent in English. She’s resourceful, and would be able to get by in most places, but she doesn’t get why I travel to some developing countries for fun."}, {"4b74": "“Vietnam is so poor!” She exclaimed when I told her I was going to there for a month."}, {"b900": "“We left China to leave that behind. No, thank you. I’ve seen enough poverty for one lifetime.”"}, {"1466": "She and her husband now aspire to travel twice a year. Their most recent trip was to Alaska on a Carnival Cruise. They couldn’t get enough of the crab legs at the buffet. Chinese people love buffets with crab legs. Especially Alaskan crab legs in Alaska."}, {"aefc": "This year they want to go to Spain with some friends."}, {"b907": "And look; I get it. Some tour groups who happen to be Chinese do suck sometimes."}, {"311e": "But this year for my mom’s 61st birthday I will gift her that trip to Spain."}, {"6cde": "And it will be with a Chinese tour group. 攀攀"}, {"df88": "You made it! Click that ❤. It’s soooo easy :)"}, {"b5f1": "哇塞！您完成了！请按 ❤."}], "content": "Typical Chinese tour group. Photo Credit: Unknown. Chinese Tour Groups Suck (In Defense of Chinese Tour Groups) Chinese Tour Groups Suck. I know this because I’m a Chinese tourist who has traveled in many Chinese tour groups. I also think you know this. You’ve seen them around town, haven’t you? In San Francisco. Or Cairo. Or Hong Kong. They’re in your way just as you’re walking home on Market St. from your startup. You have Bose wireless on, tuning out the city that you *love* but never want to hear at 6PM on a Wednesday. You’re carrying your MacBook Pro inside of a neutral-colored Herschel bag, which are made by artisans (a few thousand factory workers) practicing their traditional Saskatchewan (Guangzhou, Chinese) craftsmanship (of hipster fabric manipulation). These tourists are not wearing any of these things. Chinese tour groups are large. Always a Greyhound’s worth, at a minimum. They’re loud. I mean, just listen to them shout so… foreignly. Especially in restaurants. They wave little flags. They wear those red, or blue, or otherwise brightly colored hats. They pile on chartered busses and take over hotels. Why do they spend so much of their time in the Apple Store? Why aren’t they exploring? Don’t they have Lonely Planets in China? God, I really admire Anthony Bourdain. I love how he always eats at local spots. That’s what I try to do. That’s my kind of travel. Ugh. Why do Chinese tourists suck so much? Who Is A Chinese Tourist? You were born in 1954. The People’s Liberation Army and your comrades north of the Yalu River just defeated the Evil Empire in the War of Korean Liberation. You’re named Ping, which means Peace. Millions born in your time are also homages to peace. It’s 1960. You’re six years old and the eldest of four. The family learns that your mom’s cousin in the nearby village just died. Mom and Dad told you that he got sick. Later you learn that he died of starvation along with 50 million other comrades in what was the largest man-made disaster in history. A famine of more-than-biblical proportions. As an adult you calculate that this would be like everyone in California and Illinois dying in four short — yet unimaginably long — years. You and your brothers get one egg each to eat as your protein for the week. Your parents’ protein intake is de-prioritized. This is because you live in the provincial capital of Henan and because your family is prosperous. You guiltily savor your friends’ jealousy of your single egg. Even though The Great Famine rages in the country-side — which is to say most of China — you get animal protein. You feel like an emperor when you see that precious yolk every Sunday evening. You never leave a kernel of rice on your plate, and it never occurs to you to complain about dinner. It’s 1970. You’re 16 years old. You’re regularly bullied because your mother was a teacher, and your father was a principal. They shut down all schools except for elementary ones four years ago at the start of the Cultural Revolution, so the spit on the back of your head is from the neighborhood children and adults, not your classmates. Your family is considered part of the intelligentsia class. Your peers are part of the Red Guard. They spy on families and tell the local Communist Party members which neighbors are not adhering to the thousands of dictates and philosophies described in the Chairman’s Red Book. You never know when you might run afoul of The Little Red Book. There’s no such thing as civil society any more. Family members barely trust one another. Let alone neighbors. Let alone strangers. One day, they come for you. You’re sent to a labor camp. Like your appreciation of your Sunday eggs, you’re thankful for how lucky you are! You only have to go 50 miles away from home. But you’ve never been more than five miles away from the apartment block, so it might as well be the Gobi. You’re taught that every spade shoveled from the earth helps liberate people of the Earth. You learn that every brick you lay is one step closer to a palatial communist paradise. You believe it. You believe it with all your heart. Photo taken by my dad of me and my mom at his labor camp in 1986, 10 years after leaving it. I’m sucking on a sugar cane. For some reason you decide to use the little free time you have to study. For what purpose you’re not sure, but you decide to study English. You find a tattered textbook. The only other comrade in your battalion who reads is a Uighur; a Muslim minority group from central Asia and China. While you practice your vowels and consonants, he reads and recites the Quran. He does this in secret since religion is banned. You say nothing to others in the camp. Both of you struggle to see below the flickering 40 watt street lamp, which is the only one in a two mile radius. You do this every night for six years. It’s 1976. The Great Chairman is dead. You weep. Everyone you know weeps. You seem to weep forever. The Revolution has finished revolving. But hark! The Party is always looking out for The People! They’ve re-started the universities. You haven’t gone to school in 7 years, but you take the entrance exam. Miraculously, out of the tens of millions of applicants, you are one of the <10% who get accepted. Because you got an impressive 32% on the English section, your major is pre-determined. You begin what will be a five year career as an interpreter in the provincial Foreign Affairs office. You’re 31. For the first time in your life you escape the grip of terrestrial gravity, and the numbers 7–4–7 will never be just numerals to you again. You’re on a mission to the land of Corruption and Capitalism. And possibly baby-killers. You don’t know for sure, but you’ve heard rumors. Your first stop is Old Gold Mountain. Your dictionary says it’s called San Fran Sisco. You’re supposed to be a diplomat, but really, you have this inkling of desire. This urge. Like you want to be a tourist. My Dad is a Chinese Tourist. This was my father’s story. Two years ago I picked up Dad from SFO on one of his frequent trips to the US, and we were driving down Portola. A view that can be appreciated by anyone of any culture. “I remember this drive,” He said to me in the car. “Oh?” “This was my first drive in a Ford, and the first view of an American city that I ever had.” “What else do you remember about your first time in the US?” I remember there being a lot of cars. Everywhere there were cars. That was impressive. And I remember the grocery store. So many choices! My first impression of America was that it was a land of cars. The second, that it was a land of consumer products. Dad wasn’t in a tour group back then. But his story is not unique. With 1.4 billion people, hardly anything or anyone is unique in China. And if that statement strikes you as callous or strange, because you believe that we are all unique, or whatever…, then you may not appreciate the communal/Confucian ethics of The Orient and how it contrasts with the individual/Aristotelian ethics that we adhere to in the Greco-Roman tradition. I Am A Chinese Tourist. I used to live in Hong Kong, but I was there recently on vacation. While at the top of The Peak having a coffee I struck up a conversation with woman who had been living in Central for over a decade but is from Australia. She had a dog and was very kind to him. Given her cosmopolitan persona and fondness for canines I was optimistic about the exchange. I asked about the changes she’s seen in Hong Kong since being a resident. We spoke of political evolution, freedom of speech, and real estate prices. Then the conversation turned, as it usually does with Hong Kong residents, towards The Mainland Chinese. “There’s just so many of them”, she said. “They do all their luxury shopping here because it’s cheaper than on the mainland. Busloads of them. And it’s just getting worse.” I had already told her that I was born in mainland China in the same town as my father. I do not recall professing a deep self-loathing or otherwise invite this malice. But yet she very matter-of-factly said this with little self-awareness and even less empathy for millions of humans than she showed to her dog. The generalization was personal, and her disgust towards mainlanders was unmistakable. It was an automatic, unconscious response to the infestation of mainlanders descending on her adopted home. Her sentiment is common: in Hong Kong many citizens literally refer to mainlanders as locusts. A plague of imperial proportions. When SARS hit China it hit Hong Kong the hardest. Tourism and real estate, twin pillars of Hong Kong’s economy, cratered. Chinese tourism and money from the public and private sectors poured in and effectively staved off an even greater recession.* Now that China has opened up its borders, the message from many Hong Kong residents to mainlanders — not just the government, but the people themselves — is simple: STAY OUT. Parisians, Vancouverites, and San Franciscans may feel similarly. But Louis Vitton, Gucci and Apple (AAPL: 143.34) don’t seem to care. I’ve talked to many local businesses all over the world who complain about the Chinese, but who readily accept their cash. *I’m glossing over complex economic interconnectedness and political realities and addressing merely the sentiment of one people towards another people, not their governments or policies. We Are All Chinese Tourists Nowadays there’s a fetishization of the “traditional”, and a premium placed on the authentic. Readers on Medium, especially, extoll the “authentic”. Authentic local food. Authentic connections. Authentic experiences. And none more exhausting and self-defeating than Authentic Travel. Perhaps you’ve read the same articles that I have. Like the one by a traveler who visited Cuba c. Nov 2016 who wanted to get their “before it’s ruined” by everyone who comes after her. Or the solo backpacker who lived in a village in Togo and made bracelets with the female ‘villagers’. (They refer to themselves as ‘people’, btw). Now he sells the bracelets online, 100% of every purchase going back to that village! OK, now I’m just being cynical and mean. But the point is this: Along the false dichotomy of Authentic vs. Inauthentic, who is to judge which is which? And why are we judging others’ experiences in the first place? If a historian two hundred years from now were to document the “authentic” China and the “authentic” America of today, I suspect they would dedicate more paragraphs to the Nike and Foxconn factories of Guangzhou — pistons of a global economic engine — than they would the Forbidden City or old Hutong alleyways of Beijing. More footnotes on the decline of Detroit and our failing inner city public schools than on the Grand Canyon and Lady Liberty. On my last trip to Thailand I hired a private driver and his Land Cruiser to chauffeur me and my partner a couple hundred kilometers. We stayed at a four star boutique hotel (staffed by traditional local villagers/vegans, of course!), but also slept on the floor of an orphanage one night. How do you think we netted out on our travel authenticity index? Mark Twain said, Travel is fatal to prejudice, bigotry, and narrow-mindedness, and many of our people need it sorely on these accounts. Broad, wholesome, charitable views of men and things cannot be acquired by vegetating in one little corner of the earth all one’s lifetime. Isn’t this part of why we all travel and want others to travel? To expand our horizons? To come back a little different than when we left? We should certainly neither applaud nor forgive littering on the streets and rudeness to wait-staff by anyone. At the same time, how should we judge those who don’t like to queue up in your country when food rationing was still thing until 1996 in theirs? For whom bumping into you on the street is typical behavior in their congested home town of 11 million people with a sink-or-swim daily reality and where ‘personal space’ is a contradiction in terms? Should we reprimand those who quite possibly spent a lifetime under oppression and have only recently eeked out the means to see a world that they’ve been told is the enemy for traveling by bus with a group of friends? Who wear colored hats because getting lost in a country where they don’t speak the language would cause a panic attack? Source: World Bank Americans have a carbon footprint of 16 metric tons per person per year. Chinese citizens generated one metric ton per year in 1960. Today Chinese folks produce seven metric tons per year per person on average.* If you do a couple of LAX-JFK trips a year plus an international work trip or two like I do, you blow either of these country’s averages out of the water. Who, then, is a bigger drain on our collective resources? Me and my fellow global citizens savoring our avocado toast and rosé with brunch, burning high octane jet fuel on eco-friendly Dreamliners like it’s our job — because it sort of is? Or the family of three visiting Las Vegas for the first and only time? Who will talk about — for the rest of their lives — their stay at Circus! Circus! with fond memories and “tacky” paraphernalia. Whose lives are changed more and, potentially, for the better? I’m not suggesting Blackjack Bobby Chen is a better traveler than me. Or vice versa. I’m suggesting it’s not my place to judge. My Mom Is A Chinese Tourist My mom is effervescent and charming. She’s spent the second half of her life in Kansas and California. She will never live in China again because she says, “The people are rude, and it’s too dirty and crowded.” When I lived in Saudi Arabia and the UAE she came by herself and visited me for a week. During my days at work she explored the souks and chatted with men, which I told her was a tad out of the ordinary, but awesome. My mom with slightly confused but happy shopkeepers in Dubai. Complete with awkward arm wrap. Despite her Dora-like penchant for exploration, she still craves Chinese food if she doesn’t have it for more than two days. It turns out, she’s also not a big fan of chickpeas. “Do we have to eat this ‘hoommus’ again? It’s sort of like mud.” When we were in Jerusalem I Yelped a Chinese restaurant for lunch one day. It was pretty terrible, but it was exactly what she and I both wanted. Mom is still more comfortable speaking Chinese even though she’s medium-fluent in English. She’s resourceful, and would be able to get by in most places, but she doesn’t get why I travel to some developing countries for fun. “Vietnam is so poor!” She exclaimed when I told her I was going to there for a month. “We left China to leave that behind. No, thank you. I’ve seen enough poverty for one lifetime.” She and her husband now aspire to travel twice a year. Their most recent trip was to Alaska on a Carnival Cruise. They couldn’t get enough of the crab legs at the buffet. Chinese people love buffets with crab legs. Especially Alaskan crab legs in Alaska. This year they want to go to Spain with some friends. And look; I get it. Some tour groups who happen to be Chinese do suck sometimes. But this year for my mom’s 61st birthday I will gift her that trip to Spain. And it will be with a Chinese tour group. 攀攀 You made it! Click that ❤. It’s soooo easy :) 哇塞！您完成了！请按 ❤. ", "name": "10", "child": "10_1\t10_2\t10_3\t10_4\t10_5\t10_6\t10_7\t10_8\t10_9\t10_10\t10_11\t10_12\t10_13\t10_14\t10_15\t10_16\t10_17\t10_18\t10_19\t10_20\t10_21\t10_22\t10_23\t10_24\t10_2510_1\t10_2\t10_3\t10_4\t10_5\t10_6\t10_7\t10_8\t10_9\t10_10\t10_11\t10_12\t10_13\t10_14\t10_15\t10_16\t10_17\t10_18\t10_19\t10_20\t10_21\t10_22\t10_23\t10_24\t10_2510_1\t10_2\t10_3\t10_4\t10_5\t10_6\t10_7\t10_8\t10_9\t10_10\t10_11\t10_12\t10_13\t10_14\t10_15\t10_16\t10_17\t10_18\t10_19\t10_20\t10_21\t10_22\t10_23\t10_24\t10_2510_1\t10_2\t10_3\t10_4\t10_5\t10_6\t10_7\t10_8\t10_9\t10_10\t10_11\t10_12\t10_13\t10_14\t10_15\t10_16\t10_17\t10_18\t10_19\t10_20\t10_21\t10_22\t10_23\t10_24\t10_25", "timestamp": "Apr 10"}