{"parent": "", "title": "He Wears His Heart on His Shots", "author": "Katie Baker", "sentences": [{"a430": "He Wears His Heart on His Shots"}, {"172d": "Klay Thompson isn’t the most famous or highly paid Warrior. He’s certainly not the most effusive. But instead of giving up touches on Golden State’s increasingly super superteam, the understated sharpshooter has found a way to become more valuable than ever — one furrowed brow at a time."}, {"8486": "Klay Thompson is feeling great, though sometimes it can be hard to tell. As the Warriors’ sixth-year shooting guard walks off the court following a morning shootaround in early April at Golden State’s downtown Oakland practice facility, his expression is characteristically opaque: not Resting Bitch Face, exactly, but definitely Resting Furrowed Brow. Whether he’s standing at the free throw line or sitting behind a table signing memorabilia for fans, Thompson tends to present as a little bit skeptical or a little bit befuddled. When, on March 12, a fan named Ronnie handed over a toaster for a signature during an autograph session at an Old Navy, a photo of Thompson’s seemingly perplexed reaction went viral. But really, that’s the way he usually looks."}, {"6d40": "Until the penultimate game of the regular season, a 105–99 loss to the Jazz during which Thompson sat out to rest, the Warriors hadn’t dropped a game since Thompson signed that toaster, winning 14 in a row. With one game to go before the playoffs commence, the Dubs sit at 66–15 overall, the no. 1 seed in the West already secured. During the post-toaster streak, head coach Steve Kerr canceled the team’s Monday, April 3, practice to give his guys a well-deserved day off, which was great for Thompson, who knows how to kick back with the best of them. (During a KNBR radio interview last July, Thompson gave some insight into his relaxing ways, saying: “Honestly, soccer and golf, like I love taking a nap to both of these sports. Because you can casually watch, and casually tune in, you know?”) As Ron Adams, a Warriors assistant coach, says of his shooting guard, “He loves to score, and he loves to win, and he loves his free time. His equation for life is pretty darn good.”"}, {"a1ea": "When Thompson returns to the gym after his day off, the first thing he says after the shootaround, as he sits down on a thick padded gym mat next to the practice courts, is: “Oh, it’s going great. I love this weather.” It has been nice the past few days, sunny and in the 70s, a welcome change after a long winter of atmospheric rivers and drought-busting rains and general meteorological gloom in the Bay Area. With his newfound free time, Thompson took his beloved bulldog, Rocco, to Muir Beach in Sausalito — “such a really nice, beautiful area,” Thompson says, his face almost getting animated — and then attended the Oakland A’s Opening Day game. As TV cameras zoomed in on Thompson and a buddy in the stands of the Coliseum, which is next door to the Warriors’ Oracle Arena home, the broadcast team mused: “I think he could shoot a 3-pointer right now. From there.”"}, {"1692": "With just one game remaining in the regular season, Thompson is averaging a career-high 22.5 points and is once again shooting better than 40 percent from 3-point land — all while defending some of the most dangerous players in the league. He is having perhaps the finest season of his career, a span that already includes three All-Star Game appearances, an NBA title and nearly another, a 3-point contest victory (over teammate Steph Curry), an All-Rookie nod, an Olympic gold medal, a record-setting 37 points in a single quarter in 2015, a career-high 60 points in 29 minutes last fall, and a remark from then-president Obama that Thompson’s jump shot is “actually a little prettier” than Curry’s. (The Ringer’s Danny Chau would agree.)"}, {"da35": "And as the Warriors prepare to mount another title run, what makes the 27-year-old’s recent play all the more impressive is that, entering the season, the biggest question related to Klay Thompson wasn’t how many points he might score — it was how many he might be forced to give up."}, {"7e1b": "When then-free-agent Kevin Durant hunkered down in the Hamptons this summer to figure out where he wanted to play, Thompson was part of the Warriors contingent that paid him a visit July 1. (Durant joked to KNBR that the group of Curry, Thompson, Draymond Green, and Andre Iguodala were so tight that they “all walked in and it looked like they were holding hands.”) Durant chose Golden State on the Fourth of July, and once majority owner Joe Lacob finished celebrating the news from his vacation home in Montana, he told KNBR, his first thought was about the nuts and bolts of fitting in another star: “What we got to do now?”"}, {"98b8": "Kevin Durant on the Moment When He Thought His Season Was Over“I just burst out crying,” the All-Star says of his reaction to thinking he’d broken his tibiatheringer.com"}, {"e704": "Adding Durant to a stacked franchise coming off a record-setting 73-win regular season was exhilarating but also mildly worrisome. On the one hand, it’s Durant, end of story. On the other, why monkey with chemistry and mess with success? During his years in Oklahoma City, Durant took between 17 and 21 shots per game, and fitting in that kind of volume on a team that was third in the league in field goal attempts the season prior would be no easy task."}, {"c571": "But Thompson bristled at suggestions that he might be one of the players who would have to relinquish some touches in order to clear space for Durant. “I feel kind of disrespected that people keep using the term ‘sacrifice’ to describe me and describe us,” he told The Vertical’s Shams Charania in August. “We all want to see each other do well. But I’m not sacrificing shit, because my game isn’t changing. I’m still going to try to get buckets, hit shots, come off screens. I want to win and have a fun time every game we play.”"}, {"72d6": "Indeed, Thompson hasn’t sacrificed shit. His game hasn’t changed — except to get even better. Somehow, despite being on a team with Curry and Green and Iguodala and Durant, Thompson is averaging more shot attempts this season, 17.7, than he ever has before. In addition to his 3-point prowess, his shorter-range game has become more of a threat; he makes 51.7 percent of the 2-point shots he puts up, and that number has gone up in each season since 2013. Meanwhile, Durant, who returned to the Warriors on April 8 after sitting out 19 games with a knee injury, is the one taking fewer shots per game than he’s used to."}, {"e648": "“You gotta give Kevin a lot of credit,” Thompson says, “because, his style of play? He would fit in anywhere, and especially here. He fits so perfectly because he doesn’t need to dominate the ball to be a force. I think he’s averaging his least amount of field goal attempts, maybe even in his career, but it might be one of his more efficient seasons.” (He’s right: Durant’s 16.6 shots per game are his lowest since entering the league, but his 53.5 field goal percentage is his best.) “With Kevin now,” Thompson says, “we have obviously three guys, with me, Kev and Steph, who can have a big night on any given night and so draw a lot of attention. Dray is like the key that unlocks everything we do, because he’s so versatile. We’ve got guys like Andre and Shaun, and you can’t forget about the bigs who get us open, like Zaza and JaVale. We have such a unique talent pool on this team.”"}, {"ca9c": "That embarrassment of riches, though, initially led to some doubts around the league; the concern-trolly assessment “there’s only one basketball” became a frequent refrain. During the same KNBR appearance where Thompson talked happily about naps, he was also asked about the “one basketball” dig."}, {"9743": "“There’s one ball,” he responded. “Guess what we’ll do? We’ll put it in the hoop.”"}, {"1e9e": "Thompson puts the ball in the hoop a hell of a lot, and when he really gets going, it’s impossible to look away. He can receive and release the ball faster and more cleanly than anyone else: 11.6 of his points per game this season are considered catch-and-shoot, the most in the league; the second-place player, Dirk Nowitzki, gets 7.9 points per game that way. Thompson can step dramatically back and launch up an off-balance swish; he can even occasionally convert a setup from Curry into a high-flying, one-handed dunk. Earlier this season, against the Pacers, Thompson popped off for 60 points, a career-high for him and a rough night for his former Warriors captain, Monta Ellis, whom he lit entirely up. As a testament to Thompson’s speedy, lethal release, ESPN’s Tom Haberstroh and Brian Windhorst calculated that Thompson dribbled just 11 times on those 60 points, and that he had the ball in his hands for just a minute and a half total."}, {"aed3": "And last year, in the Western Conference finals against Durant’s Thunder, Thompson practically single-handedly saved the Warriors season, hitting 11 3-pointers in a Game 6 comeback effort. Thompson’s performance earned a tremendously dorky We Are Not Worthy display from Lacob in the tunnel after the game, and the Warriors went on to win the series in seven."}, {"9746": "“He just has got no conscience,” says big man JaVale McGee. (Warriors guard Ian Clark offers an uncannily similar assessment: “He doesn’t have a conscience.”) “He can shoot anywhere, over everybody,” says McGee. “Somebody can be right in his face and he’ll shoot and it will go in. Anyone else it would be like, ‘That’s a bad shot.’ But he makes the bad shots. So those are good shots for him.”"}, {"ee99": "Thompson’s perimeter play doesn’t just stand out on offense, however. A number of his teammates and coaches are quick to point out that defensively, he has some of the most important assignments around the arc. After his rookie season, Thompson spent a month in the Bay Area working with coaches specifically on his defense. (“That helped a lot,” he says.) “He’s definitely in shape,” says Clark, “and he has to be, to be able to guard one, two, three, sometimes four men while switching. We do a lot of switching. He can guard both sides.” Thompson says he’s lucky to be “blessed with stamina,” and rattles off a greatest hits of NBA players, ranging from Russell Westbrook and James Harden to C.J. McCollum and LeBron James, when asked whom he most enjoys defending."}, {"9ccb": "“Klay is one of those guys,” Adams says, “who never gets enough credit for what he does. Let’s think about what he does. He guards, in many cases, the best perimeter player on the other team. Might be a point guard, might be an off-guard. So he has tremendous defensive responsibilities to begin a game. And he’s pretty much relentless from start to finish. Yeah, he’ll lose focus on a play or two, but it’s amazing the energy that he’s putting into the defensive end guarding a significant, if not the significant, player on the other team, as well as playing his offense.”"}, {"c913": "According to the NBA’s SportVU speed-and-distance metric, which tracks a player’s movement around the court, Thompson covers 2.45 miles of ground during a game, 12th-most in the league, thanks to all of his looping, quick cuts, and rangy defense. The only Warrior who beats that is the slippery Curry — by just one-tenth of a mile."}, {"6e4b": "Thompson and Curry were given the collective nickname the Splash Brothers in 2012, and they’ve always been a compelling yin-and-yang on the team: the suave superstar Curry, with his maniacal grins and showmanship, and the more understated Thompson, with his deadpan humor and clockwork mechanics. Thompson is a proud and confident player, but he’s also a low-key guy who doesn’t seek out the spotlight. And on a team that has turned into a cornucopia of top NBA talent, Thompson can sometimes fly under the radar from a promotional standpoint: In the pump-up video played before Warriors games in Oracle, his relative screen time makes him look like a second, third, even fourth fiddle."}, {"c9a4": "Whichever fiddle he is or should be, Thompson is certainly known for marching to the beat of his own drum. While Curry and Durant are sponsored by Under Armour and Nike, respectively, Thompson endorses Anta, a powerhouse brand in China — in January, Chinese president Xi Jinping sported its winter wear — but has almost no presence, other than online, in the U.S. (When the Warriors were wooing Durant, Thompson diffused a potentially tense discussion about shoe sponsors with a wry Anta-related joke.) Thompson, who says he loves traveling, went to China in 2015, a trip that yielded a that’s-so-Klay viral video of him trying new food and included a push-up contest in which basketballs were balanced on the back of his neck. “KT has thousands of fans in China,” Ding Shizhong, the chairman and CEO of Anta Sports, says via email through a translator, “and his multi-city tour in 2015 was a sensation and a dream come true for many fans.”"}, {"93f8": "Thompson is one of several Warriors players who is a hot enough commodity for the media that the Warriors tend to put him in the press conference room even after run-of-the-mill regular-season games, the way they do with Curry, Durant, and Green, rather than subject him to the claustrophobia of being surrounded by NBA Finals–sized scrums of microphones and cameras at his locker."}, {"a02b": "He is pleasant and offbeat and subtly hilarious up on the dais, but he always looks like he’d rather be somewhere, anywhere else. It’s become tradition for Thompson to say near the end of his pressers, hopefully but not unkindly: Is that it? or Am I done here? then hop up, chipper and relieved, like a fidgety kid finally being excused from the dinner table. Not only did he take a swig of beer in one postgame interview in November, he followed it up with a satisfied “ahhh.” Another time, when he did linger at the interview table longer than he had to, it was to fashion what he described as the “best paper airplane on the West Coast.”"}, {"383e": "McGee says that Thompson reminds him of Wilson Chandler in terms of general laidbackitude; Durant joked at his introductory press conference that he was surprised Thompson owned a cellphone."}, {"6f57": "But while Thompson isn’t chatty, he’s as competitive as they come. He remembers walking off baseball diamonds midgame as a kid while playing with his dad, Mychal, and brothers Trayce and Mychel, fuming over some perceived slight or another. His whole family has this same sports bug. Mychal won two titles with the Los Angeles Lakers in the ’80s; Trayce is part of the Los Angeles Dodgers organization. (During an on-field interview with Trayce at Dodger Stadium last September, Klay’s dog, Rocco, in full view of the cameras, pooped on the pristine infield.) Mychel is on the Santa Cruz Warriors of the NBA Development League, and their mother, Julie, played volleyball at both the University of Portland and the University of San Francisco. Klay says that even now, when he’s with his brothers, he can sometimes get walk-out-the-door-level heated over ping-pong, golf, or the video game FIFA. (Trayce, Klay says, is probably the best at the first two games, but Klay thinks he has a leg up in the third.)"}, {"8825": "Last season, during the NBA Finals, Thompson told ESPN’s Zach Lowe that he remembers exactly who was taken before him in the draft — and that, in particular, he had a bone to pick with the Sacramento Kings, who thanks to a draft-day trade wound up with Jimmer Fredette at no. 10, one spot ahead of Thompson. “I considered myself the best shooter in that draft,” he told Lowe “so when someone took another shooter over me, it was a slap in the face.”"}, {"0896": "You might say that, ultimately, Thompson slapped back. In the third quarter of a January 2015 game against those Kings, Thompson hit 13-of-13 shots in the third quarter alone, good for 37 points, an NBA record for points in a quarter. (After he was fouled on one play before taking a shot, he even went on to sink a just-for-the-hell-of-it long 3.) Even watching the truncated highlights on YouTube is a transcendent, delightful experience, and that’s already knowing that all the shots will go in. To imagine being there that night and watching Thompson sink try after try, some of those baskets coming in the form of absurd heat checks that would be terrible shots from most anyone else, is to know bliss."}, {"e933": "“It felt like it happened so fast,” Thompson says of that game. “Almost everything had to go perfectly for me to get 37; that would be hard for me to do again. I still can’t believe some of the stuff I do sometimes in this league. I have to pinch myself and be thankful for it.”"}, {"6df5": "One of the best things about that Kings game was how much fun Thompson was outwardly, openly having. In general, he tends to carry himself on the court less like a slick NBA player and more like a quiet tennis pro fiddling with the strings of his racket between points. During idle moments, Thompson often kicks at his hands with the bottoms of each shoe, as if he’s getting ready to receive serve. His default gait is a back-to-the-baseline trudge. When he misses a shot, he scuffs his feet down the court on defense, quietly berating himself, sometimes clapping his hands a tiny bit in personal frustration."}, {"0a62": "Against Sacramento in 2015, though, he put on a performance so exciting that it left his then-teammate David Lee doing the surrender cobra in disbelief at midcourt, and inspired Iguodala, on the bench in street clothes, to capture some Thompson moments on his phone. Which probably made for some rare footage, because Thompson was all hops, leaps, chest-bumps, and smiles that night — not exactly his usual demeanor."}, {"6cda": "“I would categorize Klay as a very private player,” Adams says. “He’s emotional, but his emotions don’t always show themselves. He has some sort of internal process that he uses, so it makes it look like he’s pretty calm and collected — which he is, in many ways — but don’t think that there are not a lot of emotional juices flowing through that body.” Zaza Pachulia, the team’s center, uses the word “special” three times and the word “specialness” once as he tries to capture his teammate’s vibe. “We all have our different personalities,” Pachulia says, “but he loves big moments, he loves big games. I’ve seen him get emotional. Like, when he had 60 points? His tongue goes out, a little, maybe on the 50th point.”"}, {"1fc9": "Klay Thompson is feeling great, and this time it’s easy to tell. It’s later that night, after the April 4 shootaround, and he’s on the court against the Minnesota Timberwolves, in the midst of a 41-point effort, hitting his usual 3s, allowing a few tiny satisfied smiles, and sometimes feeling brazen enough to successfully drive the lane. (“I can handle the ball,” he says, “but the ball moves faster when you pass the ball than it does when you’re dribbling.”) With 5:47 to play in the game, though, just before he’s finally subbed out with a double-digit lead and an appreciative ovation, he pulls up for a long farewell 3 that misses, and he shakes his head as he runs back on defense, chastising himself, his brow more furrowed than usual. Even after 41 points, he hates missing out on 44."}, {"6f07": "In the postgame press conference, after a reporter asks what has enabled Thompson to go on such a tear over the past month, he adjusts the mic, his expression blank, and says: “I’ll probably say the weather’s gotten better. The sunshine’s been so good to me. Whenever I go outside it just puts me in a great mood. … That’s a big part of it, and I’m not even kidding.” He isn’t."}, {"b566": "“His face is the same whether he has 41 or four,” Curry says after the game at his own press conference. “It’s always the same expression. It’s a tough read.” Kerr, in his postgame remarks, says that Thompson is, “so poker-faced, he’s so stoic, however you want to put it. [But] when he makes two or three in a row, and he’s got a little bounce in his step, then you know he’s gonna pull up from 40 feet in transition next time. And if he makes that one — now you can really feel it. And he made a couple of those tonight.”"}, {"a4fd": "Steve Kerr on His “Supervillain” Team, the Magic of Steph, and How Brady Compares to MJThe Warriors coach sits down for a wide-ranging conversation on ‘The B.S. Podcast’theringer.com"}, {"9b87": "But Kerr also praises Thompson’s defense. “In general,” he says, “what I’d like to say about Klay is his defense is so important to us, putting pressure on the ball. He’s had a spectacular season. The shooting, we know about, but it’s everything he does for us at both ends.” With the Warriors set to begin their quest for a third straight NBA Finals appearance, Thompson’s clutch, daggerlike shooting and perimeter defense will be indispensable even on a team that appears to have parts to spare."}, {"812e": "“It’s great to be a franchise player on a team,” Thompson says, “but I look at it this way: Being on the Warriors, I have a chance to be on a team that can leave a legacy for generations to come, just like the Showtime Lakers, or the Celtics, or the Lakers’ three-peat team. To be a part of that? That would be amazing, better than any individual stat or award. To leave an imprint on my city, and have a fan base love you forever? That’s what I cherish, and that’s what’s really cool about our situation.”"}, {"e6af": "Is there any sacrifice involved in achieving that goal?"}, {"0bf7": "“No sacrifice,” Thompson says, with a flat voice but the slightest hint of a smile. “No, no.”"}], "content": "He Wears His Heart on His Shots Klay Thompson isn’t the most famous or highly paid Warrior. He’s certainly not the most effusive. But instead of giving up touches on Golden State’s increasingly super superteam, the understated sharpshooter has found a way to become more valuable than ever — one furrowed brow at a time. Klay Thompson is feeling great, though sometimes it can be hard to tell. As the Warriors’ sixth-year shooting guard walks off the court following a morning shootaround in early April at Golden State’s downtown Oakland practice facility, his expression is characteristically opaque: not Resting Bitch Face, exactly, but definitely Resting Furrowed Brow. Whether he’s standing at the free throw line or sitting behind a table signing memorabilia for fans, Thompson tends to present as a little bit skeptical or a little bit befuddled. When, on March 12, a fan named Ronnie handed over a toaster for a signature during an autograph session at an Old Navy, a photo of Thompson’s seemingly perplexed reaction went viral. But really, that’s the way he usually looks. Until the penultimate game of the regular season, a 105–99 loss to the Jazz during which Thompson sat out to rest, the Warriors hadn’t dropped a game since Thompson signed that toaster, winning 14 in a row. With one game to go before the playoffs commence, the Dubs sit at 66–15 overall, the no. 1 seed in the West already secured. During the post-toaster streak, head coach Steve Kerr canceled the team’s Monday, April 3, practice to give his guys a well-deserved day off, which was great for Thompson, who knows how to kick back with the best of them. (During a KNBR radio interview last July, Thompson gave some insight into his relaxing ways, saying: “Honestly, soccer and golf, like I love taking a nap to both of these sports. Because you can casually watch, and casually tune in, you know?”) As Ron Adams, a Warriors assistant coach, says of his shooting guard, “He loves to score, and he loves to win, and he loves his free time. His equation for life is pretty darn good.” When Thompson returns to the gym after his day off, the first thing he says after the shootaround, as he sits down on a thick padded gym mat next to the practice courts, is: “Oh, it’s going great. I love this weather.” It has been nice the past few days, sunny and in the 70s, a welcome change after a long winter of atmospheric rivers and drought-busting rains and general meteorological gloom in the Bay Area. With his newfound free time, Thompson took his beloved bulldog, Rocco, to Muir Beach in Sausalito — “such a really nice, beautiful area,” Thompson says, his face almost getting animated — and then attended the Oakland A’s Opening Day game. As TV cameras zoomed in on Thompson and a buddy in the stands of the Coliseum, which is next door to the Warriors’ Oracle Arena home, the broadcast team mused: “I think he could shoot a 3-pointer right now. From there.” With just one game remaining in the regular season, Thompson is averaging a career-high 22.5 points and is once again shooting better than 40 percent from 3-point land — all while defending some of the most dangerous players in the league. He is having perhaps the finest season of his career, a span that already includes three All-Star Game appearances, an NBA title and nearly another, a 3-point contest victory (over teammate Steph Curry), an All-Rookie nod, an Olympic gold medal, a record-setting 37 points in a single quarter in 2015, a career-high 60 points in 29 minutes last fall, and a remark from then-president Obama that Thompson’s jump shot is “actually a little prettier” than Curry’s. (The Ringer’s Danny Chau would agree.) And as the Warriors prepare to mount another title run, what makes the 27-year-old’s recent play all the more impressive is that, entering the season, the biggest question related to Klay Thompson wasn’t how many points he might score — it was how many he might be forced to give up. When then-free-agent Kevin Durant hunkered down in the Hamptons this summer to figure out where he wanted to play, Thompson was part of the Warriors contingent that paid him a visit July 1. (Durant joked to KNBR that the group of Curry, Thompson, Draymond Green, and Andre Iguodala were so tight that they “all walked in and it looked like they were holding hands.”) Durant chose Golden State on the Fourth of July, and once majority owner Joe Lacob finished celebrating the news from his vacation home in Montana, he told KNBR, his first thought was about the nuts and bolts of fitting in another star: “What we got to do now?” Kevin Durant on the Moment When He Thought His Season Was Over“I just burst out crying,” the All-Star says of his reaction to thinking he’d broken his tibiatheringer.com Adding Durant to a stacked franchise coming off a record-setting 73-win regular season was exhilarating but also mildly worrisome. On the one hand, it’s Durant, end of story. On the other, why monkey with chemistry and mess with success? During his years in Oklahoma City, Durant took between 17 and 21 shots per game, and fitting in that kind of volume on a team that was third in the league in field goal attempts the season prior would be no easy task. But Thompson bristled at suggestions that he might be one of the players who would have to relinquish some touches in order to clear space for Durant. “I feel kind of disrespected that people keep using the term ‘sacrifice’ to describe me and describe us,” he told The Vertical’s Shams Charania in August. “We all want to see each other do well. But I’m not sacrificing shit, because my game isn’t changing. I’m still going to try to get buckets, hit shots, come off screens. I want to win and have a fun time every game we play.” Indeed, Thompson hasn’t sacrificed shit. His game hasn’t changed — except to get even better. Somehow, despite being on a team with Curry and Green and Iguodala and Durant, Thompson is averaging more shot attempts this season, 17.7, than he ever has before. In addition to his 3-point prowess, his shorter-range game has become more of a threat; he makes 51.7 percent of the 2-point shots he puts up, and that number has gone up in each season since 2013. Meanwhile, Durant, who returned to the Warriors on April 8 after sitting out 19 games with a knee injury, is the one taking fewer shots per game than he’s used to. “You gotta give Kevin a lot of credit,” Thompson says, “because, his style of play? He would fit in anywhere, and especially here. He fits so perfectly because he doesn’t need to dominate the ball to be a force. I think he’s averaging his least amount of field goal attempts, maybe even in his career, but it might be one of his more efficient seasons.” (He’s right: Durant’s 16.6 shots per game are his lowest since entering the league, but his 53.5 field goal percentage is his best.) “With Kevin now,” Thompson says, “we have obviously three guys, with me, Kev and Steph, who can have a big night on any given night and so draw a lot of attention. Dray is like the key that unlocks everything we do, because he’s so versatile. We’ve got guys like Andre and Shaun, and you can’t forget about the bigs who get us open, like Zaza and JaVale. We have such a unique talent pool on this team.” That embarrassment of riches, though, initially led to some doubts around the league; the concern-trolly assessment “there’s only one basketball” became a frequent refrain. During the same KNBR appearance where Thompson talked happily about naps, he was also asked about the “one basketball” dig. “There’s one ball,” he responded. “Guess what we’ll do? We’ll put it in the hoop.” Thompson puts the ball in the hoop a hell of a lot, and when he really gets going, it’s impossible to look away. He can receive and release the ball faster and more cleanly than anyone else: 11.6 of his points per game this season are considered catch-and-shoot, the most in the league; the second-place player, Dirk Nowitzki, gets 7.9 points per game that way. Thompson can step dramatically back and launch up an off-balance swish; he can even occasionally convert a setup from Curry into a high-flying, one-handed dunk. Earlier this season, against the Pacers, Thompson popped off for 60 points, a career-high for him and a rough night for his former Warriors captain, Monta Ellis, whom he lit entirely up. As a testament to Thompson’s speedy, lethal release, ESPN’s Tom Haberstroh and Brian Windhorst calculated that Thompson dribbled just 11 times on those 60 points, and that he had the ball in his hands for just a minute and a half total. And last year, in the Western Conference finals against Durant’s Thunder, Thompson practically single-handedly saved the Warriors season, hitting 11 3-pointers in a Game 6 comeback effort. Thompson’s performance earned a tremendously dorky We Are Not Worthy display from Lacob in the tunnel after the game, and the Warriors went on to win the series in seven. “He just has got no conscience,” says big man JaVale McGee. (Warriors guard Ian Clark offers an uncannily similar assessment: “He doesn’t have a conscience.”) “He can shoot anywhere, over everybody,” says McGee. “Somebody can be right in his face and he’ll shoot and it will go in. Anyone else it would be like, ‘That’s a bad shot.’ But he makes the bad shots. So those are good shots for him.” Thompson’s perimeter play doesn’t just stand out on offense, however. A number of his teammates and coaches are quick to point out that defensively, he has some of the most important assignments around the arc. After his rookie season, Thompson spent a month in the Bay Area working with coaches specifically on his defense. (“That helped a lot,” he says.) “He’s definitely in shape,” says Clark, “and he has to be, to be able to guard one, two, three, sometimes four men while switching. We do a lot of switching. He can guard both sides.” Thompson says he’s lucky to be “blessed with stamina,” and rattles off a greatest hits of NBA players, ranging from Russell Westbrook and James Harden to C.J. McCollum and LeBron James, when asked whom he most enjoys defending. “Klay is one of those guys,” Adams says, “who never gets enough credit for what he does. Let’s think about what he does. He guards, in many cases, the best perimeter player on the other team. Might be a point guard, might be an off-guard. So he has tremendous defensive responsibilities to begin a game. And he’s pretty much relentless from start to finish. Yeah, he’ll lose focus on a play or two, but it’s amazing the energy that he’s putting into the defensive end guarding a significant, if not the significant, player on the other team, as well as playing his offense.” According to the NBA’s SportVU speed-and-distance metric, which tracks a player’s movement around the court, Thompson covers 2.45 miles of ground during a game, 12th-most in the league, thanks to all of his looping, quick cuts, and rangy defense. The only Warrior who beats that is the slippery Curry — by just one-tenth of a mile. Thompson and Curry were given the collective nickname the Splash Brothers in 2012, and they’ve always been a compelling yin-and-yang on the team: the suave superstar Curry, with his maniacal grins and showmanship, and the more understated Thompson, with his deadpan humor and clockwork mechanics. Thompson is a proud and confident player, but he’s also a low-key guy who doesn’t seek out the spotlight. And on a team that has turned into a cornucopia of top NBA talent, Thompson can sometimes fly under the radar from a promotional standpoint: In the pump-up video played before Warriors games in Oracle, his relative screen time makes him look like a second, third, even fourth fiddle. Whichever fiddle he is or should be, Thompson is certainly known for marching to the beat of his own drum. While Curry and Durant are sponsored by Under Armour and Nike, respectively, Thompson endorses Anta, a powerhouse brand in China — in January, Chinese president Xi Jinping sported its winter wear — but has almost no presence, other than online, in the U.S. (When the Warriors were wooing Durant, Thompson diffused a potentially tense discussion about shoe sponsors with a wry Anta-related joke.) Thompson, who says he loves traveling, went to China in 2015, a trip that yielded a that’s-so-Klay viral video of him trying new food and included a push-up contest in which basketballs were balanced on the back of his neck. “KT has thousands of fans in China,” Ding Shizhong, the chairman and CEO of Anta Sports, says via email through a translator, “and his multi-city tour in 2015 was a sensation and a dream come true for many fans.” Thompson is one of several Warriors players who is a hot enough commodity for the media that the Warriors tend to put him in the press conference room even after run-of-the-mill regular-season games, the way they do with Curry, Durant, and Green, rather than subject him to the claustrophobia of being surrounded by NBA Finals–sized scrums of microphones and cameras at his locker. He is pleasant and offbeat and subtly hilarious up on the dais, but he always looks like he’d rather be somewhere, anywhere else. It’s become tradition for Thompson to say near the end of his pressers, hopefully but not unkindly: Is that it? or Am I done here? then hop up, chipper and relieved, like a fidgety kid finally being excused from the dinner table. Not only did he take a swig of beer in one postgame interview in November, he followed it up with a satisfied “ahhh.” Another time, when he did linger at the interview table longer than he had to, it was to fashion what he described as the “best paper airplane on the West Coast.” McGee says that Thompson reminds him of Wilson Chandler in terms of general laidbackitude; Durant joked at his introductory press conference that he was surprised Thompson owned a cellphone. But while Thompson isn’t chatty, he’s as competitive as they come. He remembers walking off baseball diamonds midgame as a kid while playing with his dad, Mychal, and brothers Trayce and Mychel, fuming over some perceived slight or another. His whole family has this same sports bug. Mychal won two titles with the Los Angeles Lakers in the ’80s; Trayce is part of the Los Angeles Dodgers organization. (During an on-field interview with Trayce at Dodger Stadium last September, Klay’s dog, Rocco, in full view of the cameras, pooped on the pristine infield.) Mychel is on the Santa Cruz Warriors of the NBA Development League, and their mother, Julie, played volleyball at both the University of Portland and the University of San Francisco. Klay says that even now, when he’s with his brothers, he can sometimes get walk-out-the-door-level heated over ping-pong, golf, or the video game FIFA. (Trayce, Klay says, is probably the best at the first two games, but Klay thinks he has a leg up in the third.) Last season, during the NBA Finals, Thompson told ESPN’s Zach Lowe that he remembers exactly who was taken before him in the draft — and that, in particular, he had a bone to pick with the Sacramento Kings, who thanks to a draft-day trade wound up with Jimmer Fredette at no. 10, one spot ahead of Thompson. “I considered myself the best shooter in that draft,” he told Lowe “so when someone took another shooter over me, it was a slap in the face.” You might say that, ultimately, Thompson slapped back. In the third quarter of a January 2015 game against those Kings, Thompson hit 13-of-13 shots in the third quarter alone, good for 37 points, an NBA record for points in a quarter. (After he was fouled on one play before taking a shot, he even went on to sink a just-for-the-hell-of-it long 3.) Even watching the truncated highlights on YouTube is a transcendent, delightful experience, and that’s already knowing that all the shots will go in. To imagine being there that night and watching Thompson sink try after try, some of those baskets coming in the form of absurd heat checks that would be terrible shots from most anyone else, is to know bliss. “It felt like it happened so fast,” Thompson says of that game. “Almost everything had to go perfectly for me to get 37; that would be hard for me to do again. I still can’t believe some of the stuff I do sometimes in this league. I have to pinch myself and be thankful for it.” One of the best things about that Kings game was how much fun Thompson was outwardly, openly having. In general, he tends to carry himself on the court less like a slick NBA player and more like a quiet tennis pro fiddling with the strings of his racket between points. During idle moments, Thompson often kicks at his hands with the bottoms of each shoe, as if he’s getting ready to receive serve. His default gait is a back-to-the-baseline trudge. When he misses a shot, he scuffs his feet down the court on defense, quietly berating himself, sometimes clapping his hands a tiny bit in personal frustration. Against Sacramento in 2015, though, he put on a performance so exciting that it left his then-teammate David Lee doing the surrender cobra in disbelief at midcourt, and inspired Iguodala, on the bench in street clothes, to capture some Thompson moments on his phone. Which probably made for some rare footage, because Thompson was all hops, leaps, chest-bumps, and smiles that night — not exactly his usual demeanor. “I would categorize Klay as a very private player,” Adams says. “He’s emotional, but his emotions don’t always show themselves. He has some sort of internal process that he uses, so it makes it look like he’s pretty calm and collected — which he is, in many ways — but don’t think that there are not a lot of emotional juices flowing through that body.” Zaza Pachulia, the team’s center, uses the word “special” three times and the word “specialness” once as he tries to capture his teammate’s vibe. “We all have our different personalities,” Pachulia says, “but he loves big moments, he loves big games. I’ve seen him get emotional. Like, when he had 60 points? His tongue goes out, a little, maybe on the 50th point.” Klay Thompson is feeling great, and this time it’s easy to tell. It’s later that night, after the April 4 shootaround, and he’s on the court against the Minnesota Timberwolves, in the midst of a 41-point effort, hitting his usual 3s, allowing a few tiny satisfied smiles, and sometimes feeling brazen enough to successfully drive the lane. (“I can handle the ball,” he says, “but the ball moves faster when you pass the ball than it does when you’re dribbling.”) With 5:47 to play in the game, though, just before he’s finally subbed out with a double-digit lead and an appreciative ovation, he pulls up for a long farewell 3 that misses, and he shakes his head as he runs back on defense, chastising himself, his brow more furrowed than usual. Even after 41 points, he hates missing out on 44. In the postgame press conference, after a reporter asks what has enabled Thompson to go on such a tear over the past month, he adjusts the mic, his expression blank, and says: “I’ll probably say the weather’s gotten better. The sunshine’s been so good to me. Whenever I go outside it just puts me in a great mood. … That’s a big part of it, and I’m not even kidding.” He isn’t. “His face is the same whether he has 41 or four,” Curry says after the game at his own press conference. “It’s always the same expression. It’s a tough read.” Kerr, in his postgame remarks, says that Thompson is, “so poker-faced, he’s so stoic, however you want to put it. [But] when he makes two or three in a row, and he’s got a little bounce in his step, then you know he’s gonna pull up from 40 feet in transition next time. And if he makes that one — now you can really feel it. And he made a couple of those tonight.” Steve Kerr on His “Supervillain” Team, the Magic of Steph, and How Brady Compares to MJThe Warriors coach sits down for a wide-ranging conversation on ‘The B.S. Podcast’theringer.com But Kerr also praises Thompson’s defense. “In general,” he says, “what I’d like to say about Klay is his defense is so important to us, putting pressure on the ball. He’s had a spectacular season. The shooting, we know about, but it’s everything he does for us at both ends.” With the Warriors set to begin their quest for a third straight NBA Finals appearance, Thompson’s clutch, daggerlike shooting and perimeter defense will be indispensable even on a team that appears to have parts to spare. “It’s great to be a franchise player on a team,” Thompson says, “but I look at it this way: Being on the Warriors, I have a chance to be on a team that can leave a legacy for generations to come, just like the Showtime Lakers, or the Celtics, or the Lakers’ three-peat team. To be a part of that? That would be amazing, better than any individual stat or award. To leave an imprint on my city, and have a fan base love you forever? That’s what I cherish, and that’s what’s really cool about our situation.” Is there any sacrifice involved in achieving that goal? “No sacrifice,” Thompson says, with a flat voice but the slightest hint of a smile. “No, no.” ", "name": "106", "child": "106_1\t106_2\t106_3\t106_4\t106_5\t106_6\t106_7\t106_8\t106_9\t106_10\t106_11\t106_12", "timestamp": "Apr 12"}