{"parent": "", "title": "We’re living in the cult of cruel", "author": "Felicia C. Sullivan", "sentences": [{"6b7c": "We’re living in the cult of cruel"}, {"2749": "Years ago, when I was much younger than I am now, I was mean to Rachel. Really mean. High school mean, only we were adults in our twenties attending a graduate school whose tuition cost more than starter homes in the Midwest. Metrocards replaced yellow buses and hallway lockers gave way to neighborhood bars and coffee shops where we’d go to lament over our writing (or lack thereof) and gossip about one another."}, {"8d34": "Rachel was a year ahead of us and was undeniably the kind of writer we all wished we could be — her short stories were dark, potent, and seemingly effortless for her to write. She had been published; she was composing a collection of stories while we struggled to submit ten pages of writing for the weekly butchering otherwise known as workshop, where our peers would wield their scalpels and tell us, with glee, just how bad of a writer we were."}, {"bf8a": "Hers was a home on the tony Upper West Side, and the one time I visited her parent’s apartment I looked around and felt all that I didn’t, and would never, have. I grew up in apartments that never got clean no matter how much you scrubbed, and I was the first of my family to attend college, much less graduate school. My writing would always be labored. Back then, I was a shell of a person; I cared more about the mask I’d created and affixed over my face instead of being comfortable in the skin I was born in. Better to suffocate than to be exposed and lay yourself out to bear. In contrast, Rachel carried her discomfort and awkwardness with an honesty I admired but couldn’t imagine for myself. Her lipstick was sloppy, as if she’d been kissed one too many times, and she often complained about the excess weight she carried, especially when surrounded by women who were surgical in the way they preserved their shape. We were the worst kind of helicopter parents over own bodies; we would scarf down our fries in public to then count calories in private. But Rachel was public with her pain, and perhaps it was jealousy — she was achingly and blindly real while I was manufactured and fake — that made me want to break her in places she’d already been broken."}, {"32bf": "I was such an asshole to Rachel, smiling to her face while gossiping behind her back. I cringe when I think about it now, embarrassed by the kind of person I used to be. Even though our friendship didn’t last long I still think about how mean I was to her, even now, nearly two decades later, because I made her feel the way I had felt in high school, tormented for no reason other than the fact that I existed. It’s easy to spread one’s pain like sickness instead of tending to our wounds."}, {"f2ed": "High school’s supposed to be terrible, right? Par for the course, right? But how is it that we can remember those days, hallways, and the places we hid from our bullies, so vividly? We never remember the kind words; rather we feel old wounds opening up, raw and fresh as if we’re forever paying homage to old hurts. As adults every act of cruelty forces us to revisit the hallways and lockers we thought we had forever left behind."}, {"d9d4": "I remember apologizing to Rachel for all that I’d done and I was humbled by the ease in which she seemed to have forgiven me. We maintained a cordial friendship, one at a remove, and I got it. Who wouldn’t continue to regard their tormentor with suspicion? She published a flawless story collection to deserved acclaim while I struggled to finish my first book. Perhaps it was my need to draw a line between the person I was and the person I was trying to be that I was desperate in the way I tried to help her book succeed. Back then, I’d acquired some minor (we’re talking minor) literary cache having published a successful literary magazine, which gave me access to the kind of people who could further champion Rachel’s work."}, {"13cb": "One day someone approached me and said, you realize Rachel hates you, right? She’s just pretending to be your friend because of who you know. She doesn’t actually like you. I mean, look at how you treated her. While I deserved her contempt, it didn’t make the knowledge of what everyone knew and I didn’t easier to bear. I felt then what I had made her feel in graduate school — humiliated, ashamed, and the punch line to a very public joke. Rachel held up a mirror to the mask affixed to my face."}, {"5183": "I learned then that it’s easy to be cruel — the work is in being kind. You can only be kind and honest with others if you’re decent to yourself."}, {"1009": "I’ve been thinking about this a lot lately — the ways in which people exact their hurt. It’s common for people to subtweet about their hate-follows and hate-reads. Nothing distinguishes between the hate cultivated for people we know as opposed to strangers — we’re all fair game for someone else’s vitriol. People have no problem playing armchair therapist; they analyze our lives from a computer screen and then proceed to deliver play-by-play commentary on how we should live our lives based on how they live theirs. Many have come to believe that an online representation of one aspect of our lives is the complete story, the whole of our lives. Who we are, the content of our character, is reduced to what we choose to publish. The choices we make — from what we wear to how we parent and whom we love — should be obvious based on the collective’s personal experience and we’re admonished in text or in forums for “not getting it”. We crave authenticity yet we vilify others for their public missteps, for being human. People talk smack behind our backs to then kiss-kiss, hey, how are you? to our face. People leave hateful comments tearing apart our appearance: Why is she naked in every picture on Instagram...ugh! Who does she think she is? Why does she wear such unflattering clothes? If she didn’t want to hear about how bad she looks she shouldn’t be posting pictures of herself online. Apparently, being public is an open invitation for hate, and it’s frightening that groups exist on the Internet devoted to the care and feeding of that hate."}, {"6e00": "We love our hate-reads and follows because the gratification is easy and immediate:"}, {"c2e8": "Hate-reading simply makes us feel good by offering up an endless succession of “the emperor has no clothes” moments with regard to our political adversaries. In this view, we specifically seek out the anti-wisdom of whoever appears dumbest and most hateful as a means of bolstering our own sense of righteousness. — “Why We Hate Read” by Jesse Singal"}, {"742b": "We live in a country that espouses free speech, but many are forced into silence in fear of the hate avalanche. In a private Facebook group, many women talk about not reading the comments of their published articles out of self-preservation. “Don’t read the comments” is a constant refrain. Women leave social media because they’re beaten down by people in fear of losing their privilege. A whole group of people has been reduced to a patronizing “snowflake” moniker because of their inability to toughen up, and it’s as if the Internet has become Darwinian in the sense that only those who hate, and those who can withstand and endure that hate, survive. A few years ago, I was the subject of a man’s ire, someone whom I believe I knew (or at least had come into contact with during my agency career, which makes the whole situation that much more unsettling), who wrote about how much he hated me because I stood up for women who had been ridiculed online because of their appearance. Fifteen years ago, a small circle of literary bloggers posted cruel blind items about me and I remember being at work, in front of my computer, reading these posts and my whole body going numb."}, {"576c": "While it’s unrealistic to expect that everyone will love us, what we do, or what we choose to put out into the world, that knowledge doesn’t remove the sting we feel when we see ourselves as the object of someone’s ridicule. While the taunts of high school may have a limited shelf life, words published online leave an indelible mark. The cruelty is public, made searchable by our family, colleagues, and friends, serving as a constant reminder that they don’t like you."}, {"4a12": "The spectrum of cruelty seems infinite — from the side-eyes and whispers behind one’s back to the full-blown doxing and harassment of women and minorities online, made that much more ubiquitous in today’s political climate where people wear their hate as a badge of honor or as a frog, as some would have it. We’re all culpable; we may have talked shit behind someone’s back and played nice in front of their face, or perhaps we’ve hate-read someone’s blog or social media waiting for the object of our disdain to flounder and fall. Or maybe we’ve left anonymous comments–words that burn and hurt. We would be lying if we didn’t say that we’ve all been cruel in one way or another."}, {"eb2e": "I’ve been guilty of double-talk and hate-reading, and I stopped doing it because it didn’t make me feel any better for the long haul and I could imagine how I’d feel if someone did this to me. The past two years have been the hardest I’ve ever known. I have to devote all of my energy to putting one foot in front of the other. My time and energy are precious — they’re things I can’t ever get back — so I’ve made a conscious choice to lay down my anger, jealousy, annoyance, and fear. Now, instead of tormenting myself, I unfollow or unfriend; I try to cultivate a space that feels decent in a world that has become increasingly indecent. Recently, I re-read a post from Paul Graham that put me on pause. Life is short, and the hate we carry means we’re literally giving away our life to others:"}, {"0ade": "But while some amount of bullshit is inevitably forced on you, the bullshit that sneaks into your life by tricking you is no one’s fault but your own. And yet the bullshit you choose may be harder to eliminate than the bullshit that’s forced on you. Things that lure you into wasting your time on them have to be really good at tricking you. An example that will be familiar to a lot of people is arguing online. When someone contradicts you, they’re in a sense attacking you. Sometimes pretty overtly. Your instinct when attacked is to defend yourself. But like a lot of instincts, this one wasn’t designed for the world we now live in. Counterintuitive as it feels, it’s better most of the time not to defend yourself. Otherwise these people are literally taking your life."}, {"988a": "Hating people is exhausting. Perhaps it’s easier to hate than to be empathetic and kind because that requires us to be vulnerable and exposed. It forces us to ask that uncomfortable questions about ourselves. What about her bothers me so much that I had to leave that comment or say that thing behind her back? While awful people who do awful things, exist, we have a choice to devote our attention to them. We can choose to give them our life in exchange for the privilege of hating them."}, {"3be1": "Years ago, a wise friend told me that crooks undo themselves, always, so there’s no need for us to contribute to their downfall. So why should I waste my time picking apart others when I can instead use those moments to put myself forward and spend time with people whom I love. And while there are people in this world I don’t like, I no longer devote my energy to harvesting that dislike."}, {"69a9": "You have one life. Hate is so pervasive, why add to the noise? Why cultivate it? Why waste your life hating people and acting on that hate? Where does it get you? Does it move you forward? Ask yourself why you might feel so satisfied in a feeling that’s so destructive, that serves no other purpose other than to cause pain? Why not focus on yourself, and those whom you love, instead?"}], "content": "We’re living in the cult of cruel Years ago, when I was much younger than I am now, I was mean to Rachel. Really mean. High school mean, only we were adults in our twenties attending a graduate school whose tuition cost more than starter homes in the Midwest. Metrocards replaced yellow buses and hallway lockers gave way to neighborhood bars and coffee shops where we’d go to lament over our writing (or lack thereof) and gossip about one another. Rachel was a year ahead of us and was undeniably the kind of writer we all wished we could be — her short stories were dark, potent, and seemingly effortless for her to write. She had been published; she was composing a collection of stories while we struggled to submit ten pages of writing for the weekly butchering otherwise known as workshop, where our peers would wield their scalpels and tell us, with glee, just how bad of a writer we were. Hers was a home on the tony Upper West Side, and the one time I visited her parent’s apartment I looked around and felt all that I didn’t, and would never, have. I grew up in apartments that never got clean no matter how much you scrubbed, and I was the first of my family to attend college, much less graduate school. My writing would always be labored. Back then, I was a shell of a person; I cared more about the mask I’d created and affixed over my face instead of being comfortable in the skin I was born in. Better to suffocate than to be exposed and lay yourself out to bear. In contrast, Rachel carried her discomfort and awkwardness with an honesty I admired but couldn’t imagine for myself. Her lipstick was sloppy, as if she’d been kissed one too many times, and she often complained about the excess weight she carried, especially when surrounded by women who were surgical in the way they preserved their shape. We were the worst kind of helicopter parents over own bodies; we would scarf down our fries in public to then count calories in private. But Rachel was public with her pain, and perhaps it was jealousy — she was achingly and blindly real while I was manufactured and fake — that made me want to break her in places she’d already been broken. I was such an asshole to Rachel, smiling to her face while gossiping behind her back. I cringe when I think about it now, embarrassed by the kind of person I used to be. Even though our friendship didn’t last long I still think about how mean I was to her, even now, nearly two decades later, because I made her feel the way I had felt in high school, tormented for no reason other than the fact that I existed. It’s easy to spread one’s pain like sickness instead of tending to our wounds. High school’s supposed to be terrible, right? Par for the course, right? But how is it that we can remember those days, hallways, and the places we hid from our bullies, so vividly? We never remember the kind words; rather we feel old wounds opening up, raw and fresh as if we’re forever paying homage to old hurts. As adults every act of cruelty forces us to revisit the hallways and lockers we thought we had forever left behind. I remember apologizing to Rachel for all that I’d done and I was humbled by the ease in which she seemed to have forgiven me. We maintained a cordial friendship, one at a remove, and I got it. Who wouldn’t continue to regard their tormentor with suspicion? She published a flawless story collection to deserved acclaim while I struggled to finish my first book. Perhaps it was my need to draw a line between the person I was and the person I was trying to be that I was desperate in the way I tried to help her book succeed. Back then, I’d acquired some minor (we’re talking minor) literary cache having published a successful literary magazine, which gave me access to the kind of people who could further champion Rachel’s work. One day someone approached me and said, you realize Rachel hates you, right? She’s just pretending to be your friend because of who you know. She doesn’t actually like you. I mean, look at how you treated her. While I deserved her contempt, it didn’t make the knowledge of what everyone knew and I didn’t easier to bear. I felt then what I had made her feel in graduate school — humiliated, ashamed, and the punch line to a very public joke. Rachel held up a mirror to the mask affixed to my face. I learned then that it’s easy to be cruel — the work is in being kind. You can only be kind and honest with others if you’re decent to yourself. I’ve been thinking about this a lot lately — the ways in which people exact their hurt. It’s common for people to subtweet about their hate-follows and hate-reads. Nothing distinguishes between the hate cultivated for people we know as opposed to strangers — we’re all fair game for someone else’s vitriol. People have no problem playing armchair therapist; they analyze our lives from a computer screen and then proceed to deliver play-by-play commentary on how we should live our lives based on how they live theirs. Many have come to believe that an online representation of one aspect of our lives is the complete story, the whole of our lives. Who we are, the content of our character, is reduced to what we choose to publish. The choices we make — from what we wear to how we parent and whom we love — should be obvious based on the collective’s personal experience and we’re admonished in text or in forums for “not getting it”. We crave authenticity yet we vilify others for their public missteps, for being human. People talk smack behind our backs to then kiss-kiss, hey, how are you? to our face. People leave hateful comments tearing apart our appearance: Why is she naked in every picture on Instagram...ugh! Who does she think she is? Why does she wear such unflattering clothes? If she didn’t want to hear about how bad she looks she shouldn’t be posting pictures of herself online. Apparently, being public is an open invitation for hate, and it’s frightening that groups exist on the Internet devoted to the care and feeding of that hate. We love our hate-reads and follows because the gratification is easy and immediate: Hate-reading simply makes us feel good by offering up an endless succession of “the emperor has no clothes” moments with regard to our political adversaries. In this view, we specifically seek out the anti-wisdom of whoever appears dumbest and most hateful as a means of bolstering our own sense of righteousness. — “Why We Hate Read” by Jesse Singal We live in a country that espouses free speech, but many are forced into silence in fear of the hate avalanche. In a private Facebook group, many women talk about not reading the comments of their published articles out of self-preservation. “Don’t read the comments” is a constant refrain. Women leave social media because they’re beaten down by people in fear of losing their privilege. A whole group of people has been reduced to a patronizing “snowflake” moniker because of their inability to toughen up, and it’s as if the Internet has become Darwinian in the sense that only those who hate, and those who can withstand and endure that hate, survive. A few years ago, I was the subject of a man’s ire, someone whom I believe I knew (or at least had come into contact with during my agency career, which makes the whole situation that much more unsettling), who wrote about how much he hated me because I stood up for women who had been ridiculed online because of their appearance. Fifteen years ago, a small circle of literary bloggers posted cruel blind items about me and I remember being at work, in front of my computer, reading these posts and my whole body going numb. While it’s unrealistic to expect that everyone will love us, what we do, or what we choose to put out into the world, that knowledge doesn’t remove the sting we feel when we see ourselves as the object of someone’s ridicule. While the taunts of high school may have a limited shelf life, words published online leave an indelible mark. The cruelty is public, made searchable by our family, colleagues, and friends, serving as a constant reminder that they don’t like you. The spectrum of cruelty seems infinite — from the side-eyes and whispers behind one’s back to the full-blown doxing and harassment of women and minorities online, made that much more ubiquitous in today’s political climate where people wear their hate as a badge of honor or as a frog, as some would have it. We’re all culpable; we may have talked shit behind someone’s back and played nice in front of their face, or perhaps we’ve hate-read someone’s blog or social media waiting for the object of our disdain to flounder and fall. Or maybe we’ve left anonymous comments–words that burn and hurt. We would be lying if we didn’t say that we’ve all been cruel in one way or another. I’ve been guilty of double-talk and hate-reading, and I stopped doing it because it didn’t make me feel any better for the long haul and I could imagine how I’d feel if someone did this to me. The past two years have been the hardest I’ve ever known. I have to devote all of my energy to putting one foot in front of the other. My time and energy are precious — they’re things I can’t ever get back — so I’ve made a conscious choice to lay down my anger, jealousy, annoyance, and fear. Now, instead of tormenting myself, I unfollow or unfriend; I try to cultivate a space that feels decent in a world that has become increasingly indecent. Recently, I re-read a post from Paul Graham that put me on pause. Life is short, and the hate we carry means we’re literally giving away our life to others: But while some amount of bullshit is inevitably forced on you, the bullshit that sneaks into your life by tricking you is no one’s fault but your own. And yet the bullshit you choose may be harder to eliminate than the bullshit that’s forced on you. Things that lure you into wasting your time on them have to be really good at tricking you. An example that will be familiar to a lot of people is arguing online. When someone contradicts you, they’re in a sense attacking you. Sometimes pretty overtly. Your instinct when attacked is to defend yourself. But like a lot of instincts, this one wasn’t designed for the world we now live in. Counterintuitive as it feels, it’s better most of the time not to defend yourself. Otherwise these people are literally taking your life. Hating people is exhausting. Perhaps it’s easier to hate than to be empathetic and kind because that requires us to be vulnerable and exposed. It forces us to ask that uncomfortable questions about ourselves. What about her bothers me so much that I had to leave that comment or say that thing behind her back? While awful people who do awful things, exist, we have a choice to devote our attention to them. We can choose to give them our life in exchange for the privilege of hating them. Years ago, a wise friend told me that crooks undo themselves, always, so there’s no need for us to contribute to their downfall. So why should I waste my time picking apart others when I can instead use those moments to put myself forward and spend time with people whom I love. And while there are people in this world I don’t like, I no longer devote my energy to harvesting that dislike. You have one life. Hate is so pervasive, why add to the noise? Why cultivate it? Why waste your life hating people and acting on that hate? Where does it get you? Does it move you forward? Ask yourself why you might feel so satisfied in a feeling that’s so destructive, that serves no other purpose other than to cause pain? Why not focus on yourself, and those whom you love, instead? ", "name": "15", "child": "15_1\t15_2\t15_3\t15_4\t15_5\t15_6\t15_7\t15_8\t15_9\t15_10\t15_11\t15_12\t15_13\t15_14\t15_15\t15_16\t15_17\t15_18\t15_19\t15_20\t15_21\t15_22\t15_23\t15_24\t15_25", "timestamp": "Apr 12"}