{"parent": "", "title": "The Most Important Lesson George Lucas Taught His Student Are These 3 Words", "author": "Benjamin P. Hardy", "sentences": [{"0a6a": "The Most Important Lesson George Lucas Taught His Student Are These 3 Words"}, {"b9a7": "Dave Filoni worked under the mentorship of George Lucas for over 10 years. Filoni was a major part of the STAR WARS television series, “Clone Wars.” More recently, Filoni has been the executive producer of the STAR WARS Rebels series."}, {"2aef": "The most important lesson, Filoni recollects, “Which combines everything” else George taught him was:"}, {"a04a": "DON’T BE AFRAID."}, {"c221": "George would continually repeat that advice to Filoni while they created things and faced obstacles."}, {"16e0": "It must have been truly daunting when Filoni was hired as the director of a major multi-billion dollar franchise. As he reported, the sheer weight of responsibly was nauseating. Sometimes it felt impossible to create from the inner parts of his heart."}, {"a2bc": "Heck, it can be paralyzing writing a blog post which may only be read by a handful of people. Let alone creating something with millions of dollars invested which you know will be viewed by millions of devoted fans."}, {"6ce3": "Yet, with all that pressure, the most important and fitting advice remained:"}, {"7242": "DON’T BE AFRAID…"}, {"2bc2": "“Being afraid will limit you,” George told Filoni. “And most importantly, it will limit your creativity. If you become afraid of what you are trying to do.”"}, {"1dc2": "You can never be afraid to try things."}, {"d178": "To experiment."}, {"a439": "To fail."}, {"2c65": "And most importantly, you can never be afraid to truly, in all the zeal and conviction you can muster, share the truth desperately seeking to come out of you."}, {"0821": "It was a common experience for people to tell George Lucas, “That cannot be done.” Those words were the very ammunition he needed. To quote Darren Hardy, “Let the haters be your motivators.”"}, {"fff2": "When you’re trying to do something that has never been done before, you can’t be afraid of what people will think. Of course small-minded people will flinch and scoff. Every breakthrough was always considered a crazy idea before it worked."}, {"4333": "Logic ALWAYS follows intuition. Not the other way around. To repeat, logic always follows intuition. Hence, Albert Einstein has said, “I use my intuition, not logic, to help make these important decisions.”"}, {"29bb": "If you have something you want to do that isn’t necessarily traditional, don’t let that stop you from doing it. There are no cookie cutter molds to success."}, {"e264": "Of course, there are rules you can follow. But at the end of the day, you have to follow your gut. You have to create and live in the way that makes most sense to you. It will only truly work if it’s authentic. If people can feel it."}, {"614a": "If you force what you’re doing — or force yourself for that matter — into a box just because that box has been proven to work, you will live a shallow life."}, {"b50b": "The feeling won’t be there. Which is the most important consideration both when assessing a person’s work and when assessing the person themselves. Humans are very emotional creatures. We judge people and things based on how they make us feel. We’re less rational than we like to think we are."}, {"5c5e": "If the feeling is not there, then the creator wasn’t feeling it either. They were forcing it. They were afraid."}, {"a924": "They were afraid of failing."}, {"ffc9": "They were afraid of what others might think."}, {"bb67": "They were afraid of doing what in their heart they felt they should do."}, {"a956": "Your life is a product of your standards. If you’re willing to tolerate low-living, that’s exactly what you’ll get. If you’re willing to let fear dictate your decision making, you’ll never be free from your internal prison. You’ll never be able to act on your intuition."}, {"cf6b": "If, however, you hold yourself and your work to a high standard, than the work you produce will be powerful. Who cares how it’s received? That’s not the point. As Ryan Holiday has said:"}, {"4c7a": "“If as a creative person, you have decided that the artiber of whether it was good or not, or whether your time was well-spent or not, is how it is received by other people, you have now taken your sense of self worth and you have deferred it out. You have placed it in other people’s control. And they are going to let you down from time-to-time. They are not going to appreciate what you did. They’re going to judge it. They’re going to be afraid of it.”"}, {"d302": "Hence, Warren Buffett has said, “It’s better to live your life by an inner scorecard than an outer scoreboard.”"}, {"4265": "So how do you measure your success? How do you measure you life?"}, {"bdfa": "At the end of the day, either you are living a lie or you are being true to yourself."}, {"77b1": "The chasm every person MUST cross in order to live at a higher and more positive frequency is courage. Until you act courageously, you will always be living in a negative way, whether that be based on fear, pride, jealously, anger, or any other number of negative emotional states."}, {"2833": "Courage is the baseline to everything positive. It’s the ground. It’s the starting point."}, {"b86b": "DON’T BE AFRAID."}, {"feed": "Don’t hold back what you believe you should do."}, {"88dd": "Everything you want is on the opposite side of fear."}, {"9166": "Every beautiful thing you will ever create must come truly from you. And the only way for you to do that work, and to make those connections, is for you to STOP WORRYING ABOUT YOURSELF."}, {"c61a": "Get over your own sense of well-being so you can connect to other people and do work that truly resonates and connects. Hence the line from the Bible, you must lose yourself to find yourself."}, {"90b3": "DON’T BE AFRAID."}, {"f652": "Don’t let other people’s standards or results or judgments stop you."}, {"d9fa": "Live powerfully."}, {"c55b": "Create powerfully."}, {"8e29": "Connect powerfully."}, {"e6ff": "Call To Action"}, {"6da6": "If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist."}, {"6b92": "Click here to get the checklist right now!"}], "content": "The Most Important Lesson George Lucas Taught His Student Are These 3 Words Dave Filoni worked under the mentorship of George Lucas for over 10 years. Filoni was a major part of the STAR WARS television series, “Clone Wars.” More recently, Filoni has been the executive producer of the STAR WARS Rebels series. The most important lesson, Filoni recollects, “Which combines everything” else George taught him was: DON’T BE AFRAID. George would continually repeat that advice to Filoni while they created things and faced obstacles. It must have been truly daunting when Filoni was hired as the director of a major multi-billion dollar franchise. As he reported, the sheer weight of responsibly was nauseating. Sometimes it felt impossible to create from the inner parts of his heart. Heck, it can be paralyzing writing a blog post which may only be read by a handful of people. Let alone creating something with millions of dollars invested which you know will be viewed by millions of devoted fans. Yet, with all that pressure, the most important and fitting advice remained: DON’T BE AFRAID… “Being afraid will limit you,” George told Filoni. “And most importantly, it will limit your creativity. If you become afraid of what you are trying to do.” You can never be afraid to try things. To experiment. To fail. And most importantly, you can never be afraid to truly, in all the zeal and conviction you can muster, share the truth desperately seeking to come out of you. It was a common experience for people to tell George Lucas, “That cannot be done.” Those words were the very ammunition he needed. To quote Darren Hardy, “Let the haters be your motivators.” When you’re trying to do something that has never been done before, you can’t be afraid of what people will think. Of course small-minded people will flinch and scoff. Every breakthrough was always considered a crazy idea before it worked. Logic ALWAYS follows intuition. Not the other way around. To repeat, logic always follows intuition. Hence, Albert Einstein has said, “I use my intuition, not logic, to help make these important decisions.” If you have something you want to do that isn’t necessarily traditional, don’t let that stop you from doing it. There are no cookie cutter molds to success. Of course, there are rules you can follow. But at the end of the day, you have to follow your gut. You have to create and live in the way that makes most sense to you. It will only truly work if it’s authentic. If people can feel it. If you force what you’re doing — or force yourself for that matter — into a box just because that box has been proven to work, you will live a shallow life. The feeling won’t be there. Which is the most important consideration both when assessing a person’s work and when assessing the person themselves. Humans are very emotional creatures. We judge people and things based on how they make us feel. We’re less rational than we like to think we are. If the feeling is not there, then the creator wasn’t feeling it either. They were forcing it. They were afraid. They were afraid of failing. They were afraid of what others might think. They were afraid of doing what in their heart they felt they should do. Your life is a product of your standards. If you’re willing to tolerate low-living, that’s exactly what you’ll get. If you’re willing to let fear dictate your decision making, you’ll never be free from your internal prison. You’ll never be able to act on your intuition. If, however, you hold yourself and your work to a high standard, than the work you produce will be powerful. Who cares how it’s received? That’s not the point. As Ryan Holiday has said: “If as a creative person, you have decided that the artiber of whether it was good or not, or whether your time was well-spent or not, is how it is received by other people, you have now taken your sense of self worth and you have deferred it out. You have placed it in other people’s control. And they are going to let you down from time-to-time. They are not going to appreciate what you did. They’re going to judge it. They’re going to be afraid of it.” Hence, Warren Buffett has said, “It’s better to live your life by an inner scorecard than an outer scoreboard.” So how do you measure your success? How do you measure you life? At the end of the day, either you are living a lie or you are being true to yourself. The chasm every person MUST cross in order to live at a higher and more positive frequency is courage. Until you act courageously, you will always be living in a negative way, whether that be based on fear, pride, jealously, anger, or any other number of negative emotional states. Courage is the baseline to everything positive. It’s the ground. It’s the starting point. DON’T BE AFRAID. Don’t hold back what you believe you should do. Everything you want is on the opposite side of fear. Every beautiful thing you will ever create must come truly from you. And the only way for you to do that work, and to make those connections, is for you to STOP WORRYING ABOUT YOURSELF. Get over your own sense of well-being so you can connect to other people and do work that truly resonates and connects. Hence the line from the Bible, you must lose yourself to find yourself. DON’T BE AFRAID. Don’t let other people’s standards or results or judgments stop you. Live powerfully. Create powerfully. Connect powerfully. Call To Action If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist. Click here to get the checklist right now! ", "name": "156", "child": "156_1\t156_2\t156_3\t156_4\t156_5\t156_6\t156_7\t156_8\t156_9\t156_10\t156_11\t156_12\t156_13\t156_14\t156_15\t156_16\t156_17\t156_18\t156_19\t156_20\t156_21\t156_22\t156_23\t156_24\t156_25", "timestamp": "Apr 14"}