{"parent": "", "title": "13 Things You Should Give Up If You Want To Be Successful", "author": "Zdravko Cvijetic", "sentences": [{"dfc8": "13 Things You Should Give Up If You Want To Be Successful"}, {"1421": "”Somebody once told me the definition of hell:"}, {"48ee": "“On your last day on earth, the person you became will meet the person you could have become.” — Anonymous"}, {"6269": "Sometimes, to become successful and get closer to the person we can become, we don’t need to add more things — we need to give up on some of them."}, {"e804": "There are certain things that are universal, which will make you successful if you give up on them, even though each one of us could have a different definition of success."}, {"7dc9": "You can give up on some of them today, while it might take a bit longer to give up on others."}, {"304a": "1. Give Up On The Unhealthy Lifestyle"}, {"e779": "“Take care of your body. It’s the only place you have to live.” — Jim Rohn"}, {"e9cd": "If you want to achieve anything in life, everything starts here. First you have to take care of your health, and there are only two things you need to keep in mind:"}, {"0bc2": "1. Healthy Diet2. Physical Activity"}, {"025e": "Small steps, but you will thank yourself one day."}, {"de39": "2. Give Up The Short-term Mindset"}, {"7d84": "“You only live once, but if you do it right, once is enough.” — Mae West"}, {"c2ee": "Successful people set long-term goals, and they know these aims are merely the result of short-term habits that they need to do every day."}, {"afb9": "These healthy habits shouldn’t be something you do; they should be something you embody."}, {"ac55": "There is a difference between: “Working out to get a summer body” and “Working out because that’s who you are.”"}, {"0a29": "3. Give Up On Playing Small"}, {"0a92": "“Your playing small does not serve the world. There is nothing enlightened about shrinking so that other people will not feel insecure around you. We are all meant to shine, as children do. It is not just in some of us; it is in everyone, and as we let our light shine, we unconsciously give others permission to do the same. As we are liberated from our fear, our presence automatically liberates others.” - Marianne Williamson"}, {"40f6": "If you never try and take great opportunities, or allow your dreams to become realities, you will never unleash your true potential."}, {"6d12": "And the world will never benefit from what you could have achieved."}, {"0c4b": "So voice your ideas, don’t be afraid to fail, and certainly don’t be afraid to succeed."}, {"a013": "4. Give Up Your Excuses"}, {"83fb": "“It’s not about the cards you’re dealt, but how you play the hand.”― Randy Pausch, The Last Lecture"}, {"bf7c": "Successful people know that they are responsible for their life, no matter their starting point, weaknesses, and past failures."}, {"f917": "Realising that you are responsible for what happens next in your life is both frightening and exciting."}, {"247c": "And when you do, that becomes the only way you can become successful, because excuses limit and prevent us from growing personally and professionally."}, {"5492": "Own your life; no one else will."}, {"0ae7": "5. Give Up The Fixed Mindset"}, {"28e8": "“The future belongs to those who learn more skills and combine them in creative ways.” ― Robert Greene, Mastery"}, {"5069": "People with a fixed mindset think their intelligence or talents are simply fixed traits, and that talent alone creates success — without effort. They’re wrong."}, {"a674": "Successful people know this. They invest an immense amount of time on a daily basis to develop a growth mindset, acquire new knowledge, learn new skills and change their perception so that it can benefit their lives."}, {"3541": "Remember, who you are today, it’s not who you have to be tomorrow."}, {"718c": "6. Give Up Believing In The “Magic Bullet.”"}, {"b35b": "“Every day, in every way, I’m getting better and better” — Émile Coué"}, {"73d3": "Overnight success is a myth."}, {"6d0d": "Successful people know that making small continual improvement every day will be compounded over time, and give them desirable results."}, {"9cd1": "That is why you should plan for the future, but focus on the day that’s ahead of you, and improve just 1% every day."}, {"7558": "7. Give Up Your Perfectionism"}, {"ed8a": "“Shipping beats perfection.” — Khan Academy’s Development Mantra"}, {"5936": "Nothing will ever be perfect, no matter how much we try."}, {"7109": "Fear of failure (or even fear of success) often prevents us from taking an action and putting our creation out there in the world. But a lot of opportunities will be lost if we wait for the things to be right."}, {"56f6": "So “ship,” and then improve (that 1%)."}, {"8a6d": "8. Give Up Multi-tasking"}, {"c02e": "“You will never reach your destination if you stop and throw stones at every dog that barks.” ― Winston S. Churchill"}, {"301d": "Successful people know this. That’s why they choose one thing and then beat it into submission. No matter what it is — a business idea, a conversation, or a workout."}, {"0168": "Being fully present and committed to one task, is indispensable."}, {"1f05": "9. Give Up Your Need to Control Everything"}, {"84c1": "“Some things are up to us, and some things are not up to us.” — Epictetus, Stoic philosopher"}, {"05c0": "Differentiating these two is important."}, {"389b": "Detach from the things you cannot control, and focus on the ones you can, and know that sometimes, the only thing you will be able to control is your attitude towards something."}, {"0169": "Remember, nobody can be frustrated while saying “Bubbles” in an angry voice."}, {"21af": "10. Give Up On Saying YES To Things That Don’t Support Your Goals"}, {"fb7b": "“He who would accomplish little must sacrifice little; he who would achieve much must sacrifice much; he who would attain highly must sacrifice greatly.” — James Allen"}, {"7012": "Successful people know that in order to accomplish their goals, they will have to say NO to certain tasks, activities, and demands from their friends, family, and colleagues."}, {"c109": "In the short-term, you might sacrifice a bit of instant gratification, but when your goals come to fruition, it will all be worth it."}, {"ca4c": "11. Give Up The Toxic People"}, {"94e1": "“You are the average of the five people you spend the most time with.”― Jim Rohn"}, {"287b": "People we spend the most time with, add up to who we become."}, {"b9cb": "There are people who are less accomplished in their personal and professional life, and there are people who are more accomplished than us. If you spend time with those who are behind you, your average will go down, and with it, your success."}, {"5999": "But if you spend time with people who are more accomplished than you, no matter how challenging that might be, you will become more successful."}, {"c18c": "Take a look at around you, and see if you need to make any changes."}, {"6c91": "12. Give Up Your Need To Be Liked"}, {"453d": "“The only way to avoid pissing people off is to do nothing important.” — Oliver Emberton"}, {"f630": "Think of yourself as a market niche."}, {"dd05": "There will be a lot of people who like that niche, and there will be individuals who don’t. And no matter what you do, you won’t be able to make the entire market like you."}, {"4d49": "This is entirely natural, and there’s no need to justify yourself."}, {"4f55": "The only thing you can do is to remain authentic, improve and provide value every day, and know that the growing number of “haters” means that you are doing important things."}, {"918a": "13. Give Up Your Dependency on Social Media & Television"}, {"2a53": "“The trouble is, you think you have time” — Jack Kornfield"}, {"bcfb": "Impulsive web browsing and television watching are diseases of today’s society.These two should never be an escape from your life or your goals."}, {"bdcc": "Unless your goals depend on either, you should minimise (or even eliminate) your dependency on them, and direct that time towards things that can enrich your life."}, {"0b87": "Call To Action"}, {"104d": "If you want to increase your productivity and eliminate procrastination, check out my free guide called: “The Ultimate Productivity Cheat Sheet (Revised Edition)”"}, {"60a1": "Click here to get the guide right now!"}, {"7d74": "PS: Now available in both PDF and Audio Versions."}, {"3cee": "One last thing…"}, {"e375": "If you liked this article, click the💚 below so other people will see it here on Medium."}], "content": "13 Things You Should Give Up If You Want To Be Successful ”Somebody once told me the definition of hell: “On your last day on earth, the person you became will meet the person you could have become.” — Anonymous Sometimes, to become successful and get closer to the person we can become, we don’t need to add more things — we need to give up on some of them. There are certain things that are universal, which will make you successful if you give up on them, even though each one of us could have a different definition of success. You can give up on some of them today, while it might take a bit longer to give up on others. 1. Give Up On The Unhealthy Lifestyle “Take care of your body. It’s the only place you have to live.” — Jim Rohn If you want to achieve anything in life, everything starts here. First you have to take care of your health, and there are only two things you need to keep in mind: 1. Healthy Diet2. Physical Activity Small steps, but you will thank yourself one day. 2. Give Up The Short-term Mindset “You only live once, but if you do it right, once is enough.” — Mae West Successful people set long-term goals, and they know these aims are merely the result of short-term habits that they need to do every day. These healthy habits shouldn’t be something you do; they should be something you embody. There is a difference between: “Working out to get a summer body” and “Working out because that’s who you are.” 3. Give Up On Playing Small “Your playing small does not serve the world. There is nothing enlightened about shrinking so that other people will not feel insecure around you. We are all meant to shine, as children do. It is not just in some of us; it is in everyone, and as we let our light shine, we unconsciously give others permission to do the same. As we are liberated from our fear, our presence automatically liberates others.” - Marianne Williamson If you never try and take great opportunities, or allow your dreams to become realities, you will never unleash your true potential. And the world will never benefit from what you could have achieved. So voice your ideas, don’t be afraid to fail, and certainly don’t be afraid to succeed. 4. Give Up Your Excuses “It’s not about the cards you’re dealt, but how you play the hand.”― Randy Pausch, The Last Lecture Successful people know that they are responsible for their life, no matter their starting point, weaknesses, and past failures. Realising that you are responsible for what happens next in your life is both frightening and exciting. And when you do, that becomes the only way you can become successful, because excuses limit and prevent us from growing personally and professionally. Own your life; no one else will. 5. Give Up The Fixed Mindset “The future belongs to those who learn more skills and combine them in creative ways.” ― Robert Greene, Mastery People with a fixed mindset think their intelligence or talents are simply fixed traits, and that talent alone creates success — without effort. They’re wrong. Successful people know this. They invest an immense amount of time on a daily basis to develop a growth mindset, acquire new knowledge, learn new skills and change their perception so that it can benefit their lives. Remember, who you are today, it’s not who you have to be tomorrow. 6. Give Up Believing In The “Magic Bullet.” “Every day, in every way, I’m getting better and better” — Émile Coué Overnight success is a myth. Successful people know that making small continual improvement every day will be compounded over time, and give them desirable results. That is why you should plan for the future, but focus on the day that’s ahead of you, and improve just 1% every day. 7. Give Up Your Perfectionism “Shipping beats perfection.” — Khan Academy’s Development Mantra Nothing will ever be perfect, no matter how much we try. Fear of failure (or even fear of success) often prevents us from taking an action and putting our creation out there in the world. But a lot of opportunities will be lost if we wait for the things to be right. So “ship,” and then improve (that 1%). 8. Give Up Multi-tasking “You will never reach your destination if you stop and throw stones at every dog that barks.” ― Winston S. Churchill Successful people know this. That’s why they choose one thing and then beat it into submission. No matter what it is — a business idea, a conversation, or a workout. Being fully present and committed to one task, is indispensable. 9. Give Up Your Need to Control Everything “Some things are up to us, and some things are not up to us.” — Epictetus, Stoic philosopher Differentiating these two is important. Detach from the things you cannot control, and focus on the ones you can, and know that sometimes, the only thing you will be able to control is your attitude towards something. Remember, nobody can be frustrated while saying “Bubbles” in an angry voice. 10. Give Up On Saying YES To Things That Don’t Support Your Goals “He who would accomplish little must sacrifice little; he who would achieve much must sacrifice much; he who would attain highly must sacrifice greatly.” — James Allen Successful people know that in order to accomplish their goals, they will have to say NO to certain tasks, activities, and demands from their friends, family, and colleagues. In the short-term, you might sacrifice a bit of instant gratification, but when your goals come to fruition, it will all be worth it. 11. Give Up The Toxic People “You are the average of the five people you spend the most time with.”― Jim Rohn People we spend the most time with, add up to who we become. There are people who are less accomplished in their personal and professional life, and there are people who are more accomplished than us. If you spend time with those who are behind you, your average will go down, and with it, your success. But if you spend time with people who are more accomplished than you, no matter how challenging that might be, you will become more successful. Take a look at around you, and see if you need to make any changes. 12. Give Up Your Need To Be Liked “The only way to avoid pissing people off is to do nothing important.” — Oliver Emberton Think of yourself as a market niche. There will be a lot of people who like that niche, and there will be individuals who don’t. And no matter what you do, you won’t be able to make the entire market like you. This is entirely natural, and there’s no need to justify yourself. The only thing you can do is to remain authentic, improve and provide value every day, and know that the growing number of “haters” means that you are doing important things. 13. Give Up Your Dependency on Social Media & Television “The trouble is, you think you have time” — Jack Kornfield Impulsive web browsing and television watching are diseases of today’s society.These two should never be an escape from your life or your goals. Unless your goals depend on either, you should minimise (or even eliminate) your dependency on them, and direct that time towards things that can enrich your life. Call To Action If you want to increase your productivity and eliminate procrastination, check out my free guide called: “The Ultimate Productivity Cheat Sheet (Revised Edition)” Click here to get the guide right now! PS: Now available in both PDF and Audio Versions. One last thing… If you liked this article, click the💚 below so other people will see it here on Medium. ", "name": "157", "child": "157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23157_1\t157_2\t157_3\t157_4\t157_5\t157_6\t157_7\t157_8\t157_9\t157_10\t157_11\t157_12\t157_13\t157_14\t157_15\t157_16\t157_17\t157_18\t157_19\t157_20\t157_21\t157_22\t157_23", "timestamp": "Dec 26, 2016"}