{"parent": "", "title": "My Inbox to Yours 005 | Experiencing Gratitude", "author": "Gary Vaynerchuk", "sentences": [{"4fc4": "My Inbox to Yours 005 | Experiencing Gratitude"}, {"6220": "This fifth installment of My Inbox to Yours is a special one because it’s all about loving the climb. Great things start to happen the second you change the way you think."}, {"201c": "From: StevenDate: Sun, Mar 19, 2017Subject: Experiencing GratitudeTo: Gary Vaynerchuk"}, {"b048": "Hi Gary,"}, {"8089": "I just wanted to thank you for helping me see the path to beating depression. For as long as I can remember I’ve been a dweller, wishing that I was like other people or had what they had, or did what they did. I’d talk a big talk about my plans but then I’d sit home with Netflix on and then have an anxiety attack realizing how much time I had wasted. Listening to the Gary Vee Audio Experience on Spotify during my commute and sometimes at work has really affirmed what I already knew about myself but couldn’t face, and opened me up to new concepts that I’d never considered."}, {"7780": "Instead of speaking my truth, I was speaking the truth I wished for, and that realization has really gotten me to shut the fuck up and DO. I’ve stopped actively dreaming and started actively doing the shit that I need to. I want to eat healthy- put the fucking fries down and stop ordering take-out. I want to finish my degree- okay, go do the homework you’ve been blowing off. I want to get better at bass guitar/write for the 5 bands I’m involved in- Sure turn off the TV and pick up your bass. I want to inject myself into and build my friend’s amazon re-selling business into a better organization- time to start eating shit and working late nights learning the ropes with him and identifying the problems in his process."}, {"cd27": "I’ve left the world of want and entered the world of “am,” I am doing these things, and I’m now experiencing gratitude for the periods of eating shit to get to where I wanted to be. I’m no longer focused on the fact that I’m not at my ideal weight. I’m just stoked every time I realize I’m at the gym doing something about it. I get excited when I notice that I’m sitting down doing homework, programming an app, or writing and practicing music, and I’m becoming happier, which I haven’t felt in a really long time."}, {"4278": "I’m living for the journey instead of for the end game, and I wouldn’t have found that source of gratitude, self-awareness, and discipline if I hadn’t started listening to your podcast. I HAD a lot of goals on my plate, but now I’ve just got a lot of journeys that I’m excited to embark on. Thank you for breathing new life into what was once a hollow shell of a person."}, {"71ae": "-Steven"}, {"6c6d": "P.S. And a big thank you to your team who has so beautifully captured and broadcast your message without distortion to the masses. They are all MVP’s in my book, and I am grateful for them doing the work that they have done as well."}, {"3b61": "Thanks for sending this email to me Steven 😊 😘"}, {"1fc0": "Quit or Be Patient"}, {"7877": "Thanks for reading my new series! If you enjoyed it, hit that heart button below ;)"}], "content": "My Inbox to Yours 005 | Experiencing Gratitude This fifth installment of My Inbox to Yours is a special one because it’s all about loving the climb. Great things start to happen the second you change the way you think. From: StevenDate: Sun, Mar 19, 2017Subject: Experiencing GratitudeTo: Gary Vaynerchuk Hi Gary, I just wanted to thank you for helping me see the path to beating depression. For as long as I can remember I’ve been a dweller, wishing that I was like other people or had what they had, or did what they did. I’d talk a big talk about my plans but then I’d sit home with Netflix on and then have an anxiety attack realizing how much time I had wasted. Listening to the Gary Vee Audio Experience on Spotify during my commute and sometimes at work has really affirmed what I already knew about myself but couldn’t face, and opened me up to new concepts that I’d never considered. Instead of speaking my truth, I was speaking the truth I wished for, and that realization has really gotten me to shut the fuck up and DO. I’ve stopped actively dreaming and started actively doing the shit that I need to. I want to eat healthy- put the fucking fries down and stop ordering take-out. I want to finish my degree- okay, go do the homework you’ve been blowing off. I want to get better at bass guitar/write for the 5 bands I’m involved in- Sure turn off the TV and pick up your bass. I want to inject myself into and build my friend’s amazon re-selling business into a better organization- time to start eating shit and working late nights learning the ropes with him and identifying the problems in his process. I’ve left the world of want and entered the world of “am,” I am doing these things, and I’m now experiencing gratitude for the periods of eating shit to get to where I wanted to be. I’m no longer focused on the fact that I’m not at my ideal weight. I’m just stoked every time I realize I’m at the gym doing something about it. I get excited when I notice that I’m sitting down doing homework, programming an app, or writing and practicing music, and I’m becoming happier, which I haven’t felt in a really long time. I’m living for the journey instead of for the end game, and I wouldn’t have found that source of gratitude, self-awareness, and discipline if I hadn’t started listening to your podcast. I HAD a lot of goals on my plate, but now I’ve just got a lot of journeys that I’m excited to embark on. Thank you for breathing new life into what was once a hollow shell of a person. -Steven P.S. And a big thank you to your team who has so beautifully captured and broadcast your message without distortion to the masses. They are all MVP’s in my book, and I am grateful for them doing the work that they have done as well. Thanks for sending this email to me Steven 😊 😘 Quit or Be Patient Thanks for reading my new series! If you enjoyed it, hit that heart button below ;) ", "name": "160", "child": "160_1\t160_2\t160_3\t160_4\t160_5\t160_6", "timestamp": "Apr 14"}