{"parent": "", "title": "Ignore Your Goals and Follow These Steps", "author": "Zat Rana", "sentences": [{"9f25": "Ignore Your Goals and Follow These Steps"}, {"4cd5": "Let’s start with a story."}, {"8626": "In the 16th century, one man produced a monumental work of art."}, {"7e78": "The Sistine Chapel ceiling was commissioned in 1508, and it took 4 years for Michelangelo to paint. Due to its inaccessibility, he put an incredible amount of strain on his body to craft over 300 figures and their environment."}, {"0fe5": "In busier times, 25,000 people visit the Vatican Museums per day. The Chapel is the main attraction. It is a cultural, historical, and visual spectacle."}, {"fea1": "Funnily enough, Michelangelo never considered himself a painter. He had quite a low opinion of the art. He saw himself mainly as a sculptor, and he had already produced two of his most famous works, Pieta and David, by 30."}, {"f756": "More than anything, however, what he did love — regardless of his choice of expression — was creating. He thought of himself as a man in the constant pursuit of learning, and he was far more concerned with the process of what he undertook in than the medium itself."}, {"d7f8": "There’s an old myth of a friend watching Michelangelo labor over a small, obscure corner of the Sistine Chapel. The friend asked:"}, {"5351": "“Who will ever know whether or not it’s perfect?”"}, {"c539": "Michelangelo had only two words for him."}, {"e9d4": "“I will.”"}, {"a3e1": "When pursuing results, we often direct far too much attention on the goal. And by doing that, we neglect the path that paves the way. From the little we can extrapolate about Michelangelo, it seems he knew the difference."}, {"7c26": "Goal achievement isn’t about the goal. It’s about what you do to get there."}, {"f30a": "Design a Strategy into a System"}, {"22ba": "Achievement is built on three steps: a goal, a strategy, and implementation."}, {"7f26": "The goal is the easy part. It’s bright and shiny, and it’s what we daydream about when we should be directing our focus and energy elsewhere."}, {"37e9": "The strategy is the first productive step. It establishes commitment, and it sets us in motion. Here we outline most of the details of the journey."}, {"0e61": "The final part of the equation is implementation, and this is where things usually fall apart. Most people vastly underestimate what it takes, and that’s precisely why they give up once they realize how hard it is."}, {"d26e": "The most important part of accomplishing anything is translating a strategy into a system. It’s fine and well to layout what you want and where to go, but to be effective, you have to know what your days are going to look like."}, {"7c03": "You have to break off each part of your larger strategy and design these bits into a corresponding schedule that’s guided by consistency and habit."}, {"8040": "Hoping that you wake up and put in a few hours where you can rarely cuts the chase in the long run. There are exceptions, of course, but for most of us implementation requires discipline beyond intrinsic motivation."}, {"1652": "Find the Joy in Mundanity"}, {"2329": "It took Michelangelo four years to complete that ceiling, and he wasn’t even crazy about the art of painting. In spite of that, he consistently showed up and invested his time and even compromised his health to do the work."}, {"e22f": "The goal of finishing his masterpiece was no doubt a driving factor, but if that were his sole motivator, he likely would’ve quit like many of us do."}, {"511f": "For him, it was about more than that. It was about the process of creating, the quest for perfection, and the joy of improving. On a day to day basis, what he did was likely mundane and uninspiring, but it was a system that he had committed his life to."}, {"8493": "He understood what great work required, and to that end, he knew what was needed. He fell in love with the process, and the result was a byproduct."}, {"eaf1": "Almost all of our big goals take hard work. There’s no way around it. You can be more efficient, sure, but no shortcuts eliminate the need for putting in hours and going through the gestures. And these gestures aren’t romantic."}, {"f942": "They are redundant and unexciting, and to succeed is to make them not so. You have to deliberately question what about the system you love, and you have to learn to enjoy the work, day in and day out."}, {"cdf6": "Let Marginal Gains Compound"}, {"afbf": "The conventional wisdom says that big results require big leaps. That’s not entirely untrue. It’s just that those leaps rarely occur as sudden, big jumps."}, {"b03c": "If you want to run a local marathon by the end of the year, it’s probably not wise to try to do so during your first practice session. It won’t happen."}, {"3ec8": "If we presume that to go big, we have to act big, the initial burden of effort is far too high, and it demotivates us into inaction. It makes far more sense to focus on marginal improvements."}, {"2b7d": "These are easy to strive for, and they reinforce our conviction to keep going."}, {"2e78": "Instead of running the marathon on the first or even the eighth practice day, if you focus on adding half a mile or a mile to your run with each session, you find yourself a more manageable way to get to your eventual goal."}, {"c48e": "The beauty of these marginal gains is that they add up. Each improvement builds on the one before it, and over time, the result is a massive multiplier."}, {"091b": "Hypothetically, if you gained 1 percent daily for a year, you’d get 1.01³⁶⁵ = 37.78. In short, you’d be almost 38 times better than you were at the start."}, {"79f9": "Harness Small Wins for Momentum"}, {"9dbe": "Researchers Teresa Amabile and Steven Kramer once analysed 12,000 journal entries of over 200 knowledge workers at seven different companies."}, {"5ffe": "They presented their findings in The Progress Principle, published with the Harvard Business Review Press, and they found a particularly striking trend."}, {"56d4": "They observed that one of the most significant predictors of well-being at work was the idea of small wins. When people had tiny milestones designed into their larger ones, they felt that they made more progress."}, {"3bd8": "These wins worked as a catalyst that kept them going further and further, and the authors even proposed that this fact is one of the hidden forces that drive the overall performance of effective organizations."}, {"85e9": "It‘s not hard to see why this might be. Our goals are often bigger than we are when we first start out. Without feedback, it can be easy to lose sight."}, {"9fca": "Momentum is what drives the process ahead, and to be truly effective, it needs a consistent dose of fuel. Well-distributed small wins provide exactly that."}, {"b30a": "Record and Measure to Visualize Progress"}, {"ef80": "The easiest and most effective thing you can do is record and measure."}, {"d55a": "By simply tracking and documenting where you’ve been, you can visualize the chain of growth nurtured from the marginal steps taken over time."}, {"762a": "Sometimes, with marginal gains, precisely because they make the larger goal more bearable, it can be difficult to see if they’re getting us anywhere. A 1 percent improvement per day doesn’t appear too mightily in the moment."}, {"ab0d": "Recording and measuring, however, captures their compound effect."}, {"7095": "In late 2015, Benjamin Harkin and his colleagues published a meta-analysis of 138 studies made up of almost 20,000 subjects to try and figure out whether monitoring goal progress promotes goal attainment."}, {"f77c": "They studied health goals across weight loss, blood pressure, and smoking. Not surprisingly, they found the expected correlation. More interestingly, however, they observed that the more frequent the monitoring, the better the outcome. And something as simple as physically recording progress as opposed to making a mental note made a notable difference, too."}, {"9f85": "We have a tendency to direct focus ahead as opposed to backward when it comes to our goals. It’s a habit that gets in the way because it stops us from using the same feedback tools that will get us to where our sights are set."}, {"469b": "Identify your metrics, choose a time to monitor them, and put pen to paper."}, {"300b": "All You Need to Know"}, {"d98b": "We all want things. We want to be smarter, kinder, and more successful."}, {"d6b4": "The exact priorities may be different for each of us, but a greater desire for something in the future is an impulse we all share. Often, we spend so much time thinking about goals that it detracts from our ability to achieve them."}, {"54a8": "What leads to a goal is a path, routine, or a system. And this part of the machine is the most difficult to maintain. It takes the most time and effort."}, {"9cf6": "Here are the main steps to focus on:"}, {"cc48": "I. With a goal and an initial strategy in place, it starts with deliberately designing that strategy into a system. Implementation is hard, and most of us need discipline. The process of getting to the end is lined with hard work, redundancy, and boredom. On a day to day basis, it isn’t very sexy. The only way through all that is to have a routine and to learn to love the mundanity."}, {"55ca": "II. Focus on marginal improvements to get moving. Our goals are often bigger than we are at first. The way to them isn’t with sudden, big leaps. It’s through tiny step by step gains. Starting light and harnessing small wins lowers the motivation barrier and sustains momentum. The incremental improvements eventually compound into massive progress."}, {"94d4": "III. The last step is to record and measure marginal improvements to continuously drive the process until the end. It will help you visualize the effect of compounded gains, and it creates a chain of progress that paves the path towards further progress. It can be done by simply picking a time, a relevant metric, and putting pen to paper."}, {"f886": "Thinking in terms of the process while neglecting the goal isn’t easy. The goal is straightforward and romantic, while the process is long and unsexy."}, {"32bf": "But it’s a critical mindset because the process is what’s going to get you there."}, {"0d00": "Worth reading?"}, {"e78e": "Please press the💚 and share it with friends. It helps more people see it."}, {"0b72": "Want more?"}, {"65e8": "This was posted on Design Luck. It’s where I share unique insights on how to live a better life by dissecting science, art, and business. I think you’d like it."}], "content": "Ignore Your Goals and Follow These Steps Let’s start with a story. In the 16th century, one man produced a monumental work of art. The Sistine Chapel ceiling was commissioned in 1508, and it took 4 years for Michelangelo to paint. Due to its inaccessibility, he put an incredible amount of strain on his body to craft over 300 figures and their environment. In busier times, 25,000 people visit the Vatican Museums per day. The Chapel is the main attraction. It is a cultural, historical, and visual spectacle. Funnily enough, Michelangelo never considered himself a painter. He had quite a low opinion of the art. He saw himself mainly as a sculptor, and he had already produced two of his most famous works, Pieta and David, by 30. More than anything, however, what he did love — regardless of his choice of expression — was creating. He thought of himself as a man in the constant pursuit of learning, and he was far more concerned with the process of what he undertook in than the medium itself. There’s an old myth of a friend watching Michelangelo labor over a small, obscure corner of the Sistine Chapel. The friend asked: “Who will ever know whether or not it’s perfect?” Michelangelo had only two words for him. “I will.” When pursuing results, we often direct far too much attention on the goal. And by doing that, we neglect the path that paves the way. From the little we can extrapolate about Michelangelo, it seems he knew the difference. Goal achievement isn’t about the goal. It’s about what you do to get there. Design a Strategy into a System Achievement is built on three steps: a goal, a strategy, and implementation. The goal is the easy part. It’s bright and shiny, and it’s what we daydream about when we should be directing our focus and energy elsewhere. The strategy is the first productive step. It establishes commitment, and it sets us in motion. Here we outline most of the details of the journey. The final part of the equation is implementation, and this is where things usually fall apart. Most people vastly underestimate what it takes, and that’s precisely why they give up once they realize how hard it is. The most important part of accomplishing anything is translating a strategy into a system. It’s fine and well to layout what you want and where to go, but to be effective, you have to know what your days are going to look like. You have to break off each part of your larger strategy and design these bits into a corresponding schedule that’s guided by consistency and habit. Hoping that you wake up and put in a few hours where you can rarely cuts the chase in the long run. There are exceptions, of course, but for most of us implementation requires discipline beyond intrinsic motivation. Find the Joy in Mundanity It took Michelangelo four years to complete that ceiling, and he wasn’t even crazy about the art of painting. In spite of that, he consistently showed up and invested his time and even compromised his health to do the work. The goal of finishing his masterpiece was no doubt a driving factor, but if that were his sole motivator, he likely would’ve quit like many of us do. For him, it was about more than that. It was about the process of creating, the quest for perfection, and the joy of improving. On a day to day basis, what he did was likely mundane and uninspiring, but it was a system that he had committed his life to. He understood what great work required, and to that end, he knew what was needed. He fell in love with the process, and the result was a byproduct. Almost all of our big goals take hard work. There’s no way around it. You can be more efficient, sure, but no shortcuts eliminate the need for putting in hours and going through the gestures. And these gestures aren’t romantic. They are redundant and unexciting, and to succeed is to make them not so. You have to deliberately question what about the system you love, and you have to learn to enjoy the work, day in and day out. Let Marginal Gains Compound The conventional wisdom says that big results require big leaps. That’s not entirely untrue. It’s just that those leaps rarely occur as sudden, big jumps. If you want to run a local marathon by the end of the year, it’s probably not wise to try to do so during your first practice session. It won’t happen. If we presume that to go big, we have to act big, the initial burden of effort is far too high, and it demotivates us into inaction. It makes far more sense to focus on marginal improvements. These are easy to strive for, and they reinforce our conviction to keep going. Instead of running the marathon on the first or even the eighth practice day, if you focus on adding half a mile or a mile to your run with each session, you find yourself a more manageable way to get to your eventual goal. The beauty of these marginal gains is that they add up. Each improvement builds on the one before it, and over time, the result is a massive multiplier. Hypothetically, if you gained 1 percent daily for a year, you’d get 1.01³⁶⁵ = 37.78. In short, you’d be almost 38 times better than you were at the start. Harness Small Wins for Momentum Researchers Teresa Amabile and Steven Kramer once analysed 12,000 journal entries of over 200 knowledge workers at seven different companies. They presented their findings in The Progress Principle, published with the Harvard Business Review Press, and they found a particularly striking trend. They observed that one of the most significant predictors of well-being at work was the idea of small wins. When people had tiny milestones designed into their larger ones, they felt that they made more progress. These wins worked as a catalyst that kept them going further and further, and the authors even proposed that this fact is one of the hidden forces that drive the overall performance of effective organizations. It‘s not hard to see why this might be. Our goals are often bigger than we are when we first start out. Without feedback, it can be easy to lose sight. Momentum is what drives the process ahead, and to be truly effective, it needs a consistent dose of fuel. Well-distributed small wins provide exactly that. Record and Measure to Visualize Progress The easiest and most effective thing you can do is record and measure. By simply tracking and documenting where you’ve been, you can visualize the chain of growth nurtured from the marginal steps taken over time. Sometimes, with marginal gains, precisely because they make the larger goal more bearable, it can be difficult to see if they’re getting us anywhere. A 1 percent improvement per day doesn’t appear too mightily in the moment. Recording and measuring, however, captures their compound effect. In late 2015, Benjamin Harkin and his colleagues published a meta-analysis of 138 studies made up of almost 20,000 subjects to try and figure out whether monitoring goal progress promotes goal attainment. They studied health goals across weight loss, blood pressure, and smoking. Not surprisingly, they found the expected correlation. More interestingly, however, they observed that the more frequent the monitoring, the better the outcome. And something as simple as physically recording progress as opposed to making a mental note made a notable difference, too. We have a tendency to direct focus ahead as opposed to backward when it comes to our goals. It’s a habit that gets in the way because it stops us from using the same feedback tools that will get us to where our sights are set. Identify your metrics, choose a time to monitor them, and put pen to paper. All You Need to Know We all want things. We want to be smarter, kinder, and more successful. The exact priorities may be different for each of us, but a greater desire for something in the future is an impulse we all share. Often, we spend so much time thinking about goals that it detracts from our ability to achieve them. What leads to a goal is a path, routine, or a system. And this part of the machine is the most difficult to maintain. It takes the most time and effort. Here are the main steps to focus on: I. With a goal and an initial strategy in place, it starts with deliberately designing that strategy into a system. Implementation is hard, and most of us need discipline. The process of getting to the end is lined with hard work, redundancy, and boredom. On a day to day basis, it isn’t very sexy. The only way through all that is to have a routine and to learn to love the mundanity. II. Focus on marginal improvements to get moving. Our goals are often bigger than we are at first. The way to them isn’t with sudden, big leaps. It’s through tiny step by step gains. Starting light and harnessing small wins lowers the motivation barrier and sustains momentum. The incremental improvements eventually compound into massive progress. III. The last step is to record and measure marginal improvements to continuously drive the process until the end. It will help you visualize the effect of compounded gains, and it creates a chain of progress that paves the path towards further progress. It can be done by simply picking a time, a relevant metric, and putting pen to paper. Thinking in terms of the process while neglecting the goal isn’t easy. The goal is straightforward and romantic, while the process is long and unsexy. But it’s a critical mindset because the process is what’s going to get you there. Worth reading? Please press the💚 and share it with friends. It helps more people see it. Want more? This was posted on Design Luck. It’s where I share unique insights on how to live a better life by dissecting science, art, and business. I think you’d like it. ", "name": "162", "child": "162_1\t162_2\t162_3\t162_4\t162_5\t162_6\t162_7162_1\t162_2\t162_3\t162_4\t162_5\t162_6\t162_7162_1\t162_2\t162_3\t162_4\t162_5\t162_6\t162_7", "timestamp": "Apr 14"}