{"parent": "", "title": "11 Unspoken Guidelines to Win Friends & Influence Investors in Silicon Valley", "author": "Tristan Pollock", "sentences": [{"19d9": "11 Unspoken Guidelines to Win Friends & Influence Investors in Silicon Valley"}, {"b680": "The new-in-town crash course on Silicon Valley etiquette"}, {"de07": "I get a lot of emails (563 per day to be exact)."}, {"e14c": "I also get a lot of asks for intros."}, {"b47d": "A lot of intros."}, {"743e": "I don’t throw these numbers out to show how popular I am. The reality is that a lot of people — probably a lot of the people you’re trying to reach right now — get a lot more emails than I do."}, {"f782": "When I started mentoring companies at 500 Startups in my E.I.R. role, I started reflecting on everything I’ve learned as a Minnesotan who relocated to San Francisco a little over four years ago."}, {"ad9d": "In the North of the United States (yes, it’s ‘the North,’ not the Midwest) we are known for being ‘Minnesota Nice,’ so I took my principles of being a respectful, caring Northerner and massaged my approach as I integrated into the tech scene on the West Coast."}, {"baa3": "There are very subtle things tech founders and people should both know and do. I learned them by experience after moving here from Minnesota — my motto is “move fast, break things.” My hope is that by sharing some of these mundane but incredibly important notes on communication, I can give founders and tech people that have relocated from other parts of the US or world a head start and the opportunity to break fewer things (i.e. relationships) in their first few months or years in San Francisco and Silicon Valley."}, {"c843": "EMAIL"}, {"5b71": "1. @yourdomain.com"}, {"f48e": "This sounds obvious, but always send from your company domain (e.g. @thestorefront.com). I always work with a few startups every accelerator program that use their personal email. It makes it look like you aren’t focused on your business, or are too lazy to set up a business email account. Google Apps, use it!"}, {"7877": "2. Email signature"}, {"4e97": "Have a catchy email signature. Everyone sees it. Also, for incoming emails and the ability to quickly identify the emailer on LinkedIn use the Rapportive Chrome extension for Gmail."}, {"5b38": "BONUS: Add a tracked link and record how many site visits your footer brings."}, {"92cf": "EXTRA BONUS: Consider adding a promo code and tracking that. There’s value to capture in your email signature, so play around and see what you can come up with."}, {"b4c4": "Example:"}, {"df61": "The above signature made with SignBot."}, {"7c61": "3. #ABC — Always Be Closing"}, {"cc9d": "Every email, conversation, or message of any kind is an opportunity to sell your company — subtle or not. Give people a link back to your company in both your signature and email address every single time."}, {"6fab": "4. Geographic abbreviations"}, {"c45b": "A quick point on geographic abbreviations:"}, {"324e": "SF = San Francisco"}, {"e6c3": "MV = Mountain View"}, {"ded6": "PA = Palo Alto"}, {"c82f": "Sand Hill Road = Investor Central Avenue"}, {"0298": "INTROS"}, {"6d95": "5. BCC and thank your connection"}, {"7604": "Always BCC and thank the intro person after accepting the email."}, {"e80f": "Example: ‘Thanks Tristan > bcc.’ at the top of the email body."}, {"7633": "6. Response time"}, {"b2bd": "Respond quickly (24 hours or less). The faster the better."}, {"cb22": "It shows you are on top of your game, and that you care."}, {"74f5": "7. Personal, not pushy"}, {"0a99": "Don’t ask for intros in an initial email to a founder; ask after the second or third conversation. Really get to know other founders and investors and understand their unique personality."}, {"59f5": "SF is the place to be for unique personalities."}, {"c677": "Overall, relationships rule, and talking to someone in person is always the most memorable."}, {"9936": "A tip on finding your strongest intro to someone beyond LinkedIn or AngelList: Conspire.com."}, {"b81b": "8. The 15-minute call"}, {"4338": "I often suggest a quick 15-minute call to talk about X, Y, Z specific points in order to not waste someone’s time that doesn’t know me yet."}, {"5a2d": "9. Follow-ups"}, {"463d": "If you took an intro, let the intro-maker know how it went. I always appreciate a follow-up, thank you, and to know it actually helped to make the intro."}, {"fbcc": "Brent Locks, the founder of Pict, once broke down the components of a good, forwardable investor intro email for me:"}, {"efda": "> Quick one-liner saying what’s up to me."}, {"cf6a": "> Who you want an intro to. What you guys are doing. How/why what you’re doing means you must meet X investor (i.e. how you guys would benefit). It’s why you must meet them and why they must meet you. It’s a two way street. It’s a partnership. It’s not only why you would benefit (you’re gonna get money, duh!)."}, {"2b57": "> Traction (talk it up). “As you know, we’re killing it, we’re crushing it, we’re squishing it, etc.” Using the words “killing it” or “crushing it” will almost certainly land your email in the trash. Do NOT use those words. Traction should be quantifiable."}, {"5760": "> Add your Angel.co link."}, {"a880": "> Attach an overview deck or one-pager. Many legit investors won’t do a meeting without seeing something in advance.*"}, {"a0a8": "> Make sure to be genuine. While this is the template, these emails aren’t mad libs."}, {"3d26": "For me, Brent’s second to last point is debatable, I think you should have a pitch deck and shorter email-ready deck or one-pager ready, but there also should be some reciprocity or interest on the investors part before divulging a full deck or company numbers."}, {"2a6d": "Dave McClure also adds:"}, {"2d18": "I always like three bullets of milestones, as well as a link to the company’s AngelList profile, both in footer and body of the email."}, {"8e1e": "– MRR / ARR is $X."}, {"261d": "– Growth is Y% average over the past 3–6 months."}, {"4fb9": "– Raised $Z from notable investors A, B, C."}, {"5a35": "Here’s an example (with names and numbers changed) from Varun Khona of HeadOut — my mentee in Batch 11 of the 500 Startups accelerator."}, {"32ec": "SUBJECT LINE:"}, {"ea6f": "Intro to [Investor] at [Fund Name]"}, {"736f": "BODY:"}, {"8ea7": "Hey Tristan,"}, {"eb1d": "I would like to get in touch with [Investor Name] from [Fund Name]. They have a very strong portfolio of on-demand mobile services such as Lyft, Uber and Washio and would be a great strategic fit with Headout."}, {"62f0": "Below is a quick blurb you can forward."}, {"e0cc": "Headout is a mobile marketplace for spontaneous travelers to discover & book local activities on-demand for the next 24 hours. Think of it as the HotelTonight for tours & experiences."}, {"5cde": "Traction:"}, {"256d": "– $XM sales run-rate in 6 months"}, {"ccb2": "– Growing X% month-over-month"}, {"8bf5": "– Average transaction size is $X"}, {"dca3": "We are raising our seed round and would love to talk."}, {"d2d9": "You can download the app here: https://www.headout.com/app — or visit our AngelList Profile."}, {"946a": "Thanks,"}, {"f2a8": "Varun"}, {"b587": "I call this a ‘forwardable intro’ email and, if I’m excited about the product, founder, and industry, as I am with Varun and HeadOut, I would forward this email to the respective investor and tell them why I’m excited."}, {"3ddc": "In closing, these tips are obviously only a snapshot of how Silicon Valley (and San Francisco) communicate, but keeping these points in mind when talking with founders, investors, journalists, and others in the tech scene is incredibly important to growing your network and being respected."}, {"1980": "Overall, #ABT, too: ALWAYS BE THOUGHTFUL. It’s hugely respected by founders and investors."}, {"6186": "Till next time, stay nice and KEEP HUSTLING."}], "content": "11 Unspoken Guidelines to Win Friends & Influence Investors in Silicon Valley The new-in-town crash course on Silicon Valley etiquette I get a lot of emails (563 per day to be exact). I also get a lot of asks for intros. A lot of intros. I don’t throw these numbers out to show how popular I am. The reality is that a lot of people — probably a lot of the people you’re trying to reach right now — get a lot more emails than I do. When I started mentoring companies at 500 Startups in my E.I.R. role, I started reflecting on everything I’ve learned as a Minnesotan who relocated to San Francisco a little over four years ago. In the North of the United States (yes, it’s ‘the North,’ not the Midwest) we are known for being ‘Minnesota Nice,’ so I took my principles of being a respectful, caring Northerner and massaged my approach as I integrated into the tech scene on the West Coast. There are very subtle things tech founders and people should both know and do. I learned them by experience after moving here from Minnesota — my motto is “move fast, break things.” My hope is that by sharing some of these mundane but incredibly important notes on communication, I can give founders and tech people that have relocated from other parts of the US or world a head start and the opportunity to break fewer things (i.e. relationships) in their first few months or years in San Francisco and Silicon Valley. EMAIL 1. @yourdomain.com This sounds obvious, but always send from your company domain (e.g. @thestorefront.com). I always work with a few startups every accelerator program that use their personal email. It makes it look like you aren’t focused on your business, or are too lazy to set up a business email account. Google Apps, use it! 2. Email signature Have a catchy email signature. Everyone sees it. Also, for incoming emails and the ability to quickly identify the emailer on LinkedIn use the Rapportive Chrome extension for Gmail. BONUS: Add a tracked link and record how many site visits your footer brings. EXTRA BONUS: Consider adding a promo code and tracking that. There’s value to capture in your email signature, so play around and see what you can come up with. Example: The above signature made with SignBot. 3. #ABC — Always Be Closing Every email, conversation, or message of any kind is an opportunity to sell your company — subtle or not. Give people a link back to your company in both your signature and email address every single time. 4. Geographic abbreviations A quick point on geographic abbreviations: SF = San Francisco MV = Mountain View PA = Palo Alto Sand Hill Road = Investor Central Avenue INTROS 5. BCC and thank your connection Always BCC and thank the intro person after accepting the email. Example: ‘Thanks Tristan > bcc.’ at the top of the email body. 6. Response time Respond quickly (24 hours or less). The faster the better. It shows you are on top of your game, and that you care. 7. Personal, not pushy Don’t ask for intros in an initial email to a founder; ask after the second or third conversation. Really get to know other founders and investors and understand their unique personality. SF is the place to be for unique personalities. Overall, relationships rule, and talking to someone in person is always the most memorable. A tip on finding your strongest intro to someone beyond LinkedIn or AngelList: Conspire.com. 8. The 15-minute call I often suggest a quick 15-minute call to talk about X, Y, Z specific points in order to not waste someone’s time that doesn’t know me yet. 9. Follow-ups If you took an intro, let the intro-maker know how it went. I always appreciate a follow-up, thank you, and to know it actually helped to make the intro. Brent Locks, the founder of Pict, once broke down the components of a good, forwardable investor intro email for me: > Quick one-liner saying what’s up to me. > Who you want an intro to. What you guys are doing. How/why what you’re doing means you must meet X investor (i.e. how you guys would benefit). It’s why you must meet them and why they must meet you. It’s a two way street. It’s a partnership. It’s not only why you would benefit (you’re gonna get money, duh!). > Traction (talk it up). “As you know, we’re killing it, we’re crushing it, we’re squishing it, etc.” Using the words “killing it” or “crushing it” will almost certainly land your email in the trash. Do NOT use those words. Traction should be quantifiable. > Add your Angel.co link. > Attach an overview deck or one-pager. Many legit investors won’t do a meeting without seeing something in advance.* > Make sure to be genuine. While this is the template, these emails aren’t mad libs. For me, Brent’s second to last point is debatable, I think you should have a pitch deck and shorter email-ready deck or one-pager ready, but there also should be some reciprocity or interest on the investors part before divulging a full deck or company numbers. Dave McClure also adds: I always like three bullets of milestones, as well as a link to the company’s AngelList profile, both in footer and body of the email. – MRR / ARR is $X. – Growth is Y% average over the past 3–6 months. – Raised $Z from notable investors A, B, C. Here’s an example (with names and numbers changed) from Varun Khona of HeadOut — my mentee in Batch 11 of the 500 Startups accelerator. SUBJECT LINE: Intro to [Investor] at [Fund Name] BODY: Hey Tristan, I would like to get in touch with [Investor Name] from [Fund Name]. They have a very strong portfolio of on-demand mobile services such as Lyft, Uber and Washio and would be a great strategic fit with Headout. Below is a quick blurb you can forward. Headout is a mobile marketplace for spontaneous travelers to discover & book local activities on-demand for the next 24 hours. Think of it as the HotelTonight for tours & experiences. Traction: – $XM sales run-rate in 6 months – Growing X% month-over-month – Average transaction size is $X We are raising our seed round and would love to talk. You can download the app here: https://www.headout.com/app — or visit our AngelList Profile. Thanks, Varun I call this a ‘forwardable intro’ email and, if I’m excited about the product, founder, and industry, as I am with Varun and HeadOut, I would forward this email to the respective investor and tell them why I’m excited. In closing, these tips are obviously only a snapshot of how Silicon Valley (and San Francisco) communicate, but keeping these points in mind when talking with founders, investors, journalists, and others in the tech scene is incredibly important to growing your network and being respected. Overall, #ABT, too: ALWAYS BE THOUGHTFUL. It’s hugely respected by founders and investors. Till next time, stay nice and KEEP HUSTLING. ", "name": "165", "child": "165_1", "timestamp": "Apr 14"}