{"parent": "", "title": "How to Make Money With a Book", "author": "Tucker Max", "sentences": [{"071a": "How to Make Money With a Book"}, {"40fc": "It’s possible to make a lot of money from a book, but only if you approach it the right way."}, {"7b51": "This is the wrong way: “How do I sell a lot of books?”"}, {"2753": "This is the right way: “How do I use my book as a tool to make money?”"}, {"bb9b": "Aren’t those two things the same? Isn’t selling books the same as using a book to make money?"}, {"c3b3": "Absolutely not. In fact, focusing on book sales is usually the worst way to make money from a book."}, {"d35c": "If you want to make money from a book, don’t focus on selling copies, use your book as a marketing tool that gets you attention and sales for something else."}, {"b8c4": "There are two main reasons why:"}, {"82b1": "1. It’s hard to sell book copies"}, {"3ff3": "A fact of life: it’s nearly impossible to sell a lot of copies of a book."}, {"2261": "Last year, there were about 300,000 new books published in America. BookScan, the company that measures all book sales, says that only about 200 books per year sell 100,000 copies. The number of books that reached 1 million sold last year is even fewer, probably close to 10 (and almost all of those were novels)."}, {"41f5": "And virtually no book does more than that. The list of books that have sold 10 million copies in history is so small there’s a Wikipedia page about them."}, {"934e": "What’s even worse is that you can’t charge enough for books to generate good revenue from them. The highest you can charge is about $25, give or take. The greatest book ever written, if it costs more than that, won’t get bought. People have a low limit on their perceived value for books."}, {"3f13": "There is only one group of people who must focus on how many copies they sell: Professional writers (like novelists, fiction writers, etc). They need to worry about selling copies of books because book sales are only way they can make money!"}, {"f91b": "They don’t have anything else to sell but a copy of the book. But this is not true for most authors."}, {"3f0c": "2. If your book is a marketing tool for something else, it’s easy to make money"}, {"9c27": "Once you stop thinking about book sales, and start thinking about a book as a way to sell something else, everything changes. This is how we advise our clients to look at books:"}, {"937a": "A book is a multi-purpose marketing tool with unique and special abilities to create attention that you can turn into sales."}, {"8bdb": "For entrepreneurs and professionals and other business people–people who own companies, are experts in their fields, and have some other activity they get paid for like speaking or consulting or coaching–the book itself creates attention, and that attention is the means to selling the other, larger opportunities that can be VERY profitable."}, {"965e": "You can sell products, services, speaking, consulting, software–any number of things."}, {"dac2": "Great example: Our first client was a woman named Melissa Gonzalez. She did a book with us, and it’s called The Pop Up Paradigm. She estimates she’s made over a million dollars from the book."}, {"1630": "You want to hear what’s even crazier? She did it selling LESS than 1000 copies."}, {"b8ae": "How? Because she wrote it to market her business, not to sell copies."}, {"562f": "Melissa is one of the world’s premier experts in a very niche space (pop-up retail). Obviously, not many people care about books on retail, and even fewer care about pop-up retail, so focusing on selling copies was a losing strategy from the start. There just wasn’t a large audience for that topic."}, {"f044": "Instead, she focused on reaching the decision-makers in the retail space–the types of people who would hire her as a consultant. She did this by focusing her book on how the new techniques she pioneered in pop-up retail could help stagnating retail businesses. She shared her knowledge and expertise, and because her book was the first one that deeply explored this topic, she became the recognized expert in this niche field."}, {"dc6a": "Which led to all the decision makers in retail–the exact people she wanted as clients–to come to her."}, {"8f79": "Her book tripled the inbound leads to her consulting business, and she was signed a multi-million dollar contract with one of the largest mall companies in America to create and implement their pop-up strategy."}, {"5a1e": "All because of her book. It was a marketing tool intended to get attention for her from a very specific set of people, and it worked (see her full story here)."}, {"726d": "How Does A Book Get You Attention?"}, {"9fe1": "I’m going to explain all the ways you can monetize a book, but first, you need to understand how the “book as a marketing tool” works. Remember what I said earlier:"}, {"2cef": "A book is a multi-purpose marketing tool with unique and special abilities to create attention that you can turn into sales."}, {"8a42": "I’m going to make it even simpler:"}, {"869f": "Book = Attention = Sales"}, {"1c0e": "You know what content marketing and inbound marketing are, right? Well, a book is content and inbound marketing on steroids."}, {"1eb2": "So how does a book get you attention? There are 4 main ways:"}, {"ff8e": "1. A book establishes your authority and credibility"}, {"ccc4": "A lot of people like to say that “a book is the new business card.” I think that’s bullshit, because everyone has a business card. You can go to Office Depot and get business cards, but you can’t go to Office Depot and author a book."}, {"4527": "What I say is “a book is the new college degree.” It used to be, about forty years ago, only about 10% of people had college degrees. If you had one, it was a major signal of credibility and authority. It meant something."}, {"c3b0": "But now that everyone goes to college, it doesn’t signal as much. So what is a signal credibility and authority now, one that’s reliable and rare?"}, {"3f63": "A book."}, {"1f24": "A book shows you can commit to something and follow through. It shows you gets things done. And most importantly, it shows the world what you know."}, {"c50f": "A book sets you up to be judged. It’s really easy to skirt by and get a college degree. It’s really hard to manipulate your way into a good book."}, {"2337": "Yes, being judged is risky, but that’s why you get so much credit for a good book. A book puts you in a place that most people are unwilling to go–being judged–and it usually requires a lot of work to do. It requires you to actually know something."}, {"37db": "Because if you write a book that’s stupid–people are going to think you’re stupid. But if it’s good, people are going to say, “Oh, wow. This person’s really smart.”"}, {"1033": "Most people are NOT willing to take that risk, set themselves up to be judged, and show the world what they know."}, {"800a": "This is why we are very upfront with our clients that you can’t just vomit out nonsense, call it a book, and get all the benefits. You have to write a GOOD BOOK to gain credibility and authority."}, {"bf48": "People will read your book, and they WILL judge you based on it. You want them to judge you well, not poorly, and the only way to do that is to write a quality book."}, {"9a94": "2. A book raises your visibility and gets you media coverage"}, {"f936": "Whenever any media outlet wants a comment, who do they go to? The expert, right? And how do they know someone is an expert?"}, {"b970": "Because they wrote the book. That’s the #1 signal of authority and credibility–a book."}, {"7b36": "You want visibility in your field and media coverage? Write a book that stakes you out as an expert, and media coverage is 10x easier to get. This is because media want to talk to experts, and they judge expertise by who wrote the book on the subject."}, {"1066": "This is EXACTLY how Melissa’s book helped her make millions. Because she wrote the first book on pop-up retail, every media outlet that covered retail wanted to interview her. She was the expert on a hot new field, as proven by her book (which, like we said, was very good)."}, {"1f84": "How many people in your field have you seen get a lot of attention simply because they wrote a book? Even if you knew more than them, they got the attention that you didn’t, simply because of the book."}, {"7801": "[BTW–this is precisely why a niche book is better than a broad book: it helps you monetize easier. There are many “general retail experts” but no “pop-up retail experts,” so Melissa was able to differentiate and brand herself quickly by dominating that single niche.]"}, {"5003": "3. A book helps people find you"}, {"9bfd": "The #1 search engine is Google. #2 is YouTube. You know what #3 is?"}, {"0002": "Amazon."}, {"fadb": "And even more relevant, it’s the #1 search engine for professionals (it ranks even higher than LinkedIn)."}, {"5199": "When people look for experts or authorities, what’s the first thing they think about? Same as the media–they want the person who literally “wrote the book” on the topic."}, {"9cce": "Having a great book lets people know exactly who you are, how you can help them, and even brings them to you. It’s the best marketing tool you could ever use to not just build your brand, but actually attract clients."}, {"dd86": "Example:"}, {"52ca": "When we started Book In A Box we realized we had a rocket ship that we didn’t know how to drive. We needed to learn how to scale our company. What did I do? I went to Amazon to read books on the subject."}, {"60b8": "Turns out, there’s not a lot of great books out there about how to professionally manage and scale a fast growing company. The best I could find was written by Cameron Herold (it’s called Double Double). The title isn’t so good, but the book itself is amazing. I read the book, and thought, “This is genius. But I need more. I need this guy to coach me directly.”"}, {"ce6b": "I reached out to Cameron, and he’s now my executive coach and owns a piece of my company. That’s how valuable he’s been."}, {"f820": "There are probably five hundred other people out there who could have taught me the same things, but Cameron is the only one that had a great book that I could read and use to determine that he was the guy to teach me. I never would have listened to a sales pitch. I had to see proof, and his book was it, and it caused me to come to him."}, {"50ca": "4. A book facilitates word of mouth"}, {"fdd2": "There is no better marketing than word of mouth. When someone you trust tells you to use something, you listen and you use it. Anything that helps other people talk about you and your business is the best marketing tool possible."}, {"7b33": "And a book enables word of mouth better than almost anything else."}, {"6f95": "This is because a book lets you put your story into people’s mouths, so when they talk about you, they’re literally just saying what you want them to say. If you do a good book, people repeat your terms, phrases, and ideas to other people."}, {"c2cf": "We use this idea to help our authors position and frame their books. We say, “Imagine someone at a cocktail party who read your book, talking to someone else in your potential audience. What would they say? Imagine what you want them to say to the other.”"}, {"3768": "Once you understand that, once you can picture that conversation naturally happening between two people, if you can do that really honestly, you can almost construct the narrative of your book from that conversation."}, {"45bf": "If you can write a book that is valuable to a group of people, they will WANT to talk about your book at a cocktail party to someone else who has that problem."}, {"e5ae": "Why? Because that makes them look better. That’s how word of mouth works."}, {"d1ec": "And even better, once they’ve heard about you, they can pick up your book, research you, and then come track you down. Books bring you clients. It’s like we said–content marketing on steroids."}, {"8415": "The 14 Best Ways To Monetize The Attention From A Book"}, {"a252": "We laid out the four ways a book can get you attention. There are SO MANY ways you can leverage the attention from a book to sell something else. I’ll run through the most common things you can sell, with examples for each:"}, {"a6ae": "1. Sell consulting & coaching services:"}, {"9a57": "There is a reason that every major thought leader writes a book, and then ends up developing a consulting firm or works for a consulting firm. In fact, most “thought leaders” are actually just consultants who have written good books that people really like, e.g. John Hagel at Deloitte,Clayton Christensen at Harvard Business School, etc."}, {"ec54": "At Book In A Box, our largest client base are consultants. Once they reach a certain level of success–enough to afford us–they can’t really go much higher without a book."}, {"e5b6": "You might be thinking something like, “But if I write a book talking about what I know, why will people hire me?”"}, {"f6fb": "I already told you the story about Melissa. She put a ton of what she knew in her book, and it was the ONLY reason she got hired by major retailers. They wanted to know what she knew BEFORE they hired her."}, {"ec2a": "And I already talked about how I found Cameron Herold–his book made me want to hire him MORE. Most of what Cameron teaches me on a day to day basis is in his book. I’m basically paying him to help me apply it to my situation, and maybe for the ten percent of weird one-offs that aren’t in his book."}, {"4909": "But that’s the point: people who hire consultants and coaches are hiring them to teach them and their team, they’re not just hiring the knowledge in the book."}, {"9d8f": "The book is how you show them that they should hire you."}, {"3889": "Another great example of this is Dorie Clark. In only a few years, she went from an out of work journalist, to such a well respected marketing and branding consultant that she is now a professor at Duke, and speaks to such groups as the World Bank and the IMF. How’d she do that? Well, a lot of hard work of course, but she attributes most of success to her two books, and how they really put her on the map."}, {"e47e": "2. Sell a physical product:"}, {"1cc9": "Another very profitable way to monetize a book is by using it to promote a physical product."}, {"c096": "Go search on Amazon under books for “lose weight” or “eat paleo.” You’ll see thousands of books, and a lot of them are essentially buyer’s guides for physical products, like supplements, food companies, or one off products."}, {"5631": "Take Mark Sisson for example, who started Primal Blueprint. He’s published nearly a dozen books about his version of the paleo diet. They’re great books. He sells them on Amazon, and even gives many of them away on his site."}, {"d2cd": "Not only do they help people eat right, but Mark also has a complete line of Primal Blueprint supplements and food that people can buy. They don’t have to buy them, but it’s there, and easy to do, and the books and product dovetail perfectly."}, {"5b25": "Think about it–would you respond to an ad about supplements? Probably not."}, {"8454": "But what about a book that teaches you what supplements to take, when and why? If you trust the book, you’ll trust the supplement recommendations."}, {"6cf0": "Because Mark has great books on eating that you trust, you automatically give his supplement recommendations more credibility."}, {"37ea": "3. Build a speaking career:"}, {"aebd": "One of the major ways to make money from a book is using it to become a speaker (or raise the rate you charge for your speaking gigs)."}, {"4401": "It’s very hard to be a professional paid speaker without a book. People have started speaking careers without books of course, but almost all eventually write a book, and when they do, the amount they charge goes up ."}, {"061e": "This is because a book is a business card for a speaker. It’s kind of a necessity. A book is the way people know for sure you are qualified to speak to their group on your topic."}, {"4422": "A great example of this is Kevin Kruse. His blog Author Journey to 100k details how he made money in his first year as an author, and while he did 70k in book sales, he made 170k in speaking fees."}, {"a9cc": "4. Sell a video course/information product:"}, {"9ef8": "Using your book as the marketing tool and lead generation for a video course is such a good way to make money from a book."}, {"4437": "Basically, if your book teaches something for which there is a high ROI for the reader, you can create what amounts to an advanced version that is delivered as a video course, and charge much more money for it."}, {"9e43": "One of the main benefits is that while people will not pay more than about $25 for a book, they will often pay $500 or more for a video course of the EXACT SAME material."}, {"cb7f": "This actually is rational, because many people learn more easily from video and audio than they do from books."}, {"dd3f": "But whether it’s rational or not kind of doesn’t matter–what matters is that doing a book and using it to sell similar material as a video course is a great way to make money."}, {"4e65": "A great example of this is Josh Turner. He is a client who did a book with us called Connect. His book is about how to use LinkedIn to drive sales in your company, and the book, while very good, ends up driving many people to his advanced video course."}, {"03d4": "5. Sell a software/SaaS product:"}, {"2e7c": "A book is a great way for a company to sell software, especially SaaS."}, {"a8d4": "The best example is HubSpot. That company invented inbound marketing, so what did they do to promote it? Among other things, they wrote a book called Inbound Marketing."}, {"5e1a": "The book doesn’t even pitch HubSpot very much. The book is essentially a massive advertisement for their method of marketing (inbound marketing), and guess what?"}, {"95ba": "Using their software is the easiest way to actually do inbound marketing, so not only does the book provide real value to the reader, it ends up converting a lot of readers to customers."}, {"21a6": "6. Promote “Done for you” services:"}, {"b26b": "Book In A Box is a great example. We developed a new and innovative way to turn your ideas into a book, something no one else was doing… and then we proceeded to write a book that explained our entire process."}, {"7a9c": "I mean, literally the whole process, including the templates we use with authors, everything."}, {"e864": "Why the hell would we do that? It’s similar to the consultant/coach method:"}, {"f33f": "Our book shows potential authors our process so they can understand it and see how great it is. Saying our process is great is totally different than proving it in detail."}, {"066f": "We’ve had so many clients who were skeptical of us, read the book, and were like, “This is genius, I’m going to do it myself.” Then, even though they loved the process, many realized that their time was too valuable, so they just came back to us as full clients."}, {"c019": "The people who can’t afford us, no problem. Go do it yourself. We’re not losing a client by telling them how do it themselves."}, {"3da6": "In fact, the more people who use our method, the better–they’ll talk about us and our process, creating word of mouth."}, {"a520": "7. Promote paid community/mastermind groups:"}, {"5200": "There’s so many people who have paid Masterminds, and so many of their clients find out about them and want to join their group because they’ve written books that show everyone how much they know."}, {"a263": "A great example is Joe Polish. He has this group called Genius Network, which cost twenty-five thousand a year to join."}, {"6f46": "He’s doing a book with us that explains exactly how he built and runs his mastermind group, and how he is such a successful networker and connector, which in turn will end up driving a lot of sign-ups for his group."}, {"1a68": "Another example is James Maskell. He runs the Evolution of Medicine Summit and mastermind group, where tens of thousands of health professionals meet and discuss topics, and is also doing a book with us that will end up creating many new members."}, {"c486": "8. Get freelance clients:"}, {"b892": "If you’re a freelancer, doing a book is a no brainer. In fact, the problem is that as soon as you do a book, you get so slammed with work you can’t handle it all."}, {"f9ea": "This is exactly what happened to David Kadavy. He wrote a book called Design for Hackers. He wrote it for a very niche audience, and it ended up crushing him. He was flooded with design work. He had to create an agency and just pawn everything off by hiring someone to run it for him (and he did a course which does very well too)."}, {"427e": "If you’re a great freelancer, if you have a specific skill that you sell, writing a book that explains how you do it creates an almost uninterrupted supply of clients. Think about it–if I’m looking for a freelancer, I have no idea how to pick one versus the other."}, {"cb99": "Why not pick the one that wrote the book?"}, {"d6b2": "9. Workshops and group teaching:"}, {"af36": "Often this goes along with speaking, but is not always the same thing."}, {"bb2d": "Many consultants and speakers also do what is called “group workshops.” The point is that a business will bring you in to teach your method to their employees, and train them over a day or a series of days. It’s really easy to get relatively larger businesses to pay you to come in to teach a one-day workshop to their employees about what you know."}, {"eb38": "Why? Because so few people take the time to read all the way through a book."}, {"182a": "If you read books, you are way ahead of the curve, but I know, as most employers know, if they pass a book out, their employees aren’t going to read it. If they get the person who wrote the book to come in and give a speech, and to answer questions for a day, they can really teach the stuff."}, {"6db5": "A great example is Mona Patel, a client of ours who wrote the book Reframe. She now does workshops based on applying the book that routinely sell out, and both things reinforce each other. The book leads people to the workshop, and she sells copies of her book to people who come to the workshop."}, {"02e0": "10. Recruit employees to work for your company:"}, {"e4c3": "This is overlooked, but for entrepreneurs and C-level executives, there is almost no better way to get great people to work with you than by laying your vision for your company out in a book."}, {"f496": "The best example of this is, of course, Zappos. Not only did Tony Shieh write his own book, but they also wrote a different book about their culture that they give away on their site for free as a way to get people to come work for them."}, {"00ff": "11. Change careers or advance your career:"}, {"6d0c": "This is something that not a lot of people think about, but the fact is, even if you have no business of your own or entrepreneurial aspirations, a book can help you substantially advance your career; either within your current company, or help you switch careers entirely."}, {"7c7c": "Simon Dudley is a great example. He wrote a book called The End of Certainty."}, {"92ae": "He was a big influencer in the video teleconferencing space, but because of various technological changes, he didn’t believe in the field anymore. He thought they were going to be disrupted, and he didn’t think they would change."}, {"8c77": "He wanted to move totally out of video teleconferencing, so he wrote a book that was about his theories on technological change and how to adapt to them, and it never mentioned teleconferencing at all. That way he could go to other businesses and pitch them, say, “Listen. I know exactly how you’re being disrupted. I can help you.”"}, {"7c60": "He created a firm called ExcessionEvents, and now he’s doing great as a consultant on technological change. He essentially created a new career."}, {"8ddf": "Here’s the supreme irony: No one listened to him in the teleconferencing business before he wrote the book, but since he wrote the book–even though he never mentioned teleconferencing in the book, the parallels were obvious–now half of his consulting business are the firms who wouldn’t hire him in the teleconferencing business."}, {"4688": "12. Taxes and write-offs:"}, {"ab64": "This is a GREAT way to make money that way too few business owners use."}, {"17e4": "If you are using your book as a legitimate marketing tool to promote a business, the costs of production are 100% deductible. That means everything you spend money on that is part of creating the book can be deducted. For example:"}, {"38ba": "It’s all 100% deductible as a business marketing expense. Just like you can deduct what you spend on Facebook ads and website designers, a book falls into the same category."}, {"fed5": "Here’s the rub with that: YOUR TIME IS NOT deductible."}, {"ba31": "If you spend 500 hours at a computer typing away, you are totally out of luck. You cannot deduct the opportunity cost of your time from your taxes, even though that 500 hours is stopping you from making money doing other things."}, {"d700": "For example if you are a coach and people pay you $200 an hour for coaching, spending 500 hours writing a book (instead of charging for coaching) costs you $100,000 in forgone income."}, {"c579": "You absolutely CANNOT deduct that, even though it is a very real cost to you."}, {"acca": "BUT if you hire someone to help you write your book, then you absolutely CAN deduct that cost."}, {"86e3": "This is another reason why so many people use our service, even if they can write the book themselves. If they pay us $20,000 to help them author their book, not only is that cost fully deductible, but they save HUNDREDS (or oftentimes thousands) of hours–and can spend that time working in their business, doing what they do best."}, {"6af5": "When you figure in the tax savings, plus the time savings, it’s almost like getting the book for free for most of our authors–and that is BEFORE they get any of the attention and ROI from the book."}, {"6017": "NOTE: I am talking about tax laws in America. Though this is what my CPA and many other tax lawyers have told me, you should never take legal advice from someone on the internet who does not know the laws of your specific jurisdiction. And not only that, I live in Texas–it’s legal to shoot wild hogs with machine guns from helicopters here. We’re different."}, {"a55a": "13. Promote a conference:"}, {"a68b": "Books are a very underexploited marketing avenue for conferences. We’ve been working with aconference called the LDV Summit, which is about vision technology, and pairs venture capitalists in that space with the inventors and thought leaders."}, {"4948": "What we do is record the entire conference, turn it into a book, and then what the conference host does is two things:"}, {"ef54": "By spending $5 to mail a nice book to past participants, he gets them to spend $500+ on a conference that is more than 6 months away. Pretty good deal."}, {"fef7": "Not to mention, TED does this."}, {"4849": "They even have their own publishing imprint."}, {"b58a": "14. Book sales:"}, {"fbe4": "I said that book sales are not the best way to make money. I never said you can’t make ANY money from them."}, {"6e36": "What I said was it’s the worst way to frame monetizing books, because it can create bad decisions and make authors try to position a book in such a way that they don’t know how to write it. If they can’t write it well, it won’t drive the best results."}, {"5881": "Once you have a book that appeals to specific crowd, there are lots of ways to help spur book sales:"}, {"986d": "I’m not going to spend much time talking about to directly implement these things, because quite honestly, it’s not worth the time for most authors."}, {"6371": "If you positioned your book like discussed above, you don’t need to worry about selling copies, you only need to worry about how the book converts to what really matters to you."}, {"9d32": "Conclusion"}, {"29d7": "I hope this piece really opened your eyes and reframed how you see books, the place they can play in your professional life, and how to use them to get what you want."}, {"0e68": "For most professionals, a book is the very best multi-purpose marketing they can have, and crucial to their career. The only thing left is to start the process."}], "content": "How to Make Money With a Book It’s possible to make a lot of money from a book, but only if you approach it the right way. This is the wrong way: “How do I sell a lot of books?” This is the right way: “How do I use my book as a tool to make money?” Aren’t those two things the same? Isn’t selling books the same as using a book to make money? Absolutely not. In fact, focusing on book sales is usually the worst way to make money from a book. If you want to make money from a book, don’t focus on selling copies, use your book as a marketing tool that gets you attention and sales for something else. There are two main reasons why: 1. It’s hard to sell book copies A fact of life: it’s nearly impossible to sell a lot of copies of a book. Last year, there were about 300,000 new books published in America. BookScan, the company that measures all book sales, says that only about 200 books per year sell 100,000 copies. The number of books that reached 1 million sold last year is even fewer, probably close to 10 (and almost all of those were novels). And virtually no book does more than that. The list of books that have sold 10 million copies in history is so small there’s a Wikipedia page about them. What’s even worse is that you can’t charge enough for books to generate good revenue from them. The highest you can charge is about $25, give or take. The greatest book ever written, if it costs more than that, won’t get bought. People have a low limit on their perceived value for books. There is only one group of people who must focus on how many copies they sell: Professional writers (like novelists, fiction writers, etc). They need to worry about selling copies of books because book sales are only way they can make money! They don’t have anything else to sell but a copy of the book. But this is not true for most authors. 2. If your book is a marketing tool for something else, it’s easy to make money Once you stop thinking about book sales, and start thinking about a book as a way to sell something else, everything changes. This is how we advise our clients to look at books: A book is a multi-purpose marketing tool with unique and special abilities to create attention that you can turn into sales. For entrepreneurs and professionals and other business people–people who own companies, are experts in their fields, and have some other activity they get paid for like speaking or consulting or coaching–the book itself creates attention, and that attention is the means to selling the other, larger opportunities that can be VERY profitable. You can sell products, services, speaking, consulting, software–any number of things. Great example: Our first client was a woman named Melissa Gonzalez. She did a book with us, and it’s called The Pop Up Paradigm. She estimates she’s made over a million dollars from the book. You want to hear what’s even crazier? She did it selling LESS than 1000 copies. How? Because she wrote it to market her business, not to sell copies. Melissa is one of the world’s premier experts in a very niche space (pop-up retail). Obviously, not many people care about books on retail, and even fewer care about pop-up retail, so focusing on selling copies was a losing strategy from the start. There just wasn’t a large audience for that topic. Instead, she focused on reaching the decision-makers in the retail space–the types of people who would hire her as a consultant. She did this by focusing her book on how the new techniques she pioneered in pop-up retail could help stagnating retail businesses. She shared her knowledge and expertise, and because her book was the first one that deeply explored this topic, she became the recognized expert in this niche field. Which led to all the decision makers in retail–the exact people she wanted as clients–to come to her. Her book tripled the inbound leads to her consulting business, and she was signed a multi-million dollar contract with one of the largest mall companies in America to create and implement their pop-up strategy. All because of her book. It was a marketing tool intended to get attention for her from a very specific set of people, and it worked (see her full story here). How Does A Book Get You Attention? I’m going to explain all the ways you can monetize a book, but first, you need to understand how the “book as a marketing tool” works. Remember what I said earlier: A book is a multi-purpose marketing tool with unique and special abilities to create attention that you can turn into sales. I’m going to make it even simpler: Book = Attention = Sales You know what content marketing and inbound marketing are, right? Well, a book is content and inbound marketing on steroids. So how does a book get you attention? There are 4 main ways: 1. A book establishes your authority and credibility A lot of people like to say that “a book is the new business card.” I think that’s bullshit, because everyone has a business card. You can go to Office Depot and get business cards, but you can’t go to Office Depot and author a book. What I say is “a book is the new college degree.” It used to be, about forty years ago, only about 10% of people had college degrees. If you had one, it was a major signal of credibility and authority. It meant something. But now that everyone goes to college, it doesn’t signal as much. So what is a signal credibility and authority now, one that’s reliable and rare? A book. A book shows you can commit to something and follow through. It shows you gets things done. And most importantly, it shows the world what you know. A book sets you up to be judged. It’s really easy to skirt by and get a college degree. It’s really hard to manipulate your way into a good book. Yes, being judged is risky, but that’s why you get so much credit for a good book. A book puts you in a place that most people are unwilling to go–being judged–and it usually requires a lot of work to do. It requires you to actually know something. Because if you write a book that’s stupid–people are going to think you’re stupid. But if it’s good, people are going to say, “Oh, wow. This person’s really smart.” Most people are NOT willing to take that risk, set themselves up to be judged, and show the world what they know. This is why we are very upfront with our clients that you can’t just vomit out nonsense, call it a book, and get all the benefits. You have to write a GOOD BOOK to gain credibility and authority. People will read your book, and they WILL judge you based on it. You want them to judge you well, not poorly, and the only way to do that is to write a quality book. 2. A book raises your visibility and gets you media coverage Whenever any media outlet wants a comment, who do they go to? The expert, right? And how do they know someone is an expert? Because they wrote the book. That’s the #1 signal of authority and credibility–a book. You want visibility in your field and media coverage? Write a book that stakes you out as an expert, and media coverage is 10x easier to get. This is because media want to talk to experts, and they judge expertise by who wrote the book on the subject. This is EXACTLY how Melissa’s book helped her make millions. Because she wrote the first book on pop-up retail, every media outlet that covered retail wanted to interview her. She was the expert on a hot new field, as proven by her book (which, like we said, was very good). How many people in your field have you seen get a lot of attention simply because they wrote a book? Even if you knew more than them, they got the attention that you didn’t, simply because of the book. [BTW–this is precisely why a niche book is better than a broad book: it helps you monetize easier. There are many “general retail experts” but no “pop-up retail experts,” so Melissa was able to differentiate and brand herself quickly by dominating that single niche.] 3. A book helps people find you The #1 search engine is Google. #2 is YouTube. You know what #3 is? Amazon. And even more relevant, it’s the #1 search engine for professionals (it ranks even higher than LinkedIn). When people look for experts or authorities, what’s the first thing they think about? Same as the media–they want the person who literally “wrote the book” on the topic. Having a great book lets people know exactly who you are, how you can help them, and even brings them to you. It’s the best marketing tool you could ever use to not just build your brand, but actually attract clients. Example: When we started Book In A Box we realized we had a rocket ship that we didn’t know how to drive. We needed to learn how to scale our company. What did I do? I went to Amazon to read books on the subject. Turns out, there’s not a lot of great books out there about how to professionally manage and scale a fast growing company. The best I could find was written by Cameron Herold (it’s called Double Double). The title isn’t so good, but the book itself is amazing. I read the book, and thought, “This is genius. But I need more. I need this guy to coach me directly.” I reached out to Cameron, and he’s now my executive coach and owns a piece of my company. That’s how valuable he’s been. There are probably five hundred other people out there who could have taught me the same things, but Cameron is the only one that had a great book that I could read and use to determine that he was the guy to teach me. I never would have listened to a sales pitch. I had to see proof, and his book was it, and it caused me to come to him. 4. A book facilitates word of mouth There is no better marketing than word of mouth. When someone you trust tells you to use something, you listen and you use it. Anything that helps other people talk about you and your business is the best marketing tool possible. And a book enables word of mouth better than almost anything else. This is because a book lets you put your story into people’s mouths, so when they talk about you, they’re literally just saying what you want them to say. If you do a good book, people repeat your terms, phrases, and ideas to other people. We use this idea to help our authors position and frame their books. We say, “Imagine someone at a cocktail party who read your book, talking to someone else in your potential audience. What would they say? Imagine what you want them to say to the other.” Once you understand that, once you can picture that conversation naturally happening between two people, if you can do that really honestly, you can almost construct the narrative of your book from that conversation. If you can write a book that is valuable to a group of people, they will WANT to talk about your book at a cocktail party to someone else who has that problem. Why? Because that makes them look better. That’s how word of mouth works. And even better, once they’ve heard about you, they can pick up your book, research you, and then come track you down. Books bring you clients. It’s like we said–content marketing on steroids. The 14 Best Ways To Monetize The Attention From A Book We laid out the four ways a book can get you attention. There are SO MANY ways you can leverage the attention from a book to sell something else. I’ll run through the most common things you can sell, with examples for each: 1. Sell consulting & coaching services: There is a reason that every major thought leader writes a book, and then ends up developing a consulting firm or works for a consulting firm. In fact, most “thought leaders” are actually just consultants who have written good books that people really like, e.g. John Hagel at Deloitte,Clayton Christensen at Harvard Business School, etc. At Book In A Box, our largest client base are consultants. Once they reach a certain level of success–enough to afford us–they can’t really go much higher without a book. You might be thinking something like, “But if I write a book talking about what I know, why will people hire me?” I already told you the story about Melissa. She put a ton of what she knew in her book, and it was the ONLY reason she got hired by major retailers. They wanted to know what she knew BEFORE they hired her. And I already talked about how I found Cameron Herold–his book made me want to hire him MORE. Most of what Cameron teaches me on a day to day basis is in his book. I’m basically paying him to help me apply it to my situation, and maybe for the ten percent of weird one-offs that aren’t in his book. But that’s the point: people who hire consultants and coaches are hiring them to teach them and their team, they’re not just hiring the knowledge in the book. The book is how you show them that they should hire you. Another great example of this is Dorie Clark. In only a few years, she went from an out of work journalist, to such a well respected marketing and branding consultant that she is now a professor at Duke, and speaks to such groups as the World Bank and the IMF. How’d she do that? Well, a lot of hard work of course, but she attributes most of success to her two books, and how they really put her on the map. 2. Sell a physical product: Another very profitable way to monetize a book is by using it to promote a physical product. Go search on Amazon under books for “lose weight” or “eat paleo.” You’ll see thousands of books, and a lot of them are essentially buyer’s guides for physical products, like supplements, food companies, or one off products. Take Mark Sisson for example, who started Primal Blueprint. He’s published nearly a dozen books about his version of the paleo diet. They’re great books. He sells them on Amazon, and even gives many of them away on his site. Not only do they help people eat right, but Mark also has a complete line of Primal Blueprint supplements and food that people can buy. They don’t have to buy them, but it’s there, and easy to do, and the books and product dovetail perfectly. Think about it–would you respond to an ad about supplements? Probably not. But what about a book that teaches you what supplements to take, when and why? If you trust the book, you’ll trust the supplement recommendations. Because Mark has great books on eating that you trust, you automatically give his supplement recommendations more credibility. 3. Build a speaking career: One of the major ways to make money from a book is using it to become a speaker (or raise the rate you charge for your speaking gigs). It’s very hard to be a professional paid speaker without a book. People have started speaking careers without books of course, but almost all eventually write a book, and when they do, the amount they charge goes up . This is because a book is a business card for a speaker. It’s kind of a necessity. A book is the way people know for sure you are qualified to speak to their group on your topic. A great example of this is Kevin Kruse. His blog Author Journey to 100k details how he made money in his first year as an author, and while he did 70k in book sales, he made 170k in speaking fees. 4. Sell a video course/information product: Using your book as the marketing tool and lead generation for a video course is such a good way to make money from a book. Basically, if your book teaches something for which there is a high ROI for the reader, you can create what amounts to an advanced version that is delivered as a video course, and charge much more money for it. One of the main benefits is that while people will not pay more than about $25 for a book, they will often pay $500 or more for a video course of the EXACT SAME material. This actually is rational, because many people learn more easily from video and audio than they do from books. But whether it’s rational or not kind of doesn’t matter–what matters is that doing a book and using it to sell similar material as a video course is a great way to make money. A great example of this is Josh Turner. He is a client who did a book with us called Connect. His book is about how to use LinkedIn to drive sales in your company, and the book, while very good, ends up driving many people to his advanced video course. 5. Sell a software/SaaS product: A book is a great way for a company to sell software, especially SaaS. The best example is HubSpot. That company invented inbound marketing, so what did they do to promote it? Among other things, they wrote a book called Inbound Marketing. The book doesn’t even pitch HubSpot very much. The book is essentially a massive advertisement for their method of marketing (inbound marketing), and guess what? Using their software is the easiest way to actually do inbound marketing, so not only does the book provide real value to the reader, it ends up converting a lot of readers to customers. 6. Promote “Done for you” services: Book In A Box is a great example. We developed a new and innovative way to turn your ideas into a book, something no one else was doing… and then we proceeded to write a book that explained our entire process. I mean, literally the whole process, including the templates we use with authors, everything. Why the hell would we do that? It’s similar to the consultant/coach method: Our book shows potential authors our process so they can understand it and see how great it is. Saying our process is great is totally different than proving it in detail. We’ve had so many clients who were skeptical of us, read the book, and were like, “This is genius, I’m going to do it myself.” Then, even though they loved the process, many realized that their time was too valuable, so they just came back to us as full clients. The people who can’t afford us, no problem. Go do it yourself. We’re not losing a client by telling them how do it themselves. In fact, the more people who use our method, the better–they’ll talk about us and our process, creating word of mouth. 7. Promote paid community/mastermind groups: There’s so many people who have paid Masterminds, and so many of their clients find out about them and want to join their group because they’ve written books that show everyone how much they know. A great example is Joe Polish. He has this group called Genius Network, which cost twenty-five thousand a year to join. He’s doing a book with us that explains exactly how he built and runs his mastermind group, and how he is such a successful networker and connector, which in turn will end up driving a lot of sign-ups for his group. Another example is James Maskell. He runs the Evolution of Medicine Summit and mastermind group, where tens of thousands of health professionals meet and discuss topics, and is also doing a book with us that will end up creating many new members. 8. Get freelance clients: If you’re a freelancer, doing a book is a no brainer. In fact, the problem is that as soon as you do a book, you get so slammed with work you can’t handle it all. This is exactly what happened to David Kadavy. He wrote a book called Design for Hackers. He wrote it for a very niche audience, and it ended up crushing him. He was flooded with design work. He had to create an agency and just pawn everything off by hiring someone to run it for him (and he did a course which does very well too). If you’re a great freelancer, if you have a specific skill that you sell, writing a book that explains how you do it creates an almost uninterrupted supply of clients. Think about it–if I’m looking for a freelancer, I have no idea how to pick one versus the other. Why not pick the one that wrote the book? 9. Workshops and group teaching: Often this goes along with speaking, but is not always the same thing. Many consultants and speakers also do what is called “group workshops.” The point is that a business will bring you in to teach your method to their employees, and train them over a day or a series of days. It’s really easy to get relatively larger businesses to pay you to come in to teach a one-day workshop to their employees about what you know. Why? Because so few people take the time to read all the way through a book. If you read books, you are way ahead of the curve, but I know, as most employers know, if they pass a book out, their employees aren’t going to read it. If they get the person who wrote the book to come in and give a speech, and to answer questions for a day, they can really teach the stuff. A great example is Mona Patel, a client of ours who wrote the book Reframe. She now does workshops based on applying the book that routinely sell out, and both things reinforce each other. The book leads people to the workshop, and she sells copies of her book to people who come to the workshop. 10. Recruit employees to work for your company: This is overlooked, but for entrepreneurs and C-level executives, there is almost no better way to get great people to work with you than by laying your vision for your company out in a book. The best example of this is, of course, Zappos. Not only did Tony Shieh write his own book, but they also wrote a different book about their culture that they give away on their site for free as a way to get people to come work for them. 11. Change careers or advance your career: This is something that not a lot of people think about, but the fact is, even if you have no business of your own or entrepreneurial aspirations, a book can help you substantially advance your career; either within your current company, or help you switch careers entirely. Simon Dudley is a great example. He wrote a book called The End of Certainty. He was a big influencer in the video teleconferencing space, but because of various technological changes, he didn’t believe in the field anymore. He thought they were going to be disrupted, and he didn’t think they would change. He wanted to move totally out of video teleconferencing, so he wrote a book that was about his theories on technological change and how to adapt to them, and it never mentioned teleconferencing at all. That way he could go to other businesses and pitch them, say, “Listen. I know exactly how you’re being disrupted. I can help you.” He created a firm called ExcessionEvents, and now he’s doing great as a consultant on technological change. He essentially created a new career. Here’s the supreme irony: No one listened to him in the teleconferencing business before he wrote the book, but since he wrote the book–even though he never mentioned teleconferencing in the book, the parallels were obvious–now half of his consulting business are the firms who wouldn’t hire him in the teleconferencing business. 12. Taxes and write-offs: This is a GREAT way to make money that way too few business owners use. If you are using your book as a legitimate marketing tool to promote a business, the costs of production are 100% deductible. That means everything you spend money on that is part of creating the book can be deducted. For example: It’s all 100% deductible as a business marketing expense. Just like you can deduct what you spend on Facebook ads and website designers, a book falls into the same category. Here’s the rub with that: YOUR TIME IS NOT deductible. If you spend 500 hours at a computer typing away, you are totally out of luck. You cannot deduct the opportunity cost of your time from your taxes, even though that 500 hours is stopping you from making money doing other things. For example if you are a coach and people pay you $200 an hour for coaching, spending 500 hours writing a book (instead of charging for coaching) costs you $100,000 in forgone income. You absolutely CANNOT deduct that, even though it is a very real cost to you. BUT if you hire someone to help you write your book, then you absolutely CAN deduct that cost. This is another reason why so many people use our service, even if they can write the book themselves. If they pay us $20,000 to help them author their book, not only is that cost fully deductible, but they save HUNDREDS (or oftentimes thousands) of hours–and can spend that time working in their business, doing what they do best. When you figure in the tax savings, plus the time savings, it’s almost like getting the book for free for most of our authors–and that is BEFORE they get any of the attention and ROI from the book. NOTE: I am talking about tax laws in America. Though this is what my CPA and many other tax lawyers have told me, you should never take legal advice from someone on the internet who does not know the laws of your specific jurisdiction. And not only that, I live in Texas–it’s legal to shoot wild hogs with machine guns from helicopters here. We’re different. 13. Promote a conference: Books are a very underexploited marketing avenue for conferences. We’ve been working with aconference called the LDV Summit, which is about vision technology, and pairs venture capitalists in that space with the inventors and thought leaders. What we do is record the entire conference, turn it into a book, and then what the conference host does is two things: By spending $5 to mail a nice book to past participants, he gets them to spend $500+ on a conference that is more than 6 months away. Pretty good deal. Not to mention, TED does this. They even have their own publishing imprint. 14. Book sales: I said that book sales are not the best way to make money. I never said you can’t make ANY money from them. What I said was it’s the worst way to frame monetizing books, because it can create bad decisions and make authors try to position a book in such a way that they don’t know how to write it. If they can’t write it well, it won’t drive the best results. Once you have a book that appeals to specific crowd, there are lots of ways to help spur book sales: I’m not going to spend much time talking about to directly implement these things, because quite honestly, it’s not worth the time for most authors. If you positioned your book like discussed above, you don’t need to worry about selling copies, you only need to worry about how the book converts to what really matters to you. Conclusion I hope this piece really opened your eyes and reframed how you see books, the place they can play in your professional life, and how to use them to get what you want. For most professionals, a book is the very best multi-purpose marketing they can have, and crucial to their career. The only thing left is to start the process. ", "name": "171", "child": "171_1\t171_2", "timestamp": "Sep 9, 2016"}