{"parent": "", "title": "How to get your first 100,000 fans", "author": "Shaunta Grimes", "sentences": [{"9166": "How to get your first 100,000 fans"}, {"93d0": "An update on my year-long email list building project."}, {"a938": "I’m on a quest to build an email list of 100,000 rebel writers. I’ll be updating every two weeks on what works and what doesn’t. You can read the first post in this series (including how this whole thing started) here:"}, {"5f98": "Path to 100,000 subscribersA crazy ass OUT LOUD experiment. I might fall on my face.medium.com"}, {"a8a6": "I think it’s super important to keep the reason why I’m doing this front in center. Here’s they ‘why’ for this project: I believe that we can change the world with our stories. And we sure as hell can change publishing."}, {"0acb": "If you’re a writer and you’d like to be part of this experiment, you can join my list right here:"}, {"66c6": "The Update"}, {"9f13": "Two weeks ago there were 13,279 writers on my mailing list."}, {"222d": "Today there are 13,902."}, {"97e4": "That screen shot is an app called ListGoal from Bryan Harris at Video Fruit. Definitely get it if you’re working on list building."}, {"8030": "So, in the last two weeks I added 623 people to my email list. Not bad. At that rate I’ll add 14,952 in the next year. That will put me at 28,854 on my email list."}, {"8b21": "Not on pace to 100,000, though."}, {"2cdb": "To get there, I need to be adding closer to 3500 every two weeks."}, {"d4d9": "Here are my stats on ConvertKit for the last 30 days. You can see that my conversion rate over the last two weeks is pretty much steady. Maybe a slight uptick."}, {"4172": "This chart shows, though, that I definitely improved my conversion rate from February to March."}, {"6636": "In February I decided to cut my Facebook advertising in half, which is reflected in the increase to my email list. I may or may not increase that again. For now, I’m happy to see that I’m doing better with more organic means."}, {"b714": "Here are list building strategies I tried over the past 2 weeks:"}, {"f762": "I was prolific."}, {"f76b": "The thing that’s had the biggest, steadiest impact has been prolificity."}, {"7de9": "The idea of being prolific keeps popping up on my radar lately. Sean Platt and Johnny B. Truant talk about it in Write. Publish. Repeat. Susan Kaye Quinn talks about it in Indie Author Survival Guide. Seth Godin and Tim Ferris both think that everyone on Earth should have a daily blog."}, {"38a4": "Not weekly. Not occasional. Every single day. For everyone."}, {"ec1f": "I’ve been blogging daily here on Medium since March 1. I wrote about my first month’s experience, so I won’t rehash it."}, {"880a": "I blogged every day for a month. Here’s what happened.The results of a Quora + Medium experiment.medium.com"}, {"ef62": "But, I will say that the practice is having a positive impact on the particular goal we’re talking about here. Since I use Upscribe to add forms to my posts, I can see that about a third of the emails I collected over the past two weeks came directly from Medium."}, {"e756": "I’ve added more than 1000 to my Medium followers as well, which is awesome."}, {"3225": "I hosted a giveaway."}, {"6af6": "I had the opportunity to ask James Altucher what I should do to build my audience and he suggested a giveaway."}, {"d1e0": "I set one up — I gave away three books and a Ninja Writer mug."}, {"01e6": "As you can see from my stats above, it did not lead to any big surge in subscribers."}, {"ba9f": "In a way, I think that’s okay. Giveaways can bring in lots of subscribers, but unfortunately lots of the time those subscribers are people who want to win, rather than subscribers who are very interested in you and your work."}, {"5a0a": "I gave away an Echo Dot once and added a thousand emails to my list, but it tanked my open rates for a while."}, {"75a6": "I signed up for this free course from Sean McCabe."}, {"a2cb": "Audience Building CourseIt's a simple question, but it can be so involved. How do you choose something to be known for? What if you pick the…seanwes.com"}, {"1c1d": "I’ve been thinking about email list building for a long time, so there wasn’t a whole lot in this course I didn’t know already. But, it is a high quality course for FREE, taught by Sean McCabe, who is an awesome person."}, {"15d1": "If you’re new to email list building, this is an excellent place to start."}, {"7143": "Things I’m going to try in the next two weeks."}, {"21dc": "I’ve been invited to guest post at a much larger blog than mine. I haven’t had a ton of luck with guest posting bringing readers to my own site, but I feel like this one might do well. I’ll let you know more next time."}, {"b182": "I’m going to try adding more specific reasons to join my list to my posts here on Medium to see if I can increase my conversion rate."}, {"6104": "As I was writing this post, I got an email from Instafreebie.com letting me know that they’re going to feature my story The Daughter next week on their site. I’ll be excited to see (and report back) how that works out."}, {"a21a": "Instafreebie is a site that allows you to post your work (usually fiction) for free in exchange for an email. I have two stories on the site (The Daughter is science fiction, Broken Nation is a prequel to my published books) that add something like 2 to 5 emails a day to my list. I’ve participated in larger giveaways though that have added more than 1000 to my list."}, {"4912": "You can see my Instafreebie page for The Daughter here to get an idea of how it works."}, {"1e53": "Hang out with other Ninjas on our Facebook page & visit our Patreon page!"}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}], "content": "How to get your first 100,000 fans An update on my year-long email list building project. I’m on a quest to build an email list of 100,000 rebel writers. I’ll be updating every two weeks on what works and what doesn’t. You can read the first post in this series (including how this whole thing started) here: Path to 100,000 subscribersA crazy ass OUT LOUD experiment. I might fall on my face.medium.com I think it’s super important to keep the reason why I’m doing this front in center. Here’s they ‘why’ for this project: I believe that we can change the world with our stories. And we sure as hell can change publishing. If you’re a writer and you’d like to be part of this experiment, you can join my list right here: The Update Two weeks ago there were 13,279 writers on my mailing list. Today there are 13,902. That screen shot is an app called ListGoal from Bryan Harris at Video Fruit. Definitely get it if you’re working on list building. So, in the last two weeks I added 623 people to my email list. Not bad. At that rate I’ll add 14,952 in the next year. That will put me at 28,854 on my email list. Not on pace to 100,000, though. To get there, I need to be adding closer to 3500 every two weeks. Here are my stats on ConvertKit for the last 30 days. You can see that my conversion rate over the last two weeks is pretty much steady. Maybe a slight uptick. This chart shows, though, that I definitely improved my conversion rate from February to March. In February I decided to cut my Facebook advertising in half, which is reflected in the increase to my email list. I may or may not increase that again. For now, I’m happy to see that I’m doing better with more organic means. Here are list building strategies I tried over the past 2 weeks: I was prolific. The thing that’s had the biggest, steadiest impact has been prolificity. The idea of being prolific keeps popping up on my radar lately. Sean Platt and Johnny B. Truant talk about it in Write. Publish. Repeat. Susan Kaye Quinn talks about it in Indie Author Survival Guide. Seth Godin and Tim Ferris both think that everyone on Earth should have a daily blog. Not weekly. Not occasional. Every single day. For everyone. I’ve been blogging daily here on Medium since March 1. I wrote about my first month’s experience, so I won’t rehash it. I blogged every day for a month. Here’s what happened.The results of a Quora + Medium experiment.medium.com But, I will say that the practice is having a positive impact on the particular goal we’re talking about here. Since I use Upscribe to add forms to my posts, I can see that about a third of the emails I collected over the past two weeks came directly from Medium. I’ve added more than 1000 to my Medium followers as well, which is awesome. I hosted a giveaway. I had the opportunity to ask James Altucher what I should do to build my audience and he suggested a giveaway. I set one up — I gave away three books and a Ninja Writer mug. As you can see from my stats above, it did not lead to any big surge in subscribers. In a way, I think that’s okay. Giveaways can bring in lots of subscribers, but unfortunately lots of the time those subscribers are people who want to win, rather than subscribers who are very interested in you and your work. I gave away an Echo Dot once and added a thousand emails to my list, but it tanked my open rates for a while. I signed up for this free course from Sean McCabe. Audience Building CourseIt's a simple question, but it can be so involved. How do you choose something to be known for? What if you pick the…seanwes.com I’ve been thinking about email list building for a long time, so there wasn’t a whole lot in this course I didn’t know already. But, it is a high quality course for FREE, taught by Sean McCabe, who is an awesome person. If you’re new to email list building, this is an excellent place to start. Things I’m going to try in the next two weeks. I’ve been invited to guest post at a much larger blog than mine. I haven’t had a ton of luck with guest posting bringing readers to my own site, but I feel like this one might do well. I’ll let you know more next time. I’m going to try adding more specific reasons to join my list to my posts here on Medium to see if I can increase my conversion rate. As I was writing this post, I got an email from Instafreebie.com letting me know that they’re going to feature my story The Daughter next week on their site. I’ll be excited to see (and report back) how that works out. Instafreebie is a site that allows you to post your work (usually fiction) for free in exchange for an email. I have two stories on the site (The Daughter is science fiction, Broken Nation is a prequel to my published books) that add something like 2 to 5 emails a day to my list. I’ve participated in larger giveaways though that have added more than 1000 to my list. You can see my Instafreebie page for The Daughter here to get an idea of how it works. Hang out with other Ninjas on our Facebook page & visit our Patreon page! Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. ", "name": "172", "child": "172_1\t172_2\t172_3\t172_4\t172_5\t172_6\t172_7\t172_8", "timestamp": "Apr 11"}