{"parent": "", "title": "Moving On….. finding the thrill", "author": "William Nguru", "sentences": [{"c2e1": "Moving On….. finding the thrill"}, {"846e": "Exactly 1 week since I left job at MoDE Africa to go the start-up way. A leap that cost some considerable quantum of courage. There’s many people everywhere who find it unthinkable just to imagine an end-of-month without a pay-check. I too can’t picture next end-month without one. I must say it’s thrilling though. The riskier the merrier."}, {"20da": "MoDe is a top Tech company globally. The talent at MoDe is world-class. I guess the recruitment process is testament to this. Anyone who’s sat though those interviews knows what I’m saying. It’s been an exciting year at MoDe working in a team of highly talented & zealous guys. What’s more, MoDe is a company that even at it’s size is still growing at a fast rate. It’s been a real MoDe. I hope I have a big brother while I’m out here."}, {"ab91": "The decision to Leave"}, {"0f31": "I have received lots of encouragement expected and unexpected. There’s lots of guys who congratulated me for the move. I’m not sure that’s the ocasion for that but I still appreciated all that. When I decided that I’m going to leave I was sure to ignore anyone who was going to tell me how hard and cold out there is. In fact, the ‘naysayer’ is the word that comes to my mind everytime mr killjoy begins talking. The drive to do anything is often greater than the risks associated with it."}, {"a4ff": "One thing I learnt when I decided to leave is that the hardest thing is not leaving a company that pays well but rather leaving an amazing team. Such is the engineering team at MoDe. It’s hard to imagine having to put together a team from scratch. Again, it thrills. Many are for the idea that one should be doing business already while working prior to leaving but for me it’s different. With no written business plan but just a gut feeling that it’s going to work, I took the leap."}, {"fc42": "In Kibochi’s words “passion prayers perseverance and patience key” . I choose to live one day at a time and fix things bit by bit. For now, I’m glad to have earned the title ‘entrepreneur’"}, {"3bdd": "It’s pretty uncertain, but I guess it thrills."}, {"4ad5": "shukran."}, {"4538": "Nguru"}], "content": "Moving On….. finding the thrill Exactly 1 week since I left job at MoDE Africa to go the start-up way. A leap that cost some considerable quantum of courage. There’s many people everywhere who find it unthinkable just to imagine an end-of-month without a pay-check. I too can’t picture next end-month without one. I must say it’s thrilling though. The riskier the merrier. MoDe is a top Tech company globally. The talent at MoDe is world-class. I guess the recruitment process is testament to this. Anyone who’s sat though those interviews knows what I’m saying. It’s been an exciting year at MoDe working in a team of highly talented & zealous guys. What’s more, MoDe is a company that even at it’s size is still growing at a fast rate. It’s been a real MoDe. I hope I have a big brother while I’m out here. The decision to Leave I have received lots of encouragement expected and unexpected. There’s lots of guys who congratulated me for the move. I’m not sure that’s the ocasion for that but I still appreciated all that. When I decided that I’m going to leave I was sure to ignore anyone who was going to tell me how hard and cold out there is. In fact, the ‘naysayer’ is the word that comes to my mind everytime mr killjoy begins talking. The drive to do anything is often greater than the risks associated with it. One thing I learnt when I decided to leave is that the hardest thing is not leaving a company that pays well but rather leaving an amazing team. Such is the engineering team at MoDe. It’s hard to imagine having to put together a team from scratch. Again, it thrills. Many are for the idea that one should be doing business already while working prior to leaving but for me it’s different. With no written business plan but just a gut feeling that it’s going to work, I took the leap. In Kibochi’s words “passion prayers perseverance and patience key” . I choose to live one day at a time and fix things bit by bit. For now, I’m glad to have earned the title ‘entrepreneur’ It’s pretty uncertain, but I guess it thrills. shukran. Nguru ", "name": "186", "child": "186_1\t186_2\t186_3\t186_4\t186_5\t186_6\t186_7", "timestamp": "Jul 10, 2015"}