{"parent": "", "title": "A Door of Disappointment Could Lead to a Better Door for 60+ Freelancers", "author": "Jeff Gilchriest", "sentences": [{"3a34": "A Door of Disappointment Could Lead to a Better Door for 60+ Freelancers"}, {"dc31": "I subscribe to a lot of blogs and email lists, and like many of you, I want to make a difference. The other day, a desktop notification from one of my email subscriptions popped up with the single word “disappointed”. Intrigued, I clicked on the link and found a posting on a job blog for people in the 50+ age bracket, all of whom were frustrated jobseekers. The phenomenon of age discrimination is not new, but the latest crop of boomers and post-boomers are now facing the reality of discrimination first-hand. The barriers to job entry for the older worker is like a steel door slammed in their face and bolted from the inside."}, {"c5de": "I read further and saw how these workers (these were skilled workers with hard earned pedigrees) were disrespected, patronized, and shut-out from opportunities. It was an eye-opener for many of them, leaving them hopeless."}, {"33dc": "Fortunately, online communities across the US and Canada hold a premium for entrepreneurial consultants. Our economies are not as reliant on brick and mortar employers to supply all the jobs as they were in the past. Our society has been forced to evolve from the outcomes of the 2008 recession, and the Wall Street and Big Bank Bailouts of the last decade. Those disasters have created opportunities for workers willing to adapt to drastic changes in the job marketplace."}, {"5982": "For the out-of-work older worker, many stereo-types, prejudices and attitudes still exist. Most are forced to accept lower paying jobs or take multiple part-time positions. Unfortunately, on the business side, predatory forces are at play. Cave Dwelling employers and Neanderthal Management types have chosen to devalue professional experience in exchange for less experienced younger workers who cost less."}, {"b2bc": "Depending on what KoolAid you’re drinking, the reality is the U.S. full employment numbers are still underneath the pre-2008 employment floor. Hiring managers have learned wages do not have to increase to past levels. After a decade of forcing workers to perform twice the amount of labor for the same wage or face a lay-off, big and small businesses alike learned quickly how to profit under the new paradigm."}, {"9406": "Thanks to the PC neutered term “downsizing”, and Obamacare’s “forced” health care coverage for full-time workers, the whole climate of the job market has changed without much blow-back from the media."}, {"fe4a": "But the new paradigm has created millions of opportunities for older workers willing to risk security and start their own businesses."}, {"3662": "So What Do You Need to Create a Startup and Become a Successful 60+Entrepreneur?"}], "content": "A Door of Disappointment Could Lead to a Better Door for 60+ Freelancers I subscribe to a lot of blogs and email lists, and like many of you, I want to make a difference. The other day, a desktop notification from one of my email subscriptions popped up with the single word “disappointed”. Intrigued, I clicked on the link and found a posting on a job blog for people in the 50+ age bracket, all of whom were frustrated jobseekers. The phenomenon of age discrimination is not new, but the latest crop of boomers and post-boomers are now facing the reality of discrimination first-hand. The barriers to job entry for the older worker is like a steel door slammed in their face and bolted from the inside. I read further and saw how these workers (these were skilled workers with hard earned pedigrees) were disrespected, patronized, and shut-out from opportunities. It was an eye-opener for many of them, leaving them hopeless. Fortunately, online communities across the US and Canada hold a premium for entrepreneurial consultants. Our economies are not as reliant on brick and mortar employers to supply all the jobs as they were in the past. Our society has been forced to evolve from the outcomes of the 2008 recession, and the Wall Street and Big Bank Bailouts of the last decade. Those disasters have created opportunities for workers willing to adapt to drastic changes in the job marketplace. For the out-of-work older worker, many stereo-types, prejudices and attitudes still exist. Most are forced to accept lower paying jobs or take multiple part-time positions. Unfortunately, on the business side, predatory forces are at play. Cave Dwelling employers and Neanderthal Management types have chosen to devalue professional experience in exchange for less experienced younger workers who cost less. Depending on what KoolAid you’re drinking, the reality is the U.S. full employment numbers are still underneath the pre-2008 employment floor. Hiring managers have learned wages do not have to increase to past levels. After a decade of forcing workers to perform twice the amount of labor for the same wage or face a lay-off, big and small businesses alike learned quickly how to profit under the new paradigm. Thanks to the PC neutered term “downsizing”, and Obamacare’s “forced” health care coverage for full-time workers, the whole climate of the job market has changed without much blow-back from the media. But the new paradigm has created millions of opportunities for older workers willing to risk security and start their own businesses. So What Do You Need to Create a Startup and Become a Successful 60+Entrepreneur? ", "name": "190", "child": "190_1", "timestamp": "Aug 27, 2016"}