{"parent": "", "title": "Chapter 2: Planning for a Pay Cut", "author": "Garrett Dimon", "sentences": [{"3bf4": "Chapter 2: Planning for a Pay Cut"}, {"bf5a": "“You have got to be willing to be poor as an entrepreneur.”"}, {"7148": "Sean Parker"}, {"46ea": "—"}, {"b7cc": "If you want to commit yourself to building something that isn’t yet making money, you can either work more hours, or get by on less income. The former isn’t sustainable, and the latter isn’t easy."}, {"86a1": "When you have the golden handcuffs of a large regular paycheck alongside health insurance and other benefits, it can be difficult to imagine living on less income. It’s rare for people go through the exercise of calculating the effects of starting a business on their short-term income. I find that using real numbers can help put things in context."}, {"caa3": "If you want to commit yourself to building something that isn’t yet making money, you can either work more hours, or get by on less income. The former isn’t sustainable, and the latter isn’t easy."}, {"6cba": "In 2007, while I still worked at my regular-paycheck job, my total income was $86,978, and I had a full suite of benefits. That works out to about $71,417 after taxes. On January 1, 2008, I quit my job to focus my efforts on Sifter, knowing that I could freelance to make money when I needed to. In 2008, the year that I built and launched Sifter, I made $36,124 from part-time freelance design work with zero benefits. After taxes, that came to about $24,832. (Figure 1.1) For context, the poverty level for single individuals in the United States was $10,400 that year."}, {"95aa": "The first year after quitting my job, my income was 41.5 percent of what it was the previous year. If you factor in self-employment taxes and look at take-home income, I brought in 34.7 percent of my previous year’s salary. If you factor in benefits, the picture is even gloomier."}, {"c49e": "I was only able to get by because I was debt free, I had some savings set aside, and I had cut my personal expenses. I could have made some extra money by doing more freelancing, but that would have also taken away time from building Sifter. At the time, I wasn’t married, didn’t have kids, and didn’t have a mortgage, but all of those followed shortly thereafter. My lifestyle and Sifter have grown hand in hand."}, {"4735": "I was only able to get by because I was debt free, I had some savings set aside, and I had cut my personal expenses."}, {"5ac9": "To this day, Sifter’s biggest expense — by far — is my salary. I need to bring home a certain amount of money to support my family, so I don’t really have the option of paying myself less. As a result, a portion of Sifter’s income is effectively tied up supporting me — that leaves less money for us to spend on equipment, marketing, or hiring help."}, {"8ba8": "Figure 1.1: Visualizing my income both before and after taxes in the year before and the year after quitting my full-time job."}, {"8867": "Everyone has their own situation and their own challenges, but I’ve found that taking a hard look at these types of numbers can paint a sobering picture of the life of bootstrapping a startup. My guess is that many people raise venture capital simply because they can’t afford to take a pay cut, and they need a full salary and benefits from day one. (I can’t say I wasn’t tempted to explore outside investment for precisely those reasons.) For those of you who are married or in a long-term committed relationship, you might even think of your other half as your first investor. In many cases, they can offer income and access to their corporate benefits while your business is getting off the ground."}, {"ee3d": "To this day, Sifter’s biggest expense — by far — is my salary."}, {"2637": "When you’re considering the finances of starting a business, the most important thing to realize is that you are your biggest cost. Your car payment. Your mortgage. Your family. Your lifestyle. Your unsecured debt. Your savings. The greater your ability to survive on less income, the less stressful your journey will be. Fewer financial concerns mean fewer distractions, more time to build your product, and generally a more pleasant trip."}, {"1c38": "Save. Put off quitting your job as long as you can. Cancel cable. Sell your TV. Sell your car and drive something cheaper. If it’s an option for you — and if you’re up for it — you could even downgrade your home or move to an area with a lower cost of living. It may not be easy, but it could be an option. Keep this in mind if you’re thinking about starting a business someday: Every time you buy something or get a loan, you’re making it that much harder to start a business."}, {"d56e": "When I quit my job to pursue Sifter, I had just finished paying off all my credit card debt, and I had moved into a 500-square-foot apartment. I didn’t have a television or video games. I had a kitchen, a bed, and my desk — all in a single room. I was always ready to sell my car, although I’m thankful it never came to that. I had saved up about two months of living expenses and had another three months of expenses covered through freelancing work. So with a five-month runway — and a whole lot of hope — I took the plunge."}, {"5a22": "As our expenses have grown over the years, I’ve always tried to keep a few cost-cutting ideas in my back pocket. Since I work from home and Lauren takes care of our daughter full time, we knew that we could sell one of our cars if we needed to. Once again, I’m thankful that wasn’t necessary, but we decided to sell one of our cars anyway — simply because working from home meant we weren’t using it."}, {"468d": "If you can work from home, you might just be surprised by how many options to save money are on the table. You can write off your office as a tax deduction, save money on gas, or even sell your car if you no longer need it for commuting. So while finances can be daunting, some of these factors may help lessen the blow."}, {"8223": "Some of these measures may sound extreme, but my steps are only scratching the surface compared to some of the stories I’ve heard. In the end, if you’re passionate about an idea, these ideas will start to sound more feasible as you strive to make it happen. If you had wanted to become an athlete, you’d work out to improve your physical fitness. If you want to create a business, you cut costs to improve your financial fitness. If someone told you they wanted to go to the Olympics, but never took time to train, would you take them seriously?"}, {"cad5": "Ruthlessly trimming your personal expenses is just as important as ruthlessly trimming your business expenses. When you’re bootstrapping, they’re one and the same."}, {"bbf5": "Related Reading"}, {"4383": "Ramen Profitable — Paul Graham explains the benefits of having a low cost of living when creating a business."}, {"819f": "↳ Continue to Chapter 3: Creating Something Real"}, {"be7b": "This is a chapter from the first edition of Starting + Sustaining, a book about bootstrapping a successful hosted web application business. The second edition, a massive update, will be out in Spring of 2017. You can subscribe here to be notified when it launches."}], "content": "Chapter 2: Planning for a Pay Cut “You have got to be willing to be poor as an entrepreneur.” Sean Parker — If you want to commit yourself to building something that isn’t yet making money, you can either work more hours, or get by on less income. The former isn’t sustainable, and the latter isn’t easy. When you have the golden handcuffs of a large regular paycheck alongside health insurance and other benefits, it can be difficult to imagine living on less income. It’s rare for people go through the exercise of calculating the effects of starting a business on their short-term income. I find that using real numbers can help put things in context. If you want to commit yourself to building something that isn’t yet making money, you can either work more hours, or get by on less income. The former isn’t sustainable, and the latter isn’t easy. In 2007, while I still worked at my regular-paycheck job, my total income was $86,978, and I had a full suite of benefits. That works out to about $71,417 after taxes. On January 1, 2008, I quit my job to focus my efforts on Sifter, knowing that I could freelance to make money when I needed to. In 2008, the year that I built and launched Sifter, I made $36,124 from part-time freelance design work with zero benefits. After taxes, that came to about $24,832. (Figure 1.1) For context, the poverty level for single individuals in the United States was $10,400 that year. The first year after quitting my job, my income was 41.5 percent of what it was the previous year. If you factor in self-employment taxes and look at take-home income, I brought in 34.7 percent of my previous year’s salary. If you factor in benefits, the picture is even gloomier. I was only able to get by because I was debt free, I had some savings set aside, and I had cut my personal expenses. I could have made some extra money by doing more freelancing, but that would have also taken away time from building Sifter. At the time, I wasn’t married, didn’t have kids, and didn’t have a mortgage, but all of those followed shortly thereafter. My lifestyle and Sifter have grown hand in hand. I was only able to get by because I was debt free, I had some savings set aside, and I had cut my personal expenses. To this day, Sifter’s biggest expense — by far — is my salary. I need to bring home a certain amount of money to support my family, so I don’t really have the option of paying myself less. As a result, a portion of Sifter’s income is effectively tied up supporting me — that leaves less money for us to spend on equipment, marketing, or hiring help. Figure 1.1: Visualizing my income both before and after taxes in the year before and the year after quitting my full-time job. Everyone has their own situation and their own challenges, but I’ve found that taking a hard look at these types of numbers can paint a sobering picture of the life of bootstrapping a startup. My guess is that many people raise venture capital simply because they can’t afford to take a pay cut, and they need a full salary and benefits from day one. (I can’t say I wasn’t tempted to explore outside investment for precisely those reasons.) For those of you who are married or in a long-term committed relationship, you might even think of your other half as your first investor. In many cases, they can offer income and access to their corporate benefits while your business is getting off the ground. To this day, Sifter’s biggest expense — by far — is my salary. When you’re considering the finances of starting a business, the most important thing to realize is that you are your biggest cost. Your car payment. Your mortgage. Your family. Your lifestyle. Your unsecured debt. Your savings. The greater your ability to survive on less income, the less stressful your journey will be. Fewer financial concerns mean fewer distractions, more time to build your product, and generally a more pleasant trip. Save. Put off quitting your job as long as you can. Cancel cable. Sell your TV. Sell your car and drive something cheaper. If it’s an option for you — and if you’re up for it — you could even downgrade your home or move to an area with a lower cost of living. It may not be easy, but it could be an option. Keep this in mind if you’re thinking about starting a business someday: Every time you buy something or get a loan, you’re making it that much harder to start a business. When I quit my job to pursue Sifter, I had just finished paying off all my credit card debt, and I had moved into a 500-square-foot apartment. I didn’t have a television or video games. I had a kitchen, a bed, and my desk — all in a single room. I was always ready to sell my car, although I’m thankful it never came to that. I had saved up about two months of living expenses and had another three months of expenses covered through freelancing work. So with a five-month runway — and a whole lot of hope — I took the plunge. As our expenses have grown over the years, I’ve always tried to keep a few cost-cutting ideas in my back pocket. Since I work from home and Lauren takes care of our daughter full time, we knew that we could sell one of our cars if we needed to. Once again, I’m thankful that wasn’t necessary, but we decided to sell one of our cars anyway — simply because working from home meant we weren’t using it. If you can work from home, you might just be surprised by how many options to save money are on the table. You can write off your office as a tax deduction, save money on gas, or even sell your car if you no longer need it for commuting. So while finances can be daunting, some of these factors may help lessen the blow. Some of these measures may sound extreme, but my steps are only scratching the surface compared to some of the stories I’ve heard. In the end, if you’re passionate about an idea, these ideas will start to sound more feasible as you strive to make it happen. If you had wanted to become an athlete, you’d work out to improve your physical fitness. If you want to create a business, you cut costs to improve your financial fitness. If someone told you they wanted to go to the Olympics, but never took time to train, would you take them seriously? Ruthlessly trimming your personal expenses is just as important as ruthlessly trimming your business expenses. When you’re bootstrapping, they’re one and the same. Related Reading Ramen Profitable — Paul Graham explains the benefits of having a low cost of living when creating a business. ↳ Continue to Chapter 3: Creating Something Real This is a chapter from the first edition of Starting + Sustaining, a book about bootstrapping a successful hosted web application business. The second edition, a massive update, will be out in Spring of 2017. You can subscribe here to be notified when it launches. ", "name": "192", "child": "192_1192_1", "timestamp": "Jul 11, 2016"}