{"parent": "", "title": "Learning These 9 Tough Skills Will Immediately Improve Your Entire Life", "author": "Elle Kaplan", "sentences": [{"9d3f": "Learning These 9 Tough Skills Will Immediately Improve Your Entire Life"}, {"9ff2": "These essential skills are never taught in school, but they will pay dividends for your entire life."}, {"84f0": "“Anyone who stops learning is old whether at 20 or 80. Anyone who keeps learning stays strong.” — Henry Ford"}, {"3046": "We often focus only on learning skills that are directly pertinent to our jobs during the busy workweek."}, {"e830": "Wealthy and successful people, on the other hand, never stop reaching for new heights and learning new skills, even if a teacher or boss isn’t telling them to."}, {"2ad8": "The ultra-successful know that there are some other skills outside of their job description that can also immensely improve their wealth and their life. Well after they graduate, they’re still constant learners."}, {"58d5": "Start off by implementing one or two of these skills into your daily routine, and you’ll start to notice a massive difference in your success:"}, {"e843": "Thinking of your time as money"}, {"8d97": "As Jim Rohn once said, “Either you run the day, or the day runs you.”"}, {"0d02": "Time is one of our few non-renewable resources — we only have a finite amount of it every day. Without learning to manage your time, you let urgent tasks and other people control how you spend your life."}, {"8dd3": "You don’t have to turn into a Debbie Downer, but viewing your time as money is increasingly vital as we try to fit more and more into our daily lives. With everyone clamoring to achieve the ever-evasive “work-life balance,” it’s more important than ever to learn when it’s better to delegate a task rather than do it yourself. By doing this, you won’t only stay sane, but you’ll see your wealth pile up in the process."}, {"57f4": "So don’t waste your time on administrative tasks when you could be on the phone making sales calls. You’ll earn more and enjoy the ride more by sticking to what you’re best at."}, {"951b": "Scheduling your energy"}, {"66ca": "With social media screaming at us from our phones, tablets, and laptops all day, it’s difficult to filter out the noise and actually achieve what we’ve set out to do. In fact, CNBC columnist Mark Fahey estimates that since Facebook launched 12 years ago, it has cost the U.S. economy as much as $3.5 trillion in productivity."}, {"08b1": "Rather than trying to avoid distractions completely, science suggests we should schedule around our energy instead. For instance, Dr. Travis Bradberry suggests doing around 50 minutes of work followed by around 15 minutes of rest. Even if you don’t want to follow his schedule, being aware of and prioritizing around your times of maximum productivity (and avoiding the infamous afternoon slump) is a vital skill to learn."}, {"611e": "Networking"}, {"dc1d": "Studies say that over 70 percent of people have found their jobs through networking. And you can safely bet that successful entrepreneurs didn’t get to the top by living in a bubble."}, {"961d": "Now more than ever, networking is a necessity to stay ahead in business."}, {"534c": "So how do you pull it off?"}, {"25bd": "It doesn’t involve thousands of LinkedIn requests or throwing your business card at everyone you meet. The answer is simple: Truly effective networking involves being your authentic, fabulous self, and becoming your own best cheerleader."}, {"5535": "Susan Solovic, an award-winning entrepreneur and keynote speaker, says, “Remember, people do business with people they know, like, and trust.”"}, {"cbbf": "Being honest and being your true self is the best way to do that. Remember to keep it a two-way street — a mutual relationship. TV host Celeste Headlee gave a powerful TED Talk titled “10 Ways to Have a Better Conversation” in which she says that it all “boils down to the same concept, and it is this one: Be interested in other people.”"}, {"df86": "Getting started early"}, {"61be": "Yep, it’s true that almost every highly successful person — from Indra Nooyi to Richard Branson — tends to wake up at around 5 AM."}, {"24f0": "But aside from giving you more time to be productive, waking up earlier helps you in a number of other ways. There’s freedom in waking up on your own terms rather than being woken up by an alarm clock. And when you get up earlier, you give yourself a quiet moment to breathe and set your intention for the day."}, {"7be1": "Quite simply, to get started on the path to being exceptional, you have to start earlier than the rest of the pack."}, {"3d1b": "Planning everything in advance"}, {"3a0d": "As Kiva co-founder Jessica Jackley says, “As all entrepreneurs know, you live and die by your ability to prioritize. You must focus on the most important, mission-critical tasks each day and night, and then share, delegate, delay or skip the rest.”"}, {"1d38": "You can take a page from Former President Obama, who starts tomorrow off on the right foot by making a list of his most important tasks the night before. By combining this with waking up early, you’ll have all your ducks in a row while the rest of the world is still stumbling around Starbucks."}, {"d547": "Setting short goals"}, {"1a58": "Both short-term and long-term goal setting is a vital skill that keeps you focused on achieving success. Zappos CEO Tony Hsieh, for example, recommends smaller, more frequent promotions to keep employee satisfaction high in companies."}, {"dfa8": "While his employees still receive major promotions, they also have shorter-term promotions to stay motivated in between. Instead of just focusing on long-term goals (which are important!), you should get skilled at breaking them down to smaller goals to find a similar motivation."}, {"715e": "For instance, look at your five year plan and then create milestones leading up to that ultimate finish line. Take a break to celebrate each one, and then get back to the grind feeling refreshed."}, {"8898": "Meditating and winding down"}, {"3349": "It might seem surprising that getting skilled at not working (or even thinking) can result in more success. But if everyone from Oprah Winfrey to Richard Branson is meditating regularly, it’s something to pay attention to. Science proves that meditation has phenomenal benefits, from improving your happiness to your social life."}, {"50f5": "Even if you don’t want to chant “om”, develop the skill of turning down at the end of the day. For instance, both media mogul Arianna Huffington and Facebook COO Sheryl Sandberg swear by turning off their phones before bed. And research backs up this habit. According to the National Sleep Foundation, both mental alertness and light exposure contribute to wakefulness. So power down and get to sleep!"}, {"6332": "Active Listening"}, {"61b8": "With a million and a half things going on, it’s easy to get distracted when listening to others (especially if it’s a boring topic). However, as uninteresting as the conversation might be, you should know that listening has been called one of the make-or-break factors for successful leadership."}, {"74d8": "Instead of nodding off, consider both showing the speaker that you’re interested (nodding, agreeing, etc.) and actually making an effort to understand (by asking questions and clarifying). Even if you aren’t actually interested, you’ll absorb the information and look highly professional."}, {"20a2": "Eliminating ANTS"}, {"003f": "Don’t get out the bug spray just yet. Dr. Daniel Amen, author of Change Your Brain Change Your Life, claims ANTs (automatic negative thoughts) are one of the most harmful things for your brain."}, {"3364": "Negative thoughts happen to everyone, but the worst thing you can do is let them rattle around in your brain and drag your day down. That’s why Dr. Amen recommends taking a few minutes to question these thoughts daily. So if anything’s been dragging you down, focus on learning how you can change your perspective and realize your fantastic self despite it — it’s well worth the effort."}, {"ee9b": "Plus, staying optimistic also keeps you excited. And by staying optimistic and excited, your day will always be worth it."}, {"48ae": "Call to action"}, {"42fa": "If you liked these tips, check out my website for more, and follow me on Medium."}, {"07ab": "If you have any skills to add to the list, I’d love to hear them!"}], "content": "Learning These 9 Tough Skills Will Immediately Improve Your Entire Life These essential skills are never taught in school, but they will pay dividends for your entire life. “Anyone who stops learning is old whether at 20 or 80. Anyone who keeps learning stays strong.” — Henry Ford We often focus only on learning skills that are directly pertinent to our jobs during the busy workweek. Wealthy and successful people, on the other hand, never stop reaching for new heights and learning new skills, even if a teacher or boss isn’t telling them to. The ultra-successful know that there are some other skills outside of their job description that can also immensely improve their wealth and their life. Well after they graduate, they’re still constant learners. Start off by implementing one or two of these skills into your daily routine, and you’ll start to notice a massive difference in your success: Thinking of your time as money As Jim Rohn once said, “Either you run the day, or the day runs you.” Time is one of our few non-renewable resources — we only have a finite amount of it every day. Without learning to manage your time, you let urgent tasks and other people control how you spend your life. You don’t have to turn into a Debbie Downer, but viewing your time as money is increasingly vital as we try to fit more and more into our daily lives. With everyone clamoring to achieve the ever-evasive “work-life balance,” it’s more important than ever to learn when it’s better to delegate a task rather than do it yourself. By doing this, you won’t only stay sane, but you’ll see your wealth pile up in the process. So don’t waste your time on administrative tasks when you could be on the phone making sales calls. You’ll earn more and enjoy the ride more by sticking to what you’re best at. Scheduling your energy With social media screaming at us from our phones, tablets, and laptops all day, it’s difficult to filter out the noise and actually achieve what we’ve set out to do. In fact, CNBC columnist Mark Fahey estimates that since Facebook launched 12 years ago, it has cost the U.S. economy as much as $3.5 trillion in productivity. Rather than trying to avoid distractions completely, science suggests we should schedule around our energy instead. For instance, Dr. Travis Bradberry suggests doing around 50 minutes of work followed by around 15 minutes of rest. Even if you don’t want to follow his schedule, being aware of and prioritizing around your times of maximum productivity (and avoiding the infamous afternoon slump) is a vital skill to learn. Networking Studies say that over 70 percent of people have found their jobs through networking. And you can safely bet that successful entrepreneurs didn’t get to the top by living in a bubble. Now more than ever, networking is a necessity to stay ahead in business. So how do you pull it off? It doesn’t involve thousands of LinkedIn requests or throwing your business card at everyone you meet. The answer is simple: Truly effective networking involves being your authentic, fabulous self, and becoming your own best cheerleader. Susan Solovic, an award-winning entrepreneur and keynote speaker, says, “Remember, people do business with people they know, like, and trust.” Being honest and being your true self is the best way to do that. Remember to keep it a two-way street — a mutual relationship. TV host Celeste Headlee gave a powerful TED Talk titled “10 Ways to Have a Better Conversation” in which she says that it all “boils down to the same concept, and it is this one: Be interested in other people.” Getting started early Yep, it’s true that almost every highly successful person — from Indra Nooyi to Richard Branson — tends to wake up at around 5 AM. But aside from giving you more time to be productive, waking up earlier helps you in a number of other ways. There’s freedom in waking up on your own terms rather than being woken up by an alarm clock. And when you get up earlier, you give yourself a quiet moment to breathe and set your intention for the day. Quite simply, to get started on the path to being exceptional, you have to start earlier than the rest of the pack. Planning everything in advance As Kiva co-founder Jessica Jackley says, “As all entrepreneurs know, you live and die by your ability to prioritize. You must focus on the most important, mission-critical tasks each day and night, and then share, delegate, delay or skip the rest.” You can take a page from Former President Obama, who starts tomorrow off on the right foot by making a list of his most important tasks the night before. By combining this with waking up early, you’ll have all your ducks in a row while the rest of the world is still stumbling around Starbucks. Setting short goals Both short-term and long-term goal setting is a vital skill that keeps you focused on achieving success. Zappos CEO Tony Hsieh, for example, recommends smaller, more frequent promotions to keep employee satisfaction high in companies. While his employees still receive major promotions, they also have shorter-term promotions to stay motivated in between. Instead of just focusing on long-term goals (which are important!), you should get skilled at breaking them down to smaller goals to find a similar motivation. For instance, look at your five year plan and then create milestones leading up to that ultimate finish line. Take a break to celebrate each one, and then get back to the grind feeling refreshed. Meditating and winding down It might seem surprising that getting skilled at not working (or even thinking) can result in more success. But if everyone from Oprah Winfrey to Richard Branson is meditating regularly, it’s something to pay attention to. Science proves that meditation has phenomenal benefits, from improving your happiness to your social life. Even if you don’t want to chant “om”, develop the skill of turning down at the end of the day. For instance, both media mogul Arianna Huffington and Facebook COO Sheryl Sandberg swear by turning off their phones before bed. And research backs up this habit. According to the National Sleep Foundation, both mental alertness and light exposure contribute to wakefulness. So power down and get to sleep! Active Listening With a million and a half things going on, it’s easy to get distracted when listening to others (especially if it’s a boring topic). However, as uninteresting as the conversation might be, you should know that listening has been called one of the make-or-break factors for successful leadership. Instead of nodding off, consider both showing the speaker that you’re interested (nodding, agreeing, etc.) and actually making an effort to understand (by asking questions and clarifying). Even if you aren’t actually interested, you’ll absorb the information and look highly professional. Eliminating ANTS Don’t get out the bug spray just yet. Dr. Daniel Amen, author of Change Your Brain Change Your Life, claims ANTs (automatic negative thoughts) are one of the most harmful things for your brain. Negative thoughts happen to everyone, but the worst thing you can do is let them rattle around in your brain and drag your day down. That’s why Dr. Amen recommends taking a few minutes to question these thoughts daily. So if anything’s been dragging you down, focus on learning how you can change your perspective and realize your fantastic self despite it — it’s well worth the effort. Plus, staying optimistic also keeps you excited. And by staying optimistic and excited, your day will always be worth it. Call to action If you liked these tips, check out my website for more, and follow me on Medium. If you have any skills to add to the list, I’d love to hear them! ", "name": "195", "child": "195_1\t195_2\t195_3\t195_4\t195_5\t195_6\t195_7\t195_8\t195_9\t195_10\t195_11\t195_12\t195_13\t195_14\t195_15\t195_16\t195_17\t195_18\t195_19\t195_20\t195_21\t195_22\t195_23\t195_24", "timestamp": "Apr 14"}