{"parent": "", "title": "The System I Used to Write 5 Books and Over 1,000 Blog Posts", "author": "Jeff Goins", "sentences": [{"1d14": "The System I Used to Write 5 Books and Over 1,000 Blog Posts"}, {"dc95": "Most writers struggle with getting their writing done for one surprising reason. They think writing is a one-step process, when in fact, it’s a three-step process."}, {"f832": "What we call “writing” is actually made up of three distinct activities: coming up with ideas, turning those ideas into drafts, and then editing those drafts into publishable pieces."}, {"fdcf": "When I decided to become a writer and made the commitment to write 500 words per day, every single day, I quickly ran into the resistance that holds most of us back from doing our work."}, {"f005": "I’d get up early, brew my coffee, and sit down to write. And I’d wait. And wait. And I’d wait for the words to come, but nothing would come quickly. Some days, nothing would come at all."}, {"20d1": "The minutes would tick by, with me stupidly staring at the cursor, squandering what little time I had before having to go to work. When my writing time was over, I’d pack my stuff up, defeated, and beat myself up for the rest of the day."}, {"a91e": "Why couldn’t I focus?"}, {"4ea4": "The truth is most writers struggle with this. Because they believe the myth that writing is one thing. When I realized that coming up with a great idea, writing 500–1,000 words on that idea, and then editing that idea into something I could publish on my blog — all in one sitting — was, in fact, a ridiculous goal, everything changed."}, {"6208": "I began breaking those activities — ideation, creation, and editing — into three separate actions. And you know what? When you have one goal to accomplish, you are far more productive and focused than when you have three."}, {"8478": "Imagine that."}, {"d524": "As I did this, writing became easier and easier. I started writing more. I stopped getting writer’s block — period. I didn’t feel stuck anymore. I knew exactly what I needed to do, and I knew I could do it — so I did."}, {"ef55": "What resulted was, to my own chagrin, a system. To be honest, I’m not a very organized guy. I wish I were. But the truth is most of my life is messier than I care to admit. But what I’ve realized is every working writer I know has some sort of system to get the work done."}, {"a444": "A system doesn’t have to be complicated or confusing. It just has to work. To quote my friend Tim Grahl, a system is just a way of doing something that gets you a predictable result every time. Like, putting your keys in the same place every day after work (which I only recently started doing)."}, {"b2b4": "Below is my system, and maybe it’ll work for you, too. I call it: The Three-Bucket System. And it’s how I get my writing done."}, {"d116": "Bucket #1: Ideas"}, {"9d2d": "All throughout the day, I capture ideas using an app called Drafts that syncs with Evernote."}, {"8232": "That’s the first bucket: ideas."}, {"1242": "I have a whole folder full of them for when I’m feeling dry in the creativity department."}, {"5a1f": "You can use a notebook for this as well. The tool doesn’t matter, as long as you aren’t just hanging onto all those ideas in your brain. Don’t trust that operating system. It will fail you."}, {"8a9d": "You must capture ideas in a place where you can return to them later when your memory fails you and the coffee hasn’t kicked in yet."}, {"8f8d": "Bucket #2: Drafts"}, {"febe": "Then, when it’s time for me to write (usually in the morning), I’ll pull an idea out from the first bucket and start writing, usually around 500 words in one session. This process makes it easier to just start writing because I don’t have to think about what I’m going to write — I already have a prompt."}, {"06b2": "The ideas I collect function as prompts for me, but this is not just a writing exercise. It’s work. I never write something without the intent of publishing it.This is what my friend Marion calls “writing with intent.” The best practice is the kind done in public, and the best writing is the stuff you intend to publish."}, {"a465": "Once I’ve written about 500 words on my idea, I save it as a draft in Scrivener (if I’m working on a book) or in Byword (if it’s a blog post). Again, these are the tools I use. They don’t matter as much as the method."}, {"34ba": "This is the second bucket: drafts."}, {"8717": "At any given time, I have a whole bunch of half-finished chapters and blog posts on my computer begging to be edited and completed."}, {"dc59": "This is not an overwhelming feeling. It’s an empowering one, because when it’s time to edit, I get to choose what I want to work on. I don’t have to come up with an idea or “just write.”"}, {"a170": "The point of this system is to think as little as possible and just do the next thing."}, {"d09a": "Bucket #3: Edits"}, {"5b82": "Finally, I pull out one of those half-completed drafts and edit it. I’ll polish up the flow and sentence structure and of course, check for grammar and spelling."}, {"fa40": "At this point, the piece isn’t perfect, but it’s at least 90% done. I’ll either schedule it for a blog post or tuck it away in another folder called “Finished pieces” on my computer."}, {"7df6": "This is the third bucket: edits."}, {"c886": "These are pieces of writing that are more or less ready for the world to see. The next step is to share them with an editor or publisher or post to my blog. Again, I don’t write anything just for fun. It all has a purpose."}, {"660c": "This is what professionals do. They write for an audience, always with the intent of publishing. Anything less than that will result in something that isn’t your best work."}, {"fd52": "Putting it together"}, {"b540": "So here’s how this works in practice. But a quick word: if you’re just beginning, you’ll really need two days to get the system fully running."}, {"0e23": "1. Collect Ideas"}, {"ca1d": "Today, as you go on with the rest of your day, grab any ideas that come to you and capture them in a notebook or on an app that you can easily return to later. Shoot for five ideas. Write down a sentence or a phrase. Just enough to save the idea."}, {"3e88": "2. Write and Save"}, {"c96e": "Tomorrow, when it’s time to write (say, in the morning, or whenever works for you), pull one of those ideas out of that first bucket."}, {"bdb1": "I find that certain ideas speak to me, call to me even, and I try to listen to that voice. But sometimes, I just pick one. Typically, I choose the one that either most excites me or represents a deadline I have to meet."}, {"6a9b": "When you’re done, put this piece in the “drafts” folder and save it for later. Then today, you’re done."}, {"9262": "3. Edit and Publish"}, {"9951": "The day after, return to yesterday’s draft and edit it. Then move it to bucket three, maybe even publish it on your blog or wherever. Then go to bucket one to pull out a new idea and start writing again."}, {"2678": "Do this every day, and you’ll never run out of writing topics. You’ll never run out of things to edit and publish. You’ll never have writer’s block again."}, {"3a35": "As long as you remember: writing is not one thing. It’s three things. So that’s my system. Give it a try, and let me know how it works."}, {"57ec": "Call to Action"}, {"3b46": "Want to become a professional writer in less than 18 months? If so, get my free strategy-guide where I teach everything I know."}, {"d6b3": "Get your strategy-guide right now."}], "content": "The System I Used to Write 5 Books and Over 1,000 Blog Posts Most writers struggle with getting their writing done for one surprising reason. They think writing is a one-step process, when in fact, it’s a three-step process. What we call “writing” is actually made up of three distinct activities: coming up with ideas, turning those ideas into drafts, and then editing those drafts into publishable pieces. When I decided to become a writer and made the commitment to write 500 words per day, every single day, I quickly ran into the resistance that holds most of us back from doing our work. I’d get up early, brew my coffee, and sit down to write. And I’d wait. And wait. And I’d wait for the words to come, but nothing would come quickly. Some days, nothing would come at all. The minutes would tick by, with me stupidly staring at the cursor, squandering what little time I had before having to go to work. When my writing time was over, I’d pack my stuff up, defeated, and beat myself up for the rest of the day. Why couldn’t I focus? The truth is most writers struggle with this. Because they believe the myth that writing is one thing. When I realized that coming up with a great idea, writing 500–1,000 words on that idea, and then editing that idea into something I could publish on my blog — all in one sitting — was, in fact, a ridiculous goal, everything changed. I began breaking those activities — ideation, creation, and editing — into three separate actions. And you know what? When you have one goal to accomplish, you are far more productive and focused than when you have three. Imagine that. As I did this, writing became easier and easier. I started writing more. I stopped getting writer’s block — period. I didn’t feel stuck anymore. I knew exactly what I needed to do, and I knew I could do it — so I did. What resulted was, to my own chagrin, a system. To be honest, I’m not a very organized guy. I wish I were. But the truth is most of my life is messier than I care to admit. But what I’ve realized is every working writer I know has some sort of system to get the work done. A system doesn’t have to be complicated or confusing. It just has to work. To quote my friend Tim Grahl, a system is just a way of doing something that gets you a predictable result every time. Like, putting your keys in the same place every day after work (which I only recently started doing). Below is my system, and maybe it’ll work for you, too. I call it: The Three-Bucket System. And it’s how I get my writing done. Bucket #1: Ideas All throughout the day, I capture ideas using an app called Drafts that syncs with Evernote. That’s the first bucket: ideas. I have a whole folder full of them for when I’m feeling dry in the creativity department. You can use a notebook for this as well. The tool doesn’t matter, as long as you aren’t just hanging onto all those ideas in your brain. Don’t trust that operating system. It will fail you. You must capture ideas in a place where you can return to them later when your memory fails you and the coffee hasn’t kicked in yet. Bucket #2: Drafts Then, when it’s time for me to write (usually in the morning), I’ll pull an idea out from the first bucket and start writing, usually around 500 words in one session. This process makes it easier to just start writing because I don’t have to think about what I’m going to write — I already have a prompt. The ideas I collect function as prompts for me, but this is not just a writing exercise. It’s work. I never write something without the intent of publishing it.This is what my friend Marion calls “writing with intent.” The best practice is the kind done in public, and the best writing is the stuff you intend to publish. Once I’ve written about 500 words on my idea, I save it as a draft in Scrivener (if I’m working on a book) or in Byword (if it’s a blog post). Again, these are the tools I use. They don’t matter as much as the method. This is the second bucket: drafts. At any given time, I have a whole bunch of half-finished chapters and blog posts on my computer begging to be edited and completed. This is not an overwhelming feeling. It’s an empowering one, because when it’s time to edit, I get to choose what I want to work on. I don’t have to come up with an idea or “just write.” The point of this system is to think as little as possible and just do the next thing. Bucket #3: Edits Finally, I pull out one of those half-completed drafts and edit it. I’ll polish up the flow and sentence structure and of course, check for grammar and spelling. At this point, the piece isn’t perfect, but it’s at least 90% done. I’ll either schedule it for a blog post or tuck it away in another folder called “Finished pieces” on my computer. This is the third bucket: edits. These are pieces of writing that are more or less ready for the world to see. The next step is to share them with an editor or publisher or post to my blog. Again, I don’t write anything just for fun. It all has a purpose. This is what professionals do. They write for an audience, always with the intent of publishing. Anything less than that will result in something that isn’t your best work. Putting it together So here’s how this works in practice. But a quick word: if you’re just beginning, you’ll really need two days to get the system fully running. 1. Collect Ideas Today, as you go on with the rest of your day, grab any ideas that come to you and capture them in a notebook or on an app that you can easily return to later. Shoot for five ideas. Write down a sentence or a phrase. Just enough to save the idea. 2. Write and Save Tomorrow, when it’s time to write (say, in the morning, or whenever works for you), pull one of those ideas out of that first bucket. I find that certain ideas speak to me, call to me even, and I try to listen to that voice. But sometimes, I just pick one. Typically, I choose the one that either most excites me or represents a deadline I have to meet. When you’re done, put this piece in the “drafts” folder and save it for later. Then today, you’re done. 3. Edit and Publish The day after, return to yesterday’s draft and edit it. Then move it to bucket three, maybe even publish it on your blog or wherever. Then go to bucket one to pull out a new idea and start writing again. Do this every day, and you’ll never run out of writing topics. You’ll never run out of things to edit and publish. You’ll never have writer’s block again. As long as you remember: writing is not one thing. It’s three things. So that’s my system. Give it a try, and let me know how it works. Call to Action Want to become a professional writer in less than 18 months? If so, get my free strategy-guide where I teach everything I know. Get your strategy-guide right now. ", "name": "199", "child": "199_1\t199_2\t199_3\t199_4\t199_5\t199_6\t199_7\t199_8\t199_9\t199_10\t199_11\t199_12\t199_13\t199_14\t199_15\t199_16\t199_17\t199_18\t199_19\t199_20\t199_21\t199_22\t199_23\t199_24\t199_25", "timestamp": "Apr 7"}