{"parent": "", "title": "United Airlines made me ABANDON my mobility device at the gate before my honeymoon", "author": "Trey Harris", "sentences": [{"d5fc": "United Airlines made me ABANDON my mobility device at the gate before my honeymoon"}, {"2b61": "I did everything right, according to both United and TSA’s disability policies. The TSA told United it was OK."}, {"1a93": "But that still didn’t ensure I could travel with the device that lets me get around. And it didn’t save my honeymoon from near-ruin when I was threatened with arrest."}, {"a06d": "Last month, @United Airlines made me abandon my previously-approved, DOT & TSA-allowed mobility device. At the gate at Newark Liberty airport. On the way to my honeymoon cruise."}, {"aa1b": "I’d done my research before trying to take it. I’d called United’s Special Needs desk well before the flight. I explained: I have spondylitis, a type of autoimmune spinal arthritis. My symptoms vary wildly from day to day but most often I have trouble walking, but can stand okay, so I use a Segway miniPro (@SegwayInc) & cane. They asked about the device’s specs and gave me what sounded like the official OK."}, {"73d6": "The Special Needs desk rep said I could pre-board and place it in the overhead — it easily fits with the steering bar removed, and my husband can lift it. They said they’d annotated my itinerary, and told me to call them back if I had “any trouble boarding.”"}, {"d9ad": "The United rep then transferred me to the @TSA disability services desk to get the OK from them as well; TSA made a notation and told me who to contact if we had any trouble getting through security. TSA then sent me an email to confirm."}, {"670e": "We thought everything was taken care of. Boy, were we wrong."}, {"4c57": "JoCoCruise 2017 homepage (https://jococruise.com/)"}, {"8ebb": "We’d been looking forward to this day for nearly a year. On Friday, March 3, we headed to Newark Liberty airport for our flight to San Diego, where we’d embark on the JoCo Cruise — which some have described as a 7-day floating Comic-con/music festival. Some of my and my new husband Connor’s favorite podcasters, musicians, authors, and artists would be there. We would have been excited even if this hadn’t also just so happened to be our honeymoon."}, {"4f84": "We got to the airport, checked in, and I rode the Segway to security and put it through the X-ray (TSA got the memo, apparently), took it to gate, and notified the gate agent we needed preboarding."}, {"a3a1": "At gate call, we were first in line, but they said we had to wait while they “checked on something”. We waited while pre-boarding concluded, but then I told my husband to go ahead and board (we had first-class tickets — it was our honeymoon, remember — so he had boarding priority even without me), in order to save overhead room for the Segway with a bag."}, {"d738": "I waited as they finished priority boarding and had proceeded through the next couple boarding groups, then the agent said I couldn’t carry it on, and I couldn’t gate check it, because it “wasn’t allowed”. I asked if they’d seen that notation in my itinerary. They said they had, and it indeed showed my prior call."}, {"f9b9": "But they said it read: “passenger was advised he would NOT be allowed to board with device, and the device will not have to be checked, provided he can place device in overhead without crew assistance. Transferred passenger to TSA for clearance of device through security.” It seemed obvious that the “not” there was a typo — the rest of the annotation doesn’t make any sense otherwise! I tried to explain that logic to them, but they were unyielding."}, {"6246": "So I called the Special Needs desk and the rep reviewed the record and agreed, that was just a typo, I could carry it on. I handed my phone to the agent."}, {"076e": "“We don’t allow hoverboards, they’re fire risks… We don’t even allow Samsung phones, we definitely won’t allow that.”"}, {"edf5": "After speaking to the rep, the gate agent said a “manager” had to decide. We waited a bit—by this time, everyone in the gate area had boarded—then the manager came and said no. “We don’t allow hoverboards, they’re fire risks.”"}, {"4ea2": "I explained that it’s a Segway, not a hoverboard, it’s UL-certified for fire safety (with a hologram-seal certification on bottom stating this — I showed it to them), and one has never spontaneously combusted like those cheap hoverboards everyone was buying a couple years ago did. You could buy one on Amazon, even after they announced they wouldn’t sell hoverboards anymore."}, {"45e9": "The manager was unswayed. “We don’t even allow Samsung phones, we definitely won’t allow that.” (I did not point out that I hadn’t seen anyone asked to show their phone at the gate, and so how did he know there wasn’t a Samsung phone on board?)"}, {"61fb": "I got my iPad out where I’d pre-loaded the regs from United’s own website and showed them the relevant passages: “no watt hour limit” for such sealed permanent batteries¹, “Segways” for mobility purposes were specifically mentioned along with wheelchairs, scooters, etc."}, {"ea88": "“TSA has no problem with it.” He conferred with the TSA manager, who repeated, “TSA will allow.”"}, {"bbe5": "The manager tried to make it TSA’s problem. “I don’t know why they let you through security, TSA doesn’t allow these.” So I asked for the duty manager TSA’s disability line told me to ask for. He shortly arrived and succinctly gave his judgment: “TSA has no problem with it.” The United manager scowled, and said the captain must decide."}, {"0483": "My husband returned from the plane, saying there was space saved in the overhead for it. The captain came to the gate, I explained the situation and showed him the iPad, told him it’s our honeymoon and we had a cruise ship to catch, and he said “don’t worry, we’ll figure this out,” warmly — I thought he was on our side."}, {"a530": "He conferred with the TSA manager, who repeated, “TSA will allow.” The captain returned to plane without speaking to us, and I think I’m all set, so we head to the jetway — and got stopped again."}, {"eb5f": "At this point I got a phone notification from one of my travel apps (not United’s) — the flight’s now delayed 10 minutes (boarding began on-time). The reason given: “a passenger disturbance”. They’re just holding my husband and me there, and making preps to push off — with our luggage, including carry-ons, on the plane!"}, {"39c3": "I’m then told that the captain has made the decision NOT to allow it, and has “final authority”. I ask what can I do — gate-check it? No, it’s not being allowed on the plane period, cabin or cargo. Can we book another flight while we argue our case? No — no flight will arrive in time for our ship departure.²"}, {"a1cf": "“What if I just left it right here,” in front of the gate — “will you let us board without it?”"}, {"2c64": "No time to get the Segway home, or to get a friend to pick it up; no way to store it. Connor even tried without success to get an agent going off-duty to just take it to lost and found. Finally, as they’re about to close the doors (were they really going to push off with all our things onboard?), I pointed to it and said “what if I just left it right here,” in front of the gate — “will you let us board without it?”"}, {"cca0": "The gate agent grumbles that we could’ve done that at the start without all this trouble, and then lets us board — me hobbling on my cane down the jetway. We take off, and my honeymoon starts with me sobbing for an hour, my husband consoling me. I felt humiliated, like all the passengers blamed me for the delay. (One passenger a few rows back was grousing loudly, “entitled idiot thinks he can bring a hoverboard onto an airplane”.) I assumed the Segway — a device that’s been essential to me for much of the last year I’ve had it — is lost."}, {"6402": "I didn’t know how I’d get around onboard the ship and on excursions. Before I had the Segway, I’d have at least brought crutches on a trip like this, maybe a wheelchair if my symptoms were bad enough. Now I had nothing but a cane."}, {"3325": "When we arrived in San Diego, we were able to rent a scooter for several hundred dollars (including a last-minute surcharge). Compared to the Segway — which is nimble, light, can go anywhere I can except stairs, and is stable and safe — this thing was miserable. It was clunky, heavy, and dangerous."}, {"4307": "Let me quickly explain the Segway. You’ve probably seen the big ones used by tourists and mall cops the world over. The miniPro (available on Amazon) is the same idea, but smaller, lighter, much less expensive — and, in almost every way, better."}, {"b341": "Ninebot by Segway, http://www.segwayminipro.com/"}, {"b840": "When you turn it on, it stands straight up, balancing itself. A telescoping handle pops out the top so you can guide it around when you aren’t riding it."}, {"7c7e": "You can step on with either foot (I do this with the help of my cane), and it beeps to let you know it’s now balancing you; you step fully onto it. Then, when you lean forward, it goes forward; lean back, it stops and then goes backwards."}, {"48a8": "Those cheap “hoverboards” from the 2015 craze required you to steer by shifting your weight from your left foot to your right. In a way, they do steering the same way the Segway does throttle."}, {"73fc": "But the Segway ignores changes in side-to-side lean — I couldn’t use it otherwise, since one foot or the other is usually bothering me. Instead, you steer it by putting gentle pressure on a kneebar. The more you press, the quicker you turn. So I can use it, even if I can put little to no weight on one side."}, {"deb4": "Compared to many other mobility options like that scooter rental, the Segway’s control is a) intuitive, b) analog, and c) exquisite. Let me explain:"}, {"45dc": "INTUITIVE: I’ve let friends try it. I’ve let friends’ kids try it. I’ve let people on the sidewalk try it. I’ve even once — carefully!—let a stranger I met on the street, who had a similar form of arthritis to mine and was walking with crutches, give it a try."}, {"efc1": "It feels weird for the first ten or fifteen seconds; people tend to rock back and forth a bit, so I offer them my arm while they get used to it. Then your brain clicks, and you stop “driving” it. Within minutes, you stop “riding” it. You just go where you want to go. Like walking, you don’t think about the mechanics; you just think about what you want to do, and it does it."}, {"169b": "If an obstacle suddenly appears — a door opens in front of you, someone walking ahead stops abruptly to pick up something they’ve dropped — your natural startle reflex, to straighten up and lean back — stops you, nearly instantly. When I’ve had friends’ kids try it, after they get the hang of it and are zooming around happily, I tell them to try passing where I’m standing at full speed. Then, at the last moment, I step in front of them and put out a hand. They stop as quickly, as automatically, and with as little danger to either of us as if they were walking by and I’d done the same."}, {"4be8": "The point is, this thing is safe."}, {"9a24": "ANALOG: At full-tilt, the Segway goes up to about 13 mph. I very, very rarely go that fast. I just match whatever walking speed I need to for the people around me. I’ve gotten more comments from onlookers in New York City amazed how slowly I can go, creeping around Times Square throngs. I can go any speed I want."}, {"4e59": "EXQUISITE: The precision I have is hard to describe, and for people around me who haven’t seen one before, it can be hard to believe (particularly when I tell them it didn’t take practice). I can do a 360° turn in place. I can back out of a corner, turn, and continue without a stop. (When I turn it on after it’s been propped against a wall while I’ve been sitting, I don’t even bother to guide it away from the wall; I just hop on, turn in place, and ride away.)"}, {"69a9": "I can stay in place talking to someone for minutes. (Its battery life is many hours with normal use, and it uses “regenerative braking”, meaning rather than traditional brakes, it just sends power back to the battery to stop.) I can navigate a narrow NYC drugstore with a basket, go through the checkout line, pay, and leave without stepping off. Its width is less than my own elbow-to-elbow, so anywhere I can go, it can go. I have to find wheelchair ramps and elevators, but besides that I can pretty much go anywhere. And when I run into a curb without a ramp, its under-30-pound weight makes it possible to just step off and lift it up the curb."}, {"a1d8": "I went to a conference last December with the Segway. It was just like being able-bodied — I could mingle at cocktail parties, navigate through densely-packed tables, go through the buffet line, carry drinks."}, {"ce52": "It was thrilling and freeing. It was worlds better than crutches, even my expensive custom set — my hands were free, I didn’t have to watch where I planted them, and I wasn’t exhausted at the end of the day."}, {"d02e": "This scooter I’d just rented was nothing like that."}, {"dfd9": "I felt humiliated and burdensome, again and again."}, {"d8cc": "The scooter was clunky as hell. It was the kind you see on commercials and in grocery stores: one front wheel connected to a tiller, two back wheels, with a cushy chair mounted on a big platform in between. It had handlebars with a lever in the middle. The lever had basically three speeds: forward, stop, and reverse. There was a dial in the middle you needed a second hand for to control the speed. But it wasn’t natural to hold on to it all the time, so it tended to be something I’d adjust when circumstances changed."}, {"4c00": "A fancier scooter than the rental, but same basic idea. (©Zdlpwebb CC-BY SA 4.0)"}, {"cb14": "Unfortunately, it was hard to remember I didn’t have any analog control with that drive lever. To get over the door jam into my cabin, I had to have the throttle dialed up pretty high — but then I needed to remember to turn the dial way down once I’d cleared it, otherwise I’d crash headlong into the sofa. Which I did, repeatedly. And I ran over my husband’s foot at least twice doing just that. The obvious thing — letting go of the pressure on the lever like it was a gas pedal — did nothing to slow it down until it would suddenly stop."}, {"b37c": "I needed help with doors. I couldn’t turn around in the narrow ship passageways — if I overshot my destination, I had to continue all the way to the next bank of elevators and turn around. I never mastered turning in reverse."}, {"eb2a": "It had a basket I could carry things in, but I needed both hands to drive it, so even carrying a drink ten feet or getting my own food was impossible, or something I’d have to hobble on my cane to do."}, {"6583": "All week, I felt like a burden on my husband and an inconvenience to other passengers and the crew. I kept making other passengers miss elevators, because I couldn’t get out and clear fast enough before the doors shut. Places with two or three steps — places I could have easily stepped off the Segway and guided it manually over — were insurmountable obstacles with the scooter’s 150-pound weight."}, {"7b9b": "A couple times, I “turtled” it going over a hatchway ramp, both its front and rear wheels in the air. It was so heavy that the only way I could get it free the time this happened and I was alone was to get off it, put all my weight on the chair back with my elbows, turn the throttle to max and hit the drive button so it would jump over— very nearly crushing my fingers against a bulkhead in the process."}, {"fc88": "I never felt safe with the thing. When I’m around small children with the Segway, I’m careful—but only to avoid startling them or their parents, I’ve never had the slightest worry of hurting them. On the scooter, I had a couple close calls with children too little to see in my blind spot that left me shaken."}, {"9a21": "We couldn’t go on excursions we would have been able to with the Segway. A lot of excursions can handle someone with a mobility device they can lift themselves, but very few had the people or equipment to deal with a 150-pound vehicle."}, {"abac": "And “tendering” — getting to shore by way of little shuttle boats in ports that can’t accommodate huge ships — was such an ordeal, dealing with winches and tiny service elevators I had to use alone — we just stayed on the ship once, giving up our only chance for a lay on the beach. It was just too much trouble. (I can and do hold the Segway in my lap in taxicabs.)"}, {"9141": "It was just an awful experience. I needed help for everything. One night we found the handicapped spot in the ship’s main theater, only to find the handicapped symbol on the floor covered with chairs the next night; I had to ask people to give up their seats, and then move them aside for me! I felt humiliated and burdensome, again and again."}, {"76f8": "I don’t want to be overly gloomy, or pretend my honeymoon wasn’t any fun at all. The @JoCoCruise was fantastic otherwise, and the staff were extremely helpful. Performers I met like @JeanGreasy, @QuelleChris, @RebeccaSugar & others were sympathetic and outraged when they heard about this. I have no idea how some people heard about it, but strangers frequently stopped me to tell me how distressed they were about what had happened at the airport."}, {"c684": "I started to feel better, like this was just one of those “nightmare honeymoons” that couples talk about fondly decades later as something that helped them grow closer."}, {"214d": "Then, about halfway through the cruise, my cellphone briefly connected for the first time since we’d left San Diego."}, {"1ac3": "I might be arrested on arrival at EWR."}, {"e755": "I had a series of progressively more ominous voicemails saying I had “abandoned a hazardous material at an international airport”, which was a crime, and could be held “criminally and civilly liable”. @HALcruises staff were helpful, and generously let me use their phones and Internet for free. But from a distance, all I could find out was that the Segway had been “contained” by a hazmat team, that I might owe them lots of money for its disposal, and I might be arrested on arrival at EWR."}, {"9be6": "I spent the rest of cruise terrified and stressed out. My husband got me through it; I love him so much. The other cruisers were supportive, too. Jean Grae and Quelle Chris were both particularly great; I’d never met them before, but they were checking in on me regularly by the end of the cruise."}, {"0682": "When we docked in San Diego, the scooter company took the scooter from our cabin before we disembarked — so we had to call for a manual wheelchair. I’m not used to wheelchairs, and my husband had to handle all our luggage; going down a ramp heading towards the gangway I gained too much speed, and took a spill over some stairs. I was just scraped and winded, but it was very scary — probably more for my husband than for me. (It’s really okay, honey. You did great and I love you.) Someone who saw this got a HAL crewman (the ship’s IT guy!) who pushed me the rest of the way — which was a good thing, too, because we had to detour across the entire ship to get to a working elevator."}, {"47c7": "We’d planned a day in San Diego, but with my mobility now limited to a cane, we just went to the movies instead. We got on our flight home, arrived in EWR — and, glory be!, no cops to greet me! We even got the Segway back. (The baggage desk crew seemed to know we had been wronged, I caught one whispering to another, incredulously, “but those are allowed!”)"}, {"b5be": "I’m not expecting miracles. I’d just like them — or another airline, if they refuse — to assure me I’ll be allowed to bring my mobility device with me the next time I fly."}, {"fbfb": "I’ve since done more research and can find no reason whatsoever that this should have happened. I did everything I was supposed to. I had the policies and regulations behind me. I’ve sent a letter—a real, paper letter, since I hear that gets better results—to United Airlines, but so far have heard nothing."}, {"e600": "Meanwhile, we’ve signed up for next year’s @JoCoCruise. A do-over, perhaps — but I think it shows how great the cruise is that we’re already set to try again."}, {"597c": "I don’t care if @United compensates me, not even for the scooter rental. An apology would be nice, but I’m not expecting miracles. I’d just like them — or another airline, if they refuse — to assure me I’ll be allowed to bring my mobility device with me the next time I fly."}, {"661d": "—"}, {"bdaa": "Note: the comments appearing below may say “recommended by Trey Harris (author)”. That’s just how Medium notates comments that I’ve released for public display. “Recommended” does not mean “endorses” or “agrees with”, merely that I think they’re interesting takes — some of which I disagree with. There haven’t been many noxious comments here (yet) — thank you! — but I may “recommend” some of those just so you can see the tone of some of these remarks I’ve been getting in forms I can’t so easily reshare."}, {"fdd0": "Update: On request, I’ve added links to Amazon’s product page for the Segway miniPro. Full disclosure: it’s my Associates link, so if you buy one (or anything else in the same session) using that link, I may get a small percentage. Feel free to load amazon.com manually and search if you’d prefer."}, {"b529": "¹ ^ United’s policy as linked says there’s “no watt hour limit” for non-collapsible devices specifically, but even if this were the most applicable paragraph—and I’m not sure that’s the case—the miniPro doesn’t “collapse”; the steering stalk easily unlatches for removal so it fits in an overhead bin."}, {"6af7": "² ^ Update, 2017–04–14 13:49 EDT: I originally cut for brevity here, but have gotten some replies on this point, so let me expand on it. Veteran cruisers know you don’t book the last possible flight before a sailing, and we hadn’t: it was the last flight of the evening before, and we had a hotel room in San Diego. The first two flights the next morning could get us there before sailing. But at that point, we had no reason to believe United would change its mind, so we needed to get to San Diego in time to buy or rent a new mobility device and get it to the port before sailing. No later flight would give us that time— we barely made it as it was."}], "content": "United Airlines made me ABANDON my mobility device at the gate before my honeymoon I did everything right, according to both United and TSA’s disability policies. The TSA told United it was OK. But that still didn’t ensure I could travel with the device that lets me get around. And it didn’t save my honeymoon from near-ruin when I was threatened with arrest. Last month, @United Airlines made me abandon my previously-approved, DOT & TSA-allowed mobility device. At the gate at Newark Liberty airport. On the way to my honeymoon cruise. I’d done my research before trying to take it. I’d called United’s Special Needs desk well before the flight. I explained: I have spondylitis, a type of autoimmune spinal arthritis. My symptoms vary wildly from day to day but most often I have trouble walking, but can stand okay, so I use a Segway miniPro (@SegwayInc) & cane. They asked about the device’s specs and gave me what sounded like the official OK. The Special Needs desk rep said I could pre-board and place it in the overhead — it easily fits with the steering bar removed, and my husband can lift it. They said they’d annotated my itinerary, and told me to call them back if I had “any trouble boarding.” The United rep then transferred me to the @TSA disability services desk to get the OK from them as well; TSA made a notation and told me who to contact if we had any trouble getting through security. TSA then sent me an email to confirm. We thought everything was taken care of. Boy, were we wrong. JoCoCruise 2017 homepage (https://jococruise.com/) We’d been looking forward to this day for nearly a year. On Friday, March 3, we headed to Newark Liberty airport for our flight to San Diego, where we’d embark on the JoCo Cruise — which some have described as a 7-day floating Comic-con/music festival. Some of my and my new husband Connor’s favorite podcasters, musicians, authors, and artists would be there. We would have been excited even if this hadn’t also just so happened to be our honeymoon. We got to the airport, checked in, and I rode the Segway to security and put it through the X-ray (TSA got the memo, apparently), took it to gate, and notified the gate agent we needed preboarding. At gate call, we were first in line, but they said we had to wait while they “checked on something”. We waited while pre-boarding concluded, but then I told my husband to go ahead and board (we had first-class tickets — it was our honeymoon, remember — so he had boarding priority even without me), in order to save overhead room for the Segway with a bag. I waited as they finished priority boarding and had proceeded through the next couple boarding groups, then the agent said I couldn’t carry it on, and I couldn’t gate check it, because it “wasn’t allowed”. I asked if they’d seen that notation in my itinerary. They said they had, and it indeed showed my prior call. But they said it read: “passenger was advised he would NOT be allowed to board with device, and the device will not have to be checked, provided he can place device in overhead without crew assistance. Transferred passenger to TSA for clearance of device through security.” It seemed obvious that the “not” there was a typo — the rest of the annotation doesn’t make any sense otherwise! I tried to explain that logic to them, but they were unyielding. So I called the Special Needs desk and the rep reviewed the record and agreed, that was just a typo, I could carry it on. I handed my phone to the agent. “We don’t allow hoverboards, they’re fire risks… We don’t even allow Samsung phones, we definitely won’t allow that.” After speaking to the rep, the gate agent said a “manager” had to decide. We waited a bit—by this time, everyone in the gate area had boarded—then the manager came and said no. “We don’t allow hoverboards, they’re fire risks.” I explained that it’s a Segway, not a hoverboard, it’s UL-certified for fire safety (with a hologram-seal certification on bottom stating this — I showed it to them), and one has never spontaneously combusted like those cheap hoverboards everyone was buying a couple years ago did. You could buy one on Amazon, even after they announced they wouldn’t sell hoverboards anymore. The manager was unswayed. “We don’t even allow Samsung phones, we definitely won’t allow that.” (I did not point out that I hadn’t seen anyone asked to show their phone at the gate, and so how did he know there wasn’t a Samsung phone on board?) I got my iPad out where I’d pre-loaded the regs from United’s own website and showed them the relevant passages: “no watt hour limit” for such sealed permanent batteries¹, “Segways” for mobility purposes were specifically mentioned along with wheelchairs, scooters, etc. “TSA has no problem with it.” He conferred with the TSA manager, who repeated, “TSA will allow.” The manager tried to make it TSA’s problem. “I don’t know why they let you through security, TSA doesn’t allow these.” So I asked for the duty manager TSA’s disability line told me to ask for. He shortly arrived and succinctly gave his judgment: “TSA has no problem with it.” The United manager scowled, and said the captain must decide. My husband returned from the plane, saying there was space saved in the overhead for it. The captain came to the gate, I explained the situation and showed him the iPad, told him it’s our honeymoon and we had a cruise ship to catch, and he said “don’t worry, we’ll figure this out,” warmly — I thought he was on our side. He conferred with the TSA manager, who repeated, “TSA will allow.” The captain returned to plane without speaking to us, and I think I’m all set, so we head to the jetway — and got stopped again. At this point I got a phone notification from one of my travel apps (not United’s) — the flight’s now delayed 10 minutes (boarding began on-time). The reason given: “a passenger disturbance”. They’re just holding my husband and me there, and making preps to push off — with our luggage, including carry-ons, on the plane! I’m then told that the captain has made the decision NOT to allow it, and has “final authority”. I ask what can I do — gate-check it? No, it’s not being allowed on the plane period, cabin or cargo. Can we book another flight while we argue our case? No — no flight will arrive in time for our ship departure.² “What if I just left it right here,” in front of the gate — “will you let us board without it?” No time to get the Segway home, or to get a friend to pick it up; no way to store it. Connor even tried without success to get an agent going off-duty to just take it to lost and found. Finally, as they’re about to close the doors (were they really going to push off with all our things onboard?), I pointed to it and said “what if I just left it right here,” in front of the gate — “will you let us board without it?” The gate agent grumbles that we could’ve done that at the start without all this trouble, and then lets us board — me hobbling on my cane down the jetway. We take off, and my honeymoon starts with me sobbing for an hour, my husband consoling me. I felt humiliated, like all the passengers blamed me for the delay. (One passenger a few rows back was grousing loudly, “entitled idiot thinks he can bring a hoverboard onto an airplane”.) I assumed the Segway — a device that’s been essential to me for much of the last year I’ve had it — is lost. I didn’t know how I’d get around onboard the ship and on excursions. Before I had the Segway, I’d have at least brought crutches on a trip like this, maybe a wheelchair if my symptoms were bad enough. Now I had nothing but a cane. When we arrived in San Diego, we were able to rent a scooter for several hundred dollars (including a last-minute surcharge). Compared to the Segway — which is nimble, light, can go anywhere I can except stairs, and is stable and safe — this thing was miserable. It was clunky, heavy, and dangerous. Let me quickly explain the Segway. You’ve probably seen the big ones used by tourists and mall cops the world over. The miniPro (available on Amazon) is the same idea, but smaller, lighter, much less expensive — and, in almost every way, better. Ninebot by Segway, http://www.segwayminipro.com/ When you turn it on, it stands straight up, balancing itself. A telescoping handle pops out the top so you can guide it around when you aren’t riding it. You can step on with either foot (I do this with the help of my cane), and it beeps to let you know it’s now balancing you; you step fully onto it. Then, when you lean forward, it goes forward; lean back, it stops and then goes backwards. Those cheap “hoverboards” from the 2015 craze required you to steer by shifting your weight from your left foot to your right. In a way, they do steering the same way the Segway does throttle. But the Segway ignores changes in side-to-side lean — I couldn’t use it otherwise, since one foot or the other is usually bothering me. Instead, you steer it by putting gentle pressure on a kneebar. The more you press, the quicker you turn. So I can use it, even if I can put little to no weight on one side. Compared to many other mobility options like that scooter rental, the Segway’s control is a) intuitive, b) analog, and c) exquisite. Let me explain: INTUITIVE: I’ve let friends try it. I’ve let friends’ kids try it. I’ve let people on the sidewalk try it. I’ve even once — carefully!—let a stranger I met on the street, who had a similar form of arthritis to mine and was walking with crutches, give it a try. It feels weird for the first ten or fifteen seconds; people tend to rock back and forth a bit, so I offer them my arm while they get used to it. Then your brain clicks, and you stop “driving” it. Within minutes, you stop “riding” it. You just go where you want to go. Like walking, you don’t think about the mechanics; you just think about what you want to do, and it does it. If an obstacle suddenly appears — a door opens in front of you, someone walking ahead stops abruptly to pick up something they’ve dropped — your natural startle reflex, to straighten up and lean back — stops you, nearly instantly. When I’ve had friends’ kids try it, after they get the hang of it and are zooming around happily, I tell them to try passing where I’m standing at full speed. Then, at the last moment, I step in front of them and put out a hand. They stop as quickly, as automatically, and with as little danger to either of us as if they were walking by and I’d done the same. The point is, this thing is safe. ANALOG: At full-tilt, the Segway goes up to about 13 mph. I very, very rarely go that fast. I just match whatever walking speed I need to for the people around me. I’ve gotten more comments from onlookers in New York City amazed how slowly I can go, creeping around Times Square throngs. I can go any speed I want. EXQUISITE: The precision I have is hard to describe, and for people around me who haven’t seen one before, it can be hard to believe (particularly when I tell them it didn’t take practice). I can do a 360° turn in place. I can back out of a corner, turn, and continue without a stop. (When I turn it on after it’s been propped against a wall while I’ve been sitting, I don’t even bother to guide it away from the wall; I just hop on, turn in place, and ride away.) I can stay in place talking to someone for minutes. (Its battery life is many hours with normal use, and it uses “regenerative braking”, meaning rather than traditional brakes, it just sends power back to the battery to stop.) I can navigate a narrow NYC drugstore with a basket, go through the checkout line, pay, and leave without stepping off. Its width is less than my own elbow-to-elbow, so anywhere I can go, it can go. I have to find wheelchair ramps and elevators, but besides that I can pretty much go anywhere. And when I run into a curb without a ramp, its under-30-pound weight makes it possible to just step off and lift it up the curb. I went to a conference last December with the Segway. It was just like being able-bodied — I could mingle at cocktail parties, navigate through densely-packed tables, go through the buffet line, carry drinks. It was thrilling and freeing. It was worlds better than crutches, even my expensive custom set — my hands were free, I didn’t have to watch where I planted them, and I wasn’t exhausted at the end of the day. This scooter I’d just rented was nothing like that. I felt humiliated and burdensome, again and again. The scooter was clunky as hell. It was the kind you see on commercials and in grocery stores: one front wheel connected to a tiller, two back wheels, with a cushy chair mounted on a big platform in between. It had handlebars with a lever in the middle. The lever had basically three speeds: forward, stop, and reverse. There was a dial in the middle you needed a second hand for to control the speed. But it wasn’t natural to hold on to it all the time, so it tended to be something I’d adjust when circumstances changed. A fancier scooter than the rental, but same basic idea. (©Zdlpwebb CC-BY SA 4.0) Unfortunately, it was hard to remember I didn’t have any analog control with that drive lever. To get over the door jam into my cabin, I had to have the throttle dialed up pretty high — but then I needed to remember to turn the dial way down once I’d cleared it, otherwise I’d crash headlong into the sofa. Which I did, repeatedly. And I ran over my husband’s foot at least twice doing just that. The obvious thing — letting go of the pressure on the lever like it was a gas pedal — did nothing to slow it down until it would suddenly stop. I needed help with doors. I couldn’t turn around in the narrow ship passageways — if I overshot my destination, I had to continue all the way to the next bank of elevators and turn around. I never mastered turning in reverse. It had a basket I could carry things in, but I needed both hands to drive it, so even carrying a drink ten feet or getting my own food was impossible, or something I’d have to hobble on my cane to do. All week, I felt like a burden on my husband and an inconvenience to other passengers and the crew. I kept making other passengers miss elevators, because I couldn’t get out and clear fast enough before the doors shut. Places with two or three steps — places I could have easily stepped off the Segway and guided it manually over — were insurmountable obstacles with the scooter’s 150-pound weight. A couple times, I “turtled” it going over a hatchway ramp, both its front and rear wheels in the air. It was so heavy that the only way I could get it free the time this happened and I was alone was to get off it, put all my weight on the chair back with my elbows, turn the throttle to max and hit the drive button so it would jump over— very nearly crushing my fingers against a bulkhead in the process. I never felt safe with the thing. When I’m around small children with the Segway, I’m careful—but only to avoid startling them or their parents, I’ve never had the slightest worry of hurting them. On the scooter, I had a couple close calls with children too little to see in my blind spot that left me shaken. We couldn’t go on excursions we would have been able to with the Segway. A lot of excursions can handle someone with a mobility device they can lift themselves, but very few had the people or equipment to deal with a 150-pound vehicle. And “tendering” — getting to shore by way of little shuttle boats in ports that can’t accommodate huge ships — was such an ordeal, dealing with winches and tiny service elevators I had to use alone — we just stayed on the ship once, giving up our only chance for a lay on the beach. It was just too much trouble. (I can and do hold the Segway in my lap in taxicabs.) It was just an awful experience. I needed help for everything. One night we found the handicapped spot in the ship’s main theater, only to find the handicapped symbol on the floor covered with chairs the next night; I had to ask people to give up their seats, and then move them aside for me! I felt humiliated and burdensome, again and again. I don’t want to be overly gloomy, or pretend my honeymoon wasn’t any fun at all. The @JoCoCruise was fantastic otherwise, and the staff were extremely helpful. Performers I met like @JeanGreasy, @QuelleChris, @RebeccaSugar & others were sympathetic and outraged when they heard about this. I have no idea how some people heard about it, but strangers frequently stopped me to tell me how distressed they were about what had happened at the airport. I started to feel better, like this was just one of those “nightmare honeymoons” that couples talk about fondly decades later as something that helped them grow closer. Then, about halfway through the cruise, my cellphone briefly connected for the first time since we’d left San Diego. I might be arrested on arrival at EWR. I had a series of progressively more ominous voicemails saying I had “abandoned a hazardous material at an international airport”, which was a crime, and could be held “criminally and civilly liable”. @HALcruises staff were helpful, and generously let me use their phones and Internet for free. But from a distance, all I could find out was that the Segway had been “contained” by a hazmat team, that I might owe them lots of money for its disposal, and I might be arrested on arrival at EWR. I spent the rest of cruise terrified and stressed out. My husband got me through it; I love him so much. The other cruisers were supportive, too. Jean Grae and Quelle Chris were both particularly great; I’d never met them before, but they were checking in on me regularly by the end of the cruise. When we docked in San Diego, the scooter company took the scooter from our cabin before we disembarked — so we had to call for a manual wheelchair. I’m not used to wheelchairs, and my husband had to handle all our luggage; going down a ramp heading towards the gangway I gained too much speed, and took a spill over some stairs. I was just scraped and winded, but it was very scary — probably more for my husband than for me. (It’s really okay, honey. You did great and I love you.) Someone who saw this got a HAL crewman (the ship’s IT guy!) who pushed me the rest of the way — which was a good thing, too, because we had to detour across the entire ship to get to a working elevator. We’d planned a day in San Diego, but with my mobility now limited to a cane, we just went to the movies instead. We got on our flight home, arrived in EWR — and, glory be!, no cops to greet me! We even got the Segway back. (The baggage desk crew seemed to know we had been wronged, I caught one whispering to another, incredulously, “but those are allowed!”) I’m not expecting miracles. I’d just like them — or another airline, if they refuse — to assure me I’ll be allowed to bring my mobility device with me the next time I fly. I’ve since done more research and can find no reason whatsoever that this should have happened. I did everything I was supposed to. I had the policies and regulations behind me. I’ve sent a letter—a real, paper letter, since I hear that gets better results—to United Airlines, but so far have heard nothing. Meanwhile, we’ve signed up for next year’s @JoCoCruise. A do-over, perhaps — but I think it shows how great the cruise is that we’re already set to try again. I don’t care if @United compensates me, not even for the scooter rental. An apology would be nice, but I’m not expecting miracles. I’d just like them — or another airline, if they refuse — to assure me I’ll be allowed to bring my mobility device with me the next time I fly. — Note: the comments appearing below may say “recommended by Trey Harris (author)”. That’s just how Medium notates comments that I’ve released for public display. “Recommended” does not mean “endorses” or “agrees with”, merely that I think they’re interesting takes — some of which I disagree with. There haven’t been many noxious comments here (yet) — thank you! — but I may “recommend” some of those just so you can see the tone of some of these remarks I’ve been getting in forms I can’t so easily reshare. Update: On request, I’ve added links to Amazon’s product page for the Segway miniPro. Full disclosure: it’s my Associates link, so if you buy one (or anything else in the same session) using that link, I may get a small percentage. Feel free to load amazon.com manually and search if you’d prefer. ¹ ^ United’s policy as linked says there’s “no watt hour limit” for non-collapsible devices specifically, but even if this were the most applicable paragraph—and I’m not sure that’s the case—the miniPro doesn’t “collapse”; the steering stalk easily unlatches for removal so it fits in an overhead bin. ² ^ Update, 2017–04–14 13:49 EDT: I originally cut for brevity here, but have gotten some replies on this point, so let me expand on it. Veteran cruisers know you don’t book the last possible flight before a sailing, and we hadn’t: it was the last flight of the evening before, and we had a hotel room in San Diego. The first two flights the next morning could get us there before sailing. But at that point, we had no reason to believe United would change its mind, so we needed to get to San Diego in time to buy or rent a new mobility device and get it to the port before sailing. No later flight would give us that time— we barely made it as it was. ", "name": "2", "child": "2_1\t2_2\t2_3\t2_4\t2_5\t2_6\t2_7\t2_8\t2_9\t2_10\t2_11\t2_12\t2_13\t2_14\t2_15\t2_16\t2_17\t2_18\t2_19\t2_20\t2_21\t2_22\t2_23\t2_242_1\t2_2\t2_3\t2_4\t2_5\t2_6\t2_7\t2_8\t2_9\t2_10\t2_11\t2_12\t2_13\t2_14\t2_15\t2_16\t2_17\t2_18\t2_19\t2_20\t2_21\t2_22\t2_23\t2_242_1\t2_2\t2_3\t2_4\t2_5\t2_6\t2_7\t2_8\t2_9\t2_10\t2_11\t2_12\t2_13\t2_14\t2_15\t2_16\t2_17\t2_18\t2_19\t2_20\t2_21\t2_22\t2_23\t2_242_1\t2_2\t2_3\t2_4\t2_5\t2_6\t2_7\t2_8\t2_9\t2_10\t2_11\t2_12\t2_13\t2_14\t2_15\t2_16\t2_17\t2_18\t2_19\t2_20\t2_21\t2_22\t2_23\t2_242_1\t2_2\t2_3\t2_4\t2_5\t2_6\t2_7\t2_8\t2_9\t2_10\t2_11\t2_12\t2_13\t2_14\t2_15\t2_16\t2_17\t2_18\t2_19\t2_20\t2_21\t2_22\t2_23\t2_242_1\t2_2\t2_3\t2_4\t2_5\t2_6\t2_7\t2_8\t2_9\t2_10\t2_11\t2_12\t2_13\t2_14\t2_15\t2_16\t2_17\t2_18\t2_19\t2_20\t2_21\t2_22\t2_23\t2_24", "timestamp": "Apr 13"}