{"parent": "", "title": "Use the Two-Hour Rule to Make Progress on Your Creative Projects", "author": "Charlie Gilkey", "sentences": [{"62e4": "Use the Two-Hour Rule to Make Progress on Your Creative Projects"}, {"7b0b": "Two hours is the perfect chunk of time to focus on a creative project and make some meaningful progress."}, {"9bdc": "Are you having trouble getting started with a creative project or figuring out how to keep momentum with it?"}, {"54b2": "One of the reasons people get stuck with creative projects is that they make a conscious or unconscious plan to spend a full day or week working on something. Reality check: most of us will never get full days to work on something, and when we do, we can’t work for that long anyway. Our creative energy won’t last that long."}, {"b447": "The flip side of the coin is that most creative, daring projects are hard to do in 15- and 30-minute chunks. Most projects like this have an engagement threshold that requires that you have enough time to set up and sink into the Flow. Since it’s frustrating to not finish and hard for most people to pick up where they left off, the natural response is that we don’t start. Better to vacuum, check email, or stay up to date with the YouTube meme of the day. (Because such things matter.)"}, {"e28e": "Lastly, it’s often very hard to tell how much to chunk your projects down into smaller pieces, when you do think about chunking them down."}, {"ccab": "Enter the Two-Hour Rule: chunk your creative work down into two-hour increments."}, {"0d4c": "It takes time to figure out your chunks, but it’s worth it."}, {"347e": "Two hours is long enough that you can make significant progress, but not so long that it becomes a Thing to manage."}, {"c00b": "Here are a few reasons why the Two-Hour Rule works:"}, {"1d93": "The next time you’re thinking about getting started on a project or wondering how to chunk it down, use the Two-Hour Rule to make it more approachable. Sneaky tip: sometimes you have to give yourself two hours of time, at the same time that you tell yourself that you have to do only 10 minutes of whatever needs to be done. More often than not, you’ll create for two hours if you give yourself the boundaries on both sides."}, {"44a2": "The Two-Hour Rule works well unless, of course, you’re shuffling or lying. Watch out for those two as well."}, {"88d3": "Oh, and one last thing. Our planners have this line of thinking already baked in. Happy planning and project-completing."}, {"f1a9": "This story was originally published on ProductiveFlourishing.com as Use the Two-Hour Rule to Make Progress on Your Creative Projects."}], "content": "Use the Two-Hour Rule to Make Progress on Your Creative Projects Two hours is the perfect chunk of time to focus on a creative project and make some meaningful progress. Are you having trouble getting started with a creative project or figuring out how to keep momentum with it? One of the reasons people get stuck with creative projects is that they make a conscious or unconscious plan to spend a full day or week working on something. Reality check: most of us will never get full days to work on something, and when we do, we can’t work for that long anyway. Our creative energy won’t last that long. The flip side of the coin is that most creative, daring projects are hard to do in 15- and 30-minute chunks. Most projects like this have an engagement threshold that requires that you have enough time to set up and sink into the Flow. Since it’s frustrating to not finish and hard for most people to pick up where they left off, the natural response is that we don’t start. Better to vacuum, check email, or stay up to date with the YouTube meme of the day. (Because such things matter.) Lastly, it’s often very hard to tell how much to chunk your projects down into smaller pieces, when you do think about chunking them down. Enter the Two-Hour Rule: chunk your creative work down into two-hour increments. It takes time to figure out your chunks, but it’s worth it. Two hours is long enough that you can make significant progress, but not so long that it becomes a Thing to manage. Here are a few reasons why the Two-Hour Rule works: The next time you’re thinking about getting started on a project or wondering how to chunk it down, use the Two-Hour Rule to make it more approachable. Sneaky tip: sometimes you have to give yourself two hours of time, at the same time that you tell yourself that you have to do only 10 minutes of whatever needs to be done. More often than not, you’ll create for two hours if you give yourself the boundaries on both sides. The Two-Hour Rule works well unless, of course, you’re shuffling or lying. Watch out for those two as well. Oh, and one last thing. Our planners have this line of thinking already baked in. Happy planning and project-completing. This story was originally published on ProductiveFlourishing.com as Use the Two-Hour Rule to Make Progress on Your Creative Projects. ", "name": "201", "child": "201_1\t201_2\t201_3\t201_4\t201_5\t201_6\t201_7\t201_8\t201_9201_1\t201_2\t201_3\t201_4\t201_5\t201_6\t201_7\t201_8\t201_9", "timestamp": "Apr 14"}