{"parent": "", "title": "How To Focus Better: Manage Your Attention (not your time)", "author": "Darius Foroux", "sentences": [{"26a6": "How To Focus Better: Manage Your Attention (not your time)"}, {"f14e": "How many minutes of undisturbed work do you get done on an average day?"}, {"64eb": "10, 20, maybe 50 minutes? If you think that sounds low, just examine your life. Most of us can’t go undisturbed for more than 10 minutes."}, {"97b1": "We’re all so connected that it becomes impossible to find time to focus on yourself and your work. Some of us get hundreds of notifications and messages per day."}, {"7161": "You find yourself answering a Whatsapp message here, an email there, talk to a friend, and then talk to a colleague on Slack. Most people’s days consist of answering to notifications"}, {"caac": "In a way, you’re held captive by others."}, {"42fe": "So no wonder that many of us ask: “How do I focus better?”"}, {"8556": "When new subscribers join my newsletter, I always ask them about their challenges. And the majority who answers, mentions something that’s related to focus."}, {"aaa8": "In fact, when I did a survey on my newsletter last year, 28% said that their biggest challenge is related to focus and time management. Here are just two examples of what readers mentioned to me:"}, {"0565": "These questions have been on my mind in the past too. And you know what I found? Distractions are not some 21st-century first world problems."}, {"64b0": "Distractions have always been a part of life. It has nothing to do with your smartphone or YouTube, online shopping, Instagram, or any other thing you want to blame for your lack of focus. It’s human nature. We love to be busy."}, {"1484": "Socrates, one of the founders of Western Philosophy, warned us 2400 years ago:"}, {"cca5": "“Beware the barrenness of a busy life.”"}, {"2eab": "Busyness is not a good thing. Because busyness and distractions go hand in hand. Want no distractions? Move to the woods. But that’s not how life works. Plus, modern day life is too good."}, {"2014": "Seneca, one of the most famous Stoic philosophers, said this in Letters From A Stoic:"}, {"61db": "“There is never a time when new distraction will not show up.”"}, {"2588": "There are always distractions. So you better train yourself to manage your attention. Not your time. Because that’s the biggest mistake people make."}, {"f424": "We falsely believe that we can manage time. But time can’t be managed. The only thing you control is your attention."}, {"b6e2": "And in my latest podcast episode, I talk about how I manage my attention. Here’s what I talk about:"}, {"560c": "Listen to the episode:"}, {"a9a7": "And remember: Focus determines the quality of your life. No focus means no control of your attention. And no control means frustration. We all know what frustration leads to."}, {"11ed": "Start managing your attention. Not your time."}, {"bd16": "Thanks for reading! This article was originally published on dariusforoux.com."}], "content": "How To Focus Better: Manage Your Attention (not your time) How many minutes of undisturbed work do you get done on an average day? 10, 20, maybe 50 minutes? If you think that sounds low, just examine your life. Most of us can’t go undisturbed for more than 10 minutes. We’re all so connected that it becomes impossible to find time to focus on yourself and your work. Some of us get hundreds of notifications and messages per day. You find yourself answering a Whatsapp message here, an email there, talk to a friend, and then talk to a colleague on Slack. Most people’s days consist of answering to notifications In a way, you’re held captive by others. So no wonder that many of us ask: “How do I focus better?” When new subscribers join my newsletter, I always ask them about their challenges. And the majority who answers, mentions something that’s related to focus. In fact, when I did a survey on my newsletter last year, 28% said that their biggest challenge is related to focus and time management. Here are just two examples of what readers mentioned to me: These questions have been on my mind in the past too. And you know what I found? Distractions are not some 21st-century first world problems. Distractions have always been a part of life. It has nothing to do with your smartphone or YouTube, online shopping, Instagram, or any other thing you want to blame for your lack of focus. It’s human nature. We love to be busy. Socrates, one of the founders of Western Philosophy, warned us 2400 years ago: “Beware the barrenness of a busy life.” Busyness is not a good thing. Because busyness and distractions go hand in hand. Want no distractions? Move to the woods. But that’s not how life works. Plus, modern day life is too good. Seneca, one of the most famous Stoic philosophers, said this in Letters From A Stoic: “There is never a time when new distraction will not show up.” There are always distractions. So you better train yourself to manage your attention. Not your time. Because that’s the biggest mistake people make. We falsely believe that we can manage time. But time can’t be managed. The only thing you control is your attention. And in my latest podcast episode, I talk about how I manage my attention. Here’s what I talk about: Listen to the episode: And remember: Focus determines the quality of your life. No focus means no control of your attention. And no control means frustration. We all know what frustration leads to. Start managing your attention. Not your time. Thanks for reading! This article was originally published on dariusforoux.com. ", "name": "208", "child": "208_1\t208_2\t208_3\t208_4\t208_5\t208_6\t208_7\t208_8\t208_9\t208_10\t208_11\t208_12\t208_13\t208_14\t208_15\t208_16208_1\t208_2\t208_3\t208_4\t208_5\t208_6\t208_7\t208_8\t208_9\t208_10\t208_11\t208_12\t208_13\t208_14\t208_15\t208_16", "timestamp": "Apr 5"}