{"parent": "", "title": "7 Fiction Books That Change The Way You Think", "author": "Darius Foroux", "sentences": [{"b108": "7 Fiction Books That Change The Way You Think"}, {"dfd2": "Over the past three years, I’ve read more than 200 non-fiction books. I’ve dived into Philosophy, Marketing, Productivity, Evolution, History, Biographies, and many other books you read to learn something."}, {"5734": "Because that’s the main reason most of us read non-fiction, right? You read a book to get something out of it. And after reading a lot of similar books, you start noticing patterns."}, {"4721": "One thing I’ve noticed is that non-fiction books of the past ten years are not boring to read. I think Malcolm Gladwell played a huge part in that development. His book The Tipping Point, published in 2000, also seems like a tipping point for non-fiction books."}, {"828f": "Non-fiction books of today are equally entertaining to read as fiction books. That’s also because they’re forced to be more interesting — books have a lot of competition these days."}, {"bde1": "We live in a world where we all expect to be entertained all the time. Entertainment is everywhere. Just look at the options you have: Movies, tv shows, funny cat videos, Snapchat Stories, articles, you name it."}, {"8597": "But to me, reading a good book beats everything. Also, books can truly change the way you think. Especially fiction books because you don’t expect them to change your life or anything."}, {"d960": "I’ve made a list of 7 fiction books that have inspired me. You won’t find the cliché books on this list. We all know The Catcher In The Rye, Lord Of The Flies (I really hate that book, it’s so obvious), To Kill A Mocking Bird, and so forth."}, {"f98b": "No, I’ve tried to create a list with less familiar books. I hope you pick up at least one of them."}, {"30c7": "Maybe you’ve read some of these books. Maybe not. It doesn’t matter. And maybe they’ll change the way you think. Or maybe not."}, {"d16e": "Let us remind ourselves that it’s okay to ‘just’ read a book. Reading a good book is like having a conversation with a friend. J.D. Salinger said it best:"}, {"8613": "“What really knocks me out is a book that, when you’re all done reading it, you wish the author that wrote it was a terrific friend of yours and you could call him up on the phone whenever you felt like it. That doesn’t happen much, though.”"}, {"f320": "Not every single book has to make you a millionaire, turn you into a life hacker, or the best version of yourself."}, {"41e2": "So, grab a book. Sit back. Turn off your phone. And READ. Not because it will improve your life. But because it’s food for your mind."}, {"8e97": "P.S. What’s your favorite fiction book? Feel free to share it in the comments."}, {"f935": "Thanks for reading! This article was originally published on dariusforoux.com."}], "content": "7 Fiction Books That Change The Way You Think Over the past three years, I’ve read more than 200 non-fiction books. I’ve dived into Philosophy, Marketing, Productivity, Evolution, History, Biographies, and many other books you read to learn something. Because that’s the main reason most of us read non-fiction, right? You read a book to get something out of it. And after reading a lot of similar books, you start noticing patterns. One thing I’ve noticed is that non-fiction books of the past ten years are not boring to read. I think Malcolm Gladwell played a huge part in that development. His book The Tipping Point, published in 2000, also seems like a tipping point for non-fiction books. Non-fiction books of today are equally entertaining to read as fiction books. That’s also because they’re forced to be more interesting — books have a lot of competition these days. We live in a world where we all expect to be entertained all the time. Entertainment is everywhere. Just look at the options you have: Movies, tv shows, funny cat videos, Snapchat Stories, articles, you name it. But to me, reading a good book beats everything. Also, books can truly change the way you think. Especially fiction books because you don’t expect them to change your life or anything. I’ve made a list of 7 fiction books that have inspired me. You won’t find the cliché books on this list. We all know The Catcher In The Rye, Lord Of The Flies (I really hate that book, it’s so obvious), To Kill A Mocking Bird, and so forth. No, I’ve tried to create a list with less familiar books. I hope you pick up at least one of them. Maybe you’ve read some of these books. Maybe not. It doesn’t matter. And maybe they’ll change the way you think. Or maybe not. Let us remind ourselves that it’s okay to ‘just’ read a book. Reading a good book is like having a conversation with a friend. J.D. Salinger said it best: “What really knocks me out is a book that, when you’re all done reading it, you wish the author that wrote it was a terrific friend of yours and you could call him up on the phone whenever you felt like it. That doesn’t happen much, though.” Not every single book has to make you a millionaire, turn you into a life hacker, or the best version of yourself. So, grab a book. Sit back. Turn off your phone. And READ. Not because it will improve your life. But because it’s food for your mind. P.S. What’s your favorite fiction book? Feel free to share it in the comments. Thanks for reading! This article was originally published on dariusforoux.com. ", "name": "209", "child": "209_1\t209_2\t209_3\t209_4\t209_5\t209_6\t209_7\t209_8\t209_9\t209_10\t209_11\t209_12\t209_13\t209_14\t209_15\t209_16\t209_17\t209_18\t209_19\t209_20\t209_21\t209_22\t209_23\t209_24\t209_25209_1\t209_2\t209_3\t209_4\t209_5\t209_6\t209_7\t209_8\t209_9\t209_10\t209_11\t209_12\t209_13\t209_14\t209_15\t209_16\t209_17\t209_18\t209_19\t209_20\t209_21\t209_22\t209_23\t209_24\t209_25", "timestamp": "Apr 3"}