{"parent": "", "title": "Stop Spending So Much Time In Your Head", "author": "Darius Foroux", "sentences": [{"06ad": "Stop Spending So Much Time In Your Head"}, {"fa4b": "99% of all thoughts are useless but they’re still controlling your life."}, {"e824": "I know something about you without knowing you. I bet you spend A LOT of time in your head."}, {"2b54": "You know, thinking, worrying, stressing, freaking out — call it whatever you want. I call it a preoccupied mind. And with what?"}, {"34bb": "99% of your thoughts are useless. William James put it best:"}, {"5534": "“A great many people think they are thinking when they are merely rearranging their prejudices.”"}, {"1fe5": "All my life I’ve been obsessed with practical things. Practical philosophy, practical knowledge, practical books, practical work, and practical advice."}, {"21e6": "That idea comes from Pragmatism, a philosophical tradition that started in the 19th century in America. Charles Sanders Peirce, who was a Harvard professor, is considered as the “father of Pragmatism.”"}, {"5675": "But it was William James, a trained physician turned philosopher, who really defined the philosophy."}, {"098e": "About thoughts, worry, and stress, William James says:"}, {"feec": "“The greatest weapon against stress is our ability to choose one thought over another.”"}, {"5408": "Pragmatism believes that the mind is a tool. Your mind should work for you, not against you. People who don’t master their mind, don’t believe it’s possible."}, {"ce39": "They say: “I can’t help but thinking these things.”"}, {"7bbc": "Well, you can with enough practice. It’s a skill."}, {"96b0": "In other words: You have the ability to decide what you think. Or, you can choose NOT to think."}, {"6a5e": "And that is one of the most important and most practical things you can learn in life. Before I learned that skill, I would spend hours and hours inside my head."}, {"4207": "Just think about how much you think."}, {"d8a6": "And the list goes on. That is all REAL shit. That’s stuff people tell me when I ask them what they worry about."}, {"6fba": "You know what those thoughts do to you? Guilt, anger, suffering."}, {"26c3": "I just have one question for you: What’s the practical use of your thoughts?"}, {"d6d9": "Yes? I’m waiting. Still no answer? Exactly."}, {"e050": "Thoughts have no use. 99% of them that is."}, {"1ee8": "Which thoughts are useful?"}, {"1bec": "That’s it. You can ignore every other thought."}, {"f1a2": "If you’re constantly thinking, it’s because you haven’t trained your mind yet. You HAVE to get out of your head."}, {"b51b": "If not, you go mental. Everyone will. No exception."}, {"c388": "Also, you’re probably thinking so much that you’re missing out of life. Did you notice the sunshine this morning when you woke up? Or the raindrops? Did you notice the smell of your coffee? Did you feel the texture of your cereals?"}, {"8e18": "If your answer is no, you definitely need to get out of your head. Stop thinking and start feeling."}, {"7535": "Now, you might think: “How do I train myself to stop thinking useless thoughts?”"}, {"5895": "Awareness."}, {"aa0c": "That’s where it starts. Every time you start drifting off, become aware of it. Just observe your brain. Step outside yourself and just observe the crazy shit you’re thinking about."}, {"4223": "Don’t judge. Don’t think you’re stupid. If you do that, you’re thinking again."}, {"ce6e": "No, what you want to do is say this to yourself: “Ah that’s a cute thought. Now, let’s get back to reality.”"}, {"77d0": "“If you can change your mind, you can change your life.” ― William James"}, {"99ba": "Are you back to reality? Do you feel your eyes reading the letters on your screen? Do you feel your phone in your hand? Are you thinking about how you’re going to apply this information to your life?"}, {"a4bb": "Great. You’re USING your mind, and it’s not the other way around. Now, keep using that brain of yours."}, {"a48e": "Because I’ll tell you this: It’s the most powerful tool on earth."}, {"7fb3": "Originally posted on dariusforoux.com."}], "content": "Stop Spending So Much Time In Your Head 99% of all thoughts are useless but they’re still controlling your life. I know something about you without knowing you. I bet you spend A LOT of time in your head. You know, thinking, worrying, stressing, freaking out — call it whatever you want. I call it a preoccupied mind. And with what? 99% of your thoughts are useless. William James put it best: “A great many people think they are thinking when they are merely rearranging their prejudices.” All my life I’ve been obsessed with practical things. Practical philosophy, practical knowledge, practical books, practical work, and practical advice. That idea comes from Pragmatism, a philosophical tradition that started in the 19th century in America. Charles Sanders Peirce, who was a Harvard professor, is considered as the “father of Pragmatism.” But it was William James, a trained physician turned philosopher, who really defined the philosophy. About thoughts, worry, and stress, William James says: “The greatest weapon against stress is our ability to choose one thought over another.” Pragmatism believes that the mind is a tool. Your mind should work for you, not against you. People who don’t master their mind, don’t believe it’s possible. They say: “I can’t help but thinking these things.” Well, you can with enough practice. It’s a skill. In other words: You have the ability to decide what you think. Or, you can choose NOT to think. And that is one of the most important and most practical things you can learn in life. Before I learned that skill, I would spend hours and hours inside my head. Just think about how much you think. And the list goes on. That is all REAL shit. That’s stuff people tell me when I ask them what they worry about. You know what those thoughts do to you? Guilt, anger, suffering. I just have one question for you: What’s the practical use of your thoughts? Yes? I’m waiting. Still no answer? Exactly. Thoughts have no use. 99% of them that is. Which thoughts are useful? That’s it. You can ignore every other thought. If you’re constantly thinking, it’s because you haven’t trained your mind yet. You HAVE to get out of your head. If not, you go mental. Everyone will. No exception. Also, you’re probably thinking so much that you’re missing out of life. Did you notice the sunshine this morning when you woke up? Or the raindrops? Did you notice the smell of your coffee? Did you feel the texture of your cereals? If your answer is no, you definitely need to get out of your head. Stop thinking and start feeling. Now, you might think: “How do I train myself to stop thinking useless thoughts?” Awareness. That’s where it starts. Every time you start drifting off, become aware of it. Just observe your brain. Step outside yourself and just observe the crazy shit you’re thinking about. Don’t judge. Don’t think you’re stupid. If you do that, you’re thinking again. No, what you want to do is say this to yourself: “Ah that’s a cute thought. Now, let’s get back to reality.” “If you can change your mind, you can change your life.” ― William James Are you back to reality? Do you feel your eyes reading the letters on your screen? Do you feel your phone in your hand? Are you thinking about how you’re going to apply this information to your life? Great. You’re USING your mind, and it’s not the other way around. Now, keep using that brain of yours. Because I’ll tell you this: It’s the most powerful tool on earth. Originally posted on dariusforoux.com. ", "name": "212", "child": "212_1\t212_2\t212_3\t212_4\t212_5\t212_6\t212_7\t212_8\t212_9\t212_10\t212_11\t212_12\t212_13\t212_14\t212_15\t212_16\t212_17\t212_18\t212_19\t212_20\t212_21\t212_22\t212_23\t212_24\t212_25212_1\t212_2\t212_3\t212_4\t212_5\t212_6\t212_7\t212_8\t212_9\t212_10\t212_11\t212_12\t212_13\t212_14\t212_15\t212_16\t212_17\t212_18\t212_19\t212_20\t212_21\t212_22\t212_23\t212_24\t212_25", "timestamp": "Aug 15, 2016"}