{"parent": "", "title": "Read This If You Want To Keep A Journal But Don’t Know How", "author": "Darius Foroux", "sentences": [{"030b": "Read This If You Want To Keep A Journal But Don’t Know How"}, {"69dc": "A journal is the best self-awareness tool there is."}, {"f8cc": "Just open any given site that publishes articles on personal growth, and you will find at least one article that says: Why Keeping A Journal Will Change Your Life."}, {"ba24": "Please stop it for goodness sake. We know it by now!"}, {"9da0": "When I talk to friends, or when I coach people, I always ask: “Do you keep a journal?”"}, {"1df3": "This probably won’t surprise you, but the answer is almost always “No.”"}, {"af2b": "And the funny thing is that everyone knows that they should keep one. But should is not enough. There are a lot of things that we should do—but we don’t do them."}, {"e1ba": "Why? We have no idea HOW to do them."}, {"6c5a": "It’s just like when you were in school. Do you remember all those times you had a question on your mind but you didn’t ask. You probably thought: “Maybe the teacher thinks I’m dumb.”"}, {"db20": "Well, this is exactly the same. We all think that journaling is easy so we don’t bother asking how you do it. It’s not easy, but it’s also not rocket science."}, {"b756": "Most people overcomplicate the act of journaling or putting your thoughts on paper. I think Ernest Hemingway put it best:"}, {"760c": "“My aim is to put down on paper what I see and what I feel in the best and simplest way.”"}, {"6ee1": "But how do you do that?"}, {"26a7": "First, get clear on your why."}, {"e8cb": "For me, there’s only one reason to keep a journal: To manage myself."}, {"c785": "That’s the only practical reason I can think off. Why else would you keep a journal? It’s not that my life is so interesting that I can ever sell it as a memoir. I’m no John Krakauer or Maya Angelou."}, {"8545": "No, I see journaling as a self-improvement tool. Nothing else."}, {"1391": "Most of us still see journaling as a hobby or something that we do for fun or to relax. Sure, those reasons might be true for some. But for most, there’s only one why: Self-improvement."}, {"e31c": "How do you expect to improve yourself if you don’t know yourself? You truly get to know the quality of your thoughts when you write them down."}, {"c1ac": "You can answer all these questions by reading your journal. Don’t know what to write? Here are 3 ideas."}, {"72cb": "1. Write about your activities."}, {"2553": "Just write what you’ve been doing. You can either do it in the morning or evening."}, {"5b88": "It doesn’t matter when you do, just try to write about what you’ve done during the past 24 hours. It’s not same as an activity log, something I wrote about recently."}, {"da3f": "When I journal my activities, I record what time I went to bed, what time I woke up, what I worked on, who I talked to, what book I read, etc."}, {"7e88": "When I lack inspiration or motivation, I just go through my journal and see when I was inspired, felt energized, or motivated. Then, I recreate those events."}, {"d9a3": "“Don’t trust your memory. When you listen to something valuable, write it down. When you come across something important, write it down.” — Jim Rohn"}, {"9202": "2. Write about what scares you."}, {"984b": "There’s no better way to address your worries than writing about them. If you worry about something, it seems way worse in your head."}, {"7667": "When you start writing down what you’re stressed about, you can start thinking about how you’re going to solve the problem that’s causing you stress in the first place."}, {"c659": "I’ve been journaling about my fears for a long time now. And it truly helps. If you want to read more about that process, check out this article I wrote a while back."}, {"179e": "“The act of writing is the act of discovering what you believe.” — David Hare"}, {"b6e3": "3. Write about your decisions."}, {"7e6a": "Use your journal as a feedback mechanism by second-guessing your own decisions. Making decisions is hard."}, {"6c1b": "For example:"}, {"df05": "Those are examples of big decisions. But you can also use it for all the small decisions in life."}, {"d06f": "Deep down, we kind of know the answers. We just don’t look deep enough."}, {"09e3": "Ask yourself a question and try to answer it by reasoning from multiple sides. What are the pros? What are the cons? What are the outcomes?"}, {"1a56": "The questions you can ask yourself are endless."}, {"66be": "There you have it. You see? It’s not complicated stuff."}, {"64c9": "Journaling is a very versatile tool. It helps you with your self-awareness, and it also helps you to improve yourself. If you’re serious about those things, a journal is a must."}, {"ffb4": "Now, all you have to do is open a new page in your physical journal, or a document in your digital journal, and start writing:"}, {"c3c7": "“Today is the first day of my daily journaling habit.”"}, {"6454": "There’s this weird thing—when you write things down, they become real. Start journaling and see it for yourself."}, {"5f1f": "Originally posted on dariusforoux.com."}, {"d7ca": "Still Curious?"}, {"e4cd": "Hey, I’m Darius Foroux and thank you for reading this article."}, {"56f6": "I research how to (1) overcome procrastination, (2) improve productivity, and (3) get things done."}, {"ba17": "Every Monday and Thursday I publish an article related to those 3 topics. You can also sign up for my free newsletter on DariusForoux.com to never miss an article."}, {"8f68": "Get my latest ebook “Procrastinate Zero” for free."}], "content": "Read This If You Want To Keep A Journal But Don’t Know How A journal is the best self-awareness tool there is. Just open any given site that publishes articles on personal growth, and you will find at least one article that says: Why Keeping A Journal Will Change Your Life. Please stop it for goodness sake. We know it by now! When I talk to friends, or when I coach people, I always ask: “Do you keep a journal?” This probably won’t surprise you, but the answer is almost always “No.” And the funny thing is that everyone knows that they should keep one. But should is not enough. There are a lot of things that we should do—but we don’t do them. Why? We have no idea HOW to do them. It’s just like when you were in school. Do you remember all those times you had a question on your mind but you didn’t ask. You probably thought: “Maybe the teacher thinks I’m dumb.” Well, this is exactly the same. We all think that journaling is easy so we don’t bother asking how you do it. It’s not easy, but it’s also not rocket science. Most people overcomplicate the act of journaling or putting your thoughts on paper. I think Ernest Hemingway put it best: “My aim is to put down on paper what I see and what I feel in the best and simplest way.” But how do you do that? First, get clear on your why. For me, there’s only one reason to keep a journal: To manage myself. That’s the only practical reason I can think off. Why else would you keep a journal? It’s not that my life is so interesting that I can ever sell it as a memoir. I’m no John Krakauer or Maya Angelou. No, I see journaling as a self-improvement tool. Nothing else. Most of us still see journaling as a hobby or something that we do for fun or to relax. Sure, those reasons might be true for some. But for most, there’s only one why: Self-improvement. How do you expect to improve yourself if you don’t know yourself? You truly get to know the quality of your thoughts when you write them down. You can answer all these questions by reading your journal. Don’t know what to write? Here are 3 ideas. 1. Write about your activities. Just write what you’ve been doing. You can either do it in the morning or evening. It doesn’t matter when you do, just try to write about what you’ve done during the past 24 hours. It’s not same as an activity log, something I wrote about recently. When I journal my activities, I record what time I went to bed, what time I woke up, what I worked on, who I talked to, what book I read, etc. When I lack inspiration or motivation, I just go through my journal and see when I was inspired, felt energized, or motivated. Then, I recreate those events. “Don’t trust your memory. When you listen to something valuable, write it down. When you come across something important, write it down.” — Jim Rohn 2. Write about what scares you. There’s no better way to address your worries than writing about them. If you worry about something, it seems way worse in your head. When you start writing down what you’re stressed about, you can start thinking about how you’re going to solve the problem that’s causing you stress in the first place. I’ve been journaling about my fears for a long time now. And it truly helps. If you want to read more about that process, check out this article I wrote a while back. “The act of writing is the act of discovering what you believe.” — David Hare 3. Write about your decisions. Use your journal as a feedback mechanism by second-guessing your own decisions. Making decisions is hard. For example: Those are examples of big decisions. But you can also use it for all the small decisions in life. Deep down, we kind of know the answers. We just don’t look deep enough. Ask yourself a question and try to answer it by reasoning from multiple sides. What are the pros? What are the cons? What are the outcomes? The questions you can ask yourself are endless. There you have it. You see? It’s not complicated stuff. Journaling is a very versatile tool. It helps you with your self-awareness, and it also helps you to improve yourself. If you’re serious about those things, a journal is a must. Now, all you have to do is open a new page in your physical journal, or a document in your digital journal, and start writing: “Today is the first day of my daily journaling habit.” There’s this weird thing—when you write things down, they become real. Start journaling and see it for yourself. Originally posted on dariusforoux.com. Still Curious? Hey, I’m Darius Foroux and thank you for reading this article. I research how to (1) overcome procrastination, (2) improve productivity, and (3) get things done. Every Monday and Thursday I publish an article related to those 3 topics. You can also sign up for my free newsletter on DariusForoux.com to never miss an article. Get my latest ebook “Procrastinate Zero” for free. ", "name": "214", "child": "214_1\t214_2\t214_3\t214_4\t214_5\t214_6\t214_7\t214_8\t214_9\t214_10\t214_11\t214_12\t214_13\t214_14\t214_15\t214_16\t214_17\t214_18\t214_19\t214_20\t214_21\t214_22\t214_23\t214_24\t214_25214_1\t214_2\t214_3\t214_4\t214_5\t214_6\t214_7\t214_8\t214_9\t214_10\t214_11\t214_12\t214_13\t214_14\t214_15\t214_16\t214_17\t214_18\t214_19\t214_20\t214_21\t214_22\t214_23\t214_24\t214_25", "timestamp": "Aug 18, 2016"}