{"parent": "", "title": "What Problems Do You Solve?", "author": "Darius Foroux", "sentences": [{"e06b": "What Problems Do You Solve?"}, {"7faa": "Last year I decided to start a podcast. I had no idea where to start, so like everyone else who needs information about a subject, I went to Google.com for some answers."}, {"e2f3": "And I searched for “how to start a podcast.” It wasn’t helpful. Google only confuses you. There’s too much information. And you have no clue how good that information is."}, {"9645": "Every time I use Google, I think of something my college professor told me a decade ago. We were once talking about the influence of Wikipedia on books, education, and knowledge in general."}, {"936c": "I remember that in 2007, Wikipedia made the top-ten list of the most popular websites. They had surpassed the New York Times. That was a big deal ten years ago. So I said something like: “Who needs books in the future if you have Wikipedia?”"}, {"6b04": "My college professor laughed. He said something like:"}, {"fee5": "“People think free information is a big deal. But it’s still free information. That means it’s either garbage or it only provides you piece of the puzzle.”"}, {"c53c": "That’s still true today. Most information out there is pretty useless. But fortunately, there are people like Paul Jarvis who share good quality information that’s useful."}, {"81cf": "And when he shared an article about podcasting last year, I was particularly happy with it. The article showed that starting a podcast is easy as long as you keep it simple."}, {"87ea": "I can’t remember the first time I read something from Paul. But I know that it was a few years ago — well before I started my own blog."}, {"c06c": "I only ran my business at the time and did some freelancing on the side. And for the past years, Paul has put out good quality articles, books, courses, WordPress themes, and other projects."}, {"9204": "One thing I learned from Paul is this:"}, {"a3d5": "What problems do you solve?"}, {"22d2": "If you’re in business, you’re not in it for likes, applause, praise, shares, or smiles. No, you’re in business to provide value. And how do you provide value? By solving problems. That’s what gets you paid."}, {"2400": "Too often, entrepreneurs, professionals, and freelancers disregard solving problems. They do things because it’s fun, cool, or because everyone else is doing it."}, {"40a5": "Why is that?"}, {"2078": "I’ve given that a lot of thought. And I strongly feel that most people prefer to do easy work. That’s why we have so many social media experts and life coaches. That’s work that every person with a smartphone who read a book on that topic can do."}, {"a17f": "Solving real problems is hard. It’s also hard to provide measurable value. Because solving problems and providing value requires you to study, research, practice, work, deal with people, problems, setbacks, etc."}, {"4156": "But solving real problems also reaps the biggest rewards. That’s why I always like to ask myself with everything I do: What problem will this solve?"}, {"722e": "If the answer is “nothing,” I don’t do it. That simple question can save you a lot of time, energy, and resources that you otherwise might waste."}, {"9283": "You don’t have to be an entrepreneur to solve problems. When you work in sales, you solve problems. If you’re an accountant, you solve problems. And so forth."}, {"8988": "You either solve problems for clients or for your boss, colleagues, stakeholders. You see? Life is a series of answered problems."}, {"fd68": "Listen to my interview with Paul Jarvis to learn more."}, {"6c00": "After reading Paul’s article about podcasting, I reached out to him and asked if he wanted to be on my podcast. He said yes."}, {"efd3": "I always enjoy Paul’s work, and it was great to talk to him on my podcast. Like always, he provides value and good insights. We talk about entrepreneurship, dealing with criticism, having an inner compass, providing value to other people’s lives, and much more topics."}, {"9df9": "Do you like comedy? Do you also like knowledge? If so, subscribe the Practical Podcast (about life). I promise you’ll laugh and learn."}, {"7475": "Every week, I answer questions from readers/listeners. I combine comedy with lessons I’ve learned about entrepreneurship, life, productivity, relationships, etc."}], "content": "What Problems Do You Solve? Last year I decided to start a podcast. I had no idea where to start, so like everyone else who needs information about a subject, I went to Google.com for some answers. And I searched for “how to start a podcast.” It wasn’t helpful. Google only confuses you. There’s too much information. And you have no clue how good that information is. Every time I use Google, I think of something my college professor told me a decade ago. We were once talking about the influence of Wikipedia on books, education, and knowledge in general. I remember that in 2007, Wikipedia made the top-ten list of the most popular websites. They had surpassed the New York Times. That was a big deal ten years ago. So I said something like: “Who needs books in the future if you have Wikipedia?” My college professor laughed. He said something like: “People think free information is a big deal. But it’s still free information. That means it’s either garbage or it only provides you piece of the puzzle.” That’s still true today. Most information out there is pretty useless. But fortunately, there are people like Paul Jarvis who share good quality information that’s useful. And when he shared an article about podcasting last year, I was particularly happy with it. The article showed that starting a podcast is easy as long as you keep it simple. I can’t remember the first time I read something from Paul. But I know that it was a few years ago — well before I started my own blog. I only ran my business at the time and did some freelancing on the side. And for the past years, Paul has put out good quality articles, books, courses, WordPress themes, and other projects. One thing I learned from Paul is this: What problems do you solve? If you’re in business, you’re not in it for likes, applause, praise, shares, or smiles. No, you’re in business to provide value. And how do you provide value? By solving problems. That’s what gets you paid. Too often, entrepreneurs, professionals, and freelancers disregard solving problems. They do things because it’s fun, cool, or because everyone else is doing it. Why is that? I’ve given that a lot of thought. And I strongly feel that most people prefer to do easy work. That’s why we have so many social media experts and life coaches. That’s work that every person with a smartphone who read a book on that topic can do. Solving real problems is hard. It’s also hard to provide measurable value. Because solving problems and providing value requires you to study, research, practice, work, deal with people, problems, setbacks, etc. But solving real problems also reaps the biggest rewards. That’s why I always like to ask myself with everything I do: What problem will this solve? If the answer is “nothing,” I don’t do it. That simple question can save you a lot of time, energy, and resources that you otherwise might waste. You don’t have to be an entrepreneur to solve problems. When you work in sales, you solve problems. If you’re an accountant, you solve problems. And so forth. You either solve problems for clients or for your boss, colleagues, stakeholders. You see? Life is a series of answered problems. Listen to my interview with Paul Jarvis to learn more. After reading Paul’s article about podcasting, I reached out to him and asked if he wanted to be on my podcast. He said yes. I always enjoy Paul’s work, and it was great to talk to him on my podcast. Like always, he provides value and good insights. We talk about entrepreneurship, dealing with criticism, having an inner compass, providing value to other people’s lives, and much more topics. Do you like comedy? Do you also like knowledge? If so, subscribe the Practical Podcast (about life). I promise you’ll laugh and learn. Every week, I answer questions from readers/listeners. I combine comedy with lessons I’ve learned about entrepreneurship, life, productivity, relationships, etc. ", "name": "217", "child": "217_1\t217_2\t217_3\t217_4\t217_5\t217_6\t217_7\t217_8\t217_9\t217_10\t217_11217_1\t217_2\t217_3\t217_4\t217_5\t217_6\t217_7\t217_8\t217_9\t217_10\t217_11", "timestamp": "Mar 2"}