{"parent": "", "title": "39 Observations of a Life That Hasn’t Gone According to Plan", "author": "Srinivas Rao", "sentences": [{"c65a": "39 Observations of a Life That Hasn’t Gone According to Plan"}, {"9170": "You have multiple possible futures- each of which could be equally incredible. Imagine ten thousand Soul Mates. Nine hundred once in a lifetime opportunities. Three hundred and forty winning lottery tickets. Infinite big breaks. Meditate on multiple pleasurable outcomes and you will lose your grip on things being exactly how you think you need them to be — Danielle LaPorte"}, {"03f3": "Every year for the last 5 years, I’ve written a post with life lessons from each year of my life (i.e. 38 life lessons from 38 years on the planet). This would imply that I possess some sort of wisdom. But all I really have is the experience of a life that hasn’t exactly gone according to plan."}, {"1798": "I had a plan to go to Berkeley, kick ass in school, get an amazing job, be married by 25, and have a McMansion filled with kids by 30. Everywhere I went, I’d be called Mr. Rao, eat at the most expensive restaurants and stay in 5-star hotels."}, {"5836": "None of this has happened… although I do occasionally get called Mr. Rao when I check into a hotel for a speaking gig. These are 39 of my observations of a life that hasn’t gone according to plan."}, {"af6b": "This article is pretty long. If you’d like a PDF version of this article to read later, click here and we’ll email it over."}, {"182d": "1. When You Believe You Have All the Answers, You Stop Learning"}, {"e893": "It’s easy to believe this when you have some degree of success. A few weeks ago I spoke to Dan Lerner who teaches a science of happiness course at NYU. He told me a story about a woman’s soccer coach who has the best record in NCAA history. Despite his record, when he met Dan, all he did was ask questions. He told Dan “when I was younger I thought I knew everything.” Don’t ever stop asking questions. That’s what causes you to stretch, grow, and change."}, {"3f62": "2. Learning is Different than Education"}, {"8adf": "Education is about memorizing facts, regurgitating those facts on tests to earn good grades, and getting pieces of paper that your parents can hang in frames on the wall at their houses. There’s such a wall at my parent’s house. On one side are my sister’s degrees and on the other are mine."}, {"00fe": "She has 1 more frame than I do, but that hardly does her accomplishments justice. She’s kind of a badass. Her pieces of paper reinforce that."}, {"8415": "My pieces of paper are reminders of the following:"}, {"a11a": "1) Finishing Berkeley with a 2.97 after the dot-com bubble burst"}, {"ea58": "2) Getting an MBA after the financial crisis of 2008"}, {"8dcb": "When I’ve graduated from an educational institution of any sort, it has always been anticlimactic. I suppose that’s because I graduated into two recessions. I couldn’t find a real job so I made one up. I started doing the work that I wanted to get paid for even though nobody was paying me for it. I started building a body of work instead of a resume."}, {"dd72": "If you ask me about learning, I’d point you to my bookshelf. That’s where I learned. That’s how I grew. My books are what I describe as an education that kicks the crap out of the one you got in school."}, {"5aa3": "Learning is the result of genuine curiosity. It’s not something that gets measured in efficiency and effectiveness. True learning changes, shapes, and molds us. Occasionally the two overlap. I learned from my 9th-grade band director James Whitis. I learned about the tremendous power of consistency and commitment, a lesson that still impacts my life to this day. Learning is a lifelong pursuit."}, {"534b": "3. Choose the Job You’ll Love and Learn The Most From"}, {"0e21": "If there is a choice — more money or more responsibility you must always opt for the latter. A lower-paying position that offers more room to make decision and carve out little empires is infinitely preferable to something that pays well but constricts your movements. — Robert Greene, The 50th Law"}, {"42e6": "At the beginning of your career, it’s tempting to choose the most prestigious job with the biggest paycheck. This is hands down the biggest mistake I made in my career. Because of this, I lost out on a number of opportunities. In the long run, prioritize earning potential over earnings. It will have a much higher ROI."}, {"0a87": "4. If You Did Anything Differently in Your Past, You Wouldn’t Know What You do Today"}, {"9e85": "People always ask what you’d tell the younger version of yourself. I’ve thought a lot about this question. I even wrote a letter to my 20-year-old self. There are jobs I wouldn’t have taken, girls I wouldn’t have dated and all sorts of other things that I wouldn’t have done. While there’s no question that I would do things differently in certain areas of my life, if I did those things differently I wouldn’t know what I do today. That’s the paradox of life experience."}, {"fe71": "5. Do Small Things Daily"}, {"2d53": "Little things that we do repeatedly lead to big changes in our lives. 1000 words a day for about 5 years was more or less my journey from blog to book deal. Doing little things daily doesn’t seem glamorous at all. That’s because it’s not. There’s nothing sexy about it. Consistency is a highly underrated trait. It’s simple, but not easy, and pays off in big ways."}, {"2dac": "While on the subject of little things leading to big changes, I’ve put together a short book of my best ideas on how to make time and consistently create work that’s meaningful to you. If you’d like to read it, click here and I’ll send it over."}, {"c753": "6. Stoicism is Like a Philosophical Antidepressant"}, {"a388": "The highs aren’t as high. The lows aren’t as low. But it enables you to navigate life’s challenges with a sense of calm and grace. Even when you take real antidepressants the highs aren’t as high. But if it means the lows aren’t as low, I think it’s a small price to pay. Sometimes you can’t self-help your way out of depression. That being said you shouldn’t abandon practices like gratitude and meditation. Medication isn’t a substitute for those things. It’s a supplement to them."}, {"9595": "7. There’s a difference between forgiveness and forgetting"}, {"8121": "You won’t ever forget the people who hurt you. But everything that hurts like hell at the moment will eventually turn into a distant memory. Forgiveness, on the other hand, is a choice. It’s a choice to let go of whatever resentment, anger, and hostility you might feel towards a person who hurt you. It’s a selfish choice because it’s about you more than it is the other person. And as my friend Kamal Ravikant says, “it’s what sets you free.”"}, {"a4e4": "8. If you Want to Change the World, You Have to See it as Malleable"}, {"4b0d": "When I spoke with Justine Musk about the psychology of visionaries, she said the following about Elon Musk:"}, {"75ae": "“He has a way of taking the world in his head and imposing it on the world around him, until it looks like the world in his head.”"}, {"11c7": "Some of us can’t help but see the world as malleable. It’s almost as if we have to develop a reality distortion field as a coping mechanism. We’re such misfits that the only way the world works for us is by shaping and molding it to our own liking."}, {"f764": "9. The Ability to Consider a Life of Meaning and Purpose is One that’s Privileged"}, {"cea9": "We talk a lot about pursuing dreams, goals, finding passions and living lives with meaning and purpose. In the midst of this, it’s easy to forget that there are people who work 3 jobs to keep the lights on and put food on the table. There are people who don’t have clean drinking water and don’t know how they’re going to eat tomorrow. If you’re lucky enough to even explore a life greater meaning and purpose, you live a privileged life."}, {"0b85": "10. There are Some Questions we’ll Never Have Answers To"}, {"8ff3": "No matter how many times you ask why, how many hours you spend in therapy, and no matter how much journaling, meditation and praying you do, there are some questions you’ll simply never have answers to. There will be nothing there when the last thread unravels."}, {"6b7f": "11. Read the Following Books and Watch the Following Movies"}, {"cee3": "These books and movies will warm your heart, change your life and expand your sense of possibility."}, {"fc32": "12. Spend the First hour of Your Day on Something that Adds Meaning to Your Life"}, {"df2f": "A default routine for so many people is to roll over, pick up their phone, check email, check social media and go about their day. Here is a disturbing fact that I learned when I spoke with Amy Blankson about The Future of Happiness."}, {"022e": "We spend 2 hours a day, lock and unlocking our phones. That’s 38 days."}, {"eade": "Imagine what you could do with 38 extra days. That’s a month long vacation. Getting back 38 days of your life could be a game changer. Wake up and spend the first hour of your day on something that adds meaning to your life."}, {"c751": "13. Be Skeptical of Advice Offered From People That Don’t have the Life You Want"}, {"dbe3": "Unless somebody has produced the results that you’re seeking, take their advice with a grain of salt."}, {"d6d2": "People have lots of advice. Old Indian people have tons of it for some reason. A few months back I was at a lunch with some Indian doctor. When I told him I was an author, he asked if it was lucrative. I told him it wasn’t too bad. That was the end of our conversation. A distant relative told another relative of mine that she thought my career was a complete waste of my education."}, {"e0d0": "If there’s one thing that 39 years have taught me it’s that you should only value the opinions of a small group of people. Sometimes advice is implicit, other times it’s explicit. Either way, unless somebody has the life you want, be skeptical of the advice they offer and judgments they make"}, {"5f3c": "14. Some of Your Most Defining Moments Will Occur When Things Don’t go according to plan"}, {"7473": "If I hadn’t been rejected by all four business schools I applied to, I would have never ended up at Pepperdine."}, {"529e": "If I had received my dream internship, working at Harrah’s, I wouldn’t have been the social media intern at Intuit and started tinkering with blogs, writing, etc."}, {"b2b4": "If I hadn’t gone to Pepperdine, I might not have studied abroad in Brazil. And if hadn’t been for Brazil I might not be a surfer."}, {"4fae": "If had a job upon graduation, I might not have started my first blog, which led to the Unmistakable Creative, becoming an author, and being a public speaker."}, {"d147": "If things had gone according to plan, you might not be reading this."}, {"57de": "15. Invest in Yourself and Make Self-Care a Priority"}, {"40a0": "Self-care occurs in a number of different ways. It could be shutting off your devices for a few hours a day. Or it could be therapy, yoga or a massage. Make time for this. You’ll be happy you did. While you can’t necessarily quantify of the ROI of self-care, it contains an infinite value that can’t be measured."}, {"9acd": "16. Give some thought to whether you’re prioritizing eulogy or resume virtues"}, {"6702": "The resume virtues are the ones you list on your resume, the skill that you bring to the job market and that contribute to external success. The eulogy virtues are deeper. They’re the virtues that get talked about at your funeral, the ones that exist at the core of your being — whether you are kind, brave, honest, or faithful: what kind of relationships you’ve formed. — David Brooks, The Road to Character"}, {"db17": "The books I’ve written, the podcasts I’ve recorded, and the speeches I’ve given are all nice things to put on a resume. But what people will say and how they’ve been impacted by this work are what I hope will go into my eulogy. Don’t measure the impact of your work solely on the number of eyeballs, clicks, likes, or shares. Instead, measure it on the number of hearts you touch. If your work touches hearts, it will be time well spent."}, {"4948": "17. You can’t be loved by everyone"}, {"d29b": "There are people who hate my guts. They think I’m awful and want absolutely nothing to do with me. I realized at a certain point that there was no sense in trying to change their opinions. You can serve the people who love you, or you can try to cater to the people who hate you. The first is far less exhausting and far more rewarding."}, {"ca36": "18. Sometimes Your Best Performance will Happen Later in the Game"}, {"6be2": "I’ve been a late bloomer in just about every aspect of my life: I had my first girlfriend when I was 25. By the time I was in my 30’s I’d accumulated a resume of failures that a business school admissions consultant described as a “crucible of a career.” If there’s anything I’ve ever written in my life that was complete and utter bullshit, it was my admissions essay for business school. It was definitely not something I was proud to put my signature on. I was trying to turn a resume that looked more like a rap sheet into something worthy of a top ten MBA. By the time I was 36, I had even managed to come close to running my own company into the ground."}, {"4cf2": "When they cut to half time during this year’s Super Bowl, most of us probably thought the game was over. Tom Brady was getting his ass handed to him and I’m sure Arthur Blank had a shit eating grin on his face. What followed was one of the greatest comebacks in the history of the Superbowl."}, {"4cac": "I’m no Tom Brady, but I’m definitely playing much better in the later half of the game than I did in the first. And if my last quarter is anything like Brady’s from this year’s Superbowl, I might just have a few more magic moments up my sleeve."}, {"222f": "19. Sometimes It’s The People Who Write You Off That Will Light The Biggest Fire Under Your Ass"}, {"716c": "The first part of my career was pretty much a disaster. Almost every boss I had written me off. After a certain point, it stops being about proving them wrong and proving to yourself that you’re capable of far more. At 39 I’m grateful that they didn’t believe in me. They lit a fire under my ass."}, {"6ca8": "20. Every Hero’s Journey has a Crucible"}, {"cdd9": "On Christmas day 2014, I spent the morning reading articles about founder depression and suicide. I honestly started to think it would make everyone else’s life easier if I ended mine. I walked to the end of the cul de sac on my parents street and just cried."}, {"3feb": "The self-help books, gratitude interventions, and every other thing I’d learned about positive psychology from 100’s of interviews did nothing for me. But with the help of Brian Koehn, and my therapist I pulled out of it after about 3–4 months. This was my crucible."}, {"5422": "There are days when my mind still goes into this place, but it passes like waves in the ocean. That’s grief. But eventually, the waves of grief become gentler and more manageable. They go from being what surfers refer to as 6-foot bombs to ankle biters. If you’re in this place, don’t be afraid to ask for help."}, {"8509": "In your life, there will be moments that touch your heart and others that break it. There will be ones that make you laugh and others that reduce you to tears. There will be moments when you feel invincible and others when it feels as if a stiff wind could blow you over. In our darkest hours, and in the midst of our greatest losses, it’s important that we don’t lose ourselves. The thing about the crucible that’s impossible to realize and recognize while you’re in the midst of it is that nothing will make you stronger. We are greater than any of our losses."}, {"3c64": "21. Make a list of childhood dreams"}, {"ddd4": "A few weeks ago I interviewed a professional guitarist named Joe Goodkin. I told him one of the things I wanted to do before my 40th birthday was learn how to play the opening guitar riff to the Guns N Roses song Sweet Child O’ Mine. We all have these really small things that we want to learn to do and it’s worth making a list of them. Some of your childhood dreams can come true in adulthood. You just have to take the time to remember them and write them down."}, {"71da": "This article is pretty long. If you’d like a PDF version of this article to read later, go here and we’ll email it over."}, {"c159": "22. Death is the Ultimate Equalizer of Our Humanity"}, {"906c": "The days of our lives are like sentences. The hours like paragraphs. The months and years like chapters of an ongoing story that unfolds until you take your final breath. When you take that last breath, what you’ll be able to take with you are the hearts you’ve touched, the stories you’ve told, and the difference you’ve made. In the face of death all the layers of social status, fame, and more become completely irrelevant. It’s the ultimate equalizer of our humanity."}, {"028a": "23. Some of What You Believe will Change with Age"}, {"4d4c": "I used to believe in soulmates, and I don’t anymore. The math doesn’t quite work for me. I used to think that what happened in romantic comedies was what relationships were supposed to be like. But a few real life experiences altered that perception. I guess you could say I finally stopped being what my friend Rachel Resnick would call a “love junkie.” It’s not that I don’t believe in chemistry and sparks. I’m just not as quick to let my imagination run riot when it happens."}, {"aa66": "24. What you Fear Most Will Also Change"}, {"6a44": "For a good amount of my 20’s, I had this tremendous fear of ending up alone. After having a couple of girlfriends, that fear went away. I’m almost 40 and I think one thing that scares me the most is that one or both of my parents won’t be around to see what are apparently two of the most important experiences of life: getting married and having kids. At the same time, you probably don’t want to make such an important life decision out of fear."}, {"3777": "A few weeks ago I had a chance to speak to the director of the Zen Hospice project. So I shared this fear with him and he reminded me to make sure we don’t miss out on enjoying the small moments just because the big ones haven’t happened yet."}, {"62cd": "25. Parental Advice Contains Some Nuggets of Wisdom"}, {"8199": "Whenever shit hit the fan in my life, my dad would always tell me “whatever happens, it’s for your own good.” Sometimes I wondered if he’d just say this to make me feel better even when this thing that was supposedly for my own good didn’t feel good, was a gigantic screw-up and one more thing to add to my resume of failures. But regardless it always helped, even if it was just a little bit. “Anger is a terrible quality” is another thing my dad has said to me over and over again in my life. I think I can count the number of times he’s been truly angry or yelled at me on two hands."}, {"5983": "When we say things out of anger, we say things we’ll regret, and we run the risk of doing irreversible damage to our relationships. To top it all off, if we’re angry, pissed off, and a time bomb waiting to go off at any minute, nobody will want to spend time with us. The people who wanted to be with around us will be the ones we hurt the most."}, {"aef3": "26. What People Make Fun of When You’re Young can Turn into Something They Love When You’re Older"}, {"ef6e": "I had really big lips when I was a kid. I still do. And sometimes I got made fun of for them. My friend David Falwell even nicknamed me “lips” when we were in the 7th grade. My lips were helpful for learning to play the tuba. That’s probably why I played the tuba because my lips couldn’t fit into any other mouthpiece. As an adult, all the women I’ve kissed seemed thrilled about this (the lips, not the Tuba). If only I’d known this in 7th grade."}, {"de02": "27. Working a Job you Hate is Strangely great Preparation for a Job you Love"}, {"dba0": "In high school, I worked at McDonald’s for 8 months. I worked for an angry Jamaican lady (which sounds like an oxymoron). Sometime in the first few months, I wanted to quit. My parents refused to let me. I hated that job. But as Robert Greene once said to me “no experience in your life should be thought of as wasted.”"}, {"35c7": "There are some good things that come from working a job you truly hate."}, {"13f1": "First, it makes you appreciate the work you love when you finally get to do it. Second, you work much harder at what you love because you’ve experienced something you hate. Third, working a job you hate causes you to remain humble when you finally get to do something you love."}, {"b94e": "28. Life is like a science experiment"}, {"75c1": "Our experiences are data points. To formulate a decent hypothesis we need lots of data points. If you’re in your 20’s and things aren’t going according to the plan, don’t worry. You’re collecting lots of data points."}, {"9384": "29. You have to fall before you stand. And you have to stand before you fly"}, {"3ed4": "At 39 I’m more athletic than I’ve been at any point in my life. In addition to being a surfer, I’m now on avid snowboarder. It’s quite ironic considering my athletic ineptitude throughout junior high and high school."}, {"6889": "When coach Dave Powers called me on the phone the summer before 8th grade and asked if I was going to come out for football, I was a bit stunned considering I made for nothing more than a great tackling dummy in 7th grade. Getting the hell beat out of me in the hot Texas sun was not my idea of a good time. So I passed on going out for the 8th-grade football team. But Friday Night Lights is one of my favorite TV shows of all time partially because I’ve actually experienced the craziness of Texas Football."}, {"52df": "The nice thing about board sports is you’re not competing against anybody but yourself. You’re just trying to outdo whatever you did the day before: a higher wave count, bigger wave, or steeper mountain. If there’s anything that board sports teach you about life it’s how to get back up after you fall. This is a useful skill in a life that hasn’t gone according to plan. You have to fall before you stand, and you have to stand before you fly. But once you start flying, there’s no turning back."}, {"1f69": "30. The Pursuit of Any Goal Transforms Us More Than Its Accomplishment"}, {"e67c": "There are always going to be goals that we set but don’t accomplish. That doesn’t mean we shouldn’t set such goals. We learn more from the pursuit of a goal than we do from its accomplishment. It’s the pursuit that changes us. I had a goal to become a NY Times bestselling author. I didn’t accomplish that goal, but in pursuit of it, I transformed many of my habits, behaviors, and beliefs. Transformation is the ultimate purpose any goal. No matter how grand the accomplishment, the buzz and the novelty will eventually wear off. So it’s a lousy way to measure your happiness and satisfaction. But if the transformation sticks, our effort won’t have been in vain."}, {"f291": "31. Make a list of big and wildly ambitious things you’ve wanted to do. Here are some of mine:"}, {"38fb": "If you’re too afraid to write down your craziest dreams how can you expect them to come true? Every year on New Year’s day I do the following exercise that my friend AJ recommends in the Life and Times of a Remarkable Misfit."}, {"5646": "Write a 500 word description of what you want your life to look like in 2 years. This will act as your signpost. Then (and here’s the kicker) post it on your blog or email it to someone who will “get it”. It’s hard to go back on a revolution that you’ve already announced."}, {"fa86": "Then I email it to him. My life today bears an almost uncanny resemblance to the version I sent him 2 years ago."}, {"df5c": "32. Uncertainty = Infinite Possibility"}, {"0686": "If there’s anything I could say to my younger self it would be this."}, {"def9": "Some of what happens will disappoint you."}, {"5bfb": "Some of it will really hurt."}, {"dc36": "Some of it will surprise you"}, {"fc17": "Some of it will shock you."}, {"fb18": "Some of it will light your eyes up and put an ear to ear smile on your face."}, {"f834": "You can’t possibly know how it’s all going to turn out. But in that which is uncertain, that which is possible becomes infinite."}, {"82bc": "33. The books we’re reading are often reflective of what’s happening in our lives"}, {"2aee": "Sometime at the beginning of this year, I ordered a book titled Calling in the One: Seven Weeks to Finding the Love of Your Life. It’s a book for women, but I ordered it because my sister recommended it. It’s been more than seven weeks since I got the book. But in all fairness to the author, I haven’t finished the book or completed all the exercises."}, {"0f36": "The other set of books that have kept showing up are part of what I’ve affectionately titled the billionaire reading project. The premise is simple. Read every book written by, about or recommended by a billionaire. My editor Steph asked what I was hoping to learn. Other than how to become a billionaire?If you learn one thing from a book that you can apply to your life, that makes it worth reading."}, {"7329": "34. Swing for the Fences at Least Once a Year"}, {"9b07": "Steven Pressfield once said that “you can’t launch a fastball into the upper deck unless you swing for the fences.” So once a year, I swing for the fences. A few years ago it was pitching the folks at Soulpancake on animated series based on our podcast"}, {"6c20": "This year it was submitting The Unmistakable Creative to NPR for acquisition. It turns out they have a division where they’re looking for new stories and ideas."}, {"ec78": "When you decide to swing for the fences be careful who you tell. Make sure they’re people who would stand up and do the wave if you do manage to launch one out of the park."}, {"9966": "35. Conditional is happiness a bottomless pit"}, {"3df7": "If there’s always a condition that must be met in order for us to be happy, we basically won’t be happy until we’re dead. It’s so counterintuitive but if we make our happiness a priority all of these other things fall into place."}, {"99aa": "In the book The Three Laws of Performance, the authors tell the story of an Indian lady who attended the Landmark forum. She’d lost her daughter and her husband had left her. All she had left was her son. Naturally, she was devastated. But her breakthrough left her with a profound insight. She realized that she was denying her son the thing that he needed the most, a happy mother. If you’re a parent, perhaps the best thing you can be for your kid is happy."}, {"c8d3": "This is not to downplay the impact of tragedies in our lives. Many of them suck and make us feel like we can’t figure out which way is up or find our way out of the dark. And sometimes during these periods, we simply can’t think or self-help our way out of them. But what we can strive for is unconditional happiness"}, {"1040": "We spend so much of our lives trying to change ourselves and our circumstances. We seek enlightenment and happiness through all that’s external. Books, podcasts, meditation retreats, and more. We perpetually seek outside of ourselves to solve problems and heal wounds, ultimately in the pursuit of whatever we define for ourselves as wealth."}, {"50ca": "But true wealth I’m coming to realize at 39 is more about appreciation than it is accumulation. As Tim Ferriss once said to me “if you don’t appreciate what you have now you’ll never appreciate what you get later.” At 39, I’m a appreciative of living 2 minutes away from the water in Cardiff, the place where 9 years ago I got out of the water and thought to myself “I love this place, and someday I’m going to live here.”"}, {"cd77": "We think that happiness is a byproduct of all these external things like when we finally get picked, we finally fall in love, when we get the ultimate promotion, or some big life event takes place. But the more I talk to happiness researchers and social scientists, it appears to be the other way around. All the external things we crave are the byproduct of our happiness."}, {"0985": "36. Really Good friends are Like Family"}, {"958e": "Bob Goff once said to me “you have room for about 8 people around your deathbed, 9 if they’re thin. And these are people who have usually loved you well.” Sometimes I think I want to be Bob Goff when I grow up. Best friends are like family members. If you lose them it would be as devastating as losing someone in your family. You don’t need that many, just one or two."}, {"8c6a": "37. Parents Screw Their Kids Up"}, {"d91c": "One of my favorite lines in the TV show Parenthood is at the very end when one of the characters is sitting with her dad and he turns to her and says “parents screw their kids up. That’s just what they do.”"}, {"39b7": "If you’re not allowed to do something as a kid, you tend to rebel as an adult. One of the things that my parents refused to buy me that was within their means was a skateboard. I begged for months on end only to give up. As an adult, I’ve developed a pathological need to do things that involve tying boards to my feet. I’ve found a lifelong passion for board sports. I’m grateful to my parents for that screw-up."}, {"1a84": "For some strange reason, even though I have no kids, I’ve been asking a lot of guests of the Unmistakable Creative about parenting. When I asked Phillip Mckernan this question he said: “no matter what you do you’re going to fu@#$2 your kids up.” That’s the man who taught me about the pillars of a meaningful life and works with Olympians and billionaires."}, {"6739": "It turns out that being the best behavioral scientist or performance coach in the world doesn’t make you a perfect parent. Basically, parents have the job of taking someone who is literally helpless, and if all goes well, raising a well adjusted valuable member of society who is hopefully not a total jackass. I think it’s inevitable that any human would screw that up a little bit. I’m quite sure I would in at least a few ways. As Janelle Hanchett once said to me “this is the fatal flaw of our humanity.”"}, {"b84e": "38. The Moment You Think You’ve Made it, You’re Hosed"}, {"7d3b": "There’s this misconception people have of moments when they think they’ll feel like they’ve finally made it:"}, {"b9d7": "The truth is that if and when you do get picked, the work is just starting. Creative success or any kind of success is an infinite game. When you get picked you get to keep playing the game."}, {"2c22": "39. If You Have No Idea What You Want to Do With Your life, Don’t Worry Too Much About It"}, {"7834": "I thought I knew what I wanted to do when I finished school at Berkeley. I wasn’t smart enough to get a job in management consulting or investment banking. So I decided to become a salesperson because it was the only job that would allow me to make the same kind of money. I literally sat at a desk, often using the yellow pages, and made cold calls. It was thinking that I knew what I wanted to do with my life that made the first half of my career pretty miserable."}, {"aada": "Not knowing what you want to do forces exploration and uncertainty on you. In the long run that will be a good thing. It’s kind of a blessing. Often people who have really interesting careers didn’t have a plan to end up where they did. If you can, have a quarter life crisis instead of a midlife one. It’s probably more cost effective."}, {"0e5d": "If you’re looking around and wondering “where do I go from here, what exactly should I do with my life?”, I’d encourage you to consider these wise words of Cheryl Strayed."}, {"4df6": "Trust that all you’ve learned was worth learning, no matter what answer you have or do not have about what practical use it has in your life. Let whatever mysterious starlight that guided you this far guide you onward into the crazy beauty that awaits"}, {"b274": "This starlight will guide you down paths that aren’t well lit, roads that aren’t perfectly paved, and to destinations that aren’t on your itinerary. This is good because you become a traveler on the journey of life instead of a tourist. You become a participant in your life rather than a spectator."}, {"6b4b": "Maybe…."}, {"fa9f": "You’ll fall in love, get married, build a house in the suburbs and send your kids to amazing schools."}, {"9db9": "You’ll climb the ladder of success right into a corner office with an amazing view and you’ll love every second of it."}, {"63f8": "You’ll build a startup that changes the world or one small part of it"}, {"647d": "You’ll climb the biggest mountains and surf the biggest waves"}, {"18a6": "Or maybe nothing will go according to plan and it will be the best thing that’s ever happened to you because you’ll be left with what is one of the most powerful questions to ask yourself at any moment in your life:"}, {"6572": "What’s actually possible?"}, {"5d51": "As I wrap up this chapter of my life, as I round the corner for the final stretch of this decade, my 30’s, I can’t help but contemplate this monologue from one of my favorite television characters, Nora Walker"}, {"cbb3": "Families, like life, have a way of changing, never staying the same, but they’re your family, this eclectic, deeply bonded group. So you evolve, you adapt. And now… As I look at my life and my new extended family, I think of this wonderful quote by George Eliot. ‘It’s never too late to be what you might have been.”"}, {"50d4": "Before You Go…"}, {"53dd": "I‘ve spent a lot of time studying how some people live and work in a way that truly aligns with their core values. Often, it’s really scary and difficult to know how to get started- many people never take the first step. That’s why I created “The Guide to Optimizing Productivity & Creativity.”"}, {"1d4c": "The tactics I’ve put in this guide helped me make many of the big changes I detail in the article above. What could it do for your life? Get it here."}], "content": "39 Observations of a Life That Hasn’t Gone According to Plan You have multiple possible futures- each of which could be equally incredible. Imagine ten thousand Soul Mates. Nine hundred once in a lifetime opportunities. Three hundred and forty winning lottery tickets. Infinite big breaks. Meditate on multiple pleasurable outcomes and you will lose your grip on things being exactly how you think you need them to be — Danielle LaPorte Every year for the last 5 years, I’ve written a post with life lessons from each year of my life (i.e. 38 life lessons from 38 years on the planet). This would imply that I possess some sort of wisdom. But all I really have is the experience of a life that hasn’t exactly gone according to plan. I had a plan to go to Berkeley, kick ass in school, get an amazing job, be married by 25, and have a McMansion filled with kids by 30. Everywhere I went, I’d be called Mr. Rao, eat at the most expensive restaurants and stay in 5-star hotels. None of this has happened… although I do occasionally get called Mr. Rao when I check into a hotel for a speaking gig. These are 39 of my observations of a life that hasn’t gone according to plan. This article is pretty long. If you’d like a PDF version of this article to read later, click here and we’ll email it over. 1. When You Believe You Have All the Answers, You Stop Learning It’s easy to believe this when you have some degree of success. A few weeks ago I spoke to Dan Lerner who teaches a science of happiness course at NYU. He told me a story about a woman’s soccer coach who has the best record in NCAA history. Despite his record, when he met Dan, all he did was ask questions. He told Dan “when I was younger I thought I knew everything.” Don’t ever stop asking questions. That’s what causes you to stretch, grow, and change. 2. Learning is Different than Education Education is about memorizing facts, regurgitating those facts on tests to earn good grades, and getting pieces of paper that your parents can hang in frames on the wall at their houses. There’s such a wall at my parent’s house. On one side are my sister’s degrees and on the other are mine. She has 1 more frame than I do, but that hardly does her accomplishments justice. She’s kind of a badass. Her pieces of paper reinforce that. My pieces of paper are reminders of the following: 1) Finishing Berkeley with a 2.97 after the dot-com bubble burst 2) Getting an MBA after the financial crisis of 2008 When I’ve graduated from an educational institution of any sort, it has always been anticlimactic. I suppose that’s because I graduated into two recessions. I couldn’t find a real job so I made one up. I started doing the work that I wanted to get paid for even though nobody was paying me for it. I started building a body of work instead of a resume. If you ask me about learning, I’d point you to my bookshelf. That’s where I learned. That’s how I grew. My books are what I describe as an education that kicks the crap out of the one you got in school. Learning is the result of genuine curiosity. It’s not something that gets measured in efficiency and effectiveness. True learning changes, shapes, and molds us. Occasionally the two overlap. I learned from my 9th-grade band director James Whitis. I learned about the tremendous power of consistency and commitment, a lesson that still impacts my life to this day. Learning is a lifelong pursuit. 3. Choose the Job You’ll Love and Learn The Most From If there is a choice — more money or more responsibility you must always opt for the latter. A lower-paying position that offers more room to make decision and carve out little empires is infinitely preferable to something that pays well but constricts your movements. — Robert Greene, The 50th Law At the beginning of your career, it’s tempting to choose the most prestigious job with the biggest paycheck. This is hands down the biggest mistake I made in my career. Because of this, I lost out on a number of opportunities. In the long run, prioritize earning potential over earnings. It will have a much higher ROI. 4. If You Did Anything Differently in Your Past, You Wouldn’t Know What You do Today People always ask what you’d tell the younger version of yourself. I’ve thought a lot about this question. I even wrote a letter to my 20-year-old self. There are jobs I wouldn’t have taken, girls I wouldn’t have dated and all sorts of other things that I wouldn’t have done. While there’s no question that I would do things differently in certain areas of my life, if I did those things differently I wouldn’t know what I do today. That’s the paradox of life experience. 5. Do Small Things Daily Little things that we do repeatedly lead to big changes in our lives. 1000 words a day for about 5 years was more or less my journey from blog to book deal. Doing little things daily doesn’t seem glamorous at all. That’s because it’s not. There’s nothing sexy about it. Consistency is a highly underrated trait. It’s simple, but not easy, and pays off in big ways. While on the subject of little things leading to big changes, I’ve put together a short book of my best ideas on how to make time and consistently create work that’s meaningful to you. If you’d like to read it, click here and I’ll send it over. 6. Stoicism is Like a Philosophical Antidepressant The highs aren’t as high. The lows aren’t as low. But it enables you to navigate life’s challenges with a sense of calm and grace. Even when you take real antidepressants the highs aren’t as high. But if it means the lows aren’t as low, I think it’s a small price to pay. Sometimes you can’t self-help your way out of depression. That being said you shouldn’t abandon practices like gratitude and meditation. Medication isn’t a substitute for those things. It’s a supplement to them. 7. There’s a difference between forgiveness and forgetting You won’t ever forget the people who hurt you. But everything that hurts like hell at the moment will eventually turn into a distant memory. Forgiveness, on the other hand, is a choice. It’s a choice to let go of whatever resentment, anger, and hostility you might feel towards a person who hurt you. It’s a selfish choice because it’s about you more than it is the other person. And as my friend Kamal Ravikant says, “it’s what sets you free.” 8. If you Want to Change the World, You Have to See it as Malleable When I spoke with Justine Musk about the psychology of visionaries, she said the following about Elon Musk: “He has a way of taking the world in his head and imposing it on the world around him, until it looks like the world in his head.” Some of us can’t help but see the world as malleable. It’s almost as if we have to develop a reality distortion field as a coping mechanism. We’re such misfits that the only way the world works for us is by shaping and molding it to our own liking. 9. The Ability to Consider a Life of Meaning and Purpose is One that’s Privileged We talk a lot about pursuing dreams, goals, finding passions and living lives with meaning and purpose. In the midst of this, it’s easy to forget that there are people who work 3 jobs to keep the lights on and put food on the table. There are people who don’t have clean drinking water and don’t know how they’re going to eat tomorrow. If you’re lucky enough to even explore a life greater meaning and purpose, you live a privileged life. 10. There are Some Questions we’ll Never Have Answers To No matter how many times you ask why, how many hours you spend in therapy, and no matter how much journaling, meditation and praying you do, there are some questions you’ll simply never have answers to. There will be nothing there when the last thread unravels. 11. Read the Following Books and Watch the Following Movies These books and movies will warm your heart, change your life and expand your sense of possibility. 12. Spend the First hour of Your Day on Something that Adds Meaning to Your Life A default routine for so many people is to roll over, pick up their phone, check email, check social media and go about their day. Here is a disturbing fact that I learned when I spoke with Amy Blankson about The Future of Happiness. We spend 2 hours a day, lock and unlocking our phones. That’s 38 days. Imagine what you could do with 38 extra days. That’s a month long vacation. Getting back 38 days of your life could be a game changer. Wake up and spend the first hour of your day on something that adds meaning to your life. 13. Be Skeptical of Advice Offered From People That Don’t have the Life You Want Unless somebody has produced the results that you’re seeking, take their advice with a grain of salt. People have lots of advice. Old Indian people have tons of it for some reason. A few months back I was at a lunch with some Indian doctor. When I told him I was an author, he asked if it was lucrative. I told him it wasn’t too bad. That was the end of our conversation. A distant relative told another relative of mine that she thought my career was a complete waste of my education. If there’s one thing that 39 years have taught me it’s that you should only value the opinions of a small group of people. Sometimes advice is implicit, other times it’s explicit. Either way, unless somebody has the life you want, be skeptical of the advice they offer and judgments they make 14. Some of Your Most Defining Moments Will Occur When Things Don’t go according to plan If I hadn’t been rejected by all four business schools I applied to, I would have never ended up at Pepperdine. If I had received my dream internship, working at Harrah’s, I wouldn’t have been the social media intern at Intuit and started tinkering with blogs, writing, etc. If I hadn’t gone to Pepperdine, I might not have studied abroad in Brazil. And if hadn’t been for Brazil I might not be a surfer. If had a job upon graduation, I might not have started my first blog, which led to the Unmistakable Creative, becoming an author, and being a public speaker. If things had gone according to plan, you might not be reading this. 15. Invest in Yourself and Make Self-Care a Priority Self-care occurs in a number of different ways. It could be shutting off your devices for a few hours a day. Or it could be therapy, yoga or a massage. Make time for this. You’ll be happy you did. While you can’t necessarily quantify of the ROI of self-care, it contains an infinite value that can’t be measured. 16. Give some thought to whether you’re prioritizing eulogy or resume virtues The resume virtues are the ones you list on your resume, the skill that you bring to the job market and that contribute to external success. The eulogy virtues are deeper. They’re the virtues that get talked about at your funeral, the ones that exist at the core of your being — whether you are kind, brave, honest, or faithful: what kind of relationships you’ve formed. — David Brooks, The Road to Character The books I’ve written, the podcasts I’ve recorded, and the speeches I’ve given are all nice things to put on a resume. But what people will say and how they’ve been impacted by this work are what I hope will go into my eulogy. Don’t measure the impact of your work solely on the number of eyeballs, clicks, likes, or shares. Instead, measure it on the number of hearts you touch. If your work touches hearts, it will be time well spent. 17. You can’t be loved by everyone There are people who hate my guts. They think I’m awful and want absolutely nothing to do with me. I realized at a certain point that there was no sense in trying to change their opinions. You can serve the people who love you, or you can try to cater to the people who hate you. The first is far less exhausting and far more rewarding. 18. Sometimes Your Best Performance will Happen Later in the Game I’ve been a late bloomer in just about every aspect of my life: I had my first girlfriend when I was 25. By the time I was in my 30’s I’d accumulated a resume of failures that a business school admissions consultant described as a “crucible of a career.” If there’s anything I’ve ever written in my life that was complete and utter bullshit, it was my admissions essay for business school. It was definitely not something I was proud to put my signature on. I was trying to turn a resume that looked more like a rap sheet into something worthy of a top ten MBA. By the time I was 36, I had even managed to come close to running my own company into the ground. When they cut to half time during this year’s Super Bowl, most of us probably thought the game was over. Tom Brady was getting his ass handed to him and I’m sure Arthur Blank had a shit eating grin on his face. What followed was one of the greatest comebacks in the history of the Superbowl. I’m no Tom Brady, but I’m definitely playing much better in the later half of the game than I did in the first. And if my last quarter is anything like Brady’s from this year’s Superbowl, I might just have a few more magic moments up my sleeve. 19. Sometimes It’s The People Who Write You Off That Will Light The Biggest Fire Under Your Ass The first part of my career was pretty much a disaster. Almost every boss I had written me off. After a certain point, it stops being about proving them wrong and proving to yourself that you’re capable of far more. At 39 I’m grateful that they didn’t believe in me. They lit a fire under my ass. 20. Every Hero’s Journey has a Crucible On Christmas day 2014, I spent the morning reading articles about founder depression and suicide. I honestly started to think it would make everyone else’s life easier if I ended mine. I walked to the end of the cul de sac on my parents street and just cried. The self-help books, gratitude interventions, and every other thing I’d learned about positive psychology from 100’s of interviews did nothing for me. But with the help of Brian Koehn, and my therapist I pulled out of it after about 3–4 months. This was my crucible. There are days when my mind still goes into this place, but it passes like waves in the ocean. That’s grief. But eventually, the waves of grief become gentler and more manageable. They go from being what surfers refer to as 6-foot bombs to ankle biters. If you’re in this place, don’t be afraid to ask for help. In your life, there will be moments that touch your heart and others that break it. There will be ones that make you laugh and others that reduce you to tears. There will be moments when you feel invincible and others when it feels as if a stiff wind could blow you over. In our darkest hours, and in the midst of our greatest losses, it’s important that we don’t lose ourselves. The thing about the crucible that’s impossible to realize and recognize while you’re in the midst of it is that nothing will make you stronger. We are greater than any of our losses. 21. Make a list of childhood dreams A few weeks ago I interviewed a professional guitarist named Joe Goodkin. I told him one of the things I wanted to do before my 40th birthday was learn how to play the opening guitar riff to the Guns N Roses song Sweet Child O’ Mine. We all have these really small things that we want to learn to do and it’s worth making a list of them. Some of your childhood dreams can come true in adulthood. You just have to take the time to remember them and write them down. This article is pretty long. If you’d like a PDF version of this article to read later, go here and we’ll email it over. 22. Death is the Ultimate Equalizer of Our Humanity The days of our lives are like sentences. The hours like paragraphs. The months and years like chapters of an ongoing story that unfolds until you take your final breath. When you take that last breath, what you’ll be able to take with you are the hearts you’ve touched, the stories you’ve told, and the difference you’ve made. In the face of death all the layers of social status, fame, and more become completely irrelevant. It’s the ultimate equalizer of our humanity. 23. Some of What You Believe will Change with Age I used to believe in soulmates, and I don’t anymore. The math doesn’t quite work for me. I used to think that what happened in romantic comedies was what relationships were supposed to be like. But a few real life experiences altered that perception. I guess you could say I finally stopped being what my friend Rachel Resnick would call a “love junkie.” It’s not that I don’t believe in chemistry and sparks. I’m just not as quick to let my imagination run riot when it happens. 24. What you Fear Most Will Also Change For a good amount of my 20’s, I had this tremendous fear of ending up alone. After having a couple of girlfriends, that fear went away. I’m almost 40 and I think one thing that scares me the most is that one or both of my parents won’t be around to see what are apparently two of the most important experiences of life: getting married and having kids. At the same time, you probably don’t want to make such an important life decision out of fear. A few weeks ago I had a chance to speak to the director of the Zen Hospice project. So I shared this fear with him and he reminded me to make sure we don’t miss out on enjoying the small moments just because the big ones haven’t happened yet. 25. Parental Advice Contains Some Nuggets of Wisdom Whenever shit hit the fan in my life, my dad would always tell me “whatever happens, it’s for your own good.” Sometimes I wondered if he’d just say this to make me feel better even when this thing that was supposedly for my own good didn’t feel good, was a gigantic screw-up and one more thing to add to my resume of failures. But regardless it always helped, even if it was just a little bit. “Anger is a terrible quality” is another thing my dad has said to me over and over again in my life. I think I can count the number of times he’s been truly angry or yelled at me on two hands. When we say things out of anger, we say things we’ll regret, and we run the risk of doing irreversible damage to our relationships. To top it all off, if we’re angry, pissed off, and a time bomb waiting to go off at any minute, nobody will want to spend time with us. The people who wanted to be with around us will be the ones we hurt the most. 26. What People Make Fun of When You’re Young can Turn into Something They Love When You’re Older I had really big lips when I was a kid. I still do. And sometimes I got made fun of for them. My friend David Falwell even nicknamed me “lips” when we were in the 7th grade. My lips were helpful for learning to play the tuba. That’s probably why I played the tuba because my lips couldn’t fit into any other mouthpiece. As an adult, all the women I’ve kissed seemed thrilled about this (the lips, not the Tuba). If only I’d known this in 7th grade. 27. Working a Job you Hate is Strangely great Preparation for a Job you Love In high school, I worked at McDonald’s for 8 months. I worked for an angry Jamaican lady (which sounds like an oxymoron). Sometime in the first few months, I wanted to quit. My parents refused to let me. I hated that job. But as Robert Greene once said to me “no experience in your life should be thought of as wasted.” There are some good things that come from working a job you truly hate. First, it makes you appreciate the work you love when you finally get to do it. Second, you work much harder at what you love because you’ve experienced something you hate. Third, working a job you hate causes you to remain humble when you finally get to do something you love. 28. Life is like a science experiment Our experiences are data points. To formulate a decent hypothesis we need lots of data points. If you’re in your 20’s and things aren’t going according to the plan, don’t worry. You’re collecting lots of data points. 29. You have to fall before you stand. And you have to stand before you fly At 39 I’m more athletic than I’ve been at any point in my life. In addition to being a surfer, I’m now on avid snowboarder. It’s quite ironic considering my athletic ineptitude throughout junior high and high school. When coach Dave Powers called me on the phone the summer before 8th grade and asked if I was going to come out for football, I was a bit stunned considering I made for nothing more than a great tackling dummy in 7th grade. Getting the hell beat out of me in the hot Texas sun was not my idea of a good time. So I passed on going out for the 8th-grade football team. But Friday Night Lights is one of my favorite TV shows of all time partially because I’ve actually experienced the craziness of Texas Football. The nice thing about board sports is you’re not competing against anybody but yourself. You’re just trying to outdo whatever you did the day before: a higher wave count, bigger wave, or steeper mountain. If there’s anything that board sports teach you about life it’s how to get back up after you fall. This is a useful skill in a life that hasn’t gone according to plan. You have to fall before you stand, and you have to stand before you fly. But once you start flying, there’s no turning back. 30. The Pursuit of Any Goal Transforms Us More Than Its Accomplishment There are always going to be goals that we set but don’t accomplish. That doesn’t mean we shouldn’t set such goals. We learn more from the pursuit of a goal than we do from its accomplishment. It’s the pursuit that changes us. I had a goal to become a NY Times bestselling author. I didn’t accomplish that goal, but in pursuit of it, I transformed many of my habits, behaviors, and beliefs. Transformation is the ultimate purpose any goal. No matter how grand the accomplishment, the buzz and the novelty will eventually wear off. So it’s a lousy way to measure your happiness and satisfaction. But if the transformation sticks, our effort won’t have been in vain. 31. Make a list of big and wildly ambitious things you’ve wanted to do. Here are some of mine: If you’re too afraid to write down your craziest dreams how can you expect them to come true? Every year on New Year’s day I do the following exercise that my friend AJ recommends in the Life and Times of a Remarkable Misfit. Write a 500 word description of what you want your life to look like in 2 years. This will act as your signpost. Then (and here’s the kicker) post it on your blog or email it to someone who will “get it”. It’s hard to go back on a revolution that you’ve already announced. Then I email it to him. My life today bears an almost uncanny resemblance to the version I sent him 2 years ago. 32. Uncertainty = Infinite Possibility If there’s anything I could say to my younger self it would be this. Some of what happens will disappoint you. Some of it will really hurt. Some of it will surprise you Some of it will shock you. Some of it will light your eyes up and put an ear to ear smile on your face. You can’t possibly know how it’s all going to turn out. But in that which is uncertain, that which is possible becomes infinite. 33. The books we’re reading are often reflective of what’s happening in our lives Sometime at the beginning of this year, I ordered a book titled Calling in the One: Seven Weeks to Finding the Love of Your Life. It’s a book for women, but I ordered it because my sister recommended it. It’s been more than seven weeks since I got the book. But in all fairness to the author, I haven’t finished the book or completed all the exercises. The other set of books that have kept showing up are part of what I’ve affectionately titled the billionaire reading project. The premise is simple. Read every book written by, about or recommended by a billionaire. My editor Steph asked what I was hoping to learn. Other than how to become a billionaire?If you learn one thing from a book that you can apply to your life, that makes it worth reading. 34. Swing for the Fences at Least Once a Year Steven Pressfield once said that “you can’t launch a fastball into the upper deck unless you swing for the fences.” So once a year, I swing for the fences. A few years ago it was pitching the folks at Soulpancake on animated series based on our podcast This year it was submitting The Unmistakable Creative to NPR for acquisition. It turns out they have a division where they’re looking for new stories and ideas. When you decide to swing for the fences be careful who you tell. Make sure they’re people who would stand up and do the wave if you do manage to launch one out of the park. 35. Conditional is happiness a bottomless pit If there’s always a condition that must be met in order for us to be happy, we basically won’t be happy until we’re dead. It’s so counterintuitive but if we make our happiness a priority all of these other things fall into place. In the book The Three Laws of Performance, the authors tell the story of an Indian lady who attended the Landmark forum. She’d lost her daughter and her husband had left her. All she had left was her son. Naturally, she was devastated. But her breakthrough left her with a profound insight. She realized that she was denying her son the thing that he needed the most, a happy mother. If you’re a parent, perhaps the best thing you can be for your kid is happy. This is not to downplay the impact of tragedies in our lives. Many of them suck and make us feel like we can’t figure out which way is up or find our way out of the dark. And sometimes during these periods, we simply can’t think or self-help our way out of them. But what we can strive for is unconditional happiness We spend so much of our lives trying to change ourselves and our circumstances. We seek enlightenment and happiness through all that’s external. Books, podcasts, meditation retreats, and more. We perpetually seek outside of ourselves to solve problems and heal wounds, ultimately in the pursuit of whatever we define for ourselves as wealth. But true wealth I’m coming to realize at 39 is more about appreciation than it is accumulation. As Tim Ferriss once said to me “if you don’t appreciate what you have now you’ll never appreciate what you get later.” At 39, I’m a appreciative of living 2 minutes away from the water in Cardiff, the place where 9 years ago I got out of the water and thought to myself “I love this place, and someday I’m going to live here.” We think that happiness is a byproduct of all these external things like when we finally get picked, we finally fall in love, when we get the ultimate promotion, or some big life event takes place. But the more I talk to happiness researchers and social scientists, it appears to be the other way around. All the external things we crave are the byproduct of our happiness. 36. Really Good friends are Like Family Bob Goff once said to me “you have room for about 8 people around your deathbed, 9 if they’re thin. And these are people who have usually loved you well.” Sometimes I think I want to be Bob Goff when I grow up. Best friends are like family members. If you lose them it would be as devastating as losing someone in your family. You don’t need that many, just one or two. 37. Parents Screw Their Kids Up One of my favorite lines in the TV show Parenthood is at the very end when one of the characters is sitting with her dad and he turns to her and says “parents screw their kids up. That’s just what they do.” If you’re not allowed to do something as a kid, you tend to rebel as an adult. One of the things that my parents refused to buy me that was within their means was a skateboard. I begged for months on end only to give up. As an adult, I’ve developed a pathological need to do things that involve tying boards to my feet. I’ve found a lifelong passion for board sports. I’m grateful to my parents for that screw-up. For some strange reason, even though I have no kids, I’ve been asking a lot of guests of the Unmistakable Creative about parenting. When I asked Phillip Mckernan this question he said: “no matter what you do you’re going to fu@#$2 your kids up.” That’s the man who taught me about the pillars of a meaningful life and works with Olympians and billionaires. It turns out that being the best behavioral scientist or performance coach in the world doesn’t make you a perfect parent. Basically, parents have the job of taking someone who is literally helpless, and if all goes well, raising a well adjusted valuable member of society who is hopefully not a total jackass. I think it’s inevitable that any human would screw that up a little bit. I’m quite sure I would in at least a few ways. As Janelle Hanchett once said to me “this is the fatal flaw of our humanity.” 38. The Moment You Think You’ve Made it, You’re Hosed There’s this misconception people have of moments when they think they’ll feel like they’ve finally made it: The truth is that if and when you do get picked, the work is just starting. Creative success or any kind of success is an infinite game. When you get picked you get to keep playing the game. 39. If You Have No Idea What You Want to Do With Your life, Don’t Worry Too Much About It I thought I knew what I wanted to do when I finished school at Berkeley. I wasn’t smart enough to get a job in management consulting or investment banking. So I decided to become a salesperson because it was the only job that would allow me to make the same kind of money. I literally sat at a desk, often using the yellow pages, and made cold calls. It was thinking that I knew what I wanted to do with my life that made the first half of my career pretty miserable. Not knowing what you want to do forces exploration and uncertainty on you. In the long run that will be a good thing. It’s kind of a blessing. Often people who have really interesting careers didn’t have a plan to end up where they did. If you can, have a quarter life crisis instead of a midlife one. It’s probably more cost effective. If you’re looking around and wondering “where do I go from here, what exactly should I do with my life?”, I’d encourage you to consider these wise words of Cheryl Strayed. Trust that all you’ve learned was worth learning, no matter what answer you have or do not have about what practical use it has in your life. Let whatever mysterious starlight that guided you this far guide you onward into the crazy beauty that awaits This starlight will guide you down paths that aren’t well lit, roads that aren’t perfectly paved, and to destinations that aren’t on your itinerary. This is good because you become a traveler on the journey of life instead of a tourist. You become a participant in your life rather than a spectator. Maybe…. You’ll fall in love, get married, build a house in the suburbs and send your kids to amazing schools. You’ll climb the ladder of success right into a corner office with an amazing view and you’ll love every second of it. You’ll build a startup that changes the world or one small part of it You’ll climb the biggest mountains and surf the biggest waves Or maybe nothing will go according to plan and it will be the best thing that’s ever happened to you because you’ll be left with what is one of the most powerful questions to ask yourself at any moment in your life: What’s actually possible? As I wrap up this chapter of my life, as I round the corner for the final stretch of this decade, my 30’s, I can’t help but contemplate this monologue from one of my favorite television characters, Nora Walker Families, like life, have a way of changing, never staying the same, but they’re your family, this eclectic, deeply bonded group. So you evolve, you adapt. And now… As I look at my life and my new extended family, I think of this wonderful quote by George Eliot. ‘It’s never too late to be what you might have been.” Before You Go… I‘ve spent a lot of time studying how some people live and work in a way that truly aligns with their core values. Often, it’s really scary and difficult to know how to get started- many people never take the first step. That’s why I created “The Guide to Optimizing Productivity & Creativity.” The tactics I’ve put in this guide helped me make many of the big changes I detail in the article above. What could it do for your life? Get it here. ", "name": "22", "child": "22_1\t22_2\t22_3\t22_4\t22_5\t22_6\t22_7\t22_8\t22_9\t22_10\t22_11\t22_12\t22_13\t22_14\t22_15\t22_16\t22_17\t22_18\t22_19\t22_20\t22_21\t22_22\t22_23\t22_24\t22_2522_1\t22_2\t22_3\t22_4\t22_5\t22_6\t22_7\t22_8\t22_9\t22_10\t22_11\t22_12\t22_13\t22_14\t22_15\t22_16\t22_17\t22_18\t22_19\t22_20\t22_21\t22_22\t22_23\t22_24\t22_25", "timestamp": "Apr 10"}