{"parent": "", "title": "The Power of Giving", "author": "Darius Foroux", "sentences": [{"58c6": "The Power of Giving"}, {"f7ad": "Note: I recently shared this only with the readers of my newsletter. I thought I’d post it here too."}, {"9121": "Have you heard of the of the reciprocity principle in social psychology?"}, {"e7ea": "It’s a social rule that says people give back what they receive, it was popularized by Robert Cialdini in his book Influence. Everyone has been in that type of situation."}, {"4822": "When you feel obligated to invite that annoying colleague for your birthday, it’s because he/she invited you as well. And you feel like you have to return the favor, right?"}, {"d51e": "Reciprocity is a common technique used by marketers. It’s about giving with the expectation that you get something back."}, {"ef8f": "Altruism is different. Which is basically giving for the sake of giving. You don’t expect anything in return."}, {"0997": "And then there’s reciprocal altruism (originally a term from evolutionary biology), which is what most thought leaders use. People have different terms for it."}, {"98ba": "It comes down to this: Give more than you ask."}, {"30ec": "I like that idea for three reasons."}, {"43df": "The first point is straightforward. You don’t ask someone to sleep with you on the first date, right?"}, {"bfb1": "You also don’t get a promotion without adding value."}, {"53a5": "Or, you don’t just buy a book from any author. It’s only after you’ve read multiple articles or signed up for the newsletter before you consider purchasing the book."}, {"2be3": "Second, we live in a selfish economy. It’s always about me, me, me. People want to sell you all kinds of stuff you don’t need. And they pretend they are giving. But that’s not true."}, {"caa5": "They’ve read some marketing books and try to use ‘giving’ as a sales technique. We see through that because it’s not authentic. Now, it’s totally different when you give without expecting something in return. When you do that, you truly stand out from the crowd."}, {"0e3a": "The third point is often overlooked (the win-win of giving). When I write articles, It’s not only about marketing or giving, it’s also a way to improve my skills."}, {"a177": "It’s a true win-win situation. You get a free article with value. And I improve my thinking, analyzing, and writing skills."}, {"fe1a": "That’s why Seth Godin, one of the most well-known marketing thinkers, recommends everyone to blog for that reason. I agree."}, {"c599": "No matter what you do, there’s one thing you always want to keep in mind. I learned this from my mentor: Life is business."}, {"d954": "So always remember why you do what you do. And never forget to ask."}, {"35db": "There has to be a reason behind what you do. Otherwise, you’re wasting your time."}, {"9f56": "That’s also a basic idea I learned from pragmatist philosophy."}, {"1b33": "Never forget that nothing in life will happen by itself."}, {"465c": "You can’t assume people will always give back. After you give, give, give: Ask."}, {"0e2a": "When you do that, you get a great economy. People give and take. But not everyone does that."}, {"f42d": "Most people prefer to take, take, take. That means if you do give, you stand out from the crowd."}, {"cfba": "You see? When you give more than you take, you will receive more eventually. It’s not about altruism, it’s not about changing the world. It’s about creating a win-win situation."}, {"2daf": "That’s the true power of giving. Try it."}], "content": "The Power of Giving Note: I recently shared this only with the readers of my newsletter. I thought I’d post it here too. Have you heard of the of the reciprocity principle in social psychology? It’s a social rule that says people give back what they receive, it was popularized by Robert Cialdini in his book Influence. Everyone has been in that type of situation. When you feel obligated to invite that annoying colleague for your birthday, it’s because he/she invited you as well. And you feel like you have to return the favor, right? Reciprocity is a common technique used by marketers. It’s about giving with the expectation that you get something back. Altruism is different. Which is basically giving for the sake of giving. You don’t expect anything in return. And then there’s reciprocal altruism (originally a term from evolutionary biology), which is what most thought leaders use. People have different terms for it. It comes down to this: Give more than you ask. I like that idea for three reasons. The first point is straightforward. You don’t ask someone to sleep with you on the first date, right? You also don’t get a promotion without adding value. Or, you don’t just buy a book from any author. It’s only after you’ve read multiple articles or signed up for the newsletter before you consider purchasing the book. Second, we live in a selfish economy. It’s always about me, me, me. People want to sell you all kinds of stuff you don’t need. And they pretend they are giving. But that’s not true. They’ve read some marketing books and try to use ‘giving’ as a sales technique. We see through that because it’s not authentic. Now, it’s totally different when you give without expecting something in return. When you do that, you truly stand out from the crowd. The third point is often overlooked (the win-win of giving). When I write articles, It’s not only about marketing or giving, it’s also a way to improve my skills. It’s a true win-win situation. You get a free article with value. And I improve my thinking, analyzing, and writing skills. That’s why Seth Godin, one of the most well-known marketing thinkers, recommends everyone to blog for that reason. I agree. No matter what you do, there’s one thing you always want to keep in mind. I learned this from my mentor: Life is business. So always remember why you do what you do. And never forget to ask. There has to be a reason behind what you do. Otherwise, you’re wasting your time. That’s also a basic idea I learned from pragmatist philosophy. Never forget that nothing in life will happen by itself. You can’t assume people will always give back. After you give, give, give: Ask. When you do that, you get a great economy. People give and take. But not everyone does that. Most people prefer to take, take, take. That means if you do give, you stand out from the crowd. You see? When you give more than you take, you will receive more eventually. It’s not about altruism, it’s not about changing the world. It’s about creating a win-win situation. That’s the true power of giving. Try it. ", "name": "221", "child": "221_1\t221_2\t221_3\t221_4\t221_5\t221_6\t221_7\t221_8\t221_9\t221_10\t221_11\t221_12\t221_13\t221_14\t221_15\t221_16\t221_17\t221_18\t221_19\t221_20221_1\t221_2\t221_3\t221_4\t221_5\t221_6\t221_7\t221_8\t221_9\t221_10\t221_11\t221_12\t221_13\t221_14\t221_15\t221_16\t221_17\t221_18\t221_19\t221_20", "timestamp": "Feb 14"}