{"parent": "", "title": "The Power of Idea Sex", "author": "James Altucher", "sentences": [{"2ee7": "The Power of Idea Sex"}, {"1a53": "Is Da Vinci a plagiarist? Is Andy Warhol? Is Steve Jobs?"}, {"264d": "How do you take “the greatest story ever told” — a story around thousands of years and has been painted 100s of times, and make it your own?"}, {"f798": "Answer: Idea sex!"}, {"8a46": "The most famous rendition is Da Vinci’s “The Last Supper. ”"}, {"2f70": "Da Vinci was an amateur forensic doctor. He would cut up dead bodies to study, in great detail, all of the musculature, the bone structure, etc."}, {"15cb": "A “Last Supper” painting from the 13th century (see one of the attached images, “supper1”) was mostly two dimensional."}, {"5aa8": "With no talking and no emotions on the faces despite the intensity of the dinner."}, {"f671": "An intensity that has made it “the greatest story ever told” for 2000 years."}, {"dec8": "Da Vinci’s studies of human biology + his constant sketches of people talking in the street + “the greatest story ever told” = one of the most famous paintings in history."}, {"3eb2": "And was Da Vinci’s concept original? Of course not! The story was already 1400 years old and had been painted hundreds of times."}, {"8e6f": "Da Vinci made it his own. It became 100% original with his mastery of idea sex."}, {"d285": "Steve Jobs didn’t invent the phone. The “genre” of the phone had existed for a century. The iPhone is a “phone” in every way."}, {"ccde": "He didn’t invent the MP3 player either. But he combined ideas, moved the genre forward and created his own micro-category which became THE category of smart phones."}, {"51dd": "And “The Last Supper” didn’t stop with Da Vinci."}, {"75ec": "Every industry and art form is the product of thousands of generations of idea sex. Every single one."}, {"b40a": "Check out the images attached to this post."}, {"2a33": "A) Dali’s surreal take:"}, {"576b": "Da Vinci tried to be as realistic as possible."}, {"ef21": "Dali combined surrealism with “The Last Supper”. The transparent, ambisexual blonde Jesus, The ghostlike body floating above. The disciples backs facing us (not done before in prior paintings)."}, {"808f": "B ) Fast forward to Andy Warhol: Da Vinci’s painting + the Warhol-style silk screening of it he made famous in his portraits of Marilyn Monroe and Elvis Presley."}, {"f398": "Pop Art + The Last Supper = multi-million dollar painting."}, {"f095": "Fast forward to one of my favorite TV shows, Battlestar Galactica and their marketing poster based on The Last Supper."}, {"46e1": "C) Battlestar Galactica:"}, {"1bde": "A poster for Battlestar Galactica (see attached) is:"}, {"2029": "the battle between possibly semi-divine Cylons and humans (with a Judas) + Da Vinci’s exact representation = beautiful marketing poster. A work of art."}, {"a69a": "Every idea, every art, every business, is like a wedding dress. Something old, something new."}, {"9692": "The OLD is thousands of years of story, of emotional conditioning, of wars, of sickness, of “rules” to help us conform."}, {"29ad": "The NEW, is you and the pleasure and thoughts and excitements that are uniquely you. What makes YOU happy?"}, {"7fb6": "It’s a party in your brain!"}, {"3ec8": "Do it with art. Do it with business. Do it for fun. Do it for love."}, {"4b9f": "Take an idea from 100 years ago. From yesterday. From 1000 years ago. From your friend."}, {"8bcf": "Tell a story around it in modern terms. Make it uniquely yours."}, {"bb61": "You can even make it a joke."}, {"5451": "News article #1: a mother thrown out of Disney World because she was choking her child."}, {"8cf7": "News article 2: United Airlines beating a passenger up."}, {"8e8b": "1 + 2 = A mother was thrown out of DisneyWorld today for choking her son. Everything turned out ok, though. United hired her the next day."}, {"daf8": "Ok, not quite Louis CK but I’m practicing. Maybe one day I’ll be original."}, {"acc9": "P.S. Oh! I love this one."}, {"66cd": "Another great example of “idea sex” from Battlestar Galactica:"}, {"fab3": "Jimi Hendrix’s “All Along the Watchtower” (written by an obscure songwriter named Bob Dylan and then Hendrix-ized) re-written and performed (and made totally original) by Bear McCreary for the show."}, {"43e4": "So beautiful. Please google it."}, {"1e1c": "Seeing only the top of the pyramid of a work of art, or a business, or an invention, or an idea, misses the beauty of the entire pyramid."}, {"d4ef": "What are some other cool examples?"}, {"231c": "[ Related Reading: How To Make Millions With Idea Sex ]"}, {"8f05": "James Altucher is the author of the bestselling book Choose Yourself, editor at The Altucher Report and host of the popular podcast, The James Altucher Show, which takes you beyond business and entrepreneurship by exploring what it means to be human and achieve well-being in a world that is increasingly complicated. Join the 136,000 readers getting a dose of my best and controversial content. Join here."}], "content": "The Power of Idea Sex Is Da Vinci a plagiarist? Is Andy Warhol? Is Steve Jobs? How do you take “the greatest story ever told” — a story around thousands of years and has been painted 100s of times, and make it your own? Answer: Idea sex! The most famous rendition is Da Vinci’s “The Last Supper. ” Da Vinci was an amateur forensic doctor. He would cut up dead bodies to study, in great detail, all of the musculature, the bone structure, etc. A “Last Supper” painting from the 13th century (see one of the attached images, “supper1”) was mostly two dimensional. With no talking and no emotions on the faces despite the intensity of the dinner. An intensity that has made it “the greatest story ever told” for 2000 years. Da Vinci’s studies of human biology + his constant sketches of people talking in the street + “the greatest story ever told” = one of the most famous paintings in history. And was Da Vinci’s concept original? Of course not! The story was already 1400 years old and had been painted hundreds of times. Da Vinci made it his own. It became 100% original with his mastery of idea sex. Steve Jobs didn’t invent the phone. The “genre” of the phone had existed for a century. The iPhone is a “phone” in every way. He didn’t invent the MP3 player either. But he combined ideas, moved the genre forward and created his own micro-category which became THE category of smart phones. And “The Last Supper” didn’t stop with Da Vinci. Every industry and art form is the product of thousands of generations of idea sex. Every single one. Check out the images attached to this post. A) Dali’s surreal take: Da Vinci tried to be as realistic as possible. Dali combined surrealism with “The Last Supper”. The transparent, ambisexual blonde Jesus, The ghostlike body floating above. The disciples backs facing us (not done before in prior paintings). B ) Fast forward to Andy Warhol: Da Vinci’s painting + the Warhol-style silk screening of it he made famous in his portraits of Marilyn Monroe and Elvis Presley. Pop Art + The Last Supper = multi-million dollar painting. Fast forward to one of my favorite TV shows, Battlestar Galactica and their marketing poster based on The Last Supper. C) Battlestar Galactica: A poster for Battlestar Galactica (see attached) is: the battle between possibly semi-divine Cylons and humans (with a Judas) + Da Vinci’s exact representation = beautiful marketing poster. A work of art. Every idea, every art, every business, is like a wedding dress. Something old, something new. The OLD is thousands of years of story, of emotional conditioning, of wars, of sickness, of “rules” to help us conform. The NEW, is you and the pleasure and thoughts and excitements that are uniquely you. What makes YOU happy? It’s a party in your brain! Do it with art. Do it with business. Do it for fun. Do it for love. Take an idea from 100 years ago. From yesterday. From 1000 years ago. From your friend. Tell a story around it in modern terms. Make it uniquely yours. You can even make it a joke. News article #1: a mother thrown out of Disney World because she was choking her child. News article 2: United Airlines beating a passenger up. 1 + 2 = A mother was thrown out of DisneyWorld today for choking her son. Everything turned out ok, though. United hired her the next day. Ok, not quite Louis CK but I’m practicing. Maybe one day I’ll be original. P.S. Oh! I love this one. Another great example of “idea sex” from Battlestar Galactica: Jimi Hendrix’s “All Along the Watchtower” (written by an obscure songwriter named Bob Dylan and then Hendrix-ized) re-written and performed (and made totally original) by Bear McCreary for the show. So beautiful. Please google it. Seeing only the top of the pyramid of a work of art, or a business, or an invention, or an idea, misses the beauty of the entire pyramid. What are some other cool examples? [ Related Reading: How To Make Millions With Idea Sex ] James Altucher is the author of the bestselling book Choose Yourself, editor at The Altucher Report and host of the popular podcast, The James Altucher Show, which takes you beyond business and entrepreneurship by exploring what it means to be human and achieve well-being in a world that is increasingly complicated. Join the 136,000 readers getting a dose of my best and controversial content. Join here. ", "name": "224", "child": "224_1\t224_2\t224_3\t224_4\t224_5224_1\t224_2\t224_3\t224_4\t224_5", "timestamp": "Apr 14"}