{"parent": "", "title": "Let’s put this myth about MBAs to bed.", "author": "Alex Taussig", "sentences": [{"d7a5": "Let’s put this myth about MBAs to bed."}, {"45c1": "Silicon Valley has created a myth around MBAs. The myth is…well, Google autocomplete pretty much sums it up:"}, {"e802": "People who buy into this myth see MBAs as the antithesis of what Silicon Valley values — contrarian thought, resourcefulness, the capacity to build stuff, etc."}, {"8ad9": "Along those lines, Y-Combinator co-founder Paul Graham (PG) tweeted yesterday:"}, {"6a8b": "Few entities have funded more successful seed stage startups than Y-Combinator, and I have immense respect for the organization that PG has co-created. That said, I respectfully disagree that “so few really big startups [are] founded by MBAs.” It’s a myth that we can put to bed right now."}, {"8650": "Let’s start with Harvard Business School. I graduated in 2009 at the beginning of the recession. It turned out to be a great time to start companies. I’ve compiled a list of startups who came directly out of HBS from 2009–11. Together, I estimate these companies are worth somewhere in excess of $5 billion (probably closer to $10 billion), including several potential IPO candidates and businesses with annual revenue over $100 million:"}, {"f9ff": "In more recent cohorts, we see some younger HBS companies that have the potential to achieve breakout success as well. For instance, HBS 2013 launched Dia&Co ($20M raised), Farmers Business Network ($84M raised), and Handy* ($111M raised)."}, {"71f4": "Outside of HBS, there are other great examples of valuable companies started directly out of business school. I haven’t spent enough time to develop a comprehensive list, but here’s a few off the top of my head:"}, {"f728": "Our friends at NextView Ventures did a more comprehensive study of the MBA startup ecosystem that I’d encourage you to read here."}, {"7dec": "I find it strange that we keep reiterating this myth when there is clearly evidence to the contrary. Billions of market capitalization have been created in the last decade by more than a dozen startups founded from these three business schools alone. Instead of disqualifying entrepreneurs by their choice of a career path, we should affirm that there is no “one path” to building a company. The data proves it out."}, {"c272": "If you’re an MBA with a great team and an innovative idea, hit me up. I will be at Stanford GSB on 4/20 helping teach an Entrepreneurial Finance class, and I will be at HBS on 4/25 judging the finals of the New Venture Competition. Hope to see you there!"}, {"6d34": "* Disclaimer: I have an economic interest in these companies as a partner at Lightspeed or a prior fund."}, {"eaa6": "☞ Sign up for my newsletter “Drinking from the Firehose” here: http://tinyletter.com/ataussig"}, {"1e2d": "☞ Also, show me some love by clicking “♥︎” to help to promote this piece to others and following me on Medium."}, {"66fd": "☞ Or, if you want to continue the discussion, please leave a response below."}], "content": "Let’s put this myth about MBAs to bed. Silicon Valley has created a myth around MBAs. The myth is…well, Google autocomplete pretty much sums it up: People who buy into this myth see MBAs as the antithesis of what Silicon Valley values — contrarian thought, resourcefulness, the capacity to build stuff, etc. Along those lines, Y-Combinator co-founder Paul Graham (PG) tweeted yesterday: Few entities have funded more successful seed stage startups than Y-Combinator, and I have immense respect for the organization that PG has co-created. That said, I respectfully disagree that “so few really big startups [are] founded by MBAs.” It’s a myth that we can put to bed right now. Let’s start with Harvard Business School. I graduated in 2009 at the beginning of the recession. It turned out to be a great time to start companies. I’ve compiled a list of startups who came directly out of HBS from 2009–11. Together, I estimate these companies are worth somewhere in excess of $5 billion (probably closer to $10 billion), including several potential IPO candidates and businesses with annual revenue over $100 million: In more recent cohorts, we see some younger HBS companies that have the potential to achieve breakout success as well. For instance, HBS 2013 launched Dia&Co ($20M raised), Farmers Business Network ($84M raised), and Handy* ($111M raised). Outside of HBS, there are other great examples of valuable companies started directly out of business school. I haven’t spent enough time to develop a comprehensive list, but here’s a few off the top of my head: Our friends at NextView Ventures did a more comprehensive study of the MBA startup ecosystem that I’d encourage you to read here. I find it strange that we keep reiterating this myth when there is clearly evidence to the contrary. Billions of market capitalization have been created in the last decade by more than a dozen startups founded from these three business schools alone. Instead of disqualifying entrepreneurs by their choice of a career path, we should affirm that there is no “one path” to building a company. The data proves it out. If you’re an MBA with a great team and an innovative idea, hit me up. I will be at Stanford GSB on 4/20 helping teach an Entrepreneurial Finance class, and I will be at HBS on 4/25 judging the finals of the New Venture Competition. Hope to see you there! * Disclaimer: I have an economic interest in these companies as a partner at Lightspeed or a prior fund. ☞ Sign up for my newsletter “Drinking from the Firehose” here: http://tinyletter.com/ataussig ☞ Also, show me some love by clicking “♥︎” to help to promote this piece to others and following me on Medium. ☞ Or, if you want to continue the discussion, please leave a response below. ", "name": "226", "child": "226_1\t226_2\t226_3\t226_4226_1\t226_2\t226_3\t226_4", "timestamp": "Apr 14"}