{"parent": "", "title": "The Ultimate Guide To Achieving Peak Performance In Life", "author": "James Altucher", "sentences": [{"11c3": "The Ultimate Guide To Achieving Peak Performance In Life"}, {"9f89": "(rules, “non-rules”, and bibliography and a “tl;dr” for each section)"}, {"e62c": "I wanted to get better at poker. I showed up at the local underground club and within ten minutes I was out $1000 and I went home."}, {"02a0": "My wife said, “Did they scam you?” My sister said, “Was it mafia?”"}, {"1d94": "No. I sucked."}, {"15c4": "I went back the next day. Lost another $500. The next day. Another $500. I could tell people were looking at each other when I walked into the club. They were happy."}, {"6cbb": "A year later a movie was made based on that club.”Rounders.” In “Rounders” they say, “If you can’t spot the fish at the table, then you are the fish.”"}, {"0609": "I was the fish."}, {"c638": "So I did what I did with any game or business or activity I’ve ever tried to master. I’ll describe below."}, {"0f2d": "Mastery has a language to it. Speak that language and you will learn how to master anything you have some degree of talent in."}, {"cdd6": "I’ve succeeded and failed at many things. Many games. Many rises and falls in financial success. I’ve helped run businesses with a billion in revenues."}, {"8464": "And I’ve built from scratch, with no fundraising, companies with tens of millions in revenues."}, {"410a": "I’m a ranked chess master. I’m bad at relationships (I keep trying to succeed but just don’t know how, I think. Although maybe I’m getting better)."}, {"2257": "And if you aren’t improving, you’re dying. I always want to try to get better at new things."}, {"80cf": "Next Tuesday I’m going to do standup comedy. I’m also in the middle of pitching a TV show and writing a novel and I’m building my business."}, {"d318": "Some things will fail and some will succeed. But I’m using the techniques I describe below."}, {"9b65": "First, I had to define “success” for myself. It’s a different definition for everyone."}, {"88e1": "Let’s get specific."}, {"b3ad": "QUICK GUIDE TO WHAT SUCCESS IS"}, {"274b": "A) FINANCIAL success is a good metric."}, {"d150": "Not because life is about money."}, {"4465": "But money tells you if you are good enough that people are willing to spend their hard earned dollars on you rather than the other seven billion people."}, {"9db3": "Example: the most successful show of all time is Seinfeld. How do I know? Because Larry David and Jerry Seinfeld made about 900 million dollars each from it."}, {"1f66": "One time I was visiting a hedge fund that managed John Grisham’s money. They told me, “Every time John Grisham writes a book we get another $20 million to invest.”"}, {"8e1c": "This doesn’t mean John Grisham should win the Nobel Prize in Literature. But it does mean if his goal is to have a lot of people love what he writes, then he is very successful."}, {"6c45": "B) RANKING"}, {"4263": "Magnus Carlsen is the World Chess Champion. When there are tournaments that give you a rank then you know exactly who the Alpha person is, who the Omega person is, and everyone in between."}, {"a662": "In chess there is a numerical ranking system. The average player on the street has a “rating” of about 1000. The average tournament player has a rating of about 1500. A Master has a rating of about 2200. A Grandmaster about 2500. And Magnus is close to 2800."}, {"798e": "This is rough, but every 100 points difference means the higher rated player will beat the lower one two out of three times."}, {"9259": "Tennis has a ranking system. Golf has one."}, {"3748": "Writing novels has a ranking system. You can use your Amazon rank to measure sales. Or you can win awards to measure quality among the elite."}, {"a36f": "Corporations have a ranking system: salaries and titles. They understand this is how tribes work and that everyone wants to know where they fit into the tribe."}, {"4cc5": "We are built to want success in a tribe based on the chemicals in our brain."}, {"b8ae": "So find the category that is your tribe. Then you can find success in the ranking system of that tribe. But only AFTER you speak the Language of Mastery."}, {"9484": "A quick guide to chemical success:"}, {"8624": "– SEROTONIN spikes when you move up in the tribe (most anti-depressants work off of Serotonin). When you get promoted at your job Serotonin spikes."}, {"8d71": "– DOPAMINE works when there is POTENTIAL to move up in the tribe (amphetamines and cocaine take advantage of this. The “hope” is often more powerful than the actual result)."}, {"dbde": "When you start a new job where you think there is a lot of potential, dopamine spikes."}, {"b303": "– OXYTOCIN spikes when you feel comfortable with your place in the tribe. (For instance, when women are in labor with a baby, their oxytocin spikes. They are adding to the tribe)."}, {"661b": "The benefit of being a modern human is that there is not one tribe. You can CHOOSE your tribe."}, {"d21e": "If I’m bad at salsa dancing (stress spikes instead of the “happy chemicals”) I can switch back to my chess tournaments."}, {"2b01": "If I don’t like my job, I can look for a new one, or start a business (or gig) on the side and take control of my own oxytocin."}, {"5bef": "Choose your tribe wisely. We’re all bags of chemistry and we want to maximize those chemicals."}, {"dda0": "[ RELATED READING: 10 Unusual Ways to Release Oxytocin Into Your Life ]"}, {"b0a0": "This is what works for me:"}, {"15a8": "A) LOVE"}, {"3ef5": "This is the obvious one."}, {"7205": "You will only succeed what you love doing. Take two people who are just starting out. One loves it, the other doesn’t. Who will win?"}, {"73b5": "Take out talent for a second (a 6′7″ person will play better basketball than a 4′ person…just because)."}, {"6e65": "The one who loves something will have heroes .Will see the subtleties in their heroes works. Will see the artistry and, most important, will see the difference between a beginner (which is what we all are when we start something we love) and a master."}, {"1b97": "And even the masters return to the basics to keep recapturing the love."}, {"e14b": "tl;dr"}, {"61f0": "When you love something, you know at the beginning you are bad because you have TASTE. But you strive to improve."}, {"f9f6": "B) PLUS, MINUS, EQUAL"}, {"33d2": "PLUS: Find a mentor: this can be a virtual mentor (someone you read about). Or it can be a real mentor (a coach)."}, {"4944": "When I was 17 I wanted to get better at chess. I was awful."}, {"d1e0": "I had many virtual mentors (I LOVED studying the games of Kasparov, Tal, Alekhine, Fischer)"}, {"fff7": "AND I had a coach (first Sammy Reshevsky, then Michael Wilder, and John Fedorowicz. All strong professional players. Reshevsky at one point had been the best in the world). I would study with a coach up to 3x a week."}, {"047b": "The benefits of a coach:"}, {"0340": "– They know the latest learning techniques. So a student can learn much faster with a coach."}, {"d9d1": "– They give feedback. This is the only case where repetition is good. You do something, you get feedback, you do again. This is what Anders Ericsson (the god father of Mastery and the creator of the so-called “10,000 hour rule”) calls “deliberate practice.”"}, {"cfc9": "Anders, who has been on my podcast, has trained everyone from chess champions to tennis champions, scrabble, memory, violin, etc. See reading list below."}, {"2af9": "But you see this in every great master."}, {"98f1": "Mozart learned first from his father, who was a professional composer."}, {"929d": "Serena and Venus Williams had their father and then many coaches."}, {"86fe": "Magnus Carlsen, the current world chess champion, had Garry Kasparov (who is coming on my podcast next week. Yay!), as his coach for awhile."}, {"9a6c": "Hemingway had Gertrude Stein and then Maxwell Perkins, to help him learn the subtleties of minimalism in writing, which was a new form then (and thus, he created his category so he could be #1 in it)."}, {"4e6c": "Elon Musk decided to make a rocket. So he read many books on rocket science (virtual mentors) and then started hiring and conferring with the best rocket scientists in the world."}, {"d75f": "Now he sends rockets into space."}, {"0991": "A good friend of mine is doing a project: she started with no understanding of the rules of poker. She hired the best player in the world to give her lessons. Now, nine months later, she is competitive. And still learning. She is writing a book on the process which I know will be a bestseller."}, {"f39b": "EQUAL:"}, {"4e25": "Find people about equal to you to challenge you."}, {"32cf": "To get better at tennis, you can’t just play your coach. You have to play people who are also trying to achieve mastery, who are at about your level."}, {"b13b": "You will constantly find new ways to improve over each other to be better. You will challenge each other. This will result in the entire group being better."}, {"1d31": "If you look at the history of the art world, it’s always through the development of groups that are then labeled by their particular style (cubism, surrealism, pop, etc)"}, {"f590": "Same with literature."}, {"5a94": "And in something like chess, location was often away to find equals. For many years, the old Soviet Union would scour the country for the most talented young people and throw them into school together."}, {"43a3": "So for about 60 years, the Soviet Union dominated the world of chess because no other country used the “Power of Equal”."}, {"e510": "MINUS:"}, {"0219": "You get better when you teach what you’ve been learning. How come?"}, {"91bf": "It helps you remember and solidify the teachings.Students often ask questions with beginner’s mind that helps you learn more subtleties of your craft.Many great writers were once professors, for instance (Kurt Vonnegut, Raymond Carver, Tobias Wolff, Toni Morrison, Joyce Carol Oates, etc)."}, {"8e71": "Many great scientists were professors (Einstein, John Von Neumann, Craig Venter, etc)."}, {"8e68": "In Zen, it’s a common adage to keep getting back to “beginner’s mind” so you keep relearning and understanding at a deeper level the subtleties of what you love. MINUS, is a way to recapture that beginner’s mind."}, {"afa0": "A great example is two different world chess champions: Jose Capablanca and Bobby Fischer writing chess books for beginners (“Chess Fundamentals” and “Bobby Fischer Teaches Chess”)."}, {"a742": "C) HISTORY"}, {"7b2b": "You can’t get better at what you love unless you learn the history."}, {"1b6b": "Again, I will use chess as an example since it is both difficult (it takes ten years for the average player to become a Master) and it has a clear ranking system where everyone knows their place."}, {"de41": "Bobby Fischer was once an average, talented, young player."}, {"427a": "Then he disappeared."}, {"916f": "For a year he studied all the games played in the 1800s. ALL OF THEM."}, {"8631": "And he found improvements on each game. How the world champions of the 1850s could’ve played better."}, {"7f9e": "When he came back, he would steer his opponents into these “antique” positions from 100 years earlier. They laughed at him."}, {"8dce": "This was part ONE."}, {"42b6": "Then he learned Russian. He started getting the Russian chess magazines shipped to him."}, {"73b4": "He studied every game played by the Russians and their heroes. He found improvements in their games."}, {"b7c8": "He had his coach at the time (the famous coach of many young players back then: John Collins)."}, {"fa17": "Then he came back."}, {"464f": "He won every game. He became the youngest grandmaster in history. He became the first person to win every game in a US Championship. Not even a draw."}, {"b7a4": "Then on his rise to the world championship, he was beating the best players 6–0 in matches (twice in a row). No draws."}, {"5b51": "And then he even gave one game odds to the world champion (Spassky) and still won the match."}, {"e73f": "Then he went crazy. But that’s another story."}, {"1a3d": "Can this work at a job? Of course."}, {"798b": "– Learn how the industry started– Learn how the company started and competed and had its first successes– Learn how the executives made their mark on the company to rise up. — Learn how executives in other companies made their mark."}, {"ae3c": "When I was at HBO, I loved it. LOVED it. I did the above."}, {"eaad": "I learned everything about entertainment and TV. I learned everything about HBO. I would borrow tapes from the HBO library and go home and watch every show they ever did."}, {"96cc": "Did I rise up at HBO. No. But I was a small programmer in the IT department. I ended building their website, pitching a TV show and getting money to shoot a pilot."}, {"3a8b": "And then I started a company building websites for almost every company in the entertainment industry. HBO was my biggest client."}, {"7635": "Does this mean I failed at HBO? No. You learn, you reinvent. You learn more. You reinvent more. There’s no one path."}, {"e09f": "[ RELATED READING: Financial Fridays: Why Today Is The Day You Have To Reinvent Yourself ]"}, {"074b": "There is always: improve or die."}, {"91b4": "Be willing to change your definition of success as you get better. Because as you get better you will have more clear eyes on what success means for you."}, {"a646": "I spoke with Josh Foer once. He was the US Memory Champion."}, {"a867": "He studied the techniques of all the memory champions before him, dating back thousands of years."}, {"06f7": "He studied with a coach (Anders Ericsson and Ed Cooke, a prior memory champion)."}, {"5506": "And he wrote the bestseller “Moonwalking with Einstein” documenting his path to the championship."}, {"e7fd": "Does this work in marketing? Even though SEO and Facebook ads didn’t exist 20 years ago?"}, {"e848": "Yes. This works for EVERYTHING."}, {"0559": "Study the history of copywriting. Study the history of direct marketing. Study the history of cognitive biases."}, {"c164": "Even study the life story of Emmanual Juius Haldemann, the man who sold 500,000,000 “Little Blue Books” in the 1920s to see how he would change titles of his books to up sales."}, {"fed5": "Does this work for language development? Of course!"}, {"d65b": "Those who study the roots of a language (learning Latin, for instance) will have a much easier time learning a new language (French)."}, {"a146": "tl;dr — Studying the history of any field is the magic bullet for master."}, {"87f0": "D) TALENT"}, {"1f3e": "Is there such a thing as talent?"}, {"bdb0": "Yes. Let’s forget about physical talent for a second (the basketball example above)."}, {"0caf": "I once knew a kid, Jorge Zamora, who I would watch play chess when he was 11 years old. He’d crush older grandmasters and barely look like he was paying attention."}, {"7bfd": "When I would speak about chess with him, it was like talking about physics with a 50 year old Nobel prize winner."}, {"71fb": "I don’t know what he had. I don’t know how to define talent. Is it something in the brain?"}, {"6b1e": "I don’t know. But it gave him a head start. For all I know, he was the most talented chess player in history. And his brother (my roommate at the time) was a strong master, as was his father. So it ran in the family."}, {"1860": "Did he use his talent?"}, {"720e": "Sadly, no. I’m not sure what it was. Some people told me he couldn’t handle losing very well. Or the pressure of being such a prodigy."}, {"8377": "A similarly-developed prodigy, Magnus Carlsen, became World Champion. Not sure where Jorge is now."}, {"2d3d": "So two questions arise:"}, {"00d8": "– How do you know what you are talented at?"}, {"fa04": "Fortunately we are all talented at many things. Even though 100% of us will be bad at first (Michael Jordan, immensely talented, didn’t make his high school basketball team)."}, {"6caf": "The other day a friend of mine asked me to help him make notes for a script for a pilot that a major network bought."}, {"34ab": "I spent all day on it. I made suggestions on the dialogue, the plot, specific scenes, etc. I LOVED it. It made my heart go on fire."}, {"cb6f": "He took my suggestions, and we spoke all day on the phone back and forth about the ideas. I loved every minute."}, {"42fc": "Does this mean I am talented at this? I have no idea. But that’s the clue."}, {"5111": "Try things so you can find the clues. Then the clues will lead you to your talents."}, {"0bd9": "A little child doesn’t ask, “What’s my purpose?”"}, {"ee1a": "That would be an idiot question. A little child does what he or she loves. And does them obsessively. That’s how talent becomes skill."}, {"5df8": "tl;dr –"}, {"cdb2": "Do lots of things. See what you love. Do the things you love again. Don’t do the things you don’t love."}, {"a546": "What if you have no talents?"}, {"9e39": "That’s ok also. You might love something but have no talent. It doesn’t mean you can’t enjoy the subtleties of mastery."}, {"fad6": "I love chess. I love poker. I love business. I love writing."}, {"442b": "I might not be talented enough to be the best in the world at any of them."}, {"0cec": "But, by doing the techniques I listed here, I am able to achieve some level of mastery. The benefits to this are immense."}, {"3076": "One time I was in Argentina. The best chess club in the world is in Buenos Aires. I went there and they wouldn’t let me in. Private, they said."}, {"baf6": "My friend told them my ranking. They let me right in. I played the Argentina Junior Champion who was hanging out upstairs. I won one and he won one. We played and drank coffee with each other all night."}, {"cb64": "Mastery leads to community leads to friendship across the language of the mastery you both share."}, {"9605": "The Buenos Aires Chess club was the home of the famous Fischer-Petrosian and Alekhine-Capablanca matches. They gave me a tour of where those great players once played."}, {"7874": "Mastery gave me pleasure. Even if I will never be the best because I don’t have the talent."}, {"16d3": "tl;dr — if you love something but don’t have enough talent, find new ways to measure success in what you love."}, {"4991": "E) THE LUCK RULE. (OR….THE DAILY PRACTICE)"}, {"14d4": "You get luck from energy. Period."}, {"ab27": "I love to write. I write very day. Sometimes I write poorly and sometimes I write well. You can never predict."}, {"8d64": "But I know this: when I have no fuel, I can’t write. My productivity goes from 100 to, sometimes, 0, or worse."}, {"1785": "Worse than 0 means your life is out of control. This has happened to me many times. Relationships causing me much anger and stress. Businesses going broke. Losing a home. Getting sick, etc."}, {"030c": "I looked back at everything I tried to get good at and found similarities between the times I had a lot of energy and the times I didn’t."}, {"2f89": "The times I had energy was when I had the most luck."}, {"0d1e": "Here’s how I refueled so I could get as much luck every day. This is my Daily Practice:"}, {"8f5d": "PHYSICAL: Sleep eight hours, eat well (as little snacking as possible), move (walk a few miles a day or some sort of movement or gym or yoga or whatever you do)."}, {"cea6": "EMOTIONAL: Be around people who love and support your successes. Love and support their successes."}, {"4bed": "Mike Massimino, the astronaut who fixed the Hubble Space Telescope once told me about an MIT robotics class he took. “Four of the ten people in that class made it into space.”"}, {"1300": "Only a few dozen people out of billions have made it into space."}, {"1eaf": "If Mike been in a random bar in Boston there is zero chance he could’ve said, “4 out of 10 people in this bar will go into outer space”."}, {"1ed1": "Find your ten."}, {"78cb": "CREATIVE: In every field in life, the people who can do the unexpected, wins."}, {"013a": "The “unexpected” comes from creativity. Creativity is a muscle. Creativity is a practice."}, {"af17": "Jerry Seinfeld talks in the documentary “Comedian” how he never “breaks the chain”. He writes jokes every day. Louis CK develops an entire new act every year. This is how he does an entirely new special each year. He probably makes 20 to 30 million per special."}, {"ae63": "I watched him shoot his latest special. I was laughing so hard I thought I would have to leave the hall, my stomach was hurting so much."}, {"c04e": "What if you don’t know yet what you want to be creative on?"}, {"ab17": "No problem, write ten ideas a day."}, {"09d2": "What do you write about? Anything you want. Yesterday I wrote, “ten things I learned from delivering pizza when I was 19”."}, {"8db1": "The day before that I wrote “ten ideas for a TV show”. The day before that I wrote “ten chapter titles for a novel”. The day before that “ten products I can invent”."}, {"716c": "Were they good ideas? Of course not! 99.999% or 100% SUCKED."}, {"ac06": "It’s just exercise. Lift weights every day to get muscle mass and build a great body and break down older muscle (older habits, in the case of creativity)."}, {"4a7c": "This is how when you need to pull “the unexpected” (the only way to win a game, the only way to sell, the only way to beat the markets, the only way to to be a leader). you will have the muscle developed."}, {"0d6d": "But isn’t execution everything?"}, {"5cdf": "Of course! But:"}, {"7da9": "1) You need something to execute on."}, {"8dc3": "2) Execution ideas are a subset of ideas You need to be creative about the easiest ways to execute. So you need that creativity muscle be an IDEA MACHINE before you can execute ."}, {"9166": "tl;dr Write TEN IDEAS A DAY for six months and you will be an idea machine."}, {"a2a0": "SPIRITUAL: Fill in the blank here. Some people believe in a higher power. Some people meditate."}, {"9534": "The key is to know when to put regrets and anxieties to the side and learn to appreciate the moment. To love the moment, so you have fuel to infuse the moment with everything in you."}, {"f40d": "THE DAILY PRACTICE tl;dr Every day before you go to sleep ask: “What did I do to improve my physical, emotional, creative, and spiritual health?” Without this, you will not have the energy for mastery."}, {"61a1": "Luck favors the energetic."}, {"ae2c": "F) THE 5/25 RULE"}, {"c3e2": "Warren Buffett taught me this one. The benefit of studying history and virtual mentors."}, {"5cce": "I made such a study of everything Warren Buffett did that I wrote a book in 2005, “Trade Like Warren Buffett”. I studied private letters nobody had ever publicized before."}, {"802d": "“Promise me,” said the hedge fund manager who gave me the private letters, “you won’t write about this.”"}, {"989e": "“I promise,” I said."}, {"39b8": "But I’m sorry, Whitney. They were just too good. I wrote a whole book about them."}, {"b12d": "The 5/25 Rule of Buffett:"}, {"7597": "List the 25 things you love the mostPut the top 5 on the left, put the bottom 20 on the right.NEVER EVER EVER AGAIN NEVER LOOK AT THE BOTTOM 20.How come? Because you love the bottom 20. They are in your top 25. Of course you love them."}, {"2d60": "But every time you look at them, you won’t put your full energy into them (because, after all, they are not in your top 5), and you will sacrifice energy you could’ve put into your top 5."}, {"1513": "This rule is critical."}, {"f3c4": "Why is it 5? Why not your “top 1”. Isn’t focus about your “top 1”?"}, {"fc96": "“Focus on one thing” is the worst advice ever."}, {"9a21": "Because of:"}, {"9628": "G) MASTERY SEX (or HOW TO SHORTCUT THE 10,000 RULE)."}, {"e920": "It’s really hard to be the best athlete in the world."}, {"4349": "It’s really hard to be the best writer in the world."}, {"b971": "Matthew Berry was a pretty good screenwriter in Hollywood (look him up on IMDB. You’ll recognize the movies but maybe you never watched them)."}, {"e61b": "He also was pretty good at fantasy sports. He was on a few teams. People sought him out for advice."}, {"129f": "He quit his job in Hollywood after an argument with an actor over “the worst script ever.” He hated it."}, {"ac42": "He started blogging for $100 a post at a fantasy sports blog."}, {"13ab": "Because he had professional experience writing, he quickly became the best writer in the fantasy sports business."}, {"df5c": "He built his own major fantasy sports blog. ESPN bought it."}, {"3314": "Now he’s the only anchor for Fantasy Sports in the world, on ESPN. When I walk with him in the street, people stop him and say, “Thank you!”."}, {"dbdf": "He got pretty good at one thing. Pretty good at another thing. And became the BEST IN THE WORLD AT THE INTERSECTION."}, {"6ce5": "Scott Adams has written about the also. He calls it a “talent stack.”"}, {"1b82": "I called him and asked him about it."}, {"7028": "He said, “I’m not the funniest guy in the world. But I’m ok. And I’m not the best illustrator in the world. But I’m ok.”"}, {"cba2": "He started drawing about his experiences in the corporate world. The hypocrisy of it. It caught on with the other 100,000,000 people who work in cubicles."}, {"3497": "His cartoon, Dilbert, is now syndicated in 2000 newspapers. He has over a dozen books. He’s sitting on top of a $100,000,000 cartoon empire."}, {"29da": "I love this scene from the trailer of the Justice League: The Flash asks Bruce Wayne / Batman, “uhh, what are your super powers again?”"}, {"7120": "Batman is famous for not having any but still performing at the level of a superhero."}, {"b5e7": "Bruce Wayne looks over at the Flash and says, “I’m rich”."}, {"7a62": "Which is funny."}, {"a1f9": "But maybe not the answer. Bruce Wayne put his money into the top scientists who can build him non-stop wearable weapons. And he also trained his entire life to be at peak physical potential (even if he’s not the best athlete in the world)."}, {"3855": "The combination, plus his study of detective skills, makes him a superhero. The best in the world at what he does. The head of the Justice League."}, {"0ee8": "H) THE POWER OF NO AND YES"}, {"09d0": "I wrote a book about the power of “no”. Not because I was an expert sat saying “NO’. But because I needed to learn how to do it better."}, {"1d2e": "Every “NO” you say is a success. It means you have more time to do what you love."}, {"9d09": "Over years I’ve made my life so I can make as many “success” choices a day as possible."}, {"9170": "I donated all of my belongings. Everything. Even extra money I send over to savings for my kids or I donate it."}, {"1cab": "I never buy anything new. I don’t collect anything. I don’t like to travel. I don’t rent. I just live in Airbnbs so I never have to deal with furniture, paperwork, cooking (I always order delivery), and it limits the number of things I can get tempted by because I move around and that always keeps a cap on my possessions."}, {"76f1": "I say “no” to almost all social media (except Quora and except anything that helps me distribute my writing). I say “no” to almost all coffees or meals except with close friends."}, {"5728": "So now almost all of my choices throughout the day have to do with the things I love: writing, podcasting, some business to keep things going. Oh, and games."}, {"3257": "It took a long time. Years. So that I ONLY have the choice of making this set of choices. It was really painful. I miss many things I threw out. But life (to me) isn’t about being happy all the time."}, {"08f6": "It’s about setting my heart on fire as much as possible. Doing what I love even if they cause pain on occasion."}, {"d31f": "BUT, I do say “yes” to adventures I think will add to my life."}, {"8d5e": "I used to live in the Chelsea Hotel in NYC. They closed for renovations in 2013. A 130 year old beautiful building with a history that includes almost every artist and writer who ever lived in NYC has closed down."}, {"f986": "Except for one room. One guy is suing and is staying."}, {"ff1a": "I lived there for six years. But hadn’t been back. The other day I heard he was hosting a poker game. I was invited. “YES!” I went even though it meant staying up very late for me."}, {"5531": "I got to see the insides of my old home which held so many of my most intense memories. Every floor was all ripped up. Wires everywhere. The artwork on the walls all gone."}, {"2984": "Then I got to Tony’s room. He had kept the old favor. We played poker all night. Everyone there was an artist of some sort. There was a standup comedian there as well. She gave me advice about my upcoming attempt at standup."}, {"0139": "It was an adventure. It was a good “YES”."}, {"14b6": "When you say “NO” to 99% of things, you leave room for a good “YES” that can add to the things you want to master."}, {"e62b": "tl;dr You only have one life. Say “NO” to everything except the things you love. You can’t always do this. But try."}, {"ee28": "[RELATED READING: How Minimalism Brought Me Freedom and Joy ]"}, {"74bb": "I) MASTER WHAT FASCINATES YOU"}, {"84b1": "20 years ago, nobody had a passion for self-driving cars."}, {"9d4f": "They were only part of science fiction novels. And a tv series called “The Jetsons”."}, {"c4ed": "Now, it’s already becoming a major industry. People who master it will get very wealthy."}, {"3078": "How could they have known?"}, {"139a": "I was talking to Brian Koppelman. Such a great writer. He and his partner, David Levien, wrote the script for “Rounders” and one of my favorite movies, “A Solitary Man”. They also write the show “Billions”, which has become a breakout hit."}, {"0f79": "He told me, “Don’t write what you know”. Which is funny because that is ALWAYS the advice about writing."}, {"1704": "He said, “Write what fascinates you”."}, {"ebc7": "You might not have all the knowledge or qualifications. That’s ok, your fascination will give you perspectives and intensity nobody else has."}, {"5392": "Dan Carlin, host of the successful podcast “Hardcore History” is not a professional historian. He has no degree in it.But he does the work and now has the most successful podcast about history."}, {"0c59": "More people will get their history educations from Dan than from school."}, {"aa1b": "Kamal Ravikant, venture capitalist, best-selling writer and novelist, and accomplished salsa dancer, once said, “If I only did what I know I’d be a janitor someplace.”"}, {"11ec": "Nothing wrong with that. But…"}, {"6150": "Fascination opens up the imagination. The imagination is what creates action. Action creates the future."}, {"e301": "And suddenly what once fascinated you, has become reality. And you are the master."}, {"9b87": "tl;dr — ignore the advice “write what you know.” Kids are curious. They follow their curiosity. Be like a kid."}, {"5685": "J) THREE HOURS A DAY"}, {"2e42": "People confuse hours for productivity."}, {"56ae": "Someone asked me yesterday, how do you do all the things you do. You seem very productive."}, {"699d": "I am actually very lazy. I like to nap when I can. I watch my favorite TV shows often. I like to walk around and do nothing. I talk to my friends on the phone."}, {"49a0": "Someone asked Anatoly Karpov, how much time do you spend studying chess every day. He was world chess champion from 1975 until 1985, and stayed in the top 10 for another 15 years."}, {"c44d": "“Three hours a day,” he said."}, {"70c2": "Ever since he said that, I view that as a maximum on how much time I can spend on my #1 thing I love."}, {"21a6": "The rest of the time is devoted to refueling my energy, practicing my creativity, saying yes to adventures, spending time with people I love, finding things on youtube I can laugh at (since laughter is proven to have all sorts of health and psychology benefits)."}, {"4d82": "A friend of mine is the #1 book cover designer in the world. I’ve seen her in action. She lays out 100s of book covers and stares at them."}, {"7107": "She tries ideas out. She then physically backs off from the computer and shakes her head and her body and turns around and then re-looks at her work. Then she repeats."}, {"5711": "I’ve never seen her work on a design for more than two or three hours a day. The last cover she designed (my book, “Reinvent Yourself”) hit #1 in the entire Amazon store, above both fiction and non-fiction."}, {"8008": "Sadly for me, the main compliment about the book I got was, “Great cover!” Ugh! Read it! But people judge books by their covers."}, {"d657": "K) THE UMBRELLA RULE"}, {"31a5": "Louis CK started doing standup comedy in the late 80s."}, {"e206": "He was a great success. He got a job writing for Conan O’Brien, the talk show host. Then he was offered the job to be head-writer. $500,000 a year."}, {"5eb4": "He turned it down."}, {"44d7": "He wanted to really master comedy. Not just head down one direction and disappear into the politics of tv writing for someone else."}, {"9b04": "He went on the road and performed 10–15 times a week for years."}, {"3371": "He wrote a ton of scripts. He wrote for many shows and comedians including his buddy Chris Rock, one of the most successful comedians ever. Chris Rock and Conan were PLUSes and then EQUALS for Louis CK."}, {"378a": "He performed at every festival. I first saw him perform in 1997 at the Aspen Comedy Festival. I last saw him perform 20 years later in Madison Square Garden a few months ago."}, {"cacd": "He made his own show for HBO. “Lucky Louie.” It failed. He wrote a script for CBS. They rejected it. He made a show for FX at the lowest budget possible. “Louie.” It was a huge success."}, {"0dc8": "He rewrites his material every year so no joke is repeated. He learned this from George Carlin (a PLUS)."}, {"fcfd": "His TV show is not comedy. There was one scene where the woman he loves falls (Parker Posey) falls in his arms on New Year’s Eve and is brought to a hospital. The show ends with her saying, “Goodbye?” while crying and everyone is cheering for the new year in the background."}, {"f4fb": "It’s a dark show."}, {"f5bd": "He learned Internet commerce and sells his specials online. He also created an entire series from scratch with an unbelievable cast (first time in history this has been done) and only sold it off his website."}, {"a7b0": "He’s acted serious roles in movies ranging from “American Hustle” to Blue Jasmine”."}, {"a0da": "He’s developed and produced five other shows that are on the air right now."}, {"c8bc": "He made from scratch the movie “Pootie Tang” starring, among others, Chris Rock and JB Smoove."}, {"ec30": "Roger Ebert had this review for “Pootie Tang”: “Pootie Tang” is not bad so much as inexplicable. You watch in puzzlement: How did this train wreck happen? How was this movie assembled out of such ill-fitting pieces? Who thought it was funny? Who thought it was finished? For that matter, was it finished?”"}, {"c889": "Many thought it was the worst movie in history. Louis CK said the head of the production company was screaming at him, wondering how he could have let this happen."}, {"2afa": "This is the umbrella. For 30 years he did EVERYTHING under the comedy umbrella. And he became #1. The #1 ever."}, {"50f8": "THE NON-RULES:"}, {"6c3c": "NOTE: I didn’t say “Learn from failures.”"}, {"861b": "This will happen automatically if you do the ten things above and you have a good coach (a good “PLUS”) who will give feedback on your attempts at success."}, {"294f": "You will also have the psychology to deal with failure if you do the “Daily Practice” described above."}, {"a3e1": "Psychology is key but psychology doesn’t come from within, it comes from training your body to have the energy to deal with the stress of mastery. From training your body to maximize its happy chemicals."}, {"24ed": "I also didn’t say, “Find your passion”. Kids never say that. And they master things. So I don’t say it. I have no passions. But I can feel in my body when I say “yes” to something that lights me on fire."}, {"4d7e": "Maybe one rule I left out:"}, {"579b": "“The 1% Rule”. Get 1% better every day. Compounding, that’s 3800% a year."}, {"99ec": "But don’t worry about that. That happens automatically if you do the above."}, {"d474": "Another thing I didn’t say, “Be kind to others”. This rule could be important because it helps you build your scene, which helps you build your “EQUALS” described above."}, {"44e7": "This also is a side effect of achieving mastery in the way described above."}, {"b7b6": "And I didn’t say, “Find Your Category”. This is good advice: find the area where you have no competition. Create your own category."}, {"164e": "Steve Jobs took the “genre” of the phone, and made it a little better in every possible way to create his own category of phone. When the iPhone came out it had no competition and sold tens of millions of units within a year."}, {"8f95": "Changed the the entire industry and led to changes in how the entire world consumes media and entertainment."}, {"57b7": "But this is also a side rule to “Do what fascinates you” and “Mastery Sex”."}, {"51f7": "I also didn’t say “The .400 rule”. This refers to baseball. If a hitter only makes good hits 40% of the time, he will be the best player in history (Ted Williams)."}, {"f770": "This rule is a side effect of having a good coach and good equals and good psychology."}, {"e52a": "Perhaps I should say this though: if you are on track 100% of the time then you aren’t taking enough risks."}, {"d727": "But let’s not focus too much on failure. Let’s just focus on improvement."}, {"9d38": "When making a guidebook of rules to follow, I like to stick to ten things. Else it’s too much. Then I have to spend more time memorizing the rules than following them."}, {"2490": "Well, I put 11 rules up there. Master is difficult. But it’s worth it."}, {"9c0d": "I’m not necessarily a master at anything. And I’ve failed a lot. And maybe I’m a bit of a dilettante, I confess."}, {"d0f6": "But I love the journey to mastery. When my heart and brain go on fire in my attempts to get better at something I love — this is my magic drug. This is my anti-aging technique."}, {"a40d": "And if you want only follow two rules rather than ten, do: 1) PLUS, MINUS, EQUAL, and 2) THE DAILY PRACTICE described above."}, {"6370": "I suspect all the other rules fall from those two."}, {"6161": "I am scared to death to do standup comedy next Tuesday."}, {"3393": "I’ve done it once before and I loved it but I was scared."}, {"e2f7": "I am fascinated by standup comedy. I watch it every day. I read every book on comedy. I have a ton of comedians, humor writers, entertainers, on my podcast. Not because they are so great (although they are) but because I want to selfishly learn from them."}, {"6e8e": "I called a friend of mine that I grew up with who is one of the best standup comedians in the world."}, {"fbcb": "When he first moved into town when we were 9 nine years old, day one he got people laughing so much the teacher even said, “you’re going to be a comedian”. I couldn’t stop laughing that day. And every day he opened his mouth."}, {"1266": "And now he has netflix specials, tv shows, radio shows. He’s incredible. He’s among the best in the world."}, {"262a": "I called him and told him I wanted to learn how to get over the fear of doing this on Tuesday."}, {"d60a": "He said, “The fear is conquered I think just by doing it a number of times and realizing that bombing is survivable.”"}, {"5405": "tl;dr for this entire post."}, {"7a85": "If you don’t want to read a relatively small piece of writing about mastery then maybe don’t master anything."}, {"302d": "I know I hate it when people tell me what to do."}, {"9432": "But the above is not advice."}, {"8139": "Advice is just autobiography. This was my story."}, {"e50b": "BIBLIOGRAPHY: (this is a start, not a complete list)."}, {"7c85": "“Mastery” by Robert Greene“Peak” by Anders Ericsson“Moonwalking with Einstein” by Josh Foer“Sick in the Head” by Judd Apatow“Outliers” by Malcolm Gladwell“Tools of the Titans” by Tim Ferriss“How to Fail At Everything and still Win Big” by Scott Adams“Spaceman” by Mike Massimino“On Writing” by Stephen King (and also “What We Talk about When We Talk about Running” by Haruki Murakami)“Ego is the Enemy” by Ryan Holiday“A Man for All Markets” by Ed Thorp“Graceful” or “The Dip” by Seth Godin“Big Magic” by Elizabeth Gilbert“The War of Art” by Stephen Pressfield“The Confidence Game” by Maria Konnikova“Travels” by Michael Crichton“Deep Work” by Cal Newport"}, {"e12a": "Did I get better at poker?"}, {"19f7": "Yes."}, {"63e7": "And then I stopped playing. I started a business. Everything went downhill from there. Until I learned to love it and I got better."}, {"4f7e": "Bye."}, {"1870": "Read more from James Altucher on Twitter, Facebook, and LinkedIn or sign up for his newsletter."}, {"8116": "James Altucher is the author of the bestselling book Choose Yourself, editor at The Altucher Report and host of the popular podcast, The James Altucher Show, which takes you beyond business and entrepreneurship by exploring what it means to be human and achieve well-being in a world that is increasingly complicated."}], "content": "The Ultimate Guide To Achieving Peak Performance In Life (rules, “non-rules”, and bibliography and a “tl;dr” for each section) I wanted to get better at poker. I showed up at the local underground club and within ten minutes I was out $1000 and I went home. My wife said, “Did they scam you?” My sister said, “Was it mafia?” No. I sucked. I went back the next day. Lost another $500. The next day. Another $500. I could tell people were looking at each other when I walked into the club. They were happy. A year later a movie was made based on that club.”Rounders.” In “Rounders” they say, “If you can’t spot the fish at the table, then you are the fish.” I was the fish. So I did what I did with any game or business or activity I’ve ever tried to master. I’ll describe below. Mastery has a language to it. Speak that language and you will learn how to master anything you have some degree of talent in. I’ve succeeded and failed at many things. Many games. Many rises and falls in financial success. I’ve helped run businesses with a billion in revenues. And I’ve built from scratch, with no fundraising, companies with tens of millions in revenues. I’m a ranked chess master. I’m bad at relationships (I keep trying to succeed but just don’t know how, I think. Although maybe I’m getting better). And if you aren’t improving, you’re dying. I always want to try to get better at new things. Next Tuesday I’m going to do standup comedy. I’m also in the middle of pitching a TV show and writing a novel and I’m building my business. Some things will fail and some will succeed. But I’m using the techniques I describe below. First, I had to define “success” for myself. It’s a different definition for everyone. Let’s get specific. QUICK GUIDE TO WHAT SUCCESS IS A) FINANCIAL success is a good metric. Not because life is about money. But money tells you if you are good enough that people are willing to spend their hard earned dollars on you rather than the other seven billion people. Example: the most successful show of all time is Seinfeld. How do I know? Because Larry David and Jerry Seinfeld made about 900 million dollars each from it. One time I was visiting a hedge fund that managed John Grisham’s money. They told me, “Every time John Grisham writes a book we get another $20 million to invest.” This doesn’t mean John Grisham should win the Nobel Prize in Literature. But it does mean if his goal is to have a lot of people love what he writes, then he is very successful. B) RANKING Magnus Carlsen is the World Chess Champion. When there are tournaments that give you a rank then you know exactly who the Alpha person is, who the Omega person is, and everyone in between. In chess there is a numerical ranking system. The average player on the street has a “rating” of about 1000. The average tournament player has a rating of about 1500. A Master has a rating of about 2200. A Grandmaster about 2500. And Magnus is close to 2800. This is rough, but every 100 points difference means the higher rated player will beat the lower one two out of three times. Tennis has a ranking system. Golf has one. Writing novels has a ranking system. You can use your Amazon rank to measure sales. Or you can win awards to measure quality among the elite. Corporations have a ranking system: salaries and titles. They understand this is how tribes work and that everyone wants to know where they fit into the tribe. We are built to want success in a tribe based on the chemicals in our brain. So find the category that is your tribe. Then you can find success in the ranking system of that tribe. But only AFTER you speak the Language of Mastery. A quick guide to chemical success: – SEROTONIN spikes when you move up in the tribe (most anti-depressants work off of Serotonin). When you get promoted at your job Serotonin spikes. – DOPAMINE works when there is POTENTIAL to move up in the tribe (amphetamines and cocaine take advantage of this. The “hope” is often more powerful than the actual result). When you start a new job where you think there is a lot of potential, dopamine spikes. – OXYTOCIN spikes when you feel comfortable with your place in the tribe. (For instance, when women are in labor with a baby, their oxytocin spikes. They are adding to the tribe). The benefit of being a modern human is that there is not one tribe. You can CHOOSE your tribe. If I’m bad at salsa dancing (stress spikes instead of the “happy chemicals”) I can switch back to my chess tournaments. If I don’t like my job, I can look for a new one, or start a business (or gig) on the side and take control of my own oxytocin. Choose your tribe wisely. We’re all bags of chemistry and we want to maximize those chemicals. [ RELATED READING: 10 Unusual Ways to Release Oxytocin Into Your Life ] This is what works for me: A) LOVE This is the obvious one. You will only succeed what you love doing. Take two people who are just starting out. One loves it, the other doesn’t. Who will win? Take out talent for a second (a 6′7″ person will play better basketball than a 4′ person…just because). The one who loves something will have heroes .Will see the subtleties in their heroes works. Will see the artistry and, most important, will see the difference between a beginner (which is what we all are when we start something we love) and a master. And even the masters return to the basics to keep recapturing the love. tl;dr When you love something, you know at the beginning you are bad because you have TASTE. But you strive to improve. B) PLUS, MINUS, EQUAL PLUS: Find a mentor: this can be a virtual mentor (someone you read about). Or it can be a real mentor (a coach). When I was 17 I wanted to get better at chess. I was awful. I had many virtual mentors (I LOVED studying the games of Kasparov, Tal, Alekhine, Fischer) AND I had a coach (first Sammy Reshevsky, then Michael Wilder, and John Fedorowicz. All strong professional players. Reshevsky at one point had been the best in the world). I would study with a coach up to 3x a week. The benefits of a coach: – They know the latest learning techniques. So a student can learn much faster with a coach. – They give feedback. This is the only case where repetition is good. You do something, you get feedback, you do again. This is what Anders Ericsson (the god father of Mastery and the creator of the so-called “10,000 hour rule”) calls “deliberate practice.” Anders, who has been on my podcast, has trained everyone from chess champions to tennis champions, scrabble, memory, violin, etc. See reading list below. But you see this in every great master. Mozart learned first from his father, who was a professional composer. Serena and Venus Williams had their father and then many coaches. Magnus Carlsen, the current world chess champion, had Garry Kasparov (who is coming on my podcast next week. Yay!), as his coach for awhile. Hemingway had Gertrude Stein and then Maxwell Perkins, to help him learn the subtleties of minimalism in writing, which was a new form then (and thus, he created his category so he could be #1 in it). Elon Musk decided to make a rocket. So he read many books on rocket science (virtual mentors) and then started hiring and conferring with the best rocket scientists in the world. Now he sends rockets into space. A good friend of mine is doing a project: she started with no understanding of the rules of poker. She hired the best player in the world to give her lessons. Now, nine months later, she is competitive. And still learning. She is writing a book on the process which I know will be a bestseller. EQUAL: Find people about equal to you to challenge you. To get better at tennis, you can’t just play your coach. You have to play people who are also trying to achieve mastery, who are at about your level. You will constantly find new ways to improve over each other to be better. You will challenge each other. This will result in the entire group being better. If you look at the history of the art world, it’s always through the development of groups that are then labeled by their particular style (cubism, surrealism, pop, etc) Same with literature. And in something like chess, location was often away to find equals. For many years, the old Soviet Union would scour the country for the most talented young people and throw them into school together. So for about 60 years, the Soviet Union dominated the world of chess because no other country used the “Power of Equal”. MINUS: You get better when you teach what you’ve been learning. How come? It helps you remember and solidify the teachings.Students often ask questions with beginner’s mind that helps you learn more subtleties of your craft.Many great writers were once professors, for instance (Kurt Vonnegut, Raymond Carver, Tobias Wolff, Toni Morrison, Joyce Carol Oates, etc). Many great scientists were professors (Einstein, John Von Neumann, Craig Venter, etc). In Zen, it’s a common adage to keep getting back to “beginner’s mind” so you keep relearning and understanding at a deeper level the subtleties of what you love. MINUS, is a way to recapture that beginner’s mind. A great example is two different world chess champions: Jose Capablanca and Bobby Fischer writing chess books for beginners (“Chess Fundamentals” and “Bobby Fischer Teaches Chess”). C) HISTORY You can’t get better at what you love unless you learn the history. Again, I will use chess as an example since it is both difficult (it takes ten years for the average player to become a Master) and it has a clear ranking system where everyone knows their place. Bobby Fischer was once an average, talented, young player. Then he disappeared. For a year he studied all the games played in the 1800s. ALL OF THEM. And he found improvements on each game. How the world champions of the 1850s could’ve played better. When he came back, he would steer his opponents into these “antique” positions from 100 years earlier. They laughed at him. This was part ONE. Then he learned Russian. He started getting the Russian chess magazines shipped to him. He studied every game played by the Russians and their heroes. He found improvements in their games. He had his coach at the time (the famous coach of many young players back then: John Collins). Then he came back. He won every game. He became the youngest grandmaster in history. He became the first person to win every game in a US Championship. Not even a draw. Then on his rise to the world championship, he was beating the best players 6–0 in matches (twice in a row). No draws. And then he even gave one game odds to the world champion (Spassky) and still won the match. Then he went crazy. But that’s another story. Can this work at a job? Of course. – Learn how the industry started– Learn how the company started and competed and had its first successes– Learn how the executives made their mark on the company to rise up. — Learn how executives in other companies made their mark. When I was at HBO, I loved it. LOVED it. I did the above. I learned everything about entertainment and TV. I learned everything about HBO. I would borrow tapes from the HBO library and go home and watch every show they ever did. Did I rise up at HBO. No. But I was a small programmer in the IT department. I ended building their website, pitching a TV show and getting money to shoot a pilot. And then I started a company building websites for almost every company in the entertainment industry. HBO was my biggest client. Does this mean I failed at HBO? No. You learn, you reinvent. You learn more. You reinvent more. There’s no one path. [ RELATED READING: Financial Fridays: Why Today Is The Day You Have To Reinvent Yourself ] There is always: improve or die. Be willing to change your definition of success as you get better. Because as you get better you will have more clear eyes on what success means for you. I spoke with Josh Foer once. He was the US Memory Champion. He studied the techniques of all the memory champions before him, dating back thousands of years. He studied with a coach (Anders Ericsson and Ed Cooke, a prior memory champion). And he wrote the bestseller “Moonwalking with Einstein” documenting his path to the championship. Does this work in marketing? Even though SEO and Facebook ads didn’t exist 20 years ago? Yes. This works for EVERYTHING. Study the history of copywriting. Study the history of direct marketing. Study the history of cognitive biases. Even study the life story of Emmanual Juius Haldemann, the man who sold 500,000,000 “Little Blue Books” in the 1920s to see how he would change titles of his books to up sales. Does this work for language development? Of course! Those who study the roots of a language (learning Latin, for instance) will have a much easier time learning a new language (French). tl;dr — Studying the history of any field is the magic bullet for master. D) TALENT Is there such a thing as talent? Yes. Let’s forget about physical talent for a second (the basketball example above). I once knew a kid, Jorge Zamora, who I would watch play chess when he was 11 years old. He’d crush older grandmasters and barely look like he was paying attention. When I would speak about chess with him, it was like talking about physics with a 50 year old Nobel prize winner. I don’t know what he had. I don’t know how to define talent. Is it something in the brain? I don’t know. But it gave him a head start. For all I know, he was the most talented chess player in history. And his brother (my roommate at the time) was a strong master, as was his father. So it ran in the family. Did he use his talent? Sadly, no. I’m not sure what it was. Some people told me he couldn’t handle losing very well. Or the pressure of being such a prodigy. A similarly-developed prodigy, Magnus Carlsen, became World Champion. Not sure where Jorge is now. So two questions arise: – How do you know what you are talented at? Fortunately we are all talented at many things. Even though 100% of us will be bad at first (Michael Jordan, immensely talented, didn’t make his high school basketball team). The other day a friend of mine asked me to help him make notes for a script for a pilot that a major network bought. I spent all day on it. I made suggestions on the dialogue, the plot, specific scenes, etc. I LOVED it. It made my heart go on fire. He took my suggestions, and we spoke all day on the phone back and forth about the ideas. I loved every minute. Does this mean I am talented at this? I have no idea. But that’s the clue. Try things so you can find the clues. Then the clues will lead you to your talents. A little child doesn’t ask, “What’s my purpose?” That would be an idiot question. A little child does what he or she loves. And does them obsessively. That’s how talent becomes skill. tl;dr – Do lots of things. See what you love. Do the things you love again. Don’t do the things you don’t love. What if you have no talents? That’s ok also. You might love something but have no talent. It doesn’t mean you can’t enjoy the subtleties of mastery. I love chess. I love poker. I love business. I love writing. I might not be talented enough to be the best in the world at any of them. But, by doing the techniques I listed here, I am able to achieve some level of mastery. The benefits to this are immense. One time I was in Argentina. The best chess club in the world is in Buenos Aires. I went there and they wouldn’t let me in. Private, they said. My friend told them my ranking. They let me right in. I played the Argentina Junior Champion who was hanging out upstairs. I won one and he won one. We played and drank coffee with each other all night. Mastery leads to community leads to friendship across the language of the mastery you both share. The Buenos Aires Chess club was the home of the famous Fischer-Petrosian and Alekhine-Capablanca matches. They gave me a tour of where those great players once played. Mastery gave me pleasure. Even if I will never be the best because I don’t have the talent. tl;dr — if you love something but don’t have enough talent, find new ways to measure success in what you love. E) THE LUCK RULE. (OR….THE DAILY PRACTICE) You get luck from energy. Period. I love to write. I write very day. Sometimes I write poorly and sometimes I write well. You can never predict. But I know this: when I have no fuel, I can’t write. My productivity goes from 100 to, sometimes, 0, or worse. Worse than 0 means your life is out of control. This has happened to me many times. Relationships causing me much anger and stress. Businesses going broke. Losing a home. Getting sick, etc. I looked back at everything I tried to get good at and found similarities between the times I had a lot of energy and the times I didn’t. The times I had energy was when I had the most luck. Here’s how I refueled so I could get as much luck every day. This is my Daily Practice: PHYSICAL: Sleep eight hours, eat well (as little snacking as possible), move (walk a few miles a day or some sort of movement or gym or yoga or whatever you do). EMOTIONAL: Be around people who love and support your successes. Love and support their successes. Mike Massimino, the astronaut who fixed the Hubble Space Telescope once told me about an MIT robotics class he took. “Four of the ten people in that class made it into space.” Only a few dozen people out of billions have made it into space. If Mike been in a random bar in Boston there is zero chance he could’ve said, “4 out of 10 people in this bar will go into outer space”. Find your ten. CREATIVE: In every field in life, the people who can do the unexpected, wins. The “unexpected” comes from creativity. Creativity is a muscle. Creativity is a practice. Jerry Seinfeld talks in the documentary “Comedian” how he never “breaks the chain”. He writes jokes every day. Louis CK develops an entire new act every year. This is how he does an entirely new special each year. He probably makes 20 to 30 million per special. I watched him shoot his latest special. I was laughing so hard I thought I would have to leave the hall, my stomach was hurting so much. What if you don’t know yet what you want to be creative on? No problem, write ten ideas a day. What do you write about? Anything you want. Yesterday I wrote, “ten things I learned from delivering pizza when I was 19”. The day before that I wrote “ten ideas for a TV show”. The day before that I wrote “ten chapter titles for a novel”. The day before that “ten products I can invent”. Were they good ideas? Of course not! 99.999% or 100% SUCKED. It’s just exercise. Lift weights every day to get muscle mass and build a great body and break down older muscle (older habits, in the case of creativity). This is how when you need to pull “the unexpected” (the only way to win a game, the only way to sell, the only way to beat the markets, the only way to to be a leader). you will have the muscle developed. But isn’t execution everything? Of course! But: 1) You need something to execute on. 2) Execution ideas are a subset of ideas You need to be creative about the easiest ways to execute. So you need that creativity muscle be an IDEA MACHINE before you can execute . tl;dr Write TEN IDEAS A DAY for six months and you will be an idea machine. SPIRITUAL: Fill in the blank here. Some people believe in a higher power. Some people meditate. The key is to know when to put regrets and anxieties to the side and learn to appreciate the moment. To love the moment, so you have fuel to infuse the moment with everything in you. THE DAILY PRACTICE tl;dr Every day before you go to sleep ask: “What did I do to improve my physical, emotional, creative, and spiritual health?” Without this, you will not have the energy for mastery. Luck favors the energetic. F) THE 5/25 RULE Warren Buffett taught me this one. The benefit of studying history and virtual mentors. I made such a study of everything Warren Buffett did that I wrote a book in 2005, “Trade Like Warren Buffett”. I studied private letters nobody had ever publicized before. “Promise me,” said the hedge fund manager who gave me the private letters, “you won’t write about this.” “I promise,” I said. But I’m sorry, Whitney. They were just too good. I wrote a whole book about them. The 5/25 Rule of Buffett: List the 25 things you love the mostPut the top 5 on the left, put the bottom 20 on the right.NEVER EVER EVER AGAIN NEVER LOOK AT THE BOTTOM 20.How come? Because you love the bottom 20. They are in your top 25. Of course you love them. But every time you look at them, you won’t put your full energy into them (because, after all, they are not in your top 5), and you will sacrifice energy you could’ve put into your top 5. This rule is critical. Why is it 5? Why not your “top 1”. Isn’t focus about your “top 1”? “Focus on one thing” is the worst advice ever. Because of: G) MASTERY SEX (or HOW TO SHORTCUT THE 10,000 RULE). It’s really hard to be the best athlete in the world. It’s really hard to be the best writer in the world. Matthew Berry was a pretty good screenwriter in Hollywood (look him up on IMDB. You’ll recognize the movies but maybe you never watched them). He also was pretty good at fantasy sports. He was on a few teams. People sought him out for advice. He quit his job in Hollywood after an argument with an actor over “the worst script ever.” He hated it. He started blogging for $100 a post at a fantasy sports blog. Because he had professional experience writing, he quickly became the best writer in the fantasy sports business. He built his own major fantasy sports blog. ESPN bought it. Now he’s the only anchor for Fantasy Sports in the world, on ESPN. When I walk with him in the street, people stop him and say, “Thank you!”. He got pretty good at one thing. Pretty good at another thing. And became the BEST IN THE WORLD AT THE INTERSECTION. Scott Adams has written about the also. He calls it a “talent stack.” I called him and asked him about it. He said, “I’m not the funniest guy in the world. But I’m ok. And I’m not the best illustrator in the world. But I’m ok.” He started drawing about his experiences in the corporate world. The hypocrisy of it. It caught on with the other 100,000,000 people who work in cubicles. His cartoon, Dilbert, is now syndicated in 2000 newspapers. He has over a dozen books. He’s sitting on top of a $100,000,000 cartoon empire. I love this scene from the trailer of the Justice League: The Flash asks Bruce Wayne / Batman, “uhh, what are your super powers again?” Batman is famous for not having any but still performing at the level of a superhero. Bruce Wayne looks over at the Flash and says, “I’m rich”. Which is funny. But maybe not the answer. Bruce Wayne put his money into the top scientists who can build him non-stop wearable weapons. And he also trained his entire life to be at peak physical potential (even if he’s not the best athlete in the world). The combination, plus his study of detective skills, makes him a superhero. The best in the world at what he does. The head of the Justice League. H) THE POWER OF NO AND YES I wrote a book about the power of “no”. Not because I was an expert sat saying “NO’. But because I needed to learn how to do it better. Every “NO” you say is a success. It means you have more time to do what you love. Over years I’ve made my life so I can make as many “success” choices a day as possible. I donated all of my belongings. Everything. Even extra money I send over to savings for my kids or I donate it. I never buy anything new. I don’t collect anything. I don’t like to travel. I don’t rent. I just live in Airbnbs so I never have to deal with furniture, paperwork, cooking (I always order delivery), and it limits the number of things I can get tempted by because I move around and that always keeps a cap on my possessions. I say “no” to almost all social media (except Quora and except anything that helps me distribute my writing). I say “no” to almost all coffees or meals except with close friends. So now almost all of my choices throughout the day have to do with the things I love: writing, podcasting, some business to keep things going. Oh, and games. It took a long time. Years. So that I ONLY have the choice of making this set of choices. It was really painful. I miss many things I threw out. But life (to me) isn’t about being happy all the time. It’s about setting my heart on fire as much as possible. Doing what I love even if they cause pain on occasion. BUT, I do say “yes” to adventures I think will add to my life. I used to live in the Chelsea Hotel in NYC. They closed for renovations in 2013. A 130 year old beautiful building with a history that includes almost every artist and writer who ever lived in NYC has closed down. Except for one room. One guy is suing and is staying. I lived there for six years. But hadn’t been back. The other day I heard he was hosting a poker game. I was invited. “YES!” I went even though it meant staying up very late for me. I got to see the insides of my old home which held so many of my most intense memories. Every floor was all ripped up. Wires everywhere. The artwork on the walls all gone. Then I got to Tony’s room. He had kept the old favor. We played poker all night. Everyone there was an artist of some sort. There was a standup comedian there as well. She gave me advice about my upcoming attempt at standup. It was an adventure. It was a good “YES”. When you say “NO” to 99% of things, you leave room for a good “YES” that can add to the things you want to master. tl;dr You only have one life. Say “NO” to everything except the things you love. You can’t always do this. But try. [RELATED READING: How Minimalism Brought Me Freedom and Joy ] I) MASTER WHAT FASCINATES YOU 20 years ago, nobody had a passion for self-driving cars. They were only part of science fiction novels. And a tv series called “The Jetsons”. Now, it’s already becoming a major industry. People who master it will get very wealthy. How could they have known? I was talking to Brian Koppelman. Such a great writer. He and his partner, David Levien, wrote the script for “Rounders” and one of my favorite movies, “A Solitary Man”. They also write the show “Billions”, which has become a breakout hit. He told me, “Don’t write what you know”. Which is funny because that is ALWAYS the advice about writing. He said, “Write what fascinates you”. You might not have all the knowledge or qualifications. That’s ok, your fascination will give you perspectives and intensity nobody else has. Dan Carlin, host of the successful podcast “Hardcore History” is not a professional historian. He has no degree in it.But he does the work and now has the most successful podcast about history. More people will get their history educations from Dan than from school. Kamal Ravikant, venture capitalist, best-selling writer and novelist, and accomplished salsa dancer, once said, “If I only did what I know I’d be a janitor someplace.” Nothing wrong with that. But… Fascination opens up the imagination. The imagination is what creates action. Action creates the future. And suddenly what once fascinated you, has become reality. And you are the master. tl;dr — ignore the advice “write what you know.” Kids are curious. They follow their curiosity. Be like a kid. J) THREE HOURS A DAY People confuse hours for productivity. Someone asked me yesterday, how do you do all the things you do. You seem very productive. I am actually very lazy. I like to nap when I can. I watch my favorite TV shows often. I like to walk around and do nothing. I talk to my friends on the phone. Someone asked Anatoly Karpov, how much time do you spend studying chess every day. He was world chess champion from 1975 until 1985, and stayed in the top 10 for another 15 years. “Three hours a day,” he said. Ever since he said that, I view that as a maximum on how much time I can spend on my #1 thing I love. The rest of the time is devoted to refueling my energy, practicing my creativity, saying yes to adventures, spending time with people I love, finding things on youtube I can laugh at (since laughter is proven to have all sorts of health and psychology benefits). A friend of mine is the #1 book cover designer in the world. I’ve seen her in action. She lays out 100s of book covers and stares at them. She tries ideas out. She then physically backs off from the computer and shakes her head and her body and turns around and then re-looks at her work. Then she repeats. I’ve never seen her work on a design for more than two or three hours a day. The last cover she designed (my book, “Reinvent Yourself”) hit #1 in the entire Amazon store, above both fiction and non-fiction. Sadly for me, the main compliment about the book I got was, “Great cover!” Ugh! Read it! But people judge books by their covers. K) THE UMBRELLA RULE Louis CK started doing standup comedy in the late 80s. He was a great success. He got a job writing for Conan O’Brien, the talk show host. Then he was offered the job to be head-writer. $500,000 a year. He turned it down. He wanted to really master comedy. Not just head down one direction and disappear into the politics of tv writing for someone else. He went on the road and performed 10–15 times a week for years. He wrote a ton of scripts. He wrote for many shows and comedians including his buddy Chris Rock, one of the most successful comedians ever. Chris Rock and Conan were PLUSes and then EQUALS for Louis CK. He performed at every festival. I first saw him perform in 1997 at the Aspen Comedy Festival. I last saw him perform 20 years later in Madison Square Garden a few months ago. He made his own show for HBO. “Lucky Louie.” It failed. He wrote a script for CBS. They rejected it. He made a show for FX at the lowest budget possible. “Louie.” It was a huge success. He rewrites his material every year so no joke is repeated. He learned this from George Carlin (a PLUS). His TV show is not comedy. There was one scene where the woman he loves falls (Parker Posey) falls in his arms on New Year’s Eve and is brought to a hospital. The show ends with her saying, “Goodbye?” while crying and everyone is cheering for the new year in the background. It’s a dark show. He learned Internet commerce and sells his specials online. He also created an entire series from scratch with an unbelievable cast (first time in history this has been done) and only sold it off his website. He’s acted serious roles in movies ranging from “American Hustle” to Blue Jasmine”. He’s developed and produced five other shows that are on the air right now. He made from scratch the movie “Pootie Tang” starring, among others, Chris Rock and JB Smoove. Roger Ebert had this review for “Pootie Tang”: “Pootie Tang” is not bad so much as inexplicable. You watch in puzzlement: How did this train wreck happen? How was this movie assembled out of such ill-fitting pieces? Who thought it was funny? Who thought it was finished? For that matter, was it finished?” Many thought it was the worst movie in history. Louis CK said the head of the production company was screaming at him, wondering how he could have let this happen. This is the umbrella. For 30 years he did EVERYTHING under the comedy umbrella. And he became #1. The #1 ever. THE NON-RULES: NOTE: I didn’t say “Learn from failures.” This will happen automatically if you do the ten things above and you have a good coach (a good “PLUS”) who will give feedback on your attempts at success. You will also have the psychology to deal with failure if you do the “Daily Practice” described above. Psychology is key but psychology doesn’t come from within, it comes from training your body to have the energy to deal with the stress of mastery. From training your body to maximize its happy chemicals. I also didn’t say, “Find your passion”. Kids never say that. And they master things. So I don’t say it. I have no passions. But I can feel in my body when I say “yes” to something that lights me on fire. Maybe one rule I left out: “The 1% Rule”. Get 1% better every day. Compounding, that’s 3800% a year. But don’t worry about that. That happens automatically if you do the above. Another thing I didn’t say, “Be kind to others”. This rule could be important because it helps you build your scene, which helps you build your “EQUALS” described above. This also is a side effect of achieving mastery in the way described above. And I didn’t say, “Find Your Category”. This is good advice: find the area where you have no competition. Create your own category. Steve Jobs took the “genre” of the phone, and made it a little better in every possible way to create his own category of phone. When the iPhone came out it had no competition and sold tens of millions of units within a year. Changed the the entire industry and led to changes in how the entire world consumes media and entertainment. But this is also a side rule to “Do what fascinates you” and “Mastery Sex”. I also didn’t say “The .400 rule”. This refers to baseball. If a hitter only makes good hits 40% of the time, he will be the best player in history (Ted Williams). This rule is a side effect of having a good coach and good equals and good psychology. Perhaps I should say this though: if you are on track 100% of the time then you aren’t taking enough risks. But let’s not focus too much on failure. Let’s just focus on improvement. When making a guidebook of rules to follow, I like to stick to ten things. Else it’s too much. Then I have to spend more time memorizing the rules than following them. Well, I put 11 rules up there. Master is difficult. But it’s worth it. I’m not necessarily a master at anything. And I’ve failed a lot. And maybe I’m a bit of a dilettante, I confess. But I love the journey to mastery. When my heart and brain go on fire in my attempts to get better at something I love — this is my magic drug. This is my anti-aging technique. And if you want only follow two rules rather than ten, do: 1) PLUS, MINUS, EQUAL, and 2) THE DAILY PRACTICE described above. I suspect all the other rules fall from those two. I am scared to death to do standup comedy next Tuesday. I’ve done it once before and I loved it but I was scared. I am fascinated by standup comedy. I watch it every day. I read every book on comedy. I have a ton of comedians, humor writers, entertainers, on my podcast. Not because they are so great (although they are) but because I want to selfishly learn from them. I called a friend of mine that I grew up with who is one of the best standup comedians in the world. When he first moved into town when we were 9 nine years old, day one he got people laughing so much the teacher even said, “you’re going to be a comedian”. I couldn’t stop laughing that day. And every day he opened his mouth. And now he has netflix specials, tv shows, radio shows. He’s incredible. He’s among the best in the world. I called him and told him I wanted to learn how to get over the fear of doing this on Tuesday. He said, “The fear is conquered I think just by doing it a number of times and realizing that bombing is survivable.” tl;dr for this entire post. If you don’t want to read a relatively small piece of writing about mastery then maybe don’t master anything. I know I hate it when people tell me what to do. But the above is not advice. Advice is just autobiography. This was my story. BIBLIOGRAPHY: (this is a start, not a complete list). “Mastery” by Robert Greene“Peak” by Anders Ericsson“Moonwalking with Einstein” by Josh Foer“Sick in the Head” by Judd Apatow“Outliers” by Malcolm Gladwell“Tools of the Titans” by Tim Ferriss“How to Fail At Everything and still Win Big” by Scott Adams“Spaceman” by Mike Massimino“On Writing” by Stephen King (and also “What We Talk about When We Talk about Running” by Haruki Murakami)“Ego is the Enemy” by Ryan Holiday“A Man for All Markets” by Ed Thorp“Graceful” or “The Dip” by Seth Godin“Big Magic” by Elizabeth Gilbert“The War of Art” by Stephen Pressfield“The Confidence Game” by Maria Konnikova“Travels” by Michael Crichton“Deep Work” by Cal Newport Did I get better at poker? Yes. And then I stopped playing. I started a business. Everything went downhill from there. Until I learned to love it and I got better. Bye. Read more from James Altucher on Twitter, Facebook, and LinkedIn or sign up for his newsletter. James Altucher is the author of the bestselling book Choose Yourself, editor at The Altucher Report and host of the popular podcast, The James Altucher Show, which takes you beyond business and entrepreneurship by exploring what it means to be human and achieve well-being in a world that is increasingly complicated. ", "name": "227", "child": "227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23227_1\t227_2\t227_3\t227_4\t227_5\t227_6\t227_7\t227_8\t227_9\t227_10\t227_11\t227_12\t227_13\t227_14\t227_15\t227_16\t227_17\t227_18\t227_19\t227_20\t227_21\t227_22\t227_23", "timestamp": "Apr 10"}