{"parent": "", "title": "Use These 5 Secrets to Make Your Articles go Viral, According to Research", "author": "Cheryl Snapp Conner", "sentences": [{"63b1": "Use These 5 Secrets to Make Your Articles go Viral, According to Research"}, {"8fae": "According to research, these 5 conditions are often at play."}, {"dd7e": "CREDIT: Getty Images"}, {"94a5": "Is it possible to make an article go viral? Traditionally, my opinion was no. But according to Chartbeat, an organization that analyzed the articles that flew highest in 2016, viral articles tend to consistently incorporate the following traits:"}, {"a897": "1. An Attention-Getting Headline"}, {"a978": "Who wouldn’t want to open and read an article on “Why You Will Marry The Wrong Person”? This New York Times article, which was actually pro-marriage, sparked the curiosity of thousands of readers in 2016, whether they were in the market for marriage or not. Key to this strategy, though, is that the article must deliver on the promise of the headline, which this article did."}, {"220f": "2. A Contrarian View"}, {"2b28": "“Why Voting For Donald Trump Is A Morally Good Choice.” This article in Townhall was shared 766,000 times. Originally published on July 28, the author retracted it on October 8 and replaced it with another, “Trump’s Moral Character and the Election.” It received a paltry reaction. He reinstated the original on October 18 and added a follow up. This was an opinion piece, clearly, but by taking a surprising position — especially as a professor who taught Christian ethics for 39 years — the author not only made people look, but he also forced them to think. Five thousand of them left comments as well. Mission accomplished."}, {"99b3": "3. Shareability"}, {"cc64": "“The Real Reason Why Women Drink.” Whether readers agree or disagree, this article from Quartz is thought provoking and relatable to everyone, and so it was massively shared. In Chartbeat’s 2016 research, it ranked 47th as one of the top 50 most defining posts of the year."}, {"590c": "4. Shock and Awe"}, {"a42f": "“The 7 Crippling Parenting Behaviors that Prevent Children From Growing into Leaders” was not one of Chartbeat’s picks for 2016; it was an article that was written by Kathy Caprino in 2014. However, it exhibits a trait many viral articles share: It scares people. Anyone who is a parent or had a parent, who is trying to become a leader or is growing and mentoring others would be wildly curious to know what this writer and her source had to say. The article has received more than 7.2 million views."}, {"7fc3": "5. Numbers and Lists"}, {"06be": "“52 Places to Visit in 2016.” Whether you love them or hate them, “listicles” clearly captured readers’ attention in 2016, Chartbeat says. This is also evident in the Inc. community as numbered lists comprise the majority of the most-read contributor posts every month."}, {"7840": "In my opinion, any strategy that is overly used becomes formulaic, and as such, will tend to lose its viral appeal over time. So my own suggestion to aspiring writers is to not overuse lists or numbers. But as long as the articles remain compelling and fresh, there’s no denying the numbers strategy works."}, {"0ab7": "In my own experience, the article I wrote that achieved 10.4 million views exhibited all 5 of these traits, albeit largely by accident. It was a numbered list, was immensely shareable, and took a contrarian view. It was also a “derivative” article that quoted and expanded on the points of a writer I did not yet know, Amy Morin, who wrote the original list in an article for LifeHack, “The 13 Things Mentally Strong People Don’t Do.” I was so compelled by the principles that I quoted her list and applied the points to entrepreneurs in “Mentally Strong People: The 13 Things They Avoid.”"}, {"d3d4": "From the word “go” the article spread like wildfire, making both of us famous. We quickly found the chance to meet face to face, conducted a video interview together and appeared on Fox Business. Morin’s list became the theme of her book, which she published through Harper Collins in 2014. Inc. Contributor Larry Kim named the post Number 1 on his list of “The 16 Most Important Business Articles of 2014 for Entrepreneurs.” The most surreal moment for me was when my phone lit up with texts telling me that Rush Limbaugh had just called me out by name and was reading the article aloud on his show."}, {"7575": "What I learned: ultimately, it is readers who determine whether or not an article is a viral hit. In my own experience and in the examples Chartbeat has referenced, articles that go viral provide excellent insights, but the intentions of their authors are also authentic and clear. An article that is purposely contrived as a “click-bait” post will produce a result that is lackluster at best, and more likely than not, will fall flat."}, {"4be8": "The moral of the story, then, is to write interesting articles that provide readers with some surprises, some ironies or insights, or that teach while they entertain. But it is also imperative that the author’s intentions be authentic and real. This, above all, is the principle that will help you succeed."}, {"5dac": "Would you like to be a published thought leader?"}, {"e6c5": "If so, get my free Definitive Guide to Thought Leadership ebook right here."}, {"42aa": "This guide will teach you everything you need to know about turning your knowledge into business. Additionally, you can download the 7-Step Thought Leadership checklist and subscribe to the free Snappington post newsletter here."}], "content": "Use These 5 Secrets to Make Your Articles go Viral, According to Research According to research, these 5 conditions are often at play. CREDIT: Getty Images Is it possible to make an article go viral? Traditionally, my opinion was no. But according to Chartbeat, an organization that analyzed the articles that flew highest in 2016, viral articles tend to consistently incorporate the following traits: 1. An Attention-Getting Headline Who wouldn’t want to open and read an article on “Why You Will Marry The Wrong Person”? This New York Times article, which was actually pro-marriage, sparked the curiosity of thousands of readers in 2016, whether they were in the market for marriage or not. Key to this strategy, though, is that the article must deliver on the promise of the headline, which this article did. 2. A Contrarian View “Why Voting For Donald Trump Is A Morally Good Choice.” This article in Townhall was shared 766,000 times. Originally published on July 28, the author retracted it on October 8 and replaced it with another, “Trump’s Moral Character and the Election.” It received a paltry reaction. He reinstated the original on October 18 and added a follow up. This was an opinion piece, clearly, but by taking a surprising position — especially as a professor who taught Christian ethics for 39 years — the author not only made people look, but he also forced them to think. Five thousand of them left comments as well. Mission accomplished. 3. Shareability “The Real Reason Why Women Drink.” Whether readers agree or disagree, this article from Quartz is thought provoking and relatable to everyone, and so it was massively shared. In Chartbeat’s 2016 research, it ranked 47th as one of the top 50 most defining posts of the year. 4. Shock and Awe “The 7 Crippling Parenting Behaviors that Prevent Children From Growing into Leaders” was not one of Chartbeat’s picks for 2016; it was an article that was written by Kathy Caprino in 2014. However, it exhibits a trait many viral articles share: It scares people. Anyone who is a parent or had a parent, who is trying to become a leader or is growing and mentoring others would be wildly curious to know what this writer and her source had to say. The article has received more than 7.2 million views. 5. Numbers and Lists “52 Places to Visit in 2016.” Whether you love them or hate them, “listicles” clearly captured readers’ attention in 2016, Chartbeat says. This is also evident in the Inc. community as numbered lists comprise the majority of the most-read contributor posts every month. In my opinion, any strategy that is overly used becomes formulaic, and as such, will tend to lose its viral appeal over time. So my own suggestion to aspiring writers is to not overuse lists or numbers. But as long as the articles remain compelling and fresh, there’s no denying the numbers strategy works. In my own experience, the article I wrote that achieved 10.4 million views exhibited all 5 of these traits, albeit largely by accident. It was a numbered list, was immensely shareable, and took a contrarian view. It was also a “derivative” article that quoted and expanded on the points of a writer I did not yet know, Amy Morin, who wrote the original list in an article for LifeHack, “The 13 Things Mentally Strong People Don’t Do.” I was so compelled by the principles that I quoted her list and applied the points to entrepreneurs in “Mentally Strong People: The 13 Things They Avoid.” From the word “go” the article spread like wildfire, making both of us famous. We quickly found the chance to meet face to face, conducted a video interview together and appeared on Fox Business. Morin’s list became the theme of her book, which she published through Harper Collins in 2014. Inc. Contributor Larry Kim named the post Number 1 on his list of “The 16 Most Important Business Articles of 2014 for Entrepreneurs.” The most surreal moment for me was when my phone lit up with texts telling me that Rush Limbaugh had just called me out by name and was reading the article aloud on his show. What I learned: ultimately, it is readers who determine whether or not an article is a viral hit. In my own experience and in the examples Chartbeat has referenced, articles that go viral provide excellent insights, but the intentions of their authors are also authentic and clear. An article that is purposely contrived as a “click-bait” post will produce a result that is lackluster at best, and more likely than not, will fall flat. The moral of the story, then, is to write interesting articles that provide readers with some surprises, some ironies or insights, or that teach while they entertain. But it is also imperative that the author’s intentions be authentic and real. This, above all, is the principle that will help you succeed. Would you like to be a published thought leader? If so, get my free Definitive Guide to Thought Leadership ebook right here. This guide will teach you everything you need to know about turning your knowledge into business. Additionally, you can download the 7-Step Thought Leadership checklist and subscribe to the free Snappington post newsletter here. ", "name": "229", "child": "229_1\t229_2\t229_3\t229_4\t229_5\t229_6\t229_7\t229_8", "timestamp": "Apr 12"}