{"parent": "", "title": "When To Listen To Your Gut (And How To Know When Your Instincts Are Wrong)", "author": "David K. Williams", "sentences": [{"a316": "When To Listen To Your Gut (And How To Know When Your Instincts Are Wrong)"}, {"793d": "Your gut instinct is one of your greatest resources."}, {"de35": "You must hone your instincts for ultimate business success."}, {"95cd": "Your gut instinct — and the instinct of your team — is one of your greatest resources. Instinct is invaluable, but not infallible, as I’d like to explain."}, {"0364": "Why is gut instinct so valuable?"}, {"ffe9": "It is priceless primarily because it’s exponentially faster than your logical mind. Science has now demonstrated the importance of the “somatic markers” that clue you into why something “just feels right” (or it doesn’t) faster than any conscious thought can take hold. The speed of instinct is another one of the reasons body language is such an accurate marker — the body responds to stimulus within a 10th of a second and reacts with visible signals of dislike, lying, etc., that are difficult or even impossible to hide."}, {"16f3": "Instinct is a vital survival mechanism that has kept us safe from dangers from the beginning of time. Instincts are also valuable in business in that they demonstrate someone’s instant and unguarded “gut check” to an idea that can be invaluable to a leader or team. It may be the small comment across the table from a John David to a Dusty that indicates how a project might go. Even a partial remark can be meaningful."}, {"1a98": "Small reactions can mean huge things, and a leader should regard them as such. Hesitation? Fear? Perhaps ramifications you hadn’t thought about, like the sudden need to double customer support to accommodate the great idea you’ve just had? Regard these reactions with the utmost care, as a person’s good feeling or instinctive hesitation could have big implications on how your plan will work out."}, {"a0a3": "Here’s an example of the power of instinct from Lydia Dishman, in FastCompany Magazine, via a researcher named Shabnam Mousavi, an assistant professor at John Hopkins Carey Business School. Mousavi was the lead author of “Risk, Uncertainty, And Heuristics,” a paper that explores the times intuition can be more useful than deliberate calculation."}, {"cbe4": "Mousavi’s premise was that sometimes we muddle our outcomes by bombarding ourselves with too much information. As an example, she quizzed German and U.S. students to see if they could state which city is larger: Detroit or Milwaukee. Despite not being American, the Germans were 90% correct versus only 60% of the American students she asked."}, {"81e5": "Why? Because the Germans simply picked the city they’d heard more about and guessed it would stand to reason it was the larger of the two. They “went with their gut.” Americans, on the other hand, rifled through their mental library of knowledge of the two cities, which got in the way of their reaching for the obvious answer, and they failed."}, {"58f5": "Why your gut may sometimes get it wrong."}, {"c731": "Sometimes our instincts betray us. We might hire someone who makes us feel at ease and comfortable and later discover the person is a well-practiced sociopath. We might move in with a roommate or romantic partner we barely know because the friendship felt “right.”"}, {"2d80": "When we let our emotions bear sway without an accompanying cost/benefit and risk analysis, we might be hurtling down a path that is 100% wrong. In my own life, I can’t remember a time when “putting a gap between the stimuli and the response” has failed to serve me well."}, {"94b6": "Sometimes that gap may be simply standing up and walking a bit before responding. Or it may be a few hours, or you may need to sleep on it. Typically the great idea will become stronger, or you may realize your initial inclination was an emotional response without adequate accompanying intelligence behind it."}, {"ed0a": "For example, in my early career I was involved in a massive project to redevelop the property that had been operating as a steel mill in Utah, in the county where I lived. It was a gut decision (at the right time, initially) that started me down a path of cleaning up this eyesore in the heart of our community."}, {"008a": "I became so personally (and financially) invested in the positive aspects of this project (cleaning up the air where our community lived, worked and was raising our children) that I followed my gut (at the wrong time) in pursuing the project to the bitter end, which resulted in a failed real estate venture and a very bitter ending indeed. I allowed my emotions about the good the project would do for the community I loved to override the cost/benefit analysis of continuing forward, which contributed to going deeper into a project that was destined to fail."}, {"aada": "Another risk to beware in following your instincts is the tendency of some individuals, and even leaders, to wield their instincts as a kind of “God Card.” They declare that their instincts have spoken to them about a person, project or course of action, and all discussion on the matter is done."}, {"71f7": "This is self-deception. A person who moves forward in this way is not only ignoring rational analysis, but is ignoring the equally valid instincts of their team members and stakeholders as well. Using the “God Card” in business dealings is inappropriate. Whenever someone starts telling me what they do in their church in the context of a business negotiation, it raises a red flag and I will often call an immediate end to the conversation."}, {"c156": "While the strategy of “my instinct rules; the discussion’s over” might serve the person and even the team in some cases, over the course of a company’s lifetime, it is a practice that will not end well."}, {"820e": "The right approach to instinct is balanced."}, {"1ef7": "Some experts maintain that instincts based on emotion are best saved for romantic connections or vetting out situations, such as a child who is experiencing abuse. They suggest that business decisions should rely entirely on a rational analysis of cost/benefit results. I propose we discard this notion. Instead, we should hone our skills in making decisions that balance our emotions with our factual analysis. This will allow us to capture the critical aspects of both."}, {"1140": "In her research, Mousavi recommends creating a decision tree that starts with the fundamental question, “If the worst-case scenario of a proposal were to occur, could you survive?” If not, don’t pursue it. But if so, the next question might be whether the company was well-positioned as a first mover in an area. By making each decision sequentially, the company can more effectively limit its information to just relevant factors."}, {"31b9": "But here’s another approach I like even more, via Angela Jia Kim, cofounder of women entrepreneurs’ network Savor The Success. Kim suggests we dissect our feelings by asking the following questions as we are checking our gut:"}, {"0d86": "“Do I feel good around this person or choice?”"}, {"ad9c": "I suggest that with these answers in hand, you then proceed to check the pros and cons on your cost/benefit and risk analysis charts. (On a private note, these steps could have saved millions of dollars in my own prior venture.) From here, the path becomes clear. Listen to your team. Listen to your internal reactions. Learn to trust and to balance both the cognitive and emotional responses that come back in the process to identify the right way to go."}, {"c69e": "Call to Action"}, {"86b6": "Would you like to know more? You can follow my weekly Forbes.com columns (where this originally appeared) on life, leadership and entrepreneurship here."}, {"31a8": "You can learn more about my company, Fishbowl Inventory, by visiting our website here. I look forward to hearing from you."}], "content": "When To Listen To Your Gut (And How To Know When Your Instincts Are Wrong) Your gut instinct is one of your greatest resources. You must hone your instincts for ultimate business success. Your gut instinct — and the instinct of your team — is one of your greatest resources. Instinct is invaluable, but not infallible, as I’d like to explain. Why is gut instinct so valuable? It is priceless primarily because it’s exponentially faster than your logical mind. Science has now demonstrated the importance of the “somatic markers” that clue you into why something “just feels right” (or it doesn’t) faster than any conscious thought can take hold. The speed of instinct is another one of the reasons body language is such an accurate marker — the body responds to stimulus within a 10th of a second and reacts with visible signals of dislike, lying, etc., that are difficult or even impossible to hide. Instinct is a vital survival mechanism that has kept us safe from dangers from the beginning of time. Instincts are also valuable in business in that they demonstrate someone’s instant and unguarded “gut check” to an idea that can be invaluable to a leader or team. It may be the small comment across the table from a John David to a Dusty that indicates how a project might go. Even a partial remark can be meaningful. Small reactions can mean huge things, and a leader should regard them as such. Hesitation? Fear? Perhaps ramifications you hadn’t thought about, like the sudden need to double customer support to accommodate the great idea you’ve just had? Regard these reactions with the utmost care, as a person’s good feeling or instinctive hesitation could have big implications on how your plan will work out. Here’s an example of the power of instinct from Lydia Dishman, in FastCompany Magazine, via a researcher named Shabnam Mousavi, an assistant professor at John Hopkins Carey Business School. Mousavi was the lead author of “Risk, Uncertainty, And Heuristics,” a paper that explores the times intuition can be more useful than deliberate calculation. Mousavi’s premise was that sometimes we muddle our outcomes by bombarding ourselves with too much information. As an example, she quizzed German and U.S. students to see if they could state which city is larger: Detroit or Milwaukee. Despite not being American, the Germans were 90% correct versus only 60% of the American students she asked. Why? Because the Germans simply picked the city they’d heard more about and guessed it would stand to reason it was the larger of the two. They “went with their gut.” Americans, on the other hand, rifled through their mental library of knowledge of the two cities, which got in the way of their reaching for the obvious answer, and they failed. Why your gut may sometimes get it wrong. Sometimes our instincts betray us. We might hire someone who makes us feel at ease and comfortable and later discover the person is a well-practiced sociopath. We might move in with a roommate or romantic partner we barely know because the friendship felt “right.” When we let our emotions bear sway without an accompanying cost/benefit and risk analysis, we might be hurtling down a path that is 100% wrong. In my own life, I can’t remember a time when “putting a gap between the stimuli and the response” has failed to serve me well. Sometimes that gap may be simply standing up and walking a bit before responding. Or it may be a few hours, or you may need to sleep on it. Typically the great idea will become stronger, or you may realize your initial inclination was an emotional response without adequate accompanying intelligence behind it. For example, in my early career I was involved in a massive project to redevelop the property that had been operating as a steel mill in Utah, in the county where I lived. It was a gut decision (at the right time, initially) that started me down a path of cleaning up this eyesore in the heart of our community. I became so personally (and financially) invested in the positive aspects of this project (cleaning up the air where our community lived, worked and was raising our children) that I followed my gut (at the wrong time) in pursuing the project to the bitter end, which resulted in a failed real estate venture and a very bitter ending indeed. I allowed my emotions about the good the project would do for the community I loved to override the cost/benefit analysis of continuing forward, which contributed to going deeper into a project that was destined to fail. Another risk to beware in following your instincts is the tendency of some individuals, and even leaders, to wield their instincts as a kind of “God Card.” They declare that their instincts have spoken to them about a person, project or course of action, and all discussion on the matter is done. This is self-deception. A person who moves forward in this way is not only ignoring rational analysis, but is ignoring the equally valid instincts of their team members and stakeholders as well. Using the “God Card” in business dealings is inappropriate. Whenever someone starts telling me what they do in their church in the context of a business negotiation, it raises a red flag and I will often call an immediate end to the conversation. While the strategy of “my instinct rules; the discussion’s over” might serve the person and even the team in some cases, over the course of a company’s lifetime, it is a practice that will not end well. The right approach to instinct is balanced. Some experts maintain that instincts based on emotion are best saved for romantic connections or vetting out situations, such as a child who is experiencing abuse. They suggest that business decisions should rely entirely on a rational analysis of cost/benefit results. I propose we discard this notion. Instead, we should hone our skills in making decisions that balance our emotions with our factual analysis. This will allow us to capture the critical aspects of both. In her research, Mousavi recommends creating a decision tree that starts with the fundamental question, “If the worst-case scenario of a proposal were to occur, could you survive?” If not, don’t pursue it. But if so, the next question might be whether the company was well-positioned as a first mover in an area. By making each decision sequentially, the company can more effectively limit its information to just relevant factors. But here’s another approach I like even more, via Angela Jia Kim, cofounder of women entrepreneurs’ network Savor The Success. Kim suggests we dissect our feelings by asking the following questions as we are checking our gut: “Do I feel good around this person or choice?” I suggest that with these answers in hand, you then proceed to check the pros and cons on your cost/benefit and risk analysis charts. (On a private note, these steps could have saved millions of dollars in my own prior venture.) From here, the path becomes clear. Listen to your team. Listen to your internal reactions. Learn to trust and to balance both the cognitive and emotional responses that come back in the process to identify the right way to go. Call to Action Would you like to know more? You can follow my weekly Forbes.com columns (where this originally appeared) on life, leadership and entrepreneurship here. You can learn more about my company, Fishbowl Inventory, by visiting our website here. I look forward to hearing from you. ", "name": "230", "child": "230_1\t230_2\t230_3\t230_4\t230_5", "timestamp": "Apr 11"}