{"parent": "", "title": "Why is genuine teamwork elusive?", "author": "Crisp Apples", "sentences": [{"4963": "Why is genuine teamwork elusive?"}, {"b377": "If you could get all the people in an organization rowing in the same direction, you could dominate any market, against any competition. But the truth is that genuine teamwork remains elusive in most organizations, and team leaders and members fall unknowingly to the 5 dysfunction pitfalls."}, {"3fcb": "Patrick Lencioni told a leadership tale in his book about how Kathryn, the new CEO of a once-promising but now-failing company, managed to bring the unconsciously dysfunctional executive team into a cohesive and effective team, to illustrate an actionable model which is applicable to any team. I thought it’s worth sharing, if you haven’t got time to read the original."}, {"a4db": "1. Absence of Trust"}, {"c80a": "The word trust is used so often and in so many ways that it has lost its impact. You often hear people say: “I trust my coworkers so I don’t question how they do their job”, “I trust my boss so I followed his order without question”, “I trust him implicitly and I’m ready to go to bat for him any time” …… but these stand in contrast to the type of trust an effective team needs."}, {"e872": "More than anything I’ve told by others, I see a trust problem here in the lack of debate that exists during meetings and other interactions among this team."}, {"1e25": "Great team do not hold back with one another. They admit their mistakes, their weakness, and their concerns without fear. Every effective team has a substantial level of debate."}, {"823c": "The only way to do that is to overcome our need for invulnerability. Achieving vulnerability-based trust is difficult because it requires us to turn off our instincts which we learned over the years to be competitive with our peers and protective of our reputations."}, {"d8af": "Teams that lack trust waste inordinate amounts of time and energy managing their behaviors and interactions within the group. As a result, morale is usually quite low, and unwanted turnover is high."}, {"9c74": "Team assessment: Do team members call out one another’s deficiencies or unproductive behaviors? Do they challenge one another about their plans and approaches?"}, {"8e4a": "2. Fear of Conflict"}, {"d9fd": "A dysfunctional team may have tension, but almost no constructive conflict. If we don’t trust one another, then we aren’t going to engage in open, ideological conflict, and we’ll just continue to preserve a sense of artificial harmony."}, {"8111": "If we can’t learn to engage in passionate, unfiltered debate about what we need to do to succeed, we are through."}, {"f7e7": "Team meetings and movies have lots in common. What makes a movie interesting? Conflict. If there’s nothing worth debating, then we won’t have a meeting."}, {"0003": "Team Assessment: During team meetings, are the most important — and difficult — issues put on the table to be resolved?"}, {"19d2": "3. Lack of commitment"}, {"ae7c": "The evidence of this one is ambiguity."}, {"f636": "When people don’t unload their opinion and feel like they’ve been listened to (due to fear of conflict), they won’t really get on board."}, {"d4db": "This is not consensus. Consensus is horrible. Because it’s rare everyone really agrees on something naturally and quickly, consensus becomes an attempt to please everyone, which usually turns into displeasing everyone equally. Most reasonable people just need to be heard, and to know their input has been understood, considered and responded to."}, {"39bd": "You can call it disagree and commit."}, {"98ed": "You may have worked with managers who like to describe any sensitive decision as “Everyone is happy with”. Are they the effective and confident managers, or the opposite?"}, {"8a4f": "4. Avoidance of Accountability"}, {"e5a1": "The evidence is low standard."}, {"082c": "It’s not easy to hold someone accountable. Some people are hard to hold accountable because they are so helpful. Others because they get defensive. Others because they are intimidating."}, {"9762": "People decide to tolerate peers on issues which matter, to avoid the interpersonal discomfort."}, {"8690": "While managers may not have as much of problem to hold direct reports accountable, it’s harder with peers, because “We are supposed to be equals, and who am I to stick my nose into their business?” More importantly, when there was no buy-in and commitment in the first place, it seems pointless, people would just say “I never agreed to that anyway”."}, {"16cf": "(Some managers may say “I just consider each team member has his own job, I let them be accountable for their own area, and I help them on one-on-one basis when I could.”) Okay, imagine a basketball coach at half-time. He calls each player to his office one-on-one about the first half, without letting any of them knowing what everyone else was talking about. That’s not a team. It’s a collection of individuals."}, {"8a84": "Once the team achieves clarity and buy-in, then we have to hold each other accountable for what we sign up to do, for high standards of performance and behavior."}, {"ffe0": "Push with respect, and under the assumption that the other person is probably doing the right thing. But push anyway. And never hold back."}, {"1c38": "5. Inattention to results"}, {"f356": "The evidence is ego and politics."}, {"f529": "There’s a reason that sports are so prevalent when it comes to teamwork, the score at the end of the game that determines if you won or lost, there’s little room for interpretation or ego-driven success."}, {"510e": "The key is to define goals for the team in a simply measurable way which leaves no room for interpretation when it comes to success. Otherwise it only creates the opportunity for individual ego to sneak in. And that’s where politics prevail."}, {"9af6": "Many of us have had experience with organizations which emphasize effort over result. People take pride in fighting fires than preventing fire in the first place. The incentive to improve efficiency and quality is lost, the game to preserve the illusion of long working hours is on. The next things gone are the competitive edge and team morale."}, {"eabb": "The politics around here are astounding, and they are a result of everyone being far too ambiguous about what we are trying to accomplish, and that makes it easy to focus on individual success."}, {"0850": "Kathryn’s observation shocked everyone in the team, they thought she went too far this time to say they are political. One of them had to ask “What do you mean by politics?”"}, {"1315": "Politics is when people choose their words and actions based on how they want others to react rather than based on what they really think."}, {"8f26": "Then it started to sink in."}, {"fcbe": "Team Assessment: Does the failure to achieve team goals affect morale significantly? Or does everyone just think it’s not his fault?"}, {"268e": "It’s a journey."}, {"1763": "During the next two weeks I’m going to be pretty intolerant of behavior that demonstrates an absence of trust, or focus on individual ego. I will be encouraging conflict, driving for clear commitments, and expecting all of you to hold each other accountable. I’ll be calling out bad behavior when I see it, and I’d like to see you doing the same. We don’t have time to waste."}, {"5091": "After weeks of quiet observation followed by a team building phase, Kathryn laid out the ground rules."}, {"a0b8": "On the way to shedding their dysfunctions, plenty of groups slide backward. The journey is about having the discipline and persistence to keep doing what we started to do."}, {"5572": "The signs of progress in the eyes of a new member who just joined Kathryn’s renewed team:"}, {"ea01": "Joseph was new to the staff meeting. He witnessed the most passionate debates he had ever heard, which ended with crystal-clear agreements and no sense of lingering bitterness. People called each other on carpet once or twice in ways that made Joseph uncomfortable, but in each case they brought the discussions around to results. At the end of the session, he decided he had joined one of the most unusual and intense executive teams he had ever seen, and couldn’t wait to become an active part of it."}, {"f52e": "It’s difficult to build a cohesive team, but not complicated. Keep it simple."}, {"cf4d": "If you enjoyed this post, please consider clicking the ❤ button so more people can find it, and check out Part 2 of this story."}], "content": "Why is genuine teamwork elusive? If you could get all the people in an organization rowing in the same direction, you could dominate any market, against any competition. But the truth is that genuine teamwork remains elusive in most organizations, and team leaders and members fall unknowingly to the 5 dysfunction pitfalls. Patrick Lencioni told a leadership tale in his book about how Kathryn, the new CEO of a once-promising but now-failing company, managed to bring the unconsciously dysfunctional executive team into a cohesive and effective team, to illustrate an actionable model which is applicable to any team. I thought it’s worth sharing, if you haven’t got time to read the original. 1. Absence of Trust The word trust is used so often and in so many ways that it has lost its impact. You often hear people say: “I trust my coworkers so I don’t question how they do their job”, “I trust my boss so I followed his order without question”, “I trust him implicitly and I’m ready to go to bat for him any time” …… but these stand in contrast to the type of trust an effective team needs. More than anything I’ve told by others, I see a trust problem here in the lack of debate that exists during meetings and other interactions among this team. Great team do not hold back with one another. They admit their mistakes, their weakness, and their concerns without fear. Every effective team has a substantial level of debate. The only way to do that is to overcome our need for invulnerability. Achieving vulnerability-based trust is difficult because it requires us to turn off our instincts which we learned over the years to be competitive with our peers and protective of our reputations. Teams that lack trust waste inordinate amounts of time and energy managing their behaviors and interactions within the group. As a result, morale is usually quite low, and unwanted turnover is high. Team assessment: Do team members call out one another’s deficiencies or unproductive behaviors? Do they challenge one another about their plans and approaches? 2. Fear of Conflict A dysfunctional team may have tension, but almost no constructive conflict. If we don’t trust one another, then we aren’t going to engage in open, ideological conflict, and we’ll just continue to preserve a sense of artificial harmony. If we can’t learn to engage in passionate, unfiltered debate about what we need to do to succeed, we are through. Team meetings and movies have lots in common. What makes a movie interesting? Conflict. If there’s nothing worth debating, then we won’t have a meeting. Team Assessment: During team meetings, are the most important — and difficult — issues put on the table to be resolved? 3. Lack of commitment The evidence of this one is ambiguity. When people don’t unload their opinion and feel like they’ve been listened to (due to fear of conflict), they won’t really get on board. This is not consensus. Consensus is horrible. Because it’s rare everyone really agrees on something naturally and quickly, consensus becomes an attempt to please everyone, which usually turns into displeasing everyone equally. Most reasonable people just need to be heard, and to know their input has been understood, considered and responded to. You can call it disagree and commit. You may have worked with managers who like to describe any sensitive decision as “Everyone is happy with”. Are they the effective and confident managers, or the opposite? 4. Avoidance of Accountability The evidence is low standard. It’s not easy to hold someone accountable. Some people are hard to hold accountable because they are so helpful. Others because they get defensive. Others because they are intimidating. People decide to tolerate peers on issues which matter, to avoid the interpersonal discomfort. While managers may not have as much of problem to hold direct reports accountable, it’s harder with peers, because “We are supposed to be equals, and who am I to stick my nose into their business?” More importantly, when there was no buy-in and commitment in the first place, it seems pointless, people would just say “I never agreed to that anyway”. (Some managers may say “I just consider each team member has his own job, I let them be accountable for their own area, and I help them on one-on-one basis when I could.”) Okay, imagine a basketball coach at half-time. He calls each player to his office one-on-one about the first half, without letting any of them knowing what everyone else was talking about. That’s not a team. It’s a collection of individuals. Once the team achieves clarity and buy-in, then we have to hold each other accountable for what we sign up to do, for high standards of performance and behavior. Push with respect, and under the assumption that the other person is probably doing the right thing. But push anyway. And never hold back. 5. Inattention to results The evidence is ego and politics. There’s a reason that sports are so prevalent when it comes to teamwork, the score at the end of the game that determines if you won or lost, there’s little room for interpretation or ego-driven success. The key is to define goals for the team in a simply measurable way which leaves no room for interpretation when it comes to success. Otherwise it only creates the opportunity for individual ego to sneak in. And that’s where politics prevail. Many of us have had experience with organizations which emphasize effort over result. People take pride in fighting fires than preventing fire in the first place. The incentive to improve efficiency and quality is lost, the game to preserve the illusion of long working hours is on. The next things gone are the competitive edge and team morale. The politics around here are astounding, and they are a result of everyone being far too ambiguous about what we are trying to accomplish, and that makes it easy to focus on individual success. Kathryn’s observation shocked everyone in the team, they thought she went too far this time to say they are political. One of them had to ask “What do you mean by politics?” Politics is when people choose their words and actions based on how they want others to react rather than based on what they really think. Then it started to sink in. Team Assessment: Does the failure to achieve team goals affect morale significantly? Or does everyone just think it’s not his fault? It’s a journey. During the next two weeks I’m going to be pretty intolerant of behavior that demonstrates an absence of trust, or focus on individual ego. I will be encouraging conflict, driving for clear commitments, and expecting all of you to hold each other accountable. I’ll be calling out bad behavior when I see it, and I’d like to see you doing the same. We don’t have time to waste. After weeks of quiet observation followed by a team building phase, Kathryn laid out the ground rules. On the way to shedding their dysfunctions, plenty of groups slide backward. The journey is about having the discipline and persistence to keep doing what we started to do. The signs of progress in the eyes of a new member who just joined Kathryn’s renewed team: Joseph was new to the staff meeting. He witnessed the most passionate debates he had ever heard, which ended with crystal-clear agreements and no sense of lingering bitterness. People called each other on carpet once or twice in ways that made Joseph uncomfortable, but in each case they brought the discussions around to results. At the end of the session, he decided he had joined one of the most unusual and intense executive teams he had ever seen, and couldn’t wait to become an active part of it. It’s difficult to build a cohesive team, but not complicated. Keep it simple. If you enjoyed this post, please consider clicking the ❤ button so more people can find it, and check out Part 2 of this story. ", "name": "239", "child": "239_1\t239_2\t239_3\t239_4\t239_5\t239_6\t239_7\t239_8\t239_9\t239_10\t239_11\t239_12\t239_13\t239_14\t239_15\t239_16", "timestamp": "Apr 8"}