{"parent": "", "title": "Why You Shouldn’t Call It Innovation", "author": "Tim Woods", "sentences": [{"7fc5": "Why You Shouldn’t Call It Innovation"}, {"c63b": "In 1860 Swiss historian Jakob Burckhardt released his book The Civilization of the Renaissance in Italy. Up until that point the term ‘Renaissance’ was not widely used as the label for what we now think of as the period approximately between 1480 and 1520, where cultural, artistic and scientific creativity flourished. Burckhardt was the one who fixed the notion of the Renaissance into the common lexicon, and helped us to describe this seemingly unique period in history."}, {"2e44": "We think of the Renaissance as a period of great innovation and ingenuity, but at the time it was less about looking forward, and more about looking back — the overwhelming theme of the time was to rediscover and emulate the great minds of the Greek and Roman eras, it was a resurgence back to antiquity. We think of Da Vinci as one of the greatest painters in history, but at the time to paint was seen as the most common and lowly artistic form. When applying for a job with the Duke of Milan, Da Vinci lists 10 skills he can bring to the table, including the construction of bridges, cannons, and catapults. At the very end of the letter, he also mentions that in “painting I can do as much as anyone else”. To paint like Da Vinci was really no big deal."}, {"9c13": "What’s the point of this? The point is that innovation is only true after the fact. Innovation is a label you apply after the value creation has been achieved — not while you are attempting to create it."}, {"267e": "All to often today we see companies saying they are going to be innovative, pursuing innovation as a top strategic goal. But this is a category mistake; we will be the judge of whether they are innovative or not, you don’t simply get to choose."}, {"b0ac": "Hewlett-Packard was a hugely successful company. In 1990 it was worth $9 billion; through a series of innovations it grew to $135 billion by the 2000’s. But as it started to reach this plateau, it began hyping up its ‘innovativeness’, launching a branding campaign around the imperative to ‘invent’. Things soon began to fall apart, and in a desperate search for ideas it launched a consulting arm and merged with Compaq. By 2005 its market cap rapidly dropped by half to $70 billion."}, {"6e57": "When Apple unveiled the iPod, Steve Jobs talked about many things they strived for, like fitting 1,000 songs in your pocket, but how many times during his 1,400 word speech did he mention the word innovation (or innovative)? Not once."}, {"294e": "When Apple released the iPhone in 2007, a truly breakthrough innovation, Steve Jobs talked about making a product which leapfrogged any mobile device there had ever been, and making it super easy to use. In his lengthy 9,200 word speech, how many times did he mention the word innovation? Three times. Not much considering how truly breakthrough this product was."}, {"6b7f": "Yet if there is one company we’ve labelled innovative more than any other in recent times, it’s Apple. Those who innovate don’t talk about innovation."}, {"c6fe": "A couple of years ago the annual reports filed with the SEC showed the term was used 33,528 times, a 64% increase from five years prior (when Jobs unveiled the iPhone). Companies are hiring Chief Innovation Officers, and setting up Innovation Labs, or Innovation Teams. But as Chris Trimble and Vijay Govindarajan note in their excellent book, The Other Side of Innovation, you should be very careful about labelling such expeditions as innovation:"}, {"282e": "“We offer one small but important piece of advice. Since the Dedicated Team is purpose-built for an innovation initiative, it is natural to think of it as the “innovation team.” But doing so leads to several problems … calling the Dedicated Team the “innovation team” undermines the partnership [with other parts of the business]. A relationship of mutual respect is unlikely if there is a perception that the Dedicated Team is unique innovative. The implication that the Performance Engine [regular business] is not innovative will be heard loud and clear.”"}, {"ef41": "Da Vinci wasn’t aware he was living in the ‘Renaissance’, and he wasn’t even aware that his painting skills were going to be remembered far beyond his catapult-making skills were. The term Renaissance is for our benefit, to categorize and label these achievements, as historian Paul Johnson notes:"}, {"77d8": "“Needless to say, it is not those who actually live through the period who coin the term, but later, often much later, writers. … If the term has any useful meaning at all, it signifies the rediscovery and utilization of ancient virtues, skills, knowledge and culture”"}, {"7aac": "The Renaissance was a collection of many individual achievements and initiatives across Italy and eventually throughout Europe, each one adding to the momentum of the whole. Similarly what truly innovative firms are doing today, is creating a network of initiatives and capabilities — importantly not called innovation — which are collectively driving results, and transforming organizations. Specifically we are talking about things like:"}, {"30c0": "You don’t need to talk about innovation, it’s what others will talk about when you generate significant new value. In the meantime let’s talk about exactly what is happening to make better products, better companies, and happier customers, and beware of the trap of saying “we’re going to innovate”!"}, {"5f99": "Originally published at blog.hypeinnovation.com."}], "content": "Why You Shouldn’t Call It Innovation In 1860 Swiss historian Jakob Burckhardt released his book The Civilization of the Renaissance in Italy. Up until that point the term ‘Renaissance’ was not widely used as the label for what we now think of as the period approximately between 1480 and 1520, where cultural, artistic and scientific creativity flourished. Burckhardt was the one who fixed the notion of the Renaissance into the common lexicon, and helped us to describe this seemingly unique period in history. We think of the Renaissance as a period of great innovation and ingenuity, but at the time it was less about looking forward, and more about looking back — the overwhelming theme of the time was to rediscover and emulate the great minds of the Greek and Roman eras, it was a resurgence back to antiquity. We think of Da Vinci as one of the greatest painters in history, but at the time to paint was seen as the most common and lowly artistic form. When applying for a job with the Duke of Milan, Da Vinci lists 10 skills he can bring to the table, including the construction of bridges, cannons, and catapults. At the very end of the letter, he also mentions that in “painting I can do as much as anyone else”. To paint like Da Vinci was really no big deal. What’s the point of this? The point is that innovation is only true after the fact. Innovation is a label you apply after the value creation has been achieved — not while you are attempting to create it. All to often today we see companies saying they are going to be innovative, pursuing innovation as a top strategic goal. But this is a category mistake; we will be the judge of whether they are innovative or not, you don’t simply get to choose. Hewlett-Packard was a hugely successful company. In 1990 it was worth $9 billion; through a series of innovations it grew to $135 billion by the 2000’s. But as it started to reach this plateau, it began hyping up its ‘innovativeness’, launching a branding campaign around the imperative to ‘invent’. Things soon began to fall apart, and in a desperate search for ideas it launched a consulting arm and merged with Compaq. By 2005 its market cap rapidly dropped by half to $70 billion. When Apple unveiled the iPod, Steve Jobs talked about many things they strived for, like fitting 1,000 songs in your pocket, but how many times during his 1,400 word speech did he mention the word innovation (or innovative)? Not once. When Apple released the iPhone in 2007, a truly breakthrough innovation, Steve Jobs talked about making a product which leapfrogged any mobile device there had ever been, and making it super easy to use. In his lengthy 9,200 word speech, how many times did he mention the word innovation? Three times. Not much considering how truly breakthrough this product was. Yet if there is one company we’ve labelled innovative more than any other in recent times, it’s Apple. Those who innovate don’t talk about innovation. A couple of years ago the annual reports filed with the SEC showed the term was used 33,528 times, a 64% increase from five years prior (when Jobs unveiled the iPhone). Companies are hiring Chief Innovation Officers, and setting up Innovation Labs, or Innovation Teams. But as Chris Trimble and Vijay Govindarajan note in their excellent book, The Other Side of Innovation, you should be very careful about labelling such expeditions as innovation: “We offer one small but important piece of advice. Since the Dedicated Team is purpose-built for an innovation initiative, it is natural to think of it as the “innovation team.” But doing so leads to several problems … calling the Dedicated Team the “innovation team” undermines the partnership [with other parts of the business]. A relationship of mutual respect is unlikely if there is a perception that the Dedicated Team is unique innovative. The implication that the Performance Engine [regular business] is not innovative will be heard loud and clear.” Da Vinci wasn’t aware he was living in the ‘Renaissance’, and he wasn’t even aware that his painting skills were going to be remembered far beyond his catapult-making skills were. The term Renaissance is for our benefit, to categorize and label these achievements, as historian Paul Johnson notes: “Needless to say, it is not those who actually live through the period who coin the term, but later, often much later, writers. … If the term has any useful meaning at all, it signifies the rediscovery and utilization of ancient virtues, skills, knowledge and culture” The Renaissance was a collection of many individual achievements and initiatives across Italy and eventually throughout Europe, each one adding to the momentum of the whole. Similarly what truly innovative firms are doing today, is creating a network of initiatives and capabilities — importantly not called innovation — which are collectively driving results, and transforming organizations. Specifically we are talking about things like: You don’t need to talk about innovation, it’s what others will talk about when you generate significant new value. In the meantime let’s talk about exactly what is happening to make better products, better companies, and happier customers, and beware of the trap of saying “we’re going to innovate”! Originally published at blog.hypeinnovation.com. ", "name": "246", "child": "246_1\t246_2\t246_3\t246_4\t246_5\t246_6\t246_7246_1\t246_2\t246_3\t246_4\t246_5\t246_6\t246_7", "timestamp": "Apr 9"}