{"parent": "", "title": "Serving Our Public on Their Terms, on Facebook", "author": "Jeff Jarvis", "sentences": [{"002b": "Serving Our Public on Their Terms, on Facebook"}, {"6e4a": "I wrote this post before Facebook announced the principles behind its News Feed formulae and adjusted the algorithm to further favor friends and family. News organizations predictably went into a huffy fuss, presuming Facebook should acknowledge their God-given right to dump 800-word articles on Facebook’s users. (My effort at antacid here.)"}, {"1350": "The better reaction to Facebook’s announcements would be to adjust how we do our work to better inform and serve Facebook’s users on their terms. As I learned at Vidcon, we have to see that in a social context, content is not an end in itself — the destination for a click — but a social token people use to their ends in their conversations."}, {"2686": "So we should listen to those conversations to see not just how we can exploit but how we can better inform them. We should provide elements that fit into the use cases of the platforms. Take a look at how Occupy Democrats does this by making memes on Facebook. Publishers are similarly making GIFs with information embedded for easy use on Twitter."}, {"1e2e": "What follows turns out to be an example of how we in news could do this: adding facts and journalistic value to the flow of people’s conversations not by making them come to our articles but instead first by listening to what they’re saying (and getting wrong) and then enabling them to share the corrections (or stop them from unwittingly spreading untruths in the first place)."}, {"7f0e": "Facebook — with our help — can tackle the problem of viral lies and idiocies"}, {"0f15": "A week or so ago, someone I know posted a picture of Canadian Prime Minister Justin Trudeau in a liplock with a man — an apparent political statement about the Orlando tragedy. Well, I thought, that could be the kind of bold thing Trudeau might do. But I wondered why I hadn’t already seen this; the guy who posted it wasn’t someone I knew to be ahead of the news. I moved my cursor over the picture, debating whether to invest in the click, and Facebook — as is its amazing habit — popped up boxes of related content below. One of those boxes, as you can see, was from BuzzFeed, the other from Snopes. Both debunked the Trudeau smooch."}, {"6ab3": "At that moment, Facebook fact-checked the web. And I thought: Hey, Facebook, why can’t you do that all the time? Facebook could and so could Google and perhaps Twitter and other platforms. And we in news should help them."}, {"93a1": "At one level, the platforms could do just what Facebook did in this instance: Show related content to a trending item, especially when that related item comes from Snopes."}, {"01b5": "We in the news business could help by providing a simple bit of metadata when we debunk such a meme. The Trust Project has been looking for signals of authority that news sites could provide to the platforms. This is the opposite: A signal of bullshit. Nothing is more needed in media, social or otherwise, these days. When you think about it, tagging and signaling what’s known to be false is easier than trying to invent the God Tag for what is true."}, {"ffa6": "Now take it one step further: What if Facebook, Twitter, Snapchat, et al could warn us before we share such bullshit: “We see you’re about to tweet this amazing tale of Hillary Clinton eating cats for dinner, but you might want to see these reports from a few reliable sources first.” This wouldn’t stop Clinton cat-truthers from spreading their bile and lies, but it would give a reasonable person pause."}, {"d5e8": "Newsdar"}, {"2e22": "Even without specific debunking, such a learn-before-posting service would mimic what responsible people do anyway. Example: A few days after seeing the Trudeau kiss — my social newsdar sensitized — I was riding in the car with the family when I saw another reasonable person on Facebook link to a story saying that the President had issued an executive order banning assault weapons. It was, of course, a lie but it was at first glance a well-made one, written under an Associated Press byline and in APese, appearing on what appeared to be ABC News’ site with an ABC-looking url. But reading further, there were too many signals that this news was too good to be true; parodists and tall-tale-tellers always go too far. And on second glance, the URL was fake, something like abcnews.com.co. But the most telling clue was that The New York Times, The Washington Post, The Guardian, and NBC News — none of them — had a similar report."}, {"3e01": "That leads me to the further product feature: If you don’t have a formal debunking to show me, you can show me the latest reports from trusted news sources about the story’s primary entity, President Obama, and topic, assault weapons. That would save said reasonable person from the trouble of going to those sites to investigate and see that no one but this dubious site is reporting this dubious news."}, {"8f20": "Either the person who posted this report did just that — post-post — or commenters did the work for him. For when I clicked to leave a comment and alert him, the post had been deleted. Imagine if Facebook could have saved his readers the trouble and him the embarrassment of being duped."}, {"9989": "Imagine further if, once the poster realizes he has been had, he could send an alert to everyone who saw, shared, clicked on, or commented on the bullshit, alerting them to its known bullshitedness. That’s a variation on a service I’ve been asking for since the dawn of blogs: The ability to subscribe to corrections about a post or send out alerts regarding it. That would have been tough in blogs but in social media, it’d be easy: Facebook and Twitter know who has read the bullshit; just let the bullshitter send them notice."}, {"1693": "None of the features I suggest are the magical truth machines people seek when trying to solve the problem of spreading truth over ignorance. I’ve sat in too many damned brainstorming sessions in which smart people will dream that there’ll just be some algorithm — some artificial intelligence, tronc would say — that could detect a falsehood in a news story or better yet a politician’s speech. Beyond just labelling everything Donald Trump says a lie — your odds of being right are at least 90% — this idea is easier brainstormed than done."}, {"db13": "But everything I’ve suggested here — (1) attaching debunkings to the memes they debunk; (2) surfacing related reporting from reliable sources, and (3) enabling those who’ve innocently posted something that’s wrong to send out alerts once that’s known — does not rely on magic. It’s doable because the platforms are getting ever better at understanding context (Trudeau/kiss or Obama/assault weapons) and they also — to use the emotional uh-oh word too often used — track what we do, so they know who shared and interacted with any particular item."}, {"cbb7": "However, we should not rely on the platforms to solve the problems we help cause. News media should play a role. Indeed, I know too many newsrooms where it is now someone’s job to follow trending news and then rewrite it just to get cheap traffic— blame our business model. How about making it their job to follow trending bullshit and debunk it. Now that would be journalism."}], "content": "Serving Our Public on Their Terms, on Facebook I wrote this post before Facebook announced the principles behind its News Feed formulae and adjusted the algorithm to further favor friends and family. News organizations predictably went into a huffy fuss, presuming Facebook should acknowledge their God-given right to dump 800-word articles on Facebook’s users. (My effort at antacid here.) The better reaction to Facebook’s announcements would be to adjust how we do our work to better inform and serve Facebook’s users on their terms. As I learned at Vidcon, we have to see that in a social context, content is not an end in itself — the destination for a click — but a social token people use to their ends in their conversations. So we should listen to those conversations to see not just how we can exploit but how we can better inform them. We should provide elements that fit into the use cases of the platforms. Take a look at how Occupy Democrats does this by making memes on Facebook. Publishers are similarly making GIFs with information embedded for easy use on Twitter. What follows turns out to be an example of how we in news could do this: adding facts and journalistic value to the flow of people’s conversations not by making them come to our articles but instead first by listening to what they’re saying (and getting wrong) and then enabling them to share the corrections (or stop them from unwittingly spreading untruths in the first place). Facebook — with our help — can tackle the problem of viral lies and idiocies A week or so ago, someone I know posted a picture of Canadian Prime Minister Justin Trudeau in a liplock with a man — an apparent political statement about the Orlando tragedy. Well, I thought, that could be the kind of bold thing Trudeau might do. But I wondered why I hadn’t already seen this; the guy who posted it wasn’t someone I knew to be ahead of the news. I moved my cursor over the picture, debating whether to invest in the click, and Facebook — as is its amazing habit — popped up boxes of related content below. One of those boxes, as you can see, was from BuzzFeed, the other from Snopes. Both debunked the Trudeau smooch. At that moment, Facebook fact-checked the web. And I thought: Hey, Facebook, why can’t you do that all the time? Facebook could and so could Google and perhaps Twitter and other platforms. And we in news should help them. At one level, the platforms could do just what Facebook did in this instance: Show related content to a trending item, especially when that related item comes from Snopes. We in the news business could help by providing a simple bit of metadata when we debunk such a meme. The Trust Project has been looking for signals of authority that news sites could provide to the platforms. This is the opposite: A signal of bullshit. Nothing is more needed in media, social or otherwise, these days. When you think about it, tagging and signaling what’s known to be false is easier than trying to invent the God Tag for what is true. Now take it one step further: What if Facebook, Twitter, Snapchat, et al could warn us before we share such bullshit: “We see you’re about to tweet this amazing tale of Hillary Clinton eating cats for dinner, but you might want to see these reports from a few reliable sources first.” This wouldn’t stop Clinton cat-truthers from spreading their bile and lies, but it would give a reasonable person pause. Newsdar Even without specific debunking, such a learn-before-posting service would mimic what responsible people do anyway. Example: A few days after seeing the Trudeau kiss — my social newsdar sensitized — I was riding in the car with the family when I saw another reasonable person on Facebook link to a story saying that the President had issued an executive order banning assault weapons. It was, of course, a lie but it was at first glance a well-made one, written under an Associated Press byline and in APese, appearing on what appeared to be ABC News’ site with an ABC-looking url. But reading further, there were too many signals that this news was too good to be true; parodists and tall-tale-tellers always go too far. And on second glance, the URL was fake, something like abcnews.com.co. But the most telling clue was that The New York Times, The Washington Post, The Guardian, and NBC News — none of them — had a similar report. That leads me to the further product feature: If you don’t have a formal debunking to show me, you can show me the latest reports from trusted news sources about the story’s primary entity, President Obama, and topic, assault weapons. That would save said reasonable person from the trouble of going to those sites to investigate and see that no one but this dubious site is reporting this dubious news. Either the person who posted this report did just that — post-post — or commenters did the work for him. For when I clicked to leave a comment and alert him, the post had been deleted. Imagine if Facebook could have saved his readers the trouble and him the embarrassment of being duped. Imagine further if, once the poster realizes he has been had, he could send an alert to everyone who saw, shared, clicked on, or commented on the bullshit, alerting them to its known bullshitedness. That’s a variation on a service I’ve been asking for since the dawn of blogs: The ability to subscribe to corrections about a post or send out alerts regarding it. That would have been tough in blogs but in social media, it’d be easy: Facebook and Twitter know who has read the bullshit; just let the bullshitter send them notice. None of the features I suggest are the magical truth machines people seek when trying to solve the problem of spreading truth over ignorance. I’ve sat in too many damned brainstorming sessions in which smart people will dream that there’ll just be some algorithm — some artificial intelligence, tronc would say — that could detect a falsehood in a news story or better yet a politician’s speech. Beyond just labelling everything Donald Trump says a lie — your odds of being right are at least 90% — this idea is easier brainstormed than done. But everything I’ve suggested here — (1) attaching debunkings to the memes they debunk; (2) surfacing related reporting from reliable sources, and (3) enabling those who’ve innocently posted something that’s wrong to send out alerts once that’s known — does not rely on magic. It’s doable because the platforms are getting ever better at understanding context (Trudeau/kiss or Obama/assault weapons) and they also — to use the emotional uh-oh word too often used — track what we do, so they know who shared and interacted with any particular item. However, we should not rely on the platforms to solve the problems we help cause. News media should play a role. Indeed, I know too many newsrooms where it is now someone’s job to follow trending news and then rewrite it just to get cheap traffic— blame our business model. How about making it their job to follow trending bullshit and debunk it. Now that would be journalism. ", "name": "254", "child": "254_1\t254_2\t254_3\t254_4\t254_5\t254_6", "timestamp": "Jun 30, 2016"}