{"parent": "", "title": "7 leçons apprises du génie Wil Aime", "author": "Marcus Ibuka Ndjoli", "sentences": [{"99a9": "7 leçons apprises du génie Wil Aime"}, {"fe13": "Comment devenir un véritable phénomène des réseaux sociaux"}, {"2b31": "Si vous ne connaissez pas Wil Aime, de deux choses l’une : 1- Vous n’avez pas Internet : ce qui est impossible puisque vous lisez ceci;2- Vous n’êtes pas sur les réseaux sociaux, ce qui est vraiment dommage."}, {"0bcd": "Pour aller vite, je vais vous le présenter en chiffres."}, {"c508": "Wil Aime, c’est 1.846.851 fans Facebook et plus de 150 millions de vues au total. C’est aussi 12 millions de vues, +461 mille likes et 278.714 partages en 17 heures sur sa toute dernière vidéo. Oui, vous l’avez compris : il s’agit d’un véritable phénomène des réseaux sociaux."}, {"58bf": "Certains disent qu’il est un viner, d’autres, un acteur, mais tous s’accordent pour dire qu’il est un artiste, un génie. Avec ses vidéos, Wil Aime nous fait passer par plusieurs émotions. On rit, réfléchit, pleure (pour certain(e)s), et, indéniablement, se retrouve émerveillé, surpris, se demandant “comment fait-il ça, nom de Dieu ?”"}, {"9b3d": "A travers son parcours, Wil Aime nous donne tous les secrets pour réussir sur le net et devenir un véritable phénomène des réseaux sociaux. Il suffit de le suivre en gardant à l’esprit que tous les détails comptent pour s’en apercevoir. Ci-après 7 leçons apprises de ce génie guadeloupéen que je partage avec vous. Cette liste n’est pas exhaustive. N’hésitez donc pas à la compléter au besoin."}, {"5912": "1 — Partir de sa passion"}, {"1dbe": "De ses interviews, on apprend que Wil Aime a fait du théâtre, et qu’incarner des personnages l’a toujours passionné. Plus jeune, au collège, un ami et lui feront même un remake de Prison Break en l’adaptant à leur contexte : l’école. C’est cette passion toujours nourrie qui le poussera à faire des vidéos, à défaut de jouer dans de véritables pièces de théâtre comme il avait appris à le faire. C’est donc de sa passion que tout est parti. Naturellement, il n’aurait pas eu autant de réussite dans la danse classique ou l’écriture de romans, quoique... Et on remarque aussi qu’il conjugue ses différentes passions (théâtre, musique, peinture) afin de réaliser ses vidéos qui nous bluffent tous."}, {"d7eb": "Partir de votre/vos passion(s) vous permettra d’évoluer et vous réinventer continuellement, ce qui augmentera vos chances de réussite. N’essayez pas de faire une chose qui ne vous passionne pas, juste parce que tout le monde la fait, ou parce qu’une personne que vous appréciez y excelle."}, {"ebad": "2 — Oser et exploiter son talent"}, {"53ac": "Aucun de nous ne disconviendra du talent de Wil Aime. Mais il ne nous aurait pas été possible de le constater s’il n’avait jamais osé le révéler et l’exploiter comme il le fait dans chaque nouvelle vidéo publiée. Il faut de l’audace pour se lancer de la sorte, sur le net, sachant que ce qu’on fait pourrait ne pas être compris, pis, apprécié. Et ce n’est pas tout de se lancer. Beaucoup de gens ont cette audace. Ce qui fait la différence entre ces gens-là et ceux qui deviennent des incontournables, c’est la manière dont est exploité leur talent. Je pense à Justin Bieber et ses premières vidéos sur Youtube."}, {"cb3f": "Ce n’est pas tout d’être passionné et d’avoir un véritable talent pour quelque domaine que ce soit; il faut encore oser le révéler et l’exploiter afin de se donner des chances de réussir, ou du moins, d’être remarqué."}, {"3f63": "3 — Ne pas nécessairement faire ce qui marche"}, {"b688": "Contrairement à la grande majorité des personnes qui se lancent sur le net pour faire des vidéos, Wil Aime n’est pas allé sur Youtube où il est possible de monétiser ses vidéos. Il a commencé avec l’application Vine, puis a pris ses quartiers sur Facebook, où il totalise aujourd’hui près de 2 millions de fans comme mentionné plus haut. Ce choix, il l’a fait avec intention. Il voulait la liberté qu’offre Facebook. On sait combien la musique joue un rôle important dans ses vidéos, or, sur Youtube, il est défendu d’utiliser dans ses vidéos des musiques qui ne sont pas libres de droits. Aussi, sans doute a-t-il compris que les vidéos ont plus de chance d’être vues sur Facebook que sur Youtube, non seulement du fait du grand nombre de personnes présentes sur ce réseau, mais aussi parce que l’algorithme de Facebook les met davantage en valeur."}, {"f183": "Suivre la tendance n’est pas toujours la chose la plus intelligente à faire. Il faut parfois aller à contre courant, marcher contre le vent, pour trouver les plus précieux trésors. Ce ne sera pas facile, mais si vous avez suffisamment de foi en ce que vous faites et savez pourquoi vous le faites, vous construirez un château dans le désert."}, {"7e80": "4 — Oser casser les codes : disruption"}, {"627b": "S’il est vrai que le fait d’avoir été vineur a beaucoup joué dans le choix du matériel avec lequel Wil Aime fait ses vidéos, il aurait pu, comme beaucoup le font, passer à une camera plus sophistiquée lorsqu’il a pris la décision de passer aux vidéos plus longues. Mais au lieu de cela, il a gardé son Iphone, avec lequel il réalise toutes les prises de vues et le montage des vidéos que nous aimons regarder. J’ai appris avec les photographes que ce n’est jamais le matériel qui compte, mais la personne qui l’utilise. Wil Aime nous montre ce qu’on peut faire avec un simple Smartphone. Aussi, alors qu’il est dit partout que seules les vidéos de moins de 30 secondes ont la chance d’avoir du buzz sur le net, Wil Aime a choisi d’en faire de plus de 2 minutes parfois. Gary Vaynerchuck réussit encore mieux avec des vidéos de plus de 5 minutes. Cela pour dire qu’il n’y a pas véritablement de codes. Il faut oser les casser et voir ce que cela va donner."}, {"0cee": "Quel que soit le domaine dans lequel vous vous trouvez, vous pouvez le réinventer. Vous n’êtes pas obligé(e) de tout faire comme cela a toujours été fait. Il faut oser des folies, aller vers l’inconnu, risquer le nouveau, l’original, car tôt ou tard, cela finit par payer si vous le faites bien."}, {"fb1a": "PS : Wil Aime a plus de followers sur Facebook que Gary Vaynerchuk, l’un des experts (et je pèse bien ce mot) en Marketing et Social Media au monde."}, {"4b20": "5 — Ne pas être prisonnier de son/ses succès"}, {"3e4d": "La première vidéo de Wil Aime, dit-on, est cette blague pourrie que lui aurait fait son petit cousin : “Tu connais la blague du p’tit têtard qui pensait qu’il était trop tôt?” Depuis lors, de nombreuses vidéos ont suivi. On a eu Chicken, puis le Génie 1 et 2, ensuite les vidéos sur les réalités de l’école ou la fac, et enfin, celles actuelles avec des mises en scènes originales et des chutes inattendues. On note une progression, mais en réalité, ce sont des risques qui sont pris à chaque nouvelle publication. Wil Aime aurait pu continuer de faire les mêmes vidéos qui avaient été appréciées, mais il a choisi de ne pas être prisonnier de son succès et aller vers de nouveaux horizons, là où on ne l’attend pas. C’est l’une des raisons pour lesquelles nous sommes nombreux à penser qu’il est le meilleur dans son domaine à l’heure actuelle. Les autres sont presque tous dans le même format. Et à la longue, on se lasse, ou devine ce qu’ils feront."}, {"e00a": "Quoi que soient vos réussites du passé, oubliez-les lorsque vous devez entamer un nouveau projet. Donnez-vous de nouveaux challenges. N’ayez jamais peur d’entacher vos précédents succès, ou de perdre vos followers. Ce que vous faites, vous devez le faire pour vous-mêmes avant tout. Vous devez être le/la premier(ère) à être fier(e) de votre travail. Si tel n’est pas le cas, vous vous ennuierez assez vite et ne produirez que du réchauffé. Dès qu’une personne plus originale apparaîtra, on vous oubliera."}, {"aedc": "6 — Être patient et faire attention aux détails"}, {"8bf8": "A la différence des autres youtubeurs, viners et autres gens qui font de la vidéo sur le net, Wil Aime nous fait longtemps attendre avant de poster une nouvelle vidéo. Mais lorsqu’il le fait, c’est presque toujours un grand succès, car la qualité est toujours au rendez-vous. Il ne se précipite pas. Il est patient. Il l’a d’ailleurs été lorsqu’il a commencé. Ce succès que nous lui connaissons aujourd’hui n’est pas arrivé en un soir. Il a travaillé durant de longs mois pour faire ce qu’il fait. Et c’est ainsi qu’il travaille sur ses vidéos. Comme il le dit lui-même, chaque détail compte. Et ses vidéos sont comme des livres de Dan Brown. Y sont jetés çà et là des messages, références, clins d’oeil, et autres petits détails qui ne peuvent être vus que par les personnes qui font attention aux détails. Et pour arriver à faire cela, lui-même est obligé de faire attention aux détails. Il est par conséquent perfectionniste. Pas étonnant qu’il mette autant de temps à publier de nouvelles vidéos. Elles lui coûtent du temps, et c’est pour notre plaisir. Beaucoup ont essayé de l’imiter, mais aucun n’est parvenu à faire ce qu’il fait avec autant de succès, car, si tous savent jouer et filmer de belles images, tous ne font pas autant que lui attention aux détails."}, {"e133": "Le perfectionnisme est un défaut, c’est vrai, mais c’est un défaut qu’il est préférable d’avoir, tant qu’il ne vous garde pas dans l’inaction. Soyez méticuleux, tatillon, accordez une importance capitale au moindre détail. Soyez votre propre critique et soyez intransigeant envers vous-mêmes. Ne vous précipitez surtout pas pour satisfaire vos fans/followers. Ayez un gage de qualité. Nourrissez-le et faites en sorte d’y être fidèle. Démarquez-vous de la masse."}, {"cad0": "7 — S’amuser avant tout"}, {"686f": "J’ai découvert Wil Aime alors qu’il faisait encore des vines. Je ne le suivais pas régulièrement, mais j’appréciais certains de ses vines. Ensuite, il est arrivé sur Facebook et a commencé à faire des vidéos plus poussées. Je les voyais, mais étant très exigeant, cela ne suffisait pas encore pour que je commence à le suivre (je n’avais même pas aimé sa page). Ce n’est qu’après avoir été bluffé par l’une de ses vidéos à la mise en scène époustouflante que j’ai commencé à le suivre pour de vrai. Et depuis lors, ce que je constate, c’est le plaisir qu’il prend à réaliser ses vidéos et lors de la découverte des commentaires de ses followers. J’imagine son sourire, sa joie, lorsqu’une personne remarque le petit détail glissé dans une vidéo, détail souvent passé inaperçu aux yeux des autres. Je le sais car j’ai pratiquement la même réaction lorsqu’une personne voit un détail important glissé savamment dans l’un de mes livres, surtout dans les fictions. Je me dis qu’en fin de compte, cela n’a pas été vain. Et je m’amuse à le refaire, tout comme je vois Wil Aime s’amuser à nous gratifier de vidéos tout aussi surprenantes les unes que les autres. Le succès, l’argent, semblent peu lui importer, comme il le dit dans ses interviews, et c’est sage."}, {"dcaa": "Amusez-vous donc avant tout. Qu’importe le domaine dans lequel vous vous trouvez, prenez du plaisir à faire ce que vous faites. Vous travaillez dur, et vous êtes parfois le seul à savoir à quel point. Ne soyez pas esclave de ce travail. Amusez-vous, comme Beyoncé lorsqu’elle compose un nouveau son. Comme tout artiste en réalité. Ne vous laissez pas emprisonner par le succès ou l’argent. Amusez-vous; vous penserez au reste plus tard."}, {"c23c": "Voici donc les 7 leçons que j’ai tirées du parcours du génie qu’est Wil Aime ou de la personne elle-même, et que je tenais à partager avec vous. Comme je l’ai dit, la liste n’est pas exhaustive, et peut-être en avez-vous d’autres. N’hésitez pas à les partager avec moi en commentaire."}, {"63ef": "Je partage des astuces, conseils, découvertes et expériences dans une publication que j’ai nommée Ibuka Sharing, que vous trouverez => ici. N’hésitez pas à y faire un tour et/ou inviter vos proches à s’y rendre."}, {"833e": "Si vous avez apprécié ce billet, pensez à le partager avec d’autres. Et un like de votre part sur le petit ❤ en bas à gauche me fera grand plaisir ;)"}], "content": "7 leçons apprises du génie Wil Aime Comment devenir un véritable phénomène des réseaux sociaux Si vous ne connaissez pas Wil Aime, de deux choses l’une : 1- Vous n’avez pas Internet : ce qui est impossible puisque vous lisez ceci;2- Vous n’êtes pas sur les réseaux sociaux, ce qui est vraiment dommage. Pour aller vite, je vais vous le présenter en chiffres. Wil Aime, c’est 1.846.851 fans Facebook et plus de 150 millions de vues au total. C’est aussi 12 millions de vues, +461 mille likes et 278.714 partages en 17 heures sur sa toute dernière vidéo. Oui, vous l’avez compris : il s’agit d’un véritable phénomène des réseaux sociaux. Certains disent qu’il est un viner, d’autres, un acteur, mais tous s’accordent pour dire qu’il est un artiste, un génie. Avec ses vidéos, Wil Aime nous fait passer par plusieurs émotions. On rit, réfléchit, pleure (pour certain(e)s), et, indéniablement, se retrouve émerveillé, surpris, se demandant “comment fait-il ça, nom de Dieu ?” A travers son parcours, Wil Aime nous donne tous les secrets pour réussir sur le net et devenir un véritable phénomène des réseaux sociaux. Il suffit de le suivre en gardant à l’esprit que tous les détails comptent pour s’en apercevoir. Ci-après 7 leçons apprises de ce génie guadeloupéen que je partage avec vous. Cette liste n’est pas exhaustive. N’hésitez donc pas à la compléter au besoin. 1 — Partir de sa passion De ses interviews, on apprend que Wil Aime a fait du théâtre, et qu’incarner des personnages l’a toujours passionné. Plus jeune, au collège, un ami et lui feront même un remake de Prison Break en l’adaptant à leur contexte : l’école. C’est cette passion toujours nourrie qui le poussera à faire des vidéos, à défaut de jouer dans de véritables pièces de théâtre comme il avait appris à le faire. C’est donc de sa passion que tout est parti. Naturellement, il n’aurait pas eu autant de réussite dans la danse classique ou l’écriture de romans, quoique... Et on remarque aussi qu’il conjugue ses différentes passions (théâtre, musique, peinture) afin de réaliser ses vidéos qui nous bluffent tous. Partir de votre/vos passion(s) vous permettra d’évoluer et vous réinventer continuellement, ce qui augmentera vos chances de réussite. N’essayez pas de faire une chose qui ne vous passionne pas, juste parce que tout le monde la fait, ou parce qu’une personne que vous appréciez y excelle. 2 — Oser et exploiter son talent Aucun de nous ne disconviendra du talent de Wil Aime. Mais il ne nous aurait pas été possible de le constater s’il n’avait jamais osé le révéler et l’exploiter comme il le fait dans chaque nouvelle vidéo publiée. Il faut de l’audace pour se lancer de la sorte, sur le net, sachant que ce qu’on fait pourrait ne pas être compris, pis, apprécié. Et ce n’est pas tout de se lancer. Beaucoup de gens ont cette audace. Ce qui fait la différence entre ces gens-là et ceux qui deviennent des incontournables, c’est la manière dont est exploité leur talent. Je pense à Justin Bieber et ses premières vidéos sur Youtube. Ce n’est pas tout d’être passionné et d’avoir un véritable talent pour quelque domaine que ce soit; il faut encore oser le révéler et l’exploiter afin de se donner des chances de réussir, ou du moins, d’être remarqué. 3 — Ne pas nécessairement faire ce qui marche Contrairement à la grande majorité des personnes qui se lancent sur le net pour faire des vidéos, Wil Aime n’est pas allé sur Youtube où il est possible de monétiser ses vidéos. Il a commencé avec l’application Vine, puis a pris ses quartiers sur Facebook, où il totalise aujourd’hui près de 2 millions de fans comme mentionné plus haut. Ce choix, il l’a fait avec intention. Il voulait la liberté qu’offre Facebook. On sait combien la musique joue un rôle important dans ses vidéos, or, sur Youtube, il est défendu d’utiliser dans ses vidéos des musiques qui ne sont pas libres de droits. Aussi, sans doute a-t-il compris que les vidéos ont plus de chance d’être vues sur Facebook que sur Youtube, non seulement du fait du grand nombre de personnes présentes sur ce réseau, mais aussi parce que l’algorithme de Facebook les met davantage en valeur. Suivre la tendance n’est pas toujours la chose la plus intelligente à faire. Il faut parfois aller à contre courant, marcher contre le vent, pour trouver les plus précieux trésors. Ce ne sera pas facile, mais si vous avez suffisamment de foi en ce que vous faites et savez pourquoi vous le faites, vous construirez un château dans le désert. 4 — Oser casser les codes : disruption S’il est vrai que le fait d’avoir été vineur a beaucoup joué dans le choix du matériel avec lequel Wil Aime fait ses vidéos, il aurait pu, comme beaucoup le font, passer à une camera plus sophistiquée lorsqu’il a pris la décision de passer aux vidéos plus longues. Mais au lieu de cela, il a gardé son Iphone, avec lequel il réalise toutes les prises de vues et le montage des vidéos que nous aimons regarder. J’ai appris avec les photographes que ce n’est jamais le matériel qui compte, mais la personne qui l’utilise. Wil Aime nous montre ce qu’on peut faire avec un simple Smartphone. Aussi, alors qu’il est dit partout que seules les vidéos de moins de 30 secondes ont la chance d’avoir du buzz sur le net, Wil Aime a choisi d’en faire de plus de 2 minutes parfois. Gary Vaynerchuck réussit encore mieux avec des vidéos de plus de 5 minutes. Cela pour dire qu’il n’y a pas véritablement de codes. Il faut oser les casser et voir ce que cela va donner. Quel que soit le domaine dans lequel vous vous trouvez, vous pouvez le réinventer. Vous n’êtes pas obligé(e) de tout faire comme cela a toujours été fait. Il faut oser des folies, aller vers l’inconnu, risquer le nouveau, l’original, car tôt ou tard, cela finit par payer si vous le faites bien. PS : Wil Aime a plus de followers sur Facebook que Gary Vaynerchuk, l’un des experts (et je pèse bien ce mot) en Marketing et Social Media au monde. 5 — Ne pas être prisonnier de son/ses succès La première vidéo de Wil Aime, dit-on, est cette blague pourrie que lui aurait fait son petit cousin : “Tu connais la blague du p’tit têtard qui pensait qu’il était trop tôt?” Depuis lors, de nombreuses vidéos ont suivi. On a eu Chicken, puis le Génie 1 et 2, ensuite les vidéos sur les réalités de l’école ou la fac, et enfin, celles actuelles avec des mises en scènes originales et des chutes inattendues. On note une progression, mais en réalité, ce sont des risques qui sont pris à chaque nouvelle publication. Wil Aime aurait pu continuer de faire les mêmes vidéos qui avaient été appréciées, mais il a choisi de ne pas être prisonnier de son succès et aller vers de nouveaux horizons, là où on ne l’attend pas. C’est l’une des raisons pour lesquelles nous sommes nombreux à penser qu’il est le meilleur dans son domaine à l’heure actuelle. Les autres sont presque tous dans le même format. Et à la longue, on se lasse, ou devine ce qu’ils feront. Quoi que soient vos réussites du passé, oubliez-les lorsque vous devez entamer un nouveau projet. Donnez-vous de nouveaux challenges. N’ayez jamais peur d’entacher vos précédents succès, ou de perdre vos followers. Ce que vous faites, vous devez le faire pour vous-mêmes avant tout. Vous devez être le/la premier(ère) à être fier(e) de votre travail. Si tel n’est pas le cas, vous vous ennuierez assez vite et ne produirez que du réchauffé. Dès qu’une personne plus originale apparaîtra, on vous oubliera. 6 — Être patient et faire attention aux détails A la différence des autres youtubeurs, viners et autres gens qui font de la vidéo sur le net, Wil Aime nous fait longtemps attendre avant de poster une nouvelle vidéo. Mais lorsqu’il le fait, c’est presque toujours un grand succès, car la qualité est toujours au rendez-vous. Il ne se précipite pas. Il est patient. Il l’a d’ailleurs été lorsqu’il a commencé. Ce succès que nous lui connaissons aujourd’hui n’est pas arrivé en un soir. Il a travaillé durant de longs mois pour faire ce qu’il fait. Et c’est ainsi qu’il travaille sur ses vidéos. Comme il le dit lui-même, chaque détail compte. Et ses vidéos sont comme des livres de Dan Brown. Y sont jetés çà et là des messages, références, clins d’oeil, et autres petits détails qui ne peuvent être vus que par les personnes qui font attention aux détails. Et pour arriver à faire cela, lui-même est obligé de faire attention aux détails. Il est par conséquent perfectionniste. Pas étonnant qu’il mette autant de temps à publier de nouvelles vidéos. Elles lui coûtent du temps, et c’est pour notre plaisir. Beaucoup ont essayé de l’imiter, mais aucun n’est parvenu à faire ce qu’il fait avec autant de succès, car, si tous savent jouer et filmer de belles images, tous ne font pas autant que lui attention aux détails. Le perfectionnisme est un défaut, c’est vrai, mais c’est un défaut qu’il est préférable d’avoir, tant qu’il ne vous garde pas dans l’inaction. Soyez méticuleux, tatillon, accordez une importance capitale au moindre détail. Soyez votre propre critique et soyez intransigeant envers vous-mêmes. Ne vous précipitez surtout pas pour satisfaire vos fans/followers. Ayez un gage de qualité. Nourrissez-le et faites en sorte d’y être fidèle. Démarquez-vous de la masse. 7 — S’amuser avant tout J’ai découvert Wil Aime alors qu’il faisait encore des vines. Je ne le suivais pas régulièrement, mais j’appréciais certains de ses vines. Ensuite, il est arrivé sur Facebook et a commencé à faire des vidéos plus poussées. Je les voyais, mais étant très exigeant, cela ne suffisait pas encore pour que je commence à le suivre (je n’avais même pas aimé sa page). Ce n’est qu’après avoir été bluffé par l’une de ses vidéos à la mise en scène époustouflante que j’ai commencé à le suivre pour de vrai. Et depuis lors, ce que je constate, c’est le plaisir qu’il prend à réaliser ses vidéos et lors de la découverte des commentaires de ses followers. J’imagine son sourire, sa joie, lorsqu’une personne remarque le petit détail glissé dans une vidéo, détail souvent passé inaperçu aux yeux des autres. Je le sais car j’ai pratiquement la même réaction lorsqu’une personne voit un détail important glissé savamment dans l’un de mes livres, surtout dans les fictions. Je me dis qu’en fin de compte, cela n’a pas été vain. Et je m’amuse à le refaire, tout comme je vois Wil Aime s’amuser à nous gratifier de vidéos tout aussi surprenantes les unes que les autres. Le succès, l’argent, semblent peu lui importer, comme il le dit dans ses interviews, et c’est sage. Amusez-vous donc avant tout. Qu’importe le domaine dans lequel vous vous trouvez, prenez du plaisir à faire ce que vous faites. Vous travaillez dur, et vous êtes parfois le seul à savoir à quel point. Ne soyez pas esclave de ce travail. Amusez-vous, comme Beyoncé lorsqu’elle compose un nouveau son. Comme tout artiste en réalité. Ne vous laissez pas emprisonner par le succès ou l’argent. Amusez-vous; vous penserez au reste plus tard. Voici donc les 7 leçons que j’ai tirées du parcours du génie qu’est Wil Aime ou de la personne elle-même, et que je tenais à partager avec vous. Comme je l’ai dit, la liste n’est pas exhaustive, et peut-être en avez-vous d’autres. N’hésitez pas à les partager avec moi en commentaire. Je partage des astuces, conseils, découvertes et expériences dans une publication que j’ai nommée Ibuka Sharing, que vous trouverez => ici. N’hésitez pas à y faire un tour et/ou inviter vos proches à s’y rendre. Si vous avez apprécié ce billet, pensez à le partager avec d’autres. Et un like de votre part sur le petit ❤ en bas à gauche me fera grand plaisir ;) ", "name": "259", "child": "259_1\t259_2\t259_3259_1\t259_2\t259_3259_1\t259_2\t259_3259_1\t259_2\t259_3259_1\t259_2\t259_3259_1\t259_2\t259_3259_1\t259_2\t259_3259_1\t259_2\t259_3259_1\t259_2\t259_3259_1\t259_2\t259_3", "timestamp": "Apr 12"}