{"parent": "", "title": "Could the Thunder Find a Better Way to Use Russell Westbrook?", "author": "The Ringer NBA Show", "sentences": [{"03d8": "Could the Thunder Find a Better Way to Use Russell Westbrook?"}, {"dcc7": "Kevin O’Connor has a theory about Westbrook playing off the ball"}, {"eae4": "(Getty Images)"}, {"ab90": "Russell Westbrook’s 40.9 percent usage rating tops the NBA by a wide margin, and his one-man show has helped the Thunder to 46 wins and himself to the first triple-double-average season since Oscar Robertson. But could he be more efficient in a different offensive system? Kevin O’Connor shared his theory with Chris Vernon on the latest Ringer NBA Show."}, {"fec3": "Listen to the full podcast here. This transcript has been edited and condensed."}, {"07cb": "Westbrook’s Dominance in Isolation May Limit the Thunder’s Offensive Options"}, {"a63b": "Kevin O’Connor: If Russell Westbrook gets to do what he wants and [is] this Terminator triple-double machine, would his team be better off with that, or would they be better off if he took on a little bit more of a minimized role and allowed the team to really run Billy Donovan’s motion offense? If he played within the system would he benefit from becoming a more efficient player, instead of running more isolation possessions? Would he benefit from playing a little bit more off the ball?"}, {"ddd6": "Chris Vernon: The only way that Oklahoma City has won the amount of games that they have is by his individual brilliance. If Russell Westbrook would have gone down for 30 games that team would have won 10 at best. They’d go 10–20."}, {"4757": "O’Connor: I’m with you there. What I’m saying is if he didn’t have the all-time highest usage rate … if [his usage rate was] 80 percent of what it is [this season], and the role is distributed a little bit more, [maybe the team is better off]. Because I think Billy Donovan is a good coach. In many respects I’m not sure he’s getting to show that as much, because they run so much isolation with Russell Westbrook. And it works — I’m not saying it’s a bad thing for that team. But I can’t help but think that, if Donovan was allowed to install the same system he ran at Florida, like [how] a lot of teams are running their motion offense these days, Westbrook would be an even more efficient player this season. He might not be scoring over 30 a game, he might not be racking up those triple-doubles. But I can’t help but think that he’d be more efficient as a player. Maybe not even James Harden’s level, but a whole lot closer as an efficient scorer than what he is right now."}, {"e6a5": "The Best Points, Rebounds, and Assists From Westbrook’s Triple-Double SeasonOnly our favorite boards, dimes, and scorestheringer.com"}, {"e5fc": "Or Is the Talent-Depleted Roster Dependent on Westbrook?"}, {"0a56": "O’Connor: I think the answer might not be yes, but I think there’s a chance that the Thunder would be better off. A lot of people talk about how bad [the Thunder] are and how bad the core is. I don’t think their team is that bad. They don’t have a great team; it’s not as good as Houston. They don’t have nearly as much talent. But they have some good players on that team. Steven Adams is a great center. [Andre] Roberson arguably deserves to be first team All-Defense. [Victor] Oladipo has had a really good year. [Domantas] Sabonis is one of the strongest rookies this season, turned into a good shooter. [Enes] Kanter is a great backup center. They have talent on that team. I just wonder, in an alternate universe, if Russell Westbrook is averaging 28–8–8 instead of 32–11–10, would they be a little bit better off if he took slightly less of a role on the ball and played a little bit more off the ball and played off other guys? Is that possible?"}, {"7616": "Vernon: I don’t look around that roster and go, “This should be distributed, there should be less of Russell Westbrook.” I just don’t. In fact, whatever his usage rate is, it’s too low."}, {"6ff3": "O’Connor: I don’t even know if it’s less Russell Westbrook, it’s just a change in role. Tweaking his usage."}, {"458b": "Vernon: Listen, everybody loves Steven Adams, [but] I ain’t crazy about Adams. I’m a big Oladipo fan. The rest of them? You can have them. I just think we pump up these other guys. I mean, Taj [Gibson] is a nice role player. Adams is a role-playing center. Kanter, you couldn’t even have him on the court in the playoffs last year, because he can’t defend anybody. And then what? Roberson? I mean, come on. Fine, if you want to talk about “He’s an All-Defense player,” [but] you just go down that roster, there ain’t a lot that I want on that roster. I think it gets pumped up a little bit because they’re playing with Russ. If he wasn’t there and you saw them without him, I think it would shine a big light on what they actually got on that team."}], "content": "Could the Thunder Find a Better Way to Use Russell Westbrook? Kevin O’Connor has a theory about Westbrook playing off the ball (Getty Images) Russell Westbrook’s 40.9 percent usage rating tops the NBA by a wide margin, and his one-man show has helped the Thunder to 46 wins and himself to the first triple-double-average season since Oscar Robertson. But could he be more efficient in a different offensive system? Kevin O’Connor shared his theory with Chris Vernon on the latest Ringer NBA Show. Listen to the full podcast here. This transcript has been edited and condensed. Westbrook’s Dominance in Isolation May Limit the Thunder’s Offensive Options Kevin O’Connor: If Russell Westbrook gets to do what he wants and [is] this Terminator triple-double machine, would his team be better off with that, or would they be better off if he took on a little bit more of a minimized role and allowed the team to really run Billy Donovan’s motion offense? If he played within the system would he benefit from becoming a more efficient player, instead of running more isolation possessions? Would he benefit from playing a little bit more off the ball? Chris Vernon: The only way that Oklahoma City has won the amount of games that they have is by his individual brilliance. If Russell Westbrook would have gone down for 30 games that team would have won 10 at best. They’d go 10–20. O’Connor: I’m with you there. What I’m saying is if he didn’t have the all-time highest usage rate … if [his usage rate was] 80 percent of what it is [this season], and the role is distributed a little bit more, [maybe the team is better off]. Because I think Billy Donovan is a good coach. In many respects I’m not sure he’s getting to show that as much, because they run so much isolation with Russell Westbrook. And it works — I’m not saying it’s a bad thing for that team. But I can’t help but think that, if Donovan was allowed to install the same system he ran at Florida, like [how] a lot of teams are running their motion offense these days, Westbrook would be an even more efficient player this season. He might not be scoring over 30 a game, he might not be racking up those triple-doubles. But I can’t help but think that he’d be more efficient as a player. Maybe not even James Harden’s level, but a whole lot closer as an efficient scorer than what he is right now. The Best Points, Rebounds, and Assists From Westbrook’s Triple-Double SeasonOnly our favorite boards, dimes, and scorestheringer.com Or Is the Talent-Depleted Roster Dependent on Westbrook? O’Connor: I think the answer might not be yes, but I think there’s a chance that the Thunder would be better off. A lot of people talk about how bad [the Thunder] are and how bad the core is. I don’t think their team is that bad. They don’t have a great team; it’s not as good as Houston. They don’t have nearly as much talent. But they have some good players on that team. Steven Adams is a great center. [Andre] Roberson arguably deserves to be first team All-Defense. [Victor] Oladipo has had a really good year. [Domantas] Sabonis is one of the strongest rookies this season, turned into a good shooter. [Enes] Kanter is a great backup center. They have talent on that team. I just wonder, in an alternate universe, if Russell Westbrook is averaging 28–8–8 instead of 32–11–10, would they be a little bit better off if he took slightly less of a role on the ball and played a little bit more off the ball and played off other guys? Is that possible? Vernon: I don’t look around that roster and go, “This should be distributed, there should be less of Russell Westbrook.” I just don’t. In fact, whatever his usage rate is, it’s too low. O’Connor: I don’t even know if it’s less Russell Westbrook, it’s just a change in role. Tweaking his usage. Vernon: Listen, everybody loves Steven Adams, [but] I ain’t crazy about Adams. I’m a big Oladipo fan. The rest of them? You can have them. I just think we pump up these other guys. I mean, Taj [Gibson] is a nice role player. Adams is a role-playing center. Kanter, you couldn’t even have him on the court in the playoffs last year, because he can’t defend anybody. And then what? Roberson? I mean, come on. Fine, if you want to talk about “He’s an All-Defense player,” [but] you just go down that roster, there ain’t a lot that I want on that roster. I think it gets pumped up a little bit because they’re playing with Russ. If he wasn’t there and you saw them without him, I think it would shine a big light on what they actually got on that team. ", "name": "26", "child": "26_1\t26_2\t26_3\t26_4\t26_5", "timestamp": "Apr 11"}