{"parent": "", "title": "“Having a Moment” Has Had Its Moment", "author": "Kate Knibbs", "sentences": [{"20ec": "Lexicon Watch"}, {"a354": "“Having a Moment” Has Had Its Moment"}, {"009d": "How did this meaningless phrase turn into a headline cliché?"}, {"2471": "The following people, places, concepts, and political and philosophical ideologies are “having a moment” this March, according to various media outlets: drag shows, meatloaf, versatile citrus fruits, the city of Newark, gingham, Aboriginal Australian artists, Vermouth, hats, flâneurs, Laura Dern, foaming body wash, stoicism, projectile vomiting, cannibal women, and socialism. Those last three — projectile vomiting, cannibal women, and socialism — have “had a moment” within the past 24 hours (at the time of writing), in an astounding moment trifecta. The Big Three, together at last."}, {"738d": "I’m joking, the “Big Three” are projectile vomiting, cannibal women, and anarcho-capitalism. But how did “X is having a moment” become commonplace? Why is this one cliché considered so versatile?"}, {"741f": "“In cultural criticism, it is often no longer enough to simply analyze a book or a film or a song. We have to justify our interest by declaring that the product in question is having a moment,” Sam Anderson wrote in a 2015 New York Times Magazine piece exploring how the concept of “a moment” became so prevalent in the media. Anderson sees a moment as the “atomic unit of narrative,” a way to assign urgency to whatever is gaining cultural currency. It’s a lovely sounding phrase, but far too flattering. It should be enough to simply analyze something rather than imposing a meaningless trend designator on it."}, {"d4d0": "“Having a moment” is a shortcut to shallow discussion, to labeling without analyzing. It’s a sweeping diagnosis with little interest in symptoms. The phrase reminds me of the phrase “Peak X,” in that they are both overused, slangy ways to convey that something is having an ephemeral crest in relevancy. But “having a moment” is an even more insidious mash-up of the media’s worst impulses. At least “Peak X” suggests that something has reached the apex of its fashionability. It’s marginally more specific. “Having a moment” suggests that something is generally trendy. It’s a filler idiom most likely to indicate that the trend piece you’re about to read has no clear angle beyond “Look, look, this thing exists now.”"}, {"91ce": "Good trend pieces are hard to pull off; they argue that something little means something big, which is why most of them are ridiculous. They aim for breezy but mostly look full of hot air. Patterns and surges in popularity are not necessarily emblematic of a larger cultural condition. On the rare occasions when a fad does speak to a broader issue, exploring the connection between the thing and the idea takes skill and thought and time. “Having a moment” elides the importance of making those connections and shoves the trend in our faces as worthy of our attention just because it exists. It does the improbable by making trend pieces even sillier."}, {"b338": "“Fake news is having a bit of a moment,” a recent Merriam-Webster dictionary blog post begins. (I screamed.) In a frustrating twist, the piece argues the opposite of its opener and notes “fake news” has been in use since the 19th century, and is “having a moment” only in the sense that the English language has been around for many centuries and the phrase has been around for less than 200 years. It’s a good debunker of a bad buzzword — that rare thing, a good trend piece — wrapped unnecessarily in another loathsome catchphrase. Is there anything worse? Not at the moment."}], "content": "Lexicon Watch “Having a Moment” Has Had Its Moment How did this meaningless phrase turn into a headline cliché? The following people, places, concepts, and political and philosophical ideologies are “having a moment” this March, according to various media outlets: drag shows, meatloaf, versatile citrus fruits, the city of Newark, gingham, Aboriginal Australian artists, Vermouth, hats, flâneurs, Laura Dern, foaming body wash, stoicism, projectile vomiting, cannibal women, and socialism. Those last three — projectile vomiting, cannibal women, and socialism — have “had a moment” within the past 24 hours (at the time of writing), in an astounding moment trifecta. The Big Three, together at last. I’m joking, the “Big Three” are projectile vomiting, cannibal women, and anarcho-capitalism. But how did “X is having a moment” become commonplace? Why is this one cliché considered so versatile? “In cultural criticism, it is often no longer enough to simply analyze a book or a film or a song. We have to justify our interest by declaring that the product in question is having a moment,” Sam Anderson wrote in a 2015 New York Times Magazine piece exploring how the concept of “a moment” became so prevalent in the media. Anderson sees a moment as the “atomic unit of narrative,” a way to assign urgency to whatever is gaining cultural currency. It’s a lovely sounding phrase, but far too flattering. It should be enough to simply analyze something rather than imposing a meaningless trend designator on it. “Having a moment” is a shortcut to shallow discussion, to labeling without analyzing. It’s a sweeping diagnosis with little interest in symptoms. The phrase reminds me of the phrase “Peak X,” in that they are both overused, slangy ways to convey that something is having an ephemeral crest in relevancy. But “having a moment” is an even more insidious mash-up of the media’s worst impulses. At least “Peak X” suggests that something has reached the apex of its fashionability. It’s marginally more specific. “Having a moment” suggests that something is generally trendy. It’s a filler idiom most likely to indicate that the trend piece you’re about to read has no clear angle beyond “Look, look, this thing exists now.” Good trend pieces are hard to pull off; they argue that something little means something big, which is why most of them are ridiculous. They aim for breezy but mostly look full of hot air. Patterns and surges in popularity are not necessarily emblematic of a larger cultural condition. On the rare occasions when a fad does speak to a broader issue, exploring the connection between the thing and the idea takes skill and thought and time. “Having a moment” elides the importance of making those connections and shoves the trend in our faces as worthy of our attention just because it exists. It does the improbable by making trend pieces even sillier. “Fake news is having a bit of a moment,” a recent Merriam-Webster dictionary blog post begins. (I screamed.) In a frustrating twist, the piece argues the opposite of its opener and notes “fake news” has been in use since the 19th century, and is “having a moment” only in the sense that the English language has been around for many centuries and the phrase has been around for less than 200 years. It’s a good debunker of a bad buzzword — that rare thing, a good trend piece — wrapped unnecessarily in another loathsome catchphrase. Is there anything worse? Not at the moment. ", "name": "262", "child": "262_1\t262_2\t262_3\t262_4", "timestamp": "Mar 29"}