{"parent": "", "title": "The End of “Stick to Sports”", "author": "Bryan Curtis", "sentences": [{"4cf8": "The End of “Stick to Sports”"}, {"02ac": "Sportswriters have been awakened by Donald Trump’s presidency. Is that what their readers want?"}, {"7544": "Did you read sports Twitter over the weekend? Notice how your favorite sportswriters were blasting Donald Trump’s executive order on immigration like the protesters at JFK’s Terminal 4? As Trump goes, such resistance is becoming typical. For sportswriters, it could be a watershed. If there was a thin line between sportswriting and political advocacy, this weekend erased it forever. The era of “stick to sports” is over."}, {"4c32": "These days, when a Republican politician does something obnoxious or destructive, we expect them to be met by an advance guard of sportswriters like Craig Calcaterra, Dave Zirin, David Roth, and somebody from Deadspin. You know, the enforcer types."}, {"b95e": "But gaze at this (partial) list of writers and personalities who stuck pins into Trump over the weekend: Zach Lowe, Tim Kawakami, Pete Abraham, Charlotte Wilder, Greg Bedard, Pablo Torre, Howard Beck, Sarah Spain, Molly Knight, Stewart Mandel, Jemele Hill, Spencer Hall, Timothy Burke, Joe Vardon, and the proprietors of the MGoBlog. They cover different beats, have different corporate parents, live in different parts of the country, and come from different generations. None of them “stuck to sports.” When Bomani Jones begins to blend into the crowd, something about sportswriting has changed, and we have entered virgin territory."}, {"d258": "On the one hand, what’s happening to sportswriters is that Trump is radicalizing them at the same rate he’s radicalizing everyone else. A moral crisis means Super Bowl predictions will have to wait. In October, Seth Davis — son of Clinton consigliere Lanny Davis — wrote on Facebook that he was no longer sticking to sports. “When I realized I was restraining myself for fear of losing Twitter followers, I felt like a hypocrite,” he said. Plenty of people have joined Davis in the breach, though he’s the only one I’ve seen using the hashtag #teamcivility."}, {"8375": "Another factor is that Trump’s Tony Montana approach to the issues means he’s bound to touch sports frequently. Last week, Trump compared the ovation he got at CIA headquarters to the one Peyton Manning got for winning the Super Bowl. In a meeting with congressional leaders, Trump justified his obsession with “voter fraud” by telling a story (later revealed to be third-hand) that came from German golfer Bernhard Langer."}, {"df37": "But the end of “stick to sports” owes as much to structural changes within sportswriting as it does to Trump himself. After all, when newspapers ruled the world, there was a rich tradition of politically interested writers that stretched from Westbrook Pegler to Robert Lipsyte."}, {"e812": "But newspaper staffs are hierarchical. Only three or four columnists are allowed to opine about sports, much less the rest of the world. The internet has made everybody into a de facto columnist. There’s no long apprenticeship before you get a column; at casually edited content farms, hot-taking is the first thing you get to do. (Later, after a few hundred reps, you learn to be a respectable old bore.)"}, {"4e96": "In the newspaper era, even the most woke sports columnist tended to deal with politics only when it entered his or her domain. The columnist wrote about labor law when there was a baseball strike; amateurism when the NCAA and the Olympics had their regularly-scheduled crises; race relations when Tommie Smith and John Carlos stuck their fists in the air."}, {"65cd": "Another thing the internet did to sportswriting was to make it, once and for all, part of a single, large American subject. Over at The Ringer, you can find a writer like Ben Lindbergh gliding from baseball to Trump to Rogue One. The looseness of the medium allows MMQB’s Peter King to casually reveal he voted for Hillary Clinton in November. Twitter provides a forum to Seth Davis he’d never have on CBS’s college basketball desk. It’s no longer a surprise when you know a sportswriter’s politics. It’s a surprise when you don’t."}, {"6771": "A sportswriter doesn’t have to “stick to sports” if the athletes don’t. One of the most remarkable parts of Muhammad Ali’s legacy was the way he persuaded writers to follow him like ring handlers as he swaggered through the ’60s. Similarly, when Warriors coach Steve Kerr calls Trump’s Muslim ban a “horrible idea,” as he did on Sunday, the sportswriter becomes both a chronicler and a political animal simultaneously — I’m just telling you what Coach said!"}, {"0625": "The end of “stick to sports” is a pleasure for writers who can flex their muscles in a way their elders never could. The thing is, I see evidence that some readers don’t want their favorite Twitter feeds to become free-fire zones for politics. Over the weekend, when Lowe, Bedard, and Around the Horn’s Kevin Blackistone strayed from their beats, they were all commanded to “stick to sports.”"}, {"a0de": "Similarly, the writers’ corporate parents would rather they point their hot takes toward something other than Trump. Recently, one sports TV executive told me his favorite kind of partisan dispute was one personality rooting for the Patriots to win and another rooting for them to lose — a clash that mimicked the theater of cable news but had none of its baggage. Last January, ESPN sent a memo to employees telling them to “refrain from political editorializing … on platforms such as Twitter or other social media.”"}, {"9773": "This brings us to the final way the internet has changed sportswriting. Vowing to unfollow a writer after every Trump tweet has become a persistent response. But no matter how many readers the politically minded sportswriter turns off, it’s easier than ever to find new eyeballs. There is 53.9 percent of the non-Trump voting populace from which to draw an audience. So even if Trump builds a big, beautiful wall around America, he faces a new annoyance: The wall that once encircled sportswriting has been reduced to rubble."}], "content": "The End of “Stick to Sports” Sportswriters have been awakened by Donald Trump’s presidency. Is that what their readers want? Did you read sports Twitter over the weekend? Notice how your favorite sportswriters were blasting Donald Trump’s executive order on immigration like the protesters at JFK’s Terminal 4? As Trump goes, such resistance is becoming typical. For sportswriters, it could be a watershed. If there was a thin line between sportswriting and political advocacy, this weekend erased it forever. The era of “stick to sports” is over. These days, when a Republican politician does something obnoxious or destructive, we expect them to be met by an advance guard of sportswriters like Craig Calcaterra, Dave Zirin, David Roth, and somebody from Deadspin. You know, the enforcer types. But gaze at this (partial) list of writers and personalities who stuck pins into Trump over the weekend: Zach Lowe, Tim Kawakami, Pete Abraham, Charlotte Wilder, Greg Bedard, Pablo Torre, Howard Beck, Sarah Spain, Molly Knight, Stewart Mandel, Jemele Hill, Spencer Hall, Timothy Burke, Joe Vardon, and the proprietors of the MGoBlog. They cover different beats, have different corporate parents, live in different parts of the country, and come from different generations. None of them “stuck to sports.” When Bomani Jones begins to blend into the crowd, something about sportswriting has changed, and we have entered virgin territory. On the one hand, what’s happening to sportswriters is that Trump is radicalizing them at the same rate he’s radicalizing everyone else. A moral crisis means Super Bowl predictions will have to wait. In October, Seth Davis — son of Clinton consigliere Lanny Davis — wrote on Facebook that he was no longer sticking to sports. “When I realized I was restraining myself for fear of losing Twitter followers, I felt like a hypocrite,” he said. Plenty of people have joined Davis in the breach, though he’s the only one I’ve seen using the hashtag #teamcivility. Another factor is that Trump’s Tony Montana approach to the issues means he’s bound to touch sports frequently. Last week, Trump compared the ovation he got at CIA headquarters to the one Peyton Manning got for winning the Super Bowl. In a meeting with congressional leaders, Trump justified his obsession with “voter fraud” by telling a story (later revealed to be third-hand) that came from German golfer Bernhard Langer. But the end of “stick to sports” owes as much to structural changes within sportswriting as it does to Trump himself. After all, when newspapers ruled the world, there was a rich tradition of politically interested writers that stretched from Westbrook Pegler to Robert Lipsyte. But newspaper staffs are hierarchical. Only three or four columnists are allowed to opine about sports, much less the rest of the world. The internet has made everybody into a de facto columnist. There’s no long apprenticeship before you get a column; at casually edited content farms, hot-taking is the first thing you get to do. (Later, after a few hundred reps, you learn to be a respectable old bore.) In the newspaper era, even the most woke sports columnist tended to deal with politics only when it entered his or her domain. The columnist wrote about labor law when there was a baseball strike; amateurism when the NCAA and the Olympics had their regularly-scheduled crises; race relations when Tommie Smith and John Carlos stuck their fists in the air. Another thing the internet did to sportswriting was to make it, once and for all, part of a single, large American subject. Over at The Ringer, you can find a writer like Ben Lindbergh gliding from baseball to Trump to Rogue One. The looseness of the medium allows MMQB’s Peter King to casually reveal he voted for Hillary Clinton in November. Twitter provides a forum to Seth Davis he’d never have on CBS’s college basketball desk. It’s no longer a surprise when you know a sportswriter’s politics. It’s a surprise when you don’t. A sportswriter doesn’t have to “stick to sports” if the athletes don’t. One of the most remarkable parts of Muhammad Ali’s legacy was the way he persuaded writers to follow him like ring handlers as he swaggered through the ’60s. Similarly, when Warriors coach Steve Kerr calls Trump’s Muslim ban a “horrible idea,” as he did on Sunday, the sportswriter becomes both a chronicler and a political animal simultaneously — I’m just telling you what Coach said! The end of “stick to sports” is a pleasure for writers who can flex their muscles in a way their elders never could. The thing is, I see evidence that some readers don’t want their favorite Twitter feeds to become free-fire zones for politics. Over the weekend, when Lowe, Bedard, and Around the Horn’s Kevin Blackistone strayed from their beats, they were all commanded to “stick to sports.” Similarly, the writers’ corporate parents would rather they point their hot takes toward something other than Trump. Recently, one sports TV executive told me his favorite kind of partisan dispute was one personality rooting for the Patriots to win and another rooting for them to lose — a clash that mimicked the theater of cable news but had none of its baggage. Last January, ESPN sent a memo to employees telling them to “refrain from political editorializing … on platforms such as Twitter or other social media.” This brings us to the final way the internet has changed sportswriting. Vowing to unfollow a writer after every Trump tweet has become a persistent response. But no matter how many readers the politically minded sportswriter turns off, it’s easier than ever to find new eyeballs. There is 53.9 percent of the non-Trump voting populace from which to draw an audience. So even if Trump builds a big, beautiful wall around America, he faces a new annoyance: The wall that once encircled sportswriting has been reduced to rubble. ", "name": "266", "child": "266_1\t266_2\t266_3\t266_4\t266_5\t266_6\t266_7\t266_8\t266_9\t266_10\t266_11\t266_12\t266_13\t266_14\t266_15\t266_16\t266_17\t266_18\t266_19\t266_20\t266_21\t266_22\t266_23\t266_24\t266_25", "timestamp": "Jan 30"}