{"parent": "", "title": "What Went Viral in 2016 — and Where Is It Now?", "author": "Alyssa Bereznak", "sentences": [{"871d": "What Went Viral in 2016 — and Where Is It Now?"}, {"731e": "The internet moves quickly, so let’s remember the memes, people, and narratives that momentarily captured our attention this year"}, {"f14d": "The internet moves quickly. For most of us, the web’s ant-size attention span makes for a fever dream of headlines each year. And as dazed as we might be by the ravenous online news cycle, it’s nothing compared to whatever happens to the actual people, things, and institutions that made the marquee for each year’s most viral narratives. What transformation does an app, a symbol, or a person undergo after the obligatory New York Times write-up and Ellen cameo? Join me in my brief, and highly unscientific overview of the rise and fall of heroes, villains, toys, and teens of the web in 2016."}, {"c694": "Peach"}, {"a011": "The Rise: Mere days into 2016, the internet was hankering to channel its nervous energy to an unsuspecting entity. That entity ended up being Peach, a cutesy social app created by a cofounder of Vine. Much like Yo or Ello, the app’s popularity spiked because digital media types had nothing else to tweet about one afternoon. Within hours, its servers were overloaded. Within days, both MTV and Teen Vogue had launched accounts. Part of the app’s charm — aside from the fact that it had a gloriously nonsensical name — was a set of “magic words” that triggered hidden posting features. “Battery” allowed users to post their smartphone’s charge percentage, “GIF” let them attach a GIF, and so on. It felt a little like a scavenger hunt, until the hidden features ran out and everyone realized they were already fully committed to, like, six other social media platforms. Not all that long after the media had declared Peach a hot, new social media app, it was pronounced dead."}, {"2d2f": "The Fall: The Peach creators soldiered on, adding updates, releasing an Android version, and maintaining a relatively active Twitter presence. But without so much as a Medium post goodbye, they slowly faded from relevance. The company’s most recent Twitter activity was a retweet of a fluffy cat photo on April 7. Every single email address listed on their site no longer functions. O, how unceremonious these digital burials have become!"}, {"d800": "Damn Daniel"}, {"5cf9": "The Rise: The Damn Daniel phenomena started as an innocent social media bromance between Riverside, California, high schoolers Josh Holz and Daniel Lara. It began as a sixth-period ritual on their school’s pool deck: Holz would film a Snapchat video of the teen showing off his outfit while yelling “Damn, Daniel” in a weird, circus ringmaster falsetto, sometimes adding “back at it again with the white Vans!” for spice. Like many memes, it made very little sense, involved a cute kid, and had a convenient brand tie-in. The video went viral, and the great meme leaching began: Four Pins dreamed up a “Damn Daniel” starter pack, eBay sellers launched a series of deceiving auctions in which they pretended to sell Lara’s original white Vans, Clorox and Axe tweeted the equivalent of “We get it, too!” It all culminated in an appearance on Ellen, in which the budding SoCal bros told their tale of memedom and were, in turn, rewarded with a surfboard and a lifetime supply of Vans."}, {"1ea7": "The Fall: A month later, the Ellen show resurrected the duo, plopped them in a giant Vans shoe, and sent them to the red carpet of the MTV Movie Awards as unofficial Snapchat ambassadors to interview confused celebrities. They repeated the shtick at the Webby Awards. Though they both admit that “Damn Daniel” as a meme is over, they’re gunning to extend their fame for just a little bit longer. They have signed talent agency contracts and auditioned for Disney shows. There was an LG commercial somewhere in between there. It appears Lara is selling “Damn Santa” sweaters from *shudders* the link in his Instagram bio."}, {"833d": "Becky With the Good Hair"}, {"f842": "The Rise: The release of Beyoncé’s visual album was a memorable moment for most of the human population, but especially for a certain “Becky with the good hair,” who made a surprise lyrical cameo as Jay Z’s mistress in “Sorry.” Just as Beyoncé fans were sniffing for clues to Becky’s identity like ravenous sharks, Rachel Roy basically draped herself in bloody, raw meat and jumped in the water. “Good hair, don’t care,” the designer, who got her start at Rocawear, wrote in an ill-timed Instagram caption. Beyoncé’s fans flooded her Instagram comments with bee emoji, dragged her on Twitter, and — in a bout of passionate confusion — even began harassing TV chef Rachael Ray. Roy deleted the Instagram post in question, set her account to private, and tweeted something cryptic about bullying."}, {"6f69": "The Fall: Since she was relentlessly emoji-bombed, Roy has taken a notably removed approach to her social media, opting for inspirational quotes, photo shoots to advertise her latest clothing lines, and slinging artisanal items made by women in Swaziland. This June, she very notably ducked out of the CFDA fashion awards dinner before Beyoncé glided in to accept that year’s Icon award. She was never heard from again."}, {"e927": "Chewbacca Mom"}, {"12dc": "The Rise: Candace Payne is proof that the internet can’t resist pure, unadulterated joy. The 37-year-old mom from Texas used Facebook Live to stream herself laughing in a Chewbacca mask she bought at Kohl’s, and within a few days, an estimated 162 million people had tuned in to laugh along with her. Though it may have been a life-changing moment for Payne, it was also an undeniable victory for the brands that made the video possible. Kohl’s arrived at Payne’s door with a video crew, a $2,500 gift card, and loads of other Star Wars swag in what became an instant online commercial. Facebook invited her to its Menlo Park, California, campus to flaunt the power of its new, heavily-promoted feature. J.J. Abrams even popped in to thank her for the free Star Wars promotion on The Late Late Show With James Corden."}, {"1f9d": "The Fall: Things started going south for Payne a few months later, around the time that she posted a cover of Michael Jackson’s “Heal the World” in response to the Dallas police officer shootings. She was promptly scolded for veering too far out of her internet celebrity lane. “Chewbacca mom is not the moral compass of this country. She’s a woman who bought a mask and did stuff in it,” YouTube star Akilah Hughes tweeted at the time. But she has remained vigilant in her quest for long-term fame. Since then, Payne has gotten Lasik eye surgery, highlights, a full-time publicist, and a forearm tattoo of a cartoon Chewbacca that she designed herself. She was recently the guest of honor at Facebook’s New York holiday party. And it was announced last week that will be hosting not one, but two online shows for TLC starting this month. The meme plays on."}, {"c6a4": "‘Pokémon Go’"}, {"d594": "The Rise: The hysteria around Pokémon Go began almost immediately after the app was released in July, and it became clear people were going to get very hurt playing it. Not only was it a relatively novel way to implement augmented reality into a mobile video game, it was also heralded as a helpful way to burn some calories. The various screenshots of the monsters parading around people’s real lives — whether it was on the front lines or in the bedroom — encouraged chatter about the game on social media, and pushed it become the biggest mobile game in history. For a brief time, it appeared to be more popular than Tinder, which is basically an app for sex."}, {"719e": "The Fall: Just a month later, the game began shedding people who were bored by the daily slog of catching Pidgey after Pidgey — what ended up being around 20 million users. The app was still making tons of money, but it lost some of its universal everyman sheen in the dip. More recently, the game added new monsters and daily bonuses to pique interest. It also partnered with Starbucks — another company that specializes in corporate ubiquity — to turn all of its locations into Pokéstops and offer Pokémon Go Frappucinos. I haven’t tried one yet but I hear it tastes like corporate greed."}, {"35eb": "Ken Bone"}, {"154e": "The Rise: One of 2016’s greatest mysteries is why Ken Bone became so famous. Was it his mustache? His silly last name? His Izod sweater-and-khakis combo? The fact that he was a mild distraction from what had become an election full of divisive political rhetoric? Only BuzzFeed’s “social lift” witches really know. But after Ken Bone asked a question at a presidential debate, he began trending on Twitter and Facebook. He appeared on Jimmy Kimmel Live!, and a “Sexy Undecided Voter Costume” in his likeness popped up online. He turned down an offer to do porn but not one to appear in Uber ads."}, {"8d8f": "The Fall: The appeal of Ken Bone is like the appeal of one of those Big Mouth Billy Bass singing fish. Maybe you first bought into the concept because it was mildly amusing, and a nice distraction from what would otherwise be horrifying conversations at your family dinner table. But eventually it begins to get on your nerves, butting in with cheesy remarks at delicate moments, and you want to get rid of it. Where the two diverge is that one has an embarrassing Reddit comment history that included describing pregnant women as “beautiful human submarines,” and the other does not (because it’s an inanimate object). Nevertheless, that whole fiasco didn’t stop him from re-emerging in the form of sponsored content to answer questions like “Reply? Or reply all?” during BuzzFeed’s live election-night show."}, {"c3fb": "Billy Bush"}, {"0d56": "The Rise: Before this election cycle, Billy Bush was not necessarily a household name. He is related to the Bush family and also hosted a variety of nationally syndicated celebrity news shows. But his big break (in contract with NBC) came when an Access Hollywood clip of him and Donald Trump leaked online. Trump brags about grabbing women “by the pussy” and Bush laughs along. The tape was deemed incredibly offensive by basically everyone in the world, and Bush — despite being more famous than he had ever been — lost his job for egging on Trump."}, {"b71f": "The Fall: Billy Bush was last seen at SoulCycle in Georgetown. Donald Trump is our next president."}, {"2a36": "“The Alt-Right,” aka Nazism"}, {"4975": "The Rise: Twelve days after Donald Trump announced his intention to run for president, Andrew Anglin logged onto his neo-Nazi site, Daily Stormer, and wrote: “I urge all readers of this site to do whatever they can to make Donald Trump President.” His message was just the beginning of the horrifying reawakening of anti-semitic groups in America that popped up under all kinds of rebranded Nazi names like “white nationalism” or the “alt-right.” Pepe, once just a lovable frog meme found on message boards like Reddit, began appearing with Hitler staches and swastikas. In November, a full room of people mimicked Hitler’s infamous salute and yelled “Hail Trump!”"}, {"c26e": "The Fall: Well, uh. About that! Trump selected Steve Bannon — a man that the literal chairman of the American Nazi Party has praised — to be one of his closest advisers. The fall has yet to come. Yay 2017?"}], "content": "What Went Viral in 2016 — and Where Is It Now? The internet moves quickly, so let’s remember the memes, people, and narratives that momentarily captured our attention this year The internet moves quickly. For most of us, the web’s ant-size attention span makes for a fever dream of headlines each year. And as dazed as we might be by the ravenous online news cycle, it’s nothing compared to whatever happens to the actual people, things, and institutions that made the marquee for each year’s most viral narratives. What transformation does an app, a symbol, or a person undergo after the obligatory New York Times write-up and Ellen cameo? Join me in my brief, and highly unscientific overview of the rise and fall of heroes, villains, toys, and teens of the web in 2016. Peach The Rise: Mere days into 2016, the internet was hankering to channel its nervous energy to an unsuspecting entity. That entity ended up being Peach, a cutesy social app created by a cofounder of Vine. Much like Yo or Ello, the app’s popularity spiked because digital media types had nothing else to tweet about one afternoon. Within hours, its servers were overloaded. Within days, both MTV and Teen Vogue had launched accounts. Part of the app’s charm — aside from the fact that it had a gloriously nonsensical name — was a set of “magic words” that triggered hidden posting features. “Battery” allowed users to post their smartphone’s charge percentage, “GIF” let them attach a GIF, and so on. It felt a little like a scavenger hunt, until the hidden features ran out and everyone realized they were already fully committed to, like, six other social media platforms. Not all that long after the media had declared Peach a hot, new social media app, it was pronounced dead. The Fall: The Peach creators soldiered on, adding updates, releasing an Android version, and maintaining a relatively active Twitter presence. But without so much as a Medium post goodbye, they slowly faded from relevance. The company’s most recent Twitter activity was a retweet of a fluffy cat photo on April 7. Every single email address listed on their site no longer functions. O, how unceremonious these digital burials have become! Damn Daniel The Rise: The Damn Daniel phenomena started as an innocent social media bromance between Riverside, California, high schoolers Josh Holz and Daniel Lara. It began as a sixth-period ritual on their school’s pool deck: Holz would film a Snapchat video of the teen showing off his outfit while yelling “Damn, Daniel” in a weird, circus ringmaster falsetto, sometimes adding “back at it again with the white Vans!” for spice. Like many memes, it made very little sense, involved a cute kid, and had a convenient brand tie-in. The video went viral, and the great meme leaching began: Four Pins dreamed up a “Damn Daniel” starter pack, eBay sellers launched a series of deceiving auctions in which they pretended to sell Lara’s original white Vans, Clorox and Axe tweeted the equivalent of “We get it, too!” It all culminated in an appearance on Ellen, in which the budding SoCal bros told their tale of memedom and were, in turn, rewarded with a surfboard and a lifetime supply of Vans. The Fall: A month later, the Ellen show resurrected the duo, plopped them in a giant Vans shoe, and sent them to the red carpet of the MTV Movie Awards as unofficial Snapchat ambassadors to interview confused celebrities. They repeated the shtick at the Webby Awards. Though they both admit that “Damn Daniel” as a meme is over, they’re gunning to extend their fame for just a little bit longer. They have signed talent agency contracts and auditioned for Disney shows. There was an LG commercial somewhere in between there. It appears Lara is selling “Damn Santa” sweaters from *shudders* the link in his Instagram bio. Becky With the Good Hair The Rise: The release of Beyoncé’s visual album was a memorable moment for most of the human population, but especially for a certain “Becky with the good hair,” who made a surprise lyrical cameo as Jay Z’s mistress in “Sorry.” Just as Beyoncé fans were sniffing for clues to Becky’s identity like ravenous sharks, Rachel Roy basically draped herself in bloody, raw meat and jumped in the water. “Good hair, don’t care,” the designer, who got her start at Rocawear, wrote in an ill-timed Instagram caption. Beyoncé’s fans flooded her Instagram comments with bee emoji, dragged her on Twitter, and — in a bout of passionate confusion — even began harassing TV chef Rachael Ray. Roy deleted the Instagram post in question, set her account to private, and tweeted something cryptic about bullying. The Fall: Since she was relentlessly emoji-bombed, Roy has taken a notably removed approach to her social media, opting for inspirational quotes, photo shoots to advertise her latest clothing lines, and slinging artisanal items made by women in Swaziland. This June, she very notably ducked out of the CFDA fashion awards dinner before Beyoncé glided in to accept that year’s Icon award. She was never heard from again. Chewbacca Mom The Rise: Candace Payne is proof that the internet can’t resist pure, unadulterated joy. The 37-year-old mom from Texas used Facebook Live to stream herself laughing in a Chewbacca mask she bought at Kohl’s, and within a few days, an estimated 162 million people had tuned in to laugh along with her. Though it may have been a life-changing moment for Payne, it was also an undeniable victory for the brands that made the video possible. Kohl’s arrived at Payne’s door with a video crew, a $2,500 gift card, and loads of other Star Wars swag in what became an instant online commercial. Facebook invited her to its Menlo Park, California, campus to flaunt the power of its new, heavily-promoted feature. J.J. Abrams even popped in to thank her for the free Star Wars promotion on The Late Late Show With James Corden. The Fall: Things started going south for Payne a few months later, around the time that she posted a cover of Michael Jackson’s “Heal the World” in response to the Dallas police officer shootings. She was promptly scolded for veering too far out of her internet celebrity lane. “Chewbacca mom is not the moral compass of this country. She’s a woman who bought a mask and did stuff in it,” YouTube star Akilah Hughes tweeted at the time. But she has remained vigilant in her quest for long-term fame. Since then, Payne has gotten Lasik eye surgery, highlights, a full-time publicist, and a forearm tattoo of a cartoon Chewbacca that she designed herself. She was recently the guest of honor at Facebook’s New York holiday party. And it was announced last week that will be hosting not one, but two online shows for TLC starting this month. The meme plays on. ‘Pokémon Go’ The Rise: The hysteria around Pokémon Go began almost immediately after the app was released in July, and it became clear people were going to get very hurt playing it. Not only was it a relatively novel way to implement augmented reality into a mobile video game, it was also heralded as a helpful way to burn some calories. The various screenshots of the monsters parading around people’s real lives — whether it was on the front lines or in the bedroom — encouraged chatter about the game on social media, and pushed it become the biggest mobile game in history. For a brief time, it appeared to be more popular than Tinder, which is basically an app for sex. The Fall: Just a month later, the game began shedding people who were bored by the daily slog of catching Pidgey after Pidgey — what ended up being around 20 million users. The app was still making tons of money, but it lost some of its universal everyman sheen in the dip. More recently, the game added new monsters and daily bonuses to pique interest. It also partnered with Starbucks — another company that specializes in corporate ubiquity — to turn all of its locations into Pokéstops and offer Pokémon Go Frappucinos. I haven’t tried one yet but I hear it tastes like corporate greed. Ken Bone The Rise: One of 2016’s greatest mysteries is why Ken Bone became so famous. Was it his mustache? His silly last name? His Izod sweater-and-khakis combo? The fact that he was a mild distraction from what had become an election full of divisive political rhetoric? Only BuzzFeed’s “social lift” witches really know. But after Ken Bone asked a question at a presidential debate, he began trending on Twitter and Facebook. He appeared on Jimmy Kimmel Live!, and a “Sexy Undecided Voter Costume” in his likeness popped up online. He turned down an offer to do porn but not one to appear in Uber ads. The Fall: The appeal of Ken Bone is like the appeal of one of those Big Mouth Billy Bass singing fish. Maybe you first bought into the concept because it was mildly amusing, and a nice distraction from what would otherwise be horrifying conversations at your family dinner table. But eventually it begins to get on your nerves, butting in with cheesy remarks at delicate moments, and you want to get rid of it. Where the two diverge is that one has an embarrassing Reddit comment history that included describing pregnant women as “beautiful human submarines,” and the other does not (because it’s an inanimate object). Nevertheless, that whole fiasco didn’t stop him from re-emerging in the form of sponsored content to answer questions like “Reply? Or reply all?” during BuzzFeed’s live election-night show. Billy Bush The Rise: Before this election cycle, Billy Bush was not necessarily a household name. He is related to the Bush family and also hosted a variety of nationally syndicated celebrity news shows. But his big break (in contract with NBC) came when an Access Hollywood clip of him and Donald Trump leaked online. Trump brags about grabbing women “by the pussy” and Bush laughs along. The tape was deemed incredibly offensive by basically everyone in the world, and Bush — despite being more famous than he had ever been — lost his job for egging on Trump. The Fall: Billy Bush was last seen at SoulCycle in Georgetown. Donald Trump is our next president. “The Alt-Right,” aka Nazism The Rise: Twelve days after Donald Trump announced his intention to run for president, Andrew Anglin logged onto his neo-Nazi site, Daily Stormer, and wrote: “I urge all readers of this site to do whatever they can to make Donald Trump President.” His message was just the beginning of the horrifying reawakening of anti-semitic groups in America that popped up under all kinds of rebranded Nazi names like “white nationalism” or the “alt-right.” Pepe, once just a lovable frog meme found on message boards like Reddit, began appearing with Hitler staches and swastikas. In November, a full room of people mimicked Hitler’s infamous salute and yelled “Hail Trump!” The Fall: Well, uh. About that! Trump selected Steve Bannon — a man that the literal chairman of the American Nazi Party has praised — to be one of his closest advisers. The fall has yet to come. Yay 2017? ", "name": "268", "child": "268_1\t268_2\t268_3\t268_4", "timestamp": "Dec 26, 2016"}