{"parent": "", "title": "After hyping itself as antidote to fake news, New York Times hires extreme climate denier", "author": "Joe Romm", "sentences": [{"a909": "After hyping itself as antidote to fake news, New York Times hires extreme climate denier"}, {"3b7a": "New columnist Bret Stephens dismisses as “imaginary” the climate reality routinely reported by the Times. They can’t both be right."}, {"972b": "The New York Times — which advertises itself as a defender of truth in the Trump era — just hired an extreme denier of climate science as a columnist."}, {"dd99": "Bret Stephens was most recently deputy editorial page editor for Rupert Murdoch’s deeply conservative and climate-denying Wall Street Journal, where, in 2015, he wrote that climate change — along with hunger in America, campus rape statistics, and institutionalized racism— are “imaginary enemies.” He will now take those views to the New York Times."}, {"9103": "Stephens is unusually extreme and divisive even for a climate science denier, also comparing scientists and those who accept their findings to Stalinists, anti-semites, and communists."}, {"d13a": "Climate scientists around the world debunk Wall Street Journal “Stalinist” screedthinkprogress.org"}, {"1b15": "The scientific findings that Stephens has repeatedly dismissed as “imaginary” are routinely published in the New York Times itself. And in an August job description, the New York Times called climate change “the most important story in the world.” Stephens calls it “hysteria.”"}, {"1989": "This hiring is “a very sad comment on the New York Times’ judgment,” Dr. Robert J. Brulle, a media expert at Drexel University, told ThinkProgress via email. Brulle, whom the Times itself has called “an expert on environmental communications,” said this hiring “contradicts their claim” in a new ad campaign that truth is “now more important than ever” to the Times."}, {"50f9": "In a fawning press release, the Times calls Stephens “a beautiful writer” who brings to the paper, “profound intellectual depth, honesty and bravery.”"}, {"b37e": "Judge for yourself:"}, {"28fa": "Stephens’ July 2008 column, titled, “Global Warming as Mass Neurosis,” begins, “last week marked the 20th anniversary of the mass hysteria phenomenon known as global warming. Much of the science has since been discredited.”"}, {"ef6e": "His December 2009 column, examining the motivations of those who accept the overwhelming consensus on climate change, says, “one of those [motivations], I suspect, is what I would call the totalitarian impulse. This is not to say that global warming true believers are closet Stalinists. But their intellectual methods are instructively similar.” He then goes on to compare climate scientists and those who accept their finding to anti-Semites and Communists."}, {"28fc": "The Wall Street Journal publishes long-debunked myths to promote climate inaction thinkprogress.org"}, {"fca4": "Stephens has not softened his anti-science views even as the evidence and analysis showing human-caused climate change has gotten stronger. In fact, it is quite the reverse."}, {"6415": "His November 2015 column, “Liberalism’s Imaginary Enemies,” previewing the Paris climate talks, calls concern over climate change “hysteria” and compares global warming to hunger in America, institutionalized racism, and campus rape statistics — all things he says are “imaginary enemies.”"}, {"9593": "Anyone who thinks Stephens has any qualifications whatsoever to be a New York Times columnist should read the full article. And this offensive balderdash is from a person the Times is now bragging has “profound intellectual depth, honesty and bravery.”"}, {"358b": "On climate change, he writes:"}, {"dcea": "The hysteria generated by an imperceptible temperature rise of 1.7 degrees Fahrenheit since 1880 — as if the trend is bound to continue forever, or is not a product of natural variation, or cannot be mitigated except by drastic policy interventions. The hyping of flimsy studies — melting Himalayan glaciers; vanishing polar ice — to press the political point…."}, {"acc4": "Here’s a climate prediction for the year 2115: Liberals will still be organizing campaigns against yet another mooted social or environmental crisis. Temperatures will be about the same."}, {"0b98": "To assert there will be no temperature rise over the next hundred years and that climate change is imaginary is to go further than the overwhelming majority of professional climate science deniers. This is Breitbart- or Putin-level fake news."}, {"d399": "What flimsy studies of vanishing polar ice could he possibly be talking about? We have direct observations from multiple sources — satellites, airplanes, direct human measurements — that show both polar sea ice and the land-based ice are disappearing at record rates."}, {"3ace": "Rapid warming and disintegrating polar ice set the stage for ‘societal collapse’Carbon pollution is destabilizing both the Arctic and Antarctic.thinkprogress.org"}, {"a79e": "The Times itself routinely reports on vanishing polar ice and other catastrophic impacts we are facing."}, {"4aca": "In a May 2014 story on new studies suggesting warming-driven collapse of the West Antarctic ice sheet, the Times concluded, “the heat-trapping gases could destabilize other parts of Antarctica as well as the Greenland ice sheet, potentially causing enough sea-level rise that many of the world’s coastal cities would eventually have to be abandoned.”"}, {"70fb": "Do the editors of the New York Times now consider this major front-page story to be “hysteria generated by an imperceptible temperature rise of 1.7 degrees Fahrenheit since 1880?” What about the December front-page story in which the Times warned that the “perils of climate change could swamp coastal real estate?”"}, {"4b22": "By hiring Bret Stephens, the Times is making a mockery of its new ad campaign on the importance of truth — and it is impugning the reporting of its own professional journalists."}, {"cc1e": "Climatologist Michael Mann warned in a 2014 Times op-ed that “a fringe minority of our populace clings to an irrational rejection of well-established science [which also] infects the halls of Congress, the pages of leading newspapers and what we see on TV.”"}, {"d96e": "On Thursday, Mann told ThinkProgress via email, “sadly, the New York Times itself seems to have fallen victim to this malady, hiring one of the most notorious climate change deniers, Bret Stephens, to promote climate denial propaganda on the once-hallowed pages of the Grey Lady.”"}, {"4a5d": "Brulle said “the New York Times should rescind his hiring.”"}, {"76e7": "If not, what exactly do they stand for and why should anyone read them?"}], "content": "After hyping itself as antidote to fake news, New York Times hires extreme climate denier New columnist Bret Stephens dismisses as “imaginary” the climate reality routinely reported by the Times. They can’t both be right. The New York Times — which advertises itself as a defender of truth in the Trump era — just hired an extreme denier of climate science as a columnist. Bret Stephens was most recently deputy editorial page editor for Rupert Murdoch’s deeply conservative and climate-denying Wall Street Journal, where, in 2015, he wrote that climate change — along with hunger in America, campus rape statistics, and institutionalized racism— are “imaginary enemies.” He will now take those views to the New York Times. Stephens is unusually extreme and divisive even for a climate science denier, also comparing scientists and those who accept their findings to Stalinists, anti-semites, and communists. Climate scientists around the world debunk Wall Street Journal “Stalinist” screedthinkprogress.org The scientific findings that Stephens has repeatedly dismissed as “imaginary” are routinely published in the New York Times itself. And in an August job description, the New York Times called climate change “the most important story in the world.” Stephens calls it “hysteria.” This hiring is “a very sad comment on the New York Times’ judgment,” Dr. Robert J. Brulle, a media expert at Drexel University, told ThinkProgress via email. Brulle, whom the Times itself has called “an expert on environmental communications,” said this hiring “contradicts their claim” in a new ad campaign that truth is “now more important than ever” to the Times. In a fawning press release, the Times calls Stephens “a beautiful writer” who brings to the paper, “profound intellectual depth, honesty and bravery.” Judge for yourself: Stephens’ July 2008 column, titled, “Global Warming as Mass Neurosis,” begins, “last week marked the 20th anniversary of the mass hysteria phenomenon known as global warming. Much of the science has since been discredited.” His December 2009 column, examining the motivations of those who accept the overwhelming consensus on climate change, says, “one of those [motivations], I suspect, is what I would call the totalitarian impulse. This is not to say that global warming true believers are closet Stalinists. But their intellectual methods are instructively similar.” He then goes on to compare climate scientists and those who accept their finding to anti-Semites and Communists. The Wall Street Journal publishes long-debunked myths to promote climate inaction thinkprogress.org Stephens has not softened his anti-science views even as the evidence and analysis showing human-caused climate change has gotten stronger. In fact, it is quite the reverse. His November 2015 column, “Liberalism’s Imaginary Enemies,” previewing the Paris climate talks, calls concern over climate change “hysteria” and compares global warming to hunger in America, institutionalized racism, and campus rape statistics — all things he says are “imaginary enemies.” Anyone who thinks Stephens has any qualifications whatsoever to be a New York Times columnist should read the full article. And this offensive balderdash is from a person the Times is now bragging has “profound intellectual depth, honesty and bravery.” On climate change, he writes: The hysteria generated by an imperceptible temperature rise of 1.7 degrees Fahrenheit since 1880 — as if the trend is bound to continue forever, or is not a product of natural variation, or cannot be mitigated except by drastic policy interventions. The hyping of flimsy studies — melting Himalayan glaciers; vanishing polar ice — to press the political point…. Here’s a climate prediction for the year 2115: Liberals will still be organizing campaigns against yet another mooted social or environmental crisis. Temperatures will be about the same. To assert there will be no temperature rise over the next hundred years and that climate change is imaginary is to go further than the overwhelming majority of professional climate science deniers. This is Breitbart- or Putin-level fake news. What flimsy studies of vanishing polar ice could he possibly be talking about? We have direct observations from multiple sources — satellites, airplanes, direct human measurements — that show both polar sea ice and the land-based ice are disappearing at record rates. Rapid warming and disintegrating polar ice set the stage for ‘societal collapse’Carbon pollution is destabilizing both the Arctic and Antarctic.thinkprogress.org The Times itself routinely reports on vanishing polar ice and other catastrophic impacts we are facing. In a May 2014 story on new studies suggesting warming-driven collapse of the West Antarctic ice sheet, the Times concluded, “the heat-trapping gases could destabilize other parts of Antarctica as well as the Greenland ice sheet, potentially causing enough sea-level rise that many of the world’s coastal cities would eventually have to be abandoned.” Do the editors of the New York Times now consider this major front-page story to be “hysteria generated by an imperceptible temperature rise of 1.7 degrees Fahrenheit since 1880?” What about the December front-page story in which the Times warned that the “perils of climate change could swamp coastal real estate?” By hiring Bret Stephens, the Times is making a mockery of its new ad campaign on the importance of truth — and it is impugning the reporting of its own professional journalists. Climatologist Michael Mann warned in a 2014 Times op-ed that “a fringe minority of our populace clings to an irrational rejection of well-established science [which also] infects the halls of Congress, the pages of leading newspapers and what we see on TV.” On Thursday, Mann told ThinkProgress via email, “sadly, the New York Times itself seems to have fallen victim to this malady, hiring one of the most notorious climate change deniers, Bret Stephens, to promote climate denial propaganda on the once-hallowed pages of the Grey Lady.” Brulle said “the New York Times should rescind his hiring.” If not, what exactly do they stand for and why should anyone read them? ", "name": "270", "child": "270_1\t270_2\t270_3\t270_4\t270_5\t270_6\t270_7\t270_8\t270_9\t270_10\t270_11\t270_12\t270_13\t270_14\t270_15\t270_16\t270_17\t270_18\t270_19\t270_20\t270_21\t270_22\t270_23\t270_24", "timestamp": "Apr 13"}