{"parent": "", "title": "25 insights I’ve learned on becoming a better writer", "author": "Tiffany Sun", "sentences": [{"20a9": "25 insights I’ve learned on becoming a better writer"}, {"7c75": "1.25 years of my experience, broken down into 6 mins for you."}, {"2dda": "It’s crazy how amateur I was when I started writing."}, {"4d15": "But it’s even crazier knowing how the same fingers who wrote this embarrassing piece are the same fingers that got me to the top Medium stories, Fast Company, HuffingtonPost, Lifehack, Thought Catalog, Social Media Examiner….and a bunch more I can’t remember."}, {"a5bb": "You might be wondering,"}, {"ccc7": "Did I take online courses? Did I know the editors of these giant publications? Did I enjoy writing?"}, {"ac3d": "Nope, nope and definitely not."}, {"d3b0": "Writing was never my skill, or something I felt passionate about. I sucked at it. BIG time."}, {"702b": "My thoughts would scatter in all directions like pool balls. I’d make awkward word choices (some of which I made up, or thought existed in the dictionary). And the worst one — forgetting what I really wanted to say in my message."}, {"8e6d": "Sadly, my mind goes on auto-pilot once I hit the details. 😑"}, {"a582": "What I’m trying to say here is: I’m nobody special when it comes to writing."}, {"4f38": "I had to keep climbing the mountain, just like everyone else, until finally, I wrote the most heartfelt piece in my entire life, which soon got filled with dozens of replies — most wishing me the best for my future. This, alone, motivated me to keep going. To keep writing. Every single day. Rain or shine."}, {"1a6f": "Now I get about 50,000+ views for 4–5 posts that I publish every month."}, {"f06a": "My March 2017 stats"}, {"b5a2": "And a read ratio that averages around 40%."}, {"fa51": "My March 2017 read ratio stats"}, {"464c": "TLDR: If you want to be a better writer, you need to put in the work. There’s no shortcut around it."}, {"a32b": "Luckily, I’ve been through most of the work. So here’re 25 insights I’ve learned from writing that I believe will help you with yours."}, {"ea4e": "I’m Tiffany Sun, and I write on misstiffanysun.com."}, {"7e5b": "If you like what you read, follow me there. Or better yet, subscribe below to get more of my inspirational stories!"}, {"1f9c": "Thanks for reading! 👊🏻"}, {"864f": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}], "content": "25 insights I’ve learned on becoming a better writer 1.25 years of my experience, broken down into 6 mins for you. It’s crazy how amateur I was when I started writing. But it’s even crazier knowing how the same fingers who wrote this embarrassing piece are the same fingers that got me to the top Medium stories, Fast Company, HuffingtonPost, Lifehack, Thought Catalog, Social Media Examiner….and a bunch more I can’t remember. You might be wondering, Did I take online courses? Did I know the editors of these giant publications? Did I enjoy writing? Nope, nope and definitely not. Writing was never my skill, or something I felt passionate about. I sucked at it. BIG time. My thoughts would scatter in all directions like pool balls. I’d make awkward word choices (some of which I made up, or thought existed in the dictionary). And the worst one — forgetting what I really wanted to say in my message. Sadly, my mind goes on auto-pilot once I hit the details. 😑 What I’m trying to say here is: I’m nobody special when it comes to writing. I had to keep climbing the mountain, just like everyone else, until finally, I wrote the most heartfelt piece in my entire life, which soon got filled with dozens of replies — most wishing me the best for my future. This, alone, motivated me to keep going. To keep writing. Every single day. Rain or shine. Now I get about 50,000+ views for 4–5 posts that I publish every month. My March 2017 stats And a read ratio that averages around 40%. My March 2017 read ratio stats TLDR: If you want to be a better writer, you need to put in the work. There’s no shortcut around it. Luckily, I’ve been through most of the work. So here’re 25 insights I’ve learned from writing that I believe will help you with yours. I’m Tiffany Sun, and I write on misstiffanysun.com. If you like what you read, follow me there. Or better yet, subscribe below to get more of my inspirational stories! Thanks for reading! 👊🏻 At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "name": "272", "child": "272_1\t272_2\t272_3\t272_4\t272_5\t272_6\t272_7\t272_8\t272_9\t272_10\t272_11\t272_12\t272_13\t272_14\t272_15\t272_16\t272_17272_1\t272_2\t272_3\t272_4\t272_5\t272_6\t272_7\t272_8\t272_9\t272_10\t272_11\t272_12\t272_13\t272_14\t272_15\t272_16\t272_17272_1\t272_2\t272_3\t272_4\t272_5\t272_6\t272_7\t272_8\t272_9\t272_10\t272_11\t272_12\t272_13\t272_14\t272_15\t272_16\t272_17", "timestamp": "Apr 2"}