{"parent": "", "title": "15 Ways Fake Boobs And Fake News Are Similar", "author": "Allan Ishac", "sentences": [{"95ce": "15 Ways Fake Boobs And Fake News Are Similar"}, {"6244": "Reports of fake boobs made out of ice cream should be considered fake news."}, {"5ba2": "2. When fake news spreads it can cause a constitutional crisis. When fake boobs spread it can cause a class action lawsuit."}, {"0d79": "3. People will talk about fake boobs long after they pass. People will talk about fake news long after Sunday mass (especially in red states)."}, {"c2de": "4. Fake boobs tend to feel really good in the hands. Fake news tends to get really out of hand."}, {"b2f0": "5. To detect fake news, always read below the headline. To detect fake boobs, always look below the nipple and check for the scar line."}, {"3029": "Sometimes fake news and fake boobs are easy to detect — but not always!"}, {"a5ab": "6. When you stare at fake boobs, you lose all perspective. When you stare at fake news, you lose all perspective."}, {"2384": "7. Because fake boobs are typically made from silicone, things that touch them bounce off. Because fake news is typically made from prejudice, lies, and malicious rumors, it tends to stick to the things it touches."}, {"5331": "8. Sometimes small hands can’t manipulate fake boobs, but the same small hands can easily manipulate fake news."}, {"28e9": "9. Fake boobs can help a woman get attention at the office. Fake news can help keep a woman out of office."}, {"68b6": "10. The wearers of fake boobs know they’re false, but are rewarded socially. The writers of fake news know its false, but are rewarded socially, financially, and politically when they help steal national elections."}, {"449b": "Fake news is often spread by people looking to make a buck, people trying to deceive and distract or, in the case of an American president, both."}, {"609b": "11. Fake news makes it difficult to tell real news from a hoax. Fake boobs make it difficult to tell real breasts from the rest."}, {"faef": "12. On the beach, fake boobs are especially eye-catching. On the Internet, fake news is especially truth snatching."}, {"f9b6": "13. Fake boobs are often exploited as “fun bags,” while fake news is often exploited by “scumbags.”"}, {"6f04": "14. Fake boobs can boost low self-confidence. Fake news can boost low approval ratings."}, {"520c": "15. Some sleazy presidents couldn’t survive without fake boobs. The same sleazy presidents couldn’t survive (a primary, an election, or a term in office) without fake news."}, {"c4e1": "This just in: Fake boobs rarely make real news, while true boobs always make fake news."}, {"3ba1": "*****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post."}, {"1d64": "— AI"}], "content": "15 Ways Fake Boobs And Fake News Are Similar Reports of fake boobs made out of ice cream should be considered fake news. 2. When fake news spreads it can cause a constitutional crisis. When fake boobs spread it can cause a class action lawsuit. 3. People will talk about fake boobs long after they pass. People will talk about fake news long after Sunday mass (especially in red states). 4. Fake boobs tend to feel really good in the hands. Fake news tends to get really out of hand. 5. To detect fake news, always read below the headline. To detect fake boobs, always look below the nipple and check for the scar line. Sometimes fake news and fake boobs are easy to detect — but not always! 6. When you stare at fake boobs, you lose all perspective. When you stare at fake news, you lose all perspective. 7. Because fake boobs are typically made from silicone, things that touch them bounce off. Because fake news is typically made from prejudice, lies, and malicious rumors, it tends to stick to the things it touches. 8. Sometimes small hands can’t manipulate fake boobs, but the same small hands can easily manipulate fake news. 9. Fake boobs can help a woman get attention at the office. Fake news can help keep a woman out of office. 10. The wearers of fake boobs know they’re false, but are rewarded socially. The writers of fake news know its false, but are rewarded socially, financially, and politically when they help steal national elections. Fake news is often spread by people looking to make a buck, people trying to deceive and distract or, in the case of an American president, both. 11. Fake news makes it difficult to tell real news from a hoax. Fake boobs make it difficult to tell real breasts from the rest. 12. On the beach, fake boobs are especially eye-catching. On the Internet, fake news is especially truth snatching. 13. Fake boobs are often exploited as “fun bags,” while fake news is often exploited by “scumbags.” 14. Fake boobs can boost low self-confidence. Fake news can boost low approval ratings. 15. Some sleazy presidents couldn’t survive without fake boobs. The same sleazy presidents couldn’t survive (a primary, an election, or a term in office) without fake news. This just in: Fake boobs rarely make real news, while true boobs always make fake news. ***** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post. — AI ", "name": "274", "child": "274_1\t274_2\t274_3\t274_4\t274_5\t274_6\t274_7\t274_8\t274_9\t274_10\t274_11\t274_12\t274_13\t274_14\t274_15\t274_16\t274_17\t274_18\t274_19\t274_20\t274_21\t274_22\t274_23\t274_24", "timestamp": "Mar 24"}