{"parent": "", "title": "The Eight Best Lies Russell Westbrook Has Told This Season", "author": "Jason Concepcion", "sentences": [{"27b3": "The Eight Best Lies Russell Westbrook Has Told This Season"}, {"508b": "He turns untruths into art"}, {"6688": "Russell Westbrook is the greatest, most entertaining liar in NBA history. This fact is overshadowed by his averaging a triple-double for the season, shattering Oscar Robertson’s 55-year-old record of 41 triple-doubles in a single campaign, and being a part of the tightest, most exciting, pettiest MVP race ever. But his MVP contention shouldn’t distract us from Westbrook’s real talent: telling brazen untruths. We have never seen anyone lie like Russy."}, {"2813": "In July, Kevin Durant, Westbrook’s teammate for eight years, shook the balance of power in the NBA when he left the amniotic Jacuzzi womb of Oklahoma City for the Warriors and the promise of 4–7 odds to win a title. KD took stock of his years of service alongside Russ, surveyed his options, and notified Westbrook of his decision to leave via text, the least passive-aggressive of the passive-aggressive breakup options. Russ, infamously, responded with an Instagram of cupcakes."}, {"8c19": "Westbrook’s feelings about the split are unknowable only if you go strictly by his statements. But part of his magnetism is that he isn’t bound by tradition. The Thunder franchise now fully exists in a reality that Westbrook created."}, {"d601": "On Christmas Day in Cleveland, Kyrie Irving hit a whirling, falling-down jumper over Klay Thompson to beat the Warriors. Minutes later, in Oklahoma City, warming up ahead of a game against the Timberwolves, Russ hit a deep corner 3, and, while sprinting gleefully off the floor, yelled “Thank you, Kyrie!”"}, {"2142": "This was pure shade, with rich notes of acrimony, salt, and lemon. It was Russ taking joy in Durant’s defeat. Cut and dried. Plain as the nose on your face. Right?"}, {"7303": "(Via @FredKatz)"}, {"a859": "The Thunder beat the Wolves 112–110. Russ had 31 points, 15 assists, but only seven rebounds because his squad had yet to get their box-out-but-don’t-rebound routine ironed out. After the game a local newspaper asked Russ about the pregame shenanigans."}, {"c3c7": "Because words matter, I have transcribed the exchange for clarity."}, {"b9c8": "Norman Transcript: Do you want to comment on that at all?"}, {"640d": "Russ: What?"}, {"2c42": "NT: There’s a video of you saying …"}, {"5710": "Russ: Fuck do I look like, man? For real? Why would I ever say that?"}, {"74e5": "NT: I don’t know if you want to clear anything up?"}, {"3921": "Russ: Clear what up? What video?"}, {"2d0f": "NT: There’s a video that the Thunder Twitter account tweeted out."}, {"da28": "Russ: What video?"}, {"9e50": "NT: It’s a video of you, putting up a shot, pregame. You ran off and yelled something …"}, {"cf11": "Russ: I would never say no other man’s name like that. For one … “Thank you, Kyrie.” What do I look like, bro?"}, {"fb45": "NT: …"}, {"404c": "Russ: I was talking to my trainer’s daughter. His daughter’s name is Jamie. … “Thank you, Jamie.” … [Unintelligible.] … [Cracks up just a little.] … I’m ’bout to keep my spirit up. I’m not even ’bout to involve myself in dumb stuff like that. But next question, man."}, {"cdbc": "This was sublime. I put it up there with anything he’s accomplished all season. It was a performance, just like the 50-point, 16-rebound, 10-assist outing from last Sunday that broke Robertson’s record, when he single-handedly stuffed Denver’s hopes and dreams into a clown car and set it alight."}, {"070b": "He starts with two absurd ball-busting deflections — “What do I look like?” and “Why would I say that?” He transitions to denying that there could even be a video. This is important because Russ is one of the most famous athletes in the world, whose every public moment is recorded. Then the coup de grâce: this towering pietà of bullshit about his trainer’s daughter allegedly being named Jamie or whatever. Russ is a legend."}, {"8423": "Westbrook has told many, many lies this season. The silvery string connecting them like kayfabe: They’re not really intended to deceive, nor do they suggest a lack of respect for the truth. They’re performative. They invite you to be part of the gag. Russ’s falsehoods are inclusive; they are, in actuality, a deeper form of truth. Russ saying, “I don’t like Kevin,” would tell you exactly that fact. Russ claiming, with a semi-straight face, that he said “Jamie” instead of “Kyrie” tells you that not only does he not like Kevin, he’s uncomfortable admitting it flat out, but nonetheless wants you to know. It is, in short, petty. And pettiness is the most human, relatable thing about Russell Westbrook: Purveyor of Superhuman Feats."}, {"f661": "Here is the definitive power ranking of Russell Westbrook’s lies:"}, {"8378": "1. “Thank you, Jamie.”"}, {"bfae": "See above. Audacious and unabashed. Set the tone for all the lies that followed."}, {"9d10": "2. “I got this in Madrid.”"}, {"e7d8": "(Via The Players’ Tribune)"}, {"e6f9": "When Russ strutted into the arena on November 3 ahead of his first game against Kevin Durant, he was wearing a conspicuous orange bib with the words “Official Photographer” stenciled front and back, over a blank canvas of white jeans and T-shirt. The ensemble seemed like a callback to KD’s interest in photography, and specifically his Players’ Tribune feature “My View From Super Bowl 50,” about his experience as an on-field photographer covering the big game."}, {"ad95": "That piece begins, “If you had a Super Bowl bet that I would fit into my photographer’s vest, you might have lost some money,” and features such mind-blowing revelations as: tall people can’t wear normal-sized clothing, being a professional photographer is hard, and it’s very exciting to be on the field during the big game. “I’m telling you,” KD writes “the energy is crazy in there.”"}, {"188c": "But when asked about his strangely specific fashion choice for that evening, Russ replied that the vest had no special meaning."}, {"3b02": "“I got that, actually, when I was in, uh, Madrid,” Russ said. A hint of a smirk passed across his face. “I saw the photographers walking around with the thing on and I asked the young lady can she get me one because I thought of a great fashion idea.” Recall: Durant uses his inability to fit into his photographer’s vest as a framing device and an explanation for why he didn’t wear it on the field."}, {"3298": "Why’d you decide on that tonight?"}, {"514a": "“Just because I wanted to. No particular reason. There’s no story behind it.”"}, {"c67e": "The Warriors beat the Thunder 122–96."}, {"a36f": "3. “We gotta win. That’s my thoughts.”"}, {"e491": "On April 2, the Thunder fell to the Charlotte Hornets 113–101, despite Russy’s 40 points, 13 rebounds, and 10 assists, his sixth consecutive triple-double. It was Westbrook’s 40th triple-double of the season, one behind Robertson’s record. When asked about being on the cusp of shattering a record once considered unbreakable, Russ demurred. “We gotta to win. That’s my thoughts.”"}, {"6b1b": "If you’ve watched any of Westbrook’s games over the past month or so — a stretch when he hasn’t so much chased stats as run them down from horseback — you probably found that unconvincing. Russ is averaging 34 points, 10 assists, and 11 rebounds with a 40 percent usage rate, 56 percent assist percentage, and 18 percent rebound rate over that run."}, {"dd02": "4. “What exchange?”"}, {"8e05": "Westbrook-centric prog-rock guitar solos can’t match Golden State’s hydra-headed attack symphony. And on January 18, the Warriors proved that point, for the second time this season, beating OKC 121–100 in an acrimonious affair that featured various low-level squabbles. Most notably, because we’ve all been waiting for it since July, an exchange of words in the third quarter between Westbrook and Durant."}, {"a89d": "What was that about, Russ?"}, {"b5c4": "Russ: What exchange?"}, {"c7db": "Reporter: You and KD said something to each other."}, {"feb0": "Russ: You gotta sit closer to the game. You maybe you didn’t see it clearly."}, {"c84a": "5. “I really don’t care. Honestly.”"}, {"14b4": "Russ headed into a December 11 game against the Celtics on a rampaging seven-game triple-double streak. The run stopped there, but Westbrook’s 37 points, 12 boards, and six assists was just Herculean enough to lift the Thunder over Boston. Asked after the game if he thought a player on a team that doesn’t finish top two in its conference should win the MVP — a situation much like the one he, Russell Westbrook, found himself in, he was like Pshhh. No. What?"}, {"7e86": "Russ: I don’t know. I’m not sure. I don’t know how the voting or everything goes. I really don’t care, honestly. [Aside: Whenever someone says “honestly,” they’re lying.]"}, {"501a": "Reporter: About the award or about …"}, {"db98": "Russ: About none of it. Honestly, championship is the most important goal for me …"}, {"1f4a": "6. “I really don’t care. For the hundredth time. I don’t care.”"}, {"88b9": "Russ was averaging 31 points, 11 rebounds, and 11 assists when the Thunder lost to the Jazz on December 14. After the game, he was asked if he could continue to notch triple-doubles."}, {"474b": "Russ: “People think if I don’t get it, it’s like a big thing. When I do get it, it’s a thing. If y’all just let me play — if I get it, I get it. If I don’t, I don’t care. It is what it is. I really don’t care. For the hundredth time. I don’t care. All I care about is winning, honestly. All the numbers shit don’t mean nothing to me.”"}, {"60ee": "7. “I don’t care. Who is he?”"}, {"0315": "On March 16, Russ had 24 points, 10 rebounds, and 16 assists in a win over the Raptors. After the game, some poor misbegotten soul, likely working on deadline, made the classic mistake of mentioning Steph Curry’s name within earshot of Russ."}, {"59be": "Reporter: Do you pay attention to when other players talk about who the MVP could be?"}, {"d809": "Russ: I don’t."}, {"35d9": "Reporter: So, has anyone told you that Steph Curry —"}, {"747d": "Russ:"}, {"6aaf": "(Via SportsNet Canada)"}, {"7fba": "Reporter: — shared his opinion that it should be [James] Harden because of where the Rockets are in the standings?"}, {"1e4c": "Russ: I don’t care. It don’t matter what he say. Who is he? [Shrugs savagely.]"}, {"cb2a": "8. “I don’t really care, honestly, man.”"}, {"1f29": "Westbrook anointed the Garden by racking up his eighth triple-double of the season during a November 28 demolition of the New York Knicks. It was the 45th triple-double of his career. He had just become the first player since the Big O to average a triple-double through 19 games. Asked if he grasped the significance of that …"}, {"6587": "Russ: “I don’t really care, honestly, man. I just like to win and compete at a high level. I play the same way every night. I’ve been playing the same way since I’ve been in the league.”"}, {"a35a": "The ability to effectively suppress emotion is a basic building block of civilization. Everyday life is made up of dozens of micro-disappointments, anger-inducing events, small defeats, and annoyances. Being adult largely depends on one’s ability to manage these disappointments without being outwardly affected by them. The reason “How are you?” is a ubiquitous greeting found in cultures and nations across the globe isn’t that people truly care about how other people are feeling. The “correct” response to this query is, 99.999 percent of the time, “Good” or “OK” or “Fine.” The incorrect response is always any honest answer. The purpose of “How are you?,” as a purely rhetorical question, is to gauge whether a person is operating at a baseline level of emotional control or whether they’re going to make things weird by accurately expressing their inner turmoil. And that’s why I love Russell Westbrook’s lies. He’s like every other person in the world who says he doesn’t care: [Extremely Ron Howard Voice] Actually, he does."}], "content": "The Eight Best Lies Russell Westbrook Has Told This Season He turns untruths into art Russell Westbrook is the greatest, most entertaining liar in NBA history. This fact is overshadowed by his averaging a triple-double for the season, shattering Oscar Robertson’s 55-year-old record of 41 triple-doubles in a single campaign, and being a part of the tightest, most exciting, pettiest MVP race ever. But his MVP contention shouldn’t distract us from Westbrook’s real talent: telling brazen untruths. We have never seen anyone lie like Russy. In July, Kevin Durant, Westbrook’s teammate for eight years, shook the balance of power in the NBA when he left the amniotic Jacuzzi womb of Oklahoma City for the Warriors and the promise of 4–7 odds to win a title. KD took stock of his years of service alongside Russ, surveyed his options, and notified Westbrook of his decision to leave via text, the least passive-aggressive of the passive-aggressive breakup options. Russ, infamously, responded with an Instagram of cupcakes. Westbrook’s feelings about the split are unknowable only if you go strictly by his statements. But part of his magnetism is that he isn’t bound by tradition. The Thunder franchise now fully exists in a reality that Westbrook created. On Christmas Day in Cleveland, Kyrie Irving hit a whirling, falling-down jumper over Klay Thompson to beat the Warriors. Minutes later, in Oklahoma City, warming up ahead of a game against the Timberwolves, Russ hit a deep corner 3, and, while sprinting gleefully off the floor, yelled “Thank you, Kyrie!” This was pure shade, with rich notes of acrimony, salt, and lemon. It was Russ taking joy in Durant’s defeat. Cut and dried. Plain as the nose on your face. Right? (Via @FredKatz) The Thunder beat the Wolves 112–110. Russ had 31 points, 15 assists, but only seven rebounds because his squad had yet to get their box-out-but-don’t-rebound routine ironed out. After the game a local newspaper asked Russ about the pregame shenanigans. Because words matter, I have transcribed the exchange for clarity. Norman Transcript: Do you want to comment on that at all? Russ: What? NT: There’s a video of you saying … Russ: Fuck do I look like, man? For real? Why would I ever say that? NT: I don’t know if you want to clear anything up? Russ: Clear what up? What video? NT: There’s a video that the Thunder Twitter account tweeted out. Russ: What video? NT: It’s a video of you, putting up a shot, pregame. You ran off and yelled something … Russ: I would never say no other man’s name like that. For one … “Thank you, Kyrie.” What do I look like, bro? NT: … Russ: I was talking to my trainer’s daughter. His daughter’s name is Jamie. … “Thank you, Jamie.” … [Unintelligible.] … [Cracks up just a little.] … I’m ’bout to keep my spirit up. I’m not even ’bout to involve myself in dumb stuff like that. But next question, man. This was sublime. I put it up there with anything he’s accomplished all season. It was a performance, just like the 50-point, 16-rebound, 10-assist outing from last Sunday that broke Robertson’s record, when he single-handedly stuffed Denver’s hopes and dreams into a clown car and set it alight. He starts with two absurd ball-busting deflections — “What do I look like?” and “Why would I say that?” He transitions to denying that there could even be a video. This is important because Russ is one of the most famous athletes in the world, whose every public moment is recorded. Then the coup de grâce: this towering pietà of bullshit about his trainer’s daughter allegedly being named Jamie or whatever. Russ is a legend. Westbrook has told many, many lies this season. The silvery string connecting them like kayfabe: They’re not really intended to deceive, nor do they suggest a lack of respect for the truth. They’re performative. They invite you to be part of the gag. Russ’s falsehoods are inclusive; they are, in actuality, a deeper form of truth. Russ saying, “I don’t like Kevin,” would tell you exactly that fact. Russ claiming, with a semi-straight face, that he said “Jamie” instead of “Kyrie” tells you that not only does he not like Kevin, he’s uncomfortable admitting it flat out, but nonetheless wants you to know. It is, in short, petty. And pettiness is the most human, relatable thing about Russell Westbrook: Purveyor of Superhuman Feats. Here is the definitive power ranking of Russell Westbrook’s lies: 1. “Thank you, Jamie.” See above. Audacious and unabashed. Set the tone for all the lies that followed. 2. “I got this in Madrid.” (Via The Players’ Tribune) When Russ strutted into the arena on November 3 ahead of his first game against Kevin Durant, he was wearing a conspicuous orange bib with the words “Official Photographer” stenciled front and back, over a blank canvas of white jeans and T-shirt. The ensemble seemed like a callback to KD’s interest in photography, and specifically his Players’ Tribune feature “My View From Super Bowl 50,” about his experience as an on-field photographer covering the big game. That piece begins, “If you had a Super Bowl bet that I would fit into my photographer’s vest, you might have lost some money,” and features such mind-blowing revelations as: tall people can’t wear normal-sized clothing, being a professional photographer is hard, and it’s very exciting to be on the field during the big game. “I’m telling you,” KD writes “the energy is crazy in there.” But when asked about his strangely specific fashion choice for that evening, Russ replied that the vest had no special meaning. “I got that, actually, when I was in, uh, Madrid,” Russ said. A hint of a smirk passed across his face. “I saw the photographers walking around with the thing on and I asked the young lady can she get me one because I thought of a great fashion idea.” Recall: Durant uses his inability to fit into his photographer’s vest as a framing device and an explanation for why he didn’t wear it on the field. Why’d you decide on that tonight? “Just because I wanted to. No particular reason. There’s no story behind it.” The Warriors beat the Thunder 122–96. 3. “We gotta win. That’s my thoughts.” On April 2, the Thunder fell to the Charlotte Hornets 113–101, despite Russy’s 40 points, 13 rebounds, and 10 assists, his sixth consecutive triple-double. It was Westbrook’s 40th triple-double of the season, one behind Robertson’s record. When asked about being on the cusp of shattering a record once considered unbreakable, Russ demurred. “We gotta to win. That’s my thoughts.” If you’ve watched any of Westbrook’s games over the past month or so — a stretch when he hasn’t so much chased stats as run them down from horseback — you probably found that unconvincing. Russ is averaging 34 points, 10 assists, and 11 rebounds with a 40 percent usage rate, 56 percent assist percentage, and 18 percent rebound rate over that run. 4. “What exchange?” Westbrook-centric prog-rock guitar solos can’t match Golden State’s hydra-headed attack symphony. And on January 18, the Warriors proved that point, for the second time this season, beating OKC 121–100 in an acrimonious affair that featured various low-level squabbles. Most notably, because we’ve all been waiting for it since July, an exchange of words in the third quarter between Westbrook and Durant. What was that about, Russ? Russ: What exchange? Reporter: You and KD said something to each other. Russ: You gotta sit closer to the game. You maybe you didn’t see it clearly. 5. “I really don’t care. Honestly.” Russ headed into a December 11 game against the Celtics on a rampaging seven-game triple-double streak. The run stopped there, but Westbrook’s 37 points, 12 boards, and six assists was just Herculean enough to lift the Thunder over Boston. Asked after the game if he thought a player on a team that doesn’t finish top two in its conference should win the MVP — a situation much like the one he, Russell Westbrook, found himself in, he was like Pshhh. No. What? Russ: I don’t know. I’m not sure. I don’t know how the voting or everything goes. I really don’t care, honestly. [Aside: Whenever someone says “honestly,” they’re lying.] Reporter: About the award or about … Russ: About none of it. Honestly, championship is the most important goal for me … 6. “I really don’t care. For the hundredth time. I don’t care.” Russ was averaging 31 points, 11 rebounds, and 11 assists when the Thunder lost to the Jazz on December 14. After the game, he was asked if he could continue to notch triple-doubles. Russ: “People think if I don’t get it, it’s like a big thing. When I do get it, it’s a thing. If y’all just let me play — if I get it, I get it. If I don’t, I don’t care. It is what it is. I really don’t care. For the hundredth time. I don’t care. All I care about is winning, honestly. All the numbers shit don’t mean nothing to me.” 7. “I don’t care. Who is he?” On March 16, Russ had 24 points, 10 rebounds, and 16 assists in a win over the Raptors. After the game, some poor misbegotten soul, likely working on deadline, made the classic mistake of mentioning Steph Curry’s name within earshot of Russ. Reporter: Do you pay attention to when other players talk about who the MVP could be? Russ: I don’t. Reporter: So, has anyone told you that Steph Curry — Russ: (Via SportsNet Canada) Reporter: — shared his opinion that it should be [James] Harden because of where the Rockets are in the standings? Russ: I don’t care. It don’t matter what he say. Who is he? [Shrugs savagely.] 8. “I don’t really care, honestly, man.” Westbrook anointed the Garden by racking up his eighth triple-double of the season during a November 28 demolition of the New York Knicks. It was the 45th triple-double of his career. He had just become the first player since the Big O to average a triple-double through 19 games. Asked if he grasped the significance of that … Russ: “I don’t really care, honestly, man. I just like to win and compete at a high level. I play the same way every night. I’ve been playing the same way since I’ve been in the league.” The ability to effectively suppress emotion is a basic building block of civilization. Everyday life is made up of dozens of micro-disappointments, anger-inducing events, small defeats, and annoyances. Being adult largely depends on one’s ability to manage these disappointments without being outwardly affected by them. The reason “How are you?” is a ubiquitous greeting found in cultures and nations across the globe isn’t that people truly care about how other people are feeling. The “correct” response to this query is, 99.999 percent of the time, “Good” or “OK” or “Fine.” The incorrect response is always any honest answer. The purpose of “How are you?,” as a purely rhetorical question, is to gauge whether a person is operating at a baseline level of emotional control or whether they’re going to make things weird by accurately expressing their inner turmoil. And that’s why I love Russell Westbrook’s lies. He’s like every other person in the world who says he doesn’t care: [Extremely Ron Howard Voice] Actually, he does. ", "name": "28", "child": "28_1\t28_2\t28_3\t28_4\t28_5\t28_6\t28_7\t28_8\t28_9\t28_10\t28_11\t28_12\t28_13\t28_14\t28_15\t28_16\t28_17\t28_18\t28_19\t28_20\t28_21\t28_22\t28_23\t28_24", "timestamp": "Apr 11"}