{"parent": "", "title": "This Portable AC Is Perfect For Anyone Who Sweats 100% Of The Time", "author": "Dose Staff", "sentences": [{"2782": "This Portable AC Is Perfect For Anyone Who Sweats 100% Of The Time"}, {"d040": "It lasts for 5 hours without a charge."}, {"2220": "Say what you will about how air conditioners are ruining the environment and promoting laziness, there’s nothing better than aiming cold air straight at your sweaty buttcrack. To me, the only thing better than a high-powered AC unit in the dead of summer (besides drinking a margarita in a kiddie pool) is a portable AC unit you can take wherever you go."}, {"e65f": "Allow me to introduce The Geizeer, a gel ice pack-fueled mini genius that blows cold air for five hours straight without a charge — plus, it costs less than a penny a day to run. This wooden gadget sells for $109 on Indiegogo and charges via a micro-USB cable."}, {"28f9": "A few places you can use it:"}, {"6ad6": "The ice pack also provides a dedicated space where you can put fragrant diffusers, so you can breathe in lavender while also cooling down your hoo-ha. What a time to be alive."}], "content": "This Portable AC Is Perfect For Anyone Who Sweats 100% Of The Time It lasts for 5 hours without a charge. Say what you will about how air conditioners are ruining the environment and promoting laziness, there’s nothing better than aiming cold air straight at your sweaty buttcrack. To me, the only thing better than a high-powered AC unit in the dead of summer (besides drinking a margarita in a kiddie pool) is a portable AC unit you can take wherever you go. Allow me to introduce The Geizeer, a gel ice pack-fueled mini genius that blows cold air for five hours straight without a charge — plus, it costs less than a penny a day to run. This wooden gadget sells for $109 on Indiegogo and charges via a micro-USB cable. A few places you can use it: The ice pack also provides a dedicated space where you can put fragrant diffusers, so you can breathe in lavender while also cooling down your hoo-ha. What a time to be alive. ", "name": "291", "child": "291_1\t291_2", "timestamp": "Apr 3"}