{"parent": "", "title": "These Floating Hotel Rooms Carry You To Different Islands", "author": "Julianne Ishler", "sentences": [{"93fd": "These Floating Hotel Rooms Carry You To Different Islands"}, {"c2f6": "It’s a cruise ship, minus the ship."}, {"4f38": "Japan already has plenty of weird places for travelers to spend the night. The country boasts capsule hotels, love hotels and even a robot hotel. Now it’s adding another strange overnight experience to the mix: floating hotel rooms."}, {"6268": "Huis Ten Bosch Co./Kyodo"}, {"d901": "If spending the night on the water only to wake up on a deserted island in the morning sounds like a dream, book a trip to Japan’s Huis Ten Bosch theme park ASAP."}, {"2b3b": "Huis Ten Bosch is a massive (42,000 square foot) Dutch theme park that recreates Holland in the middle of Nagasaki:"}, {"6be2": "A slice of Holland in the middle of Japan. | Alamy"}, {"d116": "There are several hotels inside the park already (including the robot one I mentioned above) but this is by far the most extreme. Each floating pod has two floors — the top floor is a bedroom and the bottom half is the bathroom, according to Japan Times. Each orb apparently can house four people."}, {"a798": "The Huis Ten Bosch amusement park in Japan. | trip101.com"}, {"d00e": "While you sleep, the pods float towards several of the park’s uninhabited islands, although it’s not clear yet how they get there (do they have motors underneath? More details, please!)"}, {"aaff": "During each trip, you can expect some “Hunger Games”-style activities to go down, according to Bloomberg. You’ll apparently play survival games equipped with toy guns—so be sure to bring your Katniss Everdeen spirit along."}, {"3f98": "Huis Ten Bosch will begin renting the floating rooms by the end of the year. One night’s stay will cost between $266-$355—however, the experience of dozing off on the water seems priceless."}], "content": "These Floating Hotel Rooms Carry You To Different Islands It’s a cruise ship, minus the ship. Japan already has plenty of weird places for travelers to spend the night. The country boasts capsule hotels, love hotels and even a robot hotel. Now it’s adding another strange overnight experience to the mix: floating hotel rooms. Huis Ten Bosch Co./Kyodo If spending the night on the water only to wake up on a deserted island in the morning sounds like a dream, book a trip to Japan’s Huis Ten Bosch theme park ASAP. Huis Ten Bosch is a massive (42,000 square foot) Dutch theme park that recreates Holland in the middle of Nagasaki: A slice of Holland in the middle of Japan. | Alamy There are several hotels inside the park already (including the robot one I mentioned above) but this is by far the most extreme. Each floating pod has two floors — the top floor is a bedroom and the bottom half is the bathroom, according to Japan Times. Each orb apparently can house four people. The Huis Ten Bosch amusement park in Japan. | trip101.com While you sleep, the pods float towards several of the park’s uninhabited islands, although it’s not clear yet how they get there (do they have motors underneath? More details, please!) During each trip, you can expect some “Hunger Games”-style activities to go down, according to Bloomberg. You’ll apparently play survival games equipped with toy guns—so be sure to bring your Katniss Everdeen spirit along. Huis Ten Bosch will begin renting the floating rooms by the end of the year. One night’s stay will cost between $266-$355—however, the experience of dozing off on the water seems priceless. ", "name": "293", "child": "293_1", "timestamp": "Mar 21"}