{"parent": "", "title": "Could ‘Arrival’ Really Happen?", "author": "Mathew Jedeikin", "sentences": [{"bb63": "Could ‘Arrival’ Really Happen?"}, {"6ddc": "A deep dive into whether humans’ brains could actually perceive nonlinear time."}, {"de58": "Our Movie Mythbusters series answers the age-old question, “Okay, but could that actually happen in real life?”"}, {"c853": "“Arrival” is an unqualified masterpiece. One of the best films of 2016, it was nominated for an Academy Award for Best Picture. Unfortunately, lead actress Amy Adams was snubbed in the Best Actress category, but that’s not really the point of this article, so let’s not get too distracted. Now, there was one thing about the film that really stayed with me, besides the fact that Adams wasn’t recognized by the Academy of Motion Picture Arts and Sciences…As I left the theater after seeing “Arrival” for the first time, I couldn’t help but wonder: Is it possible for what happened in the movie to happen IRL?"}, {"155c": "‘Arrival’"}, {"a20d": "Warning: The rest of this article contains major spoilers — so if you, for some insane reason, have not yet seen “Arrival,” go to your nearest Redbox right now to rent a copy. Yeah, it’s that good."}, {"ac30": "In the movie, the US government asks Dr. Louise Banks (played by Adams) to help decipher the language of aliens called “heptapods” that arrive on Earth. Banks quickly discovers the heptapods’ written language is circular, and does not progress from cause to effect. We learn toward the end of “Arrival” that the heptapods experience time as a loop. They can access the past, present and future at all times. The heptapods came to Earth in order to give this gift (or “weapon,” as they refer to it in the film) to humans because the fate of their own race depends on assistance from humans 3,000 years in the future."}, {"0d52": "After mastering the basics of their language, Dr. Banks begins to notice that her brain has re-wired, making her able to experience time in a nonlinear fashion. Meaning that the visions she has throughout the film are actually set in the future, not memories of the past."}, {"def5": "‘Arrival’"}, {"72bf": "The main theory behind the concept that one could grow to experience nonlinear time is based on the Sapir-Whorf hypothesis, which claims that the difference in structure between different languages can influence one’s cognition and perception of the world. It’s a controversial theory, but studies have supported it. For example, the Proceedings of the National Academy of Sciences found that people who speak Russian are faster at discriminating between shades of blue than English speakers, likely due to the fact that there are two words in Russian for different shades of blue."}, {"9efd": "As Rowan Hooper of The Washington Post points out, there’s also scientific support for the concept that the heptapods could not experience time directionally. In real life, different cultures can conceive time somewhat differently. Whereas people who speak English tend to view time as running from right to left, Chinese speakers think of time as running from top to bottom."}, {"11a0": "Therefore, it is theoretically conceivable for humans to one day experience time as nonlinear, just as Dr. Banks does in “Arrival.” Add in the Sapir-Whorf hypothesis, and it is possible that language could be the tool that leads humans down this path. However, though it is possible, it’s quite improbable. The Sapir-Whorf hypothesis is, after all, just a theory, and one that is hotly debated among linguists."}, {"9d39": "Furthermore, in “Arrival,” it’s aliens who give humans the gift of their language, which results in Dr. Banks’ ability to access the future. Unfortunately, there have not yet been any signs of intelligent life beyond Earth. Now, that certainly doesn’t mean intelligent life doesn’t exist, but experts claim the chances of an extraterrestrial species visiting our planet are slim. “I’m not holding my breath that aliens will ever travel to Earth,” Douglas Vakoch, President of the Messaging Extraterrestrial Intelligence organization, told Wired."}, {"f597": "So there you have it: Yes, it is theoretically possible that aliens might one day come to our planet and gift us with a language that rewires our brains to perceive time as nonlinear, but it’s extremely unlikely. Either way, “Arrival” is an epic film, and it’s sort of awesome that the concepts it presents are rooted in actual scientific theories."}], "content": "Could ‘Arrival’ Really Happen? A deep dive into whether humans’ brains could actually perceive nonlinear time. Our Movie Mythbusters series answers the age-old question, “Okay, but could that actually happen in real life?” “Arrival” is an unqualified masterpiece. One of the best films of 2016, it was nominated for an Academy Award for Best Picture. Unfortunately, lead actress Amy Adams was snubbed in the Best Actress category, but that’s not really the point of this article, so let’s not get too distracted. Now, there was one thing about the film that really stayed with me, besides the fact that Adams wasn’t recognized by the Academy of Motion Picture Arts and Sciences…As I left the theater after seeing “Arrival” for the first time, I couldn’t help but wonder: Is it possible for what happened in the movie to happen IRL? ‘Arrival’ Warning: The rest of this article contains major spoilers — so if you, for some insane reason, have not yet seen “Arrival,” go to your nearest Redbox right now to rent a copy. Yeah, it’s that good. In the movie, the US government asks Dr. Louise Banks (played by Adams) to help decipher the language of aliens called “heptapods” that arrive on Earth. Banks quickly discovers the heptapods’ written language is circular, and does not progress from cause to effect. We learn toward the end of “Arrival” that the heptapods experience time as a loop. They can access the past, present and future at all times. The heptapods came to Earth in order to give this gift (or “weapon,” as they refer to it in the film) to humans because the fate of their own race depends on assistance from humans 3,000 years in the future. After mastering the basics of their language, Dr. Banks begins to notice that her brain has re-wired, making her able to experience time in a nonlinear fashion. Meaning that the visions she has throughout the film are actually set in the future, not memories of the past. ‘Arrival’ The main theory behind the concept that one could grow to experience nonlinear time is based on the Sapir-Whorf hypothesis, which claims that the difference in structure between different languages can influence one’s cognition and perception of the world. It’s a controversial theory, but studies have supported it. For example, the Proceedings of the National Academy of Sciences found that people who speak Russian are faster at discriminating between shades of blue than English speakers, likely due to the fact that there are two words in Russian for different shades of blue. As Rowan Hooper of The Washington Post points out, there’s also scientific support for the concept that the heptapods could not experience time directionally. In real life, different cultures can conceive time somewhat differently. Whereas people who speak English tend to view time as running from right to left, Chinese speakers think of time as running from top to bottom. Therefore, it is theoretically conceivable for humans to one day experience time as nonlinear, just as Dr. Banks does in “Arrival.” Add in the Sapir-Whorf hypothesis, and it is possible that language could be the tool that leads humans down this path. However, though it is possible, it’s quite improbable. The Sapir-Whorf hypothesis is, after all, just a theory, and one that is hotly debated among linguists. Furthermore, in “Arrival,” it’s aliens who give humans the gift of their language, which results in Dr. Banks’ ability to access the future. Unfortunately, there have not yet been any signs of intelligent life beyond Earth. Now, that certainly doesn’t mean intelligent life doesn’t exist, but experts claim the chances of an extraterrestrial species visiting our planet are slim. “I’m not holding my breath that aliens will ever travel to Earth,” Douglas Vakoch, President of the Messaging Extraterrestrial Intelligence organization, told Wired. So there you have it: Yes, it is theoretically possible that aliens might one day come to our planet and gift us with a language that rewires our brains to perceive time as nonlinear, but it’s extremely unlikely. Either way, “Arrival” is an epic film, and it’s sort of awesome that the concepts it presents are rooted in actual scientific theories. ", "name": "294", "child": "294_1\t294_2294_1\t294_2", "timestamp": "Mar 16"}