{"parent": "", "title": "This Japanese App Wants Your Real Poo", "author": "Josh O’Connor", "sentences": [{"e348": "This Japanese App Wants Your Real Poo"}, {"145c": "Time to learn the truth about your gut health."}, {"7a54": "How much do you weigh? Divide that by 100. That’s how many pounds of bacteria are living in your body right now. So if you weigh 150 pounds, you’ve got 1.5 pounds of the stuff living in your nasal passages, skin, oral cavity, urinary and digestive tracts."}, {"9306": "That sounds gross, but bacteria are really important. They extract nutrients from food that you can’t, create vitamins that you can’t, and teach your immune system to combat disease-causing microbes."}, {"e501": "Scientists are also learning that changes to the composition of bacteria in your body — known as your “microbiome” — correlate with several disease states."}, {"853c": "So you might want to know what those bacteria are."}, {"3023": "Enter Mykinso, a Japanese app that offers people a way to see what’s living inside their gut."}, {"b148": "Submitting samples for DNA mapping usually involves rubbing a cotton swab on the inside of your cheek. Mapping the microbiome in your gut is a little more … hands-on."}, {"c11f": "Here’s how it works: After registering with the app, you fill out a lifestyle questionnaire, pay $170, and Mykinso sends you a poop-sample collection kit. (The cheerful icon on their website shows a little dropper held over a toilet bowl.)"}, {"08fe": "Here’s the fun part: You take a poo, then use the dropper to collect samples of it, squeeze them out into the little plastic envelope that’s included, and mail them off to Japan. Note to Mykinso’s CEO, if you’re reading this: A hard-sided container might make postmen feel better."}, {"33d6": "H. Armstrong Roberts/Getty Images"}, {"afe0": "Next, Mykinso analyzes your stool samples, and sends you their findings via the app, telling you which bacteria are in your gut what you can do to improve your health."}, {"2fc3": "Mykinso describes the whole process in an explainer video on their website, complete with the obligatory acoustic guitar track, and cartoons of happy users and adorable little microbes. I can almost hear the teenage girls screaming, kawaiiiii! (“So cute!”) ✌.ʕʘ‿ʘʔ.✌"}, {"7a85": "Mykinso"}, {"cd58": "Mykinso is evidence of the increasing focus on microbiomes in the medical field. The National Institutes of Health (NIH) says it may be possible to improve your health by making changes to your microbiome."}, {"7de6": "But aside from improving general health, researchers are also concerned about “superbugs,” or bacteria that are resistant to antibiotics, because antibiotics have been over-prescribed. Harmless inside our gut, these superbugs are sometimes exposed through accidents or medical treatment and attack people with illnesses no drugs can treat. In a worst-case scenario, a superbug could be a plague that kills large numbers of people while researchers look on helplessly."}, {"49e5": "The NIH’s Human Microbiome Project is cataloging the microbes in our bodies, and researching how manipulating them can affect or help us. It’s similar to the successful Human Genome Project, which mapped human DNA to find ways to improve our health. The Human Genome Project made people more curious about their own DNA, and several services sprang up that let you get your DNA mapped. Mykinso promises to do that for your microbiome."}, {"7829": "A medical journalist I spoke to didn’t take Mykinso very seriously, but since it’s affiliated with research institutions like Japan’s Riken, I wouldn’t be surprised if some of the data they collect winds up contributing to international efforts to map our microbiomes. After all, home DNA tests are helpful for the researchers assembling the human genome, because they give them more data to work with."}, {"8058": "Mykinso, which secured a $2.3 million round of funding in December and is already in operation, is aimed at the Japanese market. They see San Francisco-based uBiome, which has raised $27 million, as their principal rival. uBiome’s stated goal is “to map the human microbiome with citizen science.” We’ll probably see similar apps springing up to collect poo from people around the world."}, {"8f53": "Curious about what’s in your gut now?"}], "content": "This Japanese App Wants Your Real Poo Time to learn the truth about your gut health. How much do you weigh? Divide that by 100. That’s how many pounds of bacteria are living in your body right now. So if you weigh 150 pounds, you’ve got 1.5 pounds of the stuff living in your nasal passages, skin, oral cavity, urinary and digestive tracts. That sounds gross, but bacteria are really important. They extract nutrients from food that you can’t, create vitamins that you can’t, and teach your immune system to combat disease-causing microbes. Scientists are also learning that changes to the composition of bacteria in your body — known as your “microbiome” — correlate with several disease states. So you might want to know what those bacteria are. Enter Mykinso, a Japanese app that offers people a way to see what’s living inside their gut. Submitting samples for DNA mapping usually involves rubbing a cotton swab on the inside of your cheek. Mapping the microbiome in your gut is a little more … hands-on. Here’s how it works: After registering with the app, you fill out a lifestyle questionnaire, pay $170, and Mykinso sends you a poop-sample collection kit. (The cheerful icon on their website shows a little dropper held over a toilet bowl.) Here’s the fun part: You take a poo, then use the dropper to collect samples of it, squeeze them out into the little plastic envelope that’s included, and mail them off to Japan. Note to Mykinso’s CEO, if you’re reading this: A hard-sided container might make postmen feel better. H. Armstrong Roberts/Getty Images Next, Mykinso analyzes your stool samples, and sends you their findings via the app, telling you which bacteria are in your gut what you can do to improve your health. Mykinso describes the whole process in an explainer video on their website, complete with the obligatory acoustic guitar track, and cartoons of happy users and adorable little microbes. I can almost hear the teenage girls screaming, kawaiiiii! (“So cute!”) ✌.ʕʘ‿ʘʔ.✌ Mykinso Mykinso is evidence of the increasing focus on microbiomes in the medical field. The National Institutes of Health (NIH) says it may be possible to improve your health by making changes to your microbiome. But aside from improving general health, researchers are also concerned about “superbugs,” or bacteria that are resistant to antibiotics, because antibiotics have been over-prescribed. Harmless inside our gut, these superbugs are sometimes exposed through accidents or medical treatment and attack people with illnesses no drugs can treat. In a worst-case scenario, a superbug could be a plague that kills large numbers of people while researchers look on helplessly. The NIH’s Human Microbiome Project is cataloging the microbes in our bodies, and researching how manipulating them can affect or help us. It’s similar to the successful Human Genome Project, which mapped human DNA to find ways to improve our health. The Human Genome Project made people more curious about their own DNA, and several services sprang up that let you get your DNA mapped. Mykinso promises to do that for your microbiome. A medical journalist I spoke to didn’t take Mykinso very seriously, but since it’s affiliated with research institutions like Japan’s Riken, I wouldn’t be surprised if some of the data they collect winds up contributing to international efforts to map our microbiomes. After all, home DNA tests are helpful for the researchers assembling the human genome, because they give them more data to work with. Mykinso, which secured a $2.3 million round of funding in December and is already in operation, is aimed at the Japanese market. They see San Francisco-based uBiome, which has raised $27 million, as their principal rival. uBiome’s stated goal is “to map the human microbiome with citizen science.” We’ll probably see similar apps springing up to collect poo from people around the world. Curious about what’s in your gut now? ", "name": "295", "child": "295_1\t295_2295_1\t295_2", "timestamp": "Mar 15"}