{"parent": "", "title": "The last woolly mammoths in North America didn’t starve — they died of thirst", "author": "ExtremeTech", "sentences": [{"6b3e": "The last woolly mammoths in North America didn’t starve — they died of thirst"}, {"d929": "by Joel Hruska"}, {"8f79": "Of all the prehistoric megafauna on Earth, few have captured the imagination as thoroughly as the woolly mammoth. Scientists have researched the feasibility of cloning mammoths for decades, but knowing how and why they died out would tell us a great deal about the feasibility of restoring the species today. New research on the last-surviving mammoth population in North America has shown that this particular group probably didn’t die as the result of human hunting or a loss of food."}, {"a30e": "Woolly mammoths generally went extinct between 10,000 and 14,000 years ago, along with the majority of the Pleistocene megafauna. There are, however, two known exceptions. Mammoths persisted on two islands: Wrangel Island, a Russian island in the Arctic Ocean, and Saint Paul Island, off the Alaskan coast. The latter is the last-known location where mammoths survived in North America (3600 BC), while the Wrangel population lived until roughly 2000 BC."}, {"ffab": "The Beringia land bridge. Image by NOAA."}, {"5269": "The two major reasons for why megafauna like the mammoth went extinct are thought to be climate change and human predation. As the climate warmed, humans expanded into new territories that were formerly blocked by ice or too harsh to sustain life on an ongoing basis. The populations on Saint Paul and Wrangel survived as long as they did partly because they were isolated from humans and weren’t hunted for food."}, {"f2da": "One possible explanation for the Saint Paul mammoths’ eventual extinction would be the glacial melt that created the island in the first place. The GIF above shows how the oceans rose, turning Saint Paul into an island and trapping a group of mammoths in the process. Despite being stuck on a comparatively tiny rock, the mammoths survived for thousands of years — long after the island’s modern shorelines were established. Glacial melt might have isolated the population, but it’s not what killed them off."}, {"760a": "The research team collected mammoth remains from a cave on St. Paul and took sediment samples from a nearby lake. They then analyzed the sediment samples looking for the spores of fungi that live on the island and preferentially reproduce in animal dung. Elephants are famous for producing mammoth amounts of dung and the sediment samples reflected this up to about 5,600 years ago. Other analyses of the sediment cores showed that vegetation and plant life on the island had remained constant over time as well — the mammoths didn’t die due to a lack of food, either."}, {"3822": "Thirst, not hunger, is thought to have doomed the mammoth population. The team writes:"}, {"6be0": "Instead, the extinction coincided with declining freshwater resources and drier climates between 7,850 and 5,600 y ago, as inferred from sedimentary magnetic susceptibility, oxygen isotopes, and diatom and cladoceran assemblages in a sediment core from a freshwater lake on the island, and stable nitrogen isotopes from mammoth remains. Contrary to other extinction models for the St. Paul mammoth population, this evidence indicates that this mammoth population died out because of the synergistic effects of shrinking island area and freshwater scarcity caused by rising sea levels and regional climate change."}, {"a907": "Saint Paul island lacks any spring or source for fresh water, which means there was no way to restore its supply. As the climate dried, the amount of water available to the mammoths would have dwindled, while rising sea levels allowed salt water to penetrate the soil from below. The research team conducted a comprehensive analysis on the diatom fossils present within the sediment cores and found evidence that the types of diatoms in the water had changed dramatically over time. Older core samples showed evidence of diatoms — single-celled algae — that preferred freshwater and a depth of several meters. This type of diatom was plentiful in core samples dated to ~5800 BC and became much less common thereafter before vanishing altogether. The diatoms that replaced it are from species that thrive in shallower waters with a higher concentration of salt."}, {"6940": "In short, the mammoths died out at a time when the island still had enough plants to feed them and space for them to live on, but when the quality and amount of water had precipitously declined. It’s because of this that the research team believes thirst ultimately killed the mammoth population. It’s also a reminder that climate change can damage ecosystems without inundating an area. Freshwater contaminated by saltwater seeping in from the ocean can kill plants and effectively poison animals, leading to dramatic ecological changes in a relatively short period of time."}, {"40c6": "Originally published at www.extremetech.com."}], "content": "The last woolly mammoths in North America didn’t starve — they died of thirst by Joel Hruska Of all the prehistoric megafauna on Earth, few have captured the imagination as thoroughly as the woolly mammoth. Scientists have researched the feasibility of cloning mammoths for decades, but knowing how and why they died out would tell us a great deal about the feasibility of restoring the species today. New research on the last-surviving mammoth population in North America has shown that this particular group probably didn’t die as the result of human hunting or a loss of food. Woolly mammoths generally went extinct between 10,000 and 14,000 years ago, along with the majority of the Pleistocene megafauna. There are, however, two known exceptions. Mammoths persisted on two islands: Wrangel Island, a Russian island in the Arctic Ocean, and Saint Paul Island, off the Alaskan coast. The latter is the last-known location where mammoths survived in North America (3600 BC), while the Wrangel population lived until roughly 2000 BC. The Beringia land bridge. Image by NOAA. The two major reasons for why megafauna like the mammoth went extinct are thought to be climate change and human predation. As the climate warmed, humans expanded into new territories that were formerly blocked by ice or too harsh to sustain life on an ongoing basis. The populations on Saint Paul and Wrangel survived as long as they did partly because they were isolated from humans and weren’t hunted for food. One possible explanation for the Saint Paul mammoths’ eventual extinction would be the glacial melt that created the island in the first place. The GIF above shows how the oceans rose, turning Saint Paul into an island and trapping a group of mammoths in the process. Despite being stuck on a comparatively tiny rock, the mammoths survived for thousands of years — long after the island’s modern shorelines were established. Glacial melt might have isolated the population, but it’s not what killed them off. The research team collected mammoth remains from a cave on St. Paul and took sediment samples from a nearby lake. They then analyzed the sediment samples looking for the spores of fungi that live on the island and preferentially reproduce in animal dung. Elephants are famous for producing mammoth amounts of dung and the sediment samples reflected this up to about 5,600 years ago. Other analyses of the sediment cores showed that vegetation and plant life on the island had remained constant over time as well — the mammoths didn’t die due to a lack of food, either. Thirst, not hunger, is thought to have doomed the mammoth population. The team writes: Instead, the extinction coincided with declining freshwater resources and drier climates between 7,850 and 5,600 y ago, as inferred from sedimentary magnetic susceptibility, oxygen isotopes, and diatom and cladoceran assemblages in a sediment core from a freshwater lake on the island, and stable nitrogen isotopes from mammoth remains. Contrary to other extinction models for the St. Paul mammoth population, this evidence indicates that this mammoth population died out because of the synergistic effects of shrinking island area and freshwater scarcity caused by rising sea levels and regional climate change. Saint Paul island lacks any spring or source for fresh water, which means there was no way to restore its supply. As the climate dried, the amount of water available to the mammoths would have dwindled, while rising sea levels allowed salt water to penetrate the soil from below. The research team conducted a comprehensive analysis on the diatom fossils present within the sediment cores and found evidence that the types of diatoms in the water had changed dramatically over time. Older core samples showed evidence of diatoms — single-celled algae — that preferred freshwater and a depth of several meters. This type of diatom was plentiful in core samples dated to ~5800 BC and became much less common thereafter before vanishing altogether. The diatoms that replaced it are from species that thrive in shallower waters with a higher concentration of salt. In short, the mammoths died out at a time when the island still had enough plants to feed them and space for them to live on, but when the quality and amount of water had precipitously declined. It’s because of this that the research team believes thirst ultimately killed the mammoth population. It’s also a reminder that climate change can damage ecosystems without inundating an area. Freshwater contaminated by saltwater seeping in from the ocean can kill plants and effectively poison animals, leading to dramatic ecological changes in a relatively short period of time. Originally published at www.extremetech.com. ", "name": "299", "child": "299_1299_1", "timestamp": "Aug 10, 2016"}