{"parent": "", "title": "12 Sure Signs Your President Is About To Start A Nuclear War", "author": "Allan Ishac", "sentences": [{"cc0b": "12 Sure Signs Your President Is About To Start A Nuclear War"}, {"996b": "Stay alert for these indications that it’s time to “duck and cover”"}, {"c17a": "Suddenly his attraction to orange doesn’t seem so funny."}, {"3ccc": "If you thought the Cuban missile crisis was scary, President Donald Trump is working on a more contemporary version of unspeakable global doom."}, {"226a": "In fact, the president has already managed to antagonize three of the world’s seven nuclear weapon states in just 80 days — North Korea, China, and Russia. But give him another week."}, {"3606": "In the meantime, remain vigilant as Mr. Trump walks the notorious “10-Steps To World-Ending Nuclear Annihilation” — a series of clumsy actions and diplomatic blunders that Commander Itchy Finger seems hellbent to follow."}, {"2fde": "Here’s how it typically, and terrifyingly, unfolds:"}, {"a8c1": "Step 1: Start by embroiling yourself in a political scandal that’s so perilous, if you don’t distract the nation’s attention with a major existential threat, and do it in a hurry, you’ll surely be impeached and thrown in jail."}, {"fc07": "Step 2. Intimidate a foreign country ruled by an unstable, immature megalomaniac who is possibly more thin-skinned and insane than you are. An ideal candidate would be North Korea."}, {"1baa": "Step 3: Order a nuclear submarine and a heavily-armed Navy armada into the waters off the Korean Peninsula to punctuate your threat."}, {"7d75": "Step 4: Warn North Korea’s principle, no-nonsense ally — China — that if it doesn’t take care of the pudgy, petulant despot, then you will. Use additional saber rattling to further annoy China."}, {"ba26": "Step 5: Say enough nonsensical things to the visiting Chinese president when he visits your Florida estate to make him worry that you’re stupid and naive enough to launch a preemptive military strike at his good friend, Kimchee Pudgeball."}, {"d567": "Step 6: Further fan regional fears by telling China’s president that good trade deals with the U.S. are dependent on him “handling” North Korea. Do this without experienced diplomats at your side, but rather disrespect the humorless, protocol-loving Asian strongman by having your vacuous daughter and faux First Lady Ivanka sitting in on the meeting."}, {"6ed2": "Step 7: A few days before you loudly bang noodle pots in the direction of the North Korean supreme leader, claim you’re just defending innocent babies then, to look like a tough guy, bomb a Middle East tinderbox state with Tomahawk cruise missiles. Make sure you have no follow-up plan or coherent strategy so that every adversarial nation, along with most of your allies, agrees that you are an inexperienced, unpredictable, volatile, untrustworthy fool."}, {"fb58": "Step 8: For maximum drama, be sure that the tinderbox nation is solidly allied with a longtime U.S. enemy run by yet another psychopathic, murderous loose cannon. Vladimir Putin fits this bill nicely. Ignore the reality that the Russian loose cannon is smarter than you (and owns you), and that he spent most of his career as the head of a ruthless state security force that tortured and poisoned its enemies while you were off building golf courses and leering at beauty queens."}, {"674b": "Step 9: On the day you send your Navy carrier strike group to jangle its keys on the doorstep of the paranoid Kimchee Pudgeball, send your officially emasculated Secretary of State to Moscow to mumble some insults at the murderous Russian dictator and incite more unnecessary trouble."}, {"5d93": "Step 10: Go on national TV and talk like a bombastic windbag about how you have a big ass military machine and aren’t afraid to use it. Remind the world that you were the one who asked your military advisers in the days before you became president why you had an enormous nuclear arsenal if you couldn’t at least pop off some of the “smaller nukes?”"}, {"418a": "Step 11: Tell your children to grab their children and head to the underground bunker in North Dakota and not come out until you tap on the 14-foot-thick, lead-lined steel doors with your pitching wedge to let them know the coast is clear and the radiation fallout has dropped below lethal levels. Bring four layers of down jackets per family member for the extended nuclear winter, along with 185,000 frozen tacos and a shipping container full of Cheetos."}, {"1d75": "Step 12: Declare yourself the greatest, and last, President of the United States, but only after you’ve rejoiced that all your alimony and child-support payments are now voided, followed by one brief hissy fit when you realize you’ve nuked your favorite hairdresser."}, {"337d": "****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment."}, {"25a5": "And click here for my most popular post, or at least one I liked writing a whole lot."}], "content": "12 Sure Signs Your President Is About To Start A Nuclear War Stay alert for these indications that it’s time to “duck and cover” Suddenly his attraction to orange doesn’t seem so funny. If you thought the Cuban missile crisis was scary, President Donald Trump is working on a more contemporary version of unspeakable global doom. In fact, the president has already managed to antagonize three of the world’s seven nuclear weapon states in just 80 days — North Korea, China, and Russia. But give him another week. In the meantime, remain vigilant as Mr. Trump walks the notorious “10-Steps To World-Ending Nuclear Annihilation” — a series of clumsy actions and diplomatic blunders that Commander Itchy Finger seems hellbent to follow. Here’s how it typically, and terrifyingly, unfolds: Step 1: Start by embroiling yourself in a political scandal that’s so perilous, if you don’t distract the nation’s attention with a major existential threat, and do it in a hurry, you’ll surely be impeached and thrown in jail. Step 2. Intimidate a foreign country ruled by an unstable, immature megalomaniac who is possibly more thin-skinned and insane than you are. An ideal candidate would be North Korea. Step 3: Order a nuclear submarine and a heavily-armed Navy armada into the waters off the Korean Peninsula to punctuate your threat. Step 4: Warn North Korea’s principle, no-nonsense ally — China — that if it doesn’t take care of the pudgy, petulant despot, then you will. Use additional saber rattling to further annoy China. Step 5: Say enough nonsensical things to the visiting Chinese president when he visits your Florida estate to make him worry that you’re stupid and naive enough to launch a preemptive military strike at his good friend, Kimchee Pudgeball. Step 6: Further fan regional fears by telling China’s president that good trade deals with the U.S. are dependent on him “handling” North Korea. Do this without experienced diplomats at your side, but rather disrespect the humorless, protocol-loving Asian strongman by having your vacuous daughter and faux First Lady Ivanka sitting in on the meeting. Step 7: A few days before you loudly bang noodle pots in the direction of the North Korean supreme leader, claim you’re just defending innocent babies then, to look like a tough guy, bomb a Middle East tinderbox state with Tomahawk cruise missiles. Make sure you have no follow-up plan or coherent strategy so that every adversarial nation, along with most of your allies, agrees that you are an inexperienced, unpredictable, volatile, untrustworthy fool. Step 8: For maximum drama, be sure that the tinderbox nation is solidly allied with a longtime U.S. enemy run by yet another psychopathic, murderous loose cannon. Vladimir Putin fits this bill nicely. Ignore the reality that the Russian loose cannon is smarter than you (and owns you), and that he spent most of his career as the head of a ruthless state security force that tortured and poisoned its enemies while you were off building golf courses and leering at beauty queens. Step 9: On the day you send your Navy carrier strike group to jangle its keys on the doorstep of the paranoid Kimchee Pudgeball, send your officially emasculated Secretary of State to Moscow to mumble some insults at the murderous Russian dictator and incite more unnecessary trouble. Step 10: Go on national TV and talk like a bombastic windbag about how you have a big ass military machine and aren’t afraid to use it. Remind the world that you were the one who asked your military advisers in the days before you became president why you had an enormous nuclear arsenal if you couldn’t at least pop off some of the “smaller nukes?” Step 11: Tell your children to grab their children and head to the underground bunker in North Dakota and not come out until you tap on the 14-foot-thick, lead-lined steel doors with your pitching wedge to let them know the coast is clear and the radiation fallout has dropped below lethal levels. Bring four layers of down jackets per family member for the extended nuclear winter, along with 185,000 frozen tacos and a shipping container full of Cheetos. Step 12: Declare yourself the greatest, and last, President of the United States, but only after you’ve rejoiced that all your alimony and child-support payments are now voided, followed by one brief hissy fit when you realize you’ve nuked your favorite hairdresser. **** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post, or at least one I liked writing a whole lot. ", "name": "306", "child": "306_1\t306_2\t306_3\t306_4\t306_5\t306_6\t306_7\t306_8\t306_9\t306_10\t306_11\t306_12\t306_13\t306_14\t306_15\t306_16\t306_17\t306_18\t306_19\t306_20\t306_21\t306_22\t306_23\t306_24\t306_25", "timestamp": "Apr 14"}