{"parent": "", "title": "Trump Tweets: “Uncle Sam…Sad! We Must Replace With New Donnie Warbucks Logo”", "author": "Allan Ishac", "sentences": [{"289e": "Truth In Satire"}, {"3bf5": "Trump Tweets: “Uncle Sam…Sad! We Must Replace With New Donnie Warbucks Logo”"}, {"edd2": "President apparently unaware that Tax March logo depicting him stealing taxpayer money is neither flattering nor favorable"}, {"1b75": "Massive tax day protests intended to pressure President Trump into releasing his tax returns were organized in 100 cities across the country on Saturday."}, {"c662": "A centerpiece of the marches was an altered image of the top-hatted “Mr. Monopoly” character, depicting Donald Trump absconding with taxpayers’ money."}, {"faa0": "But, apparently, the amusing image that was designed to taunt the president, had no such effect — because he mistakenly thought it was a compliment, developed as a tribute to his pro-business, ultra-capitalist policies."}, {"f71f": "President Trump hopes to replace this image of Uncle Sam, used as national symbol since the 1830’s, with an image of himself stealing a bag of money."}, {"fd71": "He was so confused, in fact, that he immediately signed an executive order instructing all government agencies to dump the iconic “Uncle Sam” image and replace it with, what he called “the new, cool Donnie Warbucks logo.”"}, {"1dc8": "In a Mar-A-Lago press briefing late Saturday afternoon, a beaming President Trump held up an image of the Mr. Monopoly character with his own face photoshopped in place, and proudly called it, “the new mascot for the United States.” Of course, amused critics immediately started referring to it as “the new ass-cot of the United States.”"}, {"82dc": "The famous Uncle Sam image that the president is hoping to force out of existence has been used extensively since the 1830’s and is beloved by many Americans."}, {"6313": "This poster was used to rally Tax March protesters across the nation on Saturday."}, {"2671": "“It is highly unusual for a president to try to dispense with a venerated national symbol and iconic American image — especially one that was used to generate support for war bonds in both World Wars I and II,” said Doris Kearns Goodwin, a well-known American historian and author. “I can’t imagine that the president’s executive order is going to get a positive reception. And, frankly, I am not sure President Trump would be pushing for this change if he fully understood the implications of the image he seems to be championing.”"}, {"2949": "U.S. Historian Doris Kearns Goodwin fears that Donald Trump does not realize he is being mocked, ridiculed, scorned, sneered at, and derided. (Credit: doriskearnsgoodwin.com)"}, {"ae9a": "Asked if the president was aware that the “Donnie Warbucks” illustration that he is pressuring government institutions to embrace is a sarcastic piece of art developed to ridicule him personally and deride him politically, White House Press Secretary Sean Spicer said, “The president knows exactly when he’s being mocked and when he’s being lauded, and in this case, it is clearly a patriotic salute to his business acumen and billionaire status. He loves it. Case closed!”"}, {"c7d6": "Organizers at TaxMarch.org say they are eager to help the president parody himself and will be heavily promoting the “Donnie Warbucks” image across the country and around the world."}, {"780f": "****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment."}, {"25a5": "And click here for my most popular post, or at least one I liked writing a whole lot."}, {"718f": "Thank you."}, {"2fde": "–AI"}], "content": "Truth In Satire Trump Tweets: “Uncle Sam…Sad! We Must Replace With New Donnie Warbucks Logo” President apparently unaware that Tax March logo depicting him stealing taxpayer money is neither flattering nor favorable Massive tax day protests intended to pressure President Trump into releasing his tax returns were organized in 100 cities across the country on Saturday. A centerpiece of the marches was an altered image of the top-hatted “Mr. Monopoly” character, depicting Donald Trump absconding with taxpayers’ money. But, apparently, the amusing image that was designed to taunt the president, had no such effect — because he mistakenly thought it was a compliment, developed as a tribute to his pro-business, ultra-capitalist policies. President Trump hopes to replace this image of Uncle Sam, used as national symbol since the 1830’s, with an image of himself stealing a bag of money. He was so confused, in fact, that he immediately signed an executive order instructing all government agencies to dump the iconic “Uncle Sam” image and replace it with, what he called “the new, cool Donnie Warbucks logo.” In a Mar-A-Lago press briefing late Saturday afternoon, a beaming President Trump held up an image of the Mr. Monopoly character with his own face photoshopped in place, and proudly called it, “the new mascot for the United States.” Of course, amused critics immediately started referring to it as “the new ass-cot of the United States.” The famous Uncle Sam image that the president is hoping to force out of existence has been used extensively since the 1830’s and is beloved by many Americans. This poster was used to rally Tax March protesters across the nation on Saturday. “It is highly unusual for a president to try to dispense with a venerated national symbol and iconic American image — especially one that was used to generate support for war bonds in both World Wars I and II,” said Doris Kearns Goodwin, a well-known American historian and author. “I can’t imagine that the president’s executive order is going to get a positive reception. And, frankly, I am not sure President Trump would be pushing for this change if he fully understood the implications of the image he seems to be championing.” U.S. Historian Doris Kearns Goodwin fears that Donald Trump does not realize he is being mocked, ridiculed, scorned, sneered at, and derided. (Credit: doriskearnsgoodwin.com) Asked if the president was aware that the “Donnie Warbucks” illustration that he is pressuring government institutions to embrace is a sarcastic piece of art developed to ridicule him personally and deride him politically, White House Press Secretary Sean Spicer said, “The president knows exactly when he’s being mocked and when he’s being lauded, and in this case, it is clearly a patriotic salute to his business acumen and billionaire status. He loves it. Case closed!” Organizers at TaxMarch.org say they are eager to help the president parody himself and will be heavily promoting the “Donnie Warbucks” image across the country and around the world. **** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post, or at least one I liked writing a whole lot. Thank you. –AI ", "name": "310", "child": "310_1\t310_2\t310_3\t310_4\t310_5\t310_6\t310_7\t310_8\t310_9", "timestamp": "Apr 16"}