{"parent": "", "title": "People Think I’m Creepy & I Don’t Know How To Fix It", "author": "Duke Harten", "sentences": [{"4874": "People Think I’m Creepy & I Don’t Know How To Fix It"}, {"c8d0": "It’s worse than just being ‘awkward.'"}, {"2a35": "Honest to God, the last thing I want to do is make women feel uncomfortable. Throw me a sign you’re not interested, and I’m outta there. No lingering come-ons, no can-I-buy-you-a-drink, none of that. My intentions are pure (ish). It’s just, sometimes I bungle the delivery."}, {"f9c9": "As a bachelor in his mid-20s, I’m often on the make. Ain’t nothing wrong with that — everybody is entitled to the pursuit of love. Here’s the thing about that delicate pursuit: people want to be approached only by people they want to be approached by."}, {"9eef": "This dismal truth stymies the romantic aspirations of men and women alike. It’s the reason that pick-up artist literature like “The Game” remains popular — people will always seek to clamber over lofty social ramparts, and pick-up-artist wisdom promises a skeleton key to anybody’s pants."}, {"7f51": "I, like many other skeevy 18-year-olds, went through a phase where I idolized these dudes (and ladies) who made a living through seduction. Thank God I grew out of it. Now I’m a much tamer sort of creepy — a reclusive right-swiper, if you will. Before that lesson got learnt, though, my studies imbued me with a special sort of creepiness."}, {"4a31": "Here are a few of my cringe-ier moments."}, {"8702": "Freshman year of college. Small English class, maybe ten or eleven kids. Most of them painfully enthusiastic. I recognize a kindred spirit in the sullen girl who sits in the back row. We exchange a few words here and there, and I deduce that our shared disdain for our classmates’ enthusiasm indicates a mutual attraction. (Bad deduction.)"}, {"6dc4": "One day — while the teacher is busy a-lecturin’ — I slide the young lady a note that reads: “Why don’t you give me your number so I can hit on you properly sometime?” She snorts derisively and ignores the note."}, {"91d7": "Give me a break. I was 18."}, {"7600": "‘Donnie Darko’"}, {"8bf2": "Geology class, junior year. Cute girl in the front row. I’m scheduled to miss three classes, so I ask her if I could copy her notes when I get back. A genuine request, but I’m so nervous I turn red and choke on the question."}, {"9602": "She politely declines. Fair enough — I’d want nothing to do with me either. Not great, at this point, but not creepy yet."}, {"95ca": "I see her a few weeks later on Newbury Street. I try to smile (cue leery grin) and go “It’s you! If I fail the exam, it’ll be all your fault.” This is meant to be funny and flirty, a way to recover from my weirdness earlier. Instead, it comes out intense and threatening. Before I can apologize, the girl literally runs away from me."}, {"dbbe": "I start googling “How to do seppuku.”"}, {"4d1b": "End of college. I make friends with a fellow English major. She’s sharp and funny, but afflicted with a boyfriend. Word on the street is the guy’s a jerk, though, so I shelve my ethics. Might be a great story to tell our kids, I reason."}, {"3d9d": "She finds my attempted courtship flattering and funny. Not threatening, not creepy. I feel like a poor man’s Ryan Gosling in “Crazy Stupid Love”— in fact, I’d recently watched that movie and gone out to buy myself an entirely new wardrobe. I’m brimming with confidence."}, {"4249": "Me, not NOT being creepy. | photo: Jillian Wheeler"}, {"32a6": "She doesn’t bite, though. Girl has morals (and taste). One day she parries my advances by saying she has an extra credit lecture to go to that evening — if I really want to hang out, I can come to that."}, {"3350": "Well, little does she know I’m not above the occasional grand creepy gesture. I show up, but she fails to notice me. She’s had her nails painted alternating colors. I wait forty minutes and then text her, “What’s with the nails?”"}, {"c4d5": "She finds me in the crowd and replies: “Omg. So creepy.”"}, {"455e": "We went out for a beer that night, but then she moved to Philadelphia."}, {"7237": "Friend’s birthday party at a bar. Amy and I have just finished Season 3 of “Peaky Blinders,” which makes us think we can drink nine glasses of neat whiskey apiece."}, {"d144": "‘Peaky Blinders’"}, {"e05d": "“I think that girl is looking at me,” I say in a Birmingham accent."}, {"d534": "“She’s cute,” Amy says in a Birmingham accent."}, {"c7d8": "“You should give her your card,” says Dan, in an American accent."}, {"a57f": "We pay our tab and push through the sea of people towards the door. When I reach the girl, I stand swaying by her chair, unsure of what to say. In that moment I realize she’s in the middle of a conversation with two tall, muscular men who each loom six inches taller than me."}, {"e109": "Their conversation halts. Without a word I place my card on the bar in front of her, nod to the gentlemen and turn on my heel to go."}, {"f5e1": "Creepy mute greeting card designer does it again."}, {"d298": "I mistake a barista’s casual friendliness for intense eye-fucking. I have a friend who used to work at a different branch of the same coffee shop. Forty minutes scrolling through mutual friends unveils the barista’s identity."}, {"aa8c": "Drunk on my P.I. skills (and a bottle of wine), I friend-request the girl, then ask her on a date via Facebook Messenger. Or rather, I ask her to come to my apartment. She suggests we go somewhere in public first."}, {"33ea": "Call me Creepy Encyclopedia Brown."}, {"341f": "It’s not like I don’t know how to be normal. Sometimes I simply miscalibrate. I linger for a moment too long, I put in a bit too much effort, I find a cute barista on Facebook even though I’m not supposed to know her name and we have no mutual friends. That sort of thing."}, {"acb1": "If you liked this post, mail me an envelope full of your hair."}], "content": "People Think I’m Creepy & I Don’t Know How To Fix It It’s worse than just being ‘awkward.' Honest to God, the last thing I want to do is make women feel uncomfortable. Throw me a sign you’re not interested, and I’m outta there. No lingering come-ons, no can-I-buy-you-a-drink, none of that. My intentions are pure (ish). It’s just, sometimes I bungle the delivery. As a bachelor in his mid-20s, I’m often on the make. Ain’t nothing wrong with that — everybody is entitled to the pursuit of love. Here’s the thing about that delicate pursuit: people want to be approached only by people they want to be approached by. This dismal truth stymies the romantic aspirations of men and women alike. It’s the reason that pick-up artist literature like “The Game” remains popular — people will always seek to clamber over lofty social ramparts, and pick-up-artist wisdom promises a skeleton key to anybody’s pants. I, like many other skeevy 18-year-olds, went through a phase where I idolized these dudes (and ladies) who made a living through seduction. Thank God I grew out of it. Now I’m a much tamer sort of creepy — a reclusive right-swiper, if you will. Before that lesson got learnt, though, my studies imbued me with a special sort of creepiness. Here are a few of my cringe-ier moments. Freshman year of college. Small English class, maybe ten or eleven kids. Most of them painfully enthusiastic. I recognize a kindred spirit in the sullen girl who sits in the back row. We exchange a few words here and there, and I deduce that our shared disdain for our classmates’ enthusiasm indicates a mutual attraction. (Bad deduction.) One day — while the teacher is busy a-lecturin’ — I slide the young lady a note that reads: “Why don’t you give me your number so I can hit on you properly sometime?” She snorts derisively and ignores the note. Give me a break. I was 18. ‘Donnie Darko’ Geology class, junior year. Cute girl in the front row. I’m scheduled to miss three classes, so I ask her if I could copy her notes when I get back. A genuine request, but I’m so nervous I turn red and choke on the question. She politely declines. Fair enough — I’d want nothing to do with me either. Not great, at this point, but not creepy yet. I see her a few weeks later on Newbury Street. I try to smile (cue leery grin) and go “It’s you! If I fail the exam, it’ll be all your fault.” This is meant to be funny and flirty, a way to recover from my weirdness earlier. Instead, it comes out intense and threatening. Before I can apologize, the girl literally runs away from me. I start googling “How to do seppuku.” End of college. I make friends with a fellow English major. She’s sharp and funny, but afflicted with a boyfriend. Word on the street is the guy’s a jerk, though, so I shelve my ethics. Might be a great story to tell our kids, I reason. She finds my attempted courtship flattering and funny. Not threatening, not creepy. I feel like a poor man’s Ryan Gosling in “Crazy Stupid Love”— in fact, I’d recently watched that movie and gone out to buy myself an entirely new wardrobe. I’m brimming with confidence. Me, not NOT being creepy. | photo: Jillian Wheeler She doesn’t bite, though. Girl has morals (and taste). One day she parries my advances by saying she has an extra credit lecture to go to that evening — if I really want to hang out, I can come to that. Well, little does she know I’m not above the occasional grand creepy gesture. I show up, but she fails to notice me. She’s had her nails painted alternating colors. I wait forty minutes and then text her, “What’s with the nails?” She finds me in the crowd and replies: “Omg. So creepy.” We went out for a beer that night, but then she moved to Philadelphia. Friend’s birthday party at a bar. Amy and I have just finished Season 3 of “Peaky Blinders,” which makes us think we can drink nine glasses of neat whiskey apiece. ‘Peaky Blinders’ “I think that girl is looking at me,” I say in a Birmingham accent. “She’s cute,” Amy says in a Birmingham accent. “You should give her your card,” says Dan, in an American accent. We pay our tab and push through the sea of people towards the door. When I reach the girl, I stand swaying by her chair, unsure of what to say. In that moment I realize she’s in the middle of a conversation with two tall, muscular men who each loom six inches taller than me. Their conversation halts. Without a word I place my card on the bar in front of her, nod to the gentlemen and turn on my heel to go. Creepy mute greeting card designer does it again. I mistake a barista’s casual friendliness for intense eye-fucking. I have a friend who used to work at a different branch of the same coffee shop. Forty minutes scrolling through mutual friends unveils the barista’s identity. Drunk on my P.I. skills (and a bottle of wine), I friend-request the girl, then ask her on a date via Facebook Messenger. Or rather, I ask her to come to my apartment. She suggests we go somewhere in public first. Call me Creepy Encyclopedia Brown. It’s not like I don’t know how to be normal. Sometimes I simply miscalibrate. I linger for a moment too long, I put in a bit too much effort, I find a cute barista on Facebook even though I’m not supposed to know her name and we have no mutual friends. That sort of thing. If you liked this post, mail me an envelope full of your hair. ", "name": "311", "child": "311_1\t311_2\t311_3\t311_4\t311_5\t311_6\t311_7\t311_8\t311_9\t311_10\t311_11\t311_12\t311_13\t311_14\t311_15\t311_16\t311_17\t311_18311_1\t311_2\t311_3\t311_4\t311_5\t311_6\t311_7\t311_8\t311_9\t311_10\t311_11\t311_12\t311_13\t311_14\t311_15\t311_16\t311_17\t311_18311_1\t311_2\t311_3\t311_4\t311_5\t311_6\t311_7\t311_8\t311_9\t311_10\t311_11\t311_12\t311_13\t311_14\t311_15\t311_16\t311_17\t311_18311_1\t311_2\t311_3\t311_4\t311_5\t311_6\t311_7\t311_8\t311_9\t311_10\t311_11\t311_12\t311_13\t311_14\t311_15\t311_16\t311_17\t311_18311_1\t311_2\t311_3\t311_4\t311_5\t311_6\t311_7\t311_8\t311_9\t311_10\t311_11\t311_12\t311_13\t311_14\t311_15\t311_16\t311_17\t311_18311_1\t311_2\t311_3\t311_4\t311_5\t311_6\t311_7\t311_8\t311_9\t311_10\t311_11\t311_12\t311_13\t311_14\t311_15\t311_16\t311_17\t311_18311_1\t311_2\t311_3\t311_4\t311_5\t311_6\t311_7\t311_8\t311_9\t311_10\t311_11\t311_12\t311_13\t311_14\t311_15\t311_16\t311_17\t311_18", "timestamp": "Apr 6"}