{"parent": "", "title": "20 Concerns On Jared Kushner’s Mind Every Time He Gets Another Promotion", "author": "Allan Ishac", "sentences": [{"bacd": "20 Concerns On Jared Kushner’s Mind Every Time He Gets Another Promotion"}, {"c72e": "A continuation of “The Kurious Kase of the Koddled Kushner” series that began yesterday with this post"}, {"8884": "In yesterday’s post, “20 Logical Explanations For Why Donald Trump Keeps Promoting His Unqualified Son-In-Law,” we explored the so-called “Kushner Kuestion” from the point of view of the president."}, {"f7ea": "Today, we’ll look at the same political phenomenon from Jared’s perspective."}, {"c16b": "Here are 20 dark thoughts that run through the young Pharisee’s mind each time his father-in-law bestows upon him yet another excessive and groundless political promotion:"}, {"60e4": "2. If he thinks I’m going to stay married to his bimbo daughter for the rest of my life, he’s got Silly Putty for brains. Once the kids get through high school, I’m outta here."}, {"c01f": "3. He’s setting me up to have that dimwit Donnie Jr. blast me with an elephant rifle, I can feel it."}, {"8c98": "4. I never really wanted to help the old man win, I just wanted to make sure Chris Christie never saw the inside of the Oval Office."}, {"936f": "5. Wait a second — I’ve become to Trump what John Ehrlichman was to Nixon. And that stupid patsy went to prison!"}, {"b128": "6. I am in such hot water with my rabbi."}, {"084e": "7. Now he makes me captain of the White House softball team, like it’s some big honor?! I don’t even like softball."}, {"b0b9": "8. If The Orange Accident keeps promoting me, Bannon’s going to send that Stephen Miller cyborg creature into my bedroom at night with both his finger lasers blazing."}, {"acc0": "9. How do you tell your deranged father-in-law, “No thanks, Dad, Chairman of the Joint Chiefs of Staff is going too far?”"}, {"055f": "10. Geezus, I told him from the beginning that it didn’t matter how many promotions he gave me, he could only sleep with Ivanka once a week."}, {"1e04": "11. When he said he wanted his closest family members by his side, I didn’t think he meant in his side pocket."}, {"cf89": "12. Ivanka said he couldn’t read or write, but I thought she just meant he hates to review tenant leases, like everyone else on the planet."}, {"1659": "13. How does a guy with a 24-handicap have the audacity to run for President of the United States?"}, {"9c99": "14. He promised me that we would never win, that it would just be a way for me to get my own TV show. And now this! Fuck, fuck, fuck!"}, {"ce58": "15. I should have listened to my mother when she said, “Are you crazy marrying that German shiksa? Her father makes Goering look like a Vienna choir boy.”"}, {"2970": "16. Having so much power in politics makes me want to go back and get a legitimate college degree."}, {"4d7d": "17. I gotta tell Ivanka at dinner tonight that we’re moving back to Russia. It’s just not safe here anymore."}, {"5b2e": "18. I should have known that when Spitzer and Weiner went down no New York Jew would ever become president — now I’m in way over my head."}, {"2065": "19. This does not feel like the right time to tell Adolf Twitler that I’m a lifelong Democrat and just wanted to hang around his campaign to meet Hillary."}, {"dcc0": "20. The adult in me says bail the fuck out right now. The kid in me says just a few more rides on Air Force One."}, {"c47e": "****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment."}, {"25a5": "And click here for my most popular post, or at least one I liked writing a whole lot."}, {"e537": "— AI"}], "content": "20 Concerns On Jared Kushner’s Mind Every Time He Gets Another Promotion A continuation of “The Kurious Kase of the Koddled Kushner” series that began yesterday with this post In yesterday’s post, “20 Logical Explanations For Why Donald Trump Keeps Promoting His Unqualified Son-In-Law,” we explored the so-called “Kushner Kuestion” from the point of view of the president. Today, we’ll look at the same political phenomenon from Jared’s perspective. Here are 20 dark thoughts that run through the young Pharisee’s mind each time his father-in-law bestows upon him yet another excessive and groundless political promotion: 2. If he thinks I’m going to stay married to his bimbo daughter for the rest of my life, he’s got Silly Putty for brains. Once the kids get through high school, I’m outta here. 3. He’s setting me up to have that dimwit Donnie Jr. blast me with an elephant rifle, I can feel it. 4. I never really wanted to help the old man win, I just wanted to make sure Chris Christie never saw the inside of the Oval Office. 5. Wait a second — I’ve become to Trump what John Ehrlichman was to Nixon. And that stupid patsy went to prison! 6. I am in such hot water with my rabbi. 7. Now he makes me captain of the White House softball team, like it’s some big honor?! I don’t even like softball. 8. If The Orange Accident keeps promoting me, Bannon’s going to send that Stephen Miller cyborg creature into my bedroom at night with both his finger lasers blazing. 9. How do you tell your deranged father-in-law, “No thanks, Dad, Chairman of the Joint Chiefs of Staff is going too far?” 10. Geezus, I told him from the beginning that it didn’t matter how many promotions he gave me, he could only sleep with Ivanka once a week. 11. When he said he wanted his closest family members by his side, I didn’t think he meant in his side pocket. 12. Ivanka said he couldn’t read or write, but I thought she just meant he hates to review tenant leases, like everyone else on the planet. 13. How does a guy with a 24-handicap have the audacity to run for President of the United States? 14. He promised me that we would never win, that it would just be a way for me to get my own TV show. And now this! Fuck, fuck, fuck! 15. I should have listened to my mother when she said, “Are you crazy marrying that German shiksa? Her father makes Goering look like a Vienna choir boy.” 16. Having so much power in politics makes me want to go back and get a legitimate college degree. 17. I gotta tell Ivanka at dinner tonight that we’re moving back to Russia. It’s just not safe here anymore. 18. I should have known that when Spitzer and Weiner went down no New York Jew would ever become president — now I’m in way over my head. 19. This does not feel like the right time to tell Adolf Twitler that I’m a lifelong Democrat and just wanted to hang around his campaign to meet Hillary. 20. The adult in me says bail the fuck out right now. The kid in me says just a few more rides on Air Force One. **** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post, or at least one I liked writing a whole lot. — AI ", "name": "312", "child": "312_1\t312_2\t312_3\t312_4\t312_5\t312_6\t312_7\t312_8\t312_9\t312_10\t312_11\t312_12\t312_13\t312_14\t312_15\t312_16\t312_17\t312_18\t312_19\t312_20\t312_21\t312_22\t312_23\t312_24\t312_25", "timestamp": "Apr 11"}