{"parent": "", "title": "5 further pitches by the creatives behind that Pepsi ad", "author": "Tom Mitchell", "sentences": [{"85b0": "5 further pitches by the creatives behind that Pepsi ad"}, {"a00b": "1. Spotify resolves the Israel/Palestine conflict."}, {"472f": "The Jerusalem skyline. An Israeli Arab and an Israeli Jew find themselves at the same party. They look at each other with suspicion. The DJ navigates Spotify on his laptop & selects ‘Come on, Eileen’ by Dexy’s Midnight Runners. The chorus blasts out and we see the Arab and Jew put their arms around each other. They dance, smiling."}, {"806b": "2. Uber engages with wealth inequality."}, {"7d6d": "A politician (Kevin Spacey?) is in a chauffeur-driven Mercedes Benz. He’s writing a speech with a thick fountain pen. The car breaks down. He calls for an Uber with his gold iPhone. The Uber arrives, we see the driver’s thoughtful eyes in the rear mirror. The Uber driver alters the route. The car passes through a poor area. The politician notices. There are shots of children playing football. The politician smiles. He draws a line through his speech, winds down the window, and sticks a thumb up. The Uber driver smiles. ‘Revolution’ by The Beatles plays."}, {"ffd9": "3. Pop Tarts support gay rights"}, {"fc39": "It’s a POV shot as we walk down Main Street. Various men cat-call and whistle. We assume that we’re a sexy woman. We pass a construction site, where builders remove their yellow helmets and shout sexual obscenities, objectifying the protagonist. We’re obviously very (conventionally) attractive. Finally, we enter an apartment. We approach a kitchen cupboard and prepare a pair of Pop Tarts. They are soon toasted. As the protagonist raises a tart to their mouth, we approach a mirror and we see, the big reveal, that WE ARE A MAN and, if the budget stretches, Chris Pratt."}, {"b084": "4. McDonald’s combats childhood illiteracy"}, {"6f70": "A feral-looking child leaves a rural infant school. He walks alone, behind large groups of children reading novels. When he arrives home, his mother asks how school was. He doesn’t answer. Instead, he tries to pronounce the phrase ‘final warning’ on a manila envelope. The mother, with a loving look, suggests they go to McDonald’s. They collect food from a drive-through and park up. The boy traces his finger across his cheeseburger wrapper and, hesitantly, says ‘cheeseburger’. His mother puts aside her Diet Coke and hugs him. We fade to the phrase ‘I’m lovin it’. Soft piano music."}, {"9202": "5. VW and Islamophobia"}, {"8c20": "We watch a man, with a full beard, pray in a mosque. There is Middle Eastern music playing. The man leaves the mosque and crosses the road to his car. We’re in a small American town. At the car are a group of white skinheads. One of them has a cross tattooed on his forehead. They eye the Muslim man with suspicion. He gets into his car. The tension is almost unbearable. The meanest looking skinhead breaks from the group and taps his knuckles against the driver’s window. The Muslim winds down the glass. The skinhead leans in."}, {"4c03": "‘Nice wheels, buddy,’ he says."}, {"7f64": "The Muslim man smiles."}, {"ee61": "(Advertising execs: DM me. Others: Please click the ❤ below to recommend.)"}], "content": "5 further pitches by the creatives behind that Pepsi ad 1. Spotify resolves the Israel/Palestine conflict. The Jerusalem skyline. An Israeli Arab and an Israeli Jew find themselves at the same party. They look at each other with suspicion. The DJ navigates Spotify on his laptop & selects ‘Come on, Eileen’ by Dexy’s Midnight Runners. The chorus blasts out and we see the Arab and Jew put their arms around each other. They dance, smiling. 2. Uber engages with wealth inequality. A politician (Kevin Spacey?) is in a chauffeur-driven Mercedes Benz. He’s writing a speech with a thick fountain pen. The car breaks down. He calls for an Uber with his gold iPhone. The Uber arrives, we see the driver’s thoughtful eyes in the rear mirror. The Uber driver alters the route. The car passes through a poor area. The politician notices. There are shots of children playing football. The politician smiles. He draws a line through his speech, winds down the window, and sticks a thumb up. The Uber driver smiles. ‘Revolution’ by The Beatles plays. 3. Pop Tarts support gay rights It’s a POV shot as we walk down Main Street. Various men cat-call and whistle. We assume that we’re a sexy woman. We pass a construction site, where builders remove their yellow helmets and shout sexual obscenities, objectifying the protagonist. We’re obviously very (conventionally) attractive. Finally, we enter an apartment. We approach a kitchen cupboard and prepare a pair of Pop Tarts. They are soon toasted. As the protagonist raises a tart to their mouth, we approach a mirror and we see, the big reveal, that WE ARE A MAN and, if the budget stretches, Chris Pratt. 4. McDonald’s combats childhood illiteracy A feral-looking child leaves a rural infant school. He walks alone, behind large groups of children reading novels. When he arrives home, his mother asks how school was. He doesn’t answer. Instead, he tries to pronounce the phrase ‘final warning’ on a manila envelope. The mother, with a loving look, suggests they go to McDonald’s. They collect food from a drive-through and park up. The boy traces his finger across his cheeseburger wrapper and, hesitantly, says ‘cheeseburger’. His mother puts aside her Diet Coke and hugs him. We fade to the phrase ‘I’m lovin it’. Soft piano music. 5. VW and Islamophobia We watch a man, with a full beard, pray in a mosque. There is Middle Eastern music playing. The man leaves the mosque and crosses the road to his car. We’re in a small American town. At the car are a group of white skinheads. One of them has a cross tattooed on his forehead. They eye the Muslim man with suspicion. He gets into his car. The tension is almost unbearable. The meanest looking skinhead breaks from the group and taps his knuckles against the driver’s window. The Muslim winds down the glass. The skinhead leans in. ‘Nice wheels, buddy,’ he says. The Muslim man smiles. (Advertising execs: DM me. Others: Please click the ❤ below to recommend.) ", "name": "313", "child": "313_1\t313_2\t313_3\t313_4\t313_5\t313_6\t313_7\t313_8\t313_9\t313_10\t313_11\t313_12\t313_13\t313_14\t313_15\t313_16\t313_17\t313_18\t313_19\t313_20\t313_21\t313_22\t313_23\t313_24\t313_25313_1\t313_2\t313_3\t313_4\t313_5\t313_6\t313_7\t313_8\t313_9\t313_10\t313_11\t313_12\t313_13\t313_14\t313_15\t313_16\t313_17\t313_18\t313_19\t313_20\t313_21\t313_22\t313_23\t313_24\t313_25313_1\t313_2\t313_3\t313_4\t313_5\t313_6\t313_7\t313_8\t313_9\t313_10\t313_11\t313_12\t313_13\t313_14\t313_15\t313_16\t313_17\t313_18\t313_19\t313_20\t313_21\t313_22\t313_23\t313_24\t313_25", "timestamp": "Apr 6"}