{"parent": "", "title": "Remarkably inexpensive mission could find planets around the nearest sun-like stars", "author": "Ethan Siegel", "sentences": [{"daa5": "An artist’s rendition of a potentially habitable exoplanet orbiting a sun-like star. Image credit: NASA Ames / JPL-Caltech."}, {"528d": "Remarkably inexpensive mission could find planets around the nearest sun-like stars"}, {"a202": "Alpha Centauri A and B are just 4.37 light years away. Do they have planets around them? And possibly life? We just might find out!"}, {"a70c": "“Resources exist to be consumed. And consumed they will be, if not by this generation then by some future. By what right does this forgotten future seek to deny us our birthright?” -Sid Meier’s Alpha Centauri"}, {"1b79": "Imagine if you were light years away, orbiting another star in our galaxy. What would it take, looking at our Solar System from that great distance, to determine whether one of our worlds was an inhabited planet, teeming with life? Even if Earth were no more than a single pixel in a telescope, you could still do it. Reflecting the light from the Sun, if you could image our world directly, you could tell that:"}, {"f49b": "If someone from light years away could do that to Earth, then it stands to reason we, here on Earth, could do that to another star. And as luck would have it, the closest star system has two perfect candidates for this technique: Alpha Centauri A and Alpha Centauri B."}, {"11f9": "The two sun-like stars, Alpha Centauri A and B, are located just 4.37 light years away from us and orbit one another with high eccentricity, coming as close as Saturn and reaching distances greater than Pluto for comparison. Image credit: ESA/Hubble & NASA."}, {"82ee": "The Alpha Centauri system is a trinary star system, with Alpha Centauri A the same type as our Sun, Alpha Centauri B a slightly cooler, yellow/orange star, and Proxima Centauri a much cooler, smaller red dwarf. Sure, Proxima Centauri is a little closer: 4.24 light years away instead of the 4.37 light years that the other two are, but Alpha Centauri A and B are much more luminous, making their habitable zone planets more distant from the parent star, and hence, much more easily visible. Any potentially habitable planets — rocky worlds at the right distance for liquid water — would be far enough away from their star that a well-equipped telescope could image them directly."}, {"e466": "Different colors, masses and sizes of main-sequence stars. Red dwarf stars may be prohibitive for imaging Earth-sized worlds directly at present, but more massive stars will create brighter, more distant Earth-like planets. The right telescope could reveal them in only a few years. Image credit: Kieff/LucasVB of Wikimedia Commons / E. Siegel."}, {"e038": "We normally think about our Sun as being a “typical” star, but that’s not quite right. Our Sun is more massive and more luminous than 95% of stars in our galaxy, and Alpha Centauri A is 50% brighter again than our Sun. Even Alpha Centauri B, half as bright as our Sun, is more luminous than nearly 90% of all stars. Because these two stars are so close and so uncommonly bright, any potentially habitable worlds will be separated by a larger angular size from their parent star than any other long-lived star (i.e., lasting billions of years) in the sky. It means that, if looking for potentially habitable planets around Alpha Centauri A and B is the scientific goal, we can do it with an incredibly small, inexpensive telescope by astronomy standards."}, {"f3ca": "A large number of space telescopes of various sizes (25 shown here) have flown in the past. This new proposal, of a 45-cm diameter mirror, would be the smallest, lightest space telescope of all of these. Image credit: Richard Kruse / Historic Spacecraft."}, {"d539": "The Hubble Space Telescope is 2.4 meters in diameter, and most telescopes designed to image planets directly from space would have diameters anywhere from four-to-twelve meters; the costs of such endeavors would quickly rocket into the billions or even the tens-of-billions of dollars. But from a scientific standpoint, a properly equipped telescope of just 45 centimeters (a mere 18 inches) in diameter would be sufficient to not only look for Earth-like worlds around the two bright Alpha Centauri stars, but to find out — if they were there — if they exhibited signs of an atmosphere, oceans, seasons, etc., we could perform a habitability assessment. The next-nearest sun-like star is 2.5 times farther away, meaning a telescope would need to be more than a meter in diameter to have a chance of imaging another star."}, {"a75a": "A simulation of what the next Pale Blue Dot would look like through this newly proposed telescope around Alpha Centauri A or B. Image credit: Project Blue Mission Team."}, {"8072": "The idea of a small telescope like this, flown in space with a coronagraph to block the light of the parent stars, gave rise to a proposed mission known as ACESat: the Alpha Centauri Exoplanet Satellite. Proposed by scientists Ruslan Belikov* and Eduardo Bendek, ACESat would be small, light, inexpensive, and yet would offer an incredible scientific opportunity: to know whether the closest sun-like stars to us have the signals we recognize as an inhabited world teeming with life."}, {"86ee": "It’s the kind of high-risk, high-reward venture that’s easy to get excited about. Alpha Centauri A and B are a binary star system, meaning that there are only three stable, long-term ways to have a planet in this system:"}, {"43c4": "Either of the first two options would be absolutely perfect for searching for a rocky, potentially inhabited world around a sun-like star. But if life is rare on habitable-zone worlds around sun-like stars, or if there are no worlds at all, the science return would not be as great. Unsurprisingly, NASA’s review committee expressed concern about the possibility of this “null result” and, partly as a result of that, the ACESat mission was not selected."}, {"c829": "An exoplanet detected around the star Fomalhaut, seen to move in multiple images over time. This kind of direct imaging is something Hubble can do for worlds distant from their parent star, but it doesn’t have the right instruments to do this for potentially habitable worlds. Image credit: NASA, ESA, and P. Kalas, University of California, Berkeley and SETI Institute."}, {"44a2": "But NASA isn’t the only option for launching a satellite into space. A similar mission to ACESat may yet come to exist, as a privately-funded venture known as Project Blue. The logistics are simpler than you’d imagine. A 45-centimeter telescope would be relatively low-cost: you can buy those off-the-shelf for only tens of thousands of dollars. The instruments would be intricate, but not prohibitive: they’d cost in the millions of dollars for the coronagraph (to block the light of the main star) and the development of new technology (to better resolve the planets orbiting the stars) and instrument integration. It would be valuable not just for our first chance to see a living, “blue” world directly, but to hone our observing and data analysis techniques for future missions designed to search for Earth-like worlds around even more distant stars."}, {"59ef": "The total cost of such a mission — including technology development, prototyping, testing, final design and launch — would only be in the $50 million range, far below the cost of a mid-sized NASA mission. About half of that would be needed for the technology’s development, with the other half for booking a launch. Even if no planets exist, the development of the coronagraph technology (with a deformable mirror), the new wavefront control algorithm (Multi-Star Wavefront Control), and the new technique of improving speckle suppression given 500–1000 unique images of the same system (Orbital Difference Imaging) would all have tremendous scientific value. But that’s a lot of money to raise, and a lack-of-funding has killed more than one very worthy project time and time again when it comes to astronomy and space exploration. But there are reasons to be hopeful."}, {"46b1": "Illustration of the planet-finding space telescope, Kepler, from NASA. Image credit: NASA Ames/ W Stenzel."}, {"6cf1": "NASA’s most successful planet-finding mission of all, Kepler, which has discovered over 3,000 new exoplanets to date, was designed more than 20 years before it flew. It’s brought us our biggest revolution so far in how we understand star systems beyond our own, including a number of surprises, but it can only identify planets that exhibit the rare and serendipitous alignment geometry that enables a planetary transit."}, {"4bdb": "The beauty of Project Blue is that we haven’t been able to look at another sun-like star in this fashion ever before, and when you look at a new thing in a new way, the possibilities for discovery go well-beyond what our imaginations are going to dream up. It may take crowdfunding; it may take the right confluence of investors and contracts; it may simply need one motivated person or consortium, but for a very small amount of money, we might be able to learn the answer to the biggest question of all: are we alone in the Universe?"}, {"bfe7": "* — Full disclosure: Rus Belikov and the author, Ethan Siegel, went to high school together. Small world."}, {"a74b": "Starts With A Bang is based at Forbes, and republished on Medium thanks to our Patreon supporters. Order Ethan’s first book, Beyond The Galaxy, and pre-order his new one, Treknology: The Science of Star Trek from Tricorders to Warp Drive!"}], "content": "An artist’s rendition of a potentially habitable exoplanet orbiting a sun-like star. Image credit: NASA Ames / JPL-Caltech. Remarkably inexpensive mission could find planets around the nearest sun-like stars Alpha Centauri A and B are just 4.37 light years away. Do they have planets around them? And possibly life? We just might find out! “Resources exist to be consumed. And consumed they will be, if not by this generation then by some future. By what right does this forgotten future seek to deny us our birthright?” -Sid Meier’s Alpha Centauri Imagine if you were light years away, orbiting another star in our galaxy. What would it take, looking at our Solar System from that great distance, to determine whether one of our worlds was an inhabited planet, teeming with life? Even if Earth were no more than a single pixel in a telescope, you could still do it. Reflecting the light from the Sun, if you could image our world directly, you could tell that: If someone from light years away could do that to Earth, then it stands to reason we, here on Earth, could do that to another star. And as luck would have it, the closest star system has two perfect candidates for this technique: Alpha Centauri A and Alpha Centauri B. The two sun-like stars, Alpha Centauri A and B, are located just 4.37 light years away from us and orbit one another with high eccentricity, coming as close as Saturn and reaching distances greater than Pluto for comparison. Image credit: ESA/Hubble & NASA. The Alpha Centauri system is a trinary star system, with Alpha Centauri A the same type as our Sun, Alpha Centauri B a slightly cooler, yellow/orange star, and Proxima Centauri a much cooler, smaller red dwarf. Sure, Proxima Centauri is a little closer: 4.24 light years away instead of the 4.37 light years that the other two are, but Alpha Centauri A and B are much more luminous, making their habitable zone planets more distant from the parent star, and hence, much more easily visible. Any potentially habitable planets — rocky worlds at the right distance for liquid water — would be far enough away from their star that a well-equipped telescope could image them directly. Different colors, masses and sizes of main-sequence stars. Red dwarf stars may be prohibitive for imaging Earth-sized worlds directly at present, but more massive stars will create brighter, more distant Earth-like planets. The right telescope could reveal them in only a few years. Image credit: Kieff/LucasVB of Wikimedia Commons / E. Siegel. We normally think about our Sun as being a “typical” star, but that’s not quite right. Our Sun is more massive and more luminous than 95% of stars in our galaxy, and Alpha Centauri A is 50% brighter again than our Sun. Even Alpha Centauri B, half as bright as our Sun, is more luminous than nearly 90% of all stars. Because these two stars are so close and so uncommonly bright, any potentially habitable worlds will be separated by a larger angular size from their parent star than any other long-lived star (i.e., lasting billions of years) in the sky. It means that, if looking for potentially habitable planets around Alpha Centauri A and B is the scientific goal, we can do it with an incredibly small, inexpensive telescope by astronomy standards. A large number of space telescopes of various sizes (25 shown here) have flown in the past. This new proposal, of a 45-cm diameter mirror, would be the smallest, lightest space telescope of all of these. Image credit: Richard Kruse / Historic Spacecraft. The Hubble Space Telescope is 2.4 meters in diameter, and most telescopes designed to image planets directly from space would have diameters anywhere from four-to-twelve meters; the costs of such endeavors would quickly rocket into the billions or even the tens-of-billions of dollars. But from a scientific standpoint, a properly equipped telescope of just 45 centimeters (a mere 18 inches) in diameter would be sufficient to not only look for Earth-like worlds around the two bright Alpha Centauri stars, but to find out — if they were there — if they exhibited signs of an atmosphere, oceans, seasons, etc., we could perform a habitability assessment. The next-nearest sun-like star is 2.5 times farther away, meaning a telescope would need to be more than a meter in diameter to have a chance of imaging another star. A simulation of what the next Pale Blue Dot would look like through this newly proposed telescope around Alpha Centauri A or B. Image credit: Project Blue Mission Team. The idea of a small telescope like this, flown in space with a coronagraph to block the light of the parent stars, gave rise to a proposed mission known as ACESat: the Alpha Centauri Exoplanet Satellite. Proposed by scientists Ruslan Belikov* and Eduardo Bendek, ACESat would be small, light, inexpensive, and yet would offer an incredible scientific opportunity: to know whether the closest sun-like stars to us have the signals we recognize as an inhabited world teeming with life. It’s the kind of high-risk, high-reward venture that’s easy to get excited about. Alpha Centauri A and B are a binary star system, meaning that there are only three stable, long-term ways to have a planet in this system: Either of the first two options would be absolutely perfect for searching for a rocky, potentially inhabited world around a sun-like star. But if life is rare on habitable-zone worlds around sun-like stars, or if there are no worlds at all, the science return would not be as great. Unsurprisingly, NASA’s review committee expressed concern about the possibility of this “null result” and, partly as a result of that, the ACESat mission was not selected. An exoplanet detected around the star Fomalhaut, seen to move in multiple images over time. This kind of direct imaging is something Hubble can do for worlds distant from their parent star, but it doesn’t have the right instruments to do this for potentially habitable worlds. Image credit: NASA, ESA, and P. Kalas, University of California, Berkeley and SETI Institute. But NASA isn’t the only option for launching a satellite into space. A similar mission to ACESat may yet come to exist, as a privately-funded venture known as Project Blue. The logistics are simpler than you’d imagine. A 45-centimeter telescope would be relatively low-cost: you can buy those off-the-shelf for only tens of thousands of dollars. The instruments would be intricate, but not prohibitive: they’d cost in the millions of dollars for the coronagraph (to block the light of the main star) and the development of new technology (to better resolve the planets orbiting the stars) and instrument integration. It would be valuable not just for our first chance to see a living, “blue” world directly, but to hone our observing and data analysis techniques for future missions designed to search for Earth-like worlds around even more distant stars. The total cost of such a mission — including technology development, prototyping, testing, final design and launch — would only be in the $50 million range, far below the cost of a mid-sized NASA mission. About half of that would be needed for the technology’s development, with the other half for booking a launch. Even if no planets exist, the development of the coronagraph technology (with a deformable mirror), the new wavefront control algorithm (Multi-Star Wavefront Control), and the new technique of improving speckle suppression given 500–1000 unique images of the same system (Orbital Difference Imaging) would all have tremendous scientific value. But that’s a lot of money to raise, and a lack-of-funding has killed more than one very worthy project time and time again when it comes to astronomy and space exploration. But there are reasons to be hopeful. Illustration of the planet-finding space telescope, Kepler, from NASA. Image credit: NASA Ames/ W Stenzel. NASA’s most successful planet-finding mission of all, Kepler, which has discovered over 3,000 new exoplanets to date, was designed more than 20 years before it flew. It’s brought us our biggest revolution so far in how we understand star systems beyond our own, including a number of surprises, but it can only identify planets that exhibit the rare and serendipitous alignment geometry that enables a planetary transit. The beauty of Project Blue is that we haven’t been able to look at another sun-like star in this fashion ever before, and when you look at a new thing in a new way, the possibilities for discovery go well-beyond what our imaginations are going to dream up. It may take crowdfunding; it may take the right confluence of investors and contracts; it may simply need one motivated person or consortium, but for a very small amount of money, we might be able to learn the answer to the biggest question of all: are we alone in the Universe? * — Full disclosure: Rus Belikov and the author, Ethan Siegel, went to high school together. Small world. Starts With A Bang is based at Forbes, and republished on Medium thanks to our Patreon supporters. Order Ethan’s first book, Beyond The Galaxy, and pre-order his new one, Treknology: The Science of Star Trek from Tricorders to Warp Drive! ", "name": "325", "child": "325_1\t325_2\t325_3325_1\t325_2\t325_3325_1\t325_2\t325_3", "timestamp": "Apr 13"}