{"parent": "", "title": "Is TV Finally Recognized as Cinema at Cannes?", "author": "Sinéad McCausland", "sentences": [{"2011": "Is TV Finally Recognized as Cinema at Cannes?"}, {"e4d6": "The director of Cannes Film Festival seems to think so."}, {"1b25": "On Thursday, the director of Cannes Film Festival, Thierry Frémaux, announced a surprisingly refreshing new line-up for its seventieth anniversary. Not only has Alejandro G. Iñńaritu’s virtual reality project been chosen as an Official Selection, but the festival will screen two TV series for the first time. This year, on Frémaux’s tenth anniversary as the Artistic Festival Director, two episodes of David Lynch’s Twin Peaks will be shown, along with the second season of Jane Campion’s Top of the Lake."}, {"33ac": "Frémaux has been known to resist screening television series, even saying he isn’t a ‘big fan’ of them. And while he urges that Cannes will not follow the likes of the Berlin Film Festival in opening a section for television series, with Frémaux saying ‘that’s not our intention,’ the artistic director’s comments on television suggest that it is an extension of the form of cinema. After all, if ‘the Cannes Film Festival is a festival of films,’ the screenings of Twin Peaks and Top of the Lake prove the case for TV-as-cinema."}, {"323c": "From SXSW introducing their ‘Episodic’ section this year, New York’s IFC Center set to launch the Split Sreens Festival, and the ATX Television Festival, television festivals are appearing around America at an increasing rate. And from the success of the UK’s Radio Times and BFI TV Festival, along with Monte Carlo’s own and France’s Series Mania, it’s clear television can exist in a world that was initially created for film. The festivals screen the series without adverts, with the episode(s) playing for the audience in whole on a big screen, consumed in exactly the same style as a film."}, {"4ccf": "What this placement of television in cinema does is emphasise the art of the TV series. While there are shows that clearly wouldn’t work on a big screen, the ones that do, or could — such as Twin Peaks — do so because as much detail is put into their creation as is put into a film. And it’s more often than not that the best series are now created by film directors and major Hollywood stars, with the most recent successful example of this being the Jean-Marc Vallée-directed Big Little Lies, starring recent collaborators Reese Witherspoon and Laura Dern (all three worked on Wild together). Moreover, with the popularised phenomenon of watching a series in one go, television has quickly become consumed closer to the style of a film than a TV series."}, {"a277": "Festivals created for TV reconfirm the split between television and film. However, the screening of a series on a big screen blurs the boundary between the way an audience consumes TV and film. Frémaux observes that ‘cinema remains a singular art, and we [Cannes] want to emphasize this while keeping our eyes open on the world that surrounds it. And this world is more and more about TV series, virtual reality.’ It’s clear Frémaux sees a split between television and cinema, but, ultimately, it does not come down to whether a story has been filmed as VR, a series, or as a film, but who’s creating it. Frémaux has recognized Lynch’s and Campion’s series because they are ‘artists,’ artists ‘who experiment and try to invent new narrative means.’"}, {"b05a": "Twin Peaks and Top of the Lake’s series debuts present a turning for television, since they are TV shows screened at festival exclusively for films. As Frémaux says, television uses ‘the classical art of filmmaking and of cinematic narration.’ Whilst for Frémaux the screenings of these series are purely based on the auteurs behind them, the very fact Lynch and Campion want to work in television prove the form’s worth."}], "content": "Is TV Finally Recognized as Cinema at Cannes? The director of Cannes Film Festival seems to think so. On Thursday, the director of Cannes Film Festival, Thierry Frémaux, announced a surprisingly refreshing new line-up for its seventieth anniversary. Not only has Alejandro G. Iñńaritu’s virtual reality project been chosen as an Official Selection, but the festival will screen two TV series for the first time. This year, on Frémaux’s tenth anniversary as the Artistic Festival Director, two episodes of David Lynch’s Twin Peaks will be shown, along with the second season of Jane Campion’s Top of the Lake. Frémaux has been known to resist screening television series, even saying he isn’t a ‘big fan’ of them. And while he urges that Cannes will not follow the likes of the Berlin Film Festival in opening a section for television series, with Frémaux saying ‘that’s not our intention,’ the artistic director’s comments on television suggest that it is an extension of the form of cinema. After all, if ‘the Cannes Film Festival is a festival of films,’ the screenings of Twin Peaks and Top of the Lake prove the case for TV-as-cinema. From SXSW introducing their ‘Episodic’ section this year, New York’s IFC Center set to launch the Split Sreens Festival, and the ATX Television Festival, television festivals are appearing around America at an increasing rate. And from the success of the UK’s Radio Times and BFI TV Festival, along with Monte Carlo’s own and France’s Series Mania, it’s clear television can exist in a world that was initially created for film. The festivals screen the series without adverts, with the episode(s) playing for the audience in whole on a big screen, consumed in exactly the same style as a film. What this placement of television in cinema does is emphasise the art of the TV series. While there are shows that clearly wouldn’t work on a big screen, the ones that do, or could — such as Twin Peaks — do so because as much detail is put into their creation as is put into a film. And it’s more often than not that the best series are now created by film directors and major Hollywood stars, with the most recent successful example of this being the Jean-Marc Vallée-directed Big Little Lies, starring recent collaborators Reese Witherspoon and Laura Dern (all three worked on Wild together). Moreover, with the popularised phenomenon of watching a series in one go, television has quickly become consumed closer to the style of a film than a TV series. Festivals created for TV reconfirm the split between television and film. However, the screening of a series on a big screen blurs the boundary between the way an audience consumes TV and film. Frémaux observes that ‘cinema remains a singular art, and we [Cannes] want to emphasize this while keeping our eyes open on the world that surrounds it. And this world is more and more about TV series, virtual reality.’ It’s clear Frémaux sees a split between television and cinema, but, ultimately, it does not come down to whether a story has been filmed as VR, a series, or as a film, but who’s creating it. Frémaux has recognized Lynch’s and Campion’s series because they are ‘artists,’ artists ‘who experiment and try to invent new narrative means.’ Twin Peaks and Top of the Lake’s series debuts present a turning for television, since they are TV shows screened at festival exclusively for films. As Frémaux says, television uses ‘the classical art of filmmaking and of cinematic narration.’ Whilst for Frémaux the screenings of these series are purely based on the auteurs behind them, the very fact Lynch and Campion want to work in television prove the form’s worth. ", "name": "353", "child": "353_1", "timestamp": "Apr 14"}