{"parent": "", "title": "Pop is a TV Network for Your Sense of Nostalgia", "author": "Francesca Fau", "sentences": [{"63e3": "Pop is a TV Network for Your Sense of Nostalgia"}, {"a22e": "I hope you like 80s set sitcoms and boyband reality shows."}, {"787c": "The Goldbergs"}, {"92ca": "Some networks like murder, others love reality drama, and some want to make you wax poetic about the good old days. Pop — formerly the TV Guide Channel — is capitalizing on the latter. Namely, your fond memories of the past. First, they focused on your love of boy bands through the unscripted series Rock This Boat: New Kids on the Block. Then, they remembered how much you loved Catherine O’Hara and Eugene Levy in Best in Show and teamed them up for the Arrested Development-like Schitt’s Creek. Now, they are bringing the third highest rated comedy series, itself an exploration in 80s nostalgia, The Goldbergs to their lineup."}, {"9c26": "Pop Network grew its audience through reruns of classic 90s television. As Schwartz described their target audience:"}, {"80a4": "“We target this audience, modern grown-ups, people who grew up in the 1990s, so the acquisition strategy to date has been to get a lot of those classics that our audience grew up with, including Beverly Hills, 90210, Melrose Place, Buffy the Vampire Slayer, The OC, That ’70s Show, Dawson’s Creek, and it’s been doing really, really well for us.”"}, {"e037": "Have you ever read a word pair more playful and millennial as “modern grown-up”? It’s amusing that somehow being a “modern grown-up” means never having to grow up. If it sounds like I’m judging Schwartz and Pop, I’m not. In fact, I respect his decision because I enjoy watching Buffy and Beverly Hills, 90210 reruns. Schwartz gives people exactly what they want and I won’t judge him for doing so."}, {"4d9f": "The Goldbergs spent a whole episode in Spencer’s gifts."}, {"8c54": "Millennials — “modern grown ups” — are wistful for childhood. Schwartz should make money off nostalgia because to do so he’ll be giving us what we want. The generational love of longing for the past created a cultural trend but it can’t just be millennials. Especially if presidential elections, box office numbers, and television networks are structuring their entire message around a return to the past."}, {"cde2": "Nostalgia is a big cultural daydream at this point. We see it come up in presidential campaign slogans where we’re always trying to make something how it used to be. We see it with clothing trends. Like the sudden return of the overall — though I blame hipsters. Even film has gotten in on the game — Power Rangers anyone? Additionally, Warner Brothers is bringing the Young Pope himself, Jude Law, in to play young Dumbledore in the Fantastic Beasts sequel. Fantastic Beasts is just another off shoot of a 90s childhood favorite, Harry Potter. Labyrinth is getting a universe expanding sequel too. Sentimentality is so hot right now."}, {"adba": "Three things encourage nostalgia: a current unappealing present, a fond memory of things past, and a feeling of hopelessness. Together, they create a need for comfort. Stability and safety always seemed available in the past. A desire to return to the past is a bias against the present. If you perceive things as the worst they’ve ever been you’re less likely to think the current circumstances can be better. Further, you’re more likely to roll over and quit. This penchant for quitting is why nostalgia can be toxic in large doses. So as with every indulgence moderation and balance is key. Therefore, the goal should not be just to stop rebooting, following up, or retooling. These things are inevitable. Rather, the motto should be caveat emptor — or if Max Fisher didn’t save your Latin class — buyer beware."}, {"c913": "Check your local listings for Pop especially if you’re a fan of Beverly Hills, 90210, ER, and Buffy the Vampire Slayer. The Goldbergs air on ABC Wednesdays 8/9 central time."}], "content": "Pop is a TV Network for Your Sense of Nostalgia I hope you like 80s set sitcoms and boyband reality shows. The Goldbergs Some networks like murder, others love reality drama, and some want to make you wax poetic about the good old days. Pop — formerly the TV Guide Channel — is capitalizing on the latter. Namely, your fond memories of the past. First, they focused on your love of boy bands through the unscripted series Rock This Boat: New Kids on the Block. Then, they remembered how much you loved Catherine O’Hara and Eugene Levy in Best in Show and teamed them up for the Arrested Development-like Schitt’s Creek. Now, they are bringing the third highest rated comedy series, itself an exploration in 80s nostalgia, The Goldbergs to their lineup. Pop Network grew its audience through reruns of classic 90s television. As Schwartz described their target audience: “We target this audience, modern grown-ups, people who grew up in the 1990s, so the acquisition strategy to date has been to get a lot of those classics that our audience grew up with, including Beverly Hills, 90210, Melrose Place, Buffy the Vampire Slayer, The OC, That ’70s Show, Dawson’s Creek, and it’s been doing really, really well for us.” Have you ever read a word pair more playful and millennial as “modern grown-up”? It’s amusing that somehow being a “modern grown-up” means never having to grow up. If it sounds like I’m judging Schwartz and Pop, I’m not. In fact, I respect his decision because I enjoy watching Buffy and Beverly Hills, 90210 reruns. Schwartz gives people exactly what they want and I won’t judge him for doing so. The Goldbergs spent a whole episode in Spencer’s gifts. Millennials — “modern grown ups” — are wistful for childhood. Schwartz should make money off nostalgia because to do so he’ll be giving us what we want. The generational love of longing for the past created a cultural trend but it can’t just be millennials. Especially if presidential elections, box office numbers, and television networks are structuring their entire message around a return to the past. Nostalgia is a big cultural daydream at this point. We see it come up in presidential campaign slogans where we’re always trying to make something how it used to be. We see it with clothing trends. Like the sudden return of the overall — though I blame hipsters. Even film has gotten in on the game — Power Rangers anyone? Additionally, Warner Brothers is bringing the Young Pope himself, Jude Law, in to play young Dumbledore in the Fantastic Beasts sequel. Fantastic Beasts is just another off shoot of a 90s childhood favorite, Harry Potter. Labyrinth is getting a universe expanding sequel too. Sentimentality is so hot right now. Three things encourage nostalgia: a current unappealing present, a fond memory of things past, and a feeling of hopelessness. Together, they create a need for comfort. Stability and safety always seemed available in the past. A desire to return to the past is a bias against the present. If you perceive things as the worst they’ve ever been you’re less likely to think the current circumstances can be better. Further, you’re more likely to roll over and quit. This penchant for quitting is why nostalgia can be toxic in large doses. So as with every indulgence moderation and balance is key. Therefore, the goal should not be just to stop rebooting, following up, or retooling. These things are inevitable. Rather, the motto should be caveat emptor — or if Max Fisher didn’t save your Latin class — buyer beware. Check your local listings for Pop especially if you’re a fan of Beverly Hills, 90210, ER, and Buffy the Vampire Slayer. The Goldbergs air on ABC Wednesdays 8/9 central time. ", "name": "354", "child": "354_1", "timestamp": "Apr 14"}