{"parent": "", "title": "Kathryn Bigelow Hones in on a War at Home in ‘Detroit’", "author": "H. Perry Horton", "sentences": [{"7496": "Kathryn Bigelow Hones in on a War at Home in ‘Detroit’"}, {"57ef": "The Oscar-winner’s first film in 5 years gets a trailer."}, {"6a70": "After reinvigorating her career with a pair of films about the war on terror — The Hurt Locker and Zero Dark Thirty, the former of which earned her a Best Director Oscar, a first for a woman — Kathryn Bigelow has turned her focus to a war at home for her first film in half a decade, Detroit."}, {"a85c": "Set during the 1967 Detroit Riot (aka the 12th Street Riot), the film tells the story of the raid on an after-hours bar that launched a five-day skirmish between a group of citizens and police, the former being predominantly African-American and the latter being predominantly white. Happening just two years after the Watts Riots and a year before the assassination of Martin Luther King Jr., Detroit takes place just as the civil rights movement was hitting a fever pitch, and as evidenced by the first trailer, released today, Bigelow is sticking with the gritty realism that made her last two films so narratively and aesthetically captivating."}, {"4810": "John Boyega (The Last Jedi) heads up an ensemble cast that includes John Krasinski (13 Hours), Will Poulter (We’re the Millers), Anthony Mackie (Captain America: Civil War), Jason Mitchell (Straight Outta Compton) and Kaitlyn Dever (Justified). As with The Hurt Locker and Zero Dark Thirty, Bigelow collaborated with Oscar-winning producer and screenwriter Mark Boal on the script. Check out the first trailer below and look for Detroit to erupt in theaters this August."}, {"7eff": "Over in our corner of the internet we had a lot of really interesting posts go up yesterday, including a Bollywood franchise for Fast and Furious fans, a video exploring the visual references of David Lynch, the week’s best new Blu-Rays, and a look at biopics vs fictional counterparts."}, {"b883": "And lastly, take a look at five of the most popular shots we tweeted over the last 24 hours. Want more? You know where to find us."}, {"0fe7": "THE GODFATHER: PART II (1974) DP: Gordon Willis | Dir: Francis Ford Coppola"}, {"aec3": "THE USUAL SUSPECTS (1995) DP: Newton Thomas Sigel | Dir: Bryan Singer"}, {"aab8": "DO THE RIGHT THING (1989) DP: Ernest R. Dickerson | Dir: Spike Lee"}, {"b417": "MAD MEN (S2,EP7) (2008) DP: Chris Manley | Dir: Andrew Bernstein"}, {"87a1": "SCIENCE OF SLEEP (2006) DP: Jean-Louis Bompoint | Dir: Michel Gondry"}], "content": "Kathryn Bigelow Hones in on a War at Home in ‘Detroit’ The Oscar-winner’s first film in 5 years gets a trailer. After reinvigorating her career with a pair of films about the war on terror — The Hurt Locker and Zero Dark Thirty, the former of which earned her a Best Director Oscar, a first for a woman — Kathryn Bigelow has turned her focus to a war at home for her first film in half a decade, Detroit. Set during the 1967 Detroit Riot (aka the 12th Street Riot), the film tells the story of the raid on an after-hours bar that launched a five-day skirmish between a group of citizens and police, the former being predominantly African-American and the latter being predominantly white. Happening just two years after the Watts Riots and a year before the assassination of Martin Luther King Jr., Detroit takes place just as the civil rights movement was hitting a fever pitch, and as evidenced by the first trailer, released today, Bigelow is sticking with the gritty realism that made her last two films so narratively and aesthetically captivating. John Boyega (The Last Jedi) heads up an ensemble cast that includes John Krasinski (13 Hours), Will Poulter (We’re the Millers), Anthony Mackie (Captain America: Civil War), Jason Mitchell (Straight Outta Compton) and Kaitlyn Dever (Justified). As with The Hurt Locker and Zero Dark Thirty, Bigelow collaborated with Oscar-winning producer and screenwriter Mark Boal on the script. Check out the first trailer below and look for Detroit to erupt in theaters this August. Over in our corner of the internet we had a lot of really interesting posts go up yesterday, including a Bollywood franchise for Fast and Furious fans, a video exploring the visual references of David Lynch, the week’s best new Blu-Rays, and a look at biopics vs fictional counterparts. And lastly, take a look at five of the most popular shots we tweeted over the last 24 hours. Want more? You know where to find us. THE GODFATHER: PART II (1974) DP: Gordon Willis | Dir: Francis Ford Coppola THE USUAL SUSPECTS (1995) DP: Newton Thomas Sigel | Dir: Bryan Singer DO THE RIGHT THING (1989) DP: Ernest R. Dickerson | Dir: Spike Lee MAD MEN (S2,EP7) (2008) DP: Chris Manley | Dir: Andrew Bernstein SCIENCE OF SLEEP (2006) DP: Jean-Louis Bompoint | Dir: Michel Gondry ", "name": "357", "child": "357_1357_1357_1", "timestamp": "Apr 12"}