{"parent": "", "title": "What I Know of Gene Wilder", "author": "Colton Ledford", "sentences": [{"9e4d": "What I Know of Gene Wilder"}, {"d440": "A personal tribute to the actor, who died this week at age 83."}, {"4386": "I know Gene Wilder like most of the world knows him. Which is to say, I don’t really know him at all. He passed away from complications of Alzheimer’s, an incredibly terrible disease that slowly takes the mind away. I don’t know that kind of suffering. I know my maternal grandparents were afflicted with it, but I wasn’t with them in that stage of their lives nor would I have been mature enough to understand what was going on if I was. I know Gene Wilder as a film star."}, {"8f22": "I know Gene Wilder as Leo Bloom from The Producers. I first watched that movie as kid with my mom. We lived together just ourselves, her and I, for much of my life. I don’t remember how old I was, but I do remember not really understanding that film. Much of the Nazi satire went straight over my bowl-haircut head. I know I liked the musical number “Springtime for Hitler,” you know, for the razzle-dazzle of it all. More importantly, it’s one of the few movies that made my mom laugh. And not like the conditioned laugh you give when placating someone or pretending, like she’d give me a lot when I was attempting to humor her. No, it was from her gut, a chortle I tried and failed to mimic, and it endeared me to her to see her laugh like that, something I don’t remember her doing often. Wilder was that elixir."}, {"1ae5": "I know Gene Wilder as Willy Wonka from Willy Wonka & the Chocolate Factory. I didn’t think much of the context of the story as a child when I first watched it. It was colorful, about candy, had songs, had naughty kids getting their comeuppance, and had good little boys — like me! — getting rewarded for their goodness. It took rewatching it in later years to understand the nuance of Wilder’s performance, the sadistic-ness behind a character that employs slave labor and pushes gluttonous ideals. Wilder understood the character of Wonka so well, he famously created the somersault introduction for his character to add another layer of distrust of what’s real and what’s fantasy between the audience and the supposed “children’s story” narrative. Wilder provided the bridge between adolescence and adulthood through one performance that works on both levels."}, {"4769": "I know Gene Wilder as the Waco Kid — well, his name is Jim, but most people call him… Jim — from Blazing Saddles. Along with his revolutionary works with Richard Pryor, this movie succeeded in satirizing racism, a no holds barred takedown of the absurdity of bigotry and entrenched stereotypes. Wilder, with his powder-blue eyes and wavy blond hair, was never more perfect for leading man status, yet he plays the sidekick role with hilarious aplomb. I wonder how Wilder might have felt about the current racial strife in our country and the fact that this movie might be more pertinent today than it was 40 years ago."}, {"b359": "I know Gene Wilder as Dr. Frederick Frankenstein — excuse me, Fronkensteen — from Young Frankenstein. This movie is an unquestionable masterpiece. The “Puttin’ on the Ritz” scene is impossible to sit through without laughing. For all the great work Wilder has done, I believe this to be his most important contribution to film. This is the Gene Wilder I know. The timeless entertainer."}, {"14dc": "Gene Wilder has been with me my whole life. He’s brought me countless hours of joy and laughter. I can meet up with him tangentially, like I always have, anytime I want. He’s just a DVD away. His family, his friends, his loved ones… their loss is heartbreaking. The world will miss a great actor and writer. Those who were close to him will miss so much more."}], "content": "What I Know of Gene Wilder A personal tribute to the actor, who died this week at age 83. I know Gene Wilder like most of the world knows him. Which is to say, I don’t really know him at all. He passed away from complications of Alzheimer’s, an incredibly terrible disease that slowly takes the mind away. I don’t know that kind of suffering. I know my maternal grandparents were afflicted with it, but I wasn’t with them in that stage of their lives nor would I have been mature enough to understand what was going on if I was. I know Gene Wilder as a film star. I know Gene Wilder as Leo Bloom from The Producers. I first watched that movie as kid with my mom. We lived together just ourselves, her and I, for much of my life. I don’t remember how old I was, but I do remember not really understanding that film. Much of the Nazi satire went straight over my bowl-haircut head. I know I liked the musical number “Springtime for Hitler,” you know, for the razzle-dazzle of it all. More importantly, it’s one of the few movies that made my mom laugh. And not like the conditioned laugh you give when placating someone or pretending, like she’d give me a lot when I was attempting to humor her. No, it was from her gut, a chortle I tried and failed to mimic, and it endeared me to her to see her laugh like that, something I don’t remember her doing often. Wilder was that elixir. I know Gene Wilder as Willy Wonka from Willy Wonka & the Chocolate Factory. I didn’t think much of the context of the story as a child when I first watched it. It was colorful, about candy, had songs, had naughty kids getting their comeuppance, and had good little boys — like me! — getting rewarded for their goodness. It took rewatching it in later years to understand the nuance of Wilder’s performance, the sadistic-ness behind a character that employs slave labor and pushes gluttonous ideals. Wilder understood the character of Wonka so well, he famously created the somersault introduction for his character to add another layer of distrust of what’s real and what’s fantasy between the audience and the supposed “children’s story” narrative. Wilder provided the bridge between adolescence and adulthood through one performance that works on both levels. I know Gene Wilder as the Waco Kid — well, his name is Jim, but most people call him… Jim — from Blazing Saddles. Along with his revolutionary works with Richard Pryor, this movie succeeded in satirizing racism, a no holds barred takedown of the absurdity of bigotry and entrenched stereotypes. Wilder, with his powder-blue eyes and wavy blond hair, was never more perfect for leading man status, yet he plays the sidekick role with hilarious aplomb. I wonder how Wilder might have felt about the current racial strife in our country and the fact that this movie might be more pertinent today than it was 40 years ago. I know Gene Wilder as Dr. Frederick Frankenstein — excuse me, Fronkensteen — from Young Frankenstein. This movie is an unquestionable masterpiece. The “Puttin’ on the Ritz” scene is impossible to sit through without laughing. For all the great work Wilder has done, I believe this to be his most important contribution to film. This is the Gene Wilder I know. The timeless entertainer. Gene Wilder has been with me my whole life. He’s brought me countless hours of joy and laughter. I can meet up with him tangentially, like I always have, anytime I want. He’s just a DVD away. His family, his friends, his loved ones… their loss is heartbreaking. The world will miss a great actor and writer. Those who were close to him will miss so much more. ", "name": "361", "child": "361_1361_1361_1361_1361_1361_1", "timestamp": "Aug 30, 2016"}