{"parent": "", "title": "This shows just how much the banks are ripping off customers.", "author": "Taavet Hinrikus", "sentences": [{"59d4": "This shows just how much the banks are ripping off customers."}, {"b95d": "A picture’s worth a thousand words."}, {"7036": "From The Guardian, 8th April 2017"}, {"4400": "This is an internal memo from Santander shared with the Guardian. I don’t have much to add. We started TransferWise because of this. Because of how the banks treat customers, because of their lack of transparency, because of their horrible service when all you want to do is manage your own money."}, {"01bb": "The sad thing is that this doesn’t surprise me."}, {"5cb1": "International money transfer is a massive consumer rip-off. Banks and companies like Western Union have gotten away with it for too long. And this proves that they have known it."}, {"11a4": "The banks aren’t changing. Western Union isn’t changing. PayPal isn’t changing."}, {"097d": "They’ve become addicted to the profits they’ve made from ripping off consumers. In their response to the Guardian, Santander didn’t argue the fact that they take advantage of their customers. Instead they chose to emphasise that their profits might not be hit quite as much as this. I bet that’s a relief for everyone they’ve screwed over with hidden charges."}, {"67df": "The Government has been slow to act. I struggle to see why the banks are allowed to get away with this."}, {"a7f2": "At least now people have alternatives. And there’s more and more information out there to help people make an informed choice whether it’s at the World Bank, comparison sites or on companies’ own sites like at TransferWise. By choosing with their wallet, people will force the industry to change."}, {"c2ba": "And about time too."}], "content": "This shows just how much the banks are ripping off customers. A picture’s worth a thousand words. From The Guardian, 8th April 2017 This is an internal memo from Santander shared with the Guardian. I don’t have much to add. We started TransferWise because of this. Because of how the banks treat customers, because of their lack of transparency, because of their horrible service when all you want to do is manage your own money. The sad thing is that this doesn’t surprise me. International money transfer is a massive consumer rip-off. Banks and companies like Western Union have gotten away with it for too long. And this proves that they have known it. The banks aren’t changing. Western Union isn’t changing. PayPal isn’t changing. They’ve become addicted to the profits they’ve made from ripping off consumers. In their response to the Guardian, Santander didn’t argue the fact that they take advantage of their customers. Instead they chose to emphasise that their profits might not be hit quite as much as this. I bet that’s a relief for everyone they’ve screwed over with hidden charges. The Government has been slow to act. I struggle to see why the banks are allowed to get away with this. At least now people have alternatives. And there’s more and more information out there to help people make an informed choice whether it’s at the World Bank, comparison sites or on companies’ own sites like at TransferWise. By choosing with their wallet, people will force the industry to change. And about time too. ", "name": "387", "child": "387_1\t387_2\t387_3", "timestamp": "Apr 8"}