{"parent": "", "title": "A theory on the fall in bank lending", "author": "David Schawel", "sentences": [{"a15a": "A theory on the fall in bank lending"}, {"2e82": "One of the more confounding stories in financial markets of late has been the drop in the growth rate of bank lending. For many, the initial reaction is to assume this is a bearish economic sign. Some of these might start out something like this, “We’ve had nearly a decade of easy credit and after so many years of strong loan growth this is a sign that the credit cycle and economy is turning lower”."}, {"20c0": "Meanwhile, the FRB’s January Senior Loan Officer Survey stated that “January survey results indicated that over the fourth quarter of 2016, on balance, banks left their standards on commercial and industrial (C&I) loans basically unchanged”. So we know that banks, in general, are not tightening standards on lending. If it’s not a supply side issue, could it be more of a demand issue? It is possible, but every piece of data we have from the corporate bond markets tell us otherwise. Issuance is robust and spreads on high and low quality corporate have continued to tighten."}, {"df08": "The line that caught my eye when looking through the Fed’s H8 report (asset and liabilities of commercial banks) was line 26 on page 2 which is titled “Fed funds and reverse RPs with nonbanks”. As shown in the chart below, this series has declined from ~$380bil in late 2016 to $330bil in February. When you look at the recently weekly H8 release the drop is even more pronounced hitting $295bil for the week ending March 29th."}, {"1d66": "What has changed and what would explain such a drop? Often we do not need to overthink things and this may be one of those cases. In connection with the rise in Fed Funds and short term Libor rates, the cost of borrowing in the repo markets has also risen."}, {"dd70": "Levered market participants such as some non bank financials utilize the repo markets to borrow. Given that risk premiums, including credit spreads, have continued to fall, the economics of leveraging in the repo markets to buy risk assets is getting hit from both sides. It may not make sense anymore to use reverse repo to buy non-agency MBS at +250 when repo rates have risen almost 100bps and loss adjusted yields have fallen. Granted, the repo markets are large and complex and the example above is only a portion of the market. That being said, the economics of employing this type of leverage are no longer as attractive as they were a few years ago."}, {"5811": "Drop in opportunity cost?"}, {"f132": "A second theory on the drop in bank lending involves the opportunity cost of making loan from the perspective of a commercial bank. Banks obviously seek to earn a spread on their earning assets (loans, securities, cash, etc) over the cost of their liabilities (deposits and borrowings). During my time managing the investment portfolio and helping with the asset/liability management of a commercial bank, we frequently had to make decisions on whether a given loan would economically make sense for the bank. The complexity goes beyond just the loan rate and includes fee income, the amount of deposits brought in, but the interest income generated is typically the major driver."}, {"b639": "Today the weighted average C&I loan rate sits largely where it has for the last 5 years. The data series is somewhat volatile, and while it has spiked a bit the last few quarters, this series has ranged from ~2.50%-3.00%."}, {"26c8": "Versus your alternatives including earning 1% at the Fed or buying some variety of fixed income securities, the opportunity cost of not making a loan is suddenly not as high as it was in the past. Terms are still easy, credit is still available, but the opportunity cost of missing out on a loan is not as high. Combined with the fact that the corporate bond markets are arguably as easy as ever and the participants in those markets have different opportunity cost thresholds, and we can begin to see why loan growth may have started to cool off."}], "content": "A theory on the fall in bank lending One of the more confounding stories in financial markets of late has been the drop in the growth rate of bank lending. For many, the initial reaction is to assume this is a bearish economic sign. Some of these might start out something like this, “We’ve had nearly a decade of easy credit and after so many years of strong loan growth this is a sign that the credit cycle and economy is turning lower”. Meanwhile, the FRB’s January Senior Loan Officer Survey stated that “January survey results indicated that over the fourth quarter of 2016, on balance, banks left their standards on commercial and industrial (C&I) loans basically unchanged”. So we know that banks, in general, are not tightening standards on lending. If it’s not a supply side issue, could it be more of a demand issue? It is possible, but every piece of data we have from the corporate bond markets tell us otherwise. Issuance is robust and spreads on high and low quality corporate have continued to tighten. The line that caught my eye when looking through the Fed’s H8 report (asset and liabilities of commercial banks) was line 26 on page 2 which is titled “Fed funds and reverse RPs with nonbanks”. As shown in the chart below, this series has declined from ~$380bil in late 2016 to $330bil in February. When you look at the recently weekly H8 release the drop is even more pronounced hitting $295bil for the week ending March 29th. What has changed and what would explain such a drop? Often we do not need to overthink things and this may be one of those cases. In connection with the rise in Fed Funds and short term Libor rates, the cost of borrowing in the repo markets has also risen. Levered market participants such as some non bank financials utilize the repo markets to borrow. Given that risk premiums, including credit spreads, have continued to fall, the economics of leveraging in the repo markets to buy risk assets is getting hit from both sides. It may not make sense anymore to use reverse repo to buy non-agency MBS at +250 when repo rates have risen almost 100bps and loss adjusted yields have fallen. Granted, the repo markets are large and complex and the example above is only a portion of the market. That being said, the economics of employing this type of leverage are no longer as attractive as they were a few years ago. Drop in opportunity cost? A second theory on the drop in bank lending involves the opportunity cost of making loan from the perspective of a commercial bank. Banks obviously seek to earn a spread on their earning assets (loans, securities, cash, etc) over the cost of their liabilities (deposits and borrowings). During my time managing the investment portfolio and helping with the asset/liability management of a commercial bank, we frequently had to make decisions on whether a given loan would economically make sense for the bank. The complexity goes beyond just the loan rate and includes fee income, the amount of deposits brought in, but the interest income generated is typically the major driver. Today the weighted average C&I loan rate sits largely where it has for the last 5 years. The data series is somewhat volatile, and while it has spiked a bit the last few quarters, this series has ranged from ~2.50%-3.00%. Versus your alternatives including earning 1% at the Fed or buying some variety of fixed income securities, the opportunity cost of not making a loan is suddenly not as high as it was in the past. Terms are still easy, credit is still available, but the opportunity cost of missing out on a loan is not as high. Combined with the fact that the corporate bond markets are arguably as easy as ever and the participants in those markets have different opportunity cost thresholds, and we can begin to see why loan growth may have started to cool off. ", "name": "395", "child": "395_1\t395_2", "timestamp": "Apr 12"}