{"parent": "", "title": "The Kansas Democrat who nearly pulled off the impossible has some advice for his party", "author": "Kira Lerner", "sentences": [{"73ea": "The Kansas Democrat who nearly pulled off the impossible has some advice for his party"}, {"2fa6": "James Thompson says Democrats can’t ignore red states."}, {"293a": "James Thompson ran for Mike Pompeo’s congressional seat. CREDIT: SCREENSHOT"}, {"f279": "James Thompson may not be heading to Congress, but not everyone is calling his loss in Kansas’ special congressional election a defeat."}, {"358a": "On Tuesday, Republican Ron Estes beat Thompson in the solidly Republican district by a margin of roughly five points. Just a few months ago, President Trump carried the district with a wide margin of 27 points."}, {"e2c8": "The Democratic Party never expected to win the seat. The Democratic Congressional Campaign Committee (DCCC) didn’t conduct polling or invest money in the race until the final days, when Republicans appeared to be worried and made a last minute push. In recent days, the GOP spent close to $100,000 on ads and dispatched party leaders like Sen. Ted Cruz (R-TX) to campaign and Speaker Paul Ryan (R-WI) to raise money for Estes."}, {"028b": "Trump already making life very difficult for Republicans trying to win electionsThe GOP won a safe Kansas seat with a slim margin.thinkprogress.org"}, {"a51a": "Speaking to ThinkProgress Wednesday morning, Thompson said that he is disappointed, but proud of his campaign. And while he was unable to swing the district to Democrats, he said a win was not impossible and that the party should not ignore red states."}, {"27e2": "We saw last night with Ron Estes’ relatively small margin of victory that President Trump is already hurting Republicans trying to win congressional elections. Did you expect such a small margin? What do you think it means for Republicans running in other upcoming elections?"}, {"7128": "I think ultraconservative Republicans anywhere in the United States need to be scared right now because we have shown that a motivated base and a well-run campaign can win. We did not lose to Estes so much as we lost to a president, a vice president, a speaker of the house, and multiple senators coming in and helping out. So in 2018 when there’s 435 races going on, he’s not going to be able to do that for everybody. I think that those congressmen and senators need to be looking at their positions on things, because there’s going to be backlash and there’s going to be people who lose their seats in 2018 as a result of it."}, {"d86d": "How much do you think Trump’s incredibly high disapproval ratings played into this race? When you spoke to Kansas voters, did they talk about their dissatisfaction with the president?"}, {"3973": "Here in Wichita, it played much greater. Getting out into more rural areas where people are more conservative, it played less. A lot of people here are still wanting to give President Trump a chance. There are a lot of people who are nervous. This was partially a referendum on him but mostly a referendum on [Gov. Sam] Brownback (R)."}, {"f376": "Brownback was, until recently, the least popular governor in the country. Were voters more vocal about their dissatisfaction for him?"}, {"7572": "Oh yes, very much so. Most of the state despises Sam Brownback for his failure to expand Medicaid, his refusal to reform the tax code, the education system that’s consistently held to be underfunded by our state supreme court, his attempt to grab power from our supreme court and to stack it himself. There’s a multitude of reasons. The economy here has gone in the tank under his watch and his failed policies."}, {"790d": "The Brownbacklash Is Finally Here: Kansas Primary Voters Send Conservatives Packingthinkprogress.org"}, {"77ba": "What about some of Trump’s signature policies, like his promises to repeal Obamacare and build a border wall? How did those play out among voters in the district? Did they hurt Estes?"}, {"37ea": "A lot of people here want good health care and affordable health care, so [Trump’s attempt to repeal the Affordable Care Act] definitely did not help him."}, {"c294": "The selection of Betsy DeVos actually was a huge thing here. There was a ten to one split against her and people told both our senators, ‘do not put that woman in as Secretary of Education, do not confirm her,’ and they did not listen. Education is very important here because of what we have going on at the state level. We’re constantly seeing cuts to education and a struggle to properly fund it, and when you’ve got somebody that’s being appointed Secretary of Education that wants to go to a voucher system that will destroy public education, there’s a lot of pushback."}, {"8feb": "Do you think it ultimately helped or hurt you that Trump made a push this week to elect Estes?"}, {"2f14": "I think in the end, it was his desperation coming out to win that seat. It drove Republicans out to the polls. Between the president, vice president, and speaker doing things and the national Republican Party coming in and running these negative campaign ads that were blatantly false and attacked me on abortion, saying I support sex-selection abortion and late-term abortion and all of these things that I’ve never said, that riled up a lot of [anti-abortion] activists here and they were able to pull out a victory."}, {"8709": "Estes himself couldn’t defeat me. It took literally the president, vice president, Sen. Ted Cruz (R-TX), Sen. Pat Roberts (R-KS), and the national party to come in."}, {"ea7a": "You’re a civil rights lawyer. Did the Trump administration’s disdain for civil rights come up during your campaign?"}, {"027a": "There was a lot of support for having a civil rights attorney go up there to help stand up when unconstitutional things are done. The [Muslim ban] came up quite a bit, and people wanted to have a civil rights lawyer who could stand up to those types of things."}, {"03bc": "Trump won’t protect students’ civil rightsTrump says he wants to help disadvantaged students, but his administration’s actions will do the opposite.thinkprogress.org"}, {"5ddc": "People are now turning their attention to Georgia’s sixth district, which will hold a special election for Tom Price’s seat next week. Do you think your race is indicative of what could happen there?"}, {"37f6": "I do. I think [Democrat Jon] Ossoff will take it and rightfully so. We need to be out fighting every single race. With Ossoff coming up, we need to be focused on that. We need to be focused on Montana [Editor’s Note: Montana will hold a special election for Ryan Zinke’s seat in May]."}, {"910e": "Whether it’s likely we win or unlikely we win, we need to be fighting each and every race. As I’ve shown here, just because something is designated safe [by Republicans] doesn’t mean it is. DCCC should be doing polls in every single race on a semi-regular basis to make sure that if they see chances like we had, they can react to it. That’s what the Republicans did and that’s why they were able to come in and save the race for Estes. The Republicans have shown that they give full effort in every race and that’s what DCCC needs to be doing as well."}, {"cb38": "Are you disappointed that DCCC didn’t make more of an investment in your race?"}, {"f526": "It’s impossible to say at this point whether or not it would have helped. It would have been nice to have seen more involvement and seen them reacting as quickly as the Republicans did. I just don’t want them to write off red states just because they looked at some poll from last year’s race where somebody won by 30 points. They need to be looking at the candidates and they need to be looking at the issues."}, {"1406": "Do you expect that more congressional races will be referendums on Trump’s presidency?"}, {"d18f": "I definitely think that they’re turning that way. Every race is going to be a combination of local and national issues and I think on the national stage, these races are going to be indicative. I think we sent a clear message yesterday that no race is safe."}, {"8b7b": "What’s next for you?"}, {"20bd": "It looks like we’re going to be running [for the same seat in] 2018 again, so we’re looking at all of the numbers today and we’re going to see where we’re at. We’ll make a formal filing once we make that final decision."}, {"4321": "Everybody’s got to remember, we did all of this in 60 days. Having 18 months to do it, I think that we’ll flip the seat."}], "content": "The Kansas Democrat who nearly pulled off the impossible has some advice for his party James Thompson says Democrats can’t ignore red states. James Thompson ran for Mike Pompeo’s congressional seat. CREDIT: SCREENSHOT James Thompson may not be heading to Congress, but not everyone is calling his loss in Kansas’ special congressional election a defeat. On Tuesday, Republican Ron Estes beat Thompson in the solidly Republican district by a margin of roughly five points. Just a few months ago, President Trump carried the district with a wide margin of 27 points. The Democratic Party never expected to win the seat. The Democratic Congressional Campaign Committee (DCCC) didn’t conduct polling or invest money in the race until the final days, when Republicans appeared to be worried and made a last minute push. In recent days, the GOP spent close to $100,000 on ads and dispatched party leaders like Sen. Ted Cruz (R-TX) to campaign and Speaker Paul Ryan (R-WI) to raise money for Estes. Trump already making life very difficult for Republicans trying to win electionsThe GOP won a safe Kansas seat with a slim margin.thinkprogress.org Speaking to ThinkProgress Wednesday morning, Thompson said that he is disappointed, but proud of his campaign. And while he was unable to swing the district to Democrats, he said a win was not impossible and that the party should not ignore red states. We saw last night with Ron Estes’ relatively small margin of victory that President Trump is already hurting Republicans trying to win congressional elections. Did you expect such a small margin? What do you think it means for Republicans running in other upcoming elections? I think ultraconservative Republicans anywhere in the United States need to be scared right now because we have shown that a motivated base and a well-run campaign can win. We did not lose to Estes so much as we lost to a president, a vice president, a speaker of the house, and multiple senators coming in and helping out. So in 2018 when there’s 435 races going on, he’s not going to be able to do that for everybody. I think that those congressmen and senators need to be looking at their positions on things, because there’s going to be backlash and there’s going to be people who lose their seats in 2018 as a result of it. How much do you think Trump’s incredibly high disapproval ratings played into this race? When you spoke to Kansas voters, did they talk about their dissatisfaction with the president? Here in Wichita, it played much greater. Getting out into more rural areas where people are more conservative, it played less. A lot of people here are still wanting to give President Trump a chance. There are a lot of people who are nervous. This was partially a referendum on him but mostly a referendum on [Gov. Sam] Brownback (R). Brownback was, until recently, the least popular governor in the country. Were voters more vocal about their dissatisfaction for him? Oh yes, very much so. Most of the state despises Sam Brownback for his failure to expand Medicaid, his refusal to reform the tax code, the education system that’s consistently held to be underfunded by our state supreme court, his attempt to grab power from our supreme court and to stack it himself. There’s a multitude of reasons. The economy here has gone in the tank under his watch and his failed policies. The Brownbacklash Is Finally Here: Kansas Primary Voters Send Conservatives Packingthinkprogress.org What about some of Trump’s signature policies, like his promises to repeal Obamacare and build a border wall? How did those play out among voters in the district? Did they hurt Estes? A lot of people here want good health care and affordable health care, so [Trump’s attempt to repeal the Affordable Care Act] definitely did not help him. The selection of Betsy DeVos actually was a huge thing here. There was a ten to one split against her and people told both our senators, ‘do not put that woman in as Secretary of Education, do not confirm her,’ and they did not listen. Education is very important here because of what we have going on at the state level. We’re constantly seeing cuts to education and a struggle to properly fund it, and when you’ve got somebody that’s being appointed Secretary of Education that wants to go to a voucher system that will destroy public education, there’s a lot of pushback. Do you think it ultimately helped or hurt you that Trump made a push this week to elect Estes? I think in the end, it was his desperation coming out to win that seat. It drove Republicans out to the polls. Between the president, vice president, and speaker doing things and the national Republican Party coming in and running these negative campaign ads that were blatantly false and attacked me on abortion, saying I support sex-selection abortion and late-term abortion and all of these things that I’ve never said, that riled up a lot of [anti-abortion] activists here and they were able to pull out a victory. Estes himself couldn’t defeat me. It took literally the president, vice president, Sen. Ted Cruz (R-TX), Sen. Pat Roberts (R-KS), and the national party to come in. You’re a civil rights lawyer. Did the Trump administration’s disdain for civil rights come up during your campaign? There was a lot of support for having a civil rights attorney go up there to help stand up when unconstitutional things are done. The [Muslim ban] came up quite a bit, and people wanted to have a civil rights lawyer who could stand up to those types of things. Trump won’t protect students’ civil rightsTrump says he wants to help disadvantaged students, but his administration’s actions will do the opposite.thinkprogress.org People are now turning their attention to Georgia’s sixth district, which will hold a special election for Tom Price’s seat next week. Do you think your race is indicative of what could happen there? I do. I think [Democrat Jon] Ossoff will take it and rightfully so. We need to be out fighting every single race. With Ossoff coming up, we need to be focused on that. We need to be focused on Montana [Editor’s Note: Montana will hold a special election for Ryan Zinke’s seat in May]. Whether it’s likely we win or unlikely we win, we need to be fighting each and every race. As I’ve shown here, just because something is designated safe [by Republicans] doesn’t mean it is. DCCC should be doing polls in every single race on a semi-regular basis to make sure that if they see chances like we had, they can react to it. That’s what the Republicans did and that’s why they were able to come in and save the race for Estes. The Republicans have shown that they give full effort in every race and that’s what DCCC needs to be doing as well. Are you disappointed that DCCC didn’t make more of an investment in your race? It’s impossible to say at this point whether or not it would have helped. It would have been nice to have seen more involvement and seen them reacting as quickly as the Republicans did. I just don’t want them to write off red states just because they looked at some poll from last year’s race where somebody won by 30 points. They need to be looking at the candidates and they need to be looking at the issues. Do you expect that more congressional races will be referendums on Trump’s presidency? I definitely think that they’re turning that way. Every race is going to be a combination of local and national issues and I think on the national stage, these races are going to be indicative. I think we sent a clear message yesterday that no race is safe. What’s next for you? It looks like we’re going to be running [for the same seat in] 2018 again, so we’re looking at all of the numbers today and we’re going to see where we’re at. We’ll make a formal filing once we make that final decision. Everybody’s got to remember, we did all of this in 60 days. Having 18 months to do it, I think that we’ll flip the seat. ", "name": "397", "child": "397_1\t397_2\t397_3\t397_4\t397_5\t397_6\t397_7\t397_8\t397_9\t397_10\t397_11\t397_12\t397_13\t397_14\t397_15\t397_16\t397_17\t397_18\t397_19\t397_20\t397_21\t397_22\t397_23\t397_24\t397_25", "timestamp": "Apr 12"}