{"parent": "", "title": "Trump just signed a bill allowing states to cut off funding to Planned Parenthood", "author": "Laurel Raymond", "sentences": [{"f3eb": "Trump just signed a bill allowing states to cut off funding to Planned Parenthood"}, {"b2ee": "The repeal could affect millions of women’s access to preventative services like birth control."}, {"3164": "In this Sept. 9, 2015, file photo, Planned Parenthood supporters rally for women’s access to reproductive health care on “National Pink Out Day’’ at Los Angeles City Hall. CREDIT: AP Photo/Nick Ut, File"}, {"b1ca": "President Donald Trump signed a bill into law on Thursday that would allow states to withhold federal money for family planning services, such as birth control, from Planned Parenthood clinics and other women’s health centers."}, {"dd28": "The bill is a repeal of an Obama-era regulation that said states couldn’t withhold Title X funding, which covers family planning and preventative care, from organizations just because those organizations also provide abortion care. This bill would roll back that protection, emboldening states to try to restrict such funding."}, {"261c": "The Senate passed the bill 51–50 in March, with Vice President Pence casting the tie breaking vote."}, {"e19b": "Four million people with low incomes rely on Title X for preventative health care. Roughly 1.5 million receive their Title X care at Planned Parenthood."}, {"ed83": "In practice, what this bill does is open the door for states to restrict these people from choosing certain health care providers — which may be, in many cases, the only health care provider nearby, the one they trust, or the only one that they can afford."}, {"5833": "While the bill does not defund Planned Parenthood directly, it is part of a wider GOP attack on the women’s health provider — and will likely encourage further efforts to cut federal funding off from Planned Parenthood."}, {"00b7": "It is already legally prohibited to use federal funds for abortion care, thanks to the Hyde Amendment. Currently, Planned Parenthood gets federal funding through programs like Title X and Medicaid, which cover STD testing, cancer screenings, birth control access, and other health needs for people who wouldn’t be able to afford them."}, {"966b": "In reality, federally defunding Planned Parenthood — as the GOP proposed to do in their failed health care bill — actually means preventing people who rely on it from accessing health care. And while anti-Planned Parenthood politicians argue that people can go elsewhere, for many low-income and rural women and men, Planned Parenthood clinics are their only option."}, {"ae72": "In last ditch effort for votes, Trump says goal of Trumpcare is to end Planned ParenthoodTrump quite literally plays politics with women’s health.thinkprogress.org"}, {"29e0": "Experts also point out that if Planned Parenthood clinics are shuttered or restricted, there simply aren’t enough other clinics to meet demand for things like contraceptive care, which forms a large portion of Planned Parenthood’s operations."}, {"af74": "“The bottom line is, it’s simply unrealistic to expect community health centers to step up and fill the void in the family planning safety nets, ” Kinsey Hasstedt, a senior policy manager at the Guttmacher Institute told the Christian Science Monitor."}, {"d08a": "That means that if states use this new freedom to discriminate against Planned Parenthood clinics, they will in fact be putting low-income Americans’ ability to access birth control and other reproductive care in jeopardy."}], "content": "Trump just signed a bill allowing states to cut off funding to Planned Parenthood The repeal could affect millions of women’s access to preventative services like birth control. In this Sept. 9, 2015, file photo, Planned Parenthood supporters rally for women’s access to reproductive health care on “National Pink Out Day’’ at Los Angeles City Hall. CREDIT: AP Photo/Nick Ut, File President Donald Trump signed a bill into law on Thursday that would allow states to withhold federal money for family planning services, such as birth control, from Planned Parenthood clinics and other women’s health centers. The bill is a repeal of an Obama-era regulation that said states couldn’t withhold Title X funding, which covers family planning and preventative care, from organizations just because those organizations also provide abortion care. This bill would roll back that protection, emboldening states to try to restrict such funding. The Senate passed the bill 51–50 in March, with Vice President Pence casting the tie breaking vote. Four million people with low incomes rely on Title X for preventative health care. Roughly 1.5 million receive their Title X care at Planned Parenthood. In practice, what this bill does is open the door for states to restrict these people from choosing certain health care providers — which may be, in many cases, the only health care provider nearby, the one they trust, or the only one that they can afford. While the bill does not defund Planned Parenthood directly, it is part of a wider GOP attack on the women’s health provider — and will likely encourage further efforts to cut federal funding off from Planned Parenthood. It is already legally prohibited to use federal funds for abortion care, thanks to the Hyde Amendment. Currently, Planned Parenthood gets federal funding through programs like Title X and Medicaid, which cover STD testing, cancer screenings, birth control access, and other health needs for people who wouldn’t be able to afford them. In reality, federally defunding Planned Parenthood — as the GOP proposed to do in their failed health care bill — actually means preventing people who rely on it from accessing health care. And while anti-Planned Parenthood politicians argue that people can go elsewhere, for many low-income and rural women and men, Planned Parenthood clinics are their only option. In last ditch effort for votes, Trump says goal of Trumpcare is to end Planned ParenthoodTrump quite literally plays politics with women’s health.thinkprogress.org Experts also point out that if Planned Parenthood clinics are shuttered or restricted, there simply aren’t enough other clinics to meet demand for things like contraceptive care, which forms a large portion of Planned Parenthood’s operations. “The bottom line is, it’s simply unrealistic to expect community health centers to step up and fill the void in the family planning safety nets, ” Kinsey Hasstedt, a senior policy manager at the Guttmacher Institute told the Christian Science Monitor. That means that if states use this new freedom to discriminate against Planned Parenthood clinics, they will in fact be putting low-income Americans’ ability to access birth control and other reproductive care in jeopardy. ", "name": "398", "child": "398_1\t398_2\t398_3\t398_4\t398_5", "timestamp": "Apr 13"}