{"parent": "", "title": "Is Thunder-Warriors Even a Rivalry Anymore?", "author": "Shea Serrano", "sentences": [{"e5a9": "Is Thunder-Warriors Even a Rivalry Anymore?"}, {"f0d3": "And five other questions from Wednesday’s one-sided game"}, {"7438": "Thunder-Warriors is the second-best nonrivalry that’s actually a rivalry in the NBA right now. First place is Cavs-Warriors, and theirs is a nonrivalry that’s actually a rivalry in that LeBron James says the Warriors aren’t their rivals but of course they are, what else could they be? Thunder-Warriors is a nonrivalry that’s actually a rivalry in that Russell Westbrook and Kevin Durant are now (what would appear to be) rivals, so, yes, that’s the rivalry, but it’s a nonrivalry in that the Thunder simply cannot compete with the Warriors in actual basketball. So anyway, they played for the second time this season on Wednesday. The Warriors won soundly again, this time 121–100, which makes sense because they are several levels better than the Thunder. But that’s not the point of this article. The point of this article is to ask the six main questions that came up from the game, and then to answer them."}, {"dc4e": "1. Are the Warriors Kevin Durant’s team yet?"}, {"d329": "It feels weird to say that the Warriors are anybody other than Steph Curry’s team, given that he was their best player when they won a championship in 2015 and also their best player when they won a record 73 regular-season games in 2016. But I don’t know. It’s starting to feel that way, isn’t it? I’m sure Golden State fans will argue otherwise — that it’s Steph’s team and that it will be Steph’s team as long as he’s there — and I get that. I understand that impulse. I appreciate the urge to stand up for him, because he absolutely deserves it. But again: I don’t know. Kevin has a higher scoring average than Steph, a higher rebounding average, more win shares, a higher VORP, a higher BPM, and a higher PER. I’m not all the way ready to say that Durant snatched that particular title away from Steph, but I’m also not willing to ignore the conversation anymore, either."}, {"fe1c": "(For the record, I am still firmly pro-Steph. I don’t think the Warriors can ever truly be KD’s team until either (a) he goes absolutely nuclear in the playoffs for at least two seasons and wins them a couple of championships in such a devastatingly dominant fashion that it becomes impossible to argue it’s not his team, or (b) Steph leaves Golden State.)"}, {"3691": "2. Should Enes Kanter have been allowed to come out of the locker room after halftime?"}, {"5b96": "You’re asking in response to that Zaza-vs.-Russell flagrant foul at the end of the first half, right? Then no. He should not have been allowed to come out of the locker room after halftime."}, {"d112": "To recap: In the final seconds of the first half, Westbrook, out several feet past the 3-point line, goaded Zaza Pachulia into fouling him on a pick-and-roll, but I say “goaded” the same way you’d say someone goaded someone else into hitting them with a baseball bat. Russ pump-faked, Zaza went up, Russ leaned into him, and then Zaza clobbered him. Russ fell backward from the blow, immediately grabbing his face (Zaza looked to have hit him during the tangling), and then Zaza stood over him, glaring, snarling, radiating evil. It was a neat moment. But it went unfinished. Because what should’ve happened there is Kanter, who was standing just several feet away, should’ve run over and shoved Zaza in the back, or drop-kicked Zaza in the back, or mashed Zaza with a folding chair. Something. Anything. LITERALLY ANYTHING. But none of those things is what he did. What he did was nothing."}, {"507d": "I had never before in my life missed Steven Adams (home in OKC recovering from a concussion) more than I did right there and then. I halfway hoped the arena was all of a sudden gonna fill with the sound of breaking glass and then Adams was gonna come swaggering out of the tunnel on some “Stone Cold” Steve Austin shit, but alas. Nothing. Poor Russell just laid there, beaten, battered, his honor left undefended."}, {"ca7c": "So, no: Enes Kanter should not have been allowed to come out of the locker room after halftime. He should’ve just sat in there and done nothing, same as he did when Russ needed him the most."}, {"c746": "(Getty Images)"}, {"1ea1": "3. Will the Thunder ever actually beat the Warriors?"}, {"ca54": "No. They’re just too many pieces behind. Best-case scenario is that the Thunder are able to sneak into the fifth spot in the Western Conference by the end of the season. That would get them a first-round playoff matchup with the Clippers, who they should probably lose to, but the Clippers always end up tumbling down a mountainside just a few games into the postseason, so maybe the Thunder get lucky and catch them at that moment and beat them. That means we’d get a Warriors-Thunder second-round matchup, and that series would 100 percent be over quickly, but it’d at least give Westbrook a minimum of four games to try to flake away Durant’s self-worth. He could just do things like — OK, let’s say every time Durant hit a shot or whatever, Russ could stand near him and talk loudly enough that Durant could hear him but not so loud that it could be taken as Russ talking to him. And Russ could just say things like, “You still ain’t shit,” and he could say it literally every time Durant made a shot. That’d be neat. It wouldn’t be an equitable amount of revenge for Durant reportedly telling Russ he was leaving OKC via text message, but it’d at least be a step toward it."}, {"c72f": "4. Does Andre Roberson know that he’s allowed to shoot the ball?"}, {"9edc": "Man. I really don’t think so, no. When the Thunder are on offense, it looks like this: they’re swinging the ball around the 3-point line a bit, things are flowing, and then it ends up in Roberson’s hands and it’s like one of those time-travel movies they show on the Disney Channel where some kids travel back to see dinosaurs or whatever and someone hands a caveman a PlayStation Vita and the caveman is like, “What the fuck is this?” and he just stares at it and flips it over and shakes it and whatnot. That’s Roberson when he gets the ball. It’s wild to watch. Draymond, who was ““guarding”” Roberson during the game, sagged off of him 10, 15, 20 feet every time. There was one play where Roberson caught the ball on the left wing and Draymond legit just walked to the bench and sat down while Roberson prayed for all of the electricity in America to shut off so he could just set the ball on the floor and walk away without anyone seeing him. I don’t like it. It’s a little embarrassing. I hope Roberson starts shooting soon."}, {"45de": "5. Do easy shots make Kevin Durant feel less like a superstar?"}, {"0b7c": "This is a weird question, but a legitimate one, I think. KD put up 40 points in the game on 16 shots, many of which were either wide-open 3s or dunks. And let me be clear: Those sorts of shots are certainly better for a team’s performance, yes. But what I’m saying is that, I mean, it just makes things a little less interesting as an observer. It’s fantastic to watch the Warriors when they get into their Total Team Destruction mode and do something silly like have 38 assists on 45 shots for the game or whatever. That’s great and beautiful basketball, obviously. It’s just that sometimes I miss a good Kevin Durant iso, you know what I’m saying? I miss him getting the ball, staring at the defense, then deciding, “You know what? Let me fuck up y’all’s life for the next few minutes,” and then going berserk, like he did to my beloved Spurs in Game 4 of their 2012 series when he scored 16 points in a row over a five-minute stretch."}, {"0bae": "6. Who’s going to be the first between Durant and Westbrook to talk to the other?"}, {"bb3d": "In Season 5 of Sons of Anarchy, a television show about a biker gang in a tiny American town, a former U.S. marshal named Lee tries to get one of the gang’s imprisoned members, Otto, to snitch on himself, or his gang, or anybody, really. It’s this whole back-and-forth thing that happens several times throughout the season, Lee getting more and more aggressive in his means of attempting to force Otto to talk. Finally, come the 13th episode, Otto has had enough. He’s in an interrogation room, and there’s a two-way mirror in there and he knows Lee is on the other side, watching. A different law enforcement officer walks in, turns on a voice recorder, sits down, turns on a camcorder, and asks Otto to state his name for the record. Otto sighs, swallows, leans forward, pauses for a second, then sticks his tongue all the way out and slams his chin down onto the table, effectively biting off his own tongue. The officer freaks and runs out of the room. Otto picks up the tongue, then throws it at the mirror."}, {"20ba": "Anyway: That’s Westbrook. There’s (I’m guessing) a zero percent chance it’s him who opens that line of communication. (The two reportedly haven’t spoken since Durant left for the Warriors.) I have to assume he’d sooner bite his own tongue off than pick up the phone and call KD. If these two are ever going to talk again, it’s going to be Durant who makes it happen."}], "content": "Is Thunder-Warriors Even a Rivalry Anymore? And five other questions from Wednesday’s one-sided game Thunder-Warriors is the second-best nonrivalry that’s actually a rivalry in the NBA right now. First place is Cavs-Warriors, and theirs is a nonrivalry that’s actually a rivalry in that LeBron James says the Warriors aren’t their rivals but of course they are, what else could they be? Thunder-Warriors is a nonrivalry that’s actually a rivalry in that Russell Westbrook and Kevin Durant are now (what would appear to be) rivals, so, yes, that’s the rivalry, but it’s a nonrivalry in that the Thunder simply cannot compete with the Warriors in actual basketball. So anyway, they played for the second time this season on Wednesday. The Warriors won soundly again, this time 121–100, which makes sense because they are several levels better than the Thunder. But that’s not the point of this article. The point of this article is to ask the six main questions that came up from the game, and then to answer them. 1. Are the Warriors Kevin Durant’s team yet? It feels weird to say that the Warriors are anybody other than Steph Curry’s team, given that he was their best player when they won a championship in 2015 and also their best player when they won a record 73 regular-season games in 2016. But I don’t know. It’s starting to feel that way, isn’t it? I’m sure Golden State fans will argue otherwise — that it’s Steph’s team and that it will be Steph’s team as long as he’s there — and I get that. I understand that impulse. I appreciate the urge to stand up for him, because he absolutely deserves it. But again: I don’t know. Kevin has a higher scoring average than Steph, a higher rebounding average, more win shares, a higher VORP, a higher BPM, and a higher PER. I’m not all the way ready to say that Durant snatched that particular title away from Steph, but I’m also not willing to ignore the conversation anymore, either. (For the record, I am still firmly pro-Steph. I don’t think the Warriors can ever truly be KD’s team until either (a) he goes absolutely nuclear in the playoffs for at least two seasons and wins them a couple of championships in such a devastatingly dominant fashion that it becomes impossible to argue it’s not his team, or (b) Steph leaves Golden State.) 2. Should Enes Kanter have been allowed to come out of the locker room after halftime? You’re asking in response to that Zaza-vs.-Russell flagrant foul at the end of the first half, right? Then no. He should not have been allowed to come out of the locker room after halftime. To recap: In the final seconds of the first half, Westbrook, out several feet past the 3-point line, goaded Zaza Pachulia into fouling him on a pick-and-roll, but I say “goaded” the same way you’d say someone goaded someone else into hitting them with a baseball bat. Russ pump-faked, Zaza went up, Russ leaned into him, and then Zaza clobbered him. Russ fell backward from the blow, immediately grabbing his face (Zaza looked to have hit him during the tangling), and then Zaza stood over him, glaring, snarling, radiating evil. It was a neat moment. But it went unfinished. Because what should’ve happened there is Kanter, who was standing just several feet away, should’ve run over and shoved Zaza in the back, or drop-kicked Zaza in the back, or mashed Zaza with a folding chair. Something. Anything. LITERALLY ANYTHING. But none of those things is what he did. What he did was nothing. I had never before in my life missed Steven Adams (home in OKC recovering from a concussion) more than I did right there and then. I halfway hoped the arena was all of a sudden gonna fill with the sound of breaking glass and then Adams was gonna come swaggering out of the tunnel on some “Stone Cold” Steve Austin shit, but alas. Nothing. Poor Russell just laid there, beaten, battered, his honor left undefended. So, no: Enes Kanter should not have been allowed to come out of the locker room after halftime. He should’ve just sat in there and done nothing, same as he did when Russ needed him the most. (Getty Images) 3. Will the Thunder ever actually beat the Warriors? No. They’re just too many pieces behind. Best-case scenario is that the Thunder are able to sneak into the fifth spot in the Western Conference by the end of the season. That would get them a first-round playoff matchup with the Clippers, who they should probably lose to, but the Clippers always end up tumbling down a mountainside just a few games into the postseason, so maybe the Thunder get lucky and catch them at that moment and beat them. That means we’d get a Warriors-Thunder second-round matchup, and that series would 100 percent be over quickly, but it’d at least give Westbrook a minimum of four games to try to flake away Durant’s self-worth. He could just do things like — OK, let’s say every time Durant hit a shot or whatever, Russ could stand near him and talk loudly enough that Durant could hear him but not so loud that it could be taken as Russ talking to him. And Russ could just say things like, “You still ain’t shit,” and he could say it literally every time Durant made a shot. That’d be neat. It wouldn’t be an equitable amount of revenge for Durant reportedly telling Russ he was leaving OKC via text message, but it’d at least be a step toward it. 4. Does Andre Roberson know that he’s allowed to shoot the ball? Man. I really don’t think so, no. When the Thunder are on offense, it looks like this: they’re swinging the ball around the 3-point line a bit, things are flowing, and then it ends up in Roberson’s hands and it’s like one of those time-travel movies they show on the Disney Channel where some kids travel back to see dinosaurs or whatever and someone hands a caveman a PlayStation Vita and the caveman is like, “What the fuck is this?” and he just stares at it and flips it over and shakes it and whatnot. That’s Roberson when he gets the ball. It’s wild to watch. Draymond, who was ““guarding”” Roberson during the game, sagged off of him 10, 15, 20 feet every time. There was one play where Roberson caught the ball on the left wing and Draymond legit just walked to the bench and sat down while Roberson prayed for all of the electricity in America to shut off so he could just set the ball on the floor and walk away without anyone seeing him. I don’t like it. It’s a little embarrassing. I hope Roberson starts shooting soon. 5. Do easy shots make Kevin Durant feel less like a superstar? This is a weird question, but a legitimate one, I think. KD put up 40 points in the game on 16 shots, many of which were either wide-open 3s or dunks. And let me be clear: Those sorts of shots are certainly better for a team’s performance, yes. But what I’m saying is that, I mean, it just makes things a little less interesting as an observer. It’s fantastic to watch the Warriors when they get into their Total Team Destruction mode and do something silly like have 38 assists on 45 shots for the game or whatever. That’s great and beautiful basketball, obviously. It’s just that sometimes I miss a good Kevin Durant iso, you know what I’m saying? I miss him getting the ball, staring at the defense, then deciding, “You know what? Let me fuck up y’all’s life for the next few minutes,” and then going berserk, like he did to my beloved Spurs in Game 4 of their 2012 series when he scored 16 points in a row over a five-minute stretch. 6. Who’s going to be the first between Durant and Westbrook to talk to the other? In Season 5 of Sons of Anarchy, a television show about a biker gang in a tiny American town, a former U.S. marshal named Lee tries to get one of the gang’s imprisoned members, Otto, to snitch on himself, or his gang, or anybody, really. It’s this whole back-and-forth thing that happens several times throughout the season, Lee getting more and more aggressive in his means of attempting to force Otto to talk. Finally, come the 13th episode, Otto has had enough. He’s in an interrogation room, and there’s a two-way mirror in there and he knows Lee is on the other side, watching. A different law enforcement officer walks in, turns on a voice recorder, sits down, turns on a camcorder, and asks Otto to state his name for the record. Otto sighs, swallows, leans forward, pauses for a second, then sticks his tongue all the way out and slams his chin down onto the table, effectively biting off his own tongue. The officer freaks and runs out of the room. Otto picks up the tongue, then throws it at the mirror. Anyway: That’s Westbrook. There’s (I’m guessing) a zero percent chance it’s him who opens that line of communication. (The two reportedly haven’t spoken since Durant left for the Warriors.) I have to assume he’d sooner bite his own tongue off than pick up the phone and call KD. If these two are ever going to talk again, it’s going to be Durant who makes it happen. ", "name": "40", "child": "40_1\t40_2\t40_3\t40_4\t40_5\t40_6\t40_7\t40_8\t40_9\t40_10\t40_11\t40_12\t40_13\t40_14\t40_15\t40_16\t40_17", "timestamp": "Jan 19"}