{"parent": "", "title": "Adam Schiff’s Tears to be Collected", "author": "borne wilder", "sentences": [{"2be4": "Adam Schiff’s Tears to be Collected"}, {"a00e": "The Army Dept. of Engineers have drawn up plans to collect the abundance of tears Adam Schiff has been shedding over being cut out of the loop by the Devil Nunes. “This isn’t the first time he’s cried, but it’s the longest,” said a fellow Intelligence Committee member."}, {"3dad": "A desalination facility is being set up in the San Luis Obispo area, where the salt will be removed and the tears will be stored indefinitely.A Department of Engineers spox said, “If he keeps weeping and wailing like he is, we should have plenty to irrigate much of the Napa Valley in the fast approaching dry years the Climate Change enthusiasts are predicting.”"}, {"b312": "A smaller facility was set up outside the Pelosi home but was quickly disassembled after experts learned that Nancy’s tear ducts dried up during the Reagan administration."}], "content": "Adam Schiff’s Tears to be Collected The Army Dept. of Engineers have drawn up plans to collect the abundance of tears Adam Schiff has been shedding over being cut out of the loop by the Devil Nunes. “This isn’t the first time he’s cried, but it’s the longest,” said a fellow Intelligence Committee member. A desalination facility is being set up in the San Luis Obispo area, where the salt will be removed and the tears will be stored indefinitely.A Department of Engineers spox said, “If he keeps weeping and wailing like he is, we should have plenty to irrigate much of the Napa Valley in the fast approaching dry years the Climate Change enthusiasts are predicting.” A smaller facility was set up outside the Pelosi home but was quickly disassembled after experts learned that Nancy’s tear ducts dried up during the Reagan administration. ", "name": "402", "child": "402_1\t402_2", "timestamp": "Mar 27"}