{"parent": "", "title": "Stunning drops in solar and wind costs turn global power market upside down", "author": "Joe Romm", "sentences": [{"6557": "Stunning drops in solar and wind costs turn global power market upside down"}, {"ccb3": "The world built more renewables for far less money last year, report UN and Bloomberg New Energy Finance."}, {"b80a": "Last year, solar in Chile set a record low global price for unsubsidized electricity by any technology. CREDIT: ACERA."}, {"2758": "Stunning drops in the cost of wind and solar energy have turned the global power market upside down."}, {"747c": "For years, opponents of renewable power, like President Donald Trump, have argued they simply aren’t affordable. The reality is quite different."}, {"5e0b": "Unsubsidized renewables have become the cheapest source of new power — by far — in more and more countries, according to a new report from the United Nations and Bloomberg New Energy Finance (BNEF)."}, {"0da8": "Chart of the year: ‘Incredible’ price drops jumpstart clean energy revolutionNew DOE report details latest advances in solar, wind, LED lights, batteries, and electric cars.thinkprogress.org"}, {"1185": "In just one year, the cost of solar generation worldwide dropped on average 17 percent, the report found. The average costs for onshore wind dropped 18 percent last year, while those for offshore wind fell a whopping 28 percent."}, {"1569": "The result is “more bang for the buck,” as the U.N. and BNEF put it. Last year saw 138.5 gigawatts of new renewable capacity. That not only beat the 2015 record of 127.5 GW, but it was built with a total investment that was 23 percent lower than in 2015."}, {"aded": "CREDIT: U.N. and BNEF"}, {"f7d5": "“After the dramatic cost reductions of the past few years,” explained BNEF chair Michael Liebreich, “unsubsidised wind and solar can provide the lowest cost new electrical power in an increasing number of countries, even in the developing world — sometimes by a factor of two.”"}, {"da84": "“It’s a whole new world,” Liebreich said. “Instead of having to subsidise renewables, now authorities may have to subsidise natural gas plants to help them provide grid reliability.”"}, {"781b": "How cheap are renewables now? The report lists “a hectic series of milestones for declining costs” taken from actual auctions around the world in 2016:"}, {"d359": "Note that $29.10 per MWh is 2.91 cents per kilowatt-hour. For context, the average U.S. residential price for electricity is 12 cents per kWh."}, {"2b24": "“Solar power delivers cheapest unsubsidised electricity ever, anywhere, by any technology,” Liebreich tweeted back in August regarding the price of solar in Chile, as we reported. In that same auction, the price of a new coal power plant was nearly twice as high."}, {"3f8c": "Energy experts give Trump the hard truth: You can’t bring coal backCoal wasn’t killed by a political “war” — cheap renewables and fracked gas were the culprits.thinkprogress.org"}, {"e5c4": "President Trump may push as hard as he wants on new coal — opening more public lands to mining, gutting President Obama’s Clean Power Plan. But the hard reality of rapidly declining costs for renewables (and storage) makes clear he will be pushing on a string, and a very dirty one at that."}], "content": "Stunning drops in solar and wind costs turn global power market upside down The world built more renewables for far less money last year, report UN and Bloomberg New Energy Finance. Last year, solar in Chile set a record low global price for unsubsidized electricity by any technology. CREDIT: ACERA. Stunning drops in the cost of wind and solar energy have turned the global power market upside down. For years, opponents of renewable power, like President Donald Trump, have argued they simply aren’t affordable. The reality is quite different. Unsubsidized renewables have become the cheapest source of new power — by far — in more and more countries, according to a new report from the United Nations and Bloomberg New Energy Finance (BNEF). Chart of the year: ‘Incredible’ price drops jumpstart clean energy revolutionNew DOE report details latest advances in solar, wind, LED lights, batteries, and electric cars.thinkprogress.org In just one year, the cost of solar generation worldwide dropped on average 17 percent, the report found. The average costs for onshore wind dropped 18 percent last year, while those for offshore wind fell a whopping 28 percent. The result is “more bang for the buck,” as the U.N. and BNEF put it. Last year saw 138.5 gigawatts of new renewable capacity. That not only beat the 2015 record of 127.5 GW, but it was built with a total investment that was 23 percent lower than in 2015. CREDIT: U.N. and BNEF “After the dramatic cost reductions of the past few years,” explained BNEF chair Michael Liebreich, “unsubsidised wind and solar can provide the lowest cost new electrical power in an increasing number of countries, even in the developing world — sometimes by a factor of two.” “It’s a whole new world,” Liebreich said. “Instead of having to subsidise renewables, now authorities may have to subsidise natural gas plants to help them provide grid reliability.” How cheap are renewables now? The report lists “a hectic series of milestones for declining costs” taken from actual auctions around the world in 2016: Note that $29.10 per MWh is 2.91 cents per kilowatt-hour. For context, the average U.S. residential price for electricity is 12 cents per kWh. “Solar power delivers cheapest unsubsidised electricity ever, anywhere, by any technology,” Liebreich tweeted back in August regarding the price of solar in Chile, as we reported. In that same auction, the price of a new coal power plant was nearly twice as high. Energy experts give Trump the hard truth: You can’t bring coal backCoal wasn’t killed by a political “war” — cheap renewables and fracked gas were the culprits.thinkprogress.org President Trump may push as hard as he wants on new coal — opening more public lands to mining, gutting President Obama’s Clean Power Plan. But the hard reality of rapidly declining costs for renewables (and storage) makes clear he will be pushing on a string, and a very dirty one at that. ", "name": "409", "child": "409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16\t409_17\t409_18\t409_19\t409_20\t409_21\t409_22", "timestamp": "Apr 6"}