{"parent": "", "title": "EPA staff ‘openly mocking’ Trump’s ‘arrogant and callous’ policies, says retiree", "author": "Joe Romm", "sentences": [{"624e": "EPA staff ‘openly mocking’ Trump’s ‘arrogant and callous’ policies, says retiree"}, {"f7ea": "30-year veteran compares EPA chief’s climate denial to lies tobacco executives told Congress"}, {"ed6f": "Mike Cox retired after three decades at the Environmental Protection Agency on March 31 with a scathing letter for EPA administrator Scott Pruitt."}, {"202c": "Team Trump is apparently an open joke to their staff — something even the Reagan and Bush administrations never experienced. Morale has collapsed, Cox notes."}, {"5a2a": "“I have worked under six administrations with political appointees leading EPA from both parties,” Cox wrote on his last day on the job. “This is the first time I remember staff openly dismissing and mocking the environmental policies of an administration and by extension you.”"}, {"9759": "Even Fox News slams EPA chief’s climate denial: ‘All kinds of studies contradict you’Chris Wallace utterly debunks Scott Pruitt’s lies about the central role carbon pollution plays in warming.thinkprogress.org"}, {"753a": "The 60-year-old Cox, who worked on climate change for EPA’s Region 10, which covers Alaska and the northwest, was especially harsh on Pruitt’s science denial."}, {"a13a": "Cox called Pruitt’s claim on national TV that CO2 is not a primary contributor to recent global warming “shocking” — and directly compared it to the congressional hearing with the CEOs of the major tobacco companies where “all of the CEOs categorically denied that smoking causes lung cancer.”"}, {"86da": "What’s the result of this denial? “You will continue to undermine your credibility and integrity with EPA staff, and the majority of the public,” Cox wrote, “if you continue to question this basic science of climate change.”"}, {"b71a": "In the five-page letter, Cox slams the president for the “false and misleading” claim that killing EPA carbon pollution standards will bring back coal jobs."}, {"0fe9": "Energy experts give Trump the hard truth: You can’t bring coal backCoal wasn’t killed by a political “war” — cheap renewables and fracked gas were the culprits.thinkprogress.org"}, {"c5c7": "In a section on “indefensible budget cuts,” Cox slams Pruitt for standing by while the White House gutted the overall EPA budget. These cuts have real consequences for real people, he says."}, {"ce4e": "Cox directly asks Pruitt:"}, {"c355": "The entire letter from Cox is a must read for anyone who cares about clean air, clean water, and our children’s future."}], "content": "EPA staff ‘openly mocking’ Trump’s ‘arrogant and callous’ policies, says retiree 30-year veteran compares EPA chief’s climate denial to lies tobacco executives told Congress Mike Cox retired after three decades at the Environmental Protection Agency on March 31 with a scathing letter for EPA administrator Scott Pruitt. Team Trump is apparently an open joke to their staff — something even the Reagan and Bush administrations never experienced. Morale has collapsed, Cox notes. “I have worked under six administrations with political appointees leading EPA from both parties,” Cox wrote on his last day on the job. “This is the first time I remember staff openly dismissing and mocking the environmental policies of an administration and by extension you.” Even Fox News slams EPA chief’s climate denial: ‘All kinds of studies contradict you’Chris Wallace utterly debunks Scott Pruitt’s lies about the central role carbon pollution plays in warming.thinkprogress.org The 60-year-old Cox, who worked on climate change for EPA’s Region 10, which covers Alaska and the northwest, was especially harsh on Pruitt’s science denial. Cox called Pruitt’s claim on national TV that CO2 is not a primary contributor to recent global warming “shocking” — and directly compared it to the congressional hearing with the CEOs of the major tobacco companies where “all of the CEOs categorically denied that smoking causes lung cancer.” What’s the result of this denial? “You will continue to undermine your credibility and integrity with EPA staff, and the majority of the public,” Cox wrote, “if you continue to question this basic science of climate change.” In the five-page letter, Cox slams the president for the “false and misleading” claim that killing EPA carbon pollution standards will bring back coal jobs. Energy experts give Trump the hard truth: You can’t bring coal backCoal wasn’t killed by a political “war” — cheap renewables and fracked gas were the culprits.thinkprogress.org In a section on “indefensible budget cuts,” Cox slams Pruitt for standing by while the White House gutted the overall EPA budget. These cuts have real consequences for real people, he says. Cox directly asks Pruitt: The entire letter from Cox is a must read for anyone who cares about clean air, clean water, and our children’s future. ", "name": "410", "child": "410_1\t410_2\t410_3\t410_4\t410_5\t410_6\t410_7\t410_8\t410_9\t410_10\t410_11\t410_12\t410_13\t410_14\t410_15\t410_16\t410_17\t410_18\t410_19\t410_20\t410_21\t410_22", "timestamp": "Apr 10"}