{"parent": "", "title": "Solar employs more U.S. workers than Apple, Google, and Facebook combined", "author": "Joe Romm", "sentences": [{"e39c": "Solar employs more U.S. workers than Apple, Google, and Facebook combined"}, {"858c": "The global solar market has soared 30-fold in just nine years."}, {"bb1f": "A rooftop is covered with solar panels at the Brooklyn Navy Yard, February 2017. CREDIT: AP/Mark Lennihan"}, {"1c45": "The rapid rise of solar power is one of the most astonishing transformations in the history of global energy use."}, {"90ee": "A decade ago, solar photovoltaics (PV) was just a tiny sapling, easily dismissed by fossil fuel advocates. Today, after a remarkable 30-fold increase in PV sales in just nine years, it has become a giant redwood forest."}, {"ad2b": "And the giant is still growing, as GTM Research reported in its latest Global Solar Demand Monitor for the first quarter of 2017."}, {"0179": "Last year alone saw a stunning jump in annual global PV demand of more than 50 percent. And GTM projects that demand for solar power will continue to rise. This transformation has been driven by steadily plummeting costs for solar (and other enabling technologies)."}, {"bb78": "Indeed, India’s Minister for Power, Coal, New & Renewable Energy and Mines reported Tuesday on a record low price for solar power in a competitive auction: 3.15 rupees (5 U.S. cents) per kilowatt-hour."}, {"0ba1": "In California, solar’s share of demand actually topped 50 percent for a few hours on March 11. The U.S. Energy Information Administration (EIA) reported last week that from 11 a.m. to 2 p.m. on the 11th utility-scale solar generation in California “accounted for almost 40 percent of net grid power produced.”"}, {"b00b": "In addition, homes and businesses also generate solar power with rooftop PV, generating some “4 million kilowatthours (kWh) during the peak solar hours,” that day the IEA calculates, “suggesting that the total solar share of gross demand probably exceeded 50 percent during the mid-day hours.”"}, {"cd6e": "CREDIT: TheAtlas.com"}, {"9df0": "As of 2016, California has just over 100,000 solar jobs — a one-third increase over the previous year. The country added a record 50,000 solar jobs last year."}, {"a63e": "The U.S. solar industry currently has more than 260,000 workers nationwide, according to The Solar Foundation. Their executive director, Andrea Luecke, points out that’s more workers than “Apple, Google, Facebook and Amazon combined.” (As a point of clarification, Amazon has added jobs at a torrid pace in the last couple of years, so the 260,000 solar jobs is ‘only’ more than Apple, Google, and Facebook combined.)"}, {"04f1": "Trump’s budget sabotages America’s best chance to add millions of high-wage jobsTrump guts clean energy funding as Beijing plans to invest $360 billion by 2020, creating 13 million jobs.thinkprogress.org"}, {"b6e1": "Tragically, President Donald Trump and his allies are working feverishly to undermine clean energy funding and policies at the national and state level. The solar and clean energy revolutions are unstoppable at this point, but which country ends up with how many of those jobs is still very much in question."}], "content": "Solar employs more U.S. workers than Apple, Google, and Facebook combined The global solar market has soared 30-fold in just nine years. A rooftop is covered with solar panels at the Brooklyn Navy Yard, February 2017. CREDIT: AP/Mark Lennihan The rapid rise of solar power is one of the most astonishing transformations in the history of global energy use. A decade ago, solar photovoltaics (PV) was just a tiny sapling, easily dismissed by fossil fuel advocates. Today, after a remarkable 30-fold increase in PV sales in just nine years, it has become a giant redwood forest. And the giant is still growing, as GTM Research reported in its latest Global Solar Demand Monitor for the first quarter of 2017. Last year alone saw a stunning jump in annual global PV demand of more than 50 percent. And GTM projects that demand for solar power will continue to rise. This transformation has been driven by steadily plummeting costs for solar (and other enabling technologies). Indeed, India’s Minister for Power, Coal, New & Renewable Energy and Mines reported Tuesday on a record low price for solar power in a competitive auction: 3.15 rupees (5 U.S. cents) per kilowatt-hour. In California, solar’s share of demand actually topped 50 percent for a few hours on March 11. The U.S. Energy Information Administration (EIA) reported last week that from 11 a.m. to 2 p.m. on the 11th utility-scale solar generation in California “accounted for almost 40 percent of net grid power produced.” In addition, homes and businesses also generate solar power with rooftop PV, generating some “4 million kilowatthours (kWh) during the peak solar hours,” that day the IEA calculates, “suggesting that the total solar share of gross demand probably exceeded 50 percent during the mid-day hours.” CREDIT: TheAtlas.com As of 2016, California has just over 100,000 solar jobs — a one-third increase over the previous year. The country added a record 50,000 solar jobs last year. The U.S. solar industry currently has more than 260,000 workers nationwide, according to The Solar Foundation. Their executive director, Andrea Luecke, points out that’s more workers than “Apple, Google, Facebook and Amazon combined.” (As a point of clarification, Amazon has added jobs at a torrid pace in the last couple of years, so the 260,000 solar jobs is ‘only’ more than Apple, Google, and Facebook combined.) Trump’s budget sabotages America’s best chance to add millions of high-wage jobsTrump guts clean energy funding as Beijing plans to invest $360 billion by 2020, creating 13 million jobs.thinkprogress.org Tragically, President Donald Trump and his allies are working feverishly to undermine clean energy funding and policies at the national and state level. The solar and clean energy revolutions are unstoppable at this point, but which country ends up with how many of those jobs is still very much in question. ", "name": "411", "child": "411_1\t411_2\t411_3\t411_4\t411_5\t411_6\t411_7\t411_8\t411_9\t411_10", "timestamp": "Apr 12"}