{"parent": "", "title": "EPA chief Scott Pruitt tells ‘Fox & Friends’ U.S. should exit Paris climate deal", "author": "Mark Hand", "sentences": [{"4c14": "EPA chief Scott Pruitt tells ‘Fox & Friends’ U.S. should exit Paris climate deal"}, {"5e3a": "He then left the interview to give the coal industry a boost."}, {"9924": "EPA Administrator Scott Pruitt. CREDIT: AP Photo/Susan Walsh"}, {"3e92": "Environmental Protection Agency chief Scott Pruitt said Thursday during an appearance on Fox and Friends that the United States should exit the Paris climate agreement because the accord only serves the interests of Europe, China and India."}, {"8655": "“Paris is something that we need to really look at closely because it is something we need to exit, in my opinion,” Pruitt told the Fox News show hosts. “It’s a bad deal for America”"}, {"56ef": "Pruitt, a former Oklahoma attorney general with close ties to the state’s oil and gas industry, has labeled the agreement a “bad deal” in the past but had not previously called for the United States to withdraw from the accord."}, {"a4bd": "The Paris accord, an international agreement to lower carbon emissions, places no emissions-reduction obligations on China and India until 2030, Pruitt stated, adding that all U.S. costs from the agreement are “front-loaded.”"}, {"b9ae": "President Donald Trump reportedly is expected to meet with his senior advisers to decide whether the Unites States should stay in the Paris climate agreement. It remains to be seen whether Trump’s daughter, Ivanka, will attend the meeting. Ivanka Trump reportedly favors the country meeting its Paris climate agreement obligations."}, {"b19f": "The Paris agreement is an incredible deal for the U.S. Trump would be foolish to cancel it.And it would destroy his “brand” forever.thinkprogress.org"}, {"c55d": "The Washington Post’s Fact Checker, in its review of Pruitt’s comments on Fox & Friends, said the EPA administrator’s concerns “might have made more sense if he had been referring to the 1992 Kyoto Protocol, which did not require developing nations such as China and India to face legally binding requirements to reduce greenhouse gas emissions.”"}, {"4e8e": "But with the Paris accord, China said that, compared to 2005 levels, it would seek to cut its carbon emissions by 60 to 65 percent per unit of GDP by 2030. India agreed to reduce its emissions per unit of economic output by 33 to 35 percent below 2005 by 2030."}, {"cafe": "China and India pledged to reach these ambitious goals by 2030, which means that, just like the U.S., they must begin staking steps now to meet their commitments."}, {"3e3e": "Four-and-a-half false statements EPA head Scott Pruitt made in just one interviewTeam Trump begins to roll out its plan to kill climate action, making up facts and ruining your children’s future.thinkprogress.org"}, {"1bce": "“The United States made more substantial commitments — which the Trump administration is abandoning — because the United States, on a per capita basis, is a much bigger polluter than either country,” the Washington Post Fact Checker said."}, {"7bae": "In the Fox News interview, conducted on the same day the U.S. dropped a hugely expensive bomb on Afghanistan, Pruitt reiterated Republican talking points about how the federal government, including the EPA, “has become way too big.”"}, {"cff9": "“It’s become too consequential in the lives of Americans — farmers and ranchers, oil and gas, business owners across the country dictated to by Washington, D.C.,” the EPA chief said. Later on Thursday, Pruitt traveled to a large coal mine in Pennsylvania to inform miners of the EPA’s plans to roll back environmental regulations."}, {"4f75": "Pruitt also told the Fox News hosts he supports Trump’s proposed wall on the U.S. border with Mexico. “The wall is going to be built,” he said. “We’re not going to stand in the way of building the wall from an environmental perspective.”"}], "content": "EPA chief Scott Pruitt tells ‘Fox & Friends’ U.S. should exit Paris climate deal He then left the interview to give the coal industry a boost. EPA Administrator Scott Pruitt. CREDIT: AP Photo/Susan Walsh Environmental Protection Agency chief Scott Pruitt said Thursday during an appearance on Fox and Friends that the United States should exit the Paris climate agreement because the accord only serves the interests of Europe, China and India. “Paris is something that we need to really look at closely because it is something we need to exit, in my opinion,” Pruitt told the Fox News show hosts. “It’s a bad deal for America” Pruitt, a former Oklahoma attorney general with close ties to the state’s oil and gas industry, has labeled the agreement a “bad deal” in the past but had not previously called for the United States to withdraw from the accord. The Paris accord, an international agreement to lower carbon emissions, places no emissions-reduction obligations on China and India until 2030, Pruitt stated, adding that all U.S. costs from the agreement are “front-loaded.” President Donald Trump reportedly is expected to meet with his senior advisers to decide whether the Unites States should stay in the Paris climate agreement. It remains to be seen whether Trump’s daughter, Ivanka, will attend the meeting. Ivanka Trump reportedly favors the country meeting its Paris climate agreement obligations. The Paris agreement is an incredible deal for the U.S. Trump would be foolish to cancel it.And it would destroy his “brand” forever.thinkprogress.org The Washington Post’s Fact Checker, in its review of Pruitt’s comments on Fox & Friends, said the EPA administrator’s concerns “might have made more sense if he had been referring to the 1992 Kyoto Protocol, which did not require developing nations such as China and India to face legally binding requirements to reduce greenhouse gas emissions.” But with the Paris accord, China said that, compared to 2005 levels, it would seek to cut its carbon emissions by 60 to 65 percent per unit of GDP by 2030. India agreed to reduce its emissions per unit of economic output by 33 to 35 percent below 2005 by 2030. China and India pledged to reach these ambitious goals by 2030, which means that, just like the U.S., they must begin staking steps now to meet their commitments. Four-and-a-half false statements EPA head Scott Pruitt made in just one interviewTeam Trump begins to roll out its plan to kill climate action, making up facts and ruining your children’s future.thinkprogress.org “The United States made more substantial commitments — which the Trump administration is abandoning — because the United States, on a per capita basis, is a much bigger polluter than either country,” the Washington Post Fact Checker said. In the Fox News interview, conducted on the same day the U.S. dropped a hugely expensive bomb on Afghanistan, Pruitt reiterated Republican talking points about how the federal government, including the EPA, “has become way too big.” “It’s become too consequential in the lives of Americans — farmers and ranchers, oil and gas, business owners across the country dictated to by Washington, D.C.,” the EPA chief said. Later on Thursday, Pruitt traveled to a large coal mine in Pennsylvania to inform miners of the EPA’s plans to roll back environmental regulations. Pruitt also told the Fox News hosts he supports Trump’s proposed wall on the U.S. border with Mexico. “The wall is going to be built,” he said. “We’re not going to stand in the way of building the wall from an environmental perspective.” ", "name": "414", "child": "414_1\t414_2\t414_3\t414_4", "timestamp": "Apr 14"}