{"parent": "", "title": "Big Coal’s last-ditch effort won’t save the industry", "author": "Natasha Geiling", "sentences": [{"1c11": "Big Coal’s last-ditch effort won’t save the industry"}, {"13d2": "Bolstered by the Trump administration, Big Coal is looking to make a comeback."}, {"b014": "Few industries have enjoyed the kind of presidential attention that has been lavished on the coal industry in the first 100 days of the Trump administration. In February, a handful of coal miners looked on as President Trump signed a bill revoking a rule designed to protect streams from coal mining operations; last week, more coal miners joined the president as he signed a sweeping executive order aimed at dismantling the Obama administration’s environmental and climate regulations."}, {"779d": "“I made them this promise,” Trump said while signing the executive order, “we will put our miners back to work.”"}, {"afa4": "Energy experts have almost uniformly rejected the feasibility of Trump’s promise to revitalize the coal industry. Utilities have said that his executive order does little to change their shift away from coal and towards cheaper sources of power like natural gas, or cleaner sources of power like wind and solar. Even coal executives have been lukewarm in their response to Trump’s promises, focusing their rhetoric on improving coal’s ability to compete, or improving profits for industry shareholders, rather than embracing Trump’s promise of coal jobs."}, {"1e29": "Trump just gutted U.S. policies to fight climate changeIt won’t do what the administration is saying it will, and what they aren’t saying about it is terrifying.thinkprogress.org"}, {"4ffe": "But coal’s bleak economic outlook hasn’t stopped the industry from embracing its newfound power within the White House in an unexpected fashion: by encouraging Trump to keep the United States in the Paris climate agreement, despite his campaign promises to withdraw from the deal."}, {"c051": "According a Reuters report published on Wednesday, coal companies have urged Trump to remain in the landmark climate deal so coal interests will have a seat at the table in shaping how global energy policy looks moving forward — which could mean more investment in things like carbon capture and storage, and more investment in coal plants in developing countries."}, {"cfba": "Ultimately, it’s unclear how much of an influence these coal companies will be able to exert with regards to the Paris agreement, both in the United States and internationally. The Paris agreement is made up of individual pledges by parties ; no one country can force another party to use a particular source of energy, be it fossil fuel or renewable ."}, {"f30c": "Still, coal companies could encourage the administration to remain in the non-binding agreement while backtracking on the Obama administration’s commitments to cut domestic emissions — a compromise that would allow the United States to save face on the international stage while undermining the agreement back home."}, {"8eea": "“This is definitely going to be backsliding,” John Coequyt, Sierra Club global climate policy director, told ThinkProgress. “This is an administration that, if they stay in [the agreement], is going to be staying in because predominantly they can’t take the blowback internationally.”"}, {"c6e1": "The Paris agreement is an incredible deal for the U.S. Trump would be foolish to cancel it.And it would destroy his “brand” forever.thinkprogress.org"}, {"f857": "The Trump administration has been quiet about its plans for the Paris agreement — a stark contrast from Trump’s rhetoric during the campaign, when he repeatedly slammed the agreement as “bad for business” and claimed, falsely, that it gave “foreign bureaucrats control over how much energy we use.”"}, {"6845": "The Paris agreement, which was signed by 186 countries, does not give any country control over how another country procures or uses energy. Instead, it requires countries to set independent goals for reducing emissions — goals that, if taken together, would put the world on track to keep global warming below 2°C. The United States, in its individual pledge, set a goal of reducing carbon emissions 26 to 28 percent below 2005 levels by 2025."}, {"980f": "If the Trump administration decides to remain in the agreement, it’s likely the United States will reconsider those targets — and with coal companies at the table, it’s likely those targets will be less ambitious than what the Obama administration put forward."}, {"c0b6": "“You can be sure that the coal industry and the oil industry will be at the table there, and they will argue for targets that are currently above U.S. emission levels,” Coequyt said. “They clearly have immense access in this administration. I think that will not be a fair fight.”"}, {"f259": "A section of the Mississippi Power Co. carbon capture power plant in DeKalb, MS. The plant has been plagued by cost overruns and is still not operational. CREDIT: AP Photo/Rogelio V. Solis"}, {"e862": "Andrew Light, a senior fellow at World Resources Institute and a former U.S. State Department climate official, agreed that coal companies would have little sway over the agreement writ large, but could exert some influence on what the United States chooses to do domestically."}, {"5b79": "“If the U.S. stays in the Paris agreement, I think that they probably will also announce that they intend to change the U.S. target,” Light said. “If they go through a process to revisit the target, then you can imagine them saying we are going to hit our target with more coal-based carbon capture storage. That might be something they could do.”"}, {"9fcd": "But, according to the Reuters report, the coal companies consulted by the administration aren’t merely looking to influence domestic policy — they want to ensure coal projects receive multilateral funding, ostensibly through international bodies of investment like the Green Climate Fund or the World Bank. And in that case, the Trump administration’s own policies could be damning."}, {"7eba": "“This is an administration that, if they stay in [the agreement], is going to be staying in because predominantly they can’t take the blowback internationally.”"}, {"a5bc": "In its so-called ‘skinny budget’ released in March, the Trump administration called for ending payments to both the Green Climate Fund and the Climate Investment Funds. Developed countries pay into those funds, which in turn go toward helping developing countries adapt to and mitigate climate change. But if the United States does not participate in either fund, Light says, it will be extremely difficult for the U.S. or its coal coal companies to exert any influence over which projects those funds choose to support."}, {"cc39": "“Coal companies have got to be taking into consideration that U.S. influence is going to completely plummet because of the administration’s intention to stop funding these funds,” he said."}, {"f964": "Moreover, projects like carbon capture and storage facilities are untested and expensive, making them unappealing to investors. A carbon capture and storage plant in DeKalb, Mississippi — which was billed as a model for how future coal plants could help reduce emissions and slow climate change — is currently more than $4 billion dollars over its initial budget and still not operational."}, {"2be4": "“Carbon capture and storage is a lot more expensive than wind and solar, it is unproven, and it really doesn’t make sense for the Green Climate Fund or any multilateral development agency to be making that investment,” Sierra Club’s Coequyt said."}, {"7e6a": "Both Coequyt and Light said that, ultimately, market forces still favor cheaper sources of fuel like natural gas, or renewable energy, over coal — even with coal companies enjoying renewed power in Washington."}, {"c40e": "“The cost of renewables continues to go down, and fossil fuel projects continue to show that they are risky financially,” Coequyt said. “It’s hard to see how a change in U.S. policy or politics really flies in the face of this enormous tidal wave of change.”"}, {"a3c1": "“The cost of renewables continues to go down, and fossil fuel projects continue to show that they are risky financially. It’s hard to see how a change in U.S. policy or politics really flies in the face of this enormous tidal wave of change.”"}, {"38dd": "In the week following Trump’s executive order rolling back Obama-era environmental regulations, that tide certainly does not appear to have turned. On Tuesday, a massive coal project in Alaska — which had been under consideration for more than a decade — was scrapped due to lack of financial backing. And on Wednesday, a coalition of electric companies representing every European Union member except Poland and Greece announced that they would build no new coal plants in the E.U. after 2020."}, {"7472": "Domestically, repealing the Clean Power Plan — which the Trump administration has begun the process of doing — will likely shift some of the U.S. energy mix back to coal, especially with natural gas prices currently higher than they have been in the past. Coal is such a carbon-intensive power source that such a shift will, in turn, raise U.S. carbon emissions. But it’s unlikely the repeal will stop utilities from shuttering old coal plants, or switching them from coal to natural gas. And without bringing new coal plants online — something many utilities say they are not planning to do anytime soon — coal’s decline will only continue."}, {"0fe1": "Which leaves coal communities, hopeful that Trump’s promise of jobs will reverse decades of decline, alone against a market that appears resolutely headed in the other direction."}, {"2a16": "“There is an overall direction of travel here that is very clear, and yet we have an administration that keeps insisting that what they are doing is going to bring these jobs back,” Light said. “This administration keeps selling these coal communities a false bill of goods, and using them as part of the window dressing for killing off these regulations.”"}], "content": "Big Coal’s last-ditch effort won’t save the industry Bolstered by the Trump administration, Big Coal is looking to make a comeback. Few industries have enjoyed the kind of presidential attention that has been lavished on the coal industry in the first 100 days of the Trump administration. In February, a handful of coal miners looked on as President Trump signed a bill revoking a rule designed to protect streams from coal mining operations; last week, more coal miners joined the president as he signed a sweeping executive order aimed at dismantling the Obama administration’s environmental and climate regulations. “I made them this promise,” Trump said while signing the executive order, “we will put our miners back to work.” Energy experts have almost uniformly rejected the feasibility of Trump’s promise to revitalize the coal industry. Utilities have said that his executive order does little to change their shift away from coal and towards cheaper sources of power like natural gas, or cleaner sources of power like wind and solar. Even coal executives have been lukewarm in their response to Trump’s promises, focusing their rhetoric on improving coal’s ability to compete, or improving profits for industry shareholders, rather than embracing Trump’s promise of coal jobs. Trump just gutted U.S. policies to fight climate changeIt won’t do what the administration is saying it will, and what they aren’t saying about it is terrifying.thinkprogress.org But coal’s bleak economic outlook hasn’t stopped the industry from embracing its newfound power within the White House in an unexpected fashion: by encouraging Trump to keep the United States in the Paris climate agreement, despite his campaign promises to withdraw from the deal. According a Reuters report published on Wednesday, coal companies have urged Trump to remain in the landmark climate deal so coal interests will have a seat at the table in shaping how global energy policy looks moving forward — which could mean more investment in things like carbon capture and storage, and more investment in coal plants in developing countries. Ultimately, it’s unclear how much of an influence these coal companies will be able to exert with regards to the Paris agreement, both in the United States and internationally. The Paris agreement is made up of individual pledges by parties ; no one country can force another party to use a particular source of energy, be it fossil fuel or renewable . Still, coal companies could encourage the administration to remain in the non-binding agreement while backtracking on the Obama administration’s commitments to cut domestic emissions — a compromise that would allow the United States to save face on the international stage while undermining the agreement back home. “This is definitely going to be backsliding,” John Coequyt, Sierra Club global climate policy director, told ThinkProgress. “This is an administration that, if they stay in [the agreement], is going to be staying in because predominantly they can’t take the blowback internationally.” The Paris agreement is an incredible deal for the U.S. Trump would be foolish to cancel it.And it would destroy his “brand” forever.thinkprogress.org The Trump administration has been quiet about its plans for the Paris agreement — a stark contrast from Trump’s rhetoric during the campaign, when he repeatedly slammed the agreement as “bad for business” and claimed, falsely, that it gave “foreign bureaucrats control over how much energy we use.” The Paris agreement, which was signed by 186 countries, does not give any country control over how another country procures or uses energy. Instead, it requires countries to set independent goals for reducing emissions — goals that, if taken together, would put the world on track to keep global warming below 2°C. The United States, in its individual pledge, set a goal of reducing carbon emissions 26 to 28 percent below 2005 levels by 2025. If the Trump administration decides to remain in the agreement, it’s likely the United States will reconsider those targets — and with coal companies at the table, it’s likely those targets will be less ambitious than what the Obama administration put forward. “You can be sure that the coal industry and the oil industry will be at the table there, and they will argue for targets that are currently above U.S. emission levels,” Coequyt said. “They clearly have immense access in this administration. I think that will not be a fair fight.” A section of the Mississippi Power Co. carbon capture power plant in DeKalb, MS. The plant has been plagued by cost overruns and is still not operational. CREDIT: AP Photo/Rogelio V. Solis Andrew Light, a senior fellow at World Resources Institute and a former U.S. State Department climate official, agreed that coal companies would have little sway over the agreement writ large, but could exert some influence on what the United States chooses to do domestically. “If the U.S. stays in the Paris agreement, I think that they probably will also announce that they intend to change the U.S. target,” Light said. “If they go through a process to revisit the target, then you can imagine them saying we are going to hit our target with more coal-based carbon capture storage. That might be something they could do.” But, according to the Reuters report, the coal companies consulted by the administration aren’t merely looking to influence domestic policy — they want to ensure coal projects receive multilateral funding, ostensibly through international bodies of investment like the Green Climate Fund or the World Bank. And in that case, the Trump administration’s own policies could be damning. “This is an administration that, if they stay in [the agreement], is going to be staying in because predominantly they can’t take the blowback internationally.” In its so-called ‘skinny budget’ released in March, the Trump administration called for ending payments to both the Green Climate Fund and the Climate Investment Funds. Developed countries pay into those funds, which in turn go toward helping developing countries adapt to and mitigate climate change. But if the United States does not participate in either fund, Light says, it will be extremely difficult for the U.S. or its coal coal companies to exert any influence over which projects those funds choose to support. “Coal companies have got to be taking into consideration that U.S. influence is going to completely plummet because of the administration’s intention to stop funding these funds,” he said. Moreover, projects like carbon capture and storage facilities are untested and expensive, making them unappealing to investors. A carbon capture and storage plant in DeKalb, Mississippi — which was billed as a model for how future coal plants could help reduce emissions and slow climate change — is currently more than $4 billion dollars over its initial budget and still not operational. “Carbon capture and storage is a lot more expensive than wind and solar, it is unproven, and it really doesn’t make sense for the Green Climate Fund or any multilateral development agency to be making that investment,” Sierra Club’s Coequyt said. Both Coequyt and Light said that, ultimately, market forces still favor cheaper sources of fuel like natural gas, or renewable energy, over coal — even with coal companies enjoying renewed power in Washington. “The cost of renewables continues to go down, and fossil fuel projects continue to show that they are risky financially,” Coequyt said. “It’s hard to see how a change in U.S. policy or politics really flies in the face of this enormous tidal wave of change.” “The cost of renewables continues to go down, and fossil fuel projects continue to show that they are risky financially. It’s hard to see how a change in U.S. policy or politics really flies in the face of this enormous tidal wave of change.” In the week following Trump’s executive order rolling back Obama-era environmental regulations, that tide certainly does not appear to have turned. On Tuesday, a massive coal project in Alaska — which had been under consideration for more than a decade — was scrapped due to lack of financial backing. And on Wednesday, a coalition of electric companies representing every European Union member except Poland and Greece announced that they would build no new coal plants in the E.U. after 2020. Domestically, repealing the Clean Power Plan — which the Trump administration has begun the process of doing — will likely shift some of the U.S. energy mix back to coal, especially with natural gas prices currently higher than they have been in the past. Coal is such a carbon-intensive power source that such a shift will, in turn, raise U.S. carbon emissions. But it’s unlikely the repeal will stop utilities from shuttering old coal plants, or switching them from coal to natural gas. And without bringing new coal plants online — something many utilities say they are not planning to do anytime soon — coal’s decline will only continue. Which leaves coal communities, hopeful that Trump’s promise of jobs will reverse decades of decline, alone against a market that appears resolutely headed in the other direction. “There is an overall direction of travel here that is very clear, and yet we have an administration that keeps insisting that what they are doing is going to bring these jobs back,” Light said. “This administration keeps selling these coal communities a false bill of goods, and using them as part of the window dressing for killing off these regulations.” ", "name": "415", "child": "415_1\t415_2\t415_3\t415_4", "timestamp": "Apr 6"}