{"parent": "", "title": "Washington Post embraces ‘fake news’ by printing debunked climate misinformation", "author": "Joe Romm", "sentences": [{"d895": "Washington Post embraces ‘fake news’ by printing debunked climate misinformation"}, {"34cb": "Running opinions that haven’t been fact-checked amounts to normalizing the fake news they decry."}, {"ec30": "CREDIT: AP Photo/Pablo Martinez Monsivais"}, {"2eef": "“Trump’s climate plan might not be so bad after all,” blasted an attention-grabbing Washington Post headline on Monday. Such a headline raises red flags as mainstream media outlets seek to combat “fake news” — misinformation aimed at confusing the public that that comes from a repeatedly debunked source but still manages to creep into a widely used and generally more legitimate news outlet."}, {"0a07": "In this case, the fake news is a long-debunked “analysis” of the Paris climate agreement by perhaps the single most debunked writer in the entire climate arena: Bjorn Lomborg. Lomborg uses the piece to greenwash the extremely anti-scientific and pro-pollution “climate plan” of President-elect Donald Trump."}, {"04ac": "By long-debunked, I mean that the leading analytical experts on the Paris pledges — the intended nationally determined contributions (INDCs) — have explained that Lomborg’s analysis “appears to have no basis in fact,” as I wrote last year."}, {"0ea5": "I checked with those Climate Interactive experts in light of Lomborg’s new op-ed, and they stand by that statement. In fact, they have re-debunked Lomborg, and John Sterman, director of MIT Sloan School’s System Dynamics Group, sums it up this way:"}, {"747c": "Dr. Lomborg sets out to show that the INDCs are useless. To do so he grossly misrepresents the pledges. He constructs an incomplete accounting of the pledges that omits the pledges of many nations, ignores China’s pledge to cap its emissions by 2030, and assumes that the [European Union countries] abandon their commitment to emissions reductions as soon as their pledges are fulfilled.”"}, {"19fe": "The scientists at Climate Action Tracker similarly debunked Lomborg last year. The CAT scientists also point us to a London School of Economics debunking, and one by the Australian-German Climate and Energy College, “Facts4Paris: Lomborg. Wrong again.”"}, {"79c3": "“Lomborg. Wrong again” sums up exactly why the op-ed is fake news and why the Washington Post should be ashamed of publishing it. Leading scientists have been debunking Lomborg’s false and leading claims since he started decades ago."}, {"d395": "Back in 2002, top scientists debunked Lomborg’s first book at length in the pages of Scientific American. Back in 2010, Yale University Press published The Lomborg Deception, detailing how Lomborg’s work is “a mirage” and “a house of cards,” as biologist Thomas Lovejoy wrote in the foreword (see also Newsweek on “Debunking Lomborg” here)."}, {"f415": "Ironically, the same day the Post published Lomborg’s op-ed, they published another piece titled, “Fake news is just the beginning.”"}, {"ab3f": "“Facebook is on the defensive after the elections, with accusations that it helped spread misinformation,” the piece begins. The Post notes that “after a torrent of criticism from his employees and the media — and indication that fake election news spread widely,” CEO Mark Zuckerberg “relented and took responsibility. He promised to improve Facebook’s detection, reporting and verification of news.” The piece continues:"}, {"3d06": "The tech industry has stepped into the field of publishing and communications without accepting the responsibility that comes with doing so."}, {"b1b6": "When will the Washington Post “improve detection, reporting and verification of news?” Where exactly is the “responsibility” from the Post editors in publishing the Lomborg’s misinformation on an issue of existential importance to the country? This isn’t the first time the Post has published Lomborg’s nonsense: back in 2010, the Climate Science Rapid Response Team debunked another Washington Post op-ed by Lomborg."}, {"4fdd": "But wait, you say, Lomborg’s piece is published in the “opinions” section not “news.” Sorry that long-standing excuse for not fact checking op-eds and for publishing misinformation no longer holds water — if it ever did — for two reasons."}, {"e132": "First, how exactly are readers to know the Post is publishing something it hasn’t fact-checked? Would the Post run a disclaimer acknowledging the piece has not been fact-checked and may be false? Of course they wouldn’t. Yet the disclaimer would be accurate whereas the article itself is not. Such is the Orwellian world we live in now."}, {"9e0d": "Second, as a new piece on fake news by the Post’s own fact-checker explains, everybody has “shared something based on the headline without actually reading the link.”"}, {"dca0": "The goal of much, if not most, fake news is simply to spread a false headline far and wide. Newspaper editors have known for decades that most people don’t read most stories much beyond the headline. That’s even more true today with so many readers getting their news via Facebook and Twitter, search engines and content aggregators."}, {"cf3f": "Thus, vastly more people see the headline of any story than actually read much of the content."}, {"3190": "So potentially millions of people could have seen the Post’s absurd headline, “Trump’s climate plan might not be so bad after all” without knowing it comes from an opinion piece that has not been fact-checked, written by a widely debunked writer."}, {"4103": "Even worse, the piece does not actually discuss most of Trump’s climate plan. It focuses almost entirely on his pledge to quit the Paris deal. Lomborg writes, “Despite its length, and for all of its heat and bluster, the election campaign left many unanswered questions and understandable concerns about the president-elect’s positions on climate change, aid and development.”"}, {"78b4": "Untrue. The campaign was actually very clear. On October 26, Trump promised: “I will also cancel all wasteful climate change spending from Obama-Clinton, including all global warming payments to the United Nations. These steps will save $100 billion over 8 years.”"}, {"8977": "Lomborg blithely asserts that a couple of Trump’s vague and meaningless statements mean he might be open to “an innovation-based green energy approach that will harness U.S. ingenuity.” In fact, Trump’s climate plan would require ending all federal clean energy development (and climate science research)."}, {"c203": "But hey, don’t worry about the facts. Didn’t we read somewhere that the Washington Post says “Trump’s climate plan might not be so bad after all?” They wouldn’t print that if it weren’t true, would they?"}], "content": "Washington Post embraces ‘fake news’ by printing debunked climate misinformation Running opinions that haven’t been fact-checked amounts to normalizing the fake news they decry. CREDIT: AP Photo/Pablo Martinez Monsivais “Trump’s climate plan might not be so bad after all,” blasted an attention-grabbing Washington Post headline on Monday. Such a headline raises red flags as mainstream media outlets seek to combat “fake news” — misinformation aimed at confusing the public that that comes from a repeatedly debunked source but still manages to creep into a widely used and generally more legitimate news outlet. In this case, the fake news is a long-debunked “analysis” of the Paris climate agreement by perhaps the single most debunked writer in the entire climate arena: Bjorn Lomborg. Lomborg uses the piece to greenwash the extremely anti-scientific and pro-pollution “climate plan” of President-elect Donald Trump. By long-debunked, I mean that the leading analytical experts on the Paris pledges — the intended nationally determined contributions (INDCs) — have explained that Lomborg’s analysis “appears to have no basis in fact,” as I wrote last year. I checked with those Climate Interactive experts in light of Lomborg’s new op-ed, and they stand by that statement. In fact, they have re-debunked Lomborg, and John Sterman, director of MIT Sloan School’s System Dynamics Group, sums it up this way: Dr. Lomborg sets out to show that the INDCs are useless. To do so he grossly misrepresents the pledges. He constructs an incomplete accounting of the pledges that omits the pledges of many nations, ignores China’s pledge to cap its emissions by 2030, and assumes that the [European Union countries] abandon their commitment to emissions reductions as soon as their pledges are fulfilled.” The scientists at Climate Action Tracker similarly debunked Lomborg last year. The CAT scientists also point us to a London School of Economics debunking, and one by the Australian-German Climate and Energy College, “Facts4Paris: Lomborg. Wrong again.” “Lomborg. Wrong again” sums up exactly why the op-ed is fake news and why the Washington Post should be ashamed of publishing it. Leading scientists have been debunking Lomborg’s false and leading claims since he started decades ago. Back in 2002, top scientists debunked Lomborg’s first book at length in the pages of Scientific American. Back in 2010, Yale University Press published The Lomborg Deception, detailing how Lomborg’s work is “a mirage” and “a house of cards,” as biologist Thomas Lovejoy wrote in the foreword (see also Newsweek on “Debunking Lomborg” here). Ironically, the same day the Post published Lomborg’s op-ed, they published another piece titled, “Fake news is just the beginning.” “Facebook is on the defensive after the elections, with accusations that it helped spread misinformation,” the piece begins. The Post notes that “after a torrent of criticism from his employees and the media — and indication that fake election news spread widely,” CEO Mark Zuckerberg “relented and took responsibility. He promised to improve Facebook’s detection, reporting and verification of news.” The piece continues: The tech industry has stepped into the field of publishing and communications without accepting the responsibility that comes with doing so. When will the Washington Post “improve detection, reporting and verification of news?” Where exactly is the “responsibility” from the Post editors in publishing the Lomborg’s misinformation on an issue of existential importance to the country? This isn’t the first time the Post has published Lomborg’s nonsense: back in 2010, the Climate Science Rapid Response Team debunked another Washington Post op-ed by Lomborg. But wait, you say, Lomborg’s piece is published in the “opinions” section not “news.” Sorry that long-standing excuse for not fact checking op-eds and for publishing misinformation no longer holds water — if it ever did — for two reasons. First, how exactly are readers to know the Post is publishing something it hasn’t fact-checked? Would the Post run a disclaimer acknowledging the piece has not been fact-checked and may be false? Of course they wouldn’t. Yet the disclaimer would be accurate whereas the article itself is not. Such is the Orwellian world we live in now. Second, as a new piece on fake news by the Post’s own fact-checker explains, everybody has “shared something based on the headline without actually reading the link.” The goal of much, if not most, fake news is simply to spread a false headline far and wide. Newspaper editors have known for decades that most people don’t read most stories much beyond the headline. That’s even more true today with so many readers getting their news via Facebook and Twitter, search engines and content aggregators. Thus, vastly more people see the headline of any story than actually read much of the content. So potentially millions of people could have seen the Post’s absurd headline, “Trump’s climate plan might not be so bad after all” without knowing it comes from an opinion piece that has not been fact-checked, written by a widely debunked writer. Even worse, the piece does not actually discuss most of Trump’s climate plan. It focuses almost entirely on his pledge to quit the Paris deal. Lomborg writes, “Despite its length, and for all of its heat and bluster, the election campaign left many unanswered questions and understandable concerns about the president-elect’s positions on climate change, aid and development.” Untrue. The campaign was actually very clear. On October 26, Trump promised: “I will also cancel all wasteful climate change spending from Obama-Clinton, including all global warming payments to the United Nations. These steps will save $100 billion over 8 years.” Lomborg blithely asserts that a couple of Trump’s vague and meaningless statements mean he might be open to “an innovation-based green energy approach that will harness U.S. ingenuity.” In fact, Trump’s climate plan would require ending all federal clean energy development (and climate science research). But hey, don’t worry about the facts. Didn’t we read somewhere that the Washington Post says “Trump’s climate plan might not be so bad after all?” They wouldn’t print that if it weren’t true, would they? ", "name": "416", "child": "416_1\t416_2\t416_3\t416_4\t416_5\t416_6\t416_7\t416_8\t416_9\t416_10\t416_11", "timestamp": "Nov 23, 2016"}