{"parent": "", "title": "Trump lines up staff to avoid international action on climate change", "author": "Samantha Page", "sentences": [{"e04d": "Trump lines up staff to avoid international action on climate change"}, {"f8e6": "Welcome, Steven Groves."}, {"0c29": "Steven Groves testifying for Congress. CREDIT: Via YouTube"}, {"8496": "The upcoming Trump administration is apparently making climate a pillar of its State Department plans."}, {"f223": "That is, President-elect Donald Trump continues to send strong signals that leaving the Paris climate agreement — the international community’s agreement to strive to keep climate change to less than 2ºC (3.6ºF) and avoid the most catastrophic disruption to our climate — is a top priority."}, {"ae5d": "On Monday, the Heritage Foundation’s Steven Groves was added to the State Department transition team. Groves has repeatedly called for leaving the Paris agreement, most recently publishing an article for the Daily Signal, Heritage’s blog, titled, “The Pathway Out of Paris.”"}, {"ab2e": "Under Sec. John Kerry, the State Department led the creation of the historic Paris climate agreement, which went into effect earlier this month. The Paris agreement is wildly popular with U.S. voters, 71 percent of whom support U.S. involvement in the 200-nation agreement."}, {"33e1": "As Joe Romm has written for ThinkProgress — and as the New York Times’ Thomas Friedman has concurred — exiting Paris is a really bad idea. It’s expected that other countries would likely punish the United States, almost certainly by treating it as an international pariah, but also potentially through financial measures, such as a carbon tax."}, {"2b8f": "Not only would leaving the agreement mean backing out of an incredibly popular and urgent agreement, for decades, the United States was the world’s largest historic greenhouse gas emitter. In other words: The United States is on the hook for much of the world’s excess carbon dioxide — and if Trump backs out of this deal, it wouldn’t be hard for other countries to pin the blame for sea levels rise squarely on his custom-tailored lapels."}, {"500f": "Of course, Groves doesn’t see it that way."}, {"c627": "Groves argues that “the cost of allowing third-world poverty to persist — and the role that energy development can play in alleviating that poverty — is far clearer, more threatening, and more easily solvable than the vague and unsubstantiated risks posed by carbon emissions.” But he simultaneously argues against U.S. financial support to developing nations under the Paris agreement — even though much of that support would go toward developing renewable energy resources."}, {"9584": "The United Nations estimates that “poorer countries” will have to invest hundreds of billions of dollars in climate mitigation by 2050."}, {"76e4": "It’s not clear how much weight Groves will have during the State Department transition — his appointment to the team came several days after the first tranche of “landing team” members were appointed — but it is certainly a sign that Trump intends to make good on his promises to leave the Paris agreement."}, {"1b47": "Other members of the team, so far, are Erin Walsh (retired from Goldman Sachs), Alexander Gray (previously with Trump for America, Inc.), Jackie Wolcott (U.S. Commission on International Religious Freedom), Ashley Bell (Republican National Committee), Charles Glazer (Fieldpoint Private), and Christopher Burnham (Cambridge Global Capital, LLC)."}], "content": "Trump lines up staff to avoid international action on climate change Welcome, Steven Groves. Steven Groves testifying for Congress. CREDIT: Via YouTube The upcoming Trump administration is apparently making climate a pillar of its State Department plans. That is, President-elect Donald Trump continues to send strong signals that leaving the Paris climate agreement — the international community’s agreement to strive to keep climate change to less than 2ºC (3.6ºF) and avoid the most catastrophic disruption to our climate — is a top priority. On Monday, the Heritage Foundation’s Steven Groves was added to the State Department transition team. Groves has repeatedly called for leaving the Paris agreement, most recently publishing an article for the Daily Signal, Heritage’s blog, titled, “The Pathway Out of Paris.” Under Sec. John Kerry, the State Department led the creation of the historic Paris climate agreement, which went into effect earlier this month. The Paris agreement is wildly popular with U.S. voters, 71 percent of whom support U.S. involvement in the 200-nation agreement. As Joe Romm has written for ThinkProgress — and as the New York Times’ Thomas Friedman has concurred — exiting Paris is a really bad idea. It’s expected that other countries would likely punish the United States, almost certainly by treating it as an international pariah, but also potentially through financial measures, such as a carbon tax. Not only would leaving the agreement mean backing out of an incredibly popular and urgent agreement, for decades, the United States was the world’s largest historic greenhouse gas emitter. In other words: The United States is on the hook for much of the world’s excess carbon dioxide — and if Trump backs out of this deal, it wouldn’t be hard for other countries to pin the blame for sea levels rise squarely on his custom-tailored lapels. Of course, Groves doesn’t see it that way. Groves argues that “the cost of allowing third-world poverty to persist — and the role that energy development can play in alleviating that poverty — is far clearer, more threatening, and more easily solvable than the vague and unsubstantiated risks posed by carbon emissions.” But he simultaneously argues against U.S. financial support to developing nations under the Paris agreement — even though much of that support would go toward developing renewable energy resources. The United Nations estimates that “poorer countries” will have to invest hundreds of billions of dollars in climate mitigation by 2050. It’s not clear how much weight Groves will have during the State Department transition — his appointment to the team came several days after the first tranche of “landing team” members were appointed — but it is certainly a sign that Trump intends to make good on his promises to leave the Paris agreement. Other members of the team, so far, are Erin Walsh (retired from Goldman Sachs), Alexander Gray (previously with Trump for America, Inc.), Jackie Wolcott (U.S. Commission on International Religious Freedom), Ashley Bell (Republican National Committee), Charles Glazer (Fieldpoint Private), and Christopher Burnham (Cambridge Global Capital, LLC). ", "name": "417", "child": "417_1\t417_2\t417_3\t417_4\t417_5\t417_6\t417_7\t417_8", "timestamp": "Nov 22, 2016"}