{"parent": "", "title": "Trump victory puts the chill on international climate talks", "author": "Mythili Sampathkumar", "sentences": [{"0726": "Trump victory puts the chill on international climate talks"}, {"6f2b": "At a U.N. conference, concerns over the future of the Paris Agreement."}, {"0ccb": "Environmental activist Bethany Hindmarsh cries during a protest against President-elect Donald Trump at the Climate Conference, known as COP22, in Marrakesh, Morocco. CREDIT: AP Photo/Mosa’ab Elshamy"}, {"fca9": "MARRAKESH, MOROCCO — On a cold Wednesday morning, climate and environment representatives from nearly 200 countries and several NGOs met for the third day of the UN climate talks in Marrakesh, Morocco. What was expected by many to be a day of celebration of first-ever woman president who would continue the United States’ efforts to combat climate change turned out to be anything but."}, {"9a1f": "The mood here was one of an eerily quiet shock and a realization that climate action may well have taken a huge blow. Many seemed stunned and even emotional about the results as they stared at phones, grabbing the nearest American they could find to explain what had happened overnight. Some looked to Twitter and found dark humor in the situation, comparing Trump to Italy’s Silvio Berlusconi."}, {"962e": "Katherine Egland, chairman of environmental and climate justice for the NAACP compared the climate movement under Trump to the civil rights movement. She said that when she grew up in the Deep South during the 1960s, it was “commonplace for elected representatives” to try to stop the civil rights movement. But like that fight, “our climate change movement will prevail.”"}, {"a028": "Egland said that her community of minorities and the economically disadvantaged on the Gulf of Mexico is one of the worst-affected by climate change in the United States. They survived the BP oil spill and Hurricane Katrina and plan on holding the new Trump administration “completely accountable” to fighting climate change."}, {"c29a": "The ‘sacrifice zone’: Life as a fisherman along Louisiana’s vanishing coastlineST. BERNARD PARISH, LOUISIANA — The two powerhouse industries in the state of Louisiana — fossil fuels and seafood …thinkprogress.org"}, {"ad7a": "Lou del Bello, a journalist based in Nairobi, compared the feeling of Trump’s election to what she went through as an Italian immigrant during the Brexit referendum. “I saw what this type of political narrative instills in people,” he said. “The [Trump victory] is like the spread of the same virus. Hate, bigotry, violence, only this time I have a glimpse of what the future of the U.S. may look like.”"}, {"1010": "Despite the initial shock, many here feel there is potential for Trump to make some progress on his view on climate in terms of his ambitious infrastructure plans."}, {"ed76": "“As a businessman, President-Elect Trump needs to understand that…America has numerous opportunities to create a modern, high-efficiency economy that is suited for the 21st century” by investing in clean energy, said Andrew Steer, president the Washington, DC-based World Resources Institute."}, {"6e4c": "Indeed, embracing the renewable energy sector could help to fulfill Trump’s campaign promise of job creation — and could help displaced coal industry and Rust Belt workers. On the campaign trail, Vice President-Elect Mike Pence said the new administration would “end the war on coal” as a way of bringing back communities ravaged by the coal industry’s decline. But perhaps the answer is not reopening coal operations but training workers for more sustainable work in the renewable energy sector. A study released in August showed that with “relatively minor investment,” all coal workers could be retrained to work in solar."}, {"0c0b": "But beyond the economic opportunities, how climate change will affect foreign policy was a critical question for many participants here in Marrakesh. Climate agreements could prove to be crucial for a Trump administration’s relations with China and India especially, two countries that are focused on adapting infrastructure to their changing climates, reducing pollution, and building their economies through renewable energy. The United States has bilateral climate agreements with both countries."}, {"70fd": "Like India and China, the United States is one of the largest polluters in the world, so it has a central role in meeting the goals of the Paris Agreement. As the largest economy in the world, the United States is also pivotal to talks that focus on implementing the agreement and arranging financing."}, {"ec33": "If Donald Trump believes climate change is a Chinese hoax, how can developing countries expect to get the money needed to rebuild infrastructure to deal with the climate damage caused by by past actions of the United States and other developed economies?"}, {"04fc": "There is an obligation to the world to help take care of the planet. And the U.S. responsibility for its emissions was one reason the Paris Agreement is not a formal treaty. The language was painstakingly pored over last December so that President Obama could have the United States join without approval from a recalcitrant Senate."}, {"7974": "Technically, this leaves the door open for Trump to withdraw from the agreement without Senate approval as well."}, {"cf28": "Withdrawing is not be an action the new president can take immediately, however, despite his campaign-trail rhetoric promising to do so."}, {"6ec5": "When the United States joined the Agreement, it became locked in for a period of no less than three years, until January 20, 2018."}, {"7313": "At that point the United States can inform the UN climate change body by “written notification,” and the withdrawal would take effect one year after notification is received, meaning it would be at least four years before the United States could get out of the agreement. (Another path would be for Trump to withdraw from the United Nations Conference on Climate Change, which could be effective in one year.)"}, {"dd8c": "While the world waits for what Trump will do in January 2017, the climate talks continue in Marrakesh with minimal interruption. Whether the United States will agree to commit more funds to help poorer countries deal with the climate damage caused by industrialized nations has always been an issue — it will now be of particular debate as the international community prepares for the country to be led by a climate denier."}, {"06de": "But while Trump might be able to withdraw from the international community — or just ignore the Paris Agreement altogether, climate change will continue. As Alden Meyer, policy director of the Union of Concerned Scientists, said, “It’s clear that Donald Trump is about to be one of the most powerful people in the world…but even he does not have the power to change the laws of physics, to stop the impact of climate change, to stop the rising sea levels.”"}, {"be25": "Meyer was confident that if a President Trump did withdraw from the financial- and emissions-based commitments in the Paris Agreement or the country’s bilateral climate agreement with China, “it will negatively impact his ability to get the cooperation of world leaders on other issues he cares about, like trade and terrorism.”"}], "content": "Trump victory puts the chill on international climate talks At a U.N. conference, concerns over the future of the Paris Agreement. Environmental activist Bethany Hindmarsh cries during a protest against President-elect Donald Trump at the Climate Conference, known as COP22, in Marrakesh, Morocco. CREDIT: AP Photo/Mosa’ab Elshamy MARRAKESH, MOROCCO — On a cold Wednesday morning, climate and environment representatives from nearly 200 countries and several NGOs met for the third day of the UN climate talks in Marrakesh, Morocco. What was expected by many to be a day of celebration of first-ever woman president who would continue the United States’ efforts to combat climate change turned out to be anything but. The mood here was one of an eerily quiet shock and a realization that climate action may well have taken a huge blow. Many seemed stunned and even emotional about the results as they stared at phones, grabbing the nearest American they could find to explain what had happened overnight. Some looked to Twitter and found dark humor in the situation, comparing Trump to Italy’s Silvio Berlusconi. Katherine Egland, chairman of environmental and climate justice for the NAACP compared the climate movement under Trump to the civil rights movement. She said that when she grew up in the Deep South during the 1960s, it was “commonplace for elected representatives” to try to stop the civil rights movement. But like that fight, “our climate change movement will prevail.” Egland said that her community of minorities and the economically disadvantaged on the Gulf of Mexico is one of the worst-affected by climate change in the United States. They survived the BP oil spill and Hurricane Katrina and plan on holding the new Trump administration “completely accountable” to fighting climate change. The ‘sacrifice zone’: Life as a fisherman along Louisiana’s vanishing coastlineST. BERNARD PARISH, LOUISIANA — The two powerhouse industries in the state of Louisiana — fossil fuels and seafood …thinkprogress.org Lou del Bello, a journalist based in Nairobi, compared the feeling of Trump’s election to what she went through as an Italian immigrant during the Brexit referendum. “I saw what this type of political narrative instills in people,” he said. “The [Trump victory] is like the spread of the same virus. Hate, bigotry, violence, only this time I have a glimpse of what the future of the U.S. may look like.” Despite the initial shock, many here feel there is potential for Trump to make some progress on his view on climate in terms of his ambitious infrastructure plans. “As a businessman, President-Elect Trump needs to understand that…America has numerous opportunities to create a modern, high-efficiency economy that is suited for the 21st century” by investing in clean energy, said Andrew Steer, president the Washington, DC-based World Resources Institute. Indeed, embracing the renewable energy sector could help to fulfill Trump’s campaign promise of job creation — and could help displaced coal industry and Rust Belt workers. On the campaign trail, Vice President-Elect Mike Pence said the new administration would “end the war on coal” as a way of bringing back communities ravaged by the coal industry’s decline. But perhaps the answer is not reopening coal operations but training workers for more sustainable work in the renewable energy sector. A study released in August showed that with “relatively minor investment,” all coal workers could be retrained to work in solar. But beyond the economic opportunities, how climate change will affect foreign policy was a critical question for many participants here in Marrakesh. Climate agreements could prove to be crucial for a Trump administration’s relations with China and India especially, two countries that are focused on adapting infrastructure to their changing climates, reducing pollution, and building their economies through renewable energy. The United States has bilateral climate agreements with both countries. Like India and China, the United States is one of the largest polluters in the world, so it has a central role in meeting the goals of the Paris Agreement. As the largest economy in the world, the United States is also pivotal to talks that focus on implementing the agreement and arranging financing. If Donald Trump believes climate change is a Chinese hoax, how can developing countries expect to get the money needed to rebuild infrastructure to deal with the climate damage caused by by past actions of the United States and other developed economies? There is an obligation to the world to help take care of the planet. And the U.S. responsibility for its emissions was one reason the Paris Agreement is not a formal treaty. The language was painstakingly pored over last December so that President Obama could have the United States join without approval from a recalcitrant Senate. Technically, this leaves the door open for Trump to withdraw from the agreement without Senate approval as well. Withdrawing is not be an action the new president can take immediately, however, despite his campaign-trail rhetoric promising to do so. When the United States joined the Agreement, it became locked in for a period of no less than three years, until January 20, 2018. At that point the United States can inform the UN climate change body by “written notification,” and the withdrawal would take effect one year after notification is received, meaning it would be at least four years before the United States could get out of the agreement. (Another path would be for Trump to withdraw from the United Nations Conference on Climate Change, which could be effective in one year.) While the world waits for what Trump will do in January 2017, the climate talks continue in Marrakesh with minimal interruption. Whether the United States will agree to commit more funds to help poorer countries deal with the climate damage caused by industrialized nations has always been an issue — it will now be of particular debate as the international community prepares for the country to be led by a climate denier. But while Trump might be able to withdraw from the international community — or just ignore the Paris Agreement altogether, climate change will continue. As Alden Meyer, policy director of the Union of Concerned Scientists, said, “It’s clear that Donald Trump is about to be one of the most powerful people in the world…but even he does not have the power to change the laws of physics, to stop the impact of climate change, to stop the rising sea levels.” Meyer was confident that if a President Trump did withdraw from the financial- and emissions-based commitments in the Paris Agreement or the country’s bilateral climate agreement with China, “it will negatively impact his ability to get the cooperation of world leaders on other issues he cares about, like trade and terrorism.” ", "name": "418", "child": "418_1\t418_2\t418_3\t418_4\t418_5", "timestamp": "Nov 11, 2016"}