{"parent": "", "title": "Will the world burn? We’ll find out on Tuesday.", "author": "Natasha Geiling", "sentences": [{"d56e": "Will the world burn? We’ll find out on Tuesday."}, {"54e4": "The U.S. election could have massive repercussions for global climate action."}, {"d5dc": "There are big things happening in the news, especially if you care about climate change."}, {"31c8": "On Friday, the historic Paris Agreement officially went into effect, months earlier than anyone expected. And on Monday, countries from around the world convened in Marrakesh, Morocco for the beginning of the annual U.N. Framework Convention on Climate Change (UNFCCC), where leaders are hoping to begin the process of turning the agreement from a historic moment into reality."}, {"f82f": "In a normal year, these two events would be huge, headline making news. But, if you live in the United States, you probably didn’t notice this was going on. You probably didn’t care — too caught up in the final sprint of what has been one of the most divisive presidential elections in recent history."}, {"00ef": "And, for once — for now, for the next 48 hours — that’s okay. Climate change is a huge story, arguably the biggest story in the world, due to the sheer magnitude of the problem and its consequences. But it’s hard to talk about these two events — the Paris Agreement and the conference to discuss its implementation — unless you know whether Democrat Hillary Clinton or Republican Donald Trump is going to be the next president of the United States. Because depending on who wins the election, the world is facing two very different paths."}, {"ff76": "The dismantling of Obama’s climate legacy by a President Donald TrumpTrump has promised to roll back President Obama’s landmark environmental regulations. Could he do it?thinkprogress.org"}, {"a33c": "If Clinton is elected president, it’s likely U.S. climate policy won’t deviate, at least too radically, from the path it has been on under President Obama. Clinton supports the United States upholding its climate commitments, including the Paris Agreement, and she has talked about her visions of America becoming the “clean energy superpower of the 21st century.” Her explicit policies call for things like installing half a billion solar panels before the end of her first term, and using fuel efficiency standards to lessen the country’s dependence on fossil fuels."}, {"b2bc": "Clinton is far from perfect on climate. She has a history of supporting fracking, released only a vague statement on the controversial Dakota Access Pipeline, and didn’t talk about climate change for much of her campaign. And, as Vox’s Brad Plumer points out, the policies she does support are nowhere near ambitious enough to put the United States on a path to stopping the worst of climate change. But, Plumer also notes that her proposals are about at the edge of what a president can likely do without the help of Congress. And, even while her plan won’t get the United States all the way across the finish line on climate action, at least, as Plumer points out, she has a plan."}, {"1fb2": "Donald Trump has a plan, too — but it’s not about helping the United States maintain its position as a leader on climate action. He wants to pull the U.S. out of the Paris Agreement, a process he could begin during his first term and witness the completion of if he is re-elected."}, {"66bd": "Even if he doesn’t officially pull the United States out of the agreement, the domestic energy policies Trump has made public — opening up offshore drilling and federal coal leases, dismantling the Clean Power Plan — would make it really difficult for the U.S. to meet its commitment of reducing emissions 26 to 28 percent below 2005 levels by 2025. He has also promised to completely cut federal spending on clean energy research and development, which would effectively slow down the transition to a carbon-free economy just as the consequences of unfettered carbon pollution are becoming increasingly clear."}, {"003c": "A Trump presidency is a clean energy nightmareHe’s been clear he’ll do everything in his power to undermine clean energy — both here and globally.thinkprogress.org"}, {"4a67": "On a call with reporters last week, White House adviser on climate and energy John Morton said that even if the United States pulled out of the Paris Agreement, its implementation in other countries would likely continue apace, because the agreement is built on individual commitments from separate countries. And beyond countries looking to implement their own commitments, many in the business community have been bullish about hastening a transition to a low-carbon economy, eager to cash in on the wave of investments in green infrastructure sparked by the agreement."}, {"1f59": "“The international business community, the international policy community, is moving forward and will continue to move forward,” Morton said. “We will see countries continuing to move forward at a fast clip, irrespective of what happens Tuesday. I think the question might be what role, or how quickly does the U.S. move.”"}, {"1a16": "Still, some worry that a Trump presidency, which would eschew climate action in favor of fossil fuel production and unregulated carbon pollution, would have a chilling effect on global climate action."}, {"4bc9": "The United States is the largest historic emitter of carbon dioxide and the second-largest current emitter. U.N. figures have shown that the current commitments of countries that have signed the Paris Agreement are not enough to keep the world below 2 °C of warming — participating countries will need to deepen their domestic emission cuts over the next several years for the agreement to have any chance at staving off the worst of global warming. The last thing the world needs, in that case, is for one of its largest emitters to enact policies that increase, instead of decrease, atmospheric carbon pollution."}, {"2183": "But the participation of the U.S. is crucial to meaningful climate action for reasons other than its outsized contribution to global emissions. Trump has also promised to cancel the United States’ payment to the U.N. Green Climate Fund (GCF), a pool of money paid by developed countries to help developing countries invest in climate mitigation and adaption strategies, like the deployment of solar panels. Obama has promised to pay $3 billion into the fund over four years, and made a $500 million payment in March. Under a President Trump, developing countries could not count on any help from the world’s largest economy."}, {"6deb": "The international community has taken note of Trump’s climate promises, expressing their dismay at his plans to remove the United States from the Paris Agreement. Last week, China’s top climate negotiator criticized Trump, telling Reuters that “a wise political leader should take policy stances that conform with global trends.” France’s environment minster told the Financial Times that she would not “entertain the hypothesis” of a Trump presidency. And Brazil’s environment minister told reporters that “on a personal note” he hoped “Trump doesn’t win.”"}, {"81c2": "Negotiations in Marrakesh began Monday morning — but negotiators will have to wait until Wednesday to know for sure which path the United States will take toward climate action."}], "content": "Will the world burn? We’ll find out on Tuesday. The U.S. election could have massive repercussions for global climate action. There are big things happening in the news, especially if you care about climate change. On Friday, the historic Paris Agreement officially went into effect, months earlier than anyone expected. And on Monday, countries from around the world convened in Marrakesh, Morocco for the beginning of the annual U.N. Framework Convention on Climate Change (UNFCCC), where leaders are hoping to begin the process of turning the agreement from a historic moment into reality. In a normal year, these two events would be huge, headline making news. But, if you live in the United States, you probably didn’t notice this was going on. You probably didn’t care — too caught up in the final sprint of what has been one of the most divisive presidential elections in recent history. And, for once — for now, for the next 48 hours — that’s okay. Climate change is a huge story, arguably the biggest story in the world, due to the sheer magnitude of the problem and its consequences. But it’s hard to talk about these two events — the Paris Agreement and the conference to discuss its implementation — unless you know whether Democrat Hillary Clinton or Republican Donald Trump is going to be the next president of the United States. Because depending on who wins the election, the world is facing two very different paths. The dismantling of Obama’s climate legacy by a President Donald TrumpTrump has promised to roll back President Obama’s landmark environmental regulations. Could he do it?thinkprogress.org If Clinton is elected president, it’s likely U.S. climate policy won’t deviate, at least too radically, from the path it has been on under President Obama. Clinton supports the United States upholding its climate commitments, including the Paris Agreement, and she has talked about her visions of America becoming the “clean energy superpower of the 21st century.” Her explicit policies call for things like installing half a billion solar panels before the end of her first term, and using fuel efficiency standards to lessen the country’s dependence on fossil fuels. Clinton is far from perfect on climate. She has a history of supporting fracking, released only a vague statement on the controversial Dakota Access Pipeline, and didn’t talk about climate change for much of her campaign. And, as Vox’s Brad Plumer points out, the policies she does support are nowhere near ambitious enough to put the United States on a path to stopping the worst of climate change. But, Plumer also notes that her proposals are about at the edge of what a president can likely do without the help of Congress. And, even while her plan won’t get the United States all the way across the finish line on climate action, at least, as Plumer points out, she has a plan. Donald Trump has a plan, too — but it’s not about helping the United States maintain its position as a leader on climate action. He wants to pull the U.S. out of the Paris Agreement, a process he could begin during his first term and witness the completion of if he is re-elected. Even if he doesn’t officially pull the United States out of the agreement, the domestic energy policies Trump has made public — opening up offshore drilling and federal coal leases, dismantling the Clean Power Plan — would make it really difficult for the U.S. to meet its commitment of reducing emissions 26 to 28 percent below 2005 levels by 2025. He has also promised to completely cut federal spending on clean energy research and development, which would effectively slow down the transition to a carbon-free economy just as the consequences of unfettered carbon pollution are becoming increasingly clear. A Trump presidency is a clean energy nightmareHe’s been clear he’ll do everything in his power to undermine clean energy — both here and globally.thinkprogress.org On a call with reporters last week, White House adviser on climate and energy John Morton said that even if the United States pulled out of the Paris Agreement, its implementation in other countries would likely continue apace, because the agreement is built on individual commitments from separate countries. And beyond countries looking to implement their own commitments, many in the business community have been bullish about hastening a transition to a low-carbon economy, eager to cash in on the wave of investments in green infrastructure sparked by the agreement. “The international business community, the international policy community, is moving forward and will continue to move forward,” Morton said. “We will see countries continuing to move forward at a fast clip, irrespective of what happens Tuesday. I think the question might be what role, or how quickly does the U.S. move.” Still, some worry that a Trump presidency, which would eschew climate action in favor of fossil fuel production and unregulated carbon pollution, would have a chilling effect on global climate action. The United States is the largest historic emitter of carbon dioxide and the second-largest current emitter. U.N. figures have shown that the current commitments of countries that have signed the Paris Agreement are not enough to keep the world below 2 °C of warming — participating countries will need to deepen their domestic emission cuts over the next several years for the agreement to have any chance at staving off the worst of global warming. The last thing the world needs, in that case, is for one of its largest emitters to enact policies that increase, instead of decrease, atmospheric carbon pollution. But the participation of the U.S. is crucial to meaningful climate action for reasons other than its outsized contribution to global emissions. Trump has also promised to cancel the United States’ payment to the U.N. Green Climate Fund (GCF), a pool of money paid by developed countries to help developing countries invest in climate mitigation and adaption strategies, like the deployment of solar panels. Obama has promised to pay $3 billion into the fund over four years, and made a $500 million payment in March. Under a President Trump, developing countries could not count on any help from the world’s largest economy. The international community has taken note of Trump’s climate promises, expressing their dismay at his plans to remove the United States from the Paris Agreement. Last week, China’s top climate negotiator criticized Trump, telling Reuters that “a wise political leader should take policy stances that conform with global trends.” France’s environment minster told the Financial Times that she would not “entertain the hypothesis” of a Trump presidency. And Brazil’s environment minister told reporters that “on a personal note” he hoped “Trump doesn’t win.” Negotiations in Marrakesh began Monday morning — but negotiators will have to wait until Wednesday to know for sure which path the United States will take toward climate action. ", "name": "419", "child": "419_1\t419_2", "timestamp": "Nov 7, 2016"}