{"parent": "", "title": "China’s top climate negotiator slams Trump’s promise to pull U.S. out of Paris climate deal", "author": "Alejandro Dávila Fragoso", "sentences": [{"2bb9": "China’s top climate negotiator slams Trump’s promise to pull U.S. out of Paris climate deal"}, {"25fc": "“A wise political leader should take policy stances that conform with global trends.”"}, {"6b2a": "Republican presidential candidate Donald Trump speaks during a campaign rally in Delaware, Ohio. CREDIT: AP/ Evan Vucci"}, {"9ebe": "China’s top climate negotiator criticized Donald Trump’s promise to pull the United States out of the landmark Paris climate agreement, noting a “wise” political leader should enact policy that matches global trends."}, {"a5eb": "In what’s been described as a rare commentary on foreign elections, Xie Zhenhua, China’s special representative for climate change, told reporters U.S. progress will be jeopardized if it moves away from the historic climate agreement set to kick in Friday."}, {"11d3": "In May, Trump promised to cancel the Paris climate agreement during his first speech on energy policies, as he vowed to push for more drilling and fewer regulations. But China, now a leader in renewable energy that’s aggressively cutting greenhouse gas pollution, seems at odds with Trump’s take on the Paris agreement."}, {"99d8": "“I believe a wise political leader should take policy stances that conform with global trends,” Xie said according to Reuters after being asked how China might work with a Trump administration on climate change."}, {"feea": "China’s top climate change negotiator, Xie Zhenhua. CREDIT: AP/Vincent Thian"}, {"e26b": "China traditionally avoids commenting on foreign elections, but this presidential election has drawn strong reactions from leaders around the world, and prompted some Chinese officials to express their animosity towards the Republican presidential candidate more than once."}, {"6e70": "That comes as China, the world’s top greenhouse gass polluter, is increasingly concerned about pollution, external affairs, and its influence on the outside world. For his part, Trump has attacked China repeatedly throughout the course of his campaign."}, {"cf41": "Trump has famously said China created the concept of global warming to harm U.S. manufacturing. And while he’s claimed to “love China and the Chinese people,” he’s repeatedly accused China of taking U.S. jobs and cheating in trade deals and monetary policy."}, {"53bd": "Trump has called global warming an expensive hoax multiple times. Just last December he told a rally: “Obama’s talking about all of this with the global warming and… a lot of it’s a hoax. It’s a hoax. I mean, it’s a money-making industry, okay? It’s a hoax, a lot of it.”"}, {"ba06": "For months Trump has also said he opposes environmental regulations, arguing they are a burden to industry, and is adamantly opposed to the Environmental Protection Agency (EPA). In fact, he is likely to tap Myron Ebell, called “one of America’s most prominent climate change skeptics” to lead his EPA transition."}, {"4c15": "The Republican nominee has also promised to do away with the Clean Power Plan — a sweeping proposal that would cut carbon emissions from the power sector and is considered the main tool for the United States, which is the world’s second largest greenhouse gas polluter, to meet the Paris agreement."}, {"b5a9": "The dismantling of Obama’s climate legacy by a President Donald TrumpTrump has promised to roll back President Obama’s landmark environmental regulations. Could he do it?thinkprogress.org"}, {"0ba3": "However, Trump may not be able to just pull the United States out of the Paris agreement, experts told ThinkProgress, noting it might take him more than four years to do that. Still, having a climate denier as president might weaken the country’s position in global climate negotiations, as other nations are increasingly focused on taking action to address climate change."}, {"dc87": "“If they (United States) resist this trend, I don’t think they’ll win the support of their people, and their country’s economic and social progress will also be affected,” Xie said Tuesday."}, {"fa16": "The United States has vowed to cut between 26 to 28 percent of its 2005 emissions by 2025, Climate Central reported. Democratic presidential nominee Hillary Clinton has said she plans to continue Barack Obama’s climate plans."}, {"6970": "Shortly after the U.S. election, the next round of U.N. climate talks will take place place in Marrakech, Morocco — a critical time for countries to figure out how to meet their commitments under the Paris agreement, which aims to limit warming to 1.5°C above pre-industrial levels. Scientists say that limit might help the planet avoid the most catastrophic effects of climate change, which include extreme weather events and overwhelming sea-level rise."}], "content": "China’s top climate negotiator slams Trump’s promise to pull U.S. out of Paris climate deal “A wise political leader should take policy stances that conform with global trends.” Republican presidential candidate Donald Trump speaks during a campaign rally in Delaware, Ohio. CREDIT: AP/ Evan Vucci China’s top climate negotiator criticized Donald Trump’s promise to pull the United States out of the landmark Paris climate agreement, noting a “wise” political leader should enact policy that matches global trends. In what’s been described as a rare commentary on foreign elections, Xie Zhenhua, China’s special representative for climate change, told reporters U.S. progress will be jeopardized if it moves away from the historic climate agreement set to kick in Friday. In May, Trump promised to cancel the Paris climate agreement during his first speech on energy policies, as he vowed to push for more drilling and fewer regulations. But China, now a leader in renewable energy that’s aggressively cutting greenhouse gas pollution, seems at odds with Trump’s take on the Paris agreement. “I believe a wise political leader should take policy stances that conform with global trends,” Xie said according to Reuters after being asked how China might work with a Trump administration on climate change. China’s top climate change negotiator, Xie Zhenhua. CREDIT: AP/Vincent Thian China traditionally avoids commenting on foreign elections, but this presidential election has drawn strong reactions from leaders around the world, and prompted some Chinese officials to express their animosity towards the Republican presidential candidate more than once. That comes as China, the world’s top greenhouse gass polluter, is increasingly concerned about pollution, external affairs, and its influence on the outside world. For his part, Trump has attacked China repeatedly throughout the course of his campaign. Trump has famously said China created the concept of global warming to harm U.S. manufacturing. And while he’s claimed to “love China and the Chinese people,” he’s repeatedly accused China of taking U.S. jobs and cheating in trade deals and monetary policy. Trump has called global warming an expensive hoax multiple times. Just last December he told a rally: “Obama’s talking about all of this with the global warming and… a lot of it’s a hoax. It’s a hoax. I mean, it’s a money-making industry, okay? It’s a hoax, a lot of it.” For months Trump has also said he opposes environmental regulations, arguing they are a burden to industry, and is adamantly opposed to the Environmental Protection Agency (EPA). In fact, he is likely to tap Myron Ebell, called “one of America’s most prominent climate change skeptics” to lead his EPA transition. The Republican nominee has also promised to do away with the Clean Power Plan — a sweeping proposal that would cut carbon emissions from the power sector and is considered the main tool for the United States, which is the world’s second largest greenhouse gas polluter, to meet the Paris agreement. The dismantling of Obama’s climate legacy by a President Donald TrumpTrump has promised to roll back President Obama’s landmark environmental regulations. Could he do it?thinkprogress.org However, Trump may not be able to just pull the United States out of the Paris agreement, experts told ThinkProgress, noting it might take him more than four years to do that. Still, having a climate denier as president might weaken the country’s position in global climate negotiations, as other nations are increasingly focused on taking action to address climate change. “If they (United States) resist this trend, I don’t think they’ll win the support of their people, and their country’s economic and social progress will also be affected,” Xie said Tuesday. The United States has vowed to cut between 26 to 28 percent of its 2005 emissions by 2025, Climate Central reported. Democratic presidential nominee Hillary Clinton has said she plans to continue Barack Obama’s climate plans. Shortly after the U.S. election, the next round of U.N. climate talks will take place place in Marrakech, Morocco — a critical time for countries to figure out how to meet their commitments under the Paris agreement, which aims to limit warming to 1.5°C above pre-industrial levels. Scientists say that limit might help the planet avoid the most catastrophic effects of climate change, which include extreme weather events and overwhelming sea-level rise. ", "name": "420", "child": "420_1\t420_2\t420_3\t420_4", "timestamp": "Nov 1, 2016"}