{"parent": "", "title": "The world’s fourth-largest emitter ratifies Paris climate agreement", "author": "Natasha Geiling", "sentences": [{"7a13": "The world’s fourth-largest emitter ratifies Paris climate agreement"}, {"0d5a": "Getting India on board is a huge deal for global climate action."}, {"83c6": "CREDIT: AP PHOTO/GURINDER OSAN, FILE"}, {"5148": "On Sunday, October 2 — the birthday of Mahatma Gandhi — India formally ratified the Paris climate agreement, bringing the total number of countries that have officially joined the historic pact to 62, representing 51.89 percent of global emissions."}, {"e72a": "That places the agreement on the brink of entering into force, as it requires 55 countries representing 55 percent of global emissions to ratify the treaty domestically before it officially kicks in. The European Union — whose 28 member states account for about 10 percent of the world’s greenhouse gas emissions — has indicated it will ratify the agreement in a vote Tuesday, October 3, meaning the agreement could enter into force as early as November."}, {"df6b": "“We are now on the verge of entry into force for the Paris Agreement at a pace that is one of the most rapid ever and faster than almost anyone imagined,” Manish Bapna, executive vice president and managing director of the World Resources Institute said in a statement. “This is an exciting moment in history as countries ramp up action and work collectively to address this global challenge.”"}, {"124c": "But India signing onto the Paris accord is notable for reasons beyond bringing the agreement ever closer to taking effect: India’s willingness to play ball with the international climate community signifies an important shift in international climate relations."}, {"b271": "As one of the world’s largest emitters and a rapidly-developing nation, India has played an important role in climate negotiations, both in the lead up to and months following the United Nations climate conference in Paris. At the Paris negotiations, India was firm in its stance that any agreement should not impede its own development goals; instead, India argued that developed countries, like the United States, should shoulder more of the burden (mostly in the form of climate finance) and more stringent regulations. That led to a bit of an impasse between countries like the U.S. and India, and as negotiations wrapped up, some worried India might play spoiler to the entire agreement. That didn’t happen; instead, India signed onto the Paris pact, ultimately compromising on things like climate finance and climate commitments from developed nations."}, {"2015": "As recently as September, during the G20 Summit, India was still playing the part of spoiler to the Paris climate deal, derailing efforts to include a firm deadline for ratification in the text of the G20 Agreement. According to the Indian Express, India’s chief negotiator at the summit argued that the country was not domestically prepared to ratify before the end of 2016, setting off concerns that, without one of the world’s largest emitters on board, the agreement might not enter into force before the year’s end."}, {"e566": "For climate activists, the G20 summit was a mixed bagThe good, the bad, and the ugly of climate at the G20 Summit.thinkprogress.org"}, {"7f0c": "So having India on board is a major win for international climate action — it strengthens the agreement from detractors who argue climate change is too large of a problem for a single country to tackle on its own. It also shows India is seriously thinking about how it can fuel its own development in a sustainable way — something that is really important for global climate action, because India’s demand for energy is set to increase faster than almost anywhere else in the near future."}, {"1ca6": "Right now, more than 300 million Indians lack access to electricity — and a lot of Indians get their power from dirty, polluting sources like coal or biomass. But India has also pledged to greatly expand solar power throughout the country, and has set a goal of getting 40 percent of its electric power from renewable sources by 2030. Ratifying the Paris agreement — especially on an unexpectedly-accelerated timeline — shows India is committed to meeting these energy demands in a way that is consistent with its lofty emissions-reduction goals, at least in theory."}, {"4367": "India’s ratification of the deal would also would make the United States, the world’s largest historic emitter, look pretty bad if it reneges on its own domestic climate pledges — like the Clean Power Plan — which are crucial to fulfilling its international promises. The U.S. has also pledged to mobilize up to $400 million in climate finance to help India invest in small-scale renewable energy projects — something a future president could ostensibly walk back. That’s unlikely to happen if Democratic candidate Hillary Clinton is elected (she has consistently voiced support for the Paris agreement) but is a distinct possibility if Republican nominee Donald Trump takes the White House."}], "content": "The world’s fourth-largest emitter ratifies Paris climate agreement Getting India on board is a huge deal for global climate action. CREDIT: AP PHOTO/GURINDER OSAN, FILE On Sunday, October 2 — the birthday of Mahatma Gandhi — India formally ratified the Paris climate agreement, bringing the total number of countries that have officially joined the historic pact to 62, representing 51.89 percent of global emissions. That places the agreement on the brink of entering into force, as it requires 55 countries representing 55 percent of global emissions to ratify the treaty domestically before it officially kicks in. The European Union — whose 28 member states account for about 10 percent of the world’s greenhouse gas emissions — has indicated it will ratify the agreement in a vote Tuesday, October 3, meaning the agreement could enter into force as early as November. “We are now on the verge of entry into force for the Paris Agreement at a pace that is one of the most rapid ever and faster than almost anyone imagined,” Manish Bapna, executive vice president and managing director of the World Resources Institute said in a statement. “This is an exciting moment in history as countries ramp up action and work collectively to address this global challenge.” But India signing onto the Paris accord is notable for reasons beyond bringing the agreement ever closer to taking effect: India’s willingness to play ball with the international climate community signifies an important shift in international climate relations. As one of the world’s largest emitters and a rapidly-developing nation, India has played an important role in climate negotiations, both in the lead up to and months following the United Nations climate conference in Paris. At the Paris negotiations, India was firm in its stance that any agreement should not impede its own development goals; instead, India argued that developed countries, like the United States, should shoulder more of the burden (mostly in the form of climate finance) and more stringent regulations. That led to a bit of an impasse between countries like the U.S. and India, and as negotiations wrapped up, some worried India might play spoiler to the entire agreement. That didn’t happen; instead, India signed onto the Paris pact, ultimately compromising on things like climate finance and climate commitments from developed nations. As recently as September, during the G20 Summit, India was still playing the part of spoiler to the Paris climate deal, derailing efforts to include a firm deadline for ratification in the text of the G20 Agreement. According to the Indian Express, India’s chief negotiator at the summit argued that the country was not domestically prepared to ratify before the end of 2016, setting off concerns that, without one of the world’s largest emitters on board, the agreement might not enter into force before the year’s end. For climate activists, the G20 summit was a mixed bagThe good, the bad, and the ugly of climate at the G20 Summit.thinkprogress.org So having India on board is a major win for international climate action — it strengthens the agreement from detractors who argue climate change is too large of a problem for a single country to tackle on its own. It also shows India is seriously thinking about how it can fuel its own development in a sustainable way — something that is really important for global climate action, because India’s demand for energy is set to increase faster than almost anywhere else in the near future. Right now, more than 300 million Indians lack access to electricity — and a lot of Indians get their power from dirty, polluting sources like coal or biomass. But India has also pledged to greatly expand solar power throughout the country, and has set a goal of getting 40 percent of its electric power from renewable sources by 2030. Ratifying the Paris agreement — especially on an unexpectedly-accelerated timeline — shows India is committed to meeting these energy demands in a way that is consistent with its lofty emissions-reduction goals, at least in theory. India’s ratification of the deal would also would make the United States, the world’s largest historic emitter, look pretty bad if it reneges on its own domestic climate pledges — like the Clean Power Plan — which are crucial to fulfilling its international promises. The U.S. has also pledged to mobilize up to $400 million in climate finance to help India invest in small-scale renewable energy projects — something a future president could ostensibly walk back. That’s unlikely to happen if Democratic candidate Hillary Clinton is elected (she has consistently voiced support for the Paris agreement) but is a distinct possibility if Republican nominee Donald Trump takes the White House. ", "name": "422", "child": "422_1", "timestamp": "Oct 3, 2016"}