{"parent": "", "title": "Fresh off a disastrous governorship, Sam Brownback reportedly set for a cushy job at the U.N.", "author": "Alan Pyke", "sentences": [{"3c0b": "Fresh off a disastrous governorship, Sam Brownback reportedly set for a cushy job at the U.N."}, {"efc0": "Kansas is reeling from Brownback’s policies. Trump wants to send him to Rome to talk about food."}, {"3fb5": "Kansas Gov. Sam Brownback (R) waves to lawmakers during his State of the State speech. CREDIT: AP Photo/Orlin Wagner"}, {"12d6": "Kansas Gov. Sam Brownback (R) will soon be given a plum United Nations job by President Donald Trump, multiple news outlets in the state reported last week."}, {"b7c7": "Neither the governor’s office nor the White House has confirmed the reports, which quote sources alternately describe it as a “done deal” and “more tentative than that.” The job would take Brownback to and from Rome, where the cluster of U.N. agencies he would be be charged with assisting are based."}, {"c27b": "Under normal circumstances there might be little to say about one politician setting another up with a cushy gig on the Mediterranean. But Brownback would be fleeing a political and economic crisis, leaving about 3 million Kansans behind in a budgetary inferno of his own devising."}, {"28ea": "Brownback’s “experiment” involved radical tax cuts, including the complete elimination of all taxes on “pass-through” income — a category almost anyone can claim, if they have a good enough accountant and sufficient resources to structure their economic life a bit oddly. Wealthy people in the state saw enormous savings. Brownback told voters it would be a “shot of adrenaline into the heart of the Kansas economy.”"}, {"98d2": "Kansas Uses Sex Toy Auction To Help Close Budget Gapthinkprogress.org"}, {"e1e6": "But the governor’s experiment quickly created a billion-dollar hole in the small state’s budget. The economic boom didn’t come. Overall economic growth there is about half the national rate over the past few years."}, {"f184": "The state ranks 45th in private-sector job creation — significantly behind neighboring Missouri and Nebraska — because job growth essentially flattened out after Brownback’s tax cuts went into effect."}, {"4715": "Kansans also saw their income growth slow dramatically after Brownback’s ideas took hold. Per-capita income growth in Kansas is also behind the national pace since 2014."}, {"5d57": "In response to the wave of inconvenient data, Brownback told state economists to stop reporting quarterly figures on job growth, unemployment, and income."}, {"d834": "As the budget gap persisted and negative economic data began to come in, Brownback dug in harder. Rather than acknowledge his tax plan was unsustainable and look to claw back some of the revenue lost to tax cuts for the rich, he began cutting programs directly tied to people’s quality of life — and raising taxes on the poor. Sales taxes, which fall heavier on the poor than the rich because low-income families have less slack to absorb higher prices at the cash register, have jumped twice."}, {"b189": "Service cuts have been broad and deep. Home health care services for seniors in Kansas have been cut by 30 percent."}, {"5154": "Kansas Governor Justifies Kicking 15,000 People Off Food Stampsthinkprogress.org"}, {"7736": "Public school budgets got so threadbare that nurses couldn’t afford to buy ice packs and resorted to keeping frozen sponges in their offices. Schools funding is so far below what Kansas’ children need that the state’s Supreme Court has repeatedly ordered lawmakers to restore hundreds of millions of dollars to public school budgets. The governor slashed state higher education funding too."}, {"c01f": "Health care for the poor was slashed by tens of millions of dollars, pushing Kansas from the middle of the pack on Medicaid reimbursement rates for providers down to 35th in the nation. Brownback also turned down some $1.2 billion in federal health care funding by declining to expand his Medicaid system under the Affordable Care Act’s auspices. His latest budget would chop $20 million out of psychiatric hospitals in the state."}, {"8539": "The upshot, for Kansas residents, is that life has become more expensive and less supported. It is harder to get by when all is well, and harder to get help when anything goes wrong. That is an unattractive blend for the very businesses Brownback pledged to attract with all of this slash-and-burn right-wing economic policy. Unhappy, undereducated, unhealthy, economically unstable people do not make a promising workforce."}, {"d9e5": "Kansas Lawmakers Ignore Separation Of Powers, Look To Impeach Supreme Court Justicesthinkprogress.org"}, {"2893": "That is the nightmare from which Brownback is now being offered a lifeline by the White House. Even some of Brownback’s fellow Republicans in the state have begun to acknowledge that his experiment is going badly. Some of his loyalists lost their seats last summer."}, {"982d": "State Republicans should find it easier to break away from him after this week’s reports that the White House wants to whisk Brownback off to Rome, former state budget director Duane Goossen says."}, {"351f": "“If even Governor Brownback can’t summon the courage to stay and fight for his failed tax experiment, why should any lawmaker defend it,” Goossen, now a fellow at a progressive think tank in the state, wrote in a statement."}, {"26d2": "If Trump does bestow a U.N. role upon Brownback, he won’t just be cutting short a Republican ally’s term in office. He’ll be rescuing Brownback from a political, economic, and social ruin."}], "content": "Fresh off a disastrous governorship, Sam Brownback reportedly set for a cushy job at the U.N. Kansas is reeling from Brownback’s policies. Trump wants to send him to Rome to talk about food. Kansas Gov. Sam Brownback (R) waves to lawmakers during his State of the State speech. CREDIT: AP Photo/Orlin Wagner Kansas Gov. Sam Brownback (R) will soon be given a plum United Nations job by President Donald Trump, multiple news outlets in the state reported last week. Neither the governor’s office nor the White House has confirmed the reports, which quote sources alternately describe it as a “done deal” and “more tentative than that.” The job would take Brownback to and from Rome, where the cluster of U.N. agencies he would be be charged with assisting are based. Under normal circumstances there might be little to say about one politician setting another up with a cushy gig on the Mediterranean. But Brownback would be fleeing a political and economic crisis, leaving about 3 million Kansans behind in a budgetary inferno of his own devising. Brownback’s “experiment” involved radical tax cuts, including the complete elimination of all taxes on “pass-through” income — a category almost anyone can claim, if they have a good enough accountant and sufficient resources to structure their economic life a bit oddly. Wealthy people in the state saw enormous savings. Brownback told voters it would be a “shot of adrenaline into the heart of the Kansas economy.” Kansas Uses Sex Toy Auction To Help Close Budget Gapthinkprogress.org But the governor’s experiment quickly created a billion-dollar hole in the small state’s budget. The economic boom didn’t come. Overall economic growth there is about half the national rate over the past few years. The state ranks 45th in private-sector job creation — significantly behind neighboring Missouri and Nebraska — because job growth essentially flattened out after Brownback’s tax cuts went into effect. Kansans also saw their income growth slow dramatically after Brownback’s ideas took hold. Per-capita income growth in Kansas is also behind the national pace since 2014. In response to the wave of inconvenient data, Brownback told state economists to stop reporting quarterly figures on job growth, unemployment, and income. As the budget gap persisted and negative economic data began to come in, Brownback dug in harder. Rather than acknowledge his tax plan was unsustainable and look to claw back some of the revenue lost to tax cuts for the rich, he began cutting programs directly tied to people’s quality of life — and raising taxes on the poor. Sales taxes, which fall heavier on the poor than the rich because low-income families have less slack to absorb higher prices at the cash register, have jumped twice. Service cuts have been broad and deep. Home health care services for seniors in Kansas have been cut by 30 percent. Kansas Governor Justifies Kicking 15,000 People Off Food Stampsthinkprogress.org Public school budgets got so threadbare that nurses couldn’t afford to buy ice packs and resorted to keeping frozen sponges in their offices. Schools funding is so far below what Kansas’ children need that the state’s Supreme Court has repeatedly ordered lawmakers to restore hundreds of millions of dollars to public school budgets. The governor slashed state higher education funding too. Health care for the poor was slashed by tens of millions of dollars, pushing Kansas from the middle of the pack on Medicaid reimbursement rates for providers down to 35th in the nation. Brownback also turned down some $1.2 billion in federal health care funding by declining to expand his Medicaid system under the Affordable Care Act’s auspices. His latest budget would chop $20 million out of psychiatric hospitals in the state. The upshot, for Kansas residents, is that life has become more expensive and less supported. It is harder to get by when all is well, and harder to get help when anything goes wrong. That is an unattractive blend for the very businesses Brownback pledged to attract with all of this slash-and-burn right-wing economic policy. Unhappy, undereducated, unhealthy, economically unstable people do not make a promising workforce. Kansas Lawmakers Ignore Separation Of Powers, Look To Impeach Supreme Court Justicesthinkprogress.org That is the nightmare from which Brownback is now being offered a lifeline by the White House. Even some of Brownback’s fellow Republicans in the state have begun to acknowledge that his experiment is going badly. Some of his loyalists lost their seats last summer. State Republicans should find it easier to break away from him after this week’s reports that the White House wants to whisk Brownback off to Rome, former state budget director Duane Goossen says. “If even Governor Brownback can’t summon the courage to stay and fight for his failed tax experiment, why should any lawmaker defend it,” Goossen, now a fellow at a progressive think tank in the state, wrote in a statement. If Trump does bestow a U.N. role upon Brownback, he won’t just be cutting short a Republican ally’s term in office. He’ll be rescuing Brownback from a political, economic, and social ruin. ", "name": "424", "child": "424_1\t424_2\t424_3\t424_4\t424_5\t424_6\t424_7\t424_8\t424_9\t424_10\t424_11\t424_12\t424_13\t424_14\t424_15\t424_16\t424_17", "timestamp": "Mar 13"}