{"parent": "", "title": "Israel will build new homes in defiance of UN resolution to end settlements", "author": "Esther Yu Hsi Lee", "sentences": [{"ef70": "Israel will build new homes in defiance of UN resolution to end settlements"}, {"7098": "Israel will not “turn the other cheek.”"}, {"aab6": "This Oct. 22, 2016, photo shows a general view of housing in the Israeli orthodox Jewish settlement of Revava, near the West Bank city of Nablus. CREDIT: AP Photo/Majdi Mohammed"}, {"0914": "Israel escalated tensions Monday by announcing plans to build more settlements in East Jerusalem. The announcement followed a United Nations Security Council resolution criticizing West Bank settlements last week. Israel also warned countries against further actions, and Prime Minister Benjamin Netanyahu said that his country would not “turn the other cheek.”"}, {"9c35": "Israel’s government has plans to build nearly 6,000 homes in the predominantly Palestinian eastern Jerusalem, the New York Times reported."}, {"f2d2": "The UN’s 15-member Security Council passed Resolution 2334 on Friday 14-o, with the United States abstaining on the resolution and allowing the vote to pass."}, {"fba1": "Under the resolution, settlements are considered illegal under international law and are “a major obstacle to the vision of two States living side-by-side in peace and security.” For the past three decades, the United Nations has condemned settlement activity but did not vote on a resolution. The United States did not veto the vote, saying that it still shows “our affirmative support for a two-state solution.”"}, {"a093": "“Israel is a country with national pride, and we do not turn the other cheek,” Prime Minister Benjamin Netanyahu said. “This is a responsible, measured and vigorous response, the natural response of a healthy people that is making it clear to the nations of the world that what was done at the U.N. is unacceptable to us.”"}, {"ad88": "After the resolution passed, Israel’s Ministry of Foreign Affairs summoned ambassadors and envoys from countries that have diplomatic ties with Israel. U.S. Ambassador to Israel Dan Shapiro met with Netanyahu on Sunday."}, {"0b34": "Incoming President-elect Donald Trump took to Twitter several times to express his displeasure at the United Nations and at the United States’ abstention, having hoped that the U.S. government would stick to its longstanding policy of vetoing the anti-settlement resolution."}, {"d99d": "Trump made a campaign promise to move the U.S. Embassy from Tel Aviv to Jerusalem, upsetting the provisional future of a city long claimed by both Israelis and Palestinians as their capital. In May, he encouraged Israelis to “keep moving forward” with settlement building."}], "content": "Israel will build new homes in defiance of UN resolution to end settlements Israel will not “turn the other cheek.” This Oct. 22, 2016, photo shows a general view of housing in the Israeli orthodox Jewish settlement of Revava, near the West Bank city of Nablus. CREDIT: AP Photo/Majdi Mohammed Israel escalated tensions Monday by announcing plans to build more settlements in East Jerusalem. The announcement followed a United Nations Security Council resolution criticizing West Bank settlements last week. Israel also warned countries against further actions, and Prime Minister Benjamin Netanyahu said that his country would not “turn the other cheek.” Israel’s government has plans to build nearly 6,000 homes in the predominantly Palestinian eastern Jerusalem, the New York Times reported. The UN’s 15-member Security Council passed Resolution 2334 on Friday 14-o, with the United States abstaining on the resolution and allowing the vote to pass. Under the resolution, settlements are considered illegal under international law and are “a major obstacle to the vision of two States living side-by-side in peace and security.” For the past three decades, the United Nations has condemned settlement activity but did not vote on a resolution. The United States did not veto the vote, saying that it still shows “our affirmative support for a two-state solution.” “Israel is a country with national pride, and we do not turn the other cheek,” Prime Minister Benjamin Netanyahu said. “This is a responsible, measured and vigorous response, the natural response of a healthy people that is making it clear to the nations of the world that what was done at the U.N. is unacceptable to us.” After the resolution passed, Israel’s Ministry of Foreign Affairs summoned ambassadors and envoys from countries that have diplomatic ties with Israel. U.S. Ambassador to Israel Dan Shapiro met with Netanyahu on Sunday. Incoming President-elect Donald Trump took to Twitter several times to express his displeasure at the United Nations and at the United States’ abstention, having hoped that the U.S. government would stick to its longstanding policy of vetoing the anti-settlement resolution. Trump made a campaign promise to move the U.S. Embassy from Tel Aviv to Jerusalem, upsetting the provisional future of a city long claimed by both Israelis and Palestinians as their capital. In May, he encouraged Israelis to “keep moving forward” with settlement building. ", "name": "426", "child": "426_1\t426_2\t426_3\t426_4\t426_5\t426_6\t426_7\t426_8\t426_9\t426_10\t426_11\t426_12", "timestamp": "Dec 27, 2016"}