{"parent": "", "title": "The U.N.’s new top diplomat is a disappointment for diversity", "author": "E.A. Crunden", "sentences": [{"997f": "The U.N.’s new top diplomat is a disappointment for diversity"}, {"b489": "“There were seven outstanding women who put their whole heart into their candidacy and all of them have been abandoned.”"}, {"1bdd": "Antonio Guterres, United Nations High Commissioner for Refugees, during an interview with the Associated Press, in London, Tuesday, Nov. 4, 2014. CREDIT: AP Photo/Kirsty Wigglesworth"}, {"3517": "On Thursday, the U.N. General Assembly appointed António Guterres, the former prime minister of Portugal and recent U.N. High Commissioner for Refugees, as the next Secretary-General of the United Nations. Per protocol, Guterres will now succeed current Secretary-General Ban-Ki Moon when he leaves the position in 2017."}, {"cadc": "The world’s chief diplomat was chosen last week during a closed-door session by the Security Council’s 15 members. Though there was initial concern that some members might push back, the decision was remarkably uncontentious. Following the adoption of a resolution presenting Guterres as the Security Council’s choice, the General Assembly applauded the choice; the 67 year-old politician will begin his term on January 1."}, {"db56": "The moment will be a bittersweet one for the many people who had hoped that a woman might assume the position for the first time in the organization’s history. It will also sting for Eastern Europe — the only U.N. regional group to never be represented in the organization’s top role."}, {"b049": "When asked, U.S. Permanent Representative to the United Nations Samantha Power praised the selection, and spoke to Guterres’ background in advocating for refugees:"}, {"8851": "“..in the end, there was just a candidate whose experience, vision, and versatility across a range of areas proved compelling. And it was remarkably uncontentious, uncontroversial, and I think it speaks to the fact that each of us represent our nation and each of us know how fundamentally important this position is in terms of the welfare of our own citizens. If we have these transnational threats and we don’t have somebody at the helm of the United Nations that can mobilize coalitions, that can make the tools of this institution — creaky though they are, flawed though they are — work better for people, that’s going to be more pain and more suffering and more dysfunction than we can afford. And I think ultimately, it’s that simple. People united around a person who impressed throughout the process and has impressed on multiple axes in his service in Portuguese politics and then, of course, at the helm of UNHCR.”"}, {"a5e3": "A total of 12 candidates were initially put forward, only nine of whom lasted through the process, with another added last minute by Eastern Europe. Ultimately, nine of the 13 individuals considered were put forward by Eastern Europe. The group’s last-minute addition, European commissioner and Bulgarian native Kristalina Georgieva, joined only days before the final straw poll, after Bulgaria withdrew its support for UNESCO chief Irinia Bokova in favor of Georgieva. The switch was made in acknowledgement of Bokova’s failure to garner significant support from the Security Council. Dismayed, Bulgaria put forward Georgieva; she in turn also failed to attract attention, and Eastern Europe lost a shot at the job."}, {"6dcb": "Initially, Russia had strongly advocated for a candidate from its region, with a nod towards gender inclusion. “We do believe that it’s the turn of Eastern Europe to provide the next secretary-general. We would very much like to see a woman,” Radio Free Europe/Radio Free Liberty reported Russian U.N. Ambassador Vitaly Churkin as saying. A veto from Russia would have halted any candidate from moving forward. In the end, however, the nation did not raise an objection over Guterres."}, {"64e9": "Russia’s acquiescence to the selection of Guterres has not been matched elsewhere."}, {"9365": "While Guterres has a refugee-friendly background at a time when the rights of refugees are sharply in focus, he is also a disappointment for activists hoping for demographic shifts. In a year that has seen historic firsts for women, including an election nudging the United States closer than ever to electing its first female president, the selection of a woman was considered a priority. Seven women were put forward for the job, and numerous diplomats expressed their support for a female candidate. However, none were able to garner the level of support that Guterres did — or even came close."}, {"10fb": "Whether or not this points to flaws within the process itself is up for debate. Choosing the United Nations’ top position is a complex affair. Article 97 of the United Nations charter calls for the role to be appointed by the organization’s General Assembly, following the recommendation of the Security Council. The five permanent members of the Security Council (the United States, the United Kingdom, Russia, China, and France) can veto any choice made, but cannot put forward any candidates of their own. Instead, candidates come from the five U.N. Regional Groups: Latin American and Caribbean, African, Asia-Pacific, Eastern European, and Western European and Others."}, {"768d": "Eastern Europeans have long suffered in the shadow of their western neighbors. There have been eight secretary-generals to date; Guterres will be the ninth man and the fifth Western European selected for the role — hardly a diverse addition."}, {"90d5": "Appointing Guterres has already caused a stir with advocates for a female secretary-general. Jean Krasno, the head of WomanSG, which advocated for a woman in the position, expressed her anger and disappointment to Buzzfeed. “There were seven outstanding women who put their whole heart into their candidacy and all of them have been abandoned,” Krasno said. “It makes me wonder if they were ever taken seriously at all.”"}, {"6f76": "Responses from Guterres’ competitors have nonetheless been relatively uniform in their congratulations. Several female candidates praised the choice, including Bulgaria’s Irina Bokova, Costa Rica’s Christiana Figueres, and New Zealand’s Helen Clark, who were all in the running."}, {"275a": "As advocates for more diverse leadership are well aware, the selection of Guterres will have long-term implications. The term length for the position of Secretary General is customarily five years and can be stretched out much longer, so it will likely be some time before another candidate is considered."}, {"d9d4": "UPDATE: This piece was updated to reflect Guterres’ official appointment on October 13, 2016."}], "content": "The U.N.’s new top diplomat is a disappointment for diversity “There were seven outstanding women who put their whole heart into their candidacy and all of them have been abandoned.” Antonio Guterres, United Nations High Commissioner for Refugees, during an interview with the Associated Press, in London, Tuesday, Nov. 4, 2014. CREDIT: AP Photo/Kirsty Wigglesworth On Thursday, the U.N. General Assembly appointed António Guterres, the former prime minister of Portugal and recent U.N. High Commissioner for Refugees, as the next Secretary-General of the United Nations. Per protocol, Guterres will now succeed current Secretary-General Ban-Ki Moon when he leaves the position in 2017. The world’s chief diplomat was chosen last week during a closed-door session by the Security Council’s 15 members. Though there was initial concern that some members might push back, the decision was remarkably uncontentious. Following the adoption of a resolution presenting Guterres as the Security Council’s choice, the General Assembly applauded the choice; the 67 year-old politician will begin his term on January 1. The moment will be a bittersweet one for the many people who had hoped that a woman might assume the position for the first time in the organization’s history. It will also sting for Eastern Europe — the only U.N. regional group to never be represented in the organization’s top role. When asked, U.S. Permanent Representative to the United Nations Samantha Power praised the selection, and spoke to Guterres’ background in advocating for refugees: “..in the end, there was just a candidate whose experience, vision, and versatility across a range of areas proved compelling. And it was remarkably uncontentious, uncontroversial, and I think it speaks to the fact that each of us represent our nation and each of us know how fundamentally important this position is in terms of the welfare of our own citizens. If we have these transnational threats and we don’t have somebody at the helm of the United Nations that can mobilize coalitions, that can make the tools of this institution — creaky though they are, flawed though they are — work better for people, that’s going to be more pain and more suffering and more dysfunction than we can afford. And I think ultimately, it’s that simple. People united around a person who impressed throughout the process and has impressed on multiple axes in his service in Portuguese politics and then, of course, at the helm of UNHCR.” A total of 12 candidates were initially put forward, only nine of whom lasted through the process, with another added last minute by Eastern Europe. Ultimately, nine of the 13 individuals considered were put forward by Eastern Europe. The group’s last-minute addition, European commissioner and Bulgarian native Kristalina Georgieva, joined only days before the final straw poll, after Bulgaria withdrew its support for UNESCO chief Irinia Bokova in favor of Georgieva. The switch was made in acknowledgement of Bokova’s failure to garner significant support from the Security Council. Dismayed, Bulgaria put forward Georgieva; she in turn also failed to attract attention, and Eastern Europe lost a shot at the job. Initially, Russia had strongly advocated for a candidate from its region, with a nod towards gender inclusion. “We do believe that it’s the turn of Eastern Europe to provide the next secretary-general. We would very much like to see a woman,” Radio Free Europe/Radio Free Liberty reported Russian U.N. Ambassador Vitaly Churkin as saying. A veto from Russia would have halted any candidate from moving forward. In the end, however, the nation did not raise an objection over Guterres. Russia’s acquiescence to the selection of Guterres has not been matched elsewhere. While Guterres has a refugee-friendly background at a time when the rights of refugees are sharply in focus, he is also a disappointment for activists hoping for demographic shifts. In a year that has seen historic firsts for women, including an election nudging the United States closer than ever to electing its first female president, the selection of a woman was considered a priority. Seven women were put forward for the job, and numerous diplomats expressed their support for a female candidate. However, none were able to garner the level of support that Guterres did — or even came close. Whether or not this points to flaws within the process itself is up for debate. Choosing the United Nations’ top position is a complex affair. Article 97 of the United Nations charter calls for the role to be appointed by the organization’s General Assembly, following the recommendation of the Security Council. The five permanent members of the Security Council (the United States, the United Kingdom, Russia, China, and France) can veto any choice made, but cannot put forward any candidates of their own. Instead, candidates come from the five U.N. Regional Groups: Latin American and Caribbean, African, Asia-Pacific, Eastern European, and Western European and Others. Eastern Europeans have long suffered in the shadow of their western neighbors. There have been eight secretary-generals to date; Guterres will be the ninth man and the fifth Western European selected for the role — hardly a diverse addition. Appointing Guterres has already caused a stir with advocates for a female secretary-general. Jean Krasno, the head of WomanSG, which advocated for a woman in the position, expressed her anger and disappointment to Buzzfeed. “There were seven outstanding women who put their whole heart into their candidacy and all of them have been abandoned,” Krasno said. “It makes me wonder if they were ever taken seriously at all.” Responses from Guterres’ competitors have nonetheless been relatively uniform in their congratulations. Several female candidates praised the choice, including Bulgaria’s Irina Bokova, Costa Rica’s Christiana Figueres, and New Zealand’s Helen Clark, who were all in the running. As advocates for more diverse leadership are well aware, the selection of Guterres will have long-term implications. The term length for the position of Secretary General is customarily five years and can be stretched out much longer, so it will likely be some time before another candidate is considered. UPDATE: This piece was updated to reflect Guterres’ official appointment on October 13, 2016. ", "name": "427", "child": "427_1\t427_2\t427_3427_1\t427_2\t427_3", "timestamp": "Oct 6, 2016"}