{"parent": "", "title": "DHS Secretary John Kelly: A single DUI could lead to deportation proceedings", "author": "Esther Yu Hsi Lee", "sentences": [{"aa32": "DHS Secretary John Kelly: A single DUI could lead to deportation proceedings"}, {"393a": "This wasn’t the case under the Obama administration."}, {"35b9": "Homeland Security Secretary John Kelly. CREDIT: AP Photo/J. Scott Applewhite"}, {"3e10": "During an interview on Sunday’s Meet the Press with host Chuck Todd, Department of Homeland Security (DHS) Secretary John Kelly affirmed that the Trump administration will aggressively convict immigrants as criminals and deport people previously deemed as non-priorities under the Obama administration."}, {"cee1": "Now, even a single conviction for driving under the influence could be considered a serious enough offense that triggers the deportation proceeding, Kelly said in response to Todd’s question to “define a criminal.”"}, {"1a40": "SEC. JOHN KELLY: It is fair to say that the definition of criminal has not changed, but where on the spectrum of criminality we operate has changed."}, {"c9b4": "CHUCK TODD: So can you give me an example of somebody that wasn’t deported before that you’re deporting now?"}, {"b02a": "SEC. JOHN KELLY: Well, someone, as an example, with multiple DUIs. Even a single DUI, depending on other aspects, would get you into the system. And remember, for the most —"}, {"3e79": "CHUCK TODD: And this wouldn’t have been the case under the –"}, {"4938": "SEC. JOHN KELLY: Unlikely."}, {"79f4": "CHUCK TODD: — previous administration."}, {"0cef": "Kelly later confirmed in the interview that Immigration and Customs Enforcement (ICE)recently completed “a targeted operation” to go after visa overstays, or people who have stayed in the country past their visa expiration date. An increasing number of the undocumented population are visa overstays."}, {"3a3d": "“I mean it’s a big problem,” Kelly said. “There’s a lot of people out there that need to be taken into custody and deported, according to the law.”"}, {"48c5": "Since he took office, President Donald Trump has signed executive orders that harshly enforce immigration laws and expand the types of crimes punishable by deportation. In two memos issued in February, Kelly instructed the hiring of 5,000 more border agents and 10,000 more ICE officers tasked with carrying out his executive orders along the U.S. border and within the interior of the country to go after undocumented immigrants."}, {"98c6": "Previously, the Obama administration prioritized the detention and deportation of undocumented immigrants convicted of serious criminal offenses, noting that the DHS agency lacked the resources to pursue all 11.3 million undocumented immigrants living in the country."}, {"8380": "Kelly’s interview is the latest affirmation that the Trump administration will not treat the undocumented population along the same priority system that the Obama administration did in the past. The Obama administration previously set guidance memos for ICE agents to detain and deport immigrants based on criteria such as whether they are parents of U.S. citizens, relatives of military personnel, or even whether they were brought to the country as children."}, {"6ace": "“This is a new era,” Attorney General Jeff Sessions said last week during a visit to the Arizona border to announce that the federal government would begin prosecuting people violating immigration laws. “This is the Trump era.”"}, {"a150": "Trump’s presidency has already put many undocumented immigrants on edge, with many making “Plan B’s” to sell their houses and leave the country. Many others have already signed documents authorizing their friends to take care of their kids in case they get deported. Others have stopped calling into domestic violence hotlines out of fear that they have to reveal their immigration status."}], "content": "DHS Secretary John Kelly: A single DUI could lead to deportation proceedings This wasn’t the case under the Obama administration. Homeland Security Secretary John Kelly. CREDIT: AP Photo/J. Scott Applewhite During an interview on Sunday’s Meet the Press with host Chuck Todd, Department of Homeland Security (DHS) Secretary John Kelly affirmed that the Trump administration will aggressively convict immigrants as criminals and deport people previously deemed as non-priorities under the Obama administration. Now, even a single conviction for driving under the influence could be considered a serious enough offense that triggers the deportation proceeding, Kelly said in response to Todd’s question to “define a criminal.” SEC. JOHN KELLY: It is fair to say that the definition of criminal has not changed, but where on the spectrum of criminality we operate has changed. CHUCK TODD: So can you give me an example of somebody that wasn’t deported before that you’re deporting now? SEC. JOHN KELLY: Well, someone, as an example, with multiple DUIs. Even a single DUI, depending on other aspects, would get you into the system. And remember, for the most — CHUCK TODD: And this wouldn’t have been the case under the – SEC. JOHN KELLY: Unlikely. CHUCK TODD: — previous administration. Kelly later confirmed in the interview that Immigration and Customs Enforcement (ICE)recently completed “a targeted operation” to go after visa overstays, or people who have stayed in the country past their visa expiration date. An increasing number of the undocumented population are visa overstays. “I mean it’s a big problem,” Kelly said. “There’s a lot of people out there that need to be taken into custody and deported, according to the law.” Since he took office, President Donald Trump has signed executive orders that harshly enforce immigration laws and expand the types of crimes punishable by deportation. In two memos issued in February, Kelly instructed the hiring of 5,000 more border agents and 10,000 more ICE officers tasked with carrying out his executive orders along the U.S. border and within the interior of the country to go after undocumented immigrants. Previously, the Obama administration prioritized the detention and deportation of undocumented immigrants convicted of serious criminal offenses, noting that the DHS agency lacked the resources to pursue all 11.3 million undocumented immigrants living in the country. Kelly’s interview is the latest affirmation that the Trump administration will not treat the undocumented population along the same priority system that the Obama administration did in the past. The Obama administration previously set guidance memos for ICE agents to detain and deport immigrants based on criteria such as whether they are parents of U.S. citizens, relatives of military personnel, or even whether they were brought to the country as children. “This is a new era,” Attorney General Jeff Sessions said last week during a visit to the Arizona border to announce that the federal government would begin prosecuting people violating immigration laws. “This is the Trump era.” Trump’s presidency has already put many undocumented immigrants on edge, with many making “Plan B’s” to sell their houses and leave the country. Many others have already signed documents authorizing their friends to take care of their kids in case they get deported. Others have stopped calling into domestic violence hotlines out of fear that they have to reveal their immigration status. ", "name": "431", "child": "431_1\t431_2\t431_3\t431_4\t431_5\t431_6", "timestamp": "Apr 16"}