{"parent": "", "title": "Fox News wants you to believe immigration detention centers are like paradise", "author": "Esther Yu Hsi Lee", "sentences": [{"e26d": "Fox News wants you to believe immigration detention centers are like paradise"}, {"c07a": "Brian Kilmeade might want to talk to an immigrant detainee about life inside detention."}, {"0dd5": "In this Wednesday, June 18, 2014 file photo, detainees sleep in a holding cell at a U.S. Customs and Border Protection processing facility in Brownsville, Texas. CREDIT: AP Photo/Eric Gay, Pool, File"}, {"f847": "Fox News’ popular morning show ​Fox & Friends wants its viewers to believe that immigrants live a very easy and carefree life in detention centers."}, {"0d81": "In a segment that aired Friday morning, Fox News host Brian Kilmeade claimed that immigrant detainees are provided clean sheets, given the chance to soak in the sun with seven hours of outdoor activity, and never have to learn English."}, {"9f57": "“The party is over for illegal criminals in jail,” Kilmeade said, remarking on the administration’s search for new jail contracts that would need to comply with fewer regulations to ensure immigrant safety. “Get this: They’re enjoying seven hours of outdoor activity. Who gets that anymore? Fresh sheets, and absolutely — I don’t get that. No need to learn English. I was born with that. But the Trump administration vowing a new plan to cut back on perks in their immigration crackdown, saying, expect a far less detailed set of regulations — maybe even dirty sheets — including no translation services, so learn English.”"}, {"17d8": "Ainsley Earhardt, another Fox News host, echoed Kilmeade’s remarks in a later segment."}, {"a277": "Kilmeade’s remarks follow the Trump administration’s decision to entice more local jails to give up detention space to house immigrants by erasing some of the provisions meant to keep immigrants safe. As a way to get local jails to comply with the federal immigration agency, Trump’s administration is “moving to curtail ​[protections for detainees] as a way to entice more sheriffs and local officials to make their correctional facilities available,” the New York Times reported Thursday."}, {"e327": "No such “perks” exist in detention centers. If they do, immigrant detainees would very much like to know which detention centers have these sorts of perks so that they can be transferred there. Immigration law violations are civil in nature, but detainees are held in less than civil conditions."}, {"9b0c": "Conditions have been so substandard at immigration detention facilities nationwide that there have been many iterations of hunger strikes to call for better food and medical care, including in Texas, Lousiana, and California."}, {"7252": "Just this week, as many as 750 immigrants have launched a hunger strike to protest the detention conditions at Northwest Detention Center in Tacoma, Washington, according to an advocacy group. Jonathan Rodriguez Guzman is one of the immigrants detained at the facility who has joined the hunger strike that is now in past the 72-hour mark — the point at which the U.S. Immigration and Customs Enforcement (ICE) guidelines say the agency has to officially recognize “hunger strikes” for what they are and can choose to put detainees in isolation or force feed them."}, {"8aae": "Rodriguez Guzman recently explained that he went on a strike because he wanted better food, medical care, and the ability to see an immigration judge who can determine whether he would be able to stay in the country. The young immigrant also complained that the prices at the canteen were “jacked up” with the price of coffee set at $5."}, {"bd1a": "“We shouldn’t be held indoors 23 hours,” Rodriguez Guzman said in an audio recording provided by the Northwest Detention Center (NWDC) Resistance, an immigrant advocacy group. “We should be able to get sun more than one hour.”"}, {"7f5c": "He also said he was forced to strip wax and double-coat the units at the detention facility. In return, he was given “soup and some chips.”"}, {"b8fb": "No immigration detention paradise exist for immigrant child detainees in family detention environments either. A detained six-year-old girl vomited blood for several days and was given emergency medical care only after she lost consciousness, according to a $10 million tort claim filed against the Department of Homeland Security in 2015. One woman who had broken bones in her hand was told to drink water as a remedy, according to a 2015 formal complaint filed against the Immigration and Customs Enforcement (ICE) agency."}, {"c508": "A bloody shirt worn by a child who was told to “drink lots of water” at an immigration detention facility in Pennsylvania. CREDIT: Carol Anne Donohue"}, {"3199": "Drinking more water was the treatment for many other detainees whenever someone was sick. At least 15 kid reportedly became sick and vomited or had diarrhea “with no effective treatment” at a family detention center in Pennsylvania, an immigration lawyer told ThinkProgress in 2015. One girl who bled over her shirt was also told to drink more water."}, {"47b6": "In 2014, the conservative news site Breitbart News published internal Customs and Border Protection (CBP) agency photos of federal processing centers that held an unprecedented number of Central American moms and kids who had fled violence. The photos — which ThinkProgress obtained permission at the time to reprint — showed moms and kids clutching few emergency metallic blankets, adults and children sleeping on cell-room floors, and communal bathrooms."}, {"6313": "CREDIT: Breitbart News"}, {"6c23": "CREDIT: Breitbart News"}, {"5ab8": "CREDIT: Breitbart News"}, {"b913": "CREDIT: Breitbart News"}, {"7b0a": "CREDIT: Breitbart News"}], "content": "Fox News wants you to believe immigration detention centers are like paradise Brian Kilmeade might want to talk to an immigrant detainee about life inside detention. In this Wednesday, June 18, 2014 file photo, detainees sleep in a holding cell at a U.S. Customs and Border Protection processing facility in Brownsville, Texas. CREDIT: AP Photo/Eric Gay, Pool, File Fox News’ popular morning show ​Fox & Friends wants its viewers to believe that immigrants live a very easy and carefree life in detention centers. In a segment that aired Friday morning, Fox News host Brian Kilmeade claimed that immigrant detainees are provided clean sheets, given the chance to soak in the sun with seven hours of outdoor activity, and never have to learn English. “The party is over for illegal criminals in jail,” Kilmeade said, remarking on the administration’s search for new jail contracts that would need to comply with fewer regulations to ensure immigrant safety. “Get this: They’re enjoying seven hours of outdoor activity. Who gets that anymore? Fresh sheets, and absolutely — I don’t get that. No need to learn English. I was born with that. But the Trump administration vowing a new plan to cut back on perks in their immigration crackdown, saying, expect a far less detailed set of regulations — maybe even dirty sheets — including no translation services, so learn English.” Ainsley Earhardt, another Fox News host, echoed Kilmeade’s remarks in a later segment. Kilmeade’s remarks follow the Trump administration’s decision to entice more local jails to give up detention space to house immigrants by erasing some of the provisions meant to keep immigrants safe. As a way to get local jails to comply with the federal immigration agency, Trump’s administration is “moving to curtail ​[protections for detainees] as a way to entice more sheriffs and local officials to make their correctional facilities available,” the New York Times reported Thursday. No such “perks” exist in detention centers. If they do, immigrant detainees would very much like to know which detention centers have these sorts of perks so that they can be transferred there. Immigration law violations are civil in nature, but detainees are held in less than civil conditions. Conditions have been so substandard at immigration detention facilities nationwide that there have been many iterations of hunger strikes to call for better food and medical care, including in Texas, Lousiana, and California. Just this week, as many as 750 immigrants have launched a hunger strike to protest the detention conditions at Northwest Detention Center in Tacoma, Washington, according to an advocacy group. Jonathan Rodriguez Guzman is one of the immigrants detained at the facility who has joined the hunger strike that is now in past the 72-hour mark — the point at which the U.S. Immigration and Customs Enforcement (ICE) guidelines say the agency has to officially recognize “hunger strikes” for what they are and can choose to put detainees in isolation or force feed them. Rodriguez Guzman recently explained that he went on a strike because he wanted better food, medical care, and the ability to see an immigration judge who can determine whether he would be able to stay in the country. The young immigrant also complained that the prices at the canteen were “jacked up” with the price of coffee set at $5. “We shouldn’t be held indoors 23 hours,” Rodriguez Guzman said in an audio recording provided by the Northwest Detention Center (NWDC) Resistance, an immigrant advocacy group. “We should be able to get sun more than one hour.” He also said he was forced to strip wax and double-coat the units at the detention facility. In return, he was given “soup and some chips.” No immigration detention paradise exist for immigrant child detainees in family detention environments either. A detained six-year-old girl vomited blood for several days and was given emergency medical care only after she lost consciousness, according to a $10 million tort claim filed against the Department of Homeland Security in 2015. One woman who had broken bones in her hand was told to drink water as a remedy, according to a 2015 formal complaint filed against the Immigration and Customs Enforcement (ICE) agency. A bloody shirt worn by a child who was told to “drink lots of water” at an immigration detention facility in Pennsylvania. CREDIT: Carol Anne Donohue Drinking more water was the treatment for many other detainees whenever someone was sick. At least 15 kid reportedly became sick and vomited or had diarrhea “with no effective treatment” at a family detention center in Pennsylvania, an immigration lawyer told ThinkProgress in 2015. One girl who bled over her shirt was also told to drink more water. In 2014, the conservative news site Breitbart News published internal Customs and Border Protection (CBP) agency photos of federal processing centers that held an unprecedented number of Central American moms and kids who had fled violence. The photos — which ThinkProgress obtained permission at the time to reprint — showed moms and kids clutching few emergency metallic blankets, adults and children sleeping on cell-room floors, and communal bathrooms. CREDIT: Breitbart News CREDIT: Breitbart News CREDIT: Breitbart News CREDIT: Breitbart News CREDIT: Breitbart News ", "name": "432", "child": "432_1\t432_2\t432_3\t432_4\t432_5\t432_6\t432_7\t432_8\t432_9\t432_10", "timestamp": "Apr 14"}