{"parent": "", "title": "Jeff Sessions’ prepared speech at the border referred to immigrants as ‘filth’", "author": "Carimah Townes", "sentences": [{"751e": "Jeff Sessions’ prepared speech at the border referred to immigrants as ‘filth’"}, {"24b0": "The word didn’t make it into his delivered remarks."}, {"751b": "CREDIT: AP Photo/Jeff Roberson"}, {"31f9": "During a speech at the U.S.-Mexico border on Tuesday, Attorney General Jeff Sessions reiterated his and President Donald Trump’s commitment to cracking down on undocumented immigrants. But one thing was missing from his speech as it was delivered: a phrase referring to criminals who cross the border as “filth,” which appeared in his prepared remarks."}, {"16bb": "In the text that was published on the Department of Justice website, Sessions told a grim tale of immigrant hordes crossing the border and wreaking havoc on U.S. citizens — a myth that has been debunked time and time again."}, {"262b": "“We mean criminal organizations that turn cities and suburbs into warzones, that rape and kill innocent citizens and who profit by smuggling poison and other human beings across our borders,” the speech says. “Depravity and violence are their calling cards, including brutal machete attacks and beheadings. It is here, on this sliver of land, where we first take our stand against this filth.”"}, {"76fd": "But according to Catherine Thompson of Talking Points Memo, Sessions dropped “against this filth” while delivering the speech to border agents in Nogales, Arizona."}, {"2262": "In the past, Sessions, like Trump, has enthusiastically expressed discontent with immigrants and vowed to deport thousands of undocumented immigrants who he’s repeatedly painted as hostile and violent."}, {"636d": "As an Alabama Senator, Sessions opposed immigration reform by arguing that immigration “takes jobs from Americans and can, in fact, create cultural problems.” He was one of the most vocal Trump supporters during the 2016 presidential campaign, and supported him after he described Mexicans as bad hombres, rapists, and criminals. And during his first speech as the U.S. Attorney General in February, Sessions said, “We need to end this lawlessness that threatens Americans’ safety and pulls down wages of ordinary Americans.”"}, {"1b96": "Based on the glaring omission on Tuesday, it appears as though Sessions thought the term “filth” would’ve been a step too far."}], "content": "Jeff Sessions’ prepared speech at the border referred to immigrants as ‘filth’ The word didn’t make it into his delivered remarks. CREDIT: AP Photo/Jeff Roberson During a speech at the U.S.-Mexico border on Tuesday, Attorney General Jeff Sessions reiterated his and President Donald Trump’s commitment to cracking down on undocumented immigrants. But one thing was missing from his speech as it was delivered: a phrase referring to criminals who cross the border as “filth,” which appeared in his prepared remarks. In the text that was published on the Department of Justice website, Sessions told a grim tale of immigrant hordes crossing the border and wreaking havoc on U.S. citizens — a myth that has been debunked time and time again. “We mean criminal organizations that turn cities and suburbs into warzones, that rape and kill innocent citizens and who profit by smuggling poison and other human beings across our borders,” the speech says. “Depravity and violence are their calling cards, including brutal machete attacks and beheadings. It is here, on this sliver of land, where we first take our stand against this filth.” But according to Catherine Thompson of Talking Points Memo, Sessions dropped “against this filth” while delivering the speech to border agents in Nogales, Arizona. In the past, Sessions, like Trump, has enthusiastically expressed discontent with immigrants and vowed to deport thousands of undocumented immigrants who he’s repeatedly painted as hostile and violent. As an Alabama Senator, Sessions opposed immigration reform by arguing that immigration “takes jobs from Americans and can, in fact, create cultural problems.” He was one of the most vocal Trump supporters during the 2016 presidential campaign, and supported him after he described Mexicans as bad hombres, rapists, and criminals. And during his first speech as the U.S. Attorney General in February, Sessions said, “We need to end this lawlessness that threatens Americans’ safety and pulls down wages of ordinary Americans.” Based on the glaring omission on Tuesday, it appears as though Sessions thought the term “filth” would’ve been a step too far. ", "name": "436", "child": "436_1\t436_2\t436_3\t436_4\t436_5\t436_6\t436_7\t436_8\t436_9\t436_10\t436_11\t436_12\t436_13", "timestamp": "Apr 11"}