{"parent": "", "title": "The big civil rights protest in Dallas that you missed over the weekend", "author": "Esther Yu Hsi Lee", "sentences": [{"2ade": "The big civil rights protest in Dallas that you missed over the weekend"}, {"7a00": "“You know, there’s times when you have to march to get your point across.”"}, {"146b": "Julio Arellano, right, stands with his children from left, Brisa Arellano, Julio C. Arellano and Israel Arellano and during a protest rally in downtown Dallas, Sunday, April 9, 2017. CREDIT: AP Photo/LM Otero"}, {"6606": "After President Donald Trump signed an executive order broadening the type of crimes punishable by deportations, scores of immigrants across the country have been arrested, detained, and potentially deported. In response to the crackdown, many immigrant, refugee, and Latino communities have gone into hiding, refusing to attend school or report serious crimes."}, {"a8ac": "On Sunday, thousands of people dressed in red, white, and blue turned out to show their support for immigrants and refugees as part of the “Dallas Mega March.” Organizers sought to keep the rally apolitical, focusing on a message of unity, empowerment, and the valuable contributions made by immigrants as they marched to the Dallas City Hall."}, {"8c72": "“You know, there’s times when you have to march to get your point across,” Roger Rocha Jr., president of the League of United Latin American Citizens, told ABC affiliate WFAA. “This is one of those times.”"}, {"9cb1": "Although organizers asked people to refrain from overtly referencing the president, Trump was exactly why many people attended the rally."}, {"3d39": "Those attendees said that they wanted to highlight the vulnerable communities affected by Trump’s federal policies. Since taking office, Trump has attempted to enact a Muslim ban that bars entry from travelers from certain countries, a months-long ban on refugee resettlement, and the construction of a border wall meant to keep out unauthorized migrants."}, {"50e4": "“I don’t believe in borders of any kind. Not physical borders, not any type of borders,” a 28-year-old woman from Mexico, who was brought to the country as a child by her parents and has since enrolled in the Deferred Action for Childhood Arrivals (DACA) program, told WFAA."}, {"ab53": "And there is some evidence that federal immigration officers have been emboldened by the Trump administration to crack down. Since the immigration raids earlier this year, many children have been afraid to go to school, fearing that their immigrant parents could be deported while they were gone."}, {"8c5c": "“Every child deserves a right to go to school without fear of losing a parent,” Esseiny Alanis, a Dallas-area teacher and Mexican immigrant who attended the rally with her students, told the Dallas Morning News. “My children are the future of the world.”"}, {"8965": "Religious groups, politicians, and civil rights leaders also attended the rally, calling for the recognition of immigrants as “Americans.”"}, {"335a": "Martin Luther King, III, the son of late civil rights icon Martin Luther King Jr., spoke to the crowd outside the Dallas City Hall."}, {"10c6": "“No matter what some politicians do to try to stop and turn the clock back, we’re not going back,” King III said. “We’re moving forward. We want America to be great for all Americans. Not any one group of people.”"}, {"c49e": "There were some Trump supporters who attended the rally, too."}, {"2d54": "“We support Donald Trump about taking all the criminals out of the country, all those that are doing bad. Yes, we support that,” Luis Aranda, a U.S. citizen, told a Fox News affiliate. “But don’t take those families that are working hard, paying their taxes and everything.”"}, {"0279": "Dallas police said about 3,200 people attended the rally. Organizers estimated that the turnout was actually closer to 20,000, in part because “many more than that could be seen for blocks,” WFAA reported. The last time organizers held a march this large was during Mega March 2006, when an estimated 500,000 people crowded the city blocks in support of immigration reform. The Dallas Police Department reported that there were no incidents or arrests at Sunday’s rally."}, {"a69d": "“We are Americans. Nobody can divide us,” Farhat Chisty, a marcher who wore a headscarf, told WFAA."}], "content": "The big civil rights protest in Dallas that you missed over the weekend “You know, there’s times when you have to march to get your point across.” Julio Arellano, right, stands with his children from left, Brisa Arellano, Julio C. Arellano and Israel Arellano and during a protest rally in downtown Dallas, Sunday, April 9, 2017. CREDIT: AP Photo/LM Otero After President Donald Trump signed an executive order broadening the type of crimes punishable by deportations, scores of immigrants across the country have been arrested, detained, and potentially deported. In response to the crackdown, many immigrant, refugee, and Latino communities have gone into hiding, refusing to attend school or report serious crimes. On Sunday, thousands of people dressed in red, white, and blue turned out to show their support for immigrants and refugees as part of the “Dallas Mega March.” Organizers sought to keep the rally apolitical, focusing on a message of unity, empowerment, and the valuable contributions made by immigrants as they marched to the Dallas City Hall. “You know, there’s times when you have to march to get your point across,” Roger Rocha Jr., president of the League of United Latin American Citizens, told ABC affiliate WFAA. “This is one of those times.” Although organizers asked people to refrain from overtly referencing the president, Trump was exactly why many people attended the rally. Those attendees said that they wanted to highlight the vulnerable communities affected by Trump’s federal policies. Since taking office, Trump has attempted to enact a Muslim ban that bars entry from travelers from certain countries, a months-long ban on refugee resettlement, and the construction of a border wall meant to keep out unauthorized migrants. “I don’t believe in borders of any kind. Not physical borders, not any type of borders,” a 28-year-old woman from Mexico, who was brought to the country as a child by her parents and has since enrolled in the Deferred Action for Childhood Arrivals (DACA) program, told WFAA. And there is some evidence that federal immigration officers have been emboldened by the Trump administration to crack down. Since the immigration raids earlier this year, many children have been afraid to go to school, fearing that their immigrant parents could be deported while they were gone. “Every child deserves a right to go to school without fear of losing a parent,” Esseiny Alanis, a Dallas-area teacher and Mexican immigrant who attended the rally with her students, told the Dallas Morning News. “My children are the future of the world.” Religious groups, politicians, and civil rights leaders also attended the rally, calling for the recognition of immigrants as “Americans.” Martin Luther King, III, the son of late civil rights icon Martin Luther King Jr., spoke to the crowd outside the Dallas City Hall. “No matter what some politicians do to try to stop and turn the clock back, we’re not going back,” King III said. “We’re moving forward. We want America to be great for all Americans. Not any one group of people.” There were some Trump supporters who attended the rally, too. “We support Donald Trump about taking all the criminals out of the country, all those that are doing bad. Yes, we support that,” Luis Aranda, a U.S. citizen, told a Fox News affiliate. “But don’t take those families that are working hard, paying their taxes and everything.” Dallas police said about 3,200 people attended the rally. Organizers estimated that the turnout was actually closer to 20,000, in part because “many more than that could be seen for blocks,” WFAA reported. The last time organizers held a march this large was during Mega March 2006, when an estimated 500,000 people crowded the city blocks in support of immigration reform. The Dallas Police Department reported that there were no incidents or arrests at Sunday’s rally. “We are Americans. Nobody can divide us,” Farhat Chisty, a marcher who wore a headscarf, told WFAA. ", "name": "437", "child": "437_1\t437_2\t437_3\t437_4\t437_5\t437_6\t437_7\t437_8", "timestamp": "Apr 10"}