{"parent": "", "title": "Majority of Americans oppose funding Trump’s border wall", "author": "Esther Yu Hsi Lee", "sentences": [{"3405": "Majority of Americans oppose funding Trump’s border wall"}, {"8921": "The wall likely won’t stretch ‘sea to shining sea.’"}, {"664b": "In this Sunday, Nov. 13, 2016, photo, a U.S. Customs and Border Patrol agent passes birdwatchers Rayborn and Nancy Hill along a section of border wall in Hidalgo, Texas. CREDIT: AP Photo/Eric Gay"}, {"bc6a": "The construction of a wall along the southern U.S. border is President Donald Trump’s most visible campaign promise. But as the astounding $1 billion-per-every-62 miles price tag of Trump’s vision buts up against the reality that the Mexican government will not defray construction costs, it’s increasingly becoming evident that Americans do not want it."}, {"902c": "A majority of Americans oppose funding Trump’s wall, according to a poll conducted by the Associated Press-NORC Center for Public Affairs Research released Thursday. The poll — which drew from a sample of 1,100 adults representative of the U.S. population between March 23 and 27— found that 58 percent oppose new spending on the wall, with nearly half saying that they “strongly oppose funding for the project.” The results were largely partisan, with 86 percent of self-identified Democrats and 57 percent of independents against new spending for the border wall. “Republicans break about 2–1 in favor of the wall, but that’s more narrow support than on other priorities,” the Associated Press reported."}, {"1cfc": "The poll result comes at a time when Trump has requested $1.4 billion to fund the construction of a border wall, part of a $30 billion package for defense spending. Some congressional lawmakers expect the final cost estimate for the wall could be more than $20 billion."}, {"c3ca": "But it will be difficult to make Trump’s vision of a wall stretching across the entirety of the southern border a reality, as Department of Homeland Security (DHS) Secretary John Kelly recently acknowledged."}, {"e6cc": "“It’s unlikely that we will build a wall or physical barrier from sea to shining sea,” Kelly said before the Senate Homeland Security Committee on Wednesday. “But… I’m committed to putting it where the men and women say we should put it.”"}, {"5c3b": "Trump has repeatedly threatened to force Mexico to reimburse the U.S. for construction costs — an idea that the Mexican government calls a non-starter — but it’s likely that U.S. taxpayers will end up footing the bill."}, {"1920": "The real losers from Trump’s border wall: ranchers, homeowners, and taxpayersThe Trump administration is already moving to take Americans’ private property to build the wall Mexico isn’t paying…thinkprogress.org"}, {"370e": "Trump’s wall won’t stretch across the entirety of the southern border. As Bloomberg reported, barriers can’t be built through the Rio Grande — which demarcates the border in some parts of Texas — because “the banks of the river are a flood plain governed by international treaty.” Some gaps in the wall exist because thousands of landowners own land that “run to the river’s edge.” But that hasn’t exactly stopped the U.S. government from wresting land from ranchers and homeowners."}, {"f047": "The border wall has been unpopular among Americans, particularly with those living in border states. A Pew Research Center American Trends poll taken between November 29 and December 12, 2016 found that 59 percent of Americans didn’t think that the construction of a border wall was important. A Quinnipiac University poll taken between November 17 and November 20, 2016 similarly found 55 percent of Americans opposed to building a wall. A 2015 Monmouth University poll, which came out before cost estimates were revealed, found partisan differences in support, with 73 percent of Republicans approving of wall construction, while only 31 percent of Democrats supported it."}], "content": "Majority of Americans oppose funding Trump’s border wall The wall likely won’t stretch ‘sea to shining sea.’ In this Sunday, Nov. 13, 2016, photo, a U.S. Customs and Border Patrol agent passes birdwatchers Rayborn and Nancy Hill along a section of border wall in Hidalgo, Texas. CREDIT: AP Photo/Eric Gay The construction of a wall along the southern U.S. border is President Donald Trump’s most visible campaign promise. But as the astounding $1 billion-per-every-62 miles price tag of Trump’s vision buts up against the reality that the Mexican government will not defray construction costs, it’s increasingly becoming evident that Americans do not want it. A majority of Americans oppose funding Trump’s wall, according to a poll conducted by the Associated Press-NORC Center for Public Affairs Research released Thursday. The poll — which drew from a sample of 1,100 adults representative of the U.S. population between March 23 and 27— found that 58 percent oppose new spending on the wall, with nearly half saying that they “strongly oppose funding for the project.” The results were largely partisan, with 86 percent of self-identified Democrats and 57 percent of independents against new spending for the border wall. “Republicans break about 2–1 in favor of the wall, but that’s more narrow support than on other priorities,” the Associated Press reported. The poll result comes at a time when Trump has requested $1.4 billion to fund the construction of a border wall, part of a $30 billion package for defense spending. Some congressional lawmakers expect the final cost estimate for the wall could be more than $20 billion. But it will be difficult to make Trump’s vision of a wall stretching across the entirety of the southern border a reality, as Department of Homeland Security (DHS) Secretary John Kelly recently acknowledged. “It’s unlikely that we will build a wall or physical barrier from sea to shining sea,” Kelly said before the Senate Homeland Security Committee on Wednesday. “But… I’m committed to putting it where the men and women say we should put it.” Trump has repeatedly threatened to force Mexico to reimburse the U.S. for construction costs — an idea that the Mexican government calls a non-starter — but it’s likely that U.S. taxpayers will end up footing the bill. The real losers from Trump’s border wall: ranchers, homeowners, and taxpayersThe Trump administration is already moving to take Americans’ private property to build the wall Mexico isn’t paying…thinkprogress.org Trump’s wall won’t stretch across the entirety of the southern border. As Bloomberg reported, barriers can’t be built through the Rio Grande — which demarcates the border in some parts of Texas — because “the banks of the river are a flood plain governed by international treaty.” Some gaps in the wall exist because thousands of landowners own land that “run to the river’s edge.” But that hasn’t exactly stopped the U.S. government from wresting land from ranchers and homeowners. The border wall has been unpopular among Americans, particularly with those living in border states. A Pew Research Center American Trends poll taken between November 29 and December 12, 2016 found that 59 percent of Americans didn’t think that the construction of a border wall was important. A Quinnipiac University poll taken between November 17 and November 20, 2016 similarly found 55 percent of Americans opposed to building a wall. A 2015 Monmouth University poll, which came out before cost estimates were revealed, found partisan differences in support, with 73 percent of Republicans approving of wall construction, while only 31 percent of Democrats supported it. ", "name": "438", "child": "438_1\t438_2\t438_3", "timestamp": "Apr 6"}