{"parent": "", "title": "Michele Bachmann: Liberals are letting the Antichrist come to power", "author": "Jack Jenkins", "sentences": [{"2716": "Michele Bachmann: Liberals are letting the Antichrist come to power"}, {"d4a0": "Apocalypse wow."}, {"69ec": "CREDIT: AP/Manuel Balce Ceneta"}, {"1b1b": "Michele Bachmann believes liberal opponents of Donald Trump could bring about the end of the world — by hastening the coming of the Antichrist."}, {"cd88": "According to Right Wing Watch and the Friendly Atheist, the Republican and former Minnesota congresswoman made the apocalyptic prediction last week during an appearance on a Last Days radio program. The show’s host, Jan Markell, asked Bachmann about “globalists,” a group she says includes American liberals who want a “one world system” and “no borders.” Markell said the group “lost big time” after the election of Donald Trump, sparking Bachman to compare them to the builders of the biblical Tower of Babel."}, {"6412": "“Scripture tells us that in the End Times, that is what [the] Antichrist will be — he will be a part of a one-world system.”"}, {"3541": "“There has always been two competing ideologies: one that wants to follow the truth of the Lord God, and those who want to rebel against the creator God,” Bachmann said, explaining that those who rebel want a “manmade, one-world system.”"}, {"4adf": "Bachmann then announced that modern-day supporters of a what she called a “borderless world” —she name-checked “G-28…Davos-types…[and] billionaires” — are setting the stage for the end of the world."}, {"718c": "“Scripture tells us that in the End Times, that is what [the] Antichrist will be — he will be a part of a one-world system,” she said. “There are people who reject Judeo-Christian truth and instead want to insert and usurp control of all of our lives with a global, economic and political government.”"}, {"c733": "Bachmann, an evangelical Christian, is well known for spouting right-wing theological positions, some of which are common among conservative people of faith (e.g., that homosexuality is “part of Satan”) and others that are decidedly fringe (e.g., that September 11 terrorist attacks were the result of God punishing America). She is also a longtime supporter of Trump: Bachmann served on Trump’s Evangelical Executive Advisory Board during the 2016 campaign, and spoke as a surrogate at his rallies."}, {"4f22": "But while it’s unclear what Bachmann and Markell mean by a “borderless world,” their theological views appear to be out-of-step with the pro-immigrant slant of most religious Americans. Majorities of every major faith group in the country support some form of comprehensive immigration reform according to PRRI, with most backing a pathway to citizenship for undocumented immigrants."}, {"af52": "Meanwhile, faith groups have also been staunch opponents of Trump’s anti-immigrant rhetoric, and a record number of worship communities have pledged to offer sanctuary to undocumented immigrants at risk of deportation by his administration. Religious groups have also overwhelmingly opposed both iterations of Trump’s now-stalled Muslim ban, which prohibits refugees and immigration from six (previously seven) Muslim-majority countries."}], "content": "Michele Bachmann: Liberals are letting the Antichrist come to power Apocalypse wow. CREDIT: AP/Manuel Balce Ceneta Michele Bachmann believes liberal opponents of Donald Trump could bring about the end of the world — by hastening the coming of the Antichrist. According to Right Wing Watch and the Friendly Atheist, the Republican and former Minnesota congresswoman made the apocalyptic prediction last week during an appearance on a Last Days radio program. The show’s host, Jan Markell, asked Bachmann about “globalists,” a group she says includes American liberals who want a “one world system” and “no borders.” Markell said the group “lost big time” after the election of Donald Trump, sparking Bachman to compare them to the builders of the biblical Tower of Babel. “Scripture tells us that in the End Times, that is what [the] Antichrist will be — he will be a part of a one-world system.” “There has always been two competing ideologies: one that wants to follow the truth of the Lord God, and those who want to rebel against the creator God,” Bachmann said, explaining that those who rebel want a “manmade, one-world system.” Bachmann then announced that modern-day supporters of a what she called a “borderless world” —she name-checked “G-28…Davos-types…[and] billionaires” — are setting the stage for the end of the world. “Scripture tells us that in the End Times, that is what [the] Antichrist will be — he will be a part of a one-world system,” she said. “There are people who reject Judeo-Christian truth and instead want to insert and usurp control of all of our lives with a global, economic and political government.” Bachmann, an evangelical Christian, is well known for spouting right-wing theological positions, some of which are common among conservative people of faith (e.g., that homosexuality is “part of Satan”) and others that are decidedly fringe (e.g., that September 11 terrorist attacks were the result of God punishing America). She is also a longtime supporter of Trump: Bachmann served on Trump’s Evangelical Executive Advisory Board during the 2016 campaign, and spoke as a surrogate at his rallies. But while it’s unclear what Bachmann and Markell mean by a “borderless world,” their theological views appear to be out-of-step with the pro-immigrant slant of most religious Americans. Majorities of every major faith group in the country support some form of comprehensive immigration reform according to PRRI, with most backing a pathway to citizenship for undocumented immigrants. Meanwhile, faith groups have also been staunch opponents of Trump’s anti-immigrant rhetoric, and a record number of worship communities have pledged to offer sanctuary to undocumented immigrants at risk of deportation by his administration. Religious groups have also overwhelmingly opposed both iterations of Trump’s now-stalled Muslim ban, which prohibits refugees and immigration from six (previously seven) Muslim-majority countries. ", "name": "439", "child": "439_1\t439_2\t439_3\t439_4\t439_5\t439_6\t439_7\t439_8\t439_9\t439_10\t439_11\t439_12\t439_13\t439_14\t439_15\t439_16\t439_17\t439_18\t439_19\t439_20\t439_21\t439_22\t439_23\t439_24\t439_25", "timestamp": "Apr 6"}