{"parent": "", "title": "GOP congressman worries about terrorists using bales of marijuana to smuggle nukes into the U.S.", "author": "Esther Yu Hsi Lee", "sentences": [{"ced1": "GOP congressman worries about terrorists using bales of marijuana to smuggle nukes into the U.S."}, {"854d": "Rep. Trent Frank’s claim is dubious."}, {"b122": "Rep. Trent Franks (R-AZ). CREDIT: AP Photo/Pablo Martinez Monsivais"}, {"7ffc": "While defending the need to build a costly wall along the southern U.S. border, Rep. Trent Franks (R-AZ) claimed on Wednesday that nuclear bombs could be hidden inside bales of marijuana smuggled into the United States through Mexico."}, {"9c69": "“I can suggest to you that there are national security implications here for a porous border,” Franks told CNN host Brianna Keilar on Wednesday. “We sometimes used to make the point that if someone wanted to smuggle in a dangerous weapon, even a nuclear weapon, into America, how would they do it? And the suggestion was made, well, we’ll simple hide it in a bale of marijuana.”"}, {"e0e9": "“And so, the implications of a porous border have national security dimensions that are very significant and that bear a lot of consideration when we talk about costs,” he added."}, {"75b0": "Franks made a similar statement in 2012, Talking Points Memo reported, when he took to the House floor to suggest that Middle Eastern terrorists could hide nuclear warheads in bales of marijuana. At least one other Democratic congressional member, Rep. Brad Sherman (D-CA), said in 2007 that a nuclear bomb could be smuggled with marijuana, according to the Washington Post."}, {"39ae": "Franks has made salacious claims about the porosity of the southern U.S. border before. In 2014, he said that the militant group ISIS had operations running in Ciudad Juarez, a claim that a senior U.S. law enforcement official said had no basis in reality."}, {"468e": "In fact, there is no reason to believe that nuclear weapons can be smuggled into the United States. As Rep. Sherman suggested in 2007, nuclear bombs are the “size of a person,” so it would hardly seem possible to smuggle such large objects."}, {"2f85": "Customs and Border Protection (CBP) agents are incredibly adept at smoking out marijuana smugglers as it is. In the past, agents have found contraband drugs like marijuana and cocaine camouflaged in other objects like limes, carrots, and cucumbers or hidden within the car floors. Border agents have also interdicted cars carrying people — who as you will remember are the size of nuclear bombs — hiding in trunks, sometimes in part because the agent’s dog alerted them to the scent. To hide a nuclear bomb within marijuana within another object would likely require a giant Babushka doll — though CBP agents have seized dolls and toys in the past."}, {"8473": "As to the claim that the border is not secure, the U.S. government under the Obama administration ramped up the number of Border Protection agents from 10,000 in 2004 to more than 21,000 in 2011 and requested $41.2 billion for federal funding for the Department of Homeland Security agency last year."}], "content": "GOP congressman worries about terrorists using bales of marijuana to smuggle nukes into the U.S. Rep. Trent Frank’s claim is dubious. Rep. Trent Franks (R-AZ). CREDIT: AP Photo/Pablo Martinez Monsivais While defending the need to build a costly wall along the southern U.S. border, Rep. Trent Franks (R-AZ) claimed on Wednesday that nuclear bombs could be hidden inside bales of marijuana smuggled into the United States through Mexico. “I can suggest to you that there are national security implications here for a porous border,” Franks told CNN host Brianna Keilar on Wednesday. “We sometimes used to make the point that if someone wanted to smuggle in a dangerous weapon, even a nuclear weapon, into America, how would they do it? And the suggestion was made, well, we’ll simple hide it in a bale of marijuana.” “And so, the implications of a porous border have national security dimensions that are very significant and that bear a lot of consideration when we talk about costs,” he added. Franks made a similar statement in 2012, Talking Points Memo reported, when he took to the House floor to suggest that Middle Eastern terrorists could hide nuclear warheads in bales of marijuana. At least one other Democratic congressional member, Rep. Brad Sherman (D-CA), said in 2007 that a nuclear bomb could be smuggled with marijuana, according to the Washington Post. Franks has made salacious claims about the porosity of the southern U.S. border before. In 2014, he said that the militant group ISIS had operations running in Ciudad Juarez, a claim that a senior U.S. law enforcement official said had no basis in reality. In fact, there is no reason to believe that nuclear weapons can be smuggled into the United States. As Rep. Sherman suggested in 2007, nuclear bombs are the “size of a person,” so it would hardly seem possible to smuggle such large objects. Customs and Border Protection (CBP) agents are incredibly adept at smoking out marijuana smugglers as it is. In the past, agents have found contraband drugs like marijuana and cocaine camouflaged in other objects like limes, carrots, and cucumbers or hidden within the car floors. Border agents have also interdicted cars carrying people — who as you will remember are the size of nuclear bombs — hiding in trunks, sometimes in part because the agent’s dog alerted them to the scent. To hide a nuclear bomb within marijuana within another object would likely require a giant Babushka doll — though CBP agents have seized dolls and toys in the past. As to the claim that the border is not secure, the U.S. government under the Obama administration ramped up the number of Border Protection agents from 10,000 in 2004 to more than 21,000 in 2011 and requested $41.2 billion for federal funding for the Department of Homeland Security agency last year. ", "name": "446", "child": "446_1\t446_2\t446_3\t446_4\t446_5\t446_6\t446_7\t446_8\t446_9\t446_10\t446_11\t446_12\t446_13\t446_14\t446_15\t446_16\t446_17\t446_18\t446_19\t446_20\t446_21\t446_22\t446_23\t446_24\t446_25", "timestamp": "Feb 22"}