{"parent": "", "title": "The Immigration Ban is a Headfake, and We’re Falling For It", "author": "Jake Fuentes", "sentences": [{"68c0": "The Immigration Ban is a Headfake, and We’re Falling For It"}, {"49e9": "When I read about the incredibly active first week of the Trump administration, I struggle with two competing narratives about what’s really going on. The first story is simple: the administration is just doing what it said it would do, literally keeping its campaign promises. Lots of people won’t agree, but it’s playing to its base. They’re also not really good at this whole government thing yet, so implementation is shaky. The second is more sinister: the administration is deliberately testing the limits of governmental checks and balances to set up a self-serving, dangerous consolidation of power."}, {"ba5e": "A legitimate argument can be made for the former: a relatively extreme and inexperienced administration was just put in place, and they haven’t yet figured out the nuances of government. But a few of the events in the past 72 hours —the intentional inclusion of green card holders in the immigration order, the DHS defiance of a federal judge, and the timing of Trump’s shakeup of the National Security Council — have pointed to a larger story. Even worse, if that larger story is true, if the source of this week’s actions is a play to consolidate power, it’s going really well so far. And that’s because mostly everyone — including those in protests shutting down airports over the weekend— are playing right into the administration’s hand."}, {"0abe": "I obviously can’t pretend to know the intentions of the new President, but let’s pretend the power consolidation move is what’s actually happening. In fact, let’s pretend we’re the Trump administration (not necessarily Trump himself, more likely his inner circle) for a second. Here’s our playbook:"}, {"1ac3": "We’ve just tested the country’s willingness to capitulate to a fascist regime."}, {"dcf7": "Assuming this narrative is true (again, I have no idea what the administration intends), the “resistance” is playing right into Trump’s playbook. The most vocal politicians could be seen at rallies, close to the headlines. The protests themselves did exactly what they were intended to: dominate the news cycle and channel opposition anger towards a relatively insignificant piece of the puzzle. I’m not saying that green card holders should be stuck in airports — far from it. I’m saying there might be a much larger picture here, and the immigration ban is a distraction."}, {"c012": "So for those that believe that the power consolidation narrative is true and want to oppose it, how does that happen?"}, {"5c70": "First, stop believing that protests alone do much good. Protests galvanize groups and display strong opposition, but they’re not sufficient. Not only are they relatively ineffective at changing policy, they’re also falsely cathartic to those protesting. Protestors get all kinds of feel-good that they’re among fellow believers and standing up for what’s right, and they go home feeling like they’ve done their part. Even if protestors gain mild, symbolic concessions, the fact that their anger has an outlet is useful to the other side. Do protest, but be very wary of going home feeling like you’ve done your job. You haven’t."}, {"f2e5": "Second, pay journalists to watch for the head fake. That’s their job. Become a paying subscriber to news outlets, then actively ask them to more deeply cover moves like the NSC shakeup. We can no longer breathlessly focus media attention on easy stories like the immigration ban. The real story is much more nuanced and boring — until it’s not."}, {"1dc2": "Third, popular attention must focus less on whether we agree with what the government is doing, and more on whether the system of checks and balances we have in place is working. It is a much bigger deal that the DHS felt they could ignore a federal court than that Trump signed an EO blocking green card holders in the first place. It is a much bigger deal that Trump removed a permanent military presence from the NSC than that he issued a temporary stay on immigration. The immigration ban may be more viscerally upsetting, but the other moves are potentially far more dangerous."}, {"fa06": "Once again, I’m desperately hoping that none of this narrative is actually true, and that we merely have a well-intentioned administration with some execution problems. I’m also hoping and praying that the structure of our democracy is resilient even to the most sophisticated attacks. I’m hoping that the better angels of our nature will prevail. But with each passing day, the evidence tilts more in the other direction."}], "content": "The Immigration Ban is a Headfake, and We’re Falling For It When I read about the incredibly active first week of the Trump administration, I struggle with two competing narratives about what’s really going on. The first story is simple: the administration is just doing what it said it would do, literally keeping its campaign promises. Lots of people won’t agree, but it’s playing to its base. They’re also not really good at this whole government thing yet, so implementation is shaky. The second is more sinister: the administration is deliberately testing the limits of governmental checks and balances to set up a self-serving, dangerous consolidation of power. A legitimate argument can be made for the former: a relatively extreme and inexperienced administration was just put in place, and they haven’t yet figured out the nuances of government. But a few of the events in the past 72 hours —the intentional inclusion of green card holders in the immigration order, the DHS defiance of a federal judge, and the timing of Trump’s shakeup of the National Security Council — have pointed to a larger story. Even worse, if that larger story is true, if the source of this week’s actions is a play to consolidate power, it’s going really well so far. And that’s because mostly everyone — including those in protests shutting down airports over the weekend— are playing right into the administration’s hand. I obviously can’t pretend to know the intentions of the new President, but let’s pretend the power consolidation move is what’s actually happening. In fact, let’s pretend we’re the Trump administration (not necessarily Trump himself, more likely his inner circle) for a second. Here’s our playbook: We’ve just tested the country’s willingness to capitulate to a fascist regime. Assuming this narrative is true (again, I have no idea what the administration intends), the “resistance” is playing right into Trump’s playbook. The most vocal politicians could be seen at rallies, close to the headlines. The protests themselves did exactly what they were intended to: dominate the news cycle and channel opposition anger towards a relatively insignificant piece of the puzzle. I’m not saying that green card holders should be stuck in airports — far from it. I’m saying there might be a much larger picture here, and the immigration ban is a distraction. So for those that believe that the power consolidation narrative is true and want to oppose it, how does that happen? First, stop believing that protests alone do much good. Protests galvanize groups and display strong opposition, but they’re not sufficient. Not only are they relatively ineffective at changing policy, they’re also falsely cathartic to those protesting. Protestors get all kinds of feel-good that they’re among fellow believers and standing up for what’s right, and they go home feeling like they’ve done their part. Even if protestors gain mild, symbolic concessions, the fact that their anger has an outlet is useful to the other side. Do protest, but be very wary of going home feeling like you’ve done your job. You haven’t. Second, pay journalists to watch for the head fake. That’s their job. Become a paying subscriber to news outlets, then actively ask them to more deeply cover moves like the NSC shakeup. We can no longer breathlessly focus media attention on easy stories like the immigration ban. The real story is much more nuanced and boring — until it’s not. Third, popular attention must focus less on whether we agree with what the government is doing, and more on whether the system of checks and balances we have in place is working. It is a much bigger deal that the DHS felt they could ignore a federal court than that Trump signed an EO blocking green card holders in the first place. It is a much bigger deal that Trump removed a permanent military presence from the NSC than that he issued a temporary stay on immigration. The immigration ban may be more viscerally upsetting, but the other moves are potentially far more dangerous. Once again, I’m desperately hoping that none of this narrative is actually true, and that we merely have a well-intentioned administration with some execution problems. I’m also hoping and praying that the structure of our democracy is resilient even to the most sophisticated attacks. I’m hoping that the better angels of our nature will prevail. But with each passing day, the evidence tilts more in the other direction. ", "name": "448", "child": "448_1\t448_2\t448_3\t448_4\t448_5\t448_6\t448_7\t448_8\t448_9\t448_10\t448_11\t448_12\t448_13\t448_14\t448_15\t448_16\t448_17\t448_18\t448_19\t448_20\t448_21\t448_22\t448_23\t448_24\t448_25448_1\t448_2\t448_3\t448_4\t448_5\t448_6\t448_7\t448_8\t448_9\t448_10\t448_11\t448_12\t448_13\t448_14\t448_15\t448_16\t448_17\t448_18\t448_19\t448_20\t448_21\t448_22\t448_23\t448_24\t448_25", "timestamp": "Jan 30"}