{"parent": "", "title": "Gair — The Menace of ‘The Other’", "author": "Runjhun Noopur", "sentences": [{"b1c7": "Gair — The Menace of ‘The Other’"}, {"543a": "A Sufi Celebration of Life, Inspired By Urdu"}, {"d912": "Kaha Aane Deeje Na Gair Ko, Hum Bulayenge Shauk Se"}, {"9b32": "Tumhe Rashq Ho Toh Na Aao Tum, Yahi Kah Ke Mujhe Utha Diya"}, {"065b": "— Bahadurshah ‘Zafar’"}, {"fddd": "I said don’t let the other come in; they said we will invite them in with pleasure"}, {"73e0": "If it makes you jealous, you are most welcome to leave; they said and dismissed me"}, {"03c9": "For once this blog is focused on a word that I wish could be eliminated, not just from our lexicons but from our very thought processes, our ideologies, our belief systems, our societies."}, {"0c14": "Gair."}, {"9fb6": "Literally translated it means ‘stranger’ or ‘the other’."}, {"4fc0": "Over the years, especially in the more recent times, the very idea of Gair has acquired horrendous and distasteful and terrible implications. Gair, for us, is someone who is unlike us, who we probably don’t understand, who we are suspicious of, who is not one of ‘our own’."}, {"22cd": "As is the case with most ideas, it is not the idea of Gair in abstraction that is demonic, or even problematic. As a matter of fact, at its bare basic core, the idea of Gair is a product of an essential evolutionary survival instinct. Back in the stone ages, perhaps, we needed to know the Gair from our own, or risk falling prey to predators, of either human or animal kind."}, {"8072": "Gair was relevant, maybe even essential in the Stone Ages. Last I checked this was not the Stone Age. Although, given our collective obsession with the idea of ‘Gair’, you may be forgiven if you have started believing otherwise."}, {"bc85": "It doesn’t make sense. We are, arguably, living in the most progressive era of human civilization. Walking on the moon is already so 60s, we are planning to colonize the space and dream of fornicating with the aliens (sorry E.T!). A.I is an undeniable part of our new reality, and sentient robots are ready to walk out of Issac Asimov stories, straight into our bedrooms."}, {"28fd": "Science, technology, development…they are the buzzwords we swear by. Globalization is not an option that we dream of; it is an existential compulsion."}, {"7edb": "It isn’t a stretch to presume that the whole survival instinct driven idea of Gair would be ancient history by now."}, {"8d8f": "But of course, when did we ever do what was good, right and ideal? We went ahead and took the exact opposite route. The result — Gair is here to stay. And minus all the survival necessity, it is now steeped in absolute absence of logic, utter stupidity, bad generalizations and idiotic artificial notions of identity based on pointless criteria like race, religion, caste, creed, religion, gender — it is a pretty imaginative list."}, {"c00f": "Because of course, everyone who we deem as ‘our own’, whether by virtue of their nationality, colour, race, caste or gender, are absolute angels, wings, harp et al. and can do absolutely nothing wrong, let alone evil, and are the only ones we can actually trust."}, {"1eb3": "Yeah, I will give you a moment to process the stupidity of that presumption."}, {"c106": "Gair Phir Bhi Gair Hain Paraye Hain Hum Ne Apne Bhi Aazmye Hain"}, {"4fe0": "Strangers are strangers, the other, ‘not our own’"}, {"f9fb": "But then, even our own have let us down"}, {"b1a6": "As far as the Urdu poets are concerned, Gair is often someone who is either a potential lover, or a lover who went away. In other words, someone we know, or knew — someone relatable, someone who is another human. Nothing less, nothing more. Gair is rarely, if ever, used as an idea to further pointless hate and discrimination. Gair just happens to be someone who we are yet to know — or is someone who broke our heart, which is a terrible things all things considered, but is not even a glitch on the demonic scale we, as a society, have started rating our Gair on."}, {"fde8": "Gair, for us, is the one we want to stop entering our countries. Gair is the one we want to build walls for. Gair is the one we don’t want our daughters (or sons) to get married to. Gair is one we don’t want to live next to, eat next to, breathe next to."}, {"ac5f": "Gair is our Mr. Nobody who we hold responsible for everything — from ‘polluting our culture’ to ‘murdering our cows (yeah, that has, unfortunately, become a thing here in India) to shooting our children to stealing our jobs to that ultimate one word blanket for all evil, terrorism."}, {"501e": "We are so obsessed with the idea of getting rid of our Gair, we seem to have completely forgotten that beneath that cruel, mass, all purpose identity are living, breathing humans — humans like us who feel feelings, laugh when tickled, bleed when cut, weep when they watch their kids drown, die when a mob beats them into a pulp for a crime that is their identity."}, {"ce1f": "Khat Gair Ka Padhte The, Jo Toka, Toh Wo Bole,"}, {"c54e": "Akhbaar Ka Parcha Hai, Khabar Dekh Rahein Hain"}, {"6e95": "— Daag Dehlvi"}, {"bbab": "They were reading the letter of a stranger, when we asked, they said,"}, {"d050": "It is just a newspaper, we are checking out the news"}, {"d247": "Even more unfortunately, Gair is also the person we read about in the newspaper, tut at their fate, probably spare a sigh, thank our Gods that we were spared and then move on our own merry ways."}, {"5cf1": "Sometimes it is hard to choose what is crueler for our Gair — our brutality or our apathy."}, {"f14d": "Either way, Gair suffers. And shall continue to suffer as long as the idea persists in our society. Which is most probably a heartbreaking forever. After all, you may kill a human; or a dozen. But an idea, an idea is almost impossible to kill."}, {"891b": "Gair is here to stay. And if that thought doesn’t make you want to run for the hills, you probably are the reason why it will stay."}, {"2e30": "Perhaps we cannot kill the idea of Gair. But we can at least try to turn it around. In true tradition of Urdu poets, maybe we can start treating Gair as merely the guy we haven’t met yet; allow them their humanity even in abstraction; and make an effort to remind ourselves that a fractured humanity is no humanity at all. It may seem like a meager fight against a mammoth challenge, but we all owe it to ourselves to do our bit and keep the hopes of a Gair free world, or at least a world where the idea of Gair is not patently negative; alive."}, {"9363": "It is the least we can do. It is also, perhaps, the most we can do."}, {"35da": "Charaago’n ko aankho’n me mahfooj rakhna Badi dur tak raat hi raat hogi"}, {"6c82": "Musafir ho tum bhi, musafir hai hum bhi Kisi mod par phir mulaakat hogi"}, {"6462": "— Basheer Badr"}, {"c48f": "Keep the lights in your eyes alight and safe"}, {"ae3b": "It is a long and dark night ahead"}, {"c110": "We are both travelers on the same path of life"}, {"693e": "At some crossroads ahead, we will, perhaps, meet again"}, {"c048": "Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon!"}], "content": "Gair — The Menace of ‘The Other’ A Sufi Celebration of Life, Inspired By Urdu Kaha Aane Deeje Na Gair Ko, Hum Bulayenge Shauk Se Tumhe Rashq Ho Toh Na Aao Tum, Yahi Kah Ke Mujhe Utha Diya — Bahadurshah ‘Zafar’ I said don’t let the other come in; they said we will invite them in with pleasure If it makes you jealous, you are most welcome to leave; they said and dismissed me For once this blog is focused on a word that I wish could be eliminated, not just from our lexicons but from our very thought processes, our ideologies, our belief systems, our societies. Gair. Literally translated it means ‘stranger’ or ‘the other’. Over the years, especially in the more recent times, the very idea of Gair has acquired horrendous and distasteful and terrible implications. Gair, for us, is someone who is unlike us, who we probably don’t understand, who we are suspicious of, who is not one of ‘our own’. As is the case with most ideas, it is not the idea of Gair in abstraction that is demonic, or even problematic. As a matter of fact, at its bare basic core, the idea of Gair is a product of an essential evolutionary survival instinct. Back in the stone ages, perhaps, we needed to know the Gair from our own, or risk falling prey to predators, of either human or animal kind. Gair was relevant, maybe even essential in the Stone Ages. Last I checked this was not the Stone Age. Although, given our collective obsession with the idea of ‘Gair’, you may be forgiven if you have started believing otherwise. It doesn’t make sense. We are, arguably, living in the most progressive era of human civilization. Walking on the moon is already so 60s, we are planning to colonize the space and dream of fornicating with the aliens (sorry E.T!). A.I is an undeniable part of our new reality, and sentient robots are ready to walk out of Issac Asimov stories, straight into our bedrooms. Science, technology, development…they are the buzzwords we swear by. Globalization is not an option that we dream of; it is an existential compulsion. It isn’t a stretch to presume that the whole survival instinct driven idea of Gair would be ancient history by now. But of course, when did we ever do what was good, right and ideal? We went ahead and took the exact opposite route. The result — Gair is here to stay. And minus all the survival necessity, it is now steeped in absolute absence of logic, utter stupidity, bad generalizations and idiotic artificial notions of identity based on pointless criteria like race, religion, caste, creed, religion, gender — it is a pretty imaginative list. Because of course, everyone who we deem as ‘our own’, whether by virtue of their nationality, colour, race, caste or gender, are absolute angels, wings, harp et al. and can do absolutely nothing wrong, let alone evil, and are the only ones we can actually trust. Yeah, I will give you a moment to process the stupidity of that presumption. Gair Phir Bhi Gair Hain Paraye Hain Hum Ne Apne Bhi Aazmye Hain Strangers are strangers, the other, ‘not our own’ But then, even our own have let us down As far as the Urdu poets are concerned, Gair is often someone who is either a potential lover, or a lover who went away. In other words, someone we know, or knew — someone relatable, someone who is another human. Nothing less, nothing more. Gair is rarely, if ever, used as an idea to further pointless hate and discrimination. Gair just happens to be someone who we are yet to know — or is someone who broke our heart, which is a terrible things all things considered, but is not even a glitch on the demonic scale we, as a society, have started rating our Gair on. Gair, for us, is the one we want to stop entering our countries. Gair is the one we want to build walls for. Gair is the one we don’t want our daughters (or sons) to get married to. Gair is one we don’t want to live next to, eat next to, breathe next to. Gair is our Mr. Nobody who we hold responsible for everything — from ‘polluting our culture’ to ‘murdering our cows (yeah, that has, unfortunately, become a thing here in India) to shooting our children to stealing our jobs to that ultimate one word blanket for all evil, terrorism. We are so obsessed with the idea of getting rid of our Gair, we seem to have completely forgotten that beneath that cruel, mass, all purpose identity are living, breathing humans — humans like us who feel feelings, laugh when tickled, bleed when cut, weep when they watch their kids drown, die when a mob beats them into a pulp for a crime that is their identity. Khat Gair Ka Padhte The, Jo Toka, Toh Wo Bole, Akhbaar Ka Parcha Hai, Khabar Dekh Rahein Hain — Daag Dehlvi They were reading the letter of a stranger, when we asked, they said, It is just a newspaper, we are checking out the news Even more unfortunately, Gair is also the person we read about in the newspaper, tut at their fate, probably spare a sigh, thank our Gods that we were spared and then move on our own merry ways. Sometimes it is hard to choose what is crueler for our Gair — our brutality or our apathy. Either way, Gair suffers. And shall continue to suffer as long as the idea persists in our society. Which is most probably a heartbreaking forever. After all, you may kill a human; or a dozen. But an idea, an idea is almost impossible to kill. Gair is here to stay. And if that thought doesn’t make you want to run for the hills, you probably are the reason why it will stay. Perhaps we cannot kill the idea of Gair. But we can at least try to turn it around. In true tradition of Urdu poets, maybe we can start treating Gair as merely the guy we haven’t met yet; allow them their humanity even in abstraction; and make an effort to remind ourselves that a fractured humanity is no humanity at all. It may seem like a meager fight against a mammoth challenge, but we all owe it to ourselves to do our bit and keep the hopes of a Gair free world, or at least a world where the idea of Gair is not patently negative; alive. It is the least we can do. It is also, perhaps, the most we can do. Charaago’n ko aankho’n me mahfooj rakhna Badi dur tak raat hi raat hogi Musafir ho tum bhi, musafir hai hum bhi Kisi mod par phir mulaakat hogi — Basheer Badr Keep the lights in your eyes alight and safe It is a long and dark night ahead We are both travelers on the same path of life At some crossroads ahead, we will, perhaps, meet again Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon! ", "name": "449", "child": "449_1\t449_2\t449_3\t449_4\t449_5\t449_6\t449_7\t449_8\t449_9\t449_10", "timestamp": "Apr 8"}