{"parent": "", "title": "ICE agency is publicly calling out counties that don’t detain immigrants for deportation", "author": "Esther Yu Hsi Lee", "sentences": [{"9d93": "ICE agency is publicly calling out counties that don’t detain immigrants for deportation"}, {"fd5f": "It’s a ‘name and shame’ game."}, {"8044": "More than 680 foreign nationals were arrested in February during targeted enforcement operations conducted by U.S. Immigration and Customs Enforcement (ICE). CREDIT: Michael Johnson/ U.S. Immigration and Customs Enforcement (ICE)"}, {"422f": "The Trump administration is beginning to fulfill its promise to name and shame so-called “sanctuary cities” where local law enforcement officials arrest immigrants and do not turn them over to the federal immigration agency for potential deportation proceedings."}, {"274c": "On Monday, the Department of Homeland Security publicly released its first-ever weekly report showing that the U.S. Immigration and Customs Enforcement (ICE) agency issued a total of 3,083 detainer requests between January 28 and February 3 to detain arrested immigrants for deportation proceedings. The report included a list of all the counties and jurisdictions that had declined a total of 206 federal detainer requests."}, {"4c08": "ICE criticized the lack of cooperation as an assault to public safety."}, {"d827": "“When law enforcement agencies fail to honor immigration detainers and release serious criminal offenders, it undermines ICE’s ability to protect the public safety and carry out its mission,” Thomas Homan, the agency’s acting director, said in a statement."}, {"018c": "Travis County, Texas, which enacted a sanctuary policy on February 1, declined 142 of the 206 requests. Local officials in Travis County explained to the Huffington Post that the number of denials was high because the county had released immigrants who don’t fit the criteria of people who should be held under their new detainer request policy. That policy would allow immigrants to post bond if they have not been charged with serious criminal offenses like murder, aggravated sexual assault, or human smuggling."}, {"75d6": "“After Sheriff Sally Hernandez took office, her office compiled all the names of people who wouldn’t be held under the new ‘sanctuary’ policy and submitted them to ICE 10 days before implementing it,” the publication reported. Maj. Wes Priddy of the Travis County Sheriff’s Office said that 37 of the 38 people released on bond attended their scheduled court hearings, a record that he said was “ every bit as good as the record of U.S. citizens that have to go to a court date. These people are showing up.”"}, {"996a": "Donald Trump tried to punish ‘sanctuary cities.’ It’s backfiring.More cities have joined the movement since his executive order.thinkprogress.org"}, {"a3b0": "Immigration data experts at the Transactional Records Access Clearinghouse at Syracuse University said that the information provided by the ICE report is “very limited and selective.” David Burnham and Susan B. Long, co-directors at TRAC, pointed out that the agency’s weekly report does little to provide accurate information on the number of total detainers received, but only lists the ones that ICE records has refused."}, {"7b7c": "“The public also does not know, for example, how often ICE issued a detainer but then decided not to take the person into custody. Or having taken individuals into custody, found it did not have a legal basis to deport them,” Burnham and Long wrote in an emailed press statement. “ICE’s report does not provide any information about the content of the detainer itself, or even whether the original detainer request met legal requirements that were outlined in the Department of Homeland Security’s November 2014 memorandum regarding limits on its legal authority to issue detainers.”"}, {"3d0e": "In spite of the ICE agency’s public shaming effort, not all local law enforcement officials see the benefits of closely collaborating with federal officials. Many law enforcement officials argue that their responsibility is to keep their communities safe, not for them to take on a bigger role to enforce federal immigration laws that may wreck public trust in the process."}, {"2eb5": "Maryland’s Montgomery County is not a sanctuary city. But Police Chief J. Thomas Manger, who is also president of the Major City Chiefs Association, said that working as a police officer for four decades has taught him to support policies that encourage immigrants to work with local law enforcement officials. One-third of the residents in Montgomery County are not born in the United States."}, {"3e2d": "“Eighteen thousand police departments — one size does not fit all.”"}, {"f5b3": "“If you ask any police chief or sheriff what their mission is, they will tell you first and foremost that it’s the safety of their community,” Manger said at a policy briefing on Capitol Hill last week. “It’s a complex mission, with a lot of moving parts. Eighteen thousand police departments — one size does not fit all. Every community has different crime challenges and different safety issues that they have to deal with, but at the core of our ability to perform our mission effectively is earning and keeping the trust and confidence of those whom we serve.”"}, {"f5e8": "“One of the things we tell people is we don’t care about your immigration status,” Montgomery County Police Department’s Lt. Jordon Satinsky told ThinkProgress at the briefing last week. He explained that immigrant victims have been more willing to report crimes because his department doesn’t automatically come into the encounter already seeing them as suspects solely because of their immigration status."}, {"9693": "“We’ve done a very good job in our county of getting the information that we’re there to help anybody that comes into the door.” Satinsky said. “We’re victim-centered.”"}], "content": "ICE agency is publicly calling out counties that don’t detain immigrants for deportation It’s a ‘name and shame’ game. More than 680 foreign nationals were arrested in February during targeted enforcement operations conducted by U.S. Immigration and Customs Enforcement (ICE). CREDIT: Michael Johnson/ U.S. Immigration and Customs Enforcement (ICE) The Trump administration is beginning to fulfill its promise to name and shame so-called “sanctuary cities” where local law enforcement officials arrest immigrants and do not turn them over to the federal immigration agency for potential deportation proceedings. On Monday, the Department of Homeland Security publicly released its first-ever weekly report showing that the U.S. Immigration and Customs Enforcement (ICE) agency issued a total of 3,083 detainer requests between January 28 and February 3 to detain arrested immigrants for deportation proceedings. The report included a list of all the counties and jurisdictions that had declined a total of 206 federal detainer requests. ICE criticized the lack of cooperation as an assault to public safety. “When law enforcement agencies fail to honor immigration detainers and release serious criminal offenders, it undermines ICE’s ability to protect the public safety and carry out its mission,” Thomas Homan, the agency’s acting director, said in a statement. Travis County, Texas, which enacted a sanctuary policy on February 1, declined 142 of the 206 requests. Local officials in Travis County explained to the Huffington Post that the number of denials was high because the county had released immigrants who don’t fit the criteria of people who should be held under their new detainer request policy. That policy would allow immigrants to post bond if they have not been charged with serious criminal offenses like murder, aggravated sexual assault, or human smuggling. “After Sheriff Sally Hernandez took office, her office compiled all the names of people who wouldn’t be held under the new ‘sanctuary’ policy and submitted them to ICE 10 days before implementing it,” the publication reported. Maj. Wes Priddy of the Travis County Sheriff’s Office said that 37 of the 38 people released on bond attended their scheduled court hearings, a record that he said was “ every bit as good as the record of U.S. citizens that have to go to a court date. These people are showing up.” Donald Trump tried to punish ‘sanctuary cities.’ It’s backfiring.More cities have joined the movement since his executive order.thinkprogress.org Immigration data experts at the Transactional Records Access Clearinghouse at Syracuse University said that the information provided by the ICE report is “very limited and selective.” David Burnham and Susan B. Long, co-directors at TRAC, pointed out that the agency’s weekly report does little to provide accurate information on the number of total detainers received, but only lists the ones that ICE records has refused. “The public also does not know, for example, how often ICE issued a detainer but then decided not to take the person into custody. Or having taken individuals into custody, found it did not have a legal basis to deport them,” Burnham and Long wrote in an emailed press statement. “ICE’s report does not provide any information about the content of the detainer itself, or even whether the original detainer request met legal requirements that were outlined in the Department of Homeland Security’s November 2014 memorandum regarding limits on its legal authority to issue detainers.” In spite of the ICE agency’s public shaming effort, not all local law enforcement officials see the benefits of closely collaborating with federal officials. Many law enforcement officials argue that their responsibility is to keep their communities safe, not for them to take on a bigger role to enforce federal immigration laws that may wreck public trust in the process. Maryland’s Montgomery County is not a sanctuary city. But Police Chief J. Thomas Manger, who is also president of the Major City Chiefs Association, said that working as a police officer for four decades has taught him to support policies that encourage immigrants to work with local law enforcement officials. One-third of the residents in Montgomery County are not born in the United States. “Eighteen thousand police departments — one size does not fit all.” “If you ask any police chief or sheriff what their mission is, they will tell you first and foremost that it’s the safety of their community,” Manger said at a policy briefing on Capitol Hill last week. “It’s a complex mission, with a lot of moving parts. Eighteen thousand police departments — one size does not fit all. Every community has different crime challenges and different safety issues that they have to deal with, but at the core of our ability to perform our mission effectively is earning and keeping the trust and confidence of those whom we serve.” “One of the things we tell people is we don’t care about your immigration status,” Montgomery County Police Department’s Lt. Jordon Satinsky told ThinkProgress at the briefing last week. He explained that immigrant victims have been more willing to report crimes because his department doesn’t automatically come into the encounter already seeing them as suspects solely because of their immigration status. “We’ve done a very good job in our county of getting the information that we’re there to help anybody that comes into the door.” Satinsky said. “We’re victim-centered.” ", "name": "450", "child": "450_1\t450_2\t450_3\t450_4\t450_5\t450_6\t450_7\t450_8", "timestamp": "Mar 21"}