{"parent": "", "title": "While world discusses North Korea missile launch, Trump complains about tax marches", "author": "Zack Ford", "sentences": [{"bdf6": "While world discusses North Korea missile launch, Trump complains about tax marches"}, {"362c": "Rehashing the election, Trump believes the Tax Day protesters must’ve been paid."}, {"5696": "CREDIT: AP Photo/David Zalubowski"}, {"3baa": "Sunday morning tweets are a peculiar tradition for President Trump, and his long weekend at Mar-a-Lago didn’t interrupt it. Though almost all news media discussed North Korea’s failed missile launch, Trump was instead complaining about the Tax Day marches."}, {"440d": "Some 150 marches took place Saturday across the country, with thousands in attendance demanding that Trump release his tax returns. Trump seemed to think they were simply rehashing the election."}, {"9876": "As signs made clear, the marchers were not concerned about the election, but about Trump’s many financial connections. If he’s in any way profiting off of the presidency or if he has foreign financial ties — both of which seem likely — those would be serious, impeachment-worthy concerns. Many marchers seemed to suspect that his tax returns would specifically reveal collusion with Russia, as evidence mounts of coordination between Russia and the Trump campaign."}, {"beac": "Trump didn’t acknowledge any of these concerns, instead dismissing the marches as “small” and implying the protesters were paid to show up."}, {"2c4f": "The Washington, D.C. rally had some 25,000 participants, and attendance surpassed expectations in other cities as well."}, {"1a11": "The myth of paid protesters has persisted in conservative media since the National Women’s March and the airport protests over Trump’s first Muslim ban during his first two weeks in office. As members of Congress have had their town halls bombarded by protesters, the conspiracy theory has truly blossomed. Breitbart, unsurprisingly, was already dismissing the Tax Day marches as having been funded by George Soros back in February."}, {"5675": "The Daily Show recently debunked the claim about paid liberal protesters:"}, {"24e6": "Trump’s tweets Sunday morning also included an admission that he flip-flopped on calling China a currency manipulator so that it would work with the U.S. to address threats from North Korea and some bragging about how he’s growing the military:"}], "content": "While world discusses North Korea missile launch, Trump complains about tax marches Rehashing the election, Trump believes the Tax Day protesters must’ve been paid. CREDIT: AP Photo/David Zalubowski Sunday morning tweets are a peculiar tradition for President Trump, and his long weekend at Mar-a-Lago didn’t interrupt it. Though almost all news media discussed North Korea’s failed missile launch, Trump was instead complaining about the Tax Day marches. Some 150 marches took place Saturday across the country, with thousands in attendance demanding that Trump release his tax returns. Trump seemed to think they were simply rehashing the election. As signs made clear, the marchers were not concerned about the election, but about Trump’s many financial connections. If he’s in any way profiting off of the presidency or if he has foreign financial ties — both of which seem likely — those would be serious, impeachment-worthy concerns. Many marchers seemed to suspect that his tax returns would specifically reveal collusion with Russia, as evidence mounts of coordination between Russia and the Trump campaign. Trump didn’t acknowledge any of these concerns, instead dismissing the marches as “small” and implying the protesters were paid to show up. The Washington, D.C. rally had some 25,000 participants, and attendance surpassed expectations in other cities as well. The myth of paid protesters has persisted in conservative media since the National Women’s March and the airport protests over Trump’s first Muslim ban during his first two weeks in office. As members of Congress have had their town halls bombarded by protesters, the conspiracy theory has truly blossomed. Breitbart, unsurprisingly, was already dismissing the Tax Day marches as having been funded by George Soros back in February. The Daily Show recently debunked the claim about paid liberal protesters: Trump’s tweets Sunday morning also included an admission that he flip-flopped on calling China a currency manipulator so that it would work with the U.S. to address threats from North Korea and some bragging about how he’s growing the military: ", "name": "451", "child": "451_1\t451_2\t451_3", "timestamp": "Apr 16"}