{"parent": "", "title": "As North Korea displays new missiles in parade, Trump visits his golf course", "author": "Lindsay Gibbs", "sentences": [{"3bdd": "As North Korea displays new missiles in parade, Trump visits his golf course"}, {"0487": "Allies are concerned."}, {"323b": "In this Friday, March 3, 2017, file photo, U.S. President Donald Trump gestures as he walks down the stairs of Air Force One upon his arrival at Palm Beach International Airport in West Palm Beach, Fla. CREDIT: AP Photo/Luis M. Alvarez"}, {"4e2e": "President Donald Trump is spending the Easter weekend at his Mar-a-Lago resort in Palm Springs. On Saturday, visited Trump International Golf Club, his 19th trip to a golf course since taking office 12 weeks ago."}, {"7b17": "Meanwhile, halfway across the world, North Korea held its annual military parade, and used the occasion to show off a flock of new missiles, including two new intercontinental ballistic missile-sized canisters."}, {"60cb": "The military showcase seems to be in response to last weekend’s move by the United States to dispatch the aircraft carrier USS Carl Vinson strike group to the region last weekend."}, {"944a": "“The Vinson was sent out to make a statement. North Korea responded by showing off the most new missile hardware we’ve ever seen in a parade before,” Melissa Hanham, senior research associate at the James Martin Center for Nonproliferation Studies in California, told CNN."}, {"26f4": "The intercontinental ballistic missile-sized canisters shown off in the parade are larger than any weapons North Korea has ever produced. While experts believe the displayed canisters are merely design concepts, and not actual working missiles, they do signal that the country is working on developing a missile that could reach the continental United States or Europe. It’s also notable that an ICBM in a canister would be solid-fueled, meaning it could be both deployed faster and hidden better from satellites than anything that is liquid-fueled."}, {"cf12": "Adam Mount, senior fellow at the Center for American Progress, told CNN that this parade “certainly appears to be a message to the United States that they’re capable of threatening the U.S. homeland.”"}, {"1f07": "North Korea also displayed other new land and submarine-launched ballistic missiles in Saturday’s parade, which have a shorter range, making them a threat to North Korea’s neighbors in Asia."}, {"dacc": "China’s president Xi Jinping met with Trump at Mar-a-Lago last week to discuss options for handling North Korea and its leader, Kim Jong-un, but tensions in the region have only escalated since."}, {"caed": "On Thursday, North Korea issued a statement to CNN calling the U.S. Navy’s deployment of the Vinson a “reckless [act] of aggression.” The country stressed that it “will make the US fully accountable for the catastrophic consequences that may be brought about by its high-handed and outrageous acts.”"}, {"c19d": "Additionally, North Korean Vice Foreign Minister Han Song Ryol told the Associated Press in an interview that Trump’s “aggressive tweets” help create a “vicious cycle” of tension in the region."}, {"def0": "This week, Trump twice tweeted that if China is unable to rein in North Korea’s nuclear program, the United States will."}, {"ca11": "On Friday, China warned that tensions in the Korean region were on the verge of spinning out of control, according to the New York Times."}, {"ed00": "“The United States and South Korea and North Korea are engaging in tit for tat, with swords drawn and bows bent, and there have been storm clouds gathering,” Wang Yi, China’s foreign minister, said as reported by Xinhau, the state news agency."}, {"13d9": "“If they let war break out on the peninsula, they must shoulder that historical culpability and pay the corresponding price for this.”"}, {"05eb": "In the past couple of weeks, Trump has bombed Syria and Afghanistan, and received praise from members of the media for both of those actions."}, {"61e2": "Vice President Mike Pence traveled to South Korea on Saturday, the start of a 10-day trip through Asia in which he hopes to send a message the U.S. has an “ironclad commitment to stand with our allies in the region, in their defense.”"}, {"a7e0": "It was not clear by the press pool report on Saturday morning whether or not Trump was playing golf at his club, or merely visiting. However, the pool report did note that “if someone were to be playing golf, he or she would be rewarded with 75 degrees and partly sunny skies.”"}], "content": "As North Korea displays new missiles in parade, Trump visits his golf course Allies are concerned. In this Friday, March 3, 2017, file photo, U.S. President Donald Trump gestures as he walks down the stairs of Air Force One upon his arrival at Palm Beach International Airport in West Palm Beach, Fla. CREDIT: AP Photo/Luis M. Alvarez President Donald Trump is spending the Easter weekend at his Mar-a-Lago resort in Palm Springs. On Saturday, visited Trump International Golf Club, his 19th trip to a golf course since taking office 12 weeks ago. Meanwhile, halfway across the world, North Korea held its annual military parade, and used the occasion to show off a flock of new missiles, including two new intercontinental ballistic missile-sized canisters. The military showcase seems to be in response to last weekend’s move by the United States to dispatch the aircraft carrier USS Carl Vinson strike group to the region last weekend. “The Vinson was sent out to make a statement. North Korea responded by showing off the most new missile hardware we’ve ever seen in a parade before,” Melissa Hanham, senior research associate at the James Martin Center for Nonproliferation Studies in California, told CNN. The intercontinental ballistic missile-sized canisters shown off in the parade are larger than any weapons North Korea has ever produced. While experts believe the displayed canisters are merely design concepts, and not actual working missiles, they do signal that the country is working on developing a missile that could reach the continental United States or Europe. It’s also notable that an ICBM in a canister would be solid-fueled, meaning it could be both deployed faster and hidden better from satellites than anything that is liquid-fueled. Adam Mount, senior fellow at the Center for American Progress, told CNN that this parade “certainly appears to be a message to the United States that they’re capable of threatening the U.S. homeland.” North Korea also displayed other new land and submarine-launched ballistic missiles in Saturday’s parade, which have a shorter range, making them a threat to North Korea’s neighbors in Asia. China’s president Xi Jinping met with Trump at Mar-a-Lago last week to discuss options for handling North Korea and its leader, Kim Jong-un, but tensions in the region have only escalated since. On Thursday, North Korea issued a statement to CNN calling the U.S. Navy’s deployment of the Vinson a “reckless [act] of aggression.” The country stressed that it “will make the US fully accountable for the catastrophic consequences that may be brought about by its high-handed and outrageous acts.” Additionally, North Korean Vice Foreign Minister Han Song Ryol told the Associated Press in an interview that Trump’s “aggressive tweets” help create a “vicious cycle” of tension in the region. This week, Trump twice tweeted that if China is unable to rein in North Korea’s nuclear program, the United States will. On Friday, China warned that tensions in the Korean region were on the verge of spinning out of control, according to the New York Times. “The United States and South Korea and North Korea are engaging in tit for tat, with swords drawn and bows bent, and there have been storm clouds gathering,” Wang Yi, China’s foreign minister, said as reported by Xinhau, the state news agency. “If they let war break out on the peninsula, they must shoulder that historical culpability and pay the corresponding price for this.” In the past couple of weeks, Trump has bombed Syria and Afghanistan, and received praise from members of the media for both of those actions. Vice President Mike Pence traveled to South Korea on Saturday, the start of a 10-day trip through Asia in which he hopes to send a message the U.S. has an “ironclad commitment to stand with our allies in the region, in their defense.” It was not clear by the press pool report on Saturday morning whether or not Trump was playing golf at his club, or merely visiting. However, the pool report did note that “if someone were to be playing golf, he or she would be rewarded with 75 degrees and partly sunny skies.” ", "name": "453", "child": "453_1\t453_2\t453_3\t453_4\t453_5\t453_6\t453_7", "timestamp": "Apr 15"}