{"parent": "", "title": "White House’s secrecy about visitor logs will obscure Trump’s conflicts of interest", "author": "Aaron Rupar", "sentences": [{"a720": "White House’s secrecy about visitor logs will obscure Trump’s conflicts of interest"}, {"b7ed": "Concealing the swamp instead of draining it."}, {"d5bb": "In a break with Obama administration policy, the Trump administration has decided to keep logs of who is visiting the White House secret."}, {"aa79": "“White House communications director Michael Dubke said the decision to reverse the Obama-era policy was due to ‘the grave national security risks and privacy concerns of the hundreds of thousands of visitors annually,’” Time reported on Friday. “Instead, the Trump Administration is relying on a federal court ruling that most of the logs are ‘presidential records’ and are not subject to the Freedom of Information Act.”"}, {"a467": "Logs will be kept secret until at least five years after Trump leaves office. The Washington Post reports that since the inauguration, “the page where the visitor logs had been publicly available has gone dark, and Trump administration officials said Friday that they will no longer maintain it, a move that the White House said would save taxpayers $70,000 by 2020.”"}, {"1046": "$70,000 is a mere fraction of the $3-plus million each of Trump’s Mar-a-Lago trips costs taxpayers."}, {"cdbd": "The decision marks yet another disconnect between the rhetoric Trump used during the Obama era and his actions as president."}, {"204a": "Shortly after launching his campaign in the summer of 2015, Trump called for “total transparency” about who politicians are speaking with."}, {"f321": "Not only will the new White House policy allow Trump to meet with lobbyists and donors without the public knowing about it, but it will allow him to meet secretly with individuals connected to the Trump Organization, including his sons Eric and Donald Jr."}, {"9eb2": "Before the inauguration, Trump promised to maintain a firewall between his presidential duties and his interests as owner of the Trump Organization, but that separation has proven to be porous in recent weeks. His kids have admitted their father will be regularly briefed about how the business is doing financially, and earlier this week, the Washington Post reported that Trump’s children are pushing for policy changes to maximize the profitability of the Trump brand."}, {"928c": "The new Trump administration policy means business meetings between Trump and his sons could now take place at the White House without the public knowing."}, {"1485": "Trump kids push for changes to White House policies to maximize profitability of Trump brand“The Trump heirs are interested in any changes that might help resuscitate the presidency and preserve the family’s…thinkprogress.org"}, {"c4b7": "The danger of keeping White House visitor logs secret was revealed by the recent Devin Nunes fiasco. In March, Nunes, the Republican chair of the House Intelligence Committee, publicly touted intelligence reports involving Trump transition officials in a clumsy attempt to validate Trump’s claim that Obama wiretapped him."}, {"58bf": "Nunes eventually told CNN he was in fact on the White House grounds the night before he held a news conference about the intelligence reports. But under the Trump administration’s new policy, there’s a chance the public wouldn’t have found out Nunes’ information was actually fed to him by the White House."}, {"ce1b": "The new White House policy is also concerning in light of White House officials’ propensity to not disclose important meetings. Late last month, the New York Times broke news about a previously undisclosed December meeting between Jared Kushner and Sergey Gorkov, head of Vnesheconombank, a state-owned Russian bank that is still under American sanctions placed on it by the Obama administration. Kushner now serves as Trump’s senior adviser, but Democrats have called for his security clearance to be suspended because of his failure to disclose his meeting with Gorkov."}, {"c6e6": "And despite Trump’s repeated claims that he had no contact with Russian officials as a presidential candidate, it emerged last month that he actually met in April 2016 with Russian ambassador Sergey Kislyak."}, {"c247": "In response to the White House’s decision to keep the visitor logs private, Citizens for Responsibility and Ethics in Washington (CREW) Executive Director Noah Bookbinder released a statement promising to challenge the Trump administration’s lack of transparency in court."}, {"9bce": "“It’s disappointing that the man who promised to ‘drain the swamp’ just took a massive step away from transparency by refusing the release the White House visitor logs that the American people have grown accustomed to accessing over the last six years and that provide indispensable information about who is seeking to influence the president,” he said."}, {"f7d7": "“The Obama administration agreed to release the visitor logs in response to our lawsuits, and despite the Trump administration’s worry over ‘grave national security risks and concerns,’ only positives for the American people came out of them. This week, we sued the Trump administration to make sure they would continue to release the logs,” Bookbinder added. “It looks like we’ll see them in court.”"}], "content": "White House’s secrecy about visitor logs will obscure Trump’s conflicts of interest Concealing the swamp instead of draining it. In a break with Obama administration policy, the Trump administration has decided to keep logs of who is visiting the White House secret. “White House communications director Michael Dubke said the decision to reverse the Obama-era policy was due to ‘the grave national security risks and privacy concerns of the hundreds of thousands of visitors annually,’” Time reported on Friday. “Instead, the Trump Administration is relying on a federal court ruling that most of the logs are ‘presidential records’ and are not subject to the Freedom of Information Act.” Logs will be kept secret until at least five years after Trump leaves office. The Washington Post reports that since the inauguration, “the page where the visitor logs had been publicly available has gone dark, and Trump administration officials said Friday that they will no longer maintain it, a move that the White House said would save taxpayers $70,000 by 2020.” $70,000 is a mere fraction of the $3-plus million each of Trump’s Mar-a-Lago trips costs taxpayers. The decision marks yet another disconnect between the rhetoric Trump used during the Obama era and his actions as president. Shortly after launching his campaign in the summer of 2015, Trump called for “total transparency” about who politicians are speaking with. Not only will the new White House policy allow Trump to meet with lobbyists and donors without the public knowing about it, but it will allow him to meet secretly with individuals connected to the Trump Organization, including his sons Eric and Donald Jr. Before the inauguration, Trump promised to maintain a firewall between his presidential duties and his interests as owner of the Trump Organization, but that separation has proven to be porous in recent weeks. His kids have admitted their father will be regularly briefed about how the business is doing financially, and earlier this week, the Washington Post reported that Trump’s children are pushing for policy changes to maximize the profitability of the Trump brand. The new Trump administration policy means business meetings between Trump and his sons could now take place at the White House without the public knowing. Trump kids push for changes to White House policies to maximize profitability of Trump brand“The Trump heirs are interested in any changes that might help resuscitate the presidency and preserve the family’s…thinkprogress.org The danger of keeping White House visitor logs secret was revealed by the recent Devin Nunes fiasco. In March, Nunes, the Republican chair of the House Intelligence Committee, publicly touted intelligence reports involving Trump transition officials in a clumsy attempt to validate Trump’s claim that Obama wiretapped him. Nunes eventually told CNN he was in fact on the White House grounds the night before he held a news conference about the intelligence reports. But under the Trump administration’s new policy, there’s a chance the public wouldn’t have found out Nunes’ information was actually fed to him by the White House. The new White House policy is also concerning in light of White House officials’ propensity to not disclose important meetings. Late last month, the New York Times broke news about a previously undisclosed December meeting between Jared Kushner and Sergey Gorkov, head of Vnesheconombank, a state-owned Russian bank that is still under American sanctions placed on it by the Obama administration. Kushner now serves as Trump’s senior adviser, but Democrats have called for his security clearance to be suspended because of his failure to disclose his meeting with Gorkov. And despite Trump’s repeated claims that he had no contact with Russian officials as a presidential candidate, it emerged last month that he actually met in April 2016 with Russian ambassador Sergey Kislyak. In response to the White House’s decision to keep the visitor logs private, Citizens for Responsibility and Ethics in Washington (CREW) Executive Director Noah Bookbinder released a statement promising to challenge the Trump administration’s lack of transparency in court. “It’s disappointing that the man who promised to ‘drain the swamp’ just took a massive step away from transparency by refusing the release the White House visitor logs that the American people have grown accustomed to accessing over the last six years and that provide indispensable information about who is seeking to influence the president,” he said. “The Obama administration agreed to release the visitor logs in response to our lawsuits, and despite the Trump administration’s worry over ‘grave national security risks and concerns,’ only positives for the American people came out of them. This week, we sued the Trump administration to make sure they would continue to release the logs,” Bookbinder added. “It looks like we’ll see them in court.” ", "name": "454", "child": "454_1\t454_2\t454_3\t454_4\t454_5\t454_6\t454_7\t454_8\t454_9\t454_10\t454_11\t454_12\t454_13\t454_14", "timestamp": "Apr 14"}