{"parent": "", "title": "Trump kids push for changes to White House policies to maximize profitability of Trump brand", "author": "Aaron Rupar", "sentences": [{"7c1d": "Trump kids push for changes to White House policies to maximize profitability of Trump brand"}, {"9be9": "“The Trump heirs are interested in any changes that might help resuscitate the presidency and preserve the family’s name…”"}, {"2ecf": "There’s supposed to be a firewall between President Trump and the business he continues to own, which is being run by his his two adult sons, Eric and Donald Jr. Both Trump Sr. and Eric have recently made public statements about their commitment to making sure the presidency doesn’t becoming a money-making venture for the Trump family."}, {"a94e": "But there’s already been indications that firewall isn’t as firm as it should be. During a February interview with Forbes, Eric admitted that he plans to give his father quarterly financial updates about how Trump’s sprawling business empire is doing. And earlier this week, Donald Jr. told the Associated Press he “has spoken to his father more frequently in recent weeks.”"}, {"9e7e": "A new Washington Post report citing 21 of Trump’s aides, confidants, and allies suggests that not only are Eric and Donald Jr. talking with their dad about his business, but they — along with Ivanka Trump and fellow White House staffer Jared Kushner — are exerting their influence to make sure his flagging presidency doesn’t destroy the family brand."}, {"7cd0": "Trump’s three oldest children — Donald Jr., Ivanka and Eric — and Kushner have been frustrated by the impression of chaos inside the White House and feel that their father has not always been served well by his senior staff, according to people with knowledge of their sentiments. The Trump heirs are interested in any changes that might help resuscitate the presidency and preserve the family’s name at a time when they are trying to expand the Trump Organization’s portfolio of hotels."}, {"fcef": "“The fundamental assessment is that if they want to win the White House in 2020, they’re not going to do it the way they did in 2016, because the family brand would not sustain the collateral damage,” said one well-connected Republican operative, speaking on the condition of anonymity to discuss the president’s family. “It would be so protectionist, nationalist and backward-looking that they’d only be able to build in Oklahoma City or the Ozarks.”"}, {"7416": "News about the Trump kids trying to manipulate White House policies for their own benefit comes at a time when Trump is abruptly breaking with positions that were near and dear to him during the campaign."}, {"47e4": "Though he urged President Obama to stay out of Syria, Trump approved a military strike against the Assad regime last week — a decision Eric attributed to Ivanka’s influence on her father. To cite another example, Trump called NATO “obsolete” as recently as March 22 and made “America first” the catchphrase of his inaugural address, but on Wednesday, he reversed course and said, “It’s no longer obsolete.”"}, {"a73e": "Trump has also recently flip-flopped on whether China is a currency manipulator, the utility of the Export-Import Bank, and whether tax reform or the repeal of Obamacare needs to happen first, among other issues."}, {"beae": "The Post report also comes on the heels of Eric and Ivanka separately defending nepotism during interviews."}, {"cf06": "Trump’s sudden position changes raise the question — are they a reflection of a sudden evolution in what he thinks is best for the country, or does he think a more “globalist” orientation is best for the Trump brand? Because Trump refuses to divest from his company and is still in regular communication with Eric and Donald Jr., it’ll remain a matter for speculation."}], "content": "Trump kids push for changes to White House policies to maximize profitability of Trump brand “The Trump heirs are interested in any changes that might help resuscitate the presidency and preserve the family’s name…” There’s supposed to be a firewall between President Trump and the business he continues to own, which is being run by his his two adult sons, Eric and Donald Jr. Both Trump Sr. and Eric have recently made public statements about their commitment to making sure the presidency doesn’t becoming a money-making venture for the Trump family. But there’s already been indications that firewall isn’t as firm as it should be. During a February interview with Forbes, Eric admitted that he plans to give his father quarterly financial updates about how Trump’s sprawling business empire is doing. And earlier this week, Donald Jr. told the Associated Press he “has spoken to his father more frequently in recent weeks.” A new Washington Post report citing 21 of Trump’s aides, confidants, and allies suggests that not only are Eric and Donald Jr. talking with their dad about his business, but they — along with Ivanka Trump and fellow White House staffer Jared Kushner — are exerting their influence to make sure his flagging presidency doesn’t destroy the family brand. Trump’s three oldest children — Donald Jr., Ivanka and Eric — and Kushner have been frustrated by the impression of chaos inside the White House and feel that their father has not always been served well by his senior staff, according to people with knowledge of their sentiments. The Trump heirs are interested in any changes that might help resuscitate the presidency and preserve the family’s name at a time when they are trying to expand the Trump Organization’s portfolio of hotels. “The fundamental assessment is that if they want to win the White House in 2020, they’re not going to do it the way they did in 2016, because the family brand would not sustain the collateral damage,” said one well-connected Republican operative, speaking on the condition of anonymity to discuss the president’s family. “It would be so protectionist, nationalist and backward-looking that they’d only be able to build in Oklahoma City or the Ozarks.” News about the Trump kids trying to manipulate White House policies for their own benefit comes at a time when Trump is abruptly breaking with positions that were near and dear to him during the campaign. Though he urged President Obama to stay out of Syria, Trump approved a military strike against the Assad regime last week — a decision Eric attributed to Ivanka’s influence on her father. To cite another example, Trump called NATO “obsolete” as recently as March 22 and made “America first” the catchphrase of his inaugural address, but on Wednesday, he reversed course and said, “It’s no longer obsolete.” Trump has also recently flip-flopped on whether China is a currency manipulator, the utility of the Export-Import Bank, and whether tax reform or the repeal of Obamacare needs to happen first, among other issues. The Post report also comes on the heels of Eric and Ivanka separately defending nepotism during interviews. Trump’s sudden position changes raise the question — are they a reflection of a sudden evolution in what he thinks is best for the country, or does he think a more “globalist” orientation is best for the Trump brand? Because Trump refuses to divest from his company and is still in regular communication with Eric and Donald Jr., it’ll remain a matter for speculation. ", "name": "456", "child": "456_1\t456_2\t456_3\t456_4\t456_5\t456_6\t456_7\t456_8\t456_9\t456_10\t456_11\t456_12\t456_13", "timestamp": "Apr 13"}