{"parent": "", "title": "Eric and Ivanka Trump deliver spirited defense of nepotism", "author": "Aaron Rupar", "sentences": [{"a0c2": "Eric and Ivanka Trump deliver spirited defense of nepotism"}, {"face": "“Nepotism is kind of a factor of life.”"}, {"cbf1": "In an interview with Forbes published Tuesday, Eric Trump characterizes his father’s proclivity to put his family members in positions of power as a phenomenon similar to the sun setting each evening."}, {"202e": "“Nepotism is kind of a factor of life,” Eric said. “We might be here because of nepotism, but we’re not still here because of nepotism. You know, if we didn’t do a good job, if we weren’t competent, believe me, we wouldn’t be in this spot.”"}, {"ab62": "Eric seems to think he and his brother find themselves running the Trump Organization because of their competence, but there might be another reason. By putting his kids in charge of a business he still owns, receives quarterly briefings about, and can still even draws profits from, President Trump has ensured that the Trump Organization still operates for his benefit."}, {"c9c8": "Trump’s effort to profit off the presidency gets underway in earnestMar-a-Lago dues are doubling, and Trump-branded hotels look to expand across the country.thinkprogress.org"}, {"97f6": "It’s one thing to take a nepotistic approach to a private business, as Trump has done with his company. It’s another, however, to take that approach in government."}, {"f706": "Trump’s daughter Ivanka now works out of the White House as her father’s assistant. The White House hasn’t been transparent about what her specific duties are. In a new interview with CBS This Morning, Ivanka pushed back on critics who argue her failure to speak out about disagreements she purportedly has with her dad means she’s “complicit” in initiatives like the Muslim ban and mass deportation."}, {"89e4": "“If being complicit is wanting to be a force for good and to make a positive impact, then I’m complicit,” Ivanka said. “You asked me about — people who criticize me for not taking to social media on every single issue, and I would ask them if that would render me more effective or less effective with the people ultimately making decisions… I think most of the impact I have, over time, most people will not actually know about.”"}, {"41b9": "In short, Ivanka thinks it’s fine if the public isn’t privy to what’s she up to in the White House or how her work benefits them."}, {"a601": "Ivanka’s husband, Jared Kushner, is Trump’s senior adviser. He landed his gig in the White House despite nearly bankrupting the family business he inherited from his father. Though Kushner’s background is in real estate, Trump has given him a portfolio including everything from negotiating peace in the Middle East to reforming the criminal justice system."}, {"0da9": "7 jobs Jared Kushner is now doing for the United States of AmericaTrump’s son-in-law has been put in charge of pretty much everything.thinkprogress.org"}, {"d45c": "During the CBS interview, Ivanka argues that because her husband helped her father run his successful presidential campaign, there’s no reason to think Jared can’t be successful working in government."}, {"b142": "“A lot of people would say the same about — how could somebody successfully win the presidency who had never been engaged in politics?” Ivanka said. “And my father did that, and Jared was instrumental in helping his campaign succeed.”"}, {"f98e": "On Monday, Jared landed in Iraq. He’s there for meetings with American military officials and members of Iraq’s government. It another sign of the power Trump’s family members have in his administration, Secretary of State Rex Tillerson didn’t come along."}], "content": "Eric and Ivanka Trump deliver spirited defense of nepotism “Nepotism is kind of a factor of life.” In an interview with Forbes published Tuesday, Eric Trump characterizes his father’s proclivity to put his family members in positions of power as a phenomenon similar to the sun setting each evening. “Nepotism is kind of a factor of life,” Eric said. “We might be here because of nepotism, but we’re not still here because of nepotism. You know, if we didn’t do a good job, if we weren’t competent, believe me, we wouldn’t be in this spot.” Eric seems to think he and his brother find themselves running the Trump Organization because of their competence, but there might be another reason. By putting his kids in charge of a business he still owns, receives quarterly briefings about, and can still even draws profits from, President Trump has ensured that the Trump Organization still operates for his benefit. Trump’s effort to profit off the presidency gets underway in earnestMar-a-Lago dues are doubling, and Trump-branded hotels look to expand across the country.thinkprogress.org It’s one thing to take a nepotistic approach to a private business, as Trump has done with his company. It’s another, however, to take that approach in government. Trump’s daughter Ivanka now works out of the White House as her father’s assistant. The White House hasn’t been transparent about what her specific duties are. In a new interview with CBS This Morning, Ivanka pushed back on critics who argue her failure to speak out about disagreements she purportedly has with her dad means she’s “complicit” in initiatives like the Muslim ban and mass deportation. “If being complicit is wanting to be a force for good and to make a positive impact, then I’m complicit,” Ivanka said. “You asked me about — people who criticize me for not taking to social media on every single issue, and I would ask them if that would render me more effective or less effective with the people ultimately making decisions… I think most of the impact I have, over time, most people will not actually know about.” In short, Ivanka thinks it’s fine if the public isn’t privy to what’s she up to in the White House or how her work benefits them. Ivanka’s husband, Jared Kushner, is Trump’s senior adviser. He landed his gig in the White House despite nearly bankrupting the family business he inherited from his father. Though Kushner’s background is in real estate, Trump has given him a portfolio including everything from negotiating peace in the Middle East to reforming the criminal justice system. 7 jobs Jared Kushner is now doing for the United States of AmericaTrump’s son-in-law has been put in charge of pretty much everything.thinkprogress.org During the CBS interview, Ivanka argues that because her husband helped her father run his successful presidential campaign, there’s no reason to think Jared can’t be successful working in government. “A lot of people would say the same about — how could somebody successfully win the presidency who had never been engaged in politics?” Ivanka said. “And my father did that, and Jared was instrumental in helping his campaign succeed.” On Monday, Jared landed in Iraq. He’s there for meetings with American military officials and members of Iraq’s government. It another sign of the power Trump’s family members have in his administration, Secretary of State Rex Tillerson didn’t come along. ", "name": "460", "child": "460_1\t460_2\t460_3\t460_4\t460_5\t460_6\t460_7\t460_8\t460_9\t460_10\t460_11\t460_12\t460_13\t460_14\t460_15\t460_16\t460_17\t460_18\t460_19\t460_20\t460_21\t460_22\t460_23\t460_24\t460_25", "timestamp": "Apr 5"}