{"parent": "", "title": "Cities sick of Trump kleptocracy push for impeachment", "author": "Laurel Raymond", "sentences": [{"cfc2": "Cities sick of Trump kleptocracy push for impeachment"}, {"e2ef": "Cambridge, Massachusetts is the latest city to take up a vote."}, {"26c3": "Rowers paddle down the Charles River near the campus of Harvard University in Cambridge, Mass. CREDIT: AP Photo/Charles Krupa"}, {"4917": "While Republicans in Congress continue to drag their feet on official investigations of President Donald Trump’s numerous conflicts of interest and alleged Russian connections, some U.S. cities aren’t holding back."}, {"caf9": "On Monday, city councilors in Cambridge, Massachusetts will vote on a resolution urging Congress to investigate whether grounds exist to impeach Trump for his violation of the Constitution’s emoluments clause. The clause, little known before Trump’s presidency, prohibits the president from accepting payments from foreign governments or from the federal or state governments other than his federal salary."}, {"3eb8": "“From the moment he took office, President Trump was in violation of the Foreign Emoluments Clause and the Domestic Emoluments Clause of the United States Constitution,” the resolution under consideration in Cambridge says. “These violations undermine the integrity of the Presidency, corruptly advance the personal wealth of the President, and violate the public trust.”"}, {"f2fb": "If the proposal passes, Cambridge will join a handful of other cities calling for the president’s impeachment, including Berkeley, Alameda, and Richmond, California. These resolutions are largely symbolic; municipalities have no power to compel Congress to conduct investigations or impeachments."}, {"f108": "They are, however, part of a growing national drumbeat for answers regarding Trump’s business ties and the conflicts they pose for his presidency."}, {"07ae": "Trump has violated his oath to the ConstitutionHis first act as President.thinkprogress.org"}, {"b2a7": "As a luxury hotelier and property magnate, Trump’s businesses are practically tailor-made to accept payments from both foreign governments and domestic entities that have an interest in influencing the presidency, and which see funneling business to his company as one way to get in the president’s good graces. Just a block from the White House, his new downtown D.C. hotel has quickly become the new hot-spot for foreign embassy events, diplomats, and government officials and lobbyists, and the Trump organization has dozens properties and projects just like it around the world."}, {"d06c": "Yet in defiance of the advice of the nonpartisan Office of Government ethics and prominent ethics experts, President Trump has refused to fully divest from his businesses. Instead of setting up an independent, blind trust as these experts advised, Trump instead has placed his assets into a revocable trust run by his sons and a longtime business associate."}, {"c1d9": "Trump and his lawyers insist that the trust, coupled with Trump’s resignation from management positions within his businesses, is sufficient to separate him from his business interests. There are strong indications, however, that Trump’s separation from his businesses are just an illusion. His son Eric recently told Forbes that he would continue to give his father profitability reports as often as every quarter, despite promising not to discuss the business with him."}, {"4789": "And on Monday, ProPublica reported on changes to the structure of Trump’s trust, which explicitly make it easier for Trump to access it while president."}, {"43a9": "The new version of the trust, signed February 10th, was released last week by the General Services Administration as part of their decision into whether Trump’s downtown D.C. hotel is in violation of its government lease. Before, the trust didn’t include restrictions on when Trump, as the “exclusive beneficiary” of the trust, could access his money. The new language, however, expressly stipulates that Trump can draw from the trust at any time."}, {"9b14": "CREDIT: screenshot, GSA"}, {"f5b0": "Profits from Trump’s businesses pay into his trust, according to documentation provided to the GSA by the Trump organization. This language in his trust means he can effectively draw on profits from his businesses at any time, and he is not required to disclose when he does to the public."}, {"c4bd": "There’s also no guarantee the public will ever know: Trump could list the profits he draws from his trust on his next federal financial disclosure, but he’s not required to. He would be required to on his tax returns, however, he has thus far refused to release those to the public."}, {"4d80": "“For tax purposes, it’s as if the trust doesn’t exist at all,” said Steven Rosenthal, a senior fellow at the Urban-Brookings Tax Policy Center told ProPublica about the broad language of the trust. “It’s just an entity on paper, nothing more.”"}], "content": "Cities sick of Trump kleptocracy push for impeachment Cambridge, Massachusetts is the latest city to take up a vote. Rowers paddle down the Charles River near the campus of Harvard University in Cambridge, Mass. CREDIT: AP Photo/Charles Krupa While Republicans in Congress continue to drag their feet on official investigations of President Donald Trump’s numerous conflicts of interest and alleged Russian connections, some U.S. cities aren’t holding back. On Monday, city councilors in Cambridge, Massachusetts will vote on a resolution urging Congress to investigate whether grounds exist to impeach Trump for his violation of the Constitution’s emoluments clause. The clause, little known before Trump’s presidency, prohibits the president from accepting payments from foreign governments or from the federal or state governments other than his federal salary. “From the moment he took office, President Trump was in violation of the Foreign Emoluments Clause and the Domestic Emoluments Clause of the United States Constitution,” the resolution under consideration in Cambridge says. “These violations undermine the integrity of the Presidency, corruptly advance the personal wealth of the President, and violate the public trust.” If the proposal passes, Cambridge will join a handful of other cities calling for the president’s impeachment, including Berkeley, Alameda, and Richmond, California. These resolutions are largely symbolic; municipalities have no power to compel Congress to conduct investigations or impeachments. They are, however, part of a growing national drumbeat for answers regarding Trump’s business ties and the conflicts they pose for his presidency. Trump has violated his oath to the ConstitutionHis first act as President.thinkprogress.org As a luxury hotelier and property magnate, Trump’s businesses are practically tailor-made to accept payments from both foreign governments and domestic entities that have an interest in influencing the presidency, and which see funneling business to his company as one way to get in the president’s good graces. Just a block from the White House, his new downtown D.C. hotel has quickly become the new hot-spot for foreign embassy events, diplomats, and government officials and lobbyists, and the Trump organization has dozens properties and projects just like it around the world. Yet in defiance of the advice of the nonpartisan Office of Government ethics and prominent ethics experts, President Trump has refused to fully divest from his businesses. Instead of setting up an independent, blind trust as these experts advised, Trump instead has placed his assets into a revocable trust run by his sons and a longtime business associate. Trump and his lawyers insist that the trust, coupled with Trump’s resignation from management positions within his businesses, is sufficient to separate him from his business interests. There are strong indications, however, that Trump’s separation from his businesses are just an illusion. His son Eric recently told Forbes that he would continue to give his father profitability reports as often as every quarter, despite promising not to discuss the business with him. And on Monday, ProPublica reported on changes to the structure of Trump’s trust, which explicitly make it easier for Trump to access it while president. The new version of the trust, signed February 10th, was released last week by the General Services Administration as part of their decision into whether Trump’s downtown D.C. hotel is in violation of its government lease. Before, the trust didn’t include restrictions on when Trump, as the “exclusive beneficiary” of the trust, could access his money. The new language, however, expressly stipulates that Trump can draw from the trust at any time. CREDIT: screenshot, GSA Profits from Trump’s businesses pay into his trust, according to documentation provided to the GSA by the Trump organization. This language in his trust means he can effectively draw on profits from his businesses at any time, and he is not required to disclose when he does to the public. There’s also no guarantee the public will ever know: Trump could list the profits he draws from his trust on his next federal financial disclosure, but he’s not required to. He would be required to on his tax returns, however, he has thus far refused to release those to the public. “For tax purposes, it’s as if the trust doesn’t exist at all,” said Steven Rosenthal, a senior fellow at the Urban-Brookings Tax Policy Center told ProPublica about the broad language of the trust. “It’s just an entity on paper, nothing more.” ", "name": "461", "child": "461_1\t461_2\t461_3\t461_4\t461_5\t461_6\t461_7\t461_8\t461_9\t461_10\t461_11\t461_12\t461_13\t461_14\t461_15", "timestamp": "Apr 3"}