{"parent": "", "title": "Pence on Trump’s unprecedented conflicts of interest: ‘Who cares?’", "author": "Zack Ford", "sentences": [{"5f15": "Pence on Trump’s unprecedented conflicts of interest: ‘Who cares?’"}, {"dc84": "The Trump administration is shrugging off how much the Trump family plans to profit off the presidency."}, {"f1c1": "An Indian man reads news of Trump’s election. CREDIT: AP Photo/Mahesh Kumar A."}, {"5258": "Donald Trump may not be taking his $400,000 presidential salary, but his business meeting this week with Indian real estate developers suggests his company will profit far more just because he’s the president. Asked about this unprecedented conflict of interest Sunday morning on Fox News Sunday, Vice President-Elect Mike Pence shrugged it off, quoting Trump, “Who cares?”"}, {"904b": "Pence insisted that there would be a “legal” separation between the presidency and the Trump business, but host Chris Wallace pressed that it was more than a legal question. There was no response regarding that conflict. “The President-elect of the United States, Donald Trump, is completely focused on the people’s business,” Pence said, “and I promise you and I can assure the public that they’ll have the proper separation from their business enterprise.”"}, {"f161": "The exact opposite seems to be true. Trump’s meeting with three Indian executives to discuss their partnership with the Trump Organization had nothing to do with the transition. It was not about advancing the American people, but advancing Trump’s profits."}, {"9557": "According to interviews some of those execs gave in Indian papers, it had to do with how much more the Trump name is worth now that he’s been elected president. Many of the buildings that bear Trump’s name internationally are not actually owned by his businesses. Generally, his name is licensed by others to inflate their property value. As president, his name is worth more, so Trump stands to make more money from these licensing deals."}, {"b9fb": "A bank controlled by the Chinese government is helping make Trump richNope, no potential for corruption here.thinkprogress.org"}, {"05b1": "And that’s only the latest story this week about how the Trump family seems to be looking to capitalize on his election. When he met with Japanese Prime Minister Shinzo Abe on Thursday, he invited his daughter Ivanka to participate in the meeting. Though nepotism laws prevent Ivanka from taking a role in the White House, she will likely serve as acting CEO of Trump’s businesses, so her participation in a state meeting is a flagrant conflict of interest."}, {"70a0": "The line between his business and his duties as president is further blurred by the prospect that foreign diplomats might stay at the Trump Hotel in Washington, D.C. They could brag to Trump that they stayed there and fed into his profits in an attempt to literally buy his favor and the ability to influence him."}, {"dee7": "There have been many promises that there will be a separation between Trump’s presidency and his business holdings, but it’s essentially too late for any such promises to be reassuring. He’s continuing to hold meetings related to his business, and his kids, who were supposedly going to run the business without his involvement, are already participating in meetings related to his administration. Given the people in these business meetings already know he’s about to be president, the conflict of interest is already playing out. Trump is leveraging his election to make his company money across the world, and his administration literally doesn’t care."}], "content": "Pence on Trump’s unprecedented conflicts of interest: ‘Who cares?’ The Trump administration is shrugging off how much the Trump family plans to profit off the presidency. An Indian man reads news of Trump’s election. CREDIT: AP Photo/Mahesh Kumar A. Donald Trump may not be taking his $400,000 presidential salary, but his business meeting this week with Indian real estate developers suggests his company will profit far more just because he’s the president. Asked about this unprecedented conflict of interest Sunday morning on Fox News Sunday, Vice President-Elect Mike Pence shrugged it off, quoting Trump, “Who cares?” Pence insisted that there would be a “legal” separation between the presidency and the Trump business, but host Chris Wallace pressed that it was more than a legal question. There was no response regarding that conflict. “The President-elect of the United States, Donald Trump, is completely focused on the people’s business,” Pence said, “and I promise you and I can assure the public that they’ll have the proper separation from their business enterprise.” The exact opposite seems to be true. Trump’s meeting with three Indian executives to discuss their partnership with the Trump Organization had nothing to do with the transition. It was not about advancing the American people, but advancing Trump’s profits. According to interviews some of those execs gave in Indian papers, it had to do with how much more the Trump name is worth now that he’s been elected president. Many of the buildings that bear Trump’s name internationally are not actually owned by his businesses. Generally, his name is licensed by others to inflate their property value. As president, his name is worth more, so Trump stands to make more money from these licensing deals. A bank controlled by the Chinese government is helping make Trump richNope, no potential for corruption here.thinkprogress.org And that’s only the latest story this week about how the Trump family seems to be looking to capitalize on his election. When he met with Japanese Prime Minister Shinzo Abe on Thursday, he invited his daughter Ivanka to participate in the meeting. Though nepotism laws prevent Ivanka from taking a role in the White House, she will likely serve as acting CEO of Trump’s businesses, so her participation in a state meeting is a flagrant conflict of interest. The line between his business and his duties as president is further blurred by the prospect that foreign diplomats might stay at the Trump Hotel in Washington, D.C. They could brag to Trump that they stayed there and fed into his profits in an attempt to literally buy his favor and the ability to influence him. There have been many promises that there will be a separation between Trump’s presidency and his business holdings, but it’s essentially too late for any such promises to be reassuring. He’s continuing to hold meetings related to his business, and his kids, who were supposedly going to run the business without his involvement, are already participating in meetings related to his administration. Given the people in these business meetings already know he’s about to be president, the conflict of interest is already playing out. Trump is leveraging his election to make his company money across the world, and his administration literally doesn’t care. ", "name": "463", "child": "463_1\t463_2\t463_3\t463_4\t463_5\t463_6\t463_7\t463_8\t463_9", "timestamp": "Nov 20, 2016"}