{"parent": "", "title": "A government of thieves strikes Romania in the middle of the night", "author": "Andra Sonea", "sentences": [{"3db5": "A government of thieves strikes Romania in the middle of the night"}, {"dbe8": "In the middle of last night, while the free world has the attention focused on the attacks to their own democratic systems, Romanian government has shamefully passed an emergency law, the tool of choice of the authoritarians of the day. Tens of thousands of Romanians demonstrated for days in over 20 cities against this announced emergency law. They demonstrated even last night at -8C. Still, the government went ahead."}, {"ca76": "In brief the government modified the Criminal Code so that official misconduct in which the financial damage is valued at less than 200,000 lei ($47,800)per person !!! is not a crime anymore."}, {"56aa": "Bucharest, 31st of January 2017"}, {"be61": "This is just a quick note for those who ask me what is going on. In Romania, people know all these facts and so much more details than I do. Abroad, one could have access to very brief updates on this situation, which mostly hide the sheer greed, incompetence and abuse of the Romanian government."}, {"e224": "So briefly, my view of what is going on."}, {"6afd": "Following the Parliamentary Elections in December 2016 the “communists” won a massive vote. The campaign was not dissimilar with what we’ve seen in the West — fake news, lies, manipulation in various forms. For example, this clique split in 3 parties to give the impression of coverage of a wider political spectrum when everybody with an ounce of memory remembers they were the same party. Together they won over 50% of the vote."}, {"d3c8": "The main party is PSD — Social Democratic Party. Don’t let yourself to be misled by the name. There is nothing social or democratic about it. You can see their history here. Boring as you would expect. Some aspects are important though and they don’t make it on Wikipedia clearly enough."}, {"7d9b": "This is the party who took over in ’89 following the Romanian Revolution. Many of those killed at Revolution, own their death to this clique who wanted to give an appearance of legitimacy to their coup by creating terror and fear. We demonstrated against them for months in Piata Universitatii. We asked for a government without communists, not a big ask after 50 years of communist dictatorship. However, they were well known communists with important leading functions in the Communist Party. They squelched the demonstrations by bringing the miners from the mining areas with the clear mandate to beat the demonstrators. Mixed with people from former and actual political police “securitate”, this is what they did very effectively for 3 days. 13–15th of June are to this day days of mourning for me."}, {"d76e": "This party and the same group of people managed to stay in power. You’d say that people vote for them. It is true, many in the rural areas, many uneducated but also many who through stealing from state property became rich vote for them. Do not underestimate what 50 years of communism do to a country and its people. They don’t emerge from this with fresh minds. Many did not have the tools to defend their mind from propaganda. I may sound dismissive to them. I have little understanding for people who after years of deprivation of freedom, hunger, cold, humiliations and terror choose to be led by the same people. It is Stockholm syndrome at scale."}, {"956d": "Also, 2 million people have been killed by the communist in regime between ’47-’89 and 2 million people emigrated after ’89. In both cases the minds, professions and determination of these people mattered. They have been imprisoned because they stood for something or they left because they trusted they could do better elsewhere. In both cases these are elements who take a country forward."}, {"74e6": "There are many brave and courageous and smart people in Romania but the political machine supported by interestingly enough American mercenary election “advisors” knew how to manipulate the desperate and the poor."}, {"0774": "The emergency ordinance that the government passed last night modified the Criminal Code of the country so that the crimes that the party in power has committed will be erased. More specifically, they will decriminalize cases of official misconduct in which the financial damage is valued at less than 200,000 lei ($47,800). In other words people in public office are free to steal $47800 each — it is not even a crime!!"}, {"e5a0": "The PSD party members, who have been already condemned for theft under this “meagre” limit, will be freed. Moreover, the Head of the PSD party of government will be affected personally because he was being pursued in court for abuse in the office and all of a sudden his crime is not a crime."}, {"ecd6": "“This measure will render the anti-corruption fight irrelevant,” anti-corruption chief prosecutor Laura Codruta Kovesi told The Associated Press. Her Anticorruption Directorate had prosecuted 1,170 cases of abuse in office during the past three years with damages worth 1 billion euros ($1.07 billion). Through this ordinance, many of these people will be free and others will have a free licence for more abuse."}, {"8cd5": "We have seen a lot of abuses over the years, during the “official” communist regime and afterwards during the “unofficial” ones… Even by our standards this is way too much."}, {"9b2c": "How do you stop this? Demonstrating is not enough."}, {"414a": "Any ideas, please let me know."}, {"36ae": "Reuters on this here."}, {"8f94": "NYTimes on this here."}], "content": "A government of thieves strikes Romania in the middle of the night In the middle of last night, while the free world has the attention focused on the attacks to their own democratic systems, Romanian government has shamefully passed an emergency law, the tool of choice of the authoritarians of the day. Tens of thousands of Romanians demonstrated for days in over 20 cities against this announced emergency law. They demonstrated even last night at -8C. Still, the government went ahead. In brief the government modified the Criminal Code so that official misconduct in which the financial damage is valued at less than 200,000 lei ($47,800)per person !!! is not a crime anymore. Bucharest, 31st of January 2017 This is just a quick note for those who ask me what is going on. In Romania, people know all these facts and so much more details than I do. Abroad, one could have access to very brief updates on this situation, which mostly hide the sheer greed, incompetence and abuse of the Romanian government. So briefly, my view of what is going on. Following the Parliamentary Elections in December 2016 the “communists” won a massive vote. The campaign was not dissimilar with what we’ve seen in the West — fake news, lies, manipulation in various forms. For example, this clique split in 3 parties to give the impression of coverage of a wider political spectrum when everybody with an ounce of memory remembers they were the same party. Together they won over 50% of the vote. The main party is PSD — Social Democratic Party. Don’t let yourself to be misled by the name. There is nothing social or democratic about it. You can see their history here. Boring as you would expect. Some aspects are important though and they don’t make it on Wikipedia clearly enough. This is the party who took over in ’89 following the Romanian Revolution. Many of those killed at Revolution, own their death to this clique who wanted to give an appearance of legitimacy to their coup by creating terror and fear. We demonstrated against them for months in Piata Universitatii. We asked for a government without communists, not a big ask after 50 years of communist dictatorship. However, they were well known communists with important leading functions in the Communist Party. They squelched the demonstrations by bringing the miners from the mining areas with the clear mandate to beat the demonstrators. Mixed with people from former and actual political police “securitate”, this is what they did very effectively for 3 days. 13–15th of June are to this day days of mourning for me. This party and the same group of people managed to stay in power. You’d say that people vote for them. It is true, many in the rural areas, many uneducated but also many who through stealing from state property became rich vote for them. Do not underestimate what 50 years of communism do to a country and its people. They don’t emerge from this with fresh minds. Many did not have the tools to defend their mind from propaganda. I may sound dismissive to them. I have little understanding for people who after years of deprivation of freedom, hunger, cold, humiliations and terror choose to be led by the same people. It is Stockholm syndrome at scale. Also, 2 million people have been killed by the communist in regime between ’47-’89 and 2 million people emigrated after ’89. In both cases the minds, professions and determination of these people mattered. They have been imprisoned because they stood for something or they left because they trusted they could do better elsewhere. In both cases these are elements who take a country forward. There are many brave and courageous and smart people in Romania but the political machine supported by interestingly enough American mercenary election “advisors” knew how to manipulate the desperate and the poor. The emergency ordinance that the government passed last night modified the Criminal Code of the country so that the crimes that the party in power has committed will be erased. More specifically, they will decriminalize cases of official misconduct in which the financial damage is valued at less than 200,000 lei ($47,800). In other words people in public office are free to steal $47800 each — it is not even a crime!! The PSD party members, who have been already condemned for theft under this “meagre” limit, will be freed. Moreover, the Head of the PSD party of government will be affected personally because he was being pursued in court for abuse in the office and all of a sudden his crime is not a crime. “This measure will render the anti-corruption fight irrelevant,” anti-corruption chief prosecutor Laura Codruta Kovesi told The Associated Press. Her Anticorruption Directorate had prosecuted 1,170 cases of abuse in office during the past three years with damages worth 1 billion euros ($1.07 billion). Through this ordinance, many of these people will be free and others will have a free licence for more abuse. We have seen a lot of abuses over the years, during the “official” communist regime and afterwards during the “unofficial” ones… Even by our standards this is way too much. How do you stop this? Demonstrating is not enough. Any ideas, please let me know. Reuters on this here. NYTimes on this here. ", "name": "466", "child": "466_1", "timestamp": "Feb 1"}