{"parent": "", "title": "America’s Leading Mindset Expert Attacked by Feral Mob, Maintains Emotional Control", "author": "Mike Cernovich", "sentences": [{"31ba": "America’s Leading Mindset Expert Attacked by Feral Mob, Maintains Emotional Control"}, {"95ca": "“Bill Clinton is a rapist,” mindset expert and journalist Mike Cernovich declared during an anti-Trump rally in Austin, Texas. The mob rushed the stage, screaming at and attacking him. Cernovich never lost his emotional control, even after he was sucker punched."}, {"0e40": "Look at how angry these people are. Watch Cernovich keep his cool. His haters do not have emotional control, they lack Gorilla Mindset."}, {"26fb": "Hundreds of people screamed at Cernovich and menaced him."}, {"b18b": "These are not normal or psychologically healthy people."}, {"a855": "Cernovich caught the angry mob on film. Watch how feral they are. These are not normal people. They are in a cult."}, {"5e99": "Mike Cernovich was sucker punched. Cernovich took reasonable measures to defend himself."}, {"2353": "Journalist Joe Biggs caught the attack on film."}, {"b97b": "Cernovich said the attack on him is why he does journalism. “A journalist’s job is to report the truth. My lengthy live streams are unedited and show the truth to the people.”"}, {"23ae": "— — —"}, {"1a7b": "Mike Cernovich is one of America’s leading journalists. You can support his work here today."}], "content": "America’s Leading Mindset Expert Attacked by Feral Mob, Maintains Emotional Control “Bill Clinton is a rapist,” mindset expert and journalist Mike Cernovich declared during an anti-Trump rally in Austin, Texas. The mob rushed the stage, screaming at and attacking him. Cernovich never lost his emotional control, even after he was sucker punched. Look at how angry these people are. Watch Cernovich keep his cool. His haters do not have emotional control, they lack Gorilla Mindset. Hundreds of people screamed at Cernovich and menaced him. These are not normal or psychologically healthy people. Cernovich caught the angry mob on film. Watch how feral they are. These are not normal people. They are in a cult. Mike Cernovich was sucker punched. Cernovich took reasonable measures to defend himself. Journalist Joe Biggs caught the attack on film. Cernovich said the attack on him is why he does journalism. “A journalist’s job is to report the truth. My lengthy live streams are unedited and show the truth to the people.” — — — Mike Cernovich is one of America’s leading journalists. You can support his work here today. ", "name": "482", "child": "482_1\t482_2\t482_3\t482_4\t482_5\t482_6\t482_7\t482_8\t482_9\t482_10\t482_11", "timestamp": "Apr 15"}