{"parent": "", "title": "Bannon’s decline isn’t the end of the White House’s ‘alt-right’", "author": "Ned Resnikoff", "sentences": [{"8b62": "Bannon’s decline isn’t the end of the White House’s ‘alt-right’"}, {"1580": "Same white nationalism, different white nationalist."}, {"dca0": "Stephen Miller, senior adviser to President Donald Trump arrives for a meeting with business leaders in the Roosevelt Room of the White House in Washington, Monday, Jan. 30, 2017. CREDIT: AP Photo/Evan Vucci"}, {"b93f": "President Donald Trump’s top adviser, former Breitbart CEO Steve Bannon, is widely viewed as the leader of the administration’s “nationalist-populist” wing — a more palatable euphemism for the white nationalist coterie that tried to block travel to the U.S. from seven Muslim-majority countries and is currently spearheading a deportation spree across the United States."}, {"1bf6": "As Bannon’s influence within the administration has diminished, many commentators have taken this as a sign that his ideology has also fallen out of favor with the president, to be replaced by the ostensible technocratic moderation of son-in-law-in-chief Jared Kushner."}, {"2aec": "But Bannon isn’t the only apostle of Bannonism in the White House. And as his star fades, the power of another extreme nationalist seems to be growing."}, {"37c6": "On Thursday night, Politico reported that senior adviser Stephen Miller “has managed to endear himself” to Kushner and is now “working closely with Kushner’s Office of American Innovation.” Up until now, Miller’s biggest policy achievement was helping to draft both versions of Trump’s Muslim ban executive order — and then inadvertently sinking the second ban’s chances of surviving a legal challenge by announcing on national television that both orders had the same intent."}, {"c836": "Don’t be fooled by Trump’s latest ‘pivot’Team Bannon might not be steering Sino-American diplomacy, but they’re winning on immigration policy.thinkprogress.org"}, {"9c42": "Miller — a protege of Attorney General Jeff Sessions, another member of the administration’s hard line ethno-nationalist camp — also wrote both Trump’s inaugural “American carnage” address, and, reportedly, his “I alone can fix it” speech to the Republican National Convention."}, {"4b7f": "If Miller is gaining more sway over the administration’s policy agenda, then Bannon’s apparent demotion means little. The Pepe brigade still has plenty of friends in the West Wing."}], "content": "Bannon’s decline isn’t the end of the White House’s ‘alt-right’ Same white nationalism, different white nationalist. Stephen Miller, senior adviser to President Donald Trump arrives for a meeting with business leaders in the Roosevelt Room of the White House in Washington, Monday, Jan. 30, 2017. CREDIT: AP Photo/Evan Vucci President Donald Trump’s top adviser, former Breitbart CEO Steve Bannon, is widely viewed as the leader of the administration’s “nationalist-populist” wing — a more palatable euphemism for the white nationalist coterie that tried to block travel to the U.S. from seven Muslim-majority countries and is currently spearheading a deportation spree across the United States. As Bannon’s influence within the administration has diminished, many commentators have taken this as a sign that his ideology has also fallen out of favor with the president, to be replaced by the ostensible technocratic moderation of son-in-law-in-chief Jared Kushner. But Bannon isn’t the only apostle of Bannonism in the White House. And as his star fades, the power of another extreme nationalist seems to be growing. On Thursday night, Politico reported that senior adviser Stephen Miller “has managed to endear himself” to Kushner and is now “working closely with Kushner’s Office of American Innovation.” Up until now, Miller’s biggest policy achievement was helping to draft both versions of Trump’s Muslim ban executive order — and then inadvertently sinking the second ban’s chances of surviving a legal challenge by announcing on national television that both orders had the same intent. Don’t be fooled by Trump’s latest ‘pivot’Team Bannon might not be steering Sino-American diplomacy, but they’re winning on immigration policy.thinkprogress.org Miller — a protege of Attorney General Jeff Sessions, another member of the administration’s hard line ethno-nationalist camp — also wrote both Trump’s inaugural “American carnage” address, and, reportedly, his “I alone can fix it” speech to the Republican National Convention. If Miller is gaining more sway over the administration’s policy agenda, then Bannon’s apparent demotion means little. The Pepe brigade still has plenty of friends in the West Wing. ", "name": "485", "child": "485_1\t485_2\t485_3\t485_4\t485_5", "timestamp": "Apr 14"}