{"parent": "", "title": "You’ll Change Your Mind", "author": "Ariel Bethencourt", "sentences": [{"3a33": "You’ll Change Your Mind"}, {"fb86": "Like it or not, not every woman needs to be a mother"}, {"e5e5": "It’s difficult to write this without having a certain tone."}, {"2ddb": "One that is either defensive, aggressive or too light. I’ve found that when I express this opinion, I’m generally met with surprise and patronizing remarks. I don’t want to be defensive, and I don’t think any woman (or man) in my position should have to be. I would like to think it’s not keeping any one awake at night but it seems like it might be."}, {"b0ff": "I’m a woman and I don’t want children."}, {"c969": "I’ve known this for a while now — basically since the day I was born. I may be exaggerating that part. But I did know it at a very young age — even at that time I didn’t like other children. I have never had a moment where I thought it might be an okay idea and I’m not even the type to be the cliche cool aunt. I do not want to adopt or foster, and I certainly will not be using my uterus as a figurative oven. I do not hate children; I think some can be charming, well-mannered, and adorable. And then there are others who are down-right obnoxious, but I suppose that isn’t really a reflection on them. Unfortunately as with many things in this world, just because you can do it, doesn’t mean you should."}, {"ea27": "It’s hard to express my viewpoints about having children when the majority of people around the world view becoming a parent as an indisputable part of life. I’ve had many negative reactions, but I can only count on one hand the positive ones I’ve had. I’ve even had romantic relationships end because of it. Even though I’m upfront about my opinions it seems that the majority of people always think the same thing: I’ll change my mind."}, {"2b66": "Courtesy of Gallup"}, {"3d74": "I’m not going to change my mind, and I’m beginning to wonder at what age that response will stop. To many, I’m selfish, immature and apparently will never feel what real love is. It is a constantly belittling and condescending conversation that I honestly try to avoid. If I’m asked when I plan on having any, I reply, “ I don’t.” I don’t need pity because it’s very simple; it’s just not for me."}, {"a61d": "The decision to be child-free is a life altering and important one, but the responses the conversation elicit remind me of something of a smaller (to some) scale. When I’m asked if I would like any meat, as a vegetarian my natural response is no, thank you. If asked why (which I generally am) I tell them that I do not eat meat."}, {"ea9b": "I feel that my decision not to eat meat is a very singular one, unless of course I have been invited to a dinner party, or find myself in the company of cannibals. Since I also consider myself to be as polite as a saint, I always tell my hosts of my dietary restrictions and rarely keep company with individuals who are in danger of contracting Kuru disease. Yet many meat-eaters I’ve encountered are continuously offended by my dietary choices. Just stop asking."}, {"419b": "Anything outside of what is considered normal, is met with resistance. But with the way society is at the current time, I had assumed that it might have at least been hip by now. People I have talked to become defensive, as if they need to argue or change my mind. I hear, “well you wouldn’t be here if it weren’t for your parents,” or “but what will you do with your life?” I plan on living it exactly as I want to, and not waking up on Saturdays at 6 AM to someone projectile vomiting on me. Unless I might have had too many the night before."}, {"ee5f": "After the initial defensive statements the next question is “well, why not?” Well why does anyone avoid doing things they don’t want to do? Having a child is in no way trivial, but it’s also not for everyone."}, {"125d": "It’s not for shock value and it’s not to avoid responsibility. It’s also not because of the state of the world today, nor does it have anything to do with global warming or a terrible past. It’s just because it’s not right for me."}, {"a213": "Some people seem to be genuinely worried for me. Or believe it’s their personal mission to save a life that must obviously be in shambles. They see a bleak and loveless future, devoid of human contact where I’m eaten alive by my many cats."}, {"2992": "They wonder what I’ll do with myself when I’m old, or how I’ll fit into a group of people who will have moved on to living life as parents. But I do have a plan, one that may seem surprising and far fetched: I’ll save my money for a nursing home. Where I’ll hope like everyone else that it doesn’t turn out to be some sick elderly Thunderdome. Children aren’t safety nets. There is no guarantee of a committed relationship, no one knows what will happen. Worrying about my financial security at the age of ninety is a ridiculous reason to have a child, and one might even say it is a selfish one. The last part was sarcasm."}, {"8b5a": "Having a child for any reason other than because you genuinely want to is wrong in my eyes. Yes, mistakes can happen, but if you genuinely want the child, that’s the important part. I hope that no one is convinced to do something they do not want. Not to fit in, social pressure or to keep a relationship."}, {"cad7": "Not wanting a child is a tough decision to make. It alienates you from a large number of people. In reality it takes a strong person, man or woman, to admit that they don’t want something just because everyone else does. It also takes a strong person to make meaning in their own lives in ways others may not consider conventional. I’m forever grateful that I was brought into this world, mostly because I’m not sure what the other options were, but also because I like living life. I find meaning in life every day, have wonderful relationships and am with someone who has the same viewpoints as me. I also have only one cat. So I’m child-free and you don’t need to worry about me."}, {"6a5c": "Ariel is a twenty-something with a love for sarcasm, reading and a good beer. She loves writing and is finally at a point where she’s brave enough to share some of it. You can follow Ariel on her Instagram."}], "content": "You’ll Change Your Mind Like it or not, not every woman needs to be a mother It’s difficult to write this without having a certain tone. One that is either defensive, aggressive or too light. I’ve found that when I express this opinion, I’m generally met with surprise and patronizing remarks. I don’t want to be defensive, and I don’t think any woman (or man) in my position should have to be. I would like to think it’s not keeping any one awake at night but it seems like it might be. I’m a woman and I don’t want children. I’ve known this for a while now — basically since the day I was born. I may be exaggerating that part. But I did know it at a very young age — even at that time I didn’t like other children. I have never had a moment where I thought it might be an okay idea and I’m not even the type to be the cliche cool aunt. I do not want to adopt or foster, and I certainly will not be using my uterus as a figurative oven. I do not hate children; I think some can be charming, well-mannered, and adorable. And then there are others who are down-right obnoxious, but I suppose that isn’t really a reflection on them. Unfortunately as with many things in this world, just because you can do it, doesn’t mean you should. It’s hard to express my viewpoints about having children when the majority of people around the world view becoming a parent as an indisputable part of life. I’ve had many negative reactions, but I can only count on one hand the positive ones I’ve had. I’ve even had romantic relationships end because of it. Even though I’m upfront about my opinions it seems that the majority of people always think the same thing: I’ll change my mind. Courtesy of Gallup I’m not going to change my mind, and I’m beginning to wonder at what age that response will stop. To many, I’m selfish, immature and apparently will never feel what real love is. It is a constantly belittling and condescending conversation that I honestly try to avoid. If I’m asked when I plan on having any, I reply, “ I don’t.” I don’t need pity because it’s very simple; it’s just not for me. The decision to be child-free is a life altering and important one, but the responses the conversation elicit remind me of something of a smaller (to some) scale. When I’m asked if I would like any meat, as a vegetarian my natural response is no, thank you. If asked why (which I generally am) I tell them that I do not eat meat. I feel that my decision not to eat meat is a very singular one, unless of course I have been invited to a dinner party, or find myself in the company of cannibals. Since I also consider myself to be as polite as a saint, I always tell my hosts of my dietary restrictions and rarely keep company with individuals who are in danger of contracting Kuru disease. Yet many meat-eaters I’ve encountered are continuously offended by my dietary choices. Just stop asking. Anything outside of what is considered normal, is met with resistance. But with the way society is at the current time, I had assumed that it might have at least been hip by now. People I have talked to become defensive, as if they need to argue or change my mind. I hear, “well you wouldn’t be here if it weren’t for your parents,” or “but what will you do with your life?” I plan on living it exactly as I want to, and not waking up on Saturdays at 6 AM to someone projectile vomiting on me. Unless I might have had too many the night before. After the initial defensive statements the next question is “well, why not?” Well why does anyone avoid doing things they don’t want to do? Having a child is in no way trivial, but it’s also not for everyone. It’s not for shock value and it’s not to avoid responsibility. It’s also not because of the state of the world today, nor does it have anything to do with global warming or a terrible past. It’s just because it’s not right for me. Some people seem to be genuinely worried for me. Or believe it’s their personal mission to save a life that must obviously be in shambles. They see a bleak and loveless future, devoid of human contact where I’m eaten alive by my many cats. They wonder what I’ll do with myself when I’m old, or how I’ll fit into a group of people who will have moved on to living life as parents. But I do have a plan, one that may seem surprising and far fetched: I’ll save my money for a nursing home. Where I’ll hope like everyone else that it doesn’t turn out to be some sick elderly Thunderdome. Children aren’t safety nets. There is no guarantee of a committed relationship, no one knows what will happen. Worrying about my financial security at the age of ninety is a ridiculous reason to have a child, and one might even say it is a selfish one. The last part was sarcasm. Having a child for any reason other than because you genuinely want to is wrong in my eyes. Yes, mistakes can happen, but if you genuinely want the child, that’s the important part. I hope that no one is convinced to do something they do not want. Not to fit in, social pressure or to keep a relationship. Not wanting a child is a tough decision to make. It alienates you from a large number of people. In reality it takes a strong person, man or woman, to admit that they don’t want something just because everyone else does. It also takes a strong person to make meaning in their own lives in ways others may not consider conventional. I’m forever grateful that I was brought into this world, mostly because I’m not sure what the other options were, but also because I like living life. I find meaning in life every day, have wonderful relationships and am with someone who has the same viewpoints as me. I also have only one cat. So I’m child-free and you don’t need to worry about me. Ariel is a twenty-something with a love for sarcasm, reading and a good beer. She loves writing and is finally at a point where she’s brave enough to share some of it. You can follow Ariel on her Instagram. ", "name": "487", "child": "487_1\t487_2\t487_3\t487_4\t487_5\t487_6\t487_7\t487_8\t487_9\t487_10\t487_11\t487_12\t487_13\t487_14\t487_15\t487_16\t487_17\t487_18\t487_19\t487_20\t487_21\t487_22\t487_23\t487_24\t487_25487_1\t487_2\t487_3\t487_4\t487_5\t487_6\t487_7\t487_8\t487_9\t487_10\t487_11\t487_12\t487_13\t487_14\t487_15\t487_16\t487_17\t487_18\t487_19\t487_20\t487_21\t487_22\t487_23\t487_24\t487_25", "timestamp": "Apr 4"}