{"parent": "", "title": "Mentored by the biggest star in the world: Inside Steve McQueen’s ‘Adam at 6 A.M.’", "author": "Jeremy Roberts", "sentences": [{"6448": "Mentored by the biggest star in the world: Inside Steve McQueen’s ‘Adam at 6 A.M.’"}, {"47c5": "Closely resembling twenty-tens superstar Scarlet Johansson is a stunning shot of then struggling actress Lee Purcell modeling in Los Angeles circa 1967. Purcell was part of Screen Gems Studios’ New Talent program until she earned her big break in “Adam at 6 A.M.” with Michael Douglas. Image Credit: Photography by Harry Langdon"}, {"78ba": "According to a bipartite interview debuting exclusively today, Lee Purcell got her first big Hollywood break on account of Steve McQueen. When the undisputed King of Cool decided to implement near-absolute creative control over his movie career, he and veteran producer Robert Relyea established Solar Productions in 1966."}, {"e0a3": "The resounding critical and commercial success of the action-packed, Solar-sanctioned Bullitt two years later may well have given McQueen the ultimate incentive to fashion a character study with modest box office aspirations that he would not appear in."}, {"07e9": "After an arduous audition process that saw somewhere in the neighborhood of 500 young women vying for the coveted part of high school cheerleader “Jerri Jo Hopper,” McQueen personally hand-picked Purcell as one of the fresh-faced stars of Adam at 6 A.M."}, {"5469": "Auditioning multiple times, requesting an unheard-of second script read through after leaving the building, cutting her long, parted straight down the middle Hippie hairstyle into ostentatious bangs, conquering the small town Missouri dialect, and memorizing the entire script no doubt proved McQueen’s decision to cast the ballsy, determined actress was right on the money."}, {"306a": "Michael Douglas, in only his second major screen appearance, rendered the California cool, albeit spiritually unfulfilled college semantics professor Adam Gaines, who drives cross country in a cherry red Porsche 911 to reconnect with his family origins in Missouri."}, {"eb15": "While not exactly penning a glowing review, the New York Times’ Vincent Canby reserved notable praise for Purcell’s screen debut, saying that the ingénue “is absolutely right, down to the slightest pout, as ‘Jerri Jo,’ the kind of girl who doesn’t think you should go all the way on a first date.”"}, {"5989": "The review must have given McQueen immense satisfaction. One year before the film’s September 1970 release, he prudently revealed while introducing Purcell before a packed press conference at Solar’s Studio City corporate offices that “there’s a basic honesty and believability in Lee…I think this girl and the picture are both going to be hits.”"}, {"400c": "Purcell has acted in countless films and television over a distinguished 50-year career, encompassing Peggy in the cult surfing classic Big Wednesday, Susan in the hilarious Gene Wilder-Richard Pryor mash-up Stir Crazy, seductive step-mom Beth in Nicolas Cage’s career-making Valley Girl, strong-willed state’s attorney Louise St. Laurent in the award-winning Due South series, and Francine Gingerfield, the sole surviving world political leader in the horror comedy Kids vs. Monsters costarring Malcolm McDowell."}, {"dc39": "The supremely gifted actress is eternally grateful that her life’s journey intertwined with the King of Cool. To revisit Part One of the conversation, “To Jump off the Cliff into an Abyss: A Life’s Work with Emmy Nominee Lee Purcell,” simply click on the highlighted link where Purcell’s juicy anecdotes abound regarding Kirk Douglas, James Garner, Andy Griffith, Michael Landon, Warren Oates, and David Carradine. Otherwise, the Big Wednesday starlet’s detailed tribute to her favorite mentor accelerates now."}, {"9c66": "In matching fashionable Age of Aquarius threads, Steve McQueen introduces a fresh-faced Lee Purcell to the world during a press conference at his Solar Production offices in Studio City, California — site of the old Republic B-Western studios — circa September 19, 1969. Image Credit: United Press International"}, {"1dcc": "The Lee Purcell Interview [Part Two]"}, {"8526": "How did legendary actor Steve McQueen enter your orbit in 1969?"}, {"2a01": "He jump-started my career, as I was a struggling young actress at the time. The path which led me to Steve was an odd series of events, in so many ways. I had not done a film before and didn’t even have a theatrical agent when I was cast in his film Adam at 6 A.M."}, {"7fd1": "At the time, I was studying acting, and modeling through my agent, Nina Blanchard, and I also had a commercial agent, Bill Cunningham. One day, Bill called and told me I should audition for a film, Adam at 6 A.M., that Steve McQueen’s company, Solar Productions, was doing."}, {"da85": "Getting a film audition through a commercial agent is not the customary way of doing business, since commercial agents do not represent actors for films. It was extremely odd for Bill to know about this film and to be able to get me an audition for it."}, {"67af": "What might seem even more odd to people was that I turned down the audition, as I didn’t feel I was ready to audition for a starring role. However, Bill was persistent, and he kept calling me about it and finally convinced me I should read the script anyway. So, I did, and I thought Bill was right."}, {"550f": "Another odd note was that I’d also been studying Standard American Speech with Professor Morris Cohen. Through hard work and practice, I had finally managed to get rid of my stutter, learn proper voice placement, and accent-free diction, instead of the hodge-podge of accents that I originally had."}, {"f160": "And then, of course, the first thing Bill told me to do for the audition was to go back to Prof. Cohen to learn an authentic Missouri accent. I didn’t know at the time that I was about to embark on a series of nerve-wracking auditions over a period of months and that my life was about to completely change for the better."}, {"881a": "Were you very cognizant of McQueen’s career when you first met?"}, {"7d74": "Another odd, but strangely advantageous situation, was that I wasn’t very familiar with Steve, as he was of my parents’ generation. I’m not sure I had even seen any of his films at the time."}, {"e3d1": "That turned out to be a good thing, as I had absolutely no intimidation when I met him. If I had really known how huge a global movie star he was, I probably would have been a nervous wreck. He was the biggest star in the world at the time."}, {"816f": "Just before signing up for a brief stint on NBC’s science fiction-soaked “Persons Unknown” 2010 drama, Lee Purcell is captured in an appealing studio portrait. Image Credit: Courtesy of Lee Purcell"}, {"8449": "What was the significance of Screen Gems Studios’ New Talent program to your career?"}, {"a7fa": "Very early in the very long audition process for Adam, I had met with the casting agent Eddie Foy, who was the talent scout for Screen Gems Studios’ New Talent program."}, {"a669": "At that time, several of the studios had talent development programs to discover young, inexpensive talent that they could sign for a very low weekly wage and put into their film and TV projects and not have to pay them anything more than the weekly stipend."}, {"46e8": "If one of their New Talent actors hit the big time, the studio could then loan them out to other companies, collect a loan-out fee from the other studio, and still only have to pay the actors the small weekly salary. This was about 20 years after the old, very expensive, star-grooming studio system had been abolished and the new system was a completely different model."}, {"f295": "Even though we received no grooming or lessons or any of the perks that earlier generations of actors in the studio systems had received, it was still very advantageous in that we got to be on film and received a “pedigree” in that Fox, Columbia, Universal or Screen Gems, etc. had given their stamp of approval to us."}, {"c0c7": "A lot of us who have gone on to have lengthy careers were in these New Talent programs: me, Tom Selleck, the late Farrah Fawcett, Sharon Gless, etc."}, {"0edb": "Before I was signed to the Screen Gems program, I told them that I was already in the audition process for this new film, Adam at 6 A.M., and asked to have that one film excluded from my deal, and to please have a legal way out of the overall contract without penalty."}, {"1a26": "They surprisingly agreed, and they started me out with one line in one episode in one of their TV series [Author’s Note: Starring Eleanor Parker, Peter Haskell, and Leslie Nielsen as the titular character, Bracken’s World was a short-lived series about a powerful Hollywood studio mogul and his bevy of gorgeous starlets that is perhaps best known for replacing the iconic Star Trek in NBC’s fall lineup. In a case of life imitating art, Purcell was cast as a young acting student in the “Don’t You Cry for Susannah” episode, broadcast on October 10, 1969]."}, {"2d76": "Since my Adam at 6 A.M. series of auditions went on for a long time, this was all happening simultaneously. Everyone was very cooperative. I didn’t know how unusual and how incredibly generous this was until years later."}, {"4e44": "Safe in the arms of the one she loves: A still taken from “Adam at 6 A.M.” featuring debut leading lady Lee Purcell [Jerri Jo Hopper] and Michael Douglas [Adam Gaines] — in only his second starring film role after 1969’s “Hail, Hero!” — released in September 1970 via Steve McQueen’s Solar Productions. Critic Leonard Maltin felt the underrated movie gave “a rare, genuine feeling for the Midwest.” Image Credit: Photography by Kenny Bell / CBS / Paramount / IMDB"}, {"a8f5": "What do you remember regarding your Adam at 6 A.M. debut audition?"}, {"3b32": "It was clear that this was the big time, but because of the casual atmosphere of Solar and Steve’s “everyman” personality, it didn’t really feel that way."}, {"6403": "The building where those first auditions took place is in the front of the CBS building today in the San Fernando Valley. Steve and his Solar Productions had their beautifully decorated offices there. Steve parked his car in the back, the same place where I was told to park mine. He never demanded a special parking place or a valet. He just parked his own car."}, {"14df": "The audition process was long and grueling, as it was a culling and winnowing process of many, many actresses. If I recall correctly, I had five auditions as I worked my way up the ladder to receive the final screen test. There were around 500 women who auditioned for the role of “Jerri Jo Hopper,” because everybody in town, and nationwide, whether they were known or unknown, was seen for that role."}, {"bdfc": "We would audition, and then either be eliminated or make it to the next round — think American Idol, but with no salary, no fame, no perks and no screen time unless you got the job — then the remaining actresses would get notes from the director, Bob Scheerer, and return days or weeks later to go the next round."}, {"83a1": "I remember after my first, maybe second, audition, on my way out of the building, I had a different idea as to how to do the scene, so I spun around, went back in, and asked to read again. Another actress was already in the audition room reading, so I had to wait."}, {"2ce6": "Asking to read again was unheard of, but they let me read again. When I got the role later, I was told that I had saved myself from early elimination by having the courage to do that, and by then delivering a better reading."}, {"ece1": "So, I moved on to the next round. Time passed, and the process went on and on, more actresses were eliminated, and I managed to hang in there. I was still tied to Screen Gems, but they had agreed to release me entirely if I got the film."}, {"3b4b": "This was incredibly generous of SG, as it meant I would not be a loan-out to Solar, so SG would not collect my salary from Adam, and I would get my entire salary from the film. Of course, I would have done the film for free and worked for free for Screen Gems as well!"}, {"aebb": "One day, thinking about the role, I was pondering myself in the mirror and thought “This is not the hairstyle that ‘Jerri Jo Hopper’ would wear.” I had the popular hairstyle of the day, very long, parted straight down the middle, standard hippie-actress style."}, {"5b02": "But, the character in the film was a small-town Missouri high school cheerleader. So, I grabbed the scissors and chopped off my hair and cut thick, chunky bangs. When I went in for the next audition, everyone got so excited about my new look, even though it was a very bad haircut!"}, {"4e2b": "By changing my hair, I suddenly embodied the character and had also differentiated myself from the rest of the remaining actresses. In addition to that, I kept working and working on the role, the Missouri accent, and all the scenes. By the time I finished with the auditions, I had the entire script memorized, including all of the screen directions and everyone’s lines, not just mine."}, {"bb49": "In between starring in “The Reivers” and “Le Mans,” 39-year-old Steve McQueen opted to produce “Adam at 6 A.M,” directed by television journeyman Robert Scheerer. McQueen is seen here attending the official press junket announcing Lee Purcell as the costar of “Adam at 6 A.M.” circa September 19, 1969. Image Credit: Globe Photos"}, {"d621": "Was your initial meeting with McQueen “normal?”"}, {"8ead": "Odd would describe it more accurately. Early in the process, perhaps after one general audition or so, I received a call on a Saturday morning from someone at Solar Productions. I had just come in from gardening, and I was grimy and dirty, and they told me to come over right away. I lived nearby."}, {"c44c": "I said, “Can I at least take a shower?” and they said, “No, come right now.” I didn’t think much of it. I thought I was just going in to probably pick up some more script pages — no email in those days; you had to drive somewhere to pick up anything; unless you were a big star, then the pages would be delivered — from the reception desk and wouldn’t even see anyone."}, {"006b": "So I grabbed my car keys and went with dirty nails and dirty gardening clothes, and little did I know it, but this was to be my introduction to Steve McQueen. He didn’t care; he was so down to earth. He wasn’t like other people. The earthier and grittier you were, the happier he was."}, {"ad80": "At this point, I didn’t have the role, but I thought I might have a chance since Steve wanted to meet me. He and I just chatted and chatted, and he didn’t make me feel as if I was being interviewed or judged. He would ask me interesting questions that had nothing to do with the role or the film."}, {"b132": "What kind of interesting questions are we talking about?"}, {"e152": "For example, Steve wanted to know whether other women liked me. I replied, “I don’t think so.” Such naïveté on my part to give such an answer, but I was young. He must have liked the answer, as he later quoted it to the press."}, {"9ae1": "I have always thought he asked it to test my honesty, as he was always testing people’s honesty. He was so easy to talk to that I was completely honest about everything."}, {"f511": "Steve also asked me about my upbringing, motorcycle, and cars, not just shallow, social questions that one asks to be conversational. His questions were more personal and insightful."}, {"e431": "Steve McQueen and beaming apprentice Lee Purcell hang out inside the King of Cool’s Solar offices in Studio City, California — site of the old Republic B-Western studios — after announcing the production of “Adam at 6 A.M.” circa September 19, 1969. Image Credit: Photography by Nate Cutler / Globe Photos / ImageCollect"}, {"4284": "Did McQueen ever take you for a drive?"}, {"8efc": "The only time I ever felt put on the spot by Steve, and I knew it was a test, was in a car one day with him. Once he figured out you had talent, that part was over with, but then he tested you as a human being."}, {"db15": "We were in his car, and he started driving really, really fast. I think it was a Porsche, and it had a very loud engine. He was yelling over the engine, and I would have to yell back my response. By this time, I knew him a little better, and I knew he was testing me, because he was watching my reactions, and I knew that I should show no fear."}, {"a07a": "And I didn’t, but my heart was pounding as I silently wondered, “Am I going to die here?” I guess I passed the test. He liked the fact that I also drove fast and thought it was great that I was an adrenaline junkie like him."}, {"9d45": "I rode a Honda 750 motorcycle at the time. It was a huge bike for me, as I was a skinny girl, but I had gotten a really good deal on it. Steve thought it was absolutely hilarious that I was riding this huge bike! Especially when I told him that if the bike fell down, I couldn’t pick it up, but had to ask strangers on the street to help me."}, {"0f46": "A lobby card taken from “Adam at 6 A.M.” featuring actress Lee Purcell and Michael Douglas at the beginning of their illustrious movie careers, released in September 1970 via Steve McQueen’s Solar Productions. Image Credit: Photography by Kenny Bell / CBS / Paramount"}, {"2162": "How difficult was your screen test?"}, {"fb57": "My screen test was truly a test of willpower and nerves. It was a “feet to the fire” sort of experience. They had narrowed the field down from 500 actresses to a handful. What’s odd is that they crammed us all in the same car — hip-to-hip in the back seat — all competitors, and took us to a movie studio ranch."}, {"0db6": "All of these nervous young ladies were sitting in the back seat of this car, and in the front seat were the very nice producers Rick Rosenberg and Bob Christiansen. All I could do was bravado my way through it or act nervous, and I really wasn’t all that nervous but more shell-shocked. So, I chose bravado."}, {"9588": "I remember Rick Rosenberg turned around, looking at us young hopefuls jammed in the back, and he was making small talk, being very kind. When he asked me, “How are you doing, Lee? Are you nervous?” I said, “I’m not nervous. I’ve already packed my bags to go do the film.”"}, {"7ca0": "Needless to say, there was shocked silence. It was just bravado…my bags weren’t packed, but I just needed to say or do something to show that I was strong and confident."}, {"b1fd": "We arrived to an open ranch area that was very beautiful, where a lot of exteriors for movies were shot, to shoot our scenes with the handsome young actors. What was really strange was that we shot our scenes outside while the other actresses just stood around and watched until it was their turn."}, {"f949": "Normally, one waits in a waiting room or a green room. But, this was a ranch, so there was nowhere to wait, nor anywhere to sit. So, everyone had to lean on trees or sit on fallen logs when they weren’t on camera as there wasn’t anywhere else to sit once you were out of the car. It was bizarre, and it’s just not done today…and I’ve never done an audition like that since."}, {"6a30": "Then we all got back in the car and drove back to the office together. I was very desperate for the role and had not slept at all the night before. So, all the way back in the crowded car, I kept saying to myself, “I have to get this role. I just have to get it…if I don’t, I’m probably going to starve.” I was in a difficult position financially — which was worsening — so it was do or die."}, {"46f9": "Take these chains from my heart: As disillusioned Golden State semantics professor Adam Gaines, AFI Life Achievement Award winner Michael Douglas decides to attend his great aunt’s funeral in Missouri and reassess life. There he encounters the innocent, enthusiastic Jerri Jo Hopper [Lee Purcell]. “Adam at 6 A.M.” was distributed with minimal fanfare on September 22, 1970, and sank into obscurity. While released on VHS in 1990, the romantic drama has yet to see a DVD or Blu-ray edition. Image Credit: Photography by Kenny Bell / CBS / Paramount / Historic Images"}, {"2a38": "What did you do when you learned that you had won the coveted part?"}, {"ee7c": "I called my grandmother and asked her to get the other family members to gather around the phone together. When they did, I said “You’re speaking to ‘Jerri Jo Hopper.’ I got the part!” It was such a moment. You only have a moment like that once as an actress. That first break is something you never forget. Everything else is gravy, but that first break is magical."}, {"4a9d": "Now that I had the role, Steve began to mentor me in earnest, as he tried to prepare me for the film and the press. He was such a multi-tasker, as he was planning the Le Mans film at the same time, had a family, the production company, and other films and a million other things."}, {"2db5": "But, he still found the time to be very involved mentoring me and planning how I should look. He made me gain weight and do my hair a different tone of blond, and he sent me to a person who cut hair, to fix what I had hacked at!"}, {"4b38": "He even taught me exercises that he’d learned from his personal trainer — whom I learned years later was Bruce Lee — as he wanted me to be toned, while I gained the 15 pounds he thought I needed."}, {"deed": "They hadn’t cast the lead male role yet, which is very unusual. It’s more common to hire the male lead first, but in this case, they hired me, the female lead, first. I don’t know why. I think I was one of the first persons in any capacity hired."}, {"1c00": "While they were casting the other roles, I got to spend a lot of time in the Solar offices just hanging out and learning from Steve. Eventually they settled on Michael Douglas, such a handsome man, and so talented and smart."}, {"259a": "Was McQueen often on the set of Adam at 6 A.M.?"}, {"0ceb": "No, that’s what producers, directors, and assistant directors are for. We were shooting in Missouri, and he was in California. The dailies — the footage of what was shot each day — were continually shipped back to Solar so Steve could see what was shot. We would all get his comments and what adjustments he wanted."}, {"e96a": "It’s me! No it’s you! The King of Cool, aka Steve McQueen, and acting protege Lee Purcell inside McQueen’s Solar offices in Studio City, California — site of the old Republic B-Western studios — announcing the production of “Adam at 6 A.M.” circa September 19, 1969. Image Credit: United Press International"}, {"4753": "What was McQueen like during your conversations with him? Was he similar to his cool, stoic, tough guy movie persona?"}, {"0cac": "My memory of him is very different from the roles he so brilliantly played. Steve was very kind to me and very helpful. He knew I knew nothing from nothing, so he wanted to help me live through the publicity fire-storm that was coming as a result of his having cast me personally. And, it was a firestorm!"}, {"5c96": "He also liked me because I rode motorcycles and liked fast cars. We had a lot in common. I think we recognized each other as kindred souls, and he always said I was a rebel like him."}, {"a5b1": "He told me a few things about his background, no big secrets or anything, but enough to let me know that we both followed a similar path in life, even though from outward appearances it probably seemed to some that I’d had a cushy time of it. He knew differently about me and even talked to the press about how much like him I was."}, {"f63c": "He was far more inquisitive about other people than anyone I had ever met. His curiosity about other people enhanced his natural talent and made him a great actor. He was so gifted in so many different areas."}, {"0cd7": "One of Steve’s great gifts was his ability to focus on what was in front of him. When you were in a room together, you felt as if you were in a different universe just with him. He had the ability to focus like a laser beam, and not be distracted by anything else, and I’d never met anyone like that before."}, {"09f6": "You never got the feeling that you were pestering him or that you made him feel rushed, or that he would rather spend that time with someone more important than you."}, {"3eb0": "You just felt like all of his attention was on you, and therefore, all of your attention was on him. It made for some very deep and meaningful conversations and life lessons. Even today, those lessons reverberate for me."}, {"5c55": "Sitting on a comfy sofa at his Solar offices in Studio City, California, a sandal-sporting Steve McQueen poses with actress Lee Purcell during an informal press conference announcing the production of “Adam at 6 A.M.” circa September 19, 1969. Image Credit: United Press International"}, {"4f71": "How exactly did McQueen help you navigate through the Adam at 6 A.M. publicity firestorm?"}, {"bf2b": "Eventually, the big day arrived for his introduction of me to the press. It was a huge press conference held in the beautiful Solar offices, very glamorous, very intimidating."}, {"e9f6": "It was a special introduction to the media by Steve McQueen to say, “I have discovered this young lady, and I want you to meet her.” He tried to warn me what I was in for — he chose my outfit, he decided how my hair would be done, and he tried to prepare me for what was in store, but no one really can."}, {"0dc6": "You just can’t know what it’s going to be like unless you’ve grown up in the spotlight, and I certainly hadn’t. I had never been exposed to that type of scrutiny and frenzy before."}, {"6014": "All the print and television media were there as well as Rona Barrett, who was the gossip maven of that era. If she was where you were, it meant that you were very, very important in “The Industry.” She was very kind to me."}, {"96f8": "Steve’s introduction of me to the press received international coverage. Before we entered the press conference, Steve spoke to me alone in a private room, and said, “The press will be here, and this is what they’re going to ask you, and here’s how you should respond. Keep your cool, and be friendly no matter what they say.”"}, {"e161": "Then we walked out arm in arm into a mob of people and blinding lights. Walking into that room was like walking into July 4th fireworks. I was overwhelmed, because I couldn’t see anything for a moment due to the camera flashes and TV lights. But Steve was holding my hand, so I managed to appear calm."}, {"7a15": "There seemed to be hundreds of people in the room. I don’t know how many people were actually there, but it was certainly more people than I’d ever been questioned by in my life."}, {"39c4": "When he said there’d be a lot of people there, I had no idea of the magnitude. I thought maybe 10 people…who would come out to see me, right? But, they were very curious about me, as Steve had never introduced a young actress to the press before, or after that, as his personal choice for a film of his."}, {"08ce": "Steve introduced me to the media crowd and spoke about Adam at 6 A.M. and my role in it. He told the media, “My partners and I interviewed close to 500 girls for the lead in this picture. It wasn’t easy. We kept narrowing down the field over a period of a few weeks until it came time to give screen tests to six of them.”"}, {"9f5a": "“All of them were good, but Lee seemed to jump out of the screen. There’s no way to explain it, but Lee has soul, and it comes through loud and clear. I think this girl and the picture are both going to be hits.” What an introduction! I was stunned."}, {"f24b": "The press asked many questions about the film, my role, how I got the job, but also some rude questions about my relationship with Steve, which he quickly stepped in and squelched. They only asked me polite questions after that! He was very protective of me."}, {"23b7": "He really knew how to handle the press. He may have not liked them, but he understood they came with the territory of being a movie star, and he had learned exactly how to deal with it."}, {"773d": "We posed for pictures, which are the publicity stills you see today. My favorite picture from that photo session is where we’re standing, laughing, and pointing at each other. To me, that photo personifies our relationship and brings back so many warm memories."}, {"e9c5": "Lee Purcell, Steve McQueen, and influential Hollywood gossip columnist Rona Barrett are captured in a jovial moment during a press conference at McQueen’s Solar Production offices in Studio City, California, circa September 19, 1969. Image Credit: United Press International"}, {"e66b": "Did you run into McQueen again after the movie wrapped?"}, {"2701": "There was a lot more to the experience than just all that led up to the film and the filming itself. So, of course, I saw him after the film wrapped. There was post-production, the very long publicity tour Solar sent Michael and me on all over the country, screenings, and finally, the film’s release."}, {"4fd6": "Steve gave me a beautiful gift after he saw the final cut of the film and a lovely note complimenting my performance. Things changed for both of us radically after that, as I moved to Europe, and he was involved in huge upheavals in his life."}, {"45ad": "Have you watched Adam at 6 A.M. since its September 1970 premiere?"}, {"f0eb": "I haven’t seen the movie since the film’s release, as I don’t watch my own work after the first — and usually the only — time I’ve seen it. It’s not that I don’t like my own work, but once I’ve done the work and seen it once, if at all, it has no further interest for me."}, {"0102": "I wouldn’t enjoy sitting in the dark watching my old films, far too Sunset Boulevard/Norma Desmond-ish for me! I prefer looking forward, not back. This interview and the one in Marshall Terrill’s biography on Steve [i.e. Steve McQueen: The Life and Legend of a Hollywood Icon] are the only ones I’ve ever done on the subject of McQueen."}, {"c5dd": "Smack dab in the middle of his hippie phase, Steve McQueen and a fresh-faced Lee Purcell kibitz during a press conference at the former’s Solar Production offices in Studio City, California, circa September 19, 1969. Image Credit: United Press International"}, {"6a20": "Do you remember where you were when McQueen passed away?"}, {"02e7": "Ironically, I was back in Hollywood and in a screening room with a handful of people, watching dailies from a new film I was in. The lights came up, and somebody came in and whispered something in the director’s ear."}, {"382c": "The director announced to the room that Steve had died, and I just lost it. I absolutely lost it…it was so hard because my whole experience with Steve came rushing back to me at that moment. Only 10 years had passed from the filming of Adam at 6 A.M. to his death. He had only had 10 more years. That is so tragic. It was such a loss."}, {"df42": "I knew he was ill, but I didn’t know how serious it was. Steve and I had a mutual friend who had visited Steve at some time during his illness. Shortly after Steve passed away, this friend told me something that really got to me: “You know, when I saw Steve, he asked me where you were and what you were doing. And I told him everything you’re up to.”"}, {"06d1": "It just broke my heart. I had so badly wanted to go see him. But, in no way did I think he was going to die. I thought I would get in touch with him after he recovered. Something held me back from seeing him when he was ill."}, {"845c": "In hindsight, I don’t think that he would have wanted me to see him in that condition. And I would never have intruded in his private time with his family during his illness."}, {"9f32": "One of my great regrets is having not seen him before he passed, not thanking him again for what he did for me, and never saying good-bye, but I never thought he was going to die — after all, he was Steve McQueen!"}, {"7561": "I cannot believe he’s been gone all these years. How can that be? It seems like just yesterday. I appreciate the opportunity to thank him publicly here and to acknowledge what he did for me."}, {"5058": "He was a good guy with a generous heart. He did more for me than he ever knew. With all that Steve had to do in his very big life, he took the time to mentor me. He was the first person to do so."}, {"28e1": "Steve was a huge, bright meteor across the sky of my life. I am very fortunate to have known him."}, {"18f1": "If you liked this, click the💚 below so other people will see this here on Medium."}, {"e66f": "******************DON’T GO ANYWHERE YET!*********************"}, {"4fab": "Exclusive Interview: “I really wish Steve could see the woman that I’ve grown up to be because I’m older than he was when he died. I’ve had my fun like he had his fun. But I wish he’d seen how much influence he had on me…I try to be honest, straightforward — as he’d say, ‘hold your mud.’ I learned a lot from him. I miss him every single day because he was my pal…you can’t find friends like that…and I never have.” In “The Definitive Account of Barbara Minty’s Love Affair with Bad Boy Steve McQueen,” the action star’s widow takes a nostalgic if practical minded journey through her Polaroid-filled back pages in her most wide-ranging interview to date. Humorous, often poignant anecdotes abound, such as landing smack dab near the Arizona-Mexico border for an extended stay in a vintage camper, dressing up like a frontier woman, how her father became a shotgun carrying extra, eavesdropping on dirty jokes courtesy of cowboy Slim Pickens, and the time James Garner showed up at her door unannounced."}, {"4afd": "Exclusive Interview No. 2: Believe it or not, Steve McQueen had an unconfirmed half-sister for six decades. Dogged researcher Marshall Terrill revealed Teri McQueen’s identity to the world in his well-received biography, Steve McQueen: The Life and Legend of a Hollywood Icon. In the exclusive “Distance Makes No Difference with Love…”, Teri painstakingly relives her miserable childhood exacerbated by alcoholic, often resentful parents who shuttled her back and forth to various temporary homes when they couldn’t live together anymore. Pregnant at age 15 and working at Woolworth’s five and dime store after lying about her age, Teri’s hard-scrabble beginnings ironically mirrored much of her brother’s rebellious adolescence. She courageously approached the King of the Cool during the filming of Bullitt. As the tried and true adage plainly says, Teri’s experiences are definitely a page turner."}, {"bb38": "Exclusive Interview No. 3: Determined Arkansan Beth Brickell had an intimate meeting with Princess Grace Kelly at the Palace of Monaco to figure out whether it was feasible for her to pursue her dream of acting. After years of toiling at the prestigious Actors Studio in New York City, she found herself cast in a breakout smash television series in 1967 as the dependable wife of Florida Everglades game warden Tom Wedloe [Dennis Weaver] on the half hour family adventure series Gentle Ben. Into the late 1970s Brickell dropped by Bonanza, Gunsmoke, Emergency!, Hawaii Five-O, Fantasy Island, and occasionally enlivened a feature film such as Kirk Douglas’s underappreciated, decidedly cynical Western Posse. A multifaceted individual also capable of political activism — Brickell conducted Democratic fundraising efforts in 1992 for Bill Clinton’s primary presidential campaign — directing independent films, and uncompromising investigative reporting — unswayed by death threats, she uncovered the motive and most likely suspect in the officially unsolved disappearance of socialite attorney Maud Crawford from her Camden colonial mansion — “The Unconventionally Persistent Journey of ‘Gentle Ben’ Heroine Beth Brickell” stands as her most comprehensive, intimate interview in years."}, {"f53e": "Click to watch Lee Purcell, as small town Missourian Jerri Jo Hopper, and Michael Douglas, the idealistic college professor Adam Gaines, serendipitously meet in “Adam at 6 A.M.,” produced by Steve McQueen. Video Credit: CBS / Paramount"}], "content": "Mentored by the biggest star in the world: Inside Steve McQueen’s ‘Adam at 6 A.M.’ Closely resembling twenty-tens superstar Scarlet Johansson is a stunning shot of then struggling actress Lee Purcell modeling in Los Angeles circa 1967. Purcell was part of Screen Gems Studios’ New Talent program until she earned her big break in “Adam at 6 A.M.” with Michael Douglas. Image Credit: Photography by Harry Langdon According to a bipartite interview debuting exclusively today, Lee Purcell got her first big Hollywood break on account of Steve McQueen. When the undisputed King of Cool decided to implement near-absolute creative control over his movie career, he and veteran producer Robert Relyea established Solar Productions in 1966. The resounding critical and commercial success of the action-packed, Solar-sanctioned Bullitt two years later may well have given McQueen the ultimate incentive to fashion a character study with modest box office aspirations that he would not appear in. After an arduous audition process that saw somewhere in the neighborhood of 500 young women vying for the coveted part of high school cheerleader “Jerri Jo Hopper,” McQueen personally hand-picked Purcell as one of the fresh-faced stars of Adam at 6 A.M. Auditioning multiple times, requesting an unheard-of second script read through after leaving the building, cutting her long, parted straight down the middle Hippie hairstyle into ostentatious bangs, conquering the small town Missouri dialect, and memorizing the entire script no doubt proved McQueen’s decision to cast the ballsy, determined actress was right on the money. Michael Douglas, in only his second major screen appearance, rendered the California cool, albeit spiritually unfulfilled college semantics professor Adam Gaines, who drives cross country in a cherry red Porsche 911 to reconnect with his family origins in Missouri. While not exactly penning a glowing review, the New York Times’ Vincent Canby reserved notable praise for Purcell’s screen debut, saying that the ingénue “is absolutely right, down to the slightest pout, as ‘Jerri Jo,’ the kind of girl who doesn’t think you should go all the way on a first date.” The review must have given McQueen immense satisfaction. One year before the film’s September 1970 release, he prudently revealed while introducing Purcell before a packed press conference at Solar’s Studio City corporate offices that “there’s a basic honesty and believability in Lee…I think this girl and the picture are both going to be hits.” Purcell has acted in countless films and television over a distinguished 50-year career, encompassing Peggy in the cult surfing classic Big Wednesday, Susan in the hilarious Gene Wilder-Richard Pryor mash-up Stir Crazy, seductive step-mom Beth in Nicolas Cage’s career-making Valley Girl, strong-willed state’s attorney Louise St. Laurent in the award-winning Due South series, and Francine Gingerfield, the sole surviving world political leader in the horror comedy Kids vs. Monsters costarring Malcolm McDowell. The supremely gifted actress is eternally grateful that her life’s journey intertwined with the King of Cool. To revisit Part One of the conversation, “To Jump off the Cliff into an Abyss: A Life’s Work with Emmy Nominee Lee Purcell,” simply click on the highlighted link where Purcell’s juicy anecdotes abound regarding Kirk Douglas, James Garner, Andy Griffith, Michael Landon, Warren Oates, and David Carradine. Otherwise, the Big Wednesday starlet’s detailed tribute to her favorite mentor accelerates now. In matching fashionable Age of Aquarius threads, Steve McQueen introduces a fresh-faced Lee Purcell to the world during a press conference at his Solar Production offices in Studio City, California — site of the old Republic B-Western studios — circa September 19, 1969. Image Credit: United Press International The Lee Purcell Interview [Part Two] How did legendary actor Steve McQueen enter your orbit in 1969? He jump-started my career, as I was a struggling young actress at the time. The path which led me to Steve was an odd series of events, in so many ways. I had not done a film before and didn’t even have a theatrical agent when I was cast in his film Adam at 6 A.M. At the time, I was studying acting, and modeling through my agent, Nina Blanchard, and I also had a commercial agent, Bill Cunningham. One day, Bill called and told me I should audition for a film, Adam at 6 A.M., that Steve McQueen’s company, Solar Productions, was doing. Getting a film audition through a commercial agent is not the customary way of doing business, since commercial agents do not represent actors for films. It was extremely odd for Bill to know about this film and to be able to get me an audition for it. What might seem even more odd to people was that I turned down the audition, as I didn’t feel I was ready to audition for a starring role. However, Bill was persistent, and he kept calling me about it and finally convinced me I should read the script anyway. So, I did, and I thought Bill was right. Another odd note was that I’d also been studying Standard American Speech with Professor Morris Cohen. Through hard work and practice, I had finally managed to get rid of my stutter, learn proper voice placement, and accent-free diction, instead of the hodge-podge of accents that I originally had. And then, of course, the first thing Bill told me to do for the audition was to go back to Prof. Cohen to learn an authentic Missouri accent. I didn’t know at the time that I was about to embark on a series of nerve-wracking auditions over a period of months and that my life was about to completely change for the better. Were you very cognizant of McQueen’s career when you first met? Another odd, but strangely advantageous situation, was that I wasn’t very familiar with Steve, as he was of my parents’ generation. I’m not sure I had even seen any of his films at the time. That turned out to be a good thing, as I had absolutely no intimidation when I met him. If I had really known how huge a global movie star he was, I probably would have been a nervous wreck. He was the biggest star in the world at the time. Just before signing up for a brief stint on NBC’s science fiction-soaked “Persons Unknown” 2010 drama, Lee Purcell is captured in an appealing studio portrait. Image Credit: Courtesy of Lee Purcell What was the significance of Screen Gems Studios’ New Talent program to your career? Very early in the very long audition process for Adam, I had met with the casting agent Eddie Foy, who was the talent scout for Screen Gems Studios’ New Talent program. At that time, several of the studios had talent development programs to discover young, inexpensive talent that they could sign for a very low weekly wage and put into their film and TV projects and not have to pay them anything more than the weekly stipend. If one of their New Talent actors hit the big time, the studio could then loan them out to other companies, collect a loan-out fee from the other studio, and still only have to pay the actors the small weekly salary. This was about 20 years after the old, very expensive, star-grooming studio system had been abolished and the new system was a completely different model. Even though we received no grooming or lessons or any of the perks that earlier generations of actors in the studio systems had received, it was still very advantageous in that we got to be on film and received a “pedigree” in that Fox, Columbia, Universal or Screen Gems, etc. had given their stamp of approval to us. A lot of us who have gone on to have lengthy careers were in these New Talent programs: me, Tom Selleck, the late Farrah Fawcett, Sharon Gless, etc. Before I was signed to the Screen Gems program, I told them that I was already in the audition process for this new film, Adam at 6 A.M., and asked to have that one film excluded from my deal, and to please have a legal way out of the overall contract without penalty. They surprisingly agreed, and they started me out with one line in one episode in one of their TV series [Author’s Note: Starring Eleanor Parker, Peter Haskell, and Leslie Nielsen as the titular character, Bracken’s World was a short-lived series about a powerful Hollywood studio mogul and his bevy of gorgeous starlets that is perhaps best known for replacing the iconic Star Trek in NBC’s fall lineup. In a case of life imitating art, Purcell was cast as a young acting student in the “Don’t You Cry for Susannah” episode, broadcast on October 10, 1969]. Since my Adam at 6 A.M. series of auditions went on for a long time, this was all happening simultaneously. Everyone was very cooperative. I didn’t know how unusual and how incredibly generous this was until years later. Safe in the arms of the one she loves: A still taken from “Adam at 6 A.M.” featuring debut leading lady Lee Purcell [Jerri Jo Hopper] and Michael Douglas [Adam Gaines] — in only his second starring film role after 1969’s “Hail, Hero!” — released in September 1970 via Steve McQueen’s Solar Productions. Critic Leonard Maltin felt the underrated movie gave “a rare, genuine feeling for the Midwest.” Image Credit: Photography by Kenny Bell / CBS / Paramount / IMDB What do you remember regarding your Adam at 6 A.M. debut audition? It was clear that this was the big time, but because of the casual atmosphere of Solar and Steve’s “everyman” personality, it didn’t really feel that way. The building where those first auditions took place is in the front of the CBS building today in the San Fernando Valley. Steve and his Solar Productions had their beautifully decorated offices there. Steve parked his car in the back, the same place where I was told to park mine. He never demanded a special parking place or a valet. He just parked his own car. The audition process was long and grueling, as it was a culling and winnowing process of many, many actresses. If I recall correctly, I had five auditions as I worked my way up the ladder to receive the final screen test. There were around 500 women who auditioned for the role of “Jerri Jo Hopper,” because everybody in town, and nationwide, whether they were known or unknown, was seen for that role. We would audition, and then either be eliminated or make it to the next round — think American Idol, but with no salary, no fame, no perks and no screen time unless you got the job — then the remaining actresses would get notes from the director, Bob Scheerer, and return days or weeks later to go the next round. I remember after my first, maybe second, audition, on my way out of the building, I had a different idea as to how to do the scene, so I spun around, went back in, and asked to read again. Another actress was already in the audition room reading, so I had to wait. Asking to read again was unheard of, but they let me read again. When I got the role later, I was told that I had saved myself from early elimination by having the courage to do that, and by then delivering a better reading. So, I moved on to the next round. Time passed, and the process went on and on, more actresses were eliminated, and I managed to hang in there. I was still tied to Screen Gems, but they had agreed to release me entirely if I got the film. This was incredibly generous of SG, as it meant I would not be a loan-out to Solar, so SG would not collect my salary from Adam, and I would get my entire salary from the film. Of course, I would have done the film for free and worked for free for Screen Gems as well! One day, thinking about the role, I was pondering myself in the mirror and thought “This is not the hairstyle that ‘Jerri Jo Hopper’ would wear.” I had the popular hairstyle of the day, very long, parted straight down the middle, standard hippie-actress style. But, the character in the film was a small-town Missouri high school cheerleader. So, I grabbed the scissors and chopped off my hair and cut thick, chunky bangs. When I went in for the next audition, everyone got so excited about my new look, even though it was a very bad haircut! By changing my hair, I suddenly embodied the character and had also differentiated myself from the rest of the remaining actresses. In addition to that, I kept working and working on the role, the Missouri accent, and all the scenes. By the time I finished with the auditions, I had the entire script memorized, including all of the screen directions and everyone’s lines, not just mine. In between starring in “The Reivers” and “Le Mans,” 39-year-old Steve McQueen opted to produce “Adam at 6 A.M,” directed by television journeyman Robert Scheerer. McQueen is seen here attending the official press junket announcing Lee Purcell as the costar of “Adam at 6 A.M.” circa September 19, 1969. Image Credit: Globe Photos Was your initial meeting with McQueen “normal?” Odd would describe it more accurately. Early in the process, perhaps after one general audition or so, I received a call on a Saturday morning from someone at Solar Productions. I had just come in from gardening, and I was grimy and dirty, and they told me to come over right away. I lived nearby. I said, “Can I at least take a shower?” and they said, “No, come right now.” I didn’t think much of it. I thought I was just going in to probably pick up some more script pages — no email in those days; you had to drive somewhere to pick up anything; unless you were a big star, then the pages would be delivered — from the reception desk and wouldn’t even see anyone. So I grabbed my car keys and went with dirty nails and dirty gardening clothes, and little did I know it, but this was to be my introduction to Steve McQueen. He didn’t care; he was so down to earth. He wasn’t like other people. The earthier and grittier you were, the happier he was. At this point, I didn’t have the role, but I thought I might have a chance since Steve wanted to meet me. He and I just chatted and chatted, and he didn’t make me feel as if I was being interviewed or judged. He would ask me interesting questions that had nothing to do with the role or the film. What kind of interesting questions are we talking about? For example, Steve wanted to know whether other women liked me. I replied, “I don’t think so.” Such naïveté on my part to give such an answer, but I was young. He must have liked the answer, as he later quoted it to the press. I have always thought he asked it to test my honesty, as he was always testing people’s honesty. He was so easy to talk to that I was completely honest about everything. Steve also asked me about my upbringing, motorcycle, and cars, not just shallow, social questions that one asks to be conversational. His questions were more personal and insightful. Steve McQueen and beaming apprentice Lee Purcell hang out inside the King of Cool’s Solar offices in Studio City, California — site of the old Republic B-Western studios — after announcing the production of “Adam at 6 A.M.” circa September 19, 1969. Image Credit: Photography by Nate Cutler / Globe Photos / ImageCollect Did McQueen ever take you for a drive? The only time I ever felt put on the spot by Steve, and I knew it was a test, was in a car one day with him. Once he figured out you had talent, that part was over with, but then he tested you as a human being. We were in his car, and he started driving really, really fast. I think it was a Porsche, and it had a very loud engine. He was yelling over the engine, and I would have to yell back my response. By this time, I knew him a little better, and I knew he was testing me, because he was watching my reactions, and I knew that I should show no fear. And I didn’t, but my heart was pounding as I silently wondered, “Am I going to die here?” I guess I passed the test. He liked the fact that I also drove fast and thought it was great that I was an adrenaline junkie like him. I rode a Honda 750 motorcycle at the time. It was a huge bike for me, as I was a skinny girl, but I had gotten a really good deal on it. Steve thought it was absolutely hilarious that I was riding this huge bike! Especially when I told him that if the bike fell down, I couldn’t pick it up, but had to ask strangers on the street to help me. A lobby card taken from “Adam at 6 A.M.” featuring actress Lee Purcell and Michael Douglas at the beginning of their illustrious movie careers, released in September 1970 via Steve McQueen’s Solar Productions. Image Credit: Photography by Kenny Bell / CBS / Paramount How difficult was your screen test? My screen test was truly a test of willpower and nerves. It was a “feet to the fire” sort of experience. They had narrowed the field down from 500 actresses to a handful. What’s odd is that they crammed us all in the same car — hip-to-hip in the back seat — all competitors, and took us to a movie studio ranch. All of these nervous young ladies were sitting in the back seat of this car, and in the front seat were the very nice producers Rick Rosenberg and Bob Christiansen. All I could do was bravado my way through it or act nervous, and I really wasn’t all that nervous but more shell-shocked. So, I chose bravado. I remember Rick Rosenberg turned around, looking at us young hopefuls jammed in the back, and he was making small talk, being very kind. When he asked me, “How are you doing, Lee? Are you nervous?” I said, “I’m not nervous. I’ve already packed my bags to go do the film.” Needless to say, there was shocked silence. It was just bravado…my bags weren’t packed, but I just needed to say or do something to show that I was strong and confident. We arrived to an open ranch area that was very beautiful, where a lot of exteriors for movies were shot, to shoot our scenes with the handsome young actors. What was really strange was that we shot our scenes outside while the other actresses just stood around and watched until it was their turn. Normally, one waits in a waiting room or a green room. But, this was a ranch, so there was nowhere to wait, nor anywhere to sit. So, everyone had to lean on trees or sit on fallen logs when they weren’t on camera as there wasn’t anywhere else to sit once you were out of the car. It was bizarre, and it’s just not done today…and I’ve never done an audition like that since. Then we all got back in the car and drove back to the office together. I was very desperate for the role and had not slept at all the night before. So, all the way back in the crowded car, I kept saying to myself, “I have to get this role. I just have to get it…if I don’t, I’m probably going to starve.” I was in a difficult position financially — which was worsening — so it was do or die. Take these chains from my heart: As disillusioned Golden State semantics professor Adam Gaines, AFI Life Achievement Award winner Michael Douglas decides to attend his great aunt’s funeral in Missouri and reassess life. There he encounters the innocent, enthusiastic Jerri Jo Hopper [Lee Purcell]. “Adam at 6 A.M.” was distributed with minimal fanfare on September 22, 1970, and sank into obscurity. While released on VHS in 1990, the romantic drama has yet to see a DVD or Blu-ray edition. Image Credit: Photography by Kenny Bell / CBS / Paramount / Historic Images What did you do when you learned that you had won the coveted part? I called my grandmother and asked her to get the other family members to gather around the phone together. When they did, I said “You’re speaking to ‘Jerri Jo Hopper.’ I got the part!” It was such a moment. You only have a moment like that once as an actress. That first break is something you never forget. Everything else is gravy, but that first break is magical. Now that I had the role, Steve began to mentor me in earnest, as he tried to prepare me for the film and the press. He was such a multi-tasker, as he was planning the Le Mans film at the same time, had a family, the production company, and other films and a million other things. But, he still found the time to be very involved mentoring me and planning how I should look. He made me gain weight and do my hair a different tone of blond, and he sent me to a person who cut hair, to fix what I had hacked at! He even taught me exercises that he’d learned from his personal trainer — whom I learned years later was Bruce Lee — as he wanted me to be toned, while I gained the 15 pounds he thought I needed. They hadn’t cast the lead male role yet, which is very unusual. It’s more common to hire the male lead first, but in this case, they hired me, the female lead, first. I don’t know why. I think I was one of the first persons in any capacity hired. While they were casting the other roles, I got to spend a lot of time in the Solar offices just hanging out and learning from Steve. Eventually they settled on Michael Douglas, such a handsome man, and so talented and smart. Was McQueen often on the set of Adam at 6 A.M.? No, that’s what producers, directors, and assistant directors are for. We were shooting in Missouri, and he was in California. The dailies — the footage of what was shot each day — were continually shipped back to Solar so Steve could see what was shot. We would all get his comments and what adjustments he wanted. It’s me! No it’s you! The King of Cool, aka Steve McQueen, and acting protege Lee Purcell inside McQueen’s Solar offices in Studio City, California — site of the old Republic B-Western studios — announcing the production of “Adam at 6 A.M.” circa September 19, 1969. Image Credit: United Press International What was McQueen like during your conversations with him? Was he similar to his cool, stoic, tough guy movie persona? My memory of him is very different from the roles he so brilliantly played. Steve was very kind to me and very helpful. He knew I knew nothing from nothing, so he wanted to help me live through the publicity fire-storm that was coming as a result of his having cast me personally. And, it was a firestorm! He also liked me because I rode motorcycles and liked fast cars. We had a lot in common. I think we recognized each other as kindred souls, and he always said I was a rebel like him. He told me a few things about his background, no big secrets or anything, but enough to let me know that we both followed a similar path in life, even though from outward appearances it probably seemed to some that I’d had a cushy time of it. He knew differently about me and even talked to the press about how much like him I was. He was far more inquisitive about other people than anyone I had ever met. His curiosity about other people enhanced his natural talent and made him a great actor. He was so gifted in so many different areas. One of Steve’s great gifts was his ability to focus on what was in front of him. When you were in a room together, you felt as if you were in a different universe just with him. He had the ability to focus like a laser beam, and not be distracted by anything else, and I’d never met anyone like that before. You never got the feeling that you were pestering him or that you made him feel rushed, or that he would rather spend that time with someone more important than you. You just felt like all of his attention was on you, and therefore, all of your attention was on him. It made for some very deep and meaningful conversations and life lessons. Even today, those lessons reverberate for me. Sitting on a comfy sofa at his Solar offices in Studio City, California, a sandal-sporting Steve McQueen poses with actress Lee Purcell during an informal press conference announcing the production of “Adam at 6 A.M.” circa September 19, 1969. Image Credit: United Press International How exactly did McQueen help you navigate through the Adam at 6 A.M. publicity firestorm? Eventually, the big day arrived for his introduction of me to the press. It was a huge press conference held in the beautiful Solar offices, very glamorous, very intimidating. It was a special introduction to the media by Steve McQueen to say, “I have discovered this young lady, and I want you to meet her.” He tried to warn me what I was in for — he chose my outfit, he decided how my hair would be done, and he tried to prepare me for what was in store, but no one really can. You just can’t know what it’s going to be like unless you’ve grown up in the spotlight, and I certainly hadn’t. I had never been exposed to that type of scrutiny and frenzy before. All the print and television media were there as well as Rona Barrett, who was the gossip maven of that era. If she was where you were, it meant that you were very, very important in “The Industry.” She was very kind to me. Steve’s introduction of me to the press received international coverage. Before we entered the press conference, Steve spoke to me alone in a private room, and said, “The press will be here, and this is what they’re going to ask you, and here’s how you should respond. Keep your cool, and be friendly no matter what they say.” Then we walked out arm in arm into a mob of people and blinding lights. Walking into that room was like walking into July 4th fireworks. I was overwhelmed, because I couldn’t see anything for a moment due to the camera flashes and TV lights. But Steve was holding my hand, so I managed to appear calm. There seemed to be hundreds of people in the room. I don’t know how many people were actually there, but it was certainly more people than I’d ever been questioned by in my life. When he said there’d be a lot of people there, I had no idea of the magnitude. I thought maybe 10 people…who would come out to see me, right? But, they were very curious about me, as Steve had never introduced a young actress to the press before, or after that, as his personal choice for a film of his. Steve introduced me to the media crowd and spoke about Adam at 6 A.M. and my role in it. He told the media, “My partners and I interviewed close to 500 girls for the lead in this picture. It wasn’t easy. We kept narrowing down the field over a period of a few weeks until it came time to give screen tests to six of them.” “All of them were good, but Lee seemed to jump out of the screen. There’s no way to explain it, but Lee has soul, and it comes through loud and clear. I think this girl and the picture are both going to be hits.” What an introduction! I was stunned. The press asked many questions about the film, my role, how I got the job, but also some rude questions about my relationship with Steve, which he quickly stepped in and squelched. They only asked me polite questions after that! He was very protective of me. He really knew how to handle the press. He may have not liked them, but he understood they came with the territory of being a movie star, and he had learned exactly how to deal with it. We posed for pictures, which are the publicity stills you see today. My favorite picture from that photo session is where we’re standing, laughing, and pointing at each other. To me, that photo personifies our relationship and brings back so many warm memories. Lee Purcell, Steve McQueen, and influential Hollywood gossip columnist Rona Barrett are captured in a jovial moment during a press conference at McQueen’s Solar Production offices in Studio City, California, circa September 19, 1969. Image Credit: United Press International Did you run into McQueen again after the movie wrapped? There was a lot more to the experience than just all that led up to the film and the filming itself. So, of course, I saw him after the film wrapped. There was post-production, the very long publicity tour Solar sent Michael and me on all over the country, screenings, and finally, the film’s release. Steve gave me a beautiful gift after he saw the final cut of the film and a lovely note complimenting my performance. Things changed for both of us radically after that, as I moved to Europe, and he was involved in huge upheavals in his life. Have you watched Adam at 6 A.M. since its September 1970 premiere? I haven’t seen the movie since the film’s release, as I don’t watch my own work after the first — and usually the only — time I’ve seen it. It’s not that I don’t like my own work, but once I’ve done the work and seen it once, if at all, it has no further interest for me. I wouldn’t enjoy sitting in the dark watching my old films, far too Sunset Boulevard/Norma Desmond-ish for me! I prefer looking forward, not back. This interview and the one in Marshall Terrill’s biography on Steve [i.e. Steve McQueen: The Life and Legend of a Hollywood Icon] are the only ones I’ve ever done on the subject of McQueen. Smack dab in the middle of his hippie phase, Steve McQueen and a fresh-faced Lee Purcell kibitz during a press conference at the former’s Solar Production offices in Studio City, California, circa September 19, 1969. Image Credit: United Press International Do you remember where you were when McQueen passed away? Ironically, I was back in Hollywood and in a screening room with a handful of people, watching dailies from a new film I was in. The lights came up, and somebody came in and whispered something in the director’s ear. The director announced to the room that Steve had died, and I just lost it. I absolutely lost it…it was so hard because my whole experience with Steve came rushing back to me at that moment. Only 10 years had passed from the filming of Adam at 6 A.M. to his death. He had only had 10 more years. That is so tragic. It was such a loss. I knew he was ill, but I didn’t know how serious it was. Steve and I had a mutual friend who had visited Steve at some time during his illness. Shortly after Steve passed away, this friend told me something that really got to me: “You know, when I saw Steve, he asked me where you were and what you were doing. And I told him everything you’re up to.” It just broke my heart. I had so badly wanted to go see him. But, in no way did I think he was going to die. I thought I would get in touch with him after he recovered. Something held me back from seeing him when he was ill. In hindsight, I don’t think that he would have wanted me to see him in that condition. And I would never have intruded in his private time with his family during his illness. One of my great regrets is having not seen him before he passed, not thanking him again for what he did for me, and never saying good-bye, but I never thought he was going to die — after all, he was Steve McQueen! I cannot believe he’s been gone all these years. How can that be? It seems like just yesterday. I appreciate the opportunity to thank him publicly here and to acknowledge what he did for me. He was a good guy with a generous heart. He did more for me than he ever knew. With all that Steve had to do in his very big life, he took the time to mentor me. He was the first person to do so. Steve was a huge, bright meteor across the sky of my life. I am very fortunate to have known him. If you liked this, click the💚 below so other people will see this here on Medium. ******************DON’T GO ANYWHERE YET!********************* Exclusive Interview: “I really wish Steve could see the woman that I’ve grown up to be because I’m older than he was when he died. I’ve had my fun like he had his fun. But I wish he’d seen how much influence he had on me…I try to be honest, straightforward — as he’d say, ‘hold your mud.’ I learned a lot from him. I miss him every single day because he was my pal…you can’t find friends like that…and I never have.” In “The Definitive Account of Barbara Minty’s Love Affair with Bad Boy Steve McQueen,” the action star’s widow takes a nostalgic if practical minded journey through her Polaroid-filled back pages in her most wide-ranging interview to date. Humorous, often poignant anecdotes abound, such as landing smack dab near the Arizona-Mexico border for an extended stay in a vintage camper, dressing up like a frontier woman, how her father became a shotgun carrying extra, eavesdropping on dirty jokes courtesy of cowboy Slim Pickens, and the time James Garner showed up at her door unannounced. Exclusive Interview No. 2: Believe it or not, Steve McQueen had an unconfirmed half-sister for six decades. Dogged researcher Marshall Terrill revealed Teri McQueen’s identity to the world in his well-received biography, Steve McQueen: The Life and Legend of a Hollywood Icon. In the exclusive “Distance Makes No Difference with Love…”, Teri painstakingly relives her miserable childhood exacerbated by alcoholic, often resentful parents who shuttled her back and forth to various temporary homes when they couldn’t live together anymore. Pregnant at age 15 and working at Woolworth’s five and dime store after lying about her age, Teri’s hard-scrabble beginnings ironically mirrored much of her brother’s rebellious adolescence. She courageously approached the King of the Cool during the filming of Bullitt. As the tried and true adage plainly says, Teri’s experiences are definitely a page turner. Exclusive Interview No. 3: Determined Arkansan Beth Brickell had an intimate meeting with Princess Grace Kelly at the Palace of Monaco to figure out whether it was feasible for her to pursue her dream of acting. After years of toiling at the prestigious Actors Studio in New York City, she found herself cast in a breakout smash television series in 1967 as the dependable wife of Florida Everglades game warden Tom Wedloe [Dennis Weaver] on the half hour family adventure series Gentle Ben. Into the late 1970s Brickell dropped by Bonanza, Gunsmoke, Emergency!, Hawaii Five-O, Fantasy Island, and occasionally enlivened a feature film such as Kirk Douglas’s underappreciated, decidedly cynical Western Posse. A multifaceted individual also capable of political activism — Brickell conducted Democratic fundraising efforts in 1992 for Bill Clinton’s primary presidential campaign — directing independent films, and uncompromising investigative reporting — unswayed by death threats, she uncovered the motive and most likely suspect in the officially unsolved disappearance of socialite attorney Maud Crawford from her Camden colonial mansion — “The Unconventionally Persistent Journey of ‘Gentle Ben’ Heroine Beth Brickell” stands as her most comprehensive, intimate interview in years. Click to watch Lee Purcell, as small town Missourian Jerri Jo Hopper, and Michael Douglas, the idealistic college professor Adam Gaines, serendipitously meet in “Adam at 6 A.M.,” produced by Steve McQueen. Video Credit: CBS / Paramount ", "name": "489", "child": "489_1", "timestamp": "Apr 13"}