{"parent": "", "title": "The Tsunami And You", "author": "Nina Szarka", "sentences": [{"d7db": "The Tsunami And You"}, {"8949": "What I am going to doIs Drink Lake MichiganI am going to kneel at the shore with cupped hands Until the whole thing is in my bellyRight down to theShipwreck skeletons And I am going to refuse to put it backUntil theLake Michigan Monster serves me tea And grants me 34 wishes, one for every yearI could not sleep well at night, my mother saysThere was no time I was notRestless But the thing I was never afraid ofWas drowning Because I know there are worst fates than dying in water."}, {"63cb": "What I am going to do is eat the sand,I am going to chewUntil my teeth are pearlsUntil my everything is pearlsAnd I am going to spit pearls instead of speaking."}, {"15c7": "I am going to swallow all the words in the worldAnd I am not giving them backUntil we stop buying condos andLearn to sing our stories Until we learn to speak in opening eyelids and sighsUntil the etymology of our movement is as significant our loan contracts Until we stop associating the color whiteWith cleanliness."}, {"ccd7": "I am going to go lay in the back yard, In the mud like that character, Witch Baby,In that book I once loved, And I am not coming out until you learnTo whistle Until you write me a haiku Until you stop shouting."}, {"13ac": "I am going to dance until I am an earthquakeAnd I am coming for your highways And your bridges I am going to split the concrete of your ivory high riseI am going to make paper airplanes out of all the birth certificates and leases and titles and Then no oneWill have come from anywhere."}, {"f7e0": "No lineage.No inheritance."}, {"be81": "Just the tsunami and you,And whether you will swim or not."}], "content": "The Tsunami And You What I am going to doIs Drink Lake MichiganI am going to kneel at the shore with cupped hands Until the whole thing is in my bellyRight down to theShipwreck skeletons And I am going to refuse to put it backUntil theLake Michigan Monster serves me tea And grants me 34 wishes, one for every yearI could not sleep well at night, my mother saysThere was no time I was notRestless But the thing I was never afraid ofWas drowning Because I know there are worst fates than dying in water. What I am going to do is eat the sand,I am going to chewUntil my teeth are pearlsUntil my everything is pearlsAnd I am going to spit pearls instead of speaking. I am going to swallow all the words in the worldAnd I am not giving them backUntil we stop buying condos andLearn to sing our stories Until we learn to speak in opening eyelids and sighsUntil the etymology of our movement is as significant our loan contracts Until we stop associating the color whiteWith cleanliness. I am going to go lay in the back yard, In the mud like that character, Witch Baby,In that book I once loved, And I am not coming out until you learnTo whistle Until you write me a haiku Until you stop shouting. I am going to dance until I am an earthquakeAnd I am coming for your highways And your bridges I am going to split the concrete of your ivory high riseI am going to make paper airplanes out of all the birth certificates and leases and titles and Then no oneWill have come from anywhere. No lineage.No inheritance. Just the tsunami and you,And whether you will swim or not. ", "name": "490", "child": "490_1\t490_2\t490_3\t490_4\t490_5\t490_6\t490_7\t490_8\t490_9\t490_10\t490_11\t490_12\t490_13\t490_14\t490_15\t490_16", "timestamp": "Mar 30"}