{"parent": "", "title": "Sex Work in San Francisco, Then and Now", "author": "Cirrus Wood", "sentences": [{"32fe": "Sex Work in San Francisco, Then and Now"}, {"23bd": "It seems little has changed in the 100-plus year movement for sex workers’ rights."}, {"29cd": "Three things made San Francisco: fortune, thievery and sex. From the old mission days to the Barbary Coast the Summer of Love to the tech boom, it’s been the steady narrative thread. Everyone wants to get lucky."}, {"ba76": "In 1911, San Francisco established the Municipal Clinic, its first clinic for sex workers. Although it existed only for a little over two years, the clinic reduced venereal diseases among sex workers — and thus the city — by more than 60 percent. The clinic’s supervising physician, Dr. O. B. Spalding, even secured city protection for property, staff and patients by agreeing to legislation requiring sex workers to carry clinic-issued bills of health or else face arrest for vagrancy."}, {"b8a4": "“All harlots were required to report at the clinic every fourth day for medical inspection, which included a blood test. For this they paid 50 cents, though treatment in the case of disease was free,” Herbert Asbury writes in The Barbary Coast, the great canon of San Francisco."}, {"6437": "The security was tenuous and short lived. Under pressure from city clergymen, mayor James Rolph ordered that police protection be withdrawn. Sex workers were no longer required to carry bills, but they also weren’t offered any physical or legal protection."}, {"48dd": "As the clinic could no longer offer any kind of safe space, and the punishments for having or not having a bill were now one in the same, prostitutes quickly stopped attending, and the Municial Clinic shuttered soon thereafter. And, as Asbury puts it, “Disease again raged unchecked.”"}, {"b028": "Some elements come across a bit dated, but at least one part of the story has been constant. Sex workers still never know what legislation is going to threaten them next. Will it be the sudden enforcement of an existing law? Or will it be something new?"}, {"dbfe": "“Most of us are working- or middle-class individuals with 17 side hustles or more to keep us going…We’re POC, queer, female and trans, and when you have that many intersecting identities, your vulnerability increases.”"}, {"fe92": "As Andre Shakti, a sex worker living in Oakland, put it, “As soon as one piece of oppressive legislation gets defeated, another one pops up in its place.” Shakti works in porn and as a dominatrix, stripper and relationship coach. She’s presented at Ivy Q, Harvard’s exploration of “queer community beyond binaries and the LGB.” Shakti is a self-directed independent contractor — emphasis on independent — with a list of gigs whose breadth and depth would rival a stock portfolio, including everything from managing conferences to workshops on fisting."}, {"c8c5": "Prop 60 contained provisions allowing California residents to sue producers for noncompliance and thereby gain access to performers’ personal information, such as legal name and address. Porn actors, especially trans actors, are necessarily cautious about sharing that information, and having it legally given to strangers would have put far more people at risk than a few condomless fucks."}, {"a541": "Sex work is never easy money. It involves a good deal more than holding one’s office hours in bed. Last November, Shakti spent hours of her time fighting Prop 60, a measure requiring condom use in porn. While the wording of the proposition sounded noble, it contained provisions allowing California residents to sue producers for noncompliance and thereby gain access to performers’ personal information, such as legal name and address. Porn actors, especially trans actors, are necessarily cautious about sharing that information, and having it legally given to strangers would have put far more people at risk than a few condomless fucks."}, {"3e94": "“Most of us are working- or middle-class individuals with 17 side hustles or more to keep us going,” says Shakti. “We’re POC, queer, female and trans, and when you have that many intersecting identities, your vulnerability increases.”"}, {"0a93": "Proposition 60 did not pass. But the work Shakti put into protecting her livelihood — highly necessary work — was unpaid. While in the months since she’s managed to make up for lost time and income, there’s no telling when or what the next fight will be. The greatest reasons for burnout in the sex-work industry are not existing laws but potential ones."}, {"0b2c": "“We barely have time to recover,” she says. “It’s just cumulatively exhausting.”"}, {"fbf6": "For sex workers, the Bay Area is attractive for reasons that will sound familiar to almost any minority. Greater tolerance for orientation and expression, excellent social services, ease of finding like-minded individuals and a social climate that generally favors the rights of the individual over the desires of the state. The result is that the local market is nearly oversaturated with professionals. Which means workers must either be adept generalists or extremely niche professionals, and be prepared to do either for less money than they might get outside of California."}, {"ef9c": "“Many sex workers really only feel safe in California,” explains Shakti. In a state with stricter laws or more rigorous prosecution, sex workers might command higher prices but at a significantly greater risk to personal and legal safety. “We have to balance comfort, safety and health against having a roof and food on the table.”"}, {"12ab": "At the Philz Coffee shop on Castro street, I met with Claire Alwyne, a trans professional dominatrix who relocated to the Bay from London in the 1990s. She found San Francisco to be even more tolerant and accepting than her former home. Although laws regarding sex work are not very different between the two cities, social attitudes toward sex workers certainly are. “Here it’s above ground,” she said."}, {"6680": "“We don’t sell our bodies,” said Alwyne. “We enter into a contract to engage in sexual behavior with another adult for an agreed-upon time and an agreed-upon fee. A bit like engaging a plumber. Which is why I am a member of a union,” she said, stressing the last word. “It’s about workers’ rights.”"}, {"fe8a": "Alwyne is a member of the Erotic Service Providers’ Union (ESPU), an agency currently involved in a lawsuit to decriminalize prostitution in the state of California. The initial lawsuit, ESPLERP vs. Gascón, was struck down in November of last year. On January 13, 2017, it was filed for appeal at the Ninth District court."}, {"0130": "In the 19th and 20th centuries, anti-prostitution advocates structured their arguments with an eye toward morality. In San Francisco, that charge was led by a Catholic priest, Father Terence Caraher, who routinely picketed brothels, encouraged his parish to harass sex workers, labeled the Municipal Clinic “a blow at marriage” and spent his later years railing against every public amusement, from trolley cars to roller-skating rinks, until his death in a San Jose sanatorium in 1914."}, {"7af9": "In the current era, anti-sex-work advocates argue less about protecting the sanctity of matrimony and more about ending sex trafficking. But laws designed to prevent trafficking, however well intentioned, often adversely and incorrectly affect the wrong parties, as law enforcement often treats sex work as one in the same as sex trafficking. In some jurisdictions adults can even be charged with trafficking themselves."}, {"ee26": "But the two are not apples and apples. Sex work is consensual. Sex trafficking is coercion. And sex workers want to end sex trafficking as much as if not more than everyone else. They are among the people most likely to witness human trafficking but also among the least likely to report it, since they cannot do so without putting themselves at legal risk. The hope for a case like ESPLERP vs. Gascón is to at last put a hard legal line between the two. The appeal may be a moon shot, but it is—if nothing else—one small step in the right direction."}, {"bece": "“If you want to stop prostitution, stop the new girls from coming in here,” said Gamble. “They are coming into it every day. They will always be coming into it as long as conditions, wages and education are as they are. You don’t do any good by attacking us. Why don’t you attack those conditions?”"}, {"e9b1": "“The reality is that sex work is not going away,” says Alwyne. And in that there is also an echo of an earlier time."}, {"a2b6": "On January 25, 1917, Reggie Gamble, a madam from a Tenderloin brothel, led a group of several hundred sex workers in what might be called the first women’s march in San Francisco. Gamble, along with fellow madam Maude Spencer, led the women to the Central Methodist Church, where they assembled in one of the most unusual congregations ever to have gathered in the city."}, {"a765": "“If you want to stop prostitution, stop the new girls from coming in here,” said Gamble. “They are coming into it every day. They will always be coming into it as long as conditions, wages and education are as they are. You don’t do any good by attacking us. Why don’t you attack those conditions?”"}, {"9798": "In The Barbary Coast, Asbury records that the reverend of the Methodist church replied that “a woman could remain virtuous on an income of 10 dollars a week,” or about $190 in today’s currency. The reverend’s figure then, as now, is laughable, and the crowd responded in more or less the same way before shuffling out, with nothing resolved."}, {"7952": "One hundred years after Gamble and Spencer’s march, the Women’s March of this past January experienced a few of the same anxieties as it opted to include, then disinvite, then re-invite sex workers. Many sex workers were left wondering just how much the movement really valued equality for all women, or whether tolerance came only with invisibility."}, {"a070": "“We wake up every day to a world that doesn’t want us to exist, profit or thrive,” says Shakti."}, {"26d4": "The more things change …"}], "content": "Sex Work in San Francisco, Then and Now It seems little has changed in the 100-plus year movement for sex workers’ rights. Three things made San Francisco: fortune, thievery and sex. From the old mission days to the Barbary Coast the Summer of Love to the tech boom, it’s been the steady narrative thread. Everyone wants to get lucky. In 1911, San Francisco established the Municipal Clinic, its first clinic for sex workers. Although it existed only for a little over two years, the clinic reduced venereal diseases among sex workers — and thus the city — by more than 60 percent. The clinic’s supervising physician, Dr. O. B. Spalding, even secured city protection for property, staff and patients by agreeing to legislation requiring sex workers to carry clinic-issued bills of health or else face arrest for vagrancy. “All harlots were required to report at the clinic every fourth day for medical inspection, which included a blood test. For this they paid 50 cents, though treatment in the case of disease was free,” Herbert Asbury writes in The Barbary Coast, the great canon of San Francisco. The security was tenuous and short lived. Under pressure from city clergymen, mayor James Rolph ordered that police protection be withdrawn. Sex workers were no longer required to carry bills, but they also weren’t offered any physical or legal protection. As the clinic could no longer offer any kind of safe space, and the punishments for having or not having a bill were now one in the same, prostitutes quickly stopped attending, and the Municial Clinic shuttered soon thereafter. And, as Asbury puts it, “Disease again raged unchecked.” Some elements come across a bit dated, but at least one part of the story has been constant. Sex workers still never know what legislation is going to threaten them next. Will it be the sudden enforcement of an existing law? Or will it be something new? “Most of us are working- or middle-class individuals with 17 side hustles or more to keep us going…We’re POC, queer, female and trans, and when you have that many intersecting identities, your vulnerability increases.” As Andre Shakti, a sex worker living in Oakland, put it, “As soon as one piece of oppressive legislation gets defeated, another one pops up in its place.” Shakti works in porn and as a dominatrix, stripper and relationship coach. She’s presented at Ivy Q, Harvard’s exploration of “queer community beyond binaries and the LGB.” Shakti is a self-directed independent contractor — emphasis on independent — with a list of gigs whose breadth and depth would rival a stock portfolio, including everything from managing conferences to workshops on fisting. Prop 60 contained provisions allowing California residents to sue producers for noncompliance and thereby gain access to performers’ personal information, such as legal name and address. Porn actors, especially trans actors, are necessarily cautious about sharing that information, and having it legally given to strangers would have put far more people at risk than a few condomless fucks. Sex work is never easy money. It involves a good deal more than holding one’s office hours in bed. Last November, Shakti spent hours of her time fighting Prop 60, a measure requiring condom use in porn. While the wording of the proposition sounded noble, it contained provisions allowing California residents to sue producers for noncompliance and thereby gain access to performers’ personal information, such as legal name and address. Porn actors, especially trans actors, are necessarily cautious about sharing that information, and having it legally given to strangers would have put far more people at risk than a few condomless fucks. “Most of us are working- or middle-class individuals with 17 side hustles or more to keep us going,” says Shakti. “We’re POC, queer, female and trans, and when you have that many intersecting identities, your vulnerability increases.” Proposition 60 did not pass. But the work Shakti put into protecting her livelihood — highly necessary work — was unpaid. While in the months since she’s managed to make up for lost time and income, there’s no telling when or what the next fight will be. The greatest reasons for burnout in the sex-work industry are not existing laws but potential ones. “We barely have time to recover,” she says. “It’s just cumulatively exhausting.” For sex workers, the Bay Area is attractive for reasons that will sound familiar to almost any minority. Greater tolerance for orientation and expression, excellent social services, ease of finding like-minded individuals and a social climate that generally favors the rights of the individual over the desires of the state. The result is that the local market is nearly oversaturated with professionals. Which means workers must either be adept generalists or extremely niche professionals, and be prepared to do either for less money than they might get outside of California. “Many sex workers really only feel safe in California,” explains Shakti. In a state with stricter laws or more rigorous prosecution, sex workers might command higher prices but at a significantly greater risk to personal and legal safety. “We have to balance comfort, safety and health against having a roof and food on the table.” At the Philz Coffee shop on Castro street, I met with Claire Alwyne, a trans professional dominatrix who relocated to the Bay from London in the 1990s. She found San Francisco to be even more tolerant and accepting than her former home. Although laws regarding sex work are not very different between the two cities, social attitudes toward sex workers certainly are. “Here it’s above ground,” she said. “We don’t sell our bodies,” said Alwyne. “We enter into a contract to engage in sexual behavior with another adult for an agreed-upon time and an agreed-upon fee. A bit like engaging a plumber. Which is why I am a member of a union,” she said, stressing the last word. “It’s about workers’ rights.” Alwyne is a member of the Erotic Service Providers’ Union (ESPU), an agency currently involved in a lawsuit to decriminalize prostitution in the state of California. The initial lawsuit, ESPLERP vs. Gascón, was struck down in November of last year. On January 13, 2017, it was filed for appeal at the Ninth District court. In the 19th and 20th centuries, anti-prostitution advocates structured their arguments with an eye toward morality. In San Francisco, that charge was led by a Catholic priest, Father Terence Caraher, who routinely picketed brothels, encouraged his parish to harass sex workers, labeled the Municipal Clinic “a blow at marriage” and spent his later years railing against every public amusement, from trolley cars to roller-skating rinks, until his death in a San Jose sanatorium in 1914. In the current era, anti-sex-work advocates argue less about protecting the sanctity of matrimony and more about ending sex trafficking. But laws designed to prevent trafficking, however well intentioned, often adversely and incorrectly affect the wrong parties, as law enforcement often treats sex work as one in the same as sex trafficking. In some jurisdictions adults can even be charged with trafficking themselves. But the two are not apples and apples. Sex work is consensual. Sex trafficking is coercion. And sex workers want to end sex trafficking as much as if not more than everyone else. They are among the people most likely to witness human trafficking but also among the least likely to report it, since they cannot do so without putting themselves at legal risk. The hope for a case like ESPLERP vs. Gascón is to at last put a hard legal line between the two. The appeal may be a moon shot, but it is—if nothing else—one small step in the right direction. “If you want to stop prostitution, stop the new girls from coming in here,” said Gamble. “They are coming into it every day. They will always be coming into it as long as conditions, wages and education are as they are. You don’t do any good by attacking us. Why don’t you attack those conditions?” “The reality is that sex work is not going away,” says Alwyne. And in that there is also an echo of an earlier time. On January 25, 1917, Reggie Gamble, a madam from a Tenderloin brothel, led a group of several hundred sex workers in what might be called the first women’s march in San Francisco. Gamble, along with fellow madam Maude Spencer, led the women to the Central Methodist Church, where they assembled in one of the most unusual congregations ever to have gathered in the city. “If you want to stop prostitution, stop the new girls from coming in here,” said Gamble. “They are coming into it every day. They will always be coming into it as long as conditions, wages and education are as they are. You don’t do any good by attacking us. Why don’t you attack those conditions?” In The Barbary Coast, Asbury records that the reverend of the Methodist church replied that “a woman could remain virtuous on an income of 10 dollars a week,” or about $190 in today’s currency. The reverend’s figure then, as now, is laughable, and the crowd responded in more or less the same way before shuffling out, with nothing resolved. One hundred years after Gamble and Spencer’s march, the Women’s March of this past January experienced a few of the same anxieties as it opted to include, then disinvite, then re-invite sex workers. Many sex workers were left wondering just how much the movement really valued equality for all women, or whether tolerance came only with invisibility. “We wake up every day to a world that doesn’t want us to exist, profit or thrive,” says Shakti. The more things change … ", "name": "491", "child": "491_1491_1491_1491_1", "timestamp": "Apr 12"}