{"parent": "", "title": "I Thought I Was Important Too", "author": "Jane Hwangbo", "sentences": [{"ccc3": "I Thought I Was Important Too"}, {"3b04": "Photo: Inspiration De"}, {"f9ec": "For the longest time, I believed money was there to make me happy."}, {"0797": "So I used it every chance I got."}, {"1fad": "I spent it and spent it. I bought shoes and makeup and lots and lots of clothes, jewelry, and even fur. My closet in New York couldn’t hold my stuff, so we rented storage. We got a bigger place. We thought about moving to the suburbs."}, {"b785": "I bought experiences that made me feel special too. We went to India, France, Italy, and Mexico. We only stayed at the best places. Five stars or nothing at all. We honeymooned in Anguilla under twinkling lights on a crescent-shaped beach."}, {"8fd1": "I was capitalism’s favorite child. I worked on Wall Street, and spent all of my money. I was hated. I was revered. I was resented for being a girl in a guy’s job. I puffed out my chest to seem bigger. I felt needed."}, {"4f1d": "I was living proof that money couldn’t bring you happiness."}, {"66f5": "When my son arrived, I entered a deep depression. No longer could I make enough money to spend and spend. He anchored me to my home, and though he needed me, I wasn’t paid the way I was used to."}, {"7ec4": "I tried to “connect” with other moms who took pride in their new lives. They could tell I didn’t really want to analyze little Sammy or Jonah’s poop. I craved meaning. But we couldn’t come to terms on what that meant."}, {"9d8b": "So I left, or maybe they left. There was judging."}, {"48a7": "My son cried all the time. I wasn’t sure I could be good enough for him. And everything I had built for a lifetime felt gone."}, {"ff5a": "Gone, gone."}, {"4d23": "Then came my daughter. I believed that more was more. She came out with the face of an apple. I had hope."}, {"95e0": "But I still felt worthless. Each day was difficult."}, {"7a9f": "For eight years, we were picture perfect. Two over-educated, professional parents with two healthy kids. We lived in a beautiful white house in the nicest area in town, with a slanted French roof and green grass that stretched to the edge of a private hill."}, {"1ecf": "I bought furniture to match the walls, and adorned the walls to match the color of the floors."}, {"11a5": "The only place in the house that gathered dust was our living room, where we had gathered all of our family photos. We barely lived in the living room."}, {"f85d": "The edges of every day kept fraying. There was drama. We took hostages. We couldn’t forgive each other."}, {"ce9f": "It was only when things started falling down and being swept away that I saw what I had missed the whole time."}, {"64a1": "There were mountains of clothes on the driveway. We had nice cars parked on the street. Rooms of antique furniture that had cost a fortune being hauled into charity trucks. The estate sales ladies were taking inventory of our heaps of now homeless stuff. Trinkets. Tchotchkes. Fake plants in vases."}, {"390a": "I had consumed all of my life. And that never had been the point."}, {"c586": "From age 17 to 40, I tried to prove my importance with money. The whole time."}, {"27aa": "When our beautiful house stood empty, I finally felt it. The emptiness of half a life wasted."}, {"b84d": "I had done everything backwards when it came to my money. I had been very busy consuming. Trying to have a good time. Buying pretty things. When the best people I knew were busy making huge contributions to others and letting the money flow back to them."}, {"8aa4": "I had created nothing. I had helped no one."}, {"9f35": "I finally let myself sit with my shame."}, {"14c8": "And then I started building."}, {"8346": "The way you build your financial life matters. It was news to me."}, {"12ea": "When you build it based on how much you contribute to other people’s lives, you feel full, even when the money isn’t there yet. I think it’s what people call purpose."}, {"ea94": "Bottom line: you want to keep going. Eventually, the money flows."}, {"2a3d": "When you build a financial life based on consuming, you feel like there’s a bottomless pit inside you. Even if you have a ton of it. It never gets filled up because you’re going about the whole thing backwards. You deplete. Just like me."}, {"4498": "Bottom line: you just want to quit. Eventually, you run out."}, {"c7c1": "You can live a life of ingratitude where you spend all of your money, or you can live a life of service where you invest it in yourself and others. Your choice."}, {"4f51": "I used to think I was somebody. So I used all my money to prove it."}, {"30be": "Now I know that I’m nobody unless I’m helping somebody. This isn’t a bad thing, despite what you see on social media. I simply don’t care about being seen anymore. I’m happy being invisible or visible."}, {"8666": "Start building something with your money that matters to you. And hopefully it matters to other people too."}, {"50ae": "You’ll radiate abundance, and you know what they say about the law of attraction. Like attracts like."}, {"d160": "Hit the ❤ button if you liked this article, please? You’ll help others find it."}, {"2fe0": "Sign up for my free weekly newsletter (packed with thoughts I don’t share anywhere else) at janehwangbo.com."}], "content": "I Thought I Was Important Too Photo: Inspiration De For the longest time, I believed money was there to make me happy. So I used it every chance I got. I spent it and spent it. I bought shoes and makeup and lots and lots of clothes, jewelry, and even fur. My closet in New York couldn’t hold my stuff, so we rented storage. We got a bigger place. We thought about moving to the suburbs. I bought experiences that made me feel special too. We went to India, France, Italy, and Mexico. We only stayed at the best places. Five stars or nothing at all. We honeymooned in Anguilla under twinkling lights on a crescent-shaped beach. I was capitalism’s favorite child. I worked on Wall Street, and spent all of my money. I was hated. I was revered. I was resented for being a girl in a guy’s job. I puffed out my chest to seem bigger. I felt needed. I was living proof that money couldn’t bring you happiness. When my son arrived, I entered a deep depression. No longer could I make enough money to spend and spend. He anchored me to my home, and though he needed me, I wasn’t paid the way I was used to. I tried to “connect” with other moms who took pride in their new lives. They could tell I didn’t really want to analyze little Sammy or Jonah’s poop. I craved meaning. But we couldn’t come to terms on what that meant. So I left, or maybe they left. There was judging. My son cried all the time. I wasn’t sure I could be good enough for him. And everything I had built for a lifetime felt gone. Gone, gone. Then came my daughter. I believed that more was more. She came out with the face of an apple. I had hope. But I still felt worthless. Each day was difficult. For eight years, we were picture perfect. Two over-educated, professional parents with two healthy kids. We lived in a beautiful white house in the nicest area in town, with a slanted French roof and green grass that stretched to the edge of a private hill. I bought furniture to match the walls, and adorned the walls to match the color of the floors. The only place in the house that gathered dust was our living room, where we had gathered all of our family photos. We barely lived in the living room. The edges of every day kept fraying. There was drama. We took hostages. We couldn’t forgive each other. It was only when things started falling down and being swept away that I saw what I had missed the whole time. There were mountains of clothes on the driveway. We had nice cars parked on the street. Rooms of antique furniture that had cost a fortune being hauled into charity trucks. The estate sales ladies were taking inventory of our heaps of now homeless stuff. Trinkets. Tchotchkes. Fake plants in vases. I had consumed all of my life. And that never had been the point. From age 17 to 40, I tried to prove my importance with money. The whole time. When our beautiful house stood empty, I finally felt it. The emptiness of half a life wasted. I had done everything backwards when it came to my money. I had been very busy consuming. Trying to have a good time. Buying pretty things. When the best people I knew were busy making huge contributions to others and letting the money flow back to them. I had created nothing. I had helped no one. I finally let myself sit with my shame. And then I started building. The way you build your financial life matters. It was news to me. When you build it based on how much you contribute to other people’s lives, you feel full, even when the money isn’t there yet. I think it’s what people call purpose. Bottom line: you want to keep going. Eventually, the money flows. When you build a financial life based on consuming, you feel like there’s a bottomless pit inside you. Even if you have a ton of it. It never gets filled up because you’re going about the whole thing backwards. You deplete. Just like me. Bottom line: you just want to quit. Eventually, you run out. You can live a life of ingratitude where you spend all of your money, or you can live a life of service where you invest it in yourself and others. Your choice. I used to think I was somebody. So I used all my money to prove it. Now I know that I’m nobody unless I’m helping somebody. This isn’t a bad thing, despite what you see on social media. I simply don’t care about being seen anymore. I’m happy being invisible or visible. Start building something with your money that matters to you. And hopefully it matters to other people too. You’ll radiate abundance, and you know what they say about the law of attraction. Like attracts like. Hit the ❤ button if you liked this article, please? You’ll help others find it. Sign up for my free weekly newsletter (packed with thoughts I don’t share anywhere else) at janehwangbo.com. ", "name": "5", "child": "5_1\t5_2\t5_3\t5_4\t5_5\t5_6\t5_7\t5_8\t5_9\t5_10\t5_11\t5_12\t5_13\t5_14\t5_15\t5_16\t5_17\t5_18\t5_19\t5_20\t5_21\t5_22\t5_23\t5_24\t5_255_1\t5_2\t5_3\t5_4\t5_5\t5_6\t5_7\t5_8\t5_9\t5_10\t5_11\t5_12\t5_13\t5_14\t5_15\t5_16\t5_17\t5_18\t5_19\t5_20\t5_21\t5_22\t5_23\t5_24\t5_255_1\t5_2\t5_3\t5_4\t5_5\t5_6\t5_7\t5_8\t5_9\t5_10\t5_11\t5_12\t5_13\t5_14\t5_15\t5_16\t5_17\t5_18\t5_19\t5_20\t5_21\t5_22\t5_23\t5_24\t5_255_1\t5_2\t5_3\t5_4\t5_5\t5_6\t5_7\t5_8\t5_9\t5_10\t5_11\t5_12\t5_13\t5_14\t5_15\t5_16\t5_17\t5_18\t5_19\t5_20\t5_21\t5_22\t5_23\t5_24\t5_255_1\t5_2\t5_3\t5_4\t5_5\t5_6\t5_7\t5_8\t5_9\t5_10\t5_11\t5_12\t5_13\t5_14\t5_15\t5_16\t5_17\t5_18\t5_19\t5_20\t5_21\t5_22\t5_23\t5_24\t5_255_1\t5_2\t5_3\t5_4\t5_5\t5_6\t5_7\t5_8\t5_9\t5_10\t5_11\t5_12\t5_13\t5_14\t5_15\t5_16\t5_17\t5_18\t5_19\t5_20\t5_21\t5_22\t5_23\t5_24\t5_255_1\t5_2\t5_3\t5_4\t5_5\t5_6\t5_7\t5_8\t5_9\t5_10\t5_11\t5_12\t5_13\t5_14\t5_15\t5_16\t5_17\t5_18\t5_19\t5_20\t5_21\t5_22\t5_23\t5_24\t5_255_1\t5_2\t5_3\t5_4\t5_5\t5_6\t5_7\t5_8\t5_9\t5_10\t5_11\t5_12\t5_13\t5_14\t5_15\t5_16\t5_17\t5_18\t5_19\t5_20\t5_21\t5_22\t5_23\t5_24\t5_25", "timestamp": "Apr 13"}