{"parent": "", "title": "Freelance Public Servant Diary #1", "author": "Dave Mckenna", "sentences": [{"f560": "Freelance Public Servant Diary #1"}, {"d9e4": "Spring is in the air and I’m looking forward to a new phase in my working life."}, {"ca6e": "Inspired by others like Ben Proctor and Neil Tamplin I thought it would be a good idea to write a diary about my transition from public sector public servant to freelance public servant and beyond."}, {"989d": "I don’t have any definite plans to do this weekly etc — like everything else it’s an experiment so let’s see how it goes."}, {"36a9": "Stuff I’m doing"}, {"aff3": "I’m still a Council employee until the end of June and there is plenty still to do. We are two people short in the team at the moment so I’ve been covering a couple of scrutiny panels. This year we have elections in May so the normal scrutiny year comes to and end about mid April."}, {"37f1": "Once that is out of the way we will be looking forward to induction for the new councillors, workplanning and team development for whatever committees and panels the Council decides to set up."}, {"f714": "Thinking about freelancing I reckon there are three main tasks over the next few months:"}, {"6f63": "Stuff I’m reading"}, {"2b9b": "Generally I’ve been trying to get some kind of sense of the various literatures on governance to see what might be useful for public governance in the UK. I had some great suggestions from Dion Curry in the Swansea University Politics Department as well."}, {"2476": "Anyhow I’ve been looking at:"}], "content": "Freelance Public Servant Diary #1 Spring is in the air and I’m looking forward to a new phase in my working life. Inspired by others like Ben Proctor and Neil Tamplin I thought it would be a good idea to write a diary about my transition from public sector public servant to freelance public servant and beyond. I don’t have any definite plans to do this weekly etc — like everything else it’s an experiment so let’s see how it goes. Stuff I’m doing I’m still a Council employee until the end of June and there is plenty still to do. We are two people short in the team at the moment so I’ve been covering a couple of scrutiny panels. This year we have elections in May so the normal scrutiny year comes to and end about mid April. Once that is out of the way we will be looking forward to induction for the new councillors, workplanning and team development for whatever committees and panels the Council decides to set up. Thinking about freelancing I reckon there are three main tasks over the next few months: Stuff I’m reading Generally I’ve been trying to get some kind of sense of the various literatures on governance to see what might be useful for public governance in the UK. I had some great suggestions from Dion Curry in the Swansea University Politics Department as well. Anyhow I’ve been looking at: ", "name": "502", "child": "502_1", "timestamp": "Mar 29"}