{"parent": "", "title": "Democracy: who needs it?", "author": "Enrique Dans", "sentences": [{"afa8": "IMAGE: Ivelin Radkov — 123RF"}, {"73f2": "Democracy: who needs it?"}, {"da3a": "There is a growing dangerous idea that democracy has become a competitive handicap, a disadvantage or a problem for countries, illustrated by the apparent comparative advantages and higher levels of economic well-being that some authoritarian governments are able to provide their citizens."}, {"72e2": "Which country has been able to generate the largest GDP growth based on purchasing power parity or has been the most successful in bringing millions of people above the poverty line? China, a country that in fact regards democracy as unnecessary. The most populous country in the world is governed by a party whose decisions are incontestable, which is not in any way subject to the popular will, and whose respect for human rights has long been disputed. China restricts its citizens access to information and has the world’s largest system of internet monitoring and surveillance, employing an army of censors larger than its armed forces that largely resembles the real world incarnation of George Orwell’s “1984\", despite which is set to become the global leader in terms of patent applications and intellectual property protection (obviously, the current, defective and unreasonable model of intellectual property lives much better under a dictatorship)."}, {"3668": "If you’re looking for Orwell’s 1984, go to ChinaI’ve commented a number of times here on the efforts of the Chinese government to control its population via the…medium.com"}, {"e3ed": "China is set to take over global leadership from a backward looking United States, a Trumpganistan that wants to put workers back on assembly lines and return to coal mining. China is led by a party who doesn’t believe in democracy, sees elections as a useless, expensive and absurd exercise that can bring unpredictable outcomes."}, {"a781": "In terms of political strategy, a democratic country that guarantees the plurality of sources of information and guarantees the legitimacy of its electoral processes is, in a hyperconnected world, at a disadvantage compared to countries that control their citizens access to information and where nobody believes for an instant that elections are free and fair. No one but the Russian government can influence the Russian elections, but it is relatively easy for Russia to influence the US elections using an internet that has become a tool for internal control, or worse, a weapon to influence the electoral process in democratic countries."}, {"1d62": "Where is the world headed when undemocratic countries learn to use the internet in this way? Countries with powerful internal security systems, that carry out surveillance, monitoring and censorship of their populations, that have bloated, unaccountable intelligence agencies, and that have developed techniques interfere in the internal affairs of other countries are the global leaders."}, {"b18c": "Please, read between the lines: I am fully, absolutely and unequivocally convinced about the importance of democracy, and I would never want to live in a country ruled by a non-democratic government. I was born in a dictatorship, and even though the dictator died when I was just ten years old, I didn’t like what I had the opportunity to see back then. When democracy can be openly questioned, when it is seen as a pointless luxury, we are headed down the road to populism, producing outcomes like Brexit or Donald Trump. We have a problem."}, {"50d9": "(En español, aquí)"}], "content": "IMAGE: Ivelin Radkov — 123RF Democracy: who needs it? There is a growing dangerous idea that democracy has become a competitive handicap, a disadvantage or a problem for countries, illustrated by the apparent comparative advantages and higher levels of economic well-being that some authoritarian governments are able to provide their citizens. Which country has been able to generate the largest GDP growth based on purchasing power parity or has been the most successful in bringing millions of people above the poverty line? China, a country that in fact regards democracy as unnecessary. The most populous country in the world is governed by a party whose decisions are incontestable, which is not in any way subject to the popular will, and whose respect for human rights has long been disputed. China restricts its citizens access to information and has the world’s largest system of internet monitoring and surveillance, employing an army of censors larger than its armed forces that largely resembles the real world incarnation of George Orwell’s “1984\", despite which is set to become the global leader in terms of patent applications and intellectual property protection (obviously, the current, defective and unreasonable model of intellectual property lives much better under a dictatorship). If you’re looking for Orwell’s 1984, go to ChinaI’ve commented a number of times here on the efforts of the Chinese government to control its population via the…medium.com China is set to take over global leadership from a backward looking United States, a Trumpganistan that wants to put workers back on assembly lines and return to coal mining. China is led by a party who doesn’t believe in democracy, sees elections as a useless, expensive and absurd exercise that can bring unpredictable outcomes. In terms of political strategy, a democratic country that guarantees the plurality of sources of information and guarantees the legitimacy of its electoral processes is, in a hyperconnected world, at a disadvantage compared to countries that control their citizens access to information and where nobody believes for an instant that elections are free and fair. No one but the Russian government can influence the Russian elections, but it is relatively easy for Russia to influence the US elections using an internet that has become a tool for internal control, or worse, a weapon to influence the electoral process in democratic countries. Where is the world headed when undemocratic countries learn to use the internet in this way? Countries with powerful internal security systems, that carry out surveillance, monitoring and censorship of their populations, that have bloated, unaccountable intelligence agencies, and that have developed techniques interfere in the internal affairs of other countries are the global leaders. Please, read between the lines: I am fully, absolutely and unequivocally convinced about the importance of democracy, and I would never want to live in a country ruled by a non-democratic government. I was born in a dictatorship, and even though the dictator died when I was just ten years old, I didn’t like what I had the opportunity to see back then. When democracy can be openly questioned, when it is seen as a pointless luxury, we are headed down the road to populism, producing outcomes like Brexit or Donald Trump. We have a problem. (En español, aquí) ", "name": "517", "child": "517_1\t517_2\t517_3517_1\t517_2\t517_3", "timestamp": "Apr 15"}