{"parent": "", "title": "The politics of a Galaxy Far, Far Away…", "author": "Chief, ISD Avenger", "sentences": [{"1437": "The politics of a Galaxy Far, Far Away…"}, {"243a": "How Star Wars can help people understand today’s turbulent world of politics"}, {"3a21": "All Images are subject to copyright and can be removed upon request"}, {"4d79": "A guest article for futureoftheforce.com — the site is committed to considering article submissions from a range of perspectives."}, {"2548": "Star Wars is wildly entertaining with its iconic characters, beautiful landscapes, and epic space battles. The films often strike a chord with the events in global and domestic politics. It is perhaps because the story is set in that galaxy far, far away that people can sometimes miss how closely real-world politics, and the politics of Star Wars, parallel one another— a process that has been apparent since 1977. This article explores some of those parallels."}, {"726b": "The political parallels were most marked in last year’s Rogue One. In its opening scene Orson Krennic, chief architect of the Death Star’s super laser, tracks down Galen Erso, a dedicated and well-intentioned scientist. Readers of James Luceno’s Catalyst book set before the film will have know that Galen had previously left the project (entitled Project Celestial Power) once he found out that his work was being deployed in the specifications for a so called “super weapon”, rather than the cheap sustainable energy source that he was led to believe he was working towards."}, {"5ff4": "In the aforementioned scene in Rogue One, having hunted the scientist down to the planet of Lah’mu, Krennic attempts to persuade Erso to come back to the program to ensure “peace and security for the galaxy”. Galen response to this is to point out that his old friend and colleague was “confusing peace with terror.”“Well, we have to start somewhere” comes Krennic’s chilling retort."}, {"cfa9": "The dreaded Death Star (Rogue One: A Star Wars Story)"}, {"9f37": "Many have compared Galen Erso to J. Robert Oppenheimer, the father of the atomic bomb (including our own Stewart Gardiner in his Catalyst review for Future of the Force). Oppenheimer famously carried regrets about his participation in the Manhattan project. After the first detonation of the atomic bomb he quoted words from the Bhagavad Gita, “Now I am become Death, the destroyer of worlds.” Erso too feels that way. Nuclear proliferation has a ready parallel with the race for the Death Star — a drive for bigger and more destructive weaponry to be utilized to reign through fear."}, {"e05c": "The Erso-Krennic dialogue is multi-faceted though and can be read in many ways. This is the joy of Star Wars — it allows us to explore real world parallels in a safe environment."}, {"345d": "Take for example the distinct views of the academic and political activist, Noam Chomsky who once stated that, “the best way to end terrorism is to stop participating in it.” Chomsky’s statement was deployed in opposition to the strategy of the Bush Doctrine, which asserted that the United States had the right to secure itself against countries that harbor or give aid to terrorist groups. From Chomsky’s quote we can see that he viewed the Bush Doctrine as an exercise in, as Erso put it, “confusing peace with terror”."}, {"284b": "There are other notable parallels with the Bush years to be found in Star Wars. In the 2002 State of the Union, as his nation recovered from the horror of the 9/11 attacks, President George Bush proclaimed, “Either you are with us, or you are with the terrorists.” The 43rd President of the United States, operating in the most extreme of political environments and faced with an unenviable challenge drew a line in the sand; either countries supported what had become known as the War on Terror, or they in effect aided the terrorists."}, {"d5fb": "This “with us or against us” theme can be seen throughout history, including in the Old Testament Book of Joshua, It would have resonated strongly in 2005 with those watching Revenge of the Sith in the cinema. Viewers would have recalled Bush’s relatively recent ultimatum as Anakin angrily declares to Obi-Wan Kenobi, “either you’re with me, or you’re my enemy.” Perhaps Lucas’s feelings on the matter could be made evident when Obi-Wan replies, “Only a Sith deals in absolutes” (although the irony of the absolutist nature of Kenobi’s reply has also not been lost on many viewers)."}, {"0e34": "In this same exchange, Obi-Wan lays his cards firmly on the table, “Anakin, my allegiance is to the Republic — to Democracy!” Kenobi is clear in his belief that the actions of Anakin and Chancellor (now Emperor) were wholly contrary to those of a functioning democratic republic."}, {"5c69": "Obi-Wan vs Anakin on Mustafar"}, {"0f07": "In the same film, we are shown that just as the newly named Darth Vader and Obi-Wan are dueling on Mustafar, Palpatine is in turn addressing the Galactic Senate back on Coruscant."}, {"615a": "Palpatine (falsely) explains how the Jedi have attempted to violently stage a galaxy-wide coup, and in the process details how he has been left severely scarred. He goes on to say that the revolt had been successfully put down, and as a result the Republic “would be reorganized into the first Galactic Empire, for a safe and secure society” As members of the Senate erupt in a standing ovation, Senator Padme Amidala — now wife of Darth Vader and soon-to-be mother of twins Luke and Leia — sadly turns to Senator Bail Organa to state those oft quoted words, “So this is how liberty dies — with thunderous applause…”. The scene symbolises the rise of any totalitarian or military regimes. Throughout history the fabrication of stories and the instilling of fear has been used by groups, of greater or lesser influence, to build a path to absolute rule."}, {"b7ee": "Bail Organa and Padme Amidala (Star Wars Episode III: Revenge of the Sith)"}, {"e69d": "If one watches closely, there are so many examples of scenes throughout the Star Wars saga that lead one to contemplate events in the real world."}, {"fc32": "The original movie itself came out of the ashes of the Vietnam War and the Watergate scandal. Many movie and pop culture experts believe that this is one of the principal reasons that the original trilogy was so successful when it was first released. Not only did it depict universal themes such as hope, redemption in its use of the hero’s journey template, but it was also able to convey something about what everyone in the country, and possibly the world, was thinking about the state of society."}, {"78cf": "As we all move forward into ever more tumultuous times domestically and globally let us hope that we can turn to Star Wars, not just for an escape, but also to help us process the world around us in a thoughtful and considered fashion."}, {"6b55": "May the Force be with you."}, {"96be": "Editor’s Note: For more content from the author — you can find him on Twitter at: @LukePlanewalker"}, {"7125": "Did you enjoy this article? If so please recommend it by hitting the green ♡ so that more people can find it on Medium. We really appreciate your support!"}], "content": "The politics of a Galaxy Far, Far Away… How Star Wars can help people understand today’s turbulent world of politics All Images are subject to copyright and can be removed upon request A guest article for futureoftheforce.com — the site is committed to considering article submissions from a range of perspectives. Star Wars is wildly entertaining with its iconic characters, beautiful landscapes, and epic space battles. The films often strike a chord with the events in global and domestic politics. It is perhaps because the story is set in that galaxy far, far away that people can sometimes miss how closely real-world politics, and the politics of Star Wars, parallel one another— a process that has been apparent since 1977. This article explores some of those parallels. The political parallels were most marked in last year’s Rogue One. In its opening scene Orson Krennic, chief architect of the Death Star’s super laser, tracks down Galen Erso, a dedicated and well-intentioned scientist. Readers of James Luceno’s Catalyst book set before the film will have know that Galen had previously left the project (entitled Project Celestial Power) once he found out that his work was being deployed in the specifications for a so called “super weapon”, rather than the cheap sustainable energy source that he was led to believe he was working towards. In the aforementioned scene in Rogue One, having hunted the scientist down to the planet of Lah’mu, Krennic attempts to persuade Erso to come back to the program to ensure “peace and security for the galaxy”. Galen response to this is to point out that his old friend and colleague was “confusing peace with terror.”“Well, we have to start somewhere” comes Krennic’s chilling retort. The dreaded Death Star (Rogue One: A Star Wars Story) Many have compared Galen Erso to J. Robert Oppenheimer, the father of the atomic bomb (including our own Stewart Gardiner in his Catalyst review for Future of the Force). Oppenheimer famously carried regrets about his participation in the Manhattan project. After the first detonation of the atomic bomb he quoted words from the Bhagavad Gita, “Now I am become Death, the destroyer of worlds.” Erso too feels that way. Nuclear proliferation has a ready parallel with the race for the Death Star — a drive for bigger and more destructive weaponry to be utilized to reign through fear. The Erso-Krennic dialogue is multi-faceted though and can be read in many ways. This is the joy of Star Wars — it allows us to explore real world parallels in a safe environment. Take for example the distinct views of the academic and political activist, Noam Chomsky who once stated that, “the best way to end terrorism is to stop participating in it.” Chomsky’s statement was deployed in opposition to the strategy of the Bush Doctrine, which asserted that the United States had the right to secure itself against countries that harbor or give aid to terrorist groups. From Chomsky’s quote we can see that he viewed the Bush Doctrine as an exercise in, as Erso put it, “confusing peace with terror”. There are other notable parallels with the Bush years to be found in Star Wars. In the 2002 State of the Union, as his nation recovered from the horror of the 9/11 attacks, President George Bush proclaimed, “Either you are with us, or you are with the terrorists.” The 43rd President of the United States, operating in the most extreme of political environments and faced with an unenviable challenge drew a line in the sand; either countries supported what had become known as the War on Terror, or they in effect aided the terrorists. This “with us or against us” theme can be seen throughout history, including in the Old Testament Book of Joshua, It would have resonated strongly in 2005 with those watching Revenge of the Sith in the cinema. Viewers would have recalled Bush’s relatively recent ultimatum as Anakin angrily declares to Obi-Wan Kenobi, “either you’re with me, or you’re my enemy.” Perhaps Lucas’s feelings on the matter could be made evident when Obi-Wan replies, “Only a Sith deals in absolutes” (although the irony of the absolutist nature of Kenobi’s reply has also not been lost on many viewers). In this same exchange, Obi-Wan lays his cards firmly on the table, “Anakin, my allegiance is to the Republic — to Democracy!” Kenobi is clear in his belief that the actions of Anakin and Chancellor (now Emperor) were wholly contrary to those of a functioning democratic republic. Obi-Wan vs Anakin on Mustafar In the same film, we are shown that just as the newly named Darth Vader and Obi-Wan are dueling on Mustafar, Palpatine is in turn addressing the Galactic Senate back on Coruscant. Palpatine (falsely) explains how the Jedi have attempted to violently stage a galaxy-wide coup, and in the process details how he has been left severely scarred. He goes on to say that the revolt had been successfully put down, and as a result the Republic “would be reorganized into the first Galactic Empire, for a safe and secure society” As members of the Senate erupt in a standing ovation, Senator Padme Amidala — now wife of Darth Vader and soon-to-be mother of twins Luke and Leia — sadly turns to Senator Bail Organa to state those oft quoted words, “So this is how liberty dies — with thunderous applause…”. The scene symbolises the rise of any totalitarian or military regimes. Throughout history the fabrication of stories and the instilling of fear has been used by groups, of greater or lesser influence, to build a path to absolute rule. Bail Organa and Padme Amidala (Star Wars Episode III: Revenge of the Sith) If one watches closely, there are so many examples of scenes throughout the Star Wars saga that lead one to contemplate events in the real world. The original movie itself came out of the ashes of the Vietnam War and the Watergate scandal. Many movie and pop culture experts believe that this is one of the principal reasons that the original trilogy was so successful when it was first released. Not only did it depict universal themes such as hope, redemption in its use of the hero’s journey template, but it was also able to convey something about what everyone in the country, and possibly the world, was thinking about the state of society. As we all move forward into ever more tumultuous times domestically and globally let us hope that we can turn to Star Wars, not just for an escape, but also to help us process the world around us in a thoughtful and considered fashion. May the Force be with you. Editor’s Note: For more content from the author — you can find him on Twitter at: @LukePlanewalker Did you enjoy this article? If so please recommend it by hitting the green ♡ so that more people can find it on Medium. We really appreciate your support! ", "name": "520", "child": "520_1\t520_2\t520_3\t520_4\t520_5\t520_6\t520_7\t520_8\t520_9\t520_10\t520_11", "timestamp": "Apr 6"}