{"parent": "", "title": "The Morbid Process Of Preparing For The Queen’s Death", "author": "Ilana Gordon", "sentences": [{"7149": "The Morbid Process Of Preparing For The Queen’s Death"}, {"92b4": "They’ve been planning for 60 years."}, {"3e09": "On April 21st, Queen Elizabeth II will turn 91 years old. During her 65-year reign, she’s outlasted 12 US presidents and she is the only queen most British citizens have ever known."}, {"0392": "Here in the States, we have dynastic families — the Kennedys, the Bushes, the Clintons — but the American government is specifically designed to limit and control the power of our political leaders. And while both British power specifically and monarchal power on the whole have declined considerably during Queen Elizabeth’s reign, Americans cannot truly grasp her significance as a cultural icon and symbol of British power; when she dies, many people will feel as if they lost their own mother."}, {"a095": "In Britain, the deaths of royal family members are heavily orchestrated affairs. When King George V was close to death in 1936, his doctor, Lord Dawson, made the decision to euthanize his patient, injecting him with 750 mg of morphine and a gram of cocaine. The injection was intended to relieve the King’s agony, but also to expedite the process in order for the news to make the next morning’s paper."}, {"babc": "The Queen’s death will be no different. Whether she dies at home or abroad, the country has prepared an incredibly elaborate response strategy."}, {"d84b": "Immediately following her death"}, {"a4e2": "Once the Queen dies, her eldest son, Charles, will inherit the throne. His siblings — Princess Anne, Prince Edward and Prince Andrew — will kiss his hands, pledging their loyalty to the new monarch."}, {"f4b5": "The Queen’s private secretary, Sir Christopher Geidt, will use a secure phone line to contact Britain’s Prime Minister, Theresa May, with the previously agreed-upon code words: “London Bridge is down.” The Queen is the head of state of 15 governments outside the UK and serves as a nominal leader for another 36 nations; the news will pass to the leaders of these countries next."}, {"8424": "Then there is the matter of notifying the media, and subsequently, the rest of the planet. A press release will go out to the UK’s press agency and to media outlets around the world. As soon as the news is made public, a door at Buckingham Palace will open and a footman outfitted in black will exit to pin a “black-edged notice” to the castle gates; the castle website will be updated to a single black webpage bearing the same text as the notice."}, {"8d92": "Around the time of the Cold War, the BBC installed a “radio alert transmission system,” or RATS; the alarm’s purpose was to alert the nation in the event of an attack or emergency. Most BBC staff have only heard the alarm employed in tests, but after the Queen passes, the alarm will sound as a call to national mourning."}, {"62e2": "Lack of content will not be an issue: In Britain, the Guardian reports that the paper’s deputy editor has a list of stories ready to go; the Times of London purportedly has 11 days’ worth of queen-related coverage planned. Other news organizations have practiced extensively, utilizing the name “Mrs. Robinson” during covert rehearsals. Experts are locked into contracts to give their exclusive takes to specific news organizations. Radio stations have crafted two levels of playlists with “sad” and “saddest” music. Fewer comedy programs will air on TV, everyone will wear black and people will be released from work early."}, {"aa72": "The mourning period"}, {"ee9a": "The Queen’s death will be marked by a 12-day mourning period, followed by the funeral. During this time, the newly minted king will take a short tour of four countries to greet his new constituents (Queen Elizabeth embarked on similar tours after her father’s death in 1952)."}, {"de0d": "Princess Elizabeth. | Hulton Archive/Getty Images"}, {"6fd4": "Her body will rest in Buckingham Palace’s throne room, next to an altar, the funeral cloth and the royal standard (a flag depicting the shield of the Royal Arms); four Grenadier Guards — members of the most senior regiment of British infantry — will stand sentinel."}, {"2263": "Since 1672, the Norfolk family has assumed responsibility for royal funeral proceedings; the 18th Duke of Norfolk is in charge of Queen Elizabeth’s funeral. The elaborate ceremony is expected go off without a hitch, largely owing to the fact that they started planning for the event in the 1960s. Organizers meet two to three times a year to update, refine and scrutinize the arrangements. Certain variables are already understood (it will take 28 minutes to march from St. James’s Palace to Westminster Hall, where the body will lie in state). Other factors will be determined in real time by the new king."}, {"de99": "The day after Queen Elizabeth’s death (also known as D+1) Charles will officially be declared king. During the Ascension Council, which will take place that same day, he will pledge a vow to protect the Church in Scotland."}, {"d6f7": "Four days after the Queen’s death (D+4), her coffin will move to Westminster Hall, where it will rest for four days; for 23 hours a day, guards will watch as the Queen’s subjects come to pay their respects. Every detail is plotted out, from how often the wreaths on the coffin will be replaced to how many portable toilets and water stations will be needed to accommodate the half a million people expected to attend."}, {"74dd": "Most businesses will close on the day of the funeral, 12 days after her death. Big Ben will ring at 9am, signifying the start of the proceedings. The funeral will take place in Westminster Abbey, in front of 2,000 guests. When the funeral begins at 11am, the country will cease all activity — for a moment, everyone and everything will stop, acknowledging the end of an era."}, {"145a": "In his incredibly researched article for the Guardian, reporter Sam Knight writes that Queen Elizabeth is “Britain’s last living link with our former greatness — the nation’s id, its problematic self-regard.” The last few years of Queen Elizabeth’s reign have been particularly fraught (see: Brexit; Scotland’s possible defection from the UK; powerful forces in Australia’s government pushing to pull out of the Commonwealth and establish a republic; the possibility that others will follow). The pomp and circumstance expected for Queen Elizabeth’s passing will celebrate her life and mourn her death, but it will also signify the official demise of Britain’s global superiority. When Elizabeth dies, the country will mourn their queen, but also their legacy."}], "content": "The Morbid Process Of Preparing For The Queen’s Death They’ve been planning for 60 years. On April 21st, Queen Elizabeth II will turn 91 years old. During her 65-year reign, she’s outlasted 12 US presidents and she is the only queen most British citizens have ever known. Here in the States, we have dynastic families — the Kennedys, the Bushes, the Clintons — but the American government is specifically designed to limit and control the power of our political leaders. And while both British power specifically and monarchal power on the whole have declined considerably during Queen Elizabeth’s reign, Americans cannot truly grasp her significance as a cultural icon and symbol of British power; when she dies, many people will feel as if they lost their own mother. In Britain, the deaths of royal family members are heavily orchestrated affairs. When King George V was close to death in 1936, his doctor, Lord Dawson, made the decision to euthanize his patient, injecting him with 750 mg of morphine and a gram of cocaine. The injection was intended to relieve the King’s agony, but also to expedite the process in order for the news to make the next morning’s paper. The Queen’s death will be no different. Whether she dies at home or abroad, the country has prepared an incredibly elaborate response strategy. Immediately following her death Once the Queen dies, her eldest son, Charles, will inherit the throne. His siblings — Princess Anne, Prince Edward and Prince Andrew — will kiss his hands, pledging their loyalty to the new monarch. The Queen’s private secretary, Sir Christopher Geidt, will use a secure phone line to contact Britain’s Prime Minister, Theresa May, with the previously agreed-upon code words: “London Bridge is down.” The Queen is the head of state of 15 governments outside the UK and serves as a nominal leader for another 36 nations; the news will pass to the leaders of these countries next. Then there is the matter of notifying the media, and subsequently, the rest of the planet. A press release will go out to the UK’s press agency and to media outlets around the world. As soon as the news is made public, a door at Buckingham Palace will open and a footman outfitted in black will exit to pin a “black-edged notice” to the castle gates; the castle website will be updated to a single black webpage bearing the same text as the notice. Around the time of the Cold War, the BBC installed a “radio alert transmission system,” or RATS; the alarm’s purpose was to alert the nation in the event of an attack or emergency. Most BBC staff have only heard the alarm employed in tests, but after the Queen passes, the alarm will sound as a call to national mourning. Lack of content will not be an issue: In Britain, the Guardian reports that the paper’s deputy editor has a list of stories ready to go; the Times of London purportedly has 11 days’ worth of queen-related coverage planned. Other news organizations have practiced extensively, utilizing the name “Mrs. Robinson” during covert rehearsals. Experts are locked into contracts to give their exclusive takes to specific news organizations. Radio stations have crafted two levels of playlists with “sad” and “saddest” music. Fewer comedy programs will air on TV, everyone will wear black and people will be released from work early. The mourning period The Queen’s death will be marked by a 12-day mourning period, followed by the funeral. During this time, the newly minted king will take a short tour of four countries to greet his new constituents (Queen Elizabeth embarked on similar tours after her father’s death in 1952). Princess Elizabeth. | Hulton Archive/Getty Images Her body will rest in Buckingham Palace’s throne room, next to an altar, the funeral cloth and the royal standard (a flag depicting the shield of the Royal Arms); four Grenadier Guards — members of the most senior regiment of British infantry — will stand sentinel. Since 1672, the Norfolk family has assumed responsibility for royal funeral proceedings; the 18th Duke of Norfolk is in charge of Queen Elizabeth’s funeral. The elaborate ceremony is expected go off without a hitch, largely owing to the fact that they started planning for the event in the 1960s. Organizers meet two to three times a year to update, refine and scrutinize the arrangements. Certain variables are already understood (it will take 28 minutes to march from St. James’s Palace to Westminster Hall, where the body will lie in state). Other factors will be determined in real time by the new king. The day after Queen Elizabeth’s death (also known as D+1) Charles will officially be declared king. During the Ascension Council, which will take place that same day, he will pledge a vow to protect the Church in Scotland. Four days after the Queen’s death (D+4), her coffin will move to Westminster Hall, where it will rest for four days; for 23 hours a day, guards will watch as the Queen’s subjects come to pay their respects. Every detail is plotted out, from how often the wreaths on the coffin will be replaced to how many portable toilets and water stations will be needed to accommodate the half a million people expected to attend. Most businesses will close on the day of the funeral, 12 days after her death. Big Ben will ring at 9am, signifying the start of the proceedings. The funeral will take place in Westminster Abbey, in front of 2,000 guests. When the funeral begins at 11am, the country will cease all activity — for a moment, everyone and everything will stop, acknowledging the end of an era. In his incredibly researched article for the Guardian, reporter Sam Knight writes that Queen Elizabeth is “Britain’s last living link with our former greatness — the nation’s id, its problematic self-regard.” The last few years of Queen Elizabeth’s reign have been particularly fraught (see: Brexit; Scotland’s possible defection from the UK; powerful forces in Australia’s government pushing to pull out of the Commonwealth and establish a republic; the possibility that others will follow). The pomp and circumstance expected for Queen Elizabeth’s passing will celebrate her life and mourn her death, but it will also signify the official demise of Britain’s global superiority. When Elizabeth dies, the country will mourn their queen, but also their legacy. ", "name": "521", "child": "521_1\t521_2\t521_3", "timestamp": "Apr 13"}