{"parent": "", "title": "Thank inventor Margaret E. Knight for the modern marvel that is the paper bag", "author": "Stephanie Buck", "sentences": [{"308d": "Thank inventor Margaret E. Knight for the modern marvel that is the paper bag"}, {"db69": "Because who wants to carry groceries in a paper cone?"}, {"c0ab": "Before flat-bottomed paper bags, shoppers carried purchases in wooden crates or rolled into paper cones. At best, they got wimpy envelopes that tapered into a V-shape, which everyone knows are barely durable enough for greeting cards."}, {"f8c1": "The force behind those sturdy Whole Foods paper bags you can reuse a hundred times: Margaret E. Knight. In 1868, Knight invented a wooden machine that folded and glued paper into an economical, roomy, and rectangular receptacle."}, {"eaa7": "Then a man stole her idea."}, {"429a": "From a young age, Knight was an inventor. Raised by a widowed mother in York, Maine, Knight scraped together what little tools and materials she could to solve problems around the house. She built toys for her older brothers, and a foot warmer to comfort her mother during late-night sewing sessions."}, {"b0eb": "Knight left school in 1850, at age 12, to earn money for the family at a nearby textile factory. There she witnessed a part fly from a motorized textile loom and injure a worker. To improve safety, Knight invented a stop-motion device that automatically killed a machine’s power if a part was malfunctioning. Soon cotton mills around the country had adopted the device, though Knight never made money off her creation. Women and girls were discouraged from filing patents at the time."}, {"81b1": "But in 1870, Knight knew she had something even bigger. While working at a paper bag factory in Springfield, Massachusetts, she envisioned a machine that could create a more secure, flat base. Using a series of springs, cutting tools, and a piece of tin she called a “plate knife holder” which did the actual folding, she built a wooden model that completed 1,000 bags during testing. It was only 2.5 feet long and 1 foot wide."}, {"e035": "She brought her model to Boston, where it was made into iron. But during construction, a man named Charles Annan spied Knight’s invention and quickly patented the device himself. To Knight’s surprise, when she attempted to patent the machine a few months later, Annan’s name already held the spot."}, {"1d4b": "Unwilling to let her hard work go to waste, Knight took the matter to court. She brought detailed notes, sketches, measurements, instructions, and witnesses from three shops that testified to her process. Annan’s only argument was that his machine contained slight modifications, presumably because he misremembered the original model. Some lore suggests he insisted a woman could not invent such a complex apparatus."}, {"c90f": "The Patents Office awarded Knight the rights in 1871. Queen Victoria decorated her with the Royal Legion of Honour the same year, as flat-bottomed paper bags had quickly spread across the world."}, {"284f": "After “disrupting” the packaging industry, Knight went on to file at least 27 more patents, though some accounts insist it was closer to 80. Most improved on heavy machinery, but she also created devices for cutting shoe soles, a fire extinguisher, and a skirt protector."}, {"9368": "In 1913, The New York Times reported Knight “at the age of seventy, is working twenty hours a day on her 89th invention.” She died the following year. Her net worth was estimated at $275.05, just under $7,000 by today’s standards. The media hailed her a “lady Edison.”"}, {"c659": "Toward the end of her life, Knight once lamented, “I’m only sorry I couldn’t have had as good a chance as a boy, and have been put to my trade regularly.”"}], "content": "Thank inventor Margaret E. Knight for the modern marvel that is the paper bag Because who wants to carry groceries in a paper cone? Before flat-bottomed paper bags, shoppers carried purchases in wooden crates or rolled into paper cones. At best, they got wimpy envelopes that tapered into a V-shape, which everyone knows are barely durable enough for greeting cards. The force behind those sturdy Whole Foods paper bags you can reuse a hundred times: Margaret E. Knight. In 1868, Knight invented a wooden machine that folded and glued paper into an economical, roomy, and rectangular receptacle. Then a man stole her idea. From a young age, Knight was an inventor. Raised by a widowed mother in York, Maine, Knight scraped together what little tools and materials she could to solve problems around the house. She built toys for her older brothers, and a foot warmer to comfort her mother during late-night sewing sessions. Knight left school in 1850, at age 12, to earn money for the family at a nearby textile factory. There she witnessed a part fly from a motorized textile loom and injure a worker. To improve safety, Knight invented a stop-motion device that automatically killed a machine’s power if a part was malfunctioning. Soon cotton mills around the country had adopted the device, though Knight never made money off her creation. Women and girls were discouraged from filing patents at the time. But in 1870, Knight knew she had something even bigger. While working at a paper bag factory in Springfield, Massachusetts, she envisioned a machine that could create a more secure, flat base. Using a series of springs, cutting tools, and a piece of tin she called a “plate knife holder” which did the actual folding, she built a wooden model that completed 1,000 bags during testing. It was only 2.5 feet long and 1 foot wide. She brought her model to Boston, where it was made into iron. But during construction, a man named Charles Annan spied Knight’s invention and quickly patented the device himself. To Knight’s surprise, when she attempted to patent the machine a few months later, Annan’s name already held the spot. Unwilling to let her hard work go to waste, Knight took the matter to court. She brought detailed notes, sketches, measurements, instructions, and witnesses from three shops that testified to her process. Annan’s only argument was that his machine contained slight modifications, presumably because he misremembered the original model. Some lore suggests he insisted a woman could not invent such a complex apparatus. The Patents Office awarded Knight the rights in 1871. Queen Victoria decorated her with the Royal Legion of Honour the same year, as flat-bottomed paper bags had quickly spread across the world. After “disrupting” the packaging industry, Knight went on to file at least 27 more patents, though some accounts insist it was closer to 80. Most improved on heavy machinery, but she also created devices for cutting shoe soles, a fire extinguisher, and a skirt protector. In 1913, The New York Times reported Knight “at the age of seventy, is working twenty hours a day on her 89th invention.” She died the following year. Her net worth was estimated at $275.05, just under $7,000 by today’s standards. The media hailed her a “lady Edison.” Toward the end of her life, Knight once lamented, “I’m only sorry I couldn’t have had as good a chance as a boy, and have been put to my trade regularly.” ", "name": "522", "child": "522_1", "timestamp": "Apr 14"}