{"parent": "", "title": "What Skills Have The Highest Hourly Pay?", "author": "Niklas Goeke", "sentences": [{"040d": "What Skills Have The Highest Hourly Pay?"}, {"47ad": "A Non-Obvious Lesson About Maximizing Your Value At Work"}, {"eead": "This is Charles Proteus Steinmetz."}, {"f776": "Charles was a German-born, American mathematician, electrical engineer, who spent most of his life in Schenectady, New York, as a professor at Union College."}, {"ea3c": "You can thank him for the thing we all most depend on in life:"}, {"1dbc": "Electricity."}, {"fb52": "Charles helped shape the development of alternating current (AC), and is the reason you can plug your toaster, blender, TV or lamps into the sockets on your wall."}, {"65b4": "As soon as General Electric got word of this little (he was indeed just 4 feet tall) genius’s work in New York, they bought out the company he worked for in 1892, and with it, the man’s expertise."}, {"db21": "In 1965, a Life magazine reader, Jack B. Scott, wrote in to tell the story of an encounter his father had made with the so-called “Wizard of Schenectady” at Henry Ford’s River Rouge plant in Dearborn, Michigan."}, {"ce6d": "Ford’s engineers had a problem they couldn’t fix, and so Steinmetz went down there on behalf of GE. Here’s the excerpt from Smithsonian Magazine:"}, {"7b45": "Ford, whose electrical engineers couldn’t solve some problems they were having with a gigantic generator, called Steinmetz in to the plant. Upon arriving, Steinmetz rejected all assistance and asked only for a notebook, pencil and cot."}, {"fa3a": "According to Scott, Steinmetz listened to the generator and scribbled computations on the notepad for two straight days and nights. On the second night, he asked for a ladder, climbed up the generator and made a chalk mark on its side. Then he told Ford’s skeptical engineers to remove a plate at the mark and replace sixteen windings from the field coil."}, {"8458": "They did, and the generator performed to perfection."}, {"9659": "Henry Ford was thrilled, until he got an invoice from General Electric in the amount of $10,000. Ford acknowledged Steinmetz’s success but balked at the figure. He asked for an itemized bill."}, {"46d5": "Steinmetz, Scott wrote, responded personally to Ford’s request with the following:"}, {"b844": "Making chalk mark on generator: $1."}, {"1c8b": "Knowing where to make mark: $9,999."}, {"d781": "Ford paid the bill."}, {"df42": "For the record, $10,000 in this era, say 1905, would be worth $1,960,000, considered in today’s value of the income of a skilled worker."}, {"6d96": "The skills with the highest hourly pay are never those, which are paid by the hour."}, {"8dcd": "Have you ever paid someone by the hour yourself? Did you think of them as an invaluable advisor? Or rather as a commodity you needed quick access to?"}, {"8274": "It’s ironic: In order to push into the highest spheres of hourly pay rate, you first have to leave it altogether."}, {"33e2": "You’ll have to spend thousands of hours, unpaid hours, researching, learning, studying, practicing and adapting your skills in the real world."}, {"63dd": "Only that will give you the deep domain expertise you need to reach the top 1% of your field — and that comes with great financial reward."}, {"9818": "However, by the time you get there, you’ll probably long have forgotten your struggle for more dollars per hour, because your greatest feeling of accomplishment will come from standing next to your peers."}, {"2bab": "Just like Charles Steinmetz, a little giant among giants, on April 23, 1921, giving Albert Einstein, Albert Hull and several other brilliant minds of his time a tour of the Radio Corporation of America (RCA)."}, {"20cd": "Think it’s smart? Hit the heart! ❤ That way, more people can start to ask questions about being paid hourly."}, {"bc92": "PS: Thanks for Auren Hoffman’s great answer to this question, which reminded me of this story. I first learned about it in my friend Ryan Waggoner’s article The Freelance Rate Mistake Costing You Millions."}, {"a9a1": "I write more here. This started as an answer on www.quora.com."}], "content": "What Skills Have The Highest Hourly Pay? A Non-Obvious Lesson About Maximizing Your Value At Work This is Charles Proteus Steinmetz. Charles was a German-born, American mathematician, electrical engineer, who spent most of his life in Schenectady, New York, as a professor at Union College. You can thank him for the thing we all most depend on in life: Electricity. Charles helped shape the development of alternating current (AC), and is the reason you can plug your toaster, blender, TV or lamps into the sockets on your wall. As soon as General Electric got word of this little (he was indeed just 4 feet tall) genius’s work in New York, they bought out the company he worked for in 1892, and with it, the man’s expertise. In 1965, a Life magazine reader, Jack B. Scott, wrote in to tell the story of an encounter his father had made with the so-called “Wizard of Schenectady” at Henry Ford’s River Rouge plant in Dearborn, Michigan. Ford’s engineers had a problem they couldn’t fix, and so Steinmetz went down there on behalf of GE. Here’s the excerpt from Smithsonian Magazine: Ford, whose electrical engineers couldn’t solve some problems they were having with a gigantic generator, called Steinmetz in to the plant. Upon arriving, Steinmetz rejected all assistance and asked only for a notebook, pencil and cot. According to Scott, Steinmetz listened to the generator and scribbled computations on the notepad for two straight days and nights. On the second night, he asked for a ladder, climbed up the generator and made a chalk mark on its side. Then he told Ford’s skeptical engineers to remove a plate at the mark and replace sixteen windings from the field coil. They did, and the generator performed to perfection. Henry Ford was thrilled, until he got an invoice from General Electric in the amount of $10,000. Ford acknowledged Steinmetz’s success but balked at the figure. He asked for an itemized bill. Steinmetz, Scott wrote, responded personally to Ford’s request with the following: Making chalk mark on generator: $1. Knowing where to make mark: $9,999. Ford paid the bill. For the record, $10,000 in this era, say 1905, would be worth $1,960,000, considered in today’s value of the income of a skilled worker. The skills with the highest hourly pay are never those, which are paid by the hour. Have you ever paid someone by the hour yourself? Did you think of them as an invaluable advisor? Or rather as a commodity you needed quick access to? It’s ironic: In order to push into the highest spheres of hourly pay rate, you first have to leave it altogether. You’ll have to spend thousands of hours, unpaid hours, researching, learning, studying, practicing and adapting your skills in the real world. Only that will give you the deep domain expertise you need to reach the top 1% of your field — and that comes with great financial reward. However, by the time you get there, you’ll probably long have forgotten your struggle for more dollars per hour, because your greatest feeling of accomplishment will come from standing next to your peers. Just like Charles Steinmetz, a little giant among giants, on April 23, 1921, giving Albert Einstein, Albert Hull and several other brilliant minds of his time a tour of the Radio Corporation of America (RCA). Think it’s smart? Hit the heart! ❤ That way, more people can start to ask questions about being paid hourly. PS: Thanks for Auren Hoffman’s great answer to this question, which reminded me of this story. I first learned about it in my friend Ryan Waggoner’s article The Freelance Rate Mistake Costing You Millions. I write more here. This started as an answer on www.quora.com. ", "name": "523", "child": "523_1\t523_2\t523_3\t523_4\t523_5\t523_6\t523_7\t523_8\t523_9523_1\t523_2\t523_3\t523_4\t523_5\t523_6\t523_7\t523_8\t523_9523_1\t523_2\t523_3\t523_4\t523_5\t523_6\t523_7\t523_8\t523_9", "timestamp": "Apr 7"}