{"parent": "", "title": "As the revolution happened in China, the expats in these photos kept partying", "author": "Rian Dundon", "sentences": [{"4db2": "As the revolution happened in China, the expats in these photos kept partying"}, {"738d": "Whooping it up, as the Communists closed in"}, {"a6f3": "In 1947, while the rest if the world was breathing a sigh of postwar relief, China was still deeply embroiled in conflict. Gone were Japan’s occupying forces. But the civil war, which was put on pause for WWII, was again raging between the nationalist Kuomintang and insurgent Communists. In Shanghai, long a cosmopolitan hub of international trade and trends, civil unrest and violent crackdowns were a daily reminder that history was happening in real time."}, {"a46e": "Most of the city’s 60,000 foreign residents had left in 1943 when the Japanese raided the foreign concessions, effectively ending Shanghai’s 101-year status as a treaty port. But for the few expats remaining—Americans and Europeans working in the diplomatic or business sectors—there were still a few good years left to soak up the city’s notorious nightlife and the remainder of their colonial privilege."}, {"192b": "Jack Birns was a young photographer dispatched to Shanghai in late 1946 to cover the civil war for Life magazine. His pictures show a tumultuous city on the verge of chaos, locals suffering the oppressions of Chiang Kai-shek’s Nationalist regime while “hardship-post” expats played tennis and partied in nightclubs. The gap between the privileged foreigners and local people is searing, and it’s easy to imagine why a Communist victory was imminent. The CCP had formed amid the decadence of Shanghai’s internationalism in the 1920s—and it would finish what it started there, too. Within two years of Birns’ arrival in Shanghai, the remaining foreigners would be expelled, and China would recede into decades of isolation."}, {"ca4f": "Shanghai, 1948. (Jack Birns/Life)"}, {"45c3": "Shanghai, 1948. (Jack Birns/Life)"}, {"c96c": "Shanghai, 1948. (Jack Birns/Life)"}, {"e9fc": "Shanghai, 1948. (Jack Birns/Life)"}], "content": "As the revolution happened in China, the expats in these photos kept partying Whooping it up, as the Communists closed in In 1947, while the rest if the world was breathing a sigh of postwar relief, China was still deeply embroiled in conflict. Gone were Japan’s occupying forces. But the civil war, which was put on pause for WWII, was again raging between the nationalist Kuomintang and insurgent Communists. In Shanghai, long a cosmopolitan hub of international trade and trends, civil unrest and violent crackdowns were a daily reminder that history was happening in real time. Most of the city’s 60,000 foreign residents had left in 1943 when the Japanese raided the foreign concessions, effectively ending Shanghai’s 101-year status as a treaty port. But for the few expats remaining—Americans and Europeans working in the diplomatic or business sectors—there were still a few good years left to soak up the city’s notorious nightlife and the remainder of their colonial privilege. Jack Birns was a young photographer dispatched to Shanghai in late 1946 to cover the civil war for Life magazine. His pictures show a tumultuous city on the verge of chaos, locals suffering the oppressions of Chiang Kai-shek’s Nationalist regime while “hardship-post” expats played tennis and partied in nightclubs. The gap between the privileged foreigners and local people is searing, and it’s easy to imagine why a Communist victory was imminent. The CCP had formed amid the decadence of Shanghai’s internationalism in the 1920s—and it would finish what it started there, too. Within two years of Birns’ arrival in Shanghai, the remaining foreigners would be expelled, and China would recede into decades of isolation. Shanghai, 1948. (Jack Birns/Life) Shanghai, 1948. (Jack Birns/Life) Shanghai, 1948. (Jack Birns/Life) Shanghai, 1948. (Jack Birns/Life) ", "name": "524", "child": "524_1\t524_2\t524_3\t524_4", "timestamp": "Apr 9"}