{"parent": "", "title": "Looking for diversity in tech? Start with childcare.", "author": "Kat Miller", "sentences": [{"a060": "Looking for diversity in tech? Start with childcare."}, {"399a": "I’ve spent 6 of my 10 years as a designer working in tech and with startups. When I had my first child last year I was scared. Scared to go through childbirth itself but, honestly, much more frightened of the effect it would have on my career. Would I be hirable as a new mom? How do you balance motherhood and a career? How does childcare fit into all of this?"}, {"a597": "Before our son arrived, I was talking with a friend of mine. The response I received gave me hope. My friend had been lucky enough to work at a company that provided in-house childcare. When her baby was 3 months old, my friend returned to work with her daughter in tow. She was able to see her baby throughout the day and, in turn, was a happier, more invested, employee."}, {"6cef": "With that experience in mind, I started researching childcare options for our baby and that’s when I realized how lucky my friend was. Childcare is expensive, and only getting more so."}, {"4d85": "Oregon is one of 33 states where the average cost of childcare is more than in-state college tuition. Infant care is even more expensive averaging out at $11,322 per year."}, {"b791": "Infant care costs 12% more per month than the average rent in Oregon. If rent is becoming largely unaffordable, specifically here in Portland, childcare absolutely is unobtainable for many. The average cost of childcare is 2 points above the 10% maximum guideline recommended by the US Department of Health and Human Services— this means that only 22% of Oregon working families are able to afford infant childcare."}, {"d2bb": "What that boils down to is this: most families can’t afford to have both parents in the workforce. If one parent’s monthly income is below, at, or slightly above the cost of childcare, that parent often stays at home. The privilege of pursuing a career and being a parent isn’t available to them. And you probably know what I’m going to say next: the parent who stays at home tends to disproportionately be women."}, {"613f": "Understanding the choices families face when it comes to accessing childcare becomes all the more frustrating when the lack of diversity in technology is taken into account. Tech companies have been at the center of the conversation when it comes to the inability to recruit and retain female talent. If better hiring practices and company culture are often cited as the biggest areas of improvement for tech companies why aren’t they shouting from the rooftops about their family friendly policies? That they provide financial support for childcare? That their offices are kid friendly? That they have onsite childcare? Flex scheduling? Family leave? Because most tech companies don’t have these programs. In 2006, the National Compensation Survey found that only “3% of private-sector workers had access to employer-provided funds for childcare.” And remember my friend from the beginning of this story who had access to in-house care? In-house childcare sponsored by a company is the mythical unicorn of perks. In the 2005 National Study of Employers, “among employers with 50 or more employees, only 7 percent provide child care at or near the worksite.”"}, {"a383": "If tech companies are struggling with recruiting and retaining women, it makes financial sense to offer childcare support. Viacom reported in 2005 that by “offering high-quality back up care they saved employees 528 days of unscheduled absences, which resulted in a substantial savings in productivity costs for the company.” Companies save considerable time and money when their employees are able to reliably access to childcare, especially when that care is onsite."}, {"6967": "I’m still working through what being a new mom means to me and what having a career means to not only myself but my new family. When I think about the kind of company I would want to work for, it’s one that supports working families. It’s the kind of company that understand how to make their workforce more diverse with real policies rather than empty blog posts. A company where every parent is supported."}, {"a0d9": "Tech companies, lift up your community. It makes financial sense."}, {"d073": "Thanks to Becca Charlier-Matthews for your editing magic and feedback; Rick Turoczy for encouraging me to write about this; Asa Miller for your love and support; K, my friend who shared her experiences."}], "content": "Looking for diversity in tech? Start with childcare. I’ve spent 6 of my 10 years as a designer working in tech and with startups. When I had my first child last year I was scared. Scared to go through childbirth itself but, honestly, much more frightened of the effect it would have on my career. Would I be hirable as a new mom? How do you balance motherhood and a career? How does childcare fit into all of this? Before our son arrived, I was talking with a friend of mine. The response I received gave me hope. My friend had been lucky enough to work at a company that provided in-house childcare. When her baby was 3 months old, my friend returned to work with her daughter in tow. She was able to see her baby throughout the day and, in turn, was a happier, more invested, employee. With that experience in mind, I started researching childcare options for our baby and that’s when I realized how lucky my friend was. Childcare is expensive, and only getting more so. Oregon is one of 33 states where the average cost of childcare is more than in-state college tuition. Infant care is even more expensive averaging out at $11,322 per year. Infant care costs 12% more per month than the average rent in Oregon. If rent is becoming largely unaffordable, specifically here in Portland, childcare absolutely is unobtainable for many. The average cost of childcare is 2 points above the 10% maximum guideline recommended by the US Department of Health and Human Services— this means that only 22% of Oregon working families are able to afford infant childcare. What that boils down to is this: most families can’t afford to have both parents in the workforce. If one parent’s monthly income is below, at, or slightly above the cost of childcare, that parent often stays at home. The privilege of pursuing a career and being a parent isn’t available to them. And you probably know what I’m going to say next: the parent who stays at home tends to disproportionately be women. Understanding the choices families face when it comes to accessing childcare becomes all the more frustrating when the lack of diversity in technology is taken into account. Tech companies have been at the center of the conversation when it comes to the inability to recruit and retain female talent. If better hiring practices and company culture are often cited as the biggest areas of improvement for tech companies why aren’t they shouting from the rooftops about their family friendly policies? That they provide financial support for childcare? That their offices are kid friendly? That they have onsite childcare? Flex scheduling? Family leave? Because most tech companies don’t have these programs. In 2006, the National Compensation Survey found that only “3% of private-sector workers had access to employer-provided funds for childcare.” And remember my friend from the beginning of this story who had access to in-house care? In-house childcare sponsored by a company is the mythical unicorn of perks. In the 2005 National Study of Employers, “among employers with 50 or more employees, only 7 percent provide child care at or near the worksite.” If tech companies are struggling with recruiting and retaining women, it makes financial sense to offer childcare support. Viacom reported in 2005 that by “offering high-quality back up care they saved employees 528 days of unscheduled absences, which resulted in a substantial savings in productivity costs for the company.” Companies save considerable time and money when their employees are able to reliably access to childcare, especially when that care is onsite. I’m still working through what being a new mom means to me and what having a career means to not only myself but my new family. When I think about the kind of company I would want to work for, it’s one that supports working families. It’s the kind of company that understand how to make their workforce more diverse with real policies rather than empty blog posts. A company where every parent is supported. Tech companies, lift up your community. It makes financial sense. Thanks to Becca Charlier-Matthews for your editing magic and feedback; Rick Turoczy for encouraging me to write about this; Asa Miller for your love and support; K, my friend who shared her experiences. ", "name": "539", "child": "539_1\t539_2539_1\t539_2", "timestamp": "Apr 13"}