{"parent": "", "title": "I Had One Boyfriend, and I Broke His Heart: Sex, Youth, and the Limits of Love", "author": "Hugo Schwyzer", "sentences": [{"18e2": "I Had One Boyfriend, and I Broke His Heart: Sex, Youth, and the Limits of Love"}, {"2e89": "May 1987, Berkeley, California.  Ivy and I walk across campus. It’s finals week, and I’ve dragged her away from a study session to come have an early dinner with me. Ivy is days away from the end of her first year, I’m one final away from the end of my second.   We’ve been dating two months, and it’s a passionate, dramatic mess.   On our way to pizza, we pass Wooster Hall, the architecture building. I glance towards the doors, half-hoping to see him. For the first time in seven months, I do. Thuy has his back to me, a blousy white oxford tucked into blue short shorts, an artist’s portfolio under his arm.   I recognize him by the nape of his strangely long neck, the golden inches between the squared-off hairline and his collar. I stop.  “What is it?” Ivy asks, and then follows my gaze. We stare at Thuy together. Ivy sighs. “I really, really don’t need this now, Hugo. Come on.”  She tugs, and I start to move. Thuy presumably senses our stares, turns. He studies me for a minute, and then gives a slow, almost sarcastic shrug. “What the fuck, Hugo?” the shoulders ask.   The only man I’ve ever called my boyfriend seems in agreement with the woman who’ll be my girlfriend for two more days. Time to move on, Hugo.  August 1986. I meet Thuy at a Gay, Lesbian, Bisexual Alliance mixer. It is the first week of my sophomore year, and I’ve come back to Cal having made the conscious decision to try to date men. I’m finally over my first girlfriend, April. I’ve slept with a couple of other women, but those hookups haven’t turned into anything.  I’m more frustrated that I keep falling in love with women I can’t have, like good female friends who already have boyfriends. I mope a lot.  At 19, I’ve had sex with 50 times more men than women, but almost all those men have been much older than me. Almost all were paying me. Only a few wanted to date me, and of those there wasn’t one who interested me emotionally. Deep down, I’ve assumed I could never love a man the way I love a woman. I’d like to try, I think — if only because the pain of these unrequited crushes on women is so wretched.  I already know I like sex with men. I don’t imagine I could ever be in love with a man the way I can be with women, but perhaps, as my mother puts it, I can find with a man a flame strong enough to warm the house, but not fiery enough to burn it down. I already know women burn my house down."}, {"95a8": "Thuy walks up to me the moment I step into the mixer, introducing himself with casual ease. He’s maybe 5’9”, a slight accent, glasses, and adorable mod haircut. My first thought, which proves correct, is that with that look, he must ride a Vespa. My second thought is that he’s very cute.  We grab sodas and talk. Thuy is a year older than I am, an architecture major from Orange County. Born in Vietnam, his family made it out in 1975, when Thuy was nine. Eleven years later, he carries the hopes of a family who would disown him if they knew he was gay. He tells me his older sister suspects, and tried to get one of her friends to seduce him in hopes of effecting a conversion. It is a comic story tinged with heartbreak, and he tells it well.  We leave the mixer and walk through campus. It is an unusually warm night, even for August, and we’re both sweating from the heat and excitement. I’m wearing the dreadfully commonplace Drakkar; his cologne is something I don’t recognize. I think about asking him, but don’t. What I really want to do is bury my nose in his neck and breathe it in, taste it.  I don’t have to wait long. It is nearly dark, and as we walk past the west side of Dwinelle Hall, Thuy grabs my wrist and deftly maneuvers me against a wall. I have four inches and 50 pounds on him, but he’s the one in control. We kiss, grab each at each other. “What are you wearing?” I stammer, inhaling sharply to make my question obvious. “Zizanie,” he tells me. “And soon, I hope, you.”   Thuy is smooth. I want to drink every inch of him."}, {"ee3a": "Thirty minutes later, we’re back in his immaculate Southside apartment. Three hours later, I sit in his kitchen in my boxers while he makes me tea. I am laughing, giddy — I’ve never had sex this good, this easy, this playful with a man. There is no anxiety about who’s top, who’s bottom, there’s just this flow of bodies and sweat and fingers and affirmations. I’ve come three times, a lot for me even at this age."}, {"c929": "I spend the night. Until now, the only time I had spent the night with a man was a john who paid me extra to stay in the motel with him. (It was awful. I had to be the little spoon, and in his sleep the john rhythmically kissed my shoulder over and over again. I had to wrestle him just to get up to pee.)   Blessedly, Thuy doesn’t want to hold or be held. In the middle of the night, I wake up with that typical “strange bed, strange partner” panic. I look around and realize we’re both on our backs, and our fingers are interlaced. Nothing else is touching. It is terribly sweet, and it’s easy to fall back asleep.  Two nights later, on our second date, I come out to Thuy as bisexual and an off-again, on-again sex worker. I assume that he’ll be more concerned about the former, but he’s not. Instead, he misses the point."}, {"8f14": "“Lots of gay men sleep with women until they accept who they are,” he tells me. “I had sex with a girl once too.” I try to explain that it’s not like that, that I’m probably more romantically and sexually drawn to women than to men, but Thuy is dismissive. I can’t remember if he actually uses the phrase “just a phase” to describe my bisexuality, but it’s certainly what he means.  I don’t feel confident enough to argue.  And anyhow, the sex is great. The sex gets better. I can’t enough of him, nor it seems, he of me. And indeed, at first, I’m the one pushing to get together more often: I’m a sophomore history major, he’s a junior in one of the nation’s most punishing architecture programs. He has more work than I do. I’m sleeping over only two nights a week. I’d like twice that.  And yet, on the nights I’m not with Thuy, I lie in bed and stroke myself thinking about April. I also have a growing crush on Robin, a girl who lives in my co-op, and I daydream about what it would be like to kiss her. I am already half in love with her. I can’t imagine feeling half as much for Thuy."}, {"1df3": "There’s time, though. I hate saying no to new experiences, and the new experience is an experiment: how much can Hugo feel for a dude? I’m used to surprising myself. Maybe I can feel a lot more than I realize."}, {"0254": "We date and fuck and sleep together for three weeks. And then one Monday night, Thuy asks if he can “kidnap” me that coming Saturday. I make a bondage joke, and Thuy looks hurt. “I mean a real date,” he says. “With my boyfriend.”  Boyfriend. That word makes my stomach feel funny. I think of my grandmother, and for a reason I can’t quite articulate, know she would be more upset if she found out I had a boyfriend than if she knew I’d slept with men for money."}, {"adbe": "More to the point, I’m not sure if I want a boyfriend."}, {"2279": "“That would be awesome,” I say, and bite his neck, my hand reaching between his legs. He is half-erect, and I start to run my fingers along his penis. “I love your cock,” I whisper.   Thuy lifts my jaw, kisses my forehead, my eyes, my nose, my mouth. “I love… all this,” he says softly, and I recoil at the mix of fragility and need I hear in his voice. I recoil at the pause after the verb."}, {"2c23": "I need to say something, the boy’s falling in love, and I can’t, I just can’t, I need to stop this now and — I say nothing. I use my mouth instead to kiss my way down Thuy’s chest.   More than ever, I try to show off the skills the men taught me. I think perhaps I’m using pleasure to create distance, but maybe that’s 50 year-old me imposing an insight on my 19 year-old self. It’s safe to say I was turned on, confused and guilty. I was changing the subject.   For a 19 year-old, I’m pretty fucking good at what I do. When Thuy comes, he holds my head and cries out “Hugo, Hugo, Hugo, Hugo.” He keeps repeating my name, more and more softly, until I climb back up his slender body and shut him up with kisses. For years afterward, I will do that same name thing when I ejaculate with women I really like or am in love with. I finally stop when one gal tells me it freaks her the fuck out.  Friday night that week, Thuy takes me to Zachary’s for their legendary pizza. Zachary’s is the sort of place where two college boys can be “out”, even in 1986. We lean into each other, laugh, and when we think it isn’t too obvious, feed each other.   Pizza tends to heighten my optimism. Maybe I can do this boyfriend thing, I decide. Maybe it just takes some getting used to. Maybe I can fall in love with this sweet, sexy guy.  Thuy eats two slices: I gobble the rest. As I munch on the last piece, Thuy pinches my tummy under the table. “It’s a good thing I like that belly of yours,” he says “some guys won’t let you get away with that.”   I put the half-eaten final slice back down, and look away. I feel the tears starting to come. Men have shamed my body for being too pale or too soft or too something since I was 17. I just didn’t expect it, however mildly, from a guy who’s supposed to be falling for me.  Thuy sees my face and is instantly abjectly apologetic, waxing frantically eloquent about how much he likes everything about me. I study his toned arms. Thuy works out five days a week; he has the lean, compact, fat-free body of a gymnast. I am years away from becoming a serious runner myself. Next to him, I feel like a clumsy, oafish bear.  We drive into the Berkeley hills and have sex in his cramped Accord. Our clothes only come half off, but Thuy takes the opportunity to remind me how much he loves my body. His eagerness to atone isn’t sweet. It’s annoying.   I lose my erection. We drive back to his apartment in silence. I wish I could sleep at my own place."}, {"c158": "Saturday morning, Thuy brings me tea in bed. “I’m sorry it’s not a very exciting kidnapping,” he confesses. “I’m just taking you for a day in the city. But it’ll be fun! So get up and shower so you smell good for me!”"}, {"1029": "When we get into his car, Thuy announces he has a present for me. With a flourish, he produces a Crystal Gayle cassette. He knows I love country music, which he despises. I’m not a particular Gayle fan, but the gesture is adorable. We listen to the “Straight to the Heart” album as we drive over the bridge to San Francisco. Thuy reaches for my hand, and I take it.  It is a bright and fogless day. Thuy drives to Golden Gate Park, and as we enter, he starts to lecture about the architecture of the various buildings. His accent and slight lisp are two of my favorite things about him, and I normally like listening to him, but as we park, I begin to feel my stomach start to hurt again.  It only takes me a second to know why. When we were in high school, April and I came here together on a field trip. We were newly in love, and kept sneaking off to make out behind trees. It was a magical day, one of my favorite memories of my very first serious romance."}, {"997f": "And now, at last I get it. I now know with absolute certainty I can never love Thuy the way he already is starting to love me. I can never love Thuy the way I loved April and the way I am sure I will love other girls."}, {"17b9": "Most vitally, I am at last sure that I can never love any man the way I love women. I love sucking cock; I love the feel of a man’s stubble against my own. But my heart just won’t open to boys, not that way. Bisexuality doesn’t mean equal romantic and sexual attraction to both sexes, after all. I’ve known for years that I like fucking both men and women. I now have confirmation of what I had already suspected: I will never be able to have romantic feelings for guys.  I grasp all this in the moments it takes us to walk from the car to the De Young Museum in the heart of the park. I let Thuy be my guide to what I’ve already seen; I squeeze back when he squeezes my hand. If I can hold out to lunch, I tell myself, I’ll tell him then. Just an hour or two."}, {"5c67": "I can’t make it. After a few minutes, Thuy looks at my ashen, anxious face and asks what’s wrong. I ask if we can go sit down, and worried, he agrees. We go outside and sit on the grass and in a heated rush tell him I can’t love him, can’t love any man, that I can only love women, that men are for friendship and sex and I’m happy to be his friend and I like fucking but we can’t keep acting like this.   I cover my face out of fear of his anger. Thuy doesn’t get angry. After a moment of contemplation he starts to sob, deep, wrenching, my dog-has-died sobs. Normally fastidious, he wipes his snot on his shirt, sobs more.   “I’m sorry,” I say.   “Just shut up,” he says."}, {"19b0": "We sit on the grass for half an hour in silence until Thuy collects himself. We rise."}, {"3e59": "“I can take a tram,” I say. “You don’t have to drive me home.”   Thuy tells me not to be an asshole. He’ll drive me.  We are halfway across the Bay Bridge before he says anything. “Never do this to anyone else,” he says coldly. “Learn to be honest with yourself.”"}, {"eda0": "I nod. He drops me off at my apartment. “Please don’t call,” he says, “ and if we see each other, let’s just keep walking.”  I apologize again as I get out of the car. Thuy says nothing, and pulls away the second the door is shut. Except for that one moment with Ivy, I will never see him again."}, {"8bd6": "I do not know what became of Thuy, whose real name is one of the most common possible Vietnamese combinations. He was bright and talented and gorgeous, and I hope his career and his romantic life both flourished in the years after our very brief affair.   I felt guilty for years about this boy, the only man whose heart I ever hurt. Some of the guilt would go when I would be in the same position as Thuy, in love with a lesbian curious to see how much her heart would permit her with a man. The rest of the guilt went when I accepted my younger self as innocent and curious rather than cruel and reckless.  The heart is a flexible muscle, and love and passion can come in, time and again, in unexpected and surprising ways. There are limitations, however, to just how flexible most of us can be. The luckiest of us know those limitations without needing to experiment. The rest of us need to learn through trial and error how we’re meant to love. And a few weeks of trial and error taught me I could not love a boy, not even one as gleaming and lovely as Thuy.  More than 30 years later, on the rare occasions I catch Zizanie on someone’s skin, I remember his taste, his lisp, his touch, and his tears.   But that, that’s not enough for love."}], "content": "I Had One Boyfriend, and I Broke His Heart: Sex, Youth, and the Limits of Love May 1987, Berkeley, California.  Ivy and I walk across campus. It’s finals week, and I’ve dragged her away from a study session to come have an early dinner with me. Ivy is days away from the end of her first year, I’m one final away from the end of my second.   We’ve been dating two months, and it’s a passionate, dramatic mess.   On our way to pizza, we pass Wooster Hall, the architecture building. I glance towards the doors, half-hoping to see him. For the first time in seven months, I do. Thuy has his back to me, a blousy white oxford tucked into blue short shorts, an artist’s portfolio under his arm.   I recognize him by the nape of his strangely long neck, the golden inches between the squared-off hairline and his collar. I stop.  “What is it?” Ivy asks, and then follows my gaze. We stare at Thuy together. Ivy sighs. “I really, really don’t need this now, Hugo. Come on.”  She tugs, and I start to move. Thuy presumably senses our stares, turns. He studies me for a minute, and then gives a slow, almost sarcastic shrug. “What the fuck, Hugo?” the shoulders ask.   The only man I’ve ever called my boyfriend seems in agreement with the woman who’ll be my girlfriend for two more days. Time to move on, Hugo.  August 1986. I meet Thuy at a Gay, Lesbian, Bisexual Alliance mixer. It is the first week of my sophomore year, and I’ve come back to Cal having made the conscious decision to try to date men. I’m finally over my first girlfriend, April. I’ve slept with a couple of other women, but those hookups haven’t turned into anything.  I’m more frustrated that I keep falling in love with women I can’t have, like good female friends who already have boyfriends. I mope a lot.  At 19, I’ve had sex with 50 times more men than women, but almost all those men have been much older than me. Almost all were paying me. Only a few wanted to date me, and of those there wasn’t one who interested me emotionally. Deep down, I’ve assumed I could never love a man the way I love a woman. I’d like to try, I think — if only because the pain of these unrequited crushes on women is so wretched.  I already know I like sex with men. I don’t imagine I could ever be in love with a man the way I can be with women, but perhaps, as my mother puts it, I can find with a man a flame strong enough to warm the house, but not fiery enough to burn it down. I already know women burn my house down. Thuy walks up to me the moment I step into the mixer, introducing himself with casual ease. He’s maybe 5’9”, a slight accent, glasses, and adorable mod haircut. My first thought, which proves correct, is that with that look, he must ride a Vespa. My second thought is that he’s very cute.  We grab sodas and talk. Thuy is a year older than I am, an architecture major from Orange County. Born in Vietnam, his family made it out in 1975, when Thuy was nine. Eleven years later, he carries the hopes of a family who would disown him if they knew he was gay. He tells me his older sister suspects, and tried to get one of her friends to seduce him in hopes of effecting a conversion. It is a comic story tinged with heartbreak, and he tells it well.  We leave the mixer and walk through campus. It is an unusually warm night, even for August, and we’re both sweating from the heat and excitement. I’m wearing the dreadfully commonplace Drakkar; his cologne is something I don’t recognize. I think about asking him, but don’t. What I really want to do is bury my nose in his neck and breathe it in, taste it.  I don’t have to wait long. It is nearly dark, and as we walk past the west side of Dwinelle Hall, Thuy grabs my wrist and deftly maneuvers me against a wall. I have four inches and 50 pounds on him, but he’s the one in control. We kiss, grab each at each other. “What are you wearing?” I stammer, inhaling sharply to make my question obvious. “Zizanie,” he tells me. “And soon, I hope, you.”   Thuy is smooth. I want to drink every inch of him. Thirty minutes later, we’re back in his immaculate Southside apartment. Three hours later, I sit in his kitchen in my boxers while he makes me tea. I am laughing, giddy — I’ve never had sex this good, this easy, this playful with a man. There is no anxiety about who’s top, who’s bottom, there’s just this flow of bodies and sweat and fingers and affirmations. I’ve come three times, a lot for me even at this age. I spend the night. Until now, the only time I had spent the night with a man was a john who paid me extra to stay in the motel with him. (It was awful. I had to be the little spoon, and in his sleep the john rhythmically kissed my shoulder over and over again. I had to wrestle him just to get up to pee.)   Blessedly, Thuy doesn’t want to hold or be held. In the middle of the night, I wake up with that typical “strange bed, strange partner” panic. I look around and realize we’re both on our backs, and our fingers are interlaced. Nothing else is touching. It is terribly sweet, and it’s easy to fall back asleep.  Two nights later, on our second date, I come out to Thuy as bisexual and an off-again, on-again sex worker. I assume that he’ll be more concerned about the former, but he’s not. Instead, he misses the point. “Lots of gay men sleep with women until they accept who they are,” he tells me. “I had sex with a girl once too.” I try to explain that it’s not like that, that I’m probably more romantically and sexually drawn to women than to men, but Thuy is dismissive. I can’t remember if he actually uses the phrase “just a phase” to describe my bisexuality, but it’s certainly what he means.  I don’t feel confident enough to argue.  And anyhow, the sex is great. The sex gets better. I can’t enough of him, nor it seems, he of me. And indeed, at first, I’m the one pushing to get together more often: I’m a sophomore history major, he’s a junior in one of the nation’s most punishing architecture programs. He has more work than I do. I’m sleeping over only two nights a week. I’d like twice that.  And yet, on the nights I’m not with Thuy, I lie in bed and stroke myself thinking about April. I also have a growing crush on Robin, a girl who lives in my co-op, and I daydream about what it would be like to kiss her. I am already half in love with her. I can’t imagine feeling half as much for Thuy. There’s time, though. I hate saying no to new experiences, and the new experience is an experiment: how much can Hugo feel for a dude? I’m used to surprising myself. Maybe I can feel a lot more than I realize. We date and fuck and sleep together for three weeks. And then one Monday night, Thuy asks if he can “kidnap” me that coming Saturday. I make a bondage joke, and Thuy looks hurt. “I mean a real date,” he says. “With my boyfriend.”  Boyfriend. That word makes my stomach feel funny. I think of my grandmother, and for a reason I can’t quite articulate, know she would be more upset if she found out I had a boyfriend than if she knew I’d slept with men for money. More to the point, I’m not sure if I want a boyfriend. “That would be awesome,” I say, and bite his neck, my hand reaching between his legs. He is half-erect, and I start to run my fingers along his penis. “I love your cock,” I whisper.   Thuy lifts my jaw, kisses my forehead, my eyes, my nose, my mouth. “I love… all this,” he says softly, and I recoil at the mix of fragility and need I hear in his voice. I recoil at the pause after the verb. I need to say something, the boy’s falling in love, and I can’t, I just can’t, I need to stop this now and — I say nothing. I use my mouth instead to kiss my way down Thuy’s chest.   More than ever, I try to show off the skills the men taught me. I think perhaps I’m using pleasure to create distance, but maybe that’s 50 year-old me imposing an insight on my 19 year-old self. It’s safe to say I was turned on, confused and guilty. I was changing the subject.   For a 19 year-old, I’m pretty fucking good at what I do. When Thuy comes, he holds my head and cries out “Hugo, Hugo, Hugo, Hugo.” He keeps repeating my name, more and more softly, until I climb back up his slender body and shut him up with kisses. For years afterward, I will do that same name thing when I ejaculate with women I really like or am in love with. I finally stop when one gal tells me it freaks her the fuck out.  Friday night that week, Thuy takes me to Zachary’s for their legendary pizza. Zachary’s is the sort of place where two college boys can be “out”, even in 1986. We lean into each other, laugh, and when we think it isn’t too obvious, feed each other.   Pizza tends to heighten my optimism. Maybe I can do this boyfriend thing, I decide. Maybe it just takes some getting used to. Maybe I can fall in love with this sweet, sexy guy.  Thuy eats two slices: I gobble the rest. As I munch on the last piece, Thuy pinches my tummy under the table. “It’s a good thing I like that belly of yours,” he says “some guys won’t let you get away with that.”   I put the half-eaten final slice back down, and look away. I feel the tears starting to come. Men have shamed my body for being too pale or too soft or too something since I was 17. I just didn’t expect it, however mildly, from a guy who’s supposed to be falling for me.  Thuy sees my face and is instantly abjectly apologetic, waxing frantically eloquent about how much he likes everything about me. I study his toned arms. Thuy works out five days a week; he has the lean, compact, fat-free body of a gymnast. I am years away from becoming a serious runner myself. Next to him, I feel like a clumsy, oafish bear.  We drive into the Berkeley hills and have sex in his cramped Accord. Our clothes only come half off, but Thuy takes the opportunity to remind me how much he loves my body. His eagerness to atone isn’t sweet. It’s annoying.   I lose my erection. We drive back to his apartment in silence. I wish I could sleep at my own place. Saturday morning, Thuy brings me tea in bed. “I’m sorry it’s not a very exciting kidnapping,” he confesses. “I’m just taking you for a day in the city. But it’ll be fun! So get up and shower so you smell good for me!” When we get into his car, Thuy announces he has a present for me. With a flourish, he produces a Crystal Gayle cassette. He knows I love country music, which he despises. I’m not a particular Gayle fan, but the gesture is adorable. We listen to the “Straight to the Heart” album as we drive over the bridge to San Francisco. Thuy reaches for my hand, and I take it.  It is a bright and fogless day. Thuy drives to Golden Gate Park, and as we enter, he starts to lecture about the architecture of the various buildings. His accent and slight lisp are two of my favorite things about him, and I normally like listening to him, but as we park, I begin to feel my stomach start to hurt again.  It only takes me a second to know why. When we were in high school, April and I came here together on a field trip. We were newly in love, and kept sneaking off to make out behind trees. It was a magical day, one of my favorite memories of my very first serious romance. And now, at last I get it. I now know with absolute certainty I can never love Thuy the way he already is starting to love me. I can never love Thuy the way I loved April and the way I am sure I will love other girls. Most vitally, I am at last sure that I can never love any man the way I love women. I love sucking cock; I love the feel of a man’s stubble against my own. But my heart just won’t open to boys, not that way. Bisexuality doesn’t mean equal romantic and sexual attraction to both sexes, after all. I’ve known for years that I like fucking both men and women. I now have confirmation of what I had already suspected: I will never be able to have romantic feelings for guys.  I grasp all this in the moments it takes us to walk from the car to the De Young Museum in the heart of the park. I let Thuy be my guide to what I’ve already seen; I squeeze back when he squeezes my hand. If I can hold out to lunch, I tell myself, I’ll tell him then. Just an hour or two. I can’t make it. After a few minutes, Thuy looks at my ashen, anxious face and asks what’s wrong. I ask if we can go sit down, and worried, he agrees. We go outside and sit on the grass and in a heated rush tell him I can’t love him, can’t love any man, that I can only love women, that men are for friendship and sex and I’m happy to be his friend and I like fucking but we can’t keep acting like this.   I cover my face out of fear of his anger. Thuy doesn’t get angry. After a moment of contemplation he starts to sob, deep, wrenching, my dog-has-died sobs. Normally fastidious, he wipes his snot on his shirt, sobs more.   “I’m sorry,” I say.   “Just shut up,” he says. We sit on the grass for half an hour in silence until Thuy collects himself. We rise. “I can take a tram,” I say. “You don’t have to drive me home.”   Thuy tells me not to be an asshole. He’ll drive me.  We are halfway across the Bay Bridge before he says anything. “Never do this to anyone else,” he says coldly. “Learn to be honest with yourself.” I nod. He drops me off at my apartment. “Please don’t call,” he says, “ and if we see each other, let’s just keep walking.”  I apologize again as I get out of the car. Thuy says nothing, and pulls away the second the door is shut. Except for that one moment with Ivy, I will never see him again. I do not know what became of Thuy, whose real name is one of the most common possible Vietnamese combinations. He was bright and talented and gorgeous, and I hope his career and his romantic life both flourished in the years after our very brief affair.   I felt guilty for years about this boy, the only man whose heart I ever hurt. Some of the guilt would go when I would be in the same position as Thuy, in love with a lesbian curious to see how much her heart would permit her with a man. The rest of the guilt went when I accepted my younger self as innocent and curious rather than cruel and reckless.  The heart is a flexible muscle, and love and passion can come in, time and again, in unexpected and surprising ways. There are limitations, however, to just how flexible most of us can be. The luckiest of us know those limitations without needing to experiment. The rest of us need to learn through trial and error how we’re meant to love. And a few weeks of trial and error taught me I could not love a boy, not even one as gleaming and lovely as Thuy.  More than 30 years later, on the rare occasions I catch Zizanie on someone’s skin, I remember his taste, his lisp, his touch, and his tears.   But that, that’s not enough for love. ", "name": "551", "child": "551_1\t551_2\t551_3\t551_4", "timestamp": "Apr 14"}