{"parent": "", "title": "What it’s Like to Die", "author": "Dan Moore", "sentences": [{"426e": "What it’s Like to Die"}, {"19d7": "The Feeling of Fading Away"}, {"8147": "Fentanyl is a powerful synthetic opioid analgesic. It’s like morphine, just 50 to 100 times more potent. It’s what the EMTs give me as they close the back doors of the ambulance and secure the restraints of my gurney. They inject it through a needle thick as a small straw. It feels blue as it seeps into my bloodstream. Cold and blue."}, {"f21a": "Quickly, as the ambulance starts down the street, the chaos of the preceding handful of minutes recedes. The pedestrians hovering on the corner, the fire trucks, the broken glass — it all dissipates. I relax. My heart slows."}, {"df7f": "Around me however, things continue moving very fast. Machines blink and dial. The ambulance rounds a corner and starts juking through traffic, which causes my gurney to jostle. A pair of hands hold my arm, press down on the vein where the needle has been inserted, ensuring it stays in place. A voice behind me speaks into a radio, or phone, his sentences clipped, precise, urgent. The man pressing down on my arm asks for my name and whether I can feel my legs. I ignore him and ask about my wife, where is she? And what about my kids? Are they OK? He seems to ignore me, reports something to his partner instead."}, {"8c7e": "I feel as if I am floating."}, {"d7a4": "Soon we are at the hospital. The EMTs push me down a hallway lined by faces and clipboards. A variety of people, colors, and hand-held devices blur along the periphery of my vision. They fade as I’m installed in a room, at which point a swarm of doctors and nurses coalesce around me. They speak in tones that are measured and low. For a moment, I find their voices oddly comforting. I can’t lift my head, and so I resolve to gazing peacefully past their open eyes, into the perforations of the mineral fiber ceiling tiles, listening to their voices the way one listens to the ocean — gently, respectfully, meditatively."}, {"40f0": "But before too long, their voices seem to change in pitch, kick into a somehow more violent key. Someone starts cutting off my clothes, re-securing the restraints demobilizing my body. A series of brighter lights are positioned over my face."}, {"aefc": "The lights trigger something inside me. Suddenly the variety of hands and faces and glinting metal tools darting across my field of vision strike me as decidedly dangerous. The color of the lights curdle bleak and sickly. I become sharply aware of the fact that I can’t move. I try to talk, try asking again for my family, but nobody answers me. That’s when I remember: I’ve been in an accident, a violent disruption, jangled metal. I recall the brutal texture of the street as I was being dragged out of the car. I remember that my family was with me, inside."}, {"413c": "I start to panic. I try once more to escape from my restraints, but still I can’t move. I need to find out where my wife is, where my kids are, whether they’re alright. Voices and drills and more metal tools clatter electrically above, all around. I try to scream, as nothing else seems to be working. But then a mask is lowered over my face. It smells of chemicals."}, {"190d": "The goal of drugs like fentanyl, or morphine, or anesthesia, I know — or knew, back when I was capable of knowing things — is to help people fade away from reality. To sedate one’s sense of self-awareness and help one forget about what it’s like to be alive, now, to have regrets and to have lost and to be human, now, in these moments of unbearable reality."}, {"8feb": "Such drugs come in a variety of forms. I will become familiar with some in the years that follow this night in the hospital, once I give up on rebuilding the life I’ve lost and resolve instead to pursuing the oblivion I feel as the mask is secured over my mouth, and the world inside my head calms back down, and slowly — finally — I stop floating and sink into something both heavy and light, both nothing and everything, a body of water or gelatinous matter with no beginning or end, just a glorious, momentary absence of pain."}, {"2229": "I’m not even sure, now, whether I’m still alive or not."}, {"9a92": "If you enjoyed this story, please click the little heart so more people can read it."}], "content": "What it’s Like to Die The Feeling of Fading Away Fentanyl is a powerful synthetic opioid analgesic. It’s like morphine, just 50 to 100 times more potent. It’s what the EMTs give me as they close the back doors of the ambulance and secure the restraints of my gurney. They inject it through a needle thick as a small straw. It feels blue as it seeps into my bloodstream. Cold and blue. Quickly, as the ambulance starts down the street, the chaos of the preceding handful of minutes recedes. The pedestrians hovering on the corner, the fire trucks, the broken glass — it all dissipates. I relax. My heart slows. Around me however, things continue moving very fast. Machines blink and dial. The ambulance rounds a corner and starts juking through traffic, which causes my gurney to jostle. A pair of hands hold my arm, press down on the vein where the needle has been inserted, ensuring it stays in place. A voice behind me speaks into a radio, or phone, his sentences clipped, precise, urgent. The man pressing down on my arm asks for my name and whether I can feel my legs. I ignore him and ask about my wife, where is she? And what about my kids? Are they OK? He seems to ignore me, reports something to his partner instead. I feel as if I am floating. Soon we are at the hospital. The EMTs push me down a hallway lined by faces and clipboards. A variety of people, colors, and hand-held devices blur along the periphery of my vision. They fade as I’m installed in a room, at which point a swarm of doctors and nurses coalesce around me. They speak in tones that are measured and low. For a moment, I find their voices oddly comforting. I can’t lift my head, and so I resolve to gazing peacefully past their open eyes, into the perforations of the mineral fiber ceiling tiles, listening to their voices the way one listens to the ocean — gently, respectfully, meditatively. But before too long, their voices seem to change in pitch, kick into a somehow more violent key. Someone starts cutting off my clothes, re-securing the restraints demobilizing my body. A series of brighter lights are positioned over my face. The lights trigger something inside me. Suddenly the variety of hands and faces and glinting metal tools darting across my field of vision strike me as decidedly dangerous. The color of the lights curdle bleak and sickly. I become sharply aware of the fact that I can’t move. I try to talk, try asking again for my family, but nobody answers me. That’s when I remember: I’ve been in an accident, a violent disruption, jangled metal. I recall the brutal texture of the street as I was being dragged out of the car. I remember that my family was with me, inside. I start to panic. I try once more to escape from my restraints, but still I can’t move. I need to find out where my wife is, where my kids are, whether they’re alright. Voices and drills and more metal tools clatter electrically above, all around. I try to scream, as nothing else seems to be working. But then a mask is lowered over my face. It smells of chemicals. The goal of drugs like fentanyl, or morphine, or anesthesia, I know — or knew, back when I was capable of knowing things — is to help people fade away from reality. To sedate one’s sense of self-awareness and help one forget about what it’s like to be alive, now, to have regrets and to have lost and to be human, now, in these moments of unbearable reality. Such drugs come in a variety of forms. I will become familiar with some in the years that follow this night in the hospital, once I give up on rebuilding the life I’ve lost and resolve instead to pursuing the oblivion I feel as the mask is secured over my mouth, and the world inside my head calms back down, and slowly — finally — I stop floating and sink into something both heavy and light, both nothing and everything, a body of water or gelatinous matter with no beginning or end, just a glorious, momentary absence of pain. I’m not even sure, now, whether I’m still alive or not. If you enjoyed this story, please click the little heart so more people can read it. ", "name": "554", "child": "554_1\t554_2\t554_3\t554_4\t554_5\t554_6\t554_7\t554_8\t554_9\t554_10", "timestamp": "Apr 7"}