{"parent": "", "title": "Should We Have A Moral Responsibility To Refugees?", "author": "Benjamin Sledge", "sentences": [{"4f93": "Should We Have A Moral Responsibility To Refugees?"}, {"ee4a": "Well, should we?"}, {"a077": "No one tells you how to act in an awkward situation."}, {"d8cb": "I get uncomfortable enough watching tense moments on TV that I have to look down at my phone and pretend like it’s not happening."}, {"e0f7": "That’s probably why most of us couldn’t look at Alliance’s picture (pronounced Ah-lee-onz) for more than a few moments without glancing around the room."}, {"1723": "The young man on the screen was a student when he was arrested and tortured by the Burundi Secret Police."}, {"4e5b": "Alliance had run a student group that openly opposed some of the Burundi government’s policies. He was just a kid really, so I imagined the story was going to be about how they roughed up some 18-year-old and put the fear-of-God in him. Instead, they arrested him. Then they ordered him to change his position and influence the other members of his student group to change their views as well."}, {"4fa2": "When he refused, that’s when the torture began."}, {"f6d1": "He went days without food or water. They beat him until his body went limp, only to wake him by electrocution, at which point he would pass out once more."}, {"b73a": "This process continued for five days until they dumped his body next to a local river so that the crocodiles would consume his corpse."}, {"1e6c": "He miraculously survived."}, {"3cef": "A local villager found Alliance and contacted his family, and they secretly nursed him back to health. Alliance then escaped to Uganda once he was healthy enough to move."}, {"5fca": "End of story, right? Yay, Uganda for letting him in."}, {"c6aa": "But the Burundi Secret Police caught wind that Alliance had survived and traveled over the border to assassinate him. With no hope left, Alliance returned to Burundi and resolved to die among his people."}, {"c604": "Poor guy, right? Life dealt him a really bad hand. If you’re like me, I was thinking “Wow, that story sucks…I wish there was something we could have done.”"}, {"c6cd": "As luck would have it, Alliance’s family raised enough money for him to escape to America on a student visa."}, {"35ea": "When he arrived in the United States the only English word he knew was “Yes.”"}, {"a27f": "Initially, the man who said he could stay with him in Austin, Texas informed him he had until the end of the week to vacate his home. With nowhere to go, he was left without food when he was hungry, blankets when he was cold, toilet paper when he needed to use the restroom, or air-conditioning when it was 101 outside."}, {"599e": "Alliance, however, found a church that took him in and an American woman named Jony who would become his “American mama.” The church helped feed and cloth him as well as find a place to live. From there, Alliance made friends and even began to assist in the church’s tech department. When his work visa expired, he discovered the post office had lost his new one. To receive a replacement, it would take six-months, during which he had no right to work or request benefits without one. The church, once more, stepped into action and paid his rent while a team of American lawyers from the church’s community went to work to expedite a new work visa."}, {"213b": "You want to stand and cheer when you hear stories like this. People being loved and embraced as humans. Christians actually being Christians. Not just an event happening in a place far away from you."}, {"ebf4": "I guess that’s why this is the best part of the story."}, {"8460": "“Alliance can you stand up?”"}, {"4300": "Three feet away from me a young, dark-skinned man stood up and grinned a mouth full of pearl-white teeth at the crowd gathered."}, {"2066": "I’d seen Alliance every week laughing and interacting with others, having no idea the depth and reality of his story. And that’s when it hit me:"}, {"481d": "This is your neighbor. Treat them accordingly."}, {"b32c": "If you enjoyed reading this, please share and recommend. Then consider supporting a refugee."}, {"79e2": "Press Inquiries | Speaking Inquiries | Join Our Community"}], "content": "Should We Have A Moral Responsibility To Refugees? Well, should we? No one tells you how to act in an awkward situation. I get uncomfortable enough watching tense moments on TV that I have to look down at my phone and pretend like it’s not happening. That’s probably why most of us couldn’t look at Alliance’s picture (pronounced Ah-lee-onz) for more than a few moments without glancing around the room. The young man on the screen was a student when he was arrested and tortured by the Burundi Secret Police. Alliance had run a student group that openly opposed some of the Burundi government’s policies. He was just a kid really, so I imagined the story was going to be about how they roughed up some 18-year-old and put the fear-of-God in him. Instead, they arrested him. Then they ordered him to change his position and influence the other members of his student group to change their views as well. When he refused, that’s when the torture began. He went days without food or water. They beat him until his body went limp, only to wake him by electrocution, at which point he would pass out once more. This process continued for five days until they dumped his body next to a local river so that the crocodiles would consume his corpse. He miraculously survived. A local villager found Alliance and contacted his family, and they secretly nursed him back to health. Alliance then escaped to Uganda once he was healthy enough to move. End of story, right? Yay, Uganda for letting him in. But the Burundi Secret Police caught wind that Alliance had survived and traveled over the border to assassinate him. With no hope left, Alliance returned to Burundi and resolved to die among his people. Poor guy, right? Life dealt him a really bad hand. If you’re like me, I was thinking “Wow, that story sucks…I wish there was something we could have done.” As luck would have it, Alliance’s family raised enough money for him to escape to America on a student visa. When he arrived in the United States the only English word he knew was “Yes.” Initially, the man who said he could stay with him in Austin, Texas informed him he had until the end of the week to vacate his home. With nowhere to go, he was left without food when he was hungry, blankets when he was cold, toilet paper when he needed to use the restroom, or air-conditioning when it was 101 outside. Alliance, however, found a church that took him in and an American woman named Jony who would become his “American mama.” The church helped feed and cloth him as well as find a place to live. From there, Alliance made friends and even began to assist in the church’s tech department. When his work visa expired, he discovered the post office had lost his new one. To receive a replacement, it would take six-months, during which he had no right to work or request benefits without one. The church, once more, stepped into action and paid his rent while a team of American lawyers from the church’s community went to work to expedite a new work visa. You want to stand and cheer when you hear stories like this. People being loved and embraced as humans. Christians actually being Christians. Not just an event happening in a place far away from you. I guess that’s why this is the best part of the story. “Alliance can you stand up?” Three feet away from me a young, dark-skinned man stood up and grinned a mouth full of pearl-white teeth at the crowd gathered. I’d seen Alliance every week laughing and interacting with others, having no idea the depth and reality of his story. And that’s when it hit me: This is your neighbor. Treat them accordingly. If you enjoyed reading this, please share and recommend. Then consider supporting a refugee. Press Inquiries | Speaking Inquiries | Join Our Community ", "name": "562", "child": "562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9", "timestamp": "Feb 7"}