{"parent": "", "title": "Dying : Thoughts from Lent", "author": "Sam Herrmann", "sentences": [{"0d17": "Dying : Thoughts from Lent"}, {"1ab9": "Every Lenten season has a death and a resurrection. This Good Friday I have been reflecting on what death this Lenten season has led me to. I am hopeful for a resurrection, but this Lent has been filled with a keen awareness of what is dying in me."}, {"4dcc": "The past few months have been filled with more spiritual doubt and confusion than I’ve probably ever experienced. I am struggling right now with a good bit of doubt about my faith and the world. I am struggling because I look to the places of faith around me and feel like they are so flimsy in comparison to the issues of the world. I sit in class at school and people ask for prayers on their chances at a summer internship or for their lease applications to be approved, but then I go home to watch the news and see people in Syria dying from a Sarin gas attack. I understand that God can be focused on two situations at once, but how does a summer internship compare to a gas attack? Sometimes it feels at my own Christian school that some of the students are so focused on being the stars of their own life movies that they forget about the greater issues surrounding them."}, {"d425": "So I now have this confusion about why I should be asking God for anything while there are atrocities far greater than anything I experience that are happening all across the world. Meanwhile, other people around me, who have even more than me (they don’t even have jobs as juniors or seniors in college because their parents pay for everything), are complaining about a teacher they don’t like or homework they have to do. Professors are saying we should become CEOs and big recording artists and be creative directors “in the name of Jesus” when we aren’t even talking about the healing of Syria “in the name of Jesus.” No, we’re yelling “Donald! Donald!” as our military drops bombs on that nation."}, {"9df4": "My point is, I don’t know where to turn. I feel like every time I bring up Syria, refugees, war, ISIS, racism, sexism or bigotry, I’m responded to with silly jokes about what Donald Trump will do as our President (because we all know he’s a joke, but evangelicals still voted for him) or a comment from someone telling me to stop talking about such heavy things in a playful atmosphere or even just a meme. I feel silenced about the important things. But if I crack open a beer in my apartment, say a “bad” word or watch movies that have too much sex in them (it’s okay if there’s violence though), then we have to sit down and have a conversation about my heart."}, {"78b8": "What’s right? What’s wrong? Different cultures are telling me different things. I’m looking for the great Consistency, but it’s hard to hear when I’m distracted by the voices of those with the head mics on behind the pulpit."}, {"f00a": "So I’m letting my ethnocentric Christianity die this Good Friday. I’m choosing to let go of my inner-Pharisee and looking to embrace a little Samaritan. I want to die so that the risen Jesus can take His rightful place in my life and in my world."}], "content": "Dying : Thoughts from Lent Every Lenten season has a death and a resurrection. This Good Friday I have been reflecting on what death this Lenten season has led me to. I am hopeful for a resurrection, but this Lent has been filled with a keen awareness of what is dying in me. The past few months have been filled with more spiritual doubt and confusion than I’ve probably ever experienced. I am struggling right now with a good bit of doubt about my faith and the world. I am struggling because I look to the places of faith around me and feel like they are so flimsy in comparison to the issues of the world. I sit in class at school and people ask for prayers on their chances at a summer internship or for their lease applications to be approved, but then I go home to watch the news and see people in Syria dying from a Sarin gas attack. I understand that God can be focused on two situations at once, but how does a summer internship compare to a gas attack? Sometimes it feels at my own Christian school that some of the students are so focused on being the stars of their own life movies that they forget about the greater issues surrounding them. So I now have this confusion about why I should be asking God for anything while there are atrocities far greater than anything I experience that are happening all across the world. Meanwhile, other people around me, who have even more than me (they don’t even have jobs as juniors or seniors in college because their parents pay for everything), are complaining about a teacher they don’t like or homework they have to do. Professors are saying we should become CEOs and big recording artists and be creative directors “in the name of Jesus” when we aren’t even talking about the healing of Syria “in the name of Jesus.” No, we’re yelling “Donald! Donald!” as our military drops bombs on that nation. My point is, I don’t know where to turn. I feel like every time I bring up Syria, refugees, war, ISIS, racism, sexism or bigotry, I’m responded to with silly jokes about what Donald Trump will do as our President (because we all know he’s a joke, but evangelicals still voted for him) or a comment from someone telling me to stop talking about such heavy things in a playful atmosphere or even just a meme. I feel silenced about the important things. But if I crack open a beer in my apartment, say a “bad” word or watch movies that have too much sex in them (it’s okay if there’s violence though), then we have to sit down and have a conversation about my heart. What’s right? What’s wrong? Different cultures are telling me different things. I’m looking for the great Consistency, but it’s hard to hear when I’m distracted by the voices of those with the head mics on behind the pulpit. So I’m letting my ethnocentric Christianity die this Good Friday. I’m choosing to let go of my inner-Pharisee and looking to embrace a little Samaritan. I want to die so that the risen Jesus can take His rightful place in my life and in my world. ", "name": "574", "child": "574_1", "timestamp": "Apr 14"}