{"parent": "", "title": "Farewell My Beautiful Eliza: A Lenten Lesson", "author": "Cynthia Dagnal-Myron", "sentences": [{"e591": "Farewell My Beautiful Eliza: A Lenten Lesson"}, {"b572": "My beautiful Eliza"}, {"72fb": "This won’t take long. Because it still hurts so badly that I don’t want to think about it too much."}, {"2879": "But I think I now understand what Lent is all about — -I’m a newbie Catholic. Just catching on. Slowly."}, {"3546": "So here goes."}, {"040f": "I’ve been wanting a puppy for a long time now. Against my better judgment in a way. I believe I may be a bit too old, at 65, for the stress and strain of caring for a wee one."}, {"bd59": "But about two weeks ago, I received an email about a group of recently rescued pups, among them two of the most beautiful little Cairn terriers I’ve ever seen. Eliza, the female of the pair, was an absolute angel."}, {"bc77": "I had to have her."}, {"0f93": "Turns out she was listed on several Web sites dedicated to rescued pups. So when I called and emailed about her, I found out that there were lots of people who felt as I did."}, {"676b": "But I was absolutely determined, even when she developed colitis and her foster mother let me know I’d have to wait at least another week to stand in line at the Petco their shelter preferred."}, {"e5d5": "I filled out adoption applications, hoping to raise my chances. And kept in touch with the foster mother, too, to prove how much I wanted that little girl."}, {"7d21": "And on adoption day, I arrived at the Petco not long after it opened at 9 a.m., even though the adoptions didn’t begin until 11. And by 10 a.m. I was glad I’d been so early, as a long line of hopefuls formed."}, {"309d": "A Petco staffer went down the line to find out if any of us were waiting for a particular pup. I proudly said, “Eliza,” which gave me “first dibs,” as the shelter manager said when he arrived and went down the list."}, {"2837": "And soon, he brought in Eliza and waved me over. And I was in love at first lick."}, {"585f": "She was even more beautiful in person. Just the sweetest face, ever. I couldn’t believe my luck."}, {"d7d5": "The shelter manager urged me to sit with her for a while, before making my decision. So I decided to humor him for a few minutes."}, {"36b0": "I went to the little “get acquainted” area, and little Eliza wriggled and licked and gazed up at me with such love that I finally couldn’t stand to wait any longer."}, {"0da7": "And just as I was about to get up and start the paperwork, a young woman rushed up and asked, “Is that Eliza?”"}, {"1995": "I admitted it was."}, {"4f9f": "Her face fell. In fact, her whole body slumped."}, {"ba25": "“I thought they didn’t start until 11,” she cried."}, {"3adb": "I honestly thought she was about to cry. And then, I looked behind her and saw a little boy with sad eyes, too. And then a teenage girl, also looking on with deep longing. A concerned father soon arrived as well."}, {"cd38": "But I focused on the little boy, who was just about the age my own daughter had been when I gave her her first puppy. We had been through a tough time, my little girl and I. First a divorce, and then the remarriage and “relocation” of her father to whom she had always been very close, despite some very difficult and even dangerous moments he’d caused."}, {"69dc": "He had stayed home with her when she was a baby, while I worked. Not by choice, but because he couldn’t seem to hold a job — substance abuse issues. But those years had created a strong, sacred bond between them. So his moving away had left her bereft and bewildered."}, {"ada7": "And so I had decided to give her a little “sister” to play with. And they had become exactly like siblings, she and her Bijou, who did not leave us until 17 years later, when her human sister was fully grown and ready to face the world without her constant companion."}, {"ab31": "This little boy had a big family, both parents — it wasn’t quite the same. But he was a little boy. And I was holding a very little girl in my arms. One I’d been told was very feisty and playful and full of mischief."}, {"4d14": "And the little boy’s mother really did look close to tears."}, {"05d8": "“I’ve been calling for two weeks,” she told me. “Because she was sick for a while, so I wanted to make sure she would be here. He’s been wanting puppy for so long — we all love animals. But he really wants a puppy.”"}, {"c676": "She meant he wanted my puppy. I knew that."}, {"3709": "So I looked at her son, and said, “Would you like to hold her?”"}, {"d9f5": "The way his face lit up, the way he cradled her in his arms with such love, well…that was that."}, {"8076": "I gave up Eliza for Lent."}, {"ecd6": "I was always told the sacrifice had to be something precious. And that it should probably hurt at least a little bit."}, {"20cb": "I don’t know if any of that is true. Though it was that day for sure."}, {"49ed": "For me, the important thing is that little Eliza went home with a sweet little boy. And his adorable family. And that she probably had the best day of the first nine weeks of her life, running and jumping and playing the way a puppy should."}, {"3c05": "God bless you, you beautiful little fur ball. I’ll miss you forever."}, {"f77d": "Lesson learned."}, {"3fb8": "Author’s note: Did you enjoy the read? Please click the 💚 below and thanks for your support"}], "content": "Farewell My Beautiful Eliza: A Lenten Lesson My beautiful Eliza This won’t take long. Because it still hurts so badly that I don’t want to think about it too much. But I think I now understand what Lent is all about — -I’m a newbie Catholic. Just catching on. Slowly. So here goes. I’ve been wanting a puppy for a long time now. Against my better judgment in a way. I believe I may be a bit too old, at 65, for the stress and strain of caring for a wee one. But about two weeks ago, I received an email about a group of recently rescued pups, among them two of the most beautiful little Cairn terriers I’ve ever seen. Eliza, the female of the pair, was an absolute angel. I had to have her. Turns out she was listed on several Web sites dedicated to rescued pups. So when I called and emailed about her, I found out that there were lots of people who felt as I did. But I was absolutely determined, even when she developed colitis and her foster mother let me know I’d have to wait at least another week to stand in line at the Petco their shelter preferred. I filled out adoption applications, hoping to raise my chances. And kept in touch with the foster mother, too, to prove how much I wanted that little girl. And on adoption day, I arrived at the Petco not long after it opened at 9 a.m., even though the adoptions didn’t begin until 11. And by 10 a.m. I was glad I’d been so early, as a long line of hopefuls formed. A Petco staffer went down the line to find out if any of us were waiting for a particular pup. I proudly said, “Eliza,” which gave me “first dibs,” as the shelter manager said when he arrived and went down the list. And soon, he brought in Eliza and waved me over. And I was in love at first lick. She was even more beautiful in person. Just the sweetest face, ever. I couldn’t believe my luck. The shelter manager urged me to sit with her for a while, before making my decision. So I decided to humor him for a few minutes. I went to the little “get acquainted” area, and little Eliza wriggled and licked and gazed up at me with such love that I finally couldn’t stand to wait any longer. And just as I was about to get up and start the paperwork, a young woman rushed up and asked, “Is that Eliza?” I admitted it was. Her face fell. In fact, her whole body slumped. “I thought they didn’t start until 11,” she cried. I honestly thought she was about to cry. And then, I looked behind her and saw a little boy with sad eyes, too. And then a teenage girl, also looking on with deep longing. A concerned father soon arrived as well. But I focused on the little boy, who was just about the age my own daughter had been when I gave her her first puppy. We had been through a tough time, my little girl and I. First a divorce, and then the remarriage and “relocation” of her father to whom she had always been very close, despite some very difficult and even dangerous moments he’d caused. He had stayed home with her when she was a baby, while I worked. Not by choice, but because he couldn’t seem to hold a job — substance abuse issues. But those years had created a strong, sacred bond between them. So his moving away had left her bereft and bewildered. And so I had decided to give her a little “sister” to play with. And they had become exactly like siblings, she and her Bijou, who did not leave us until 17 years later, when her human sister was fully grown and ready to face the world without her constant companion. This little boy had a big family, both parents — it wasn’t quite the same. But he was a little boy. And I was holding a very little girl in my arms. One I’d been told was very feisty and playful and full of mischief. And the little boy’s mother really did look close to tears. “I’ve been calling for two weeks,” she told me. “Because she was sick for a while, so I wanted to make sure she would be here. He’s been wanting puppy for so long — we all love animals. But he really wants a puppy.” She meant he wanted my puppy. I knew that. So I looked at her son, and said, “Would you like to hold her?” The way his face lit up, the way he cradled her in his arms with such love, well…that was that. I gave up Eliza for Lent. I was always told the sacrifice had to be something precious. And that it should probably hurt at least a little bit. I don’t know if any of that is true. Though it was that day for sure. For me, the important thing is that little Eliza went home with a sweet little boy. And his adorable family. And that she probably had the best day of the first nine weeks of her life, running and jumping and playing the way a puppy should. God bless you, you beautiful little fur ball. I’ll miss you forever. Lesson learned. Author’s note: Did you enjoy the read? Please click the 💚 below and thanks for your support ", "name": "575", "child": "575_1\t575_2\t575_3", "timestamp": "Apr 10"}