{"parent": "", "title": "How to Make Bold Decisions, Even When Your Friends or Parents Want You to Play Safe", "author": "Benjamin P. Hardy", "sentences": [{"0817": "How to Make Bold Decisions, Even When Your Friends or Parents Want You to Play Safe"}, {"c2b1": "You are currently on a path."}, {"7167": "The question is: Is the path you’re on the one you want to be on?"}, {"1bd3": "Is your path moving you forward at the pace you’d like?"}, {"fce6": "Does your path allow you the opportunities for growth and service you want?"}, {"d8dc": "Does your path cross with people you want to surround yourself with?"}, {"6aa0": "Is your current path actually taking you in the direction you truly want to go?If not, how do you get yourself on one that does? Once on a better path, how do you ensure you stay the path to achieve your desired aims?"}, {"900a": "Most people are not, I repeat NOT, on a path that would get them where they want to go. In other words, our daily decisions — small and large — are a reflection of our course."}, {"9ed8": "You may have initially started down a desired path. But like airplanes that are constantly nudged off-course, your life also gets nudged off-course. Even one degree off-course, over a long enough period of time could take you somewhere far from your intended destination. Not only that, but being off-course could cost you years or decades of time you can never get back."}, {"a01d": "For instance, if you left the equator on a flight circumnavigating the globe, being off-course just one degree would result in being nearly 500 miles (800 km) off course, or one hour of flight for a jet."}, {"445c": "Two quotes are instructive:"}, {"f7f5": "No one is exempt from this reality. We are all living with some amount of internal conflict. Shrinking the gap between who we are and who we want to be is completely do-able."}, {"ca62": "Here’s the process:"}, {"8402": "The Two Motivational Systems Operating in Your Life"}, {"3c6d": "Put simply, there are two primary systems determining and influencing every decision and action (or inaction) in your life."}, {"efa2": "Your behavioral inhibition system is what attunes you to risks or threats in your environment. When you perceive these risks or threats, your behavioral inhibition system stops you from acting."}, {"acb7": "Your behavioral activation system, on the other hand, is what attunes you to rewards. When you perceive these rewards, your behavioral activation system encourages you to action so you can obtain the reward."}, {"bd45": "These two systems are in constant tension with one another. In every situation, one of these systems is over-ruling the other. Either you are acting, or you’re inhibiting action."}, {"3209": "Every person has different tendencies respective to these two systems. Some people are far more inhibition-oriented, with a high sensitivity to risks and threats. Others are more activation or approach-oriented, with a high sensitivity to rewards."}, {"869d": "Having a high reward sensitivity has been linked to impulsive behavior, such as drug and alcohol addiction or abuse. Other research has linked a high reward sensitivity with the presence of a lifetime alcohol abuse disorder. Indeed, having a high reward sensitivity is motivated by the dopamine reward system to seek novel and exciting experiences."}, {"2589": "On the other hand, having a high risk sensitivity stops you from acting toward you highest goals."}, {"3b90": "So what do you do? How do you overcome your fear of risks without going too far the other direction?"}, {"cb11": "How do you get yourself to act, even boldly, in the most effective way possible?"}, {"b8a3": "The process by which you make your decisions is key. If you are thoughtful and proactive about your decisions, you can seek rewards while mitigating risks. A crucial component of making quality decisions is the conditions in which you make those decisions."}, {"4ec1": "Hence, Tony Robbins has explained that you only should make big and important decisions while you’re in a peak and passionate state. When you do so, you set yourself up to live at the highest level, consistently."}, {"8e7a": "Unfortunately, most people don’t make big decisions from a peak state. As a result, their passion fades and they lose momentum."}, {"22c6": "Take away:"}, {"9f14": "In order to make epic decisions, you want to be in a peak state. Do whatever gets you in a “natural” high where you can hear your highest intuitions. Running, learning, writing in my journal, being in nature, traveling, serving other people, collaborating about big ideas, and being with my family are the conditions when I generally experience a peak-state. Consequently, it is in those conditions that I generally make committed decisions."}, {"7603": "It is during those moments when I have the confidence and clarity to act toward my highest goals."}, {"8f71": "Getting Yourself to Act"}, {"28d5": "People who are prone to perfectionism are likely to have a high risk sensitivity."}, {"0d83": "I have a friend like this."}, {"6336": "Despite being incredibly intelligent, his perfectionism plagues him. He ends up putting-off big projects because the solutions are complex or confusing. He purposefully “distracts” himself with other projects to avoid the unknowns of his big project."}, {"b98d": "Said Robert Brault, author of Round Up the Usual Subjects, “We are kept from our goal not by obstacles but by a clear path to a lesser goal.”"}, {"bfbc": "My friend distracts himself from his big objective with other projects because his other projects have a clearer path. The uncertainty and fears associated with being wrong are his behavioral inhibition system at work."}, {"ed9d": "In other words, his over-focus on the risks and under-focus on the reward/goal keeps him from acting. Instead of acting, he purposefully distracts himself away from even thinking about the decision. Thus, he’s getting nowhere closer to solving his problem."}, {"9424": "Unfortunately for my friend, and for many others like him, this isn’t a one-time experience. Actually, it’s a reflection of his entire life."}, {"7c76": "He actually hates his whole job, not just this one project. But he stays at his job because it has a clear path. It’s safe and secure. His parents are pleased with him being at a big and respectable company."}, {"65c0": "What he truly wants in life is filled with uncertainty and fear. His over-focus on the risks inhibit his action. In other words, his behavioral inhibition systems has his behavioral activation system pinned-down in a headlock."}, {"dec4": "No movement in the desired direction."}, {"f71b": "However, there is hope for my friend. But it’s going to take a lot of courage. Itstarts with experiencing more stimuli related to the rewards of his goal. This stimuli can be in the form of telling his friends he hates his job and wants something new. It could be in actually looking for other jobs. It could be entertaining thoughts and feelings — negative about his current job and positive about other prospects. Educating himself. Being around people who are successfully doing what he wants to do. All of these things can contribute to him eventually taking the action he truly wants."}, {"52e5": "He must re-balance his two systems. His activation system will need to be stronger than his inhibition system. Until he’s more focused on the rewards than the risks of his goals, he’ll never reach the threshold where action becomes inevitable."}, {"4b25": "Take away:"}, {"e645": "If you really want something, but have reservations, expose yourself to it as much as you can. Talk to people about it. Learn about it. The more information, experience, and exposure you get with it, the more likely you’ll make an informed and committed decision."}, {"dbf1": "In the summer of 2016, my friend wrote down on a piece of paper: By Jan. 11, 2017, I’ll be gone from this job. He did it."}, {"581e": "That single act created a mostly subconscious ripple-effect. It has effected his behaviors and actions — allowing him to more fully focus on the rewards of his goal. It has lead him to starting having more conversations with people about it, and to thoughtfully introspect about what he truly wants in life."}, {"561d": "Take away:"}, {"c1ac": "Give yourself a timeline to act."}, {"4695": "Give yourself enough exposure and you’ll eventually act. However, if you want true momentum, you’ll need to begin acting before you feel ready."}, {"aab5": "You can become fluent at hearing your intuition, once you do, you’ll be able to respond more automatically, rather than having to spend loads of time preparing yourself to act."}, {"df4b": "Take away:"}, {"0c83": "Act sooner than you’re ready. You’ll never feel ready. Listen to your intuition. It’s speaking to you right now. The more you ignore it, the harder it will be to hear. The more you heed it, the louder and more clear it will be."}, {"3b02": "Conclusion"}, {"1247": "It can be scary putting yourself on an epic path in life."}, {"5711": "If you’re like most people, you are sensitive to the risks and uncertainty involved in what you truly want to do."}, {"1f2f": "You’ll never act if you don’t begin to set things in motion. You need to shift your motivational system from inhibition to activation."}, {"63e0": "The best way to do that is to get yourself into a peak or passionate state, and make committed decisions from that state."}, {"2c6c": "The process you make your decisions, and the conditions in which you make those decisions is essential."}, {"e183": "Eventually, you’ll need to act. That act will undoubtedly feel risky. But with an emphasis on the rewards and results, you’ll be willing to take that risk. If the rewards are compelling enough, you’ll act without delay. The highest rewards are not material, but purpose-centered."}, {"2c45": "Again, this is very different from acting impulsively and regretfully."}, {"0269": "Make the decision."}, {"f8f1": "Commit to the decision."}, {"7e21": "Put yourself in a mental and emotional state to act on your highest intuitions."}, {"7cac": "Achieve the life you want. Don’t give-in to lesser goals simply because they have clearer paths."}, {"86d8": "The longer you wait, the longer it will take to get where you want to go. The opportunity cost of procrastinating your decisions is enormous."}, {"554f": "Go."}, {"da71": "Call To Action"}, {"6da6": "If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist."}, {"6b92": "Click here to get the checklist right now!"}], "content": "How to Make Bold Decisions, Even When Your Friends or Parents Want You to Play Safe You are currently on a path. The question is: Is the path you’re on the one you want to be on? Is your path moving you forward at the pace you’d like? Does your path allow you the opportunities for growth and service you want? Does your path cross with people you want to surround yourself with? Is your current path actually taking you in the direction you truly want to go?If not, how do you get yourself on one that does? Once on a better path, how do you ensure you stay the path to achieve your desired aims? Most people are not, I repeat NOT, on a path that would get them where they want to go. In other words, our daily decisions — small and large — are a reflection of our course. You may have initially started down a desired path. But like airplanes that are constantly nudged off-course, your life also gets nudged off-course. Even one degree off-course, over a long enough period of time could take you somewhere far from your intended destination. Not only that, but being off-course could cost you years or decades of time you can never get back. For instance, if you left the equator on a flight circumnavigating the globe, being off-course just one degree would result in being nearly 500 miles (800 km) off course, or one hour of flight for a jet. Two quotes are instructive: No one is exempt from this reality. We are all living with some amount of internal conflict. Shrinking the gap between who we are and who we want to be is completely do-able. Here’s the process: The Two Motivational Systems Operating in Your Life Put simply, there are two primary systems determining and influencing every decision and action (or inaction) in your life. Your behavioral inhibition system is what attunes you to risks or threats in your environment. When you perceive these risks or threats, your behavioral inhibition system stops you from acting. Your behavioral activation system, on the other hand, is what attunes you to rewards. When you perceive these rewards, your behavioral activation system encourages you to action so you can obtain the reward. These two systems are in constant tension with one another. In every situation, one of these systems is over-ruling the other. Either you are acting, or you’re inhibiting action. Every person has different tendencies respective to these two systems. Some people are far more inhibition-oriented, with a high sensitivity to risks and threats. Others are more activation or approach-oriented, with a high sensitivity to rewards. Having a high reward sensitivity has been linked to impulsive behavior, such as drug and alcohol addiction or abuse. Other research has linked a high reward sensitivity with the presence of a lifetime alcohol abuse disorder. Indeed, having a high reward sensitivity is motivated by the dopamine reward system to seek novel and exciting experiences. On the other hand, having a high risk sensitivity stops you from acting toward you highest goals. So what do you do? How do you overcome your fear of risks without going too far the other direction? How do you get yourself to act, even boldly, in the most effective way possible? The process by which you make your decisions is key. If you are thoughtful and proactive about your decisions, you can seek rewards while mitigating risks. A crucial component of making quality decisions is the conditions in which you make those decisions. Hence, Tony Robbins has explained that you only should make big and important decisions while you’re in a peak and passionate state. When you do so, you set yourself up to live at the highest level, consistently. Unfortunately, most people don’t make big decisions from a peak state. As a result, their passion fades and they lose momentum. Take away: In order to make epic decisions, you want to be in a peak state. Do whatever gets you in a “natural” high where you can hear your highest intuitions. Running, learning, writing in my journal, being in nature, traveling, serving other people, collaborating about big ideas, and being with my family are the conditions when I generally experience a peak-state. Consequently, it is in those conditions that I generally make committed decisions. It is during those moments when I have the confidence and clarity to act toward my highest goals. Getting Yourself to Act People who are prone to perfectionism are likely to have a high risk sensitivity. I have a friend like this. Despite being incredibly intelligent, his perfectionism plagues him. He ends up putting-off big projects because the solutions are complex or confusing. He purposefully “distracts” himself with other projects to avoid the unknowns of his big project. Said Robert Brault, author of Round Up the Usual Subjects, “We are kept from our goal not by obstacles but by a clear path to a lesser goal.” My friend distracts himself from his big objective with other projects because his other projects have a clearer path. The uncertainty and fears associated with being wrong are his behavioral inhibition system at work. In other words, his over-focus on the risks and under-focus on the reward/goal keeps him from acting. Instead of acting, he purposefully distracts himself away from even thinking about the decision. Thus, he’s getting nowhere closer to solving his problem. Unfortunately for my friend, and for many others like him, this isn’t a one-time experience. Actually, it’s a reflection of his entire life. He actually hates his whole job, not just this one project. But he stays at his job because it has a clear path. It’s safe and secure. His parents are pleased with him being at a big and respectable company. What he truly wants in life is filled with uncertainty and fear. His over-focus on the risks inhibit his action. In other words, his behavioral inhibition systems has his behavioral activation system pinned-down in a headlock. No movement in the desired direction. However, there is hope for my friend. But it’s going to take a lot of courage. Itstarts with experiencing more stimuli related to the rewards of his goal. This stimuli can be in the form of telling his friends he hates his job and wants something new. It could be in actually looking for other jobs. It could be entertaining thoughts and feelings — negative about his current job and positive about other prospects. Educating himself. Being around people who are successfully doing what he wants to do. All of these things can contribute to him eventually taking the action he truly wants. He must re-balance his two systems. His activation system will need to be stronger than his inhibition system. Until he’s more focused on the rewards than the risks of his goals, he’ll never reach the threshold where action becomes inevitable. Take away: If you really want something, but have reservations, expose yourself to it as much as you can. Talk to people about it. Learn about it. The more information, experience, and exposure you get with it, the more likely you’ll make an informed and committed decision. In the summer of 2016, my friend wrote down on a piece of paper: By Jan. 11, 2017, I’ll be gone from this job. He did it. That single act created a mostly subconscious ripple-effect. It has effected his behaviors and actions — allowing him to more fully focus on the rewards of his goal. It has lead him to starting having more conversations with people about it, and to thoughtfully introspect about what he truly wants in life. Take away: Give yourself a timeline to act. Give yourself enough exposure and you’ll eventually act. However, if you want true momentum, you’ll need to begin acting before you feel ready. You can become fluent at hearing your intuition, once you do, you’ll be able to respond more automatically, rather than having to spend loads of time preparing yourself to act. Take away: Act sooner than you’re ready. You’ll never feel ready. Listen to your intuition. It’s speaking to you right now. The more you ignore it, the harder it will be to hear. The more you heed it, the louder and more clear it will be. Conclusion It can be scary putting yourself on an epic path in life. If you’re like most people, you are sensitive to the risks and uncertainty involved in what you truly want to do. You’ll never act if you don’t begin to set things in motion. You need to shift your motivational system from inhibition to activation. The best way to do that is to get yourself into a peak or passionate state, and make committed decisions from that state. The process you make your decisions, and the conditions in which you make those decisions is essential. Eventually, you’ll need to act. That act will undoubtedly feel risky. But with an emphasis on the rewards and results, you’ll be willing to take that risk. If the rewards are compelling enough, you’ll act without delay. The highest rewards are not material, but purpose-centered. Again, this is very different from acting impulsively and regretfully. Make the decision. Commit to the decision. Put yourself in a mental and emotional state to act on your highest intuitions. Achieve the life you want. Don’t give-in to lesser goals simply because they have clearer paths. The longer you wait, the longer it will take to get where you want to go. The opportunity cost of procrastinating your decisions is enormous. Go. Call To Action If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist. Click here to get the checklist right now! ", "name": "601", "child": "601_1\t601_2\t601_3\t601_4\t601_5\t601_6\t601_7\t601_8\t601_9\t601_10\t601_11\t601_12\t601_13\t601_14\t601_15\t601_16\t601_17\t601_18\t601_19\t601_20\t601_21\t601_22\t601_23\t601_24\t601_25", "timestamp": "Mar 31"}