{"parent": "", "title": "My Inbox to Yours 004 | Rock Bottom and Back", "author": "Gary Vaynerchuk", "sentences": [{"dcf4": "My Inbox to Yours 004 | Rock Bottom and Back"}, {"e91d": "This fourth installment of My Inbox to Yours is a special one because Andrea wrote to me when things were falling apart and then followed back up when she Hustled her way back :) …Love you for this Andrea ;)"}, {"8da5": "From: AndreaDate: Fri, Dec 16, 2016Subject: Rock BottomTo: Gary Vaynerchuk"}, {"8047": "Gary-"}, {"000d": "This morning I hit rock bottom. My husband and I were evicted from our home with our two dogs. All of our possessions are now in storage, and we’re picking up the pieces."}, {"b489": "He’s a realtor and I’ve owned my own business for four years. We were doing well, but then things changed. Try as I might, I just didn’t recover in time. And we couldn’t catch up on bills."}, {"0edf": "I just want to thank you. We are living in a hotel, but he’s up this morning on the phones like he does everyday- and I’m sitting here doing my business plan for the next six months. I’m also looking for a part time job."}, {"3d27": "You inspire us. Nothing is an excuse- even homelessness."}, {"e827": "Andrea"}, {"460b": "She followed up with another email after a few weeks:"}, {"f402": "From: AndreaDate: Sat, Feb 11, 2017Subject: Thank YouTo: Gary Vaynerchuk"}, {"6eb2": "Two months ago my business failed, my business partner gave up, and before I knew it, I was homeless and my car was repoed."}, {"3e8b": "With your motivation, I made the most of it, stopped complaining, and went right back to the hustle. While living in a hotel with my husband and my two dogs, I got a new job, we found a new home, and I restarted my side hustle. We finally moved into a new house the day before Christmas Eve and I began my job on Jan 3rd."}, {"9e4a": "Since then we’ve caught up on bills and we are enjoying life."}, {"6e0f": "Thank you again for the hustle. Two months from now I will have a sitcom in production, a movie in Production, my side hustle will have made me over $30,000, and my day job supports everything I do."}, {"278e": "You’re more than just motivation. You’re a life changer. ❤️"}, {"9831": "Andrea"}, {"10c9": "Thanks for reading my new series! If you enjoyed it, hit that heart button below ;)"}], "content": "My Inbox to Yours 004 | Rock Bottom and Back This fourth installment of My Inbox to Yours is a special one because Andrea wrote to me when things were falling apart and then followed back up when she Hustled her way back :) …Love you for this Andrea ;) From: AndreaDate: Fri, Dec 16, 2016Subject: Rock BottomTo: Gary Vaynerchuk Gary- This morning I hit rock bottom. My husband and I were evicted from our home with our two dogs. All of our possessions are now in storage, and we’re picking up the pieces. He’s a realtor and I’ve owned my own business for four years. We were doing well, but then things changed. Try as I might, I just didn’t recover in time. And we couldn’t catch up on bills. I just want to thank you. We are living in a hotel, but he’s up this morning on the phones like he does everyday- and I’m sitting here doing my business plan for the next six months. I’m also looking for a part time job. You inspire us. Nothing is an excuse- even homelessness. Andrea She followed up with another email after a few weeks: From: AndreaDate: Sat, Feb 11, 2017Subject: Thank YouTo: Gary Vaynerchuk Two months ago my business failed, my business partner gave up, and before I knew it, I was homeless and my car was repoed. With your motivation, I made the most of it, stopped complaining, and went right back to the hustle. While living in a hotel with my husband and my two dogs, I got a new job, we found a new home, and I restarted my side hustle. We finally moved into a new house the day before Christmas Eve and I began my job on Jan 3rd. Since then we’ve caught up on bills and we are enjoying life. Thank you again for the hustle. Two months from now I will have a sitcom in production, a movie in Production, my side hustle will have made me over $30,000, and my day job supports everything I do. You’re more than just motivation. You’re a life changer. ❤️ Andrea Thanks for reading my new series! If you enjoyed it, hit that heart button below ;) ", "name": "602", "child": "602_1\t602_2\t602_3\t602_4\t602_5\t602_6\t602_7\t602_8\t602_9\t602_10\t602_11\t602_12\t602_13\t602_14\t602_15\t602_16\t602_17602_1\t602_2\t602_3\t602_4\t602_5\t602_6\t602_7\t602_8\t602_9\t602_10\t602_11\t602_12\t602_13\t602_14\t602_15\t602_16\t602_17", "timestamp": "Mar 27"}