{"parent": "", "title": "The 5-Million-Views Mindset", "author": "Nabeel Azeez", "sentences": [{"91dd": "The 5-Million-Views Mindset"}, {"b19c": "What does it take to Write the most Viral post in the History of Medium.com?"}, {"2c95": "This is really meta"}, {"708e": "A few weeks ago I read a post on Medium by Zdravko Cvijetic."}, {"b7a9": "How I Gained 103,886 Email Subscribers With Just One Article“Nothing is more expensive than a missed opportunity” — H. Hackson Brown, JR.medium.com"}, {"79ac": "He’s a regular Medium contributor and he also runs a website called Zero to Skill."}, {"a986": "In this post, he was analyzing another post of his that went viral, “13 things you should give up if you want to be successful.”"}, {"d4d4": "Turns out he wrote the most recommended story in the history of Medium"}, {"ca39": "13 Things You Should Give Up If You Want To Be Successful”Somebody once told me the definition of hell:medium.com"}, {"a9d6": "The image at the top of this page? That’s a screenshot of his stats for this one post."}, {"5e41": "At the time of writing his analysis, it had over 5 million views and recommended by over 34,000 people."}, {"aabd": "Medium doesn’t show social shares, but I’m sure those are well into the 10s of thousands too."}, {"8e51": "The reason why I’m focusing on his follow-up analysis of the post is because it’s a treasure-trove of lessons for marketers."}, {"d1b8": "Writes Cvijetic,"}, {"329b": "It took me four days to write the following piece…"}, {"eb35": "But it took me over nine months to make it go viral and to become the most recommended story in the history of Medium."}, {"7c19": "In my post, the one you’re reading right now,"}, {"2b88": "Tl;dr: what you will learn in this post"}, {"a9e2": "1) You Can’t Predict Virality"}, {"c7ce": "What you *can* do, is look at other content that went viral and find common elements between them."}, {"6a06": "Then, incorporate those elements into your own material."}, {"5903": "Cvijetic cites Jonah Berger’s STEPPS framework of virality."}, {"c5f6": "If you’ve read Made to Stick, Chip and Dan Heath mention 6 principles of Sticky Ideas which are verily similar to Bergers (more on this later.)"}, {"fff6": "This is something I’ve talked about in one of my own blog posts."}, {"66d7": "You can’t “chase” virality."}, {"6059": "You have to Jeet Kune Do it — absorb what is useful, reject what is useless, and add what is uniquely your own."}, {"a6ba": "2) You Went Viral. Now What?"}, {"f310": "This is probably the best part of his article."}, {"1cd3": "Cvijetic had the self-awareness to say,"}, {"8760": "I’m spending all this time to create this content, hoping it will resonate with my audience."}, {"a828": "What if one of them becomes really popular?"}, {"332b": "Is my platform ready to deal with the extra attention?"}, {"5691": "Imagine…You spend 20 hours creating a masterpiece."}, {"189c": "It goes viral."}, {"e15d": "You get a massive spike in web traffic."}, {"50cd": "Your website goes down. Or your email marketing provider can’t handle the spike in signups."}, {"e902": "Or you forgot to tell them what to do after reading your piece."}, {"3326": "Or you don’t have a landing page set up properly."}, {"e231": "All it took to avoid a massive wasted opportunity is two phone calls to his web host and email provider to make sure his website and email marketing service could handle the additional load."}, {"e0f6": "He also made sure to budget for the increased hosting and email marketing fees."}, {"b687": "Also, having a single, clear call to action which links to an optimized landing page is table stakes."}, {"f840": "If you haven’t taken the time to do this prep work, you have no business trying to create viral content."}, {"c03c": "3) The Follow-Up is 100X More Valuable than the Viral Post"}, {"9cfd": "This is deliberately subjective on my part."}, {"c5f0": "The post that went viral, while very good, was high-level and a little abstract."}, {"2d97": "The follow-up post, *showing* us it was by design, and not a flash in the pan, was just better."}, {"5389": "There are two lessons here."}, {"4c8a": "First, speak to people at their level, in the way they understand."}, {"f226": "As you educate them, as they improve, you can slowly introduce them to the more complex stuff."}, {"6c76": "Cvijetic mentions how just tweaking one word in his title made all the difference in the World."}, {"2735": "He didn’t pull the tweak out of his ass either."}, {"181f": "His research led him to make the change (more on this later.)"}, {"9e59": "Second, your viral content won’t necessarily be your best content."}, {"04bd": "Cvijetic mentions he normally writes 3000+ word, long-form posts."}, {"2eaf": "However, because he was deliberately designing a “viral post,” he looked up what kind of content goes viral on Medium and adapted his content creation to suit the channel."}, {"7248": "Combined, they highlight a valuable lesson Ramit Sethi teaches his students."}, {"2dc0": "Give people what they want right now so you can give them what they need later."}, {"d276": "4) Don’t put Artificial Limitations on Your Success"}, {"b532": "With the exception of the post I’m discussing right now, every one of Cvijetic’s Medium posts was originally published on his website."}, {"0a86": "AND he ended up republishing it on several mainstream media outlets."}, {"5bdc": "Now, I don’t know about you guys, but I have this narrative in my head about my website."}, {"2173": "I tell myself,"}, {"1f6c": "You should only grow your website 100% organic."}, {"bf54": "Everything needs to be original content."}, {"898e": "Don’t pay for traffic."}, {"1200": "Don’t make The Man rich off of syndicating your content."}, {"321a": "Don’t re-publish old content for your guest posts, that’s just lazy…Write fresh material."}, {"20a7": "Yadda yadda yadda."}, {"e2b3": "I mean, I’ll be honest, it makes great sense in my head, and still sort of makes sense even after writing it down."}, {"4dc4": "However, after reading about Cvijetic’s success, maybe there’s more to it than I thought."}, {"f82a": "After you identify your primary objective, do whatever steps are necessary to reach that goal."}, {"43e8": "Don’t let secondary objectives divert your focus or make you take actions that will self-sabotage achieving your primary objective."}, {"92d4": "Here’s a fun caveat to think about."}, {"5dbe": "This just came to my mind while writing this post."}, {"954b": "Do any of you read X-Men?"}, {"7228": "PEW, PEW, PEW"}, {"32a6": "So, there was this clone of Magneto called Joseph."}, {"2961": "Joseph was way more powerful than Magneto in terms of raw power, but he ended up dying."}, {"1104": "His power consumed him."}, {"c431": "Because he was cloned as an adult and had complete access to his powers from day 1, he didn’t have the same control as Magneto, who had to learn how to use his powers over decades."}, {"d6ee": "Magneto deliberately limits his power output because he knows what can happen if he really lets loose."}, {"6676": "You’ll have to Jeet Kune Do this analogy in whichever way applies to you."}, {"44c8": "Absorb what is useful, reject what is useless, and add what is uniquely your own"}, {"f262": "5) Virality is the Product of Consistency"}, {"c26e": "This is something I’ve blogged and podcasted about before."}, {"d518": "Cvijetic has 19 posts on Medium."}, {"41bd": "A few do pretty well, sitting at around 1k hearts."}, {"50c7": "Most are in the dozens or 100s."}, {"7414": "ONE post went viral."}, {"d5bf": "AND his results are far better than most."}, {"48ed": "Look at people like #SaltBae and the Chicken Connoisseur."}, {"5584": "SaltBae’s first Instagram post was almost 4 years ago."}, {"a6ca": "It has 2k likes."}, {"c6ad": "Dude’s been consistent ever since."}, {"6775": "He only went viral a few weeks ago."}, {"2ab6": "Now, his posts get 10s of thousands of likes."}, {"74cc": "Some are over 100k."}, {"3f49": "His latest Instagram videos have millions of views."}, {"7f16": "Episode 1 of the Pengest Munch was a year ago."}, {"4460": "Elijah Quashie (the Chicken Connoisseur) and his team dropped 4 episodes and were inactive for 9 months until releasing episode 5."}, {"e57e": "Episode 5 of the Pengest Munch was when the show got traction and went viral."}, {"22da": "I remember checking out his channel back then when episodes 1–4 had only a few thousand views (hadn’t even broken 5 figures.)"}, {"bfdc": "Now, it could be that Elijah and his team got busy and didn’t have time to produce more content."}, {"6cd9": "However, I will take an educated guess and say they produced 4 episodes, got low engagement, got demotivated and quit."}, {"96f3": "Then 3 months ago decided to give it another shot."}, {"1794": "Virality, disruption, stickiness, is the product of 100s, if not 1000s of iterations."}, {"37ef": "There’s no substitute for putting in the work."}, {"c55d": "6) Sell Benefits, not Features/Functions"}, {"2536": "I mentioned earlier that Cvijetic tweaked one word in the title."}, {"f9c8": "He changed the word “productive” (how it was originally titled on his website) to “successful.”"}, {"a1e5": "Now, he explains the change as being practical — there are over 500% more search engine results for the word “successful,” it was the new year so people are in re-invention mode, etc."}, {"649d": "However, without even thinking about it (or maybe he did, just didn’t mention it) he sold the BENEFITS of productivity as opposed to the FUNCTION of being productive."}, {"ddad": "This is copywriting rule numero uno."}, {"24a8": "How many post titles do we see with the word “productive” in them?"}, {"2d6e": "Over the course of a year, maybe thousands."}, {"6b07": "A) We’re completely desensitized to the word."}, {"5d14": "B) We immediately think, “I’ve probably read this material before.”"}, {"8d79": "Change the word “productive” to “success,” however, and it’s a guaranteed click."}, {"a051": "A lot of people may believe they are productive, with their Pomodoros and their calendars and their morning meditations."}, {"a528": "But everyone DESIRES to be more successful."}, {"f6e6": "7) BONUS: I Apply “Made to Stick” to Cvijetic’s Post"}, {"330d": "Cvijetic says he built his viral post on Berger’s STEPPS framework."}, {"7f60": "He also, knowingly or not, has applied the Sticky Ideas framework."}, {"0e8c": "In their best-selling book, “Made to Stick,” Chip and Dan Heath distil sticky ideas down to 6 principles:"}, {"e04c": "Here’s how Cvijetic compares."}, {"a3de": "Simplicity"}, {"beca": "It’s a listicle and it’s short."}, {"ead8": "Unexpectedness"}, {"4a46": "He wrote a skim-your-feed-stopping, scroll-stopping, disruptive headline."}, {"9a99": "Concreteness"}, {"3944": "Every point is a specific action you can do, or stop doing."}, {"70e1": "Credibility"}, {"d4f1": "Every point is accompanied with a motivational quote from a popular contemporary or historical figure."}, {"6e92": "Emotions"}, {"cb8d": "Every point is something we really don’t like about ourselves."}, {"1adf": "Stories"}, {"fab0": "He opens the post with “someone once told me….”"}, {"0c10": "Conclusion"}, {"52c8": "You can’t create viral content."}, {"0232": "What you can do, is bust your ass to consistently create amazing content the masses will love to read and share, i.e. content that has the possibility of going viral."}, {"73c9": "You can also make sure that if and when your content does go viral, you are in a position to capitalize on the massive spike in attention."}, {"3519": "Because virality is just a tool, it’s not the goal."}, {"2d15": "The goal is to make more $$$."}, {"c57b": "My challenge to you"}, {"6503": "Think of ONE way you can immediately implement something you’ve learned from this post and tell me what it is in the comments below."}, {"c3dd": "Be specific — What will you do? How long will it take to execute? How long until you see results? Can you predict its ROI (ball-park)? — paint me a picture."}, {"6858": "Nabeel Azeez is the founder of Dropkick Copy, a boutique conversion copywriting and content strategy agency, where he helps small agencies who need Hired Muscle."}, {"f57a": "He is also the founder of Becoming the Alpha Muslim, a self-improvement blog for millennial Muslim men."}, {"56fd": "You can find him on Facebook, Twitter, and Linkedin."}], "content": "The 5-Million-Views Mindset What does it take to Write the most Viral post in the History of Medium.com? This is really meta A few weeks ago I read a post on Medium by Zdravko Cvijetic. How I Gained 103,886 Email Subscribers With Just One Article“Nothing is more expensive than a missed opportunity” — H. Hackson Brown, JR.medium.com He’s a regular Medium contributor and he also runs a website called Zero to Skill. In this post, he was analyzing another post of his that went viral, “13 things you should give up if you want to be successful.” Turns out he wrote the most recommended story in the history of Medium 13 Things You Should Give Up If You Want To Be Successful”Somebody once told me the definition of hell:medium.com The image at the top of this page? That’s a screenshot of his stats for this one post. At the time of writing his analysis, it had over 5 million views and recommended by over 34,000 people. Medium doesn’t show social shares, but I’m sure those are well into the 10s of thousands too. The reason why I’m focusing on his follow-up analysis of the post is because it’s a treasure-trove of lessons for marketers. Writes Cvijetic, It took me four days to write the following piece… But it took me over nine months to make it go viral and to become the most recommended story in the history of Medium. In my post, the one you’re reading right now, Tl;dr: what you will learn in this post 1) You Can’t Predict Virality What you *can* do, is look at other content that went viral and find common elements between them. Then, incorporate those elements into your own material. Cvijetic cites Jonah Berger’s STEPPS framework of virality. If you’ve read Made to Stick, Chip and Dan Heath mention 6 principles of Sticky Ideas which are verily similar to Bergers (more on this later.) This is something I’ve talked about in one of my own blog posts. You can’t “chase” virality. You have to Jeet Kune Do it — absorb what is useful, reject what is useless, and add what is uniquely your own. 2) You Went Viral. Now What? This is probably the best part of his article. Cvijetic had the self-awareness to say, I’m spending all this time to create this content, hoping it will resonate with my audience. What if one of them becomes really popular? Is my platform ready to deal with the extra attention? Imagine…You spend 20 hours creating a masterpiece. It goes viral. You get a massive spike in web traffic. Your website goes down. Or your email marketing provider can’t handle the spike in signups. Or you forgot to tell them what to do after reading your piece. Or you don’t have a landing page set up properly. All it took to avoid a massive wasted opportunity is two phone calls to his web host and email provider to make sure his website and email marketing service could handle the additional load. He also made sure to budget for the increased hosting and email marketing fees. Also, having a single, clear call to action which links to an optimized landing page is table stakes. If you haven’t taken the time to do this prep work, you have no business trying to create viral content. 3) The Follow-Up is 100X More Valuable than the Viral Post This is deliberately subjective on my part. The post that went viral, while very good, was high-level and a little abstract. The follow-up post, *showing* us it was by design, and not a flash in the pan, was just better. There are two lessons here. First, speak to people at their level, in the way they understand. As you educate them, as they improve, you can slowly introduce them to the more complex stuff. Cvijetic mentions how just tweaking one word in his title made all the difference in the World. He didn’t pull the tweak out of his ass either. His research led him to make the change (more on this later.) Second, your viral content won’t necessarily be your best content. Cvijetic mentions he normally writes 3000+ word, long-form posts. However, because he was deliberately designing a “viral post,” he looked up what kind of content goes viral on Medium and adapted his content creation to suit the channel. Combined, they highlight a valuable lesson Ramit Sethi teaches his students. Give people what they want right now so you can give them what they need later. 4) Don’t put Artificial Limitations on Your Success With the exception of the post I’m discussing right now, every one of Cvijetic’s Medium posts was originally published on his website. AND he ended up republishing it on several mainstream media outlets. Now, I don’t know about you guys, but I have this narrative in my head about my website. I tell myself, You should only grow your website 100% organic. Everything needs to be original content. Don’t pay for traffic. Don’t make The Man rich off of syndicating your content. Don’t re-publish old content for your guest posts, that’s just lazy…Write fresh material. Yadda yadda yadda. I mean, I’ll be honest, it makes great sense in my head, and still sort of makes sense even after writing it down. However, after reading about Cvijetic’s success, maybe there’s more to it than I thought. After you identify your primary objective, do whatever steps are necessary to reach that goal. Don’t let secondary objectives divert your focus or make you take actions that will self-sabotage achieving your primary objective. Here’s a fun caveat to think about. This just came to my mind while writing this post. Do any of you read X-Men? PEW, PEW, PEW So, there was this clone of Magneto called Joseph. Joseph was way more powerful than Magneto in terms of raw power, but he ended up dying. His power consumed him. Because he was cloned as an adult and had complete access to his powers from day 1, he didn’t have the same control as Magneto, who had to learn how to use his powers over decades. Magneto deliberately limits his power output because he knows what can happen if he really lets loose. You’ll have to Jeet Kune Do this analogy in whichever way applies to you. Absorb what is useful, reject what is useless, and add what is uniquely your own 5) Virality is the Product of Consistency This is something I’ve blogged and podcasted about before. Cvijetic has 19 posts on Medium. A few do pretty well, sitting at around 1k hearts. Most are in the dozens or 100s. ONE post went viral. AND his results are far better than most. Look at people like #SaltBae and the Chicken Connoisseur. SaltBae’s first Instagram post was almost 4 years ago. It has 2k likes. Dude’s been consistent ever since. He only went viral a few weeks ago. Now, his posts get 10s of thousands of likes. Some are over 100k. His latest Instagram videos have millions of views. Episode 1 of the Pengest Munch was a year ago. Elijah Quashie (the Chicken Connoisseur) and his team dropped 4 episodes and were inactive for 9 months until releasing episode 5. Episode 5 of the Pengest Munch was when the show got traction and went viral. I remember checking out his channel back then when episodes 1–4 had only a few thousand views (hadn’t even broken 5 figures.) Now, it could be that Elijah and his team got busy and didn’t have time to produce more content. However, I will take an educated guess and say they produced 4 episodes, got low engagement, got demotivated and quit. Then 3 months ago decided to give it another shot. Virality, disruption, stickiness, is the product of 100s, if not 1000s of iterations. There’s no substitute for putting in the work. 6) Sell Benefits, not Features/Functions I mentioned earlier that Cvijetic tweaked one word in the title. He changed the word “productive” (how it was originally titled on his website) to “successful.” Now, he explains the change as being practical — there are over 500% more search engine results for the word “successful,” it was the new year so people are in re-invention mode, etc. However, without even thinking about it (or maybe he did, just didn’t mention it) he sold the BENEFITS of productivity as opposed to the FUNCTION of being productive. This is copywriting rule numero uno. How many post titles do we see with the word “productive” in them? Over the course of a year, maybe thousands. A) We’re completely desensitized to the word. B) We immediately think, “I’ve probably read this material before.” Change the word “productive” to “success,” however, and it’s a guaranteed click. A lot of people may believe they are productive, with their Pomodoros and their calendars and their morning meditations. But everyone DESIRES to be more successful. 7) BONUS: I Apply “Made to Stick” to Cvijetic’s Post Cvijetic says he built his viral post on Berger’s STEPPS framework. He also, knowingly or not, has applied the Sticky Ideas framework. In their best-selling book, “Made to Stick,” Chip and Dan Heath distil sticky ideas down to 6 principles: Here’s how Cvijetic compares. Simplicity It’s a listicle and it’s short. Unexpectedness He wrote a skim-your-feed-stopping, scroll-stopping, disruptive headline. Concreteness Every point is a specific action you can do, or stop doing. Credibility Every point is accompanied with a motivational quote from a popular contemporary or historical figure. Emotions Every point is something we really don’t like about ourselves. Stories He opens the post with “someone once told me….” Conclusion You can’t create viral content. What you can do, is bust your ass to consistently create amazing content the masses will love to read and share, i.e. content that has the possibility of going viral. You can also make sure that if and when your content does go viral, you are in a position to capitalize on the massive spike in attention. Because virality is just a tool, it’s not the goal. The goal is to make more $$$. My challenge to you Think of ONE way you can immediately implement something you’ve learned from this post and tell me what it is in the comments below. Be specific — What will you do? How long will it take to execute? How long until you see results? Can you predict its ROI (ball-park)? — paint me a picture. Nabeel Azeez is the founder of Dropkick Copy, a boutique conversion copywriting and content strategy agency, where he helps small agencies who need Hired Muscle. He is also the founder of Becoming the Alpha Muslim, a self-improvement blog for millennial Muslim men. You can find him on Facebook, Twitter, and Linkedin. ", "name": "617", "child": "617_1617_1", "timestamp": "Mar 28"}