{"parent": "", "title": "A Very Special & Short Announcement", "author": "mark-john clifford", "sentences": [{"a3e0": "A Very Special & Short Announcement"}, {"fca2": "An hour ago I received notification via Medium that Imperfect Writers of the World reached 2000 followers."}, {"421c": "THAT’S RIGHT…"}, {"a802": "While that isn’t a big deal to many of you out there you need to see why it’s such a big deal to us here at Imperfect Writers Central. That includes me, Patti, & Lisa."}, {"0e6b": "We started this little publication just over a year ago with only 3 followers which included me. Now we’re at 2000."}, {"6e65": "We aren’t the quickest at growth, but we’ve been steady. We have the most loyal followers according to Medium staff which is why they added us to the beta membership program. Cool, right?"}, {"531e": "So congrats to everyone that got us here. It wasn’t just me, Patti & Lisa. It was every one of the 2000 followers."}, {"5028": "I want to especially thank Patti, my wife & Lisa, our daughter for keeping me motivated, helping with the contests and judging and being the rock that keeps me doing this. I love you both very much!"}, {"6c92": "Thank you,"}, {"8d07": "Mark, Patti, & Lisa"}, {"7824": "Now on to the next 2,000!"}, {"f388": "Our Newsletter"}, {"d1dc": "If you’re interested in keeping up with our work getting some inside information then you should subscribe to our once a month newsletter that’s full of popular posts,, some writing tips, and whatever else I find to inform you."}, {"f60d": "Imperfect Writers of the World - RevueThis is your newsletter. As a supporter of Imperfect Writers, this newsletter is curated with you in mind. Filled with…www.getrevue.co"}], "content": "A Very Special & Short Announcement An hour ago I received notification via Medium that Imperfect Writers of the World reached 2000 followers. THAT’S RIGHT… While that isn’t a big deal to many of you out there you need to see why it’s such a big deal to us here at Imperfect Writers Central. That includes me, Patti, & Lisa. We started this little publication just over a year ago with only 3 followers which included me. Now we’re at 2000. We aren’t the quickest at growth, but we’ve been steady. We have the most loyal followers according to Medium staff which is why they added us to the beta membership program. Cool, right? So congrats to everyone that got us here. It wasn’t just me, Patti & Lisa. It was every one of the 2000 followers. I want to especially thank Patti, my wife & Lisa, our daughter for keeping me motivated, helping with the contests and judging and being the rock that keeps me doing this. I love you both very much! Thank you, Mark, Patti, & Lisa Now on to the next 2,000! Our Newsletter If you’re interested in keeping up with our work getting some inside information then you should subscribe to our once a month newsletter that’s full of popular posts,, some writing tips, and whatever else I find to inform you. Imperfect Writers of the World - RevueThis is your newsletter. As a supporter of Imperfect Writers, this newsletter is curated with you in mind. Filled with…www.getrevue.co ", "name": "618", "child": "618_1\t618_2\t618_3\t618_4\t618_5\t618_6\t618_7\t618_8\t618_9\t618_10\t618_11\t618_12\t618_13\t618_14\t618_15", "timestamp": "Apr 13"}