{"parent": "", "title": "Pourquoi j’ai arrêté d’utiliser AMP", "author": "Nicolas Furno", "sentences": [{"3a86": "Pourquoi j’ai arrêté d’utiliser AMP"}, {"bdd0": "Tout le monde ne parle plus que de ça et il faut reconnaître que Google a réussi son coup. Les pages web se convertissent en pages AMP un petit peu partout, tous les sites hébergés par WordPress.com y ont droit automatiquement, tous les CMS s’y mettent et vous avez sûrement croisé dans les résultats de recherche l’icône en forme d’éclair qui signale leur présence."}, {"18e4": "Si vous n’avez jamais cliqué sur ces liens, vous ne savez peut-être pas ce qui se cache derrière ces trois lettres. Ces articles se chargent instantanément, ou presque, à la fois parce qu’ils sont légers et parce qu’ils sont hébergés par Google."}, {"d9cf": "À l’origine, l’idée est plutôt bonne : inciter les créateurs du site à alléger leurs pages web pour les visiteurs mobiles. Le projet définit une série de règles et restreint le développement web à quelques éléments uniquement. Impossible d’avoir du contenu interactif et du JavaScript en pagaille, on revient à l’essence du web : du texte, des images et un peu de style, pour faire simple."}, {"1c56": "Le projet AMP est open-source, mais Google est son instigateur et son principal moteur. L’objectif étant d’offrir un web mobile plus rapide, le géant de la recherche a ajouté une petite fonction qui fait toute la différence : les pages AMP sont stockées sur son serveur, pour être livrées plus rapidement. Google agit comme un cache pour la version optimisée, ce qui signifie que le visiteur n’utilise plus votre serveur."}, {"a993": "C’est le même principe que les Instant Articles de Facebook, ou bien les articles diffusés par Apple News. Chaque service a son système complet et fermé, mais là où le réseau social et le créateur de l’iPhone réservent leurs systèmes de lecture à une app tierce, AMP est disponible directement dans le plus gros moteur de recherche au monde et dans le même navigateur web de base. Et cela change totalement la visibilité de ce service et son rôle pour les créateurs de contenus."}, {"5120": "Je l’ai vu à l’échelle de mon blog, l’écrasante majorité des requêtes mobiles étaient désormais vers des pages AMP et non vers mon serveur. Google a commencé à pousser ces pages optimisées et en cache sur son serveur et il est difficile désormais de passer à côté. Ce qui n’a pas plu à tout le monde : il ne faut pas longtemps pour trouver des mécontents, des utilisateurs qui essaient de ne plus voir ces liens et des créateurs de contenus qui ne veulent plus du cache de Google."}, {"1bcc": "Le sujet devient vite technique, mais on peut résumer le cœur du problème à l’URL, l’adresse de la page web qui est affichée dans le navigateur. Une fois que la page est stockée sur les serveurs de Google, elle change d’adresse et ressemble à ça :"}, {"782f": "https://www.google.fr/amp/s/voiretmanger.fr/alice-pays-merveilles-geronimi-jackson-luske/amp/"}, {"feed": "L’URL originale est toujours là, mais elle n’est plus directement accessible. Et la plupart des internautes ne vont pas faire attention et récupérer cette adresse pour la partager, au lieu de prendre l’originale. Le problème étant que c’est le cache de Google qui est alors référencé, pas le serveur qui héberge le site. En cas de changement dans l’article, il faut compter sur le bon vouloir de l’entreprise pour que le contenu associé à cette URL soit aussi mis à jour."}, {"190d": "Google a fini par réagir face aux critiques en ajoutant un bouton en haut qui affiche alors l’adresse originale. Disons-le, ce n’est pas une solution efficace, personne ne va savoir comment trouver l’URL et comment la partager. D’autres solutions sont prévues pour faciliter le partage du lien original, mais ce n’est pas encore au point. En attendant, tout le monde se trompe de lien, même les PDG des plus grandes entreprises."}, {"fa46": "Google a ajouté un moyen d’afficher le lien original d’une page AMP, mais c’est plutôt bien masqué. Même cette capture d’écran ne suffit pas à comprendre le principe : il faut en fait cliquer sur l’icône en forme de pilule, en haut à droite."}, {"1b57": "Impossible de quitter AMP ?"}, {"551c": "Mon blog étant un loisir personnel, je m’en fiche assez si mes lecteurs n’atteignent pas mon serveur et s’ils lisent mes articles sur ceux de Google. À dire vrai, c’est même probablement une meilleure chose, les serveurs de Google étant bien plus rapides que le mien. Et puis l’entreprise met en avant les pages AMP dans ses résultats de recherche, une carotte importante pour les sites, mais qui ne le touche pas, puisque je ne gagne rien grâce à la publicité."}, {"6de9": "Je me suis lassé d’AMP et de son style assez éloigné de celui de mon blog. Cela, je pouvais le changer, mais Google impose aussi ces barres qui occupent inutilement l’écran et nuisent à la qualité de lecture. La présentation de chaque article est très différente, les métadonnées affichées à la fin sont beaucoup moins nombreuses et importantes. Certes, rien ne m’empêchait d’ajouter moi-même ces éléments aux pages AMP, mais j’ai fini par réaliser que c’était beaucoup de travail alors que j’avais déjà un site optimisé pour le mobile et bien assez rapide, au moins depuis l’Europe."}, {"5497": "Fort de ce constat, j’ai voulu couper totalement AMP pour revenir à de simples liens vers mes articles. C’est alors que je me suis aperçu que Google n’avait pas prévu ce cas de figure. Il n’y a aucun moyen de dire au géant de la recherche que les liens vers une publication doivent s’afficher directement sur le site, et non plus via ses serveurs. Cela n’a pas été prévu, et ce n’est pas un oubli, non, c’est une manière très pernicieuse pour Google d’enfermer les créateurs de site dans son système. Pour preuve, les réponses officielles évoquent toujours de futures améliorations à AMP, au lieu de proposer une solution."}, {"8cd1": "Sur mon serveur, il m’a fallu 30 secondes pour couper le module AMP et vider mon cache, supprimant de fait toutes les versions optimisées. Il m’a fallu une minute ou deux pour réaliser que je devais ajouter une redirection des liens AMP vers les liens orignaux, et encore quelques minutes pour la mettre en place. Mais disons que j’ai retiré AMP très rapidement… pour m’apercevoir que Google affichait toujours les versions optimisées. Vérifications faites, il n’est absolument pas possible de gérer le cache AMP de Google."}, {"2a18": "Concrètement, vous ne pouvez pas ajouter de page au cache, vous ne pouvez pas demander une mise à jour du contenu et surtout, vous ne pouvez pas demander de suppression d’un contenu. Pour être exact, il y a bien une solution officielle, mais elle est fastidieuse (il faut traiter chaque URL manuellement) et d’après mon expérience rapide, elle ne fonctionne même pas. J’ai demandé à supprimer des liens AMP, mais une semaine après, ils étaient toujours indexés par Google."}, {"32c3": "Pire, Google préfère afficher une erreur comme celle-ci, plutôt que d’afficher le site original, où le contenu est disponible. C’est un chantage assez honteux pour obliger les propriétaires de sites à faire marche arrière et à réactiver AMP."}, {"3065": "Google préfère afficher une erreur, plutôt que de renvoyer vers l’article original. C’est du chantage, pour forcer les créateurs de contenu à réactiver AMP par peur de perdre du trafic."}, {"5f4d": "Le problème, c’est que Google ne laisse pas le choix. À partir du moment où on utilise AMP, on accepte que son contenu soit mis en cache sur les serveurs de l’entreprise. De ce côté, c’est automatique, par contre Google ne s’engage pas à vider son cache à votre demande, ce qui est tout de même gênant."}, {"276e": "À ce stade, je n’avais qu’une envie : fuir. N’ayant pas peur de perdre des visites, j’ai choisi la voie la plus radicale. Je n’ai pas réactivé AMP, j’ai laissé la redirection 301 de tous les liens AMP vers les articles originaux et j’ai patienté. Il en faut, de la patience : j’ai tout coupé le 18 mars, Google indexait encore environ 270 liens AMP trois semaines plus tard. Soit, en gros, un peu plus du quart de ce qui était mémorisé par le moteur de recherche auparavant."}, {"7b5b": "La bonne nouvelle, c’est que Google finit par suivre les redirections et par retirer les pages AMP de son index pour mon site. La mauvaise nouvelle, c’est qu’il faudra sans doute autour d’un mois pour les 1000 articles de mon blog. Qu’en sera-t-il pour les plus gros sites ?"}, {"33ee": "Je n’en reviens toujours pas que Google s’en sorte aussi facilement avec ce blocage des contenus AMP. Le moteur de recherche abuse clairement de sa position de force et c’est à mes yeux un argument fort pour ne pas utiliser son système et se tenir complètement à l’écart du projet. Pour ma part, c’est décidé, je ne touche plus à AMP !"}, {"d388": "Quid des Instant Articles ?"}, {"b332": "Après cette mauvaise expérience, je me suis posé la question : est-ce que je ne devrais pas couper aussi les Instant Articles de Facebook ? Après tout, le style est aussi différent de mon blog, et je ne peux pas afficher du tout certaines informations proposées sur le site."}, {"032d": "Pourquoi mes articles de blog sont sur Instant ArticlesJe l’écrivais déjà lors de leur première présentation, il y a près d’un an : les Instant Articles de Facebook m’int…medium.com"}, {"9e8f": "Néanmoins, le réseau social a eu une très bonne idée : un bouton global qui permet de couper totalement les Instant Articles à n’importe quel moment. C’est rassurant je trouve, et même si j’hésite à revenir à mon seul site aussi sur Facebook, cette option m’incite à prolonger l’expérience. Le fait que ce soit uniquement réservé aux apps iOS et Android me rassure aussi, je trouve que c’est moins gênant que dans un navigateur web. Et Facebook transmet la bonne adresse en cas de partage, un excellent point également."}, {"a386": "Mon objectif au fond reste le même : toujours garder la main sur le contenu que je publie. AMP a franchi la ligne jaune en m’empêchant de repasser rapidement sur mon blog quand je l’ai souhaité et je ne veux plus en entendre parler. Pour le moment, Instant Articles reste du bon côté, mais je dois reconnaître que je suis moins enthousiaste qu’à une époque vis à vis de ces plateformes de lecture."}, {"2012": "Même si le confort apporté par l’instantanéité est un élément important, garder le contrôle complet sur l’expérience de lecture devient de plus en plus essentiel à mes yeux. Sur mon blog, hébergé sur mon serveur, je fais ce que je veux. Sur ces services tiers, je cède une grandepartie de mon contrôle et je commence vraiment à me demander si ce n’est pas un mauvais calcul…"}, {"dc5b": "Que pensez-vous des articles AMP, en tant que lecteur ou éditeur ? Croyez-vous que j’ai fait le bon ou le mauvais choix ? N’hésitez pas à témoigner en commentaires ou sur Twitter !"}], "content": "Pourquoi j’ai arrêté d’utiliser AMP Tout le monde ne parle plus que de ça et il faut reconnaître que Google a réussi son coup. Les pages web se convertissent en pages AMP un petit peu partout, tous les sites hébergés par WordPress.com y ont droit automatiquement, tous les CMS s’y mettent et vous avez sûrement croisé dans les résultats de recherche l’icône en forme d’éclair qui signale leur présence. Si vous n’avez jamais cliqué sur ces liens, vous ne savez peut-être pas ce qui se cache derrière ces trois lettres. Ces articles se chargent instantanément, ou presque, à la fois parce qu’ils sont légers et parce qu’ils sont hébergés par Google. À l’origine, l’idée est plutôt bonne : inciter les créateurs du site à alléger leurs pages web pour les visiteurs mobiles. Le projet définit une série de règles et restreint le développement web à quelques éléments uniquement. Impossible d’avoir du contenu interactif et du JavaScript en pagaille, on revient à l’essence du web : du texte, des images et un peu de style, pour faire simple. Le projet AMP est open-source, mais Google est son instigateur et son principal moteur. L’objectif étant d’offrir un web mobile plus rapide, le géant de la recherche a ajouté une petite fonction qui fait toute la différence : les pages AMP sont stockées sur son serveur, pour être livrées plus rapidement. Google agit comme un cache pour la version optimisée, ce qui signifie que le visiteur n’utilise plus votre serveur. C’est le même principe que les Instant Articles de Facebook, ou bien les articles diffusés par Apple News. Chaque service a son système complet et fermé, mais là où le réseau social et le créateur de l’iPhone réservent leurs systèmes de lecture à une app tierce, AMP est disponible directement dans le plus gros moteur de recherche au monde et dans le même navigateur web de base. Et cela change totalement la visibilité de ce service et son rôle pour les créateurs de contenus. Je l’ai vu à l’échelle de mon blog, l’écrasante majorité des requêtes mobiles étaient désormais vers des pages AMP et non vers mon serveur. Google a commencé à pousser ces pages optimisées et en cache sur son serveur et il est difficile désormais de passer à côté. Ce qui n’a pas plu à tout le monde : il ne faut pas longtemps pour trouver des mécontents, des utilisateurs qui essaient de ne plus voir ces liens et des créateurs de contenus qui ne veulent plus du cache de Google. Le sujet devient vite technique, mais on peut résumer le cœur du problème à l’URL, l’adresse de la page web qui est affichée dans le navigateur. Une fois que la page est stockée sur les serveurs de Google, elle change d’adresse et ressemble à ça : https://www.google.fr/amp/s/voiretmanger.fr/alice-pays-merveilles-geronimi-jackson-luske/amp/ L’URL originale est toujours là, mais elle n’est plus directement accessible. Et la plupart des internautes ne vont pas faire attention et récupérer cette adresse pour la partager, au lieu de prendre l’originale. Le problème étant que c’est le cache de Google qui est alors référencé, pas le serveur qui héberge le site. En cas de changement dans l’article, il faut compter sur le bon vouloir de l’entreprise pour que le contenu associé à cette URL soit aussi mis à jour. Google a fini par réagir face aux critiques en ajoutant un bouton en haut qui affiche alors l’adresse originale. Disons-le, ce n’est pas une solution efficace, personne ne va savoir comment trouver l’URL et comment la partager. D’autres solutions sont prévues pour faciliter le partage du lien original, mais ce n’est pas encore au point. En attendant, tout le monde se trompe de lien, même les PDG des plus grandes entreprises. Google a ajouté un moyen d’afficher le lien original d’une page AMP, mais c’est plutôt bien masqué. Même cette capture d’écran ne suffit pas à comprendre le principe : il faut en fait cliquer sur l’icône en forme de pilule, en haut à droite. Impossible de quitter AMP ? Mon blog étant un loisir personnel, je m’en fiche assez si mes lecteurs n’atteignent pas mon serveur et s’ils lisent mes articles sur ceux de Google. À dire vrai, c’est même probablement une meilleure chose, les serveurs de Google étant bien plus rapides que le mien. Et puis l’entreprise met en avant les pages AMP dans ses résultats de recherche, une carotte importante pour les sites, mais qui ne le touche pas, puisque je ne gagne rien grâce à la publicité. Je me suis lassé d’AMP et de son style assez éloigné de celui de mon blog. Cela, je pouvais le changer, mais Google impose aussi ces barres qui occupent inutilement l’écran et nuisent à la qualité de lecture. La présentation de chaque article est très différente, les métadonnées affichées à la fin sont beaucoup moins nombreuses et importantes. Certes, rien ne m’empêchait d’ajouter moi-même ces éléments aux pages AMP, mais j’ai fini par réaliser que c’était beaucoup de travail alors que j’avais déjà un site optimisé pour le mobile et bien assez rapide, au moins depuis l’Europe. Fort de ce constat, j’ai voulu couper totalement AMP pour revenir à de simples liens vers mes articles. C’est alors que je me suis aperçu que Google n’avait pas prévu ce cas de figure. Il n’y a aucun moyen de dire au géant de la recherche que les liens vers une publication doivent s’afficher directement sur le site, et non plus via ses serveurs. Cela n’a pas été prévu, et ce n’est pas un oubli, non, c’est une manière très pernicieuse pour Google d’enfermer les créateurs de site dans son système. Pour preuve, les réponses officielles évoquent toujours de futures améliorations à AMP, au lieu de proposer une solution. Sur mon serveur, il m’a fallu 30 secondes pour couper le module AMP et vider mon cache, supprimant de fait toutes les versions optimisées. Il m’a fallu une minute ou deux pour réaliser que je devais ajouter une redirection des liens AMP vers les liens orignaux, et encore quelques minutes pour la mettre en place. Mais disons que j’ai retiré AMP très rapidement… pour m’apercevoir que Google affichait toujours les versions optimisées. Vérifications faites, il n’est absolument pas possible de gérer le cache AMP de Google. Concrètement, vous ne pouvez pas ajouter de page au cache, vous ne pouvez pas demander une mise à jour du contenu et surtout, vous ne pouvez pas demander de suppression d’un contenu. Pour être exact, il y a bien une solution officielle, mais elle est fastidieuse (il faut traiter chaque URL manuellement) et d’après mon expérience rapide, elle ne fonctionne même pas. J’ai demandé à supprimer des liens AMP, mais une semaine après, ils étaient toujours indexés par Google. Pire, Google préfère afficher une erreur comme celle-ci, plutôt que d’afficher le site original, où le contenu est disponible. C’est un chantage assez honteux pour obliger les propriétaires de sites à faire marche arrière et à réactiver AMP. Google préfère afficher une erreur, plutôt que de renvoyer vers l’article original. C’est du chantage, pour forcer les créateurs de contenu à réactiver AMP par peur de perdre du trafic. Le problème, c’est que Google ne laisse pas le choix. À partir du moment où on utilise AMP, on accepte que son contenu soit mis en cache sur les serveurs de l’entreprise. De ce côté, c’est automatique, par contre Google ne s’engage pas à vider son cache à votre demande, ce qui est tout de même gênant. À ce stade, je n’avais qu’une envie : fuir. N’ayant pas peur de perdre des visites, j’ai choisi la voie la plus radicale. Je n’ai pas réactivé AMP, j’ai laissé la redirection 301 de tous les liens AMP vers les articles originaux et j’ai patienté. Il en faut, de la patience : j’ai tout coupé le 18 mars, Google indexait encore environ 270 liens AMP trois semaines plus tard. Soit, en gros, un peu plus du quart de ce qui était mémorisé par le moteur de recherche auparavant. La bonne nouvelle, c’est que Google finit par suivre les redirections et par retirer les pages AMP de son index pour mon site. La mauvaise nouvelle, c’est qu’il faudra sans doute autour d’un mois pour les 1000 articles de mon blog. Qu’en sera-t-il pour les plus gros sites ? Je n’en reviens toujours pas que Google s’en sorte aussi facilement avec ce blocage des contenus AMP. Le moteur de recherche abuse clairement de sa position de force et c’est à mes yeux un argument fort pour ne pas utiliser son système et se tenir complètement à l’écart du projet. Pour ma part, c’est décidé, je ne touche plus à AMP ! Quid des Instant Articles ? Après cette mauvaise expérience, je me suis posé la question : est-ce que je ne devrais pas couper aussi les Instant Articles de Facebook ? Après tout, le style est aussi différent de mon blog, et je ne peux pas afficher du tout certaines informations proposées sur le site. Pourquoi mes articles de blog sont sur Instant ArticlesJe l’écrivais déjà lors de leur première présentation, il y a près d’un an : les Instant Articles de Facebook m’int…medium.com Néanmoins, le réseau social a eu une très bonne idée : un bouton global qui permet de couper totalement les Instant Articles à n’importe quel moment. C’est rassurant je trouve, et même si j’hésite à revenir à mon seul site aussi sur Facebook, cette option m’incite à prolonger l’expérience. Le fait que ce soit uniquement réservé aux apps iOS et Android me rassure aussi, je trouve que c’est moins gênant que dans un navigateur web. Et Facebook transmet la bonne adresse en cas de partage, un excellent point également. Mon objectif au fond reste le même : toujours garder la main sur le contenu que je publie. AMP a franchi la ligne jaune en m’empêchant de repasser rapidement sur mon blog quand je l’ai souhaité et je ne veux plus en entendre parler. Pour le moment, Instant Articles reste du bon côté, mais je dois reconnaître que je suis moins enthousiaste qu’à une époque vis à vis de ces plateformes de lecture. Même si le confort apporté par l’instantanéité est un élément important, garder le contrôle complet sur l’expérience de lecture devient de plus en plus essentiel à mes yeux. Sur mon blog, hébergé sur mon serveur, je fais ce que je veux. Sur ces services tiers, je cède une grandepartie de mon contrôle et je commence vraiment à me demander si ce n’est pas un mauvais calcul… Que pensez-vous des articles AMP, en tant que lecteur ou éditeur ? Croyez-vous que j’ai fait le bon ou le mauvais choix ? N’hésitez pas à témoigner en commentaires ou sur Twitter ! ", "name": "622", "child": "622_1\t622_2\t622_3\t622_4\t622_5\t622_6622_1\t622_2\t622_3\t622_4\t622_5\t622_6622_1\t622_2\t622_3\t622_4\t622_5\t622_6622_1\t622_2\t622_3\t622_4\t622_5\t622_6622_1\t622_2\t622_3\t622_4\t622_5\t622_6622_1\t622_2\t622_3\t622_4\t622_5\t622_6", "timestamp": "Apr 11"}