{"parent": "", "title": "The 3 Most Effective MailChimp Integrations for Shopify", "author": "Steven Rado", "sentences": [{"283d": "The 3 Most Effective MailChimp Integrations for Shopify"}, {"46c7": "Whether you manage a Shopify store for yourself or a client, you should be taking advantage of the various integrations that Shopify offers. I’ve found that MailChimp, the email marketing service, offers many different integrations that can streamline the customer experience process and increase retention and purchases through various customer re-engagement automations. Linking your Shopify store to MailChimp will allow you to take advantage of eight different e-commerce automations, and put your email marketing efforts on autopilot."}, {"427f": "MailChimp makes it easy to set up these automations once you link your Shopify store and mailing lists. Simply choose which email list you want to link with the automation and begin creating your email. You can edit sending schedules, subjects lines, and customize and design email templates. If you are having trouble setting up your first automation, MailChimp explains the process step-by-step here."}, {"4a97": "Abandoned Cart Email"}, {"4de1": "You spend lots of time and money in your marketing efforts to drive traffic to your website. Since you sell great products, many of your visitors will add an item to the shopping cart. However, about 65% of these shoppers will not purchase the item or items that they have added to their cart. This leaves a big discrepancy between your “added to cart” and “purchased” rates. In an effort to increase the conversions of website visitors into customers, MailChimp lets you send a custom, automated email to visitors that have added an item to the shopping cart (Shopify also has this functionality built-in, but it’s only available on some of their more expensive paid tiers). This allows you to encourage customers to complete their purchase by offering a discount, free shipping, or bonus gift."}, {"6ab5": "Customer Re-engagement Email"}, {"6a58": "If a customer buys a product from your store (which of course sells great products with unsurpassed customer service), it is likely that they will buy again. MailChimp’s customer re-engagement email automation allows you to set up triggers that send emails to customers who have purchased an item from your store in the past. The standard setup involves sending three different emails. These emails are triggered 30, 60, and 90 days after the customer’s last purchase. I like to use this standard setup because it allows me to test different subject lines, copy, and offers, without spamming the customer’s inbox. You can always change the triggers to send these emails more frequently, but do so with caution. If you’re sending re-engagement, abandoned cart, newsletters, and the latest sales updates to your customers they may feel overwhelmed and unsubscribe."}, {"76df": "Image from MailChimp"}, {"8a42": "The re-engagement email is more than just a chance to get more sales. It’s a chance to nurture relationships with your existing customers. Subject lines like “We miss you” or “We haven’t seen you in a while…” have better open rates as they reference an existing relationship and seem less spammy. Personalizing subject lines with the customer’s first name also helps to further make that connection of an existing relationship."}, {"07e4": "Sometimes a great subject line and copy isn’t enough to get conversions. Delivering value in these emails is the best way to develop the customer relationship and drive purchases. One of the simplest ways to do this is through discounts or free shipping, which are aimed at increasing purchases at that exact moment. Other forms of value could focus on education and building a long-term relationship with the customer. Sharing articles or blog posts that your customers care about will help them to learn more about your product and industry, and will make you a trusted source of information. For example, if you sell laptop cases, your customers may enjoy a “how-to” article about laptop care. I encourage you to experiment and test these different ways to re-engage your customers, and decide which works best for your business."}, {"12d4": "Best Customers Email"}, {"e581": "This automation rewards your best customers with special promotions, discounts, and sales. It is very effective since you are retargeting customers that already love your products. A little nudge in the form of a sale or coupon code may be all they need to make another purchase. Like the re-engagement automation, this automation goes out in a triggered sequence so you can continue to engage your best customers and provide value."}, {"3c1c": "Conclusion"}, {"f7fe": "Running a Shopify e-commerce store can be a daunting task. Taking advantage of integrations such as MailChimp can put your email marketing on cruise control. Using the above email marketing automations lets you engage potential and existing customers with minimal effort. This frees up time to focus on other important parts of your business such as product development, fulfillment, or driving traffic to your website."}, {"d7da": "About the author: Steven Rado is a growth marketer at one of Connecticut’s fastest growing digital advertising agencies. Steven helps grow businesses by optimizing inbound marketing funnels for lead generation through content creation, SMM, PPC, and email marketing."}], "content": "The 3 Most Effective MailChimp Integrations for Shopify Whether you manage a Shopify store for yourself or a client, you should be taking advantage of the various integrations that Shopify offers. I’ve found that MailChimp, the email marketing service, offers many different integrations that can streamline the customer experience process and increase retention and purchases through various customer re-engagement automations. Linking your Shopify store to MailChimp will allow you to take advantage of eight different e-commerce automations, and put your email marketing efforts on autopilot. MailChimp makes it easy to set up these automations once you link your Shopify store and mailing lists. Simply choose which email list you want to link with the automation and begin creating your email. You can edit sending schedules, subjects lines, and customize and design email templates. If you are having trouble setting up your first automation, MailChimp explains the process step-by-step here. Abandoned Cart Email You spend lots of time and money in your marketing efforts to drive traffic to your website. Since you sell great products, many of your visitors will add an item to the shopping cart. However, about 65% of these shoppers will not purchase the item or items that they have added to their cart. This leaves a big discrepancy between your “added to cart” and “purchased” rates. In an effort to increase the conversions of website visitors into customers, MailChimp lets you send a custom, automated email to visitors that have added an item to the shopping cart (Shopify also has this functionality built-in, but it’s only available on some of their more expensive paid tiers). This allows you to encourage customers to complete their purchase by offering a discount, free shipping, or bonus gift. Customer Re-engagement Email If a customer buys a product from your store (which of course sells great products with unsurpassed customer service), it is likely that they will buy again. MailChimp’s customer re-engagement email automation allows you to set up triggers that send emails to customers who have purchased an item from your store in the past. The standard setup involves sending three different emails. These emails are triggered 30, 60, and 90 days after the customer’s last purchase. I like to use this standard setup because it allows me to test different subject lines, copy, and offers, without spamming the customer’s inbox. You can always change the triggers to send these emails more frequently, but do so with caution. If you’re sending re-engagement, abandoned cart, newsletters, and the latest sales updates to your customers they may feel overwhelmed and unsubscribe. Image from MailChimp The re-engagement email is more than just a chance to get more sales. It’s a chance to nurture relationships with your existing customers. Subject lines like “We miss you” or “We haven’t seen you in a while…” have better open rates as they reference an existing relationship and seem less spammy. Personalizing subject lines with the customer’s first name also helps to further make that connection of an existing relationship. Sometimes a great subject line and copy isn’t enough to get conversions. Delivering value in these emails is the best way to develop the customer relationship and drive purchases. One of the simplest ways to do this is through discounts or free shipping, which are aimed at increasing purchases at that exact moment. Other forms of value could focus on education and building a long-term relationship with the customer. Sharing articles or blog posts that your customers care about will help them to learn more about your product and industry, and will make you a trusted source of information. For example, if you sell laptop cases, your customers may enjoy a “how-to” article about laptop care. I encourage you to experiment and test these different ways to re-engage your customers, and decide which works best for your business. Best Customers Email This automation rewards your best customers with special promotions, discounts, and sales. It is very effective since you are retargeting customers that already love your products. A little nudge in the form of a sale or coupon code may be all they need to make another purchase. Like the re-engagement automation, this automation goes out in a triggered sequence so you can continue to engage your best customers and provide value. Conclusion Running a Shopify e-commerce store can be a daunting task. Taking advantage of integrations such as MailChimp can put your email marketing on cruise control. Using the above email marketing automations lets you engage potential and existing customers with minimal effort. This frees up time to focus on other important parts of your business such as product development, fulfillment, or driving traffic to your website. About the author: Steven Rado is a growth marketer at one of Connecticut’s fastest growing digital advertising agencies. Steven helps grow businesses by optimizing inbound marketing funnels for lead generation through content creation, SMM, PPC, and email marketing. ", "name": "639", "child": "639_1", "timestamp": "Oct 10, 2016"}