{"parent": "", "title": "What Does “Playoff Basketball” Really Mean?", "author": "Ryan O'Hanlon", "sentences": [{"462c": "What Does “Playoff Basketball” Really Mean?"}, {"7f83": "Does every possession matter? Does defense win championships? Does the pressure really ramp up in the postseason? Is the competition that much better? Coaches and analysts talk about the truth behind the playoff basketball clichés."}, {"43fc": "Kyrie Irving and DeMar DeRozan are the same player."}, {"4837": "Irving shoots more accurately and creates more often, while DeRozan bulldozes his way to the line at a much higher clip. Defensively, they are mediocre at best, and crippling liabilities at worst. DeRozan plays in a languid staccato of drawn-out jabs, while Irving effectively dances along the border of looseness and carelessness with each possession. But even though their games lead down different paths, their production reaches the same point: Per Basketball-Reference, Irving and DeRozan have produced almost the same number of win shares in 2017."}, {"09a5": "Zoom out far enough, and there’s nothing separating the two."}, {"1522": "But the increased attention to the playoffs zooms us right back in: It puts every team, every player, every ref, every broadcaster, and every courtside cherub under the microscope. And with a focused lens hovering over their play, Irving shines, while DeRozan combusts."}, {"a30a": "Kyrie Irving and DeMar DeRozan (Getty Images)"}, {"7453": "Over the previous two regular seasons, the Raptors averaged more than 105 points per 100 possessions with DeRozan on the court — an elite number. Over the past two postseasons, that rate has dropped below 100; this regular season, Philadelphia’s league-worst number was 100.7. And while Cleveland’s number with Irving dropped from 111 in the regular season to 108 in the 2015 playoffs, it shot up from 110 to 116 last year."}, {"6ccf": "Over the past couple of years, the Raptors and Cavs have been two of the league’s best offenses during the regular season. During the playoffs, the Cavs have remained so … and the Raptors are terrible."}, {"30ab": "“There’s more intensity [in the playoffs]; everything means more,” former Houston Rockets coach and current NBA TV and TNT analyst Kevin McHale said. “It’s just completely different.”"}, {"e35d": "But how is it different? Every spring, the word “pressure” starts to pop up in basketball conversations — how some teams thrive under it, and others fall apart."}, {"0de0": "Maybe Irving and his teammates have some ineffable “it” that allows them to execute at an incredible level even when every game is on national television and none of their opponents are actively trying to lose. And maybe DeRozan and Co. benefit from playing half their games in a different country, crushing the rest of the league under a barrage of elbow jumpers and free throws, hidden away amid the pressure-free environment north of the border."}, {"60dd": "Or maybe playoff basketball is just a slightly different game than regular-season basketball. The rules remain the same, but more rest, more prep time, and more talent will alter the winning equation as soon as Round 1 tips off."}, {"762b": "Defense Wins Championships—But Will It Win This Year’s?What defense means in this age of explosive offensetheringer.com"}, {"6a49": "The biggest difference between regular-season basketball and playoff basketball is every team in the playoffs is good enough to make the playoffs."}, {"1c34": "“You’ve got two playoff teams [in every series], as simple as that sounds,” ESPN NBA analyst P.J. Carlesimo told me. “People say, ‘What’s different about the playoffs?’ Well, guess what? You’re not playing the 14 teams that are under .500.”"}, {"6833": "There’s also the matter of logistics. During the 2016–17 regular season, there were 488 back-to-back games on the schedule. As ESPN The Magazine’s Baxter Holmes wrote back in October, “There are 42 games in the 2016–17 season in which the schedule creates a distinct competitive disadvantage for one team.”"}, {"0a84": "While the rest debate has been the ambient noise of this NBA season — and will continue to be until someone in power does something more than write a strongly worded email — the knob on the “shorten the regular season” dial should be turned toward zero for the next two months. (That is, until a star gets hurt in the postseason.)"}, {"2b07": "There are no back-to-backs, and at least one travel/rest day between the first four games of each series, and in each matchup, both teams are on the same schedule."}, {"fbe5": "“You play a game, you’ve got two days off, you both fly to the next city, and then you play the game,” Carlesimo said. “The fatigue factor that often slants to one team or the other in the regular season is just not there because there’s not a significant travel advantage in the playoffs.”"}, {"d314": "Five Potential Out-of-Nowhere Breakouts to Watch for in the NBA PlayoffsRemember Goran Dragic’s explosion against the Spurs in 2010? These players could have a similar postseason impact.theringer.com"}, {"c8aa": "With the more manageable schedule comes more preparation time. Over the course of a given week, NBA teams will often barely have any time to practice — let alone scout for the specific tendencies of their opponent. Come the postseason, teams have already begun scouting potential opponents, but there’s an initial lull that gets filled with prep, and then there’s always at least a day between each game to fine-tune strategies, practice against your second team, and decide on a game plan."}, {"6198": "“If you play a team on a back end of a back-to-back, you have a morning breakfast meeting, a walk-through, then you have about 15 minutes before the game to talk,” McHale said. “[In the playoffs], you have about four, five games to say, ‘OK, they really struggle with pick-and-roll on the right wing, and these are the spots that are going to be open. They overcommit here, they under-commit there.’”"}, {"33cc": "In the Finals last year, the Cavs had to figure out ways to stop Stephen Curry. But they were also able to use his substandard defense to their advantage. Golden State often tried to hide Curry on Cleveland’s weakest offensive player, so Cleveland forced him into picks and ball screens in order get him switched onto someone like LeBron — and, well, it doesn’t get any easier than this:"}, {"5419": "During the regular season, teams will also rarely play the same team twice in a row. In the postseason, they’re playing the same team up to seven times. Once the base level of familiarity is established — this is their rotation, these are their play sets — then comes everybody’s favorite playoff buzzword: adjustments."}, {"c31f": "“It becomes a little bit of a chess game,” Carlesimo said. “I always liken the playoffs to coaching in college. Because you have a couple of days to get ready for every game, so you can have more control over a game. Whereas in the regular season, you don’t have nearly as much control.”"}, {"0537": "Most adjustments are unrecognizable to the average NBA fan, and most don’t make a difference. If they do, the improvement lasts only until the other side makes its own change. But sometimes, there’s an adjustment that just can’t be adjusted against."}, {"233d": "The most famous one in recent years — and arguably one of the most philosophically important adjustments in league history — was when Golden State head coach Steve Kerr removed center Andrew Bogut from the Warriors’ starting lineup in favor of small forward Andre Iguodala during the 2015 NBA Finals against Cleveland, who were up 2–1 at the time. At the behest of a millennial assistant, Kerr birthed the so-called “Lineup of Death,” and Golden State won the next three games by a combined 42 points."}, {"4b95": "Such creative epiphanies, though, only get squeezed out of the desperation that’s created by the day-after-day repetition of a playoff series. And sometimes, like when Gregg Popovich swapped Boris Diaw for Tiago Splitter in the 2014 Finals between the Spurs and the Heat, the adjustment is a personnel change paired with a more subtle strategic shift. (It’s not a coincidence that these brilliant adjustments both came against LeBron James. His versatility forces coaches to go beyond the borders of conventional basketball thought.)"}, {"3270": "“Every time, it was the same thing,” Mika Honkasalo, an NBA analyst and a basketball coach in Finland, told me. “There’s a hedge on the ball screen, and then [the Spurs] hit it to the top of the key. Diaw or someone basically knows what the rotations are with his eyes closed. Their players can execute so well that it was basically just playing the same math problem over again.”"}, {"1bcc": "That’s often how it feels when a coach makes an unadjustable adjustment: as if he and his players just put the finishing touches on an elegant, multi-chalkboard equation. No matter how good the opposing coaching staff is and how talented their players are, they’re powerless against a game plan that’s suddenly become inevitable."}, {"2674": "A year ago, Honkasalo conducted a study to determine what kinds of teams outperform or underperform their playoff expectations. In other words, compared with their regular-season numbers, which teams did better in the postseason and which teams did worse?"}, {"8d94": "He found that teams with higher defensive efficiency ratings tended to exceed expectations, and teams with higher offensive efficiency ratings performed worse than expected. (But teams with high effective field goal percentages also exceeded expectation, suggesting that teams that rely on free throws aren’t as dangerous in the postseason. Rockets fans, you can enjoy the uncertainty of rooting for a team that excels at both.) The study also found that teams with high offensive rebounding rates tended to perform worse come playoff time, and teams that shared the ball more tended to perform better."}, {"ba5b": "Why the changes? Honkasalo said it’s the adjustment saturation. During the regular season, the best-prepared teams can beat up on opponents whose game plans and gameplay aren’t vacuum-tight. Teams like this year’s Spurs and Heat exploit, Honkasalo said, “the dumb advantages like the lazy box outs or the transition running.” But once the postseason begins, every team is prepared, so the game slows down, transition-scoring rates plummet, and the easy offensive-rebound opportunities no longer present themselves. In a macro sense, coaching actually evens out in the postseason."}, {"571b": "Russell Westbrook built his MVP candidacy by turning basketball into football: exploding through disorganized defenses and leading the league in fast-break points per game. In the playoffs, though, the Thunder will have to rely more often on a half-court offense that finished the year 25th in the NBA in points per possession. As for their first-round opponent? The Rockets were the best half-court offense in the league."}, {"6ea9": "The Five Plays You Need to Know About Heading Into the NBA PlayoffsFrom mutated pick-and-rolls to off-kilter handoffs, here’s how your favorite team is going to get easy bucketstheringer.com"}, {"70de": "“It’s still basketball, and the players are still going to decide it,” Carlesimo said. “But there are a lot fewer elements left to chance.”"}, {"206d": "With the increased prep time and the familiarity that comes with the repetitive schedule, weaknesses that might skirt by on a Tuesday night at the Barclays Center get put under a spotlight in May and June. If a wing player on a certain team can’t hit 3-pointers at an efficient rate, opponents will barely pay any attention to him."}, {"705f": "“[In the 2015 Western Conference semifinals], Steve Kerr just didn’t guard [Grizzlies shooting guard] Tony Allen, but he put [center Andrew] Bogut on him,” McHale said. “And Bogut was just a roamer. And that gave them a whole different look defensively.”"}, {"9283": "If a big man can’t defend against a smaller lineup, he’ll see his playing time dwindle — as happened with Bogut in the Finals over the past two seasons. And if a big man can score but can’t anchor a defense, he might have a place on the second unit of a top team in the regular season, but in the playoffs he’ll get stapled to the bench."}, {"a6a4": "“If you’re [Golden State’s] JaVale McGee, you can’t play defense against a good team,” Honkasalo said. “You don’t understand all the nuances of where you’re supposed to stand. When he plays against the well-prepared, good team, that just doesn’t work at all.”"}, {"11e5": "Playoff defense is more creative and less forgiving. Even though the worst offenses in the league don’t make it beyond the 82nd game, efficiency and scoring rates tend to decrease in the postseason. Catch-and-shoot scorers like Kyle Korver and Klay Thompson no longer have as much space for their jump shots, and their percentages drop once the calendar hits mid-April."}, {"5293": "Yet while the threat Korver and Thompson pose still creates space for an offense, an inefficient scorer like DeRozan crumples amid the increased pressure. This year, over 90 percent of his shots have come from within the 3-point arc, so DeRozan has to make those shots at an incredibly high rate in order to still be an effective scorer. It’s the whole “three is more than two” thing. He pulls off that tight-rope act in the regular season, but it’s just harder to make shots in the playoffs, and so if DeRozan’s field goal percentage drops even just a few points, he becomes a net negative on offense. In the playoffs, he shoots a full 5 percentage points worse from the field."}, {"e794": "Eight years into his career, it’s clear that DeRozan can be the lead scorer on a great offensive team — during the regular season. Once the playoffs start, though, his game looks completely out of place."}, {"3595": "If DeRozan is the prototypical regular-season player, then Irving was made for the playoffs."}, {"61f8": "“[Defenses] just know whatever play is going to come,” Carlesimo said. “You know what I mean? They’re more wired in. If there is a call, they know what’s going to happen, so it comes down to more execution and individual creativity than it does what a team is doing.”"}, {"d3e8": "No one in the NBA is better at combining individual creativity and execution than Irving. Among players with at least 1.5 isolation possessions per game, almost no one scores at a higher rate (1.12 per possession) than the Cleveland point guard. And among players with at least 200 iso possessions this season, no one else breaks 1.05. (DeRozan, at 1.02, comes in a distant third behind Irving and Damian Lillard.) Irving’s combination of individual efficiency and raw production puts him on his own level."}, {"0289": "During the regular season last year, Cleveland’s net rating was slightly better with Irving off the court. Once the playoffs hit, though, they were better off with him in the game by 1.5 points per possession."}, {"ba8b": "Some of that is likely due to a more dialed-in and more prepared defense that’s able to carry some of Irving’s inadequacies on that end — and maybe his own defensive performance improves too — but it’s also because there’s no adjustment to be made against an incredible one-on-one scorer."}, {"c88c": "“He’s not good at the stuff that can be taken away,” Honkasalo said. In other words, he’s good at the one thing a great defense is helpless against."}, {"1138": "By the time teams reach the Finals, if defensive game plans are fully optimized and each team has planned for every set the opponent throws at it, sometimes there is no series-deciding adjustment to make. In that case, an efficient isolation scorer serves as a fail-safe for offenses that get diminished by prepared and aggressive postseason defenses. Last year, it was enough to give the Cavs one final push over the wall."}, {"cae8": "Is there a secret to solving the playoffs? For one, go get LeBron James. His teams always exceed expectation because he’s LeBron James and you’re not. But is there a new way teams should play once they hit April?"}, {"5da2": "Before the league’s pace of play was put through a particle accelerator, the Memphis Grizzlies were able to, despite never earning more than a 4-seed, turn every game into something like a coin flip. Those odds don’t work in the regular season, but you’ll take it against the Warriors or the Spurs."}, {"452a": "“There was real stuff that they did to make that happen,” Honkasalo said. “Limit 3-pointers — high-variance stuff — and keep the games slow. Get the variance out of it, keep it close. Play a 50–50 game and hope you win — that’s the logic.”"}, {"bf36": "Under new coach David Fizdale, the Grizzlies have dragged their heels toward the pace-and-space era. While that slow evolution has allowed them to push an aging core into the playoffs for a seventh straight year, it doesn’t necessarily portend postseason success. They play the Spurs in Round 1, and San Antonio is essentially just a much better version of what Memphis has become."}, {"02f1": "Are LeBron’s Cavaliers Playoff Scary?Or are they just regular scary? Let’s consult the NBA playoffs fear index.theringer.com"}, {"aa06": "The best squads want better than coin-flip odds. Teams spend the entire season crafting their identities, smoothing out their defensive rotations, and fine-tuning their offensive philosophies. The playoffs require an incredible level of execution — one that only seems possible after a regular season’s worth of preparation. Suddenly shifting toward a playoff-optimized strategy would be its own kind of disaster."}, {"b9d9": "“If your identity just changes in the playoffs, you have problems,” McHale said. “It’s gotta be an extension of who you are. I promise you, Houston is not gonna come out now and shoot like one 3-pointer, and say, ‘Haha, we tricked you all year.’”"}, {"bf9d": "It’s fun to imagine Popovich, Celtics head coach Brad Stevens, and even Cleveland’s Tyronn Lue — if you’ll believe him — as these grand masters of multidimensional chess, directing their players to take a strange number of midrange shots or play bad pick-and-roll defense so as to distract opponents from a never-before-used game plan they’re waiting to unveil until the playoffs. But the margin for error in the postseason just doesn’t lend itself to anything that hasn’t been drilled to the point of being airtight."}, {"1253": "If the regular season is figuring out how to run your stuff, the postseason is figuring out how your stuff works against whoever you’re playing. It’s just that some teams are better positioned to succeed as the playoffs begin."}, {"a2f9": "The basketball-adjacent world is watching and the emotional stakes do have an effect — how else to explain a certain then-Miami star’s performance in 2011? — but those changes are intangible, unpredictable, and, ultimately, the negatives and the positives likely cancel each other out. Playoff basketball is tangibly different because coaches and players have more time to prepare and rest, the easy advantages that can be mined in mid-February all but disappear in April, and defenses get optimized toward their opponent. In the face of that, some offenses still work, just in a reduced or more painstaking fashion, while others collapse under the new effort required to hide their inefficiencies."}, {"56f0": "Once every possible adjustment is made, though, it gets pretty simple: If our guy can beat your guy, we’re probably going to win."}], "content": "What Does “Playoff Basketball” Really Mean? Does every possession matter? Does defense win championships? Does the pressure really ramp up in the postseason? Is the competition that much better? Coaches and analysts talk about the truth behind the playoff basketball clichés. Kyrie Irving and DeMar DeRozan are the same player. Irving shoots more accurately and creates more often, while DeRozan bulldozes his way to the line at a much higher clip. Defensively, they are mediocre at best, and crippling liabilities at worst. DeRozan plays in a languid staccato of drawn-out jabs, while Irving effectively dances along the border of looseness and carelessness with each possession. But even though their games lead down different paths, their production reaches the same point: Per Basketball-Reference, Irving and DeRozan have produced almost the same number of win shares in 2017. Zoom out far enough, and there’s nothing separating the two. But the increased attention to the playoffs zooms us right back in: It puts every team, every player, every ref, every broadcaster, and every courtside cherub under the microscope. And with a focused lens hovering over their play, Irving shines, while DeRozan combusts. Kyrie Irving and DeMar DeRozan (Getty Images) Over the previous two regular seasons, the Raptors averaged more than 105 points per 100 possessions with DeRozan on the court — an elite number. Over the past two postseasons, that rate has dropped below 100; this regular season, Philadelphia’s league-worst number was 100.7. And while Cleveland’s number with Irving dropped from 111 in the regular season to 108 in the 2015 playoffs, it shot up from 110 to 116 last year. Over the past couple of years, the Raptors and Cavs have been two of the league’s best offenses during the regular season. During the playoffs, the Cavs have remained so … and the Raptors are terrible. “There’s more intensity [in the playoffs]; everything means more,” former Houston Rockets coach and current NBA TV and TNT analyst Kevin McHale said. “It’s just completely different.” But how is it different? Every spring, the word “pressure” starts to pop up in basketball conversations — how some teams thrive under it, and others fall apart. Maybe Irving and his teammates have some ineffable “it” that allows them to execute at an incredible level even when every game is on national television and none of their opponents are actively trying to lose. And maybe DeRozan and Co. benefit from playing half their games in a different country, crushing the rest of the league under a barrage of elbow jumpers and free throws, hidden away amid the pressure-free environment north of the border. Or maybe playoff basketball is just a slightly different game than regular-season basketball. The rules remain the same, but more rest, more prep time, and more talent will alter the winning equation as soon as Round 1 tips off. Defense Wins Championships—But Will It Win This Year’s?What defense means in this age of explosive offensetheringer.com The biggest difference between regular-season basketball and playoff basketball is every team in the playoffs is good enough to make the playoffs. “You’ve got two playoff teams [in every series], as simple as that sounds,” ESPN NBA analyst P.J. Carlesimo told me. “People say, ‘What’s different about the playoffs?’ Well, guess what? You’re not playing the 14 teams that are under .500.” There’s also the matter of logistics. During the 2016–17 regular season, there were 488 back-to-back games on the schedule. As ESPN The Magazine’s Baxter Holmes wrote back in October, “There are 42 games in the 2016–17 season in which the schedule creates a distinct competitive disadvantage for one team.” While the rest debate has been the ambient noise of this NBA season — and will continue to be until someone in power does something more than write a strongly worded email — the knob on the “shorten the regular season” dial should be turned toward zero for the next two months. (That is, until a star gets hurt in the postseason.) There are no back-to-backs, and at least one travel/rest day between the first four games of each series, and in each matchup, both teams are on the same schedule. “You play a game, you’ve got two days off, you both fly to the next city, and then you play the game,” Carlesimo said. “The fatigue factor that often slants to one team or the other in the regular season is just not there because there’s not a significant travel advantage in the playoffs.” Five Potential Out-of-Nowhere Breakouts to Watch for in the NBA PlayoffsRemember Goran Dragic’s explosion against the Spurs in 2010? These players could have a similar postseason impact.theringer.com With the more manageable schedule comes more preparation time. Over the course of a given week, NBA teams will often barely have any time to practice — let alone scout for the specific tendencies of their opponent. Come the postseason, teams have already begun scouting potential opponents, but there’s an initial lull that gets filled with prep, and then there’s always at least a day between each game to fine-tune strategies, practice against your second team, and decide on a game plan. “If you play a team on a back end of a back-to-back, you have a morning breakfast meeting, a walk-through, then you have about 15 minutes before the game to talk,” McHale said. “[In the playoffs], you have about four, five games to say, ‘OK, they really struggle with pick-and-roll on the right wing, and these are the spots that are going to be open. They overcommit here, they under-commit there.’” In the Finals last year, the Cavs had to figure out ways to stop Stephen Curry. But they were also able to use his substandard defense to their advantage. Golden State often tried to hide Curry on Cleveland’s weakest offensive player, so Cleveland forced him into picks and ball screens in order get him switched onto someone like LeBron — and, well, it doesn’t get any easier than this: During the regular season, teams will also rarely play the same team twice in a row. In the postseason, they’re playing the same team up to seven times. Once the base level of familiarity is established — this is their rotation, these are their play sets — then comes everybody’s favorite playoff buzzword: adjustments. “It becomes a little bit of a chess game,” Carlesimo said. “I always liken the playoffs to coaching in college. Because you have a couple of days to get ready for every game, so you can have more control over a game. Whereas in the regular season, you don’t have nearly as much control.” Most adjustments are unrecognizable to the average NBA fan, and most don’t make a difference. If they do, the improvement lasts only until the other side makes its own change. But sometimes, there’s an adjustment that just can’t be adjusted against. The most famous one in recent years — and arguably one of the most philosophically important adjustments in league history — was when Golden State head coach Steve Kerr removed center Andrew Bogut from the Warriors’ starting lineup in favor of small forward Andre Iguodala during the 2015 NBA Finals against Cleveland, who were up 2–1 at the time. At the behest of a millennial assistant, Kerr birthed the so-called “Lineup of Death,” and Golden State won the next three games by a combined 42 points. Such creative epiphanies, though, only get squeezed out of the desperation that’s created by the day-after-day repetition of a playoff series. And sometimes, like when Gregg Popovich swapped Boris Diaw for Tiago Splitter in the 2014 Finals between the Spurs and the Heat, the adjustment is a personnel change paired with a more subtle strategic shift. (It’s not a coincidence that these brilliant adjustments both came against LeBron James. His versatility forces coaches to go beyond the borders of conventional basketball thought.) “Every time, it was the same thing,” Mika Honkasalo, an NBA analyst and a basketball coach in Finland, told me. “There’s a hedge on the ball screen, and then [the Spurs] hit it to the top of the key. Diaw or someone basically knows what the rotations are with his eyes closed. Their players can execute so well that it was basically just playing the same math problem over again.” That’s often how it feels when a coach makes an unadjustable adjustment: as if he and his players just put the finishing touches on an elegant, multi-chalkboard equation. No matter how good the opposing coaching staff is and how talented their players are, they’re powerless against a game plan that’s suddenly become inevitable. A year ago, Honkasalo conducted a study to determine what kinds of teams outperform or underperform their playoff expectations. In other words, compared with their regular-season numbers, which teams did better in the postseason and which teams did worse? He found that teams with higher defensive efficiency ratings tended to exceed expectations, and teams with higher offensive efficiency ratings performed worse than expected. (But teams with high effective field goal percentages also exceeded expectation, suggesting that teams that rely on free throws aren’t as dangerous in the postseason. Rockets fans, you can enjoy the uncertainty of rooting for a team that excels at both.) The study also found that teams with high offensive rebounding rates tended to perform worse come playoff time, and teams that shared the ball more tended to perform better. Why the changes? Honkasalo said it’s the adjustment saturation. During the regular season, the best-prepared teams can beat up on opponents whose game plans and gameplay aren’t vacuum-tight. Teams like this year’s Spurs and Heat exploit, Honkasalo said, “the dumb advantages like the lazy box outs or the transition running.” But once the postseason begins, every team is prepared, so the game slows down, transition-scoring rates plummet, and the easy offensive-rebound opportunities no longer present themselves. In a macro sense, coaching actually evens out in the postseason. Russell Westbrook built his MVP candidacy by turning basketball into football: exploding through disorganized defenses and leading the league in fast-break points per game. In the playoffs, though, the Thunder will have to rely more often on a half-court offense that finished the year 25th in the NBA in points per possession. As for their first-round opponent? The Rockets were the best half-court offense in the league. The Five Plays You Need to Know About Heading Into the NBA PlayoffsFrom mutated pick-and-rolls to off-kilter handoffs, here’s how your favorite team is going to get easy bucketstheringer.com “It’s still basketball, and the players are still going to decide it,” Carlesimo said. “But there are a lot fewer elements left to chance.” With the increased prep time and the familiarity that comes with the repetitive schedule, weaknesses that might skirt by on a Tuesday night at the Barclays Center get put under a spotlight in May and June. If a wing player on a certain team can’t hit 3-pointers at an efficient rate, opponents will barely pay any attention to him. “[In the 2015 Western Conference semifinals], Steve Kerr just didn’t guard [Grizzlies shooting guard] Tony Allen, but he put [center Andrew] Bogut on him,” McHale said. “And Bogut was just a roamer. And that gave them a whole different look defensively.” If a big man can’t defend against a smaller lineup, he’ll see his playing time dwindle — as happened with Bogut in the Finals over the past two seasons. And if a big man can score but can’t anchor a defense, he might have a place on the second unit of a top team in the regular season, but in the playoffs he’ll get stapled to the bench. “If you’re [Golden State’s] JaVale McGee, you can’t play defense against a good team,” Honkasalo said. “You don’t understand all the nuances of where you’re supposed to stand. When he plays against the well-prepared, good team, that just doesn’t work at all.” Playoff defense is more creative and less forgiving. Even though the worst offenses in the league don’t make it beyond the 82nd game, efficiency and scoring rates tend to decrease in the postseason. Catch-and-shoot scorers like Kyle Korver and Klay Thompson no longer have as much space for their jump shots, and their percentages drop once the calendar hits mid-April. Yet while the threat Korver and Thompson pose still creates space for an offense, an inefficient scorer like DeRozan crumples amid the increased pressure. This year, over 90 percent of his shots have come from within the 3-point arc, so DeRozan has to make those shots at an incredibly high rate in order to still be an effective scorer. It’s the whole “three is more than two” thing. He pulls off that tight-rope act in the regular season, but it’s just harder to make shots in the playoffs, and so if DeRozan’s field goal percentage drops even just a few points, he becomes a net negative on offense. In the playoffs, he shoots a full 5 percentage points worse from the field. Eight years into his career, it’s clear that DeRozan can be the lead scorer on a great offensive team — during the regular season. Once the playoffs start, though, his game looks completely out of place. If DeRozan is the prototypical regular-season player, then Irving was made for the playoffs. “[Defenses] just know whatever play is going to come,” Carlesimo said. “You know what I mean? They’re more wired in. If there is a call, they know what’s going to happen, so it comes down to more execution and individual creativity than it does what a team is doing.” No one in the NBA is better at combining individual creativity and execution than Irving. Among players with at least 1.5 isolation possessions per game, almost no one scores at a higher rate (1.12 per possession) than the Cleveland point guard. And among players with at least 200 iso possessions this season, no one else breaks 1.05. (DeRozan, at 1.02, comes in a distant third behind Irving and Damian Lillard.) Irving’s combination of individual efficiency and raw production puts him on his own level. During the regular season last year, Cleveland’s net rating was slightly better with Irving off the court. Once the playoffs hit, though, they were better off with him in the game by 1.5 points per possession. Some of that is likely due to a more dialed-in and more prepared defense that’s able to carry some of Irving’s inadequacies on that end — and maybe his own defensive performance improves too — but it’s also because there’s no adjustment to be made against an incredible one-on-one scorer. “He’s not good at the stuff that can be taken away,” Honkasalo said. In other words, he’s good at the one thing a great defense is helpless against. By the time teams reach the Finals, if defensive game plans are fully optimized and each team has planned for every set the opponent throws at it, sometimes there is no series-deciding adjustment to make. In that case, an efficient isolation scorer serves as a fail-safe for offenses that get diminished by prepared and aggressive postseason defenses. Last year, it was enough to give the Cavs one final push over the wall. Is there a secret to solving the playoffs? For one, go get LeBron James. His teams always exceed expectation because he’s LeBron James and you’re not. But is there a new way teams should play once they hit April? Before the league’s pace of play was put through a particle accelerator, the Memphis Grizzlies were able to, despite never earning more than a 4-seed, turn every game into something like a coin flip. Those odds don’t work in the regular season, but you’ll take it against the Warriors or the Spurs. “There was real stuff that they did to make that happen,” Honkasalo said. “Limit 3-pointers — high-variance stuff — and keep the games slow. Get the variance out of it, keep it close. Play a 50–50 game and hope you win — that’s the logic.” Under new coach David Fizdale, the Grizzlies have dragged their heels toward the pace-and-space era. While that slow evolution has allowed them to push an aging core into the playoffs for a seventh straight year, it doesn’t necessarily portend postseason success. They play the Spurs in Round 1, and San Antonio is essentially just a much better version of what Memphis has become. Are LeBron’s Cavaliers Playoff Scary?Or are they just regular scary? Let’s consult the NBA playoffs fear index.theringer.com The best squads want better than coin-flip odds. Teams spend the entire season crafting their identities, smoothing out their defensive rotations, and fine-tuning their offensive philosophies. The playoffs require an incredible level of execution — one that only seems possible after a regular season’s worth of preparation. Suddenly shifting toward a playoff-optimized strategy would be its own kind of disaster. “If your identity just changes in the playoffs, you have problems,” McHale said. “It’s gotta be an extension of who you are. I promise you, Houston is not gonna come out now and shoot like one 3-pointer, and say, ‘Haha, we tricked you all year.’” It’s fun to imagine Popovich, Celtics head coach Brad Stevens, and even Cleveland’s Tyronn Lue — if you’ll believe him — as these grand masters of multidimensional chess, directing their players to take a strange number of midrange shots or play bad pick-and-roll defense so as to distract opponents from a never-before-used game plan they’re waiting to unveil until the playoffs. But the margin for error in the postseason just doesn’t lend itself to anything that hasn’t been drilled to the point of being airtight. If the regular season is figuring out how to run your stuff, the postseason is figuring out how your stuff works against whoever you’re playing. It’s just that some teams are better positioned to succeed as the playoffs begin. The basketball-adjacent world is watching and the emotional stakes do have an effect — how else to explain a certain then-Miami star’s performance in 2011? — but those changes are intangible, unpredictable, and, ultimately, the negatives and the positives likely cancel each other out. Playoff basketball is tangibly different because coaches and players have more time to prepare and rest, the easy advantages that can be mined in mid-February all but disappear in April, and defenses get optimized toward their opponent. In the face of that, some offenses still work, just in a reduced or more painstaking fashion, while others collapse under the new effort required to hide their inefficiencies. Once every possible adjustment is made, though, it gets pretty simple: If our guy can beat your guy, we’re probably going to win. ", "name": "64", "child": "64_1\t64_2\t64_3\t64_4\t64_5\t64_6\t64_7\t64_8\t64_9\t64_10\t64_11", "timestamp": "Apr 14"}