{"parent": "", "title": "Etkinlik düzenliyoruz, mobil uygulama yapmalı mıyız?", "author": "Baybars Umur", "sentences": [{"41e2": "Etkinlik düzenliyoruz, mobil uygulama yapmalı mıyız?"}, {"4c60": "Bir veya bir kaç gün sürecek bir etkinlik düzenliyorsunuz. Binlerce davetiye gönderdiniz, email attınız, Facebook’ta etkinlik sayfası açtınız hatta etkinliğe özel bir websitesi bile yaptınız."}, {"c292": "Ziyaretçilerin etkinlik anında kullanması için bir mobil uygulamanız olmalı mı? Olmalıysa nasıl olmalı?"}, {"c076": "Bence yanıtlanması gereken ilk soru: mobil site mi yoksa mobil uygulama mı? Buna karar verirken de yanıtlanması gereken sorular; App yaparak hangi sorunları çözeceğiz? Ziyaretçilerin hayatını kolaylaştırıyor muyuz? Oturumların akışını daha verimli hale getiriyor muyuz? Etkinliği genel olarak daha sosyal hale getiriyor muyuz?"}, {"c3d7": "Bir örnek üzerinden gidelim, Mayıs ayında katıldığım Adobe Summit’ten bahsetmiştim. Kayıt anında gönderilen emailde şöyle bir bölüm vardı:"}, {"349a": "Hızlıca indirip kurcalamaya başladım. Etkinlik 2 gün sürdüğü ve katılabileceğim çok sayıda oturum olduğu için öncelikle bana özel bir takvim olması hoşuma gitti."}, {"b394": "Bu tip bir takvimin en güzel yanı, hangi saatte hangi etkinliğe katılacağımı önceden organize edip, etkinlik alanında bir daha bununla uğraşmak zorunda olmadan networking’e vakit ayırmak. Bunu sunabilmek için doğal olarak etkinliğinizde aynı anda farklı salonlarda gerçekleşen oturumlar olmalı, aksi taktirde buna zaten ihtiyaç yok. Sabit bir program varsa, onu yayınlamak ziyaretçiler için yeterli olacaktır."}, {"948d": "Benzer şekilde, farklı salonların yerlerine ulaşım için bir harita sunmak epey faydalı olabiliyor."}, {"5fa6": "Bir diğer faydalı özellik, konuşmacıların kısa bilgilerini içeren sayfalar olması. Hem oturuma katılmadan önce, hem de oturum sırasında bu arkadaş kimdi? ne iş yapıyordu? diye hızlıca bir bakmak için pratik bir çözüm."}, {"9201": "Q&A oturumları varsa, veya Adobe Summit’te olduğu gibi her oturumun sonunda bir Q&A varsa, soru cevap akışını yönetmenin en iyi yolu soruları konuşma sırasında istiflemeye başlamak. Bunu uygulama içerisinden yaparsanız izleyiciler arasında dolaşan mikrofonların yarattığı uzun sıkıcı sessizlikler ve daha da önemlisi zaman kaybını önleme imkanınız var."}, {"403d": "Uygulamaya zaten bir sosyal profil ile giriş yapabildiğiniz için, ister kendi isminizle, ister anonim olarak, sormak istediğiniz soruları bulunduğunuz oturuma submit edebiliyorsunuz. Oturum sonunda da konuşmacı tüm soruları görüp teker teker yanıt vermeye başlıyor."}, {"b551": "Peki tüm bunları yapmak için sıfırdan bir uygulama yapmaya gerek var mı? Yoksa mobil site yeterli mi? Değerlendirmemiz gereken kriterleri bir daha toparlayalım:"}, {"8db3": "Özellikle etkinliğe gelmeden önce download ettirmeyi başaramadıysanız, etkinlik alanında bunu yaptırmak pek kolay olmayabiliyor. Herkes kotasından uygulama download etmeye hala sıcak bakmıyor, etkinlik alanında da yeterince iyi bir Wi-Fi sunmuyorsanız şansınızı kaybettiniz."}, {"205e": "Etkinlikte sunmayı düşündüğünüz özellikleri (teknik olarak) mobil site üstünden yapabiliyorsanız her zaman tercih etmenizi öneriyorum. Yüklemesi ve kullanımı kolay. Cross-platform düşünmeniz gerekmiyor. (iOS, Android vb.) Üretimi uygulama yapımına göre çok daha hızlı."}, {"6cce": "Öte yandan mobil uygulama üretmeye karar verdiniz, o zaman Amerika’yı yeniden keşfetmeden önce buralara bakmanızda fayda var:"}, {"4a0e": "https://whova.com"}, {"e2e6": "https://www.sli.do/home"}, {"25f8": "https://www.eventbase.com"}, {"40f9": "http://www.eventmobi.com"}, {"d92e": "http://www.quickmobile.com"}, {"a45a": "vee tabii ki bir Quora cevabı ekleyeceğim:) https://www.quora.com/What-are-the-best-mobile-apps-aimed-at-conferences-and-events"}, {"ef31": "Umarım faydalı olur!"}, {"b66e": "Baybars"}, {"9b2a": "Originally published at kosanadam.wordpress.com on September 17, 2016."}], "content": "Etkinlik düzenliyoruz, mobil uygulama yapmalı mıyız? Bir veya bir kaç gün sürecek bir etkinlik düzenliyorsunuz. Binlerce davetiye gönderdiniz, email attınız, Facebook’ta etkinlik sayfası açtınız hatta etkinliğe özel bir websitesi bile yaptınız. Ziyaretçilerin etkinlik anında kullanması için bir mobil uygulamanız olmalı mı? Olmalıysa nasıl olmalı? Bence yanıtlanması gereken ilk soru: mobil site mi yoksa mobil uygulama mı? Buna karar verirken de yanıtlanması gereken sorular; App yaparak hangi sorunları çözeceğiz? Ziyaretçilerin hayatını kolaylaştırıyor muyuz? Oturumların akışını daha verimli hale getiriyor muyuz? Etkinliği genel olarak daha sosyal hale getiriyor muyuz? Bir örnek üzerinden gidelim, Mayıs ayında katıldığım Adobe Summit’ten bahsetmiştim. Kayıt anında gönderilen emailde şöyle bir bölüm vardı: Hızlıca indirip kurcalamaya başladım. Etkinlik 2 gün sürdüğü ve katılabileceğim çok sayıda oturum olduğu için öncelikle bana özel bir takvim olması hoşuma gitti. Bu tip bir takvimin en güzel yanı, hangi saatte hangi etkinliğe katılacağımı önceden organize edip, etkinlik alanında bir daha bununla uğraşmak zorunda olmadan networking’e vakit ayırmak. Bunu sunabilmek için doğal olarak etkinliğinizde aynı anda farklı salonlarda gerçekleşen oturumlar olmalı, aksi taktirde buna zaten ihtiyaç yok. Sabit bir program varsa, onu yayınlamak ziyaretçiler için yeterli olacaktır. Benzer şekilde, farklı salonların yerlerine ulaşım için bir harita sunmak epey faydalı olabiliyor. Bir diğer faydalı özellik, konuşmacıların kısa bilgilerini içeren sayfalar olması. Hem oturuma katılmadan önce, hem de oturum sırasında bu arkadaş kimdi? ne iş yapıyordu? diye hızlıca bir bakmak için pratik bir çözüm. Q&A oturumları varsa, veya Adobe Summit’te olduğu gibi her oturumun sonunda bir Q&A varsa, soru cevap akışını yönetmenin en iyi yolu soruları konuşma sırasında istiflemeye başlamak. Bunu uygulama içerisinden yaparsanız izleyiciler arasında dolaşan mikrofonların yarattığı uzun sıkıcı sessizlikler ve daha da önemlisi zaman kaybını önleme imkanınız var. Uygulamaya zaten bir sosyal profil ile giriş yapabildiğiniz için, ister kendi isminizle, ister anonim olarak, sormak istediğiniz soruları bulunduğunuz oturuma submit edebiliyorsunuz. Oturum sonunda da konuşmacı tüm soruları görüp teker teker yanıt vermeye başlıyor. Peki tüm bunları yapmak için sıfırdan bir uygulama yapmaya gerek var mı? Yoksa mobil site yeterli mi? Değerlendirmemiz gereken kriterleri bir daha toparlayalım: Özellikle etkinliğe gelmeden önce download ettirmeyi başaramadıysanız, etkinlik alanında bunu yaptırmak pek kolay olmayabiliyor. Herkes kotasından uygulama download etmeye hala sıcak bakmıyor, etkinlik alanında da yeterince iyi bir Wi-Fi sunmuyorsanız şansınızı kaybettiniz. Etkinlikte sunmayı düşündüğünüz özellikleri (teknik olarak) mobil site üstünden yapabiliyorsanız her zaman tercih etmenizi öneriyorum. Yüklemesi ve kullanımı kolay. Cross-platform düşünmeniz gerekmiyor. (iOS, Android vb.) Üretimi uygulama yapımına göre çok daha hızlı. Öte yandan mobil uygulama üretmeye karar verdiniz, o zaman Amerika’yı yeniden keşfetmeden önce buralara bakmanızda fayda var: https://whova.com https://www.sli.do/home https://www.eventbase.com http://www.eventmobi.com http://www.quickmobile.com vee tabii ki bir Quora cevabı ekleyeceğim:) https://www.quora.com/What-are-the-best-mobile-apps-aimed-at-conferences-and-events Umarım faydalı olur! Baybars Originally published at kosanadam.wordpress.com on September 17, 2016. ", "name": "654", "child": "654_1\t654_2654_1\t654_2", "timestamp": "Sep 17, 2016"}