{"parent": "", "title": "How we growth-hacked from 0 to 2 Million users without raising any money.", "author": "Ravi Mittal", "sentences": [{"c2a6": "How we growth-hacked from 0 to 2 Million users without raising any money."}, {"78ec": "I often come across friends and acquaintances who’re often thrilled to know we have 2 million plus users on our dating app — QuackQuack, surprisingly enough, because we haven’t raised a single rupee in venture funding. I decided to write this post to share some nifty growth hacks we used to scale to 2 million plus users and growing. To those who wish to see our growth visually, here’s a graph showing the same —"}, {"93d9": "1. A/B testing"}, {"b55d": "As simple as it may sound, but the true way to test and understand user psychology is to test different versions of design / flow / user experience. We started A/B testing early in our product development. We’ve tested with almost everything we could! Here are some examples:i. We used two different colors for our landing page ‘Submit’ button — green and orange. The results after a month — the orange button gave us 7% more conversions than the green one.ii. We used two different taglines on our landing page — “Signup now! It’s free” and “Signup now! Meet Singles”. The result after two months — the latter gave us 10% more conversions."}, {"1ca4": "Result — these small hacks helped us drop our CAC by 33%. Lower CAC gave us more bandwidth to acquire more users with the limited amount of money."}, {"0524": "2. ROI vs Brand building"}, {"d7b1": "We’ve always advertised online since our budgets were limited. We mark our money separately for campaigns which can give us ROI and brand building. If a particular campaign designated for ROI doesn’t perform, we immediately stop those campaigns. If a brand building campaign doesn’t convert to organic growth in the long run (3 months or so), we move ahead and work on other strategies. Doing so, it has helped streamline our spending and utilising money at the right places to fuel user growth."}, {"c4b4": "3. Employ top performers"}, {"a25c": "When you’re starting up, you’ll be tempted to employ/hire candidates without much experience (aka lower CTCs). However, they can slow down the product development cycle and thus cost more over the long run. Not to forget the outcome of your product which may be substantially low on your expectations. Remember, Time=Money.Go for candidates with prior experience / awesome portfolio. They might come in a bit expensive, however, they will help you leverage time, product quality and eventually build a better product. And when your product speaks for itself, there is no looking back.PS: I am not against hiring freshers or inexperienced candidates. You may find better candidates who can do a better job than the experienced ones, just make sure you test them out and don’t get into sunk cost fallacy."}, {"d4ac": "4. Focus on App Store / Search Engine Optimization"}, {"0545": "ASOA lot of ‘free’ traffic can be obtained if you spend sometime to optimize your app screens on Android Play Store and iOS App Store. Here’s a list of stuff you can do to improve likeability of people installing your apps:i. Play around with your app icon. See which version attracts more people to install your app. Gaming apps often try this strategy.ii. Change and test the name of your app. Did you know Paytm’s app name is actually “Payments, Wallet & Recharge” and the actual name “Paytm’ is part of their publisher name. The keywords in your app name can go a long way in ranking for keywords related to your product.iii. Play around with app banners and screenshots. If they can explain easily what your app does and build trust, it makes your user’s decision easy to install your app."}, {"6d7d": "SEOWhile ASO is for apps and can be done easily, SEO is a different ball game all-together. You might need a good team who can leverage SEO for your product if you have presence on browsers. While SEO is a time and money consuming process, it takes time to get your keywords ranking on Google. We invested a good one year on SEO and are now reaping the benefits as 50% of our traffic comes from SEO."}, {"14ff": "5. App size, battery and memory usage"}, {"b244": "Admit it, we all need space! We need space in our phones to install apps and with space being a major constraint, ensure your app’s size doesn’t come in the way between you and your user. Our app is a mere 9 MB. Make sure your app also doesn’t take much space even when un-bundled after installation. Use your apps for a few days and check if your app is draining the battery and hogging memory on your phone. I found the harsh reality one day when I myself wanted to uninstall our app for draining my phone’s battery! We quickly had a team discussion and our development team promptly fixed the issues with an update. This helped improve no. of sessions on our app and hence more returning users. Also, all these improvements further help in improving your app store rankings."}, {"6912": "6. Make customers life easy"}, {"6386": "How often do you get an email from a ‘x’ product and when you open the link, it prompts you to sign-in again? At QuackQuack, we firmly believe in making customers lives easy. Any of the emails users receive open directly into their page of context. It helps reducing user drop outs and better retention."}, {"4fd3": "Wherever possible, we try to make nifty changes so users don’t have to spend extra time typing or clicking at something which could have been avoided with better UI. For example, on our signup screen, the city field is already filled up with your city’s name based on your IP address. This information is accurate 60% of the times which at least helps 60 out of 100 users who don’t have to click an extra button. Same goes for many other things in our UI."}, {"971b": "7. Use social media for reach, not for likes"}, {"e061": "Many a startups spend time on improving their Facebook / Twitter pages to get more likes and followers. However, the aim should be completely opposite. Focus on getting more engagement and get more visibility for your product via your posts. We have always focused on campaigns on social media which can make our posts go viral and hence reach more people. More engagement=more recall value for brand. The below screenshots from our Facebook page show the kind of reach we got for some of our campaigns which are not focused on getting page likes."}, {"4b62": "8. Build a better product, not advertisement"}, {"b1d6": "Our focus and mantra has always been in building a better product rather than a catchy advt. We keep making improvements to our app based on user experiences. That in turn helps improve our top-line, bottom-line and word of mouth publicity which makes us among the top 3 grossing dating startups in India without spending much on ads."}, {"8272": "9. Focus on existing customers"}, {"a4d6": "While getting new customers requires high acquisition costs, we have realized that focusing on existing customers too can improve our retention and top-line. While many companies offer discounts to ‘new users only’, we give discounts to users who renew their subscriptions with us, helping them get more value for money by retaining with us. This puts us in an autopilot mode where the top-line is again re-invested in acquiring new users."}], "content": "How we growth-hacked from 0 to 2 Million users without raising any money. I often come across friends and acquaintances who’re often thrilled to know we have 2 million plus users on our dating app — QuackQuack, surprisingly enough, because we haven’t raised a single rupee in venture funding. I decided to write this post to share some nifty growth hacks we used to scale to 2 million plus users and growing. To those who wish to see our growth visually, here’s a graph showing the same — 1. A/B testing As simple as it may sound, but the true way to test and understand user psychology is to test different versions of design / flow / user experience. We started A/B testing early in our product development. We’ve tested with almost everything we could! Here are some examples:i. We used two different colors for our landing page ‘Submit’ button — green and orange. The results after a month — the orange button gave us 7% more conversions than the green one.ii. We used two different taglines on our landing page — “Signup now! It’s free” and “Signup now! Meet Singles”. The result after two months — the latter gave us 10% more conversions. Result — these small hacks helped us drop our CAC by 33%. Lower CAC gave us more bandwidth to acquire more users with the limited amount of money. 2. ROI vs Brand building We’ve always advertised online since our budgets were limited. We mark our money separately for campaigns which can give us ROI and brand building. If a particular campaign designated for ROI doesn’t perform, we immediately stop those campaigns. If a brand building campaign doesn’t convert to organic growth in the long run (3 months or so), we move ahead and work on other strategies. Doing so, it has helped streamline our spending and utilising money at the right places to fuel user growth. 3. Employ top performers When you’re starting up, you’ll be tempted to employ/hire candidates without much experience (aka lower CTCs). However, they can slow down the product development cycle and thus cost more over the long run. Not to forget the outcome of your product which may be substantially low on your expectations. Remember, Time=Money.Go for candidates with prior experience / awesome portfolio. They might come in a bit expensive, however, they will help you leverage time, product quality and eventually build a better product. And when your product speaks for itself, there is no looking back.PS: I am not against hiring freshers or inexperienced candidates. You may find better candidates who can do a better job than the experienced ones, just make sure you test them out and don’t get into sunk cost fallacy. 4. Focus on App Store / Search Engine Optimization ASOA lot of ‘free’ traffic can be obtained if you spend sometime to optimize your app screens on Android Play Store and iOS App Store. Here’s a list of stuff you can do to improve likeability of people installing your apps:i. Play around with your app icon. See which version attracts more people to install your app. Gaming apps often try this strategy.ii. Change and test the name of your app. Did you know Paytm’s app name is actually “Payments, Wallet & Recharge” and the actual name “Paytm’ is part of their publisher name. The keywords in your app name can go a long way in ranking for keywords related to your product.iii. Play around with app banners and screenshots. If they can explain easily what your app does and build trust, it makes your user’s decision easy to install your app. SEOWhile ASO is for apps and can be done easily, SEO is a different ball game all-together. You might need a good team who can leverage SEO for your product if you have presence on browsers. While SEO is a time and money consuming process, it takes time to get your keywords ranking on Google. We invested a good one year on SEO and are now reaping the benefits as 50% of our traffic comes from SEO. 5. App size, battery and memory usage Admit it, we all need space! We need space in our phones to install apps and with space being a major constraint, ensure your app’s size doesn’t come in the way between you and your user. Our app is a mere 9 MB. Make sure your app also doesn’t take much space even when un-bundled after installation. Use your apps for a few days and check if your app is draining the battery and hogging memory on your phone. I found the harsh reality one day when I myself wanted to uninstall our app for draining my phone’s battery! We quickly had a team discussion and our development team promptly fixed the issues with an update. This helped improve no. of sessions on our app and hence more returning users. Also, all these improvements further help in improving your app store rankings. 6. Make customers life easy How often do you get an email from a ‘x’ product and when you open the link, it prompts you to sign-in again? At QuackQuack, we firmly believe in making customers lives easy. Any of the emails users receive open directly into their page of context. It helps reducing user drop outs and better retention. Wherever possible, we try to make nifty changes so users don’t have to spend extra time typing or clicking at something which could have been avoided with better UI. For example, on our signup screen, the city field is already filled up with your city’s name based on your IP address. This information is accurate 60% of the times which at least helps 60 out of 100 users who don’t have to click an extra button. Same goes for many other things in our UI. 7. Use social media for reach, not for likes Many a startups spend time on improving their Facebook / Twitter pages to get more likes and followers. However, the aim should be completely opposite. Focus on getting more engagement and get more visibility for your product via your posts. We have always focused on campaigns on social media which can make our posts go viral and hence reach more people. More engagement=more recall value for brand. The below screenshots from our Facebook page show the kind of reach we got for some of our campaigns which are not focused on getting page likes. 8. Build a better product, not advertisement Our focus and mantra has always been in building a better product rather than a catchy advt. We keep making improvements to our app based on user experiences. That in turn helps improve our top-line, bottom-line and word of mouth publicity which makes us among the top 3 grossing dating startups in India without spending much on ads. 9. Focus on existing customers While getting new customers requires high acquisition costs, we have realized that focusing on existing customers too can improve our retention and top-line. While many companies offer discounts to ‘new users only’, we give discounts to users who renew their subscriptions with us, helping them get more value for money by retaining with us. This puts us in an autopilot mode where the top-line is again re-invested in acquiring new users. ", "name": "673", "child": "673_1\t673_2\t673_3\t673_4\t673_5\t673_6", "timestamp": "Mar 20"}