{"parent": "", "title": "Shockingly, Everyone Was Active for Cavaliers-Spurs , but the Cavs Still Chose Not to Show Up", "author": "Chris Almeida", "sentences": [{"dd61": "Shockingly, Everyone Was Active for Cavaliers-Spurs , but the Cavs Still Chose Not to Show Up"}, {"2b24": "Tyronn Lue wants us to believe this is all part of his plan, but his team’s performance against the Spurs wasn’t convincing"}, {"7f90": "There are benefits to conserving energy and monitoring effort. Optimal performance, in anything physical or mental, is not something that can be sustained throughout the year. There’s good reason that racing world records are most often set at the biggest meets; sprinters and swimmers prepare their bodies to be at their best when the stakes are highest. Seeing Serena Williams skip tournaments to rest before majors or seeing top NFL teams sit their starters after clinching home-field advantage is a yearly ritual; if Usain Bolt loses at a Diamond League meet in May, that’s a negligible price to pay to give him a better chance to crush the field at the Olympics in August."}, {"2258": "Top NBA teams choosing to rest their players has become the logical extension of this principle. Parity in the NBA often gives the best teams enough security to rest their best players during the middle of the regular season, and often, it’s hard to blame them. The 82-game season is a slog, and beating up on the Nets or fighting for a single game in a race for seeding often isn’t worth risking injury or burnout."}, {"87ab": "The Cleveland Cavaliers didn’t rest any of their players on Monday night, but they may as well have, as they were blown out 103–74 by the San Antonio Spurs."}, {"0b02": "As far as the night’s competition was concerned, it was a clean thrashing for Kawhi Leonard and Co., who pulled out to a 20-point lead during the second quarter and led by more than 30 for much of the second half. Leonard, despite missing all seven of his attempts from deep, shot over 50 percent from the field and scored 25 points to go along with six rebounds and six assists. The game marked Leonard’s 100th consecutive game scoring in double figures, which is good for third all-time in Spurs history. The sweet game for San Antonio came with an extra sour note for Cleveland when LeBron James left the game in the third quarter after being elbowed in the upper back by David Lee."}, {"d391": "The game, for the Spurs, was so comfortable even in the first half, that they threw an alley-oop in transition with 21 seconds left on the shot clock to a player who will turn 40 later this year."}, {"7d5e": "This didn’t look like a potential preview of the Finals because since the All-Star break, the Cavs haven’t looked like anything resembling a Finals team. Since the break, Cleveland has gone 8–10 and received drubbings at the hands of Chicago, Miami, and Denver, teams on the edge of the playoff picture. The Cavs have posted the second-worst defensive rating (113.2) in the league over that span, just edging the Lakers, who sit at 113.8."}, {"4b3d": "Tyronn Lue has recently hinted that this performance may be intentional — that giving up nearly 115 points per game over the past six contests is some way of saving a secret weapon for the playoffs."}, {"5611": "“We’ve got to hold back. We can’t show our hand early because … these are some good teams and we don’t want them to be able to come into a series and be able to adjust to what we do,” Lue said after his team’s 127–115 loss to Washington on Saturday. “We just have to be able to play our normal defense until we get there and then we will see what happens.”"}, {"624c": "Lue, allegedly, has a solution for the Cavs’ issues on the boards, as well."}, {"4c52": "“I think the rebounding hurt us. Rebounding. But it will be different once some other things happen. … We have something to fix that. Just not right now.”"}, {"c55e": "But if Lue really has a magical fix for the Cavaliers’ woes, it seems strange that he is still hesitant to use it. The loss to the Spurs dropped them from the top spot in the Eastern Conference for the first time in months; at 47–26, they now trail the Celtics by half a game. Even if Lue is confident in his strategic changes or if he believes that LeBron will successfully complete his annual transformation into Parallax and scare opponents out of contention, saving anything for the playoffs seems like a risky gamble. Home-court advantage will come in handy against the surging Celtics and Wizards, both of whom won their most recent matchups with Cleveland."}, {"52c4": "With concerns about minutes mounting around the league recently and James’s time on court piling higher than any other player his age, it’s entirely possible that the Cavs’ issues on defense are effort-based; it certainly looked so as Cleveland jogged back on defense while San Antonio streaked down the court for much of the first half. But if Lue’s secret stuff is to simply have his players … try, he may want to tell them soon. It’s nearly impossible to imagine that the Cavs will slide any further — James’s teams haven’t finished with a seed lower than second since 2008 — but here we are, with Cleveland only 2.5 games away from the fourth seed."}, {"880e": "Minutes, especially high-effort minutes, are costly. Regular-season games can often have minimal meaning and athletics are always, in some capacity, about peaking at the right time. But if Lue and the Cavs keep projecting their best basketball a few weeks down the road, they might give themselves too steep a mountain for even James to ascend."}], "content": "Shockingly, Everyone Was Active for Cavaliers-Spurs , but the Cavs Still Chose Not to Show Up Tyronn Lue wants us to believe this is all part of his plan, but his team’s performance against the Spurs wasn’t convincing There are benefits to conserving energy and monitoring effort. Optimal performance, in anything physical or mental, is not something that can be sustained throughout the year. There’s good reason that racing world records are most often set at the biggest meets; sprinters and swimmers prepare their bodies to be at their best when the stakes are highest. Seeing Serena Williams skip tournaments to rest before majors or seeing top NFL teams sit their starters after clinching home-field advantage is a yearly ritual; if Usain Bolt loses at a Diamond League meet in May, that’s a negligible price to pay to give him a better chance to crush the field at the Olympics in August. Top NBA teams choosing to rest their players has become the logical extension of this principle. Parity in the NBA often gives the best teams enough security to rest their best players during the middle of the regular season, and often, it’s hard to blame them. The 82-game season is a slog, and beating up on the Nets or fighting for a single game in a race for seeding often isn’t worth risking injury or burnout. The Cleveland Cavaliers didn’t rest any of their players on Monday night, but they may as well have, as they were blown out 103–74 by the San Antonio Spurs. As far as the night’s competition was concerned, it was a clean thrashing for Kawhi Leonard and Co., who pulled out to a 20-point lead during the second quarter and led by more than 30 for much of the second half. Leonard, despite missing all seven of his attempts from deep, shot over 50 percent from the field and scored 25 points to go along with six rebounds and six assists. The game marked Leonard’s 100th consecutive game scoring in double figures, which is good for third all-time in Spurs history. The sweet game for San Antonio came with an extra sour note for Cleveland when LeBron James left the game in the third quarter after being elbowed in the upper back by David Lee. The game, for the Spurs, was so comfortable even in the first half, that they threw an alley-oop in transition with 21 seconds left on the shot clock to a player who will turn 40 later this year. This didn’t look like a potential preview of the Finals because since the All-Star break, the Cavs haven’t looked like anything resembling a Finals team. Since the break, Cleveland has gone 8–10 and received drubbings at the hands of Chicago, Miami, and Denver, teams on the edge of the playoff picture. The Cavs have posted the second-worst defensive rating (113.2) in the league over that span, just edging the Lakers, who sit at 113.8. Tyronn Lue has recently hinted that this performance may be intentional — that giving up nearly 115 points per game over the past six contests is some way of saving a secret weapon for the playoffs. “We’ve got to hold back. We can’t show our hand early because … these are some good teams and we don’t want them to be able to come into a series and be able to adjust to what we do,” Lue said after his team’s 127–115 loss to Washington on Saturday. “We just have to be able to play our normal defense until we get there and then we will see what happens.” Lue, allegedly, has a solution for the Cavs’ issues on the boards, as well. “I think the rebounding hurt us. Rebounding. But it will be different once some other things happen. … We have something to fix that. Just not right now.” But if Lue really has a magical fix for the Cavaliers’ woes, it seems strange that he is still hesitant to use it. The loss to the Spurs dropped them from the top spot in the Eastern Conference for the first time in months; at 47–26, they now trail the Celtics by half a game. Even if Lue is confident in his strategic changes or if he believes that LeBron will successfully complete his annual transformation into Parallax and scare opponents out of contention, saving anything for the playoffs seems like a risky gamble. Home-court advantage will come in handy against the surging Celtics and Wizards, both of whom won their most recent matchups with Cleveland. With concerns about minutes mounting around the league recently and James’s time on court piling higher than any other player his age, it’s entirely possible that the Cavs’ issues on defense are effort-based; it certainly looked so as Cleveland jogged back on defense while San Antonio streaked down the court for much of the first half. But if Lue’s secret stuff is to simply have his players … try, he may want to tell them soon. It’s nearly impossible to imagine that the Cavs will slide any further — James’s teams haven’t finished with a seed lower than second since 2008 — but here we are, with Cleveland only 2.5 games away from the fourth seed. Minutes, especially high-effort minutes, are costly. Regular-season games can often have minimal meaning and athletics are always, in some capacity, about peaking at the right time. But if Lue and the Cavs keep projecting their best basketball a few weeks down the road, they might give themselves too steep a mountain for even James to ascend. ", "name": "68", "child": "68_1\t68_2\t68_3\t68_4\t68_5\t68_6\t68_7\t68_8\t68_9\t68_10\t68_11\t68_12\t68_13\t68_14", "timestamp": "Mar 27"}