{"parent": "", "title": "Communication In Its Simplest Form", "author": "Peter Schroeder 🚀", "sentences": [{"58fb": "Communication In Its Simplest Form"}, {"00d8": "Communication is supposed to be as simple as a sender communicating a message to a receiver, with the receiver sending feedback to the originator."}, {"4f58": "Simple enough, right?"}, {"882e": "Communication in its simplest form."}, {"3c01": "If it is so simple, then why is it so hard for companies to communicate to their audience?"}, {"a9b6": "There seems to be an unspoken epidemic among startups of being unable to communicate with their audiences. I have seen the disconnect first hand, and the problems a lack of proper communication leads to."}, {"b9ea": "If communication is so simple, why is it hard for companies to communicate to their audience?"}, {"dd4d": "When a company is communicating to their audience, it is not as simple as a sender communicating a message to a receiver, with the receiver sending feedback to the originator. (That would be a dream come true.)"}, {"ee3f": "The ‘No Feedback Loop’."}, {"d0f9": "In fact, it is only half of the process. It looks more like this: a sender communicating a message to a receiver, followed by radio silence."}, {"ca64": "You may notice the communication is only going one way. I like to call this a ‘No Feedback Loop’. When this happens (it will happen), how can you be sure you are communicating the right message to your audience?"}, {"e256": "Make it so the ‘No Feedback Loop’ is never an option."}, {"9f70": "Plain and simple, you cannot get caught in the ‘No Feedback Loop’ trap."}, {"4db9": "You need to constantly be testing your messages and getting feedback on them. You can do this a few ways."}, {"3063": "In the end, it is up to you to never stop testing to ensure you are saying the right thing to your audience. You want to have a relationship with your audience and just like with communication, relationships are also a two way street."}, {"df65": "For your startup, communication will never be ‘simple’ and that’s okay."}, {"a465": "As a startup, you will (or at least should) have a diverse range of customers. All of these customers communicate differently, so there will never be a ‘one size fits all’ message for you to send them."}, {"ad1b": "People communicate diversely."}, {"bc16": "Take the message here for example. You may not know what the hell these people are talking about, but this is the way they communicate."}, {"f91a": "Now looking at this, would your email blast on why grammar is important resonate with them? Probably not. Never the less, this is the way they communicate and it’s your job to solve for it."}, {"472c": "When you embrace diversity, you find it easier to be able to communicate to your audience. Understand they will be people from all walks of life. The beauty of this reality may still be a challenge for you, but accept it."}, {"cbdc": "It is my goal to make communication easier, through my messaging app. UNUM messenger helps you to unify all other messaging apps you use to simplify messaging. Learn more at http://www.unummessenger.com/ (We are in development, so sign up to be notified when we launch!)"}], "content": "Communication In Its Simplest Form Communication is supposed to be as simple as a sender communicating a message to a receiver, with the receiver sending feedback to the originator. Simple enough, right? Communication in its simplest form. If it is so simple, then why is it so hard for companies to communicate to their audience? There seems to be an unspoken epidemic among startups of being unable to communicate with their audiences. I have seen the disconnect first hand, and the problems a lack of proper communication leads to. If communication is so simple, why is it hard for companies to communicate to their audience? When a company is communicating to their audience, it is not as simple as a sender communicating a message to a receiver, with the receiver sending feedback to the originator. (That would be a dream come true.) The ‘No Feedback Loop’. In fact, it is only half of the process. It looks more like this: a sender communicating a message to a receiver, followed by radio silence. You may notice the communication is only going one way. I like to call this a ‘No Feedback Loop’. When this happens (it will happen), how can you be sure you are communicating the right message to your audience? Make it so the ‘No Feedback Loop’ is never an option. Plain and simple, you cannot get caught in the ‘No Feedback Loop’ trap. You need to constantly be testing your messages and getting feedback on them. You can do this a few ways. In the end, it is up to you to never stop testing to ensure you are saying the right thing to your audience. You want to have a relationship with your audience and just like with communication, relationships are also a two way street. For your startup, communication will never be ‘simple’ and that’s okay. As a startup, you will (or at least should) have a diverse range of customers. All of these customers communicate differently, so there will never be a ‘one size fits all’ message for you to send them. People communicate diversely. Take the message here for example. You may not know what the hell these people are talking about, but this is the way they communicate. Now looking at this, would your email blast on why grammar is important resonate with them? Probably not. Never the less, this is the way they communicate and it’s your job to solve for it. When you embrace diversity, you find it easier to be able to communicate to your audience. Understand they will be people from all walks of life. The beauty of this reality may still be a challenge for you, but accept it. It is my goal to make communication easier, through my messaging app. UNUM messenger helps you to unify all other messaging apps you use to simplify messaging. Learn more at http://www.unummessenger.com/ (We are in development, so sign up to be notified when we launch!) ", "name": "685", "child": "685_1\t685_2\t685_3\t685_4\t685_5685_1\t685_2\t685_3\t685_4\t685_5", "timestamp": "Jan 2"}