{"parent": "", "title": "Worth Every Single Grek!", "author": "Indira Reddy", "sentences": [{"593c": "Worth Every Single Grek!"}, {"e3ba": "Flickr"}, {"c29b": "The spaceship transitions from hyperspace and comes to a rest near Saturn. Images of the planet are broadcast on all the walls of the spaceship. One of the tourists, Kadvosk, approaches a server-bot and says, “Bot, that’s some beautiful rings that planet’s got. Is that on our stop?” He points at an area on the wall and says, “I think the pink in that particular area of the ring would really bring out the green in my skin. How that Greval will be jealous! Ha!”"}, {"6c54": "“Sir, I’m afraid that the specified area is not on our basic tour package. However, we do have a mini-ship which will take tourists to the edge of the rings. This will cost extra. Two hundred greks. Would you like me to book you a place?”“Nah! I’ll stick to the scheduled stops. Else the brood’ll kill me. They think they own me… Pesky little pups.”“Thank you. May I go now?”“Go, go,” he mutters, “Even a bot thinks I’m trouble. I should have splurged on that Eternity drug on Betelguese.”"}, {"556c": "Kadvosk goes back to the main dining area. He thinks, “The only good thing about this cruise is that the drinks are free. I need a FireEater so bad. Maybe a side of Hoogle worms.” At the bar, his friend and fellow drinker, Lorsquatch is seated. She’s drinking a ThunderPlunder. He joins her and orders a FireEater."}, {"b765": "“Going on the mini-ship?” asks Lorsquatch.Kadvosk replies, “Nah! Brood’ll kill me.”Lorsquatch nods and says, “Mine too. Another?”Kadvosk nods and they both order another drink, then another, and another…. Suddenly Kadvosk falls off his seat, snoring.“Why drink when you cannot hold your water?” asks Lorsquatch before summoning a bot."}, {"e84f": "The next morning, Kadvosk wakes up with a bodyache. “Damn FireEaters! I really should drink less of those,” he thinks. He goes to the dining area. Lorsquatch is already seated at the bar, drink in hand. Kadvosk joins her.“Glad you could make it. Wake up! Show some spizzle. We’re going to Earth today. The only damn reason I ever came on this trip. I can’t wait to go dive into water. They have oceans of it. If only I could live there,” she says.“No more water. Jool knows how you can keep drinking!” he replies.“You know I don’t hold with that Joolian stuff. It keeps the brood happy, but I can’t be bothered. Now, just shut up and wait. We’ll be stopping soon. And then, sweet, sweet water!”"}, {"8aa7": "Just then, an announcement pings on their personal gadgets. It says, “Our first stop on Earth is nearing. Called Antartica in the local language, it consists mainly of frozen water. The local atmosphere is predominantly nitrogen and is breathable. No harmful pollutants found. We recommend taking shallow breaths. The ship will stop here for 60 kricks. Please approach teleport zone for beaming to the surface. Thank you.”“Come on, you! I don’t want to waste a single hemikrick!” says Lorsquatch, dragging Kadvosk with her."}, {"1c83": "They land on Antartica. “Yes, yes, yes! All my dreams have come true! Water, water, everywhere!” screams Lorsquatch.“Shh! Everyone’s looking. Calm down, will ya?” says Kadvosk.“To Hole with everyone! Now, let me mine this stuff,” replies Lorsquatch."}, {"bc52": "For the next 60 kricks, Lorsquatch melts a bit of water with her hand-held laser, scoops it out and drinks. Kadvosk looks on for some time, undecided, then he joins Lorsquatch — body ache be damned!"}, {"f71d": "All too soon, the ship sends another message saying, “You will now be teleported to a place near the equator of the planet. It is wonderfully hot and humid. The natives are celebrating a festival today, called Diwali. They ignite primitive mixtures of carbon, chlorine and potassium, known as fireworks, as offerings to their native Jool. It results in a spectacular display of colours on the land and in the sky. This festival is celebrated over a large area and we will be beaming groups of 25 Grughians to each location. Please activate your camouflage packs and please stay in touch with your group at all times. The fumes from igniting fireworks may cause irritation but are non-toxic. It is recommended that you activate your air shields as a precaution. The ship will stop here for 150 kricks.”"}, {"c9e0": "Lorsquatch and Kadvosk are beamed to a street corner. It’s evening. There are a lot of natives outside. An acrid smell is in the air. Suddenly, they hear a loud bang. Startled, they look around. A bunch of native younglings are shrieking. One of them places something on the ground, lights it and runs away. BANG!"}, {"0e29": "Both Lorsquatch and Kadvosk jump. The younglings turn to look at them and shout something. The bang has deafened them and they can’t hear anything. They shake their heads. The younglings start laughing - at least that’s how the translator interprets it."}, {"da0e": "Lorsquatch says, \"I’m not standing here waiting for that sound again. Let’s go find some water.\""}, {"39fc": "Lorsquatch turns and walks a few steps. A native in front of her gestures her back. Suddenly, a burst of flame and sparks spurts from the ground. Startled, Lorsquatch moves back. The native, a male, comes forward, saying, \"Are you okay? Didn’t you see the flowerpot?\"\"What flowerpot?\""}, {"719b": "Another native, a female this time, comes and says, \"Poor thing must be new here. Look how scared she is. Here, have some water. Relax. You are fine.\"She hands Lorsquatch a small container of fluid. Lorsquatch sips. It’s pure water. She gulps down the whole thing. The native woman smiles and says, \"Feeling better now? You look better.\"\"Thank you. Yes. I’m better,\" says Lorsquatch."}, {"a48b": "Kadvosk reaches them and asks Lorsquatch, \"What happened? Where did you go?\"\"Your friend came too close to a flowerpot and got scared. I gave her some water. She’s fine now,\" says the native woman, smiling.\"Yes. I’m feeling good. Let’s go,\" says Lorsquatch. Turning to the natives, she says, \"Thank you. I’ll be careful and look out for flowerpots.\""}, {"cf8f": "They smile, nod and walk away. Lorsquatch grabs Kadvosk and says, \"Did you see? I went near that burning thing.... What was it?... Yah... Flowerpot... And these natives gave me water. Pure water. And they didn’t ask me for a single grek. This is too easy. Let’s go. You can do one and I’ll do the next.\"\"That just might work. Let’s do it,\" concurs Kadvosk, grinning."}, {"af00": "So, they walk through the streets, stopping at every other flowerpot, getting a drink of water. In some places, the natives gave them some very sweet stuff but they followed it up with water, so it was all good. By the time it came for them to leave, both were just about to collapse but were too happy to do anything about it. As the ship beamed them back, Lorsquatch said, \"I was right! This was worth every grek I paid!\""}, {"f763": "They spent the rest of their trip blissfully unaware, recovering from acute water poisoning."}], "content": "Worth Every Single Grek! Flickr The spaceship transitions from hyperspace and comes to a rest near Saturn. Images of the planet are broadcast on all the walls of the spaceship. One of the tourists, Kadvosk, approaches a server-bot and says, “Bot, that’s some beautiful rings that planet’s got. Is that on our stop?” He points at an area on the wall and says, “I think the pink in that particular area of the ring would really bring out the green in my skin. How that Greval will be jealous! Ha!” “Sir, I’m afraid that the specified area is not on our basic tour package. However, we do have a mini-ship which will take tourists to the edge of the rings. This will cost extra. Two hundred greks. Would you like me to book you a place?”“Nah! I’ll stick to the scheduled stops. Else the brood’ll kill me. They think they own me… Pesky little pups.”“Thank you. May I go now?”“Go, go,” he mutters, “Even a bot thinks I’m trouble. I should have splurged on that Eternity drug on Betelguese.” Kadvosk goes back to the main dining area. He thinks, “The only good thing about this cruise is that the drinks are free. I need a FireEater so bad. Maybe a side of Hoogle worms.” At the bar, his friend and fellow drinker, Lorsquatch is seated. She’s drinking a ThunderPlunder. He joins her and orders a FireEater. “Going on the mini-ship?” asks Lorsquatch.Kadvosk replies, “Nah! Brood’ll kill me.”Lorsquatch nods and says, “Mine too. Another?”Kadvosk nods and they both order another drink, then another, and another…. Suddenly Kadvosk falls off his seat, snoring.“Why drink when you cannot hold your water?” asks Lorsquatch before summoning a bot. The next morning, Kadvosk wakes up with a bodyache. “Damn FireEaters! I really should drink less of those,” he thinks. He goes to the dining area. Lorsquatch is already seated at the bar, drink in hand. Kadvosk joins her.“Glad you could make it. Wake up! Show some spizzle. We’re going to Earth today. The only damn reason I ever came on this trip. I can’t wait to go dive into water. They have oceans of it. If only I could live there,” she says.“No more water. Jool knows how you can keep drinking!” he replies.“You know I don’t hold with that Joolian stuff. It keeps the brood happy, but I can’t be bothered. Now, just shut up and wait. We’ll be stopping soon. And then, sweet, sweet water!” Just then, an announcement pings on their personal gadgets. It says, “Our first stop on Earth is nearing. Called Antartica in the local language, it consists mainly of frozen water. The local atmosphere is predominantly nitrogen and is breathable. No harmful pollutants found. We recommend taking shallow breaths. The ship will stop here for 60 kricks. Please approach teleport zone for beaming to the surface. Thank you.”“Come on, you! I don’t want to waste a single hemikrick!” says Lorsquatch, dragging Kadvosk with her. They land on Antartica. “Yes, yes, yes! All my dreams have come true! Water, water, everywhere!” screams Lorsquatch.“Shh! Everyone’s looking. Calm down, will ya?” says Kadvosk.“To Hole with everyone! Now, let me mine this stuff,” replies Lorsquatch. For the next 60 kricks, Lorsquatch melts a bit of water with her hand-held laser, scoops it out and drinks. Kadvosk looks on for some time, undecided, then he joins Lorsquatch — body ache be damned! All too soon, the ship sends another message saying, “You will now be teleported to a place near the equator of the planet. It is wonderfully hot and humid. The natives are celebrating a festival today, called Diwali. They ignite primitive mixtures of carbon, chlorine and potassium, known as fireworks, as offerings to their native Jool. It results in a spectacular display of colours on the land and in the sky. This festival is celebrated over a large area and we will be beaming groups of 25 Grughians to each location. Please activate your camouflage packs and please stay in touch with your group at all times. The fumes from igniting fireworks may cause irritation but are non-toxic. It is recommended that you activate your air shields as a precaution. The ship will stop here for 150 kricks.” Lorsquatch and Kadvosk are beamed to a street corner. It’s evening. There are a lot of natives outside. An acrid smell is in the air. Suddenly, they hear a loud bang. Startled, they look around. A bunch of native younglings are shrieking. One of them places something on the ground, lights it and runs away. BANG! Both Lorsquatch and Kadvosk jump. The younglings turn to look at them and shout something. The bang has deafened them and they can’t hear anything. They shake their heads. The younglings start laughing - at least that’s how the translator interprets it. Lorsquatch says, \"I’m not standing here waiting for that sound again. Let’s go find some water.\" Lorsquatch turns and walks a few steps. A native in front of her gestures her back. Suddenly, a burst of flame and sparks spurts from the ground. Startled, Lorsquatch moves back. The native, a male, comes forward, saying, \"Are you okay? Didn’t you see the flowerpot?\"\"What flowerpot?\" Another native, a female this time, comes and says, \"Poor thing must be new here. Look how scared she is. Here, have some water. Relax. You are fine.\"She hands Lorsquatch a small container of fluid. Lorsquatch sips. It’s pure water. She gulps down the whole thing. The native woman smiles and says, \"Feeling better now? You look better.\"\"Thank you. Yes. I’m better,\" says Lorsquatch. Kadvosk reaches them and asks Lorsquatch, \"What happened? Where did you go?\"\"Your friend came too close to a flowerpot and got scared. I gave her some water. She’s fine now,\" says the native woman, smiling.\"Yes. I’m feeling good. Let’s go,\" says Lorsquatch. Turning to the natives, she says, \"Thank you. I’ll be careful and look out for flowerpots.\" They smile, nod and walk away. Lorsquatch grabs Kadvosk and says, \"Did you see? I went near that burning thing.... What was it?... Yah... Flowerpot... And these natives gave me water. Pure water. And they didn’t ask me for a single grek. This is too easy. Let’s go. You can do one and I’ll do the next.\"\"That just might work. Let’s do it,\" concurs Kadvosk, grinning. So, they walk through the streets, stopping at every other flowerpot, getting a drink of water. In some places, the natives gave them some very sweet stuff but they followed it up with water, so it was all good. By the time it came for them to leave, both were just about to collapse but were too happy to do anything about it. As the ship beamed them back, Lorsquatch said, \"I was right! This was worth every grek I paid!\" They spent the rest of their trip blissfully unaware, recovering from acute water poisoning. ", "name": "687", "child": "687_1\t687_2", "timestamp": "Apr 15"}