{"parent": "", "title": "How to Write a Trilogy — with a Soundtrack", "author": "Mike Van Horn", "sentences": [{"ce0f": "My sketch of my main alien, nickname Breadbox"}, {"41a7": "How to Write a Trilogy — with a Soundtrack"}, {"a636": "Start with a short story"}, {"a482": "I didn’t set out to write a trilogy. Or music, lord knows. Years ago I wrote a chapter about a woman singer who found a surviving alien in a spaceship that crashed on her back hillside, and decided to nurse it back to health. I called it Agate and Breadbox — their nicknames for each other. But I had no idea where it was going, so I did nothing with it."}, {"11ab": "A couple of years ago I started adding chapters to it, thinking I could get a short story. Turned out the alien was also a singer, and they sang together. When it grew past 15,000 words, I started thinking novella. I got what I thought was a finished story; it was 33,000 words. Too long for short; too short for a novel. At a writing seminar, I pitched it to an agent. I told her the length; she laughed and said come back when I had twice that much."}, {"33b5": "I introduced a subplot, which soon became the main arc of the story. I wrote a bunch of new chapters and new characters. The story evolved from nursing an alien back to health, to keeping the alien and the spaceship away from the government, to the main character rediscovering her passion for singing with the help of the alien. The name changed to Aliens Crashed in My Back Yard."}, {"48ea": "People liked the story but said there was a large gap between the last two chapters. Too much unexplained. I felt dismayed; the story was done. I didn’t want to muck it up with more chapters tacked on. Thus was born Book II — My Spaceship Calls Out to Me. I saw I could write an entire story between the two last chapters of the first book. The protagonist finally flies the alien vessel to the Moon, pursued by the Americans, Russians, and Chinese. Yet I couldn’t leave her circling the Moon; I had to get her back to Earth, and I needed to add in more alien interactions. That took more chapters."}, {"7187": "When the word count of Book II pushed past 100,000, I again felt dismay. A major part in the middle still wasn’t worked out. (I don’t write from beginning to end.) The beginning and end were written, but the middle was a muddle. As I was yet again outlining the intertwined pieces of the middle section, I came to a point where I said, “This feels like the completion of the story.” But that came before the whole last section that is already written. Rather than have a long, two-humped story, or throwing away parts I really liked, I explored dividing it in two, creating a third book."}, {"c777": "Thus was born Book III, working title Space Girl Yearning. Our heroine is circling the Moon, but she is still drawn to fly to the distant worlds of other stars, and the aliens are urging her to come. They entice her and invite her, flattering her singing ability. Yet she has equally strong pulls to return to Earth, share the technology, and resume her singing career. She can’t seem to shake the space-roaming bug."}, {"f466": "My sketch for Book III cover, will become beautiful art by Shane Colclough"}, {"4972": "The best part is: most of Book III is already written, or outlined with substantial notes. So it won’t be like starting a whole new book project."}, {"bd5d": "What about the soundtrack? The heroine is a singer; so is the alien. I had to write lyrics for songs she performed. First just a couple of lines of made up songs, but some grew multiple verses. If I have lyrics, I need music, I thought. So I found a guy to compose music, and he brought in a woman blues singer and a producer. I now have five songs produced. We’re working on one sung by the alien — that’s the toughest one. What do aliens sound like? The titles of Books II and III are also song titles."}, {"8016": "I will soon have a sci fi trilogy — with accompanying music. When it comes to writing stories, having a trilogy is a benefit. So I’m glad it is turning out this way."}, {"f85f": "If your story keeps growing (some might say metastasizing) you can either take heart or feel dismay from reading this. I guess my advice to you is, let your story take you where it wants. Your characters tell their stories; all you have to do is sign your name and take credit at the end."}], "content": "My sketch of my main alien, nickname Breadbox How to Write a Trilogy — with a Soundtrack Start with a short story I didn’t set out to write a trilogy. Or music, lord knows. Years ago I wrote a chapter about a woman singer who found a surviving alien in a spaceship that crashed on her back hillside, and decided to nurse it back to health. I called it Agate and Breadbox — their nicknames for each other. But I had no idea where it was going, so I did nothing with it. A couple of years ago I started adding chapters to it, thinking I could get a short story. Turned out the alien was also a singer, and they sang together. When it grew past 15,000 words, I started thinking novella. I got what I thought was a finished story; it was 33,000 words. Too long for short; too short for a novel. At a writing seminar, I pitched it to an agent. I told her the length; she laughed and said come back when I had twice that much. I introduced a subplot, which soon became the main arc of the story. I wrote a bunch of new chapters and new characters. The story evolved from nursing an alien back to health, to keeping the alien and the spaceship away from the government, to the main character rediscovering her passion for singing with the help of the alien. The name changed to Aliens Crashed in My Back Yard. People liked the story but said there was a large gap between the last two chapters. Too much unexplained. I felt dismayed; the story was done. I didn’t want to muck it up with more chapters tacked on. Thus was born Book II — My Spaceship Calls Out to Me. I saw I could write an entire story between the two last chapters of the first book. The protagonist finally flies the alien vessel to the Moon, pursued by the Americans, Russians, and Chinese. Yet I couldn’t leave her circling the Moon; I had to get her back to Earth, and I needed to add in more alien interactions. That took more chapters. When the word count of Book II pushed past 100,000, I again felt dismay. A major part in the middle still wasn’t worked out. (I don’t write from beginning to end.) The beginning and end were written, but the middle was a muddle. As I was yet again outlining the intertwined pieces of the middle section, I came to a point where I said, “This feels like the completion of the story.” But that came before the whole last section that is already written. Rather than have a long, two-humped story, or throwing away parts I really liked, I explored dividing it in two, creating a third book. Thus was born Book III, working title Space Girl Yearning. Our heroine is circling the Moon, but she is still drawn to fly to the distant worlds of other stars, and the aliens are urging her to come. They entice her and invite her, flattering her singing ability. Yet she has equally strong pulls to return to Earth, share the technology, and resume her singing career. She can’t seem to shake the space-roaming bug. My sketch for Book III cover, will become beautiful art by Shane Colclough The best part is: most of Book III is already written, or outlined with substantial notes. So it won’t be like starting a whole new book project. What about the soundtrack? The heroine is a singer; so is the alien. I had to write lyrics for songs she performed. First just a couple of lines of made up songs, but some grew multiple verses. If I have lyrics, I need music, I thought. So I found a guy to compose music, and he brought in a woman blues singer and a producer. I now have five songs produced. We’re working on one sung by the alien — that’s the toughest one. What do aliens sound like? The titles of Books II and III are also song titles. I will soon have a sci fi trilogy — with accompanying music. When it comes to writing stories, having a trilogy is a benefit. So I’m glad it is turning out this way. If your story keeps growing (some might say metastasizing) you can either take heart or feel dismay from reading this. I guess my advice to you is, let your story take you where it wants. Your characters tell their stories; all you have to do is sign your name and take credit at the end. ", "name": "688", "child": "688_1", "timestamp": "Apr 12"}