{"parent": "", "title": "Why Is Nobody Watching “Schitt’s Creek” With Me?", "author": "Katie Heaney", "sentences": [{"c0f5": "Why Is Nobody Watching “Schitt’s Creek” With Me?"}, {"87f7": "It’s amazing and everyone on it is hot."}, {"c395": "A few weeks ago, a Facebook friend of mine (yeah — I have Facebook friends) posted a request for TV show recommendations. I, too, was in need of TV show recommendations, am always in need of TV show recommendations, so I scanned the list of comments. Most of them were things everyone has already seen (“ever tried ‘Parks and Rec’?” — this person’s friend), but I also saw a couple enthusiastic shout-outs to a show called “Schitt’s Creek.” I had seen the show among the “new to Netflix” selections and scrolled right past it. I am here today to make sure you don’t make the same mistake I did."}, {"5e51": "“Schitt’s Creek,” which was just renewed for a fourth season, is a Canadian show co-created and written by Eugene Levy and his son, Daniel Levy, who star as Johnny and David Rose, respectively. The show centers around a formerly wealthy family — Johnny, wife Moira (Catherine O’Hara), and their adult children David and Alexis (Annie Murphy) — who is forced to move to a small town called Schitt’s Creek after losing their fortune and assets to government seizure because their crooked business manager hasn’t been paying their taxes. The Rose family happens to own Schitt’s Creek because they bought it as a birthday present for then-sixteen-year-old David as a joke. With nowhere else to go, no money, and very little practical job experience, they move into two adjoining rooms at the local motel and attempt to start a new life. Because they must live off the reluctant good fortune of the townspeople (the family keeps a “running tab” at the town’s cafe to cover their meals), the Roses are beholden to a group of people they approach with varying levels of contempt, pity, and benevolent condescension. But in their new small-town surroundings, it is the Roses who are made ridiculous."}, {"6a3b": "In Schitt’s Creek’s riches-to-rags storyline there is an obvious parallel to “Arrested Development,” but where the Bluths are dysfunctional individualists, the Roses are an essentially happy family, and basically kind to one another. David and Alexis bicker like teenagers, but they are also best friends. Johnny is often baffled by Moira’s behavior, but one never doubts how much he loves her. David and Alexis are sometimes embarrassed by their parents, but they also stand by them — in a recent episode, David saves his mother from certain embarrassment at the hands of his own ex, a famous New York photographer, and the two walk away arm-in-arm. None of them is thrilled to be where they are, but all are aware how much worse things would be without each other."}, {"2a56": "There isn’t much I can say about this without giving the good stuff away, so you’ll have to trust me when I say that the show’s romantic arcs, too, are fresh and surprising. David’s character is presumed bisexual by a comparison he makes to wines (he likes red and white), though he doesn’t claim any label explicitly. In fact, the topic mainly seems to bore him — at least until [spoiler spoiler season three ahhhh spoiler]. Alexis quickly gets involved with the two hottest guys in town (hello, Tim Rozon), but neither works out the way you’d expect. For her, too, there is an indifference to her approach which is refreshing in a female TV character in her late twenties. Also, she is very, very funny. The entire Rose family is so good it would be nearly impossible to pick a favorite, but Annie Murphy’s timing, and the specificity of her facial expressions, are unparalleled."}, {"3532": "Pop"}, {"26d1": "But really, everyone is great. Catherine O’Hara plays the former soap opera star with a delightfully strange Mid-Atlantic accent and an endearing self-assuredness disproportionate to her acting talent. Eugene Levy is the perfect straight man in a conservative suit next to Moira’s endless parade of black-and-white ensembles and fashion wigs. Daniel Levy is sardonic and more self-aware than his sister, but only slightly, and he obviously gets his fashion sense from his mother. He is also very handsome. Then there are all the townspeople: Chris Elliott as mayor and Jennifer Robinson as his wife, Sarah Levy (Eugene’s daughter and Daniel’s sister) as beleaguered waitress Twyla, Emily Hampshire’s deadpan hotel concierge Stevie. Everyone is so good!"}, {"2d7c": "What more do you people need?!!! There are two seasons of this show available on Netflix right this minute, and you can get the third on Amazon prime for twenty bucks. I promise it is worth it. It’s so funny and good, and there are so many attractive people on it, and it’s made me say “aw” out loud about sixty times. I’m going to start it over again right now while I wait for season four."}], "content": "Why Is Nobody Watching “Schitt’s Creek” With Me? It’s amazing and everyone on it is hot. A few weeks ago, a Facebook friend of mine (yeah — I have Facebook friends) posted a request for TV show recommendations. I, too, was in need of TV show recommendations, am always in need of TV show recommendations, so I scanned the list of comments. Most of them were things everyone has already seen (“ever tried ‘Parks and Rec’?” — this person’s friend), but I also saw a couple enthusiastic shout-outs to a show called “Schitt’s Creek.” I had seen the show among the “new to Netflix” selections and scrolled right past it. I am here today to make sure you don’t make the same mistake I did. “Schitt’s Creek,” which was just renewed for a fourth season, is a Canadian show co-created and written by Eugene Levy and his son, Daniel Levy, who star as Johnny and David Rose, respectively. The show centers around a formerly wealthy family — Johnny, wife Moira (Catherine O’Hara), and their adult children David and Alexis (Annie Murphy) — who is forced to move to a small town called Schitt’s Creek after losing their fortune and assets to government seizure because their crooked business manager hasn’t been paying their taxes. The Rose family happens to own Schitt’s Creek because they bought it as a birthday present for then-sixteen-year-old David as a joke. With nowhere else to go, no money, and very little practical job experience, they move into two adjoining rooms at the local motel and attempt to start a new life. Because they must live off the reluctant good fortune of the townspeople (the family keeps a “running tab” at the town’s cafe to cover their meals), the Roses are beholden to a group of people they approach with varying levels of contempt, pity, and benevolent condescension. But in their new small-town surroundings, it is the Roses who are made ridiculous. In Schitt’s Creek’s riches-to-rags storyline there is an obvious parallel to “Arrested Development,” but where the Bluths are dysfunctional individualists, the Roses are an essentially happy family, and basically kind to one another. David and Alexis bicker like teenagers, but they are also best friends. Johnny is often baffled by Moira’s behavior, but one never doubts how much he loves her. David and Alexis are sometimes embarrassed by their parents, but they also stand by them — in a recent episode, David saves his mother from certain embarrassment at the hands of his own ex, a famous New York photographer, and the two walk away arm-in-arm. None of them is thrilled to be where they are, but all are aware how much worse things would be without each other. There isn’t much I can say about this without giving the good stuff away, so you’ll have to trust me when I say that the show’s romantic arcs, too, are fresh and surprising. David’s character is presumed bisexual by a comparison he makes to wines (he likes red and white), though he doesn’t claim any label explicitly. In fact, the topic mainly seems to bore him — at least until [spoiler spoiler season three ahhhh spoiler]. Alexis quickly gets involved with the two hottest guys in town (hello, Tim Rozon), but neither works out the way you’d expect. For her, too, there is an indifference to her approach which is refreshing in a female TV character in her late twenties. Also, she is very, very funny. The entire Rose family is so good it would be nearly impossible to pick a favorite, but Annie Murphy’s timing, and the specificity of her facial expressions, are unparalleled. Pop But really, everyone is great. Catherine O’Hara plays the former soap opera star with a delightfully strange Mid-Atlantic accent and an endearing self-assuredness disproportionate to her acting talent. Eugene Levy is the perfect straight man in a conservative suit next to Moira’s endless parade of black-and-white ensembles and fashion wigs. Daniel Levy is sardonic and more self-aware than his sister, but only slightly, and he obviously gets his fashion sense from his mother. He is also very handsome. Then there are all the townspeople: Chris Elliott as mayor and Jennifer Robinson as his wife, Sarah Levy (Eugene’s daughter and Daniel’s sister) as beleaguered waitress Twyla, Emily Hampshire’s deadpan hotel concierge Stevie. Everyone is so good! What more do you people need?!!! There are two seasons of this show available on Netflix right this minute, and you can get the third on Amazon prime for twenty bucks. I promise it is worth it. It’s so funny and good, and there are so many attractive people on it, and it’s made me say “aw” out loud about sixty times. I’m going to start it over again right now while I wait for season four. ", "name": "694", "child": "694_1\t694_2\t694_3\t694_4", "timestamp": "Apr 14"}