{"parent": "", "title": "‘Survivor’ Seizes Its Teachable Moment", "author": "Alison Herman", "sentences": [{"e2f8": "‘Survivor’ Seizes Its Teachable Moment"}, {"150c": "The show responded to a transgender outing with thought, sensitivity, and some uneasy self-promotion"}, {"8b35": "We watch reality television on two levels. There’s the actual substance of a given episode: what happened and why; who said what about whom. And then there’s our knowledge of the small army of executives, producers, and editors it took to shape hundreds of hours of footage into a coherent narrative. The hour put before us each week is the result of many behind-the-scenes decisions, and speculating about them is half the fun — and occasionally, the work — of analyzing reality TV."}, {"cfa5": "When it comes to parsing a situation as murky and queasy as one Survivor contestant outing another as transgender, it’s useful to consider both."}, {"3a46": "To be clear, the way that outing is portrayed on the show isn’t murky in the slightest. The Tribal Council began with routine strategizing, then took a turn for the shocking: Jeff Varner told host Jeff Probst, “There is a deception here. Deception on levels, Jeff, these guys don’t even understand,” then turned to tribemate Zeke Smith and asked him, “Why haven’t you told anyone you’re transgender?”"}, {"fe77": "The reaction from both Probst and Varner’s fellow contestants was swift: “That’s personal.” “Nobody has the right to out anybody.” “That isn’t deceiving us strategically.” “You should be ashamed of yourself.” There wasn’t a single dissenting opinion except for Varner’s, who gave a half-hearted and nonsensical self-defense — “I argue for the rights of transgender people every day in the state of North Carolina … I’m not outing him” — before himself backing down and admitting fault: “I clearly have made the wrong choice tonight. My conscience is in pain.” (Varner reprised those sentiments in a subsequent Twitter apology.) Rather than play the role of impartial moderator, Probst himself weighed in: “That is a giant leap of logic,” he told Varner, before closing out deliberations by declaring, “We don’t need to vote.” Varner was sent home."}, {"ba77": "The confrontation was remarkable for Varner’s violation alone, which was self-evidently reprehensible. Trans people are often targeted and discriminated against for their gender identity, in many states without legal protection; disclosing it is thus a matter of personal discretion, not deception. But it was frankly astonishing to see the unanimity with which Survivor presented both the contestants’ opinion and its own, via Probst. It’s almost impossible to imagine any version of this episode airing just five years ago; if it had, however, I seriously doubt whether it would have such a strongly articulated position about the ethics of outing, or even a clear understanding of what the issues around outing are. The instant consensus against Varner and in support of Zeke, meanwhile, felt like the unmistakable product of a cultural moment that has room for not just indie darlings like Transparent, but mainstream trans megacelebrities like Caitlyn Jenner. Lest we forget, all this was airing on CBS, the most notoriously conservative broadcast network with a notoriously white, older, and middle-American demographic."}, {"7fdc": "Times have changed, obviously. Even though it was canceled after just a handful of episodes, CBS aired the first broadcast series with a regular transgender role with Laverne Cox’s Doubt earlier this spring. And now it’s aired an episode of television that does more than portray and condemn a nonconsensual outing. It’s clearly shot, packaged, and promoted to be a teachable moment."}, {"8300": "While Smith was outed against his wishes, in just a few minutes of screen time he pivoted to a slightly different take on the night’s events. “Maybe this will lead to a greater good,” he told Probst, positing that even though “I didn’t want to be the trans Survivor player,” seeing an out transgender contestant might help some viewers. For his part, Probst capped the evening by declaring the proceedings “complicated but ultimately beautiful.” The accelerated learning curve was almost whiplash-inducing — an initial surprise smoothly guided into a determinedly positive Lesson of the Week by experienced hands, both in front of the camera and behind it."}, {"c4e9": "What started with the broadcast itself was soon borne out by how CBS handled its rollout. Within hours of the episode’s East Coast airtime, Smith himself had an op-ed published in The Hollywood Reporter. EW posted an interview with Probst. At The New York Times, contributing opinion writer Jennifer Finney Boylan published a piece about the issues surrounding outing, thoughtfully engaging Varner’s “deception” framing at face value. They’re different voices with different stakes in the show. Together, though, they demonstrate that CBS was well aware of what it had on its hands and had gotten ahead of the conversation with the pre-prepared message that this was a capital-i Important hour of television."}, {"ae6b": "“Transitioning created the opportunity to remake myself — to really consider and construct the man I wanted to be,” Smith wrote in THR. “Whether I was conscious of it or not, ‘Survivor player’ became part of the remodel blue prints.” The editorial is well and movingly written, speaking to his personal history, the broader trans experience, and even putting himself in Varner’s shoes: “Beyond his charm and charisma, I thought I recognized a deep-seated insecurity and self-loathing, a glimpse at who I could become were I not careful.” It’s also worth keeping in mind that at the same time Smith is speaking for himself, he’s also playing a role in a larger publicity effort that casts his show in a flattering light. While Smith didn’t give his consent to be outed by Varner, he did agree to participate in the outing’s presentation — though that choice might be more in the interest of controlling his own story than in furthering the interests of Survivor."}, {"1152": "For his part, Probst told EW, “It was as if [Smith] had been preparing for this absolutely unpredictable, completely public, and incredibly vulnerable moment for his entire life. His composure was astounding. And when he connected the entire event to the word metamorphosis [a Survivor mainstay], I distinctly remember thinking — how in the world did you just do that?” The passage is jarring. In the same paragraph where Probst is complimenting Smith as a human being, he’s also praising him as a brand ambassador."}, {"747b": "I’ll admit to being of two minds about this. The repeatedly stated takeaway the entire episode is designed to deliver is unimpeachable. Outing someone is appalling; privacy is a fundamental human right. There are many ways to communicate that message, and as Smith proposes during the Council, playacting the scenario in the relatively controlled environment of a reality television shoot and its extremely controlled distribution may well be one of them. Yet this controversy also marks another, less clear-cut milestone: awareness of and convictions on transgender issues becoming mainstream enough to be co-opted as part of the promotional strategy for a mainstream television show."}, {"98fd": "I don’t think Smith is being disingenuous about his emotional connection with Survivor. I’d also much rather Survivor take Smith’s side as adamantly as it did than give Varner’s wrongheaded and harmful ideas traction. Alongside those more positive emotions, though, I’m also the slightest bit uneasy with the commodification of a personal violation as ad-supported, sensationalized entertainment. (It is also discomfiting to see a civil rights struggle portrayed in this way, even if trans rights aren’t the first issue to go through this wringer, nor will they be the last.) After all, CBS’s options here weren’t limited to “support outing” or “condemn outing” — they also could have chosen not to air the event in the first place, and to keep the outing within the confines of the set. Neither the appreciation nor the discomfort necessarily cancels out the other; in its own way, weighing those contradictions is just as meaningful as the episode’s surface-level takeaway. The whole situation is a mess, but the kind of mess that inevitably comes with negotiating progress in public."}], "content": "‘Survivor’ Seizes Its Teachable Moment The show responded to a transgender outing with thought, sensitivity, and some uneasy self-promotion We watch reality television on two levels. There’s the actual substance of a given episode: what happened and why; who said what about whom. And then there’s our knowledge of the small army of executives, producers, and editors it took to shape hundreds of hours of footage into a coherent narrative. The hour put before us each week is the result of many behind-the-scenes decisions, and speculating about them is half the fun — and occasionally, the work — of analyzing reality TV. When it comes to parsing a situation as murky and queasy as one Survivor contestant outing another as transgender, it’s useful to consider both. To be clear, the way that outing is portrayed on the show isn’t murky in the slightest. The Tribal Council began with routine strategizing, then took a turn for the shocking: Jeff Varner told host Jeff Probst, “There is a deception here. Deception on levels, Jeff, these guys don’t even understand,” then turned to tribemate Zeke Smith and asked him, “Why haven’t you told anyone you’re transgender?” The reaction from both Probst and Varner’s fellow contestants was swift: “That’s personal.” “Nobody has the right to out anybody.” “That isn’t deceiving us strategically.” “You should be ashamed of yourself.” There wasn’t a single dissenting opinion except for Varner’s, who gave a half-hearted and nonsensical self-defense — “I argue for the rights of transgender people every day in the state of North Carolina … I’m not outing him” — before himself backing down and admitting fault: “I clearly have made the wrong choice tonight. My conscience is in pain.” (Varner reprised those sentiments in a subsequent Twitter apology.) Rather than play the role of impartial moderator, Probst himself weighed in: “That is a giant leap of logic,” he told Varner, before closing out deliberations by declaring, “We don’t need to vote.” Varner was sent home. The confrontation was remarkable for Varner’s violation alone, which was self-evidently reprehensible. Trans people are often targeted and discriminated against for their gender identity, in many states without legal protection; disclosing it is thus a matter of personal discretion, not deception. But it was frankly astonishing to see the unanimity with which Survivor presented both the contestants’ opinion and its own, via Probst. It’s almost impossible to imagine any version of this episode airing just five years ago; if it had, however, I seriously doubt whether it would have such a strongly articulated position about the ethics of outing, or even a clear understanding of what the issues around outing are. The instant consensus against Varner and in support of Zeke, meanwhile, felt like the unmistakable product of a cultural moment that has room for not just indie darlings like Transparent, but mainstream trans megacelebrities like Caitlyn Jenner. Lest we forget, all this was airing on CBS, the most notoriously conservative broadcast network with a notoriously white, older, and middle-American demographic. Times have changed, obviously. Even though it was canceled after just a handful of episodes, CBS aired the first broadcast series with a regular transgender role with Laverne Cox’s Doubt earlier this spring. And now it’s aired an episode of television that does more than portray and condemn a nonconsensual outing. It’s clearly shot, packaged, and promoted to be a teachable moment. While Smith was outed against his wishes, in just a few minutes of screen time he pivoted to a slightly different take on the night’s events. “Maybe this will lead to a greater good,” he told Probst, positing that even though “I didn’t want to be the trans Survivor player,” seeing an out transgender contestant might help some viewers. For his part, Probst capped the evening by declaring the proceedings “complicated but ultimately beautiful.” The accelerated learning curve was almost whiplash-inducing — an initial surprise smoothly guided into a determinedly positive Lesson of the Week by experienced hands, both in front of the camera and behind it. What started with the broadcast itself was soon borne out by how CBS handled its rollout. Within hours of the episode’s East Coast airtime, Smith himself had an op-ed published in The Hollywood Reporter. EW posted an interview with Probst. At The New York Times, contributing opinion writer Jennifer Finney Boylan published a piece about the issues surrounding outing, thoughtfully engaging Varner’s “deception” framing at face value. They’re different voices with different stakes in the show. Together, though, they demonstrate that CBS was well aware of what it had on its hands and had gotten ahead of the conversation with the pre-prepared message that this was a capital-i Important hour of television. “Transitioning created the opportunity to remake myself — to really consider and construct the man I wanted to be,” Smith wrote in THR. “Whether I was conscious of it or not, ‘Survivor player’ became part of the remodel blue prints.” The editorial is well and movingly written, speaking to his personal history, the broader trans experience, and even putting himself in Varner’s shoes: “Beyond his charm and charisma, I thought I recognized a deep-seated insecurity and self-loathing, a glimpse at who I could become were I not careful.” It’s also worth keeping in mind that at the same time Smith is speaking for himself, he’s also playing a role in a larger publicity effort that casts his show in a flattering light. While Smith didn’t give his consent to be outed by Varner, he did agree to participate in the outing’s presentation — though that choice might be more in the interest of controlling his own story than in furthering the interests of Survivor. For his part, Probst told EW, “It was as if [Smith] had been preparing for this absolutely unpredictable, completely public, and incredibly vulnerable moment for his entire life. His composure was astounding. And when he connected the entire event to the word metamorphosis [a Survivor mainstay], I distinctly remember thinking — how in the world did you just do that?” The passage is jarring. In the same paragraph where Probst is complimenting Smith as a human being, he’s also praising him as a brand ambassador. I’ll admit to being of two minds about this. The repeatedly stated takeaway the entire episode is designed to deliver is unimpeachable. Outing someone is appalling; privacy is a fundamental human right. There are many ways to communicate that message, and as Smith proposes during the Council, playacting the scenario in the relatively controlled environment of a reality television shoot and its extremely controlled distribution may well be one of them. Yet this controversy also marks another, less clear-cut milestone: awareness of and convictions on transgender issues becoming mainstream enough to be co-opted as part of the promotional strategy for a mainstream television show. I don’t think Smith is being disingenuous about his emotional connection with Survivor. I’d also much rather Survivor take Smith’s side as adamantly as it did than give Varner’s wrongheaded and harmful ideas traction. Alongside those more positive emotions, though, I’m also the slightest bit uneasy with the commodification of a personal violation as ad-supported, sensationalized entertainment. (It is also discomfiting to see a civil rights struggle portrayed in this way, even if trans rights aren’t the first issue to go through this wringer, nor will they be the last.) After all, CBS’s options here weren’t limited to “support outing” or “condemn outing” — they also could have chosen not to air the event in the first place, and to keep the outing within the confines of the set. Neither the appreciation nor the discomfort necessarily cancels out the other; in its own way, weighing those contradictions is just as meaningful as the episode’s surface-level takeaway. The whole situation is a mess, but the kind of mess that inevitably comes with negotiating progress in public. ", "name": "698", "child": "698_1\t698_2\t698_3\t698_4\t698_5\t698_6\t698_7", "timestamp": "Apr 13"}