{"parent": "", "title": "It’s Called ‘Girls,’ Not ‘Friends’", "author": "Alison Herman", "sentences": [{"d5b1": "It’s Called ‘Girls,’ Not ‘Friends’"}, {"afb3": "The show’s foursome hasn’t been close for a while — and with one episode left, ‘Girls’ finally acknowledged it"}, {"cce6": "There’s no more meta time in a show’s life than its final stretch, when relationships are revisited and bit parts revived. That’s especially true on a show as heavily talked about as Girls. Last week’s “What Will We Do This Time About Adam?,” for example, felt like a pointed answer to all the speculation surrounding Girls’ first and most enduring pairing: Hannah and Adam said goodbye, and Girls prompted us to do so, too. Sunday night’s “Goodbye Tour” did the same thing for Hannah’s platonic relationships, confronting the audience’s expectations as well as the characters’. For what is almost certainly the last time, Girls brought its namesake foursome together; both the plot gymnastics that got them there and the ensuing gathering were more forced and awkward than ever. For the first time, however, the show actually acknowledged it."}, {"ef1a": "Girls has never served its characters equally. Hannah is the uncontested center, so Girls’ farewell has been unmistakably her farewell, and her pregnancy the game-changing event around which everything has revolved. The other three have all been sidelined or mistreated to varying degrees throughout the show for reasons both out of Lena Dunham’s control (Jemima Kirke’s pregnancy put her, and by extension Jessa, out of commission for much of the second season) and very much in it (there’s a reason “Panic in Central Park” felt like a partial mea culpa for what had become of Girls’ most initially put-together player). This resulted in the inevitable fracturing of Girls into several borderline-unconnected shows — or rather, one show and three spinoffs that happened to share the same half-hour. It has also felt like life: Girls managed to chronicle the slow-motion death of friendship rather than friendship itself, an effort with mixed success but still novel results."}, {"0c7b": "Lena Dunham Wants to Talk About ‘Girls,’ Not HerselfShe addressed the way her show is talked about with Andy Greenwaldtheringer.com"}, {"70ff": "“Goodbye Tour” finally faces this state of affairs head on. By the look of Hannah’s stomach, we’ve fast-forwarded a few months in time, and our heroine has yet another bombshell to share, arguably an even bigger one: she’s leaving New York, for a cushy job at an upstate college working for Ann Dowd’s crunchy department chair and teaching kids about the internet. (Hannah needs the health insurance.) But besides her dad and Elijah, she finds, there’s not many people to tell. Marnie’s ignoring her calls. Jessa’s out, now more than ever after Adam’s chosen her. And Shoshanna’s been out of the loop for so long that she’s changed her number without Hannah even noticing. Hannah, and her show, are finally taking stock of what we’ve noticed for years: The foursome’s continental drift has left them an ocean apart."}, {"ca71": "This being Hannah Horvath, it takes a grand demonstration to bring the point home: walking right into the middle of Shoshanna’s engagement party. Huh? Exactly."}, {"58f0": "Hannah’s reaction mirrors ours. “You had a party and you didn’t invite me?” she accuses. “Yeah, I did,” Shoshanna bluntly replies. “Which would be strange, except you’re having a baby and neglected to tell me.” She has a point. As Vulture noted last week, one of the ostensible four most important characters on this show has had less screen time this season than seven of her castmates. And while incorporating that fact into Girls itself doesn’t render what came before it any more consistent or less confusing, it does make for a clever demonstration of Hannah’s epic self-absorption, and maybe even a tacit admission of negligence on the part of her creators."}, {"d793": "When Marnie calls a “group meeting” in the bathroom, Shoshanna calls bullshit. Here, she reprises her role from Season 3’s “Beach House,” not coincidentally the very last time this foursome felt natural: with the clique’s kid sister grown up into its conscience. She doesn’t come right out and say that there is no group, but she strides right up to the edge: “We cannot be in the same room without one of us making it completely and totally about ourselves,” she pronounces. She’s come to see “how narcissistic and exhausting and ultimately boring” this whole dynamic is, and she’s had enough: “I think we should just all agree to call it.” Any one of those lines could have been taken from a water-cooler conversation about the late period of the show, and now Girls is parroting it right back at us."}, {"3ff7": "“Goodbye Tour” backs off from the ledge a bit by having Jessa and Hannah reconcile, though it comes off more as a slate-clearing than a resumption of friendship. The show won’t totally forswear these friendships, or reject their onetime value, or even rule out the possibility of one last reunion around Hannah’s hospital bed next week — just its probability. But “Goodbye Tour” is propped up by what this show has long needed and, in its final weeks, can finally provide: a collective recognition that there’s nothing holding these women together, and what’s worse, they even hold each other back. Shoshanna realized this early, which is why she’s been off getting her life together while Marnie moves back home and Jessa yells at the cable company. Hannah, of course, is the last to wake up. No wonder her show took so long, too."}, {"a3bf": "Even though it’s the show’s penultimate episode, “Goodbye Tour” works, on many levels, as a series finale, with Hannah embarking on a new journey as she and her onetime besties share one last dance. And yet the episode ultimately serves as a throat-clearing — a show working out its issues through the people onscreen working out theirs. The girls haven’t been a cohesive unit for a while, and Girls is aware of that. Time to move on."}, {"89a4": "Disclosure: HBO is an initial investor in The Ringer."}], "content": "It’s Called ‘Girls,’ Not ‘Friends’ The show’s foursome hasn’t been close for a while — and with one episode left, ‘Girls’ finally acknowledged it There’s no more meta time in a show’s life than its final stretch, when relationships are revisited and bit parts revived. That’s especially true on a show as heavily talked about as Girls. Last week’s “What Will We Do This Time About Adam?,” for example, felt like a pointed answer to all the speculation surrounding Girls’ first and most enduring pairing: Hannah and Adam said goodbye, and Girls prompted us to do so, too. Sunday night’s “Goodbye Tour” did the same thing for Hannah’s platonic relationships, confronting the audience’s expectations as well as the characters’. For what is almost certainly the last time, Girls brought its namesake foursome together; both the plot gymnastics that got them there and the ensuing gathering were more forced and awkward than ever. For the first time, however, the show actually acknowledged it. Girls has never served its characters equally. Hannah is the uncontested center, so Girls’ farewell has been unmistakably her farewell, and her pregnancy the game-changing event around which everything has revolved. The other three have all been sidelined or mistreated to varying degrees throughout the show for reasons both out of Lena Dunham’s control (Jemima Kirke’s pregnancy put her, and by extension Jessa, out of commission for much of the second season) and very much in it (there’s a reason “Panic in Central Park” felt like a partial mea culpa for what had become of Girls’ most initially put-together player). This resulted in the inevitable fracturing of Girls into several borderline-unconnected shows — or rather, one show and three spinoffs that happened to share the same half-hour. It has also felt like life: Girls managed to chronicle the slow-motion death of friendship rather than friendship itself, an effort with mixed success but still novel results. Lena Dunham Wants to Talk About ‘Girls,’ Not HerselfShe addressed the way her show is talked about with Andy Greenwaldtheringer.com “Goodbye Tour” finally faces this state of affairs head on. By the look of Hannah’s stomach, we’ve fast-forwarded a few months in time, and our heroine has yet another bombshell to share, arguably an even bigger one: she’s leaving New York, for a cushy job at an upstate college working for Ann Dowd’s crunchy department chair and teaching kids about the internet. (Hannah needs the health insurance.) But besides her dad and Elijah, she finds, there’s not many people to tell. Marnie’s ignoring her calls. Jessa’s out, now more than ever after Adam’s chosen her. And Shoshanna’s been out of the loop for so long that she’s changed her number without Hannah even noticing. Hannah, and her show, are finally taking stock of what we’ve noticed for years: The foursome’s continental drift has left them an ocean apart. This being Hannah Horvath, it takes a grand demonstration to bring the point home: walking right into the middle of Shoshanna’s engagement party. Huh? Exactly. Hannah’s reaction mirrors ours. “You had a party and you didn’t invite me?” she accuses. “Yeah, I did,” Shoshanna bluntly replies. “Which would be strange, except you’re having a baby and neglected to tell me.” She has a point. As Vulture noted last week, one of the ostensible four most important characters on this show has had less screen time this season than seven of her castmates. And while incorporating that fact into Girls itself doesn’t render what came before it any more consistent or less confusing, it does make for a clever demonstration of Hannah’s epic self-absorption, and maybe even a tacit admission of negligence on the part of her creators. When Marnie calls a “group meeting” in the bathroom, Shoshanna calls bullshit. Here, she reprises her role from Season 3’s “Beach House,” not coincidentally the very last time this foursome felt natural: with the clique’s kid sister grown up into its conscience. She doesn’t come right out and say that there is no group, but she strides right up to the edge: “We cannot be in the same room without one of us making it completely and totally about ourselves,” she pronounces. She’s come to see “how narcissistic and exhausting and ultimately boring” this whole dynamic is, and she’s had enough: “I think we should just all agree to call it.” Any one of those lines could have been taken from a water-cooler conversation about the late period of the show, and now Girls is parroting it right back at us. “Goodbye Tour” backs off from the ledge a bit by having Jessa and Hannah reconcile, though it comes off more as a slate-clearing than a resumption of friendship. The show won’t totally forswear these friendships, or reject their onetime value, or even rule out the possibility of one last reunion around Hannah’s hospital bed next week — just its probability. But “Goodbye Tour” is propped up by what this show has long needed and, in its final weeks, can finally provide: a collective recognition that there’s nothing holding these women together, and what’s worse, they even hold each other back. Shoshanna realized this early, which is why she’s been off getting her life together while Marnie moves back home and Jessa yells at the cable company. Hannah, of course, is the last to wake up. No wonder her show took so long, too. Even though it’s the show’s penultimate episode, “Goodbye Tour” works, on many levels, as a series finale, with Hannah embarking on a new journey as she and her onetime besties share one last dance. And yet the episode ultimately serves as a throat-clearing — a show working out its issues through the people onscreen working out theirs. The girls haven’t been a cohesive unit for a while, and Girls is aware of that. Time to move on. Disclosure: HBO is an initial investor in The Ringer. ", "name": "708", "child": "708_1\t708_2\t708_3", "timestamp": "Apr 10"}