{"parent": "", "title": "O que há por trás da guerra entre Youtube e youtubers?", "author": "Eden Wiedemann", "sentences": [{"d557": "O que há por trás da guerra entre Youtube e youtubers?"}, {"2e3a": "Menos audiência quando há mais qualificação, não é exatamente ruim"}, {"7588": "Recentemente marcas como Volkswagen, Toyota, Tesco, McDonald’s, L’Oreal, RBS, BBC, Channel 4, o governo britânico, Verizon, AT&T e Johnson & Johnson removeram suas campanhas do Youtube, estimulando muitas outras marcas a fazerem o mesmo. O motivo: descobriram que seus anúncios estavam sendo veiculados em vídeos e canais com discursos de ódios, palavrões e conteúdo de baixa qualidade. Aparentemente o controle de qualidade do Google havia derrapado, ignorando aderência entre produto e meio, buscando tão somente volume."}, {"538a": "Para tentar estancar o sangramento, o Google divulgou algumas mudanças. Uma delas é não monetizar canais com menos de 10.000 visualizações totais, a outra — e que vem causando maior gritaria por parte de alguns “influencers” — é a decisão de não monetizar vídeos cheios de palavrões ou conteúdo de qualidade discutível, dando maior relevância a conteúdo para a família. Como resultado, aqueles Youtubers acostumados a gravar videos gritando, xingando e mostrando todo tipo de porcaria tiveram uma queda de cerca de 90% na monetização de seus vídeos."}, {"2be1": "Os Youtubers, claro, começaram a gritar. “Ah, mas sou eu que gero audiência para o Youtube ter o que vender”. Bom, esse sempre foi o problema dessa turma, dos hubs ou influenciadores, se acharem a última bolacha do pacote. Esqueceram que são substituíveis, que são apenas parte de um engrenagem bem maior que eles."}, {"deb1": "Sempre haverá anunciantes. SEMPRE. Ter menos audiência — se a redução significar melhor qualificação — não é exatamente ruim. Menor oferta, maior preço. O mercado vai se ajustar. Eles realmente esperavam que o Youtube se preocupasse em não ferir os sentimentos deles (e o bolso) em detrimento dos próprios (O BOLSO)?"}, {"49e0": "Mas é o ciclo. A turma fica se achando foda, o Google/Youtube/Facebook ou o que seja, mostra quem manda (o anunciante) e começa o chororô. Em 2012 vimos o mesmo acontecer com os blogueiros. Pressionados pelas agências para apresentarem maior (e não melhor) audiência — um erro grosseiro comum, tentar relacionar audiência de blogs e canais de nicho com a de portais ou da mídia off sem considerar suas características próprias — passaram a fazer tudo pelo views, reduzindo consideravelmente a qualidade de seu conteúdo e, para aumentar seu alcance, ficando reféns do Facebook e de modismos (que afastaram seu leitor fiel, com quem ele tinha maior credibilidade e relevância). Eles permitiram que as agências ditassem as regras, não se impuseram e logo depois se viram queimados pelas mesmas agências que os obrigaram a mudar. Foram esquecidos e muitos deles morreram, definharam sem verba. Toda uma geração de influenciadores, que dominaram a web de 2006 à 2012/2013 ficou para trás."}, {"1cde": "Gente que já produzia conteúdo de qualidade vai ser pouco ou nada afetada por essas mudanças. Castanhari, Não Salvo, Castrezana, Iberê, Jovem Nerd e tantos outros que respeitam a audiência que deram duro pra criar e manter, que optaram pelo caminho mais difícil — criar uma audiência fiel em torno de sua proposta de conteúdo, com conteúdo de qualidade. O Castanhari, por exemplo, que começou em 2012 com um canal focado em abordar desenhos animados, acabou de publicar um vídeo explicando a guerra da Síria, vídeo esse que é longo, sério e que atingiu 20 milhões de visualizações em poucos dias. Sem gritos. Sem palavrões. Sem Nutella ou Amoeba."}, {"1409": "Agora uma coisa: pessoalmente eu acho LINDO os produtores de conteúdo lixo levarem um tranco. LINDO. Por mim, toda essa turma do “juntei x amoebas”, “enchi a banheira de bosta”, “trolei a minha namorada/mãe/amiga” e coisas do tipo seriam limados. Mas, como eu disse, isso é opinião pessoal (e já a expressei nesse texto AQUI), eles só continuam fazendo — e ganhavam dinheiro com isso — porque existe audiência para esse tipo de bobagem. A verdade é que toda essa turma “grito pra câmera enquanto imito o João Gordo” vai ter que aprender a produzir conteúdo de qualidade. E, não, não sou um babaca que acha que meter um \"filho de uma puta\" bem colocado no meio de um texto merece ser punido, longe de mim. E acho que em determinado momento o Youtube vai se ajustar a isso. Não é o uso, é o exagero."}, {"2ce1": "Confesso que já há algum tempo vejo esse ciclo — do surgimento e desaparecimento de Deuses da influência em redes sociais — com muitas restrições. O que os eleva ao panteão das divindades influenciadoras é a moeda com a pior sustentação: a audiência. Em temos onde quase 60% do país tem acesso a internet e o WhatsApp atinge 128 milhões de pessoa, já passou da hora de pensarmos na cauda longa, na credibilidade, na relevância, na capacidade de conversão e não focarmos apenas no alcance. O grande problema aqui é que o dinheiro dita as regras e o dinheiro está na mão dos grandes anunciantes e, consequentemente, na mão das grandes agências. Essa mudança nunca irá partir das agências; lidar com o grande influenciador facilita as coisas. Focam em alguns poucos, que cobram muito e alcançam muito — apesar de pesquisas mostrarem que convertem bem menos que os médios e micro influenciadores. Geralmente eles têm uma empresa séria e burocrática por trás deles, o que facilita a contratação, processos de produção e até mesmo comprovação. É o mais fácil. E, convenhamos, até pouco tempo era o possível."}, {"ee03": "Identificar, ativar e manter relacionamento com milhões de micro-influenciadores, sem um processo ou tecnologia que permitisse isso era um desafio que não cabia exatamente dentro do modelo de negócios da publicidade brasileira, que sobrevive de comissionamento e BV. Eu mesmo estou investindo nisso, pensando redução da importância dos mega influencers e da mídia “rabo balança cachorro”, a Wololo e as tecnologias que estão sendo desenvolvidas por nós estão focadas em micro influenciadores, em seu poder e importância. Estamos certos? O caminho é realmente esse? O tempo dirá. Espero estarmos. Mas, se a melhor forma de se prever o futuro é estudando o passado, avaliando o presente e identificando tendências e ciclos, posso dizer que você, leitor, sempre terá influência sobre seu círculo. Podem mudar as redes sociais, os meios e formatos, mas o fato de que pessoas seguirão tendo influência, relevância e credibilidade junto aos seus irá se manter, afinal isso faz parte do conceito de grupo, de comunidade."}, {"8f99": "A “guerra” iniciada pelo Youtube — forçado pelos seus grandes anunciantes — contra a turma do conteúdo ruim e do “palavrão é vírgula” é apenas um sinal da mudança. A briga vai ser boa? Não, essa história de que David bate Golias é só pra criancinhas."}, {"9b42": "Como bem disse o Cardoso: “Nessa briga do Youtube contra a 5a Série, eu fico do lado do YouTube”."}], "content": "O que há por trás da guerra entre Youtube e youtubers? Menos audiência quando há mais qualificação, não é exatamente ruim Recentemente marcas como Volkswagen, Toyota, Tesco, McDonald’s, L’Oreal, RBS, BBC, Channel 4, o governo britânico, Verizon, AT&T e Johnson & Johnson removeram suas campanhas do Youtube, estimulando muitas outras marcas a fazerem o mesmo. O motivo: descobriram que seus anúncios estavam sendo veiculados em vídeos e canais com discursos de ódios, palavrões e conteúdo de baixa qualidade. Aparentemente o controle de qualidade do Google havia derrapado, ignorando aderência entre produto e meio, buscando tão somente volume. Para tentar estancar o sangramento, o Google divulgou algumas mudanças. Uma delas é não monetizar canais com menos de 10.000 visualizações totais, a outra — e que vem causando maior gritaria por parte de alguns “influencers” — é a decisão de não monetizar vídeos cheios de palavrões ou conteúdo de qualidade discutível, dando maior relevância a conteúdo para a família. Como resultado, aqueles Youtubers acostumados a gravar videos gritando, xingando e mostrando todo tipo de porcaria tiveram uma queda de cerca de 90% na monetização de seus vídeos. Os Youtubers, claro, começaram a gritar. “Ah, mas sou eu que gero audiência para o Youtube ter o que vender”. Bom, esse sempre foi o problema dessa turma, dos hubs ou influenciadores, se acharem a última bolacha do pacote. Esqueceram que são substituíveis, que são apenas parte de um engrenagem bem maior que eles. Sempre haverá anunciantes. SEMPRE. Ter menos audiência — se a redução significar melhor qualificação — não é exatamente ruim. Menor oferta, maior preço. O mercado vai se ajustar. Eles realmente esperavam que o Youtube se preocupasse em não ferir os sentimentos deles (e o bolso) em detrimento dos próprios (O BOLSO)? Mas é o ciclo. A turma fica se achando foda, o Google/Youtube/Facebook ou o que seja, mostra quem manda (o anunciante) e começa o chororô. Em 2012 vimos o mesmo acontecer com os blogueiros. Pressionados pelas agências para apresentarem maior (e não melhor) audiência — um erro grosseiro comum, tentar relacionar audiência de blogs e canais de nicho com a de portais ou da mídia off sem considerar suas características próprias — passaram a fazer tudo pelo views, reduzindo consideravelmente a qualidade de seu conteúdo e, para aumentar seu alcance, ficando reféns do Facebook e de modismos (que afastaram seu leitor fiel, com quem ele tinha maior credibilidade e relevância). Eles permitiram que as agências ditassem as regras, não se impuseram e logo depois se viram queimados pelas mesmas agências que os obrigaram a mudar. Foram esquecidos e muitos deles morreram, definharam sem verba. Toda uma geração de influenciadores, que dominaram a web de 2006 à 2012/2013 ficou para trás. Gente que já produzia conteúdo de qualidade vai ser pouco ou nada afetada por essas mudanças. Castanhari, Não Salvo, Castrezana, Iberê, Jovem Nerd e tantos outros que respeitam a audiência que deram duro pra criar e manter, que optaram pelo caminho mais difícil — criar uma audiência fiel em torno de sua proposta de conteúdo, com conteúdo de qualidade. O Castanhari, por exemplo, que começou em 2012 com um canal focado em abordar desenhos animados, acabou de publicar um vídeo explicando a guerra da Síria, vídeo esse que é longo, sério e que atingiu 20 milhões de visualizações em poucos dias. Sem gritos. Sem palavrões. Sem Nutella ou Amoeba. Agora uma coisa: pessoalmente eu acho LINDO os produtores de conteúdo lixo levarem um tranco. LINDO. Por mim, toda essa turma do “juntei x amoebas”, “enchi a banheira de bosta”, “trolei a minha namorada/mãe/amiga” e coisas do tipo seriam limados. Mas, como eu disse, isso é opinião pessoal (e já a expressei nesse texto AQUI), eles só continuam fazendo — e ganhavam dinheiro com isso — porque existe audiência para esse tipo de bobagem. A verdade é que toda essa turma “grito pra câmera enquanto imito o João Gordo” vai ter que aprender a produzir conteúdo de qualidade. E, não, não sou um babaca que acha que meter um \"filho de uma puta\" bem colocado no meio de um texto merece ser punido, longe de mim. E acho que em determinado momento o Youtube vai se ajustar a isso. Não é o uso, é o exagero. Confesso que já há algum tempo vejo esse ciclo — do surgimento e desaparecimento de Deuses da influência em redes sociais — com muitas restrições. O que os eleva ao panteão das divindades influenciadoras é a moeda com a pior sustentação: a audiência. Em temos onde quase 60% do país tem acesso a internet e o WhatsApp atinge 128 milhões de pessoa, já passou da hora de pensarmos na cauda longa, na credibilidade, na relevância, na capacidade de conversão e não focarmos apenas no alcance. O grande problema aqui é que o dinheiro dita as regras e o dinheiro está na mão dos grandes anunciantes e, consequentemente, na mão das grandes agências. Essa mudança nunca irá partir das agências; lidar com o grande influenciador facilita as coisas. Focam em alguns poucos, que cobram muito e alcançam muito — apesar de pesquisas mostrarem que convertem bem menos que os médios e micro influenciadores. Geralmente eles têm uma empresa séria e burocrática por trás deles, o que facilita a contratação, processos de produção e até mesmo comprovação. É o mais fácil. E, convenhamos, até pouco tempo era o possível. Identificar, ativar e manter relacionamento com milhões de micro-influenciadores, sem um processo ou tecnologia que permitisse isso era um desafio que não cabia exatamente dentro do modelo de negócios da publicidade brasileira, que sobrevive de comissionamento e BV. Eu mesmo estou investindo nisso, pensando redução da importância dos mega influencers e da mídia “rabo balança cachorro”, a Wololo e as tecnologias que estão sendo desenvolvidas por nós estão focadas em micro influenciadores, em seu poder e importância. Estamos certos? O caminho é realmente esse? O tempo dirá. Espero estarmos. Mas, se a melhor forma de se prever o futuro é estudando o passado, avaliando o presente e identificando tendências e ciclos, posso dizer que você, leitor, sempre terá influência sobre seu círculo. Podem mudar as redes sociais, os meios e formatos, mas o fato de que pessoas seguirão tendo influência, relevância e credibilidade junto aos seus irá se manter, afinal isso faz parte do conceito de grupo, de comunidade. A “guerra” iniciada pelo Youtube — forçado pelos seus grandes anunciantes — contra a turma do conteúdo ruim e do “palavrão é vírgula” é apenas um sinal da mudança. A briga vai ser boa? Não, essa história de que David bate Golias é só pra criancinhas. Como bem disse o Cardoso: “Nessa briga do Youtube contra a 5a Série, eu fico do lado do YouTube”. ", "name": "717", "child": "717_1\t717_2\t717_3\t717_4\t717_5", "timestamp": "Apr 11"}