{"parent": "", "title": "Seitas abusivas: o que são, como agem e quais as suas práticas nocivas", "author": "Daniele Cavalcante", "sentences": [{"df9f": "Seitas abusivas: o que são, como agem e quais as suas práticas nocivas"}, {"01c5": "Éramos cerca de 40 pessoas, de várias partes do país, reunidas em uma casa relativamente espaçosa no Rio de Janeiro. Muitos ali eu conhecia apenas através da internet, outros eu nunca ouvira falar a respeito. A maioria eu conhecia muito bem — eu morava com eles havia anos."}, {"b9a3": "Renata** era uma dessas pessoas que eu não conhecia. Viajou de Minas Gerais para um grande encontro da nossa “comunidade”. Vamos chamar assim, pois não tínhamos um nome, e também nos recusávamos a usar termos como “grupo”, “religião”, “igreja”. Seita? Nem pensar!"}, {"f836": "Era um feriado de Dia da Criança. Ou Páscoa. Não importa. Renata, e muitas outras pessoas que participavam das nossas reuniões online e formavam células em outros estados, estava ali, preparando comidas em grande quantidade e organizando o necessário para a reunião."}, {"7710": "Sou uma pessoa de raciocínio lento, então demorava um pouco para entender algumas coisas, e muitas estavam acontecendo ali a cada instante. E uma delas é que Renata tremia. Muito. Mal conseguia carregar garrafas para guardar na geladeira, de modo que precisou de ajuda para uma tarefa tão simples. As pessoas comentavam. Ninguém supunha que Renata sofresse de algum tipo de transtorno de ansiedade."}, {"a2fd": "Durante a reunião, Renata se tornou o centro das atenções quando toda aquela gente a questionava por detalhes pessoais de sua vida, durante toda a madrugada."}, {"b2d6": "Assim ocorria com cada pessoa que fizesse parte da comunidade. Qualquer indício de que você tivesse algum apego à sua família, aos amigos, aos sabores e prazeres mundanos, ou mesmo um relacionamento amoroso, era motivo para questionamentos, sempre na tentativa de te induzir a abdicar dessas coisas. Afinal, se você está lá dentro, já deveria ter deixado tudo isso para trás a fim de dedicar-se apenas aos novos “irmãos”."}, {"bc82": "Abandonar laços familiares e desfazer amizades que atrapalhassem sua nova fé é um requisito, mas o principal é compreender que a sua vida — e suas posses — serve unicamente para servir à comunidade."}, {"5a60": "O que são seitas? Quais são realmente suas práticas? Onde mora o perigo?"}, {"2b58": "Você já leu histórias ou assistiu documentários e filmes sobre seitas bizarras? Elas fazem parte do imaginário popular, graças a casos trágicos que ganharam as páginas dos jornais e causam grande espanto. Algumas são simples casos de charlatanismo; outras terminam em suicídio em massa, e se tornam um grande trauma na região."}, {"8f74": "Todas são uma ameaça em potencial."}, {"6507": "Uma das características mais perigosas é que seitas são sutis. Elas podem até mesmo se denominar como “grupo de apoio”, mas tendem a pedir segredo. “O que fazemos aqui, a sociedade não entenderia e nos perseguiria”, dizem. O mundo não está pronto para a verdade que trazemos”. “Precisamos manter segredo de tudo o que fazemos”."}, {"2643": "Por serem secretas, é difícil saber onde estão e como identificar quando algum parente ou amigo se torna vítima de uma dessas seitas. Não pretendo ser sensacionalista e causar alarde, mas o fato é que quando uma pessoa é “fisgada”, os sinais podem aparecer apenas quando é tarde demais."}, {"2541": "Também não pretendo colocar todas as seitas no mesmo pacote, pois muitas delas são de fato inofensivas e apenas exercem seu direito constitucional ao culto. Meu objetivo é destacar um tipo bem específico: as seitas abusivas."}, {"b19f": "Imagem do filme “Helter Skelter”, sobre a família Manson"}, {"56e3": "Para conceituar melhor, primeiro é preciso desmistificar o conceito de seitas, de modo geral. A religião institucionalizada dominante (cristianismo) e a mídia cercam o assunto com significados que nos afastam da raiz do problema."}, {"a52a": "Por isso, às vezes as seitas não são identificadas como tal, nem identificam a si mesmas dessa forma. Preferem outros nomes, pois “seita” se tornou pejorativo, associado a sangue de bode e pentagramas. Elas querem se afastar das teorias sobre sociedades secretas e de “satanistas”. Algumas adotam nomes próprios e inofensivos; outras, nomes genéricos."}, {"3288": "“Não temos uma denominação, somos apenas pessoas que se uniram por um propósito em comum”."}, {"4a12": "Existem muitas abordagens para definir e até mesmo para encontrar o significado da raiz etimológica da palavra (secta). Os mais aceitos são:"}, {"86d5": "Vale lembrar que o próprio cristianismo, nos tempos dos 12 apóstolos, era chamado de “seita do Caminho” pela religião dominante. Este é um tipo de seita que surge através de um grande líder messiânico."}, {"3ea7": "Devido a exemplos muito negativos, como as seitas que envolveram assassinatos, suicídios, escândalos sexuais e estupros, as religiões afirmam que uma seita é uma distorção religiosa que apresenta doutrinas falsas. Mas para melhor abrangência na nossa abordagem, a interpretação de “seguidor” é mais interessante. Guarde bem esta definição."}, {"0722": "Deixemos de lado, portanto, o pensamento cristão de “falsa doutrina” para abordarmos os grupos que surgem de vários meios, não só os religiosos, e se tornam abusivos."}, {"3ffa": "Ou seja, não levamos em conta a fé particular de cada uma. Queremos falar necessariamente de seitas abusivas; por isso, vamos excluir também da nossa abordagem as seitas políticas e filosóficas, que não se enquadram nas descrições que você verá mais abaixo."}, {"b89c": "Pode ser até mesmo um grupo de apoio de narcóticos anônimos que adota táticas duvidosas de lavagem cerebral para manipular pessoas. Mas isso ficará mais claro durante a leitura. Me acompanhe."}, {"629c": "Na interpretação de “seguidores”, um ou mais indivíduos criam um conjunto de doutrinas e crenças religiosas, políticas ou filosóficas e consegue levar consigo um grupo grande de pessoas. Estes podem ser considerados líderes de uma seita, por mais que eles neguem este título."}, {"270b": "Imagem do filme “Jim Jones, O Pastor do Diabo”"}, {"5476": "O sociólogo e teólogo Peter L. Berger definiu seita como a organização de um grupo contra um meio que consideram hostil ou descrente de algo. Os membros se fecham em um corpo de doutrinas e olham o restante da sociedade como inerentemente má, “cega” ou pecadora."}, {"bd3d": "As seitas religiosas tem um maior potencial de conquistar a devoção e o fanatismo dos seus seguidores, pois incluem uma fé no divino ou em forças ocultas, natureza, ou na própria divindade do ser humano. Isso é um prato cheio para cooptar aqueles que se sentem incapazes diante as dificuldades e dores do mundo."}, {"4e85": "O que são seitas abusivas?"}, {"8621": "São aquelas que fazem promessas, oferecem uma missão ou um propósito, e levam seus membros a guardar segredo sobre suas práticas para, assim, praticar abusos."}, {"b677": "Tudo começa de forma sutil. Em pequenas dosagens, como pedir contribuição financeira, alimentos ou outros tipos de doação para manter o grupo. “Tudo será de todos”, dizem. Com o sucesso das primeiras tentativas, os líderes podem passar a “exigir” cada vez mais dedicação. Às vezes, não será uma ordem expressa, mas um requisito para que o membro atinja o objetivo da seita; por exemplo, alcançar a evolução espiritual."}, {"068b": "Algumas características que podem aparecer:"}, {"4901": "Um líder carismático e persuasivo"}, {"5fab": "Um grupo que funciona na base do segredo tem todo o potencial para ser abusivo. Principalmente se os seus líderes têm conhecimentos sobre psicologia, linguagem, persuasão, neurolinguística, filosofia e outros assuntos do tipo."}, {"d5eb": "Esses conhecimentos ajudam pessoas abusivas a manipular os mais vulneráveis."}, {"b318": "Missão"}, {"6c1e": "As seitas desse tipo costumam ter uma “missão especial”. Candidatos são abordados como se fossem escolhidos para exercer um papel fundamental em tal tarefa."}, {"4731": "Geralmente a missão inclui coisas boas e genéricas, como “levar o amor aos povos” “paz mundial” “evolução do ser humano” “criar uma sociedade justa” “causar a volta de Jesus”."}, {"0c4b": "Isolamento"}, {"b8ec": "Uma seita abusiva provavelmente afastará lentamente os indivíduos de suas famílias e amigos. Será dito que isso é para que possam se dedicar cada vez mais à sua “missão”, como se estivessem se preparando para uma difícil batalha pela frente. Sim, é algo meio “Clube da Luta”."}, {"0ec7": "Algumas pregam que, literalmente, protagonizarão uma batalha contra “eles”, “o mal”, “o sistema”, “os dominadores do mundo”, “os illuminati”, e submetem os membros a um “preparo”."}, {"70fa": "Se os amigos e familiares “não entenderem”, eles são inimigos em potencial, e os membros devem abandoná-los definitivamente. Afinal, “família é aquela que se escolhe”, ou como disse o Cristo, “minha família são aqueles que fazem a vontade de Deus”. Isso deve ser levado ao pé da letra pelos fiéis."}, {"0027": "Visão de mundo"}, {"4920": "Com a alienação, doutrinação e isolamento, os membros são limitados a uma única visão de mundo. Uma interpretação de toda a realidade sob o ponto de vista daquela doutrina."}, {"1a98": "Embora este não seja o problema em si, isso torna os seguidores suscetíveis à liderança, pois é o líder quem trouxe a “revelação” sobre essa visão de mundo. O que ele disser, provavelmente é verdade. Daí, a brecha para os abusos aparece."}, {"3795": "Abstinência"}, {"52be": "Essa preparação para a missão inclui se abster das “coisas do mundo”. Ou seja, coisas agradáveis que podem “comprar” ou “distrair” os combatentes de uma batalha."}, {"634e": "Se você se abster por tempo o suficiente daquilo que lhe corrompe, passará a não gostar de tais coisas, e resistirá a tentações futuras. É uma “reconstrução” do indivíduo “pecaminoso”. Dirão que é bom os membros se prepararem enquanto estamos em “tempos de paz” para que estejam prontos em tempos de batalhas."}, {"9932": "Messianismo"}, {"38a0": "Por fim, é seguro dizer que o messianismo é uma característica comum. Seitas desse tipo tendem a pregar que suas doutrinas são as únicas capazes de mudar o mundo, salvar a humanidade, etc."}, {"6d9b": "O que uma seita abusiva faz?"}, {"a72f": "Imagem do filme “Martha Marcy May Marlene”"}, {"d4f6": "Em 1998, foi fundada no Brasil a seita Comunidade Evangélica Jesus, a Verdade que Marca¹. Eles convenciam os fiéis a doarem tudo o que tinham para conviver em um espaço onde “tudo seria de todos”. Os líderes foram presos em 2015 por submeter membros à condição análoga à de escravo, tráfico de pessoas, estelionato, organização criminosa, falsidade ideológica e lavagem de dinheiro. Com as doações, eles compravam terrenos, estabelecimentos comerciais e automóveis."}, {"816e": "O norte-americano Victor Arden Barnard foi acusado por 59 abusos sexuais como participante da seita River Road Fellowship² localizada no estado americano de Minnesota. As jovens abusadas tinham entre 13 e 15 anos de idade."}, {"99a2": "Em 1994, a ordem francesa Solar Temple foi responsável por um caso de assassinato de uma criança de três anos de idade, porque acreditava-se que ele seria o anti-cristo. Ele foi morto com golpes de estaca, no Canadá. Depois, na Suíça, 15 membros do círculo interno cometeram suicídio com veneno, 30 foram mortos por balas ou sufocados e outros 8 foram mortos por outras causas. 16 pessoas foram encontrados na floresta de Vercors, na região francesa do Isére."}, {"8878": "A França é um país que tem um bom histórico com seitas e no combate aos perigos que elas podem trazer. Em 2006, o jornal francês “Le Parisien” publicou que 60 mil crianças são manipuladas por diferentes grupos sectários no país e que “são vítimas de graves maus-tratos psicológicos, físicos e às vezes sexuais”."}, {"76dd": "Entre as seitas mencionadas pela publicação, estava a Tabitha’s Place³, que fazia das crianças “vítimas da ideologia de seus pais, que impõem a elas o estilo de vida dos primeiros cristãos”."}, {"b2c9": "Em 2001 os pais de um bebê de 19 meses, membros do Tabita’s Place, foram condenados a doze anos de prisão por deixarem a criança morrer ao impedir que recebesse o tratamento médico adequado, por ser contrário às normas da seita. Outros 19 membros desta “comunidade” foram condenados à prisão por se negarem a escolarizar e a vacinar seus filhos."}, {"4896": "Com o amplo histórico no país, em junho de 2000 o Parlamento Francês aprovou uma lei que prevê detenção e multa para membros de Igrejas e Seitas que pudessem ser enquadradas na prática de “manipulação mental” e causar um “estado de sujeição” físico ou psicológico."}, {"005f": "Na Inglaterra, é proibida publicidade que faça referência a um estado de sofrimento, do tipo “ Você que está sofrendo, procure a Igreja…”como incentivo para convidar alguém a uma reunião ou culto 4."}, {"0423": "Como é possível exemplificar em uma extensiva lista de casos famosos, as seitas abusivas têm uma série de práticas, muitas delas criminosas. Vamos apontar algumas características comuns. Mesmo em menor grau que os exemplos acima, elas podem servir como um sinal de que alguém esteja sofrendo algum tipo de abuso no grupo que frequenta."}, {"c690": "Imagem do filme “Seita de Fanáticos”"}, {"67b6": "Talvez você considere um ou dois itens abaixo não-abusivos, mas importa considerar o conjunto como um todo. Vale lembrar que muitas delas podem parecer grupos inofensivos e bem-intencionados, mas isso não significa que não cometam abusos físicos e/ou psicológicos."}, {"f3a4": "Um alerta"}, {"bd6e": "Este não é um assunto para se ignorar. Seitas abusivas ainda existem às centenas, talvez milhares, aqui mesmo no Brasil, e sabem ser invisíveis. Não só precisamos ficar atentos para não cair em seus discursos, mas também para evitar que parentes e amigos sejam seduzidos por suas promessas, ideologias e carisma."}, {"0394": "Como a seita costuma isolar os seguidores e aprisioná-los em uma visão única de mundo, o pensamento entre todos os membros tende a ser unificado, assim como o comportamento, linguajar, preferências, crenças, ideologias, etc. E, no processo, as características mais individuais são anuladas."}, {"2ef4": "Caso alguém não se adapte a essa unificação ideológica e de comportamento, inevitavelmente carregará sobre si um peso maior; a seita jogará culpa sobre culpa, e com essa culpa haverá espaço para os maiores abusos na forma de castigos e técnicas de “correção”. E, caso ainda não ocorra a adaptação, vem o rompimento."}, {"37bc": "Muitas vezes, esse rompimento é traumático, marcado por mais julgamentos e condenação. Ao deixar a seita ou culto, essa pessoa dilacerada carregará dupla culpa — aquela que a levou a se submeter aos abusos e aquela despejada sobre si por ter abandonado “a fé”, “o único caminho”, a “única verdade”."}, {"3384": "Paranoias e medos podem segui-la por bastante tempo, além de uma série de consequências psicológicas, e será difícil recuperar uma mente consumida por seitas abusivas. Por isso, a última coisa que ela precisa é de mais culpabilização por parte da família e amigos."}, {"0435": "*Comecei a escrever sobre o tema em 2016 a partir de minhas próprias experiências e este novo texto é o primeiro de um “reboot” da série original."}, {"83bd": "**Nome fictício"}], "content": "Seitas abusivas: o que são, como agem e quais as suas práticas nocivas Éramos cerca de 40 pessoas, de várias partes do país, reunidas em uma casa relativamente espaçosa no Rio de Janeiro. Muitos ali eu conhecia apenas através da internet, outros eu nunca ouvira falar a respeito. A maioria eu conhecia muito bem — eu morava com eles havia anos. Renata** era uma dessas pessoas que eu não conhecia. Viajou de Minas Gerais para um grande encontro da nossa “comunidade”. Vamos chamar assim, pois não tínhamos um nome, e também nos recusávamos a usar termos como “grupo”, “religião”, “igreja”. Seita? Nem pensar! Era um feriado de Dia da Criança. Ou Páscoa. Não importa. Renata, e muitas outras pessoas que participavam das nossas reuniões online e formavam células em outros estados, estava ali, preparando comidas em grande quantidade e organizando o necessário para a reunião. Sou uma pessoa de raciocínio lento, então demorava um pouco para entender algumas coisas, e muitas estavam acontecendo ali a cada instante. E uma delas é que Renata tremia. Muito. Mal conseguia carregar garrafas para guardar na geladeira, de modo que precisou de ajuda para uma tarefa tão simples. As pessoas comentavam. Ninguém supunha que Renata sofresse de algum tipo de transtorno de ansiedade. Durante a reunião, Renata se tornou o centro das atenções quando toda aquela gente a questionava por detalhes pessoais de sua vida, durante toda a madrugada. Assim ocorria com cada pessoa que fizesse parte da comunidade. Qualquer indício de que você tivesse algum apego à sua família, aos amigos, aos sabores e prazeres mundanos, ou mesmo um relacionamento amoroso, era motivo para questionamentos, sempre na tentativa de te induzir a abdicar dessas coisas. Afinal, se você está lá dentro, já deveria ter deixado tudo isso para trás a fim de dedicar-se apenas aos novos “irmãos”. Abandonar laços familiares e desfazer amizades que atrapalhassem sua nova fé é um requisito, mas o principal é compreender que a sua vida — e suas posses — serve unicamente para servir à comunidade. O que são seitas? Quais são realmente suas práticas? Onde mora o perigo? Você já leu histórias ou assistiu documentários e filmes sobre seitas bizarras? Elas fazem parte do imaginário popular, graças a casos trágicos que ganharam as páginas dos jornais e causam grande espanto. Algumas são simples casos de charlatanismo; outras terminam em suicídio em massa, e se tornam um grande trauma na região. Todas são uma ameaça em potencial. Uma das características mais perigosas é que seitas são sutis. Elas podem até mesmo se denominar como “grupo de apoio”, mas tendem a pedir segredo. “O que fazemos aqui, a sociedade não entenderia e nos perseguiria”, dizem. O mundo não está pronto para a verdade que trazemos”. “Precisamos manter segredo de tudo o que fazemos”. Por serem secretas, é difícil saber onde estão e como identificar quando algum parente ou amigo se torna vítima de uma dessas seitas. Não pretendo ser sensacionalista e causar alarde, mas o fato é que quando uma pessoa é “fisgada”, os sinais podem aparecer apenas quando é tarde demais. Também não pretendo colocar todas as seitas no mesmo pacote, pois muitas delas são de fato inofensivas e apenas exercem seu direito constitucional ao culto. Meu objetivo é destacar um tipo bem específico: as seitas abusivas. Imagem do filme “Helter Skelter”, sobre a família Manson Para conceituar melhor, primeiro é preciso desmistificar o conceito de seitas, de modo geral. A religião institucionalizada dominante (cristianismo) e a mídia cercam o assunto com significados que nos afastam da raiz do problema. Por isso, às vezes as seitas não são identificadas como tal, nem identificam a si mesmas dessa forma. Preferem outros nomes, pois “seita” se tornou pejorativo, associado a sangue de bode e pentagramas. Elas querem se afastar das teorias sobre sociedades secretas e de “satanistas”. Algumas adotam nomes próprios e inofensivos; outras, nomes genéricos. “Não temos uma denominação, somos apenas pessoas que se uniram por um propósito em comum”. Existem muitas abordagens para definir e até mesmo para encontrar o significado da raiz etimológica da palavra (secta). Os mais aceitos são: Vale lembrar que o próprio cristianismo, nos tempos dos 12 apóstolos, era chamado de “seita do Caminho” pela religião dominante. Este é um tipo de seita que surge através de um grande líder messiânico. Devido a exemplos muito negativos, como as seitas que envolveram assassinatos, suicídios, escândalos sexuais e estupros, as religiões afirmam que uma seita é uma distorção religiosa que apresenta doutrinas falsas. Mas para melhor abrangência na nossa abordagem, a interpretação de “seguidor” é mais interessante. Guarde bem esta definição. Deixemos de lado, portanto, o pensamento cristão de “falsa doutrina” para abordarmos os grupos que surgem de vários meios, não só os religiosos, e se tornam abusivos. Ou seja, não levamos em conta a fé particular de cada uma. Queremos falar necessariamente de seitas abusivas; por isso, vamos excluir também da nossa abordagem as seitas políticas e filosóficas, que não se enquadram nas descrições que você verá mais abaixo. Pode ser até mesmo um grupo de apoio de narcóticos anônimos que adota táticas duvidosas de lavagem cerebral para manipular pessoas. Mas isso ficará mais claro durante a leitura. Me acompanhe. Na interpretação de “seguidores”, um ou mais indivíduos criam um conjunto de doutrinas e crenças religiosas, políticas ou filosóficas e consegue levar consigo um grupo grande de pessoas. Estes podem ser considerados líderes de uma seita, por mais que eles neguem este título. Imagem do filme “Jim Jones, O Pastor do Diabo” O sociólogo e teólogo Peter L. Berger definiu seita como a organização de um grupo contra um meio que consideram hostil ou descrente de algo. Os membros se fecham em um corpo de doutrinas e olham o restante da sociedade como inerentemente má, “cega” ou pecadora. As seitas religiosas tem um maior potencial de conquistar a devoção e o fanatismo dos seus seguidores, pois incluem uma fé no divino ou em forças ocultas, natureza, ou na própria divindade do ser humano. Isso é um prato cheio para cooptar aqueles que se sentem incapazes diante as dificuldades e dores do mundo. O que são seitas abusivas? São aquelas que fazem promessas, oferecem uma missão ou um propósito, e levam seus membros a guardar segredo sobre suas práticas para, assim, praticar abusos. Tudo começa de forma sutil. Em pequenas dosagens, como pedir contribuição financeira, alimentos ou outros tipos de doação para manter o grupo. “Tudo será de todos”, dizem. Com o sucesso das primeiras tentativas, os líderes podem passar a “exigir” cada vez mais dedicação. Às vezes, não será uma ordem expressa, mas um requisito para que o membro atinja o objetivo da seita; por exemplo, alcançar a evolução espiritual. Algumas características que podem aparecer: Um líder carismático e persuasivo Um grupo que funciona na base do segredo tem todo o potencial para ser abusivo. Principalmente se os seus líderes têm conhecimentos sobre psicologia, linguagem, persuasão, neurolinguística, filosofia e outros assuntos do tipo. Esses conhecimentos ajudam pessoas abusivas a manipular os mais vulneráveis. Missão As seitas desse tipo costumam ter uma “missão especial”. Candidatos são abordados como se fossem escolhidos para exercer um papel fundamental em tal tarefa. Geralmente a missão inclui coisas boas e genéricas, como “levar o amor aos povos” “paz mundial” “evolução do ser humano” “criar uma sociedade justa” “causar a volta de Jesus”. Isolamento Uma seita abusiva provavelmente afastará lentamente os indivíduos de suas famílias e amigos. Será dito que isso é para que possam se dedicar cada vez mais à sua “missão”, como se estivessem se preparando para uma difícil batalha pela frente. Sim, é algo meio “Clube da Luta”. Algumas pregam que, literalmente, protagonizarão uma batalha contra “eles”, “o mal”, “o sistema”, “os dominadores do mundo”, “os illuminati”, e submetem os membros a um “preparo”. Se os amigos e familiares “não entenderem”, eles são inimigos em potencial, e os membros devem abandoná-los definitivamente. Afinal, “família é aquela que se escolhe”, ou como disse o Cristo, “minha família são aqueles que fazem a vontade de Deus”. Isso deve ser levado ao pé da letra pelos fiéis. Visão de mundo Com a alienação, doutrinação e isolamento, os membros são limitados a uma única visão de mundo. Uma interpretação de toda a realidade sob o ponto de vista daquela doutrina. Embora este não seja o problema em si, isso torna os seguidores suscetíveis à liderança, pois é o líder quem trouxe a “revelação” sobre essa visão de mundo. O que ele disser, provavelmente é verdade. Daí, a brecha para os abusos aparece. Abstinência Essa preparação para a missão inclui se abster das “coisas do mundo”. Ou seja, coisas agradáveis que podem “comprar” ou “distrair” os combatentes de uma batalha. Se você se abster por tempo o suficiente daquilo que lhe corrompe, passará a não gostar de tais coisas, e resistirá a tentações futuras. É uma “reconstrução” do indivíduo “pecaminoso”. Dirão que é bom os membros se prepararem enquanto estamos em “tempos de paz” para que estejam prontos em tempos de batalhas. Messianismo Por fim, é seguro dizer que o messianismo é uma característica comum. Seitas desse tipo tendem a pregar que suas doutrinas são as únicas capazes de mudar o mundo, salvar a humanidade, etc. O que uma seita abusiva faz? Imagem do filme “Martha Marcy May Marlene” Em 1998, foi fundada no Brasil a seita Comunidade Evangélica Jesus, a Verdade que Marca¹. Eles convenciam os fiéis a doarem tudo o que tinham para conviver em um espaço onde “tudo seria de todos”. Os líderes foram presos em 2015 por submeter membros à condição análoga à de escravo, tráfico de pessoas, estelionato, organização criminosa, falsidade ideológica e lavagem de dinheiro. Com as doações, eles compravam terrenos, estabelecimentos comerciais e automóveis. O norte-americano Victor Arden Barnard foi acusado por 59 abusos sexuais como participante da seita River Road Fellowship² localizada no estado americano de Minnesota. As jovens abusadas tinham entre 13 e 15 anos de idade. Em 1994, a ordem francesa Solar Temple foi responsável por um caso de assassinato de uma criança de três anos de idade, porque acreditava-se que ele seria o anti-cristo. Ele foi morto com golpes de estaca, no Canadá. Depois, na Suíça, 15 membros do círculo interno cometeram suicídio com veneno, 30 foram mortos por balas ou sufocados e outros 8 foram mortos por outras causas. 16 pessoas foram encontrados na floresta de Vercors, na região francesa do Isére. A França é um país que tem um bom histórico com seitas e no combate aos perigos que elas podem trazer. Em 2006, o jornal francês “Le Parisien” publicou que 60 mil crianças são manipuladas por diferentes grupos sectários no país e que “são vítimas de graves maus-tratos psicológicos, físicos e às vezes sexuais”. Entre as seitas mencionadas pela publicação, estava a Tabitha’s Place³, que fazia das crianças “vítimas da ideologia de seus pais, que impõem a elas o estilo de vida dos primeiros cristãos”. Em 2001 os pais de um bebê de 19 meses, membros do Tabita’s Place, foram condenados a doze anos de prisão por deixarem a criança morrer ao impedir que recebesse o tratamento médico adequado, por ser contrário às normas da seita. Outros 19 membros desta “comunidade” foram condenados à prisão por se negarem a escolarizar e a vacinar seus filhos. Com o amplo histórico no país, em junho de 2000 o Parlamento Francês aprovou uma lei que prevê detenção e multa para membros de Igrejas e Seitas que pudessem ser enquadradas na prática de “manipulação mental” e causar um “estado de sujeição” físico ou psicológico. Na Inglaterra, é proibida publicidade que faça referência a um estado de sofrimento, do tipo “ Você que está sofrendo, procure a Igreja…”como incentivo para convidar alguém a uma reunião ou culto 4. Como é possível exemplificar em uma extensiva lista de casos famosos, as seitas abusivas têm uma série de práticas, muitas delas criminosas. Vamos apontar algumas características comuns. Mesmo em menor grau que os exemplos acima, elas podem servir como um sinal de que alguém esteja sofrendo algum tipo de abuso no grupo que frequenta. Imagem do filme “Seita de Fanáticos” Talvez você considere um ou dois itens abaixo não-abusivos, mas importa considerar o conjunto como um todo. Vale lembrar que muitas delas podem parecer grupos inofensivos e bem-intencionados, mas isso não significa que não cometam abusos físicos e/ou psicológicos. Um alerta Este não é um assunto para se ignorar. Seitas abusivas ainda existem às centenas, talvez milhares, aqui mesmo no Brasil, e sabem ser invisíveis. Não só precisamos ficar atentos para não cair em seus discursos, mas também para evitar que parentes e amigos sejam seduzidos por suas promessas, ideologias e carisma. Como a seita costuma isolar os seguidores e aprisioná-los em uma visão única de mundo, o pensamento entre todos os membros tende a ser unificado, assim como o comportamento, linguajar, preferências, crenças, ideologias, etc. E, no processo, as características mais individuais são anuladas. Caso alguém não se adapte a essa unificação ideológica e de comportamento, inevitavelmente carregará sobre si um peso maior; a seita jogará culpa sobre culpa, e com essa culpa haverá espaço para os maiores abusos na forma de castigos e técnicas de “correção”. E, caso ainda não ocorra a adaptação, vem o rompimento. Muitas vezes, esse rompimento é traumático, marcado por mais julgamentos e condenação. Ao deixar a seita ou culto, essa pessoa dilacerada carregará dupla culpa — aquela que a levou a se submeter aos abusos e aquela despejada sobre si por ter abandonado “a fé”, “o único caminho”, a “única verdade”. Paranoias e medos podem segui-la por bastante tempo, além de uma série de consequências psicológicas, e será difícil recuperar uma mente consumida por seitas abusivas. Por isso, a última coisa que ela precisa é de mais culpabilização por parte da família e amigos. *Comecei a escrever sobre o tema em 2016 a partir de minhas próprias experiências e este novo texto é o primeiro de um “reboot” da série original. **Nome fictício ", "name": "719", "child": "719_1\t719_2719_1\t719_2719_1\t719_2719_1\t719_2", "timestamp": "Apr 5"}