{"parent": "", "title": "How I Detect Fake News", "author": "Tim O'Reilly", "sentences": [{"a910": "Fake maps claiming to correlate crime rates and Democratic votes, circulated via email."}, {"2aca": "How I Detect Fake News"}, {"3daa": "How I traced the falsity of one internet meme, and what that teaches us about how an algorithm might do it"}, {"e1c6": "I have a brother who is a big Donald Trump fan, and he frequently sends me articles from various right-wing media sources. Last week, he sent me a variant of the image above."}, {"a94e": "I immediately consulted Snopes, the fact checking site for internet hoaxes, and discovered that it was, as I expected, fake. According to Snopes, these are actually both electoral maps. Per Snopes, “On 11 November 2016, the Facebook page “Subject Politics” published two maps purportedly comparing the results of the 2016 U.S. presidential election with the 2013 crime rate in in the U.S…. The map pictured on the bottom actually shows a 2012 electoral map that was created by Mark Newman from the Department of Physics and Center for the Study of Complex Systems at the University of Michigan.” Snopes was unable to verify the source of the first map, but concluded (presumably by comparing with known electoral maps) that it is in fact an incomplete electoral map from the 2016 election."}, {"d2fa": "Snopes, which uses human editors for fact checking, does a good job, but they can’t find every fake news story. Still, when a reputable fact-checking organization like Snopes or Politifact identifies a story as false, that’s a pretty good sign. And in fact, the fake news story has been taken down on Facebook, presumably in response."}, {"6265": "Facebook message that now shows for the link provided by Snopes to the original source of the hoax."}, {"5a51": "Continuing my research, I used Google to search for other sources that might provide more insight on the relationship between the electoral map and crime rates. I quickly found this 2013 article from Business Insider, Nine Maps That Show How Americans Commit Crime. It shows a very different picture."}, {"5ea0": "Data on violent crime per one hundred thousand people, from the FBI Uniform Crime Report, 2012"}, {"eaa5": "Since Business Insider told me the source of the data (the FBI Uniform Crime Report) I could go verify it for myself. Sure enough, the data on the FBI site matched the Business Insider map."}, {"a769": "I tell this story of two maps to emphasize that when people are discussing the truth or falsity of news, and the responsibility of sites like Facebook, Google, and Twitter to help identify it, they somehow think that determining “truth” or “falsity” is something that only humans can do. But as this example shows, there are many signals of likely truth or falsity that can be verified algorithmically by a computer, often more quickly and thoroughly than they can be verified by humans:"}, {"49e8": "Note that when fake news is detected, there are a number of possible ways to respond."}, {"ec09": "As I wrote in my first article on the topic of fake news, Media in the Age of Algorithms, “The essence of algorithm design is not to eliminate all error, but to make results robust in the face of error.” Much as we stop pandemics by finding infections at their source and keeping them from finding new victims, it isn’t necessary to eliminate all fake news, but only to limit its spread."}], "content": "Fake maps claiming to correlate crime rates and Democratic votes, circulated via email. How I Detect Fake News How I traced the falsity of one internet meme, and what that teaches us about how an algorithm might do it I have a brother who is a big Donald Trump fan, and he frequently sends me articles from various right-wing media sources. Last week, he sent me a variant of the image above. I immediately consulted Snopes, the fact checking site for internet hoaxes, and discovered that it was, as I expected, fake. According to Snopes, these are actually both electoral maps. Per Snopes, “On 11 November 2016, the Facebook page “Subject Politics” published two maps purportedly comparing the results of the 2016 U.S. presidential election with the 2013 crime rate in in the U.S…. The map pictured on the bottom actually shows a 2012 electoral map that was created by Mark Newman from the Department of Physics and Center for the Study of Complex Systems at the University of Michigan.” Snopes was unable to verify the source of the first map, but concluded (presumably by comparing with known electoral maps) that it is in fact an incomplete electoral map from the 2016 election. Snopes, which uses human editors for fact checking, does a good job, but they can’t find every fake news story. Still, when a reputable fact-checking organization like Snopes or Politifact identifies a story as false, that’s a pretty good sign. And in fact, the fake news story has been taken down on Facebook, presumably in response. Facebook message that now shows for the link provided by Snopes to the original source of the hoax. Continuing my research, I used Google to search for other sources that might provide more insight on the relationship between the electoral map and crime rates. I quickly found this 2013 article from Business Insider, Nine Maps That Show How Americans Commit Crime. It shows a very different picture. Data on violent crime per one hundred thousand people, from the FBI Uniform Crime Report, 2012 Since Business Insider told me the source of the data (the FBI Uniform Crime Report) I could go verify it for myself. Sure enough, the data on the FBI site matched the Business Insider map. I tell this story of two maps to emphasize that when people are discussing the truth or falsity of news, and the responsibility of sites like Facebook, Google, and Twitter to help identify it, they somehow think that determining “truth” or “falsity” is something that only humans can do. But as this example shows, there are many signals of likely truth or falsity that can be verified algorithmically by a computer, often more quickly and thoroughly than they can be verified by humans: Note that when fake news is detected, there are a number of possible ways to respond. As I wrote in my first article on the topic of fake news, Media in the Age of Algorithms, “The essence of algorithm design is not to eliminate all error, but to make results robust in the face of error.” Much as we stop pandemics by finding infections at their source and keeping them from finding new victims, it isn’t necessary to eliminate all fake news, but only to limit its spread. ", "name": "737", "child": "737_1\t737_2\t737_3\t737_4\t737_5\t737_6\t737_7\t737_8\t737_9\t737_10\t737_11\t737_12\t737_13\t737_14\t737_15\t737_16\t737_17\t737_18\t737_19\t737_20\t737_21\t737_22\t737_23\t737_24\t737_25", "timestamp": "Nov 23, 2016"}