{"parent": "", "title": "Top 5 iOS Libraries — April 2017", "author": "COBE Team", "sentences": [{"9848": "Top 5 iOS Libraries — April 2017"}, {"e43f": "If you have been struggling with animations lately, or maybe if you’ve had problems filling out a tableview content, you’ve come to the right place. The April list of the best iOS libraries is here! And if you like what we are doing here, don’t forget to click on the ❤ on the side. :)"}, {"3569": "Starting this month, we will also share our favorite JavaScript libraries! See the first list here:"}, {"42a0": "Top 5 JavaScript Libraries — April 2017Choosing the best Android and iOS libraries each month has already become some kind of a ritual for COBE mobile devs…medium.cobeisfresh.com"}, {"7548": "Animations — our favorite things to hate! Remember those lovely headaches from the last implementation of a badass animation? Fortunately, the web is full of animation libraries that can provide some nice prebuilt animations. The only problem is that we don’t always want the exact same animation, and combining your custom animations with prebuilt library animations can be a real pain."}, {"8031": "Luckily, there is one library handling this issue quite well — Spruce. The code coverage of this lib is stunning 97 percent so be sure to check it out."}, {"ea1e": "2. Transition"}, {"c4fd": "Even though the name might tell a different story, Transition is not just another transition handling library. It offers easy to use principles of single responsibility components. This means that you define your animations and interactions, and then Transition ties them all together. Pod Transition in your pod file and start making some crazy new transitions with this library!"}, {"744b": "3. CHIPageControl"}, {"3c8d": "Ever wanted to animate a boring UIPage Control? New library made by ChiliLabs is just what you need. For now, you can choose between 8 stylish controls, all of which are animated, and very easy to implement. Just drop UIView and set its class to be one of CHIPageControls. After that, you are ready to go. Give it a try."}, {"65b1": "4. Request Permission"}, {"1208": "Permission requests can be annoying to users. Chances of obtaining a permit might go up if the dialog looks nice. With Request Permission, your permission dialogs will look much more appealing, and with them, your permission requests might have a higher chance of being accepted."}, {"303c": "This module is based on another library made by the same user, called Sparrow, so to use RequestPermission you only need a few lines of code. Simple as that."}, {"af04": "5. ReverseExtension"}, {"c984": "It might prove difficult to fill a tableview content from the bottom of the screen. So what would be the logic solution? Just flip it 180°! That’s exactly what ReverseExtension does — it rotates UITableView and UITableViewCell upside down. Now your cells appear from below!"}, {"8ac6": "And if you want to revert the changes, you can rollback to the normal behaviour by removing the namespace. ReverseExtension is also available through CocoaPods and Carthage."}, {"091e": "That’s all folks! Of course, there is an Android libraries list too, so don’t forget to check it out. :) Also, starting this month, we will share our favorite JavaScript libraries! As before, if you have your own recommendations, leave them in the comments and we will try to include them in the upcoming articles. Check some other articles from COBE:"}, {"6003": "How to Win a Hackathon — Tips & TricksSo far, I’ve participated in seven different Hackathons — four national and three international. Some of them were…medium.cobeisfresh.com"}, {"03dc": "Top 5 JavaScript Libraries — April 2017Choosing the best Android and iOS libraries each month has already become some kind of a ritual for COBE mobile devs…medium.cobeisfresh.com"}], "content": "Top 5 iOS Libraries — April 2017 If you have been struggling with animations lately, or maybe if you’ve had problems filling out a tableview content, you’ve come to the right place. The April list of the best iOS libraries is here! And if you like what we are doing here, don’t forget to click on the ❤ on the side. :) Starting this month, we will also share our favorite JavaScript libraries! See the first list here: Top 5 JavaScript Libraries — April 2017Choosing the best Android and iOS libraries each month has already become some kind of a ritual for COBE mobile devs…medium.cobeisfresh.com Animations — our favorite things to hate! Remember those lovely headaches from the last implementation of a badass animation? Fortunately, the web is full of animation libraries that can provide some nice prebuilt animations. The only problem is that we don’t always want the exact same animation, and combining your custom animations with prebuilt library animations can be a real pain. Luckily, there is one library handling this issue quite well — Spruce. The code coverage of this lib is stunning 97 percent so be sure to check it out. 2. Transition Even though the name might tell a different story, Transition is not just another transition handling library. It offers easy to use principles of single responsibility components. This means that you define your animations and interactions, and then Transition ties them all together. Pod Transition in your pod file and start making some crazy new transitions with this library! 3. CHIPageControl Ever wanted to animate a boring UIPage Control? New library made by ChiliLabs is just what you need. For now, you can choose between 8 stylish controls, all of which are animated, and very easy to implement. Just drop UIView and set its class to be one of CHIPageControls. After that, you are ready to go. Give it a try. 4. Request Permission Permission requests can be annoying to users. Chances of obtaining a permit might go up if the dialog looks nice. With Request Permission, your permission dialogs will look much more appealing, and with them, your permission requests might have a higher chance of being accepted. This module is based on another library made by the same user, called Sparrow, so to use RequestPermission you only need a few lines of code. Simple as that. 5. ReverseExtension It might prove difficult to fill a tableview content from the bottom of the screen. So what would be the logic solution? Just flip it 180°! That’s exactly what ReverseExtension does — it rotates UITableView and UITableViewCell upside down. Now your cells appear from below! And if you want to revert the changes, you can rollback to the normal behaviour by removing the namespace. ReverseExtension is also available through CocoaPods and Carthage. That’s all folks! Of course, there is an Android libraries list too, so don’t forget to check it out. :) Also, starting this month, we will share our favorite JavaScript libraries! As before, if you have your own recommendations, leave them in the comments and we will try to include them in the upcoming articles. Check some other articles from COBE: How to Win a Hackathon — Tips & TricksSo far, I’ve participated in seven different Hackathons — four national and three international. Some of them were…medium.cobeisfresh.com Top 5 JavaScript Libraries — April 2017Choosing the best Android and iOS libraries each month has already become some kind of a ritual for COBE mobile devs…medium.cobeisfresh.com ", "name": "767", "child": "767_1\t767_2\t767_3\t767_4\t767_5767_1\t767_2\t767_3\t767_4\t767_5", "timestamp": "Apr 3"}