{"parent": "", "title": "The Real NBA Season Awards", "author": "serge", "sentences": [{"6151": "The Real NBA Season Awards"}, {"08b4": "Because only so many times we can debate the Russell Westbrook vs. James Harden debate without it getting irrelevant until the actual vote."}, {"b009": "Flickr | Sean Davis"}, {"7ada": "I am going to go on the record and say something that we’re all thinking. Something that we’ve all known for a long time, but for the purposes of intrigue and notions of instant gratification decided to largely ignore or not speak about. That’s right, I’m going to be that guy (you know who you are Greg). Regular season awards do not matter."}, {"4b35": "Okay, sure they’re a snapshot of either individual or team greatness over a stretch of 82 games and they’re an indicate of performance levels for that particular year. You know, something we’ll all forget next season and only NBA historians will get slightly aroused now 5 seasons from now. Also, probably something that Susan from accounting will use in her pointless argument of who’s better, Kobe Bryant or LeBron James without ever having actually watched either play consistently. Otherwise, who cares?"}, {"2f5c": "Allow me to expand. We all know LeBron James is the best basketball player on this and eight other planets (long live Pluto). If there was an Earth wide catastrophe and we could only save two people to blast into space Kal El style in hopes that they find a new civilization and get adopted into it, I’m choosing LeBron James and Serena Williams. I don’t want whatever aliens find our survival probe to think humanity was some sort of collection of punk-ass tricks. I want them to know we were the goddamn shit. No one communicates that more than the superhuman entities of LeBron James and Serena Williams. Yet, despite being the best player in the game of basketball LeBron is fourth (!!!) in the MVP race. Which is still incredible in its own right."}, {"9f73": "Same goes for coach of the year. Realistically we all know that Pop and Carlisle should just pass that award around like a hot potato season to season depending on a variety of factors such as “how many family members did one of them have to threaten to turn Yogi Ferrell into a productive basketball player.” As it stands Mike D’Antoni will most likely walk home with this one for putting basketball on steroids but then also forcing it to take crack."}, {"4a5f": "The NBA needs some real awards. It’s cool though, because we here at 16 Wins A Ring got you covered."}, {"2bf6": "The Grand Warlock Disciple of Rick Carlisle Award"}, {"20c7": "This award generally goes to the coach and/or organization that is able to McGyver a competent NBA team out of pieces of string, scrap metal and one, maybe one and a half competent basketball players. You would think that given my affection for Gregg Popovich (I love him more than my own father, in fact, he might be my father now through association) will be the award’s namesake, but also remember that time Rick Carlisle took a cart of manure driven by Dirk Nowitzki to the NBA Finals."}, {"ad10": "No one has done more with less this year than coach Erik Spoelstra (please pause for crying applause from Allana Tachauer at this juncture). He has taken an at best mediocre Miami team on paper, a collection of scrappy but neglected basketball players and turned them into a team that no one really wants to see in the first round. That seems like an extreme accomplishment. He has Waiters Island teeming with tourists like it’s a goddamn metropolis. He reignited Goran Dragic’s career and he let James Johnson loose on the NBA (consequently I think he recently got away with manslaughter)."}, {"d212": "They’re literally the Mighty Ducks of basketball right now. And now good luck of getting the side-by-side of Emilio Estevez and Coach Spo out of your head."}, {"9d62": "Winner: Coach Erik Spoelstra"}, {"49c2": "Why Can’t Bismack Biyombo Help The Magic Defend?Bismack Biyombo is supposed to be an all-defense quality center. Why hasn’t he helped Orlando’s defense?16winsaring.com"}, {"244d": "The Infinite Pit of Sadness Awards"}, {"1232": "At one point of the season it looked that Brooklyn Nets would run away with this one for the third straight year running, but the Orlando Magic have entered the conversation very rapidly. Brooklyn tried to salvage a terrible situation by making it a merely… sad situation. And none of their woes were inflicted by their current GM. Which grants them a bit of parity in this category."}, {"8430": "The Magic on the other hand continued their proud tradition of “what the hell are they doing” approach to basketball management. They followed up the departure of Tobias Harris with trading Victor Oladipo for Serge Ibaka to pair with Jeff Green and Bismack Biyombo, which makes me think they wildly misinterpreted the notion of position-less basketball. Then they flipped Ibaka for spare change effectively giving them to Toronto for ten cents on the dollar. And if that wasn’t enough, a recent (now deleted tweet) inadvertently revealed Magic’s off-season targets, robbing them of any leverage they may have had on the board."}, {"98fd": "Winner: Orlando Magic"}, {"c547": "The Category Five Devastation Hurricane on the Court Award"}, {"6a5e": "I feel like it’s unnecessary for me to even go on here because you know who this is. Only one player makes playing the sport of basketball look like the running of the bulls in the middle of Pamplona. Only one NBA player can subtweet an entire league with a devastating dunk. Only one player has subverted the idea of time and space to finish the most complete eradication of the most absurd NBA individual record to date. Only one player is scarier to face in real life than in your darkest nightmare."}, {"e3a8": "Winner: Russell Westbrook"}, {"ecbf": "The Riverdale Teenage Drama of the Year Award"}, {"1a2f": "I love LeBron James the basketball player. LeBron James the basketball player is what our version of the Hercules legend will be based on and retold 2,000 years from now. LeBron James the person I am still 50/50 on. The biggest question mark is that James insists to treat each regular season like it’s The Godfather. The problem is, he lacks the subtlety of Michael and chooses to operate with the bluntness of Sonny, before running headlong into an ambush set up by his own previous decisions."}, {"c998": "It’s hard to feel bad for a man who’s built half man half prototype android from the year 2044 to teach us about basketball when he also chooses to complain about unfair treatment, brush off teammates, and criticize team decision making forgetting that it’s his agent, friends and confidantes that have buried Cleveland in financial insecurity. But this is a team award, and as we’ve learned lately LeBron is greater than any team he plays on, he is that team."}, {"a842": "Winner: Cleveland Cavaliers"}, {"3831": "A Woman Can Succeed As Head Coach In The NBA, But We Are Not ReadyAs some societal barriers crumble and gender-equality is prioritized, a female head coach in the NBA is no longer just…16winsaring.com"}, {"04b2": "The Pour One Out for Award"}, {"4431": "This award is reserved for the particularly tortured soul marooned by the decisions (or lack thereof) of the management team or the coaching stuff to produce any sort of viable reinforcements of support. In the past this award has gone to Anthony Davis for being forced to play with the squad that’s basically a cast of Goonies or DeMarcus Cousins who played with “wait, who is that again?”"}, {"4f32": "This year, Jimmy Butler is clearly running away with this award and is the foremost candidate whom we should pour one out for. At the crossroads of an identity crisis for both the team and the way basketball is headed the Bulls faced a decision. They could choose door one and built around their start about to enter his prime, surrounding him with shooters and one strong post player. They could also choose number two by doubling down on the of taking long twos (that’s been extinct for about seven years) and bringing in two ball-heavy guards with noted history of personality problems. The Bulls decided to run square at the wall in between two doors and now someone has to help them out off the floor and check them for a concussion."}, {"f9e1": "Winner: Jimmy Butler"}, {"5b03": "The Sacramento Kings Lifetime Achievement Award for Ruining a Franchise Utterly and Entirely"}, {"d681": "Winner: Vivek Ranadive"}, {"8658": "The Quietly Having an Amazing Season Award"}, {"855e": "The Westbrook’s and Harden’s of the NBA spoiled us. Before that it was Steph Curry and LeBron James. They have conditioned us to expect not just fundamentally strong basketball and efficient performances but a level of panache and entertainment from our sport heroes. Winning is nice, but we want to believe there is a possibility that the next dunk may just end a defender’s life or that the next crossover will split a defender’s ankles into many geometrically proportionate pieces."}, {"3a5c": "Sometimes however, flash is just out of place. There was a Real Estate convention in Toronto recently and their headline performer was… None other than Pitbull, Mr. 3-Oh-Heisstillrelevant himself. That feels akin to lighting fireworks at a funeral. Unless it’s your arch nemesis funeral, in which case it at least merit’s a discussion. That is how I feel about Mike Conley and playing good basketball. I don’t need Mike Conley to be flashy. I need Mike Conley to be Mike Conley. I need Mike Conley to push a career high in points per game (20.5) and rebounds (3.6) with a usage rate of 26.3. We need to appreciate Mike Conley more."}, {"7e23": "Winner: Mike Conley"}, {"9e01": "The “Need a Larger Sample Size” Award"}, {"4f00": "I love Isaiah Thomas, I would watch Isaiah Thomas fight a live dinosaur from Jurassic Park, and in current form I would put some money down on Isaiah Thomas to win. Especially if they were fighting in the fourth quarter. But are we really ready to declare him as good as he is? Certain NBA players have been known to capture lighting in the bottle for the duration of the season just to watch it whimper out in consecutive seasons."}, {"9f2d": "I think Isaiah Thomas is a good basketball player. I think Isaiah Thomas is a great basketball player. I just don’t think that Isaiah Thomas is a good as Isaiah Thomas thinks he is. To be clear, I respect the amount of good which Isaiah Thomas believes Isaiah Thomas is very much. I like the audacity. But even when your own teams is looking at two prospects at your position that would make you expendable, should the draft Gods grace you with a high enough Brooklyn pick… I’m taking a pause."}, {"3f20": "Winner: Isaiah Thomas"}, {"7a61": "The Our Boy is All Grown Up Award"}, {"8046": "It seems that just yesterday he was rocking the Alpha Alpha haircut and talking about his l337 skills at League of Legends. Now, the baby haired assassin turned into a walking GQ fold-out with zero respect for his opponents feelings. Having undergone basketball (and actual) puberty, Gordon Hayward is a cold-blooded killer. They grow up so fast."}, {"7626": "Winner: Gordon Hayward"}, {"0d7b": "Gordon Hayward: Making A Mark In The Post SeasonCan Hayward make the leap from do-it-all wing to playoff star?16winsaring.com"}, {"4377": "The New York Knicks Lifetime Achievement Award for Managing to New York Knick Their Season in the Most New York Knick way Possible"}, {"e7d3": "Winner: New York Knicks"}, {"9a30": "The Talk Your Shit Award"}, {"c854": "Draymond Green talks his shit. Draymond Green talks his shit on average the same amount of times per day as a regular person talks his shit per year. Draymond Green is a professional “talk your shit” talker. He probably talks his shit in his sleep. Which is why it took a collective effort to snatch this honor from his grasp."}, {"607f": "The Portland Trailblazers long tradition of “talking your shit” starts with Damian Lillard. Consistently snubbed from the All-Star team, from the National Team, from the NBA Christmas Newsletter… Damian Lillard talks his shit a lot. Except that now, the Trail Blazers have added Jusuf Nurkić who doesn’t only talk his shit he basically takes his giant fist and planets opposing teams through a brick wall while talking his shit. Just look at what he did to the Denver Nuggets."}, {"017a": "Winner: Portland Trail Blazers"}, {"333d": "The He’s Getting Paid How Much Award"}, {"bcb0": "Let us remember that Allen Crabbe is getting paid 18.5$-mil per year."}, {"1a16": "Winner: Allen Crabbe"}, {"1956": "The Pettiest Career Decision of the Year Award"}, {"b581": "Pettiness is in, especially in the National Basketball Association. Pettiness takes many forms. One form could be acting out at the reporters and relisting your past playoff appearances when asked about an important regular season match up. The other form of pettiness could be tastefully arranging three trays of pastry, normally associated with softness, to reflect someone’s jersey number. But the best form of pettiness is taking a significant pay cut just to play for a team that is the most likely to play your old team in the Finals with the supposed intention of dislocating upwards of one joint as some form of revenge."}, {"1646": "Winner: Andrew Bogut"}], "content": "The Real NBA Season Awards Because only so many times we can debate the Russell Westbrook vs. James Harden debate without it getting irrelevant until the actual vote. Flickr | Sean Davis I am going to go on the record and say something that we’re all thinking. Something that we’ve all known for a long time, but for the purposes of intrigue and notions of instant gratification decided to largely ignore or not speak about. That’s right, I’m going to be that guy (you know who you are Greg). Regular season awards do not matter. Okay, sure they’re a snapshot of either individual or team greatness over a stretch of 82 games and they’re an indicate of performance levels for that particular year. You know, something we’ll all forget next season and only NBA historians will get slightly aroused now 5 seasons from now. Also, probably something that Susan from accounting will use in her pointless argument of who’s better, Kobe Bryant or LeBron James without ever having actually watched either play consistently. Otherwise, who cares? Allow me to expand. We all know LeBron James is the best basketball player on this and eight other planets (long live Pluto). If there was an Earth wide catastrophe and we could only save two people to blast into space Kal El style in hopes that they find a new civilization and get adopted into it, I’m choosing LeBron James and Serena Williams. I don’t want whatever aliens find our survival probe to think humanity was some sort of collection of punk-ass tricks. I want them to know we were the goddamn shit. No one communicates that more than the superhuman entities of LeBron James and Serena Williams. Yet, despite being the best player in the game of basketball LeBron is fourth (!!!) in the MVP race. Which is still incredible in its own right. Same goes for coach of the year. Realistically we all know that Pop and Carlisle should just pass that award around like a hot potato season to season depending on a variety of factors such as “how many family members did one of them have to threaten to turn Yogi Ferrell into a productive basketball player.” As it stands Mike D’Antoni will most likely walk home with this one for putting basketball on steroids but then also forcing it to take crack. The NBA needs some real awards. It’s cool though, because we here at 16 Wins A Ring got you covered. The Grand Warlock Disciple of Rick Carlisle Award This award generally goes to the coach and/or organization that is able to McGyver a competent NBA team out of pieces of string, scrap metal and one, maybe one and a half competent basketball players. You would think that given my affection for Gregg Popovich (I love him more than my own father, in fact, he might be my father now through association) will be the award’s namesake, but also remember that time Rick Carlisle took a cart of manure driven by Dirk Nowitzki to the NBA Finals. No one has done more with less this year than coach Erik Spoelstra (please pause for crying applause from Allana Tachauer at this juncture). He has taken an at best mediocre Miami team on paper, a collection of scrappy but neglected basketball players and turned them into a team that no one really wants to see in the first round. That seems like an extreme accomplishment. He has Waiters Island teeming with tourists like it’s a goddamn metropolis. He reignited Goran Dragic’s career and he let James Johnson loose on the NBA (consequently I think he recently got away with manslaughter). They’re literally the Mighty Ducks of basketball right now. And now good luck of getting the side-by-side of Emilio Estevez and Coach Spo out of your head. Winner: Coach Erik Spoelstra Why Can’t Bismack Biyombo Help The Magic Defend?Bismack Biyombo is supposed to be an all-defense quality center. Why hasn’t he helped Orlando’s defense?16winsaring.com The Infinite Pit of Sadness Awards At one point of the season it looked that Brooklyn Nets would run away with this one for the third straight year running, but the Orlando Magic have entered the conversation very rapidly. Brooklyn tried to salvage a terrible situation by making it a merely… sad situation. And none of their woes were inflicted by their current GM. Which grants them a bit of parity in this category. The Magic on the other hand continued their proud tradition of “what the hell are they doing” approach to basketball management. They followed up the departure of Tobias Harris with trading Victor Oladipo for Serge Ibaka to pair with Jeff Green and Bismack Biyombo, which makes me think they wildly misinterpreted the notion of position-less basketball. Then they flipped Ibaka for spare change effectively giving them to Toronto for ten cents on the dollar. And if that wasn’t enough, a recent (now deleted tweet) inadvertently revealed Magic’s off-season targets, robbing them of any leverage they may have had on the board. Winner: Orlando Magic The Category Five Devastation Hurricane on the Court Award I feel like it’s unnecessary for me to even go on here because you know who this is. Only one player makes playing the sport of basketball look like the running of the bulls in the middle of Pamplona. Only one NBA player can subtweet an entire league with a devastating dunk. Only one player has subverted the idea of time and space to finish the most complete eradication of the most absurd NBA individual record to date. Only one player is scarier to face in real life than in your darkest nightmare. Winner: Russell Westbrook The Riverdale Teenage Drama of the Year Award I love LeBron James the basketball player. LeBron James the basketball player is what our version of the Hercules legend will be based on and retold 2,000 years from now. LeBron James the person I am still 50/50 on. The biggest question mark is that James insists to treat each regular season like it’s The Godfather. The problem is, he lacks the subtlety of Michael and chooses to operate with the bluntness of Sonny, before running headlong into an ambush set up by his own previous decisions. It’s hard to feel bad for a man who’s built half man half prototype android from the year 2044 to teach us about basketball when he also chooses to complain about unfair treatment, brush off teammates, and criticize team decision making forgetting that it’s his agent, friends and confidantes that have buried Cleveland in financial insecurity. But this is a team award, and as we’ve learned lately LeBron is greater than any team he plays on, he is that team. Winner: Cleveland Cavaliers A Woman Can Succeed As Head Coach In The NBA, But We Are Not ReadyAs some societal barriers crumble and gender-equality is prioritized, a female head coach in the NBA is no longer just…16winsaring.com The Pour One Out for Award This award is reserved for the particularly tortured soul marooned by the decisions (or lack thereof) of the management team or the coaching stuff to produce any sort of viable reinforcements of support. In the past this award has gone to Anthony Davis for being forced to play with the squad that’s basically a cast of Goonies or DeMarcus Cousins who played with “wait, who is that again?” This year, Jimmy Butler is clearly running away with this award and is the foremost candidate whom we should pour one out for. At the crossroads of an identity crisis for both the team and the way basketball is headed the Bulls faced a decision. They could choose door one and built around their start about to enter his prime, surrounding him with shooters and one strong post player. They could also choose number two by doubling down on the of taking long twos (that’s been extinct for about seven years) and bringing in two ball-heavy guards with noted history of personality problems. The Bulls decided to run square at the wall in between two doors and now someone has to help them out off the floor and check them for a concussion. Winner: Jimmy Butler The Sacramento Kings Lifetime Achievement Award for Ruining a Franchise Utterly and Entirely Winner: Vivek Ranadive The Quietly Having an Amazing Season Award The Westbrook’s and Harden’s of the NBA spoiled us. Before that it was Steph Curry and LeBron James. They have conditioned us to expect not just fundamentally strong basketball and efficient performances but a level of panache and entertainment from our sport heroes. Winning is nice, but we want to believe there is a possibility that the next dunk may just end a defender’s life or that the next crossover will split a defender’s ankles into many geometrically proportionate pieces. Sometimes however, flash is just out of place. There was a Real Estate convention in Toronto recently and their headline performer was… None other than Pitbull, Mr. 3-Oh-Heisstillrelevant himself. That feels akin to lighting fireworks at a funeral. Unless it’s your arch nemesis funeral, in which case it at least merit’s a discussion. That is how I feel about Mike Conley and playing good basketball. I don’t need Mike Conley to be flashy. I need Mike Conley to be Mike Conley. I need Mike Conley to push a career high in points per game (20.5) and rebounds (3.6) with a usage rate of 26.3. We need to appreciate Mike Conley more. Winner: Mike Conley The “Need a Larger Sample Size” Award I love Isaiah Thomas, I would watch Isaiah Thomas fight a live dinosaur from Jurassic Park, and in current form I would put some money down on Isaiah Thomas to win. Especially if they were fighting in the fourth quarter. But are we really ready to declare him as good as he is? Certain NBA players have been known to capture lighting in the bottle for the duration of the season just to watch it whimper out in consecutive seasons. I think Isaiah Thomas is a good basketball player. I think Isaiah Thomas is a great basketball player. I just don’t think that Isaiah Thomas is a good as Isaiah Thomas thinks he is. To be clear, I respect the amount of good which Isaiah Thomas believes Isaiah Thomas is very much. I like the audacity. But even when your own teams is looking at two prospects at your position that would make you expendable, should the draft Gods grace you with a high enough Brooklyn pick… I’m taking a pause. Winner: Isaiah Thomas The Our Boy is All Grown Up Award It seems that just yesterday he was rocking the Alpha Alpha haircut and talking about his l337 skills at League of Legends. Now, the baby haired assassin turned into a walking GQ fold-out with zero respect for his opponents feelings. Having undergone basketball (and actual) puberty, Gordon Hayward is a cold-blooded killer. They grow up so fast. Winner: Gordon Hayward Gordon Hayward: Making A Mark In The Post SeasonCan Hayward make the leap from do-it-all wing to playoff star?16winsaring.com The New York Knicks Lifetime Achievement Award for Managing to New York Knick Their Season in the Most New York Knick way Possible Winner: New York Knicks The Talk Your Shit Award Draymond Green talks his shit. Draymond Green talks his shit on average the same amount of times per day as a regular person talks his shit per year. Draymond Green is a professional “talk your shit” talker. He probably talks his shit in his sleep. Which is why it took a collective effort to snatch this honor from his grasp. The Portland Trailblazers long tradition of “talking your shit” starts with Damian Lillard. Consistently snubbed from the All-Star team, from the National Team, from the NBA Christmas Newsletter… Damian Lillard talks his shit a lot. Except that now, the Trail Blazers have added Jusuf Nurkić who doesn’t only talk his shit he basically takes his giant fist and planets opposing teams through a brick wall while talking his shit. Just look at what he did to the Denver Nuggets. Winner: Portland Trail Blazers The He’s Getting Paid How Much Award Let us remember that Allen Crabbe is getting paid 18.5$-mil per year. Winner: Allen Crabbe The Pettiest Career Decision of the Year Award Pettiness is in, especially in the National Basketball Association. Pettiness takes many forms. One form could be acting out at the reporters and relisting your past playoff appearances when asked about an important regular season match up. The other form of pettiness could be tastefully arranging three trays of pastry, normally associated with softness, to reflect someone’s jersey number. But the best form of pettiness is taking a significant pay cut just to play for a team that is the most likely to play your old team in the Finals with the supposed intention of dislocating upwards of one joint as some form of revenge. Winner: Andrew Bogut ", "name": "77", "child": "77_1\t77_2", "timestamp": "Apr 6"}