{"parent": "", "title": "The irony of usability and linear motion", "author": "Issara Willenskomer", "sentences": [{"7c7c": "The irony of usability and linear motion"}, {"c2ac": "I’ve long puzzled over why eased motion is ‘better’ in user experiences than linear motion."}, {"8f3f": "In the ‘UX in Motion Principle: Easing,’ I was able ‘tease open’ why eased motion is ‘better’ than linear motion, but I never felt like the I threw the door all the way open."}, {"2f0a": "This bothered me. It’s one thing to know that ‘eased’ motion feels better in user experiences. Everyone knows this. The question is why? What is going on in our brains and consciousness wherein eased motion is ‘better.’ Over the years I’ve spent a lot of time reading articles on animation, in particular on Disney’s Animation Principle of Slow in and Slow Out, hoping to glean insight not into just the mechanics, but the deeper why. Not only did nobody seem to know, it honestly seemed that no one had given the topic much thought."}, {"2f6f": "I will now attempt to throw the door all (or at least most of) the way open and answer the question of why eased motion is better in user experiences than linear motion."}, {"2265": "In the shower this morning (apologies for the image, but that’s where a lot of my most creative ideas happen), I was struck by the following insight."}, {"d00b": "Ironically, linear motion is the most predictive motion. I say ironically because we seem to be better at predicting non-linear motion than linear motion. With linear motion, the rate of change is identical for any given moment in time. This means that all you have to know is the rate of change at one moment, and you’ll know what value it will have in any future or past moment in time. Linear motion is therefore ‘simpler.’"}, {"57b7": "Conversely, non-linear motion, or eased motion is almost by definition more complex. It is less inherently predictable."}, {"5be6": "So what in effect we’re saying is that between two kinds of hypothetical motion, linear and non-linear, where linear is ‘simpler’ or ‘easier’ and non-linear is ‘complex’ or ‘harder’ our neuro/mental systems would naturally evolve in ways to capitalize on the ‘simpler/easier’ motion model. But what this argument pre-supposes is the reality of linear motion, when in fact for 99.9999% of what our brain experiences, linear motion is purely theoretical and does not exist (obvious counter examples of motion which we cannot directly perceive due to their slow rate of movement are the sun and the moon)."}, {"3eb0": "None of this matters, however, due to the laws governing the conservation of momentum, which basically state that objects with mass have to alter their velocity when they change direction , which everything does when they move in any path other than a mathematically straight line."}, {"a854": "Throw in a few more complicated influencers like spring dynamics, gravity, air resistance, kinematics, thermodynamics, etc., that govern our physical reality on the habitable surface of a planet, and what you get is a near total absence of linear motion in our evolutionary cycle. A near absence equates to minimal need to select genes that influence this benefit (since all genetic benefits come at costs, and assuming such a thing had genetic variability which was influence by natural selection to begin with)."}, {"0235": "Our neuro/mental/consciousness framework evolved in physical bodies in physical space. Not only are all external objects that are important to us moving in non-linear motion, but the internal motion of our bodies, our heads, even our eyes in our sockets are constantly doing a complex dance of inertial movement — which is non-linear. If this movement were graphed, the graphs would appear ‘eased,’ or ‘curved,’ which in UX is basically the same thing."}, {"8d88": "Imagine — you take a step. Your weight shifts. The long vertical column that extends from your feet to your head oscillates and jiggles like a skyscraper in an earthquake. At the very apex of this jiggling column, your head is careening wildly like a melon balanced on a stick. You know this from camera footage captured by a camera strapped to a person’s head. It’s nearly unwatchable without stabilization."}, {"2a68": "However, from your perspective, from inside your own head, all you see is smooth continuous movement. You watch the footage from the camera strapped to your head in bewilderment. The discrepancy is truly shocking because we’re so used to the near-realtime anticipation and cancellation of superfluous macro and micro movements that our brain unconsciously performs for us."}, {"c800": "Therein lies the key. Our brains have evolved the ability to predict and counter (not necessarily together) these internal cascades of non-linear motion as well as all the non-linear motion that occurs around us all the time. In fact, over time, the ability to perceive linear motion as effectively as non-linear motion has likely been nearly quashed."}, {"8738": "Think about this. In this hypothesis, we are evolutionary ‘hardwired’ to cognitively grasp (for the dual purpose of predicting and countering, depending on context), and make meaning from non-linear motion ‘better’ than we would be from linear motion, simply because it exists, while linear motion does not."}, {"29e1": "As you can see, when it comes to motion in user experiences, linear motion can not only actually hinder users ability to fully take advantage of their innate motion tracking cognition, but can force users to use more primitive and atrophied linear tracking systems. Linear motion may in fact be harder to ‘read’ or perceive, or to make sense of."}, {"98f9": "I’ve been testing this theory out. While walking around, I eye-track with flying birds close to me, while watching how my consciousness/body reacts. My eyes are frighteningly good at ‘sticking’ to quickly moving objects as they change their momentum and direction. Even with quickly moving birds, I can make out minute details of their feathers as the bodies they cling to move organically through space."}, {"0e99": "The really amazing implication here is that it’s almost as if we have a suite of ‘natural easing functions’ hardwired into our brains that get loaded into our consciousness to predict the motion of an external object."}, {"def2": "A completely different and equally amazing implication is that we’re able to cobble together complex velocity algorithms on the fly (or from a set of deeper library functions) from visual data in near realtime and load those results into our consciousness."}, {"155c": "We know from recent breakthroughs in neuroplasticity that the brain is an organ that organizes itself in response to its environment."}, {"63fe": "It follows that structures in the brain that are environmentally determined are either reinforced by stimulation or they ‘atrophy’ through a lack of stimulation. If stimulated, more connections are made, and neurons are re-myelinated. The ‘mind-map’ reinforces itself and expands. If not stimulated, however, those regions are recruited by other regions and fade in dominance, or disappear altogether. This argument favors the idea that our favoring non-linear over linear comes from how our brains are organized around our environmental inputs, not necessarily a genetic reason."}, {"1792": "Therefore, designers who employ linear motion in their projects are not just missing an opportunity to create usability, they may also be negatively impacting it."}, {"4766": "The UX in Motion recommendation here is to always use eased motion."}, {"0dfb": "The question remains — of the infinite possible easing values in existence, which are best? Should I use this curve or that curve? At this point there is no solid answer, but the hypothesis suggests a likely scenario where any eased motion will create better usability than linear motion."}, {"964c": "To conclude: the irony is that while linear motion is vastly ‘simpler’ and seemingly easier to grasp, it is in fact the non-linear, more complex motion that we seem to be adapted to, and which ultimately affects the quality of the user experience."}, {"def0": "As a quick plug, if you want me to speak at your conference or lead an onsite workshop for your team on the exciting topic of motion and usability, go here. If you want to attend a class in your city go here. Finally, if you want me to consult on your project, you can go here. To get added to my list, go here."}, {"f8b3": "Special thanks, as usual, to Kateryna for being both a tolerant and not so tolerant recipient of my annoying habit of becoming extremely excited about absurdly esoteric topics during inappropriate times."}], "content": "The irony of usability and linear motion I’ve long puzzled over why eased motion is ‘better’ in user experiences than linear motion. In the ‘UX in Motion Principle: Easing,’ I was able ‘tease open’ why eased motion is ‘better’ than linear motion, but I never felt like the I threw the door all the way open. This bothered me. It’s one thing to know that ‘eased’ motion feels better in user experiences. Everyone knows this. The question is why? What is going on in our brains and consciousness wherein eased motion is ‘better.’ Over the years I’ve spent a lot of time reading articles on animation, in particular on Disney’s Animation Principle of Slow in and Slow Out, hoping to glean insight not into just the mechanics, but the deeper why. Not only did nobody seem to know, it honestly seemed that no one had given the topic much thought. I will now attempt to throw the door all (or at least most of) the way open and answer the question of why eased motion is better in user experiences than linear motion. In the shower this morning (apologies for the image, but that’s where a lot of my most creative ideas happen), I was struck by the following insight. Ironically, linear motion is the most predictive motion. I say ironically because we seem to be better at predicting non-linear motion than linear motion. With linear motion, the rate of change is identical for any given moment in time. This means that all you have to know is the rate of change at one moment, and you’ll know what value it will have in any future or past moment in time. Linear motion is therefore ‘simpler.’ Conversely, non-linear motion, or eased motion is almost by definition more complex. It is less inherently predictable. So what in effect we’re saying is that between two kinds of hypothetical motion, linear and non-linear, where linear is ‘simpler’ or ‘easier’ and non-linear is ‘complex’ or ‘harder’ our neuro/mental systems would naturally evolve in ways to capitalize on the ‘simpler/easier’ motion model. But what this argument pre-supposes is the reality of linear motion, when in fact for 99.9999% of what our brain experiences, linear motion is purely theoretical and does not exist (obvious counter examples of motion which we cannot directly perceive due to their slow rate of movement are the sun and the moon). None of this matters, however, due to the laws governing the conservation of momentum, which basically state that objects with mass have to alter their velocity when they change direction , which everything does when they move in any path other than a mathematically straight line. Throw in a few more complicated influencers like spring dynamics, gravity, air resistance, kinematics, thermodynamics, etc., that govern our physical reality on the habitable surface of a planet, and what you get is a near total absence of linear motion in our evolutionary cycle. A near absence equates to minimal need to select genes that influence this benefit (since all genetic benefits come at costs, and assuming such a thing had genetic variability which was influence by natural selection to begin with). Our neuro/mental/consciousness framework evolved in physical bodies in physical space. Not only are all external objects that are important to us moving in non-linear motion, but the internal motion of our bodies, our heads, even our eyes in our sockets are constantly doing a complex dance of inertial movement — which is non-linear. If this movement were graphed, the graphs would appear ‘eased,’ or ‘curved,’ which in UX is basically the same thing. Imagine — you take a step. Your weight shifts. The long vertical column that extends from your feet to your head oscillates and jiggles like a skyscraper in an earthquake. At the very apex of this jiggling column, your head is careening wildly like a melon balanced on a stick. You know this from camera footage captured by a camera strapped to a person’s head. It’s nearly unwatchable without stabilization. However, from your perspective, from inside your own head, all you see is smooth continuous movement. You watch the footage from the camera strapped to your head in bewilderment. The discrepancy is truly shocking because we’re so used to the near-realtime anticipation and cancellation of superfluous macro and micro movements that our brain unconsciously performs for us. Therein lies the key. Our brains have evolved the ability to predict and counter (not necessarily together) these internal cascades of non-linear motion as well as all the non-linear motion that occurs around us all the time. In fact, over time, the ability to perceive linear motion as effectively as non-linear motion has likely been nearly quashed. Think about this. In this hypothesis, we are evolutionary ‘hardwired’ to cognitively grasp (for the dual purpose of predicting and countering, depending on context), and make meaning from non-linear motion ‘better’ than we would be from linear motion, simply because it exists, while linear motion does not. As you can see, when it comes to motion in user experiences, linear motion can not only actually hinder users ability to fully take advantage of their innate motion tracking cognition, but can force users to use more primitive and atrophied linear tracking systems. Linear motion may in fact be harder to ‘read’ or perceive, or to make sense of. I’ve been testing this theory out. While walking around, I eye-track with flying birds close to me, while watching how my consciousness/body reacts. My eyes are frighteningly good at ‘sticking’ to quickly moving objects as they change their momentum and direction. Even with quickly moving birds, I can make out minute details of their feathers as the bodies they cling to move organically through space. The really amazing implication here is that it’s almost as if we have a suite of ‘natural easing functions’ hardwired into our brains that get loaded into our consciousness to predict the motion of an external object. A completely different and equally amazing implication is that we’re able to cobble together complex velocity algorithms on the fly (or from a set of deeper library functions) from visual data in near realtime and load those results into our consciousness. We know from recent breakthroughs in neuroplasticity that the brain is an organ that organizes itself in response to its environment. It follows that structures in the brain that are environmentally determined are either reinforced by stimulation or they ‘atrophy’ through a lack of stimulation. If stimulated, more connections are made, and neurons are re-myelinated. The ‘mind-map’ reinforces itself and expands. If not stimulated, however, those regions are recruited by other regions and fade in dominance, or disappear altogether. This argument favors the idea that our favoring non-linear over linear comes from how our brains are organized around our environmental inputs, not necessarily a genetic reason. Therefore, designers who employ linear motion in their projects are not just missing an opportunity to create usability, they may also be negatively impacting it. The UX in Motion recommendation here is to always use eased motion. The question remains — of the infinite possible easing values in existence, which are best? Should I use this curve or that curve? At this point there is no solid answer, but the hypothesis suggests a likely scenario where any eased motion will create better usability than linear motion. To conclude: the irony is that while linear motion is vastly ‘simpler’ and seemingly easier to grasp, it is in fact the non-linear, more complex motion that we seem to be adapted to, and which ultimately affects the quality of the user experience. As a quick plug, if you want me to speak at your conference or lead an onsite workshop for your team on the exciting topic of motion and usability, go here. If you want to attend a class in your city go here. Finally, if you want me to consult on your project, you can go here. To get added to my list, go here. Special thanks, as usual, to Kateryna for being both a tolerant and not so tolerant recipient of my annoying habit of becoming extremely excited about absurdly esoteric topics during inappropriate times. ", "name": "771", "child": "771_1\t771_2\t771_3\t771_4\t771_5\t771_6\t771_7771_1\t771_2\t771_3\t771_4\t771_5\t771_6\t771_7771_1\t771_2\t771_3\t771_4\t771_5\t771_6\t771_7771_1\t771_2\t771_3\t771_4\t771_5\t771_6\t771_7", "timestamp": "Apr 14"}