{"parent": "", "title": "Hey HDFC, we fixed your mobile banking app", "author": "Dhivya Ramanujam", "sentences": [{"bcd2": "Hey HDFC, we fixed your mobile banking app"}, {"35ce": "The Government of India’s (GoI) mandate to digitise all payments has opened up a lot of opportunities and challenges for the exciting new sector of FinTech. In this post, we examine the HDFC Mobile banking app that we use internally at NFN Labs and summarise our redesign approach."}, {"983e": "Disclaimer: This is a side project we took up. We do not work for HDFC and the views from this case study are strictly our own. This case study is not exhaustive as we do not have access to all the user data that influenced the design decisions for HDFC’s current application."}, {"ec74": "The trigger:"}, {"4c99": "According to Forrester’s Global mobile banking report, mobile banking in India isn’t yet world class. Indian banks fare much poorly in mobile banking functionality when compared to the global average. HDFC scored 48 on 100 for its mobile banking functionality."}, {"a7cf": "HDFC scored a 48/100 for its mobile banking functionality"}, {"1f84": "User Research, Findings and Data"}, {"bd9d": "User research preceded the redesign phase and it helped us understand the users and their needs, how they currently approach the problem, their mental models of the solution and the way they perceived information."}, {"37e9": "Personas: Who are our users?"}, {"5517": "The two key parameters we decided on for segmentation were the user’s financial security and familiarity with technology. We focussed on those personas who were more likely to be current users i.e those least resistant to the mobile banking experience."}, {"b318": "What is their typical behaviour with mobile banking? What are they looking for within the application?"}, {"086b": "We built a survey to analyse mobile banking behaviour and the results we observed from around ~100 entries were as follows:"}, {"7f8e": "Netbanking was the most frequently used medium for banking while none of the users who took the survey opted for Banking/ ATM as their most frequently used medium"}, {"e1ad": "User focus in mobile banking was more on money management than on wealth and investment management"}, {"7301": "Their key activities on the app helped prioritise the tasks on the application. The average user’s focus was more on money management than wealth management"}, {"cc06": "Mental models of organising information:"}, {"3d05": "We followed up with a card sorting exercise with over 20 participants to understand how users categorised information, to draft the information architecture accordingly. A key finding was that a proportion of participants grouped deposits and mutual funds together as wealth management, while several banking applications typically categorised deposits under account information. The information architecture had to keep in mind the user’s mental model, without compromising on the standard norms of categorising information."}, {"d60b": "A participant’s results for the card sorting exercise"}, {"b079": "Reviewing the User Experience:"}, {"7b3d": "Log in:"}, {"5cec": "Login screen"}, {"a4b0": "One common complaint on the Appstore was the inability to log in via the app. This was due to password expiry. While the website notifies the user prompting them to reset it, the app doesn’t. Leaving the users clueless until they got on the website"}, {"ba58": "Inability to log in due to password expiry"}, {"8fd2": "My Menu:"}, {"42be": "Constraints: Functionally, certain fields get disabled depending on the user’s input but remain enabled visually. This can serve as a misleading affordance (an attribute of an object that allows people to know how to use it) to the user delaying the user’s task completion time and affect user experience"}, {"cb14": "The Norman door handle is an example of a misleading affordance for a door that needs to be pushed instead of pulled (Source: Tumblr)"}, {"f153": "Fixed deposit user flow:"}, {"e6a4": "The app requests the user to input the deposit amount before generating the rules that determine the minimum deposit amount and duration. This could lead to the user re-entering the amount based on the displayed rules. The ideal flow would be to educate the user on the rules before they enter the amount and duration."}, {"dc53": "Proposed flow for Fixed deposit generates the rules prior to user input"}, {"7448": "Prompting the user when the amount entered is below the minimum amount can enhance UX"}, {"0ffd": "Fund transfer flow:"}, {"fdd3": "a) Is it the actual user looking to make the transfer?"}, {"51ff": "b) Is the user certain of the transfer they’re trying to make?"}, {"a743": "Frequently made fund transfers often become habitual i.e ingrained in our muscle memory. While this makes it easier for the user, it can often result in the user easily accomplishing the wrong task."}, {"520b": "Friction in user experience can sometimes be to the user’s advantage, especially if it’s while introducing an additional layer of validation in the payment process, an OTP for example."}, {"3bd0": "User review on accomplishing a wrong task"}, {"4d02": "2. The current approach of categorising information into ‘Transact’, ‘Enquire’ and ‘Request’ although theoretically accurate does not prioritise the user’s flow of performing tasks and organising information."}, {"690f": "Categorising information into ‘Transact’, ‘Enquire’ and ‘Request’ although technically accurate did not align with the user’s flow of performing tasks and organising information"}, {"03ec": "Credit Card:"}, {"baf5": "The Redesign:"}, {"c7ff": "Red Routes prioritise tasks by evaluating each task on how many users perform it and how many times they perform it. This helps identify the crucial tasks that should be provided upfront and the good to have tasks that can be discovered gradually through progressive disclosure."}, {"90c4": "Red Routes for prioritising tasks across frequency of times and people who perform them"}, {"1e99": "Features such as Bill payments, Fund transfer and viewing account details are crucial for money management and need to be provided up-front, whereas features like managing deposits, mutual funds that relate to wealth management can be disclosed progressively ."}, {"b1a9": "The Information Architecture took into account the tasks users wanted to primarily perform, the categories they perceived as well as the norms of categorising banking features."}, {"5537": "The Wireframing process involved putting together all the redesigned functionalities and flows on the mobile screen. This was the final, iterative check-point on how the workflow would translate onto the screens, before delving into how the screens would look."}, {"b268": "Wireframes using Figma"}, {"d6ef": "User Interface Design:"}, {"497b": "Once the wireframes were finalised, we moved on to the User Interface design. Selection of colours, iconization and typographical choices were centred around the brand identity and functionality."}, {"f25a": "The redesigned Sign in Screen:"}, {"895e": "The redesigned sign in screen"}, {"f7dd": "The redesigned navigation menu prioritises the primary money management tasks that users perform. Secondary features are accommodated within the ‘More’ section."}, {"bc2e": "The redesigned navigation menu"}, {"4b2a": "Account Screen: The primary information made visible on the account screen is the balance and the recent transactions. The screen provides access to transaction history- where transactions can be filtered by type, time-frame and amount."}, {"7df3": "Prioritising balance amount and recent transactions on the account screen with progressive disclosure to access transaction history by type, amount and time-frame"}, {"5f2e": "Transfer funds process incorporating OTP verification:"}, {"7e98": "As a finishing touch, we also redesigned HDFC’s app icon as we noticed it wasn’t up to speed with current design trends."}, {"2634": "HDFC app icon redesign"}, {"d756": "NFN Labs is a design driven app development agency. We design, develop and ship beautiful and functional apps for the Web, iOS, Android, Apple TV and Apple Watch"}, {"219e": "Did you like what you read?Recommend this post (by clicking the ❤️ button) so other people can see it too…We can also connect on Twitter @NFNLabs"}], "content": "Hey HDFC, we fixed your mobile banking app The Government of India’s (GoI) mandate to digitise all payments has opened up a lot of opportunities and challenges for the exciting new sector of FinTech. In this post, we examine the HDFC Mobile banking app that we use internally at NFN Labs and summarise our redesign approach. Disclaimer: This is a side project we took up. We do not work for HDFC and the views from this case study are strictly our own. This case study is not exhaustive as we do not have access to all the user data that influenced the design decisions for HDFC’s current application. The trigger: According to Forrester’s Global mobile banking report, mobile banking in India isn’t yet world class. Indian banks fare much poorly in mobile banking functionality when compared to the global average. HDFC scored 48 on 100 for its mobile banking functionality. HDFC scored a 48/100 for its mobile banking functionality User Research, Findings and Data User research preceded the redesign phase and it helped us understand the users and their needs, how they currently approach the problem, their mental models of the solution and the way they perceived information. Personas: Who are our users? The two key parameters we decided on for segmentation were the user’s financial security and familiarity with technology. We focussed on those personas who were more likely to be current users i.e those least resistant to the mobile banking experience. What is their typical behaviour with mobile banking? What are they looking for within the application? We built a survey to analyse mobile banking behaviour and the results we observed from around ~100 entries were as follows: Netbanking was the most frequently used medium for banking while none of the users who took the survey opted for Banking/ ATM as their most frequently used medium User focus in mobile banking was more on money management than on wealth and investment management Their key activities on the app helped prioritise the tasks on the application. The average user’s focus was more on money management than wealth management Mental models of organising information: We followed up with a card sorting exercise with over 20 participants to understand how users categorised information, to draft the information architecture accordingly. A key finding was that a proportion of participants grouped deposits and mutual funds together as wealth management, while several banking applications typically categorised deposits under account information. The information architecture had to keep in mind the user’s mental model, without compromising on the standard norms of categorising information. A participant’s results for the card sorting exercise Reviewing the User Experience: Log in: Login screen One common complaint on the Appstore was the inability to log in via the app. This was due to password expiry. While the website notifies the user prompting them to reset it, the app doesn’t. Leaving the users clueless until they got on the website Inability to log in due to password expiry My Menu: Constraints: Functionally, certain fields get disabled depending on the user’s input but remain enabled visually. This can serve as a misleading affordance (an attribute of an object that allows people to know how to use it) to the user delaying the user’s task completion time and affect user experience The Norman door handle is an example of a misleading affordance for a door that needs to be pushed instead of pulled (Source: Tumblr) Fixed deposit user flow: The app requests the user to input the deposit amount before generating the rules that determine the minimum deposit amount and duration. This could lead to the user re-entering the amount based on the displayed rules. The ideal flow would be to educate the user on the rules before they enter the amount and duration. Proposed flow for Fixed deposit generates the rules prior to user input Prompting the user when the amount entered is below the minimum amount can enhance UX Fund transfer flow: a) Is it the actual user looking to make the transfer? b) Is the user certain of the transfer they’re trying to make? Frequently made fund transfers often become habitual i.e ingrained in our muscle memory. While this makes it easier for the user, it can often result in the user easily accomplishing the wrong task. Friction in user experience can sometimes be to the user’s advantage, especially if it’s while introducing an additional layer of validation in the payment process, an OTP for example. User review on accomplishing a wrong task 2. The current approach of categorising information into ‘Transact’, ‘Enquire’ and ‘Request’ although theoretically accurate does not prioritise the user’s flow of performing tasks and organising information. Categorising information into ‘Transact’, ‘Enquire’ and ‘Request’ although technically accurate did not align with the user’s flow of performing tasks and organising information Credit Card: The Redesign: Red Routes prioritise tasks by evaluating each task on how many users perform it and how many times they perform it. This helps identify the crucial tasks that should be provided upfront and the good to have tasks that can be discovered gradually through progressive disclosure. Red Routes for prioritising tasks across frequency of times and people who perform them Features such as Bill payments, Fund transfer and viewing account details are crucial for money management and need to be provided up-front, whereas features like managing deposits, mutual funds that relate to wealth management can be disclosed progressively . The Information Architecture took into account the tasks users wanted to primarily perform, the categories they perceived as well as the norms of categorising banking features. The Wireframing process involved putting together all the redesigned functionalities and flows on the mobile screen. This was the final, iterative check-point on how the workflow would translate onto the screens, before delving into how the screens would look. Wireframes using Figma User Interface Design: Once the wireframes were finalised, we moved on to the User Interface design. Selection of colours, iconization and typographical choices were centred around the brand identity and functionality. The redesigned Sign in Screen: The redesigned sign in screen The redesigned navigation menu prioritises the primary money management tasks that users perform. Secondary features are accommodated within the ‘More’ section. The redesigned navigation menu Account Screen: The primary information made visible on the account screen is the balance and the recent transactions. The screen provides access to transaction history- where transactions can be filtered by type, time-frame and amount. Prioritising balance amount and recent transactions on the account screen with progressive disclosure to access transaction history by type, amount and time-frame Transfer funds process incorporating OTP verification: As a finishing touch, we also redesigned HDFC’s app icon as we noticed it wasn’t up to speed with current design trends. HDFC app icon redesign NFN Labs is a design driven app development agency. We design, develop and ship beautiful and functional apps for the Web, iOS, Android, Apple TV and Apple Watch Did you like what you read?Recommend this post (by clicking the ❤️ button) so other people can see it too…We can also connect on Twitter @NFNLabs ", "name": "772", "child": "772_1\t772_2\t772_3\t772_4", "timestamp": "Apr 13"}