{"parent": "", "title": "Krijg geld gestort op je telefoonnummer via Florin", "author": "Andre Woons", "sentences": [{"d843": "Krijg geld gestort op je telefoonnummer via Florin"}, {"e506": "Vandaag lanceert Florin een update van de app waarmee je direct geld kunt overmaken naar telefoonnummers. Voor ons (Bas en Andre, oprichters van Florin) is het een droom die uitkomt. Al vanaf het prille begin wilden we dit voor jullie realiseren."}, {"bfc5": "In augustus kon je via Florin al ‘rekeningen delen’ en ‘terugbetalen’. Sinds vandaag (yes!) is Florin de eerste en enige échte Nederlandse betaalapp. Geen ander biedt je de mogelijkheid om geld gestort te krijgen op je telefoonnummer."}, {"e7aa": "Waarom?"}, {"198c": "In de bus, achter je bureau, tijdens het koken — op de gekste momenten kun je eraan denken: ik moet iemand nog betalen. Je moet dan iemands IBAN nummer gaan vragen, en tegen de tijd dat je die hebt ontvangen heb je al geen zin of tijd meer om de betaling te doen."}, {"78df": "Met Florin is dat verleden tijd. Het versturen van geld is nu net zo eenvoudig als het versturen van een Whatsappje."}, {"480e": "Hoe werkt het?"}, {"d7f9": "Met Florin selecteer je je geldschieter simpelweg in je contactenlijst en maak je het bedrag over met het gemak van een berichtje sturen. Bedrag invullen, veilig betalen via iDeal en je bent klaar."}, {"c0dc": "Het maakt niet uit of de vriend die je betaalt al Florin heeft. Hij krijgt direct een sms’je van Florin. Wanneer hij Florin downloadt en z’n bankrekening koppelt wordt het geld automatisch bijgeschreven. Doet je vriend dit niet binnen 24 uur, dan krijg jij het geld gewoon terug. Superhandig!"}, {"33fa": "Kost dat?"}, {"d95d": "Betalingen doen naar ieder telefoonnummer is gratis, net als rekeningen delen en terugbetalen. Dat is zo en dat blijft zo."}, {"455c": "Florin downloaden"}, {"99f8": "Florin is gratis te downloaden uit de App Store en de Play Store."}], "content": "Krijg geld gestort op je telefoonnummer via Florin Vandaag lanceert Florin een update van de app waarmee je direct geld kunt overmaken naar telefoonnummers. Voor ons (Bas en Andre, oprichters van Florin) is het een droom die uitkomt. Al vanaf het prille begin wilden we dit voor jullie realiseren. In augustus kon je via Florin al ‘rekeningen delen’ en ‘terugbetalen’. Sinds vandaag (yes!) is Florin de eerste en enige échte Nederlandse betaalapp. Geen ander biedt je de mogelijkheid om geld gestort te krijgen op je telefoonnummer. Waarom? In de bus, achter je bureau, tijdens het koken — op de gekste momenten kun je eraan denken: ik moet iemand nog betalen. Je moet dan iemands IBAN nummer gaan vragen, en tegen de tijd dat je die hebt ontvangen heb je al geen zin of tijd meer om de betaling te doen. Met Florin is dat verleden tijd. Het versturen van geld is nu net zo eenvoudig als het versturen van een Whatsappje. Hoe werkt het? Met Florin selecteer je je geldschieter simpelweg in je contactenlijst en maak je het bedrag over met het gemak van een berichtje sturen. Bedrag invullen, veilig betalen via iDeal en je bent klaar. Het maakt niet uit of de vriend die je betaalt al Florin heeft. Hij krijgt direct een sms’je van Florin. Wanneer hij Florin downloadt en z’n bankrekening koppelt wordt het geld automatisch bijgeschreven. Doet je vriend dit niet binnen 24 uur, dan krijg jij het geld gewoon terug. Superhandig! Kost dat? Betalingen doen naar ieder telefoonnummer is gratis, net als rekeningen delen en terugbetalen. Dat is zo en dat blijft zo. Florin downloaden Florin is gratis te downloaden uit de App Store en de Play Store. ", "name": "782", "child": "782_1\t782_2", "timestamp": "Oct 24, 2016"}