{"parent": "", "title": "Why bots aren’t the real AI disruption", "author": "Jensen Harris", "sentences": [{"18c3": "Why bots aren’t the real AI disruption"}, {"11b2": "The quiet rise of headless AI"}, {"2c2c": "“Hey Siri, how’s the weather today?”“OK Google, remind me to pay the power bill.”“Alexa, tell me a joke!”"}, {"ed64": "Bots are eating the world. Whether you are an enterprising app developer building the essential software to bring a virtual Taylor Swift into your Slack chats, or just lonely and in need of a dumb, annoying virtual friend to message you on Facebook, we seem to be clear on one thing: many experiences, apps, sites, and products are breathlessly going to be replaced with bots."}, {"6a19": "(Unless they are being replaced with VR. Or AR. Or a typewriter keyboard for your iPhone.)"}, {"4085": "It’s official: “bot for X” is the new “Uber for X”."}, {"43dd": "And sure, bots are cool. Ever since ELIZA struggled to pass the Turing Test and HAL 9000 murdered his crew (later reincarnated in a hardly-remembered Apple Super Bowl commercial) we’ve been infatuated with the idea of computers as our inevitable sidekicks."}, {"eed4": "Bots center around one specific niche aspect of artificial intelligence: conversational understanding. Human factors experts have long been enthralled by the idea that a more natural way to communicate with computers would be through speech, and we’ve spent the better part of a century building to a point where natural conversations may soon be a reality."}, {"c8fb": "While this is indeed an important step forward in human-computer interaction, it is truly just one small part of what AI is about—and not the part that will matter the most for the enterprise companies who actually buy almost $4 trillion in software and services each year."}, {"9e51": "Bots are the new command line"}, {"01d4": "Today, most bots just provide a wrapper around existing functionality. Much as in the early days of graphical user interface (GUI), the point-and-click interface provided different ways of achieving the same tasks you could do on the command line, most bots provide an additional channel with which to do tasks you likely often do another way."}, {"c461": "Instead of speaking a specific sentence, you can open the Weather app on your iPhone. You can open your task list and type “Pay the power bill.” You could search Google for a viola joke."}, {"6674": "Many of today’s bots are kind of a hipster façade around the same basic command line interfaces consumers abandoned in the 1980s. They require specific syntaxes and understand only a limited vocabulary—but they sure have personality!"}, {"7560": "format /q /fs:fat /v:mydisk wasn’t nearly this funny back in the day."}, {"9e83": "Yes, Taco Bell really did this."}, {"f1e9": "While the added convenience of language recognition is a benefit, until bots are capable of performing very complex and novel tasks that richly combine actions and context across the boundaries of apps and sites in unique ways the first time they are asked, we will be limited to trying to remember the 489 commands Siri recognizes. (Yes that link is a man page for Siri. ~sigh~)"}, {"413b": "The rise of headless AI"}, {"cc73": "But I’m not down on bots. I’m just a lot more excited by the less-flashy flavor of AI that is changing the nature of work itself: headless AI."}, {"c2fd": "Headless AI is the application of artificial intelligence to vastly improve internal business processes."}, {"29b8": "It is fully transforming the crucial machinery of business—processes like hiring, lead generation, financial modeling, and information security. Legacy software has become commodity in all of these areas, and purpose-built AI solutions will get a larger and larger wallet share of these huge enterprise cost centers."}, {"3956": "Headless AI combines machine intelligence and learning loops to constantly evolve. Because these solutions plug into the data lifeblood of a company, they become incredibly valuable as the algorithms adapt to the patterns that work."}, {"d3dc": "I call this form of AI “headless” because, unlike bots, the value is mostly not about the personality. Headless AI works with humans and augments their strengths; it doesn’t try to replace them. It gives people superpowers."}, {"ff07": "While being able to talk to your CRM is cool, having a sales platform that accurately predicts the 100 opportunities you can close this quarter is worth breaking the bank for. Having a cute avatar answer your customer support chats seems nice enough, but predicting ahead of time what areas of your product will get support requests so that you can fix them before customers suffer is pure gold."}, {"c9ad": "It’s happening! (already)"}, {"2eb2": "Though bots get all the glamour, headless AI is quietly happening everywhere already. These new platforms are generally purpose-built solutions optimized around specific domains and outcomes data. They learn not from people talking to them, but by voraciously chomping up all of the relevant proprietary data fed into them. The best systems employ learning loops and massive streams of incoming data to constantly improve."}, {"90ba": "This creates a multiplier effect: the earlier and more pervasively an organization rolls out headless AI solutions, the more quickly the positive results compound. If you wait a year to deploy, you don’t just lose the year of improved productivity — you lose the year of learning and adaptation of the software to your company’s patterns. This puts you doubly behind."}, {"617b": "Companies like Apple, Expedia, and Johnson & Johnson use Textio’s augmented writing platform to chop weeks off the time it takes them to fill open jobs. DeepMind helped Google reduce power consumption in their data centers by 15%. A former NSA analyst created Area 1 Security to predict cyberattacks before they happen."}, {"3018": "Textio’s augmented writing platform"}, {"a0f6": "These new headless AI companies, and dozens of others, are helping enterprises make radical productivity leaps today that they haven’t seen from software in decades."}, {"8417": "Headless AI is where the money is"}, {"8528": "I’m not sure if there’s a revenue model that works for bots. I guess we will see. People are trying to figure that out. I’m thankful I don’t have to!"}, {"b8f2": "What I do know is that there is a lot of money to be made in transforming the efficiency of core enterprise functions. This is what headless AI is all about."}, {"1bd1": "If you can improve a crucial business process in a decisive way by a clear and measurable amount, that is incredibly valuable."}, {"7eca": "What is most game changing about this kind of software is that it is purely quantitative. Unlike a bot, where the potential return on investment is fairly qualitative (“customers liked interacting with the bot”), most headless AI is fully in the realm of predicting the future and then helping you change that future. Something where the return on investment is measurable and evident."}, {"0c81": "Improving, in real life, the quantity, quality, and demographics of the people who walk through your front door with resumes in hand… how much is it worth to more quickly hire better people than your competition?"}, {"8c85": "If you can predict exactly who will buy what, when… how much could you improve your customer experience?"}, {"3ae8": "Because this kind of software proves itself through the numbers, it is inherently valuable and easy to budget for. Headless is where the real AI money is."}, {"3a1e": "Headless AI everywhere"}, {"3428": "In the near future, every core business function will have been transformed by AI—hiring, sales, security, marketing, finance, manufacturing… everything. Purpose-built headless AI platforms will provide the new infrastructure which will drive every business."}, {"ffd0": "The enterprises who are already on this train are getting an outsized advantage until everyone else catches up. Legacy software will get squeezed down into a smaller portion of the IT wallet as the most valuable services become the native AI platforms—just as form-based desktop software got squeezed out by the cloud in the last generation."}, {"1c68": "Bots are here to stay. They’ll keep getting headlines. “OK Google, search for tacobot.”"}, {"2042": "But the real enterprise revolution is happening in the companies who are using headless AI to transform their core businesses."}, {"a4e1": "Try Textio for free at textio.com"}], "content": "Why bots aren’t the real AI disruption The quiet rise of headless AI “Hey Siri, how’s the weather today?”“OK Google, remind me to pay the power bill.”“Alexa, tell me a joke!” Bots are eating the world. Whether you are an enterprising app developer building the essential software to bring a virtual Taylor Swift into your Slack chats, or just lonely and in need of a dumb, annoying virtual friend to message you on Facebook, we seem to be clear on one thing: many experiences, apps, sites, and products are breathlessly going to be replaced with bots. (Unless they are being replaced with VR. Or AR. Or a typewriter keyboard for your iPhone.) It’s official: “bot for X” is the new “Uber for X”. And sure, bots are cool. Ever since ELIZA struggled to pass the Turing Test and HAL 9000 murdered his crew (later reincarnated in a hardly-remembered Apple Super Bowl commercial) we’ve been infatuated with the idea of computers as our inevitable sidekicks. Bots center around one specific niche aspect of artificial intelligence: conversational understanding. Human factors experts have long been enthralled by the idea that a more natural way to communicate with computers would be through speech, and we’ve spent the better part of a century building to a point where natural conversations may soon be a reality. While this is indeed an important step forward in human-computer interaction, it is truly just one small part of what AI is about—and not the part that will matter the most for the enterprise companies who actually buy almost $4 trillion in software and services each year. Bots are the new command line Today, most bots just provide a wrapper around existing functionality. Much as in the early days of graphical user interface (GUI), the point-and-click interface provided different ways of achieving the same tasks you could do on the command line, most bots provide an additional channel with which to do tasks you likely often do another way. Instead of speaking a specific sentence, you can open the Weather app on your iPhone. You can open your task list and type “Pay the power bill.” You could search Google for a viola joke. Many of today’s bots are kind of a hipster façade around the same basic command line interfaces consumers abandoned in the 1980s. They require specific syntaxes and understand only a limited vocabulary—but they sure have personality! format /q /fs:fat /v:mydisk wasn’t nearly this funny back in the day. Yes, Taco Bell really did this. While the added convenience of language recognition is a benefit, until bots are capable of performing very complex and novel tasks that richly combine actions and context across the boundaries of apps and sites in unique ways the first time they are asked, we will be limited to trying to remember the 489 commands Siri recognizes. (Yes that link is a man page for Siri. ~sigh~) The rise of headless AI But I’m not down on bots. I’m just a lot more excited by the less-flashy flavor of AI that is changing the nature of work itself: headless AI. Headless AI is the application of artificial intelligence to vastly improve internal business processes. It is fully transforming the crucial machinery of business—processes like hiring, lead generation, financial modeling, and information security. Legacy software has become commodity in all of these areas, and purpose-built AI solutions will get a larger and larger wallet share of these huge enterprise cost centers. Headless AI combines machine intelligence and learning loops to constantly evolve. Because these solutions plug into the data lifeblood of a company, they become incredibly valuable as the algorithms adapt to the patterns that work. I call this form of AI “headless” because, unlike bots, the value is mostly not about the personality. Headless AI works with humans and augments their strengths; it doesn’t try to replace them. It gives people superpowers. While being able to talk to your CRM is cool, having a sales platform that accurately predicts the 100 opportunities you can close this quarter is worth breaking the bank for. Having a cute avatar answer your customer support chats seems nice enough, but predicting ahead of time what areas of your product will get support requests so that you can fix them before customers suffer is pure gold. It’s happening! (already) Though bots get all the glamour, headless AI is quietly happening everywhere already. These new platforms are generally purpose-built solutions optimized around specific domains and outcomes data. They learn not from people talking to them, but by voraciously chomping up all of the relevant proprietary data fed into them. The best systems employ learning loops and massive streams of incoming data to constantly improve. This creates a multiplier effect: the earlier and more pervasively an organization rolls out headless AI solutions, the more quickly the positive results compound. If you wait a year to deploy, you don’t just lose the year of improved productivity — you lose the year of learning and adaptation of the software to your company’s patterns. This puts you doubly behind. Companies like Apple, Expedia, and Johnson & Johnson use Textio’s augmented writing platform to chop weeks off the time it takes them to fill open jobs. DeepMind helped Google reduce power consumption in their data centers by 15%. A former NSA analyst created Area 1 Security to predict cyberattacks before they happen. Textio’s augmented writing platform These new headless AI companies, and dozens of others, are helping enterprises make radical productivity leaps today that they haven’t seen from software in decades. Headless AI is where the money is I’m not sure if there’s a revenue model that works for bots. I guess we will see. People are trying to figure that out. I’m thankful I don’t have to! What I do know is that there is a lot of money to be made in transforming the efficiency of core enterprise functions. This is what headless AI is all about. If you can improve a crucial business process in a decisive way by a clear and measurable amount, that is incredibly valuable. What is most game changing about this kind of software is that it is purely quantitative. Unlike a bot, where the potential return on investment is fairly qualitative (“customers liked interacting with the bot”), most headless AI is fully in the realm of predicting the future and then helping you change that future. Something where the return on investment is measurable and evident. Improving, in real life, the quantity, quality, and demographics of the people who walk through your front door with resumes in hand… how much is it worth to more quickly hire better people than your competition? If you can predict exactly who will buy what, when… how much could you improve your customer experience? Because this kind of software proves itself through the numbers, it is inherently valuable and easy to budget for. Headless is where the real AI money is. Headless AI everywhere In the near future, every core business function will have been transformed by AI—hiring, sales, security, marketing, finance, manufacturing… everything. Purpose-built headless AI platforms will provide the new infrastructure which will drive every business. The enterprises who are already on this train are getting an outsized advantage until everyone else catches up. Legacy software will get squeezed down into a smaller portion of the IT wallet as the most valuable services become the native AI platforms—just as form-based desktop software got squeezed out by the cloud in the last generation. Bots are here to stay. They’ll keep getting headlines. “OK Google, search for tacobot.” But the real enterprise revolution is happening in the companies who are using headless AI to transform their core businesses. Try Textio for free at textio.com ", "name": "784", "child": "784_1\t784_2", "timestamp": "Apr 13"}