{"parent": "", "title": "Analyzing the Automotive Industry — Earlybird’s Guide to Disruption", "author": "Julius Rüßmann", "sentences": [{"0e84": "Analyzing the Automotive Industry — Earlybird’s Guide to Disruption"}, {"e137": "Knight Industries Two Thousand Micro Processor aka K.I.T.T 2000"}, {"68a0": "When I was a kid watching Knight Rider was a big deal. One has to admit, though, that the combination of the super cool Hoff and the super smart KITT is a tough one to top. However, looking back today — with a technology investor’s viewpoint — I refuse to ignore the very obvious anymore: a car that smart, capable and versatile as KITT would have driven autonomously, or wouldn’t it? But I get it: The Hoff just face-timing and snapping all the time while he is driven and flown around by KITT, probably wouldn’t have been such an entertaining series hit."}, {"5637": "Talking 2017 reality, however, the disruption of the automotive industry, marked by a dramatic paradigms shift towards high-dynamic, on the spot consumption of mobility services, is no longer reversible. Success stories such as the trade sale of Israel-based company MobileEye to Intel for $ 15bn are only the tip of the iceberg, but make evident why the discussion of this transformation is vital; even more if you are a Germany headquartered Venture Capital Firm with a Pan-European investment focus:"}, {"1fd4": "The relevance of the automotive industry for the German economy is unparalleled. A fact most of us would not challenge, but let’s speak data and validate the assumption: €20bn are annually spend by German OEMs in Germany on R&D investments — translating into 10 patents registration per day and more than 100,000 people being employed in automotive R&D. About 20% of annually produced automobiles worldwide are manufactured by German OEMs. Aggregately, German OEMs contribute 20% of the entire German GDP. Pouring these facts in a economic-like framework one could call it the 20–20–20 input, output and effect cycle (see below)."}, {"a2be": "The German triple 20 cycle."}, {"760b": "The Sword of the Damocles"}, {"50e6": "This said, there is not much doubt that the prosper and thriving economy we see today in Germany deeply roots in the pioneering work contributed by engineers, such as Karl Benz who invented the car over 125 years ago. The work of him and others effectively enabled German auto manufacturers to assume first mover position and to defend this position successfully until today."}, {"9b43": "Germany’s domination of the global automotive industry."}, {"f51d": "A structural analysis reveals that more than 25% of global automotive brands are German or directly owned by a German OEM. This translates to an effective 80% market penetration in the global premium automobile segment. The big picture perspective makes it even more evident: German automotive companies generate annual turnover gravitating towards €400bn; this yields a market share of almost 20% in this global €2tn industry."}, {"d082": "However, this very privileged economic situation is also somewhat double-edged (think: cluster risk). Being driven by the automotive industry, the German economy is also highly dependent on this industry’s survival and future growth, or to recall Churchill: “Where there is great power there is great responsibility”. Having remained almost unchanged for the last 100 years, the automotive industry today is literally in motion with an ever accelerating dynamic. Digitization, being all-pervasive by definition, introduces innovative technologies, transformational business models and entirely new players to the market, posing a exceptional challenge to the status quo. But where there is disruption there is opportunity. Given the holistic significance inherent to the European automotive industry, “auto tech” naturally became an integral part of Earlybird’s investment strategy. So let’s have a look what auto tech means for us, what sort of companies we are looking for and why we are the right partner to talk to for this topic."}, {"e257": "Mapping out the automotive value chain"}, {"e792": "Analyzing the value chain of an industry provides several key insights that are critical in order to derive an effective investment strategy and to get a well-rounded understanding. Among other factors, I deem the identification of the revenue generating units, the main cost blocks as well as assessing the degree of market fragmentation to be central. In the best case you are left with a strong indication on where to dig deeper in order to find innovative and agile early stage companies that may benefit from the redistribution of profit centers (think of Porter’s five forces)."}, {"9e65": "Applying this rational to the automotive industry leaves one with something like the graphic below. Equivalent to any value chain, there are input, value adding and output factors. Evidently this is a simplified view of the value chain which is, especially in the case of the automotive industry, significantly more complex."}, {"392d": "Key findings include: main value creation today still is achieved by OEM’S founded on their strong, centralized and interwoven market position. A status quo being intensely pressured by newly emerging, aggressively operating companies up- and downstream the value chain."}, {"460d": "So what is driving this dissolving dynamic and how to find disrupting opportunities?"}, {"6d29": "For those who follow the tech sector for a while now this may feel like a déjà vu. Analogously to what has happened to the personal computer industry in the 1980’s/90’s, the automotive industry is about to be transformed — „Software is eating the world“, ongoing. When Microsoft introduced MS-DOS in the late 1980’s, followed by Windows in the 1990’s, the computer industry was irreversibly disrupted. Software was taking over the role of growth driven innovation and hardware, which had been the main source economic value creation, started to be commoditized. A transformation the mobile phone industry equally underwent: An industry that was a couple of years ago dominated by hardware companies such as Nokia, Motorola and BlackBerry, today is split between Apple and Google. Two companies that very well know that software is key for scalable and impacting business models. Taking this thought of hardware versus software one step further one recognizes why this finding is particular important for the automotive industry. The modern car is in fact among the largest connected devices available on the market. And what has happened to the personal computer and mobile phone market, one-to-one applies to the automotive industry. The automobile will soon be a networked device, composed by swappable hardware components, ultimately defined by the software and applications in runs on. The balance of power is about to shift from OEM’s to suppliers and software companies — and the race is already on, although not clearly decided yet."}, {"2f56": "What we look for"}, {"53d8": "As innovation pace is gaining momentum, we very closely screen the automotive industry for impact-driven as well as game-changing companies. As illustrated by the value chain graph inserted above, we expect two types of companies to emerge, scale and ultimately capture a significant market share, namely fast moving technology companies located upstream and downstream of the value chain. This hypothesis translates into expected deal flow in the following clusters:"}, {"0759": "I. We look for companies that develop entirely new sources of data through sensors and / or software applications that offer leverage to increase the connectivity and smartness of a car. We believe that European companies can become a key factor for facilitating the race towards level 4 / 5 autonomy."}, {"9f38": "II. We also look for companies that redefine how value is created and provided to the customer, the“Uberization” of mobility services is a good example. As it has been the case in several other industries, the emergence of platforms that digitize, bundle and match relevant parties will also in the automotive industry play a key role. Asset-light, high-margin, digital first companies will offer enormous potential. Although this market has already brought forward several global players, such as Uber, Lyft and Gett among others, we think that a variety of potential models have yet no been realized."}, {"732a": "That being said, we believe that there are plenty of opportunities to facilitate the automotive industry’s transition from a hardware only to a software first strategy. We think that Europe has to assume a leading role in this transformational process and can do so by leveraging its’ natural strength. But partnering with people that understand 21st century entrepreneurship and have a native understanding of digital business models remains essential to succeed collectively in this high-dynamic market. So let’s talk!"}], "content": "Analyzing the Automotive Industry — Earlybird’s Guide to Disruption Knight Industries Two Thousand Micro Processor aka K.I.T.T 2000 When I was a kid watching Knight Rider was a big deal. One has to admit, though, that the combination of the super cool Hoff and the super smart KITT is a tough one to top. However, looking back today — with a technology investor’s viewpoint — I refuse to ignore the very obvious anymore: a car that smart, capable and versatile as KITT would have driven autonomously, or wouldn’t it? But I get it: The Hoff just face-timing and snapping all the time while he is driven and flown around by KITT, probably wouldn’t have been such an entertaining series hit. Talking 2017 reality, however, the disruption of the automotive industry, marked by a dramatic paradigms shift towards high-dynamic, on the spot consumption of mobility services, is no longer reversible. Success stories such as the trade sale of Israel-based company MobileEye to Intel for $ 15bn are only the tip of the iceberg, but make evident why the discussion of this transformation is vital; even more if you are a Germany headquartered Venture Capital Firm with a Pan-European investment focus: The relevance of the automotive industry for the German economy is unparalleled. A fact most of us would not challenge, but let’s speak data and validate the assumption: €20bn are annually spend by German OEMs in Germany on R&D investments — translating into 10 patents registration per day and more than 100,000 people being employed in automotive R&D. About 20% of annually produced automobiles worldwide are manufactured by German OEMs. Aggregately, German OEMs contribute 20% of the entire German GDP. Pouring these facts in a economic-like framework one could call it the 20–20–20 input, output and effect cycle (see below). The German triple 20 cycle. The Sword of the Damocles This said, there is not much doubt that the prosper and thriving economy we see today in Germany deeply roots in the pioneering work contributed by engineers, such as Karl Benz who invented the car over 125 years ago. The work of him and others effectively enabled German auto manufacturers to assume first mover position and to defend this position successfully until today. Germany’s domination of the global automotive industry. A structural analysis reveals that more than 25% of global automotive brands are German or directly owned by a German OEM. This translates to an effective 80% market penetration in the global premium automobile segment. The big picture perspective makes it even more evident: German automotive companies generate annual turnover gravitating towards €400bn; this yields a market share of almost 20% in this global €2tn industry. However, this very privileged economic situation is also somewhat double-edged (think: cluster risk). Being driven by the automotive industry, the German economy is also highly dependent on this industry’s survival and future growth, or to recall Churchill: “Where there is great power there is great responsibility”. Having remained almost unchanged for the last 100 years, the automotive industry today is literally in motion with an ever accelerating dynamic. Digitization, being all-pervasive by definition, introduces innovative technologies, transformational business models and entirely new players to the market, posing a exceptional challenge to the status quo. But where there is disruption there is opportunity. Given the holistic significance inherent to the European automotive industry, “auto tech” naturally became an integral part of Earlybird’s investment strategy. So let’s have a look what auto tech means for us, what sort of companies we are looking for and why we are the right partner to talk to for this topic. Mapping out the automotive value chain Analyzing the value chain of an industry provides several key insights that are critical in order to derive an effective investment strategy and to get a well-rounded understanding. Among other factors, I deem the identification of the revenue generating units, the main cost blocks as well as assessing the degree of market fragmentation to be central. In the best case you are left with a strong indication on where to dig deeper in order to find innovative and agile early stage companies that may benefit from the redistribution of profit centers (think of Porter’s five forces). Applying this rational to the automotive industry leaves one with something like the graphic below. Equivalent to any value chain, there are input, value adding and output factors. Evidently this is a simplified view of the value chain which is, especially in the case of the automotive industry, significantly more complex. Key findings include: main value creation today still is achieved by OEM’S founded on their strong, centralized and interwoven market position. A status quo being intensely pressured by newly emerging, aggressively operating companies up- and downstream the value chain. So what is driving this dissolving dynamic and how to find disrupting opportunities? For those who follow the tech sector for a while now this may feel like a déjà vu. Analogously to what has happened to the personal computer industry in the 1980’s/90’s, the automotive industry is about to be transformed — „Software is eating the world“, ongoing. When Microsoft introduced MS-DOS in the late 1980’s, followed by Windows in the 1990’s, the computer industry was irreversibly disrupted. Software was taking over the role of growth driven innovation and hardware, which had been the main source economic value creation, started to be commoditized. A transformation the mobile phone industry equally underwent: An industry that was a couple of years ago dominated by hardware companies such as Nokia, Motorola and BlackBerry, today is split between Apple and Google. Two companies that very well know that software is key for scalable and impacting business models. Taking this thought of hardware versus software one step further one recognizes why this finding is particular important for the automotive industry. The modern car is in fact among the largest connected devices available on the market. And what has happened to the personal computer and mobile phone market, one-to-one applies to the automotive industry. The automobile will soon be a networked device, composed by swappable hardware components, ultimately defined by the software and applications in runs on. The balance of power is about to shift from OEM’s to suppliers and software companies — and the race is already on, although not clearly decided yet. What we look for As innovation pace is gaining momentum, we very closely screen the automotive industry for impact-driven as well as game-changing companies. As illustrated by the value chain graph inserted above, we expect two types of companies to emerge, scale and ultimately capture a significant market share, namely fast moving technology companies located upstream and downstream of the value chain. This hypothesis translates into expected deal flow in the following clusters: I. We look for companies that develop entirely new sources of data through sensors and / or software applications that offer leverage to increase the connectivity and smartness of a car. We believe that European companies can become a key factor for facilitating the race towards level 4 / 5 autonomy. II. We also look for companies that redefine how value is created and provided to the customer, the“Uberization” of mobility services is a good example. As it has been the case in several other industries, the emergence of platforms that digitize, bundle and match relevant parties will also in the automotive industry play a key role. Asset-light, high-margin, digital first companies will offer enormous potential. Although this market has already brought forward several global players, such as Uber, Lyft and Gett among others, we think that a variety of potential models have yet no been realized. That being said, we believe that there are plenty of opportunities to facilitate the automotive industry’s transition from a hardware only to a software first strategy. We think that Europe has to assume a leading role in this transformational process and can do so by leveraging its’ natural strength. But partnering with people that understand 21st century entrepreneurship and have a native understanding of digital business models remains essential to succeed collectively in this high-dynamic market. So let’s talk! ", "name": "786", "child": "786_1", "timestamp": "Apr 10"}