{"parent": "", "title": "Embracing Blockchain — Tracking Trends", "author": "Vani Kola", "sentences": [{"8ac5": "Embracing Blockchain — Tracking Trends"}, {"3f03": "As humans, we are wired to find ways to lower uncertainty and increase trust with one another prior to exchanging value. Historically, we have relied on political and economic institutions such as banks, corporations, media and governments to reduce the trust deficit. Interestingly, this year at the World Economic Forum in Davos, David Edelman cited his annual trust barometer report (an online survey composed of 33,000+ respondents in 28 countries), titled an “Implosion of trust” indicating that trust in institutions has declined with the survey results indicating 85% aren’t working towards their best interests, and governments are distrusted in 75% of these countries."}, {"1b7f": "If there is any technology that has the potential to solve the problem of distrust and uncertainty in exchanging value it is the blockchain. Endorsed as the second coming of the internet, blockchain, if widely adopted has the ability to transform and fundamentally change how we exchange value disrupting the notion of an institution."}, {"942e": "Blockchain was first introduced in the original source code of bitcoin in 2008. Over the years it has radically evolved and is gaining recognition with Google searches for “blockchain” growing 1900% since 2013 being a key indicator of its immense popularity. The heart of blockchain’s potential lies in its distinctive properties of a distributed database and ability to improve transparency, security and efficiency across sectors."}, {"fc02": "What is “Blockchain”?"}, {"0769": "Blockchain is a decentralized database that records a registry of assets and transactions across a peer-to-peer network. Every transaction is secured through cryptography, and over time, the blocks of data are linked together to create an immutable and highly integral record of all transactions across this network. This record is duplicated across every computer that uses the network."}, {"85c8": "A close comparison to blockchain would be Wikipedia, an open platform that stores words, images and changes it to visible data over the internet. Today, we can create, access, constantly change and time track any information on Wikipedia, because the core technology is its data infrastructure. Likewise, you can think of blockchain as an open and secure infrastructure to store assets. The technology can create and store information from a simple contract to documents pertaining to ownership of real estate or Intellectual Property across a network that is secure. A difference between the two is that data on blockchain is immutable and hard to tamper with."}, {"78fc": "How does it Work?"}, {"d1e2": "Source — Financial Times"}, {"136c": "Key Features:"}, {"d1a3": "“One can think of blockchain as the layers in a geological formation. The surface layers may change with seasons, or even be blown away before settling down. As you go a few inches deep, the layers become more stable. When you look a few feet down, you are looking at a snapshot of the past that has remained undisturbed for millions of years” — Mastering Bitcon: Unlocking Crypto Currencies, Andreas Antonopoulous"}, {"d659": "How is it beneficial?"}, {"839d": "Where are we with Blockchain today?"}, {"681b": "Blockchain is at a very nascent stage. Multiple financial institutions have been exploring opportunities and partnerships with respect to blockchain. Most notably, Santander Bank identified 20–25 use cases for technology to reduce infrastructure costs up to USD 20 Billion every year and UBS has set up a blockchain research lab in London. It is forecasted that 80% of banks will have initiated Distributed Ledger Technology (DLT) projects by 2017 with the intention of saving market infrastructure costs including messaging, matching, payments, remittances, trade reporting, contracts, reconciliation and middle-office processes."}, {"2583": "Some of the use-cases for financial institutions in the order of priority (scale of 1 (low) — 5 (high)) for testing and application are given below:"}, {"ff81": "Source — Infosys & Let’s Talk Payments"}, {"ce8c": "In the recent past, the non-financial services applications of blockchain have emerged with 100+ start-ups being founded globally. Some of the sectors investors and founders are most optimistic on include healthcare, real estate, and retail, amongst others, for various use cases ranging from smart contracts, health records, cross border transactions to music distribution. Given below is an infographic of potential blockchain use cases:"}, {"1a51": "Source — QInsights"}, {"59e7": "Global Funding:"}, {"bcfb": "According to The Wall Street Journal, about 2–3% of the total VC funding of about USD 20 Billion in financial services has gone into blockchain. The year-on-year dollars invested in early stage blockchain companies at the end of 2016 stands at USD 422 Million compared to USD 292 Million at the end of 2015 (45.7% growth), indicating a bullish investor take on the technology. At the end of 2016, there were a total of 730 blockchain companies founded across financial services, technology, consumer and enterprise out of which 225 (30.8%) of them are currently funded."}, {"a536": "Source — Tracxn"}, {"c165": "Blockchain In India:"}, {"557e": "Until the end of 2016, the blockchain buzz in India has been restricted mostly to bitcoin and cryptocurrency with minimal seed stage and series A funding. Late last year, ICICI bank settled its first blockchain based export transaction with its middle eastern counterpart Emirates NBD with Infosys’ EdgeVerve systems serving as technology partner. With efforts being made by the regulators to push for a cashless economy and a research wing dedicated to look into blockchain and the issuance of digital currency, the industry looks promising. 2017 kicked off with leading Indian banks and financial services companies announcing their pilots on non-crypto currency based blockchain applications."}, {"0b55": "Additionally, Gates Foundation is exploring blockchain as a potential solution to solve for financial inclusion and reach the 200 million unbanked Indians. Looking forward to a less-cash India, I see all the right building blocks in place — UPI, the India Stack launch in 2016 and the Digital India initiative by our Prime Minister. I hope to see innovative ideas and startups in blockchain adopting BCT and leveraging resources of the ecosystem to build companies with decentralised solutions. The main use cases that are ripe for disruption in India specifically are micro-finance, cooperative loans, peer-to-peer insurance, education, healthcare and governance (decentralised e-office, e-cabinet & e-procurement portals). As for talent, governing bodies are attempting partnerships with well-established institutions to train, nurture and enable education in the sector."}, {"2692": "With its potential to revolutionize the global economy, I expect blockchain to be an emerging investment theme, not only for venture capitalists, but also banks, information technology companies and global organizations in the coming years. Currently, although the industry is nascent in India with very few leading authorities and influencers on the topic, we are well positioned to steer its commercialisation."}, {"6ccb": "Acknowledging, Siddhanth Jayaram a contributor to this article. Siddhanth is a Kstart Fellow  #TrackingTrends is a series of articles on topics, technologies and trends that are likely to have an impact on us in the years to come."}, {"45b2": "Note — Kalaari or Kstart is not an investor in the above mentioned start-ups."}, {"491d": "Disclaimer: It is strictly an independent opinion of the writer, not representative of Kstart or Kalaari"}], "content": "Embracing Blockchain — Tracking Trends As humans, we are wired to find ways to lower uncertainty and increase trust with one another prior to exchanging value. Historically, we have relied on political and economic institutions such as banks, corporations, media and governments to reduce the trust deficit. Interestingly, this year at the World Economic Forum in Davos, David Edelman cited his annual trust barometer report (an online survey composed of 33,000+ respondents in 28 countries), titled an “Implosion of trust” indicating that trust in institutions has declined with the survey results indicating 85% aren’t working towards their best interests, and governments are distrusted in 75% of these countries. If there is any technology that has the potential to solve the problem of distrust and uncertainty in exchanging value it is the blockchain. Endorsed as the second coming of the internet, blockchain, if widely adopted has the ability to transform and fundamentally change how we exchange value disrupting the notion of an institution. Blockchain was first introduced in the original source code of bitcoin in 2008. Over the years it has radically evolved and is gaining recognition with Google searches for “blockchain” growing 1900% since 2013 being a key indicator of its immense popularity. The heart of blockchain’s potential lies in its distinctive properties of a distributed database and ability to improve transparency, security and efficiency across sectors. What is “Blockchain”? Blockchain is a decentralized database that records a registry of assets and transactions across a peer-to-peer network. Every transaction is secured through cryptography, and over time, the blocks of data are linked together to create an immutable and highly integral record of all transactions across this network. This record is duplicated across every computer that uses the network. A close comparison to blockchain would be Wikipedia, an open platform that stores words, images and changes it to visible data over the internet. Today, we can create, access, constantly change and time track any information on Wikipedia, because the core technology is its data infrastructure. Likewise, you can think of blockchain as an open and secure infrastructure to store assets. The technology can create and store information from a simple contract to documents pertaining to ownership of real estate or Intellectual Property across a network that is secure. A difference between the two is that data on blockchain is immutable and hard to tamper with. How does it Work? Source — Financial Times Key Features: “One can think of blockchain as the layers in a geological formation. The surface layers may change with seasons, or even be blown away before settling down. As you go a few inches deep, the layers become more stable. When you look a few feet down, you are looking at a snapshot of the past that has remained undisturbed for millions of years” — Mastering Bitcon: Unlocking Crypto Currencies, Andreas Antonopoulous How is it beneficial? Where are we with Blockchain today? Blockchain is at a very nascent stage. Multiple financial institutions have been exploring opportunities and partnerships with respect to blockchain. Most notably, Santander Bank identified 20–25 use cases for technology to reduce infrastructure costs up to USD 20 Billion every year and UBS has set up a blockchain research lab in London. It is forecasted that 80% of banks will have initiated Distributed Ledger Technology (DLT) projects by 2017 with the intention of saving market infrastructure costs including messaging, matching, payments, remittances, trade reporting, contracts, reconciliation and middle-office processes. Some of the use-cases for financial institutions in the order of priority (scale of 1 (low) — 5 (high)) for testing and application are given below: Source — Infosys & Let’s Talk Payments In the recent past, the non-financial services applications of blockchain have emerged with 100+ start-ups being founded globally. Some of the sectors investors and founders are most optimistic on include healthcare, real estate, and retail, amongst others, for various use cases ranging from smart contracts, health records, cross border transactions to music distribution. Given below is an infographic of potential blockchain use cases: Source — QInsights Global Funding: According to The Wall Street Journal, about 2–3% of the total VC funding of about USD 20 Billion in financial services has gone into blockchain. The year-on-year dollars invested in early stage blockchain companies at the end of 2016 stands at USD 422 Million compared to USD 292 Million at the end of 2015 (45.7% growth), indicating a bullish investor take on the technology. At the end of 2016, there were a total of 730 blockchain companies founded across financial services, technology, consumer and enterprise out of which 225 (30.8%) of them are currently funded. Source — Tracxn Blockchain In India: Until the end of 2016, the blockchain buzz in India has been restricted mostly to bitcoin and cryptocurrency with minimal seed stage and series A funding. Late last year, ICICI bank settled its first blockchain based export transaction with its middle eastern counterpart Emirates NBD with Infosys’ EdgeVerve systems serving as technology partner. With efforts being made by the regulators to push for a cashless economy and a research wing dedicated to look into blockchain and the issuance of digital currency, the industry looks promising. 2017 kicked off with leading Indian banks and financial services companies announcing their pilots on non-crypto currency based blockchain applications. Additionally, Gates Foundation is exploring blockchain as a potential solution to solve for financial inclusion and reach the 200 million unbanked Indians. Looking forward to a less-cash India, I see all the right building blocks in place — UPI, the India Stack launch in 2016 and the Digital India initiative by our Prime Minister. I hope to see innovative ideas and startups in blockchain adopting BCT and leveraging resources of the ecosystem to build companies with decentralised solutions. The main use cases that are ripe for disruption in India specifically are micro-finance, cooperative loans, peer-to-peer insurance, education, healthcare and governance (decentralised e-office, e-cabinet & e-procurement portals). As for talent, governing bodies are attempting partnerships with well-established institutions to train, nurture and enable education in the sector. With its potential to revolutionize the global economy, I expect blockchain to be an emerging investment theme, not only for venture capitalists, but also banks, information technology companies and global organizations in the coming years. Currently, although the industry is nascent in India with very few leading authorities and influencers on the topic, we are well positioned to steer its commercialisation. Acknowledging, Siddhanth Jayaram a contributor to this article. Siddhanth is a Kstart Fellow  #TrackingTrends is a series of articles on topics, technologies and trends that are likely to have an impact on us in the years to come. Note — Kalaari or Kstart is not an investor in the above mentioned start-ups. Disclaimer: It is strictly an independent opinion of the writer, not representative of Kstart or Kalaari ", "name": "787", "child": "787_1", "timestamp": "Mar 15"}