{"parent": "", "title": "How to build the next Trello and sell it for $425 million or more", "author": "Mitt Tarasowski", "sentences": [{"0b6a": "How to build the next Trello and sell it for $425 million or more"}, {"b351": "Atlassian bought Trello for $425 million. Because Trello was on trajectory to kill Atlassian."}, {"39d9": "So, how do you build the next Trello and get rich? By not building a Trello clone. Why? Trello is a classic example of a disruptive innovation. If you deal with disruptive innovation, the first mover takes everything. Atlassian bought Trello for $425 million not because of its brand or its user base, but because Trello was a big threat to the company’s future. That’s why Google and other companies make similar acquisitions. If you want to build a $400 million startup, build something simple. This essay explains why!"}, {"2f3a": "The rationale behind Trello’s acquisition."}, {"58b5": "Fog Creek launched Trello in 2011, and six years later sold it for $425 million. It was Atlassian’s biggest acquisition ever. But why did Atlassian pay so much money for Trello? Because Trello disrupted the project tracking space. Products based on disruptive technologies are typically cheaper, simpler, smaller, and more convenient to use."}, {"c022": "Trello brings a different value proposition to the market. Its value proposition is collaboration and simplicity. Jira’s value proposition is different. It seems that Atlassian is a well-managed company. Its managers did everything according to the books. They listened to their customers, and created a better and more complicated product. By adding new features, they sought to capture new customers. They went upmarket."}, {"bf77": "While the company’s revenue grew, its product became overly complicated and difficult to maintain. By moving upmarket, Atlassian created a vacuum at lower price points into which competitors with disruptive technologies could enter. This is what Trello did."}, {"106a": "Trello created a cheaper, simpler, and smaller version of Jira. It marketed its product to segments of customers, such as marketers, designers, and managers, which weren’t a focus for Atlassian. In 2011, there was no competition for Trello and it filled the vacuum created by Atlassian. Because Atlassian overshot the market."}, {"bf4f": "In their efforts to stay ahead by developing competitively superior products, many companies don’t realize the speed at which they are moving up-market. They fail to recognize that they’re over-satisfying the needs of their original customers as they race the competition towards higher-performance, higher-margin markets. And they fail to see that in doing so, they’re creating a vacuum at lower price points into which competitors employing disruptive technologies can enter. (See Clayton Christensen’s writings in The Innovator’s Dilemma.)"}, {"522d": "Trello Board Example"}, {"229f": "Source: Zapier.com"}, {"6300": "Jira Board Example"}, {"7f68": "Source: Spartez.com"}, {"d444": "At the same time, Jira became expensive. But its mainstream customers would accept fewer features for better pricing. That’s how Atlassian became vulnerable to attack from competitors with cheaper, simpler, and more convenient products."}, {"7e76": "By adding more features, Trello will also move upmarket and cross the mainstream market needs (the blue line). When it crosses the blue line, Jira’s mainstream customers will switch to Trello. This is how disruptive innovation overtakes established products. It happened to other industries, such as disk drives and mainframe computers. It will happen in the project tracking industry too."}, {"5328": "That’s why Trello became the biggest threat to Atlassian’s future. Trello became an attacker. Its product had less features. It was simple. And it was fucking cheap. It was disruptive!"}, {"df1b": "I’m not working for Atlassian. I have no connections to its employees. But I know how it feels when disruptive innovation meets a 15-year-old company. It sucks in all areas!"}, {"09f3": "The CEO of Atlassian did it right. Instead of trying to fight the disruptive technology, he accepted it and bought Trello. In an interview, he said:"}, {"be0f": "All companies fit into one of two buckets: either becoming a software company or being disrupted by one. Every industry is being fundamentally altered by software."}, {"dce0": "I’m sure many of Atlassian’s employees don’t understand this decision. Because it makes no sense for them. In their minds, Trello is a shitty product compared to Jira. But Atlassian’s CEO secured their jobs and salaries by buying Trello. Because Trello was on trajectory to kill Atlassian!"}, {"469e": "The market reaction was positive. Atlassian’s share price went from $25.03 on January 9th (the date of the announcement) to $28.03 January 23rd."}, {"2e2a": "Atlassian failed to build its own Trello."}, {"7e74": "According to Clayton Christensen, leadership in disruptive technology has been very important. Companies that entered the market first were six times more likely to succeed than those that entered later. Therefore, if Atlassian would even create its own version of Trello, there’s no evidence to suggest that product would succeed. Atlassian wasn’t a first mover."}, {"53ea": "But there is a bigger reason than the missed first-mover advantage. Atlassian is a public company. The company needs to grow its business by 30% per year. Therefore, everyone in the company needs to make money. Lots of money. And to make lots of money, you need big customers."}, {"f7e0": "In 2016, Atlassian generated $458 million in revenue. To grow 30% in 2017, it needed to generate an additional $137 million. In its shareholder letter, it forecast a total revenue in the range of $597 to $603 million."}, {"e82a": "According to Forbes.com, Trello generates around $10 million in annual recurring revenue. A clone of Trello is not going to help Atlassian reach its goal. Atlassian has many good managers, it seems. Good managers would never allocate resources to build another Trello, because doing so would not solve the company’s main problem: the question of how to grow revenue. Instead, they will do everything necessary to satisfy their biggest customers’ needs."}, {"4d6a": "Over time, they have created a set of values. They don’t care about a potential $10 million in revenue. They need an additional $137 million. Therefore, everyone at Atlassian has a focus on big customers and their needs. And big customers want a bigger, better, more complicated product."}, {"411a": "As we’ve learned, products based on disruptive technologies are typically cheaper, simpler, smaller, and more convenient. That’s the opposite of what Atlassian does. Atlassian’s set of values has no room for Trello’s disruptive innovation."}, {"0cd1": "So what happens after the acquisition of Trello?"}, {"d160": "I remember when Google bought Android. Android’s operations were not fully integrated into Google’s main business. Even Google’s employees had no access to the Android offices. As we can see, it was one of the Google’s best acquisitions. But why didn’t Google integrate Android into its main business? Simple. Because Google’s processes, values, and culture would have killed Android. That’s one of the main reasons for not integrating newly acquired companies."}, {"fcc9": "Atlassian is a 15-year-old-company. It has established processes, values, and culture. It works with different customer segments than Trello. Atlassian has 1,700 employees. Its executives now need to make a decision: Should the company integrate Trello or not."}, {"82fb": "If Atlassian’s executives are smart, they will not integrate Trello into their main business. And for Trello employees: If you hear that integration is on the way, start looking for a new job. If integration happens, it’s the beginning of the end. Because Trello is not a part of Atlassian’s values. If something is not a part of a company’s values, there is no priority for it!"}, {"4dbd": "The values of an organization are the criteria by which decisions about priorities are made, and the prioritization of decisions affects employees at every level. The values of successful firms tend to evovle in a predictable fashion in at least two dimensions. The first relates to acceptable gross margins. The second dimension along which values predictably change relates to how big a business must be in order to remain interesting. (Again, please see Clayton Christensen’s work in The Innovator’s Dilemma.)"}, {"c1ec": "Trello has created a new emerging market. There are no $800 million emerging markets. When emerging markets are small, they are least attractive to large companies. Therefore, Trello will become underserved in money and resources inside Atlassian."}, {"a4ec": "Trello will become the new Jira!"}, {"819f": "In a blog post, the CEO of Atlassian wrote: “Trello will become an important part of the Atlassian portfolio.” I guess it’s too early to tell the truth. It will be the other way around."}, {"8ea0": "In a few years, Trello will cross the blue line. Everything that mainstream customers want will be available in Trello. It’s the tipping point for customers of Jira. They will start to migrate to Trello."}, {"443d": "By crossing the blue line, Trello will enter the mainstream market. Trello will start to drive huge profits for Atlassian. The revenue generated by Trello will be higher than the revenue generated by Jira. This is the simple reason why Trello will become the new Jira!"}, {"3dae": "Of course, many of you think I’m crazy. But this is how disruptive innovation works. The weaknesses of Trello today will become strengths tomorrow."}, {"0c06": "These are the next $400 million startups."}, {"71ef": "Zapier published statistics about the fastest growing apps. In first place was Airtable, with a growth rate of 682%. I hadn’t heard of Airtable, and I was curious to know what it does. I checked out its website and learned that it’s basically a cheaper and simpler version of Microsoft Access. As we established earlier, products based on disruptive technologies are typically cheaper, simpler, smaller, and more convenient to use."}, {"fa1b": "What about Quip, the cloud-based word processing app? It was founded in 2012 and sold to Salesforce for $750 million. Quip is similar to Trello. Both are simple in terms of functionality. Quip is a disruptive innovation to Google Docs and Google Sheets. Just like how Google disrupted Microsoft Office not that many years ago."}, {"ab5a": "While some companies move upmarket and create complex products, others use the vacuum for innovation as an entry point. Through observation, you can find a vacuum in many industries. By filling the vacuum with simpler and cheaper technology, you can build a $400 million startup."}, {"f7a8": "There are some interesting industries waiting for disruptive innovation. One is the almost $4 billion marketing automation industry. Many years ago, the leaders in the marketing automation software field overshot the market. The same happened to the accounting software market."}, {"a463": "Scott Cook, Intuit’s founder, decided that the makers of accounting software for small businesses had overshot the functionality required by that market, thus creating an opportunity for a disruptive software technology that provided adequate but not superior functionality (and which was simple and convenient to use). Quickbooks proceeded to capture 70% of the market within two years of its introduction (Christensen)."}, {"e44a": "Create something new, but simpler and cheaper. Make something the mainstream market doesn’t want now, but will want later. The weaknesses of today will become the strengths of tomorrow."}, {"22a0": "If you want to get ideas for your $400 million startup, subscribe to my newsletter at http://tarasowski.co"}, {"b587": "PS: You’re reading this essay on Medium. Medium is a disruptive innovation to Wordpress. Wordpress overshot the market, and in doing so, they created a vacuum for innovation."}, {"dfa1": "If you enjoyed reading, please support my work by hitting that little heart!"}], "content": "How to build the next Trello and sell it for $425 million or more Atlassian bought Trello for $425 million. Because Trello was on trajectory to kill Atlassian. So, how do you build the next Trello and get rich? By not building a Trello clone. Why? Trello is a classic example of a disruptive innovation. If you deal with disruptive innovation, the first mover takes everything. Atlassian bought Trello for $425 million not because of its brand or its user base, but because Trello was a big threat to the company’s future. That’s why Google and other companies make similar acquisitions. If you want to build a $400 million startup, build something simple. This essay explains why! The rationale behind Trello’s acquisition. Fog Creek launched Trello in 2011, and six years later sold it for $425 million. It was Atlassian’s biggest acquisition ever. But why did Atlassian pay so much money for Trello? Because Trello disrupted the project tracking space. Products based on disruptive technologies are typically cheaper, simpler, smaller, and more convenient to use. Trello brings a different value proposition to the market. Its value proposition is collaboration and simplicity. Jira’s value proposition is different. It seems that Atlassian is a well-managed company. Its managers did everything according to the books. They listened to their customers, and created a better and more complicated product. By adding new features, they sought to capture new customers. They went upmarket. While the company’s revenue grew, its product became overly complicated and difficult to maintain. By moving upmarket, Atlassian created a vacuum at lower price points into which competitors with disruptive technologies could enter. This is what Trello did. Trello created a cheaper, simpler, and smaller version of Jira. It marketed its product to segments of customers, such as marketers, designers, and managers, which weren’t a focus for Atlassian. In 2011, there was no competition for Trello and it filled the vacuum created by Atlassian. Because Atlassian overshot the market. In their efforts to stay ahead by developing competitively superior products, many companies don’t realize the speed at which they are moving up-market. They fail to recognize that they’re over-satisfying the needs of their original customers as they race the competition towards higher-performance, higher-margin markets. And they fail to see that in doing so, they’re creating a vacuum at lower price points into which competitors employing disruptive technologies can enter. (See Clayton Christensen’s writings in The Innovator’s Dilemma.) Trello Board Example Source: Zapier.com Jira Board Example Source: Spartez.com At the same time, Jira became expensive. But its mainstream customers would accept fewer features for better pricing. That’s how Atlassian became vulnerable to attack from competitors with cheaper, simpler, and more convenient products. By adding more features, Trello will also move upmarket and cross the mainstream market needs (the blue line). When it crosses the blue line, Jira’s mainstream customers will switch to Trello. This is how disruptive innovation overtakes established products. It happened to other industries, such as disk drives and mainframe computers. It will happen in the project tracking industry too. That’s why Trello became the biggest threat to Atlassian’s future. Trello became an attacker. Its product had less features. It was simple. And it was fucking cheap. It was disruptive! I’m not working for Atlassian. I have no connections to its employees. But I know how it feels when disruptive innovation meets a 15-year-old company. It sucks in all areas! The CEO of Atlassian did it right. Instead of trying to fight the disruptive technology, he accepted it and bought Trello. In an interview, he said: All companies fit into one of two buckets: either becoming a software company or being disrupted by one. Every industry is being fundamentally altered by software. I’m sure many of Atlassian’s employees don’t understand this decision. Because it makes no sense for them. In their minds, Trello is a shitty product compared to Jira. But Atlassian’s CEO secured their jobs and salaries by buying Trello. Because Trello was on trajectory to kill Atlassian! The market reaction was positive. Atlassian’s share price went from $25.03 on January 9th (the date of the announcement) to $28.03 January 23rd. Atlassian failed to build its own Trello. According to Clayton Christensen, leadership in disruptive technology has been very important. Companies that entered the market first were six times more likely to succeed than those that entered later. Therefore, if Atlassian would even create its own version of Trello, there’s no evidence to suggest that product would succeed. Atlassian wasn’t a first mover. But there is a bigger reason than the missed first-mover advantage. Atlassian is a public company. The company needs to grow its business by 30% per year. Therefore, everyone in the company needs to make money. Lots of money. And to make lots of money, you need big customers. In 2016, Atlassian generated $458 million in revenue. To grow 30% in 2017, it needed to generate an additional $137 million. In its shareholder letter, it forecast a total revenue in the range of $597 to $603 million. According to Forbes.com, Trello generates around $10 million in annual recurring revenue. A clone of Trello is not going to help Atlassian reach its goal. Atlassian has many good managers, it seems. Good managers would never allocate resources to build another Trello, because doing so would not solve the company’s main problem: the question of how to grow revenue. Instead, they will do everything necessary to satisfy their biggest customers’ needs. Over time, they have created a set of values. They don’t care about a potential $10 million in revenue. They need an additional $137 million. Therefore, everyone at Atlassian has a focus on big customers and their needs. And big customers want a bigger, better, more complicated product. As we’ve learned, products based on disruptive technologies are typically cheaper, simpler, smaller, and more convenient. That’s the opposite of what Atlassian does. Atlassian’s set of values has no room for Trello’s disruptive innovation. So what happens after the acquisition of Trello? I remember when Google bought Android. Android’s operations were not fully integrated into Google’s main business. Even Google’s employees had no access to the Android offices. As we can see, it was one of the Google’s best acquisitions. But why didn’t Google integrate Android into its main business? Simple. Because Google’s processes, values, and culture would have killed Android. That’s one of the main reasons for not integrating newly acquired companies. Atlassian is a 15-year-old-company. It has established processes, values, and culture. It works with different customer segments than Trello. Atlassian has 1,700 employees. Its executives now need to make a decision: Should the company integrate Trello or not. If Atlassian’s executives are smart, they will not integrate Trello into their main business. And for Trello employees: If you hear that integration is on the way, start looking for a new job. If integration happens, it’s the beginning of the end. Because Trello is not a part of Atlassian’s values. If something is not a part of a company’s values, there is no priority for it! The values of an organization are the criteria by which decisions about priorities are made, and the prioritization of decisions affects employees at every level. The values of successful firms tend to evovle in a predictable fashion in at least two dimensions. The first relates to acceptable gross margins. The second dimension along which values predictably change relates to how big a business must be in order to remain interesting. (Again, please see Clayton Christensen’s work in The Innovator’s Dilemma.) Trello has created a new emerging market. There are no $800 million emerging markets. When emerging markets are small, they are least attractive to large companies. Therefore, Trello will become underserved in money and resources inside Atlassian. Trello will become the new Jira! In a blog post, the CEO of Atlassian wrote: “Trello will become an important part of the Atlassian portfolio.” I guess it’s too early to tell the truth. It will be the other way around. In a few years, Trello will cross the blue line. Everything that mainstream customers want will be available in Trello. It’s the tipping point for customers of Jira. They will start to migrate to Trello. By crossing the blue line, Trello will enter the mainstream market. Trello will start to drive huge profits for Atlassian. The revenue generated by Trello will be higher than the revenue generated by Jira. This is the simple reason why Trello will become the new Jira! Of course, many of you think I’m crazy. But this is how disruptive innovation works. The weaknesses of Trello today will become strengths tomorrow. These are the next $400 million startups. Zapier published statistics about the fastest growing apps. In first place was Airtable, with a growth rate of 682%. I hadn’t heard of Airtable, and I was curious to know what it does. I checked out its website and learned that it’s basically a cheaper and simpler version of Microsoft Access. As we established earlier, products based on disruptive technologies are typically cheaper, simpler, smaller, and more convenient to use. What about Quip, the cloud-based word processing app? It was founded in 2012 and sold to Salesforce for $750 million. Quip is similar to Trello. Both are simple in terms of functionality. Quip is a disruptive innovation to Google Docs and Google Sheets. Just like how Google disrupted Microsoft Office not that many years ago. While some companies move upmarket and create complex products, others use the vacuum for innovation as an entry point. Through observation, you can find a vacuum in many industries. By filling the vacuum with simpler and cheaper technology, you can build a $400 million startup. There are some interesting industries waiting for disruptive innovation. One is the almost $4 billion marketing automation industry. Many years ago, the leaders in the marketing automation software field overshot the market. The same happened to the accounting software market. Scott Cook, Intuit’s founder, decided that the makers of accounting software for small businesses had overshot the functionality required by that market, thus creating an opportunity for a disruptive software technology that provided adequate but not superior functionality (and which was simple and convenient to use). Quickbooks proceeded to capture 70% of the market within two years of its introduction (Christensen). Create something new, but simpler and cheaper. Make something the mainstream market doesn’t want now, but will want later. The weaknesses of today will become the strengths of tomorrow. If you want to get ideas for your $400 million startup, subscribe to my newsletter at http://tarasowski.co PS: You’re reading this essay on Medium. Medium is a disruptive innovation to Wordpress. Wordpress overshot the market, and in doing so, they created a vacuum for innovation. If you enjoyed reading, please support my work by hitting that little heart! ", "name": "791", "child": "791_1\t791_2\t791_3\t791_4\t791_5\t791_6\t791_7\t791_8\t791_9\t791_10\t791_11\t791_12\t791_13\t791_14\t791_15\t791_16\t791_17\t791_18\t791_19\t791_20\t791_21\t791_22\t791_23\t791_24", "timestamp": "Jan 24"}