{"parent": "", "title": "Deadlines", "author": "Brandon Chu", "sentences": [{"3524": "giphy.com"}, {"86d5": "Deadlines"}, {"be93": "For as long as I’ve been working in tech I’ve heard this oscillating debate about the use of deadlines in projects, with particularly strong opinions from those against them:"}, {"2baa": "“I don’t believe in deadlines. They are bullshit created by (predominantly business) people who don’t understand how hard it is to design and build great products. You cannot rush great [design, software, etc.]”"}, {"6d71": "I disagree, I believe in deadlines. Not because the date matters, but because they’re a powerful way to influence the behaviour of a team."}, {"5c90": "At the time of this writing, our team at Shopify is busy preparing for Unite, our annual partner & developer conference. It’s the final stretch of six months of work that started when we (internally) committed to launch a bunch of products at the conference."}, {"58a1": "It really is a great conference. See why so many developers build on Shopify."}, {"4d66": "Unite brings together thousands of people from our ecosystem, and on top of building the products themselves, our teams spend hundreds of hours preparing for presentations and workshops. It’s very hard to pull off, and a big investment of company energy. The pace is frantic, the months are stressful, and the chaos is draining."}, {"7f29": "Yet, no one forced us to have it. We happily impose this deadline on ourselves because it makes us better, and in turn, makes our product better."}, {"c85a": "Why deadlines work"}, {"9e50": "Deadlines work because they force critical thinking by adding a constraint. When a deadline is set on a project, magical things happen."}, {"c97f": "How to use Deadlines effectively"}, {"3d23": "There are two types of deadlines: those that matter, and those that don’t really matter at all."}, {"ea20": "The ones that matter tend to relate to either a short-lived opportunity, or a company’s survival. The day your startup runs out of cash is a deadline you don’t want to miss. You don’t even need to think about using these types o deadlines, they will use you."}, {"c3f1": "More interesting (and common), are deadlines that don’t actually matter."}, {"7f26": "Missed an arbitrary launch date by 3 weeks? Stakeholders may moan, but does it really matter? Just delay the blog post, and save that tweet for later. You’ll get roughly the same impact."}, {"eb10": "Even Shopify’s Unite conference doesn’t really matter. Would Shopify’s outcome materially change if a team missed the conference launch date? Unlikely. (jk team, jk 🙏)"}, {"8ad5": "Which brings us to the interesting part about using deadlines effectively. The meaning of the date is often irrelevant to it’s usefulness. You will get the behavioural benefits by just having a deadline for the sake of it."}, {"a152": "Using deadlines when the date doesn’t (really) matter"}, {"108c": "As a leader of a team, using deadlines when the date is irrelevant is tricky, because in order to get the behavioural effects to work for your team, you have to genuinely care about the date or they will see right through you."}, {"0bb0": "Am I suggesting you fake it? No, and I don’t think you need to."}, {"6a1f": "When runners are training, is there some universal force compelling them to care that today’s time was better than yesterday’s? No, runners aspire to hit the time for the sake of achieving it and for the pleasure in knowing they’re growing."}, {"54c6": "This should be your mentality when you rally your team around a deadline. Make it a point of team pride to achieve it. Make everyone want to meet the deadline, if not for the impact it will have to customers, than for the sake of the challenge and for what it says about them."}, {"0dc5": "How to avoid using deadlines disastrously"}, {"8f04": "Be wary of deadlines negatively influencing your decision making as you approach the ship-date."}, {"26ab": "If you don’t think it could happen to you, imagine leading a team and beating the “we can do it!” drum everyday for seven months. In that situation, don’t kid yourself — you are very emotionally vested in meeting the date. And that’s exactly when you will act irrationally."}, {"6360": "Here are a few reminders I give myself of as a deadline approaches:"}, {"fc5a": "No more debate"}, {"179f": "Deadlines work because constraints foster creativity and resourcefulness. There are countless examples of how deadlines pushed teams to do more than they thought they could. Think moon landing, think Tesla even though they miss every one."}, {"0d22": "Deadlines work even when dates are arbitrary, because they give a team a challenge and something to prove."}, {"bfa3": "Deadlines work, but they must be used with care and in service of good products, not in priority to them."}, {"6039": "Deadlines make product teams better, and that’s why I believe in them."}, {"5824": "Bonus — how to pick a date when there isn’t an obvious one:"}, {"43f5": "Before you go, some things to consider:"}], "content": "giphy.com Deadlines For as long as I’ve been working in tech I’ve heard this oscillating debate about the use of deadlines in projects, with particularly strong opinions from those against them: “I don’t believe in deadlines. They are bullshit created by (predominantly business) people who don’t understand how hard it is to design and build great products. You cannot rush great [design, software, etc.]” I disagree, I believe in deadlines. Not because the date matters, but because they’re a powerful way to influence the behaviour of a team. At the time of this writing, our team at Shopify is busy preparing for Unite, our annual partner & developer conference. It’s the final stretch of six months of work that started when we (internally) committed to launch a bunch of products at the conference. It really is a great conference. See why so many developers build on Shopify. Unite brings together thousands of people from our ecosystem, and on top of building the products themselves, our teams spend hundreds of hours preparing for presentations and workshops. It’s very hard to pull off, and a big investment of company energy. The pace is frantic, the months are stressful, and the chaos is draining. Yet, no one forced us to have it. We happily impose this deadline on ourselves because it makes us better, and in turn, makes our product better. Why deadlines work Deadlines work because they force critical thinking by adding a constraint. When a deadline is set on a project, magical things happen. How to use Deadlines effectively There are two types of deadlines: those that matter, and those that don’t really matter at all. The ones that matter tend to relate to either a short-lived opportunity, or a company’s survival. The day your startup runs out of cash is a deadline you don’t want to miss. You don’t even need to think about using these types o deadlines, they will use you. More interesting (and common), are deadlines that don’t actually matter. Missed an arbitrary launch date by 3 weeks? Stakeholders may moan, but does it really matter? Just delay the blog post, and save that tweet for later. You’ll get roughly the same impact. Even Shopify’s Unite conference doesn’t really matter. Would Shopify’s outcome materially change if a team missed the conference launch date? Unlikely. (jk team, jk 🙏) Which brings us to the interesting part about using deadlines effectively. The meaning of the date is often irrelevant to it’s usefulness. You will get the behavioural benefits by just having a deadline for the sake of it. Using deadlines when the date doesn’t (really) matter As a leader of a team, using deadlines when the date is irrelevant is tricky, because in order to get the behavioural effects to work for your team, you have to genuinely care about the date or they will see right through you. Am I suggesting you fake it? No, and I don’t think you need to. When runners are training, is there some universal force compelling them to care that today’s time was better than yesterday’s? No, runners aspire to hit the time for the sake of achieving it and for the pleasure in knowing they’re growing. This should be your mentality when you rally your team around a deadline. Make it a point of team pride to achieve it. Make everyone want to meet the deadline, if not for the impact it will have to customers, than for the sake of the challenge and for what it says about them. How to avoid using deadlines disastrously Be wary of deadlines negatively influencing your decision making as you approach the ship-date. If you don’t think it could happen to you, imagine leading a team and beating the “we can do it!” drum everyday for seven months. In that situation, don’t kid yourself — you are very emotionally vested in meeting the date. And that’s exactly when you will act irrationally. Here are a few reminders I give myself of as a deadline approaches: No more debate Deadlines work because constraints foster creativity and resourcefulness. There are countless examples of how deadlines pushed teams to do more than they thought they could. Think moon landing, think Tesla even though they miss every one. Deadlines work even when dates are arbitrary, because they give a team a challenge and something to prove. Deadlines work, but they must be used with care and in service of good products, not in priority to them. Deadlines make product teams better, and that’s why I believe in them. Bonus — how to pick a date when there isn’t an obvious one: Before you go, some things to consider: ", "name": "802", "child": "802_1\t802_2\t802_3\t802_4\t802_5\t802_6802_1\t802_2\t802_3\t802_4\t802_5\t802_6802_1\t802_2\t802_3\t802_4\t802_5\t802_6", "timestamp": "Apr 11"}