{"parent": "", "title": "Machine Learning and Product Managers", "author": "Vishal Sood", "sentences": [{"696e": "Machine Learning and Product Managers"}, {"8f8b": "Machine learning is going to change the world more than any other technology, over the next several decades. To take advantage of the machine learning revolution we (aka product managers) should move quickly to equip ourselves with the necessary tools. Or else, we would be lost in obscurity bitting the dust, because many top technology companies are already harnessing ML to create new business opportunities."}, {"16d8": "As Mark Cuban recently stated:"}, {"7efd": "“Artificial Intelligence, deep learning, machine learning — whatever you’re doing if you don’t understand it — learn it. Because otherwise you’re going to be a dinosaur within 3 years.”"}, {"bb87": "Here is why I believe every Product Manager should understand Machine Learning and how can they get a jump start on it."}, {"8cc6": "The Why ?"}, {"f41d": "For a moment, pause and think of all the products that you use on a daily basis. I bet they all use some flavor of machine learning in their products. Here are a few that I am guessing we all use almost everyday:"}, {"a3ff": "And the list can go on, but I guess you get my point. Machine learning is everywhere. Machine learning is going to upend industries and your product. If I can go a bit further, it will be the next big tech platform where incumbents will be upended and new leaders emerge (If you think ML is a fad, check in with someone who thought the web was a fad in 1998, or mobile in 2008). Hence, as product managers we need to understand the current state of machine learning, and the opportunities and techniques such as deep learning provide for transforming your products and delighting your users."}, {"c056": "By ‘understanding machine learning’ I don’t mean that you have in-depth knowledge of ML algorithms that you should be able come up with models for the algorithms (it will be good if you can, but that’s besides the point)."}, {"fc4c": "But, you should know enough to answer these questions below:"}, {"dbef": "And then, when you are working on a product that uses Machine learning (which will be very often), you should make sure to understand:"}, {"1075": "The How?"}, {"1970": "A simple google search on ‘machine learning for beginners’ can give you more than a million results. To make things easier, with the help of some of my friends at Amazon, I have curated a list of the best resources to learn about machine learning esp. for Product Managers"}, {"dcac": "Books"}, {"0664": "Courses"}, {"f947": "Must-Reads:"}, {"fe99": "Other:"}, {"a039": "This is in no way an exhaustive list and I will keep updating it as and when I come across more valuable resources. All product managers, I would love to know your take on ML and how it is impacting your products. Please leave a comment below."}], "content": "Machine Learning and Product Managers Machine learning is going to change the world more than any other technology, over the next several decades. To take advantage of the machine learning revolution we (aka product managers) should move quickly to equip ourselves with the necessary tools. Or else, we would be lost in obscurity bitting the dust, because many top technology companies are already harnessing ML to create new business opportunities. As Mark Cuban recently stated: “Artificial Intelligence, deep learning, machine learning — whatever you’re doing if you don’t understand it — learn it. Because otherwise you’re going to be a dinosaur within 3 years.” Here is why I believe every Product Manager should understand Machine Learning and how can they get a jump start on it. The Why ? For a moment, pause and think of all the products that you use on a daily basis. I bet they all use some flavor of machine learning in their products. Here are a few that I am guessing we all use almost everyday: And the list can go on, but I guess you get my point. Machine learning is everywhere. Machine learning is going to upend industries and your product. If I can go a bit further, it will be the next big tech platform where incumbents will be upended and new leaders emerge (If you think ML is a fad, check in with someone who thought the web was a fad in 1998, or mobile in 2008). Hence, as product managers we need to understand the current state of machine learning, and the opportunities and techniques such as deep learning provide for transforming your products and delighting your users. By ‘understanding machine learning’ I don’t mean that you have in-depth knowledge of ML algorithms that you should be able come up with models for the algorithms (it will be good if you can, but that’s besides the point). But, you should know enough to answer these questions below: And then, when you are working on a product that uses Machine learning (which will be very often), you should make sure to understand: The How? A simple google search on ‘machine learning for beginners’ can give you more than a million results. To make things easier, with the help of some of my friends at Amazon, I have curated a list of the best resources to learn about machine learning esp. for Product Managers Books Courses Must-Reads: Other: This is in no way an exhaustive list and I will keep updating it as and when I come across more valuable resources. All product managers, I would love to know your take on ML and how it is impacting your products. Please leave a comment below. ", "name": "812", "child": "812_1\t812_2\t812_3\t812_4", "timestamp": "Apr 11"}