{"parent": "", "title": "The Mississippi Effect: How Small Decisions Can Change the World", "author": "Charles Chu", "sentences": [{"9605": "The Mississippi Effect: How Small Decisions Can Change the World"}, {"4279": "Malcolm Gladwell’s books have sold tens of millions of copies and changed the lives of people all over the world."}, {"17d4": "But few people know that Gladwell’s books are deeply inspired by another, lesser-known book:"}, {"cea8": "“All of my books have been, in some sense, intellectual godchildren of The Person and the Situation. This book has been a constant companion over the past 10 years.”"}, {"36d0": "What’s so amazing about it?"}, {"976f": "Gladwell again:"}, {"02b8": "“The genius of this book is that it will insinuate itself into the way you think about virtually everything.”"}, {"123c": "More on what this book has to teach us a bit later."}, {"e481": "First, a story…"}, {"344c": "Growing Up"}, {"dbb7": "“We’re adults now, man. I’ve learned to be realistic”"}, {"e06b": "That’s Jarred. We’re at a sushi restaurant in South Florida, catching up for the first time in a few years."}, {"eeb8": "In high school, Jarred made you believe he could do anything. He’d ace all his classes without studying and spend all his time playing around with whatever interested him."}, {"6623": "One time, he made a Super Mario game that you could play on your calculator and it spread all over the school — boy was that a nightmare for the math teaching staff."}, {"0b92": "We all knew he was going to be big."}, {"e735": "Jarred’s looking down at his plate now, spreading out a blob of wasabi with his fork."}, {"7aba": "“It’s a big world out there. Billions of people. What’s the point of doing anything? I’m just one guy, man.”"}, {"8c2c": "The Mississippi Effect"}, {"59dc": "Call me an optimist, but I can’t agree with Jarred."}, {"1eaa": "Let’s go back Ross and Nisbett’s The Person and the Situation. In it, they introduce a concept that I call the “Mississippi Effect.”"}, {"e006": "It involves, as you might expect, Mississippi River:"}, {"23d5": "…the river meanders through its last several hundred miles before spilling into the Gulf of Mexico in a general course that could not be altered by any event of less than cataclysmic proportions."}, {"f310": "What can one human do against something that powerful, that majestic?"}, {"bdf4": "Follow me along for a thought experiment."}, {"5d30": "Let’s say I bring you the bank of the Mississippi River. I hand you a shovel. “Your job,” I say, “is to change the flow of this river. You are only allowed to use this shovel.”"}, {"cce5": "Could you do it?"}, {"eb75": "Here’s another anecdote about the Mississippi:"}, {"0cde": "A person with a shovel can, at the right place, start a small cut that gets bigger and bigger until the whole river flows through the new channel and an entire curve of the river is obliterated."}, {"7b70": "This, my friends, is the “Mississippi Effect.”"}, {"75ca": "Small actions, applied in the right place, can have cataclysmic effects."}, {"7ab5": "Levers and Rivers"}, {"0423": "Now, let’s turn the clock back 2200 years."}, {"7c3a": "Here’s a quote from Archimedes of Syracuse, the great mathematician, engineer and scientist:"}, {"159c": "“Give me a place to stand, and a lever long enough, and I will move the world.”"}, {"c807": "Archimedes’ Lever (WIkimedia Commons)"}, {"fc06": "What can one human do?"}, {"620d": "Well, if that human has a really long stick and knows where to put it, he can do a lot."}, {"e3e4": "There’s a fundamental truth these analogies are getting at. In life, there are asymmetries. Some powerful actions — like a thousand shovels thrown into the river — have little to no effect. But others, with a single stroke, can literally change the flow of history."}, {"a482": "Lion and Sheep"}, {"3c33": "One last asymmetry, perhaps the most powerful."}, {"a22c": "Here is bestselling author Nassim Taleb on what he calls the minority rule:"}, {"2972": "The minority rule will show us how it all it takes is a small number of intolerant virtuous people with skin in the game, in the form of courage, for society to function properly."}, {"be38": "I’ll let you judge his argument for yourself, but his main point is not so different from that of the Mississippi Effect — correct application by a small force can have a tremendous global impact."}, {"2091": "All it takes, says Taleb, is a few, special people:"}, {"1064": "Society doesn’t evolve by consensus, voting, majority, committees, verbose meeting, academic conferences, and polling; only a few people suffice to disproportionately move the needle."}, {"869a": "We love to talk about equality these days, but let us not confuse equality of opportunity with equality of outcome. Where you start does not dictate where you shall end."}, {"dda9": "There are lions and there are sheep:"}, {"1a6f": "Alexander said that it was preferable to have an army of sheep led by a lion to an army of lions led by a sheep. Alexander (or no doubt he who produced this probably apocryphal saying) understood the value of the active, intolerant, and courageous minority."}, {"a67b": "So you’re just one person. And all life gave you was a shovel."}, {"e4bb": "Lion, or sheep?"}, {"7f5e": "Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here."}], "content": "The Mississippi Effect: How Small Decisions Can Change the World Malcolm Gladwell’s books have sold tens of millions of copies and changed the lives of people all over the world. But few people know that Gladwell’s books are deeply inspired by another, lesser-known book: “All of my books have been, in some sense, intellectual godchildren of The Person and the Situation. This book has been a constant companion over the past 10 years.” What’s so amazing about it? Gladwell again: “The genius of this book is that it will insinuate itself into the way you think about virtually everything.” More on what this book has to teach us a bit later. First, a story… Growing Up “We’re adults now, man. I’ve learned to be realistic” That’s Jarred. We’re at a sushi restaurant in South Florida, catching up for the first time in a few years. In high school, Jarred made you believe he could do anything. He’d ace all his classes without studying and spend all his time playing around with whatever interested him. One time, he made a Super Mario game that you could play on your calculator and it spread all over the school — boy was that a nightmare for the math teaching staff. We all knew he was going to be big. Jarred’s looking down at his plate now, spreading out a blob of wasabi with his fork. “It’s a big world out there. Billions of people. What’s the point of doing anything? I’m just one guy, man.” The Mississippi Effect Call me an optimist, but I can’t agree with Jarred. Let’s go back Ross and Nisbett’s The Person and the Situation. In it, they introduce a concept that I call the “Mississippi Effect.” It involves, as you might expect, Mississippi River: …the river meanders through its last several hundred miles before spilling into the Gulf of Mexico in a general course that could not be altered by any event of less than cataclysmic proportions. What can one human do against something that powerful, that majestic? Follow me along for a thought experiment. Let’s say I bring you the bank of the Mississippi River. I hand you a shovel. “Your job,” I say, “is to change the flow of this river. You are only allowed to use this shovel.” Could you do it? Here’s another anecdote about the Mississippi: A person with a shovel can, at the right place, start a small cut that gets bigger and bigger until the whole river flows through the new channel and an entire curve of the river is obliterated. This, my friends, is the “Mississippi Effect.” Small actions, applied in the right place, can have cataclysmic effects. Levers and Rivers Now, let’s turn the clock back 2200 years. Here’s a quote from Archimedes of Syracuse, the great mathematician, engineer and scientist: “Give me a place to stand, and a lever long enough, and I will move the world.” Archimedes’ Lever (WIkimedia Commons) What can one human do? Well, if that human has a really long stick and knows where to put it, he can do a lot. There’s a fundamental truth these analogies are getting at. In life, there are asymmetries. Some powerful actions — like a thousand shovels thrown into the river — have little to no effect. But others, with a single stroke, can literally change the flow of history. Lion and Sheep One last asymmetry, perhaps the most powerful. Here is bestselling author Nassim Taleb on what he calls the minority rule: The minority rule will show us how it all it takes is a small number of intolerant virtuous people with skin in the game, in the form of courage, for society to function properly. I’ll let you judge his argument for yourself, but his main point is not so different from that of the Mississippi Effect — correct application by a small force can have a tremendous global impact. All it takes, says Taleb, is a few, special people: Society doesn’t evolve by consensus, voting, majority, committees, verbose meeting, academic conferences, and polling; only a few people suffice to disproportionately move the needle. We love to talk about equality these days, but let us not confuse equality of opportunity with equality of outcome. Where you start does not dictate where you shall end. There are lions and there are sheep: Alexander said that it was preferable to have an army of sheep led by a lion to an army of lions led by a sheep. Alexander (or no doubt he who produced this probably apocryphal saying) understood the value of the active, intolerant, and courageous minority. So you’re just one person. And all life gave you was a shovel. Lion, or sheep? Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here. ", "name": "813", "child": "813_1\t813_2\t813_3\t813_4\t813_5813_1\t813_2\t813_3\t813_4\t813_5", "timestamp": "Apr 16"}