{"parent": "", "title": "7 UX/Usability tools to try in 2017", "author": "Ryan Ruud", "sentences": [{"a2a6": "7 UX/Usability tools to try in 2017"}, {"3719": "With each passing year, we see a surge in new tools and technology to make our marketing and creative lives easier."}, {"8ee7": "Just 5 years ago, 100 pieces of technology could claim the title of marketing technology “martech”. In 2016, that number skyrocketed to more than 4000. In the creative category of the martech space, UX tools also continue to grow in number and influence."}, {"f4fb": "Last year we shared 7 tools worth checking out. Here are 7 more tools and resources to add to your workflows for 2017."}, {"851a": "1. UX MAP"}, {"4846": "If you’re a designer or product manager struggling to convey your ideas and you’re familiar with Axure RP, then UXMAP is worth checking out."}, {"77b8": "More often than not, trying to explain user flows and interactions with words, just doesn’t work, especially when there are multiple stakeholders involved. With UXMAP you can bring ideas to life, add notes on mouse over as if you’re there to narrate and more."}, {"6020": "2. UX — APP"}, {"af3f": "I know what you’re thinking. Do we need another prototyping app? Yes. UX-App brings functional HTML5 prototyping to the table."}, {"4d08": "It works via, what they call, “logic blocks” allowing designers to move past hotspots. The HTML prototyping allows fast sharing through html without the use of special apps. If you’ve ever sat on the phone waiting for a client to load the viewing app on the other side, you know the struggle is real."}, {"1156": "3. HandrailUX"}, {"d6f8": "Creating user interviews, gathering feedback and sharing insights with others on your team can be a challenge. HandrailUX aims to simplify the whole process by providing a research platform for individuals and teams."}, {"a4d7": "Handrail simplifies user interview development with built in guides and cloning functionality allowing HandrailUX users to quickly replicate past interviews or questions or build from an existing library. Interviews get translated into real time results allowing design to iterate faster. (Disclosure: I work with HandrailUX)"}, {"ec97": "4. PersonApp"}, {"191b": "PersonApp takes the pain out of person creation. It’s slick. So slick, that there should never, ever, ever, be another excuse why your project or organization wouldn’t have user or buyer personas."}, {"55b1": "PersonApp provides a guided experience with prompts that explain, in beautiful detail, exactly the information necessary for product, design, development and marketing to be successful. And it’s free."}, {"443c": "5. UXChecklist"}, {"9d39": "Checklists rock my world. Especially when things get hectic. They insure that the foundational work gets done. The iterative, reactive things, that’s a whole different story."}, {"5b5c": "UX Checklists is exactly what it sounds like. A checklist for the core steps of the UX design process. Each section includes a link for some extended reading and you can sign in via Google and share the checklist across your accounts. It’s straightforward, but sometimes less is more."}, {"de10": "6. HelloMany"}, {"b621": "With so many new tools, resources and assets getting shared every day, anyone who is a curated source of these items is A++ in my book. Say howdy, to HelloMany."}, {"cbab": "They are a curated source of UI assets including themes, icons and kits. Check here for inspirations or to download resources for your next project and skip the time suck of internet searches. Also, if you do use HelloMany, be a good community steward and submit assets you find elsewhere."}, {"20bc": "7. ProductHunt"}, {"7fd3": "In the same thread as HelloMany, helping to sort through the noise, I have to conclude with ProductHunt."}, {"a4d5": "If the past is any indicator of the future, we’re only going to see more tools and resources emerge. Product Hunt is a fantastic source of finding the latest and greatest. ProductHunt’s community helps the cream rise to the top so you know if it’s trending, it’s worth a look."}, {"2eac": "A couple of my favorite lists to follow include: All Things UI and User Experience Design. I keep a list as well, among many collections."}, {"0791": "About me"}, {"5367": "Ryan Ruud is the founder of Lake One, a marketing and growth firm that helps startups, innovators, makers, and social enterprises find traction and build modern, measurable marketing programs."}, {"f6cf": "Originally published at CreativeBloq"}], "content": "7 UX/Usability tools to try in 2017 With each passing year, we see a surge in new tools and technology to make our marketing and creative lives easier. Just 5 years ago, 100 pieces of technology could claim the title of marketing technology “martech”. In 2016, that number skyrocketed to more than 4000. In the creative category of the martech space, UX tools also continue to grow in number and influence. Last year we shared 7 tools worth checking out. Here are 7 more tools and resources to add to your workflows for 2017. 1. UX MAP If you’re a designer or product manager struggling to convey your ideas and you’re familiar with Axure RP, then UXMAP is worth checking out. More often than not, trying to explain user flows and interactions with words, just doesn’t work, especially when there are multiple stakeholders involved. With UXMAP you can bring ideas to life, add notes on mouse over as if you’re there to narrate and more. 2. UX — APP I know what you’re thinking. Do we need another prototyping app? Yes. UX-App brings functional HTML5 prototyping to the table. It works via, what they call, “logic blocks” allowing designers to move past hotspots. The HTML prototyping allows fast sharing through html without the use of special apps. If you’ve ever sat on the phone waiting for a client to load the viewing app on the other side, you know the struggle is real. 3. HandrailUX Creating user interviews, gathering feedback and sharing insights with others on your team can be a challenge. HandrailUX aims to simplify the whole process by providing a research platform for individuals and teams. Handrail simplifies user interview development with built in guides and cloning functionality allowing HandrailUX users to quickly replicate past interviews or questions or build from an existing library. Interviews get translated into real time results allowing design to iterate faster. (Disclosure: I work with HandrailUX) 4. PersonApp PersonApp takes the pain out of person creation. It’s slick. So slick, that there should never, ever, ever, be another excuse why your project or organization wouldn’t have user or buyer personas. PersonApp provides a guided experience with prompts that explain, in beautiful detail, exactly the information necessary for product, design, development and marketing to be successful. And it’s free. 5. UXChecklist Checklists rock my world. Especially when things get hectic. They insure that the foundational work gets done. The iterative, reactive things, that’s a whole different story. UX Checklists is exactly what it sounds like. A checklist for the core steps of the UX design process. Each section includes a link for some extended reading and you can sign in via Google and share the checklist across your accounts. It’s straightforward, but sometimes less is more. 6. HelloMany With so many new tools, resources and assets getting shared every day, anyone who is a curated source of these items is A++ in my book. Say howdy, to HelloMany. They are a curated source of UI assets including themes, icons and kits. Check here for inspirations or to download resources for your next project and skip the time suck of internet searches. Also, if you do use HelloMany, be a good community steward and submit assets you find elsewhere. 7. ProductHunt In the same thread as HelloMany, helping to sort through the noise, I have to conclude with ProductHunt. If the past is any indicator of the future, we’re only going to see more tools and resources emerge. Product Hunt is a fantastic source of finding the latest and greatest. ProductHunt’s community helps the cream rise to the top so you know if it’s trending, it’s worth a look. A couple of my favorite lists to follow include: All Things UI and User Experience Design. I keep a list as well, among many collections. About me Ryan Ruud is the founder of Lake One, a marketing and growth firm that helps startups, innovators, makers, and social enterprises find traction and build modern, measurable marketing programs. Originally published at CreativeBloq ", "name": "827", "child": "827_1\t827_2\t827_3\t827_4\t827_5\t827_6\t827_7\t827_8\t827_9", "timestamp": "Apr 9"}