{"parent": "", "title": "Case Study: Upper App. UI Design for To-Do List.", "author": "Tubik Studio", "sentences": [{"d3d9": "Case Study: Upper App. UI Design for To-Do List."}, {"5bec": "Famous author and motivational speaker Zig Ziglar once said: «You were born to win, but to be a winner, you must plan to win, prepare to win, and expect to win.» Planning our day and managing our tasks is the significant job we have to do regularly and devotedly in case we seek for success. Tons of books, articles and interviews from successful and productive people generally send the global message: to be productive you have to plan your day and tasks distributing your time and effort wisely."}, {"9bee": "Would you like to have a reliable helping hand in the process of planning your days and setting goals effectively and without any distractions? Welcome to try Upper, simple and elegant free application for iPhones, designed and developed by Tubik team. Being featured and having rocketed at Product Hunt, Upper was marked out as the iOS App of the day, so we’ve also decided to unveil some details of design and functionality to our readers."}, {"abc9": "Upper App at Product Hunt"}, {"5058": "Task"}, {"9d2f": "Full-cycle UI/UX design for the simple and motivational productivity app for iPhones."}, {"3ffd": "Process"}, {"6505": "Creating the to-do list application, Tubik team realized the high scale of competition in this sphere of utilities: that was a step into a red ocean. Still, as it usually happens in the fields covering wide and diverse target audience, variety of the products is another user-friendly feature: it allows choosing the styles and features every particular user likes. Continuing the theme of personal productivity, which was started with our previous app Toonie Alarm, we’ve established the goal to present the app of totally different look and functionality deeply focused on personal and professional motivation."}, {"71d0": "In UX perspective, the app interface was concentrated on extremely simple interactions and intuitive navigation, while in UI design the core concerns gathered around high readability level and visual hierarchy that would allow users to use the app easily in any environment and on the go. In addition, working over the visual performance of the app user interface, Tubik designer Ernest Asanov made a general stylistic concept choice in favor of minimalist and elegant solutions."}, {"adbd": "Functionality"}, {"0b32": "The basic idea set behind Upper was creating helpful to-do list, deeply concentrating user’s attention on the tasks and deadline. That’s why it doesn’t include complex functionality, distractions or decorations. It presents only the features and elements needed for time and task management."}, {"cb8d": "Functions and features provide the following:"}, {"ec5a": "Design and Layout"}, {"4263": "Interactions: The basic functionality of the app is built around user’s ability to create the list of tasks which can be saved for the particular date and time, easily deleted or marked complete. In addition, Upper analyzes task completion progress and shows stats to keep users updated and motivated. The absence of distractions, simple screen design and thought-out typography make the content highly readable and allow using the app easily in any environment and on-the-go."}, {"8182": "Basic functional buttons are placed in the bottom of the screen, which supports usability for users with big devices. Different swipe gestures allow user to mark the task complete or delete it from the list. Core information such as dates, the words for the closest days (tomorrow, today), the number of tasks and days in Upper Streak are presented in uppercase font, supporting both efficient visual hierarchy of the layout elements and the harmonic consistency in combination with the product brand name."}, {"9655": "Upper Streak: The original feature of Upper App is user motivation with special challenge of non-breaking plans and increasing productivity potential: the app motivates to complete all the planned tasks via Upper Streak Challenge. Streak is the period during which users don’t interrupt completing the tasks with Upper: it shows the achievement in being consistent and productive and encourages not to stop and break the progress. Seeing your determination, the app will challenge you with bigger number of tasks, so users are motivated to get organized and complete the plans with Upper without missing a day."}, {"4e77": "Color and style: The app is designed in minimalist and elegant style of layout based deeply on quick functionality and intuitive navigation. What is more, users are provided with the variety of skins and can choose between dark, light and red skin depending on their personal taste and wishes. At the moment the app is presented in dark skin, but next update coming very soon will let users activate any of the three palettes."}, {"5bd6": "User-friendly navigation, supported with slight eye-pleasing animation, will help users to focus on their tasks. No ads, no complications, no extra copy, interface motivating to create short concise notes for the tasks — nothing will distract from the goals. Application provides the simple calendar, allows saving notes conveniently, check stats and plan anything from everyday stuff to business objectives."}, {"97d8": "Upper presented on Dribbble"}, {"f428": "To get more information on design and interactions, you can also review the full presentation of Upper App design or check full pack of the details via Upper Press Kit."}, {"c863": "Originally written for tubikstudio.com"}, {"580d": "Welcome to download Upper App via App Store"}, {"f924": "Welcome to see full presentation on Product Hunt"}, {"c7bf": "Welcome to see Upper Website"}, {"7e12": "Welcome to check Behance Presentation"}], "content": "Case Study: Upper App. UI Design for To-Do List. Famous author and motivational speaker Zig Ziglar once said: «You were born to win, but to be a winner, you must plan to win, prepare to win, and expect to win.» Planning our day and managing our tasks is the significant job we have to do regularly and devotedly in case we seek for success. Tons of books, articles and interviews from successful and productive people generally send the global message: to be productive you have to plan your day and tasks distributing your time and effort wisely. Would you like to have a reliable helping hand in the process of planning your days and setting goals effectively and without any distractions? Welcome to try Upper, simple and elegant free application for iPhones, designed and developed by Tubik team. Being featured and having rocketed at Product Hunt, Upper was marked out as the iOS App of the day, so we’ve also decided to unveil some details of design and functionality to our readers. Upper App at Product Hunt Task Full-cycle UI/UX design for the simple and motivational productivity app for iPhones. Process Creating the to-do list application, Tubik team realized the high scale of competition in this sphere of utilities: that was a step into a red ocean. Still, as it usually happens in the fields covering wide and diverse target audience, variety of the products is another user-friendly feature: it allows choosing the styles and features every particular user likes. Continuing the theme of personal productivity, which was started with our previous app Toonie Alarm, we’ve established the goal to present the app of totally different look and functionality deeply focused on personal and professional motivation. In UX perspective, the app interface was concentrated on extremely simple interactions and intuitive navigation, while in UI design the core concerns gathered around high readability level and visual hierarchy that would allow users to use the app easily in any environment and on the go. In addition, working over the visual performance of the app user interface, Tubik designer Ernest Asanov made a general stylistic concept choice in favor of minimalist and elegant solutions. Functionality The basic idea set behind Upper was creating helpful to-do list, deeply concentrating user’s attention on the tasks and deadline. That’s why it doesn’t include complex functionality, distractions or decorations. It presents only the features and elements needed for time and task management. Functions and features provide the following: Design and Layout Interactions: The basic functionality of the app is built around user’s ability to create the list of tasks which can be saved for the particular date and time, easily deleted or marked complete. In addition, Upper analyzes task completion progress and shows stats to keep users updated and motivated. The absence of distractions, simple screen design and thought-out typography make the content highly readable and allow using the app easily in any environment and on-the-go. Basic functional buttons are placed in the bottom of the screen, which supports usability for users with big devices. Different swipe gestures allow user to mark the task complete or delete it from the list. Core information such as dates, the words for the closest days (tomorrow, today), the number of tasks and days in Upper Streak are presented in uppercase font, supporting both efficient visual hierarchy of the layout elements and the harmonic consistency in combination with the product brand name. Upper Streak: The original feature of Upper App is user motivation with special challenge of non-breaking plans and increasing productivity potential: the app motivates to complete all the planned tasks via Upper Streak Challenge. Streak is the period during which users don’t interrupt completing the tasks with Upper: it shows the achievement in being consistent and productive and encourages not to stop and break the progress. Seeing your determination, the app will challenge you with bigger number of tasks, so users are motivated to get organized and complete the plans with Upper without missing a day. Color and style: The app is designed in minimalist and elegant style of layout based deeply on quick functionality and intuitive navigation. What is more, users are provided with the variety of skins and can choose between dark, light and red skin depending on their personal taste and wishes. At the moment the app is presented in dark skin, but next update coming very soon will let users activate any of the three palettes. User-friendly navigation, supported with slight eye-pleasing animation, will help users to focus on their tasks. No ads, no complications, no extra copy, interface motivating to create short concise notes for the tasks — nothing will distract from the goals. Application provides the simple calendar, allows saving notes conveniently, check stats and plan anything from everyday stuff to business objectives. Upper presented on Dribbble To get more information on design and interactions, you can also review the full presentation of Upper App design or check full pack of the details via Upper Press Kit. Originally written for tubikstudio.com Welcome to download Upper App via App Store Welcome to see full presentation on Product Hunt Welcome to see Upper Website Welcome to check Behance Presentation ", "name": "834", "child": "834_1\t834_2\t834_3\t834_4\t834_5\t834_6\t834_7\t834_8834_1\t834_2\t834_3\t834_4\t834_5\t834_6\t834_7\t834_8", "timestamp": "Feb 2"}