{"parent": "", "title": "The Secret to Naming In-App Currency", "author": "Cassius Kiani", "sentences": [{"e2cb": "The Secret to Naming In-App Currency"}, {"5840": "Leveraging the Currency Pyramid to make more money."}, {"34fb": "Currency is fascinating."}, {"6f95": "People are willing to offer their time, trade their resources and reciprocate kindness or gratitude in exchange for it (think happy customer service)."}, {"7d68": "There are so many different dimensions to currency and a curious question that pops up time and time again, revolves around the names."}, {"15ed": "Why is currency labelled and named in so many different ways?"}, {"d204": "Of course, there’s economic and sociocultural reasons why currency has (and still can) range from pounds to pesos or dollars to rupees, but there’s more to it than that."}, {"df17": "Did you know that ‘peso’ literally translates to ‘weight’ in Spanish? In context, weight only ever implies two things:"}, {"37b0": "Now, perhaps peso was a physically heavy currency when it was first created (it was metal after all) but it’s much more fascinating to assume that peso was named after the gravitas that it, as a currency holds."}, {"13f1": "From Real Life to Make Believe"}, {"0440": "For the purpose of this article, this is the definition we’ll use for In-App currency (IAC)…"}, {"971f": "In-App currency (IAC) is the fabricated currency tied to a specific app that allows users to purchase assets (items, perks and rewards)."}, {"191a": "IAC comes in 2 forms:"}, {"6d19": "In this article, we’re going to focus on Premium IAC. The name of your Simple currency has a much smaller impact on your business’ bottom line."}, {"c1fb": "Why? Because with Premium IAC the goal is to get your users to part with their real currency. There’s different mechanics that can be used to increase purchase behaviour, but would user’s rather buy ‘points’ to upgrade their towers or buy ‘gems’?"}, {"8bce": "…Or would they rather purchase coins, cash, diamonds, doubloons, FarmCash, gems, gold, karma, RiotPoints or tokens (to name a few)?"}, {"426d": "By simply changing the names of Premium IAC in products we’ve designed, we’ve seen increases of over 50% revenue from currency purchases alone."}, {"cfcd": "If we extrapolate this data, suddenly $10,000 becomes $15,000, all from a simple name change."}, {"a1eb": "In light of this, we created a quick and simple tool dubbed the Currency pyramid to help us brainstorm and rank names for Premium IAC."}, {"dc5c": "The Currency Pyramid"}, {"50a5": "There are 3 areas of focus in the currency pyramid:"}, {"ca35": "Using gems as an example, we’ll take a look through each of these areas and work through a few points of consideration for each."}, {"6cd9": "Why gems? Gems are an all-round play it safe kinda name."}, {"0c7a": "They fall short in a few cases, but more often they’re contextual ‘enough’ in almost any given scenario."}, {"b2cb": "Perceived Value"}, {"1c4e": "Whether the currency is real or fabricated, it’ll still follow the governing laws of perceived value."}, {"b76a": "Perceived value focuses on how much the user feels the currency is worth. Ultimately, the worth of a currency boils down to its buying power, how difficult it is to earn and (paradoxically) social proof."}, {"e567": "If more people value and desire the currency, then it becomes infamous and inadvertently, as more people want it, the perceived value increases."}, {"bd40": "Perceived value is the same phenomenon that creates purchase behaviour."}, {"7b1f": "If we perceive something as useful and valuable to our lives, then we’re willing to exchange resources to own/get access to it. The important thing to remember is that perceived value is subjective, so don’t expect everyone to ‘feel’ the same way."}, {"f58f": "To maximise perceived value, focus on creating value for a specific audience (your app’s audience) rather than trying to please everyone, as that’ll dilute the value proposition."}, {"3bd8": "This is how we see the perceived value of gems (higher is better):"}, {"5a29": "Overall perceived value = moderate (7/10)This might seem harsh, but there’s definitely more valuable currency out there. Through the exploration, we’ve already discovered that gems could be precious or semi-precious and more clarity on the type of gem (or a more suited context) would raise the perceived value here."}, {"717a": "Perceived Loss"}, {"378c": "Perceived value and perceived loss are two sides of the same coin and often referred to as opportunity cost."}, {"8dcc": "Opportunity cost is a simple concept, if you make one decision, what’re you giving up to fulfil that decision?"}, {"96ab": "When you buy a new computer, the opportunity cost could be giving up on buying a new washing machine or going on holiday."}, {"ce31": "When you’re buying Premium IAC, you’re buying into a currency that can only be spent within an app, and on the assets within that app."}, {"98d9": "Most users can return a computer, or sell it on to recover some of the loss. With Premium IAC, it can’t be resold, it’s tied to you and you alone."}, {"dc46": "For the purchase of IAC to happen, there needs to be perceived value, but on the other side of the coin, what is the perceived loss? If the perceived loss is too great, but you’ve managed to insight purchase behaviour, then users will feel a phenomenon known as buyer’s regret."}, {"9cec": "With buyer’s regret, users find themselves slowly loathing the purchase they’ve made, deeming it as a poor choice."}, {"fc16": "Buyer’s regret temporarily reduces spending behaviour and leaves a lasting impression on the product that insight it (which is detrimental to a user’s lifetime value)."}, {"899b": "This is how we’d look at the perceived loss for gems (lower is better)."}, {"3c66": "Overall perceived loss = moderate (7/10)The loss isn’t too dear, but it’s not unnoticeable, losing gems (precious or otherwise) will be a typically unpleasant ordeal. That being said, balancing the loss through a careful value proposition shouldn’t be too challenging."}, {"5dcc": "Perceived Novelty"}, {"f072": "Novelty refers to how fun, memorable and easy to recall the currency is."}, {"2b87": "As users, we all seek fascination and excitement within our lives. When something is fascinating, our involvement with the object in question becomes greater. Even if this fascination is only short-lived, it leaves a lasting and memorable impression in our minds."}, {"2136": "But fascination is only a small part of what novelty is and how it’s created."}, {"f772": "If you’re looking for a strict definition of novelty…"}, {"aa05": "Novelty is the quality of being new, original, or unusual. — Cambridge Dictionary"}, {"79c6": "Anything that can insight originality or the unusual can be defined as novel, which gives you a lot of flexibility on what you can do or what you can your Premium IAC."}, {"2b27": "This is how we’d look at perceived novelty for gems (higher is better)."}, {"2f9f": "Overall perceived novelty = moderate (7/10)Gems have a high recall value and are familiar enough to users that with a clever design to symbolism gems, it’ll be novel enough as a Premium IAC. There’s more novelty out there, but gems are a stable place to start."}, {"89b6": "The Perfect Formula"}, {"c07b": "In an ideal world, the name of your Premium IAC will look like the above."}, {"c6d0": "There’ll be little to no perceived loss, it’ll have incredible perceived value and more than that, it’ll be novel for users to buy and spend."}, {"f933": "Truth is, there’s no name that can do the above on its own."}, {"41e5": "The experience, context and flow of the app will play a critical part in adding to and creating the perfect formula."}, {"b1c4": "In fact, the experience itself has the potential to take any mundane name (like points) and push it towards the perfect balance."}, {"0d77": "That being said, time is alway against us as designers."}, {"f72c": "We could spend 4 weeks crafting an experience to see if we’ve managed to tip the needle, or we can use the Currency Pyramid to increase overall revenue in as little as a day."}, {"6518": "We use the pyramid to validate our thinking and come up with the best Premium IAC names we can think of and to optimise existing currencies in products."}, {"31a7": "After that, it’s always time to focus on the experience."}, {"138e": "If you enjoyed this post, I’d love to keep in touch 🦁"}], "content": "The Secret to Naming In-App Currency Leveraging the Currency Pyramid to make more money. Currency is fascinating. People are willing to offer their time, trade their resources and reciprocate kindness or gratitude in exchange for it (think happy customer service). There are so many different dimensions to currency and a curious question that pops up time and time again, revolves around the names. Why is currency labelled and named in so many different ways? Of course, there’s economic and sociocultural reasons why currency has (and still can) range from pounds to pesos or dollars to rupees, but there’s more to it than that. Did you know that ‘peso’ literally translates to ‘weight’ in Spanish? In context, weight only ever implies two things: Now, perhaps peso was a physically heavy currency when it was first created (it was metal after all) but it’s much more fascinating to assume that peso was named after the gravitas that it, as a currency holds. From Real Life to Make Believe For the purpose of this article, this is the definition we’ll use for In-App currency (IAC)… In-App currency (IAC) is the fabricated currency tied to a specific app that allows users to purchase assets (items, perks and rewards). IAC comes in 2 forms: In this article, we’re going to focus on Premium IAC. The name of your Simple currency has a much smaller impact on your business’ bottom line. Why? Because with Premium IAC the goal is to get your users to part with their real currency. There’s different mechanics that can be used to increase purchase behaviour, but would user’s rather buy ‘points’ to upgrade their towers or buy ‘gems’? …Or would they rather purchase coins, cash, diamonds, doubloons, FarmCash, gems, gold, karma, RiotPoints or tokens (to name a few)? By simply changing the names of Premium IAC in products we’ve designed, we’ve seen increases of over 50% revenue from currency purchases alone. If we extrapolate this data, suddenly $10,000 becomes $15,000, all from a simple name change. In light of this, we created a quick and simple tool dubbed the Currency pyramid to help us brainstorm and rank names for Premium IAC. The Currency Pyramid There are 3 areas of focus in the currency pyramid: Using gems as an example, we’ll take a look through each of these areas and work through a few points of consideration for each. Why gems? Gems are an all-round play it safe kinda name. They fall short in a few cases, but more often they’re contextual ‘enough’ in almost any given scenario. Perceived Value Whether the currency is real or fabricated, it’ll still follow the governing laws of perceived value. Perceived value focuses on how much the user feels the currency is worth. Ultimately, the worth of a currency boils down to its buying power, how difficult it is to earn and (paradoxically) social proof. If more people value and desire the currency, then it becomes infamous and inadvertently, as more people want it, the perceived value increases. Perceived value is the same phenomenon that creates purchase behaviour. If we perceive something as useful and valuable to our lives, then we’re willing to exchange resources to own/get access to it. The important thing to remember is that perceived value is subjective, so don’t expect everyone to ‘feel’ the same way. To maximise perceived value, focus on creating value for a specific audience (your app’s audience) rather than trying to please everyone, as that’ll dilute the value proposition. This is how we see the perceived value of gems (higher is better): Overall perceived value = moderate (7/10)This might seem harsh, but there’s definitely more valuable currency out there. Through the exploration, we’ve already discovered that gems could be precious or semi-precious and more clarity on the type of gem (or a more suited context) would raise the perceived value here. Perceived Loss Perceived value and perceived loss are two sides of the same coin and often referred to as opportunity cost. Opportunity cost is a simple concept, if you make one decision, what’re you giving up to fulfil that decision? When you buy a new computer, the opportunity cost could be giving up on buying a new washing machine or going on holiday. When you’re buying Premium IAC, you’re buying into a currency that can only be spent within an app, and on the assets within that app. Most users can return a computer, or sell it on to recover some of the loss. With Premium IAC, it can’t be resold, it’s tied to you and you alone. For the purchase of IAC to happen, there needs to be perceived value, but on the other side of the coin, what is the perceived loss? If the perceived loss is too great, but you’ve managed to insight purchase behaviour, then users will feel a phenomenon known as buyer’s regret. With buyer’s regret, users find themselves slowly loathing the purchase they’ve made, deeming it as a poor choice. Buyer’s regret temporarily reduces spending behaviour and leaves a lasting impression on the product that insight it (which is detrimental to a user’s lifetime value). This is how we’d look at the perceived loss for gems (lower is better). Overall perceived loss = moderate (7/10)The loss isn’t too dear, but it’s not unnoticeable, losing gems (precious or otherwise) will be a typically unpleasant ordeal. That being said, balancing the loss through a careful value proposition shouldn’t be too challenging. Perceived Novelty Novelty refers to how fun, memorable and easy to recall the currency is. As users, we all seek fascination and excitement within our lives. When something is fascinating, our involvement with the object in question becomes greater. Even if this fascination is only short-lived, it leaves a lasting and memorable impression in our minds. But fascination is only a small part of what novelty is and how it’s created. If you’re looking for a strict definition of novelty… Novelty is the quality of being new, original, or unusual. — Cambridge Dictionary Anything that can insight originality or the unusual can be defined as novel, which gives you a lot of flexibility on what you can do or what you can your Premium IAC. This is how we’d look at perceived novelty for gems (higher is better). Overall perceived novelty = moderate (7/10)Gems have a high recall value and are familiar enough to users that with a clever design to symbolism gems, it’ll be novel enough as a Premium IAC. There’s more novelty out there, but gems are a stable place to start. The Perfect Formula In an ideal world, the name of your Premium IAC will look like the above. There’ll be little to no perceived loss, it’ll have incredible perceived value and more than that, it’ll be novel for users to buy and spend. Truth is, there’s no name that can do the above on its own. The experience, context and flow of the app will play a critical part in adding to and creating the perfect formula. In fact, the experience itself has the potential to take any mundane name (like points) and push it towards the perfect balance. That being said, time is alway against us as designers. We could spend 4 weeks crafting an experience to see if we’ve managed to tip the needle, or we can use the Currency Pyramid to increase overall revenue in as little as a day. We use the pyramid to validate our thinking and come up with the best Premium IAC names we can think of and to optimise existing currencies in products. After that, it’s always time to focus on the experience. If you enjoyed this post, I’d love to keep in touch 🦁 ", "name": "836", "child": "836_1\t836_2836_1\t836_2", "timestamp": "Dec 30, 2016"}