{"parent": "", "title": "An Open Letter About Rest, From Roger Goodell to Adam Silver", "author": "Kevin O'Connor", "sentences": [{"7997": "An Open Letter About Rest, From Roger Goodell to Adam Silver"}, {"5f34": "The NBA’s issues pale in comparison to the NFL’s"}, {"aa17": "Hi Adam, it’s Roger Goodell. I woke up this morning to an ESPN push alert saying you will crack down on NBA teams that don’t provide adequate notice that a marquee player will be rested for a game. It is my job as NFL commissioner to protect the shield, so I commend you for protecting the integrity of the game."}, {"de34": "You also said in the memo sent to NBA owners that you will impose “significant penalties” on teams that don’t abide by your rules. Punishment is my specialty. No one is tougher on rule breakers than me, so here’s some unsolicited advice, based on my experiences."}, {"a341": "The prime-time Cavaliers-Clippers game on Saturday scored a pathetic 1.1 overnight rating, which must have been an especially worrisome return in light of your league signing a monstrous TV deal. If fans bought tickets to see LeBron James play the Clippers and ended up watching Richard Jefferson lead the Cavs in scoring, that’s a tough break, and bad for the league, from a customer satisfaction standpoint. Those decisions can have an impact on, as you said in the memo, “fans and business partners” and the perception of the game."}, {"621e": "Don’t overreact, though. Keep in mind that you already have a big change coming. Under the new collective bargaining agreement the NBA and the NBPA signed in December, the start of the season will be moved up one week, which will give the league’s spreadsheet wizards more flexibility in assembling the schedule to create ample time between prime-time games, in most instances. No team will play four games in five nights more than once. Back-to-backs will be reduced significantly."}, {"ccd9": "That alone could solve this issue. But in case it doesn’t, then what kind of punishment do you have in mind? Suspensions? Fines? Coaches and front-office executives, as well as many fans, understand that rest is important. You need it to prevent injuries, therefore maintaining or maximizing a team’s chances of staying healthy for the playoffs. That’s when the games really matter."}, {"7b88": "I don’t want to see fans lose trust in you, Adam. You are a good man with good intentions. So think through the ripple effects of punishments. What would a fine accomplish? In 2012, your predecessor David Stern handed out a $250,000 fine to the Spurs for doing a “disservice” to the league and fans for not playing Tim Duncan, Tony Parker, Manu Ginobili, and Danny Green against the Heat, in the fourth game in five nights, and in the second game of a back-to-back. Even I think that seems extreme."}, {"f9c5": "Did that fine make things better for fans who missed out on seeing their favorite players live? No. Did it stop teams from resting their players? The practice of DNP-Rest plummeted for the rest of that season, according to ESPN’s Tom Haberstroh, but it’s been rampant ever since. Why? Yeah, science! Haberstroh added that back-to-backs played on the road generate 3.5 times the injury rate as those played at home. I suspended Tom Brady four games for being “generally aware” of team employees allegedly deflating footballs because I don’t believe in science, but a lot of people do and you must respect their beliefs."}, {"0a6f": "You have even said that teams resting players is a “sophistication of minutes management by coaches and general managers.” You’ve apparently changed your mind, though, and are ready to hand down discipline. But if fining the team doesn’t solve anything, then what’s the alternative? You can’t suspend the player (as much as I would love you to), because that’d be counterproductive. Fining the coach? Fining the general manager? Suspending the coach or GM? Does that make any sense? Maybe it’ll deter some teams from resting players, but it won’t solve the problem."}, {"a6c1": "Regulation, not punishment, is the solution. Would you like me to come to your powwow at the NBA Board of Governors meeting on April 6 in New York? I have ideas. Here’s the gist of them:"}, {"def9": "One last thought, Adam: What you called “an extremely significant issue” wouldn’t make the morning headlines in the NFL. Think about what Bill Simmons and Malcolm Gladwell called the NFL’s “second conversations.” For me, the list is long and includes concussions, the decline of youth football participation, my abuse of power, and conflicting policies regarding performance-enhancing drugs."}, {"ffa6": "You’re the commissioner of an international sport that’s rising in popularity. Your “second conversations” are shoddy officiating (which isn’t unique to the NBA), Draymond Green’s karate kicks, and scheduling issues. Big deal. Want to swap gigs and try your hand at protecting the shield?"}, {"cba4": "Regards,"}, {"840b": "Roger Goodell"}], "content": "An Open Letter About Rest, From Roger Goodell to Adam Silver The NBA’s issues pale in comparison to the NFL’s Hi Adam, it’s Roger Goodell. I woke up this morning to an ESPN push alert saying you will crack down on NBA teams that don’t provide adequate notice that a marquee player will be rested for a game. It is my job as NFL commissioner to protect the shield, so I commend you for protecting the integrity of the game. You also said in the memo sent to NBA owners that you will impose “significant penalties” on teams that don’t abide by your rules. Punishment is my specialty. No one is tougher on rule breakers than me, so here’s some unsolicited advice, based on my experiences. The prime-time Cavaliers-Clippers game on Saturday scored a pathetic 1.1 overnight rating, which must have been an especially worrisome return in light of your league signing a monstrous TV deal. If fans bought tickets to see LeBron James play the Clippers and ended up watching Richard Jefferson lead the Cavs in scoring, that’s a tough break, and bad for the league, from a customer satisfaction standpoint. Those decisions can have an impact on, as you said in the memo, “fans and business partners” and the perception of the game. Don’t overreact, though. Keep in mind that you already have a big change coming. Under the new collective bargaining agreement the NBA and the NBPA signed in December, the start of the season will be moved up one week, which will give the league’s spreadsheet wizards more flexibility in assembling the schedule to create ample time between prime-time games, in most instances. No team will play four games in five nights more than once. Back-to-backs will be reduced significantly. That alone could solve this issue. But in case it doesn’t, then what kind of punishment do you have in mind? Suspensions? Fines? Coaches and front-office executives, as well as many fans, understand that rest is important. You need it to prevent injuries, therefore maintaining or maximizing a team’s chances of staying healthy for the playoffs. That’s when the games really matter. I don’t want to see fans lose trust in you, Adam. You are a good man with good intentions. So think through the ripple effects of punishments. What would a fine accomplish? In 2012, your predecessor David Stern handed out a $250,000 fine to the Spurs for doing a “disservice” to the league and fans for not playing Tim Duncan, Tony Parker, Manu Ginobili, and Danny Green against the Heat, in the fourth game in five nights, and in the second game of a back-to-back. Even I think that seems extreme. Did that fine make things better for fans who missed out on seeing their favorite players live? No. Did it stop teams from resting their players? The practice of DNP-Rest plummeted for the rest of that season, according to ESPN’s Tom Haberstroh, but it’s been rampant ever since. Why? Yeah, science! Haberstroh added that back-to-backs played on the road generate 3.5 times the injury rate as those played at home. I suspended Tom Brady four games for being “generally aware” of team employees allegedly deflating footballs because I don’t believe in science, but a lot of people do and you must respect their beliefs. You have even said that teams resting players is a “sophistication of minutes management by coaches and general managers.” You’ve apparently changed your mind, though, and are ready to hand down discipline. But if fining the team doesn’t solve anything, then what’s the alternative? You can’t suspend the player (as much as I would love you to), because that’d be counterproductive. Fining the coach? Fining the general manager? Suspending the coach or GM? Does that make any sense? Maybe it’ll deter some teams from resting players, but it won’t solve the problem. Regulation, not punishment, is the solution. Would you like me to come to your powwow at the NBA Board of Governors meeting on April 6 in New York? I have ideas. Here’s the gist of them: One last thought, Adam: What you called “an extremely significant issue” wouldn’t make the morning headlines in the NFL. Think about what Bill Simmons and Malcolm Gladwell called the NFL’s “second conversations.” For me, the list is long and includes concussions, the decline of youth football participation, my abuse of power, and conflicting policies regarding performance-enhancing drugs. You’re the commissioner of an international sport that’s rising in popularity. Your “second conversations” are shoddy officiating (which isn’t unique to the NBA), Draymond Green’s karate kicks, and scheduling issues. Big deal. Want to swap gigs and try your hand at protecting the shield? Regards, Roger Goodell ", "name": "84", "child": "84_1\t84_2\t84_3\t84_4\t84_5\t84_6\t84_7\t84_8\t84_9\t84_10\t84_11\t84_12\t84_13\t84_14\t84_15\t84_16\t84_17", "timestamp": "Mar 21"}