{"parent": "", "title": "Unconventional way of learning a new programming language", "author": "Sahil Dua", "sentences": [{"3d85": "Unconventional way of learning a new programming language"}, {"262a": "There are more than 500 programming languages. Hence, it’s pretty normal for you to start learning a new programming language today. It’s possible that you know C++ and Java but your work requires Python or you are well versed in Python and you need to code in Java at work. Or maybe you want to learn that cool language just to expand your expertise."}, {"d006": "What are your options if you want to learn a new programming language?"}, {"c336": "Some of you may even argue that the best way of learning a new language is actually as follows:"}, {"958f": "Fair enough! This makes sure that you apply the knowledge you gain from learning the syntax of the language you want to learn."}, {"8bf2": "I have developed more than 20 mini projects while learning different languages. Trust me, when you write code for your personal project which may be a weekend project or an overnight quick hack, you write code to get something done. All you care about is — “Does my code work?”. You hardly care about the quality of the code."}, {"6903": "“Any fool can write code that a computer can understand. Good programmers write code that humans can understand.” — (Martin Fowler)"}, {"216b": "So, how do you learn good practices of the new programming language that you are trying to learn?"}, {"771f": "Contribute to an open source project in that language."}, {"4319": "Surprised? Some of you may be thinking — “But wait, open source is hard. We can contribute to an open source project only if we are expert in that language, right?”. The answer is No."}, {"2301": "Let me tell you a story."}, {"e5e4": "Last year, I got an offer for full-time job from Booking.com and I knew that I’d be working on Perl (which is their primary language for backend). In June 2016, when I got done with my college degree, I started learning Perl so as to prepare myself for my first job after college. Since I was to join in second week of the July, I had roughly one month."}, {"47d1": "I started reading about syntax of Perl and started understanding some of the common patterns of the language. Now, I really wanted to build something using Perl so that I could apply my knowledge of the language and practice various concepts of the language. While I was looking for ideas to build something in Perl, I came across DuckDuckGo’s open source organization on GitHub. I noticed that some of the open projects were written in Perl. I had a look at the issues and found a lot of “beginner” issues. I immediately started working on them and submitted a couple of pull requests. Fast forward to today, I am one of the main contributors for a couple of their open projects and also one of the 20 Open Source Community Leaders for DuckDuckGo."}, {"d634": "Moral of the story — I ended up learning Perl by contributing to open source projects written in Perl."}, {"8894": "So why did it work?"}, {"0832": "Right after I learnt the syntax of Perl, I started contributing to open source projects. While doing so, I always used to look at the existing modules. I used to notice the patterns being used in Perl. Hence, I started picking up those good practices in my own code and it helped me in learning how to write good code in Perl."}, {"6dc8": "That wasn’t just a coincidence; let me tell you another story to derive more correlation."}, {"ee1f": "Recently, while working at Booking.com, I picked up some task which included working (adding a new feature) on one of the services written in Go language. This was the conversation I had with my teammate —"}, {"a38f": "Me: I really like this task. I want to work on it. What do you think about it?"}, {"f15e": "Him: Yes, it’s indeed an interesting one. However, it requires knowledge of Go. Do you know Go?"}, {"92e3": "Me: No."}, {"e1f2": "Him: Do you want to learn Go?"}, {"7bdb": "Me: Yes!"}, {"f40f": "Him: *smiles* There you go!"}, {"2654": "So there I was — at the verge of learning another programming language — Go!"}, {"7483": "I started reading about the syntax of Go and found an awesome beginners language tour on their official website. It was good enough to get me acquainted with all the basic concepts of the language."}, {"5e3a": "Once again, I started looking for open source projects in Go which had some “beginner” or “easy-fix” issues. I found a project by Google which is basically a Go wrapper for GitHub’s REST API."}, {"bfb3": "I had my first PR on that project 2 days after I started learning Go."}, {"bcbe": "My contribution graph for last 1 year (https://github.com/sahildua2305)"}, {"36cb": "How Does Open Source Help?"}, {"7ea5": "So now you may be wondering about how open source contributions can help you in learning good practices of a language. There are various aspects of it. Let’s discuss them one by one."}, {"c1cc": "Code Quality"}, {"d4b5": "Most of the good open source projects have strict coding guidelines which you have to adhere to in order to get your code merged. This will help you in adapting those guidelines and hence writing good quality code even though you are just learning the language."}, {"6bf3": "Not just that, you have a chance to look at the rest of the code and see how well it’s written and/or documented."}, {"7e1e": "Code Reviews"}, {"ef1a": "The best part about open source contributions is code reviewing. When you push your code, you get feedback from the experts associated with that project and hence it gives you a chance to improve your understanding of a language."}, {"2b16": "This is like getting a free-of-cost personal guidance about how to write good code."}, {"71c9": "Appreciation"}, {"b8a4": "First comment on my first PR in Go Lang (https://github.com/google/go-github/pull/497)"}, {"c1e5": "We, as software developers, really need appreciation for our work; and open source community makes sure you have enough of that. In my whole experience with open source contributions, I have never received even a single comment which was insulting or demotivating. Everyone is super encouraging and helpful."}, {"0c4e": "Another comment by someone in DuckDuckGo community"}, {"1bea": "So next time you want to learn a new language, go ahead and take the plunge! Find an open source project to contribute to and march ahead on the path to learning that language and its nuances ;)"}, {"4a17": "Do let me know how this unconventional way works for you. Also, please recommend (❤) this post if you think this may be useful for someone."}, {"d453": "Feel free to share any other way that worked for you really well. Tweet/follow me @sahildua2305."}], "content": "Unconventional way of learning a new programming language There are more than 500 programming languages. Hence, it’s pretty normal for you to start learning a new programming language today. It’s possible that you know C++ and Java but your work requires Python or you are well versed in Python and you need to code in Java at work. Or maybe you want to learn that cool language just to expand your expertise. What are your options if you want to learn a new programming language? Some of you may even argue that the best way of learning a new language is actually as follows: Fair enough! This makes sure that you apply the knowledge you gain from learning the syntax of the language you want to learn. I have developed more than 20 mini projects while learning different languages. Trust me, when you write code for your personal project which may be a weekend project or an overnight quick hack, you write code to get something done. All you care about is — “Does my code work?”. You hardly care about the quality of the code. “Any fool can write code that a computer can understand. Good programmers write code that humans can understand.” — (Martin Fowler) So, how do you learn good practices of the new programming language that you are trying to learn? Contribute to an open source project in that language. Surprised? Some of you may be thinking — “But wait, open source is hard. We can contribute to an open source project only if we are expert in that language, right?”. The answer is No. Let me tell you a story. Last year, I got an offer for full-time job from Booking.com and I knew that I’d be working on Perl (which is their primary language for backend). In June 2016, when I got done with my college degree, I started learning Perl so as to prepare myself for my first job after college. Since I was to join in second week of the July, I had roughly one month. I started reading about syntax of Perl and started understanding some of the common patterns of the language. Now, I really wanted to build something using Perl so that I could apply my knowledge of the language and practice various concepts of the language. While I was looking for ideas to build something in Perl, I came across DuckDuckGo’s open source organization on GitHub. I noticed that some of the open projects were written in Perl. I had a look at the issues and found a lot of “beginner” issues. I immediately started working on them and submitted a couple of pull requests. Fast forward to today, I am one of the main contributors for a couple of their open projects and also one of the 20 Open Source Community Leaders for DuckDuckGo. Moral of the story — I ended up learning Perl by contributing to open source projects written in Perl. So why did it work? Right after I learnt the syntax of Perl, I started contributing to open source projects. While doing so, I always used to look at the existing modules. I used to notice the patterns being used in Perl. Hence, I started picking up those good practices in my own code and it helped me in learning how to write good code in Perl. That wasn’t just a coincidence; let me tell you another story to derive more correlation. Recently, while working at Booking.com, I picked up some task which included working (adding a new feature) on one of the services written in Go language. This was the conversation I had with my teammate — Me: I really like this task. I want to work on it. What do you think about it? Him: Yes, it’s indeed an interesting one. However, it requires knowledge of Go. Do you know Go? Me: No. Him: Do you want to learn Go? Me: Yes! Him: *smiles* There you go! So there I was — at the verge of learning another programming language — Go! I started reading about the syntax of Go and found an awesome beginners language tour on their official website. It was good enough to get me acquainted with all the basic concepts of the language. Once again, I started looking for open source projects in Go which had some “beginner” or “easy-fix” issues. I found a project by Google which is basically a Go wrapper for GitHub’s REST API. I had my first PR on that project 2 days after I started learning Go. My contribution graph for last 1 year (https://github.com/sahildua2305) How Does Open Source Help? So now you may be wondering about how open source contributions can help you in learning good practices of a language. There are various aspects of it. Let’s discuss them one by one. Code Quality Most of the good open source projects have strict coding guidelines which you have to adhere to in order to get your code merged. This will help you in adapting those guidelines and hence writing good quality code even though you are just learning the language. Not just that, you have a chance to look at the rest of the code and see how well it’s written and/or documented. Code Reviews The best part about open source contributions is code reviewing. When you push your code, you get feedback from the experts associated with that project and hence it gives you a chance to improve your understanding of a language. This is like getting a free-of-cost personal guidance about how to write good code. Appreciation First comment on my first PR in Go Lang (https://github.com/google/go-github/pull/497) We, as software developers, really need appreciation for our work; and open source community makes sure you have enough of that. In my whole experience with open source contributions, I have never received even a single comment which was insulting or demotivating. Everyone is super encouraging and helpful. Another comment by someone in DuckDuckGo community So next time you want to learn a new language, go ahead and take the plunge! Find an open source project to contribute to and march ahead on the path to learning that language and its nuances ;) Do let me know how this unconventional way works for you. Also, please recommend (❤) this post if you think this may be useful for someone. Feel free to share any other way that worked for you really well. Tweet/follow me @sahildua2305. ", "name": "849", "child": "849_1\t849_2\t849_3\t849_4\t849_5\t849_6\t849_7\t849_8\t849_9\t849_10\t849_11\t849_12\t849_13\t849_14\t849_15\t849_16\t849_17\t849_18\t849_19\t849_20\t849_21\t849_22\t849_23\t849_24\t849_25849_1\t849_2\t849_3\t849_4\t849_5\t849_6\t849_7\t849_8\t849_9\t849_10\t849_11\t849_12\t849_13\t849_14\t849_15\t849_16\t849_17\t849_18\t849_19\t849_20\t849_21\t849_22\t849_23\t849_24\t849_25849_1\t849_2\t849_3\t849_4\t849_5\t849_6\t849_7\t849_8\t849_9\t849_10\t849_11\t849_12\t849_13\t849_14\t849_15\t849_16\t849_17\t849_18\t849_19\t849_20\t849_21\t849_22\t849_23\t849_24\t849_25849_1\t849_2\t849_3\t849_4\t849_5\t849_6\t849_7\t849_8\t849_9\t849_10\t849_11\t849_12\t849_13\t849_14\t849_15\t849_16\t849_17\t849_18\t849_19\t849_20\t849_21\t849_22\t849_23\t849_24\t849_25", "timestamp": "Mar 15"}