{"parent": "", "title": "I am a good bipolar", "author": "Rachel KallemWhitman", "sentences": [{"31a8": "I am a good bipolar"}, {"929a": "I am a good bipolar."}, {"141f": "I am a watchful bipolar."}, {"1838": "I research myself every day."}, {"314b": "In order to manage mental illness you need to recognize the triggers and the tells that alert you to the fact that you’re not-so-slowly inching away from sanity."}, {"7b30": "As those with mental illness know, there are some actions that universally signal that we’re moments away from sinking into nothingness or setting ourselves on fire."}, {"fb76": "Not sleeping, sleeping too much, not eating, eating too much, never leaving your house, going out all night every night, all the drugs, all the drinking, all the money spent on all the dumbest things, making bad decisions, or doing nothing at all."}, {"b0c6": "These can be easier to spot."}, {"57ea": "But in addition to that we all have little things, little bizarre behaviors and skewed logic, little inklings unique to us that whisper and wail to the rest of the world that we’re starting to slip sideways into being fucked up."}, {"3dd2": "They all start out so infuriatingly under the radar. Cloaked in self-sabotage. Designed to go unnoticed, fatally subtle. Mental illness is an abusive dark shadow. Think Eeyore with unrelenting lightning bolts and fist sized bullets of hail. And thunder telling you to go fuck yourself."}, {"1bf1": "You need to constantly be on the lookout for all these little, idiosyncratic signs that signal you’re starting to lose it."}, {"75c8": "complete and unabridged journal"}, {"6e1b": "Anyway, to be a good bipolar you need to understand your illness, yourself, and take a lot of notes. Here goes it."}, {"ffe5": "For me, depression is listening to an instrumental version of the Pixie’s “Where is My Mind” on repeat."}, {"71f3": "It’s feeling fat. It’s not eating. It’s realizing I’m a failure at everything I do."}, {"b561": "Realizing that no one truly likes me and I’m full of mistakes — some that already happened and so many more yet to be made. I second-guess, I trillionth guess, everything I do. I have no patience for anything, anyone, especially not for myself."}, {"9429": "I have no energy for the catastrophe that is me. I start having panic attacks, every day it feels like I’m losing more and more of my right to breathe, my stomach is full of concrete and my eyes won’t dry. I can’t stop tensing my hands, so tightly that my rigid, pained fingers make it practically impossible to crack open my pillbox full of ativan."}, {"fe9a": "Depression is crying in the car after I hang out with friends because it physically hurts to keep pretending that I am happy."}, {"1a52": "It’s fondly remembering how it felt to self-harm, fantasizing over the release I used to get from pooling blood around the point of a pair of scissors, practically drooling over the phantom pain I could cause, getting light headed just remembering how such delectable physical pain freed me from emotional wreckage. When I am depressed I look wistfully at the scars on my body because they remind me of a time when I was free to self injure, when survival meant dissecting my pain all night long assuming I had the right number of band aids."}, {"fbb5": "But then again, depression is also dreaming of dying."}, {"bb0d": "Dreaming of letting go and leaving everything and everyone behind. Coming to terms with the fact that you will always be a burden. It’s your fault. Why are you still here? Stop dreaming already."}, {"19c8": "For me, hypomania and mania are listening to Grimes too loudly, too often. She’s the musician who invented the genre “ADD music;” she’s a psychedelic alien sprite — right up my alley."}, {"c769": "My desire to hear everything and look at everything and touch everything is insatiable. To others it looks obsessive and that’s because it is."}, {"f1e1": "I want to devour words, noises, colors, laughter. I want to flit around feverously and the only thing keeping me paced is the need to rub my hand across brick buildings, smooth countertops, finger fabrics, and caress everything that I deem too tender to pass up."}, {"021b": "Strong heightened sensations make me salivate — except I don’t need to eat because I’m too beautiful for food."}, {"c2ee": "When I start to cycle I always get this sly knowing smile that slinks sweetly across my face. It’s because I’ve figured out the universe and I’m the only one in on the secret. But I have a shoddy poker face so when my husband asks me if I’m “too happy” I can try to lie but he sees how unbelievably sick and happy I am and that I need help."}, {"b3d1": "When my mania revs full force I rock my body and wring my hands. I’m energized and agitated and I fidget ferociously in a way that is utterly unsatisfying but compulsive."}, {"7153": "My eyes feel too big for my face and everything looks louder in both good and bad ways."}, {"bc4b": "“This time it’s different,” I always say, “this is the real me.” My speech is pressured, erratic, loud, confusing, and brilliant. I don’t recognize myself."}, {"3ec0": "For me, psychosis is being suspicious of my husband’s basil plant because it has been looking at me funny all week. I decorate it with office supplies to make it look like a makeshift Christmas tree, like if a mentally unstable Office Depot employee threw an underwhelming, low-budget, holiday party. Christening the plant with a purple paperclip “Christmas tree” topper, decorating it with rubber band tinsel, and nesting four grapes at the base to mimic gifts at first made the plant less menacing. But ultimately it never works and I cry to my husband to throw it out, which is a bummer because we both like Caprese salads when I’m sane."}, {"1dca": "When I’m psychotic I don’t trust any food that isn’t pre-packaged. My husband knows that things are amiss when I throw out our economy, bulk size tub of applesauce and insist on buying individual applesauce cups with tight, tamper proof seals."}, {"62b1": "The menu of a psychotic leads little to the imagination."}, {"e2f5": "Hypergraphia hits me hard. If I don’t write down exactly what I’m thinking — with 100% correctness — it is the end of the world. I get so mad my hair falls out and I can’t see straight. I can probably attribute that to the countless times I’ve leapt out of the shower, with no time to find my glasses, because I HAD to write down a paragraph that at the time was my manifesto but after the antipsychotics kick in is actually just fucking nonsense. Which is devastatingly disappointing. To not be brilliant after all."}, {"6999": "Sometimes I just hug my knees to my forehead and cry on the floor. Or on the bed. Or on the couch. Or in the car because I’m stuck in skin that’s scratchy, loud, vicious, and I’m equal parts dying to be lost forever and frightened of being alone."}, {"ccc9": "Sometimes I hear or see things that aren’t there and I wonder if it’s the real world or my real craziness- the confusion monopolizes so much of my time."}, {"c172": "I talk about Princess Diana and Mother Theresa with rave reviews. If these two ladies come up in conversation my husband knows my meds aren’t cutting it. And I’m probably on the verge of cutting myself."}, {"ad4c": "I’ve lived with this illness for over fifteen years and I’ve studied myself intently."}, {"7c11": "I observe my behaviors and analyze my cognitions."}, {"8234": "I see a therapist and a psychiatrist and a fundamental component of my marriage is talking authentically about my bipolar."}, {"ef8b": "Over the years I’ve gotten so much better at comparing my notes with those of my treatment team. Of trying to intervene when things start to blur. Being proactive to prevent trashing innocent basil plants."}, {"9dd1": "I’m trying so hard to pay attention to the illness and not pretend that the illness is who I am — the “me” that I celebrate and the “me” that I despise."}, {"04d1": "But with mental illness it is so hard to be objective."}, {"c378": "The illness excels at distracting you and seeping into your skull without you even knowing there was an invasion, so you get sick but it just seems normal. Insanity is status quo. I’m a good bipolar but it is challenging to successfully track and catch my crazy."}, {"1732": "I slip up a lot it seems. It is exhausting to be hyper vigilant 24/7 hoping to catch a glimpse of the beginnings of a brush fire. There’s just been a lot on my mind lately because I graduate in May and I need to get a job. I also haven’t been sleeping much and I’m pretty fucking tired. Today I downloaded “Where is My Mind” by Maxence Cyrin– I totally recommend it. The melancholic nature of the song is so beautiful the way it lingers and lays heavily across your shoulders. I forgot to pick up my ativan prescription. I am so completely worthless. It will never get better. Why am I even here? I am tired of waking up."}], "content": "I am a good bipolar I am a good bipolar. I am a watchful bipolar. I research myself every day. In order to manage mental illness you need to recognize the triggers and the tells that alert you to the fact that you’re not-so-slowly inching away from sanity. As those with mental illness know, there are some actions that universally signal that we’re moments away from sinking into nothingness or setting ourselves on fire. Not sleeping, sleeping too much, not eating, eating too much, never leaving your house, going out all night every night, all the drugs, all the drinking, all the money spent on all the dumbest things, making bad decisions, or doing nothing at all. These can be easier to spot. But in addition to that we all have little things, little bizarre behaviors and skewed logic, little inklings unique to us that whisper and wail to the rest of the world that we’re starting to slip sideways into being fucked up. They all start out so infuriatingly under the radar. Cloaked in self-sabotage. Designed to go unnoticed, fatally subtle. Mental illness is an abusive dark shadow. Think Eeyore with unrelenting lightning bolts and fist sized bullets of hail. And thunder telling you to go fuck yourself. You need to constantly be on the lookout for all these little, idiosyncratic signs that signal you’re starting to lose it. complete and unabridged journal Anyway, to be a good bipolar you need to understand your illness, yourself, and take a lot of notes. Here goes it. For me, depression is listening to an instrumental version of the Pixie’s “Where is My Mind” on repeat. It’s feeling fat. It’s not eating. It’s realizing I’m a failure at everything I do. Realizing that no one truly likes me and I’m full of mistakes — some that already happened and so many more yet to be made. I second-guess, I trillionth guess, everything I do. I have no patience for anything, anyone, especially not for myself. I have no energy for the catastrophe that is me. I start having panic attacks, every day it feels like I’m losing more and more of my right to breathe, my stomach is full of concrete and my eyes won’t dry. I can’t stop tensing my hands, so tightly that my rigid, pained fingers make it practically impossible to crack open my pillbox full of ativan. Depression is crying in the car after I hang out with friends because it physically hurts to keep pretending that I am happy. It’s fondly remembering how it felt to self-harm, fantasizing over the release I used to get from pooling blood around the point of a pair of scissors, practically drooling over the phantom pain I could cause, getting light headed just remembering how such delectable physical pain freed me from emotional wreckage. When I am depressed I look wistfully at the scars on my body because they remind me of a time when I was free to self injure, when survival meant dissecting my pain all night long assuming I had the right number of band aids. But then again, depression is also dreaming of dying. Dreaming of letting go and leaving everything and everyone behind. Coming to terms with the fact that you will always be a burden. It’s your fault. Why are you still here? Stop dreaming already. For me, hypomania and mania are listening to Grimes too loudly, too often. She’s the musician who invented the genre “ADD music;” she’s a psychedelic alien sprite — right up my alley. My desire to hear everything and look at everything and touch everything is insatiable. To others it looks obsessive and that’s because it is. I want to devour words, noises, colors, laughter. I want to flit around feverously and the only thing keeping me paced is the need to rub my hand across brick buildings, smooth countertops, finger fabrics, and caress everything that I deem too tender to pass up. Strong heightened sensations make me salivate — except I don’t need to eat because I’m too beautiful for food. When I start to cycle I always get this sly knowing smile that slinks sweetly across my face. It’s because I’ve figured out the universe and I’m the only one in on the secret. But I have a shoddy poker face so when my husband asks me if I’m “too happy” I can try to lie but he sees how unbelievably sick and happy I am and that I need help. When my mania revs full force I rock my body and wring my hands. I’m energized and agitated and I fidget ferociously in a way that is utterly unsatisfying but compulsive. My eyes feel too big for my face and everything looks louder in both good and bad ways. “This time it’s different,” I always say, “this is the real me.” My speech is pressured, erratic, loud, confusing, and brilliant. I don’t recognize myself. For me, psychosis is being suspicious of my husband’s basil plant because it has been looking at me funny all week. I decorate it with office supplies to make it look like a makeshift Christmas tree, like if a mentally unstable Office Depot employee threw an underwhelming, low-budget, holiday party. Christening the plant with a purple paperclip “Christmas tree” topper, decorating it with rubber band tinsel, and nesting four grapes at the base to mimic gifts at first made the plant less menacing. But ultimately it never works and I cry to my husband to throw it out, which is a bummer because we both like Caprese salads when I’m sane. When I’m psychotic I don’t trust any food that isn’t pre-packaged. My husband knows that things are amiss when I throw out our economy, bulk size tub of applesauce and insist on buying individual applesauce cups with tight, tamper proof seals. The menu of a psychotic leads little to the imagination. Hypergraphia hits me hard. If I don’t write down exactly what I’m thinking — with 100% correctness — it is the end of the world. I get so mad my hair falls out and I can’t see straight. I can probably attribute that to the countless times I’ve leapt out of the shower, with no time to find my glasses, because I HAD to write down a paragraph that at the time was my manifesto but after the antipsychotics kick in is actually just fucking nonsense. Which is devastatingly disappointing. To not be brilliant after all. Sometimes I just hug my knees to my forehead and cry on the floor. Or on the bed. Or on the couch. Or in the car because I’m stuck in skin that’s scratchy, loud, vicious, and I’m equal parts dying to be lost forever and frightened of being alone. Sometimes I hear or see things that aren’t there and I wonder if it’s the real world or my real craziness- the confusion monopolizes so much of my time. I talk about Princess Diana and Mother Theresa with rave reviews. If these two ladies come up in conversation my husband knows my meds aren’t cutting it. And I’m probably on the verge of cutting myself. I’ve lived with this illness for over fifteen years and I’ve studied myself intently. I observe my behaviors and analyze my cognitions. I see a therapist and a psychiatrist and a fundamental component of my marriage is talking authentically about my bipolar. Over the years I’ve gotten so much better at comparing my notes with those of my treatment team. Of trying to intervene when things start to blur. Being proactive to prevent trashing innocent basil plants. I’m trying so hard to pay attention to the illness and not pretend that the illness is who I am — the “me” that I celebrate and the “me” that I despise. But with mental illness it is so hard to be objective. The illness excels at distracting you and seeping into your skull without you even knowing there was an invasion, so you get sick but it just seems normal. Insanity is status quo. I’m a good bipolar but it is challenging to successfully track and catch my crazy. I slip up a lot it seems. It is exhausting to be hyper vigilant 24/7 hoping to catch a glimpse of the beginnings of a brush fire. There’s just been a lot on my mind lately because I graduate in May and I need to get a job. I also haven’t been sleeping much and I’m pretty fucking tired. Today I downloaded “Where is My Mind” by Maxence Cyrin– I totally recommend it. The melancholic nature of the song is so beautiful the way it lingers and lays heavily across your shoulders. I forgot to pick up my ativan prescription. I am so completely worthless. It will never get better. Why am I even here? I am tired of waking up. ", "name": "876", "child": "876_1\t876_2\t876_3\t876_4\t876_5\t876_6\t876_7", "timestamp": "Apr 13"}