{"parent": "", "title": "My Inbox to Yours 001 | Permission To Be Who I Am", "author": "Gary Vaynerchuk", "sentences": [{"e56d": "My Inbox to Yours 001 | Permission To Be Who I Am"}, {"3d00": "Sometimes it’s better to hear from each other, I want to use medium for a few months to start trying that, hope you enjoy the first post in this series …"}, {"6a3d": "From: Nicholas Date: Sun, Mar 12, 2017 at 3:31 AMSubject: Re: [3 min read] Gary, A Humble Thank You: 15 Months Ago, You Changed My LifeTo: Gary Vaynerchuk"}, {"fbf2": "Gary, I’ve never reached out — because I don’t know how to thank you."}, {"e5bc": "So, cheers to this overdue email."}, {"e422": "My family has been entrepreneurs in our city (Rochester, NY) for nearly 100 years. Everyone has sold/bailed, besides my mother. I am the only one in my families generation to carry the legacy — out of the 26 of us great-grandkids — and I’m proud of that. And it’s because of you."}, {"7e6a": "In 2015, I saw the Monday morning rant and accepted my identity as a corporate heretic. Then, after following along closely and reading crush it — my life completely fast tracked."}, {"ecca": "I was a college drop out for 7 years, but in 2016 I graduated — because of you."}, {"bdd6": "I got a job at a startup and generated $5M of new LTV revenue in 9 months exclusively through Facebook Advertising for my company — 20% growth — because of you."}, {"0942": "In Dec 2015 I started my own business and followed through on my great-grandfathers legacy — because of you."}, {"e207": "In 15 months, I’ve 5x my income in a economically dying city — top 3 in nation — from 50k to 250k — because of you. (Crush it)"}, {"696a": "Last week, I helped pay my mothers breast cancer co-pays — because of you."}, {"d6a1": "I will pay off 125k of student debt in 1 year — because of you."}, {"2959": "My kids & wife have a massive advantage in life — because you’ve gave me permission to be who I am."}, {"4457": "There are no words man, there’s just a ton of gratitude and appreciation. My life is more fulfilled than I could have ever imagined."}, {"071d": "No idea how to close this out. I hope this finds you well at the right time brother."}, {"5ec4": "Thanks for reading my new series! If you enjoyed it, hit that heart button below ;)"}], "content": "My Inbox to Yours 001 | Permission To Be Who I Am Sometimes it’s better to hear from each other, I want to use medium for a few months to start trying that, hope you enjoy the first post in this series … From: Nicholas Date: Sun, Mar 12, 2017 at 3:31 AMSubject: Re: [3 min read] Gary, A Humble Thank You: 15 Months Ago, You Changed My LifeTo: Gary Vaynerchuk Gary, I’ve never reached out — because I don’t know how to thank you. So, cheers to this overdue email. My family has been entrepreneurs in our city (Rochester, NY) for nearly 100 years. Everyone has sold/bailed, besides my mother. I am the only one in my families generation to carry the legacy — out of the 26 of us great-grandkids — and I’m proud of that. And it’s because of you. In 2015, I saw the Monday morning rant and accepted my identity as a corporate heretic. Then, after following along closely and reading crush it — my life completely fast tracked. I was a college drop out for 7 years, but in 2016 I graduated — because of you. I got a job at a startup and generated $5M of new LTV revenue in 9 months exclusively through Facebook Advertising for my company — 20% growth — because of you. In Dec 2015 I started my own business and followed through on my great-grandfathers legacy — because of you. In 15 months, I’ve 5x my income in a economically dying city — top 3 in nation — from 50k to 250k — because of you. (Crush it) Last week, I helped pay my mothers breast cancer co-pays — because of you. I will pay off 125k of student debt in 1 year — because of you. My kids & wife have a massive advantage in life — because you’ve gave me permission to be who I am. There are no words man, there’s just a ton of gratitude and appreciation. My life is more fulfilled than I could have ever imagined. No idea how to close this out. I hope this finds you well at the right time brother. Thanks for reading my new series! If you enjoyed it, hit that heart button below ;) ", "name": "878", "child": "878_1\t878_2\t878_3\t878_4\t878_5\t878_6\t878_7\t878_8\t878_9\t878_10\t878_11\t878_12\t878_13\t878_14\t878_15\t878_16\t878_17\t878_18\t878_19\t878_20\t878_21\t878_22\t878_23\t878_24\t878_25878_1\t878_2\t878_3\t878_4\t878_5\t878_6\t878_7\t878_8\t878_9\t878_10\t878_11\t878_12\t878_13\t878_14\t878_15\t878_16\t878_17\t878_18\t878_19\t878_20\t878_21\t878_22\t878_23\t878_24\t878_25", "timestamp": "Mar 17"}