{"parent": "", "title": "Love/Time", "author": "C. Duhnne", "sentences": [{"a6c3": "Love/Time"}, {"31be": "We lived and breathed fire. The intensity of first love that consumed, branding new wholes into our hearts — the organs that kept time: his heartbeat to my breaths. His name was Summer: light like a breeze and laugh like the ocean. We drew constellations in the stars and pitched tents, sang made up lyrics around a campfire and swam with dolphins. He was cool beer sipped in summer heat and menthol cigarettes. I loved him the way you love when you’re 18 and free, with a burn that scorched with every kiss and brush of fingers; his plaid shirt around my shoulders, iPod blasting white kid rap and days that blended into fireworks at sunset. We traded promises and seashells, with an intensity that inspired sonnets. Collected sand in our shoes and brought it to college. The fairytale that ended the way summer always does: too soon."}, {"ffac": "I jumped into Autumn the way a child dives into orange leaves: headfirst with no consequence of pain. The warmth of Summer lingered on my skin, burnt from knowledge and memories. We whispered secrets in a fort of blankets and painted futures into our skins, swearing forever. Forever burned. Like the whiskey that slid down my throat, like the newfound freedom that college brought. I gave him the sacred parts of me and he made me a woman. Tequila shots and smoke that blazed in my throat long after our goodbyes were said."}, {"c02e": "I inhaled his forever, but it didn’t make him stay."}, {"995f": "Winter brought a blistering heat that belied his name. The smell of his down jacket as the frigid wind blew us together forever imprinted in my chest. The blazing fire in his apartment, empty wine bottles and a discarded copy of Aristotle on his rug: playing at grown up and house that gave new reasons to let go of the past. We debated politics and smoked on the fire escape. Snow melted down my cheeks. He was angry fucking and cold disapproval; warm apologies and make up sex. His skin was a map to a foreign city and a season that dragged on too long. My favourite regret."}, {"1d23": "Spring came to me amidst the dying embers of Winter. A warm breeze that vaguely reminded me of oceans, budding orange as they unfurl into greens, the clean rains washing away the ashes of heartbreak. She is why the 3am phone call went unanswered. The biography of Aristotle that was finally read. The empty wine bottles that are new homes to first blossoms."}, {"020e": "She is the gentle brush of fingers that warm but don’t burn. The inspired freedom that comes from knowledge and time. Whiskey that slides smoothly down a throat with a palette nuanced enough to discern."}, {"c1ff": "She is an apology and an acceptance, an ending and a new beginning. A moment, content with the knowledge that there is no need for forever."}], "content": "Love/Time We lived and breathed fire. The intensity of first love that consumed, branding new wholes into our hearts — the organs that kept time: his heartbeat to my breaths. His name was Summer: light like a breeze and laugh like the ocean. We drew constellations in the stars and pitched tents, sang made up lyrics around a campfire and swam with dolphins. He was cool beer sipped in summer heat and menthol cigarettes. I loved him the way you love when you’re 18 and free, with a burn that scorched with every kiss and brush of fingers; his plaid shirt around my shoulders, iPod blasting white kid rap and days that blended into fireworks at sunset. We traded promises and seashells, with an intensity that inspired sonnets. Collected sand in our shoes and brought it to college. The fairytale that ended the way summer always does: too soon. I jumped into Autumn the way a child dives into orange leaves: headfirst with no consequence of pain. The warmth of Summer lingered on my skin, burnt from knowledge and memories. We whispered secrets in a fort of blankets and painted futures into our skins, swearing forever. Forever burned. Like the whiskey that slid down my throat, like the newfound freedom that college brought. I gave him the sacred parts of me and he made me a woman. Tequila shots and smoke that blazed in my throat long after our goodbyes were said. I inhaled his forever, but it didn’t make him stay. Winter brought a blistering heat that belied his name. The smell of his down jacket as the frigid wind blew us together forever imprinted in my chest. The blazing fire in his apartment, empty wine bottles and a discarded copy of Aristotle on his rug: playing at grown up and house that gave new reasons to let go of the past. We debated politics and smoked on the fire escape. Snow melted down my cheeks. He was angry fucking and cold disapproval; warm apologies and make up sex. His skin was a map to a foreign city and a season that dragged on too long. My favourite regret. Spring came to me amidst the dying embers of Winter. A warm breeze that vaguely reminded me of oceans, budding orange as they unfurl into greens, the clean rains washing away the ashes of heartbreak. She is why the 3am phone call went unanswered. The biography of Aristotle that was finally read. The empty wine bottles that are new homes to first blossoms. She is the gentle brush of fingers that warm but don’t burn. The inspired freedom that comes from knowledge and time. Whiskey that slides smoothly down a throat with a palette nuanced enough to discern. She is an apology and an acceptance, an ending and a new beginning. A moment, content with the knowledge that there is no need for forever. ", "name": "881", "child": "881_1\t881_2\t881_3\t881_4", "timestamp": "Apr 12"}