{"parent": "", "title": "No Longer Hiding", "author": "Sheila", "sentences": [{"4714": "No Longer Hiding"}, {"6f59": "Lift Your Head and Look."}, {"c080": "In a crowd, you are surrounded. There are dozens, hundreds, thousands of eyes and your ego tells you: All of these eyes are on you!"}, {"0c9f": "A breath is caught in your throat; your pupils dilate to take them all in. What could these eyes be thinking of you? Pretty, ugly, smart, stupid, average, rich, poor, just barely making it through this world? Looking at each one is maddening; you meet eyes with someone and you both look away. Oops. Did you catch me looking at you? What did my eyes give away? Did they tell you my fears, sorrows, hopes and dreams?"}, {"052c": "My eyes are naked; these eyelids do nothing to disguise them, only a fraction of a second is hidden away. What do I do? How do I avoid all those gazes, those judgments, those… those eyes! I cast my gaze down, first to the noses, to the mouths, the hands, until finally I am at the feet. Feet see nothing and I am protected by the gazes, the glares, the wandering eyes. Over time, the world is nothing but streets, sidewalks and feet. The sky is gone, the birds do not whistle for me, I cannot tell when rain is coming. I see the ground and feet. I know it rains because the ground is wet. I know I am surrounded because I see a multitude of feet, but they neither see nor tell me anything."}, {"19f6": "I am hiding. I cannot see you therefore you cannot see me. I am hiding. I am ashamed of my fears, sorrows, hopes and dreams and I do not want to see yours. My head is down in shame, the bones in my neck settled from years of hiding. This is my new curve now, to make up for the one I lost to bars and screws on my spine. I look at my feet to avoid my own glance: my mind’s eye. But now that I have learned to meet my own gaze, all other eyes in the crowd belong to me and I can’t look away. Judgements, fears, sorrows, hopes and dreams melt in the ether."}, {"f9d1": "Suddenly I am just me and you are just you and neither of us have anything to be ashamed about."}], "content": "No Longer Hiding Lift Your Head and Look. In a crowd, you are surrounded. There are dozens, hundreds, thousands of eyes and your ego tells you: All of these eyes are on you! A breath is caught in your throat; your pupils dilate to take them all in. What could these eyes be thinking of you? Pretty, ugly, smart, stupid, average, rich, poor, just barely making it through this world? Looking at each one is maddening; you meet eyes with someone and you both look away. Oops. Did you catch me looking at you? What did my eyes give away? Did they tell you my fears, sorrows, hopes and dreams? My eyes are naked; these eyelids do nothing to disguise them, only a fraction of a second is hidden away. What do I do? How do I avoid all those gazes, those judgments, those… those eyes! I cast my gaze down, first to the noses, to the mouths, the hands, until finally I am at the feet. Feet see nothing and I am protected by the gazes, the glares, the wandering eyes. Over time, the world is nothing but streets, sidewalks and feet. The sky is gone, the birds do not whistle for me, I cannot tell when rain is coming. I see the ground and feet. I know it rains because the ground is wet. I know I am surrounded because I see a multitude of feet, but they neither see nor tell me anything. I am hiding. I cannot see you therefore you cannot see me. I am hiding. I am ashamed of my fears, sorrows, hopes and dreams and I do not want to see yours. My head is down in shame, the bones in my neck settled from years of hiding. This is my new curve now, to make up for the one I lost to bars and screws on my spine. I look at my feet to avoid my own glance: my mind’s eye. But now that I have learned to meet my own gaze, all other eyes in the crowd belong to me and I can’t look away. Judgements, fears, sorrows, hopes and dreams melt in the ether. Suddenly I am just me and you are just you and neither of us have anything to be ashamed about. ", "name": "890", "child": "890_1\t890_2", "timestamp": "Dec 21, 2016"}