{"parent": "", "title": "I wish I could have known.", "author": "TeriJo", "sentences": [{"9e44": "I wish I could have known."}, {"b00d": "I wish I could have understood."}, {"913f": "Courtesy of Pixabay."}, {"4a60": "The common request to know where you would go back to... How old would you be if you could do it again?"}, {"1126": "My age pick is 45."}, {"8433": "Why so old? Is the frequent response… Because they don’t understand…"}, {"9273": "If I could go back to that 8-year-old, and tell her to scream… Not just tell the next day about the man in her room, who watched her lying in her bed. Not just make it seem like a dream, with no real meaning, no real significance?"}, {"f1ea": "I would."}, {"9771": "But, it wouldn’t change the fact, as far as my parents were concerned. It was a dream. He didn’t enter my room… He didn’t pull back the covers while my sister slept. He didn’t touch me in places no one should touch without permission. He didn’t steal my trust in what “should” be and rob me of my ability to look for good in strangers. He was just a dream."}, {"5031": "Dismissed. Gone."}, {"a5c2": "They don’t understand that…"}, {"59e5": "If I could go back to that 12-year-old, with her father’s best friend leering at her newly grown breasts… too big, too much… and yet ugly too with their stretch marks and their consistency just like the consistency of fat that Mom so hates… What’s so good about them? But, he wants to see them and steals a kiss from me because it’s “funny” how much I look like I woman, but I’m not. I’m just a girl. Nothing special."}, {"9090": "I’d tell her he’s wrong. He’s scum."}, {"b8d0": "I’d tell her to run and tell everyone at the party what he’s done. And then let him explain away the torn collar of my shirt. And my bruised face with the beard rash and the bite marks. And my tear stained cheeks. I’d tell her to let HIM, the ADULT deal with the consequences of his drunken actions."}, {"0b5d": "I would tell her not to run to her room and wash it all away, and explain the aftermath the next day as a run in with the carpet after a fall…"}, {"36e8": "I’d tell the 14-year-old me that getting in that car was a really bad idea. That your gut is talking to you for a REASON."}, {"17f1": "LISTEN TO YOUR GUT. 14-year-old me! Listen!"}, {"5e44": "I’d tell the 18-year-old me not to let it pass that a stranger had to find out if my 36DDD breasts were actually real, or implants by grabbing one, twisting and falling to the fall in the worst pratfall in history. Twice. To not tell the bouncer to simply throw him out. To let the bouncer, my friend, go ahead and teach him that lesson that he needed to learn. Because chances are good that he did it again."}, {"7e10": "I’d tell the 19-year-old me to never, ever let anyone give you something to smoke that hasn’t come from a package you watched him open that was made by one of the largest corporations in the world because if you do, it might be laced with something that makes you so sick, you’re vomiting on the ground while he’s trying to undo your bra and pants to see how far he can get before you vomit on his lap and he gives up in disgust because he can rape a woman who’s too high to say no but he can’t deal if she’s just getting sick in his lap because of his actions."}, {"cd98": "I’d tell the 23-year-old me that when he breaks every SINGLE piece of plastic anything in the house from your electric piano to the remote for the TV into tiny bits of gravel… that he’s likely to use that against you next and you need to get a plan and get the FUCK outta there. I’d tell her to NOT walk back in that door, even though, or maybe because Mom said you should… and you certainly shouldn’t engage him in conversation as your feet crunch the plastic all over the floor because the wall hurts when you hit it."}, {"8764": "I’d tell the 25-year-old me that being invited to live with someone, in a house that they own, does not usually involve sleeping on the floor in the den for 6 months or more. They don’t usually need to hear that a bedroom is required or you’re leaving before they actually acquiesce and grant that private space. And they most certainly don’t say things like “Go do your thing. I’ll be here when you’re done.” Because their life has already been lived. And they don’t care to share yours."}, {"c225": "I’d tell the 28-year-old me that waiting for someone to make up their mind isn’t worth the energy. That you’re worth soooo much more than they are willing to give."}, {"ead2": "But, I don’t think you’d hear me."}, {"7565": "I’d tell the 32-year-old me that finding that escape finally, even if it’s to a different prison, is the right thing to do. At least this prison has purpose. Meaning. An end to a life should not go unwitnessed. A matriarch, no matter how twisted, should be given the respect of an end with a witness."}, {"5515": "At least you would hear part of that."}, {"37fe": "I’d tell the 34-year-old me that you can do this. You needn’t go back to that prison. You can handle being single with a baby. You can handle child care, 60-hour work weeks to make ends meet, and create a healthy happy human."}, {"8ac1": "I know. That one is complete and utter bullshit. That was one decision I did right. For her."}, {"423c": "I’d tell the 38-year-old me that it wasn’t the end of the world that my 22-year career was over. Because I had a 3-year-old, and I couldn’t do the 60-hour weeks anymore. Because I’d rather spend my time making cookies with her, than on a 3-hour conference call that no one heard my voice on anyway. Because some sick fuck in a delusional religious fog thought taking out the World Trade Center and 3,000 lives would be a way to end his country’s problems."}, {"8707": "So? Why bother? I could and would start over. I’d tell my 38-year-old self that it would be okay. And as my 38-year-old self reassured my baby that Mommy was only crying for silly things, and she gave me the best hug in the world, I’d tell my 38-year-old self, it’s okay."}, {"d7aa": "You got this. You always do."}, {"ffa7": "I’d tell the 43-year-old me that losing your $125K a year business isn’t the end of the world. There’ll be another chance. Just gotta build it again. And that you can do it."}, {"2bba": "I’d tell the 46-year-old me that it wasn’t your fault he lied. It wasn’t on you that you were so tired. So done. So needing someone to hold your head."}, {"aed7": "That you believed his lies."}, {"808f": "That it’s not on you that it’s easier to use than it is to protect. That it’s easier to take advantage of a weakness than it is to recognize it, and nurture it ‘til it’s a strength. That you are the one to be taken and used and lied to. It’s on THEM."}, {"23d9": "I’d tell the 47-year-old me that you are not to blame. That you trusted someone you know, not to hurt you, doesn’t mean it’s your fault because your trust was misplaced."}, {"7b77": "I’d tell the 52-year-old me that the fact that another one found you is simply a symptom of their disease."}, {"5c95": "And I’d tell her Congratulations for finally seeing it before he could do any more damage."}, {"add7": "Before he crossed too much of the wall…"}, {"86ba": "Gloria DiFulvio Thank you for the inspiration…"}], "content": "I wish I could have known. I wish I could have understood. Courtesy of Pixabay. The common request to know where you would go back to... How old would you be if you could do it again? My age pick is 45. Why so old? Is the frequent response… Because they don’t understand… If I could go back to that 8-year-old, and tell her to scream… Not just tell the next day about the man in her room, who watched her lying in her bed. Not just make it seem like a dream, with no real meaning, no real significance? I would. But, it wouldn’t change the fact, as far as my parents were concerned. It was a dream. He didn’t enter my room… He didn’t pull back the covers while my sister slept. He didn’t touch me in places no one should touch without permission. He didn’t steal my trust in what “should” be and rob me of my ability to look for good in strangers. He was just a dream. Dismissed. Gone. They don’t understand that… If I could go back to that 12-year-old, with her father’s best friend leering at her newly grown breasts… too big, too much… and yet ugly too with their stretch marks and their consistency just like the consistency of fat that Mom so hates… What’s so good about them? But, he wants to see them and steals a kiss from me because it’s “funny” how much I look like I woman, but I’m not. I’m just a girl. Nothing special. I’d tell her he’s wrong. He’s scum. I’d tell her to run and tell everyone at the party what he’s done. And then let him explain away the torn collar of my shirt. And my bruised face with the beard rash and the bite marks. And my tear stained cheeks. I’d tell her to let HIM, the ADULT deal with the consequences of his drunken actions. I would tell her not to run to her room and wash it all away, and explain the aftermath the next day as a run in with the carpet after a fall… I’d tell the 14-year-old me that getting in that car was a really bad idea. That your gut is talking to you for a REASON. LISTEN TO YOUR GUT. 14-year-old me! Listen! I’d tell the 18-year-old me not to let it pass that a stranger had to find out if my 36DDD breasts were actually real, or implants by grabbing one, twisting and falling to the fall in the worst pratfall in history. Twice. To not tell the bouncer to simply throw him out. To let the bouncer, my friend, go ahead and teach him that lesson that he needed to learn. Because chances are good that he did it again. I’d tell the 19-year-old me to never, ever let anyone give you something to smoke that hasn’t come from a package you watched him open that was made by one of the largest corporations in the world because if you do, it might be laced with something that makes you so sick, you’re vomiting on the ground while he’s trying to undo your bra and pants to see how far he can get before you vomit on his lap and he gives up in disgust because he can rape a woman who’s too high to say no but he can’t deal if she’s just getting sick in his lap because of his actions. I’d tell the 23-year-old me that when he breaks every SINGLE piece of plastic anything in the house from your electric piano to the remote for the TV into tiny bits of gravel… that he’s likely to use that against you next and you need to get a plan and get the FUCK outta there. I’d tell her to NOT walk back in that door, even though, or maybe because Mom said you should… and you certainly shouldn’t engage him in conversation as your feet crunch the plastic all over the floor because the wall hurts when you hit it. I’d tell the 25-year-old me that being invited to live with someone, in a house that they own, does not usually involve sleeping on the floor in the den for 6 months or more. They don’t usually need to hear that a bedroom is required or you’re leaving before they actually acquiesce and grant that private space. And they most certainly don’t say things like “Go do your thing. I’ll be here when you’re done.” Because their life has already been lived. And they don’t care to share yours. I’d tell the 28-year-old me that waiting for someone to make up their mind isn’t worth the energy. That you’re worth soooo much more than they are willing to give. But, I don’t think you’d hear me. I’d tell the 32-year-old me that finding that escape finally, even if it’s to a different prison, is the right thing to do. At least this prison has purpose. Meaning. An end to a life should not go unwitnessed. A matriarch, no matter how twisted, should be given the respect of an end with a witness. At least you would hear part of that. I’d tell the 34-year-old me that you can do this. You needn’t go back to that prison. You can handle being single with a baby. You can handle child care, 60-hour work weeks to make ends meet, and create a healthy happy human. I know. That one is complete and utter bullshit. That was one decision I did right. For her. I’d tell the 38-year-old me that it wasn’t the end of the world that my 22-year career was over. Because I had a 3-year-old, and I couldn’t do the 60-hour weeks anymore. Because I’d rather spend my time making cookies with her, than on a 3-hour conference call that no one heard my voice on anyway. Because some sick fuck in a delusional religious fog thought taking out the World Trade Center and 3,000 lives would be a way to end his country’s problems. So? Why bother? I could and would start over. I’d tell my 38-year-old self that it would be okay. And as my 38-year-old self reassured my baby that Mommy was only crying for silly things, and she gave me the best hug in the world, I’d tell my 38-year-old self, it’s okay. You got this. You always do. I’d tell the 43-year-old me that losing your $125K a year business isn’t the end of the world. There’ll be another chance. Just gotta build it again. And that you can do it. I’d tell the 46-year-old me that it wasn’t your fault he lied. It wasn’t on you that you were so tired. So done. So needing someone to hold your head. That you believed his lies. That it’s not on you that it’s easier to use than it is to protect. That it’s easier to take advantage of a weakness than it is to recognize it, and nurture it ‘til it’s a strength. That you are the one to be taken and used and lied to. It’s on THEM. I’d tell the 47-year-old me that you are not to blame. That you trusted someone you know, not to hurt you, doesn’t mean it’s your fault because your trust was misplaced. I’d tell the 52-year-old me that the fact that another one found you is simply a symptom of their disease. And I’d tell her Congratulations for finally seeing it before he could do any more damage. Before he crossed too much of the wall… Gloria DiFulvio Thank you for the inspiration… ", "name": "892", "child": "892_1\t892_2\t892_3\t892_4892_1\t892_2\t892_3\t892_4", "timestamp": "Oct 22, 2016"}