{"parent": "", "title": "Those Words Again", "author": "marialar", "sentences": [{"098a": "Those Words Again"}, {"c9ec": "a prose poem"}, {"c179": "Image courtesy of Unsplash"}, {"9659": "Sometimes we spend what feels like years waiting for the words, though it has hardly been two hours. Having bundled up our feelings inside our stomachs like a ball of wet, rotting rags, we sigh when they finally say, “Are you okay? Tell me what’s wrong.” Slowly, the ball unravels. Those words again. Upon hearing them we spill our secrets, our worries, our doubts for them — our tragedies too. Like water, they all spill out onto our feet and wash across the pavement, and that person, the one who saves us every time, listens. They advise and comfort, sometimes they take action against our demons. As waves crash down around us, they toss a raft and in rough waters they throw down an anchor. In return they ask for nothing, they request no saving. While we may waiver, they never do. Strong and steady, wise beyond words, where would we be without them? Who would we be without them? Yet we often forget that sometimes the person who saves us will also need to be saved. Preoccupied with our own trials, do we ever stop to consider theirs? How often do we repeat back to them the words they so faithfully and selflessly ask us? “How about you? Are you okay?” While we are busy piecing our world back together like a puzzle in the dark, that person, our person, may be falling apart — a silent sufferer in a crazy kaleidoscope of a world where tumultuous troubles collide all around them. No matter how dim the world becomes for us, we must stop to consider the fact that we are all human. We all hurt. Do not hurt others simply because you are hurting. Spread the kindness you receive."}, {"5e39": "marialar for Poetry in Form."}], "content": "Those Words Again a prose poem Image courtesy of Unsplash Sometimes we spend what feels like years waiting for the words, though it has hardly been two hours. Having bundled up our feelings inside our stomachs like a ball of wet, rotting rags, we sigh when they finally say, “Are you okay? Tell me what’s wrong.” Slowly, the ball unravels. Those words again. Upon hearing them we spill our secrets, our worries, our doubts for them — our tragedies too. Like water, they all spill out onto our feet and wash across the pavement, and that person, the one who saves us every time, listens. They advise and comfort, sometimes they take action against our demons. As waves crash down around us, they toss a raft and in rough waters they throw down an anchor. In return they ask for nothing, they request no saving. While we may waiver, they never do. Strong and steady, wise beyond words, where would we be without them? Who would we be without them? Yet we often forget that sometimes the person who saves us will also need to be saved. Preoccupied with our own trials, do we ever stop to consider theirs? How often do we repeat back to them the words they so faithfully and selflessly ask us? “How about you? Are you okay?” While we are busy piecing our world back together like a puzzle in the dark, that person, our person, may be falling apart — a silent sufferer in a crazy kaleidoscope of a world where tumultuous troubles collide all around them. No matter how dim the world becomes for us, we must stop to consider the fact that we are all human. We all hurt. Do not hurt others simply because you are hurting. Spread the kindness you receive. marialar for Poetry in Form. ", "name": "895", "child": "895_1895_1", "timestamp": "Mar 2"}