{"parent": "", "title": "The MVP is James Harden", "author": "Berny Belvedere", "sentences": [{"8412": "The MVP is James Harden"}, {"1c4c": "You know it in your heart to be true"}, {"b530": "Today, in The Federalist, I make the definitive case for James Harden being MVP of the 2016–2017 NBA season. Go here for the full argument:"}, {"9896": "James Harden Should Be This Year's MVP, Not Russell WestbrookJames Harden, not Russell Westbrook, should be this year's most valuable player. You might wonder: How could anyone…thefederalist.com"}, {"960a": "What follows is an abridged version of my case for Harden."}, {"accf": "The first question to address is: How could anyone possibly give it to Harden over Westbrook?"}, {"19d2": "How could anyone possibly deny the player whose stat line is the greatest in the modern NBA era? How could anyone possibly deny the player whose only statistical match, when measuring the top three categories — points, rebounds, and assists — is Oscar Robertson, the man who averaged a triple-double across an entire season? How could anyone possibly deny the player who has single-handedly guided a mediocre team through the raging, broiling Western Conference crucible and into the playoffs?"}, {"e879": "There is no denying that Westbrook has had a breathtakingly special season. Here’s the problem: all of the above is true of Harden as well."}, {"ad29": "Lost in the Westbrook mania is the fact that the Bearded One is matching him stat for stat, all while shooting fewer shots, requiring fewer overall possessions, and securing a far more impressive win total for his team."}, {"ef79": "This last point is really important."}, {"3844": "Harden’s Houston Rockets have a higher winning percentage than every single team in the Eastern Conference, including LeBron’s Cleveland Cavaliers and the conference-leading Boston Celtics. The Rockets have the third best record in the league, behind only the San Antonio Spurs, whose undying excellence is Patriots-esque, and the Golden State Warriors, who during the All-Star Game had four players on the court at one time and who just last year broke the single-season record for most wins all time."}, {"0146": "The Spurs have Kawhi Leonard, LaMarcus Aldridge, and the irascible genius Gregg Popovich. The Warriors have Steph Curry, who has won the MVP the last two years, Kevin Durant, Klay Thompson, and Draymond Green."}, {"8295": "The Rockets have…James Harden."}, {"3094": "And yet the Rockets have just two more losses than the Cavs did last year. Why is that significant? The Cavs finished first place in the East last year, and they went on to win the NBA title. Who do the Cavs have? LeBron, obviously and most prominently, but also All-Stars Kyrie Irving and Kevin Love."}, {"1397": "At the start of the season, Vegas gave the Rockets the same odds to win the NBA title that they gave the Minnesota Timberwolves and the New Orleans Pelicans. These are two teams who have fallen far short of even making the postseason, and despite sharing multiple stars between them, fell more than twenty wins shy of matching the Rockets’ win total."}, {"e97c": "I’m not arguing that Vegas dramatically undervalued the Rockets; on the contrary, Vegas — and basketball pundits more generally — appraised them more or less accurately. That’s what’s so earth-shattering about Harden’s season. He’s taken an average team — their other best players are Eric Gordon, Lou Williams, Trevor Ariza, Patrick Beverley, and Clint Capela — and elevated them to inconceivably lofty heights, record-wise."}, {"67e5": "What’s likelier, that every single one of these players is having a career year? Or that Harden’s offensive genius is significantly contributing to their stellar play?"}, {"8bc7": "Meanwhile, the Thunder will go into the postseason as the West’s 6th seed, which is in the bottom half of the conference. They’ve got the 10th best record in the league overall, and are 16th in offensive efficiency, and 11th in defensive efficiency."}, {"7dea": "This alone would make Westbrook an unprecedented selection. Let’s take a look at the last three decades of MVP winners."}, {"1fba": "One of the biggest obstacles to seeing Westbrook as this year’s Most Valuable Player is that winning is a significant criterion for earning this award."}, {"e46b": "The award is often wrongly construed as an individual accolade — the word “player” is in the singular, of course. The problem is that the word “value” is also there, and MVP voting has included team success into its calculus precisely because winning is seen as one of the highest functions of value. As an award that ostensibly measures value, the quite reasonable assumption built into the history of NBA MVP voting is that value ought to be partially defined by team success. Otherwise what good are all the individual stats doing? What value is being generated by the stats padding?"}, {"78ef": "Prior to the season, NBA.com’s David Aldridge suggested that if Harden could register 26 points per game and 9 assists per game on a team that makes the playoffs, this should generate “strong MVP consideration.” Harden has spectacularly exceeded each one of these metrics. He is getting basically 30 per game, leading the league in assists at over 11 per game, and his team has the third best record in the entire league."}, {"7cab": "The only reason he is not the runaway MVP is because Russell Westbrook is averaging a triple-double for the season. I won’t argue that the triple-double is arbitrary, but a strong case can be made for seeing it as somewhat misleading."}, {"e15d": "One of these two players is averaging a triple-double and the other is not. Upon first glance, this can suggest that Westbrook’s season is a dazzling, history-defying spectacle, whereas Harden’s season is condemned to the milder, more mundane sort of excellence no one writes any paeans about."}, {"e4a2": "But it only seems this way when we use this binary category — the triple-double — as our main evaluative grid. When we look purely at the numbers, here’s the reality: Harden is getting two fewer rebounds per game, but one more assist per game. Is that really the sort of discrepancy that warrants seeing one of the two as having achieved something historic while the other must settle for coming across as a garden variety MVP candidate?"}, {"8d54": "If the triple-double is clouding our judgment, we need the purifying work of statistics to disabuse us of this error. The Rockets, led by General Manager Daryl Morey, are perhaps the NBA team most attuned to advanced analytics for guiding franchise decision-making. Here are some aspects to Harden’s game they would like NBA viewers to consider:"}, {"57b9": "Most importantly, Harden’s spellbinding statistics have been in the service of team success. Harden leads the league in total touches per game, and in what is perhaps the most significant statistic of them all, Harden is number 1 in the league in win shares, which estimates how many wins an individual player has contributed to his team. Westbrook is 5th."}, {"285e": "The case for Harden over Westbrook is that Harden is basically putting up the same numbers Westbrook is, yet doing so in a way that generates far more team success."}, {"86d4": "But all of the above is basically just fluff. Here’s the real clincher for Harden: Skip Bayless has given the MVP nod to Russell Westbrook. If there’s ever a consideration that works against a player who is ostensibly being praised, this has to be it. Case closed."}, {"85d3": "Congratulations, Harden!"}, {"8a7a": "The full version of this post can be found at The Federalist:"}, {"190e": "James Harden Should Be This Year's MVP, Not Russell WestbrookJames Harden, not Russell Westbrook, should be this year's most valuable player. You might wonder: How could anyone…thefederalist.com"}], "content": "The MVP is James Harden You know it in your heart to be true Today, in The Federalist, I make the definitive case for James Harden being MVP of the 2016–2017 NBA season. Go here for the full argument: James Harden Should Be This Year's MVP, Not Russell WestbrookJames Harden, not Russell Westbrook, should be this year's most valuable player. You might wonder: How could anyone…thefederalist.com What follows is an abridged version of my case for Harden. The first question to address is: How could anyone possibly give it to Harden over Westbrook? How could anyone possibly deny the player whose stat line is the greatest in the modern NBA era? How could anyone possibly deny the player whose only statistical match, when measuring the top three categories — points, rebounds, and assists — is Oscar Robertson, the man who averaged a triple-double across an entire season? How could anyone possibly deny the player who has single-handedly guided a mediocre team through the raging, broiling Western Conference crucible and into the playoffs? There is no denying that Westbrook has had a breathtakingly special season. Here’s the problem: all of the above is true of Harden as well. Lost in the Westbrook mania is the fact that the Bearded One is matching him stat for stat, all while shooting fewer shots, requiring fewer overall possessions, and securing a far more impressive win total for his team. This last point is really important. Harden’s Houston Rockets have a higher winning percentage than every single team in the Eastern Conference, including LeBron’s Cleveland Cavaliers and the conference-leading Boston Celtics. The Rockets have the third best record in the league, behind only the San Antonio Spurs, whose undying excellence is Patriots-esque, and the Golden State Warriors, who during the All-Star Game had four players on the court at one time and who just last year broke the single-season record for most wins all time. The Spurs have Kawhi Leonard, LaMarcus Aldridge, and the irascible genius Gregg Popovich. The Warriors have Steph Curry, who has won the MVP the last two years, Kevin Durant, Klay Thompson, and Draymond Green. The Rockets have…James Harden. And yet the Rockets have just two more losses than the Cavs did last year. Why is that significant? The Cavs finished first place in the East last year, and they went on to win the NBA title. Who do the Cavs have? LeBron, obviously and most prominently, but also All-Stars Kyrie Irving and Kevin Love. At the start of the season, Vegas gave the Rockets the same odds to win the NBA title that they gave the Minnesota Timberwolves and the New Orleans Pelicans. These are two teams who have fallen far short of even making the postseason, and despite sharing multiple stars between them, fell more than twenty wins shy of matching the Rockets’ win total. I’m not arguing that Vegas dramatically undervalued the Rockets; on the contrary, Vegas — and basketball pundits more generally — appraised them more or less accurately. That’s what’s so earth-shattering about Harden’s season. He’s taken an average team — their other best players are Eric Gordon, Lou Williams, Trevor Ariza, Patrick Beverley, and Clint Capela — and elevated them to inconceivably lofty heights, record-wise. What’s likelier, that every single one of these players is having a career year? Or that Harden’s offensive genius is significantly contributing to their stellar play? Meanwhile, the Thunder will go into the postseason as the West’s 6th seed, which is in the bottom half of the conference. They’ve got the 10th best record in the league overall, and are 16th in offensive efficiency, and 11th in defensive efficiency. This alone would make Westbrook an unprecedented selection. Let’s take a look at the last three decades of MVP winners. One of the biggest obstacles to seeing Westbrook as this year’s Most Valuable Player is that winning is a significant criterion for earning this award. The award is often wrongly construed as an individual accolade — the word “player” is in the singular, of course. The problem is that the word “value” is also there, and MVP voting has included team success into its calculus precisely because winning is seen as one of the highest functions of value. As an award that ostensibly measures value, the quite reasonable assumption built into the history of NBA MVP voting is that value ought to be partially defined by team success. Otherwise what good are all the individual stats doing? What value is being generated by the stats padding? Prior to the season, NBA.com’s David Aldridge suggested that if Harden could register 26 points per game and 9 assists per game on a team that makes the playoffs, this should generate “strong MVP consideration.” Harden has spectacularly exceeded each one of these metrics. He is getting basically 30 per game, leading the league in assists at over 11 per game, and his team has the third best record in the entire league. The only reason he is not the runaway MVP is because Russell Westbrook is averaging a triple-double for the season. I won’t argue that the triple-double is arbitrary, but a strong case can be made for seeing it as somewhat misleading. One of these two players is averaging a triple-double and the other is not. Upon first glance, this can suggest that Westbrook’s season is a dazzling, history-defying spectacle, whereas Harden’s season is condemned to the milder, more mundane sort of excellence no one writes any paeans about. But it only seems this way when we use this binary category — the triple-double — as our main evaluative grid. When we look purely at the numbers, here’s the reality: Harden is getting two fewer rebounds per game, but one more assist per game. Is that really the sort of discrepancy that warrants seeing one of the two as having achieved something historic while the other must settle for coming across as a garden variety MVP candidate? If the triple-double is clouding our judgment, we need the purifying work of statistics to disabuse us of this error. The Rockets, led by General Manager Daryl Morey, are perhaps the NBA team most attuned to advanced analytics for guiding franchise decision-making. Here are some aspects to Harden’s game they would like NBA viewers to consider: Most importantly, Harden’s spellbinding statistics have been in the service of team success. Harden leads the league in total touches per game, and in what is perhaps the most significant statistic of them all, Harden is number 1 in the league in win shares, which estimates how many wins an individual player has contributed to his team. Westbrook is 5th. The case for Harden over Westbrook is that Harden is basically putting up the same numbers Westbrook is, yet doing so in a way that generates far more team success. But all of the above is basically just fluff. Here’s the real clincher for Harden: Skip Bayless has given the MVP nod to Russell Westbrook. If there’s ever a consideration that works against a player who is ostensibly being praised, this has to be it. Case closed. Congratulations, Harden! The full version of this post can be found at The Federalist: James Harden Should Be This Year's MVP, Not Russell WestbrookJames Harden, not Russell Westbrook, should be this year's most valuable player. You might wonder: How could anyone…thefederalist.com ", "name": "90", "child": "90_1\t90_2\t90_3", "timestamp": "Apr 12"}