{"parent": "", "title": "The Gaggle — Women Holding Women Up", "author": "Dianna Somerville", "sentences": [{"9222": "The Gaggle — Women Holding Women Up"}, {"1604": "Tonight I called in a favour. A chat with an old school friend in Melbourne who has been successfully flying the entrepreneur’s banner for ten years. It made me reflect on how lifelong friends hold your deepest truths, fears and strengths and know you sometimes better than anyone else in your life."}, {"5da0": "For whatever reason I stumbled upon an amazing group of friends in late high school. Almost twenty years on we remain close, talking daily on What’s App. From sore breast feeding boobs, to holiday organisation and business success we share it all. Our own private sanctuary where we can reach out, knowing that the gaggle will be there. And whatever you put out you are returned threefold with laughter, tears and encouragement."}, {"9862": "I could never explain how or why I was so blessed to have such long term great friends. It is sad though, as every other group of women is held up to this light and, unfortunately, dismally fails. From high school to now, there has never been an ounce of jealousy. All that exists is praise and celebration in everyone’s achievements and a warm deep down sentimental happiness that comes from being associated with such and amazing, strong and highly successful group of women. Oh and one other thing… this was public high school regional NSW, not Loreto or PLC."}, {"7da6": "Floating around other groups of women, I can truly say that the most uplifting and inspiring feeling is being in a gaggle of girls that have nothing but true admiration for each other… that is true girl power… that is a match to spark the fire, a pillow to rest your weary head, a safe haven to break down and above all an endless place of happiness. Long live the gaggle and long live women who treat each other with respect, no matter where they come from or what their title is."}, {"3475": "www.rgtcgroup.com.au"}], "content": "The Gaggle — Women Holding Women Up Tonight I called in a favour. A chat with an old school friend in Melbourne who has been successfully flying the entrepreneur’s banner for ten years. It made me reflect on how lifelong friends hold your deepest truths, fears and strengths and know you sometimes better than anyone else in your life. For whatever reason I stumbled upon an amazing group of friends in late high school. Almost twenty years on we remain close, talking daily on What’s App. From sore breast feeding boobs, to holiday organisation and business success we share it all. Our own private sanctuary where we can reach out, knowing that the gaggle will be there. And whatever you put out you are returned threefold with laughter, tears and encouragement. I could never explain how or why I was so blessed to have such long term great friends. It is sad though, as every other group of women is held up to this light and, unfortunately, dismally fails. From high school to now, there has never been an ounce of jealousy. All that exists is praise and celebration in everyone’s achievements and a warm deep down sentimental happiness that comes from being associated with such and amazing, strong and highly successful group of women. Oh and one other thing… this was public high school regional NSW, not Loreto or PLC. Floating around other groups of women, I can truly say that the most uplifting and inspiring feeling is being in a gaggle of girls that have nothing but true admiration for each other… that is true girl power… that is a match to spark the fire, a pillow to rest your weary head, a safe haven to break down and above all an endless place of happiness. Long live the gaggle and long live women who treat each other with respect, no matter where they come from or what their title is. www.rgtcgroup.com.au ", "name": "901", "child": "901_1", "timestamp": "Aug 17, 2015"}