{"parent": "", "title": "One Behavior Separates The Successful From The Average", "author": "Benjamin P. Hardy", "sentences": [{"9685": "One Behavior Separates The Successful From The Average"}, {"2fd3": "A certain farmer had become old and ready to pass his farm down to one of his two sons. When he brought his sons together to speak about it, he told them: The farm will go to the younger son."}, {"32c5": "The older son was furious! “What are you talking about?!” he fumed."}, {"8b69": "The father sat patiently, thinking."}, {"49ab": "“Okay,” the father said, “I need you to do something for me. We need more stocks. Will you go to Cibi’s farm and see if he has any cows for sale?”"}, {"032a": "The older son shortly returned and reported, “Father, Cibi has 6 cows for sale.”"}, {"09e3": "The father graciously thanked the older son for his work. He then turned to the younger son and said, “I need you to do something for me. We need more stocks. Will you go to Cibi’s farm and see if he has any cows for sale?”"}, {"5070": "The younger son did as he was asked. A short while later, he returned and reported, “Father, Cibi has 6 cows for sale. Each cow will cost 2,000 rupees. If we are thinking about buying more than 6 cows, Cibi said he would be willing to reduce the price 100 rupees. Cibi also said they are getting special jersey cows next week if we aren’t in a hurry, it may be good to wait. However, if we need the cows urgently, Cibi said he could deliver the cows tomorrow.”"}, {"27bb": "The father graciously thanked the younger son for his work. He then turned to the older son and said, “That’s why your younger brother is getting the farm.”"}, {"53ce": "Successful People Initiate"}, {"4b7d": "Most people only do what they are asked, doing only the minimum requirement. They need specific instructions on most things they do."}, {"1449": "Image courtesy of Pixabay"}, {"c43c": "Conversely, those who become successful are anxiously engaged in a good cause. They don’t need to be managed in all things. They don’t just do the job, they do it right and complete. They also influence the direction for how certain ideas and projects go."}, {"8e3f": "Most importantly, those who become successful initiate. They reach out to people, ask questions, make recommendations, offer to help, and pitch their ideas."}, {"b3a8": "Being successful requires being proactive and not waiting for life to come to you. It means you’re on offense, not defense. You’re active, not passive."}, {"b2a8": "In every organization, there are a select few employees who would be difficult to replace. For the most part, most people are like the older son in the story. Most people could be easily replaced. Most people are passive and reactive. They require specific instructions. They need to be governed and managed in all things."}, {"5f0b": "Initiation always involves some degree of risk. You’re putting yourself out there and there is a chance you could fail."}, {"ac79": "Conversely, doing only what you’re told entails no risk and carries no responsibility. It’s playing safe."}, {"1e79": "Conclusion"}, {"7b82": "Are you an initiator? You absolutely can be."}, {"5862": "But if not, one thing is for certain: Life isn’t going to wait for you."}, {"5a2a": "Call To Action"}, {"6da6": "If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist."}, {"6b92": "Click here to get the checklist right now!"}], "content": "One Behavior Separates The Successful From The Average A certain farmer had become old and ready to pass his farm down to one of his two sons. When he brought his sons together to speak about it, he told them: The farm will go to the younger son. The older son was furious! “What are you talking about?!” he fumed. The father sat patiently, thinking. “Okay,” the father said, “I need you to do something for me. We need more stocks. Will you go to Cibi’s farm and see if he has any cows for sale?” The older son shortly returned and reported, “Father, Cibi has 6 cows for sale.” The father graciously thanked the older son for his work. He then turned to the younger son and said, “I need you to do something for me. We need more stocks. Will you go to Cibi’s farm and see if he has any cows for sale?” The younger son did as he was asked. A short while later, he returned and reported, “Father, Cibi has 6 cows for sale. Each cow will cost 2,000 rupees. If we are thinking about buying more than 6 cows, Cibi said he would be willing to reduce the price 100 rupees. Cibi also said they are getting special jersey cows next week if we aren’t in a hurry, it may be good to wait. However, if we need the cows urgently, Cibi said he could deliver the cows tomorrow.” The father graciously thanked the younger son for his work. He then turned to the older son and said, “That’s why your younger brother is getting the farm.” Successful People Initiate Most people only do what they are asked, doing only the minimum requirement. They need specific instructions on most things they do. Image courtesy of Pixabay Conversely, those who become successful are anxiously engaged in a good cause. They don’t need to be managed in all things. They don’t just do the job, they do it right and complete. They also influence the direction for how certain ideas and projects go. Most importantly, those who become successful initiate. They reach out to people, ask questions, make recommendations, offer to help, and pitch their ideas. Being successful requires being proactive and not waiting for life to come to you. It means you’re on offense, not defense. You’re active, not passive. In every organization, there are a select few employees who would be difficult to replace. For the most part, most people are like the older son in the story. Most people could be easily replaced. Most people are passive and reactive. They require specific instructions. They need to be governed and managed in all things. Initiation always involves some degree of risk. You’re putting yourself out there and there is a chance you could fail. Conversely, doing only what you’re told entails no risk and carries no responsibility. It’s playing safe. Conclusion Are you an initiator? You absolutely can be. But if not, one thing is for certain: Life isn’t going to wait for you. Call To Action If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist. Click here to get the checklist right now! ", "name": "906", "child": "906_1\t906_2\t906_3\t906_4\t906_5\t906_6\t906_7\t906_8\t906_9\t906_10\t906_11\t906_12\t906_13\t906_14\t906_15\t906_16\t906_17\t906_18\t906_19\t906_20\t906_21\t906_22\t906_23\t906_24\t906_25", "timestamp": "Apr 3"}