{"parent": "", "title": "How to Make Immediate Behavior Changes", "author": "Benjamin P. Hardy", "sentences": [{"3744": "How to Make Immediate Behavior Changes"}, {"37ec": "Most self-improvement “strategies” and even psychological interventions seek incremental progress."}, {"4f71": "“Be just a little bit better”. . ."}, {"5b1a": "And although this approach, especially over a long period of time, will yield results, there are better approaches to change."}, {"a538": "Actually, from a systems perspective, you can’t change a part without simultaneously changing the whole. If you don’t change the system as a whole, you won’t be able to break unhealthy behavioral cycles."}, {"f5d7": "Without fostering an environment that facilitates and supports your desired changes, you’ll constantly be in conflict with your environment. You’ll be required to exert high doses of willpower, which, as has been overly-stressed, is a limited resource. Strain your willpower, even for a short period of time, and you’ll find yourself impulsively engaging in goal-conflicting absurdity."}, {"df1f": "Is there really another way to improve yourself?"}, {"29f3": "Of course there is. And you’ve experienced it. Perhaps not consciously. But any permanent change you made was actually done in an instant."}, {"4e21": "At one point or another, you crossed a point at which you haven’t retracted. A point when you decided enough was enough. That may have been “rock-bottom” — or the moment the consequences of your actions became real to you."}, {"b232": "Therein lies the secret to immediate behavioral change: understanding and feeling the weight of the consequences of your behavior. Having your eye’s opened to what you didn’t see before."}, {"b284": "Image the child who touches the hot stove. Consequences are brought to full-attention. Thus, immediate behavior change."}, {"9969": "The challenge with most of our behaviors is that we don’t immediately feel the weight of the consequences. Sometimes it takes years to fully experience the consequences, even if our choices have been negatively impacting ourselves and others all along."}, {"1bf3": "If you got fat the instant you ate ice-cream, you probably wouldn’t eat it."}, {"9f02": "If you got lung cancer the moment you smoked a cigarette, you probably wouldn’t smoke it."}, {"5bfb": "If your dreams were shattered the moment you scrolled your Facebook news feed, you probably wouldn’t chill on Facebook so much."}, {"200f": "If your marriage ended the moment you entertained terrible thoughts about your spouse, you’d probably figure out how to transform your thinking."}, {"cbba": "Said Dr. Stephen R. Covey, “We control our actions, but the consequences that flow from those actions are controlled by principles.”"}, {"032d": "Wisdom then, is an understanding and application of principles. When you understand principles and follow your intuition, you can recognize the consequences of certain things without having to experience them first-hand. Not that first-hand experience is a bad thing. Actually, failure is simply feedback, and it is one of the primary paths to growth because consequences are felt, rather than avoided."}, {"4b0d": "Preparing for the worst in order to live at your best"}, {"d283": "Another reason people don’t make needed change is what psychologists call “normalcy bias,” where they underestimate the possibility and effects of disasters occurring. But life has a way of throwing curve balls. For example, I have a good friend who’s brother recently died in an freak accident. My friend is most devastated by what she didn’t do and the love she neglected to show to her brother."}, {"6961": "To quote Morgan Matson, American novelist, “A thousand moments that I had just taken for granted — mostly because I had assumed there would be a thousand more.” Similarly, Harriet Beecher Stowe, American abolitionist and author, has said, “The bitterest tears shed over graves are for words left unsaid and deeds left undone.”"}, {"9801": "People incorrectly assume things will be as they have always been. Thus, they don’t have an urgency to prepare for the worst. Accordingly, most people don’t have an urgency to live in the here-and-now."}, {"f759": "The costs of not truly living aren’t real enough for most people. Hence, they justify living far beneath their desires and potential. They tolerate far less than could be their’s. Sadly, most people only become aware of the opportunity cost in retrospect."}, {"8fa4": "A solid way, then, to immediately change your behavior is to deeply consider the consequences of not changing your behavior."}, {"953d": "According to psychologist Julie Norem, people engage in “defensive pessimism,” in order to consciously envision the worst case scenario. When they do this, they escalate their anxiety and convert it into motivation to live better."}, {"08dc": "Similarly, Adam Grant explained in his book Originals:"}, {"9d64": "“Once [defensive pessimists] considered the worst, they’re driven to avoid it, considering every relevant detail to make sure they don’t crash and burn, which enables them to feel a sense of control.”"}, {"663d": "Tim Ferriss uses a similar approach when considering new endeavors or important decisions — what he calls, “practical pessimism.” Involved is Ferriss visualizing all the negative things that could happen if he proceeds. Instead of defining his goals, he defines his fears — “in excruciating details, the worst case scenarios.”"}, {"5172": "The costs of your choices and behaviors need to be very real you to you. Perhaps this is the biggest difference between those truly living and those just getting by. The consequences (or potential consequences) of not living to their highest potential is more painful than whatever is involved."}, {"1e17": "The costs of not being present with your loved ones needs to be real to you."}, {"f944": "The costs of not being healthy needs to be real to you."}, {"52d1": "Not only do the costs of not changing need to be real, but a clear recognition of the effects of your current behavior on yourself and others. Without a doubt, your behavior effects other people. This becomes painfully obvious when you have children. On days I’m not on my A-Game, I can see it in my kids. They have a harder time getting to sleep at night. They are more reactive and avoidant."}, {"d7fa": "You are not only damaging your own life by not making needed changes, but you are also damaging the lives of those around you. This isn’t a joke. Taking personal responsibility is key, which is not the same as feeling guilt."}, {"a3fd": "Guilt comes from fear, and thus, doesn’t create the same feelings as acting out of love. You could perform the “right” behaviors out of guilt, but without the “right” feelings to accompany those behaviors, transformation won’t happen."}, {"97b6": "Do it because you love yourself and the people around you. This is the highest motivation."}, {"e603": "Focusing on and experiencing (even visually) the consequences of behavior is a powerful tool for creating immediate behavior change."}, {"e327": "There are other ways as well."}, {"0a13": "Change the default option"}, {"127c": "Simply by changing the default option of certain choices is an easy way to immediately change behavior. People often take the first choice given them."}, {"bf51": "For example, after deciding the university computer labs were wasting too much paper, Rutgers University simply made double-sided printing the default option on its lab printers."}, {"555d": "This small act saved 7,391,065 sheets of paper in the first semester, or roughly 620 trees for the semester, and 1,280 trees for the academic year. Students, who frequently have no preference, are now required to manually select the option of printing only one side of the page. The option to conserve is made that much easier by becoming the default option."}, {"b45e": "What are your default behavioral options?"}, {"86e9": "Most people’s default option, these days, is to distract themselves. Email. Social media. Mindless surfing."}, {"b669": "What if your default option was something else?"}, {"912e": "How could you reshape your circumstances so better options were your default?"}, {"d986": "In Greg McKeown’s book, Essentialism, he recommends removing all non-essentials from your life so doing the essentials becomes your “default position.” He also recommends giving yourself time before reactively responding “Yes” to requests. Most people have “Yes” as their default response to a request when, with even a few seconds of consideration, “No” is often the better answer."}, {"620b": "Taking on greater responsibility"}, {"59e1": "Another way to immediately change your behavior is to take on greater responsibility. It was only a month or two after becoming a foster parent that a sense of urgency filled my heart. No longer did my career decisions only affect me. I now had three kids to provide for. That responsibility compelled me to take massive action toward my goal of becoming a professional writer."}, {"1437": "Most people avoid responsibility. Yet, that may be the very thing they need to become better. Feeling needed, like others depend on you gives you a purpose for changing. It also puts your back against the wall, leaving you with no other choice but to act."}, {"63f9": "Change environment"}, {"7793": "In her book Grit, psychologist Angela Duckworth tells the story of trying to potty-train her three-year-old daughter. Duckworth and her husband spent months trying to coax and cajole their child to use the toilet, to no avail."}, {"e38f": "Shortly after her third birthday, Duckworth’s daughter advanced from one pre-school class to another. Her previous class was for toddlers, where almost all the children were still in diapers. Her new classroom with the “big kids” didn’t even have a changing table."}, {"042b": "According to Duckworth, her daughter looked nervous when first entering her new classroom. However, after that first day of class, she proudly told her mom she had used the potty and that she was “done with diapers.” Said Duckworth, “And she was. Potty training happened in a single moment in time. Why? Because when a child lines up for the potty with all the other children, and sees that she’s expected to take her turn, she does exactly that. She learns to do what she needs to do.”"}, {"c99b": "This story shows that we match our behaviors to our environmental expectations."}, {"1d57": "If you have high expectations, you’ll generally rise to those. You have have low expectations, you’ll generally fall to those. Our expectations turn into a self-fulfilling prophecy. And every environment you are in has expectations. Most people prefer environments and relationships with low expectations."}, {"5189": "People constantly growing purposefully cultivate environments that force them to show up at a higher level. They surround themselves with people who are where they want to be. They are fine feeling like impostors and being the dumbest and least “successful” person in the room."}, {"1ea5": "Conclusion"}, {"05e3": "Systemically, when you change the part, you simultaneously change the whole. Unless the whole changes, small modifications will probably not be sustained. Thus, in order to change anything, you often must change everything."}, {"b9dc": "Everything, is connected."}, {"86a9": "If your health isn’t a priority, you better believe it’s impacting all other areas of your life. If you hate your work, don’t fool yourself into thinking the rest of your life isn’t affected."}, {"a07c": "What immediate changes could you make right now? How would that change influence the rest of your life?"}, {"d89e": "Call To Action"}, {"6da6": "If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist."}, {"6b92": "Click here to get the checklist right now!"}], "content": "How to Make Immediate Behavior Changes Most self-improvement “strategies” and even psychological interventions seek incremental progress. “Be just a little bit better”. . . And although this approach, especially over a long period of time, will yield results, there are better approaches to change. Actually, from a systems perspective, you can’t change a part without simultaneously changing the whole. If you don’t change the system as a whole, you won’t be able to break unhealthy behavioral cycles. Without fostering an environment that facilitates and supports your desired changes, you’ll constantly be in conflict with your environment. You’ll be required to exert high doses of willpower, which, as has been overly-stressed, is a limited resource. Strain your willpower, even for a short period of time, and you’ll find yourself impulsively engaging in goal-conflicting absurdity. Is there really another way to improve yourself? Of course there is. And you’ve experienced it. Perhaps not consciously. But any permanent change you made was actually done in an instant. At one point or another, you crossed a point at which you haven’t retracted. A point when you decided enough was enough. That may have been “rock-bottom” — or the moment the consequences of your actions became real to you. Therein lies the secret to immediate behavioral change: understanding and feeling the weight of the consequences of your behavior. Having your eye’s opened to what you didn’t see before. Image the child who touches the hot stove. Consequences are brought to full-attention. Thus, immediate behavior change. The challenge with most of our behaviors is that we don’t immediately feel the weight of the consequences. Sometimes it takes years to fully experience the consequences, even if our choices have been negatively impacting ourselves and others all along. If you got fat the instant you ate ice-cream, you probably wouldn’t eat it. If you got lung cancer the moment you smoked a cigarette, you probably wouldn’t smoke it. If your dreams were shattered the moment you scrolled your Facebook news feed, you probably wouldn’t chill on Facebook so much. If your marriage ended the moment you entertained terrible thoughts about your spouse, you’d probably figure out how to transform your thinking. Said Dr. Stephen R. Covey, “We control our actions, but the consequences that flow from those actions are controlled by principles.” Wisdom then, is an understanding and application of principles. When you understand principles and follow your intuition, you can recognize the consequences of certain things without having to experience them first-hand. Not that first-hand experience is a bad thing. Actually, failure is simply feedback, and it is one of the primary paths to growth because consequences are felt, rather than avoided. Preparing for the worst in order to live at your best Another reason people don’t make needed change is what psychologists call “normalcy bias,” where they underestimate the possibility and effects of disasters occurring. But life has a way of throwing curve balls. For example, I have a good friend who’s brother recently died in an freak accident. My friend is most devastated by what she didn’t do and the love she neglected to show to her brother. To quote Morgan Matson, American novelist, “A thousand moments that I had just taken for granted — mostly because I had assumed there would be a thousand more.” Similarly, Harriet Beecher Stowe, American abolitionist and author, has said, “The bitterest tears shed over graves are for words left unsaid and deeds left undone.” People incorrectly assume things will be as they have always been. Thus, they don’t have an urgency to prepare for the worst. Accordingly, most people don’t have an urgency to live in the here-and-now. The costs of not truly living aren’t real enough for most people. Hence, they justify living far beneath their desires and potential. They tolerate far less than could be their’s. Sadly, most people only become aware of the opportunity cost in retrospect. A solid way, then, to immediately change your behavior is to deeply consider the consequences of not changing your behavior. According to psychologist Julie Norem, people engage in “defensive pessimism,” in order to consciously envision the worst case scenario. When they do this, they escalate their anxiety and convert it into motivation to live better. Similarly, Adam Grant explained in his book Originals: “Once [defensive pessimists] considered the worst, they’re driven to avoid it, considering every relevant detail to make sure they don’t crash and burn, which enables them to feel a sense of control.” Tim Ferriss uses a similar approach when considering new endeavors or important decisions — what he calls, “practical pessimism.” Involved is Ferriss visualizing all the negative things that could happen if he proceeds. Instead of defining his goals, he defines his fears — “in excruciating details, the worst case scenarios.” The costs of your choices and behaviors need to be very real you to you. Perhaps this is the biggest difference between those truly living and those just getting by. The consequences (or potential consequences) of not living to their highest potential is more painful than whatever is involved. The costs of not being present with your loved ones needs to be real to you. The costs of not being healthy needs to be real to you. Not only do the costs of not changing need to be real, but a clear recognition of the effects of your current behavior on yourself and others. Without a doubt, your behavior effects other people. This becomes painfully obvious when you have children. On days I’m not on my A-Game, I can see it in my kids. They have a harder time getting to sleep at night. They are more reactive and avoidant. You are not only damaging your own life by not making needed changes, but you are also damaging the lives of those around you. This isn’t a joke. Taking personal responsibility is key, which is not the same as feeling guilt. Guilt comes from fear, and thus, doesn’t create the same feelings as acting out of love. You could perform the “right” behaviors out of guilt, but without the “right” feelings to accompany those behaviors, transformation won’t happen. Do it because you love yourself and the people around you. This is the highest motivation. Focusing on and experiencing (even visually) the consequences of behavior is a powerful tool for creating immediate behavior change. There are other ways as well. Change the default option Simply by changing the default option of certain choices is an easy way to immediately change behavior. People often take the first choice given them. For example, after deciding the university computer labs were wasting too much paper, Rutgers University simply made double-sided printing the default option on its lab printers. This small act saved 7,391,065 sheets of paper in the first semester, or roughly 620 trees for the semester, and 1,280 trees for the academic year. Students, who frequently have no preference, are now required to manually select the option of printing only one side of the page. The option to conserve is made that much easier by becoming the default option. What are your default behavioral options? Most people’s default option, these days, is to distract themselves. Email. Social media. Mindless surfing. What if your default option was something else? How could you reshape your circumstances so better options were your default? In Greg McKeown’s book, Essentialism, he recommends removing all non-essentials from your life so doing the essentials becomes your “default position.” He also recommends giving yourself time before reactively responding “Yes” to requests. Most people have “Yes” as their default response to a request when, with even a few seconds of consideration, “No” is often the better answer. Taking on greater responsibility Another way to immediately change your behavior is to take on greater responsibility. It was only a month or two after becoming a foster parent that a sense of urgency filled my heart. No longer did my career decisions only affect me. I now had three kids to provide for. That responsibility compelled me to take massive action toward my goal of becoming a professional writer. Most people avoid responsibility. Yet, that may be the very thing they need to become better. Feeling needed, like others depend on you gives you a purpose for changing. It also puts your back against the wall, leaving you with no other choice but to act. Change environment In her book Grit, psychologist Angela Duckworth tells the story of trying to potty-train her three-year-old daughter. Duckworth and her husband spent months trying to coax and cajole their child to use the toilet, to no avail. Shortly after her third birthday, Duckworth’s daughter advanced from one pre-school class to another. Her previous class was for toddlers, where almost all the children were still in diapers. Her new classroom with the “big kids” didn’t even have a changing table. According to Duckworth, her daughter looked nervous when first entering her new classroom. However, after that first day of class, she proudly told her mom she had used the potty and that she was “done with diapers.” Said Duckworth, “And she was. Potty training happened in a single moment in time. Why? Because when a child lines up for the potty with all the other children, and sees that she’s expected to take her turn, she does exactly that. She learns to do what she needs to do.” This story shows that we match our behaviors to our environmental expectations. If you have high expectations, you’ll generally rise to those. You have have low expectations, you’ll generally fall to those. Our expectations turn into a self-fulfilling prophecy. And every environment you are in has expectations. Most people prefer environments and relationships with low expectations. People constantly growing purposefully cultivate environments that force them to show up at a higher level. They surround themselves with people who are where they want to be. They are fine feeling like impostors and being the dumbest and least “successful” person in the room. Conclusion Systemically, when you change the part, you simultaneously change the whole. Unless the whole changes, small modifications will probably not be sustained. Thus, in order to change anything, you often must change everything. Everything, is connected. If your health isn’t a priority, you better believe it’s impacting all other areas of your life. If you hate your work, don’t fool yourself into thinking the rest of your life isn’t affected. What immediate changes could you make right now? How would that change influence the rest of your life? Call To Action If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist. Click here to get the checklist right now! ", "name": "907", "child": "907_1\t907_2\t907_3\t907_4\t907_5\t907_6\t907_7\t907_8\t907_9\t907_10\t907_11\t907_12\t907_13\t907_14\t907_15\t907_16\t907_17\t907_18\t907_19\t907_20\t907_21\t907_22\t907_23\t907_24", "timestamp": "Apr 4"}