{"parent": "", "title": "16 Things Your Successful Friends Have Given Up", "author": "Tim Denning", "sentences": [{"5a9e": "16 Things Your Successful Friends Have Given Up"}, {"b764": "Sit down and think, for a moment, about what your successful friends do compared to your loser friends that complain. If you don’t have any successful friends, then you need these tips I’m about to share more than anyone."}, {"f0e8": "Your successful friends think differently, speak differently, and work 10 times harder than your loser friends. Success is easier than you think it is, but you’ve got to model and learn from the right people. Your unsuccessful loser friends are the ones that are feeding your mind lies."}, {"7b7a": "They’re telling you that you can’t do it, or it’s too hard, or there’s no meaning in it all anyway. What total crap! Listen to your successful friends. Divorce your unsuccessful friends once and for all. You’re destined for big things, young Skywalker."}, {"289d": "Here are 16 things your successful friends have given up:"}, {"11bf": "1. They’ve given up believing they can’t change the world"}, {"198f": "Your successful friends believe that it’s not where you are born, how much education you have, or how much money you start out with; success is about believing you can change the world. All of us have the power to do something incredible."}, {"73c0": "We don’t need anyone to tell us we are worthy, or deserve to be phenomenal. Your successful friends let the belief in themselves guide their vision for a better world. Your successful friends believe they can be part of the positive change that helps humanity rise to a higher level."}, {"3442": "2. They’ve given up on luck"}, {"c62f": "“Luck is a matter of preparation meeting opportunity” — Oprah Winfrey"}, {"8c83": "Luck is a myth straight out. Your successful friends stopped believing in it a long time ago and have replaced luck with “hustle.”"}, {"e721": "Get out there and make stuff happen. Stop waiting for the right time because it’s never the right time to do anything. You’re in charge of your success, and you’ve got to grab it by the curly ones. The lottery is not going to make you have good luck and be rich; your mind is."}, {"bbfc": "3. They’ve given up on numbing pain"}, {"4fec": "Your successful friends are not trying to escape life by numbing the pain; they’re trying to discover the pain and then push through it like a bulldozer. Rather than sit at the pub and drink beer, indulge on carbs/salt and mingle with the other losers, they’re out there having meetings and making the stars align towards their vision."}, {"aa03": "They’re frustrated not at the world, but at how much harder they’ve got to work to make their dream come true. Instead of forgetting their failures by numbing the pain, they’re trying to etch their failures into their brain so they can ensure they learn from them, rather than be pushed into darkness by them."}, {"8da4": "4. They’ve given up on negative people"}, {"5f79": "More than anything, your successful friends have left their loser friends behind. They’re no longer going to sit down and listen to people who have no idea about anything. Your successful friends avoid losers and treat them like they’re infected with malaria."}, {"f3b7": "The only time your successful friends are willing to hang out with a loser is when that person has committed to turning their life around, and they’re asking for help. Your successful friends believe in helping others and sharing their advice."}, {"26f1": "Don’t let negative people tell you how the world is supposed to be. Find out for your yourself. Grab a piece of the map that guides your life from each of your successful friends. Combine all of their knowledge, and then stop consuming content like this. Then go out and execute on it."}, {"8180": "5. They’ve given up on time wasting"}, {"0004": "Procrastinating is something your successful friends are really bad at. They have faith in what they can achieve and just get started on the goal. They treat life like every moment is precious, and they don’t want to waste a second of it."}, {"92b9": "When your successful friends are old and have gray hair one day, they want to be proud of how they spent their time. Ideally, they want to have changed the world in some significant way, and for their legacy to last generations to come."}, {"ae55": "When they enter a room, they want to be given a standing ovation for the way they have lived their life. They are humbled by the gift of wisdom that they first saw, and then embraced with every cell in their body."}, {"c7b0": "6. They’ve given up only consuming"}, {"42e0": "Rather than consume YouTube videos all day long, your successful friends have given up consuming for creating. They spend as much time as possible doing the “doing” instead of sitting there watching others have the success they’ve always dreamt of."}, {"6541": "As a rule of thumb, spend more than 50% of your time creating and leave the rest of the time for consuming."}, {"9104": "7. They’ve given up selfishness"}, {"62a8": "Your successful friends put their vision, family and goals before everything else. They also are insanely focused on giving and serving others. Put simply: life is not just all about them."}, {"421d": "8. They’ve given up wasting their money"}, {"cd9d": "Money is one of the key differences. Successful people pay themselves first and invest a large amount of their income. They also never forget to make giving money a habit, even when they don’t have much money to give. How much you give will determine how rich you become."}, {"6f8d": "9. They’ve given up on not believing in people"}, {"b7f8": "You can’t build Rome if you don’t have people to help with the workload. Your successful friends believe in other people, and pick their “A Team” wisely. They see raw talent, and love to polish certain people into beautifully shining diamonds. Your successful friends want to create more leaders rather than be the sole leader."}, {"5b5d": "Your successful friends can see through all the imperfections someone might have, and notice the light that is desperately trying to shine through. They love to help people transform, and they believe anyone can be successful."}, {"46c3": "10. They’ve given up on negative thoughts"}, {"6bb3": "“World War 3 is not being fought on the battlefield like prior wars; it’s being fought in our own minds” — Tim Denning"}, {"f67a": "Your successful friends have oodles of discipline when it comes to their minds. It’s the center of their universe, and they know that all success starts in this one place. They train their mind every single day to avoid the default response of the brain that tells us negative things."}, {"c044": "Rather than embrace their negative thoughts, your successful friends do everything they can to let these thoughts pass by like clouds in the sky. They’re an observer of their thoughts, and they choose to focus on the rare positive thoughts that come into their consciousness."}, {"baca": "11. They’ve given up on BS"}, {"cd3f": "Life is full of so much meaningless nonsense. Your successful friends have made a conscious choice to give up on bullsh*t. Things that don’t serve them, like the news, are eliminated from their schedule. Meetings for the sake of meetings are frowned upon."}, {"5dc7": "People who only serve their own interest and have disgustingly ugly egos are forgotten about, like last year’s bottom-of-the-ladder football team. Being successful is centered around not letting BS get in your way. You’ve got to sort through the dirt to find the golden nugget tasks that make you fulfilled."}, {"fbfd": "Your BS tolerance has to be at an all-time low for you to be successful. Don’t put up with your own BS and other people’s BS anymore. Make a change for the better and do what successful people do: make a habit of permanently escaping it for the dream island called “meaning.” Now that’s an island we should all want to live on for the rest of our human existence on this beautiful planet we take for granted."}, {"60b1": "12. They’ve given up on being stuck in failure"}, {"ffc3": "“Failure is a cheap lesson in what’s not going to make you successful” — Tim Denning"}, {"a298": "Your successful friends don’t let failure stop them; they use it to become more. Failure allows your successful friends to learn things they didn’t know. Failure equals education rather than a negative experience that stops them in their tracks."}, {"e5a6": "13. They’ve given up on being single"}, {"c817": "Now to love: your successful friends have figured out that being single is a myth. Their partner is the one who supports them through all of the challenging times, and reinforces their successful nature. Your successful friends know that they need a good man or woman to come home to."}, {"1d68": "Your successful friends know that love is what makes all of the madness of life worthwhile. Rather than avoiding love or postponing it, they make it their life mission to stop at nothing until they find it while they work away at their vision."}, {"fbaf": "Being single is cool for about thirty seconds until you’re an old wrinkly person sitting in your chair and watching all the happy couples dance at the charity ball. You’ll have that sinking feeling that somehow you missed out. Somehow you got so busy with achieving that you forgot what we were put on this planet to do: Love."}, {"a9c9": "14. They’ve given up on wearing a mask"}, {"1b3b": "Unlike the corporate politicians, your successful friends have taken the mask away. They’re happy to be vulnerable, and they share even the most personal of stories. Being fake is the ultimate crime to them, and letting who they are shine through is the only way they will live their life."}, {"dcc2": "15. They’ve given up on people’s opinions of them"}, {"37a5": "Your successful friends couldn’t give a rats a$$ what anyone thinks about them. They’re not trying to impress anyone other than themselves. That’s why they’re not afraid to have a go and fail."}, {"3daa": "16. They’ve given up on giving up"}, {"dd6c": "You’ve come a long way so far. The final thing your successful friends have given up is giving up. They’ve figured out that you can’t work three months on something and then say, “I’m not getting enough traction and quit.”"}, {"5a31": "Your successful friends are not quitters. They push through all of the struggle and pain to earn the title of “successful.” It doesn’t come easy and what they do, more than any of the tips I’ve mentioned above, is NEVER GIVE UP!"}, {"f01d": "Quitting is not an option, and they let their passion push through all the barriers. They’re insanely obsessed not to lose, and nothing is going to stop them. Could you adopt this mindset and then go on to join your successful friends on cloud nine where they all hang out after a day of winning at life? I believe you can. Do you?"}, {"d426": "What are you going to decide today to give up on so you can be successful?"}, {"59d7": "Originally posted on Addicted2Success.com"}, {"22a9": "Call To Action"}, {"104d": "If you want to increase your productivity and learn some valuable life hacks, then subscribe to my private mailing list. You’ll also get my free Ebook that will help you become a game-changing influencer online."}, {"60a1": "Click here to subscribe right now!"}], "content": "16 Things Your Successful Friends Have Given Up Sit down and think, for a moment, about what your successful friends do compared to your loser friends that complain. If you don’t have any successful friends, then you need these tips I’m about to share more than anyone. Your successful friends think differently, speak differently, and work 10 times harder than your loser friends. Success is easier than you think it is, but you’ve got to model and learn from the right people. Your unsuccessful loser friends are the ones that are feeding your mind lies. They’re telling you that you can’t do it, or it’s too hard, or there’s no meaning in it all anyway. What total crap! Listen to your successful friends. Divorce your unsuccessful friends once and for all. You’re destined for big things, young Skywalker. Here are 16 things your successful friends have given up: 1. They’ve given up believing they can’t change the world Your successful friends believe that it’s not where you are born, how much education you have, or how much money you start out with; success is about believing you can change the world. All of us have the power to do something incredible. We don’t need anyone to tell us we are worthy, or deserve to be phenomenal. Your successful friends let the belief in themselves guide their vision for a better world. Your successful friends believe they can be part of the positive change that helps humanity rise to a higher level. 2. They’ve given up on luck “Luck is a matter of preparation meeting opportunity” — Oprah Winfrey Luck is a myth straight out. Your successful friends stopped believing in it a long time ago and have replaced luck with “hustle.” Get out there and make stuff happen. Stop waiting for the right time because it’s never the right time to do anything. You’re in charge of your success, and you’ve got to grab it by the curly ones. The lottery is not going to make you have good luck and be rich; your mind is. 3. They’ve given up on numbing pain Your successful friends are not trying to escape life by numbing the pain; they’re trying to discover the pain and then push through it like a bulldozer. Rather than sit at the pub and drink beer, indulge on carbs/salt and mingle with the other losers, they’re out there having meetings and making the stars align towards their vision. They’re frustrated not at the world, but at how much harder they’ve got to work to make their dream come true. Instead of forgetting their failures by numbing the pain, they’re trying to etch their failures into their brain so they can ensure they learn from them, rather than be pushed into darkness by them. 4. They’ve given up on negative people More than anything, your successful friends have left their loser friends behind. They’re no longer going to sit down and listen to people who have no idea about anything. Your successful friends avoid losers and treat them like they’re infected with malaria. The only time your successful friends are willing to hang out with a loser is when that person has committed to turning their life around, and they’re asking for help. Your successful friends believe in helping others and sharing their advice. Don’t let negative people tell you how the world is supposed to be. Find out for your yourself. Grab a piece of the map that guides your life from each of your successful friends. Combine all of their knowledge, and then stop consuming content like this. Then go out and execute on it. 5. They’ve given up on time wasting Procrastinating is something your successful friends are really bad at. They have faith in what they can achieve and just get started on the goal. They treat life like every moment is precious, and they don’t want to waste a second of it. When your successful friends are old and have gray hair one day, they want to be proud of how they spent their time. Ideally, they want to have changed the world in some significant way, and for their legacy to last generations to come. When they enter a room, they want to be given a standing ovation for the way they have lived their life. They are humbled by the gift of wisdom that they first saw, and then embraced with every cell in their body. 6. They’ve given up only consuming Rather than consume YouTube videos all day long, your successful friends have given up consuming for creating. They spend as much time as possible doing the “doing” instead of sitting there watching others have the success they’ve always dreamt of. As a rule of thumb, spend more than 50% of your time creating and leave the rest of the time for consuming. 7. They’ve given up selfishness Your successful friends put their vision, family and goals before everything else. They also are insanely focused on giving and serving others. Put simply: life is not just all about them. 8. They’ve given up wasting their money Money is one of the key differences. Successful people pay themselves first and invest a large amount of their income. They also never forget to make giving money a habit, even when they don’t have much money to give. How much you give will determine how rich you become. 9. They’ve given up on not believing in people You can’t build Rome if you don’t have people to help with the workload. Your successful friends believe in other people, and pick their “A Team” wisely. They see raw talent, and love to polish certain people into beautifully shining diamonds. Your successful friends want to create more leaders rather than be the sole leader. Your successful friends can see through all the imperfections someone might have, and notice the light that is desperately trying to shine through. They love to help people transform, and they believe anyone can be successful. 10. They’ve given up on negative thoughts “World War 3 is not being fought on the battlefield like prior wars; it’s being fought in our own minds” — Tim Denning Your successful friends have oodles of discipline when it comes to their minds. It’s the center of their universe, and they know that all success starts in this one place. They train their mind every single day to avoid the default response of the brain that tells us negative things. Rather than embrace their negative thoughts, your successful friends do everything they can to let these thoughts pass by like clouds in the sky. They’re an observer of their thoughts, and they choose to focus on the rare positive thoughts that come into their consciousness. 11. They’ve given up on BS Life is full of so much meaningless nonsense. Your successful friends have made a conscious choice to give up on bullsh*t. Things that don’t serve them, like the news, are eliminated from their schedule. Meetings for the sake of meetings are frowned upon. People who only serve their own interest and have disgustingly ugly egos are forgotten about, like last year’s bottom-of-the-ladder football team. Being successful is centered around not letting BS get in your way. You’ve got to sort through the dirt to find the golden nugget tasks that make you fulfilled. Your BS tolerance has to be at an all-time low for you to be successful. Don’t put up with your own BS and other people’s BS anymore. Make a change for the better and do what successful people do: make a habit of permanently escaping it for the dream island called “meaning.” Now that’s an island we should all want to live on for the rest of our human existence on this beautiful planet we take for granted. 12. They’ve given up on being stuck in failure “Failure is a cheap lesson in what’s not going to make you successful” — Tim Denning Your successful friends don’t let failure stop them; they use it to become more. Failure allows your successful friends to learn things they didn’t know. Failure equals education rather than a negative experience that stops them in their tracks. 13. They’ve given up on being single Now to love: your successful friends have figured out that being single is a myth. Their partner is the one who supports them through all of the challenging times, and reinforces their successful nature. Your successful friends know that they need a good man or woman to come home to. Your successful friends know that love is what makes all of the madness of life worthwhile. Rather than avoiding love or postponing it, they make it their life mission to stop at nothing until they find it while they work away at their vision. Being single is cool for about thirty seconds until you’re an old wrinkly person sitting in your chair and watching all the happy couples dance at the charity ball. You’ll have that sinking feeling that somehow you missed out. Somehow you got so busy with achieving that you forgot what we were put on this planet to do: Love. 14. They’ve given up on wearing a mask Unlike the corporate politicians, your successful friends have taken the mask away. They’re happy to be vulnerable, and they share even the most personal of stories. Being fake is the ultimate crime to them, and letting who they are shine through is the only way they will live their life. 15. They’ve given up on people’s opinions of them Your successful friends couldn’t give a rats a$$ what anyone thinks about them. They’re not trying to impress anyone other than themselves. That’s why they’re not afraid to have a go and fail. 16. They’ve given up on giving up You’ve come a long way so far. The final thing your successful friends have given up is giving up. They’ve figured out that you can’t work three months on something and then say, “I’m not getting enough traction and quit.” Your successful friends are not quitters. They push through all of the struggle and pain to earn the title of “successful.” It doesn’t come easy and what they do, more than any of the tips I’ve mentioned above, is NEVER GIVE UP! Quitting is not an option, and they let their passion push through all the barriers. They’re insanely obsessed not to lose, and nothing is going to stop them. Could you adopt this mindset and then go on to join your successful friends on cloud nine where they all hang out after a day of winning at life? I believe you can. Do you? What are you going to decide today to give up on so you can be successful? Originally posted on Addicted2Success.com Call To Action If you want to increase your productivity and learn some valuable life hacks, then subscribe to my private mailing list. You’ll also get my free Ebook that will help you become a game-changing influencer online. Click here to subscribe right now! ", "name": "910", "child": "910_1\t910_2\t910_3\t910_4\t910_5\t910_6\t910_7\t910_8\t910_9\t910_10\t910_11\t910_12\t910_13\t910_14\t910_15\t910_16", "timestamp": "Apr 11"}