{"parent": "", "title": "Wreckonomics", "author": "umair haque", "sentences": [{"266e": "Wreckonomics"}, {"85e2": "How Economics Wrecked the World – and How to Fix It"}, {"9612": "Every modern age of decline, of war, can be seen as the result of a broken political economics, failed ideas about how to run economies. World War I exploded at the end of a failed system of colonialism and mercantilism. World War II, at the end of a failed monopoly capitalism."}, {"6f15": "Today we – the West – are in a similar plight. There are two dominant schools of economics. Trickle down. And what I’ll reluctantly call neoliberalism, but is more accurately just called American economics – because most of the rest of the world mostly just wisely ignores it."}, {"637b": "These two schools of economics today stand discredited by reality. They have wrecked everything in their path. Their societies, the young, the middle class, prosperity, stability, global peace. Consider for a moment how deep the wreckage goes: first, blind adherence to both these economics wrecked the American middle class, which turned right around and wrecked the government, installing supremacist demagogues, who are wrecking…global stability, peace, more or less the basics the world took for granted just five years ago."}, {"cf54": "How did wreckonomics fail so badly? Both these schools argue against a basic good life for all: they suggest, in a perverse inversion, that public goods are in fact bad, and thus people shouldn’t have healthcare, savings, transport, education."}, {"9d53": "Thus, they forgot the most basic truth of political economy. Whether or not there are self driving miracle machines, super John Galts, and so on, without a basic sense of fair play, all is lost. Without bread on the table, people will grow angry, vengeful, hateful. They will become easy prey for demagogues. Those demagogues will wreck the very institutions and norms that even neoliberalism and trickle down econ depends on: the rule of law, rights, justice, contracts, transparency, stability, and so on. That’s now."}, {"f6be": "Both neoliberalism and trickle down economics are precisely the same in one crucial respect. They ask people to wait for a life-changing payoff that will arrive one day. For trickle down, it’s benefits from the rich. For neoliberalism, it’s benefits from global trade."}, {"d8fa": "But tomorrow never came. The benefits of global trade went, more than 100%, to the super rich. Their transformation from just rich to super rich had less than no benefits for the average person, only costs: at the very same time, the middle class imploded, and life expectancy fell."}, {"bb3d": "So here we are. What now? Now we need a better economics to save the world. No, really. Just as at the end of World War II, Keynes’ ideas of investing in broken societies became reality – and thus really ended the war – so today we need a revolution in economics. Now. This time, probably to prevent such a war."}, {"c101": "What should that revolution look like? All the above, the failures of yesterday’s economics gives us many clues."}, {"9241": "Tomorrow’s economics should be grounded upon reality. That is, the lived reality of people’s daily lives. It should trade science for art and math for genuine knowledge."}, {"1490": "Tomorrow’s economics should be about improving everyone’s lives – not just making “society” rich, which can mean, as it has today, just a tiny handful of people."}, {"2171": "And tomorrow’s economics should not just be about money, finance, stock prices. But genuine human well being. Whether or not a person is living a longer, happier, healthier, saner, truer, gentler, more meaningful life."}, {"2f08": "If we can go that far, accomplish just those three things, I think we will have gone far enough. Perhaps not to save the world. But at least to genuinely advance the purpose of political economy. Not to debate how many angels dance upon the head of a pin. But to breathe possibility into every life."}, {"62bc": "Umair"}, {"2780": "April 2017"}], "content": "Wreckonomics How Economics Wrecked the World – and How to Fix It Every modern age of decline, of war, can be seen as the result of a broken political economics, failed ideas about how to run economies. World War I exploded at the end of a failed system of colonialism and mercantilism. World War II, at the end of a failed monopoly capitalism. Today we – the West – are in a similar plight. There are two dominant schools of economics. Trickle down. And what I’ll reluctantly call neoliberalism, but is more accurately just called American economics – because most of the rest of the world mostly just wisely ignores it. These two schools of economics today stand discredited by reality. They have wrecked everything in their path. Their societies, the young, the middle class, prosperity, stability, global peace. Consider for a moment how deep the wreckage goes: first, blind adherence to both these economics wrecked the American middle class, which turned right around and wrecked the government, installing supremacist demagogues, who are wrecking…global stability, peace, more or less the basics the world took for granted just five years ago. How did wreckonomics fail so badly? Both these schools argue against a basic good life for all: they suggest, in a perverse inversion, that public goods are in fact bad, and thus people shouldn’t have healthcare, savings, transport, education. Thus, they forgot the most basic truth of political economy. Whether or not there are self driving miracle machines, super John Galts, and so on, without a basic sense of fair play, all is lost. Without bread on the table, people will grow angry, vengeful, hateful. They will become easy prey for demagogues. Those demagogues will wreck the very institutions and norms that even neoliberalism and trickle down econ depends on: the rule of law, rights, justice, contracts, transparency, stability, and so on. That’s now. Both neoliberalism and trickle down economics are precisely the same in one crucial respect. They ask people to wait for a life-changing payoff that will arrive one day. For trickle down, it’s benefits from the rich. For neoliberalism, it’s benefits from global trade. But tomorrow never came. The benefits of global trade went, more than 100%, to the super rich. Their transformation from just rich to super rich had less than no benefits for the average person, only costs: at the very same time, the middle class imploded, and life expectancy fell. So here we are. What now? Now we need a better economics to save the world. No, really. Just as at the end of World War II, Keynes’ ideas of investing in broken societies became reality – and thus really ended the war – so today we need a revolution in economics. Now. This time, probably to prevent such a war. What should that revolution look like? All the above, the failures of yesterday’s economics gives us many clues. Tomorrow’s economics should be grounded upon reality. That is, the lived reality of people’s daily lives. It should trade science for art and math for genuine knowledge. Tomorrow’s economics should be about improving everyone’s lives – not just making “society” rich, which can mean, as it has today, just a tiny handful of people. And tomorrow’s economics should not just be about money, finance, stock prices. But genuine human well being. Whether or not a person is living a longer, happier, healthier, saner, truer, gentler, more meaningful life. If we can go that far, accomplish just those three things, I think we will have gone far enough. Perhaps not to save the world. But at least to genuinely advance the purpose of political economy. Not to debate how many angels dance upon the head of a pin. But to breathe possibility into every life. Umair April 2017 ", "name": "911", "child": "911_1\t911_2\t911_3\t911_4\t911_5\t911_6\t911_7\t911_8\t911_9\t911_10\t911_11\t911_12\t911_13", "timestamp": "Apr 14"}