{"parent": "", "title": "Fantastic Mistakes", "author": "Crisp Apples", "sentences": [{"6651": "Fantastic Mistakes"}, {"7df8": "Recently I started to write more, after spending the last decade on real jobs. Luckily I came across Neil Gaiman’s “Make Good Art” speech. Have you noticed that people who gave commencement speech often never graduated or even started at college? Here is what has inspired me."}, {"4497": "When you start out"}, {"fb6c": "You have no idea what you are doing, and you should not. This is great. People who know what they are doing know the rules, and know what is possible and impossible."}, {"4478": "If you don’t know it’s impossible, it’s easier to do."}, {"f5c9": "Because nobody’s done it before, they haven’t made up rules to stop anyone doing that again, yet."}, {"3c91": "I just got out into the world"}, {"eb0c": "I never had any kind of career plan. The nearest thing I had was a list I made when I was 15 of everything I wanted to do."}, {"8f2b": "Something that worked for me was imagining where I wanted to be, a distant mountain. I knew that as long as I kept walking towards the mountain I would be all right. I said no to proper jobs that would have paid proper money, because they would have been walking away from the mountain. If those offers had come along earlier I might have taken them, because they would have been closer to the mountain than I was at the time."}, {"86fe": "I learned to write by writing. I wrote, and I became a better writer. I tended to do anything as long as it felt like an adventure, and to stop when it felt like work."}, {"d2c6": "Failures"}, {"23f5": "You need to be thick-skinned, to learn that not every project will survive."}, {"e6ba": "A freelance life, a life in the arts, is sometimes like putting messages in bottles, on a desert island, and hoping that someone will find one of your bottles, open it and read it."}, {"5702": "Nothing I did where the only reason for doing it was the money was ever worth it. Usually I didn’t wind up getting the money, either. If I did work I was proud of and I didn’t get the money, at least I’d have the work."}, {"b2cc": "Success"}, {"d6e7": "The problems of failures are hard. The problems of success can be harder."}, {"c1b3": "Because nobody warns you about them. The first problem of any kind of (even limited) success is the unshakable conviction that you are getting away with something, and that any moment now they will discover you. And after that, the biggest problem of success is that the world conspires to stop you from doing the things that you do because you are successful."}, {"6a80": "There was a day when I looked up and realized that I had become someone who professionally replied to emails, and who wrote as a hobby."}, {"3daf": "You have to learn to say no, because now the bottles you threw in the ocean are all coming back."}, {"be12": "Make your art"}, {"daf9": "You have the ability to make art. It gets you through good times and it gets you through the other ones. When things get tough, do what only you do best. Make your art."}, {"f05e": "The moment that you feel that you’re walking down the street naked, exposing too much of your heart and your mind and what exists on the inside... That’s the moment you may be starting to get it right."}, {"4d58": "The things I’ve done that worked the best were the things I was the least certain about. Where would be the fun in making something you knew was going to work easily from the start?"}, {"b9cc": "Keep working"}, {"0590": "People keep working in a freelance world, because"}, {"e4b9": "You don’t even need all three, two out of three is fine. And more and more of today’s world is freelance."}, {"2a92": "The best advice"}, {"091f": "“This is really great. You should enjoy it.”"}, {"0e76": "This was the absolute best advice I got that I ignored. Because I was too worried about things going wrong, I didn’t stop and look around and go, “wow, this is really fun.” That was the hardest lesson for me. Let go and enjoy the ride, because the ride takes you to some remarkable and unexpected places."}, {"06b3": "Now what?"}, {"c6fd": "The rules as we know them are breaking down. The nature of distribution is changing, and nobody knows what the landscape will look like two years from now. So make up your own rules. Be wise."}, {"0b7b": "Often the harder you work, and the more wisely you work, the “luckier” you get."}, {"e331": "If you cannot be wise, pretend to be someone who is wise, and then just behave like they would."}, {"1696": "Go make interesting, amazing, fantastic mistakes. Leave the world more interesting for your being there."}, {"f68d": "If you enjoyed this story, please consider clicking the ♡ button so more people can find it."}], "content": "Fantastic Mistakes Recently I started to write more, after spending the last decade on real jobs. Luckily I came across Neil Gaiman’s “Make Good Art” speech. Have you noticed that people who gave commencement speech often never graduated or even started at college? Here is what has inspired me. When you start out You have no idea what you are doing, and you should not. This is great. People who know what they are doing know the rules, and know what is possible and impossible. If you don’t know it’s impossible, it’s easier to do. Because nobody’s done it before, they haven’t made up rules to stop anyone doing that again, yet. I just got out into the world I never had any kind of career plan. The nearest thing I had was a list I made when I was 15 of everything I wanted to do. Something that worked for me was imagining where I wanted to be, a distant mountain. I knew that as long as I kept walking towards the mountain I would be all right. I said no to proper jobs that would have paid proper money, because they would have been walking away from the mountain. If those offers had come along earlier I might have taken them, because they would have been closer to the mountain than I was at the time. I learned to write by writing. I wrote, and I became a better writer. I tended to do anything as long as it felt like an adventure, and to stop when it felt like work. Failures You need to be thick-skinned, to learn that not every project will survive. A freelance life, a life in the arts, is sometimes like putting messages in bottles, on a desert island, and hoping that someone will find one of your bottles, open it and read it. Nothing I did where the only reason for doing it was the money was ever worth it. Usually I didn’t wind up getting the money, either. If I did work I was proud of and I didn’t get the money, at least I’d have the work. Success The problems of failures are hard. The problems of success can be harder. Because nobody warns you about them. The first problem of any kind of (even limited) success is the unshakable conviction that you are getting away with something, and that any moment now they will discover you. And after that, the biggest problem of success is that the world conspires to stop you from doing the things that you do because you are successful. There was a day when I looked up and realized that I had become someone who professionally replied to emails, and who wrote as a hobby. You have to learn to say no, because now the bottles you threw in the ocean are all coming back. Make your art You have the ability to make art. It gets you through good times and it gets you through the other ones. When things get tough, do what only you do best. Make your art. The moment that you feel that you’re walking down the street naked, exposing too much of your heart and your mind and what exists on the inside... That’s the moment you may be starting to get it right. The things I’ve done that worked the best were the things I was the least certain about. Where would be the fun in making something you knew was going to work easily from the start? Keep working People keep working in a freelance world, because You don’t even need all three, two out of three is fine. And more and more of today’s world is freelance. The best advice “This is really great. You should enjoy it.” This was the absolute best advice I got that I ignored. Because I was too worried about things going wrong, I didn’t stop and look around and go, “wow, this is really fun.” That was the hardest lesson for me. Let go and enjoy the ride, because the ride takes you to some remarkable and unexpected places. Now what? The rules as we know them are breaking down. The nature of distribution is changing, and nobody knows what the landscape will look like two years from now. So make up your own rules. Be wise. Often the harder you work, and the more wisely you work, the “luckier” you get. If you cannot be wise, pretend to be someone who is wise, and then just behave like they would. Go make interesting, amazing, fantastic mistakes. Leave the world more interesting for your being there. If you enjoyed this story, please consider clicking the ♡ button so more people can find it. ", "name": "912", "child": "912_1\t912_2\t912_3\t912_4\t912_5", "timestamp": "Apr 15"}