{"parent": "", "title": "Judging a company by their team page", "author": "Wil Reynolds", "sentences": [{"4623": "Judging a company by their team page"}, {"e37d": "I recently took a look at a meet the team page, for an agency a client of ours is using, and was reminded of all the things that fire off in my head when I see those pages. Good and bad. Ours still makes me chuckle. I don’t know if its just me, but I judge companies by their “meet the team” pages. I’m maybe not the average guy anymore who is looking for a job, but I still make inferences about companies based on these pages. Here is what I find myself paying attention to when I go to a about us page:"}, {"98eb": "1 — Where is the CEO / Executive Team?"}, {"bf76": "CEO at the top of your about the “team” page? I read that as the 2000’s version of parking spots at the front reserved for execs. You’d never find that in a “progressive” company, but it seems like we have no problem doing it on our websites?"}, {"aa3d": "https://www.pinterest.com/pin/142144931958897175/"}, {"eccf": "Where your executives are listed fires something off in my head. I can’t help it. If the CEO/Exec team is listed first, and everyone else is alphabetical it says something. I know a lot of people look for who are the execs, so for users it makes it easier to find the executive team. If that is important to you keep it."}, {"6e02": "Our About us page is built to show that we don’t take ourselves too seriously, and we default to A-Z is the way to go, some day that might have to change, just like I changed my mind about titles. Page load time is getting pretty bad on that page, so maybe we’ll work on that in 2018."}, {"e602": "I recently took a look at a 30 person digital agency. CEO was listed in the top left (#1 spot), Exec assistant, bottom right (dead last). I could be wrong, but that is an assumption I’d make about that company, even if it is unintentional."}, {"8388": "2 — How white & male is the executive team?"}, {"0f35": "I’m not the biggest diversity champion, never was, not until I listened to the podcast I linked below and had this conversation with Rand Fishkin (start at 4:30). We view diversity differently, FYI."}, {"7ba2": "Rand Fishkin — Pioneers of Company Culture"}, {"4a66": "Rand, wrote up a great piece on intentional diversity after this, worth a read for sure."}, {"794e": "CMOs are starting to say more and more, things like this:"}, {"31d0": "Pepsi CMO, Brad Jakeman recently said... “I am sick and tired as a client of sitting in agency meetings with a whole bunch of white straight males talking to me about how we are going to sell our brands that are bought 85% by women,” he said. “Innovation and disruption does not come from homogeneous groups of people.”"}, {"c09c": "When I see all the executives looking like this I think does this agency/company believe that diverse groups make better products/decisions for their customers/businesses? Take a listen at the podcast (start at 12 minutes) that changed my mind about diversity, if you dig it follow Leslie Miley!"}, {"9510": "So what is the solution?"}, {"06df": "I don’t think there is one, companies with hundreds of thousands of employees can’t list everyone, I think its not a problem to be solved. Its more important to know how some applicants, partners, etc might look at your company based on clues from your website including your about us page. So it comes down to what do you want to communicate about your organization, and how you list people communicates something, just take a sec to make sure what you want to communicate represents what you believe."}], "content": "Judging a company by their team page I recently took a look at a meet the team page, for an agency a client of ours is using, and was reminded of all the things that fire off in my head when I see those pages. Good and bad. Ours still makes me chuckle. I don’t know if its just me, but I judge companies by their “meet the team” pages. I’m maybe not the average guy anymore who is looking for a job, but I still make inferences about companies based on these pages. Here is what I find myself paying attention to when I go to a about us page: 1 — Where is the CEO / Executive Team? CEO at the top of your about the “team” page? I read that as the 2000’s version of parking spots at the front reserved for execs. You’d never find that in a “progressive” company, but it seems like we have no problem doing it on our websites? https://www.pinterest.com/pin/142144931958897175/ Where your executives are listed fires something off in my head. I can’t help it. If the CEO/Exec team is listed first, and everyone else is alphabetical it says something. I know a lot of people look for who are the execs, so for users it makes it easier to find the executive team. If that is important to you keep it. Our About us page is built to show that we don’t take ourselves too seriously, and we default to A-Z is the way to go, some day that might have to change, just like I changed my mind about titles. Page load time is getting pretty bad on that page, so maybe we’ll work on that in 2018. I recently took a look at a 30 person digital agency. CEO was listed in the top left (#1 spot), Exec assistant, bottom right (dead last). I could be wrong, but that is an assumption I’d make about that company, even if it is unintentional. 2 — How white & male is the executive team? I’m not the biggest diversity champion, never was, not until I listened to the podcast I linked below and had this conversation with Rand Fishkin (start at 4:30). We view diversity differently, FYI. Rand Fishkin — Pioneers of Company Culture Rand, wrote up a great piece on intentional diversity after this, worth a read for sure. CMOs are starting to say more and more, things like this: Pepsi CMO, Brad Jakeman recently said... “I am sick and tired as a client of sitting in agency meetings with a whole bunch of white straight males talking to me about how we are going to sell our brands that are bought 85% by women,” he said. “Innovation and disruption does not come from homogeneous groups of people.” When I see all the executives looking like this I think does this agency/company believe that diverse groups make better products/decisions for their customers/businesses? Take a listen at the podcast (start at 12 minutes) that changed my mind about diversity, if you dig it follow Leslie Miley! So what is the solution? I don’t think there is one, companies with hundreds of thousands of employees can’t list everyone, I think its not a problem to be solved. Its more important to know how some applicants, partners, etc might look at your company based on clues from your website including your about us page. So it comes down to what do you want to communicate about your organization, and how you list people communicates something, just take a sec to make sure what you want to communicate represents what you believe. ", "name": "914", "child": "914_1\t914_2\t914_3\t914_4\t914_5", "timestamp": "Apr 14"}