{"parent": "", "title": "7 Things I Learned About A.I. at SxSW17", "author": "Dharmesh Shah", "sentences": [{"3bc9": "7 Things I Learned About A.I. at SxSW17"}, {"89ee": "I recently spent time in a magical place filled with madness and mayhem. A place where some of the smartest minds on the planet congregate each March to discuss and share exciting new insights into the worlds of business, technology, and much more."}, {"0895": "That place was the SXSW festival in Austin, Texas."}, {"cb38": "This year, I had the opportunity to talk about my bots, including lessons learned from building GrowthBot. I was a bit worried that the topic of B2B bots might be too arcane and nobody would show up — but it turned out to be a sold-out session."}, {"fd57": "Turns out, I was not the only one there interested in A.I., machine learning, and bots."}, {"ce0c": "One thing that was clear, A.I. is no longer going to be relegated to Summer sci-fi movie releases. It will be increasingly commonplace. Some might argue that it already is with more and more businesses leveraging A.I. to improve their decision-making, their operations — and experience they deliver to customers."}, {"f09a": "Here are some of the takeaways I’m rolling around in my head."}, {"3e08": "1. The New-Look Creative Team"}, {"3c32": "Engineers have long been stereotyped. Images of solitary workspaces with headphones, multiple monitors filled with code, and remnants of the take-out food from earlier that afternoon. (Or in my case, empty bottles of Soylent)."}, {"3641": "Now, I know what you’re thinking: These are exactly the people that have been missing from creative teams! Wait, that’s not what you were thinking? OK then, hear me out."}, {"4a22": "John Lasseter, Chief Creative Officer at Pixar, has this theory. He believes the challenge isn’t the technology, it’s getting the technology to push the art."}, {"1382": "With the emergence of AI engineers and artists alike need to venture into one another’s traditional space. The only creative boundaries in AI is that technology should be an extension of story."}, {"a2ba": "Start by including engineers in creative brainstorms. I have a feeling you’ll be surprised by the results."}, {"1cd9": "2. B2B Will Soon Mean Bot-to-Bot Conversation"}, {"7a70": "OK, I cheated on this one a little. In my own session, I was asked a question by an audience member. “Will bots ever reach out to speak to us first, without our prompting?” He continued, “Even more, will they speak to other bots on our behalf?” Smart cookie."}, {"0094": "My answer was “Yes. So many times, yes.”"}, {"0dd2": "It’s inevitable, really. The A.I.-powered digital assistants of the future will know you and your preferences. More importantly, they’ll know about other bots. They can then actively reach out to other bots on your behalf to get a specific task done."}, {"66d2": "For example, I need a battery case for my phone by Thursday, let’s say. My personal shopping bot will be able to go to the Amazon bot, the Mophie bot and others. It will know which model phone I have, who has the right batteries, and find the best source to get it shipped to me so that it arrives before my next long business trip. Once it’s placed the order, the bot will just send me a tracking code and give me updates as needed. We’re a few years off from this, but it’s only a matter of time."}, {"911b": "3. IBM’s Watson is Much More Than a Jeopardy Champion"}, {"77fd": "This year, IBM’s AI-powered Watson appeared to be trading in its white collar shirt and tie for a cool t-shirt and ripped jeans. That’s to say, Watson is now a consumer-focused, creative powerhouse."}, {"d463": "I walked up to an unassuming keyboard. OK, I watched someone walk up to an unassuming keyboard. In a mere 10 seconds she selected her current mood from a list of choices, and wham! A completely original, three-minute piece of music."}, {"7c8f": "The question is no longer whether AI can create original works of art. It can. We’ll see more and more of that. The question is what is the value of these works of art to humans?"}, {"6762": "4. The Challenge is the Data, Not the Algorithm"}, {"e4a6": "AI assisted search is changing the way we understand and conduct SEO (Search Engine Optimization). Keywords are the current bearers of search results, but more and more people are turning to conversational A.I. assistants like Alexa and Google Home for online searches. And that means data. Lots of data."}, {"9fb6": "By 2020, humans and all our things will use data. A lot of data. Here’s what intel’s Blue Horizon work has figured out:"}, {"c3c5": "That’s only the raw data. We’re going to need to process and analyze every bit of it if the data’s going to be relevant and helpful. Companies need to anticipate this surge in data usage by finding ways to centralize their own data to be used in the most efficient ways."}, {"1e20": "5. The Most Terrifying Robot is One That Does Nothing at All"}, {"da7d": "You’re alone in a room. Before you stands a robot. Its hand is outstretched and eyes locked onto you. It stays silent. You might find yourself asking, “Is it alive? Do I need to speak first? Is it plotting my demise?”"}, {"4929": "When we think of AI-powered products, like robots, the goal should never be to make them as human as possible. Instead, we should design A.I. for the human user."}, {"02d2": "Movements, intonations, and interactions should all be designed for what humans expect. A robot that doesn’t interact with humans in a humanlike way is just strange. Robots need to be social, in a way, communicating at least somewhat like a human."}, {"75bc": "So if a physical robot tries to appear as a human, we will expect a completely human interaction. Which remains a ways off for us. A.I. of any type should follow the simple framework of detect, acknowledge, think, and respond when attempting to best serve humans."}, {"f4e9": "6. It’s All About the Story"}, {"d93e": "Coding will continue to be important, but writing will be invaluable. Your next great hire will be someone who can write a concise paragraph that conveys information, has a distinct personality, and delights your customers."}, {"7481": "Everything we do as marketers or salespeople is about story. Our content and conversations should excite the imagination and make others curious about the characters in our story — and perhaps see themselves in it. A.I. and other tech innovations will allow us to get closer to the characters in the stories we tell."}, {"ebe4": "The stories we told were once confined to the stage (and books), separate from the audience. Then there was a screen. Now, with A.I. and the virtual worlds of storytelling, you can do things where the characters are among the audience."}, {"c4f9": "The next story to be told is this: How can you be the hero of your own story? So as we think about how we tell our own brand stories, always keep the audience in mind. How can they be involved in your story? Which brings me to my final takeaway:"}, {"a879": "7. The Future of Marketing and Sales is A.I."}, {"4de0": "At the heart of inbound marketing and sales is the customer. And of all the lessons I’ve learned at SXSW, the greatest takeaway I had was that the future of inbound is A.I."}, {"d11a": "As I started drawing parallels between the number of A.I. talks I heard, I came up with the Rule of Right — and it reminded me of how companies today already approach inbound marketing and sales."}, {"52f9": "The Rule of 3 R’s is meeting the right customer, in the right place, at the right time."}, {"a284": "A.I. can still conjure up images of doomsday, ethical dilemmas on moral norms, and a very real concern of job displacement."}, {"cb4a": "Of everything I’ve learned from SXSW this year, I think I cling to the biggest takeaway: A.I. will drive the betterment of humankind. It will complement our work and our lives. And it has the ability to make a lasting, positive impact on our world."}], "content": "7 Things I Learned About A.I. at SxSW17 I recently spent time in a magical place filled with madness and mayhem. A place where some of the smartest minds on the planet congregate each March to discuss and share exciting new insights into the worlds of business, technology, and much more. That place was the SXSW festival in Austin, Texas. This year, I had the opportunity to talk about my bots, including lessons learned from building GrowthBot. I was a bit worried that the topic of B2B bots might be too arcane and nobody would show up — but it turned out to be a sold-out session. Turns out, I was not the only one there interested in A.I., machine learning, and bots. One thing that was clear, A.I. is no longer going to be relegated to Summer sci-fi movie releases. It will be increasingly commonplace. Some might argue that it already is with more and more businesses leveraging A.I. to improve their decision-making, their operations — and experience they deliver to customers. Here are some of the takeaways I’m rolling around in my head. 1. The New-Look Creative Team Engineers have long been stereotyped. Images of solitary workspaces with headphones, multiple monitors filled with code, and remnants of the take-out food from earlier that afternoon. (Or in my case, empty bottles of Soylent). Now, I know what you’re thinking: These are exactly the people that have been missing from creative teams! Wait, that’s not what you were thinking? OK then, hear me out. John Lasseter, Chief Creative Officer at Pixar, has this theory. He believes the challenge isn’t the technology, it’s getting the technology to push the art. With the emergence of AI engineers and artists alike need to venture into one another’s traditional space. The only creative boundaries in AI is that technology should be an extension of story. Start by including engineers in creative brainstorms. I have a feeling you’ll be surprised by the results. 2. B2B Will Soon Mean Bot-to-Bot Conversation OK, I cheated on this one a little. In my own session, I was asked a question by an audience member. “Will bots ever reach out to speak to us first, without our prompting?” He continued, “Even more, will they speak to other bots on our behalf?” Smart cookie. My answer was “Yes. So many times, yes.” It’s inevitable, really. The A.I.-powered digital assistants of the future will know you and your preferences. More importantly, they’ll know about other bots. They can then actively reach out to other bots on your behalf to get a specific task done. For example, I need a battery case for my phone by Thursday, let’s say. My personal shopping bot will be able to go to the Amazon bot, the Mophie bot and others. It will know which model phone I have, who has the right batteries, and find the best source to get it shipped to me so that it arrives before my next long business trip. Once it’s placed the order, the bot will just send me a tracking code and give me updates as needed. We’re a few years off from this, but it’s only a matter of time. 3. IBM’s Watson is Much More Than a Jeopardy Champion This year, IBM’s AI-powered Watson appeared to be trading in its white collar shirt and tie for a cool t-shirt and ripped jeans. That’s to say, Watson is now a consumer-focused, creative powerhouse. I walked up to an unassuming keyboard. OK, I watched someone walk up to an unassuming keyboard. In a mere 10 seconds she selected her current mood from a list of choices, and wham! A completely original, three-minute piece of music. The question is no longer whether AI can create original works of art. It can. We’ll see more and more of that. The question is what is the value of these works of art to humans? 4. The Challenge is the Data, Not the Algorithm AI assisted search is changing the way we understand and conduct SEO (Search Engine Optimization). Keywords are the current bearers of search results, but more and more people are turning to conversational A.I. assistants like Alexa and Google Home for online searches. And that means data. Lots of data. By 2020, humans and all our things will use data. A lot of data. Here’s what intel’s Blue Horizon work has figured out: That’s only the raw data. We’re going to need to process and analyze every bit of it if the data’s going to be relevant and helpful. Companies need to anticipate this surge in data usage by finding ways to centralize their own data to be used in the most efficient ways. 5. The Most Terrifying Robot is One That Does Nothing at All You’re alone in a room. Before you stands a robot. Its hand is outstretched and eyes locked onto you. It stays silent. You might find yourself asking, “Is it alive? Do I need to speak first? Is it plotting my demise?” When we think of AI-powered products, like robots, the goal should never be to make them as human as possible. Instead, we should design A.I. for the human user. Movements, intonations, and interactions should all be designed for what humans expect. A robot that doesn’t interact with humans in a humanlike way is just strange. Robots need to be social, in a way, communicating at least somewhat like a human. So if a physical robot tries to appear as a human, we will expect a completely human interaction. Which remains a ways off for us. A.I. of any type should follow the simple framework of detect, acknowledge, think, and respond when attempting to best serve humans. 6. It’s All About the Story Coding will continue to be important, but writing will be invaluable. Your next great hire will be someone who can write a concise paragraph that conveys information, has a distinct personality, and delights your customers. Everything we do as marketers or salespeople is about story. Our content and conversations should excite the imagination and make others curious about the characters in our story — and perhaps see themselves in it. A.I. and other tech innovations will allow us to get closer to the characters in the stories we tell. The stories we told were once confined to the stage (and books), separate from the audience. Then there was a screen. Now, with A.I. and the virtual worlds of storytelling, you can do things where the characters are among the audience. The next story to be told is this: How can you be the hero of your own story? So as we think about how we tell our own brand stories, always keep the audience in mind. How can they be involved in your story? Which brings me to my final takeaway: 7. The Future of Marketing and Sales is A.I. At the heart of inbound marketing and sales is the customer. And of all the lessons I’ve learned at SXSW, the greatest takeaway I had was that the future of inbound is A.I. As I started drawing parallels between the number of A.I. talks I heard, I came up with the Rule of Right — and it reminded me of how companies today already approach inbound marketing and sales. The Rule of 3 R’s is meeting the right customer, in the right place, at the right time. A.I. can still conjure up images of doomsday, ethical dilemmas on moral norms, and a very real concern of job displacement. Of everything I’ve learned from SXSW this year, I think I cling to the biggest takeaway: A.I. will drive the betterment of humankind. It will complement our work and our lives. And it has the ability to make a lasting, positive impact on our world. ", "name": "921", "child": "921_1\t921_2\t921_3\t921_4\t921_5\t921_6\t921_7\t921_8", "timestamp": "Mar 24"}