{"parent": "", "title": "Stop Making These Incredibly Common Recruiting Mistakes", "author": "Declan Fitzgerald", "sentences": [{"ac39": "Stop Making These Incredibly Common Recruiting Mistakes"}, {"a80b": "I’ve worked in recruiting nearly 20 years and at some pretty amazing companies like LinkedIn, Microsoft, and most recently HubSpot."}, {"fc69": "There are some common mistakes that hiring managers just cannot seem to stop making. New hiring managers make these, but even seasoned pros will get comfortable and start making these mistakes."}, {"b3e5": "Let me know if you recognize any of these or have some other mistakes to share I may not have listed."}, {"c321": "1.You eased your hiring process because the candidate was a referral from a source you trusted. This one is right at the top of the list. You’ve got a role you need to fill, a referral comes in from someone you trust who says this person would be a real good fit for the role. You trust this referral source so you decide to move quickly on the candidate. Why not? The market is hot and you don’t want to lose them."}, {"c9f7": "So you cut steps out of the interview process or even worse, you go easy on them through the interview process. You don’t apply the normally critical eye on their candidacy as you would on someone for whom have no data point."}, {"199d": "You decide not to do a reference check, your referrer is good enough for you."}, {"f052": "Six months later things haven’t worked out as well as you thought and all of a sudden you’re asking yourself why…why didn’t I spot certain things in the interview process? You were duped by the candidate being a strong referral."}, {"e8b9": "2.You didn’t over index on references. If I had a dollar for the amount of times a hiring manager decides to either circumvent this step or simply deprioritize this step I’d be a wealthy man."}, {"f6b7": "There are two types of reference checks you should be doing for every candidate:"}, {"5c7f": "Reference checks are absolutely pivotal in minimizing the risk of making the wrong hire. Learn to do them well, be dogged about making sure you can get the level of detail you need to make an informed decision."}, {"96c1": "3.You didn’t conduct a “work sample” in your interview process. I’m a big believer in using work samples or work simulation exercises in the interview process to try assist with hiring the right candidate. In Work Rules, Google’s Chief People Officer, Lazlo Block, stresses the weight that Google places on work simulations in the interview process. This may come in the form of a coding test for engineers, a piece of content a marketer may be asked to write, or an Excel test an account manager may be asked to crunch. Lazlo writes:"}, {"a360": "“The best predictor of how someone will perform in a job is a work sample test. This entails giving candidates a sample piece of work, similar to that which they would do in the job, and assessing their performance at it.”"}, {"a277": "Some examples that have worked for us include:"}, {"48c4": "Lazlo goes on to say:"}, {"4752": "“Even this can’t predict performance perfectly, since the actual performance also depends on other skills, such as how well they collaborate with others, adapt to uncertainty, and learn.”"}, {"416b": "But it helps a lot! So the golden role here is don’t rely on candidates just talking about what they can do, get them to show you."}, {"a555": "How We Use Tests to Improve Hiring ResultsThe story of how one startup uses project-based hiring to find the perfect fit every time. thinkgrowth.org"}, {"0eb2": "4.You didn’t tolerate enough pain, blinked and settled. Have you ever been in that situation where you can’t find the right person for your open requisition, and it is beginning to hurt your team and even the business? This is a tough one and it will depend on each given situation and the severity of the pain involved and the size and gravity of the opportunity cost of not making the right hire, but generally — hold out as much as possible to make the right hire."}, {"2c87": "Believe you me, you’ll be glad you did. There is nothing worse than making the wrong hire and then having to fire that person only a few short months after they’ve joined."}, {"f384": "When in doubt, don’t make the hire."}, {"75d7": "Keep the search going."}, {"dfc8": "Especially, for those of you new to making hiring decisions, if you want to learn from the collective wisdom of many many hiring managers that have made bad hiring decision, heed this advice closely."}, {"13eb": "5.You neglected candidate experience or passed the responsibility to someone else. Too often I’ve seen hiring managers’ think of candidate experience being the responsibility of reception or the recruitment team, it’s far more than that. Candidate experience is the responsibility of every single person that touches a candidate in any way. It involves every aspect of the recruiting process:"}, {"36cc": "Candidate experience and how good you are at it directly affects your acceptance rates. A bad experience or a bad Glassdoor review sends ripple effects out to talent networks. No company can afford that in this competitive recruiting environment."}, {"a205": "Think carefully about the candidate experience. Work closely with your recruitment partners to understand best practice and always try to keep this practice front of mind each and every time you host a candidate."}, {"8f90": "(Click to tweet this Image)"}, {"340c": "Was this post valuable? Click the 💚 so other people can find it."}], "content": "Stop Making These Incredibly Common Recruiting Mistakes I’ve worked in recruiting nearly 20 years and at some pretty amazing companies like LinkedIn, Microsoft, and most recently HubSpot. There are some common mistakes that hiring managers just cannot seem to stop making. New hiring managers make these, but even seasoned pros will get comfortable and start making these mistakes. Let me know if you recognize any of these or have some other mistakes to share I may not have listed. 1.You eased your hiring process because the candidate was a referral from a source you trusted. This one is right at the top of the list. You’ve got a role you need to fill, a referral comes in from someone you trust who says this person would be a real good fit for the role. You trust this referral source so you decide to move quickly on the candidate. Why not? The market is hot and you don’t want to lose them. So you cut steps out of the interview process or even worse, you go easy on them through the interview process. You don’t apply the normally critical eye on their candidacy as you would on someone for whom have no data point. You decide not to do a reference check, your referrer is good enough for you. Six months later things haven’t worked out as well as you thought and all of a sudden you’re asking yourself why…why didn’t I spot certain things in the interview process? You were duped by the candidate being a strong referral. 2.You didn’t over index on references. If I had a dollar for the amount of times a hiring manager decides to either circumvent this step or simply deprioritize this step I’d be a wealthy man. There are two types of reference checks you should be doing for every candidate: Reference checks are absolutely pivotal in minimizing the risk of making the wrong hire. Learn to do them well, be dogged about making sure you can get the level of detail you need to make an informed decision. 3.You didn’t conduct a “work sample” in your interview process. I’m a big believer in using work samples or work simulation exercises in the interview process to try assist with hiring the right candidate. In Work Rules, Google’s Chief People Officer, Lazlo Block, stresses the weight that Google places on work simulations in the interview process. This may come in the form of a coding test for engineers, a piece of content a marketer may be asked to write, or an Excel test an account manager may be asked to crunch. Lazlo writes: “The best predictor of how someone will perform in a job is a work sample test. This entails giving candidates a sample piece of work, similar to that which they would do in the job, and assessing their performance at it.” Some examples that have worked for us include: Lazlo goes on to say: “Even this can’t predict performance perfectly, since the actual performance also depends on other skills, such as how well they collaborate with others, adapt to uncertainty, and learn.” But it helps a lot! So the golden role here is don’t rely on candidates just talking about what they can do, get them to show you. How We Use Tests to Improve Hiring ResultsThe story of how one startup uses project-based hiring to find the perfect fit every time. thinkgrowth.org 4.You didn’t tolerate enough pain, blinked and settled. Have you ever been in that situation where you can’t find the right person for your open requisition, and it is beginning to hurt your team and even the business? This is a tough one and it will depend on each given situation and the severity of the pain involved and the size and gravity of the opportunity cost of not making the right hire, but generally — hold out as much as possible to make the right hire. Believe you me, you’ll be glad you did. There is nothing worse than making the wrong hire and then having to fire that person only a few short months after they’ve joined. When in doubt, don’t make the hire. Keep the search going. Especially, for those of you new to making hiring decisions, if you want to learn from the collective wisdom of many many hiring managers that have made bad hiring decision, heed this advice closely. 5.You neglected candidate experience or passed the responsibility to someone else. Too often I’ve seen hiring managers’ think of candidate experience being the responsibility of reception or the recruitment team, it’s far more than that. Candidate experience is the responsibility of every single person that touches a candidate in any way. It involves every aspect of the recruiting process: Candidate experience and how good you are at it directly affects your acceptance rates. A bad experience or a bad Glassdoor review sends ripple effects out to talent networks. No company can afford that in this competitive recruiting environment. Think carefully about the candidate experience. Work closely with your recruitment partners to understand best practice and always try to keep this practice front of mind each and every time you host a candidate. (Click to tweet this Image) Was this post valuable? Click the 💚 so other people can find it. ", "name": "927", "child": "927_1", "timestamp": "Apr 6"}