{"parent": "", "title": "The Magic Fired Rob Hennigan. Now What?", "author": "Kevin O'Connor", "sentences": [{"0d9f": "The Magic Fired Rob Hennigan. Now What?"}, {"da62": "The next GM needs clarity from ownership"}, {"43fc": "With the ousting of Magic general manager Rob Hennigan and his lead assistant, Scott Perry, Magic ownership has wiped the whiteboard clean. Matt Lloyd is taking over as interim GM and will be considered for the full-time position. But it might not matter who they hire officially, if ownership’s short-sighted quick fixes interfere with long-term goals."}, {"4191": "“We appreciate Rob’s efforts to rebuild the team, but feel we have not made any discernible improvement over the last few years specifically,” Magic CEO Alex Martins said in a statement. Firing Hennigan is an understandable decision. The team has won an average of 26.4 games since he was hired in 2012. The Tobias Harris trade is still hard to decipher. Mario Hezonja looks like a bust (though I still have hope). Elfrid Payton has not worked out yet. They’ve hired three head coaches in five years. The Magic are an idle franchise that’s neither moved forward nor backward."}, {"2f1e": "There are auxiliary factors to consider, though. As my Ringer teammate Kevin Clark pointed out, the Magic haven’t had lottery luck in loaded draft classes; if the balls bounce a different way, maybe Hennigan looks like a brilliant GM. It’s also not easy to build a team with a lack of organizational alignment. The Magic were trying to go young with the likes of Aaron Gordon and Victor Oladipo, but the youth movement was stopped last summer. They dumped youth and picks for an aging Serge Ibaka, signed Jeff Green to mope on the bench, and brought in Bismack Biyombo to awkwardly fit alongside Nikola Vucevic."}, {"a4a1": "Did Hennigan make those decisions? Sure. But they weren’t made without approval or pressure from ownership to win now. Instant gratification isn’t always rewarding, though. The Orlando Sentinel reported last year that Hennigan’s seat “couldn’t be any hotter,” which is exactly what I heard: Ownership is desperate to make the playoffs, and that played a huge role in the lateral moves they made that superficially moved them closer to the postseason, but in reality set the Magic back. Even armchair general managers who finish in last place in their fantasy leagues knew whatever the Magic did last summer wasn’t going to work, and I’m willing to bet Hennigan and his front office knew it, too."}, {"0c12": "You’ll read about potential candidates: analytics wizards like free-agent general manager Sam Hinkie or Celtics assistant GM Mike Zarren, or longtime respected executives such as Wizards senior vice president of basketball operations Tommy Sheppard and Spurs assistant GM Brian Wright. Elite basketball players rarely sign with bad teams, and neither do elite general manager candidates. They wait for a better position to open, knowing the relationship between an owner, the general manger, and the coach are the foundation of a successful team — without that, what’s the point?"}, {"93b9": "Before the Magic can make any “discernible improvement,” ownership needs to figure out what the team’s priorities really should be. Some teams try to contend and win championships, while others want to win now so they can jog on the treadmill of playoff mediocrity. Which kind of team are the Magic?"}], "content": "The Magic Fired Rob Hennigan. Now What? The next GM needs clarity from ownership With the ousting of Magic general manager Rob Hennigan and his lead assistant, Scott Perry, Magic ownership has wiped the whiteboard clean. Matt Lloyd is taking over as interim GM and will be considered for the full-time position. But it might not matter who they hire officially, if ownership’s short-sighted quick fixes interfere with long-term goals. “We appreciate Rob’s efforts to rebuild the team, but feel we have not made any discernible improvement over the last few years specifically,” Magic CEO Alex Martins said in a statement. Firing Hennigan is an understandable decision. The team has won an average of 26.4 games since he was hired in 2012. The Tobias Harris trade is still hard to decipher. Mario Hezonja looks like a bust (though I still have hope). Elfrid Payton has not worked out yet. They’ve hired three head coaches in five years. The Magic are an idle franchise that’s neither moved forward nor backward. There are auxiliary factors to consider, though. As my Ringer teammate Kevin Clark pointed out, the Magic haven’t had lottery luck in loaded draft classes; if the balls bounce a different way, maybe Hennigan looks like a brilliant GM. It’s also not easy to build a team with a lack of organizational alignment. The Magic were trying to go young with the likes of Aaron Gordon and Victor Oladipo, but the youth movement was stopped last summer. They dumped youth and picks for an aging Serge Ibaka, signed Jeff Green to mope on the bench, and brought in Bismack Biyombo to awkwardly fit alongside Nikola Vucevic. Did Hennigan make those decisions? Sure. But they weren’t made without approval or pressure from ownership to win now. Instant gratification isn’t always rewarding, though. The Orlando Sentinel reported last year that Hennigan’s seat “couldn’t be any hotter,” which is exactly what I heard: Ownership is desperate to make the playoffs, and that played a huge role in the lateral moves they made that superficially moved them closer to the postseason, but in reality set the Magic back. Even armchair general managers who finish in last place in their fantasy leagues knew whatever the Magic did last summer wasn’t going to work, and I’m willing to bet Hennigan and his front office knew it, too. You’ll read about potential candidates: analytics wizards like free-agent general manager Sam Hinkie or Celtics assistant GM Mike Zarren, or longtime respected executives such as Wizards senior vice president of basketball operations Tommy Sheppard and Spurs assistant GM Brian Wright. Elite basketball players rarely sign with bad teams, and neither do elite general manager candidates. They wait for a better position to open, knowing the relationship between an owner, the general manger, and the coach are the foundation of a successful team — without that, what’s the point? Before the Magic can make any “discernible improvement,” ownership needs to figure out what the team’s priorities really should be. Some teams try to contend and win championships, while others want to win now so they can jog on the treadmill of playoff mediocrity. Which kind of team are the Magic? ", "name": "93", "child": "93_1\t93_2\t93_3\t93_4\t93_5\t93_6\t93_7\t93_8\t93_9\t93_10\t93_11\t93_12\t93_13\t93_14\t93_15\t93_16", "timestamp": "Apr 13"}