{"parent": "", "title": "9 Useful Apps for Product Managers", "author": "Product Hunt", "sentences": [{"19d8": "9 Useful Apps for Product Managers"}, {"ebc5": "If you are a product manager, you know just how important great tools are for planning and managing your team’s progress on a daily basis. If you’re looking for applications to help make your workflow more organized and efficient, here’s a list of nine great products to try. Whether you need a better way to markup screenshots, visualize your product roadmap, or manage your team’s ideas, you’ll find something here that will help. Give one—or all nine—a try."}, {"62ee": "1. Pinpoint"}, {"0c58": "Markup screenshots on iOS."}, {"9dfa": "If you’re looking to give mobile app feedback as quickly and painlessly as possible, Pinpoint is a must-have tool. You can markup anything directly from your phone and send it off to your team with a few taps. The functionality is purposefully simple, giving you just what you need without the unnecessary bells and whistles. Highly recommended for all product managers who are working with their teams on mobile app development."}, {"7ba0": "2. ProductPlan"}, {"8f9d": "The easiest way to plan, visualize, & share your product roadmap."}, {"dc00": "There are plenty of roadmapping tools on the market, and this is definitely one worth trying. Build your team’s next roadmap in minutes using features like: drag and drop elements, flexible calendar templates (e.g. months, quarters, sprints, etc.), visual milestone dates, and unlimited lanes (for different product lines, teams, and initiatives). You can also customize your own legend, add tags to just about anything, and prioritize your roadmap using “benefit vs. cost” functionality. If you’re already using JIRA for issue and project tracking, ProductPlan integrates nicely with it."}, {"8a1e": "3. Tailor"}, {"8d39": "Stitch your conversations, websites, emails, and more on iOS."}, {"f05e": "Tailor is great if you’re working on a mobile app and need to take a screenshot of an entire page. Normally, you have to take multiple screenshots and paste them together later. This app makes the whole process easier by taking a series of overlapping screenshots you take of conversations, websites, apps, and emails on iOS and stitching them together into one complete screenshot."}, {"c96a": "4. TestFlight (iOS app)"}, {"f409": "Beta testing made simple."}, {"9acc": "TestFlight allows testers to install and beta test apps on iOS, tvOS, and watchOS devices once they receive an invitation directly from a developer. Each app can be tested by up to 25 members of your internal team, and up to 2,000 external beta users. Once beta users install the app, TestFlight will notify them each time a new build is available, along with instructions on where to focus and how to give feedback. A must-use tool if you want to beta test a new mobile app or a major mobile app update."}, {"ad8b": "5. ProductBoard"}, {"0c47": "A beautiful product management tool for lean startups."}, {"3c62": "ProductBoard is a platform built to help you centralize all of your research and use it in smarter ways to make better prioritization decisions and products. You can organize and structure your qualitative research in a way that allows you to easily find patterns in user behavior, and thus, identify the product features that matter most to your target audience. If your team is getting lost in implementation details, this tool will help you gain focus by enabling you to more clearly identify the core problems of specific customer segments. No more wasting time on building features that your users don’t really want or need."}, {"66ef": "6. User Onboard"}, {"f618": "Onboarding teardowns of popular sites/services."}, {"ec11": "We’re big believers that when building something new, it’s best to learn from some of the most successful pre-existing sites and apps so you don’t have to unnecessarily reinvent the wheel. At User Onboarding, you can find dozens of in-depth UX teardowns to see how popular web apps handle their signup experiences. This is a great resource for borrowing already-proven UX strategies if you’re looking to optimize your app’s user conversion rate quickly (and who isn’t?)."}, {"ba27": "7. ProdPad"}, {"9031": "Build product roadmaps, manage ideas, and make users happy."}, {"5d14": "This is a stellar product management tool that is designed to help you view and prioritize ideas from across your company. ProdPad’s theme-based roadmap will help your product team stay organized and focus—but it’s also built for non-product people, too. Now, anyone at your company can see which problems you’re prioritizing, which means less confusion and questioning about what your team is focusing on. You can also pull in customer feedback and link them to various ideas in your “backlog.” This is such a useful feature if you want to make a case for which features and bugs to build and fix first. This is a great roadmapping tool not just for your team, but for the entire company."}, {"61b3": "8. CloudApp"}, {"e673": "Your clipboard in the cloud."}, {"6b59": "CloudApp is a super useful tool that makes it easier to record a webcam video, take a screenshot or screen recording, add comments and annotations, and share files with your team seamlessly. No more wasting time trying to explain complex workflows or edit requests. If you’re constantly taking screenshots and sharing them with your team, this tool will help you capture, comment, and share feedback more efficiently."}, {"92a9": "9. Typeform"}, {"4507": "Generate surveys in seconds."}, {"228c": "Let’s be honest: surveys suck. It’s a pain to create them, and a pain to try and get users to complete them. Typeform makes the process not just easier but actually enjoyable (both for your team and the users you want feedback from). The form builder is simple to use, and allows you to create visually appealing and engaging questionnaires quickly and painlessly. If you need to get user feedback and want high completion rates, this tool will help you accomplish just that."}, {"d2e9": "We know being a product manager isn’t an easy gig! There are, at any given moment, dozens (if not hundreds) of moving parts to manage. We hope the tools above help make your day-to-day workflow easier."}, {"eedd": "If you’re looking for more great apps built for product managers, you can find the full collection on Product Hunt:"}, {"912a": "(P.S. Intercom published a very popular book all about product management)"}], "content": "9 Useful Apps for Product Managers If you are a product manager, you know just how important great tools are for planning and managing your team’s progress on a daily basis. If you’re looking for applications to help make your workflow more organized and efficient, here’s a list of nine great products to try. Whether you need a better way to markup screenshots, visualize your product roadmap, or manage your team’s ideas, you’ll find something here that will help. Give one—or all nine—a try. 1. Pinpoint Markup screenshots on iOS. If you’re looking to give mobile app feedback as quickly and painlessly as possible, Pinpoint is a must-have tool. You can markup anything directly from your phone and send it off to your team with a few taps. The functionality is purposefully simple, giving you just what you need without the unnecessary bells and whistles. Highly recommended for all product managers who are working with their teams on mobile app development. 2. ProductPlan The easiest way to plan, visualize, & share your product roadmap. There are plenty of roadmapping tools on the market, and this is definitely one worth trying. Build your team’s next roadmap in minutes using features like: drag and drop elements, flexible calendar templates (e.g. months, quarters, sprints, etc.), visual milestone dates, and unlimited lanes (for different product lines, teams, and initiatives). You can also customize your own legend, add tags to just about anything, and prioritize your roadmap using “benefit vs. cost” functionality. If you’re already using JIRA for issue and project tracking, ProductPlan integrates nicely with it. 3. Tailor Stitch your conversations, websites, emails, and more on iOS. Tailor is great if you’re working on a mobile app and need to take a screenshot of an entire page. Normally, you have to take multiple screenshots and paste them together later. This app makes the whole process easier by taking a series of overlapping screenshots you take of conversations, websites, apps, and emails on iOS and stitching them together into one complete screenshot. 4. TestFlight (iOS app) Beta testing made simple. TestFlight allows testers to install and beta test apps on iOS, tvOS, and watchOS devices once they receive an invitation directly from a developer. Each app can be tested by up to 25 members of your internal team, and up to 2,000 external beta users. Once beta users install the app, TestFlight will notify them each time a new build is available, along with instructions on where to focus and how to give feedback. A must-use tool if you want to beta test a new mobile app or a major mobile app update. 5. ProductBoard A beautiful product management tool for lean startups. ProductBoard is a platform built to help you centralize all of your research and use it in smarter ways to make better prioritization decisions and products. You can organize and structure your qualitative research in a way that allows you to easily find patterns in user behavior, and thus, identify the product features that matter most to your target audience. If your team is getting lost in implementation details, this tool will help you gain focus by enabling you to more clearly identify the core problems of specific customer segments. No more wasting time on building features that your users don’t really want or need. 6. User Onboard Onboarding teardowns of popular sites/services. We’re big believers that when building something new, it’s best to learn from some of the most successful pre-existing sites and apps so you don’t have to unnecessarily reinvent the wheel. At User Onboarding, you can find dozens of in-depth UX teardowns to see how popular web apps handle their signup experiences. This is a great resource for borrowing already-proven UX strategies if you’re looking to optimize your app’s user conversion rate quickly (and who isn’t?). 7. ProdPad Build product roadmaps, manage ideas, and make users happy. This is a stellar product management tool that is designed to help you view and prioritize ideas from across your company. ProdPad’s theme-based roadmap will help your product team stay organized and focus—but it’s also built for non-product people, too. Now, anyone at your company can see which problems you’re prioritizing, which means less confusion and questioning about what your team is focusing on. You can also pull in customer feedback and link them to various ideas in your “backlog.” This is such a useful feature if you want to make a case for which features and bugs to build and fix first. This is a great roadmapping tool not just for your team, but for the entire company. 8. CloudApp Your clipboard in the cloud. CloudApp is a super useful tool that makes it easier to record a webcam video, take a screenshot or screen recording, add comments and annotations, and share files with your team seamlessly. No more wasting time trying to explain complex workflows or edit requests. If you’re constantly taking screenshots and sharing them with your team, this tool will help you capture, comment, and share feedback more efficiently. 9. Typeform Generate surveys in seconds. Let’s be honest: surveys suck. It’s a pain to create them, and a pain to try and get users to complete them. Typeform makes the process not just easier but actually enjoyable (both for your team and the users you want feedback from). The form builder is simple to use, and allows you to create visually appealing and engaging questionnaires quickly and painlessly. If you need to get user feedback and want high completion rates, this tool will help you accomplish just that. We know being a product manager isn’t an easy gig! There are, at any given moment, dozens (if not hundreds) of moving parts to manage. We hope the tools above help make your day-to-day workflow easier. If you’re looking for more great apps built for product managers, you can find the full collection on Product Hunt: (P.S. Intercom published a very popular book all about product management) ", "name": "932", "child": "932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25932_1\t932_2\t932_3\t932_4\t932_5\t932_6\t932_7\t932_8\t932_9\t932_10\t932_11\t932_12\t932_13\t932_14\t932_15\t932_16\t932_17\t932_18\t932_19\t932_20\t932_21\t932_22\t932_23\t932_24\t932_25", "timestamp": "May 13, 2016"}