{"parent": "", "title": "Why your investor pitch is ruining your sales pitch", "author": "April Dunford", "sentences": [{"84c6": "Why your investor pitch is ruining your sales pitch"}, {"da0c": "One by-product of having so many early stage incubators and accelerators in the startup ecosystem is that most young founders have done a lot of pitch training very early in the life of their companies. Maybe too much. Many founders I meet have completed more than one incubator program before reaching product/market fit and well before they have significant customer traction. Having completed programs with weekly and monthly pitches complete with a handful of pitch contests, I suspect some of these founders have done 10X more investor pitches than they’ve done customer pitches. Which may be great for honing the company story for investors, not so great for perfecting a compelling story for customers."}, {"f56a": "With all of this pitch practice, it isn’t surprising that some founders start seeing their pitch contest pitch as “THE pitch” — a general-purpose sales story for any audience. But customers are very, very different and they are looking for very, very different things. In a customer pitch the starting point positioning is different, the value they are looking for is different, and the call to action is different."}, {"34c1": "1/ The Set-up: Positioning is completely different for Customers vs Investors"}, {"3305": "The setup for any pitch usually involves describing the problem space and the market you operate in. This sets up the context for the rest of the story — what value you deliver, who your potential competitors would be, your likely routes to market, and so on."}, {"37c0": "When describing what you are to an investor, founders need to position themselves within the larger context of where they will be in the future. How you will win deals today matters of course, but your investor positioning needs to show how your company could credibly win a very large market in the future. This is what makes you a great investment."}, {"3fa7": "For customers on the other hand, you need to position what you have today as uniquely valuable and better than the current set of alternatives customers might choose. Your positioning for customers will only make sense if it is grounded in their current understanding of solutions in the market."}, {"ded4": "Customers are far less interested in your plans for world domination of a much larger market or the cool features you hope to have in 5 years. In fact, talking too much about that might convince customers they would be better off not purchasing anything until this glorious future materializes. Investors love disruption but customers hate it. From a customer point of view, disruption means they purchased something that later had to be thrown away and replaced. Your disruption talk that played well with investors, could inspire fearful paralysis in prospects."}, {"9bf5": "Here’s an example. I was part of a startup that sold solutions to large retailers. Our goal was to be a platform for “omni-channel commerce”, where the lines between online and in-store shopping are invisible. Retailers found our idea compelling however, most couldn’t imagine getting there without drastic changes to existing systems that spanned organizations. No startup could hope to sell a large retailer such a complex project."}, {"0800": "We broke the problem down and started with the easiest piece, which was helping retailers provide their in-store sales associates with better product information on mobile devices. Once we were established in many big retailers, we could move toward our longer-term goal."}, {"1c2e": "Our customer positioning “A mobile solution for sales associates” was completely different from our investor positioning “An enterprise omni-channel retail platform”. Our investor positioning would have been not only confusing for customers, but potentially frightening enough to make them want to delay making a purchase altogether."}, {"55f5": "2/ Why you: Investors and customers look for different kinds of “proof”"}, {"8ef7": "Here are some things that make your company look like a good investment:"}, {"a5f7": "Here are some things that make you a good solution provider to a business customer:"}, {"5a87": "Notice the lack of overlap on these lists. If you have ever competed in a pitch contest I bet your presentation covered most of the points on the first list. I also expect the company that won the last pitch contest you went to didn’t talk about things in the second list at all."}, {"a2b9": "3/ The Ask: Selling your company vs selling a solution"}, {"d0a3": "This is the most obvious difference between a sales pitch to a customer and an investor pitch — the goals of the conversations are different and therefore what you are asking for at the end of the conversation is completely different. Yes, they are both ultimately about selling something, but the sales process for each circumstance is completely different."}, {"5eab": "If you are giving a first pitch to an investor (or pitching in front of many of them at a pitch contest), the goal is to get investors interested enough to spend more time with you to get to know you, your team, your offering and your business better. I don’t know any investors that write cheques after a first meeting. For many investor pitches, the “ask” is to have another meeting."}, {"e371": "If you are selling to businesses, the goal of the meeting can be a number of things depending on your sales process and the customer’s purchase process. Often the “ask” is for the customer to go to the next stage of the sales process — this could be anything from you sending them an invoice to starting a proof of concept or trial. With more complex sales you might be asking for an additional meeting with different stakeholders, but in general, the “ask” in B2B sales meetings is (and I’m clearly paraphrasing here) “If you aren’t ready to buy this right now, what do we need to do next?”"}, {"d5fa": "Customers hate your pitch contest pitch"}, {"713d": "One of my biggest beefs with pitch contests (and oh man, I’ve got a long list of beefs with them), is that they reward a particular kind of pitch that doesn’t work in any other circumstances. Pretend you are pitching to someone that knows absolutely nothing about your market! Condense your story down to 5 minutes! Be as theatrical as possible — own the stage! Can you imagine talking to a customer like that? They would hate you."}, {"2116": "I once attended a pitch contest where the organizers invited buyers from a particular industry to listen to and vote on pitches from startups selling solutions to that industry. Only a couple of startups realized that this audience required a very different pitch than usual and simply showed up and gave their normal pitch contest pitch. The reaction from the customers in the room alternated between complete utter confusion and abject horror as founders described the need to replace every system they had invested in in the past 5 years and how they planned on locking customers in by selling a customer’s own data back to them. Needless to say, there wasn’t a lot of business generated at this event."}, {"2518": "Don’t be that startup. Just, don’t."}, {"c10f": "Like this post? Click the ❤ button below! DO IT NOW!"}], "content": "Why your investor pitch is ruining your sales pitch One by-product of having so many early stage incubators and accelerators in the startup ecosystem is that most young founders have done a lot of pitch training very early in the life of their companies. Maybe too much. Many founders I meet have completed more than one incubator program before reaching product/market fit and well before they have significant customer traction. Having completed programs with weekly and monthly pitches complete with a handful of pitch contests, I suspect some of these founders have done 10X more investor pitches than they’ve done customer pitches. Which may be great for honing the company story for investors, not so great for perfecting a compelling story for customers. With all of this pitch practice, it isn’t surprising that some founders start seeing their pitch contest pitch as “THE pitch” — a general-purpose sales story for any audience. But customers are very, very different and they are looking for very, very different things. In a customer pitch the starting point positioning is different, the value they are looking for is different, and the call to action is different. 1/ The Set-up: Positioning is completely different for Customers vs Investors The setup for any pitch usually involves describing the problem space and the market you operate in. This sets up the context for the rest of the story — what value you deliver, who your potential competitors would be, your likely routes to market, and so on. When describing what you are to an investor, founders need to position themselves within the larger context of where they will be in the future. How you will win deals today matters of course, but your investor positioning needs to show how your company could credibly win a very large market in the future. This is what makes you a great investment. For customers on the other hand, you need to position what you have today as uniquely valuable and better than the current set of alternatives customers might choose. Your positioning for customers will only make sense if it is grounded in their current understanding of solutions in the market. Customers are far less interested in your plans for world domination of a much larger market or the cool features you hope to have in 5 years. In fact, talking too much about that might convince customers they would be better off not purchasing anything until this glorious future materializes. Investors love disruption but customers hate it. From a customer point of view, disruption means they purchased something that later had to be thrown away and replaced. Your disruption talk that played well with investors, could inspire fearful paralysis in prospects. Here’s an example. I was part of a startup that sold solutions to large retailers. Our goal was to be a platform for “omni-channel commerce”, where the lines between online and in-store shopping are invisible. Retailers found our idea compelling however, most couldn’t imagine getting there without drastic changes to existing systems that spanned organizations. No startup could hope to sell a large retailer such a complex project. We broke the problem down and started with the easiest piece, which was helping retailers provide their in-store sales associates with better product information on mobile devices. Once we were established in many big retailers, we could move toward our longer-term goal. Our customer positioning “A mobile solution for sales associates” was completely different from our investor positioning “An enterprise omni-channel retail platform”. Our investor positioning would have been not only confusing for customers, but potentially frightening enough to make them want to delay making a purchase altogether. 2/ Why you: Investors and customers look for different kinds of “proof” Here are some things that make your company look like a good investment: Here are some things that make you a good solution provider to a business customer: Notice the lack of overlap on these lists. If you have ever competed in a pitch contest I bet your presentation covered most of the points on the first list. I also expect the company that won the last pitch contest you went to didn’t talk about things in the second list at all. 3/ The Ask: Selling your company vs selling a solution This is the most obvious difference between a sales pitch to a customer and an investor pitch — the goals of the conversations are different and therefore what you are asking for at the end of the conversation is completely different. Yes, they are both ultimately about selling something, but the sales process for each circumstance is completely different. If you are giving a first pitch to an investor (or pitching in front of many of them at a pitch contest), the goal is to get investors interested enough to spend more time with you to get to know you, your team, your offering and your business better. I don’t know any investors that write cheques after a first meeting. For many investor pitches, the “ask” is to have another meeting. If you are selling to businesses, the goal of the meeting can be a number of things depending on your sales process and the customer’s purchase process. Often the “ask” is for the customer to go to the next stage of the sales process — this could be anything from you sending them an invoice to starting a proof of concept or trial. With more complex sales you might be asking for an additional meeting with different stakeholders, but in general, the “ask” in B2B sales meetings is (and I’m clearly paraphrasing here) “If you aren’t ready to buy this right now, what do we need to do next?” Customers hate your pitch contest pitch One of my biggest beefs with pitch contests (and oh man, I’ve got a long list of beefs with them), is that they reward a particular kind of pitch that doesn’t work in any other circumstances. Pretend you are pitching to someone that knows absolutely nothing about your market! Condense your story down to 5 minutes! Be as theatrical as possible — own the stage! Can you imagine talking to a customer like that? They would hate you. I once attended a pitch contest where the organizers invited buyers from a particular industry to listen to and vote on pitches from startups selling solutions to that industry. Only a couple of startups realized that this audience required a very different pitch than usual and simply showed up and gave their normal pitch contest pitch. The reaction from the customers in the room alternated between complete utter confusion and abject horror as founders described the need to replace every system they had invested in in the past 5 years and how they planned on locking customers in by selling a customer’s own data back to them. Needless to say, there wasn’t a lot of business generated at this event. Don’t be that startup. Just, don’t. Like this post? Click the ❤ button below! DO IT NOW! ", "name": "934", "child": "934_1\t934_2", "timestamp": "Apr 11"}