{"parent": "", "title": "A Beginner’s Guide to Communities for Higher Ed: Community Engagement", "author": "Salesforce", "sentences": [{"fe0a": "A Beginner’s Guide to Communities for Higher Ed: Community Engagement"}, {"f214": "By Rebecca Joffrey and Shane Sugino"}, {"55b2": "The deployment of Communities gives you a chance to pro-actively shape and direct the student experience. Yesterday I provided a diagram to help you articulate the difference between a portal and a community. Today — for those wondering, ‘what can I actually do with this technology?’ — the Slideshare below provides 10 examples of community engagement."}, {"7725": "Lesson 2. 10 Examples of Community Engagement in Higher Ed"}, {"267e": "10 Examples of Community Engagement in Higher Ed from Salesforce Foundation"}, {"0fdf": "Bluewolf is a global consulting agency obsessed with digital innovation. Named a worldwide leader in the Salesforce ecosystem by IDC Marketscape, Bluewolf’s technology-driven methodology produces measurable business outcomes now. To learn more, visitwww.bluewolf.com."}, {"3768": "About the Author"}, {"1e1b": "Rebecca Joffrey is Director of Interactive Services at the College of Agriculture and Life Sciences at Cornell University and is responsible for re-defining the way that students engage with alumni, faculty, staff, and peers in both physical and online spaces. Prior to this role, she was Director of the Career Development Office at the Tuck School of Business at Dartmouth where she led one of the first university implementations of Chatter for students. You can follow Rebecca on Twitter, “Living in the Feed” @RebeccaJoffrey."}, {"08d1": "Shane Sugino is Director of Higher Education and Non-Profits, Bluewolf"}, {"08da": "Watch how Western Governors University uses Community Cloud to build and foster community with students."}, {"38f9": "This post was originally published on the Salesforce Foundation Blog."}], "content": "A Beginner’s Guide to Communities for Higher Ed: Community Engagement By Rebecca Joffrey and Shane Sugino The deployment of Communities gives you a chance to pro-actively shape and direct the student experience. Yesterday I provided a diagram to help you articulate the difference between a portal and a community. Today — for those wondering, ‘what can I actually do with this technology?’ — the Slideshare below provides 10 examples of community engagement. Lesson 2. 10 Examples of Community Engagement in Higher Ed 10 Examples of Community Engagement in Higher Ed from Salesforce Foundation Bluewolf is a global consulting agency obsessed with digital innovation. Named a worldwide leader in the Salesforce ecosystem by IDC Marketscape, Bluewolf’s technology-driven methodology produces measurable business outcomes now. To learn more, visitwww.bluewolf.com. About the Author Rebecca Joffrey is Director of Interactive Services at the College of Agriculture and Life Sciences at Cornell University and is responsible for re-defining the way that students engage with alumni, faculty, staff, and peers in both physical and online spaces. Prior to this role, she was Director of the Career Development Office at the Tuck School of Business at Dartmouth where she led one of the first university implementations of Chatter for students. You can follow Rebecca on Twitter, “Living in the Feed” @RebeccaJoffrey. Shane Sugino is Director of Higher Education and Non-Profits, Bluewolf Watch how Western Governors University uses Community Cloud to build and foster community with students. This post was originally published on the Salesforce Foundation Blog. ", "name": "992", "child": "992_1", "timestamp": "Sep 7, 2015"}