{"parent": "", "title": "A Follow-Up on Using Highrise CRM", "author": "Boris Mann", "sentences": [{"0d6d": "A Follow-Up on Using Highrise CRM"}, {"5288": "I wrote a previous article on picking Highrise as my personal CRM. It’s been going well to keep me on track, keep track of projects, and to build a glorious pile of companies, people, and web apps that I track."}, {"2a3f": "Nathan Kontny left me a private note about their Broadcast email tool — yes, you can use Templates and Broadcast to personalize messages, but it requires you to create a ton of Custom Fields to do it, which are then attached to every single Organization and Person contact. It is a great integrated feature."}, {"ad99": "I’ve taken some notes and reflected on how I use various features, as well as listed additional bugs and feature requests."}, {"e17c": "Image from Highrise Features Page"}, {"93a0": "Do I have too many Cases?"}, {"1550": "I currently have 13 cases. There are two more I’m thinking of opening. Maybe three. Several of them only have one note or email message. There is no “cost” to having more cases, other than getting scattered and losing track (which is a very real cost!)."}, {"aa0d": "I think I like the grouping of cases for certain things, and will keep opening more of them."}, {"da41": "Having a view that shows “staleness” aside from just alphabetical or when the case was originally created would be great. And of course, with lots of cases, supporting tags for cases might make sense as well. But maybe we’re recreating folders at this point, and you really should close off stale cases, and think twice before opening a new one."}, {"7970": "Deals are for closing"}, {"a365": "I only have a couple of deals. I’m looking for some consulting projects while also exploring full-time opportunities, so I don’t think I’ll have lots open at any one time."}, {"6cda": "As opposed to cases, I think of them as things that shouldn’t stay open forever — they should be “closed” and be marked as won or lost."}, {"6e0d": "As a single user this is working well for me. I can think of some other uses for deals — maybe you are booking speakers for an event, or maybe you do enough meetings / appointments that you track them as deals."}, {"12a4": "Going Fluid"}, {"2b0e": "I’m working on another post about how many of us are working with professional, desktop operating systems. Chances are, you’re reading this on mobile or a tablet — and Medium works great for that — but “work” (or at the least, maker time) very often gets done with a full size keyboard on a desktop operating system."}, {"322a": "And then all of our apps are trapped in browser tabs, flirting with cat videos and one off lookups and searches. Apps that we’re paying for!"}, {"1ce4": "More importantly, apps that we can’t Command-Tab to, can’t be focused in."}, {"7452": "That’s a long pre-amble to say, I used Fluid to turn Highrise into a desktop “app” on my laptop."}, {"c611": "Scheduling Meetings"}, {"8ce7": "I’m currently using a combination of X.ai and Boomerang Calendar to help with scheduling meetings. Since I can send email from within Highrise, I can just cc Andrew Ingram from X.ai and he robo-arranges timing with the other person."}, {"5f9d": "I’ve used Calendly in the past, and a similar click-this-link-to-pick-a-time would work as well."}, {"8029": "( I kind of think Highrise should know about meetings. You can add tasks to your calendar, which is good. But calendaring is a deep dark shoal that many a startup has run aground on. Also timezones. And voice conferencing… 💀 )"}, {"c7f0": "Bugs and Feature Requests"}, {"6c5b": "Is it a bug? Is it a feature? You be the judge!"}, {"f1b1": "CC Autocomplete: When you’re sending email, there is no autocomplete on the CC or BCC fields. Need to look up someone’s email address? You’ll need to open a new tab and search your CRM for their email address, then cut and paste it into those fields."}, {"952f": "Markdown support for notes: I love Markdown. If I’m going to use notes, it would be great if Markdown were supported when I just need that little bit extra bit of HTML-ing."}, {"2967": "Merge to company: Sometimes, companies end up as people. Being able to select merge and say “this actually should be a company” would be great."}, {"68a8": "Trailing/leading spaces on cut and pasted email address aren’t valid and show error: OMG. This is the biggest thing. I’m still booting up my CRM with contacts, so I often find myself cut and pasting email addresses into new contacts. Very often, these end up with a space in front of or behind the email address, and the JavaScript validation throws an error. Please just trim those spaces and save the email address!"}, {"f3a8": "Custom fields that are separate for People vs. Organizations: I only have two custom fields. One for AngelList link, and one for Referred By. Both of these apply to both People and Organizations, but there are definitely People-only or Organization-only fields that I want to track. For example, for Organizations I often want to know who the Lawyer is, or what Accelerator the company went through."}, {"8194": "( And yes, those could be the People and Organization field types that I requested in my first post, but I’d settle for just text for now )"}, {"827f": "While we’re at it, you’ve got a LinkedIn field for People. Organizations also have LinkedIn pages these days."}, {"0c5c": "And then the dropdown for Website under an Organization lists “Personal” as an option. I mean, I know we’re all friendly with #Brands™ these days, but… 😜"}, {"02a7": "( yes, this is hard to get right without becoming a mass of labels and different data types and special cases )"}, {"c799": "Mobile"}, {"c3e9": "The Highrise native mobile app on iOS is barely functional. This is the case for a lot of CRM apps that I mentioned. But in day to day usage of Highrise, the experience of the mobile app almost made me give up on Highrise."}, {"d555": "Highrise for iOS icon"}, {"0e31": "I think that thinking through what the benefits of the native mobile platform are, and the context of what people use in a mobile context, would help in clarifying what features should be added to that native mobile app for a CRM like Highrise. Personally, I use both email, tasks, and other applications in triage/curation mode in the mobile context. I go in and prioritize, set tasks, add a few notes, and generally know that when I sit down in a desktop context, I can “get work done”."}, {"bd14": "I think there are some very good features that are enabled by native mobile. For instance, syncing with your contacts or reminders on your phone. These are data sources that are easier to sync when you have “local” access by having that mobile app installed, and add great usability. I can use my native contacts or my native reminders, and know that they also sync to the web (and therefore desktop) version of Highrise. Great!"}, {"12e7": "The team knows this, of course, and recently posted an interesting hack on how to create tasks using Siri / Google Now and a task dropbox. But man, native Reminder sync would be pretty awesome."}, {"c562": "I’m not going to go into a full analysis here of what the overarching use cases and context for mobile usage that would need to be done to understand what features should be in that mobile version of Highrise, but I have collected some basic feature requests and bugs."}, {"a0f3": "Mobile Feature Requests & Bugs"}, {"3ec4": "Auto-saving of notes: I’d love to take notes on meetings with people directly. But, these notes don’t auto-save, so several times I’ve switched back and forth between apps and found the notes I’ve typed but not yet hit save on to be gone."}, {"e05b": "Support for tags: you can’t add tags, you can’t search for them, you can’t view them. If tags are going to be a major way to slice and dice People and Organizations, they have to be available on mobile."}, {"e8b0": "Full view of emails: emails forwarded into Highrise are truncated in the mobile app. What do I mean by truncated? Well, your email app adds a Forwarded Message separator, and so essentially the entire forwarded message isn’t visible. Various replied-to emails also do this. Since I’m relying on Highrise to capture my important emails, it’s super frustrating to not have access to this on mobile."}, {"3960": "Files attached to notes don’t display: I was going to a meeting where I had some files that we were going to review and discuss. I attached them directly to a note so that I could access them on the app on my phone during the meeting. Nope. THAT was maddening."}, {"951a": "(I eventually got to the files by visiting the Highrise Mobile Website on my phone’s browser. It has another, completely different set of features and use cases. But you can see the full text of emails and get to file attachments)"}, {"d553": "No delete: you can’t delete contacts on mobile. No merge either, which would be another great curation task."}, {"c6f1": "( But Boris, why do you have contacts you don’t want in your CRM? Well, partly because of an overzealous Zapier / Twitter rule, Partly because sometimes Organizations end up as People )"}, {"80a8": "Building great software products for many different use cases, types of businesses, and work contexts is very hard."}, {"b6db": "Are you a Highrise hater?"}, {"6135": "I am most definitely not a hater. Building great software products for many different use cases, types of businesses, and work contexts is very hard."}, {"a4c3": "If I didn’t care, I wouldn’t write anything, I’d just switch to some other tool."}, {"61fb": "I’m trying to “talk out loud” about my usage of the tool and how I think about it, in my usage context. Think of it as a really long user story 😜"}, {"6943": "Got any Highrise tips? Or stories about an app / tool / hack that you use? I’d love to hear it."}, {"e379": "Boris Mann is a COO-for-hire that likes building products and businesses. Find out more and subscribe to his fortnightly newsletter at bmannconsulting.com."}], "content": "A Follow-Up on Using Highrise CRM I wrote a previous article on picking Highrise as my personal CRM. It’s been going well to keep me on track, keep track of projects, and to build a glorious pile of companies, people, and web apps that I track. Nathan Kontny left me a private note about their Broadcast email tool — yes, you can use Templates and Broadcast to personalize messages, but it requires you to create a ton of Custom Fields to do it, which are then attached to every single Organization and Person contact. It is a great integrated feature. I’ve taken some notes and reflected on how I use various features, as well as listed additional bugs and feature requests. Image from Highrise Features Page Do I have too many Cases? I currently have 13 cases. There are two more I’m thinking of opening. Maybe three. Several of them only have one note or email message. There is no “cost” to having more cases, other than getting scattered and losing track (which is a very real cost!). I think I like the grouping of cases for certain things, and will keep opening more of them. Having a view that shows “staleness” aside from just alphabetical or when the case was originally created would be great. And of course, with lots of cases, supporting tags for cases might make sense as well. But maybe we’re recreating folders at this point, and you really should close off stale cases, and think twice before opening a new one. Deals are for closing I only have a couple of deals. I’m looking for some consulting projects while also exploring full-time opportunities, so I don’t think I’ll have lots open at any one time. As opposed to cases, I think of them as things that shouldn’t stay open forever — they should be “closed” and be marked as won or lost. As a single user this is working well for me. I can think of some other uses for deals — maybe you are booking speakers for an event, or maybe you do enough meetings / appointments that you track them as deals. Going Fluid I’m working on another post about how many of us are working with professional, desktop operating systems. Chances are, you’re reading this on mobile or a tablet — and Medium works great for that — but “work” (or at the least, maker time) very often gets done with a full size keyboard on a desktop operating system. And then all of our apps are trapped in browser tabs, flirting with cat videos and one off lookups and searches. Apps that we’re paying for! More importantly, apps that we can’t Command-Tab to, can’t be focused in. That’s a long pre-amble to say, I used Fluid to turn Highrise into a desktop “app” on my laptop. Scheduling Meetings I’m currently using a combination of X.ai and Boomerang Calendar to help with scheduling meetings. Since I can send email from within Highrise, I can just cc Andrew Ingram from X.ai and he robo-arranges timing with the other person. I’ve used Calendly in the past, and a similar click-this-link-to-pick-a-time would work as well. ( I kind of think Highrise should know about meetings. You can add tasks to your calendar, which is good. But calendaring is a deep dark shoal that many a startup has run aground on. Also timezones. And voice conferencing… 💀 ) Bugs and Feature Requests Is it a bug? Is it a feature? You be the judge! CC Autocomplete: When you’re sending email, there is no autocomplete on the CC or BCC fields. Need to look up someone’s email address? You’ll need to open a new tab and search your CRM for their email address, then cut and paste it into those fields. Markdown support for notes: I love Markdown. If I’m going to use notes, it would be great if Markdown were supported when I just need that little bit extra bit of HTML-ing. Merge to company: Sometimes, companies end up as people. Being able to select merge and say “this actually should be a company” would be great. Trailing/leading spaces on cut and pasted email address aren’t valid and show error: OMG. This is the biggest thing. I’m still booting up my CRM with contacts, so I often find myself cut and pasting email addresses into new contacts. Very often, these end up with a space in front of or behind the email address, and the JavaScript validation throws an error. Please just trim those spaces and save the email address! Custom fields that are separate for People vs. Organizations: I only have two custom fields. One for AngelList link, and one for Referred By. Both of these apply to both People and Organizations, but there are definitely People-only or Organization-only fields that I want to track. For example, for Organizations I often want to know who the Lawyer is, or what Accelerator the company went through. ( And yes, those could be the People and Organization field types that I requested in my first post, but I’d settle for just text for now ) While we’re at it, you’ve got a LinkedIn field for People. Organizations also have LinkedIn pages these days. And then the dropdown for Website under an Organization lists “Personal” as an option. I mean, I know we’re all friendly with #Brands™ these days, but… 😜 ( yes, this is hard to get right without becoming a mass of labels and different data types and special cases ) Mobile The Highrise native mobile app on iOS is barely functional. This is the case for a lot of CRM apps that I mentioned. But in day to day usage of Highrise, the experience of the mobile app almost made me give up on Highrise. Highrise for iOS icon I think that thinking through what the benefits of the native mobile platform are, and the context of what people use in a mobile context, would help in clarifying what features should be added to that native mobile app for a CRM like Highrise. Personally, I use both email, tasks, and other applications in triage/curation mode in the mobile context. I go in and prioritize, set tasks, add a few notes, and generally know that when I sit down in a desktop context, I can “get work done”. I think there are some very good features that are enabled by native mobile. For instance, syncing with your contacts or reminders on your phone. These are data sources that are easier to sync when you have “local” access by having that mobile app installed, and add great usability. I can use my native contacts or my native reminders, and know that they also sync to the web (and therefore desktop) version of Highrise. Great! The team knows this, of course, and recently posted an interesting hack on how to create tasks using Siri / Google Now and a task dropbox. But man, native Reminder sync would be pretty awesome. I’m not going to go into a full analysis here of what the overarching use cases and context for mobile usage that would need to be done to understand what features should be in that mobile version of Highrise, but I have collected some basic feature requests and bugs. Mobile Feature Requests & Bugs Auto-saving of notes: I’d love to take notes on meetings with people directly. But, these notes don’t auto-save, so several times I’ve switched back and forth between apps and found the notes I’ve typed but not yet hit save on to be gone. Support for tags: you can’t add tags, you can’t search for them, you can’t view them. If tags are going to be a major way to slice and dice People and Organizations, they have to be available on mobile. Full view of emails: emails forwarded into Highrise are truncated in the mobile app. What do I mean by truncated? Well, your email app adds a Forwarded Message separator, and so essentially the entire forwarded message isn’t visible. Various replied-to emails also do this. Since I’m relying on Highrise to capture my important emails, it’s super frustrating to not have access to this on mobile. Files attached to notes don’t display: I was going to a meeting where I had some files that we were going to review and discuss. I attached them directly to a note so that I could access them on the app on my phone during the meeting. Nope. THAT was maddening. (I eventually got to the files by visiting the Highrise Mobile Website on my phone’s browser. It has another, completely different set of features and use cases. But you can see the full text of emails and get to file attachments) No delete: you can’t delete contacts on mobile. No merge either, which would be another great curation task. ( But Boris, why do you have contacts you don’t want in your CRM? Well, partly because of an overzealous Zapier / Twitter rule, Partly because sometimes Organizations end up as People ) Building great software products for many different use cases, types of businesses, and work contexts is very hard. Are you a Highrise hater? I am most definitely not a hater. Building great software products for many different use cases, types of businesses, and work contexts is very hard. If I didn’t care, I wouldn’t write anything, I’d just switch to some other tool. I’m trying to “talk out loud” about my usage of the tool and how I think about it, in my usage context. Think of it as a really long user story 😜 Got any Highrise tips? Or stories about an app / tool / hack that you use? I’d love to hear it. Boris Mann is a COO-for-hire that likes building products and businesses. Find out more and subscribe to his fortnightly newsletter at bmannconsulting.com. ", "name": "998", "child": "998_1\t998_2998_1\t998_2998_1\t998_2998_1\t998_2998_1\t998_2", "timestamp": "Jun 28, 2016"}