{"title": "", "name": "2087_6", "id": "aca9fe555100", "creatorid": "ae4e4e4b5573", "timestamp": 1491031958674, "child": "", "content": "Coach, you gotta get Simmons to authorize you for an early bird flight out of Brownsburg International to Greater Phoenix for the games tomorrow & Monday. You could gain entry THE REGULAR WAY, as a Coach of the People. Turns out there’s a few unintended consequences involved with presenting the FF games inside a Zeppelin museum that dwarfs Tempe Stadium. Among those? There are huge swaths of seats that are so far out from the court that a patron who tries to throw something at a ref would be exposed to dealing with three geographically contiguous yet legally distinct municipal jurisdictions. If you go to circumnavigate the concourse, be sure to have your identification documents in order because there are at least two sections where you’re liable to detention by ICE agents acting under the authority of Sheriff Joe Arpaio. Looking out onto the north expossure, you can’t quite make out Senator McCain’s cliff-side estate in Sonora, but you can make out livestock stables on his southern ranch. What I’m trying to say here is that there’s lots of tickets that are going begging. The ticket hawkers are taking a real photon shower. And if this year’s experience of playing in a venue larger than a constitutionally-significant number of Congressional electoral districts doesn’t stop the trend, I’m hearing and reading serious speculation about Grand Canyon hosting the next Az FF, and I don’t mean the arena of the university of that name. They’ll set up some parquet, band seating and media pods right at the bottom alongside the Colorado River parquet, bolt chairs along the trails all the way up to the plateau, some 6 hours walking distance away, and sell temporary loge seating along the crest. Capacity? Depending on how much of the perchable surface they’ll have to dedicate to concession booths and restrooms, I’d estimate somewhere in the low millions. As it is, the players are going to need golf course flags or windsocks for a decent chance at making three pointers, and there’s going to be both a weird sonic delay like when you’re talking with your aunt in Sante Fe via Skype, plus the crowd reaction from some big plays won’t hit the players until the next commercial time out. Fluid replacement from rapid wind-aided evaporation will be an issue. ", "username": "labdancer", "parent": "2087"}