{"title": "", "name": "2087_3", "id": "6c71fc6465a6", "creatorid": "ae4e4e4b5573", "timestamp": 1490977362859, "child": "", "content": "I think Coach T is being prudent in raising a possible “Spike Albrecht Conundrum” Effect Syndrome Phenomenon. A lot of folks don’t tend to remember, and many people are inclined to forget, that the said Spike — DESPITE hailing from an Indiana town that, according to Wikipedia, was on named “Crown Point” because it’s located on one figurative ‘point’ of a geological prominence, yet somehow still nicknamed “the hub of the country” because retired, unemployed or unemployable local wits nicknaming things by some hack descriptive when it’s entirely unnecessary because the originally givenname is inherently sufficiently descriptive, or because the thing is already inherently described by a nickname, is, to paraphrase Winston Churchill, ‘a meme wrapped up in a cliche, hidden in a puzzle, duck-taped to a hackney & left ot twist in the wind; but perhaps there are three in the key, that key being the central northern European continental diaspora out of the mid-1800s’ German Revolution, or if not that, then one of the Tulip Bubbles out of Holland or Flanders’. The point here is Albrecht was so over-rated, his own coaches, including first the ineffable Buehler (or Beeline, or Byleen, or WTF that guy’s name is), then next one Matthew Painter, official custodian of the Ghost of Gene Keady, all overrated him. It’s why every professional sport suffers from a surfeit of characters named “Spike”, “Buster”, “Stretch”, “Lefty”, etc., because the very first thing that new general managers of professional sportsball teams learn is that the absurdly rich hobbyists who tend to own professional sportsball franchises are convinced that athletes who bear those names somehow ‘earned’ them (again, despite the clear evidence of Crown Point, Indiana, having already received a perfectly descriptive nickname in its actual name, then somehow acquiring a boring and uttely superfluous nickname as “the hub of the country”). Also, people, even folks, or the public more generally, need to understand that just because Luke Maye was born in Hunterville NC does not mean he comes from an iconic hunter-eyed background or some famous hunting area (It actually doesn’t; it was named for some completely non-hunting member of a totally non-hunting local family.), anymore than being from Brownsburg Indiana means the town was founded in bucolic valley carved out by a discolored ice formation. Coach, on a serious note, re: the Duquesne Fiasco and all: thank you for your service, and I know I speak for myself and your other fan(s) and reader(s) in saying we’re all/both looking forward to your ex post mort’em. ", "username": "labdancer", "parent": "2087"}