{"title": "", "name": "2227_6", "id": "eb4ee3275b12", "creatorid": "6730b52dd4ac", "timestamp": 1492192569758, "child": "", "content": "WOOF. Huge whiff on your assumption that Rey is Luke’s daughter. You gotta do a better job keeping up with the other aspects of the new canon if you want to state such a thing so matter-of-factly. Kylo Ren (“Ben Solo”) is 10 years older than Rey, as established in the new canonical novels. He was raised under the pretense he was an Organa-Solo, as Luke/Han/Leia were keeping Leia’s true parentage a secret. Ben Solo finds out the truth when he is about 10 or 11 years old, which is when Leia sends him to be trained as a Jedi by Luke….aside from the logistical difficulties of inserting an entire romantic-relationship arc for Luke into the story, this romantic involvement would also have to take place at a time that still-dedicated Jedi (and therefore celibate and devoid of attachment) Luke was busy refounding the Jedi Order and training his 10 year old nephew in the Force….at this point it seems incredibly unlikely that Rey is a Skywalker or a Solo. As for Luke’s last line in the trailer “ It’s time for the Jedi to end” — this corroborates another speculation that has been well-alluded to throughout the new canon: that after failing with his New Order, Luke sought out the first Jedi temple and has been busy trying to uncover the secrets of the Jedi Order’s origins and past. What he has discovered is how the Order “lost its way” or “failed in its original purpose” over the course of the milennia, including becoming too dogmatic. This is why he says that line. It’s also why in the trailer he asks Rey “What do you see?” and she says “light…darkness..the balance”…this concept of the “balance” or the “grey Force” has been alluded to throughout the new canon and is how Luke will train Rey in the Force. Luke will train Rey in a wider perspective of the Force that is in more accordance with its origins than the dogmatic interpretation of the later Jedi Order. ", "username": "danmclain", "parent": "2227"}