{"title": "", "name": "2332_13", "id": "dd741a933d95", "creatorid": "1986898e95a", "timestamp": 1479444971413, "child": "", "content": "“Typography may not seem like a crucial design element, but it is.” On the contrary, typography is the most important element. Everything is type, every button, every item that we respond to. So it’s even more annoying that designers reduce contrast not only by picking the wrong colours, but also by choosing the thinnest type possible. I’ve been fighting against both trends for a long time. In most cases it is a folly of youth. Young, inexperienced designers want things to look cool. They don’t use whatever site they design, they just look at it on a hi-res monitor at 400%. The font on Medium could also do with a bit more heft, but then the pages wouldn’t look so precious. The type on my own site (which hasn’t been updated for years) isn’t light grey, but the background is. This reduces contrast and introduces white as a colour, not just a background. I’ve had designers call me on this, telling me how old-fashioned it looks. But my aim is not to be cool or appear younger than I am (70 next year) but to make reading easy. After 500 years of designing books, we do know what works. Just because screens aren’t made of paper doesn’t mean we couldn’t learn from the old guys. My letterpress studio in Berlin (www.p98a.com) is going back to printing books on old presses, using digitally generated plates (computer-to-plate: polymer without the negative film stage in between). So we get the best of both worlds: digital typography with all its choices and analog printing with real inks on real paper. Not nostalgia, but a boon to readers. My hope is that these young designers will grow out of their narcissistic phase and into responsible people who care more about their clients than their peers. Mind you, they’ll have to learn their craft first. ", "username": "espiekermann", "parent": "2332"}