{"title": "", "name": "2345_8", "id": "5d11c24542de", "creatorid": "9057a9c54038", "timestamp": 1489947760819, "child": "", "content": "Interesting article. I have known all of my life that I was playing mental chess with people. I would study them and observe their demeanor and their vocabulary and then decide if I wanted to interact with them. As a introvert you learn a skill that will save you a lot of time and heart aches with people. I always called it life101 the act of observation. I took the Myers Briggs certification class last year and what was funny was I started talking to the instructor on the breaks and he was impressed with what I knew about myself. From years of self observation. One of the exercise he had us do was writing out our type and line up with everyone that was our type. Now before this exercise I had already mentioned to him that every time something went down and it involved others I always felt alone in my thinking. As it turned out yes I am a thinking type and with that exercise I was standing alone. Again he looked at me and shook his head and said I can’t believe you know yourself that well. I have been studying myself since I was about eight years old. I study others and I love to people watch. It’s something about the facial expressions that can tell you a lot about a person. Also when you see others who are extrovert it opens one up to learning from them. Their loud conversations and how they need that interaction with others to feel good about themselves. Not to say this is right or wrong but people are who they are. Now I love extroverts their energy and their conversations are interesting. They are the ones who have kick ass parties and they know so many people it’s amazing. They are great people to know. They are the ones who mingle among everyone there is a saying (I have yet to meet a stranger I’m sure that was quoted by a extrovert). Introvert or extrovert it’s always a pleasure to meet you and learn something from you. Everyone we meet has something very unique to share with us. ", "username": "mackjohnson", "parent": "2345"}