{"title": "", "name": "2359_3", "id": "a95279e33727", "creatorid": "77b53a0587d8", "timestamp": 1488660511859, "child": "", "content": "When crafting the Declaration, Jefferson borrowed heavily from the ideas of John Locke, who had expressed these rights as life, liberty, and property. Perhaps the change from property to happiness was an acknowledgment that the drive to acquire stuff is not a healthy goal and can adversely impact one’s life and liberty. It could also stem back to the founders’ puritan roots and their belief in the importance of the spiritual, rather than worldly objects. With these inalienable rights endowed by their creator, it supports the idea that the true happiness lays in the realm of that creator. Since it is a guarantee of the pursuit rather than the achievement of happiness, maybe the point was the journey and not the goal. Maybe it is encouraging us to find happiness within the struggle itself, to become content with what is and what we have in the here and now. Don’t forget they also wrote those words for the nation’s future citizens a year into the Revolutionary War. Many of the Americans who would read them were needed as recruits in that fight. Many that did fight would later die to forge the new nation that the Declaration proclaimed. It was the promise for a chance at living autonomously, with control over their own lives and destinies, rather than under tyrannical rule. It was a call to arms to unify a disparate group of citizens to fight together for something greater than themselves. Sorry if that’s going a bit deep for a response to a post about how managers can make their workers more productive. Frankly, I think the founders would see corporations as a threat to democracy. IMHO, I don’t think they would enjoy people using their ideas to find ways to better exploit people by squeezing out every last drop of productivity possible, finding ways to get one person to do the job of multiple people, until they can automate whatever that job is and get rid of those workers entirely. ", "username": "77andaSkosh", "parent": "2359"}