{"username": "CHerrrero1971", "timestamp": 1490221109155, "creatorid": "e473d49e8cce", "id": "5e831fc33265", "child": "", "content": "Dear Mark, my comment is not aimed at anyone, but rgarding the ecosystem. I agree with Bradfeld tht the driver centre of a startup ecosystem should be the entrepreneur. I agree because without entrepreneurs there would not be the various asset classes, VC’s, today contribute less than angels, micro-Vc’s, late stage players due to companies not going public that much, and staying private , so you have new late stage players, hedge funds, nutual funds. Well What an I tell you that you don’t know much better than me.ºNow I recenetly reviwed a talk by Scot Sandell Co-managing Partner of NEA, who was on the BOD and lead investor in the startup I worked for nearly 5 years until investor fatigue kicked in. He was at the time of the key note President of the NVCA and was explaig that VC is a long term proposition, in the case of NEA they had 10 years plus 3 1 year extensions. HE was trying to say that this ecosystem required Patient capital and Patient founders. He then, talked about metrics, he clarified that the data was not exact but quite close. He said in the US there are about 6000 people that were Venture Capitalist, and would invest in 2016 he said about $29Bn. With returns coming over times. He said more or less 1200 get funded, about 70–80 had great exits, less IPO’s and more M&A or acquisition. about 5–6%. The rest some would give positive returns but not the required IRR to return the Capital to the LP’s. BUt he said if you really peal down the data a lot more, it was eally 10 companies that really bought in extremely high returns or lets say 1%. And these were done by 100–200 VC’s 3% of the 6000. Now why is there only talk about startup, entrepreneurs failing, when some acountability IMHO should also go to the VC’s picking the investments. How the 5800 or 5000 VC still managed to keep their jobs is another story. Can you shed some light and share your opinion. Because when I was talking to investors in Europe (I was MD od the ROW) it was always, we add value, we help you, but I think expectations ar emisaligned. For example in a $4000mn Fund with 4 partners each investing $100mn maybe the sponsor of the startup, was making bad investvents, and in follow up rounds when voting for follow on funds, his partners had lost faith in his track record, who was affected the startup. Food or thought ", "title": "", "name": "2410_2", "parent": "2410"}