{"content": "Wow. Reading this brought to mind a situation my roommate had to go through himself… I’ll try to keep this as concise as possible but almost all of the red flags were there. He got hired by one of the higher level managers of the company in question, who apparently had a carte blanche for putting together his own team. In light of this he also brought in one of his own friends to join the same team, who also got hired rather quickly without any follow-up interviews or any involvement other than the single manager and one HR employee (who probably didn’t know better either). During this process he was promised bonuses like new iPads for private use, it was the time when those were the New Thing Around after all. There was talk about private jets and business trips overseas and well, it was all literally ‘too good to be true’. Of course, pretty soon after the problems started when the first paycheck was late. It eventually resolved two weeks overdue, but it spurred him to start covering his ass by assembling a dossier with every single scrap of paper, email and screenshots he could collect. This turned out to be his life-saver. The following paycheck was also late, and we had to cover that one out of our collected savings. When the third month didn’t even seem to be coming at all he started pushing for clear answers and proof of payment when his manager said he had wired the money. In The Netherlands, unfortunately, you can make a wire-transfer via the bank webpage -and show you doing so via skype as an act of good faith- and immediately call the bank to make the claim you accidentally used the wrong account and have it cancelled anyway. We assume this is what happened because my roommate saw him wire the money (recording it from his side) and it never arrived. Eventually, despite the man’s insistence it was allright and he needn’t worry or get in touch with other members of the company leadership (also a funny thing to say) my roommate cornered the CEO of the company itself… and here’s the kicker. The good man had absolutely NO idea that multiple employees had been hired by this manager, that wages had to be paid or that anything was up at all. He’d been acting behind his back and that of the CFO and HR management to just get people to supply work and then, probably, just sink them off without there being proof of their legal employment. That week a few things happened. Every single person whom this manager had hired had a sit-down with the CEO and the HR manager and had a quick job review. Every single one of them, including my roommate, had a new contract offered and got signed on properly and permanently. Everyone got their wages within a day afterwards, including a bonus to cover any fees for late bills and because of his initiative my roommate got made Team Lead for the entire crew. The manager in question got his arse fired, of course. Ok, it seems that this got away from me a little even though I promised to make it short, but the point I was wanting to make is that if you take Penny’s story and the given red flags to heart and reckognise them on time, you have a fair chance of being able to take appropriate steps or cut your losses before things get too bad for you. And to Penny, I am happy at least that you could get your old apparment back, and hope you, your cat and boyfriend (if I read that right) get to see that career in Sillicon Valley someday. ", "title": "", "name": "2441_11", "creatorid": "fc68565efa4f", "id": "61e6e8ef5582", "username": "Taross", "timestamp": 1472458734376, "parent": "2441", "child": ""}