{"content": "Assalaamu alaikum wa rahmat Ullahi wa barakaatoh Firstly, it seems it was an unfortunate and an unforeseen event that the sisters were moved and had to sit in the corridors. Hopefully in the future the women are seated better and thus prevented from having to sit in awkward places. Having said this, I disagree with many points you have raised. Unfortunately, I do not agree that you were moved because the men thought the seeking of knowledge or spirituality is more important for men and less important for women nor that it is humiliating. The shariah is not humiliating. I think the three of you were asked to move due to shari’ reasons. I will expand. By the shari’ah, a woman and a man are not permitted to look at one another if there is no necessity. So in reality, there is no need to see Habib. And there is no need for the men and the Habaib to see women in the gathering. This is not because we are less than men, or their knowledge is more important, this is just the law. If a woman wished to sit in the same gathering as the men, then really the correct adaab should be followed. The women should be wearing hijab appropriately and hold herself in the correct demeanour. Unfortunately nowadays many women do not do this. I’m aware of people taking photos of the habaib and placing them on Facebook and commenting how handsome they are, this is so inappropriate. Women beautify themselves with makeup and sit there and expect not to be seen but to see? It just doesn’t make sense. The beloved daughter of our Rasul ﷺ had so much haya, that she even had concern that when she was buried and she was shrouded, people would be able to see her figure and she asked those around her to shroud her with extra sheets. This is the Rasul ﷺ daughter. To have this haya does not make us less than men, does not mean we are not privileged as men. So I really have to disagree with you on the point of a “fourth sister”, it goes against our law. There is fitna there, especially if you are saying men were looking, then how is this appropriate for us to be the “fourth sister”? I really believe we have lost this haya as women, and we have become fixated on feminism, our rights are within the religion. We have been given our rights. So let’s look at the fiqh of the matter. Let’s not get emotional about it. I do agree that it is different when we are placed in another hall than to the men, but I’d rather that then sit with the men and have Habib send someone over to tell us to move. And I would rather that than go against the teachings of Islam. It’s quite sad to read that you were asked to move by the habib and you did not. Let’s not have an opinion on a matter before we look to what the law on the matter is. Please feel free to open this up to a discussion, I can pass on my email if you wish to keep it private. -I think I may need to clarify. I do not have a problem with the need of more appropriate seating and more consideration from the organisers. My problem is with the author of this article compromising her obedience to Allah and sitting in a room full of men with men looking at her and asking others to follow, this is clearly against the shariah. So the problem is that women are not being seated appropriately and we need a solution to this. The solution is not being the “fourth sister”. -You will have to ask the organisers this as I do not know. I cant imagine it was because the women were an inconvenience, I can only assume it was poor organisation and they were unable to move the brothers once the prayer was completed. I have focused on haya as I think it is very relevant. I’m not sure I have said that sitting in the basement is acceptable, however, if it is between sitting in the hall with the men when there is fitna and having the habib asked you to move then I would look the the law and follow what is obligated upon me. I do agree it is an issue that women are placed elsewhere, ideally it would be great if women were sat in the same hall with a barrier. My main issue is that we forget about the fiqh and the shariah. Lets not become fixated on what men would do and how men would feel. Lets firstly be fixated on what Allah has commanded and follow that and then we can quite happily raise our concerns and perhaps the organisers will take heed and provide appropriate seating for the women. First and foremost, ensuring it is appropriate in the shariah and then secondly ensuring it is appropriate for the women needs and comfort. Lastly, I do not really understand what you mean about bravery. I think we can quite openly say hey excuse me we dont really like sitting in the basement or in a cupboard. I dont think we are being subdued or anything of the like. Go ahead and tell the organisers this. Whether they listen or not is up to them, I would like to have good opinion and hope they would. And if they don’t, it is probably due to their lack of organisation, lets not jump to conclusions and start assuming that it is because they think we are less than them. ", "title": "", "name": "2453_3", "creatorid": "9ebeff902b60", "id": "b4cb4ae27729", "username": "mamjad", "timestamp": 1492522373384, "parent": "2453", "child": ""}