{"parent": "2459", "content": "This was great. I’m a 35yo middle class white guy from SoCal, an amateur novelist who went to a decent east coast school and thought Wallace was a god and recommended his essays widely. I don’t know for certain that I pretended to have read Infinite Jest but it’s certainly a safe assumption. I finally did read it when I was in my late twenties and quitting drinking. Wallace had hanged himself by then, and I was very confused about why he’d been such a god of mine — and by “confused” I mostly mean embarrassed by the extent to which I’d been hypnotized by, and let’s be honest emulating, his performance of tortured genius. And Infinite Jest helped me reconcile myself to getting sober, and it helped pass a lot of otherwise empty and excruciating hours (I’m also guilty of reading Pynchon’s Against the Day in this time period), but mostly it helped me realize that he actually was a depressed genius, and that he wasn’t just performing it for kicks. Or that his performance of it wasn’t ironic. Or that it was, but that it was also true. But, yeah, I have to agree with you, Wallace demonstrating over and over and over again that he was deeply aware that men are shit and life is a bitch is kind of the extent of what he was capable of. Unlike the victims of that shittiness, who are forced to “learn” and “grow” in order to make sense of the world and what happened to them and to not be victimized again, shitty men don’t have to do shit after being shitty (see also: POTUS). A lot of men who have a modicum of self-awareness know that they should act differently than they do, and they think that self-awareness is not just, as you put it, “the best anyone could expect from them,” but is actually enough to exculpate their once and future wrongdoings. So yeah, their recommending Wallace to you was a way of saying, “look, I get it, men are shit — but I get it, which means I’m not shit. So let’s fuck or at least love me, k?” This is why the “new sincerity” that people like to say Wallace “called for” in his that early ’90s essay “E Unibus [Whatever]” is doomed to fail; white guys at the end of the 20th and beginning of the 21st century like to think that their epiphanies about what shit they are are interesting. But you’re right, it’s just self-indulgent crap. People’s neuroses in general are boring, unless and until they lead to some greater understanding, which in turn leads to some kind of change in behavior. Nice Millennial prep school bros would bristle at this comparison, but Wallace isn’t that different from Bukowski, whose characters were the ultimate scumbags and who, himself, purported to be unable to change. The macho Hemingways before that demonstrated — some on purpose, some through their life failures — the tragedy of machismo. But to think that saying “I understand” is enough is ridiculous and immature. Maybe that’s what bothers me the most about looking back on my love of Wallace — it seems too teenage-angsty. Like that whole bit about figs in The Bell Jar — fucking just get over it, right? And maybe it’s because I’m on the other side now — of a lot of things, of being a 23-, 25-, 29-year-old teenager, of being in love with Wallace and Plath, of thinking my own neuroses are the most important problems in the universe and how they affect me the most tragic — that it’s with a little bit of scorn that I see the stuff I used to love. I mean, I know depression is no respecter of class or color, but look at the differences between the novels you mention: The Bell Jar and Infinite Jest on one side, Beloved and The Color Purple on the other. Look at the problems there, and the choices the characters have to make. Is it not part of the tragedy of American culture that the former are so much more widely read and discussed than the latter, which are often relegated to a modified subcategory of literature? A more-generous me will probably look back on all this in a few years with compassion for Wallace and how hard it must have been for him to do that “unimaginably hard” thing that is live the examined/self-aware life but find yourself utterly incapable of changing it. Which is where I think he departs from so many of his bro-y fans, who, like most “well-intentioned” people, have no real intention of changing and want credit just for realizing what to the rest of the world are banal and fundamental facts of existence. Anyway, hell if I know why I wanted to write this much in response to your essay. Except that it was super thoughtful and really put form to stuff I’ve just had vague thoughts and impressions about for a long time. So, thanks. And bravo. ", "title": "", "id": "e746246a8b6f", "name": "2459_3", "username": "ian_prichard", "timestamp": 1492467136741, "creatorid": "268e309c279e", "child": ""}