{"parent": "2459", "content": "Your point that women don’t recommend books by female authors is an interesting one, because I often wish I would get recommendations for female authors that reached the exhortative levels I got to in my first year after reading Consider the Lobster and A Supposedly Fun Thing I’ll Never Do Again (I’ve calmed down since, especially when I realized that fervent evangelism is the worst possible way of recommending a writer known for skepticism and irony). Like, just this last year, I finally opened The Handmaid’s Tale after years of telling myself I would do my cultural homework by reading this book — and it was amazing! Why the hell weren’t people hurling copies of this book at my head the second I expressed some enjoyment of 1984? Or take Virginia Woolf — I read To The Lighthouse in college and loved it, and moved on to…nothing else by her! How come people seem okay with this? How can I be able to go into society, and every third sentence I hear is not “Have you started Mrs. Dalloway yet?” Maybe it’s a product of the different behavioral expectations society has for men and women — like, the same unspoken social structures that make everyone assume that the guy should ask the girl out make guys more likely to be overbearing when recommending books, and cause women to be more likely to withhold their opinion. I don’t know, and I’m not even sure how true this is — the recommendations I can remember receiving have about a 50/50 gender split on the recommendations (though the authorship tends to skew male). All I know is, I’d rather live in a world where I get regular strident, insistent recommendations for books I wouldn’t otherwise consider than a world where everyone sits politely inside their own cloisters of personal taste, sheltering the world from the sight of their cultural preferences. ", "title": "", "id": "452d1cd870e6", "name": "2459_5", "username": "wykstrad", "timestamp": 1492471905753, "creatorid": "5278cf2c055f", "child": ""}