{"parent": "2462", "content": "Yes, well … I live in the southern hemisphere — and grew up with the Mercator Projection in every atlas I ever looked at — the image of a huge Greenland dwarfing my own continent of Australia — (while in reality not even one-third the size of Australia) and of a vast and overarching Asia with an Africa in turn dwarfed by that distorted image of Asia. You show an interesting version of the Mercator Projection which I never ever saw — in fact this is the first time to see it. What’s interesting is that it shows Antarctica. The Mercator always finished below Australia in the Southern Ocean showing nothing of that region — or at the very least maybe a hint — below South America’s southern tip. So in the early 1980s when I first became aware of the Peter’s Projection (I never saw the name Gall- attached) I bought some copies and attached them to my classroom walls and used them well (I thought) to explain to my secondary school students the flaws and distortions of the Mercator (sans Antarctica) adding a sense of enhanced size and therefore dominance to certain northern hemisphere continents and parts — while diminishing the physical size in relation to the other parts of others — our own southern regions — southern Africa and Southern South America, too, included. To reduce the African continent appears to explain to me why many people/commentators reduce references to the continent to simply that name — Africa — ignoring the many many countries and cultures and landscapes and climatic zones which make it up. I taught nearly two decades in Japan, too, and in my university classroom I had that map on the wall. Interestingly — the Japanese did not use the Mercator Projection — they used another projection which unfolded as a kind of Globe version stretched straight — not too far wide of the mark in terms of real comparison of size — so it seemed to me that my students there were not so much in need of the corrective as in much of the rest of “the West”! Don’t defend the Mercator — except in its earliest historical manifestation — because it is long past its used-by date nowadays. ", "title": "", "id": "e2faf175415f", "name": "2462_5", "username": "shoin", "timestamp": 1492386810920, "creatorid": "99e92969c5e2", "child": ""}