{"parent": "2488", "content": "1,044 New Energy and Energy related Technologies that the World Economic Forum doesn’t know about. That’s what this One Tiny Cambodian Startup has. From Generators to Batteries to Electric car powering systems to wave and water and hydro and fuel cell and distributed energy generation techs to technology that can help power the International Space station and satellites. This tiny Cambodian startup just emailed the WEF asking for tickets and to pitch and to meet the stakeholders. Will there be any response? Will there be any support? Or just fly in-fly out and just more talk? WEF travels to Phnom Penh May 10 for their event and seemingly no one from the 3 failed Private Equity companies to a number of government departments nor the listing department at the Cambodia Stock Exchange even knows about it. This tiny startup is not only breaking the molds but they’re breaking the chains. They just walked into the Child Welfare Ministry and got approval to power all the Orphanages in the country with clean energy. World bank doesn’t even have solar panels on their roof in climate change devastated Cambodia when they just cut another controversial check to the government for 130 Million dollars and this money helps projects continue where landowners rights and property have been stolen. When does the talking become real meaningful support and change into investment in the sme and particularly startup and small private innovators sector where Thousands of breakthroughs are ready for commercialization? The whole world of peoples asks when will WEF and WB and the establishments support them? If you want the answer to come and are willing to invest in it to make it happen, contact this tiny Cambodian startup, who aims to change it all. They Startup with the underdog cambodians and their poor and ignored little orphans, and those very empty world bank and child welfare building and orphanage rooftops. Amen. Aomegaenergy at outlook dot com ", "title": "", "id": "f13a1635e8b6", "name": "2488_2", "username": "aomegaenergy", "timestamp": 1492413229446, "creatorid": "17b946ed4ee8", "child": ""}