{"parent": "2529", "content": "Bitcoin network has been running with FULL blocks for over 1 year Factually incorrect. We’re only been running up against the limit in recent months. A year ago we were still at 600kb-700kb average block size. https://data.bitcoinity.org/bitcoin/blocksize/2y?r=week&t=l Even if SegWit after activation can slightly scale up block size with new transaction formats SegWit more than doubles the block size. How can a 2x increase be called “slight” with a straight face? Second-tier networks such as Lightning Network (which relies on SegWit) cannot be considered as a block scaling solution. They are not a “block scaling” solution, but they’re definitely a transaction capacity solution — one that has much better properties than scaling with on-chain transactions. most Bitcoin use scenarios are not applicable with Lightning Network Not only that nearly all Bitcoin payments use scenarios used today on the network are applicable with the Lightning Network (except for complex script conditions and paying to offline recipients), it even adds new ones that were impossible until today: use cases that require instant confirmations, micro- and nano- payments, HFT, and more. LN will also lead to big payment “centers” LN is being built around decentralized payment routing and has no concept of “hubs”. This means SegWit is irrevocable once it’s activated, … This is true of all protocol upgrades: undoing them is an hard-fork. Bitcoin Unlimited could not easily be rolled back either. … or all unspent transactions in SegWit formats will face the risk of being stolen. This is true of every OP_NOP-based protocol upgrades we did to date, including P2SH, CLTV and CSV. They worked out fine. However, from the current transaction data, the average effective block size will be less than 2MB even if all transactions upgrade to SegWit. Factually incorrect. According to a research done by Bitfury back in November 2016, SegWit would provide an effective block size of 2.1MB. It’s probably even higher since. https://www.weusecoins.com/eli-segwit/ But Core put a blame on the way people are using Bitcoin. They tried some strange parameter settings to force users to cut down complexity of Bitcoin transactions. But it’s a wrong way to fix a not even existing problem. Core didn’t put a blame on anyone, they simply acknowledged the fact that creating new UTXOs puts more burden on the network than spending existing ones, and aligned the cost-incentives to ensure the UTXO set size stays in check. This isn’t a matter of opinion; the UTXO set is undeniably the most problematic part of scaling bitcoin, as it cannot be pruned and must be held in quickly accessible storage area. SegWit will deepen Core’s impact on the community By abusing their previous influence, they’ve obstructed Bitcoin block size increase from happening, against the will of the community. Core team has in some cases explicitly, supported censorship of Bitcoin’s mainstream forums, along with banning of many prominent developers, businesses, and community members Conspiracy garbage nonsense. Today, Bitcoin is in urgent need of diversified dev teams and implementations to achieve decentralization in Bitcoin development. Bitcoin already has many different consensus-compatible implementations: core, libbitcoin, bitcoinj, bcoin, btcd, knots, bitcore, haskoin, toshi, nbitcoin, pynode, and probably more that I forgot. ", "title": "", "id": "6b8d5d5b9034", "name": "2529_24", "username": "shesek", "timestamp": 1492620132365, "creatorid": "276c6460d8c0", "child": ""}