{"parent": "2529", "content": "“SegWit doesn’t solve the most urgent capacity issue” Segwit+LN does solve the scaling issue faster than any HF because no HF solutions are well tested and ready and a viable one the community can get behind won’t be ready for years. “ running with FULL blocks for over 1 year” unfortunately this isn’t the case either. Antpool likes to mine empty blocks occasionally. Why? “ it’s still far behind the demand for the development of Bitcoin network.” Even 8–16Mb blocks are far behind what is needed, which is why we need LN ASAP. “ LN will also lead to big payment “centers”” Complete Lie. “ This means SegWit is irrevocable once it’s activated, or all unspent transactions in SegWit formats will face the risk of being stolen.” False. “ less than 2MB even if all transactions upgrade to SegWit.” 1.7–2.3MB average in reality. “ This will make it even tougher to increase block size in the future.” False. Future HF can change the weight allocation to anything desired and the discussed numbers here are also incorrect. “ They tried some strange parameter settings to force users to cut down complexity of Bitcoin transactions.” So you have no idea what UTXO bloat is and why segwit is weighted thus? “ against the will of the community.” The community overwhelmingly supports segwit and core over BU= Bitcoin Node SoftwareEdit descriptionluke.dashjr.org Coin DanceSee which active proposals are supported by which companies and find out the legal & political status of bitcoin…coin.dance “ Bitcoin is in urgent need of diversified dev teams and implementations to achieve decentralization in Bitcoin development.” There already exists over 13 implementations, each with different dev teams , how many do you want? “ Should SegWit be activated, Bitcoin will have no choice but to proceed with Core’s current roadmap in the coming years” False, segwit doesn’t force the bitcoin community to follow their roadmap whatsoever. ", "title": "", "id": "d0daf71fc0d", "name": "2529_12", "username": "compricadev", "timestamp": 1492588544832, "creatorid": "d3847deaf5c0", "child": ""}