{"sentences": [{"sentence": "TOTTORI, Japan - Tottori, a remote outpost on the west coast of Japan, is frequently defined by what it lacks."}, {"sentence": "It has the lowest population of any prefecture in the country. No bullet train stops here. It ranks 39th out of the nation's 47 prefectures in attracting tourists."}, {"sentence": "But what Tottori does have, in abundance, is sand: Undulating golden dunes stretch for about 10 miles along the coast here, so majestic they have been turned into a national park."}, {"sentence": "For the past decade, a group of sand sculpture artists gather here every year for two weeks at the world's only indoor sand museum to mount an exhibit of improbably intricate tableaus, all crafted from about 3,000 tons of sand."}, {"sentence": "This year, 19 artists from countries including Canada, China, Italy, the Netherlands and Russia traveled to Tottori to sculpt scenes on the theme of the United States. Previous themes have included Africa, Russia and South America."}, {"sentence": "Working nine hours a day, the artists - five of whom are from the United States - built, among other things, Mount Rushmore, the New York skyline (yes, Trump Tower makes an appearance), oversize busts of Ella Fitzgerald and Louis Armstrong, scenes from the gold rush and the signing of the Declaration of Independence."}, {"sentence": "With Japan's population declining, Tottori officials are mounting a campaign to attract more foreign tourists to the region, and the sand museum and dunes are central to the effort."}, {"sentence": "Japan in general is seeking to lure more tourists. Last year, 24 million foreign visitors traveled to Japan, a record high. The national tourism bureau wants to increase that number to 40 million by 2020, the year Tokyo will host the Summer Olympics."}, {"sentence": "Foreign visitors typically stick to what tourism officials describe as the \"golden route\" of well-known destinations in Tokyo, Mount Fuji, Kyoto and Osaka."}, {"sentence": "In an attempt to expand that range, particularly among tourists who may be returning for a second or third visit to the country, the government's Japan Tourism Agency has allocated 1.64 billion yen (or close to $15 million) to help develop and market suggested routes through 11 regions, including around Tottori."}, {"sentence": "Fewer than 500,000 people visit the Tottori sand museum every year, though in recent years the number has declined slightly, and it does not come close to the two million people who visit the much better known snow festival in Sapporo, Hokkaido, every year."}, {"sentence": "Local tourism officials acknowledged that Tottori's distant location remains a challenge, but said they had suggested that visitors be allowed to watch the artists at work, or even help knock down the structures at the end of each exhibition."}, {"sentence": "The sand museum was founded in 2006 when the city of Tottori decided it wanted to better exploit its proximity to the sand dunes."}, {"sentence": "Officials invited Katsuhiko Chaen, an artist who had mounted sand sculpture festivals in his hometown in Kagoshima prefecture in southern Japan, to help develop an exhibition in Tottori."}, {"sentence": "Although the dunes sand is actually off-limits because of the national park designation, the city had saved a trove of sand unearthed during a road-building project above the dunes a decade ago."}, {"sentence": "For locals who had mounted a campaign to save the dunes from erosion, the ephemerality of the sand sculptures appealed."}, {"sentence": "\"One attraction of the sand sculptures is their frailty,\" said Yoshihiko Fukazawa, the mayor of the city of Tottori, the capital of the prefecture. \"All the forms will eventually disappear or degrade or collapse.\" Treasuring that impermanence, he said, is \"a Japanese virtue.\""}, {"sentence": "The first year, the sculptures sat outside and lasted about a month and half, attracting about 100,000 visitors."}, {"sentence": "But after four years of staging the exhibit under a tent, the city decided that maybe a little permanence would bring in more visitors."}, {"sentence": "It invested $5.5 million to construct a customized building to house a 21,000-square-foot exhibition floor, where sculptures would remain standing for eight months before bulldozers reduced them to piles of sand to be used in the following year's exhibit."}, {"sentence": "For artists, the facility, the fine-grained sand and the opportunity to collaborate with top international sand sculptors makes Tottori one of the most coveted spots on the sand-sculpting circuit."}, {"sentence": "\"There is no other place like this in the world,\" said Jon Woodworth, 50, a sculptor from Leander, Tex., working on his first assignment in Tottori this spring. \"This is the Mac Daddy of them all.\""}, {"sentence": "Mr. Chaen, now the artistic director of the museum, said he hoped it would help raise the profile of sand sculpture as a legitimate art form."}, {"sentence": "\"It has been difficult for these sand sculptures to be regarded as art,\" he said. \"People think of it as an activity that kids do on the beach or as a hobby.\""}, {"sentence": "Many of the artists have been working in sand - as well as ice and snow in the winter months - for years. In Tottori, Mr. Chaen selects each artist and assigns each one a scene that he has sketched out. The artists adapt his vision with their own ideas."}, {"sentence": "Two weeks before the official exhibition opening in mid-April, the artists carved and smoothed the sand with shovels, chisels, painters' palette knives, pastry wheels, scalpels, masonry levels and garden trowels. They often seemed to push the bounds of physics as they whittled detailed faces or delicate scenery. Aside from water, they use no adhesives or shellac to keep the sand in place."}, {"sentence": "That means the artists have to know what the sand can do."}, {"sentence": "\"The sand has a big part in the conversation,\" said Daniel Doyle, 43, an Irish artist who has been making sand sculptures for 20 years. In Tottori this year, he designed a montage of sports figures. \"Sand is different all over the world,\" he said. \"If you go with an idea and try to make the sand do something, the sand may not care.\""}, {"sentence": "One of the biggest challenges is making the sculptures look fully three-dimensional when in fact they are rendered more in two and a half dimensions. The prominent faces on the sand replica of Mount Rushmore, for example, are much flatter when viewed from the side than from the front."}, {"sentence": "\"It would be dangerous to do a nose in 3D,\" said Leonardo Ugolini, 47, as he completed the sand version of the famous lineup of American presidents. \"It might fall off.\" Mr. Ugolini, who is from Italy, has worked on every Tottori exhibit since 2006."}, {"sentence": "Sometimes, the sand does not cooperate. Seven days before they were scheduled to finish, the artists working on a Hollywood scene discovered a hairline crack on the head of a planned bust of Lucille Ball."}, {"sentence": "The artists shaved several pounds of sand off the figure's head and turned high-powered fans on overnight to help it dry faster. They also reconceived part of the design to give more support to Ms. Ball's neck. \"You really have to think on your feet,\" said Jill Harris, a seven-year Tottori veteran from Melbourne, Fla., and one of three artists working on the scene."}, {"sentence": "Curiously, with such an international crew, Mr. Chaen has never invited a Japanese artist to sculpt in Tottori."}, {"sentence": "\"I am not intentionally excluding Japanese artists,\" he said. \"But at this moment I don't think any Japanese artists have risen to the top level yet.\""}], "title": "Japan’s Sand Museum, a Home to Ephemeral Treasures", "content": "TOTTORI, Japan - Tottori, a remote outpost on the west coast of Japan, is frequently defined by what it lacks. It has the lowest population of any prefecture in the country. No bullet train stops here. It ranks 39th out of the nation's 47 prefectures in attracting tourists. But what Tottori does have, in abundance, is sand: Undulating golden dunes stretch for about 10 miles along the coast here, so majestic they have been turned into a national park. For the past decade, a group of sand sculpture artists gather here every year for two weeks at the world's only indoor sand museum to mount an exhibit of improbably intricate tableaus, all crafted from about 3,000 tons of sand. This year, 19 artists from countries including Canada, China, Italy, the Netherlands and Russia traveled to Tottori to sculpt scenes on the theme of the United States. Previous themes have included Africa, Russia and South America. Working nine hours a day, the artists - five of whom are from the United States - built, among other things, Mount Rushmore, the New York skyline (yes, Trump Tower makes an appearance), oversize busts of Ella Fitzgerald and Louis Armstrong, scenes from the gold rush and the signing of the Declaration of Independence. With Japan's population declining, Tottori officials are mounting a campaign to attract more foreign tourists to the region, and the sand museum and dunes are central to the effort. Japan in general is seeking to lure more tourists. Last year, 24 million foreign visitors traveled to Japan, a record high. The national tourism bureau wants to increase that number to 40 million by 2020, the year Tokyo will host the Summer Olympics. Foreign visitors typically stick to what tourism officials describe as the \"golden route\" of well-known destinations in Tokyo, Mount Fuji, Kyoto and Osaka. In an attempt to expand that range, particularly among tourists who may be returning for a second or third visit to the country, the government's Japan Tourism Agency has allocated 1.64 billion yen (or close to $15 million) to help develop and market suggested routes through 11 regions, including around Tottori. Fewer than 500,000 people visit the Tottori sand museum every year, though in recent years the number has declined slightly, and it does not come close to the two million people who visit the much better known snow festival in Sapporo, Hokkaido, every year. Local tourism officials acknowledged that Tottori's distant location remains a challenge, but said they had suggested that visitors be allowed to watch the artists at work, or even help knock down the structures at the end of each exhibition. The sand museum was founded in 2006 when the city of Tottori decided it wanted to better exploit its proximity to the sand dunes. Officials invited Katsuhiko Chaen, an artist who had mounted sand sculpture festivals in his hometown in Kagoshima prefecture in southern Japan, to help develop an exhibition in Tottori. Although the dunes sand is actually off-limits because of the national park designation, the city had saved a trove of sand unearthed during a road-building project above the dunes a decade ago. For locals who had mounted a campaign to save the dunes from erosion, the ephemerality of the sand sculptures appealed. \"One attraction of the sand sculptures is their frailty,\" said Yoshihiko Fukazawa, the mayor of the city of Tottori, the capital of the prefecture. \"All the forms will eventually disappear or degrade or collapse.\" Treasuring that impermanence, he said, is \"a Japanese virtue.\" The first year, the sculptures sat outside and lasted about a month and half, attracting about 100,000 visitors. But after four years of staging the exhibit under a tent, the city decided that maybe a little permanence would bring in more visitors. It invested $5.5 million to construct a customized building to house a 21,000-square-foot exhibition floor, where sculptures would remain standing for eight months before bulldozers reduced them to piles of sand to be used in the following year's exhibit. For artists, the facility, the fine-grained sand and the opportunity to collaborate with top international sand sculptors makes Tottori one of the most coveted spots on the sand-sculpting circuit. \"There is no other place like this in the world,\" said Jon Woodworth, 50, a sculptor from Leander, Tex., working on his first assignment in Tottori this spring. \"This is the Mac Daddy of them all.\" Mr. Chaen, now the artistic director of the museum, said he hoped it would help raise the profile of sand sculpture as a legitimate art form. \"It has been difficult for these sand sculptures to be regarded as art,\" he said. \"People think of it as an activity that kids do on the beach or as a hobby.\" Many of the artists have been working in sand - as well as ice and snow in the winter months - for years. In Tottori, Mr. Chaen selects each artist and assigns each one a scene that he has sketched out. The artists adapt his vision with their own ideas. Two weeks before the official exhibition opening in mid-April, the artists carved and smoothed the sand with shovels, chisels, painters' palette knives, pastry wheels, scalpels, masonry levels and garden trowels. They often seemed to push the bounds of physics as they whittled detailed faces or delicate scenery. Aside from water, they use no adhesives or shellac to keep the sand in place. That means the artists have to know what the sand can do. \"The sand has a big part in the conversation,\" said Daniel Doyle, 43, an Irish artist who has been making sand sculptures for 20 years. In Tottori this year, he designed a montage of sports figures. \"Sand is different all over the world,\" he said. \"If you go with an idea and try to make the sand do something, the sand may not care.\" One of the biggest challenges is making the sculptures look fully three-dimensional when in fact they are rendered more in two and a half dimensions. The prominent faces on the sand replica of Mount Rushmore, for example, are much flatter when viewed from the side than from the front. \"It would be dangerous to do a nose in 3D,\" said Leonardo Ugolini, 47, as he completed the sand version of the famous lineup of American presidents. \"It might fall off.\" Mr. Ugolini, who is from Italy, has worked on every Tottori exhibit since 2006. Sometimes, the sand does not cooperate. Seven days before they were scheduled to finish, the artists working on a Hollywood scene discovered a hairline crack on the head of a planned bust of Lucille Ball. The artists shaved several pounds of sand off the figure's head and turned high-powered fans on overnight to help it dry faster. They also reconceived part of the design to give more support to Ms. Ball's neck. \"You really have to think on your feet,\" said Jill Harris, a seven-year Tottori veteran from Melbourne, Fla., and one of three artists working on the scene. Curiously, with such an international crew, Mr. Chaen has never invited a Japanese artist to sculpt in Tottori. \"I am not intentionally excluding Japanese artists,\" he said. \"But at this moment I don't think any Japanese artists have risen to the top level yet.\" ", "parent": "", "child": "", "name": "6"}