{"child": "", "content": "Gunfire erupted inside an elementary school classroom in San Bernardino, Calif., on Monday, leaving two adults dead in what authorities said was an apparent murder-suicide. Two students may have also been injured in the attack. The students were rushed to a nearby hospital from North Park Elementary School, said Jarrod Burguan, the San Bernardino police chief, in a series of Twitter posts. He said the person who carried out the shooting may have been among the four victims. One of the victims was a teacher at the school, Maria Garcia, a spokeswoman for the school district, said. The chief said other students at North Park were being taken to nearby Cajon High School for safety. A spokesman for the San Bernardino Fire Department said they had no information on the status of the victims. The school is about ten miles from the site of the terror attack in 2015. This is a developing story. Please return for updates. ", "parent": "", "name": "7", "title": "San Bernardino School Shooting Leaves Two Dead", "sentences": [{"sentence": "Gunfire erupted inside an elementary school classroom in San Bernardino, Calif., on Monday, leaving two adults dead in what authorities said was an apparent murder-suicide. Two students may have also been injured in the attack."}, {"sentence": "The students were rushed to a nearby hospital from North Park Elementary School, said Jarrod Burguan, the San Bernardino police chief, in a series of Twitter posts. He said the person who carried out the shooting may have been among the four victims. One of the victims was a teacher at the school, Maria Garcia, a spokeswoman for the school district, said."}, {"sentence": "The chief said other students at North Park were being taken to nearby Cajon High School for safety."}, {"sentence": "A spokesman for the San Bernardino Fire Department said they had no information on the status of the victims."}, {"sentence": "The school is about ten miles from the site of the terror attack in 2015."}, {"sentence": "This is a developing story. Please return for updates."}]}