{"parent": "", "title": "How to Construct a 3D Main Character", "author": "ProWritingAid", "sentences": [{"4d96": "How to Construct a 3D Main Character"}, {"7ec5": "Have you ever read something and about 50 pages into it, you’re just not feeling the main character? You’re either not invested in her conflict or she’s kind of … boring."}, {"af6d": "Or worse, has an agent or editor to whom you’ve submitted your work ever commented that your MC is one dimensional?"}, {"39b2": "Now think about the latest book you couldn’t put down. You could hardly wait to find out what happened to the MC. You just “got” her; she was relatable and you understood why she did the things she did."}, {"94f3": "She was obviously a three-dimensional MC. But what does that mean?"}, {"a342": "How to Identify the Deeper Dimensions of an MC"}, {"126a": "This is where a little forethought and planning will help you create a multi-dimensional MC. When you try to create a character by the “pants” approach, the end result will be hit or miss."}, {"1b62": "If you’re an incredibly intuitive person, pantsing it may work for you, but most of us need to plot a character’s dimensions to show real depth. Let’s face it. Real life is three-dimensional. If we could predict how people will respond to situations, it would be so much easier to figure out how to ask the difficult questions."}, {"7eb5": "Life is messy. Emotions are messy. Real life unfolds and unravels rather unpredictably. So should your characters. Consider the following three dimensions of character development:"}, {"ef41": "The 1st Dimension."}, {"1bb4": "This is what we see on the outside. These are the surface traits, the little personality quirks and habits that characters have. This may be the real person or it may just be their social mask that they present to the world. Without any other dimensions, we’ll never know how authentic it is. The supporting cast in our stories are one-dimensional. We don’t need to know what’s behind their façade. It’s not important to your readers to know what kind of childhood the waiter at the restaurant had. But you do need to know that about your MC. That’s where weaving in the other dimensions helps flesh out your characters."}, {"4848": "One thing to note: avoid cliché quirks and tics for your main characters, and even in your supporting characters. The grumpy old man who screams at the kids to get off his lawn or the two-faced politician who preaches family values to the public yet has a mistress or two on the side — all of these traits have been done to boredom and back. You definitely do not want to give your MC quirks that are tired or even too quirky."}, {"1032": "The 2nd Dimension."}, {"a2ba": "Or what we see on the inside. This is when backstory comes into play. What is it about your MC’s childhood that causes her to freeze up whenever someone gets too close? What are her inner conflicts or unfulfilled dreams that cause her to respond in certain ways? Everyone has fears and weaknesses, resentments and inclinations that underlay the outer face they show the world. Sometimes that’s a smokescreen to throw the reader off the path. When readers understand why an MC reacts the way he or she does, you’ve created empathy for that character. And the more empathy you can create for a character, the more readers will invest in reading."}, {"2312": "The 3rd Dimension."}, {"66dc": "Or the character’s beliefs that lead to action and behavior. This is their moral substance. An MC’s character isn’t defined by their backstory or their inner conflict, but rather by the decisions they make when facing a moral situation. You may have been angry enough to smack someone in the face a time or two, but you decided not to. Why? Because of your moral character. That decision defines who you are. Now take a character who has a similar backstory and inner conflicts, but who decided to punch someone in the face. You’ve now created a completely different dimensioned character."}, {"bb5e": "Hopefully you can see how each of the dimensions informs the others, but they’re each distinct and unique. The 1st and 2nd dimensions don’t necessarily dictate the 3rd. This is how you layer your character to create depth. Think of the layers of an onion. The layers aren’t transparent. You can’t see through one to what’s underneath. You need to peel back to find what’s at the core."}, {"d611": "6 Tips for Creating 3D Characters"}, {"dd84": "These tips will help you flesh out some multi-dimensional depth:"}, {"b7cd": "1. Let them surprise you."}, {"f0e0": "A shy person who’s always shy suddenly finds herself flirting with an attractive stranger on the train. Be open to unexpected reactions in your MC. An outspoken businessman gets tongue-tied when facing a big presentation or speech. Don’t restrict your characters to acting a certain way all the time. Punch things up. Everyone acts out of character periodically; imbue your MC with a little “out of character” action and surprise your reader."}, {"7d8c": "2. Let them search for a purpose."}, {"894e": "We all — at least most of us — search for a greater purpose in our lives. Let your MC reach for one. When faced with a hard decision, let your character decide to take a different path because it brings her closer to her beliefs or dreams. Whether or not this turns out to be a good or bad decision is another story. Give your MC a sense of destiny and see where it takes her."}, {"a6c8": "3. Let inner feelings be expressed physically."}, {"7ae4": "When we feel good about ourselves, we might dress a little differently or spend more time on an up-do to make our outer appearance match the way we feel inside. On the flip side, don’t tell us your main character is trying to fight off a wave of insecurity through inner dialogue or omniscient narrative. Show us the fingernails bitten and torn, ragged and bleeding."}, {"2ee0": "4. Use conflicting emotions."}, {"b987": "You know you want that third cookie before dinner, but you also really want to lose the last 10 pounds you’ve been working on. Human beings are naturally conflicted about a lot of things. Let us see that your MC is conflicted about her strongest beliefs. She’ll be much more human for it."}, {"d40b": "5. Use real-life emotions."}, {"31fe": "You’ve experienced emotions in life. It may not have been the same scenario as your MC is facing, but you can draw from your life experiences to inform your writing about what your character is feeling. Did you have a beloved pet die when you were a kid? Channel those emotions into your MC when something bad happens. The details aren’t important; the human emotions of losing something beloved are."}, {"65d8": "6. Use dialogue to illustrate deceit or create power dynamics."}, {"8faf": "Often what comes out of your MC’s mouth is quite different from what they are really thinking. Your reader has the unique ability to read your MC’s thoughts and see whether they are being honest or have some ulterior motive. We talked further about this idea a couple months ago in 5 Tricks for Using Dialogue to Write Truly Captivating Characters"}, {"4c49": "Take-Aways"}, {"fcfc": "Human beings are conflicted, emotional creations that work on all three dimensions. They are a sum of all their parts, and that’s the essence you want to convey when creating your MC. They are the best — and worst — mix of their dark and deeply hidden secrets."}, {"675f": "It’s your job to show your readers these dimensions to create engaging and compelling characters that are complex, frightening, endearing, and, most of all, empathetic."}, {"a11c": "Please share this with all the writers in your life and hit that ♥ button to spread it around even more."}, {"3686": "Still thinking about your characters? You might also be interested in Why You Should Start Writing Morally Grey Characters."}, {"d8fc": "Originally published at prowritingaid.com."}, {"95cb": "The Writing Cooperative is a community of people helping each other write better. Become a member to join our Slack team, get fresh eyes on your writing, and participate in the 52-Week Writing Challenge!"}], "content": "How to Construct a 3D Main Character Have you ever read something and about 50 pages into it, you’re just not feeling the main character? You’re either not invested in her conflict or she’s kind of … boring. Or worse, has an agent or editor to whom you’ve submitted your work ever commented that your MC is one dimensional? Now think about the latest book you couldn’t put down. You could hardly wait to find out what happened to the MC. You just “got” her; she was relatable and you understood why she did the things she did. She was obviously a three-dimensional MC. But what does that mean? How to Identify the Deeper Dimensions of an MC This is where a little forethought and planning will help you create a multi-dimensional MC. When you try to create a character by the “pants” approach, the end result will be hit or miss. If you’re an incredibly intuitive person, pantsing it may work for you, but most of us need to plot a character’s dimensions to show real depth. Let’s face it. Real life is three-dimensional. If we could predict how people will respond to situations, it would be so much easier to figure out how to ask the difficult questions. Life is messy. Emotions are messy. Real life unfolds and unravels rather unpredictably. So should your characters. Consider the following three dimensions of character development: The 1st Dimension. This is what we see on the outside. These are the surface traits, the little personality quirks and habits that characters have. This may be the real person or it may just be their social mask that they present to the world. Without any other dimensions, we’ll never know how authentic it is. The supporting cast in our stories are one-dimensional. We don’t need to know what’s behind their façade. It’s not important to your readers to know what kind of childhood the waiter at the restaurant had. But you do need to know that about your MC. That’s where weaving in the other dimensions helps flesh out your characters. One thing to note: avoid cliché quirks and tics for your main characters, and even in your supporting characters. The grumpy old man who screams at the kids to get off his lawn or the two-faced politician who preaches family values to the public yet has a mistress or two on the side — all of these traits have been done to boredom and back. You definitely do not want to give your MC quirks that are tired or even too quirky. The 2nd Dimension. Or what we see on the inside. This is when backstory comes into play. What is it about your MC’s childhood that causes her to freeze up whenever someone gets too close? What are her inner conflicts or unfulfilled dreams that cause her to respond in certain ways? Everyone has fears and weaknesses, resentments and inclinations that underlay the outer face they show the world. Sometimes that’s a smokescreen to throw the reader off the path. When readers understand why an MC reacts the way he or she does, you’ve created empathy for that character. And the more empathy you can create for a character, the more readers will invest in reading. The 3rd Dimension. Or the character’s beliefs that lead to action and behavior. This is their moral substance. An MC’s character isn’t defined by their backstory or their inner conflict, but rather by the decisions they make when facing a moral situation. You may have been angry enough to smack someone in the face a time or two, but you decided not to. Why? Because of your moral character. That decision defines who you are. Now take a character who has a similar backstory and inner conflicts, but who decided to punch someone in the face. You’ve now created a completely different dimensioned character. Hopefully you can see how each of the dimensions informs the others, but they’re each distinct and unique. The 1st and 2nd dimensions don’t necessarily dictate the 3rd. This is how you layer your character to create depth. Think of the layers of an onion. The layers aren’t transparent. You can’t see through one to what’s underneath. You need to peel back to find what’s at the core. 6 Tips for Creating 3D Characters These tips will help you flesh out some multi-dimensional depth: 1. Let them surprise you. A shy person who’s always shy suddenly finds herself flirting with an attractive stranger on the train. Be open to unexpected reactions in your MC. An outspoken businessman gets tongue-tied when facing a big presentation or speech. Don’t restrict your characters to acting a certain way all the time. Punch things up. Everyone acts out of character periodically; imbue your MC with a little “out of character” action and surprise your reader. 2. Let them search for a purpose. We all — at least most of us — search for a greater purpose in our lives. Let your MC reach for one. When faced with a hard decision, let your character decide to take a different path because it brings her closer to her beliefs or dreams. Whether or not this turns out to be a good or bad decision is another story. Give your MC a sense of destiny and see where it takes her. 3. Let inner feelings be expressed physically. When we feel good about ourselves, we might dress a little differently or spend more time on an up-do to make our outer appearance match the way we feel inside. On the flip side, don’t tell us your main character is trying to fight off a wave of insecurity through inner dialogue or omniscient narrative. Show us the fingernails bitten and torn, ragged and bleeding. 4. Use conflicting emotions. You know you want that third cookie before dinner, but you also really want to lose the last 10 pounds you’ve been working on. Human beings are naturally conflicted about a lot of things. Let us see that your MC is conflicted about her strongest beliefs. She’ll be much more human for it. 5. Use real-life emotions. You’ve experienced emotions in life. It may not have been the same scenario as your MC is facing, but you can draw from your life experiences to inform your writing about what your character is feeling. Did you have a beloved pet die when you were a kid? Channel those emotions into your MC when something bad happens. The details aren’t important; the human emotions of losing something beloved are. 6. Use dialogue to illustrate deceit or create power dynamics. Often what comes out of your MC’s mouth is quite different from what they are really thinking. Your reader has the unique ability to read your MC’s thoughts and see whether they are being honest or have some ulterior motive. We talked further about this idea a couple months ago in 5 Tricks for Using Dialogue to Write Truly Captivating Characters Take-Aways Human beings are conflicted, emotional creations that work on all three dimensions. They are a sum of all their parts, and that’s the essence you want to convey when creating your MC. They are the best — and worst — mix of their dark and deeply hidden secrets. It’s your job to show your readers these dimensions to create engaging and compelling characters that are complex, frightening, endearing, and, most of all, empathetic. Please share this with all the writers in your life and hit that ♥ button to spread it around even more. Still thinking about your characters? You might also be interested in Why You Should Start Writing Morally Grey Characters. Originally published at prowritingaid.com. The Writing Cooperative is a community of people helping each other write better. Become a member to join our Slack team, get fresh eyes on your writing, and participate in the 52-Week Writing Challenge! ", "name": "1009", "child": "1009_1", "timestamp": "Apr 13"}