{"parent": "", "title": "Deepest darkest sea creatures", "author": "Harris Sockel", "sentences": [{"b87b": "Deepest darkest sea creatures"}, {"9360": "poems and not-poems"}, {"8763": "so you think you can live:"}, {"0152": "the truthmy aunt died aloneon the floor ofthe house she grew up inwith a handful of dietpills and an unlockeddoor and…medium.com"}, {"bb17": "Our Townie:"}, {"0763": "this towncan I just saythat I know this townbetter than my pocketsthe backs of my handsbetter than that small liein the…medium.com"}, {"d68e": "alt Maslow:"}, {"ac37": "the fourbasic human wantsmedium.com"}, {"f82f": "please don’t shoot the music:"}, {"9ac6": "No photosWhen you see someone play musicReally play musicYou cannot take a photo.medium.com"}, {"67f7": "MEEEP MEEEP MEEEP:"}, {"174b": "the most sensitive person in the universe pt 1Flickering lights slip through Amazon’s 4.3 star rated blackout shades and a siren’s squeak sneaks through noise…medium.com"}, {"c2ab": "“assemble small boats of love”:"}, {"4d93": "Five Poems, by Jeff Whitney“in this dream / no child was ever killed by a government / bullet”electricliterature.com"}, {"db61": "Center Stage-ish:"}, {"f22e": "Still Too Gay to be an ActorJimmy Tripp. Actor. Teacher. Homo.medium.com"}, {"2fee": "when you eat a star:"}, {"c8f8": "8.I will swallow the sunAnd then when I Weep or laughIt willEscape in piecesSmall enough for you toHoldmedium.com"}, {"0ff0": "i train myself to avoid the things i love the most:"}, {"c9ef": "Learned ReactionI am between not knowing what love is andholding onto it like a balloon that isabout to burst in my hands.medium.com"}, {"d1d8": "hearts on sleeves on sale:"}, {"c8db": "inner monologueMake use ofthis freakish heart.Display it-maybe it couldstill be something,if not loved.Yes.Let it struggleto…medium.com"}, {"a23a": "what is beauty anyway, i mean really:"}, {"18eb": "The Story of an Ugly Trans GirlI don’t know if Medium is for telling (relatively) simple autobiographies, but since I think mine has some value beyond…medium.com"}, {"9bac": "Feat. Matt Vercillo, sink or swim, Kellan Kryak, Amy McEwan, Nick Chmura, Okey-Panky, Adam John Roper, Nina Szarka, Ali Guerra, and Mike"}], "content": "Deepest darkest sea creatures poems and not-poems so you think you can live: the truthmy aunt died aloneon the floor ofthe house she grew up inwith a handful of dietpills and an unlockeddoor and…medium.com Our Townie: this towncan I just saythat I know this townbetter than my pocketsthe backs of my handsbetter than that small liein the…medium.com alt Maslow: the fourbasic human wantsmedium.com please don’t shoot the music: No photosWhen you see someone play musicReally play musicYou cannot take a photo.medium.com MEEEP MEEEP MEEEP: the most sensitive person in the universe pt 1Flickering lights slip through Amazon’s 4.3 star rated blackout shades and a siren’s squeak sneaks through noise…medium.com “assemble small boats of love”: Five Poems, by Jeff Whitney“in this dream / no child was ever killed by a government / bullet”electricliterature.com Center Stage-ish: Still Too Gay to be an ActorJimmy Tripp. Actor. Teacher. Homo.medium.com when you eat a star: 8.I will swallow the sunAnd then when I Weep or laughIt willEscape in piecesSmall enough for you toHoldmedium.com i train myself to avoid the things i love the most: Learned ReactionI am between not knowing what love is andholding onto it like a balloon that isabout to burst in my hands.medium.com hearts on sleeves on sale: inner monologueMake use ofthis freakish heart.Display it-maybe it couldstill be something,if not loved.Yes.Let it struggleto…medium.com what is beauty anyway, i mean really: The Story of an Ugly Trans GirlI don’t know if Medium is for telling (relatively) simple autobiographies, but since I think mine has some value beyond…medium.com Feat. Matt Vercillo, sink or swim, Kellan Kryak, Amy McEwan, Nick Chmura, Okey-Panky, Adam John Roper, Nina Szarka, Ali Guerra, and Mike ", "name": "1012", "child": "1012_11012_11012_1", "timestamp": "Apr 11"}