{"parent": "", "title": "Legal Financial Obligations Are the New Debtors’ Prison", "author": "Arvind Dilawar", "sentences": [{"2852": "Legal Financial Obligations Are the New Debtors’ Prison"}, {"bbbf": "Legal financial obligations can saddle a prisoner with exponentially increasing debt long after they’ve been released from prison. It can even land them back in jail. Can the cycle be broken?"}, {"ce16": "By Arvind Dilawar"}, {"6501": "The day Tarra Simmons walked out of Mission Creek Correctional Center for Women in 2013, she owed $7,500 to Kitsap County in Washington state. These court-mandated fines and fees, known as legal financial obligations, or LFOs, included charges for “services” she had “rendered” — police, court, public defender, DNA collection — and some line items unrelated to her case, such as expert witnesses and victims’ services. (Her case had no named victim.) Simmons had spent the previous 20 months of her incarceration on drug, theft, and firearm charges trying to pay down that debt. But her prison job paid only 42 cents an hour, and even with the state putting a portion of the money her family sent in for commissary toward her mounting tab, it was impossible to keep up with the 12 percent interest that began accruing the day she was convicted."}, {"9935": "It would have taken Simmons almost two and a half years of steady $300-a-month, court-mandated payments to be rid of her debt, but that was not an option. With her multiple felony convictions, well-paid work was unattainable, and, as a single mother, she had two boys to support. Working at a fast food restaurant and earning only $900 a month, Simmons couldn’t afford rent, utilities, and food, much less LFO payments. Her family was evicted, and the court began garnishing her paychecks. Still her debt climbed to $8,800. “It caused a lot of anxiety and depression,” Simmons says of her LFO debt. “I thought about selling drugs again to provide for my family.”"}, {"265f": "Who Gets a Public Defender?For pre-trial defendants, a lawyer can be the difference between waiting in jail or at home.psmag.com"}, {"b9e1": "Simmons is one of potentially millions of Americans who have already served their time, but cannot rebuild their lives because of LFOs. The number of those prisoners, as well as former convicts, saddled with LFOs and the total amount of their debt is unknown. As LFOs can be administered differently by every state, county, and even municipality, it is difficult to make generalizations. And because there is no central repository for all of this information, investigating the subject is challenging. Alexes Harris, a professor of sociology at the University of Washington, has been researching LFOs since 2007. Considering the question of how much outstanding LFO debt there is nationwide, she underscores the absence of a coherent data set, but hazards a guess: “I think it it would be in the billions.”"}, {"fc1e": "In her 2016 book A Pound of Flesh: Monetary Sanctions as Punishment for the Poor, Harris traces the recent history of LFOs in the United States. Although monetary sanctions have always been a part of the American criminal justice system, their use grew in the 1990s when states began codifying their financial penalties. LFOs proliferated as incarceration rates increased, offering governments some means of offsetting the ballooning cost of corrections. As state and local budgets became tighter, even more pressure was put on defendants to pay for their “use” of the criminal justice system. Today, in Washington state (where Harris conducted her research), you can be charged not only for victim’s restitution, but for bench warrants, clerks, court-appointed attorneys, lab analyses, juries, drug funds, incarcerations, emergency responses, extraditions, convictions, collections, drug and alcohol assessments and treatments, supervisions, house arrests, and, of course, interest. These charges are levied even on minors and, in some cases, defendants found innocent."}, {"85ef": "“It caused a lot of anxiety and depression. I thought about selling drugs again to provide for my family.”"}, {"5155": "While the primary justification for LFOs rests on delivering justice to victims through compensation, evidence suggests that most of the funds collected fail to make it that far. In Washington state, for example, only 44 percent of LFO collections from 2012 was paid to victims; the rest was retained by the county (38 percent), given to the state (12 percent), or put into funds ostensibly to aid others affected by similar crimes (6 percent). As in Simmons’ case, many defendants commit victimless crimes, yet are still forced to pay LFOs that include contributions to victims’ funds."}, {"3aa0": "Technically, allowances should be made by judges to spare poor defendants from impossible debt. This sometimes takes the form of community service in lieu of payment, but as indigence or inability to pay are not firmly defined, defendants can get on the hook for more money than they could make in the remainder of their lives — especially after interest is taken into account."}, {"85a1": "What’s Propelling Second-Chance Legislation Across America?From Indiana to Pennsylvania, second-chance legislation is increasingly becoming a viable option for some offenders.psmag.com"}, {"693e": "When, in 2006 in Kitsap County, Washington, Michael Shoemaker was convicted of three charges related to methamphetamine addiction, he was also fined $11,614; after serving his 90-month sentence, Shoemaker’s LFO debt had more than doubled to over $23,300. As a 63-year-old Vietnam veteran with a service-related disability, he has little hope of obtaining work and gets by on his monthly pension of $1,075. By claiming hardship, he was able to clear his interest and pay off the principal LFO balance using a small inheritance he had come into. Still outstanding are two older LFO debts from 18 years ago, which have grown to $30,000. “I don’t see them getting paid off before I die,” Shoemaker says. Consequences for non-payment include monitoring, wage garnishment, court summonses, warrants, and even incarceration."}, {"6c39": "LFOs earned national attention in the aftermath of the 2014 unrest in Ferguson, Missouri. While the weeks of protests and riots were most directly connected to the police shooting of Michael Brown, an investigation by the U.S. Department of Justice (DOJ) identified the collection of court fines and fees to be a major source of contention between the community and the criminal justice system. For the 2014–15 fiscal year, the Ferguson municipal government anticipated collecting $3 million — 15 percent of its revenue — from “fines and public safety”; that’s $354 from every household in a city where nearly a quarter of the population lives in poverty. In this climate, the local police force functions as a collection agency, not only freely distributing as many charges as possible, but acting as muscle in cases of non-payment. Poor residents, once charged, are taken in over and over again, squeezed for what little they can pay, as their debts continue to mount unabated. Regularly monitored, dragged into court, and threatened with imprisonment, defendants struggling with LFOs live in open-air debtors prisons."}, {"1a3b": "Some progress is being made in the wake of the DOJ investigation. In December of 2015, the department convened judges, academics, and lawyers to bring attention to the issues around LFOs; the following spring it issued “Dear Colleague” letters to judges across the country, reaffirming that defendants should not be incarcerated solely because of their inability to pay their debts. Soon after, the Bureau of Justice Assistance offered grants to five states to conduct research into and reform of their LFO policies. Unfortunately, the federal momentum may have already been broken with the change in presidential administrations. “The Obama DOJ really took a lead nationally,” Harris says. “Unfortunately, things have changed and I haven’t heard anything from [President Donald] Trump’s DOJ about if they’re continuing that work.”"}, {"b2ae": "Inside the Push to Give Ex-Offenders in Pennsylvania a Second ChanceLawmakers and activists are leading an effort to open up expungement and sealing laws for misdemeanor convictions in…psmag.com"}, {"c0cc": "For now, Harris is continuing her own research. With funding from the Laura and John Arnold Foundation, which sponsors social, governmental, and economic research to better society, Harris and her colleagues at universities in eight different states are examining local LFO policies on municipal, county, and state levels. “It’s really replicating what I did in the book, but across these eight states,” she says."}, {"aa8c": "Although research needs to continue before the entirety of the problem can be grasped, Harris is already certain of some solutions. She advocates for state-level statutes explicitly stating that mandatory fines and fees not be applied to indigent defendants, and for statutes clearly defining indigency. She also insists that interest rates should be abolished."}, {"3ee9": "Simmons, too, is playing an unlikely role in LFO reform. Refusing to be crushed beneath the weight of her eviction and her debt, she instead enrolled in Seattle University to study law in 2014. She will be graduating this May, but already she has been helping with legislation — namely House Bill 1783 in the Washington State Legislature, which would eliminate interest on some LFOs and make community service a more accessible alternative to payment. Just last week, Simmons testified on the bill before the State Senate. As of this writing, it has already passed in the House and is in Committee in the Senate."}, {"74fb": "“Not many people have the ability to keep fighting through all of the barriers associated with a criminal record, including the LFOs that force us to decide between potentially going back to jail or purchasing groceries,” Simmons says. “It is my duty to keep sharing my story in hopes of changing these practices for everybody.”"}], "content": "Legal Financial Obligations Are the New Debtors’ Prison Legal financial obligations can saddle a prisoner with exponentially increasing debt long after they’ve been released from prison. It can even land them back in jail. Can the cycle be broken? By Arvind Dilawar The day Tarra Simmons walked out of Mission Creek Correctional Center for Women in 2013, she owed $7,500 to Kitsap County in Washington state. These court-mandated fines and fees, known as legal financial obligations, or LFOs, included charges for “services” she had “rendered” — police, court, public defender, DNA collection — and some line items unrelated to her case, such as expert witnesses and victims’ services. (Her case had no named victim.) Simmons had spent the previous 20 months of her incarceration on drug, theft, and firearm charges trying to pay down that debt. But her prison job paid only 42 cents an hour, and even with the state putting a portion of the money her family sent in for commissary toward her mounting tab, it was impossible to keep up with the 12 percent interest that began accruing the day she was convicted. It would have taken Simmons almost two and a half years of steady $300-a-month, court-mandated payments to be rid of her debt, but that was not an option. With her multiple felony convictions, well-paid work was unattainable, and, as a single mother, she had two boys to support. Working at a fast food restaurant and earning only $900 a month, Simmons couldn’t afford rent, utilities, and food, much less LFO payments. Her family was evicted, and the court began garnishing her paychecks. Still her debt climbed to $8,800. “It caused a lot of anxiety and depression,” Simmons says of her LFO debt. “I thought about selling drugs again to provide for my family.” Who Gets a Public Defender?For pre-trial defendants, a lawyer can be the difference between waiting in jail or at home.psmag.com Simmons is one of potentially millions of Americans who have already served their time, but cannot rebuild their lives because of LFOs. The number of those prisoners, as well as former convicts, saddled with LFOs and the total amount of their debt is unknown. As LFOs can be administered differently by every state, county, and even municipality, it is difficult to make generalizations. And because there is no central repository for all of this information, investigating the subject is challenging. Alexes Harris, a professor of sociology at the University of Washington, has been researching LFOs since 2007. Considering the question of how much outstanding LFO debt there is nationwide, she underscores the absence of a coherent data set, but hazards a guess: “I think it it would be in the billions.” In her 2016 book A Pound of Flesh: Monetary Sanctions as Punishment for the Poor, Harris traces the recent history of LFOs in the United States. Although monetary sanctions have always been a part of the American criminal justice system, their use grew in the 1990s when states began codifying their financial penalties. LFOs proliferated as incarceration rates increased, offering governments some means of offsetting the ballooning cost of corrections. As state and local budgets became tighter, even more pressure was put on defendants to pay for their “use” of the criminal justice system. Today, in Washington state (where Harris conducted her research), you can be charged not only for victim’s restitution, but for bench warrants, clerks, court-appointed attorneys, lab analyses, juries, drug funds, incarcerations, emergency responses, extraditions, convictions, collections, drug and alcohol assessments and treatments, supervisions, house arrests, and, of course, interest. These charges are levied even on minors and, in some cases, defendants found innocent. “It caused a lot of anxiety and depression. I thought about selling drugs again to provide for my family.” While the primary justification for LFOs rests on delivering justice to victims through compensation, evidence suggests that most of the funds collected fail to make it that far. In Washington state, for example, only 44 percent of LFO collections from 2012 was paid to victims; the rest was retained by the county (38 percent), given to the state (12 percent), or put into funds ostensibly to aid others affected by similar crimes (6 percent). As in Simmons’ case, many defendants commit victimless crimes, yet are still forced to pay LFOs that include contributions to victims’ funds. Technically, allowances should be made by judges to spare poor defendants from impossible debt. This sometimes takes the form of community service in lieu of payment, but as indigence or inability to pay are not firmly defined, defendants can get on the hook for more money than they could make in the remainder of their lives — especially after interest is taken into account. What’s Propelling Second-Chance Legislation Across America?From Indiana to Pennsylvania, second-chance legislation is increasingly becoming a viable option for some offenders.psmag.com When, in 2006 in Kitsap County, Washington, Michael Shoemaker was convicted of three charges related to methamphetamine addiction, he was also fined $11,614; after serving his 90-month sentence, Shoemaker’s LFO debt had more than doubled to over $23,300. As a 63-year-old Vietnam veteran with a service-related disability, he has little hope of obtaining work and gets by on his monthly pension of $1,075. By claiming hardship, he was able to clear his interest and pay off the principal LFO balance using a small inheritance he had come into. Still outstanding are two older LFO debts from 18 years ago, which have grown to $30,000. “I don’t see them getting paid off before I die,” Shoemaker says. Consequences for non-payment include monitoring, wage garnishment, court summonses, warrants, and even incarceration. LFOs earned national attention in the aftermath of the 2014 unrest in Ferguson, Missouri. While the weeks of protests and riots were most directly connected to the police shooting of Michael Brown, an investigation by the U.S. Department of Justice (DOJ) identified the collection of court fines and fees to be a major source of contention between the community and the criminal justice system. For the 2014–15 fiscal year, the Ferguson municipal government anticipated collecting $3 million — 15 percent of its revenue — from “fines and public safety”; that’s $354 from every household in a city where nearly a quarter of the population lives in poverty. In this climate, the local police force functions as a collection agency, not only freely distributing as many charges as possible, but acting as muscle in cases of non-payment. Poor residents, once charged, are taken in over and over again, squeezed for what little they can pay, as their debts continue to mount unabated. Regularly monitored, dragged into court, and threatened with imprisonment, defendants struggling with LFOs live in open-air debtors prisons. Some progress is being made in the wake of the DOJ investigation. In December of 2015, the department convened judges, academics, and lawyers to bring attention to the issues around LFOs; the following spring it issued “Dear Colleague” letters to judges across the country, reaffirming that defendants should not be incarcerated solely because of their inability to pay their debts. Soon after, the Bureau of Justice Assistance offered grants to five states to conduct research into and reform of their LFO policies. Unfortunately, the federal momentum may have already been broken with the change in presidential administrations. “The Obama DOJ really took a lead nationally,” Harris says. “Unfortunately, things have changed and I haven’t heard anything from [President Donald] Trump’s DOJ about if they’re continuing that work.” Inside the Push to Give Ex-Offenders in Pennsylvania a Second ChanceLawmakers and activists are leading an effort to open up expungement and sealing laws for misdemeanor convictions in…psmag.com For now, Harris is continuing her own research. With funding from the Laura and John Arnold Foundation, which sponsors social, governmental, and economic research to better society, Harris and her colleagues at universities in eight different states are examining local LFO policies on municipal, county, and state levels. “It’s really replicating what I did in the book, but across these eight states,” she says. Although research needs to continue before the entirety of the problem can be grasped, Harris is already certain of some solutions. She advocates for state-level statutes explicitly stating that mandatory fines and fees not be applied to indigent defendants, and for statutes clearly defining indigency. She also insists that interest rates should be abolished. Simmons, too, is playing an unlikely role in LFO reform. Refusing to be crushed beneath the weight of her eviction and her debt, she instead enrolled in Seattle University to study law in 2014. She will be graduating this May, but already she has been helping with legislation — namely House Bill 1783 in the Washington State Legislature, which would eliminate interest on some LFOs and make community service a more accessible alternative to payment. Just last week, Simmons testified on the bill before the State Senate. As of this writing, it has already passed in the House and is in Committee in the Senate. “Not many people have the ability to keep fighting through all of the barriers associated with a criminal record, including the LFOs that force us to decide between potentially going back to jail or purchasing groceries,” Simmons says. “It is my duty to keep sharing my story in hopes of changing these practices for everybody.” ", "name": "1052", "child": "1052_1\t1052_2", "timestamp": "Apr 12"}