{"parent": "", "title": "Republican remains a town hall no-show as climate change claims spotlight in Virginia", "author": "Mark Hand", "sentences": [{"35d6": "Republican remains a town hall no-show as climate change claims spotlight in Virginia"}, {"718e": "Who’s afraid of Virginia voters?"}, {"5cc2": "Residents gather at Rep. Barbara Comstock’s (R-VA) district officer in Sterling, Va., on April 11, 2017, to urge lawmaker to push back against President Donald Trump’s anti-environment agenda. CREDIT: Indivisible VA District 10"}, {"500e": "STERLING,VIRGINIA — When Congress recessed in February, many Republican lawmakers across the country refused to meet with their constituents. Those who dared to show up at town hall-style events faced outrage over GOP plans to repeal Obamacare."}, {"c61b": "As lawmakers traveled home this week for spring break, constituents were less concerned about health care issues, after Republicans failed in their initial attempt since Donald Trump assumed the presidency to repeal President Barack Obama’s signature Affordable Care Act. With many Americans breathing easier about their health care, other issues, such as environmental protection and climate action, rose in prominence."}, {"5a4c": "Rep. Barbara Comstock, a Republican who represents a portion of Northern Virginia, refused to hold a public forum in February and once again doesn’t plan to meet with constituents during the current two-week recess."}, {"c097": "Virginia Rep. congressional candidate Barbara Comstock speaks at election night party on Nov. 4, 2014 in Ashburn, Va. CREDIT: AP Photo/Alex Brandon."}, {"8e65": "In February, about 150 residents showed up for a “citizen’s town hall” where a chair sat empty at a table with Comstock’s name on a card. This week, angry constituents held daily protests outside Comstock’s district office in Sterling, Virginia."}, {"8199": "Tuesday’s protest, in a grassy area along a busy highway outside her office, was designated “Toxic Tuesday,” with a focus on the environment."}, {"555b": "Comstock has told her constituents that she is an “all-of-the-above” energy strategy supporter, Chris Tandy, co-chairman of the environmental group 350 Loudoun, told ThinkProgress on Friday outside Comstock’s office. “We don’t think that’s appropriate,” he said. “What we’re looking for is a reduction to fossil fuel consumption to protect the environment.”"}, {"3652": "With cars honking their support for the residents, Tandy expressed dismay at Trump’s unwillingness to recognize the importance of the Paris climate agreement in reducing greenhouse gas emissions. “The Paris climate deal is about the most historic climate agreement that we’ve ever reached. We should stay in it. We should meet our obligations under it,” he said."}, {"ca60": "Tandy, who plans to attend the climate march in Washington, D.C., on April 29, also blasted Trump’s choice of former Oklahoma attorney general Scott Pruitt to head the Environmental Protection Agency. “It would have been nice if the current administration had appointed someone to the EPA who believes in the mission of the EPA and wasn’t seemingly trying to dismantle it, discredit its scientists,” he said."}, {"9586": "Residents protest outside district office of Rep. Barbara Comstock (R-VA) in Sterling, Va., on April 14, 2017. CREDIT: ThinkProgress/Mark Hand"}, {"1c40": "Comstock may understand her party-line votes aren’t in step with the views of the majority of her constituents, Tandy suggested. “It seems like even conservative voters are coming out for the environment in some places,” he said. “I think there’s a lot of middle ground on environmental issues.”"}, {"0309": "Climate change is popping up as a major concern in other congressional districts during the spring recess. Unlike some of his Republican colleagues, Rep. Justin Amash (R-MI) has not been shy about holding town hall meetings. The libertarian-leaning Republican held a town hall meeting in Byron Township, Michigan, on Tuesday. Unlike previous public forums, the primary discussion item was climate change."}, {"d8b8": "However, when asked about climate change, Amash responded that he believes “the climate changes.” His solution to global warming was “a strong economy,” which was met with boos by the audience, as reported by MLive.com."}, {"091b": "Amash echoed the Trump administration’s position on the EPA, saying it frequently oversteps its bounds. “There are places where the EPA should have a role, but I do think the EPA overreaches. I do support eliminating the EPA’s authority over those things,” he said."}], "content": "Republican remains a town hall no-show as climate change claims spotlight in Virginia Who’s afraid of Virginia voters? Residents gather at Rep. Barbara Comstock’s (R-VA) district officer in Sterling, Va., on April 11, 2017, to urge lawmaker to push back against President Donald Trump’s anti-environment agenda. CREDIT: Indivisible VA District 10 STERLING,VIRGINIA — When Congress recessed in February, many Republican lawmakers across the country refused to meet with their constituents. Those who dared to show up at town hall-style events faced outrage over GOP plans to repeal Obamacare. As lawmakers traveled home this week for spring break, constituents were less concerned about health care issues, after Republicans failed in their initial attempt since Donald Trump assumed the presidency to repeal President Barack Obama’s signature Affordable Care Act. With many Americans breathing easier about their health care, other issues, such as environmental protection and climate action, rose in prominence. Rep. Barbara Comstock, a Republican who represents a portion of Northern Virginia, refused to hold a public forum in February and once again doesn’t plan to meet with constituents during the current two-week recess. Virginia Rep. congressional candidate Barbara Comstock speaks at election night party on Nov. 4, 2014 in Ashburn, Va. CREDIT: AP Photo/Alex Brandon. In February, about 150 residents showed up for a “citizen’s town hall” where a chair sat empty at a table with Comstock’s name on a card. This week, angry constituents held daily protests outside Comstock’s district office in Sterling, Virginia. Tuesday’s protest, in a grassy area along a busy highway outside her office, was designated “Toxic Tuesday,” with a focus on the environment. Comstock has told her constituents that she is an “all-of-the-above” energy strategy supporter, Chris Tandy, co-chairman of the environmental group 350 Loudoun, told ThinkProgress on Friday outside Comstock’s office. “We don’t think that’s appropriate,” he said. “What we’re looking for is a reduction to fossil fuel consumption to protect the environment.” With cars honking their support for the residents, Tandy expressed dismay at Trump’s unwillingness to recognize the importance of the Paris climate agreement in reducing greenhouse gas emissions. “The Paris climate deal is about the most historic climate agreement that we’ve ever reached. We should stay in it. We should meet our obligations under it,” he said. Tandy, who plans to attend the climate march in Washington, D.C., on April 29, also blasted Trump’s choice of former Oklahoma attorney general Scott Pruitt to head the Environmental Protection Agency. “It would have been nice if the current administration had appointed someone to the EPA who believes in the mission of the EPA and wasn’t seemingly trying to dismantle it, discredit its scientists,” he said. Residents protest outside district office of Rep. Barbara Comstock (R-VA) in Sterling, Va., on April 14, 2017. CREDIT: ThinkProgress/Mark Hand Comstock may understand her party-line votes aren’t in step with the views of the majority of her constituents, Tandy suggested. “It seems like even conservative voters are coming out for the environment in some places,” he said. “I think there’s a lot of middle ground on environmental issues.” Climate change is popping up as a major concern in other congressional districts during the spring recess. Unlike some of his Republican colleagues, Rep. Justin Amash (R-MI) has not been shy about holding town hall meetings. The libertarian-leaning Republican held a town hall meeting in Byron Township, Michigan, on Tuesday. Unlike previous public forums, the primary discussion item was climate change. However, when asked about climate change, Amash responded that he believes “the climate changes.” His solution to global warming was “a strong economy,” which was met with boos by the audience, as reported by MLive.com. Amash echoed the Trump administration’s position on the EPA, saying it frequently oversteps its bounds. “There are places where the EPA should have a role, but I do think the EPA overreaches. I do support eliminating the EPA’s authority over those things,” he said. ", "name": "1062", "child": "1062_1\t1062_2\t1062_3\t1062_4\t1062_5\t1062_6", "timestamp": "Apr 15"}