{"parent": "", "title": "This weekend saw massive town hall protests against Trumpcare and Trump", "author": "Josh Israel", "sentences": [{"da51": "This weekend saw massive town hall protests against Trumpcare and Trump"}, {"eb8b": "California Republicans Darrell Issa and Duncan Hunter Jr. faced angry constituents, while Virginia’s Barbara Comstock bravely ran away."}, {"275d": "Rep. Barbara Comstock (R-VA) fled a parade Saturday to avoid facing voters. CREDIT: Dump Comstock"}, {"8f92": "On Saturday, Reps. Darrell Issa (R-CA) and Duncan Hunter Jr. (R-CA) became the latest Republican legislators to be read the riot act by constituents who are furious about Donald Trump’s administration and his Trumpcare plan."}, {"fa7e": "At two gatherings on Saturday, Issa faced about 1,000 people at an Oceanside, California, community center. According to media reports, “hecklers often interrupted what they said were long-winded non-answers” and audience members jeered when Issa dismissed the Affordable Care act as “Obamacare” and claimed it is “not affordable.” Recognizing that the crowd was not happy with his answers or his support of Trump’s agenda, Issa told the audience, “I don’t mind that things are contentious. I just don’t want things to end like the play Hamilton.” (Spoiler: The show ends with a fatal duel.)"}, {"85b8": "One constituent objected to having had a small sign that said “Investigate Russia,” confiscated by Issa’s uniformed security team, claiming their treatment of her constituted battery. Issa responded that he was going to move on to “somebody who doesn’t have a pending lawsuit… next.” Audience members booed."}, {"7697": "Outside, hundreds of protesters held signs supporting the Affordable Care Act and urging Issa: “Do your job.”"}, {"cffd": "Watch:"}, {"aeea": "A similar scene unfolded in Ramona, California, where Hunter told angry constituents that he generally supports Trumpcare. “I don’t believe in guaranteed health care. I believe in guaranteed access to health care that people can afford,” he explained. A San Diego Union-Tribune account noted that as “he was booed, yelled at, and interrupted,” the Congressman “drank a can of Red Bull and was down to his shirtsleeves by the end of the forum.”"}, {"db2b": "Hunter also told constituents that he does not support an independent inquiry into Russia’s interference in the 2016 elections, claiming without evidence that the nation’s intelligence community is filled with “seditious Obama folks” who “hate Donald Trump as much as you do” and seek only to undermine the Trump administration. He also echoed Trump’s unsubstantiated claims that the Obama administration wiretapped Trump Tower."}, {"5266": "Only about 400 of the estimated 1,000 people who showed up for the event were allowed into the forum. The paper noted that “Hunter appeared to have more supporters at his event than Issa did at his, but they were both heavily outnumbered.”"}, {"0103": "Meanwhile, Rep. Barbara Comstock (R-VA), one of many embattled Congressional Republicans who have avoided attending town halls with constituents — instead favoring carefully screened “tele-townhall” conference calls — was caught on video fleeing from a Manassas, Virginia parade on Saturday. According to Blue Virginia, members of the group Dump Comstock distributed “Missing Person” fliers and yelled out questions as she beat a hasty retreat."}], "content": "This weekend saw massive town hall protests against Trumpcare and Trump California Republicans Darrell Issa and Duncan Hunter Jr. faced angry constituents, while Virginia’s Barbara Comstock bravely ran away. Rep. Barbara Comstock (R-VA) fled a parade Saturday to avoid facing voters. CREDIT: Dump Comstock On Saturday, Reps. Darrell Issa (R-CA) and Duncan Hunter Jr. (R-CA) became the latest Republican legislators to be read the riot act by constituents who are furious about Donald Trump’s administration and his Trumpcare plan. At two gatherings on Saturday, Issa faced about 1,000 people at an Oceanside, California, community center. According to media reports, “hecklers often interrupted what they said were long-winded non-answers” and audience members jeered when Issa dismissed the Affordable Care act as “Obamacare” and claimed it is “not affordable.” Recognizing that the crowd was not happy with his answers or his support of Trump’s agenda, Issa told the audience, “I don’t mind that things are contentious. I just don’t want things to end like the play Hamilton.” (Spoiler: The show ends with a fatal duel.) One constituent objected to having had a small sign that said “Investigate Russia,” confiscated by Issa’s uniformed security team, claiming their treatment of her constituted battery. Issa responded that he was going to move on to “somebody who doesn’t have a pending lawsuit… next.” Audience members booed. Outside, hundreds of protesters held signs supporting the Affordable Care Act and urging Issa: “Do your job.” Watch: A similar scene unfolded in Ramona, California, where Hunter told angry constituents that he generally supports Trumpcare. “I don’t believe in guaranteed health care. I believe in guaranteed access to health care that people can afford,” he explained. A San Diego Union-Tribune account noted that as “he was booed, yelled at, and interrupted,” the Congressman “drank a can of Red Bull and was down to his shirtsleeves by the end of the forum.” Hunter also told constituents that he does not support an independent inquiry into Russia’s interference in the 2016 elections, claiming without evidence that the nation’s intelligence community is filled with “seditious Obama folks” who “hate Donald Trump as much as you do” and seek only to undermine the Trump administration. He also echoed Trump’s unsubstantiated claims that the Obama administration wiretapped Trump Tower. Only about 400 of the estimated 1,000 people who showed up for the event were allowed into the forum. The paper noted that “Hunter appeared to have more supporters at his event than Issa did at his, but they were both heavily outnumbered.” Meanwhile, Rep. Barbara Comstock (R-VA), one of many embattled Congressional Republicans who have avoided attending town halls with constituents — instead favoring carefully screened “tele-townhall” conference calls — was caught on video fleeing from a Manassas, Virginia parade on Saturday. According to Blue Virginia, members of the group Dump Comstock distributed “Missing Person” fliers and yelled out questions as she beat a hasty retreat. ", "name": "1063", "child": "1063_1\t1063_2\t1063_3\t1063_4\t1063_5\t1063_6\t1063_7\t1063_8\t1063_9\t1063_10\t1063_11\t1063_12", "timestamp": "Mar 12"}