{"parent": "", "title": "Congressman who wants to kill the EPA gets blasted at his town hall", "author": "Samantha Page", "sentences": [{"c5d6": "Congressman who wants to kill the EPA gets blasted at his town hall"}, {"14c8": "Turns out, people really like clean air and water."}, {"6c35": "Rep. Matt Gaetz’s (R-FL) first piece of legislation was a one-liner:"}, {"b7b1": "The Environmental Protection Agency shall terminate on December 31, 2018."}, {"6652": "But it turns out the newly-elected member of Congress might have misunderstood his mandate from voters. At Gaetz’s first town hall meeting with constituents Thursday night, protesters rallied outside with signs supporting the EPA. Inside, constituents pushed Gaetz to explain his bill."}, {"74c3": "“My bill doesn’t eliminate [the EPA] right away, but sunsets the agency by 2018,” Gaetz told the crowd. “I want to keep the Clean Air Act and the Clean Water Act… take the power out of Washington and back into the states.”"}, {"3a6e": "Legislation from Congress — including the Clean Air Act and Clean Water Act — gives the EPA authority to regulate pollution and enforce other environmental protection statutes. Carrying out the EPA’s activities, which are required by law, would have to be delegated elsewhere."}, {"8011": "Gaetz has suggested the EPA’s roughly $8 billion budget could be given directly to states for environmental enforcement. He also suggested Thursday that it could be rolled into defense spending."}, {"ad9f": "“My belief is that the $8 billion we’re currently spending on the EPA is not appropriately utilized to be able to really get in and punish polluters,” Gaetz told the crowd at one of his nine events Thursday."}, {"a44d": "Half of the EPA’s current funding is already passed on to state programs."}, {"c62b": "Opponents to abolishing the nearly 50-year-old agency point out that prior to the EPA, states were at the mercy of their upstream neighbors to reduce pollution."}, {"807a": "“Our water supplies don’t all come from Florida,” Sarah Coutu of Florida Panhandle Progressives told a local ABC affiliate. “They also come from Georgia and from Alabama and from Louisiana and from other states in the north.”"}, {"bb6c": "The Tampa Bay Times ran a piece earlier this month describing what would happen to the state if the EPA were cut."}, {"6ba9": "“Florida would probably be a much stinkier place, for one thing. Breathing might be difficult in the Tampa Bay area. And going to the beach could endanger your health,” the piece says."}], "content": "Congressman who wants to kill the EPA gets blasted at his town hall Turns out, people really like clean air and water. Rep. Matt Gaetz’s (R-FL) first piece of legislation was a one-liner: The Environmental Protection Agency shall terminate on December 31, 2018. But it turns out the newly-elected member of Congress might have misunderstood his mandate from voters. At Gaetz’s first town hall meeting with constituents Thursday night, protesters rallied outside with signs supporting the EPA. Inside, constituents pushed Gaetz to explain his bill. “My bill doesn’t eliminate [the EPA] right away, but sunsets the agency by 2018,” Gaetz told the crowd. “I want to keep the Clean Air Act and the Clean Water Act… take the power out of Washington and back into the states.” Legislation from Congress — including the Clean Air Act and Clean Water Act — gives the EPA authority to regulate pollution and enforce other environmental protection statutes. Carrying out the EPA’s activities, which are required by law, would have to be delegated elsewhere. Gaetz has suggested the EPA’s roughly $8 billion budget could be given directly to states for environmental enforcement. He also suggested Thursday that it could be rolled into defense spending. “My belief is that the $8 billion we’re currently spending on the EPA is not appropriately utilized to be able to really get in and punish polluters,” Gaetz told the crowd at one of his nine events Thursday. Half of the EPA’s current funding is already passed on to state programs. Opponents to abolishing the nearly 50-year-old agency point out that prior to the EPA, states were at the mercy of their upstream neighbors to reduce pollution. “Our water supplies don’t all come from Florida,” Sarah Coutu of Florida Panhandle Progressives told a local ABC affiliate. “They also come from Georgia and from Alabama and from Louisiana and from other states in the north.” The Tampa Bay Times ran a piece earlier this month describing what would happen to the state if the EPA were cut. “Florida would probably be a much stinkier place, for one thing. Breathing might be difficult in the Tampa Bay area. And going to the beach could endanger your health,” the piece says. ", "name": "1064", "child": "1064_1\t1064_2\t1064_3\t1064_4\t1064_5\t1064_6\t1064_7\t1064_8\t1064_9\t1064_10\t1064_11\t1064_12\t1064_13\t1064_14\t1064_15\t1064_16\t1064_17\t1064_18\t1064_19\t1064_20\t1064_21\t1064_22\t1064_23", "timestamp": "Feb 24"}