{"parent": "", "title": "Republican congressman skips town halls, holds invitation-only conference call instead", "author": "Rick Freeman", "sentences": [{"279e": "Republican congressman skips town halls, holds invitation-only conference call instead"}, {"8f72": "“He’s getting to a point now where it’s like it’s beyond hiding.”"}, {"a046": "Rep. Rodney Frelinghuysen (R-NJ) in cardboard form at a town hall in Livingston, New Jersey, February 24, 2017. CREDIT: Rick Freeman"}, {"0c09": "LIVINGSTON, NEW JERSEY — One thing about a town hall where the member of Congress hasn’t shown up: The part with the questions moves along pretty fast when no one’s there to answer them."}, {"f9ca": "Thursday night, Rep. Rodney Frelinghuysen (R-NJ) missed the fourth town hall put on for him this week by a constituent group. In a mostly full synagogue, constituents formed two orderly lines behind microphones and asked dozens of questions."}, {"c711": "But there were no answers, because there was no congressman. Instead, a cardboard cutout bearing a cartoon likeness, complete with a flag pin, has been brought to several of the town halls organized by New Jersey 11th for Change, a grassroots, nonpartisan group seeking to promote political transparency in the state’s 11th district."}, {"7eee": "“He’s getting to a point now where it’s like it’s beyond hiding,” said Ashley Barnes, an organizer with the group and the leader of Thursday night’s town hall. “Because now he’s dismissing people who are actually just people showing up wanting to talk to their congressman, which is more than reasonable.”"}, {"53ab": "A question about Russian involvement in the election drew loud approval. As did queries about health care, Black Lives Matter, and building a wall along the U.S.-Mexico border, far away from the suburbs of northern New Jersey that Frelinghuysen has represented for 22 years. The raucous scenes at other meetings, where voters drowned out members of Congress with chants and jeers, were nowhere to be found."}, {"acf0": "Frelinghuysen held an invitation-only conference call this week for select constituents, billing it as a “telephone town hall.” He also appeared at local high schools, where he spoke with students studying AP government. But he hasn’t met with his constituents in person. He was also absent Wednesday night at a United Food and Commercial Workers’ union hall, the night before that at a mosque, and on Sunday night at a Veterans of Foreign Wars event out in the more rural, Republican part of his almost evenly split, purple district. The town halls were all planned by NJ 11th for Change."}, {"efb6": "If Democrats do wind up regaining control of the House of Representatives in 2018, districts like this one, with higher than average education and incomes, seem ripe for the picking. And New Jersey’s 11th is important for another reason — with Frelinghuysen in charge of the Appropriations Committee, several key parts of the Trump agenda will wind up in front of him, catching him between his voters and House leadership."}, {"409f": "Even before his week of absences, voters here seemed to be having some buyers’ remorse. They sent Frelinguysen, son of Peter, a New Jersey congressman from 1953–74, back to Washington with a win by nearly 20 points in 2016, but the district voted for Donald Trump by less than one percent."}, {"997f": "“He’s veered much further to the right, but his constituency, a lot of people were not aware of that,” said Debra Caplan, an organizer with NJ 11th for Change. “We have a lot of moderate republicans who feel like they’re not being represented.”"}, {"67d3": "Frelinghuysen seems to have plenty of fences to mend in his district."}, {"7158": "One constituent in attendance drew cheers when he observed that he had been a registered Republican, but wasn’t any more. Another openly wondered if voters could redistrict the 11th out of existence. He later said he was a registered Republican, though a moderate one."}, {"6f0b": "Elsa Sjunneson-Henry said she was upset when she heard that Frelinghuysen said a reason he didn’t attend one of the group’s town halls out of concerns for access by disabled people. She is the group’s accessibility coordinator. “It feels like it’s an excuse,” Sjunneson-Henry said. “And I as a disabled person am not willing to be his get out of jail free card. Especially when I’m working this hard to make sure that everybody can be here.”"}, {"d2f6": "NJ 11th for Change, which registered as a Super PAC this week, began with three women sitting around a table in the days after the November election, organizers said. Then it grew to 30 people in a Facebook group, then hundreds, and on Thursday night, they announced that they had more than 6,700 participants signed up."}, {"d814": "As has been the case in so many districts around the country, many of those participants, and many among the estimated 500 who showed up on Thursday night, were involved in political organizing for the first time."}, {"72ec": "Jacqueline Nikovic of Bloomfield said she didn’t even know what congressional district she was in when she went online in search of answers after the November presidential election, only to have the mayor of her town steer her toward the group for her district."}, {"75b2": "On Thursday night, she was wearing a “volunteer” nametag and manning a table covered in buttons and other gear in the synagogue’s entryway, alongside Myrna Brome of West Orange. Both women said they had gotten involved after considering the implications of a Trump presidency for their children."}, {"bf35": "Matthew Walters of Montclair asked the last question of the night. He noted that another New Jersey Congressman, a Republican, once spoke up in a tough time for the country and his party. Looking into the camera he asked: “How much damage does Donald Trump have to do to the country and the party before you have your own Peter Frelinghuysen moment?”"}, {"50b6": "The only answer he got was a standing ovation."}], "content": "Republican congressman skips town halls, holds invitation-only conference call instead “He’s getting to a point now where it’s like it’s beyond hiding.” Rep. Rodney Frelinghuysen (R-NJ) in cardboard form at a town hall in Livingston, New Jersey, February 24, 2017. CREDIT: Rick Freeman LIVINGSTON, NEW JERSEY — One thing about a town hall where the member of Congress hasn’t shown up: The part with the questions moves along pretty fast when no one’s there to answer them. Thursday night, Rep. Rodney Frelinghuysen (R-NJ) missed the fourth town hall put on for him this week by a constituent group. In a mostly full synagogue, constituents formed two orderly lines behind microphones and asked dozens of questions. But there were no answers, because there was no congressman. Instead, a cardboard cutout bearing a cartoon likeness, complete with a flag pin, has been brought to several of the town halls organized by New Jersey 11th for Change, a grassroots, nonpartisan group seeking to promote political transparency in the state’s 11th district. “He’s getting to a point now where it’s like it’s beyond hiding,” said Ashley Barnes, an organizer with the group and the leader of Thursday night’s town hall. “Because now he’s dismissing people who are actually just people showing up wanting to talk to their congressman, which is more than reasonable.” A question about Russian involvement in the election drew loud approval. As did queries about health care, Black Lives Matter, and building a wall along the U.S.-Mexico border, far away from the suburbs of northern New Jersey that Frelinghuysen has represented for 22 years. The raucous scenes at other meetings, where voters drowned out members of Congress with chants and jeers, were nowhere to be found. Frelinghuysen held an invitation-only conference call this week for select constituents, billing it as a “telephone town hall.” He also appeared at local high schools, where he spoke with students studying AP government. But he hasn’t met with his constituents in person. He was also absent Wednesday night at a United Food and Commercial Workers’ union hall, the night before that at a mosque, and on Sunday night at a Veterans of Foreign Wars event out in the more rural, Republican part of his almost evenly split, purple district. The town halls were all planned by NJ 11th for Change. If Democrats do wind up regaining control of the House of Representatives in 2018, districts like this one, with higher than average education and incomes, seem ripe for the picking. And New Jersey’s 11th is important for another reason — with Frelinghuysen in charge of the Appropriations Committee, several key parts of the Trump agenda will wind up in front of him, catching him between his voters and House leadership. Even before his week of absences, voters here seemed to be having some buyers’ remorse. They sent Frelinguysen, son of Peter, a New Jersey congressman from 1953–74, back to Washington with a win by nearly 20 points in 2016, but the district voted for Donald Trump by less than one percent. “He’s veered much further to the right, but his constituency, a lot of people were not aware of that,” said Debra Caplan, an organizer with NJ 11th for Change. “We have a lot of moderate republicans who feel like they’re not being represented.” Frelinghuysen seems to have plenty of fences to mend in his district. One constituent in attendance drew cheers when he observed that he had been a registered Republican, but wasn’t any more. Another openly wondered if voters could redistrict the 11th out of existence. He later said he was a registered Republican, though a moderate one. Elsa Sjunneson-Henry said she was upset when she heard that Frelinghuysen said a reason he didn’t attend one of the group’s town halls out of concerns for access by disabled people. She is the group’s accessibility coordinator. “It feels like it’s an excuse,” Sjunneson-Henry said. “And I as a disabled person am not willing to be his get out of jail free card. Especially when I’m working this hard to make sure that everybody can be here.” NJ 11th for Change, which registered as a Super PAC this week, began with three women sitting around a table in the days after the November election, organizers said. Then it grew to 30 people in a Facebook group, then hundreds, and on Thursday night, they announced that they had more than 6,700 participants signed up. As has been the case in so many districts around the country, many of those participants, and many among the estimated 500 who showed up on Thursday night, were involved in political organizing for the first time. Jacqueline Nikovic of Bloomfield said she didn’t even know what congressional district she was in when she went online in search of answers after the November presidential election, only to have the mayor of her town steer her toward the group for her district. On Thursday night, she was wearing a “volunteer” nametag and manning a table covered in buttons and other gear in the synagogue’s entryway, alongside Myrna Brome of West Orange. Both women said they had gotten involved after considering the implications of a Trump presidency for their children. Matthew Walters of Montclair asked the last question of the night. He noted that another New Jersey Congressman, a Republican, once spoke up in a tough time for the country and his party. Looking into the camera he asked: “How much damage does Donald Trump have to do to the country and the party before you have your own Peter Frelinghuysen moment?” The only answer he got was a standing ovation. ", "name": "1065", "child": "1065_1\t1065_2\t1065_3", "timestamp": "Feb 24"}