{"parent": "", "title": "Our congressman wouldn’t meet with us, so we took matters into our own hands", "author": "Andrew Kohn", "sentences": [{"7140": "Our congressman wouldn’t meet with us, so we took matters into our own hands"}, {"fcae": "We need our congressman to know this is not a game."}, {"c9be": "CLINTONVILLE, OHIO — What happens when your congressman won’t agree to meet with his constituents? If you live in Ohio’s 12th district, you take matters into your own hands."}, {"fab2": "On Wednesday night, over 1,000 of Rep. Pat Tiberi’s constituents held their own town hall. The congressman was invited, but instead decided to attend a private fundraiser outside his district. To remind everyone of Tiberi’s absence, there was a table set up at the entrance of the town hall, with fine china and a reminder that if you could pay $400, you too could see your publicly elected official that night."}, {"0ecd": "There was a life-size cut-out of Tiberi — “Flat Pat” as people called it — that was the closest his constituents would come to seeing him that night."}, {"a205": "As Chairman of the House Ways and Means Health Subcommitte, Tiberi has been called the “quarterback” in finding a replacement for the Affordable Care Act (ACA). But on Wednesday, he wasn’t there to hear his constituents’ thoughts about it."}, {"88d9": "“When your health care relies on kindness and charity, there’s no security, there’s only a series of small emergencies punctuated by nervous silence,” said Julie S., from Worthington. “Representative Tiberi promised me that ‘We aren’t going backwards,’ but the plans the current congress has put forward will take away some people’s insurance and put living, surviving, out of reach financially for some of us.”"}, {"2113": "Amandalynn R., from Columbus, said she was saved by the ACA. “After college I was no longer covered by my parent’s insurance, and I was in the middle of an intense treatment plan for my leukemia,” she said. “In the one year and eight months before I was eligible for insurance through the ACA, I had racked up twice my four-year college debt for just one of my medications.”"}, {"4756": "Mitch L. of Granville has three children, who together, have nine auto-immune diseases. “To tell my children that here, in one of the richest, most advanced nations in the world, their lives might once again be in jeopardy because the life-saving medicine might not be available to them because they can’t afford it without insurance but they can’t get insurance because their immune systems are broken.”"}, {"845f": "The most powerful moments of the meeting came during the question and answer session. Questions were asked. And because Tiberi wasn’t there, they were followed by silence."}, {"a446": "Constituents talked to an empty chair, asking what they should do if they have a pre-existing condition and the ACA is repealed. They asked about the cost of medication, the need for greater care, and they gave examples of how the ACA helped support them during difficult times. They received no answers. The congressman was still attending his $400 per table fundraiser."}, {"9517": "Our town hall on Wednesday wasn’t partisan. It was held in a house of worship. It was a community coming together to help those in need. People came with donations for the local food bank, and there was a mini-clinic on site, where people could get basic medical testing done and learn about their health care options. People shared their stories about how access to health care saved their lives."}, {"c3ef": "We need our congressman, and members of Congress throughout the country, to know this isn’t a game. The lives of your constituents are very much in danger. We are not paid protesters, or secret agents from the liberal elite. We are everyday Americans. We are teachers and nurses. Our children attend public schools, and we know that our success is very much dependent on that of our neighbors. While the lack of support from our congressman is frustrating, we have not lost hope. If Tiberi won’t listen to his constituents and address our concerns, then we will find someone who is ready and willing to listen in 2018. This is what democracy looks like."}, {"4ad3": "Andrew Kohn has worked for members of Congress, in the Obama White House, and currently is at Planned Parenthood of Greater Ohio. He is a member of the Granville, OH Board of Education and active in Indivisible: Ohio District 12."}], "content": "Our congressman wouldn’t meet with us, so we took matters into our own hands We need our congressman to know this is not a game. CLINTONVILLE, OHIO — What happens when your congressman won’t agree to meet with his constituents? If you live in Ohio’s 12th district, you take matters into your own hands. On Wednesday night, over 1,000 of Rep. Pat Tiberi’s constituents held their own town hall. The congressman was invited, but instead decided to attend a private fundraiser outside his district. To remind everyone of Tiberi’s absence, there was a table set up at the entrance of the town hall, with fine china and a reminder that if you could pay $400, you too could see your publicly elected official that night. There was a life-size cut-out of Tiberi — “Flat Pat” as people called it — that was the closest his constituents would come to seeing him that night. As Chairman of the House Ways and Means Health Subcommitte, Tiberi has been called the “quarterback” in finding a replacement for the Affordable Care Act (ACA). But on Wednesday, he wasn’t there to hear his constituents’ thoughts about it. “When your health care relies on kindness and charity, there’s no security, there’s only a series of small emergencies punctuated by nervous silence,” said Julie S., from Worthington. “Representative Tiberi promised me that ‘We aren’t going backwards,’ but the plans the current congress has put forward will take away some people’s insurance and put living, surviving, out of reach financially for some of us.” Amandalynn R., from Columbus, said she was saved by the ACA. “After college I was no longer covered by my parent’s insurance, and I was in the middle of an intense treatment plan for my leukemia,” she said. “In the one year and eight months before I was eligible for insurance through the ACA, I had racked up twice my four-year college debt for just one of my medications.” Mitch L. of Granville has three children, who together, have nine auto-immune diseases. “To tell my children that here, in one of the richest, most advanced nations in the world, their lives might once again be in jeopardy because the life-saving medicine might not be available to them because they can’t afford it without insurance but they can’t get insurance because their immune systems are broken.” The most powerful moments of the meeting came during the question and answer session. Questions were asked. And because Tiberi wasn’t there, they were followed by silence. Constituents talked to an empty chair, asking what they should do if they have a pre-existing condition and the ACA is repealed. They asked about the cost of medication, the need for greater care, and they gave examples of how the ACA helped support them during difficult times. They received no answers. The congressman was still attending his $400 per table fundraiser. Our town hall on Wednesday wasn’t partisan. It was held in a house of worship. It was a community coming together to help those in need. People came with donations for the local food bank, and there was a mini-clinic on site, where people could get basic medical testing done and learn about their health care options. People shared their stories about how access to health care saved their lives. We need our congressman, and members of Congress throughout the country, to know this isn’t a game. The lives of your constituents are very much in danger. We are not paid protesters, or secret agents from the liberal elite. We are everyday Americans. We are teachers and nurses. Our children attend public schools, and we know that our success is very much dependent on that of our neighbors. While the lack of support from our congressman is frustrating, we have not lost hope. If Tiberi won’t listen to his constituents and address our concerns, then we will find someone who is ready and willing to listen in 2018. This is what democracy looks like. Andrew Kohn has worked for members of Congress, in the Obama White House, and currently is at Planned Parenthood of Greater Ohio. He is a member of the Granville, OH Board of Education and active in Indivisible: Ohio District 12. ", "name": "1067", "child": "1067_1\t1067_2\t1067_3\t1067_4\t1067_51067_1\t1067_2\t1067_3\t1067_4\t1067_5", "timestamp": "Feb 24"}