{"parent": "", "title": "Republican congressman says he won’t hold town hall because people could die", "author": "Aaron Rupar", "sentences": [{"f8d4": "Republican congressman says he won’t hold town hall because people could die"}, {"2c29": "Rep. Gohmert cites the Gabby Giffords shooting."}, {"1131": "In a letter to his constituents, Rep. Louie Gohmert (R-TX) announced he won’t be holding an in-person town hall anytime soon because “there are groups from the more violent strains of the leftist ideology, some even being paid, who are preying on public town halls to wreak havoc and threaten public safety.”"}, {"d2d1": "But there’s no evidence of that."}, {"49c0": "Though Republican member of Congress have been grilled about their support for repealing Obamacare and Trump’s agenda during recent town halls— sometimes even by children — there hasn’t been any violence. And reporters who have searched for paid protesters haven’t been able to find them."}, {"e52c": "In his letter, Gohmert even mentioned Gabby Giffords, the former Arizona congresswoman who was shot while chatting with constituents outside a grocery store in 2011, to bolster his claim that holding a town hall would be dangerous."}, {"9774": "“Threats are nothing new to me and I have gotten my share as a felony judge,” he writes. “However, the House Sergeant at Arms advised us after former Congresswoman Gabby Giffords was shot at a public appearance, that civilian attendees at Congressional public events stand the most chance of being harmed or killed — just as happened there.”"}, {"e40d": "Arkansas boy has epic confrontation with Republican senator “Toby. I am Toby.”thinkprogress.org"}, {"f394": "In lieu of an in-person town hall, Gohmert pledges to hold a “telephone town hall meeting.”"}, {"ebcf": "“Then, when the threat of violence at town hall meetings recedes, we can go back to having the civil town hall meetings I’ve had in the past to supplement the masses reached in our telephone town halls,” he adds."}, {"ab6e": "Gohmert signaled his ongoing support for repealing Obamacare, but said nothing about what his preferred replacement would look like."}, {"41a0": "“I very much appreciate hearing from the most vocal who form part of the very important twenty-six percent who disagreed with my seven year position on Obamacare, and I really believe that if we do the right things after repealing Obamacare, that even most of those who like government control of their lives in Obamacare, will acknowledge that things are better with more personal choices at a lower price,” Gohmert wrote."}, {"83cc": "Gohmert’s lack of a real replacement plan — while offering platitudes — echoes the talking points other prominent Republicans are running with, including Vice President Mike Pence."}, {"530e": "Referring to the Indivisible guide organizers across the country are using to make sure people turn out at Republican town halls, Gohmert writes that “some public town halls from this particular group recently boasted having agitators even come in from other states to cause havoc.”"}, {"cd84": "But journalists unflaggingly report that people at Republican town halls are overwhelmingly residents of the districts where they’re held. On Thursday morning, New York Times reporter Trip Gabriel refuted Rep. Marsha Blackburn’s (R-TN) claim that the people booing her at her town hall largely weren’t her constituents."}, {"585a": "While numerous Republican members of Congress are trying to delegitimize the activism on display at recent town halls as being the work of paid protesters or outside agitators, Tim Phillips, president of the conservative Americans for Prosperity group, is willing to at least acknowledge the grassroots energy on the left is real."}, {"42d3": "“It’s absolutely real, and it would be a mistake to try to say it’s astroturf,” Phillips told RealClearPolitics. “It’s just like how the Tea Party and explosion of activity we had was real.”"}, {"959e": "UPDATE: Giffords herself has weighed in."}], "content": "Republican congressman says he won’t hold town hall because people could die Rep. Gohmert cites the Gabby Giffords shooting. In a letter to his constituents, Rep. Louie Gohmert (R-TX) announced he won’t be holding an in-person town hall anytime soon because “there are groups from the more violent strains of the leftist ideology, some even being paid, who are preying on public town halls to wreak havoc and threaten public safety.” But there’s no evidence of that. Though Republican member of Congress have been grilled about their support for repealing Obamacare and Trump’s agenda during recent town halls— sometimes even by children — there hasn’t been any violence. And reporters who have searched for paid protesters haven’t been able to find them. In his letter, Gohmert even mentioned Gabby Giffords, the former Arizona congresswoman who was shot while chatting with constituents outside a grocery store in 2011, to bolster his claim that holding a town hall would be dangerous. “Threats are nothing new to me and I have gotten my share as a felony judge,” he writes. “However, the House Sergeant at Arms advised us after former Congresswoman Gabby Giffords was shot at a public appearance, that civilian attendees at Congressional public events stand the most chance of being harmed or killed — just as happened there.” Arkansas boy has epic confrontation with Republican senator “Toby. I am Toby.”thinkprogress.org In lieu of an in-person town hall, Gohmert pledges to hold a “telephone town hall meeting.” “Then, when the threat of violence at town hall meetings recedes, we can go back to having the civil town hall meetings I’ve had in the past to supplement the masses reached in our telephone town halls,” he adds. Gohmert signaled his ongoing support for repealing Obamacare, but said nothing about what his preferred replacement would look like. “I very much appreciate hearing from the most vocal who form part of the very important twenty-six percent who disagreed with my seven year position on Obamacare, and I really believe that if we do the right things after repealing Obamacare, that even most of those who like government control of their lives in Obamacare, will acknowledge that things are better with more personal choices at a lower price,” Gohmert wrote. Gohmert’s lack of a real replacement plan — while offering platitudes — echoes the talking points other prominent Republicans are running with, including Vice President Mike Pence. Referring to the Indivisible guide organizers across the country are using to make sure people turn out at Republican town halls, Gohmert writes that “some public town halls from this particular group recently boasted having agitators even come in from other states to cause havoc.” But journalists unflaggingly report that people at Republican town halls are overwhelmingly residents of the districts where they’re held. On Thursday morning, New York Times reporter Trip Gabriel refuted Rep. Marsha Blackburn’s (R-TN) claim that the people booing her at her town hall largely weren’t her constituents. While numerous Republican members of Congress are trying to delegitimize the activism on display at recent town halls as being the work of paid protesters or outside agitators, Tim Phillips, president of the conservative Americans for Prosperity group, is willing to at least acknowledge the grassroots energy on the left is real. “It’s absolutely real, and it would be a mistake to try to say it’s astroturf,” Phillips told RealClearPolitics. “It’s just like how the Tea Party and explosion of activity we had was real.” UPDATE: Giffords herself has weighed in. ", "name": "1068", "child": "1068_1\t1068_2\t1068_3\t1068_4\t1068_5\t1068_6\t1068_7\t1068_8\t1068_9\t1068_10\t1068_11\t1068_12\t1068_13\t1068_14\t1068_15\t1068_16\t1068_17\t1068_18\t1068_19\t1068_20\t1068_21\t1068_22\t1068_23\t1068_24\t1068_251068_1\t1068_2\t1068_3\t1068_4\t1068_5\t1068_6\t1068_7\t1068_8\t1068_9\t1068_10\t1068_11\t1068_12\t1068_13\t1068_14\t1068_15\t1068_16\t1068_17\t1068_18\t1068_19\t1068_20\t1068_21\t1068_22\t1068_23\t1068_24\t1068_25", "timestamp": "Feb 23"}