{"parent": "", "title": "Nancy Pelosi says Obamacare payments are not optional", "author": "Casey Quinlan", "sentences": [{"5aeb": "Nancy Pelosi says Obamacare payments are not optional"}, {"0019": "An aide to Pelosi said Trump’s threat to payments is also a a “threat to keeping government open.”"}, {"6e68": "House Minority Leader Nancy Pelosi of Calif. speaks with reporters about Democratic objections to the GOP agenda, Thursday, March 30, 2017, on Capitol Hill in Washington. CREDIT:"}, {"1428": "Responding to President Donald Trump’s threat to end crucial Obamacare payments, House Democratic Leader Nancy Pelosi (D-CA) made a threat of her own. An aide to Pelosi said that if the payments aren’t included in the next spending bill, there could be a government shutdown."}, {"9390": "The payments, called cost-sharing reductions, reimburse insurers. These payments help a lot of low-income people access health care. If the payments stopped, insurers could leave the market or raise premiums by 19 percent to make up for them."}, {"6fc9": "This week, Trump told The Wall Street Journal that he is still considering whether or not to end the payments. He implied he was using the payments as leverage to force Democrats into negotiating a proposal to replace and repeal Obamacare."}, {"3688": "“Obamacare is dead next month if it doesn’t get that money. I haven’t made my viewpoint clear yet. I don’t want people to get hurt….What I think should happen and will happen is the Democrats will start calling me and negotiating,” Trump told the Journal."}, {"249e": "But whatever Trump intended with his threat, it appears to have had the opposite effect. In a written statement, an aide to Pelosi said, “The President’s comments on stopping the Cost Sharing Reduction payments will increase costs, is a threat to the good health of the American people, and a threat to keeping government open.”"}, {"e973": "Trump threatens cutting off payments for low-income people to get health care“I don’t want people to get hurt,” said Trump.thinkprogress.org"}, {"970c": "A Pelosi aide told Politico that said funding “must be included” as “permanent mandatory spending.”"}, {"d61c": "Senate Democratic Leader Charles Schumer (D-NY) is reportedly in agreement with Pelosi that the cost-sharing reductions payments have to be included in the spending bill, according to The Hill."}, {"fe0f": "Lawmakers would have to work fast to avoid a government shutdown. The current funding bill expires on April 28. Due to the two-week recess, lawmakers would have only a few days to get the spending bill through Congress and signed by Trump. House lawmakers said they were considering a stopgap measure to move the deadline forward but the Senate has ruled it out, according to Politico."}, {"d6b6": "It’s likely that Trump’s comments made insurers even more nervous. The uncertainty created by Republicans’ efforts to repeal and replace Obamacare, ditch the bill, and then revive it again, have made it challenging for insurers to plan ahead for 2018. Qualified Health Plan applications are due to the Centers for Medicare and Medicaid Services (CMS) on June 21, and some states set filing deadlines in May. Health insurance officials are meeting with CMS administrator Seema Veera on Tuesday."}], "content": "Nancy Pelosi says Obamacare payments are not optional An aide to Pelosi said Trump’s threat to payments is also a a “threat to keeping government open.” House Minority Leader Nancy Pelosi of Calif. speaks with reporters about Democratic objections to the GOP agenda, Thursday, March 30, 2017, on Capitol Hill in Washington. CREDIT: Responding to President Donald Trump’s threat to end crucial Obamacare payments, House Democratic Leader Nancy Pelosi (D-CA) made a threat of her own. An aide to Pelosi said that if the payments aren’t included in the next spending bill, there could be a government shutdown. The payments, called cost-sharing reductions, reimburse insurers. These payments help a lot of low-income people access health care. If the payments stopped, insurers could leave the market or raise premiums by 19 percent to make up for them. This week, Trump told The Wall Street Journal that he is still considering whether or not to end the payments. He implied he was using the payments as leverage to force Democrats into negotiating a proposal to replace and repeal Obamacare. “Obamacare is dead next month if it doesn’t get that money. I haven’t made my viewpoint clear yet. I don’t want people to get hurt….What I think should happen and will happen is the Democrats will start calling me and negotiating,” Trump told the Journal. But whatever Trump intended with his threat, it appears to have had the opposite effect. In a written statement, an aide to Pelosi said, “The President’s comments on stopping the Cost Sharing Reduction payments will increase costs, is a threat to the good health of the American people, and a threat to keeping government open.” Trump threatens cutting off payments for low-income people to get health care“I don’t want people to get hurt,” said Trump.thinkprogress.org A Pelosi aide told Politico that said funding “must be included” as “permanent mandatory spending.” Senate Democratic Leader Charles Schumer (D-NY) is reportedly in agreement with Pelosi that the cost-sharing reductions payments have to be included in the spending bill, according to The Hill. Lawmakers would have to work fast to avoid a government shutdown. The current funding bill expires on April 28. Due to the two-week recess, lawmakers would have only a few days to get the spending bill through Congress and signed by Trump. House lawmakers said they were considering a stopgap measure to move the deadline forward but the Senate has ruled it out, according to Politico. It’s likely that Trump’s comments made insurers even more nervous. The uncertainty created by Republicans’ efforts to repeal and replace Obamacare, ditch the bill, and then revive it again, have made it challenging for insurers to plan ahead for 2018. Qualified Health Plan applications are due to the Centers for Medicare and Medicaid Services (CMS) on June 21, and some states set filing deadlines in May. Health insurance officials are meeting with CMS administrator Seema Veera on Tuesday. ", "name": "1072", "child": "1072_1\t1072_2\t1072_3\t1072_4\t1072_5\t1072_6", "timestamp": "Apr 14"}