{"parent": "", "title": "Transgender women sue University of Wisconsin for health benefits", "author": "Zack Ford", "sentences": [{"e45a": "Transgender women sue University of Wisconsin for health benefits"}, {"b65d": "A plan to implement the benefits was blocked last year by Gov. Scott Walker."}, {"b265": "Gov. Scott Walker (R). CREDIT: AP Photo/Andy Manis"}, {"6abb": "Two transgender women who are both employed by the University of Wisconsin have filed a federal lawsuit against the school and various state agencies after being denied health insurance coverage for transition-related procedures. The ACLU-led suit follows months of politicking in which the state’s exclusion on trans benefits was almost lifted, but then reinstated."}, {"4898": "Technically, the Wisconsin state exclusion on covering procedures for transgender state employees was set to lift on January 1. That’s why Alina Boyden, one of the plaintiffs in the suit, immediately put in her request for gender confirmation surgery the next business day. A month later, however, the Wisconsin Department of Employee Trust Funds (ETF), one of the defendants in the suit, announced that the exclusion was back in place — effective immediately — and none of the requests like hers would be considered."}, {"0b2f": "Boyden, along with her co-plaintiff Shannon Andrews, are both transgender women employed by the University of Wisconsin-Madison, making them state employees. Boyden has had to forego her gender confirmation surgery because, without insurance, she simply cannot afford it. This is despite the fact that the surgery has been prescribed for her by her primary care physician as a medically necessary procedure because it will be “the best way for her to keep her testosterone levels at goal.”"}, {"c23b": "Andrews, on the other hand, had already undergone gender confirmation surgery back in 2015. She paid for the procedure out-of-pocket, but then submitted a claim for coverage to her insurance provider. Her claims were rejected, and a series of legal challenges led her to join the current suit."}, {"aa40": "Johns Hopkins to resume gender-affirming surgeries after nearly 40 yearsThe prestigious school is finally distancing itself from its anti-trans reputation.thinkprogress.org"}, {"ef24": "Gov. Scott Walker (R) was instrumental in re-implementing the exclusion that prevents them from receiving care. Back in August, a month after ETF decided to lift it, he ordered the state Department of Justice to urge the agency to reconsider. The letter Walker had sent to ETF argued that protections on the basis of sex should not be interpreted to protect transgender people from discrimination — mirroring the logic of a lawsuit, spearheaded by Texas and later joined by Wisconsin, challenging an Obama administration rule prohibiting discrimination on the basis of gender identity in health care."}, {"b829": "In late December, the ETF agreed that it would re-implement the exclusion if a judge ruled against the federal rule. Given that the case had been shopped to a federal judge in Texas known for ruling against LGBT people (including in a similar case involving President Barack Obama’s guidance protecting transgender students from discrimination), this result was inevitable, and the decision was expected imminently."}, {"b85c": "Judge Reed O’Connor indeed granted the expected injunction on December 31, which put the ETF on track to undo the change. Under President Trump and Attorney General Jeff Sessions, the U.S. Department of Justice has since decided to let that court decision stand and not fight any further to defend the federal gender identity nondiscrimination protections implemented."}, {"a64b": "The complaint from Boyden and Andrews highlights the fact that “every major medical organization and the overwhelming consensus among medical experts” agree that the treatment these women have received and been prescribed are “effective, safe, and medically necessary” to alleviate their gender dysphoria. Likewise, there is also a consensus among those professionals that “discriminatory exclusions of transition-related health care have no basis in medical science.”"}, {"67f9": "Wisconsin Governor Defends Ban On Same-Sex Marriage As ‘Healthy Balance’ Of LGBT Rightsthinkprogress.org"}, {"b010": "Conservatives are already crowing that these women simply want Wisconsin to pay for their surgeries — treatment that, like transgender identities themselves, they reject as illegitimate. The state itself is similarly echoing the concern that covering trans women’s medically necessary health concerns is just too expensive. Tom Evenson, a spokesperson for Walker, defended the exclusion in an email to the Milwaukee Journal Sentinel."}, {"1c8a": "“We believe the policy adopted by the (state) is a reasonable measure,” Evenson insisted, “that protects taxpayers from funding sex changes for state employees and complies with both state and federal law.”"}, {"4c85": "A consultant had previously estimated that the costs of covering trans people’s health needs would come out to between $100,000 and $250,000. That’s not per person; that’s for covering trans state employees across the entire state. The total non-Medicare premiums for the State of Wisconsin Group Health Insurance Plan amount to about $1.3 billion, meaning that the cost of providing transgender people with the services their doctors have prescribed for them would amount to, at most, less than .02 percent of the budget."}, {"27a5": "In a statement, Andrews noted that being denied coverage for medical services based on identity can be truly devastating. “Many people can relate to paying into an insurance plan only to be told that the treatment they need is not covered,” she said. “But when the reason you are denied coverage is because of who you are, it is even more painful. And it’s clearly discrimination.”"}], "content": "Transgender women sue University of Wisconsin for health benefits A plan to implement the benefits was blocked last year by Gov. Scott Walker. Gov. Scott Walker (R). CREDIT: AP Photo/Andy Manis Two transgender women who are both employed by the University of Wisconsin have filed a federal lawsuit against the school and various state agencies after being denied health insurance coverage for transition-related procedures. The ACLU-led suit follows months of politicking in which the state’s exclusion on trans benefits was almost lifted, but then reinstated. Technically, the Wisconsin state exclusion on covering procedures for transgender state employees was set to lift on January 1. That’s why Alina Boyden, one of the plaintiffs in the suit, immediately put in her request for gender confirmation surgery the next business day. A month later, however, the Wisconsin Department of Employee Trust Funds (ETF), one of the defendants in the suit, announced that the exclusion was back in place — effective immediately — and none of the requests like hers would be considered. Boyden, along with her co-plaintiff Shannon Andrews, are both transgender women employed by the University of Wisconsin-Madison, making them state employees. Boyden has had to forego her gender confirmation surgery because, without insurance, she simply cannot afford it. This is despite the fact that the surgery has been prescribed for her by her primary care physician as a medically necessary procedure because it will be “the best way for her to keep her testosterone levels at goal.” Andrews, on the other hand, had already undergone gender confirmation surgery back in 2015. She paid for the procedure out-of-pocket, but then submitted a claim for coverage to her insurance provider. Her claims were rejected, and a series of legal challenges led her to join the current suit. Johns Hopkins to resume gender-affirming surgeries after nearly 40 yearsThe prestigious school is finally distancing itself from its anti-trans reputation.thinkprogress.org Gov. Scott Walker (R) was instrumental in re-implementing the exclusion that prevents them from receiving care. Back in August, a month after ETF decided to lift it, he ordered the state Department of Justice to urge the agency to reconsider. The letter Walker had sent to ETF argued that protections on the basis of sex should not be interpreted to protect transgender people from discrimination — mirroring the logic of a lawsuit, spearheaded by Texas and later joined by Wisconsin, challenging an Obama administration rule prohibiting discrimination on the basis of gender identity in health care. In late December, the ETF agreed that it would re-implement the exclusion if a judge ruled against the federal rule. Given that the case had been shopped to a federal judge in Texas known for ruling against LGBT people (including in a similar case involving President Barack Obama’s guidance protecting transgender students from discrimination), this result was inevitable, and the decision was expected imminently. Judge Reed O’Connor indeed granted the expected injunction on December 31, which put the ETF on track to undo the change. Under President Trump and Attorney General Jeff Sessions, the U.S. Department of Justice has since decided to let that court decision stand and not fight any further to defend the federal gender identity nondiscrimination protections implemented. The complaint from Boyden and Andrews highlights the fact that “every major medical organization and the overwhelming consensus among medical experts” agree that the treatment these women have received and been prescribed are “effective, safe, and medically necessary” to alleviate their gender dysphoria. Likewise, there is also a consensus among those professionals that “discriminatory exclusions of transition-related health care have no basis in medical science.” Wisconsin Governor Defends Ban On Same-Sex Marriage As ‘Healthy Balance’ Of LGBT Rightsthinkprogress.org Conservatives are already crowing that these women simply want Wisconsin to pay for their surgeries — treatment that, like transgender identities themselves, they reject as illegitimate. The state itself is similarly echoing the concern that covering trans women’s medically necessary health concerns is just too expensive. Tom Evenson, a spokesperson for Walker, defended the exclusion in an email to the Milwaukee Journal Sentinel. “We believe the policy adopted by the (state) is a reasonable measure,” Evenson insisted, “that protects taxpayers from funding sex changes for state employees and complies with both state and federal law.” A consultant had previously estimated that the costs of covering trans people’s health needs would come out to between $100,000 and $250,000. That’s not per person; that’s for covering trans state employees across the entire state. The total non-Medicare premiums for the State of Wisconsin Group Health Insurance Plan amount to about $1.3 billion, meaning that the cost of providing transgender people with the services their doctors have prescribed for them would amount to, at most, less than .02 percent of the budget. In a statement, Andrews noted that being denied coverage for medical services based on identity can be truly devastating. “Many people can relate to paying into an insurance plan only to be told that the treatment they need is not covered,” she said. “But when the reason you are denied coverage is because of who you are, it is even more painful. And it’s clearly discrimination.” ", "name": "1075", "child": "1075_1\t1075_2\t1075_3\t1075_4", "timestamp": "Apr 12"}