{"parent": "", "title": "Premiums under Trumpcare would be lower for all the wrong reasons", "author": "Casey Quinlan", "sentences": [{"577e": "Premiums under Trumpcare would be lower for all the wrong reasons"}, {"4904": "Paul Ryan latched onto what appeared to be a bright spot in the CBO report, but it isn’t what it seems."}, {"9d5f": "House Speaker Paul Ryan of Wis., speaks during a news conference on the American Health Care Act on Capitol Hill in Washington, March 7, 2017. CREDIT: AP/Susan Walsh"}, {"1617": "Despite the fact that a CBO report projected that 24 million more people would be uninsured under Trumpcare, House Speaker Paul Ryan (R) is bragging about its lower premiums. But premiums would be lower because people would buy less generous plans and fewer older people would be able to buy coverage."}, {"4f66": "Minutes after the CBO released the report, Speaker Ryan tweeted that the CBO confirmed the American Healthcare Act would lower premiums."}, {"3fed": "The report projected that average premiums for single policyholders in the nongroup insurance market would be 15 to 20 percent higher than under the Affordable Care Act (ACA) in 2018 and 2019, because fewer health people would sign up. But beginning in 2020, the CBO said, the increase in premiums would offset by grants to states by Patient and State Stability Fund and the fact that the plan gets rid of the requirement for insurers to offer more generous plans. This means that eventually average insurance premium would be 10 percent lower than under the ACA by 2026."}, {"a6d2": "But the premiums are lower because insurance would be so expensive for older people that they would exit the market and become uninsured. Under the House GOP plan, insurance companies would be allowed to charge five times more for older enrollees. Under the ACA, they could only charge three times more for older enrollees than younger people. This means there would be a larger share of younger people in the nongroup market and a smaller share of older people."}, {"7b42": "The CBO projected that premiums in the nongroup market would be “20 percent to 25 percent lower for a 21-year-old and 8 percent to 10 percent lower for a 40-year-old — but 20 percent to 25 percent higher for a 64-year-old.”"}, {"a569": "With a pool of healthier people who are much cheaper to cover, premiums would fall, healthcare experts explained. Premiums would also be lower under Trumpcare because people would buy skimpier — and cheaper — coverage, said Cynthia Cox, associate director, and Larry Levitt, senior vice president, at the Kaiser Family Foundation. Lower-income people who are still able to buy any coverage under the plan would go from higher quality plans to lower quality plans. Deductibles would also be higher under Trumpcare than the ACA."}, {"0a1d": "The CBO estimates that repealing the ACA’s actuarial value requirements for different tiers, with two tiers being about 80 percent and 90 percent, would lower the actuarial value on average, which means that on average, people would have less generous coverage. For example, a plan with an actuarial value of 70 percent means that 70 percent of health care expenses will be paid for and the rest — made up of copays, deductibles, and coinsurance — would be paid for by enrollees. The CBO report reads:"}, {"cd22": "As a result, an insurer could choose to sell only plans with lower actuarial values. Many insurers would find that option attractive because they could offer a plan priced closer to the amount of the premium tax credit so that a younger person would have low out-of-pocket costs for premiums and would be more likely to enroll. Insurers might be less likely to offer plans with high actuarial values out of a fear of attracting a greater proportion of less healthy enrollees to those plans, although the availability of the Patient and State Stability Fund grants in most states would reduce that risk."}, {"05b8": "Since these requirements would be eliminated and plans would cover a lower share of health care costs, premiums would fall on average, the CBO concluded."}], "content": "Premiums under Trumpcare would be lower for all the wrong reasons Paul Ryan latched onto what appeared to be a bright spot in the CBO report, but it isn’t what it seems. House Speaker Paul Ryan of Wis., speaks during a news conference on the American Health Care Act on Capitol Hill in Washington, March 7, 2017. CREDIT: AP/Susan Walsh Despite the fact that a CBO report projected that 24 million more people would be uninsured under Trumpcare, House Speaker Paul Ryan (R) is bragging about its lower premiums. But premiums would be lower because people would buy less generous plans and fewer older people would be able to buy coverage. Minutes after the CBO released the report, Speaker Ryan tweeted that the CBO confirmed the American Healthcare Act would lower premiums. The report projected that average premiums for single policyholders in the nongroup insurance market would be 15 to 20 percent higher than under the Affordable Care Act (ACA) in 2018 and 2019, because fewer health people would sign up. But beginning in 2020, the CBO said, the increase in premiums would offset by grants to states by Patient and State Stability Fund and the fact that the plan gets rid of the requirement for insurers to offer more generous plans. This means that eventually average insurance premium would be 10 percent lower than under the ACA by 2026. But the premiums are lower because insurance would be so expensive for older people that they would exit the market and become uninsured. Under the House GOP plan, insurance companies would be allowed to charge five times more for older enrollees. Under the ACA, they could only charge three times more for older enrollees than younger people. This means there would be a larger share of younger people in the nongroup market and a smaller share of older people. The CBO projected that premiums in the nongroup market would be “20 percent to 25 percent lower for a 21-year-old and 8 percent to 10 percent lower for a 40-year-old — but 20 percent to 25 percent higher for a 64-year-old.” With a pool of healthier people who are much cheaper to cover, premiums would fall, healthcare experts explained. Premiums would also be lower under Trumpcare because people would buy skimpier — and cheaper — coverage, said Cynthia Cox, associate director, and Larry Levitt, senior vice president, at the Kaiser Family Foundation. Lower-income people who are still able to buy any coverage under the plan would go from higher quality plans to lower quality plans. Deductibles would also be higher under Trumpcare than the ACA. The CBO estimates that repealing the ACA’s actuarial value requirements for different tiers, with two tiers being about 80 percent and 90 percent, would lower the actuarial value on average, which means that on average, people would have less generous coverage. For example, a plan with an actuarial value of 70 percent means that 70 percent of health care expenses will be paid for and the rest — made up of copays, deductibles, and coinsurance — would be paid for by enrollees. The CBO report reads: As a result, an insurer could choose to sell only plans with lower actuarial values. Many insurers would find that option attractive because they could offer a plan priced closer to the amount of the premium tax credit so that a younger person would have low out-of-pocket costs for premiums and would be more likely to enroll. Insurers might be less likely to offer plans with high actuarial values out of a fear of attracting a greater proportion of less healthy enrollees to those plans, although the availability of the Patient and State Stability Fund grants in most states would reduce that risk. Since these requirements would be eliminated and plans would cover a lower share of health care costs, premiums would fall on average, the CBO concluded. ", "name": "1086", "child": "1086_1\t1086_2\t1086_3\t1086_4\t1086_5", "timestamp": "Mar 14"}