{"parent": "", "title": "Republicans don’t understand how poor people access health care", "author": "Casey Quinlan", "sentences": [{"ba25": "Republicans don’t understand how poor people access health care"}, {"b660": "“There is a group of people that just don’t want health care and aren’t going to take care of themselves.”"}, {"5250": "House Speaker Paul Ryan of Wis. administers the House oath of office to Rep. Roger Marshall, R-Kan., during a mock swearing in ceremony on Capitol Hill in Washington, Tuesday, Jan. 3, 2017, as the 115th Congress began. CREDIT: AP/Zach Gibson"}, {"4283": "A first-term Republican Congressman answered a journalist’s question about Medicaid expansion by answering that the poor “just don’t want health care.” Rep. Roger Marshall (R-KS) told STAT, a national health news publication, “There is a group of people that just don’t want health care and aren’t going to take care of themselves.”"}, {"cf4f": "The research doesn’t support Marshall’s claim that low-income people “morally, spiritually, socially,” don’t want access to preventive medicine."}, {"f5e6": "Research shows that people in Medicaid both have access to and use primary and preventive care at rates similar to people with employer-sponsored insurance. We also know that people with Medicaid are more likely to access health care than those without coverage. A study of Oregon’s Medicaid program showed that people with Medicaid were more likely to have a regular primary care office or clinic and use preventive care. Medicaid also substantially reduced the prevalence of depression. Studies also show that Medicaid helps patients with chronic diseases receive care that prevents their condition from worsening, according to the Kaiser Family Foundation’s brief on the effectiveness of Medicaid."}, {"8f50": "Thirty-one states and the district of Columbia have expanded Medicaid. Medicaid expansion under the Affordable Care Act has also positively affected low-income people’s financial security, the affordability of health care, and access to care, most research shows."}, {"8976": "That doesn’t mean that Medicaid could not improve for people in many states or that there are no longer barriers for low-income people to access health care, however. Gaps in access to health care between low-income and high-income adults were higher in states with limited Medicaid coverage, according to a 2008 study. Low-income people also had better access to preventive services in states with broader Medicaid coverage."}, {"955d": "There are also barriers to care outside of Medicaid for low-income people to contend with, such as lack of transportation and the distribution of the health care workforce, according to KFF. Health policy experts say that the current system does not offer specific compensation for health care providers for preventive services and that there is more the Center for Medicare and Medicaid could do to invest in community-based interventions that focus on preventive care."}, {"101e": "Marshall’s comment was one of multiple tone-deaf comments about health care access made by House Republicans this week. On Tuesday, Rep. Jason Chaffetz (R-UT) said that under Trumpcare, Americans would have to make a choice between buying an iPhone and making sure they see a doctor. Since the plan doesn’t have a mandate, and would result in an increase in premiums — one insurance company CEO said they could rise by 30 percent — his comments appear to be directed at low-income Americans, who would suffer most under the plan."}], "content": "Republicans don’t understand how poor people access health care “There is a group of people that just don’t want health care and aren’t going to take care of themselves.” House Speaker Paul Ryan of Wis. administers the House oath of office to Rep. Roger Marshall, R-Kan., during a mock swearing in ceremony on Capitol Hill in Washington, Tuesday, Jan. 3, 2017, as the 115th Congress began. CREDIT: AP/Zach Gibson A first-term Republican Congressman answered a journalist’s question about Medicaid expansion by answering that the poor “just don’t want health care.” Rep. Roger Marshall (R-KS) told STAT, a national health news publication, “There is a group of people that just don’t want health care and aren’t going to take care of themselves.” The research doesn’t support Marshall’s claim that low-income people “morally, spiritually, socially,” don’t want access to preventive medicine. Research shows that people in Medicaid both have access to and use primary and preventive care at rates similar to people with employer-sponsored insurance. We also know that people with Medicaid are more likely to access health care than those without coverage. A study of Oregon’s Medicaid program showed that people with Medicaid were more likely to have a regular primary care office or clinic and use preventive care. Medicaid also substantially reduced the prevalence of depression. Studies also show that Medicaid helps patients with chronic diseases receive care that prevents their condition from worsening, according to the Kaiser Family Foundation’s brief on the effectiveness of Medicaid. Thirty-one states and the district of Columbia have expanded Medicaid. Medicaid expansion under the Affordable Care Act has also positively affected low-income people’s financial security, the affordability of health care, and access to care, most research shows. That doesn’t mean that Medicaid could not improve for people in many states or that there are no longer barriers for low-income people to access health care, however. Gaps in access to health care between low-income and high-income adults were higher in states with limited Medicaid coverage, according to a 2008 study. Low-income people also had better access to preventive services in states with broader Medicaid coverage. There are also barriers to care outside of Medicaid for low-income people to contend with, such as lack of transportation and the distribution of the health care workforce, according to KFF. Health policy experts say that the current system does not offer specific compensation for health care providers for preventive services and that there is more the Center for Medicare and Medicaid could do to invest in community-based interventions that focus on preventive care. Marshall’s comment was one of multiple tone-deaf comments about health care access made by House Republicans this week. On Tuesday, Rep. Jason Chaffetz (R-UT) said that under Trumpcare, Americans would have to make a choice between buying an iPhone and making sure they see a doctor. Since the plan doesn’t have a mandate, and would result in an increase in premiums — one insurance company CEO said they could rise by 30 percent — his comments appear to be directed at low-income Americans, who would suffer most under the plan. ", "name": "1094", "child": "1094_1\t1094_2\t1094_3\t1094_4\t1094_5\t1094_6\t1094_7\t1094_8\t1094_9\t1094_10", "timestamp": "Mar 10"}