{"parent": "", "title": "The Affordable Care Act Was Always Supposed to be Amended- Just Not Like This.", "author": "Richard Wilkins", "sentences": [{"f23f": "The Affordable Care Act Was Always Supposed to be Amended- Just Not Like This."}, {"b504": "From the moment President Barack Obama lifted his pen off the paper after he finished signing the Affordable Care Act in 2010, the legislation began needing amendments. While the Republican Party used that as a political battering ram for the remainder of his Presidency, the reality is this is how all legislation works. Whether we’re talking about Social Security, No Child Left Behind, or our tax code, the idea is that we amend legislation to fit the changing times. After Ronald Reagan passed his tax cuts, he spent much of the remainder of his Presidency tweaking them (generally upward), to make them work. On the contrary, our failure to amend the Crime Bill (which made sense at the time of it’s passage) has made that legislation a bi-partisan whipping boy, because it seems more and more antiquated to the data and outcomes we’ve seen come from it. Legislation is made to be changed as new information becomes available. That’s the idea."}, {"6d54": "Of course, that didn’t happen for the past six years, a period of time in which a Republican Congress seemed to have little interest in using their power to govern. The only legislation they would consider regarding the Affordable Care Act was repeal. If they weren’t killing President Obama’s signature bill, they weren’t touching it. Sure, they talked about “replace,” but they never put forward a plan to do it, they weren’t serious about it. Now, they finally have put forward a “replace”- and it’s completely not serious."}, {"0602": "If you want to know if a piece of legislation is at a “serious” stage yet, check and see if it has a price on it. If it’s health care legislation, also check and see how many people it will cover. If you look at Donald Trump and Paul Ryan’s monstrosity of a bill, there is yet no cost or coverage number attached to it. The reason there isn’t is rather simple- this bill is a budget buster and won’t cover as many people. It’s as simple as that. If either of those things were true in any real world, they would be releasing those numbers with the bill. Maybe they will figure out a way to twist and contort the numbers to say that later, but clearly they can’t right now."}, {"5824": "The Affordable Care Act sought to do several things within the health care market- increase access to insurance, lower the cost increases on premiums, protect consumers, and lower federal spending on health care. This “RyanCare” bill simply seeks to undo the things insurance companies and conservatives don’t like- it ends tax subsidies to lower-middle-class consumers (these are people who don’t qualify for Medicaid, have jobs that don’t provide care, and have to buy personal plans), allows insurance companies to give more money in executive bonuses (with tax credits), ends the individual mandate (welcome back to the uninsured showing up at the emergency room for care, with no way to pay) and replaces the mandate with huge surcharges to those who lapse their coverage. There are winners in their plan- wealthy people, insurance companies, and some young, healthy people. There are bigger losers though- the working poor, the elderly, health providers and anyone who was buying their own plan in the marketplace. This plan lowers taxes on the upper income earners in our country, but it hurt Medicare and Medicaid recipients and the working poor. It is basically a Republican response to the things they don’t like about the Affordable Care Act, not their twist on how to lower premiums, increase access, lower deficits and protect consumers. It’s basically going back to a pre-ACA world."}, {"fc3c": "Obviously the Affordable Care Act needed some revisions seven years after it’s passage. All legislation does. Obviously one would hope the Republican Party would bring forward it’s best and brightest ideas to solve the problems the initial ACA attempted to solve too. They didn’t. Instead the Republican Party brought forward a bill to cut taxes and cut Grandma’s coverage. Tax subsidies and health savings accounts are not the solution for people who can neither afford to save much or buy health insurance, and basically the Republican plan tells them to go to hell. This is not amending the existing legislation, it’s not even a replacement after a true repeal- it’s a middle-finger to the 20 million people who were getting quality health insurance under the Affordable Care Act, all to help health care executives and rich people. Color me shocked."}, {"7afc": "Opinions in PoliticsMeansPolitics.com are those of their authors, not the views of this website or its owners. Please support our independent journalism: Support.PoliticsMeansPolitics.com"}], "content": "The Affordable Care Act Was Always Supposed to be Amended- Just Not Like This. From the moment President Barack Obama lifted his pen off the paper after he finished signing the Affordable Care Act in 2010, the legislation began needing amendments. While the Republican Party used that as a political battering ram for the remainder of his Presidency, the reality is this is how all legislation works. Whether we’re talking about Social Security, No Child Left Behind, or our tax code, the idea is that we amend legislation to fit the changing times. After Ronald Reagan passed his tax cuts, he spent much of the remainder of his Presidency tweaking them (generally upward), to make them work. On the contrary, our failure to amend the Crime Bill (which made sense at the time of it’s passage) has made that legislation a bi-partisan whipping boy, because it seems more and more antiquated to the data and outcomes we’ve seen come from it. Legislation is made to be changed as new information becomes available. That’s the idea. Of course, that didn’t happen for the past six years, a period of time in which a Republican Congress seemed to have little interest in using their power to govern. The only legislation they would consider regarding the Affordable Care Act was repeal. If they weren’t killing President Obama’s signature bill, they weren’t touching it. Sure, they talked about “replace,” but they never put forward a plan to do it, they weren’t serious about it. Now, they finally have put forward a “replace”- and it’s completely not serious. If you want to know if a piece of legislation is at a “serious” stage yet, check and see if it has a price on it. If it’s health care legislation, also check and see how many people it will cover. If you look at Donald Trump and Paul Ryan’s monstrosity of a bill, there is yet no cost or coverage number attached to it. The reason there isn’t is rather simple- this bill is a budget buster and won’t cover as many people. It’s as simple as that. If either of those things were true in any real world, they would be releasing those numbers with the bill. Maybe they will figure out a way to twist and contort the numbers to say that later, but clearly they can’t right now. The Affordable Care Act sought to do several things within the health care market- increase access to insurance, lower the cost increases on premiums, protect consumers, and lower federal spending on health care. This “RyanCare” bill simply seeks to undo the things insurance companies and conservatives don’t like- it ends tax subsidies to lower-middle-class consumers (these are people who don’t qualify for Medicaid, have jobs that don’t provide care, and have to buy personal plans), allows insurance companies to give more money in executive bonuses (with tax credits), ends the individual mandate (welcome back to the uninsured showing up at the emergency room for care, with no way to pay) and replaces the mandate with huge surcharges to those who lapse their coverage. There are winners in their plan- wealthy people, insurance companies, and some young, healthy people. There are bigger losers though- the working poor, the elderly, health providers and anyone who was buying their own plan in the marketplace. This plan lowers taxes on the upper income earners in our country, but it hurt Medicare and Medicaid recipients and the working poor. It is basically a Republican response to the things they don’t like about the Affordable Care Act, not their twist on how to lower premiums, increase access, lower deficits and protect consumers. It’s basically going back to a pre-ACA world. Obviously the Affordable Care Act needed some revisions seven years after it’s passage. All legislation does. Obviously one would hope the Republican Party would bring forward it’s best and brightest ideas to solve the problems the initial ACA attempted to solve too. They didn’t. Instead the Republican Party brought forward a bill to cut taxes and cut Grandma’s coverage. Tax subsidies and health savings accounts are not the solution for people who can neither afford to save much or buy health insurance, and basically the Republican plan tells them to go to hell. This is not amending the existing legislation, it’s not even a replacement after a true repeal- it’s a middle-finger to the 20 million people who were getting quality health insurance under the Affordable Care Act, all to help health care executives and rich people. Color me shocked. Opinions in PoliticsMeansPolitics.com are those of their authors, not the views of this website or its owners. Please support our independent journalism: Support.PoliticsMeansPolitics.com ", "name": "1114", "child": "1114_1\t1114_21114_1\t1114_2", "timestamp": "Mar 7"}