{"parent": "", "title": "Multi-millionaire at 27. What I learned.", "author": "Duncan Riach", "sentences": [{"d1a5": "Multi-millionaire at 27. What I learned."}, {"7da5": "In the early two-thousands, I was an early employee at a Silicon Valley technology company that designs and markets cutting-edge computer processing chips. When I started, there were a few dozen other people. When I left, there were thousands. I was a computer processor engineer, architect, and manager. The company is now one of the largest and most successful in the world."}, {"a95d": "I made some number of million dollars. I never really figured out exactly how much it was. I think it might have been around five million. I know that my adjusted gross income in at least one year was about one-and-a-half million dollars. I was making at least five-hundred thousand per year."}, {"9c7f": "Here are some of the things I learned from being relatively rich."}, {"9b34": "This is what I looked like (at a costume party)"}, {"60d9": "Money doesn’t make you happy"}, {"ce7f": "Some people say that “money doesn’t make you happy,” yet they continue striving to be more wealthy in the hope of becoming more happy. It’s one thing to say it or think it, and it’s another thing altogether to experience it."}, {"a74b": "Money doesn’t make you happy, and it doesn’t make you content either. I remember getting to the end of a particularly challenging but satisfying project, putting my feet up on my desk, taking a deep breath, and realizing that I had it all."}, {"2010": "I had the fancy million-dollar house in Mountain View (where Google is based). I had a small mortgage on that house, but I could have paid that off any time I wanted. I had a house in another country that I owned outright. I had the luxury cars that I purchased with cash. I had the attractive wife at home. I was highly respected where I worked. I had freedom to work on whatever I chose. I had a very high salary, lucrative stock options, and more money than I knew what to do with."}, {"c866": "But I felt anxious and dissatisfied. On some level, my striving for success had been driven by a belief that my deep suffering would go away when I had enough wealth. I learned first-hand that once our basic needs are taken care of, the level of contentment and happiness we experience has nothing to do with how much wealth we have."}, {"a1b8": "In fact, wealth can actually make life worse. We can use wealth to distract us from our deeper issues by spending money on things we don’t need, or worrying about losing our wealth. Life might also get a lot more complicated with wealth."}, {"3673": "I have become aware that I tend to worry about not having enough money in the future, and that this fear has been with me all of my life. It is not correlated with my net equity or my net cash-flow."}, {"b94d": "You can only help people to help themselves"}, {"c268": "Instead of buying a holiday home at Lake Tahoe or a some investment properties, I purchased a house in another country for some members of my extended family to live in. I let them live there without paying rent for a few years. I was essentially giving them tens of thousands of dollars per year from my own pocket."}, {"d8a9": "I later found out that these people resented me for doing this. They felt that I was treating them like children and claimed that I had not included them in the process of choosing and buying the house. They claimed that I had caused them to lose the favorable tenancy for a much smaller house that they had with their previous landlord. They claimed that they didn’t like the house that I had bought."}, {"616c": "Financially, I lost not only the rent for that house, but enormous amounts of money in currency exchanges, in buying and selling fees, and in having a very low return on investment. The whole process consumed much of my time and energy over an extended period time."}, {"de79": "I used to believe that people were inherently reasonable and good. This process taught me that I should not assume that people can be relied upon, or that other people will necessarily receive from me in the same way that I receive from others."}, {"a653": "I learned another big lesson from this. I now never help people who don’t ask me for help, and even then I only help them to the extent that they ask. I also look for ways that I can help that don’t compromise my own position, and that require the least outlay of my money, time, and effort."}, {"ae4a": "There will always be someone richer than you"}, {"1b19": "If you equate your worth to how much stuff you have, then you will always be noticing people who have more than you, and you will always be feeling that you don’t measure-up."}, {"13fc": "If you suffer from this, you’re not going to get to some magical level of net worth and finally realize that you are valuable. In fact, the problem is going to just get worse. I bought a bigger, fancier house in Mountain View, mostly because I didn’t think that my house in Santa Clara was fancy enough. I couldn’t, at that time, buy the level of fanciness that some of my friends could. When I moved to Mountain View, one couple I knew moved from Palo Alto—which is already nicer than Mountain View—to Los Altos Hills, which is super-fancy."}, {"d4d4": "The trick is to figure out how much money you actually need and want in order to get your pragmatic needs met. How much money do you need to live a reasonable lifestyle? Optionally, you could also work out how much wealth you need to accumulate in order to become financially independent while living your chosen lifestyle."}, {"f9e1": "It’s also important to heal the wound that makes you strive to feel valuable based on what you have. I believed that I was fundamentally worthless. Through a process of psychotherapy, coaching, authentic friendships, and healing intimate relationships, I came to understand that I have a rich intrinsic value. Others enjoy me just for my essence, and I learned how to internalize that so that now I can enjoy myself just for my essence also."}, {"1397": "Luxury is an addictive drug"}, {"f97f": "The frugal blogger Mr. Money Mustache tells us that luxury is weakness. Luxury is an addictive drug. Until we understand this, it has the power to ruin our lives."}, {"854e": "I remember driving my brand new luxury sports car and noticing that my identity was becoming tied up with the car. I realized that this super-expensive car would wear out and then I would need to buy another one. To keep my identity, I would need to keep generating a lot of money. It was like having a drug habit. The car didn’t make me feel that good, but the idea of not having the car felt crappy. So I realized that I would need to keep having that fix to feel normal."}, {"7c6a": "This process of getting the drug to get back to normal is a common experience for drug addicts. Also, tolerance to the drug increases with abuse over time. An amount of the drug that was once satisfying starts to not have the desired effect. We find that we need more and more of the substance or experience to get back to normal."}, {"8bed": "The problem is that, as the U2 lyric goes, “You can never get enough of what you don’t really need.” Once you have the Porsche Cayenne Turbo, you start wishing for a Bentley Bentayga. The more luxury you have, the more luxury you need, but luxury never really satisfies the itch that it promises to scratch."}, {"bb42": "Luxury makes us feel successful, that we are winning at the game of life, that we are not only surviving, but thriving. Like an opioid in our brains, luxury locks into our survival receptors. The irony is that purchasing luxury, and being dependent on it for our sense of self and wellbeing, leads to us depleting the very resources that we actually need for survival."}, {"d244": "It turns out that having the discipline to live frugally, to invest rather than spend, to mend and make do, and to be able to live for longer and longer periods of time without having to work, are true measures of wealth. Deeply enjoying whatever it is you’re experiencing right now is the ultimate wealth."}, {"4012": "The people who are on the nine-to-five treadmill, working to pay for luxury cars to drive for two hours per day to and from work, are really on a luxury treadmill. These people are addicted to luxury."}, {"19a5": "Some people are very shallow"}, {"f8e1": "I took a long period of mid-life retirement. During that time, I have been getting a PhD, and starting some businesses. I remember one time in my early 30s being at a party when a very physically attractive woman walked up to me, introduced herself and then asked, “What do you do?” I responded, “I’m a student.”"}, {"41b5": "Before I knew it, she had turned around and walked away from me. She instantly stopped talking to me and disappeared into the crowd. I remember feeling really hurt. Thoughts of my worthless came up. Presumably, she didn’t want to speak to me because I was a student, and perhaps she thought I didn’t have any money. A few days later, after pondering what must have happened some more, I understood the irony that I was probably the richest person at the party. I also understood my luck that she didn’t stick around."}, {"def0": "I know many people with extremely high net worths. Many of these people spend their time in pajamas, or flip-flops, or shorts. You can’t tell how wealthy someone is by what they’re wearing. You also can’t tell how wealthy someone is by how much money they have."}, {"a8b1": "Everyone respects wealth"}, {"6494": "I can’t think of specific examples of this one, but I do know that I’ve had a lot of experiences of people treating me very differently when they got a sense of how much money I had. Having money seems to telegraph that you are successful, in a way that’s totally disconnected with how successful you are in other areas of your life."}, {"52bc": "I have also seen new-age kind of people talking with disdain about money, and claiming that “money doesn’t make you happy,” and “rich people are assholes,” and various other statements that show disgust for money. Then, later, I have seen these very same people starting to make and accumulate money, and I have seen them consuming conspicuously and showing off."}, {"000b": "Money is so powerful as a symbol of choice and freedom that it’s impossible for it not to galvanize powerful responses in people, and to create strong reactions."}, {"55ed": "Most financial advisors know nothing"}, {"ec1b": "I went to some financial advisors at a stock brokerage to get some advice on how to manage my money. This pair of advisors, actually “stockbrokers,” told me a lot about the marathons they ran in Hawaii before proceeding to advise me to buy a bunch of individual stocks. Over a period of months, they would call me, “We like Lucent Technologies!” and I would say, “Okay, buy $20,000 of that for me.” and then they would bill me $1,000 brokerage commission. That’s a 5% commission for “liking” something. I was a fool. I had an online brokerage account where I could have got the same stock for a $10 fee."}, {"4234": "When I told them about my stock options, they said, “Never heard of that company! You need to get out of that!” I ended up cashing-in large chunks of the stock in my company to buy all these hot internet stocks that they liked. During my last meeting with them, they asked me if they could exercise and sell some more of my stock options in order to buy some of company X. I told them I couldn’t because I was in a black-out period. They looked confused."}, {"b411": "Later, I got an email telling me that a bunch of my stock options had been exercised and sold and that I was the proud owner of company X. I called them to ask what was happening. They said that I had told them to sell the stock. I said I hadn’t. The guy on the phone told me that his partner had been there and witnessed it. I told them to undo the stock trades before I got jailed for insider trading, and I fired them."}, {"1b52": "That’s when I realized that I had hundreds of thousands of dollars worth of stock in companies that I knew nothing about. Looking back, I feel consoled understanding that the stock brokers knew nothing about the stocks either. That’s also when the dot-com bubble burst and that basket of stocks halved in price, while the stock for the company I worked at kept on climbing (it wasn’t a dot com company)."}, {"d7f2": "I started reading books about investment. The most valuable information I learned was from Warren Buffet. He says that if you don’t have the time or interest to investigate and track individual stocks, it’s best to buy index funds or index-tracking stocks. This is because most mutual fund managers can’t beat the market, and yet they charge hefty commissions. With these stockbrokers, I had not even been buying managed mutual funds, I was buying individual stocks, relying only on their choices. That’s the worst thing I could have done."}, {"7395": "I have also learned that most of the people on Wall Street either don’t know what’s really going on, for one reason or another, or they’re unable to make the most effective decisions. For example, most Wall Street types are out of touch with what’s happening in the real world, so they don’t know what the trends are. In the book Laughing at Wall Street, the author explains how he made millions by beating institutional investors into and out of stocks by noticing trends on the street months before the institutional investors became aware of them. An example of limitations in the decision-making choices of large mutual funds is that small- and medium-sized companies tend to grow at a significantly faster rate than the entire market, yet large mutual funds are unable or unwilling to invest in them because they’re too small. Mutual funds often have to maintain certain mixes of investments to stay within the parameters specified to those who have already invested in them. It’s hard for even hedge funds to make effective long-term choices, because they are always trying to keep their investors happy in the short-term."}, {"eca3": "Note that I’m talking about real Wall Street types, real investment bankers and mutual fund managers. My local stockbrokers were not even that. Nevertheless, the incompetence on Wall Street is staggering. I recommend reading the book The Big Short (a movie was made of it), to understand how much opportunity there is to make money by taking the radical approach of reading financial reports and thinking about them. By the way, reading and thinking are two of Warren Buffet’s secret weapons."}, {"428d": "Banks rip-off wealthy people too"}, {"1ff3": "I have transferred a lot of money between countries, and I have used services provided by banks to help wealthy people to move their money around effortlessly. After a few experiences of losing enormous amounts of money in these transactions, I looked into it more deeply, and discovered that even though the banks don’t charge a fee for transferring money between countries and currencies, they do add a spread onto the exchange rate. This spread is so large (several percent) that they can make an enormous amount of money on a single transaction."}, {"f010": "For example, if you moved $1,000,000 between two currencies, a bank might add a 5% spread to the transaction for an unsuspecting wealthy customer. So then the transaction would cost an additional $50,000. That’s a completely unnecessary expense."}, {"7d09": "After a few instances of transferring money internationally using my bank, I understood this problem. I kept finding much less money in the target currency than I had expected based on the market exchange rate. When I called the bank’s international currency trading center, based in another country, they were unable to explain to me how I could transfer money without unnecessarily enriching them in this way. It’s essentially part of their business model: make rich people feel special and then rip them off."}, {"19ec": "I discovered that there are currency brokerages that will buy and sell currencies, and transfer money internationally for you, with a variable spread that amounts to only a few thousand on a very large transaction. I’m not talking about Western Union, by the way."}, {"b011": "More zeros are just more zeros"}, {"cbf9": "You can write anything you want on a check. I have written many checks with six figures on them. I assume that it’s the same deal with seven, eight, nine, or ten figures. You just write the number on there."}, {"896f": "Banks don’t say, “oh, this is a big check!” They just honor the check. This was an eye-opener for me. The number of zeros means nothing. Large amounts of money are just large numbers. When you look at your brokerage account and see seven figures, they’re just numbers. It doesn’t make any difference."}, {"a18d": "The biggest issue people have with money is limiting beliefs"}, {"ba38": "I have worked with a lot of people in therapy, and I’ve talked to a lot of people about money and wealth. I have a very strong impression that what defines how much money or income anyone has is almost completely defined by their limiting beliefs."}, {"b8d6": "We all hold beliefs. Beliefs are held because we had experiences in the past that have not been fully lived and integrated, and that still live within our minds, controlling our actions without our conscious awareness."}, {"7d45": "Since money is such a power symbol for freedom, survival, control, power, legacy, continuation, and survival, it becomes tied up with so many of these early experiences. Our ability to generate, retain, and utilize money is almost completely defined by these unconsciously-driven beliefs."}, {"314e": "I highly recommend getting a therapist or coach to work with you on your money-related limiting beliefs."}, {"f5be": "Fuck-you-money is overrated"}, {"22ad": "I remember one time making a management decision that was overruled by my manager. I remember saying to him, “Well, I don’t agree with you, and you can fire me if you want.” He chuckled. I don’t know what he really thought of that, and nothing negative happened to me. I played the “fuck you” card, and it didn’t feel particularly good."}, {"c8cb": "In 2007, I quit my job and basically retired. I took on a large number of projects and I worked my ass off. I had the freedom to do many things that I wanted to, and many more things that didn’t really serve me. Meanwhile, I didn’t take the opportunity to really retire, to just do nothing, to backpack around the world and lie on beaches, and to surf all day."}, {"4f77": "Okay, I did spend some periods, lasting months at a time, living in inexpensive tropical places surfing a lot, but I didn’t do it as much as I now wish I had. Those experiences were good for me. Often doing the thing that is the most difficult or strange for you—which for me is going on vacation—can actually be the most transformative."}, {"d2f1": "The moral of this story is that you can have all the fuck-you-money in the world, but left to your own devices, without deep inner work, often facilitated by a great coach or therapist, you’re going to spend your time essentially fucking yourself over."}, {"45e7": "Being wealthy is a full-time job"}, {"0ba5": "There’s a foolish impression that once you have a lot of money, you can kick back and relax. To some degree this is true. You can have more choice, and you can buffer situations in your life to some degree. However, once you have assets you have to manage them, protect them, and maintain them. You need to worry about being sued, so you need insurance. You need to hire people to do stuff for you, and you need to manage them. Delegation is really hard."}, {"d457": "If you’re not careful, you will make your life more complex, with more things, and more activities. Perhaps you will use spending money and buying things as a cheap way of avoiding self-awareness. Perhaps you will become obsessed with hoarding your money and maximizing its growth."}, {"051b": "Some people become very suspicious of other people, not trusting that they really have friends, thinking that others are trying to get at their wealth. Even with the best intentions, others will seek funding and support from you. They want you to invest in their businesses and projects. They want to borrow money. All of this is a massive strain on your ability to be aware of your boundaries, and avoid being co-dependent or enabling."}, {"c885": "It’s really challenging being wealthy. Approach with caution."}, {"b724": "Conclusion"}, {"4000": "Being wealthy is not all it’s often cracked up to be. It can be amazing, if you know how to approach it. I recommend finding a guide who can help you to attain and retain the wealth you desire, and to reap the maximum benefits and pay the minimum costs."}, {"c64e": "Call to action"}, {"697b": "More Information"}], "content": "Multi-millionaire at 27. What I learned. In the early two-thousands, I was an early employee at a Silicon Valley technology company that designs and markets cutting-edge computer processing chips. When I started, there were a few dozen other people. When I left, there were thousands. I was a computer processor engineer, architect, and manager. The company is now one of the largest and most successful in the world. I made some number of million dollars. I never really figured out exactly how much it was. I think it might have been around five million. I know that my adjusted gross income in at least one year was about one-and-a-half million dollars. I was making at least five-hundred thousand per year. Here are some of the things I learned from being relatively rich. This is what I looked like (at a costume party) Money doesn’t make you happy Some people say that “money doesn’t make you happy,” yet they continue striving to be more wealthy in the hope of becoming more happy. It’s one thing to say it or think it, and it’s another thing altogether to experience it. Money doesn’t make you happy, and it doesn’t make you content either. I remember getting to the end of a particularly challenging but satisfying project, putting my feet up on my desk, taking a deep breath, and realizing that I had it all. I had the fancy million-dollar house in Mountain View (where Google is based). I had a small mortgage on that house, but I could have paid that off any time I wanted. I had a house in another country that I owned outright. I had the luxury cars that I purchased with cash. I had the attractive wife at home. I was highly respected where I worked. I had freedom to work on whatever I chose. I had a very high salary, lucrative stock options, and more money than I knew what to do with. But I felt anxious and dissatisfied. On some level, my striving for success had been driven by a belief that my deep suffering would go away when I had enough wealth. I learned first-hand that once our basic needs are taken care of, the level of contentment and happiness we experience has nothing to do with how much wealth we have. In fact, wealth can actually make life worse. We can use wealth to distract us from our deeper issues by spending money on things we don’t need, or worrying about losing our wealth. Life might also get a lot more complicated with wealth. I have become aware that I tend to worry about not having enough money in the future, and that this fear has been with me all of my life. It is not correlated with my net equity or my net cash-flow. You can only help people to help themselves Instead of buying a holiday home at Lake Tahoe or a some investment properties, I purchased a house in another country for some members of my extended family to live in. I let them live there without paying rent for a few years. I was essentially giving them tens of thousands of dollars per year from my own pocket. I later found out that these people resented me for doing this. They felt that I was treating them like children and claimed that I had not included them in the process of choosing and buying the house. They claimed that I had caused them to lose the favorable tenancy for a much smaller house that they had with their previous landlord. They claimed that they didn’t like the house that I had bought. Financially, I lost not only the rent for that house, but enormous amounts of money in currency exchanges, in buying and selling fees, and in having a very low return on investment. The whole process consumed much of my time and energy over an extended period time. I used to believe that people were inherently reasonable and good. This process taught me that I should not assume that people can be relied upon, or that other people will necessarily receive from me in the same way that I receive from others. I learned another big lesson from this. I now never help people who don’t ask me for help, and even then I only help them to the extent that they ask. I also look for ways that I can help that don’t compromise my own position, and that require the least outlay of my money, time, and effort. There will always be someone richer than you If you equate your worth to how much stuff you have, then you will always be noticing people who have more than you, and you will always be feeling that you don’t measure-up. If you suffer from this, you’re not going to get to some magical level of net worth and finally realize that you are valuable. In fact, the problem is going to just get worse. I bought a bigger, fancier house in Mountain View, mostly because I didn’t think that my house in Santa Clara was fancy enough. I couldn’t, at that time, buy the level of fanciness that some of my friends could. When I moved to Mountain View, one couple I knew moved from Palo Alto—which is already nicer than Mountain View—to Los Altos Hills, which is super-fancy. The trick is to figure out how much money you actually need and want in order to get your pragmatic needs met. How much money do you need to live a reasonable lifestyle? Optionally, you could also work out how much wealth you need to accumulate in order to become financially independent while living your chosen lifestyle. It’s also important to heal the wound that makes you strive to feel valuable based on what you have. I believed that I was fundamentally worthless. Through a process of psychotherapy, coaching, authentic friendships, and healing intimate relationships, I came to understand that I have a rich intrinsic value. Others enjoy me just for my essence, and I learned how to internalize that so that now I can enjoy myself just for my essence also. Luxury is an addictive drug The frugal blogger Mr. Money Mustache tells us that luxury is weakness. Luxury is an addictive drug. Until we understand this, it has the power to ruin our lives. I remember driving my brand new luxury sports car and noticing that my identity was becoming tied up with the car. I realized that this super-expensive car would wear out and then I would need to buy another one. To keep my identity, I would need to keep generating a lot of money. It was like having a drug habit. The car didn’t make me feel that good, but the idea of not having the car felt crappy. So I realized that I would need to keep having that fix to feel normal. This process of getting the drug to get back to normal is a common experience for drug addicts. Also, tolerance to the drug increases with abuse over time. An amount of the drug that was once satisfying starts to not have the desired effect. We find that we need more and more of the substance or experience to get back to normal. The problem is that, as the U2 lyric goes, “You can never get enough of what you don’t really need.” Once you have the Porsche Cayenne Turbo, you start wishing for a Bentley Bentayga. The more luxury you have, the more luxury you need, but luxury never really satisfies the itch that it promises to scratch. Luxury makes us feel successful, that we are winning at the game of life, that we are not only surviving, but thriving. Like an opioid in our brains, luxury locks into our survival receptors. The irony is that purchasing luxury, and being dependent on it for our sense of self and wellbeing, leads to us depleting the very resources that we actually need for survival. It turns out that having the discipline to live frugally, to invest rather than spend, to mend and make do, and to be able to live for longer and longer periods of time without having to work, are true measures of wealth. Deeply enjoying whatever it is you’re experiencing right now is the ultimate wealth. The people who are on the nine-to-five treadmill, working to pay for luxury cars to drive for two hours per day to and from work, are really on a luxury treadmill. These people are addicted to luxury. Some people are very shallow I took a long period of mid-life retirement. During that time, I have been getting a PhD, and starting some businesses. I remember one time in my early 30s being at a party when a very physically attractive woman walked up to me, introduced herself and then asked, “What do you do?” I responded, “I’m a student.” Before I knew it, she had turned around and walked away from me. She instantly stopped talking to me and disappeared into the crowd. I remember feeling really hurt. Thoughts of my worthless came up. Presumably, she didn’t want to speak to me because I was a student, and perhaps she thought I didn’t have any money. A few days later, after pondering what must have happened some more, I understood the irony that I was probably the richest person at the party. I also understood my luck that she didn’t stick around. I know many people with extremely high net worths. Many of these people spend their time in pajamas, or flip-flops, or shorts. You can’t tell how wealthy someone is by what they’re wearing. You also can’t tell how wealthy someone is by how much money they have. Everyone respects wealth I can’t think of specific examples of this one, but I do know that I’ve had a lot of experiences of people treating me very differently when they got a sense of how much money I had. Having money seems to telegraph that you are successful, in a way that’s totally disconnected with how successful you are in other areas of your life. I have also seen new-age kind of people talking with disdain about money, and claiming that “money doesn’t make you happy,” and “rich people are assholes,” and various other statements that show disgust for money. Then, later, I have seen these very same people starting to make and accumulate money, and I have seen them consuming conspicuously and showing off. Money is so powerful as a symbol of choice and freedom that it’s impossible for it not to galvanize powerful responses in people, and to create strong reactions. Most financial advisors know nothing I went to some financial advisors at a stock brokerage to get some advice on how to manage my money. This pair of advisors, actually “stockbrokers,” told me a lot about the marathons they ran in Hawaii before proceeding to advise me to buy a bunch of individual stocks. Over a period of months, they would call me, “We like Lucent Technologies!” and I would say, “Okay, buy $20,000 of that for me.” and then they would bill me $1,000 brokerage commission. That’s a 5% commission for “liking” something. I was a fool. I had an online brokerage account where I could have got the same stock for a $10 fee. When I told them about my stock options, they said, “Never heard of that company! You need to get out of that!” I ended up cashing-in large chunks of the stock in my company to buy all these hot internet stocks that they liked. During my last meeting with them, they asked me if they could exercise and sell some more of my stock options in order to buy some of company X. I told them I couldn’t because I was in a black-out period. They looked confused. Later, I got an email telling me that a bunch of my stock options had been exercised and sold and that I was the proud owner of company X. I called them to ask what was happening. They said that I had told them to sell the stock. I said I hadn’t. The guy on the phone told me that his partner had been there and witnessed it. I told them to undo the stock trades before I got jailed for insider trading, and I fired them. That’s when I realized that I had hundreds of thousands of dollars worth of stock in companies that I knew nothing about. Looking back, I feel consoled understanding that the stock brokers knew nothing about the stocks either. That’s also when the dot-com bubble burst and that basket of stocks halved in price, while the stock for the company I worked at kept on climbing (it wasn’t a dot com company). I started reading books about investment. The most valuable information I learned was from Warren Buffet. He says that if you don’t have the time or interest to investigate and track individual stocks, it’s best to buy index funds or index-tracking stocks. This is because most mutual fund managers can’t beat the market, and yet they charge hefty commissions. With these stockbrokers, I had not even been buying managed mutual funds, I was buying individual stocks, relying only on their choices. That’s the worst thing I could have done. I have also learned that most of the people on Wall Street either don’t know what’s really going on, for one reason or another, or they’re unable to make the most effective decisions. For example, most Wall Street types are out of touch with what’s happening in the real world, so they don’t know what the trends are. In the book Laughing at Wall Street, the author explains how he made millions by beating institutional investors into and out of stocks by noticing trends on the street months before the institutional investors became aware of them. An example of limitations in the decision-making choices of large mutual funds is that small- and medium-sized companies tend to grow at a significantly faster rate than the entire market, yet large mutual funds are unable or unwilling to invest in them because they’re too small. Mutual funds often have to maintain certain mixes of investments to stay within the parameters specified to those who have already invested in them. It’s hard for even hedge funds to make effective long-term choices, because they are always trying to keep their investors happy in the short-term. Note that I’m talking about real Wall Street types, real investment bankers and mutual fund managers. My local stockbrokers were not even that. Nevertheless, the incompetence on Wall Street is staggering. I recommend reading the book The Big Short (a movie was made of it), to understand how much opportunity there is to make money by taking the radical approach of reading financial reports and thinking about them. By the way, reading and thinking are two of Warren Buffet’s secret weapons. Banks rip-off wealthy people too I have transferred a lot of money between countries, and I have used services provided by banks to help wealthy people to move their money around effortlessly. After a few experiences of losing enormous amounts of money in these transactions, I looked into it more deeply, and discovered that even though the banks don’t charge a fee for transferring money between countries and currencies, they do add a spread onto the exchange rate. This spread is so large (several percent) that they can make an enormous amount of money on a single transaction. For example, if you moved $1,000,000 between two currencies, a bank might add a 5% spread to the transaction for an unsuspecting wealthy customer. So then the transaction would cost an additional $50,000. That’s a completely unnecessary expense. After a few instances of transferring money internationally using my bank, I understood this problem. I kept finding much less money in the target currency than I had expected based on the market exchange rate. When I called the bank’s international currency trading center, based in another country, they were unable to explain to me how I could transfer money without unnecessarily enriching them in this way. It’s essentially part of their business model: make rich people feel special and then rip them off. I discovered that there are currency brokerages that will buy and sell currencies, and transfer money internationally for you, with a variable spread that amounts to only a few thousand on a very large transaction. I’m not talking about Western Union, by the way. More zeros are just more zeros You can write anything you want on a check. I have written many checks with six figures on them. I assume that it’s the same deal with seven, eight, nine, or ten figures. You just write the number on there. Banks don’t say, “oh, this is a big check!” They just honor the check. This was an eye-opener for me. The number of zeros means nothing. Large amounts of money are just large numbers. When you look at your brokerage account and see seven figures, they’re just numbers. It doesn’t make any difference. The biggest issue people have with money is limiting beliefs I have worked with a lot of people in therapy, and I’ve talked to a lot of people about money and wealth. I have a very strong impression that what defines how much money or income anyone has is almost completely defined by their limiting beliefs. We all hold beliefs. Beliefs are held because we had experiences in the past that have not been fully lived and integrated, and that still live within our minds, controlling our actions without our conscious awareness. Since money is such a power symbol for freedom, survival, control, power, legacy, continuation, and survival, it becomes tied up with so many of these early experiences. Our ability to generate, retain, and utilize money is almost completely defined by these unconsciously-driven beliefs. I highly recommend getting a therapist or coach to work with you on your money-related limiting beliefs. Fuck-you-money is overrated I remember one time making a management decision that was overruled by my manager. I remember saying to him, “Well, I don’t agree with you, and you can fire me if you want.” He chuckled. I don’t know what he really thought of that, and nothing negative happened to me. I played the “fuck you” card, and it didn’t feel particularly good. In 2007, I quit my job and basically retired. I took on a large number of projects and I worked my ass off. I had the freedom to do many things that I wanted to, and many more things that didn’t really serve me. Meanwhile, I didn’t take the opportunity to really retire, to just do nothing, to backpack around the world and lie on beaches, and to surf all day. Okay, I did spend some periods, lasting months at a time, living in inexpensive tropical places surfing a lot, but I didn’t do it as much as I now wish I had. Those experiences were good for me. Often doing the thing that is the most difficult or strange for you—which for me is going on vacation—can actually be the most transformative. The moral of this story is that you can have all the fuck-you-money in the world, but left to your own devices, without deep inner work, often facilitated by a great coach or therapist, you’re going to spend your time essentially fucking yourself over. Being wealthy is a full-time job There’s a foolish impression that once you have a lot of money, you can kick back and relax. To some degree this is true. You can have more choice, and you can buffer situations in your life to some degree. However, once you have assets you have to manage them, protect them, and maintain them. You need to worry about being sued, so you need insurance. You need to hire people to do stuff for you, and you need to manage them. Delegation is really hard. If you’re not careful, you will make your life more complex, with more things, and more activities. Perhaps you will use spending money and buying things as a cheap way of avoiding self-awareness. Perhaps you will become obsessed with hoarding your money and maximizing its growth. Some people become very suspicious of other people, not trusting that they really have friends, thinking that others are trying to get at their wealth. Even with the best intentions, others will seek funding and support from you. They want you to invest in their businesses and projects. They want to borrow money. All of this is a massive strain on your ability to be aware of your boundaries, and avoid being co-dependent or enabling. It’s really challenging being wealthy. Approach with caution. Conclusion Being wealthy is not all it’s often cracked up to be. It can be amazing, if you know how to approach it. I recommend finding a guide who can help you to attain and retain the wealth you desire, and to reap the maximum benefits and pay the minimum costs. Call to action More Information ", "name": "1120", "child": "1120_1\t1120_2\t1120_3\t1120_4\t1120_5\t1120_6\t1120_7\t1120_8\t1120_9\t1120_10\t1120_11\t1120_12\t1120_13\t1120_14\t1120_15\t1120_16\t1120_17\t1120_18\t1120_19\t1120_20\t1120_21\t1120_22\t1120_23\t1120_24\t1120_25", "timestamp": "Feb 21"}