{"parent": "", "title": "Index Funds Outperform Actively Managed Funds", "author": "Nicole Dieker", "sentences": [{"b70a": "Index Funds Outperform Actively Managed Funds"}, {"6fb4": "The WSJ has a new report with a not-too-surprising conclusion."}, {"3790": "In case you needed one more argument for investing in low-cost index funds, The Wall Street Journal just released data indicating that index funds have been outperforming actively managed funds 92 percent of the time, over the last fifteen years."}, {"ebed": "Wall Street Rout: Indexes Beat Stockpickers 92% of the TimeNews Corp is a network of leading companies in the worlds of diversified media, news, education, and information…blogs.wsj.com"}, {"d01d": "That particular story is behind a paywall, but the six-minute podcast version is not:"}, {"fee2": "Indexes Beat Stock Pickers Even Over 15 Years4/14/2017 8:47AM New data show that 82% of all U.S. stock funds trailed their respective benchmarks over 15 years. The…www.wsj.com"}, {"c683": "“This is another blow to managers of stock funds who try to actively select the best stocks,” the WSJ’s Daisy Maxey explains. “They haven’t been doing well.”"}, {"5809": "The WSJ notes that some active fund managers do meet their benchmarks, though it is “very difficult for active managers to sustain” those benchmarks over time—even in the bull market of the past eight years."}, {"7817": "Index funds, meanwhile, have been doing very well. Just make sure you choose a low-cost index fund, so you don’t lose too much of your money to fees."}, {"793f": "The debate between passive and actively managed funds still “rages on,” as the WSJ puts it, and maybe it does."}, {"bb8f": "But the data, in this case, clearly comes down on one side of the debate."}], "content": "Index Funds Outperform Actively Managed Funds The WSJ has a new report with a not-too-surprising conclusion. In case you needed one more argument for investing in low-cost index funds, The Wall Street Journal just released data indicating that index funds have been outperforming actively managed funds 92 percent of the time, over the last fifteen years. Wall Street Rout: Indexes Beat Stockpickers 92% of the TimeNews Corp is a network of leading companies in the worlds of diversified media, news, education, and information…blogs.wsj.com That particular story is behind a paywall, but the six-minute podcast version is not: Indexes Beat Stock Pickers Even Over 15 Years4/14/2017 8:47AM New data show that 82% of all U.S. stock funds trailed their respective benchmarks over 15 years. The…www.wsj.com “This is another blow to managers of stock funds who try to actively select the best stocks,” the WSJ’s Daisy Maxey explains. “They haven’t been doing well.” The WSJ notes that some active fund managers do meet their benchmarks, though it is “very difficult for active managers to sustain” those benchmarks over time—even in the bull market of the past eight years. Index funds, meanwhile, have been doing very well. Just make sure you choose a low-cost index fund, so you don’t lose too much of your money to fees. The debate between passive and actively managed funds still “rages on,” as the WSJ puts it, and maybe it does. But the data, in this case, clearly comes down on one side of the debate. ", "name": "1121", "child": "1121_1\t1121_2\t1121_3\t1121_4\t1121_5\t1121_6\t1121_7\t1121_8", "timestamp": "Apr 14"}