{"parent": "", "title": "15 Essential Skills They Don’t Teach You In College", "author": "James Altucher", "sentences": [{"526e": "15 Essential Skills They Don’t Teach You In College"}, {"a6c9": "This is what I wish: that my daughters don’t go to school."}, {"583c": "I offered my oldest the very prestigious “Altucher Fellowship”. Never awarded before. Only awarded to her."}, {"c423": "Basically it says: do exactly what I tell you to do for a year and don’t go to college."}, {"a790": "I’m not sure she’s going to take it."}, {"5b0f": "Here’s my ideal program:"}, {"7460": "And, by the way, this will be cheaper than you going to college."}, {"d5b7": "Her answer, begrudgingly: I’ll think about it."}, {"d043": "Here are the skills:"}, {"8986": "A. Networking"}, {"fef6": "A corollary of leadership"}, {"a68b": "B. How to sell"}, {"6683": "Presentation, vision, motivation, sales."}, {"8aa8": "C. Negotiation"}, {"2ecc": "Which means win-win, Not war."}, {"6df5": "D. The Google Rule"}, {"e36e": "Always send people to the best resource. Even if it’s a competitor. The benefit to you comes back tenfold."}, {"e239": "E. The 1% Rule"}, {"a9d5": "Every week, try to get better 1% physically, mentally, and emotionally."}, {"2310": "F. Idea Sex (but with protection!)"}, {"f978": "G. Reinvention"}, {"e435": "Which will happen repeatedly throughout life."}, {"9590": "H. Leadership (which is really a course about how to deal with both Vision and Anger at the same time)"}, {"7bac": "Give more to others than you expect back for yourself."}, {"4b30": "I. Mastery; How to master any field"}, {"b0df": "You can’t learn this in school with each ‘field’ being regimented into equal 50 minute periods. Mastery begins when formal education ends. Find the topic that sets your heart on fire. Then combust."}, {"6dfb": "J. Finding Signal in the Noise"}, {"f4ae": "News, advice books, fees upon fees in almost every area of your life. Find the signal outside of the noise everyone else marches to ."}, {"c10d": "K. Themes > Goals"}, {"4585": "Goals will break your heart. Have a theme. You can build your days around your themes. In the short blink that thins out your life, when you reach the point where goals matter no more, the themes of your life will shine bright."}, {"8676": "L. Creativity"}, {"110b": "Take down a pad. Write down a list of ideas, everyday."}, {"7d3d": "M. Failure (a skill not taught until many years after the degree. But it is taught, believe me, you will learn it or die)."}, {"8ba2": "Learn how to fail so that failure turns into a beginning."}, {"6707": "N. Give and you will Receive"}, {"f1b0": "Give constantly to the people in your network. The value of your network increases linearly if you get to know more people, but exponentially if the people you know get to know and help eachother."}, {"af11": "O. Simple tools"}, {"02fb": "To increase productivity"}, {"3f0d": "[RELATED: Don’t Send Your Kids To College]"}, {"45c6": "If I were creating a college — these would be the only classes."}, {"fee4": "Or maybe I’m just like a failed athlete who wishes for his kids what he didn’t have for himself, whether they want it or not."}, {"fa1a": "I’ll never really know the answer."}, {"4a98": "But I do know this:"}, {"8cfc": "Or by finding a:"}, {"4519": "PLUS: mentors to model yourself after (real or virtual)"}, {"866e": "EQUALS: who can challenge you and bring out your potential"}, {"036d": "MINUS: people you can teach, to solidify your learning."}, {"333c": "Remember winning?"}, {"365f": "Remember getting an “A”? And it felt good? It felt like, “I won!”"}, {"322d": "And then it became too easy to get the As. Schools lulled us into some form of complacency, where an “A” was the new normal and anything below was considered unhealthy."}, {"b6cd": "What happened to the idea that a 40% success rate made someone the best baseball player in the history of the world?"}, {"4b95": "Or the idea that if only 50% of your business decisions are correct, you’ll have a billion dollar business."}, {"d206": "Or the idea that, in the hands of an artist, even the wrong note can be turned into beautiful music?"}, {"cdf7": "Life is improv. Not a fact test. You take the bad notes and weave them into music."}, {"3caf": "Now we get the “participation” trophy for showing up."}, {"e868": "My Mac is broken. The easiest computer in the world to use and I broke the keyboard. Do I suffer for my sins?"}, {"428e": "Of course not, I get to go to the “Genius Bar” and get it fixed. The Genius Bar at the Apple store is the participation trophy for adults."}, {"ee2b": "One day I will get good at these skills."}, {"a6f8": "I guess I lied."}, {"c8cc": "This is not a letter for my kids. This is a love letter to me."}, {"36e3": "Read more from James Altucher on Twitter, Facebook, and LinkedIn or sign up for his newsletter."}, {"9bb4": "James Altucher is the author of the bestselling book Choose Yourself, editor at The Altucher Report and host of the popular podcast, The James Altucher Show, which takes you beyond business and entrepreneurship by exploring what it means to be human and achieve well-being in a world that is increasingly complicated."}], "content": "15 Essential Skills They Don’t Teach You In College This is what I wish: that my daughters don’t go to school. I offered my oldest the very prestigious “Altucher Fellowship”. Never awarded before. Only awarded to her. Basically it says: do exactly what I tell you to do for a year and don’t go to college. I’m not sure she’s going to take it. Here’s my ideal program: And, by the way, this will be cheaper than you going to college. Her answer, begrudgingly: I’ll think about it. Here are the skills: A. Networking A corollary of leadership B. How to sell Presentation, vision, motivation, sales. C. Negotiation Which means win-win, Not war. D. The Google Rule Always send people to the best resource. Even if it’s a competitor. The benefit to you comes back tenfold. E. The 1% Rule Every week, try to get better 1% physically, mentally, and emotionally. F. Idea Sex (but with protection!) G. Reinvention Which will happen repeatedly throughout life. H. Leadership (which is really a course about how to deal with both Vision and Anger at the same time) Give more to others than you expect back for yourself. I. Mastery; How to master any field You can’t learn this in school with each ‘field’ being regimented into equal 50 minute periods. Mastery begins when formal education ends. Find the topic that sets your heart on fire. Then combust. J. Finding Signal in the Noise News, advice books, fees upon fees in almost every area of your life. Find the signal outside of the noise everyone else marches to . K. Themes > Goals Goals will break your heart. Have a theme. You can build your days around your themes. In the short blink that thins out your life, when you reach the point where goals matter no more, the themes of your life will shine bright. L. Creativity Take down a pad. Write down a list of ideas, everyday. M. Failure (a skill not taught until many years after the degree. But it is taught, believe me, you will learn it or die). Learn how to fail so that failure turns into a beginning. N. Give and you will Receive Give constantly to the people in your network. The value of your network increases linearly if you get to know more people, but exponentially if the people you know get to know and help eachother. O. Simple tools To increase productivity [RELATED: Don’t Send Your Kids To College] If I were creating a college — these would be the only classes. Or maybe I’m just like a failed athlete who wishes for his kids what he didn’t have for himself, whether they want it or not. I’ll never really know the answer. But I do know this: Or by finding a: PLUS: mentors to model yourself after (real or virtual) EQUALS: who can challenge you and bring out your potential MINUS: people you can teach, to solidify your learning. Remember winning? Remember getting an “A”? And it felt good? It felt like, “I won!” And then it became too easy to get the As. Schools lulled us into some form of complacency, where an “A” was the new normal and anything below was considered unhealthy. What happened to the idea that a 40% success rate made someone the best baseball player in the history of the world? Or the idea that if only 50% of your business decisions are correct, you’ll have a billion dollar business. Or the idea that, in the hands of an artist, even the wrong note can be turned into beautiful music? Life is improv. Not a fact test. You take the bad notes and weave them into music. Now we get the “participation” trophy for showing up. My Mac is broken. The easiest computer in the world to use and I broke the keyboard. Do I suffer for my sins? Of course not, I get to go to the “Genius Bar” and get it fixed. The Genius Bar at the Apple store is the participation trophy for adults. One day I will get good at these skills. I guess I lied. This is not a letter for my kids. This is a love letter to me. Read more from James Altucher on Twitter, Facebook, and LinkedIn or sign up for his newsletter. James Altucher is the author of the bestselling book Choose Yourself, editor at The Altucher Report and host of the popular podcast, The James Altucher Show, which takes you beyond business and entrepreneurship by exploring what it means to be human and achieve well-being in a world that is increasingly complicated. ", "name": "1127", "child": "1127_1\t1127_2\t1127_3\t1127_4\t1127_5\t1127_6\t1127_7\t1127_8\t1127_9\t1127_10\t1127_11\t1127_12\t1127_13\t1127_14\t1127_15\t1127_16\t1127_17\t1127_18\t1127_19\t1127_20\t1127_21\t1127_22\t1127_23\t1127_24\t1127_25", "timestamp": "Mar 30"}