{"parent": "", "title": "Would You Want an Anonymous Couple to Pay Off Your Student Loans?", "author": "Nicole Dieker", "sentences": [{"0b29": "Would You Want an Anonymous Couple to Pay Off Your Student Loans?"}, {"ac2c": "A server gets an unexpected tip from two generous customers."}, {"2e4e": "Billfolder Ruzielle Ganuelas suggested we look at this story of a restaurant server who got a very unusual tip:"}, {"81b1": "Hero Customers Pay Off Their Server's Student LoansA server in Hawaii won the service-industry lottery twice last week, when a couple she waited on tipped her $400, then…www.grubstreet.com"}, {"fe93": "A server in Hawaii won the service-industry lottery twice last week, when a couple she waited on tipped her $400, then decided that — as a bonus tip — they were also going to pay off her student loans."}, {"d257": "The Australian couple assumedly asked how the server ended up in Hawaii, and the server explained that she had moved to Hawaii for college but could no longer afford to attend school. Now, she was working at two different restaurants to try and pay down her debt."}, {"b2ff": "The couple decided to give her a $400 tip, and returned the next day to offer to pay off her debt—“more than $10,000”—in full."}, {"04d3": "It’s probably a sign of the times that I immediately thought “$10,000 isn’t that much!”"}, {"0cf7": "Then I asked myself if I’d want an anonymous couple to offer to pay off my debt. I’m debt-free at the moment, so this doesn’t strictly apply, but I still think I might feel a little uncomfortable. It’s too large of a gesture. It also means staying connected to this couple for the next several years, right? Would we be Facebook friends? Would they want updates? Holiday cards? Coffee dates?"}, {"0b18": "The gift could easily become a burden—and the fact that two people I didn’t know made a large, spontaneous decision to change my life suggests that they might make other large, spontaneous, life-changing decisions in the future. (“We’re going to be in your town for a month! Can we stay with you?”)"}, {"921b": "There’s no reason to suspect this real-life anonymous couple will turn out to be a burden—all I know about them is the single paragraph I read on Grub Street—but I feel like I’d be really hesitant to accept a large sum of money from two people I knew nothing about."}, {"c122": "What about you?"}], "content": "Would You Want an Anonymous Couple to Pay Off Your Student Loans? A server gets an unexpected tip from two generous customers. Billfolder Ruzielle Ganuelas suggested we look at this story of a restaurant server who got a very unusual tip: Hero Customers Pay Off Their Server's Student LoansA server in Hawaii won the service-industry lottery twice last week, when a couple she waited on tipped her $400, then…www.grubstreet.com A server in Hawaii won the service-industry lottery twice last week, when a couple she waited on tipped her $400, then decided that — as a bonus tip — they were also going to pay off her student loans. The Australian couple assumedly asked how the server ended up in Hawaii, and the server explained that she had moved to Hawaii for college but could no longer afford to attend school. Now, she was working at two different restaurants to try and pay down her debt. The couple decided to give her a $400 tip, and returned the next day to offer to pay off her debt—“more than $10,000”—in full. It’s probably a sign of the times that I immediately thought “$10,000 isn’t that much!” Then I asked myself if I’d want an anonymous couple to offer to pay off my debt. I’m debt-free at the moment, so this doesn’t strictly apply, but I still think I might feel a little uncomfortable. It’s too large of a gesture. It also means staying connected to this couple for the next several years, right? Would we be Facebook friends? Would they want updates? Holiday cards? Coffee dates? The gift could easily become a burden—and the fact that two people I didn’t know made a large, spontaneous decision to change my life suggests that they might make other large, spontaneous, life-changing decisions in the future. (“We’re going to be in your town for a month! Can we stay with you?”) There’s no reason to suspect this real-life anonymous couple will turn out to be a burden—all I know about them is the single paragraph I read on Grub Street—but I feel like I’d be really hesitant to accept a large sum of money from two people I knew nothing about. What about you? ", "name": "1128", "child": "1128_1\t1128_2\t1128_3\t1128_4\t1128_5\t1128_6\t1128_7\t1128_8\t1128_9\t1128_10\t1128_11\t1128_12\t1128_13\t1128_14\t1128_15\t1128_16\t1128_17\t1128_18\t1128_19\t1128_20\t1128_21\t1128_22\t1128_23\t1128_24\t1128_25", "timestamp": "Apr 13"}