{"parent": "", "title": "The Second Sort-Of Annual Change Bowl Guessing Game", "author": "Silvia Killingsworth", "sentences": [{"09a5": "The Second Sort-Of Annual Change Bowl Guessing Game"}, {"45a1": "(The first one was eight years ago.)"}, {"571c": "According to Dusty Matthews, Awl technician and Texan anthropologist, “the worst development for society in the last 4–6 years or so is TD Bank taking their coin machines out of their branches.” We firmly agree. Do you even know where to find a Coinstar machine these days? What do you do with your change now? Do you just throw it in the trash? I know you’re not giving it to your barista, whom you are instead lavishing with full paper dollar bills. Remember when you used to be able to go to the bank with these kinds of problems? The banks aren’t for you, the citizen, anymore—they’re for the corporations and the traders."}, {"2bb6": "Anyway, here’s a bunch of change again. Please tell us how much you think is in each bag, and/or all together. Honestly if you get either of them close that will count. You guys really fucked this up last time, FWIW—the answer was $624.58 and the highest guess without going over was $368). Keep in mind: The one on the left is mixed coinage, and the one on the right is all quarters. Coke Zero for scale:"}, {"1ef5": "The winner (i.e., whoever’s guess is closest) will win either one book selected at random from the book room or all the leftover euros and Icelandic coins or maybe an original Liana Finck drawing. I don’t know I haven’t decided yet. Here is the book room FYI:"}], "content": "The Second Sort-Of Annual Change Bowl Guessing Game (The first one was eight years ago.) According to Dusty Matthews, Awl technician and Texan anthropologist, “the worst development for society in the last 4–6 years or so is TD Bank taking their coin machines out of their branches.” We firmly agree. Do you even know where to find a Coinstar machine these days? What do you do with your change now? Do you just throw it in the trash? I know you’re not giving it to your barista, whom you are instead lavishing with full paper dollar bills. Remember when you used to be able to go to the bank with these kinds of problems? The banks aren’t for you, the citizen, anymore—they’re for the corporations and the traders. Anyway, here’s a bunch of change again. Please tell us how much you think is in each bag, and/or all together. Honestly if you get either of them close that will count. You guys really fucked this up last time, FWIW—the answer was $624.58 and the highest guess without going over was $368). Keep in mind: The one on the left is mixed coinage, and the one on the right is all quarters. Coke Zero for scale: The winner (i.e., whoever’s guess is closest) will win either one book selected at random from the book room or all the leftover euros and Icelandic coins or maybe an original Liana Finck drawing. I don’t know I haven’t decided yet. Here is the book room FYI: ", "name": "1129", "child": "1129_1\t1129_2\t1129_3\t1129_4\t1129_5\t1129_6\t1129_7\t1129_8\t1129_9\t1129_10\t1129_11\t1129_12\t1129_13\t1129_14\t1129_15", "timestamp": "Apr 14"}