{"parent": "", "title": "Add Lillian Karabaic’s ‘Oh My Dollar!’ to Your Financial Podcast Roster", "author": "Nicole Dieker", "sentences": [{"ca14": "Add Lillian Karabaic’s ‘Oh My Dollar!’ to Your Financial Podcast Roster"}, {"8aff": "I’m listening to the entire backlog."}, {"06be": "If you’re looking for another great financial podcast to fill the days between new episodes of Bad With Money, I highly recommend Lillian Karabaic’s Oh My Dollar! Taglined “personal finance with a dash of glitter,” Oh My Dollar! is both smart and entertaining—and I’m ready to listen to all of the episodes."}, {"7967": "Radio Show - Oh My Dollar!Personal finance with a dash of glitterwww.ohmydollar.com"}, {"9e28": "I discovered Karabaic’s podcast after hearing her on an episode of cartoonist Lucy Bellwood’s Patreon-only podcast, talking about how to run a creative career like a business (among other things)."}, {"5f43": "The Oh My Dollar! podcast is only one aspect of Karabaic’s larger Oh My Dollar! business; she also teaches courses like the Get Your Money Together Bootcamp for Creative People, and backs up her advice with extraordinarily detailed infographics detailing what she earns and how she spends it, down to each homemade taco."}, {"476b": "But I want to focus specifically on a recent Oh My Dollar! episode dealing with a topic I’ve been reading about lately: whether to live with your debt or pay it off as quickly as you can."}, {"aa1e": "How to go through adult life \"permanently in debt\" - Oh My Dollar!Listener Lola asks about how to plan for her future when she has six figures of college debt she'll never be able to…www.ohmydollar.com"}, {"786b": "Unlike The Value of Debt’s Tom Anderson—whom I will be interviewing for The Billfold soon, so watch for that—Karabaic advocates paying down debt as quickly as possible. Even six-figure student loan debts that will be forgiven in 30 years—because we really don’t know what’s going to happen in the next 30 years, and we can’t count on those loans being forgiven."}, {"11f5": "She advises her listener to set aside a one-month emergency fund and then start attacking her debt while simultaneously figuring out how to earn more money so that the debt can be paid off more quickly. (She also suggests her listener consider a public service job to take advantage of the Public Service Loan Forgiveness program, although she notes that isn’t always an ideal solution.)"}, {"c633": "From my perspective this listener might need a little more than a one-month emergency fund (to prevent going into further debt during a period of job loss, for example), but listening to Karabaic’s advice compared to Anderson’s makes me think about how many different ways there are to “do money,” and the more we hear about how other people do money the more options we might discover for our own finances."}, {"42c5": "So yeah, I am going to power through the backlog of Oh My Dollar! episodes, and then wait eagerly for the next one."}], "content": "Add Lillian Karabaic’s ‘Oh My Dollar!’ to Your Financial Podcast Roster I’m listening to the entire backlog. If you’re looking for another great financial podcast to fill the days between new episodes of Bad With Money, I highly recommend Lillian Karabaic’s Oh My Dollar! Taglined “personal finance with a dash of glitter,” Oh My Dollar! is both smart and entertaining—and I’m ready to listen to all of the episodes. Radio Show - Oh My Dollar!Personal finance with a dash of glitterwww.ohmydollar.com I discovered Karabaic’s podcast after hearing her on an episode of cartoonist Lucy Bellwood’s Patreon-only podcast, talking about how to run a creative career like a business (among other things). The Oh My Dollar! podcast is only one aspect of Karabaic’s larger Oh My Dollar! business; she also teaches courses like the Get Your Money Together Bootcamp for Creative People, and backs up her advice with extraordinarily detailed infographics detailing what she earns and how she spends it, down to each homemade taco. But I want to focus specifically on a recent Oh My Dollar! episode dealing with a topic I’ve been reading about lately: whether to live with your debt or pay it off as quickly as you can. How to go through adult life \"permanently in debt\" - Oh My Dollar!Listener Lola asks about how to plan for her future when she has six figures of college debt she'll never be able to…www.ohmydollar.com Unlike The Value of Debt’s Tom Anderson—whom I will be interviewing for The Billfold soon, so watch for that—Karabaic advocates paying down debt as quickly as possible. Even six-figure student loan debts that will be forgiven in 30 years—because we really don’t know what’s going to happen in the next 30 years, and we can’t count on those loans being forgiven. She advises her listener to set aside a one-month emergency fund and then start attacking her debt while simultaneously figuring out how to earn more money so that the debt can be paid off more quickly. (She also suggests her listener consider a public service job to take advantage of the Public Service Loan Forgiveness program, although she notes that isn’t always an ideal solution.) From my perspective this listener might need a little more than a one-month emergency fund (to prevent going into further debt during a period of job loss, for example), but listening to Karabaic’s advice compared to Anderson’s makes me think about how many different ways there are to “do money,” and the more we hear about how other people do money the more options we might discover for our own finances. So yeah, I am going to power through the backlog of Oh My Dollar! episodes, and then wait eagerly for the next one. ", "name": "1130", "child": "1130_1\t1130_2\t1130_3\t1130_4\t1130_5", "timestamp": "Apr 14"}