{"parent": "", "title": "The Queen of Loan Rejections", "author": "Stephanie Ashe", "sentences": [{"88a0": "The Queen of Loan Rejections"}, {"f3e9": "I built up my credit score, but that wasn’t enough."}, {"64db": "Eight years ago I sat down with a personal banker at a local credit union. I was 19, with no credit history to my knowledge, and here I was asking her to give me an auto loan. The car I had was falling apart, and I knew that every day it didn’t explode was one step closer to the day it would."}, {"0d2e": "So I went in scared but hopeful, explained my story, and pleaded a case for my punctuality and maturity. She asked if I had any collateral the bank could loan against — I didn’t, but I also didn’t know what that meant. I distinctly remember answering “I mean, I have like $1,000 in the bank?” and I don’t know how she didn’t laugh at me."}, {"ef04": "When she ran my credit report, she found that it wasn’t as empty as I had thought. It turned out my parents had made some of my tuition payments late (and some not at all) and that this had gone against my credit. I cried and realized my dream of getting a car was gone for now. I slowly paid off the unpaid tuition and kept saving until I could afford a $6,000 2001 Honda Civic. It wasn’t great, but it ran without smoking, so it would have to do."}, {"1fc0": "The woman at the credit union did give me some advice, though. She suggested I start building positive credit to balance the negative credit I had. She gave me a $300 personal loan that I would pay back over the next six months, and I went to my own bank and got a $500 secured credit card. At least it was a start."}, {"6a87": "I spent the next eight years meticulously pouring over my credit report and doing everything right. I gradually increased my credit limits on the cards I had, got my student loans back on track, and I even qualified for a new car loan this year. So, a few weeks ago, I went back into a bank to ask for a personal line of credit. The reason I want and need a LOC is another story, but the short version is: I’m poor. I’ve always been poor. I wanted some financial security in the form of an open line of credit."}, {"8a0f": "I sat down with a personal banker who guided me through the process. He was very nice, and we talked about his family, his recent trip to Europe, and how he got married when he was 17 years old! We talked about choosing between a loan and a LOC, and he happily told me I’d made the right decision based on what I had planned. Yes! The right decision!"}, {"27b8": "What we never talked about was that I was likely going to be rejected for this line of credit."}, {"1ab2": "I went to a bank that wasn’t my own, because the bank I use doesn’t offer personal loans or LOCs. I had to open a small savings account to even be able to apply—which was fine with me, because I liked the idea of having a separate savings account for a vacation fund. We finished the application, and the banker told me to expect an initial decision within 24 hours. The moment I walked into my house I got an email that my application had been rejected."}, {"98d4": "The banker and I went back and forth for about a week, and I’ll spare you those details, but the overall message was this: you asked for too much money, and you don’t bank with us. Their reasoning was that, despite an excellent credit score, I didn’t have an account history with them—which meant they didn’t know how well I managed money, so they couldn’t trust me. I had also asked for too much money compared to my salary, which is absolutely true. I somehow thought that my credit spoke for itself: “No matter how much money you loan her, she will pay it back on time. Look at this report! No late payments! She’s so trustworthy!”"}, {"ae38": "I had spent months researching banks and loans and making what I thought was the best decision. But seeing that rejection, I was blindsided. I don’t like to put the blame on other people, because I am responsible for 94 percent of the bad things that have happened to me. But in this particular instance I couldn’t help feeling mad. The banker puts in these applications every day. Why didn’t he tell me these things? Why didn’t he suggest that we lower the amount I was asking for? Why didn’t he tell me how heavily they weigh a banking history? I could have banked with them for six months or so and then applied. But he didn’t tell me those things. Instead we talked about Disney and weddings, and I thought the loan was a done deal."}, {"d954": "But it’s OK — it’s done. I’ll never be one of those people that storm into a business and demand to speak to a manager because things didn’t go my way. (Unless it happens at Taco Bell, the place that I hold most sacred.)"}, {"4835": "What I’m most upset about is that after all these years and after all this progress and thinking I was unstoppable, I’m still in the exact same position I was before. I’m embarrassed, worried, with a pitiful savings account, and not as financially secure as I’d like to be. I don’t know when that will change, but for now I’ll keep saving and sacrificing until I feel safe."}, {"4441": "Stephanie Ashe is a freelance writer, cat mom, and pop culture devotee. She’s probably talking about a 90’s movie on Twitter right now."}], "content": "The Queen of Loan Rejections I built up my credit score, but that wasn’t enough. Eight years ago I sat down with a personal banker at a local credit union. I was 19, with no credit history to my knowledge, and here I was asking her to give me an auto loan. The car I had was falling apart, and I knew that every day it didn’t explode was one step closer to the day it would. So I went in scared but hopeful, explained my story, and pleaded a case for my punctuality and maturity. She asked if I had any collateral the bank could loan against — I didn’t, but I also didn’t know what that meant. I distinctly remember answering “I mean, I have like $1,000 in the bank?” and I don’t know how she didn’t laugh at me. When she ran my credit report, she found that it wasn’t as empty as I had thought. It turned out my parents had made some of my tuition payments late (and some not at all) and that this had gone against my credit. I cried and realized my dream of getting a car was gone for now. I slowly paid off the unpaid tuition and kept saving until I could afford a $6,000 2001 Honda Civic. It wasn’t great, but it ran without smoking, so it would have to do. The woman at the credit union did give me some advice, though. She suggested I start building positive credit to balance the negative credit I had. She gave me a $300 personal loan that I would pay back over the next six months, and I went to my own bank and got a $500 secured credit card. At least it was a start. I spent the next eight years meticulously pouring over my credit report and doing everything right. I gradually increased my credit limits on the cards I had, got my student loans back on track, and I even qualified for a new car loan this year. So, a few weeks ago, I went back into a bank to ask for a personal line of credit. The reason I want and need a LOC is another story, but the short version is: I’m poor. I’ve always been poor. I wanted some financial security in the form of an open line of credit. I sat down with a personal banker who guided me through the process. He was very nice, and we talked about his family, his recent trip to Europe, and how he got married when he was 17 years old! We talked about choosing between a loan and a LOC, and he happily told me I’d made the right decision based on what I had planned. Yes! The right decision! What we never talked about was that I was likely going to be rejected for this line of credit. I went to a bank that wasn’t my own, because the bank I use doesn’t offer personal loans or LOCs. I had to open a small savings account to even be able to apply—which was fine with me, because I liked the idea of having a separate savings account for a vacation fund. We finished the application, and the banker told me to expect an initial decision within 24 hours. The moment I walked into my house I got an email that my application had been rejected. The banker and I went back and forth for about a week, and I’ll spare you those details, but the overall message was this: you asked for too much money, and you don’t bank with us. Their reasoning was that, despite an excellent credit score, I didn’t have an account history with them—which meant they didn’t know how well I managed money, so they couldn’t trust me. I had also asked for too much money compared to my salary, which is absolutely true. I somehow thought that my credit spoke for itself: “No matter how much money you loan her, she will pay it back on time. Look at this report! No late payments! She’s so trustworthy!” I had spent months researching banks and loans and making what I thought was the best decision. But seeing that rejection, I was blindsided. I don’t like to put the blame on other people, because I am responsible for 94 percent of the bad things that have happened to me. But in this particular instance I couldn’t help feeling mad. The banker puts in these applications every day. Why didn’t he tell me these things? Why didn’t he suggest that we lower the amount I was asking for? Why didn’t he tell me how heavily they weigh a banking history? I could have banked with them for six months or so and then applied. But he didn’t tell me those things. Instead we talked about Disney and weddings, and I thought the loan was a done deal. But it’s OK — it’s done. I’ll never be one of those people that storm into a business and demand to speak to a manager because things didn’t go my way. (Unless it happens at Taco Bell, the place that I hold most sacred.) What I’m most upset about is that after all these years and after all this progress and thinking I was unstoppable, I’m still in the exact same position I was before. I’m embarrassed, worried, with a pitiful savings account, and not as financially secure as I’d like to be. I don’t know when that will change, but for now I’ll keep saving and sacrificing until I feel safe. Stephanie Ashe is a freelance writer, cat mom, and pop culture devotee. She’s probably talking about a 90’s movie on Twitter right now. ", "name": "1131", "child": "1131_1\t1131_2\t1131_3\t1131_4\t1131_5\t1131_6\t1131_7\t1131_8\t1131_91131_1\t1131_2\t1131_3\t1131_4\t1131_5\t1131_6\t1131_7\t1131_8\t1131_9", "timestamp": "Apr 6"}