{"parent": "", "title": "I Want Expensive Eggs", "author": "Tim Cigelske", "sentences": [{"b48c": "I Want Expensive Eggs"}, {"b464": "I’ve seen how the cheap eggs get processed."}, {"211f": "I’m standing in the grocery store dairy section faced with a simple decision."}, {"01ae": "Do I get the cheap 89-cent store-brand eggs? Or do I get the organic free-range eggs, which cost 3–5 times as much?"}, {"0fd2": "Fifteen years ago, I vowed to never buy the cheap eggs after spending a day on a factory farm. But then life happened. The expenses of a family with two kids and a dog added up to an accumulation of debt."}, {"e30c": "This was the year my wife and I decided to get our debt under control. We’ve aggressively cut costs, sold old items on Craigslist, took on more work, and stuck to a strict budget. We’re tired of throwing away interest to credit card companies. We want to be in control of our future."}, {"3942": "But the one place we kept going over budget was the grocery store. That’s bound to happen when you stop going to restaurants and your 6-year-old and 3-year-old are both going through growth spurts."}, {"0ec1": "I wanted to get out from under our debt. But I also wanted those eggs. Which would it be?"}, {"1415": "One summer during college, my friend Jesse told me we could make some quick cash by working on this farm he knew. This didn’t sound that unusual to me. I grew up on a hobby farm with goats, and many of my relatives still work on family farms. I thought we’d be working outside lifting hay bales."}, {"60b3": "Nothing in my past farm experience prepared me."}, {"dad8": "We pulled up in front of a huge warehouse with rows and rows of vertical cages. We walked inside, and it reminded me exactly of those secret warehouses that Mulder and Scully snuck into on The X-Files."}, {"1a9f": "Our job was straightforward: Transport chickens from the back of a semi trailer into their new home in the warehouse. Jesse and I would be assisted by a group of workers who knew exactly what to do. They started grabbing the chickens by the legs — three to four in each hand — and thrusting them at us."}, {"5e48": "It moved so fast. There was no time to think. You grabbed the chicken and shoved them into their cages. You tried to remember how many went into each cage and lost count. Were there four in there or five?"}, {"c0a3": "Because I’m not skilled at holding multiple chickens, occasionally one got away and tried to make a break for it. There was nowhere to go in the warehouse. I chased it down while holding the other squawking chickens. If it was fortunate, it would get a top cage. The chickens in the bottom cages were covered in the feces from those above."}, {"62ce": "While some chickens put up a fight, others just gave up. I couldn’t tell if some chickens were state of shock or dead. You’d occasionally feel when the weight of a leg snapped under your grip and the chicken went limp."}, {"d426": "Before we collected our cash payment and left, I saw a long maze of conveyor belts snaking through the warehouse. It was filled with eggs that came from these cages, rolling down toward another semi."}, {"d398": "That image stuck with me. I can’t do it, I thought. I can’t buy eggs that come from these kind of conditions. At least that’s one thing I can change."}, {"002b": "It was my only day on that farm."}, {"0890": "Free-range eggs are just one purchase on the grocery bill. They’re certainly not the worst offender in the grand scheme of factory farming. If ethics were driving my decision, I should probably give up meat."}, {"2179": "But my visit to the poultry section is more personal. I’ve seen how the sausage is made."}, {"0dea": "I want expensive eggs not because their taste, but how they make me feel. I don’t want to think about my experience on the factory farm while having breakfast."}, {"1670": "The differences between the two brands stare you in the face when you’re making a decision. The grocery store brand eggs come in bland gray cartons. The organic free-range eggs are wrapped in an illustration of a beautiful outdoor farm — one brand is called the Happy Egg Co. (Tagline: “Hens who roam, lay eggs that rule.”)"}, {"7bc9": "So I usually put the expensive eggs on the credit card and borrow from the future, with up to 18 percent interest. But with the goal to pay off debt, now I feel guilty if I buy the expensive eggs or if buy the cheap eggs. (Is this what they call a chicken and egg paradox? Never mind.)"}, {"1afd": "Debt feels like a weight on your shoulders. It carries both a financial and psychological toll, always on your mind. Obviously, a few extra bucks won’t make or break a budget. But expensive eggs seem like a luxury."}, {"6502": "I want the expensive eggs, but I also don’t want to weigh all the factors of this seemingly simple decision every visit to the grocery store."}, {"1816": "So today, I buy cheap eggs."}, {"3908": "Because tomorrow I want free-range and guilt-free."}, {"8de7": "Tim Cigelske is director of social media at Marquette University and an adjunct professor in the Diederich College of Comm. Follow him on Twitter."}, {"b346": "This story is part of The Billfold’s I Want It Now series."}], "content": "I Want Expensive Eggs I’ve seen how the cheap eggs get processed. I’m standing in the grocery store dairy section faced with a simple decision. Do I get the cheap 89-cent store-brand eggs? Or do I get the organic free-range eggs, which cost 3–5 times as much? Fifteen years ago, I vowed to never buy the cheap eggs after spending a day on a factory farm. But then life happened. The expenses of a family with two kids and a dog added up to an accumulation of debt. This was the year my wife and I decided to get our debt under control. We’ve aggressively cut costs, sold old items on Craigslist, took on more work, and stuck to a strict budget. We’re tired of throwing away interest to credit card companies. We want to be in control of our future. But the one place we kept going over budget was the grocery store. That’s bound to happen when you stop going to restaurants and your 6-year-old and 3-year-old are both going through growth spurts. I wanted to get out from under our debt. But I also wanted those eggs. Which would it be? One summer during college, my friend Jesse told me we could make some quick cash by working on this farm he knew. This didn’t sound that unusual to me. I grew up on a hobby farm with goats, and many of my relatives still work on family farms. I thought we’d be working outside lifting hay bales. Nothing in my past farm experience prepared me. We pulled up in front of a huge warehouse with rows and rows of vertical cages. We walked inside, and it reminded me exactly of those secret warehouses that Mulder and Scully snuck into on The X-Files. Our job was straightforward: Transport chickens from the back of a semi trailer into their new home in the warehouse. Jesse and I would be assisted by a group of workers who knew exactly what to do. They started grabbing the chickens by the legs — three to four in each hand — and thrusting them at us. It moved so fast. There was no time to think. You grabbed the chicken and shoved them into their cages. You tried to remember how many went into each cage and lost count. Were there four in there or five? Because I’m not skilled at holding multiple chickens, occasionally one got away and tried to make a break for it. There was nowhere to go in the warehouse. I chased it down while holding the other squawking chickens. If it was fortunate, it would get a top cage. The chickens in the bottom cages were covered in the feces from those above. While some chickens put up a fight, others just gave up. I couldn’t tell if some chickens were state of shock or dead. You’d occasionally feel when the weight of a leg snapped under your grip and the chicken went limp. Before we collected our cash payment and left, I saw a long maze of conveyor belts snaking through the warehouse. It was filled with eggs that came from these cages, rolling down toward another semi. That image stuck with me. I can’t do it, I thought. I can’t buy eggs that come from these kind of conditions. At least that’s one thing I can change. It was my only day on that farm. Free-range eggs are just one purchase on the grocery bill. They’re certainly not the worst offender in the grand scheme of factory farming. If ethics were driving my decision, I should probably give up meat. But my visit to the poultry section is more personal. I’ve seen how the sausage is made. I want expensive eggs not because their taste, but how they make me feel. I don’t want to think about my experience on the factory farm while having breakfast. The differences between the two brands stare you in the face when you’re making a decision. The grocery store brand eggs come in bland gray cartons. The organic free-range eggs are wrapped in an illustration of a beautiful outdoor farm — one brand is called the Happy Egg Co. (Tagline: “Hens who roam, lay eggs that rule.”) So I usually put the expensive eggs on the credit card and borrow from the future, with up to 18 percent interest. But with the goal to pay off debt, now I feel guilty if I buy the expensive eggs or if buy the cheap eggs. (Is this what they call a chicken and egg paradox? Never mind.) Debt feels like a weight on your shoulders. It carries both a financial and psychological toll, always on your mind. Obviously, a few extra bucks won’t make or break a budget. But expensive eggs seem like a luxury. I want the expensive eggs, but I also don’t want to weigh all the factors of this seemingly simple decision every visit to the grocery store. So today, I buy cheap eggs. Because tomorrow I want free-range and guilt-free. Tim Cigelske is director of social media at Marquette University and an adjunct professor in the Diederich College of Comm. Follow him on Twitter. This story is part of The Billfold’s I Want It Now series. ", "name": "1134", "child": "1134_1\t1134_2\t1134_3\t1134_4\t1134_5\t1134_6\t1134_7\t1134_8\t1134_9\t1134_10\t1134_111134_1\t1134_2\t1134_3\t1134_4\t1134_5\t1134_6\t1134_7\t1134_8\t1134_9\t1134_10\t1134_111134_1\t1134_2\t1134_3\t1134_4\t1134_5\t1134_6\t1134_7\t1134_8\t1134_9\t1134_10\t1134_111134_1\t1134_2\t1134_3\t1134_4\t1134_5\t1134_6\t1134_7\t1134_8\t1134_9\t1134_10\t1134_11", "timestamp": "Mar 21"}