{"parent": "", "title": "How Divorce Changed My Financial Approach to Relationships", "author": "Tiffany Johnson", "sentences": [{"2c36": "How Divorce Changed My Financial Approach to Relationships"}, {"71f0": "My ex-husband did not care that his financial decisions affected me as well."}, {"35c1": "I was always a young person who had a good handle on her money. At 16, I got my first job as a tutor and would only take out only $10 a week from my paycheck for fun stuff. My mother worked in finance and, together with my father, had worked themselves out of poverty and into a solid working-to-middle-class existence. At 18, I got my first “real” job at a local newspaper and picked up a second job at my university newspaper."}, {"56a6": "By my senior year of college, I was working 50–55 hours per week and had socked away quite a bit of money. My college tuition was paid by scholarship, so I graduated with no loans. I was lucky."}, {"d5d9": "By my junior year of college, I had also reconnected with the man I would marry and divorce. We did not discuss money or finances before we got married. He was deployed the first year of our marriage, but we were lucky financially. Deployed soldiers not only make additional combat pay on top of their normal salary, but all of their pay is non-taxed while deployed in a combat zone. He had minimal living costs and I was still working my two jobs and finishing my last year of college. We put a lot of money into our joint savings account that year."}, {"c11e": "The first major crack in our relationship was a court judgment that came in my mail while he was deployed, after a debt collector took him to court over a few thousands dollars. I had no idea debt collectors could even take you to court and it was humiliating to have to call the court for information and admit I didn’t even know my husband’s financial history. I set up a payment schedule to get this debt paid off during his deployment."}, {"b4fa": "He came back from deployment and we moved in together at a military base. We bought a car together and put both of our incomes in a joint account."}, {"e2d8": "Once I was added to his phone plan, I started getting phone calls from creditors and collection agencies. He had thousands more in old debt that did not pay — a fact he left out when he told me his credit wasn’t great. When I asked him about it, he said his father told him to ignore the calls and keep changing phone numbers — eventually the statue of limitations on the debt would pass and they would not be able to collect."}, {"963d": "He did not seem fazed that debt collectors would take him to court and garnish his wages for the debt. He did not care that it affected his credit since it was already ruined. He did not care that this affected me financially as well."}, {"1087": "Our regular bills were paid on time because I always paid them immediately once we our paychecks came. I had no faith that he would pay the bills on time. He had no credit cards to build up more debt. His deployment savings went towards buying a car and paying some of his debt."}, {"8095": "But he spent every single penny in our checking account regardless. I put groceries on my credit card to ensure I had something to eat while he ate out everyday on our joint checking account. At on point, we had $50 in our checking account and two days until payday. I told him not to spend any money and to pack his lunch for the next two days."}, {"bbd9": "He overdrew our account that same day. I fought back humiliated tears at the credit union as I emptied our change jar to put our account back in the black. When I divorced him, I stayed in the same house (in separate bedrooms) because I couldn’t afford rent in upstate New York on my salary and had no savings for a hotel. Our final joint tax return went towards paying our divorce fees. In some ways, I was lucky because we had nothing to split and I could use the free law service on the base. I left my marriage with no savings, credit card debt, and the determination that I would never let another partner’s potential financial problems put me in that situation again."}, {"00c0": "After my divorce, I’ve become an advocate for women to remain financially self-supporting, no matter their relationship status. I tell my engaged friends to keep separate accounts after marriage, even if they open a joint one. I warn them to protect themselves with savings and insurance if they decide to stay home when they have children. I advise them to make sure they know how to handle their bills in the event that something happens to their partner, like death, disability, or even divorce. I ask them to imagine the financial worst case scenario and prepare for it."}, {"24d3": "Now years later, I find myself in another long-term relationship — a relationship that is ending. I live with my partner, but we have almost no financial assets in common. The house we live in was bought by him and is legally in his name. We have no joint financial accounts or assets. We split nearly every bill or expense between us. (It took me two years to reluctantly join his phone plan and save a little money.) I still have a backup savings account just in case."}, {"d7c4": "This makes financially moving on from this relationship relatively easy. I don’t have to worry about legal paperwork or splitting up any major assets. Studies consistently cite finances as the number one thing that splits couples up but finances, largely, haven’t been an issue this time around. We both make close to the same salaries, we both agree on splitting things, and we kept our separate accounts and savings. We had the same general financial goals and agreed on most things."}, {"5ed1": "This was my first long-term relationship after my divorce and I completely changed my financial approach this time. I was more cautious about rushing the process — I didn’t want to move in with him as soon as he did even though we spent most of our nights at each other’s places. I was adamant about not wanting a joint account and keeping many of our expenses separate. I chose not to entangle myself in his financial assets. I built up my own emergency fund to ensure I was covered no matter what happened between us."}, {"2410": "Now this relationship is ending after three years and cohabitation. It makes me wonder: did I subconsciously make building a back-up fund a priority during my relationship because I didn’t trust that the relationship would last?"}, {"8f52": "Many of my friends rely on their (male) partners and spouses to handle the financial arrangement. They do the budgeting and the saving. They handle retirement. Several of them are stay-at-home or work-at-home moms who rely on husbands to be the primary breadwinner. One friend says that she has no idea what their budget is and she asks her partner if something is within their budget. It’s partly the result of living in a conservative area of Ohio, but these friends seem to have a level of trust in their relationships that I don’t. I also recognize that all of us (myself included) come from a place of privilege because we have the financial means to make the choices we want."}, {"b959": "I don’t know if I would ever trust a partner enough to be the only breadwinner or to downgrade my career aspirations—but I also know that some of my relationship behaviors, like putting cash into a private emergency fund, might have made my partner less inclined to trust me. There are financial advice columns, after all, that tell people to avoid “secret savings:”"}, {"7f4c": "Financial Infidelity: 3 Ways People Keep Money Hidden From a PartnerSure, opposites attract, but having opposing financial mind-sets can lead to enormous stress in a marriage-especially…www.learnvest.com"}, {"8898": "Although it may seem that having a hidden stash of cash is a good idea if you’re living with a serious spender, the experts don’t agree."}, {"146c": "When a couple has an agreement on how money will be spent and one of them breaks that promise, says Baker, “it’s very corrosive to trust and creates distance.”"}, {"230a": "It’s a chicken-and-egg question: did I have enough doubts about this relationship to secretly bulk up my savings, or did my financial infidelity damage the trust my partner and I were building together?"}, {"910f": "I don’t really have an answer. This break-up is still new and raw for me, so it’s hard to see anything outside the lens of that. It’s terrifying and yet familiar to find myself starting over again, but I also recognize that I’m lucky. I’m financially independent and have a solid support system to help me through this. I hope I’ll find a partner one day that I can trust fully and completely, but I’ll never approach relationships like I did before my divorce."}, {"177f": "Tiffany Johnson is a former journalist and writes about books, finance, and more."}], "content": "How Divorce Changed My Financial Approach to Relationships My ex-husband did not care that his financial decisions affected me as well. I was always a young person who had a good handle on her money. At 16, I got my first job as a tutor and would only take out only $10 a week from my paycheck for fun stuff. My mother worked in finance and, together with my father, had worked themselves out of poverty and into a solid working-to-middle-class existence. At 18, I got my first “real” job at a local newspaper and picked up a second job at my university newspaper. By my senior year of college, I was working 50–55 hours per week and had socked away quite a bit of money. My college tuition was paid by scholarship, so I graduated with no loans. I was lucky. By my junior year of college, I had also reconnected with the man I would marry and divorce. We did not discuss money or finances before we got married. He was deployed the first year of our marriage, but we were lucky financially. Deployed soldiers not only make additional combat pay on top of their normal salary, but all of their pay is non-taxed while deployed in a combat zone. He had minimal living costs and I was still working my two jobs and finishing my last year of college. We put a lot of money into our joint savings account that year. The first major crack in our relationship was a court judgment that came in my mail while he was deployed, after a debt collector took him to court over a few thousands dollars. I had no idea debt collectors could even take you to court and it was humiliating to have to call the court for information and admit I didn’t even know my husband’s financial history. I set up a payment schedule to get this debt paid off during his deployment. He came back from deployment and we moved in together at a military base. We bought a car together and put both of our incomes in a joint account. Once I was added to his phone plan, I started getting phone calls from creditors and collection agencies. He had thousands more in old debt that did not pay — a fact he left out when he told me his credit wasn’t great. When I asked him about it, he said his father told him to ignore the calls and keep changing phone numbers — eventually the statue of limitations on the debt would pass and they would not be able to collect. He did not seem fazed that debt collectors would take him to court and garnish his wages for the debt. He did not care that it affected his credit since it was already ruined. He did not care that this affected me financially as well. Our regular bills were paid on time because I always paid them immediately once we our paychecks came. I had no faith that he would pay the bills on time. He had no credit cards to build up more debt. His deployment savings went towards buying a car and paying some of his debt. But he spent every single penny in our checking account regardless. I put groceries on my credit card to ensure I had something to eat while he ate out everyday on our joint checking account. At on point, we had $50 in our checking account and two days until payday. I told him not to spend any money and to pack his lunch for the next two days. He overdrew our account that same day. I fought back humiliated tears at the credit union as I emptied our change jar to put our account back in the black. When I divorced him, I stayed in the same house (in separate bedrooms) because I couldn’t afford rent in upstate New York on my salary and had no savings for a hotel. Our final joint tax return went towards paying our divorce fees. In some ways, I was lucky because we had nothing to split and I could use the free law service on the base. I left my marriage with no savings, credit card debt, and the determination that I would never let another partner’s potential financial problems put me in that situation again. After my divorce, I’ve become an advocate for women to remain financially self-supporting, no matter their relationship status. I tell my engaged friends to keep separate accounts after marriage, even if they open a joint one. I warn them to protect themselves with savings and insurance if they decide to stay home when they have children. I advise them to make sure they know how to handle their bills in the event that something happens to their partner, like death, disability, or even divorce. I ask them to imagine the financial worst case scenario and prepare for it. Now years later, I find myself in another long-term relationship — a relationship that is ending. I live with my partner, but we have almost no financial assets in common. The house we live in was bought by him and is legally in his name. We have no joint financial accounts or assets. We split nearly every bill or expense between us. (It took me two years to reluctantly join his phone plan and save a little money.) I still have a backup savings account just in case. This makes financially moving on from this relationship relatively easy. I don’t have to worry about legal paperwork or splitting up any major assets. Studies consistently cite finances as the number one thing that splits couples up but finances, largely, haven’t been an issue this time around. We both make close to the same salaries, we both agree on splitting things, and we kept our separate accounts and savings. We had the same general financial goals and agreed on most things. This was my first long-term relationship after my divorce and I completely changed my financial approach this time. I was more cautious about rushing the process — I didn’t want to move in with him as soon as he did even though we spent most of our nights at each other’s places. I was adamant about not wanting a joint account and keeping many of our expenses separate. I chose not to entangle myself in his financial assets. I built up my own emergency fund to ensure I was covered no matter what happened between us. Now this relationship is ending after three years and cohabitation. It makes me wonder: did I subconsciously make building a back-up fund a priority during my relationship because I didn’t trust that the relationship would last? Many of my friends rely on their (male) partners and spouses to handle the financial arrangement. They do the budgeting and the saving. They handle retirement. Several of them are stay-at-home or work-at-home moms who rely on husbands to be the primary breadwinner. One friend says that she has no idea what their budget is and she asks her partner if something is within their budget. It’s partly the result of living in a conservative area of Ohio, but these friends seem to have a level of trust in their relationships that I don’t. I also recognize that all of us (myself included) come from a place of privilege because we have the financial means to make the choices we want. I don’t know if I would ever trust a partner enough to be the only breadwinner or to downgrade my career aspirations—but I also know that some of my relationship behaviors, like putting cash into a private emergency fund, might have made my partner less inclined to trust me. There are financial advice columns, after all, that tell people to avoid “secret savings:” Financial Infidelity: 3 Ways People Keep Money Hidden From a PartnerSure, opposites attract, but having opposing financial mind-sets can lead to enormous stress in a marriage-especially…www.learnvest.com Although it may seem that having a hidden stash of cash is a good idea if you’re living with a serious spender, the experts don’t agree. When a couple has an agreement on how money will be spent and one of them breaks that promise, says Baker, “it’s very corrosive to trust and creates distance.” It’s a chicken-and-egg question: did I have enough doubts about this relationship to secretly bulk up my savings, or did my financial infidelity damage the trust my partner and I were building together? I don’t really have an answer. This break-up is still new and raw for me, so it’s hard to see anything outside the lens of that. It’s terrifying and yet familiar to find myself starting over again, but I also recognize that I’m lucky. I’m financially independent and have a solid support system to help me through this. I hope I’ll find a partner one day that I can trust fully and completely, but I’ll never approach relationships like I did before my divorce. Tiffany Johnson is a former journalist and writes about books, finance, and more. ", "name": "1138", "child": "1138_1\t1138_2\t1138_3\t1138_4\t1138_5\t1138_6\t1138_7\t1138_8\t1138_9\t1138_10\t1138_11\t1138_12\t1138_13\t1138_14\t1138_15\t1138_16\t1138_17\t1138_181138_1\t1138_2\t1138_3\t1138_4\t1138_5\t1138_6\t1138_7\t1138_8\t1138_9\t1138_10\t1138_11\t1138_12\t1138_13\t1138_14\t1138_15\t1138_16\t1138_17\t1138_18", "timestamp": "Dec 29, 2016"}