{"parent": "", "title": "10 Photography Tips to Step Up Your Instagram Game", "author": "Depositphotos", "sentences": [{"4605": "10 Photography Tips to Step Up Your Instagram Game"}, {"0bf5": "By Sandra Iakovleva, Content Marketing Manager at Depositphotos"}, {"a9ff": "You may not always have a DSLR at hand, but you do have your phone on you at all times. This means creative opportunities are everywhere, you just have to learn to look. A few photography tips can also come in handy to inspire your impromptu photo shoots of everyday life."}, {"5669": "One of the obvious destinations for your photographs is Instagram and these 10 tips will hopefully give you new ideas and a way to change up your feed. A fresh perspective and some new techniques can go a long way in helping you reach a wider audience."}, {"c08f": "1. Keep it simple"}, {"f7ac": "You need to train your eye to filter the distractive elements around you. In perfecting this skill, you will learn to appreciate the beauty in simplicity and will elevate your iPhone photography almost instantly. Everyday wonders are all around us. Learn to spot them and remember to simplify until you can’t anymore."}, {"c915": "2. Find unconventional angles"}, {"0a9b": "One of the great advantages to having your iPhone on you is that you can quickly and easily access your camera phone. An iPhone will also allow you to shoot at unconventional angles much better than a DSLR camera."}, {"f145": "3. Make or break your compositions"}, {"7e3b": "Polish up your knowledge on the basic composition rules in photography. When you know them, you can move on to more advanced techniques and break the rules in your compositions for visual interest."}, {"651e": "For more information on composition rules, see our article, “Back to Basics: 10 Composition Rules in Photography”. Once you master the basics, you can take it a step further with your unique touch."}, {"dca9": "4. Try closeups"}, {"87a3": "The same way a photograph can be broken down into shots with more details, so can your compositions. Take interesting closeups of objects and zoom in on things like colors and textures."}, {"4e5c": "5. Play with shadows"}, {"b052": "The Golden Hour is a beautiful time to go out and photograph. When the sun rises and sets, it creates beautiful shadows so keep an eye out!"}, {"1cf2": "6. Color blocking"}, {"9cff": "Take pictures of people or objects against the sunlight to capture nature’s hues. You can also experiment with lighting and do this at home."}, {"1594": "7. Catch reflections"}, {"628c": "For visual interest, you can narrow in on reflections in water or shiny surfaces. Get down to lower viewpoints for unconventional photographs of reflections."}, {"acf5": "8. Obsess over symmetry"}, {"d986": "Symmetry is always going to be pleasing to the eye. Draw your inspiration from nature, man made objects and people."}, {"b3a5": "9. Editing tools to the rescue"}, {"d308": "Even the most dull photographs can be made into something extraordinary with the help of editing tools. See our article on the top 10 editing apps and find one that works for you. It’s useful to have a reliable app to turn to on the go."}, {"f1fd": "10. Become a storyteller"}, {"14d2": "Don’t just be a photographer, be a storyteller! Document the process of someone doing something or capture an event in a series of photographs. In becoming an observer and documenting something, you are showing your viewers something in a candid light. This type of photography is trendy!"}, {"d55b": "This story was originally published at blog.depositphotos.com"}], "content": "10 Photography Tips to Step Up Your Instagram Game By Sandra Iakovleva, Content Marketing Manager at Depositphotos You may not always have a DSLR at hand, but you do have your phone on you at all times. This means creative opportunities are everywhere, you just have to learn to look. A few photography tips can also come in handy to inspire your impromptu photo shoots of everyday life. One of the obvious destinations for your photographs is Instagram and these 10 tips will hopefully give you new ideas and a way to change up your feed. A fresh perspective and some new techniques can go a long way in helping you reach a wider audience. 1. Keep it simple You need to train your eye to filter the distractive elements around you. In perfecting this skill, you will learn to appreciate the beauty in simplicity and will elevate your iPhone photography almost instantly. Everyday wonders are all around us. Learn to spot them and remember to simplify until you can’t anymore. 2. Find unconventional angles One of the great advantages to having your iPhone on you is that you can quickly and easily access your camera phone. An iPhone will also allow you to shoot at unconventional angles much better than a DSLR camera. 3. Make or break your compositions Polish up your knowledge on the basic composition rules in photography. When you know them, you can move on to more advanced techniques and break the rules in your compositions for visual interest. For more information on composition rules, see our article, “Back to Basics: 10 Composition Rules in Photography”. Once you master the basics, you can take it a step further with your unique touch. 4. Try closeups The same way a photograph can be broken down into shots with more details, so can your compositions. Take interesting closeups of objects and zoom in on things like colors and textures. 5. Play with shadows The Golden Hour is a beautiful time to go out and photograph. When the sun rises and sets, it creates beautiful shadows so keep an eye out! 6. Color blocking Take pictures of people or objects against the sunlight to capture nature’s hues. You can also experiment with lighting and do this at home. 7. Catch reflections For visual interest, you can narrow in on reflections in water or shiny surfaces. Get down to lower viewpoints for unconventional photographs of reflections. 8. Obsess over symmetry Symmetry is always going to be pleasing to the eye. Draw your inspiration from nature, man made objects and people. 9. Editing tools to the rescue Even the most dull photographs can be made into something extraordinary with the help of editing tools. See our article on the top 10 editing apps and find one that works for you. It’s useful to have a reliable app to turn to on the go. 10. Become a storyteller Don’t just be a photographer, be a storyteller! Document the process of someone doing something or capture an event in a series of photographs. In becoming an observer and documenting something, you are showing your viewers something in a candid light. This type of photography is trendy! This story was originally published at blog.depositphotos.com ", "name": "1147", "child": "1147_1\t1147_2\t1147_3\t1147_4\t1147_5\t1147_6\t1147_7\t1147_8\t1147_9", "timestamp": "Jan 26"}