{"parent": "", "title": "How I live: Organizing my finances", "author": "Stephen Cognetta", "sentences": [{"e6bd": "How I live: Organizing my finances"}, {"a600": "This post is part of a larger attempt to share my personal “systems” that help me organize my life. I’m no expert, but by sharing my system, I hope to get feedback and inspire others to share as well."}, {"72b5": "Why should I care about this anyway?"}, {"ec22": "So you’re thinking, I’m young, free, wild and I don’t need to be caring about myself 5, 10, or 50 years in the future — I’ll probably have enough income by then anyways! Screw this, I want money now!"}, {"407a": "I won’t spend this article addressing why you should be saving as there are plenty of other articles that do, but overall, you’re literally losing money by not investing it now — and investing is a sure-fire way to make sure you and your future family are financially stable."}, {"5823": "Well, shit. What am I supposed to do though, there are so many options? How can I even pick?"}, {"5ab6": "Minimal action is WAY better than no action. Start investing now, don’t fall victim to choice paradox. Do SOMETHING."}, {"4e0c": "I know nothing and don’t invest. What should I do?"}, {"de0c": "Assuming you’re relatively young, here are the top priority things:"}, {"71a1": "Stephen’s financial system"}, {"e4fb": "Below is a diagram of exactly what I do with my money. I have recurring transactions set up for most things."}, {"9047": "(1) 401(K)"}, {"837b": "Think of your 401(K) as your responsible aunt. You can give money to her, and you can tell your aunt where to invest the money, so long as you don’t get to take any of it out until retirement. You usually do this through your company."}, {"5c38": "What I do: I fill up my 401(K) every year, especially since I have a company match. 401(K)s are the best way to save for retirement. I invest my 401(K) in a Lifecycle fund (VTTSX — Vanguard Target Retirement 2060 Fund Investor Shares)."}, {"7799": "Lifecycle funds like VTTSX will automatically transition your stocks to bonds as you age, thereby de-risking your investments as you get closer to retirement (so you really don’t have to think about them at all)."}, {"7420": "(2) HSA"}, {"622d": "Health Savings Accounts are another “aunt” where you can put money, but have certain restrictions. Health Savings Accounts are not taxed at all ! The main catch is that you can only spend the money on health-related expenses (a likely given expenditure for most individuals)."}, {"5513": "What I do: I max it out every year through my company service, HealthEquity. I invest it in the riskiest profile that my HSA provider offers."}, {"8881": "(3) Checking Account"}, {"9ac6": "What I do: I use Bank of America, but I’m told there are other marginally better checking accounts that have better ATM coverage, etc. Overall, I haven’t prioritized my checking account as a high priority item to investigate in my finances."}, {"c5b5": "(4) Roth IRA"}, {"570c": "These accounts are awesome — they are a post-tax account that grows tax free, and you can take out the principal, without penalty. The catch is that you can only put in $5,500 per year, and often times less if your gross income is higher than a certain limit. In general, one should put money here if they can."}, {"8766": "What I do: I max out this account if possible, through Vanguard. I invest the money in the lifecycle fund VTTSX as well."}, {"72f0": "Remember: you can’t just put money in a Roth IRA and expect it to grow. You put it into a Roth IRA and THEN invest the money in something! If you’re confused and don’t know what to do — lifecycle funds are made for you. Invest the money in VTTSX (assuming 2060 target retirement)."}, {"e567": "(5) Savings Account"}, {"bf77": "What I do: I have an account with Ally Bank which has a good APY (Annual Percentage Yield), and I keep a small (under $1000) amount in there. In a real jam, I have friends/family that I would ask to loan money from, so I don’t feel like I need the large safety net usually recommended. If you don’t have this luxury, it makes sense to put a lot more money here."}, {"8842": "(6) Investing (short-term)"}, {"b117": "Short-term investing is useful for large ~10-15 year-out purchases. Things like weddings, buying a house, and getting a new car. Note that the market is volatile, so you could lose any money you invest here in the short-term."}, {"42e6": "What I do: Firstly, I use Wealthfront for the majority of my short-term investing. I put in money in Wealthfront under the fee cap (so I don’t have to pay fees on using Wealthfront), but I would still consider keeping money in my Wealthfront if there were fees applied."}, {"617b": "Secondly, I use a Vanguard Brokerage account (Vanguard is great because lowest fees) and invest in 45% VTI, 45% VSUX, 10% BND. (Note be careful about investing in both Vanguard and Wealthfront simultaneously, as there are some tax implications that might reduce the tax harvesting benefit Wealthfront provides)."}, {"d334": "Again, my opinion is that it’s better to invest in SOMETHING rather than nothing — so if it’s individual ETFs in Vanguard, Wealthfront, Betterment, it’s better to have your money sitting in an investment account regardless. I picked Wealthfront because it had a partnership with my company."}, {"923e": "Why VTI, VSUX, and BND? You can learn more about them here. This is a simple quick three-fund portfolio to get started."}, {"6c0e": "(7) Credit Cards"}, {"e892": "What I do: I have three credit cards: Chase Sapphire Preferred that I use for my travel rewards, Chase Freedom that I use for the rotating discounts (groceries, transportation are two big categories), and an Amazon Prime Card that I use for my Amazon purchases."}, {"9c4d": "They’re all pretty good cards with good deals, but the benefits and perks change pretty frequently, so I usually check sites like NerdWallet before getting a new card."}, {"1428": "(8) Payment Apps"}, {"d158": "What I do: I drain my payment apps of their balance as much as possible, so that I can keep my money organized and invest as much as possible. I personally use Messenger, Paypal, Square Cash, and Venmo."}, {"a378": "(9) Bills"}, {"7215": "Pay these off. I try to automate where possible. Not much more to it."}, {"e05d": "(10) “Fun” investing"}, {"bf5c": "What I do: Lastly, I enjoy making small bets on the stock market. I personally invest in Bitcoin via Coinbase, as well as invest about $500 for fun in Robinhood, to play random stocks and keep myself knowledgeable about certain companies."}, {"c3ab": "Below is a list of the full list of services I use (with referral links, if you found this info useful!):"}, {"e004": "If you liked this article, please recommend it on Medium, and sign up for my monthly newsletter! Follow me on Twitter at @stervyc."}], "content": "How I live: Organizing my finances This post is part of a larger attempt to share my personal “systems” that help me organize my life. I’m no expert, but by sharing my system, I hope to get feedback and inspire others to share as well. Why should I care about this anyway? So you’re thinking, I’m young, free, wild and I don’t need to be caring about myself 5, 10, or 50 years in the future — I’ll probably have enough income by then anyways! Screw this, I want money now! I won’t spend this article addressing why you should be saving as there are plenty of other articles that do, but overall, you’re literally losing money by not investing it now — and investing is a sure-fire way to make sure you and your future family are financially stable. Well, shit. What am I supposed to do though, there are so many options? How can I even pick? Minimal action is WAY better than no action. Start investing now, don’t fall victim to choice paradox. Do SOMETHING. I know nothing and don’t invest. What should I do? Assuming you’re relatively young, here are the top priority things: Stephen’s financial system Below is a diagram of exactly what I do with my money. I have recurring transactions set up for most things. (1) 401(K) Think of your 401(K) as your responsible aunt. You can give money to her, and you can tell your aunt where to invest the money, so long as you don’t get to take any of it out until retirement. You usually do this through your company. What I do: I fill up my 401(K) every year, especially since I have a company match. 401(K)s are the best way to save for retirement. I invest my 401(K) in a Lifecycle fund (VTTSX — Vanguard Target Retirement 2060 Fund Investor Shares). Lifecycle funds like VTTSX will automatically transition your stocks to bonds as you age, thereby de-risking your investments as you get closer to retirement (so you really don’t have to think about them at all). (2) HSA Health Savings Accounts are another “aunt” where you can put money, but have certain restrictions. Health Savings Accounts are not taxed at all ! The main catch is that you can only spend the money on health-related expenses (a likely given expenditure for most individuals). What I do: I max it out every year through my company service, HealthEquity. I invest it in the riskiest profile that my HSA provider offers. (3) Checking Account What I do: I use Bank of America, but I’m told there are other marginally better checking accounts that have better ATM coverage, etc. Overall, I haven’t prioritized my checking account as a high priority item to investigate in my finances. (4) Roth IRA These accounts are awesome — they are a post-tax account that grows tax free, and you can take out the principal, without penalty. The catch is that you can only put in $5,500 per year, and often times less if your gross income is higher than a certain limit. In general, one should put money here if they can. What I do: I max out this account if possible, through Vanguard. I invest the money in the lifecycle fund VTTSX as well. Remember: you can’t just put money in a Roth IRA and expect it to grow. You put it into a Roth IRA and THEN invest the money in something! If you’re confused and don’t know what to do — lifecycle funds are made for you. Invest the money in VTTSX (assuming 2060 target retirement). (5) Savings Account What I do: I have an account with Ally Bank which has a good APY (Annual Percentage Yield), and I keep a small (under $1000) amount in there. In a real jam, I have friends/family that I would ask to loan money from, so I don’t feel like I need the large safety net usually recommended. If you don’t have this luxury, it makes sense to put a lot more money here. (6) Investing (short-term) Short-term investing is useful for large ~10-15 year-out purchases. Things like weddings, buying a house, and getting a new car. Note that the market is volatile, so you could lose any money you invest here in the short-term. What I do: Firstly, I use Wealthfront for the majority of my short-term investing. I put in money in Wealthfront under the fee cap (so I don’t have to pay fees on using Wealthfront), but I would still consider keeping money in my Wealthfront if there were fees applied. Secondly, I use a Vanguard Brokerage account (Vanguard is great because lowest fees) and invest in 45% VTI, 45% VSUX, 10% BND. (Note be careful about investing in both Vanguard and Wealthfront simultaneously, as there are some tax implications that might reduce the tax harvesting benefit Wealthfront provides). Again, my opinion is that it’s better to invest in SOMETHING rather than nothing — so if it’s individual ETFs in Vanguard, Wealthfront, Betterment, it’s better to have your money sitting in an investment account regardless. I picked Wealthfront because it had a partnership with my company. Why VTI, VSUX, and BND? You can learn more about them here. This is a simple quick three-fund portfolio to get started. (7) Credit Cards What I do: I have three credit cards: Chase Sapphire Preferred that I use for my travel rewards, Chase Freedom that I use for the rotating discounts (groceries, transportation are two big categories), and an Amazon Prime Card that I use for my Amazon purchases. They’re all pretty good cards with good deals, but the benefits and perks change pretty frequently, so I usually check sites like NerdWallet before getting a new card. (8) Payment Apps What I do: I drain my payment apps of their balance as much as possible, so that I can keep my money organized and invest as much as possible. I personally use Messenger, Paypal, Square Cash, and Venmo. (9) Bills Pay these off. I try to automate where possible. Not much more to it. (10) “Fun” investing What I do: Lastly, I enjoy making small bets on the stock market. I personally invest in Bitcoin via Coinbase, as well as invest about $500 for fun in Robinhood, to play random stocks and keep myself knowledgeable about certain companies. Below is a list of the full list of services I use (with referral links, if you found this info useful!): If you liked this article, please recommend it on Medium, and sign up for my monthly newsletter! Follow me on Twitter at @stervyc. ", "name": "1167", "child": "1167_1\t1167_2\t1167_3\t1167_4\t1167_51167_1\t1167_2\t1167_3\t1167_4\t1167_51167_1\t1167_2\t1167_3\t1167_4\t1167_5", "timestamp": "Mar 29"}