{"parent": "", "title": "A new (to me) concept for keeping a notebook.", "author": "Shaunta Grimes", "sentences": [{"8be7": "A new (to me) concept for keeping a notebook."}, {"2f8a": "I am a Commonplace Book convert. You should be, too."}, {"32f9": "Every once in a while vision clears, or inspiration burns through, or some sharp spot of clarity happens and you hear the angels singing."}, {"fb36": "Or something like that."}, {"8d0c": "It’s happened to you before, though, right?"}, {"a220": "You learn about something that’s been there all along, but not in your sphere of knowledge or experience. Something that just makes instant and absolute sense and you know, immediately, that it’s yours now forever and ever. Amen."}, {"3bc1": "That’s what happened when I saw this post on Ryan Holiday’s blog linked to by Austin Kleon on Twitter. It’s called: How and Why to Keep a Commonplace Book."}, {"269c": "A Commonplace Book. I’d never heard of one. And if someone had told me before I read that post that there was something about writing things in a notebook that could feel revolutionary to me, I would have been skeptical."}, {"1210": "It took about two minutes to realize that A) people have been creating them for eons and B) it’s ridiculous that I’d never heard of them before."}, {"64f4": "Best part: I’m already hardwired to do this. Zero learning curve."}, {"9c25": "I realized almost as soon as my eyes hit the term that I have been keeping a version of a Commonplace Book my entire life. And that I was about to level up my notebook game for life."}, {"b4aa": "I’ve been intentionally working on being a writer since I was ten years old. That’s thirty-five years. I have had a lifelong compulsion to write things down."}, {"1964": "In other words: I’m not a stranger to keeping a notebook. I’ve kept one most of my life."}, {"013e": "I’m not talking about a journal. I’ve never been great at journaling. This isn’t a reflective thing. Just a notebook for writing down my ideas or other people’s thoughts or what other people have to teach me."}, {"3e52": "I didn’t know that there was an official name for the kind of notebook I keep."}, {"c254": "The kind that I carry around with me and write lists, bits of eavesdropped conversation, notes from a meeting, recipes, reminders, quotes, ideas for projects."}, {"6b0d": "The problem I’ve always had with my compulsive notebook keeping is that it’s a disaster. I love it. I’m fairly certain my head would fizzle and pop and spin off my shoulders if I didn’t get the stuff that’s in it OUT. But, it’s hard to access later."}, {"afed": "I’m an analog girl at heart."}, {"2dd5": "I know a lot of people are in love with Evernote. I can’t. It doesn’t work for me. I need to write things down, with a pen on paper. Or seriously, it might as well have never happened."}, {"32da": "I’ve tried bullet journaling with various levels of success. It doesn’t work for me as a daily planner, because I go about two weeks and then blow off making the weekly layout."}, {"85a0": "A BuJo works better for me as a repository for brain dumping, but I get uptight about keeping it neat and the whole index thing eventually trips me up. My notebook is like my pre-BuJo. I spew my thoughts into it and when something takes root, I make a more formal note of it in my bullet journal."}, {"edeb": "So, when I saw that article and Ryan Holiday’s method for reading books and going back later and taking notes on index cards . . . that’s when the angels sang for me."}, {"ce00": "Instead of having a random collection of notebooks that I grab and write in and then lose or forget about or can’t be bothered digging through, I’ll keep ONE notebook and then go back through it and write the important stuff on index cards."}, {"489c": "The little analog nerd inside of me is literally doing cartwheels of joy at the thought."}, {"2173": "Here’s the notebook I went with at the beginning of 2017. It’s made by Miquelrious and has 300 pages of grid paper. It costs about as much as a Moleskine, but is a doorstop monster of a book and will last me about nine months, I think."}, {"73fe": "I have no rules for my notebook except that it stays with me. I carry it in my purse. (Never mug me. This thing will knock you out if I take a swing at your head with my handbag. Just saying.)"}, {"401e": "I don’t number the pages. I don’t keep an index. I don’t do fancy handlettering. Sometimes I date the entry, but usually not. I just write what needs writing. Usually with a Papermate Flair or an Ink Joy gel pen."}, {"17fc": "Here are some examples:"}, {"28fe": "Some notes I took a couple of months ago about Ray Bradbury’s thoughts on how to become a good writer. These turned into my 1000 Day MFA program for Ninja Writers. Later that day I went to an Indivisible Reno meeting and took some notes on that."}, {"9ab5": "Here are some notes I took during a meeting I went to in Nashville a few weeks ago. I’m a doodler. If I’m not careful, my whole page will be covered in doodles without my even realizing I’d done it."}, {"f873": "Here are some ideas I wrote down for my friend Amy as part of my practice of becoming an idea machine. Turned into twelve. I may or may not have excited myself so much with my ideas for her that I called her before I remembered that not EVERYONE lives on the west coast and it was way past her bedtime."}, {"e911": "On the left here is a list of the names of the people who are in a class I’m teaching at my local community college. I’m terrible with names and if I don’t write them down, I’ll never remember them at all."}, {"1cb0": "On the right is a recipe for lemon Parmesan chicken and a caprese salad. Also a note for my class at the top."}, {"4bd0": "My kid has a soccer tournament this weekend, which means a lot of sitting around at a park waiting for her game to start. I’m going to bring my notebook and a stack of index cards and start transcribing the ideas in my notebook that bear saving and organizing in some usable way."}, {"faa1": "What about you? Do you keep a Commonplace Book? Or just a notebook that doesn’t even know it’s a Commonplace Book?"}, {"f3bf": "If you enjoyed this post, give it some love with a heart. ❤❤❤"}, {"522d": ">>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}], "content": "A new (to me) concept for keeping a notebook. I am a Commonplace Book convert. You should be, too. Every once in a while vision clears, or inspiration burns through, or some sharp spot of clarity happens and you hear the angels singing. Or something like that. It’s happened to you before, though, right? You learn about something that’s been there all along, but not in your sphere of knowledge or experience. Something that just makes instant and absolute sense and you know, immediately, that it’s yours now forever and ever. Amen. That’s what happened when I saw this post on Ryan Holiday’s blog linked to by Austin Kleon on Twitter. It’s called: How and Why to Keep a Commonplace Book. A Commonplace Book. I’d never heard of one. And if someone had told me before I read that post that there was something about writing things in a notebook that could feel revolutionary to me, I would have been skeptical. It took about two minutes to realize that A) people have been creating them for eons and B) it’s ridiculous that I’d never heard of them before. Best part: I’m already hardwired to do this. Zero learning curve. I realized almost as soon as my eyes hit the term that I have been keeping a version of a Commonplace Book my entire life. And that I was about to level up my notebook game for life. I’ve been intentionally working on being a writer since I was ten years old. That’s thirty-five years. I have had a lifelong compulsion to write things down. In other words: I’m not a stranger to keeping a notebook. I’ve kept one most of my life. I’m not talking about a journal. I’ve never been great at journaling. This isn’t a reflective thing. Just a notebook for writing down my ideas or other people’s thoughts or what other people have to teach me. I didn’t know that there was an official name for the kind of notebook I keep. The kind that I carry around with me and write lists, bits of eavesdropped conversation, notes from a meeting, recipes, reminders, quotes, ideas for projects. The problem I’ve always had with my compulsive notebook keeping is that it’s a disaster. I love it. I’m fairly certain my head would fizzle and pop and spin off my shoulders if I didn’t get the stuff that’s in it OUT. But, it’s hard to access later. I’m an analog girl at heart. I know a lot of people are in love with Evernote. I can’t. It doesn’t work for me. I need to write things down, with a pen on paper. Or seriously, it might as well have never happened. I’ve tried bullet journaling with various levels of success. It doesn’t work for me as a daily planner, because I go about two weeks and then blow off making the weekly layout. A BuJo works better for me as a repository for brain dumping, but I get uptight about keeping it neat and the whole index thing eventually trips me up. My notebook is like my pre-BuJo. I spew my thoughts into it and when something takes root, I make a more formal note of it in my bullet journal. So, when I saw that article and Ryan Holiday’s method for reading books and going back later and taking notes on index cards . . . that’s when the angels sang for me. Instead of having a random collection of notebooks that I grab and write in and then lose or forget about or can’t be bothered digging through, I’ll keep ONE notebook and then go back through it and write the important stuff on index cards. The little analog nerd inside of me is literally doing cartwheels of joy at the thought. Here’s the notebook I went with at the beginning of 2017. It’s made by Miquelrious and has 300 pages of grid paper. It costs about as much as a Moleskine, but is a doorstop monster of a book and will last me about nine months, I think. I have no rules for my notebook except that it stays with me. I carry it in my purse. (Never mug me. This thing will knock you out if I take a swing at your head with my handbag. Just saying.) I don’t number the pages. I don’t keep an index. I don’t do fancy handlettering. Sometimes I date the entry, but usually not. I just write what needs writing. Usually with a Papermate Flair or an Ink Joy gel pen. Here are some examples: Some notes I took a couple of months ago about Ray Bradbury’s thoughts on how to become a good writer. These turned into my 1000 Day MFA program for Ninja Writers. Later that day I went to an Indivisible Reno meeting and took some notes on that. Here are some notes I took during a meeting I went to in Nashville a few weeks ago. I’m a doodler. If I’m not careful, my whole page will be covered in doodles without my even realizing I’d done it. Here are some ideas I wrote down for my friend Amy as part of my practice of becoming an idea machine. Turned into twelve. I may or may not have excited myself so much with my ideas for her that I called her before I remembered that not EVERYONE lives on the west coast and it was way past her bedtime. On the left here is a list of the names of the people who are in a class I’m teaching at my local community college. I’m terrible with names and if I don’t write them down, I’ll never remember them at all. On the right is a recipe for lemon Parmesan chicken and a caprese salad. Also a note for my class at the top. My kid has a soccer tournament this weekend, which means a lot of sitting around at a park waiting for her game to start. I’m going to bring my notebook and a stack of index cards and start transcribing the ideas in my notebook that bear saving and organizing in some usable way. What about you? Do you keep a Commonplace Book? Or just a notebook that doesn’t even know it’s a Commonplace Book? If you enjoyed this post, give it some love with a heart. ❤❤❤ >>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. ", "name": "1171", "child": "1171_1\t1171_2\t1171_3\t1171_4\t1171_5\t1171_6\t1171_7\t1171_8\t1171_9\t1171_10\t1171_11\t1171_12\t1171_13\t1171_14", "timestamp": "Mar 29"}