{"parent": "", "title": "Melanie’s Happy Space", "author": "Debbie Aruta", "sentences": [{"8df6": "Melanie’s Happy Space"}, {"8548": "Melanie took out her small red notebook. She was determined to write 5000 words today. They may not be her best work, but 5000 words they shall be. She wrote one word then another. Her character started out shattered and depressed. She was in pieces emotionally and mentally. She needed to move her story line forward and was stuck. She left her pen in her notebook and she walked away."}, {"8795": "She started her morning over again. Reboot, admit defeat! She had writer’s block and it was a huge stumbling block. Not a pebble, but a mountain of a writing block. She got a new cup of coffee as she noticed her first one sitting cold and untouched over by her writing desk. She put the second cup down like the first and decided perhaps she needed to do something else. She walked into her bathroom to shower. Maybe if she freshened up and took a shower her writing would be freshened up too. She needed a change of environment and to actually drink coffee."}, {"85db": "Freshly showered Melanie grabbed her notebook, threw it into her bag, grabbed her car keys, and headed out the door. Once outside she decided it was a nice autumn day and she would walk the mile through town and walk to her favorite coffee house. All she had to do was follow Maple street straight to Coffee Bean coffee house."}, {"afad": "The coffee shop had large clear glass windows with fliers taped all over them, but she could see people busy inside. They were hustling around the shop to get coffee, get napkins, settle into their comfy chairs, and busily typing away on their laptops. This was the energy she needed around her."}, {"dc63": "Inside the shop had an assortment of eclectic chairs,enormous leather couches, and glorious mugs filled with coffee, which she has yet to consume. The aroma mixing in the air was intoxicating. Melanie knew in a flash that she could lose her writers block in the mix of all the chaos around her. This is what she needed to propel her character forward."}, {"3186": "She sauntered up to her favorite barista, ordered her normal black coffee with a shot of espresso, picked a table by the back to sit and write at, plopped into her comfy chair, and took out her red notebook ready to write. She could see all the coffee house characters from this vantage point."}, {"985c": "The barista brought over her drink and asked how she was today, she didn’t wait for an answer, and hurried back behind her wall that separated her everyone else in the joint. It was a quick interaction and Melanie was thankful the barista left her swiftly so she could write. After all she did bring Melanie her coffee. Melanie took her first sip of the day and could feel the writing block dissolving from the heat of the coffee."}, {"604f": "With coffee in hand she could feel warmth taking over her body. The heat of the coffee, the warmth of the shop, the building filled with bodies heating it up, and she knew NOW I can write. She picked up her pencil,took the last page she was writing on, re read some of her story, and decided to start something new because it was crap."}, {"d385": "Her character, like her, was struggling with moving forward. All she had done today was pour two cups of coffee, which still sat at home, she changed the location of where she wrote from, but could not write still, and she and her character seemed to just be having a standoff of who would flinch first. Nope she would come back to this some other time."}, {"8aaa": "New pencil and blue notebook in hand Melanie is determined to write. She sips her coffee, gets lost in the noises around her, closes her eyes and frees her mind. Her hand starts gliding across the paper like an ice skater on the ice. Firmly planting her letters on the page, but pencil gliding as if it was about to twirl and come right off her page. She opened her eyes to see what looked like spells to her on her page. No no perhaps it is poetry. She starts to read one quietly, but out loud, and as soon as she does everyone in the coffee house is frozen. She tries to talk to people around her, she gets up and tries to interact with people across the shop, nothing!! Her mouth just hung open, her heart was racing, how, why, what???"}, {"7b67": "She crossed the Coffee Bean again, sat back in her chair, closed her eyes. Again her hand picked up the pencil and guided her hand what to write. When she opened them and read the words this time, everyone went back to normal and no one knew they were missing time. What had she done? How had she done it? What was going on?"}, {"4f47": "Just then a feline rubbed against her leg. She had this déjà-vu feeling about the cat. She noticed it had a small tag on its collar. She reached down to pet it, but it quickly leaped into her lap and nuzzled up to her. His name plate said Griffin. Why was that name familiar to her? She had read her great aunts journals about magic and magical creatures who saved her from evil, but she never imagined it was true. She carefully examined this cat. It looked up at her, seemed to wink, and strutted away. She asked the barista about their coffee house kitty, but the barista said they didn’t have one. She had this suspicion that some how her writings had opened the door to her families past and that it was not going to be a pleasant journey."}, {"bbc9": "If you haven’t read this other piece, it might help with any confusion for this piece."}, {"7c31": "Off the HandleThis is a continuation of a story started here:medium.com"}], "content": "Melanie’s Happy Space Melanie took out her small red notebook. She was determined to write 5000 words today. They may not be her best work, but 5000 words they shall be. She wrote one word then another. Her character started out shattered and depressed. She was in pieces emotionally and mentally. She needed to move her story line forward and was stuck. She left her pen in her notebook and she walked away. She started her morning over again. Reboot, admit defeat! She had writer’s block and it was a huge stumbling block. Not a pebble, but a mountain of a writing block. She got a new cup of coffee as she noticed her first one sitting cold and untouched over by her writing desk. She put the second cup down like the first and decided perhaps she needed to do something else. She walked into her bathroom to shower. Maybe if she freshened up and took a shower her writing would be freshened up too. She needed a change of environment and to actually drink coffee. Freshly showered Melanie grabbed her notebook, threw it into her bag, grabbed her car keys, and headed out the door. Once outside she decided it was a nice autumn day and she would walk the mile through town and walk to her favorite coffee house. All she had to do was follow Maple street straight to Coffee Bean coffee house. The coffee shop had large clear glass windows with fliers taped all over them, but she could see people busy inside. They were hustling around the shop to get coffee, get napkins, settle into their comfy chairs, and busily typing away on their laptops. This was the energy she needed around her. Inside the shop had an assortment of eclectic chairs,enormous leather couches, and glorious mugs filled with coffee, which she has yet to consume. The aroma mixing in the air was intoxicating. Melanie knew in a flash that she could lose her writers block in the mix of all the chaos around her. This is what she needed to propel her character forward. She sauntered up to her favorite barista, ordered her normal black coffee with a shot of espresso, picked a table by the back to sit and write at, plopped into her comfy chair, and took out her red notebook ready to write. She could see all the coffee house characters from this vantage point. The barista brought over her drink and asked how she was today, she didn’t wait for an answer, and hurried back behind her wall that separated her everyone else in the joint. It was a quick interaction and Melanie was thankful the barista left her swiftly so she could write. After all she did bring Melanie her coffee. Melanie took her first sip of the day and could feel the writing block dissolving from the heat of the coffee. With coffee in hand she could feel warmth taking over her body. The heat of the coffee, the warmth of the shop, the building filled with bodies heating it up, and she knew NOW I can write. She picked up her pencil,took the last page she was writing on, re read some of her story, and decided to start something new because it was crap. Her character, like her, was struggling with moving forward. All she had done today was pour two cups of coffee, which still sat at home, she changed the location of where she wrote from, but could not write still, and she and her character seemed to just be having a standoff of who would flinch first. Nope she would come back to this some other time. New pencil and blue notebook in hand Melanie is determined to write. She sips her coffee, gets lost in the noises around her, closes her eyes and frees her mind. Her hand starts gliding across the paper like an ice skater on the ice. Firmly planting her letters on the page, but pencil gliding as if it was about to twirl and come right off her page. She opened her eyes to see what looked like spells to her on her page. No no perhaps it is poetry. She starts to read one quietly, but out loud, and as soon as she does everyone in the coffee house is frozen. She tries to talk to people around her, she gets up and tries to interact with people across the shop, nothing!! Her mouth just hung open, her heart was racing, how, why, what??? She crossed the Coffee Bean again, sat back in her chair, closed her eyes. Again her hand picked up the pencil and guided her hand what to write. When she opened them and read the words this time, everyone went back to normal and no one knew they were missing time. What had she done? How had she done it? What was going on? Just then a feline rubbed against her leg. She had this déjà-vu feeling about the cat. She noticed it had a small tag on its collar. She reached down to pet it, but it quickly leaped into her lap and nuzzled up to her. His name plate said Griffin. Why was that name familiar to her? She had read her great aunts journals about magic and magical creatures who saved her from evil, but she never imagined it was true. She carefully examined this cat. It looked up at her, seemed to wink, and strutted away. She asked the barista about their coffee house kitty, but the barista said they didn’t have one. She had this suspicion that some how her writings had opened the door to her families past and that it was not going to be a pleasant journey. If you haven’t read this other piece, it might help with any confusion for this piece. Off the HandleThis is a continuation of a story started here:medium.com ", "name": "1173", "child": "1173_1\t1173_2\t1173_3", "timestamp": "Nov 12, 2016"}