{"parent": "", "title": "An Illustrated Guide to Using the Sh*t Out of Your Notebook", "author": "Jessica Guzik", "sentences": [{"ad22": "An Illustrated Guide to Using the Sh*t Out of Your Notebook"}, {"914b": "I have friends who are more successful and better-looking than I am but who envy my creativity. They say things like “When was the last time you got a promotion?” and “You can wax that, you know,” but also, “How can I be as creative as you?”"}, {"3670": "I usually suggest notebooking, and Srinivas Rao backs me up on this in his recent story in Life Learning about why you, too, should carry a notebook. Having a notebook handy, Srinivas says, helps you capture ideas whenever they arise and shape those ideas over time. This, in turn, develops your creative muscle memory. Srinivas helpfully includes a few ideas for what to put in your notebook: Quotes, ideas, thoughts, sketches."}, {"ab02": "As Srinivas describes notebooks, I imagine they look like this:"}, {"d821": "This is not what my notebooks look like."}, {"4c5e": "With respect to Srinivas, I think you’ll get more out of your notebook if you go a little crazy. Actually, not a little. You should fear being committed to a mental institution lest someone finds your notebook (that’s why you never fill in the “This Notebook Belongs To _____” label). Here’s my advice:"}, {"3921": "1. Play the notebook field, bro"}, {"cb8c": "There’s a tendency to put notebooks on a pedestal. Brandi Paubel writes that she’s still searching for her perfect notebook because none have made her feel inspired yet. When we do find a perfect notebook, though, we’re afraid to touch it. Srinivas writes:"}, {"1318": "Sometimes people get tripped up because they have no idea what they’ll put in their notebooks. Other times they don’t want to ruin something as beautiful as a Moleskine with their chicken scratch."}, {"2007": "I remember thinking the same thing about my first boyfriend. Then we broke up and I started playing the field. Turns out you can have fun with a lot of people when you’re not hung up on preserving one perfect relationship. So too with notebooks! I currently scribble in four:"}, {"f94f": "My crazy doesn’t fit in one notebook."}, {"3d37": "None is pure and perfect; all are marked and messy. Each notebook was picked up at a different time in my life and there’s no rhyme or reason for writing in one versus another. Having four around makes it easier to reach for one when I need it, use it casually, and discard it for the next without second thoughts."}, {"acee": "2. Make your notebook work for you"}, {"85e2": "For sure include thoughts, quotes, sketches, Boy Scout badges, whatever in your notebook. But give it some grunt work too. It helps to build the habit of carrying a notebook if you rely on it for practical stuff, like grocery lists and notes from client meetings and Goldeneye cheat codes. If you’re doing it right your notebook will reflect what’s on your mind on a daily basis, creative or not: Ideas, insecurities, obligations, Rachel Ray recipes, etc."}, {"9b17": "Here’s a recent notebook page from my tour of a co-living space, with a list of questions to ask my tour guide and a few illegible story ideas:"}, {"d6f9": "The unlimited coffee was a yes, but the unlimited beer was a no :-("}, {"5237": "3. Get inspired by your childhood/nightmares"}, {"ea57": "“Doodle while you’re watching Netflix,” suggests Austin Kleon."}, {"6121": "“Doodle what?” asks Tushar Daga and other notebook novitiates."}, {"baca": "Look no further for inspiration than your icy subconscious. Sure, there are flowers and clouds and cubes and tubes. But what about those haunting images that surface from deep within and seem familiar yet give you chills? Draw those! To wit, some self-reflection on my part yielded a universe of balloons, disembodied Pooh bears, Dalí figures, frayed nerve endings, Georges Braque patterns, and demitasses. Can’t wait for the next therapy session, Dr. Rosenthal!"}, {"754a": "Name that song lyric!"}, {"5f0f": "4. Write your stupidest stuff first"}, {"4f02": "Let’s get serious for a second. Srinivas’ article references all the cool stuff you can put in your notebook, like startup ideas and character sketches. But make it your purpose to put on paper the very stupidest thoughts first."}, {"9708": "Putting stuff on paper acts like a kind of permission. The permission to have stupid, embarrassing, or shallow thoughts is the permission to have ALL thoughts."}, {"4d77": "When you give yourself that kind of permission you open up every creative faucet. Top-shelf ideas will come out with time. I’m still waiting for mine, but in the meantime I’m nailing the stupid thoughts thing. A wine tasting with an “Oaky Dokey” theme? Sign me up!"}, {"aab0": "Note the quick reminder not to cater to “his needs” so much. I always forget what standards I should hold my suitors to, so writing down little reminders helps."}, {"b7d2": "This is me throwing the gauntlet, Srinivas Rao: What’s in your notebook?"}], "content": "An Illustrated Guide to Using the Sh*t Out of Your Notebook I have friends who are more successful and better-looking than I am but who envy my creativity. They say things like “When was the last time you got a promotion?” and “You can wax that, you know,” but also, “How can I be as creative as you?” I usually suggest notebooking, and Srinivas Rao backs me up on this in his recent story in Life Learning about why you, too, should carry a notebook. Having a notebook handy, Srinivas says, helps you capture ideas whenever they arise and shape those ideas over time. This, in turn, develops your creative muscle memory. Srinivas helpfully includes a few ideas for what to put in your notebook: Quotes, ideas, thoughts, sketches. As Srinivas describes notebooks, I imagine they look like this: This is not what my notebooks look like. With respect to Srinivas, I think you’ll get more out of your notebook if you go a little crazy. Actually, not a little. You should fear being committed to a mental institution lest someone finds your notebook (that’s why you never fill in the “This Notebook Belongs To _____” label). Here’s my advice: 1. Play the notebook field, bro There’s a tendency to put notebooks on a pedestal. Brandi Paubel writes that she’s still searching for her perfect notebook because none have made her feel inspired yet. When we do find a perfect notebook, though, we’re afraid to touch it. Srinivas writes: Sometimes people get tripped up because they have no idea what they’ll put in their notebooks. Other times they don’t want to ruin something as beautiful as a Moleskine with their chicken scratch. I remember thinking the same thing about my first boyfriend. Then we broke up and I started playing the field. Turns out you can have fun with a lot of people when you’re not hung up on preserving one perfect relationship. So too with notebooks! I currently scribble in four: My crazy doesn’t fit in one notebook. None is pure and perfect; all are marked and messy. Each notebook was picked up at a different time in my life and there’s no rhyme or reason for writing in one versus another. Having four around makes it easier to reach for one when I need it, use it casually, and discard it for the next without second thoughts. 2. Make your notebook work for you For sure include thoughts, quotes, sketches, Boy Scout badges, whatever in your notebook. But give it some grunt work too. It helps to build the habit of carrying a notebook if you rely on it for practical stuff, like grocery lists and notes from client meetings and Goldeneye cheat codes. If you’re doing it right your notebook will reflect what’s on your mind on a daily basis, creative or not: Ideas, insecurities, obligations, Rachel Ray recipes, etc. Here’s a recent notebook page from my tour of a co-living space, with a list of questions to ask my tour guide and a few illegible story ideas: The unlimited coffee was a yes, but the unlimited beer was a no :-( 3. Get inspired by your childhood/nightmares “Doodle while you’re watching Netflix,” suggests Austin Kleon. “Doodle what?” asks Tushar Daga and other notebook novitiates. Look no further for inspiration than your icy subconscious. Sure, there are flowers and clouds and cubes and tubes. But what about those haunting images that surface from deep within and seem familiar yet give you chills? Draw those! To wit, some self-reflection on my part yielded a universe of balloons, disembodied Pooh bears, Dalí figures, frayed nerve endings, Georges Braque patterns, and demitasses. Can’t wait for the next therapy session, Dr. Rosenthal! Name that song lyric! 4. Write your stupidest stuff first Let’s get serious for a second. Srinivas’ article references all the cool stuff you can put in your notebook, like startup ideas and character sketches. But make it your purpose to put on paper the very stupidest thoughts first. Putting stuff on paper acts like a kind of permission. The permission to have stupid, embarrassing, or shallow thoughts is the permission to have ALL thoughts. When you give yourself that kind of permission you open up every creative faucet. Top-shelf ideas will come out with time. I’m still waiting for mine, but in the meantime I’m nailing the stupid thoughts thing. A wine tasting with an “Oaky Dokey” theme? Sign me up! Note the quick reminder not to cater to “his needs” so much. I always forget what standards I should hold my suitors to, so writing down little reminders helps. This is me throwing the gauntlet, Srinivas Rao: What’s in your notebook? ", "name": "1178", "child": "1178_1\t1178_2\t1178_3\t1178_4\t1178_5\t1178_6\t1178_7\t1178_8\t1178_9\t1178_10\t1178_11\t1178_12\t1178_13\t1178_14\t1178_15\t1178_16\t1178_17\t1178_18\t1178_19\t1178_20\t1178_21\t1178_22\t1178_23\t1178_24", "timestamp": "Jun 3, 2016"}