{"parent": "", "title": "Fireworks", "author": "Tre L. Loadholt", "sentences": [{"594b": "Fireworks"}, {"a89b": "And Mini Rocket Launchers"}, {"3969": "Aidan decides that today is a good day to learn how to build a mini fireworks rocket launcher. They have some of the items in their garage: gas can, two medium sized pipes, a small tube, tape, and glue. What did they not have?"}, {"87ea": "Fireworks!"}, {"48f0": "“Aidan, what are you doing?”"}, {"9a13": "“Looking for fireworks.”"}, {"7be4": "“Why on earth are you looking for fireworks during Spring?”"}, {"78d0": "“Nunya.”"}, {"fa32": "“Nunya?”"}, {"cb50": "“Yes, Brenda. Nunya. As in, “Nun ya bizness.”"}, {"e23a": "“Oh, so you got jokes? We’ll see who’s laughing when you blow off a finger with that rickety rocket launcher of yours.”"}, {"1ea6": "Brenda slyly walks away knowing she won this round, however, Aidan does not give up so easily. He knows his sister will be fascinated with his creation. Most times, she is."}, {"8d3a": "“So, Bren. I know you’re holding out on me. Where are the fireworks!”"}, {"64ce": "Calm and collected. Brenda raises her body an inch taller so that she is standing head to to head with her brother and challenges his tone."}, {"0210": "“Aidan, we do not have any fireworks. It is Spring. There is no need for them. Do yourself a favor and go make something else. Perhaps a new brother for me.”"}, {"fdc9": "“Son of a holy ghost! You know what, Bren?! Forget it! I am going to buy some fireworks. I will be back shortly!”"}, {"71f4": "“Whatcha buying them with? They don’t take Monopoly money at Jen’s Hardware Store. Ch-ching! I’ll be here all week, folks!”"}, {"23cb": "“I have money!”"}, {"496a": "“Uh huh. Sure, you do.”"}, {"dd3d": "“You just wait. It is going to be a blast!”"}, {"0081": "“Better not bet on that, bro. Blasts haven’t always worked out well for their creators.”"}, {"c39a": "“Oh yeah?”"}, {"1c48": "“Yep. Let’s just say Harry from two blocks up, those three toes he’s missing? Not a work injury.”"}, {"140c": "“You’re lying!”"}, {"8ccb": "“Nope. You wanna end up like him, you be my guest.”"}, {"205a": "Aidan takes a long hard thought about his sister’s words then decides to back out of this project."}, {"3513": "“I’m not gonna go to the store after all.”"}, {"0c68": "“Smart kid. I like you with all your toes, anyway.”"}, {"8d02": "Scotch“Have you seen the scotch tape?”theweeklyknob.com"}, {"0a6c": "Brenda and Aidan first appeared above for the “Scotch” Weekly Knob prompt. Happy 1 Year Mediumversary KNOB!!!"}], "content": "Fireworks And Mini Rocket Launchers Aidan decides that today is a good day to learn how to build a mini fireworks rocket launcher. They have some of the items in their garage: gas can, two medium sized pipes, a small tube, tape, and glue. What did they not have? Fireworks! “Aidan, what are you doing?” “Looking for fireworks.” “Why on earth are you looking for fireworks during Spring?” “Nunya.” “Nunya?” “Yes, Brenda. Nunya. As in, “Nun ya bizness.” “Oh, so you got jokes? We’ll see who’s laughing when you blow off a finger with that rickety rocket launcher of yours.” Brenda slyly walks away knowing she won this round, however, Aidan does not give up so easily. He knows his sister will be fascinated with his creation. Most times, she is. “So, Bren. I know you’re holding out on me. Where are the fireworks!” Calm and collected. Brenda raises her body an inch taller so that she is standing head to to head with her brother and challenges his tone. “Aidan, we do not have any fireworks. It is Spring. There is no need for them. Do yourself a favor and go make something else. Perhaps a new brother for me.” “Son of a holy ghost! You know what, Bren?! Forget it! I am going to buy some fireworks. I will be back shortly!” “Whatcha buying them with? They don’t take Monopoly money at Jen’s Hardware Store. Ch-ching! I’ll be here all week, folks!” “I have money!” “Uh huh. Sure, you do.” “You just wait. It is going to be a blast!” “Better not bet on that, bro. Blasts haven’t always worked out well for their creators.” “Oh yeah?” “Yep. Let’s just say Harry from two blocks up, those three toes he’s missing? Not a work injury.” “You’re lying!” “Nope. You wanna end up like him, you be my guest.” Aidan takes a long hard thought about his sister’s words then decides to back out of this project. “I’m not gonna go to the store after all.” “Smart kid. I like you with all your toes, anyway.” Scotch“Have you seen the scotch tape?”theweeklyknob.com Brenda and Aidan first appeared above for the “Scotch” Weekly Knob prompt. Happy 1 Year Mediumversary KNOB!!! ", "name": "1183", "child": "1183_1\t1183_2\t1183_3\t1183_41183_1\t1183_2\t1183_3\t1183_4", "timestamp": "Apr 15"}