{"parent": "", "title": "Don’t Talk to Strangers", "author": "Nicole Willson", "sentences": [{"8cbb": "Don’t Talk to Strangers"}, {"046a": "Source"}, {"e04d": "On Saturday afternoon, Dahlia and her parents go to Peartree Municipal Park for the annual community festival. Everywhere Dahlia looks, there are bands. Food trucks. Face painting booths. Funnel cake stands. Cotton candy. Pony rides. And when the sun starts going down, there will be fireworks over the lake."}, {"98b8": "Dahlia’s parents let her run around to look at the exhibits but warn her to be careful. She knows to run if a stranger tries to get her in a car with him (it’s always a him in these examples). She knows to scream if someone tries to grab her. She knows to find an older woman — especially one who’s got kids with her — if she gets lost and needs help."}, {"b4ca": "She’s ten years old, for Pete’s sake. She’s all set."}, {"6ffa": "There’s enough money in her pocket for the face-painting stand and either cotton candy or a funnel cake (not both, Mom says). The sweet, yeasty smell of the funnel cakes calls to her and she visits that stand first. After wiping powdered sugar and stickiness from her mouth, she goes to the face-painting booth. A lot of other kids got there first, and she’s bored and a little hot by the time it’s her turn."}, {"4b34": "“What’ll it be, sweetie?” says the tattooed young woman at the stand."}, {"35c5": "She picks a cat design, and the woman paints a tabby face in orange and silver shades that suit Dahlia’s dark brown hair and green eyes. She’s thrilled when she looks at herself in the mirror."}, {"7a88": "The crowd grows larger and noisier as the time for the fireworks gets nearer. Dahlia walks around the edge of the crowd to find her way back to her parents and their big checkered picnic blanket and their cooler full of sodas and water."}, {"f800": "That’s when a girl’s voice breaks through the noise."}, {"9a42": "“Hey! There’s kittens!”"}, {"c0f7": "Dahlia looks around, because she loves kittens."}, {"3230": "A skinny girl with long blonde braids and a pink party dress that looks a little too fancy for the festival waves at Dahlia."}, {"a2a3": "“Bunch of kittens, back in those trees. Wanna see?”"}, {"f116": "Dahlia wants a cat, but Mom’s allergic. Mom is never moved when Dahlia says that her friend Sarah’s mom is allergic too, but there’s medicine for that and now Sarah has a cat."}, {"2306": "Maybe if Dahlia brings an adorable little ball of fluff back to the blanket, even Mom won’t be able to say no. Mom’s really good at saying no, but even she has her limits."}, {"d617": "When Dahlia approaches her, the girl turns and starts walking towards the wooded area surrounding the lake."}, {"86a0": "“What’s your name?” Dahlia asks."}, {"4b87": "“Christy.”"}, {"4bd0": "“I’m Dahlia.” She wonders why Christy didn’t ask her name, but decides it’s no big deal."}, {"eb8b": "But as they reach the woods and keep moving, Dahlia gets the creeps. A goose just walked over my grave, Dad always says about that feeling."}, {"6469": "“Where are the kittens, anyway?” Dahlia asks. Her parents probably aren’t going to be cool with her being in the woods, kittens or not. And it’s getting dark out. Yeah, they’re definitely going to be mad if she’s caught here."}, {"2067": "“They’re up here.” Christy smiles at Dahlia, and another goose walks over her grave. For just a second, Christy’s eyes look wrong. They look silvered-over, like she doesn’t have pupils."}, {"8ae4": "“My mom and dad aren’t going to like this. I should go back,” Dahlia says."}, {"5492": "“Christy? Who’s your friend?”"}, {"d2d8": "A grown woman stands in front of them and now Dahlia’s really freaked. That lady wasn’t there before. That lady couldn’t have gotten there without Dahlia seeing her, could she? She’s got wavy red hair and she wears a sweatshirt and jeans that seem really hot for a warm day."}, {"03fe": "“This is Dahlia, Mom.” Christy reaches back and takes Dahlia’s hand, and a bright jolt of panic shoots through her body."}, {"d19e": "For Christy’s hand is a terrible thing. It’s ice cold and feels hollow, like a balloon hand grabbing hers."}, {"63a1": "Dahlia starts pulling away and Christy clamps down harder, much harder than a little kid should be able to grab. It grinds Dahlia’s bones together and she cries out."}, {"4524": "“What’s wrong, sweetheart?” the woman asks Dahlia. “Don’t you want a new friend?”"}, {"e0e1": "Dahlia can’t get loose. She screams, but she knows nobody’s going to hear her all the way out here."}, {"283d": "But then her scream gets drowned out by a long, high whistle that echoes through the air, and then BOOM. The parts of sky visible through the trees light up all white and gold."}, {"5091": "Christy gasps and the woman looks up, wide-eyed."}, {"b354": "“Wh-what was that?” Christy says, only she sounds faint now, like she’s far away. The woman holds a shaky hand to her mouth."}, {"7592": "They’re scared, Dahlia realizes."}, {"4bec": "BANG. POP. POW. Bursts of red and gold and blue explode across the darkening sky. The ground around them shakes."}, {"a458": "“You guys are in big trouble now,” Dahlia says."}, {"c663": "Christy and the woman gasp and it’s like their heads fall open. Their mouths become huge, way bigger than mouths are ever supposed to be, as they let out long, echoing screams. And then they change right in front of Dahlia’s eyes. They wither down to bones, and they disintegrate."}, {"4172": "Dahlia’s not stupid enough to stay there to find out what happens next. She takes off running towards the fireworks, towards the crowd by the lake. She falls and skins her knee but jumps right back up and keeps going, ignoring the searing pain as the blooms of pounding light erupt all around her and the sharp smell of firework smoke starts to fill the air."}, {"d6a4": "Dahlia’s mother is weaving her way through other families, looking terrified, calling Dahlia’s name."}, {"96c6": "“Mommy!” Dahlia races to Mom and hugs her hard enough that she almost knocks her over. She leaves a smear of orange tabby face paint on Mom’s purple T-shirt."}, {"d193": "“Where in the world were you? I looked all over!” Dahlia’s mom looks like she wants to yell, but when she takes a closer look at Dahlia’s face, her eyes get softer."}, {"a432": "“Is everything OK? What happened?”"}, {"2991": "“I … I got lost,” Dahlia says."}, {"d5c3": "Mom leads Dahlia through the crowds and to the safety of their picnic blanket."}, {"d581": "“You had us a little scared, Squirt,” Dad says. And then he sees her knee."}, {"a69f": "“Whoa, kiddo. That’s a mess.” Past experience has taught Mom and Dad to have quick first-aid supplies handy during community festivals, and Dad gets Dahlia’s skinned knee disinfected and Band-Aided as Dahlia grits her teeth against the sting of the disinfectant wipe. She won’t cry. She thinks of Christy’s ice cold hand and knows things could have been much, much worse."}, {"734e": "As an especially cool display of aerial cherries and rings soars against the twilight sky, Dad leans over to Dahlia."}, {"b22a": "“Did you know that fireworks were invented to scare off ghosts?”"}, {"b147": "Dahlia looks at her father in confusion. Does he know what I saw? He can’t, can he?"}, {"43f8": "“They worked,” she tells him."}], "content": "Don’t Talk to Strangers Source On Saturday afternoon, Dahlia and her parents go to Peartree Municipal Park for the annual community festival. Everywhere Dahlia looks, there are bands. Food trucks. Face painting booths. Funnel cake stands. Cotton candy. Pony rides. And when the sun starts going down, there will be fireworks over the lake. Dahlia’s parents let her run around to look at the exhibits but warn her to be careful. She knows to run if a stranger tries to get her in a car with him (it’s always a him in these examples). She knows to scream if someone tries to grab her. She knows to find an older woman — especially one who’s got kids with her — if she gets lost and needs help. She’s ten years old, for Pete’s sake. She’s all set. There’s enough money in her pocket for the face-painting stand and either cotton candy or a funnel cake (not both, Mom says). The sweet, yeasty smell of the funnel cakes calls to her and she visits that stand first. After wiping powdered sugar and stickiness from her mouth, she goes to the face-painting booth. A lot of other kids got there first, and she’s bored and a little hot by the time it’s her turn. “What’ll it be, sweetie?” says the tattooed young woman at the stand. She picks a cat design, and the woman paints a tabby face in orange and silver shades that suit Dahlia’s dark brown hair and green eyes. She’s thrilled when she looks at herself in the mirror. The crowd grows larger and noisier as the time for the fireworks gets nearer. Dahlia walks around the edge of the crowd to find her way back to her parents and their big checkered picnic blanket and their cooler full of sodas and water. That’s when a girl’s voice breaks through the noise. “Hey! There’s kittens!” Dahlia looks around, because she loves kittens. A skinny girl with long blonde braids and a pink party dress that looks a little too fancy for the festival waves at Dahlia. “Bunch of kittens, back in those trees. Wanna see?” Dahlia wants a cat, but Mom’s allergic. Mom is never moved when Dahlia says that her friend Sarah’s mom is allergic too, but there’s medicine for that and now Sarah has a cat. Maybe if Dahlia brings an adorable little ball of fluff back to the blanket, even Mom won’t be able to say no. Mom’s really good at saying no, but even she has her limits. When Dahlia approaches her, the girl turns and starts walking towards the wooded area surrounding the lake. “What’s your name?” Dahlia asks. “Christy.” “I’m Dahlia.” She wonders why Christy didn’t ask her name, but decides it’s no big deal. But as they reach the woods and keep moving, Dahlia gets the creeps. A goose just walked over my grave, Dad always says about that feeling. “Where are the kittens, anyway?” Dahlia asks. Her parents probably aren’t going to be cool with her being in the woods, kittens or not. And it’s getting dark out. Yeah, they’re definitely going to be mad if she’s caught here. “They’re up here.” Christy smiles at Dahlia, and another goose walks over her grave. For just a second, Christy’s eyes look wrong. They look silvered-over, like she doesn’t have pupils. “My mom and dad aren’t going to like this. I should go back,” Dahlia says. “Christy? Who’s your friend?” A grown woman stands in front of them and now Dahlia’s really freaked. That lady wasn’t there before. That lady couldn’t have gotten there without Dahlia seeing her, could she? She’s got wavy red hair and she wears a sweatshirt and jeans that seem really hot for a warm day. “This is Dahlia, Mom.” Christy reaches back and takes Dahlia’s hand, and a bright jolt of panic shoots through her body. For Christy’s hand is a terrible thing. It’s ice cold and feels hollow, like a balloon hand grabbing hers. Dahlia starts pulling away and Christy clamps down harder, much harder than a little kid should be able to grab. It grinds Dahlia’s bones together and she cries out. “What’s wrong, sweetheart?” the woman asks Dahlia. “Don’t you want a new friend?” Dahlia can’t get loose. She screams, but she knows nobody’s going to hear her all the way out here. But then her scream gets drowned out by a long, high whistle that echoes through the air, and then BOOM. The parts of sky visible through the trees light up all white and gold. Christy gasps and the woman looks up, wide-eyed. “Wh-what was that?” Christy says, only she sounds faint now, like she’s far away. The woman holds a shaky hand to her mouth. They’re scared, Dahlia realizes. BANG. POP. POW. Bursts of red and gold and blue explode across the darkening sky. The ground around them shakes. “You guys are in big trouble now,” Dahlia says. Christy and the woman gasp and it’s like their heads fall open. Their mouths become huge, way bigger than mouths are ever supposed to be, as they let out long, echoing screams. And then they change right in front of Dahlia’s eyes. They wither down to bones, and they disintegrate. Dahlia’s not stupid enough to stay there to find out what happens next. She takes off running towards the fireworks, towards the crowd by the lake. She falls and skins her knee but jumps right back up and keeps going, ignoring the searing pain as the blooms of pounding light erupt all around her and the sharp smell of firework smoke starts to fill the air. Dahlia’s mother is weaving her way through other families, looking terrified, calling Dahlia’s name. “Mommy!” Dahlia races to Mom and hugs her hard enough that she almost knocks her over. She leaves a smear of orange tabby face paint on Mom’s purple T-shirt. “Where in the world were you? I looked all over!” Dahlia’s mom looks like she wants to yell, but when she takes a closer look at Dahlia’s face, her eyes get softer. “Is everything OK? What happened?” “I … I got lost,” Dahlia says. Mom leads Dahlia through the crowds and to the safety of their picnic blanket. “You had us a little scared, Squirt,” Dad says. And then he sees her knee. “Whoa, kiddo. That’s a mess.” Past experience has taught Mom and Dad to have quick first-aid supplies handy during community festivals, and Dad gets Dahlia’s skinned knee disinfected and Band-Aided as Dahlia grits her teeth against the sting of the disinfectant wipe. She won’t cry. She thinks of Christy’s ice cold hand and knows things could have been much, much worse. As an especially cool display of aerial cherries and rings soars against the twilight sky, Dad leans over to Dahlia. “Did you know that fireworks were invented to scare off ghosts?” Dahlia looks at her father in confusion. Does he know what I saw? He can’t, can he? “They worked,” she tells him. ", "name": "1185", "child": "1185_1\t1185_2\t1185_3\t1185_4\t1185_5\t1185_6", "timestamp": "Apr 15"}