{"parent": "", "title": "Ticking Off Time", "author": "Lia M. B.", "sentences": [{"38d1": "source"}, {"25e6": "Ticking Off Time"}, {"6101": "Every December, along with Christmas postcards she would buy a new calendar. She could barely wait to get home and rip open the plastic casing and smell the promise of a new year in the paper and the glue. But she would delay and prolong the anticipation by roaming around the shops a little more, until it was dark and the seasonal lights spread colour against the shop’s windows twinkling and reflecting infinitely. Along with the calendar, she would also buy a new pen. Black, always black. She had quit the mandatory blue right after school and, now, it seemed like such a childish colour to use."}, {"148a": "The hour or so spent outside exhausted her. Coming home she turned on the tv on the news channel, mute, as usual and put on sweatpants and a ragged t-shirt. Now she needed to rest before doing anything else."}, {"e6d2": "Years of reclusion turned her pale skin ghostly grey. Her limbs, once strong and thick, were now weak and emaciated. Her body had shrunk to fit the tiny apartment, getting smaller and smaller as the walls closed in on her every day."}, {"2e1a": "Day after day, times drags along too fast. Behind the always closed curtains to shield her from any light outside, she ticks off the days in the calendar. Sometimes one after the other, most of the times, quite a few in one sitting. Darkness envelops time and space sucking her life into a black hole."}, {"ffc9": "The excitement of the new calendar soon wore off. Most of the time she was aware of all the plans she would never make and mark on it. But, once in a while something came up: a birthday, a holiday, doctor’s appointment. A fleeting moment of happiness writing it down in meticulous calligraphy on the designated day and month. A sense of purpose came to her. An ethereal hope that life matters. She matters."}, {"8f1d": "Day after day, ticking off the days until her mind would set her free at last, from a life captive."}], "content": "source Ticking Off Time Every December, along with Christmas postcards she would buy a new calendar. She could barely wait to get home and rip open the plastic casing and smell the promise of a new year in the paper and the glue. But she would delay and prolong the anticipation by roaming around the shops a little more, until it was dark and the seasonal lights spread colour against the shop’s windows twinkling and reflecting infinitely. Along with the calendar, she would also buy a new pen. Black, always black. She had quit the mandatory blue right after school and, now, it seemed like such a childish colour to use. The hour or so spent outside exhausted her. Coming home she turned on the tv on the news channel, mute, as usual and put on sweatpants and a ragged t-shirt. Now she needed to rest before doing anything else. Years of reclusion turned her pale skin ghostly grey. Her limbs, once strong and thick, were now weak and emaciated. Her body had shrunk to fit the tiny apartment, getting smaller and smaller as the walls closed in on her every day. Day after day, times drags along too fast. Behind the always closed curtains to shield her from any light outside, she ticks off the days in the calendar. Sometimes one after the other, most of the times, quite a few in one sitting. Darkness envelops time and space sucking her life into a black hole. The excitement of the new calendar soon wore off. Most of the time she was aware of all the plans she would never make and mark on it. But, once in a while something came up: a birthday, a holiday, doctor’s appointment. A fleeting moment of happiness writing it down in meticulous calligraphy on the designated day and month. A sense of purpose came to her. An ethereal hope that life matters. She matters. Day after day, ticking off the days until her mind would set her free at last, from a life captive. ", "name": "1188", "child": "1188_1\t1188_2\t1188_3\t1188_4", "timestamp": "Apr 8"}