{"parent": "", "title": "Out With a Bang", "author": "Andrea Smith", "sentences": [{"e473": "http://www.lightroom.com.br/wp-content/uploads/2016/12/Fireworks-at-Lake-Lanier-Islands-SunsetCove.jpg"}, {"c70c": "Out With a Bang"}, {"c6b7": "The day had been hot and miserable. According to the weatherman on the evening news, they’d set a new heat record. Now that the sun was setting, it had cooled off considerably and it was actually quite pleasant. Lisa poured herself a glass of iced tea and went outside. She took the well-worn path that led from the back patio down to the lake and then walked to the end of the little dock that jutted out over the water. She slid her sandals off before sitting down. She sat there, gently kicking her feet in the cool water, and waited."}, {"8c56": "It was much quieter this year than it had been in years past. Most 4th of July weekends found the lake packed. All of the permanent residents would have family and friends visiting. The various campgrounds would fill up with repeat visitors and newcomers alike. Tantalizing smells from countless barbeques would waft across the lake. There would be pontoons and boats pulling squealing kids on tubes. Almost without fail, there would be at least one group that got a little too drunk and a little too rowdy, drawing complaints and then a visit from the park ranger to settle them down. Nighttime always brought campfires and although it would quiet down, you could still hear laughter and catch snippets of conversations drift across the lake."}, {"3fa2": "This year, there had still been visitors, just not as many. The smell of burgers and hot dogs cooking on a grill made her mouth water just as it always had. A few pontoons had drifted by throughout the day and Lisa had even seen a couple of jet skis, but as far as she could tell, the ranger hadn’t been called out to settle down any overzealous party crowds. The mood seemed to be much more laid back this year, somber even. It was almost as if everyone knew."}, {"4961": "She hadn’t felt quite like herself for months now. At first, she just noticed she tired more easily than was normal for her. She upped her vitamin intake, ate better and got a little more exercise which seemed to help for a while. Then the fatigue came back with a vengeance and brought along a few friends. Some of the symptoms she tried to chalk up to early menopause. It didn’t take too long for her to stop trying to kid herself and make an appointment with her doctor."}, {"413f": "The news really hadn’t come as much of a surprise. She’d known her body was trying to tell her something. Unfortunately, she hadn’t listened as soon as she should have and things had progressed rather quickly. She sat there numb as her doctor droned on and on with the details. Words drifted in and out of her consciousness……advanced, stage 4, no known cure, 20% survival rate, options."}, {"d691": "“I know this is a lot to take in.” Her doctor reached out and touched her hand and causing Lisa’s attention to snap back in focus. “You’ll have a lot of questions and we are here to answer them and guide you every step of the way. You won’t be going through this alone.”"}, {"145e": "Alone. Oh yes, she would be going through this very much alone. There was no one in her life. No family, no lovers, no close friends. At least not close enough to burden with this. What the hell could they do anyway? Nothing was going to stop the inevitable."}, {"93c6": "“I’m going to prescribe you something for the pain. Go home, look over this information to help you decide what option you want to move forward with. Call me with any questions. And Lisa, please don’t take too long. We will need to start treatment as soon as possible.”"}, {"0a18": "Lisa just nodded. Somehow she made it out of there and was able to get herself home although she didn’t remember doing so. It took Lisa two days to come to her decision. She had no plans to fight this thing. The odds of survival were slim and she didn’t want to spend her last days going through treatments that would most likely make her sick and lessen the quality of what life she had left. She called her doctor with her decision. She also asked the doctor to prescribe her something to help her sleep, as she hadn’t been able to sleep at all since receiving her diagnosis."}, {"e611": "That had been on Monday and today was Saturday. Just like any other 4th of July holiday, Lisa was sitting here in her prime viewing spot, waiting for the fireworks display to start. She could see the Petersons from across the lake gathered around their campfire. It looked like the little ones were making S’mores. She smiled. It had been forever since she’d had one of those."}, {"35b6": "“I should have bought some marshmallows and had my own campfire.” She thought. She’d always loved roasting marshmallows. She loved to get hers good and charred on the outside, almost burnt. Biting through the crispy outside and into the gooey center was pure enjoyment. “Oh well. It’s too late now.”"}, {"fcbe": "The fireworks would be starting any minute. She reached into the pocket of her shorts and pulled out the bottle of sleeping pills. She twisted off the childproof cap and shook several into her hand. She washed those down with her iced tea and filled her hand with several more. Within seconds, the bottle was empty. She reached down and filled the empty bottle with lake water and watched as it slowly drifted away and begin to sink out of sight."}, {"6e03": "She watched the Petersons for another minute or so, then laid back to watch the show."}, {"b105": "She didn’t have to wait long before the first brilliant shower of light lit the sky. It looked as if they were going to outdo themselves this year. One lovely explosion followed immediately after the one before it. The display was still going strong when Lisa closed her eyes and began to drift away."}], "content": "http://www.lightroom.com.br/wp-content/uploads/2016/12/Fireworks-at-Lake-Lanier-Islands-SunsetCove.jpg Out With a Bang The day had been hot and miserable. According to the weatherman on the evening news, they’d set a new heat record. Now that the sun was setting, it had cooled off considerably and it was actually quite pleasant. Lisa poured herself a glass of iced tea and went outside. She took the well-worn path that led from the back patio down to the lake and then walked to the end of the little dock that jutted out over the water. She slid her sandals off before sitting down. She sat there, gently kicking her feet in the cool water, and waited. It was much quieter this year than it had been in years past. Most 4th of July weekends found the lake packed. All of the permanent residents would have family and friends visiting. The various campgrounds would fill up with repeat visitors and newcomers alike. Tantalizing smells from countless barbeques would waft across the lake. There would be pontoons and boats pulling squealing kids on tubes. Almost without fail, there would be at least one group that got a little too drunk and a little too rowdy, drawing complaints and then a visit from the park ranger to settle them down. Nighttime always brought campfires and although it would quiet down, you could still hear laughter and catch snippets of conversations drift across the lake. This year, there had still been visitors, just not as many. The smell of burgers and hot dogs cooking on a grill made her mouth water just as it always had. A few pontoons had drifted by throughout the day and Lisa had even seen a couple of jet skis, but as far as she could tell, the ranger hadn’t been called out to settle down any overzealous party crowds. The mood seemed to be much more laid back this year, somber even. It was almost as if everyone knew. She hadn’t felt quite like herself for months now. At first, she just noticed she tired more easily than was normal for her. She upped her vitamin intake, ate better and got a little more exercise which seemed to help for a while. Then the fatigue came back with a vengeance and brought along a few friends. Some of the symptoms she tried to chalk up to early menopause. It didn’t take too long for her to stop trying to kid herself and make an appointment with her doctor. The news really hadn’t come as much of a surprise. She’d known her body was trying to tell her something. Unfortunately, she hadn’t listened as soon as she should have and things had progressed rather quickly. She sat there numb as her doctor droned on and on with the details. Words drifted in and out of her consciousness……advanced, stage 4, no known cure, 20% survival rate, options. “I know this is a lot to take in.” Her doctor reached out and touched her hand and causing Lisa’s attention to snap back in focus. “You’ll have a lot of questions and we are here to answer them and guide you every step of the way. You won’t be going through this alone.” Alone. Oh yes, she would be going through this very much alone. There was no one in her life. No family, no lovers, no close friends. At least not close enough to burden with this. What the hell could they do anyway? Nothing was going to stop the inevitable. “I’m going to prescribe you something for the pain. Go home, look over this information to help you decide what option you want to move forward with. Call me with any questions. And Lisa, please don’t take too long. We will need to start treatment as soon as possible.” Lisa just nodded. Somehow she made it out of there and was able to get herself home although she didn’t remember doing so. It took Lisa two days to come to her decision. She had no plans to fight this thing. The odds of survival were slim and she didn’t want to spend her last days going through treatments that would most likely make her sick and lessen the quality of what life she had left. She called her doctor with her decision. She also asked the doctor to prescribe her something to help her sleep, as she hadn’t been able to sleep at all since receiving her diagnosis. That had been on Monday and today was Saturday. Just like any other 4th of July holiday, Lisa was sitting here in her prime viewing spot, waiting for the fireworks display to start. She could see the Petersons from across the lake gathered around their campfire. It looked like the little ones were making S’mores. She smiled. It had been forever since she’d had one of those. “I should have bought some marshmallows and had my own campfire.” She thought. She’d always loved roasting marshmallows. She loved to get hers good and charred on the outside, almost burnt. Biting through the crispy outside and into the gooey center was pure enjoyment. “Oh well. It’s too late now.” The fireworks would be starting any minute. She reached into the pocket of her shorts and pulled out the bottle of sleeping pills. She twisted off the childproof cap and shook several into her hand. She washed those down with her iced tea and filled her hand with several more. Within seconds, the bottle was empty. She reached down and filled the empty bottle with lake water and watched as it slowly drifted away and begin to sink out of sight. She watched the Petersons for another minute or so, then laid back to watch the show. She didn’t have to wait long before the first brilliant shower of light lit the sky. It looked as if they were going to outdo themselves this year. One lovely explosion followed immediately after the one before it. The display was still going strong when Lisa closed her eyes and began to drift away. ", "name": "1195", "child": "1195_1\t1195_2", "timestamp": "Apr 15"}