{"parent": "", "timestamp": "Apr 15", "title": "Medium’s Membership Deal So Far: Following up", "sentences": [{"56ab": "Medium’s Membership Deal So Far: Following up"}, {"ad87": "JLA City Church"}, {"8248": "I was one of the first to respond to this, although Renée S and Aura Wilming then did much better jobs of it than I did. That was a month ago. What do I see now?"}, {"4a63": "First, it is only fair to point out that I am an untypical user. I write poetry and mostly read poetry, fiction and literary non-fiction. That certainly skews my point of view."}, {"a238": "What have I gotten for my five dollars? Frankly, nothing worth five dollars. A green half halo, the new homepage which I don’t like, like or use, and the members only emails."}, {"24e3": "So far, I have not seen a single article in the members only emails that I have had any interest in reading. It is all the stuff I avoid on Medium: tech, self-help, SJW politics, etc. A good example would be Creating Usability with Motion: The UX in Motion Manifesto. Fascinating stuff, for someone."}, {"3899": "One email said that they would be adding Lit as a category, whatever Lit means. Problem is, being included in that amorphous category would put my work behind the pay wall. That would limit possible readers. As I am on Medium only for the audience, that would be bad for me."}, {"b0a9": "Neither have I seen any interface upgrades, like the much needed text editor capability for spacing and line breaks, so important to poets."}, {"3acb": "As far as I can tell, membership has no benefits for those whose writing is mostly literature and whose interests are mostly the same."}, {"639d": "I intend to continue the membership for a few months, if only to see what happens or changes. Beyond that, I doubt I will."}, {"f1af": "I have read no complaints from non-members saying that their user experience has been degraded. If there are neither down-sides or up-sides, you have to ask: what’s the point."}, {"329c": "Mike"}, {"45f3": "If you value my work, and can afford it, please consider occasionally sending me a buck or two at Paypal. Even poets have to eat. :)"}, {"1439": "Pay Mike Essig using PayPal.MeGo to paypal.me/bookgardener and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me"}], "author": "Mike Essig", "child": "1209_1\t1209_2\t1209_3\t1209_4\t1209_5\t1209_6\t1209_7\t1209_8\t1209_9\t1209_10\t1209_11\t1209_12\t1209_13\t1209_14\t1209_151209_1\t1209_2\t1209_3\t1209_4\t1209_5\t1209_6\t1209_7\t1209_8\t1209_9\t1209_10\t1209_11\t1209_12\t1209_13\t1209_14\t1209_15", "name": "1209", "content": "Medium’s Membership Deal So Far: Following up JLA City Church I was one of the first to respond to this, although Renée S and Aura Wilming then did much better jobs of it than I did. That was a month ago. What do I see now? First, it is only fair to point out that I am an untypical user. I write poetry and mostly read poetry, fiction and literary non-fiction. That certainly skews my point of view. What have I gotten for my five dollars? Frankly, nothing worth five dollars. A green half halo, the new homepage which I don’t like, like or use, and the members only emails. So far, I have not seen a single article in the members only emails that I have had any interest in reading. It is all the stuff I avoid on Medium: tech, self-help, SJW politics, etc. A good example would be Creating Usability with Motion: The UX in Motion Manifesto. Fascinating stuff, for someone. One email said that they would be adding Lit as a category, whatever Lit means. Problem is, being included in that amorphous category would put my work behind the pay wall. That would limit possible readers. As I am on Medium only for the audience, that would be bad for me. Neither have I seen any interface upgrades, like the much needed text editor capability for spacing and line breaks, so important to poets. As far as I can tell, membership has no benefits for those whose writing is mostly literature and whose interests are mostly the same. I intend to continue the membership for a few months, if only to see what happens or changes. Beyond that, I doubt I will. I have read no complaints from non-members saying that their user experience has been degraded. If there are neither down-sides or up-sides, you have to ask: what’s the point. Mike If you value my work, and can afford it, please consider occasionally sending me a buck or two at Paypal. Even poets have to eat. :) Pay Mike Essig using PayPal.MeGo to paypal.me/bookgardener and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me "}