{"parent": "", "timestamp": "Apr 15", "title": "How to Create a Compelling Character Arc", "sentences": [{"71dd": "How to Create a Compelling Character Arc"}, {"6bf8": "The standard definition of a character arc is how your main character changes over the course of your story."}, {"65f0": "The most common form of character arc is the Hero’s Journey. An ordinary person receives a call to adventure and, at first, he or she refuses that call. There’s usually a mentor who helps the hero accept or learn how to attempt the adventure. Think of Yoda in Star Wars."}, {"872f": "On the Hero’s Journey, the main character goes through many tests, trials, friends and enemies as he or she prepares for the final challenge. The journey culminates in the hero facing down the opposition where he finally acquires his goal, whether it’s a golden chalice or the princess’s hand. There’s a sort of resurrection where the hero comes from the brink of death or destruction to a higher form of being. Then the main character finally returns home — a hero."}, {"ff4c": "There’s More to the Character Arc"}, {"fcd8": "It’s important to note that there’s more out there than just the good guy or gal who’s transformed by the end of the story. Not all characters undergo some major transformation. In some cases, your main character will grow, but not transform."}, {"a50c": "In fact, most character arcs can be simplified to fit into three different, but sometimes overlapping, categories:"}, {"63b5": "1. The Change Arc (aka the Hero’s Journey)."}, {"becc": "Probably the most common, or at least the most recognizable. By the end of the tale, the main character has conquered and becomes a usually unlikely hero. Some examples include:"}, {"aba9": "2. The Growth Arc"}, {"3c76": "This is where your main character becomes a better version of who he or she really is. Another version of the Growth Arc is a Shift Arc where the main character shifts his opinion or perspective about a certain situation or a group of people. Some examples of a growth arc include:"}, {"eeff": "3. The Negative or Fall Arc (aka the Tragedy)."}, {"06a2": "Our main character fails, he or she is doomed, or death occurs. Shakespeare was excellent at writing compelling tragedies."}, {"3660": "There you have the 3 major character arcs. People may — and do — argue that there’s more than just these 3 character arcs and perhaps they’re right. It can also be argued that there are no original story lines, just variant degrees of the same plot. I’ll leave those arguments for another article."}, {"4cd6": "Character Arc & Story Arc"}, {"3331": "You can’t have one without the other. Your story arc informs what happens to your MC to induce change and transformation, help her grow into a stronger version of herself, or become his undoing by the end. When you plan out your story arc, you should create it with one thought in mind: how is this going to affect my main character’s inner world?"}, {"e43a": "If you don’t know where your story is headed, how can you determine how your main character will be affected? And at the same time, if you don’t know how your main character is going to change and grow by the end, how can you decide what events to include in your story that will induce that change or growth?"}, {"9b52": "The best stories have an intimately intertwined story arc and character arc that feed off each other."}, {"1f2e": "How Do You Create a Character Arc?"}, {"81d3": "Now you need to figure out which character arc to use in your story. Ask yourself these three questions:"}, {"8aaa": "Knowing where your main character starts out and where you want him to be by the resolution will dictate the character arc you choose."}, {"38c8": "Remember, your story arc and your character arc are irrevocably intertwined: each plot point on your story arc helps your character change or grow. And your character’s growth dictates how the will respond to each new point on your plot. These two facets of writing work together to get your MC to the climax of your story."}, {"5cfb": "Now to Make Your Character Arc Compelling"}, {"9dbc": "It’s safe to assume that in real life, most people are striving to do or be someone better. We all want to feel complete and know that we’re living up to our potential. That’s probably why there are so many self-help apps out there to help you conquer everything from procrastination to eliminating bad habits and even running a marathon (if that’s your thing)."}, {"d163": "Our journeys are all different because we each have a unique vision of what’s missing from our lives and what it takes to be complete or whole. And what makes a character arc ultimately compelling is taking the universal truths about a life journey and showing your reader how your main character achieves the very thing we all hope for. Is it love? Or perhaps hero status? Maybe it’s ultimate heartbreak. Whatever it is, it’s your character arc."}, {"2ede": "Do you believe the world needs more good writing? Please share this with all the writers in your life and hit that ♥ button to spread it around even more."}, {"2058": "https://prowritingaid.com/?utm_source=medium&utm_medium=character%20arc"}, {"a9cc": "Originally published at prowritingaid.com."}], "author": "ProWritingAid", "child": "1210_11210_1", "name": "1210", "content": "How to Create a Compelling Character Arc The standard definition of a character arc is how your main character changes over the course of your story. The most common form of character arc is the Hero’s Journey. An ordinary person receives a call to adventure and, at first, he or she refuses that call. There’s usually a mentor who helps the hero accept or learn how to attempt the adventure. Think of Yoda in Star Wars. On the Hero’s Journey, the main character goes through many tests, trials, friends and enemies as he or she prepares for the final challenge. The journey culminates in the hero facing down the opposition where he finally acquires his goal, whether it’s a golden chalice or the princess’s hand. There’s a sort of resurrection where the hero comes from the brink of death or destruction to a higher form of being. Then the main character finally returns home — a hero. There’s More to the Character Arc It’s important to note that there’s more out there than just the good guy or gal who’s transformed by the end of the story. Not all characters undergo some major transformation. In some cases, your main character will grow, but not transform. In fact, most character arcs can be simplified to fit into three different, but sometimes overlapping, categories: 1. The Change Arc (aka the Hero’s Journey). Probably the most common, or at least the most recognizable. By the end of the tale, the main character has conquered and becomes a usually unlikely hero. Some examples include: 2. The Growth Arc This is where your main character becomes a better version of who he or she really is. Another version of the Growth Arc is a Shift Arc where the main character shifts his opinion or perspective about a certain situation or a group of people. Some examples of a growth arc include: 3. The Negative or Fall Arc (aka the Tragedy). Our main character fails, he or she is doomed, or death occurs. Shakespeare was excellent at writing compelling tragedies. There you have the 3 major character arcs. People may — and do — argue that there’s more than just these 3 character arcs and perhaps they’re right. It can also be argued that there are no original story lines, just variant degrees of the same plot. I’ll leave those arguments for another article. Character Arc & Story Arc You can’t have one without the other. Your story arc informs what happens to your MC to induce change and transformation, help her grow into a stronger version of herself, or become his undoing by the end. When you plan out your story arc, you should create it with one thought in mind: how is this going to affect my main character’s inner world? If you don’t know where your story is headed, how can you determine how your main character will be affected? And at the same time, if you don’t know how your main character is going to change and grow by the end, how can you decide what events to include in your story that will induce that change or growth? The best stories have an intimately intertwined story arc and character arc that feed off each other. How Do You Create a Character Arc? Now you need to figure out which character arc to use in your story. Ask yourself these three questions: Knowing where your main character starts out and where you want him to be by the resolution will dictate the character arc you choose. Remember, your story arc and your character arc are irrevocably intertwined: each plot point on your story arc helps your character change or grow. And your character’s growth dictates how the will respond to each new point on your plot. These two facets of writing work together to get your MC to the climax of your story. Now to Make Your Character Arc Compelling It’s safe to assume that in real life, most people are striving to do or be someone better. We all want to feel complete and know that we’re living up to our potential. That’s probably why there are so many self-help apps out there to help you conquer everything from procrastination to eliminating bad habits and even running a marathon (if that’s your thing). Our journeys are all different because we each have a unique vision of what’s missing from our lives and what it takes to be complete or whole. And what makes a character arc ultimately compelling is taking the universal truths about a life journey and showing your reader how your main character achieves the very thing we all hope for. Is it love? Or perhaps hero status? Maybe it’s ultimate heartbreak. Whatever it is, it’s your character arc. Do you believe the world needs more good writing? Please share this with all the writers in your life and hit that ♥ button to spread it around even more. https://prowritingaid.com/?utm_source=medium&utm_medium=character%20arc Originally published at prowritingaid.com. "}