{"parent": "", "timestamp": "Apr 15", "title": "The Black Terror Rides Again", "sentences": [{"cc9a": "The Black Terror Rides Again"}, {"6492": "Heroic family legacies can become quite complicated"}, {"b9f6": "The old superhero in the mix — by artist Andreas Englund"}, {"2d6f": "“Dad, he’s wearing it again.” I heard my daughter shout as she was running out the door on her way to her date."}, {"0e92": "Damn. I knew what she meant as soon as she said it. I meant to put that costume in storage after the last time I managed to get him out of it."}, {"f278": "To be honest I was surprised she noticed it. She would have had to look up from her phone and see anyone existed besides her. To be fair to Pop, he was once an imposing figure in his Black Terror outfit."}, {"1826": "He’s sitting at the table peeling an orange, his once rock-solid hands trembled slightly and his forehead was furled as if he were in deep concentration."}, {"4852": "He wore his costume, his last identity as the Black Terror, an identity which was a scourge to the scum and villainy of Chicago, but it hung loosely off his narrowed and aging frame. As I pass around him, I see him wearing my stunner pistol, a replacement for the Desert Eagle he used to prefer."}, {"db29": "I was trying to wean him from the superhero lifestyle when he turned sixty and wasn’t quite able to leap tall buildings any more. He had taken to driving the Terror-mobile again until he lost his license at seventy."}, {"053e": "It seemed like his powers were fading with age but he didn’t seem to be willing to spend more time doing less hero-related things. I had him in the Cave helping me, doing remote support, managing drones and the like but he hates it. Says it lacks the personal touch."}, {"2f90": "“You must be feeling good today, Pop. Were you planning on going out?”"}, {"8b5c": "“Did you fix the autopilot for the Terror-mobile?” His voice once caused grown men to wet themselves had lost none of its mysterious baritone. But it always seemed strange when he talked about mundane things."}, {"3069": "“Yes, Pop. It can drive you anywhere you want to go, but I am not sure you should be going to crime alerts these days. It’s gotten dangerous again.”"}, {"071c": "He looked up at me while dribbling a bit of orange juice from his lips. His blue eyes still had that sting of a hero who had seen and done just about anything in the name of justice. When I was his sidekick that look told me what to do without a word."}, {"7133": "Now, it told me: “I’m going out and you better not say too much to me about it. I am wearing this peashooter and I haven’t killed anyone in three years. Now can we eat breakfast in peace?”"}, {"2540": "When I was his sidekick, I would have sat there and ate quietly. But I don’t work for him any more."}, {"0487": "“Pop, how about we patrol together. I have a new Knight-Wing glider pack I think might help you get around town.”"}, {"ddff": "Dropping the last peel on the counter, he stood up and drew the stunner, firing three rounds right at me. His draw was every bit as perfect as I remembered, smooth, effortless, with barely a hitch."}, {"e824": "“I don’t need your damn pity.”"}, {"8853": "I caught all three rounds in a tight group right before they hit my face. All three released their charges into my hands making my fingers tingle. I hate taking the old man off the streets. He is every bit as dangerous as he has ever been, at least with a firearm."}, {"20e3": "But when he’s in a bad mood, people die."}, {"015d": "“See, Pop. This is why you can’t go out. Even with the stunner, someone is going to get hurt because you can’t curb your instincts.”"}, {"1d50": "“Have you been reading the papers, boy? People are already dying. What they need is a reminder of why this city was the safest place in the world for twenty years when I ran it.”"}, {"9ed0": "“Pop, you were considered a supervillain for the last ten years because you kept crossing the line.” I knew we were about to have that argument again."}, {"9d65": "He gave me the aggrieved look of an old man betrayed. “You left. You thought it was time for Knight-Wing to fly alone. We were the Black Terror and Knight-Wing for almost a decade. Chicago was never safer. Then you decided you wanted to go out on your own. What did you think was going to happen?”"}, {"4795": "“I didn’t think you were going to become a homicidal maniac solving Chicago’s crime problem with a bullet between the eyes of every two bit criminal and supervillain who crossed your path. It was your behavior which has made the city what it is now. A place where everyone thinks they can do what they want. You became the problem, Pop. You didn’t solve it, you escalated it.”"}, {"e981": "He gave me a look which spoke volumes. I remember when his powers started fading. I left him during those years when he needed me most."}, {"1917": "I thought he was holding me back. The Justice Legion invited me to join them, without him. He was devastated, but pretended it didn’t matter."}, {"57e1": "He took more risks. He faced villains out of his league, made worse by his slowly disappearing superhuman strength and invulnerability. When mom died, because of him, he broke. He killed everyone involved in her death."}, {"e519": "I hunted him down but could not bring myself to turn him in. It took me a long time to come to understand my part in what happened. He and I fought it out. We collapsed a burnt out tenement on the South Side."}, {"f42a": "Bloody, brutal, final. I retired the Black Terror for good. I carried him home and nursed him back to health. He was never the same after that."}, {"73b4": "“Pop, if you insist on going out, you can’t wear that rig. You know this. The Justice Legion would pick you up. They already suspect you’re the Sand Man. The only reason they don’t pick you up is you haven’t killed anyone yet.”"}, {"f581": "“Yet.”"}, {"9d22": "“Pop. We are not having this conversation. Either you work the way we’ve discussed or you can’t go out, at all.”"}, {"e763": "He looks down at the stunner and taking it between his hands, he proceeds to bend it into a pretzel. I wince. Those things aren’t cheap."}, {"c61d": "Tossing the gun on the counter amid the orange peels, he gives me that bone-chilling look I remember the first night we ever patrolled together."}, {"76c3": "“Boy, did you forget, I was once the Black Terror. I have killed more people than you have saved in your career. The people I killed deserved to die and I hope they are burning in hell right now.”"}, {"dc6c": "Turning around he proceeds to strip out of his Black Terror costume and drops it in the trash on his way out of the kitchen. “Now I am going to go in the back and put on that nanby-pamby Sand Man costume and I intend to go into the most crime-ridden parts of the city, where people are dying because no one in the Justice Legion can be bothered to go there and dispense some good old fashioned, two-fisted justice. You got a problem with that?”"}, {"7713": "I follow him into the back and driven by his frustration, watch him put on the protective Sand Man gear. This is the fastest I have seen him do so for quite some time."}, {"49e6": "“No, Pop. I don’t have a problem with that. Promise me you won’t kill anyone.”"}, {"c7a4": "“Does maiming count?” He threw down a smoke grenade and disappeared."}, {"0e06": "Compromise reached. I guess I better call the Justice Legion crime monitoring desk and see whose on duty. They won’t catch him, he’s been avoiding them for the last twenty years, but they should at least know where to start cleaning up."}, {"fdb0": "Better go get that glider pack ready. Sounds like it might be a long night."}, {"53a1": "Thaddeus Howze is a writer, essayist, author and professional storyteller for mysterious beings who exist in non-Euclidean realms beyond our understanding. You can follow him on Twitter or support his writings on Patreon. But one of the best ways to show you care is to share this story."}], "author": "Thaddeus Howze", "child": "1212_1", "name": "1212", "content": "The Black Terror Rides Again Heroic family legacies can become quite complicated The old superhero in the mix — by artist Andreas Englund “Dad, he’s wearing it again.” I heard my daughter shout as she was running out the door on her way to her date. Damn. I knew what she meant as soon as she said it. I meant to put that costume in storage after the last time I managed to get him out of it. To be honest I was surprised she noticed it. She would have had to look up from her phone and see anyone existed besides her. To be fair to Pop, he was once an imposing figure in his Black Terror outfit. He’s sitting at the table peeling an orange, his once rock-solid hands trembled slightly and his forehead was furled as if he were in deep concentration. He wore his costume, his last identity as the Black Terror, an identity which was a scourge to the scum and villainy of Chicago, but it hung loosely off his narrowed and aging frame. As I pass around him, I see him wearing my stunner pistol, a replacement for the Desert Eagle he used to prefer. I was trying to wean him from the superhero lifestyle when he turned sixty and wasn’t quite able to leap tall buildings any more. He had taken to driving the Terror-mobile again until he lost his license at seventy. It seemed like his powers were fading with age but he didn’t seem to be willing to spend more time doing less hero-related things. I had him in the Cave helping me, doing remote support, managing drones and the like but he hates it. Says it lacks the personal touch. “You must be feeling good today, Pop. Were you planning on going out?” “Did you fix the autopilot for the Terror-mobile?” His voice once caused grown men to wet themselves had lost none of its mysterious baritone. But it always seemed strange when he talked about mundane things. “Yes, Pop. It can drive you anywhere you want to go, but I am not sure you should be going to crime alerts these days. It’s gotten dangerous again.” He looked up at me while dribbling a bit of orange juice from his lips. His blue eyes still had that sting of a hero who had seen and done just about anything in the name of justice. When I was his sidekick that look told me what to do without a word. Now, it told me: “I’m going out and you better not say too much to me about it. I am wearing this peashooter and I haven’t killed anyone in three years. Now can we eat breakfast in peace?” When I was his sidekick, I would have sat there and ate quietly. But I don’t work for him any more. “Pop, how about we patrol together. I have a new Knight-Wing glider pack I think might help you get around town.” Dropping the last peel on the counter, he stood up and drew the stunner, firing three rounds right at me. His draw was every bit as perfect as I remembered, smooth, effortless, with barely a hitch. “I don’t need your damn pity.” I caught all three rounds in a tight group right before they hit my face. All three released their charges into my hands making my fingers tingle. I hate taking the old man off the streets. He is every bit as dangerous as he has ever been, at least with a firearm. But when he’s in a bad mood, people die. “See, Pop. This is why you can’t go out. Even with the stunner, someone is going to get hurt because you can’t curb your instincts.” “Have you been reading the papers, boy? People are already dying. What they need is a reminder of why this city was the safest place in the world for twenty years when I ran it.” “Pop, you were considered a supervillain for the last ten years because you kept crossing the line.” I knew we were about to have that argument again. He gave me the aggrieved look of an old man betrayed. “You left. You thought it was time for Knight-Wing to fly alone. We were the Black Terror and Knight-Wing for almost a decade. Chicago was never safer. Then you decided you wanted to go out on your own. What did you think was going to happen?” “I didn’t think you were going to become a homicidal maniac solving Chicago’s crime problem with a bullet between the eyes of every two bit criminal and supervillain who crossed your path. It was your behavior which has made the city what it is now. A place where everyone thinks they can do what they want. You became the problem, Pop. You didn’t solve it, you escalated it.” He gave me a look which spoke volumes. I remember when his powers started fading. I left him during those years when he needed me most. I thought he was holding me back. The Justice Legion invited me to join them, without him. He was devastated, but pretended it didn’t matter. He took more risks. He faced villains out of his league, made worse by his slowly disappearing superhuman strength and invulnerability. When mom died, because of him, he broke. He killed everyone involved in her death. I hunted him down but could not bring myself to turn him in. It took me a long time to come to understand my part in what happened. He and I fought it out. We collapsed a burnt out tenement on the South Side. Bloody, brutal, final. I retired the Black Terror for good. I carried him home and nursed him back to health. He was never the same after that. “Pop, if you insist on going out, you can’t wear that rig. You know this. The Justice Legion would pick you up. They already suspect you’re the Sand Man. The only reason they don’t pick you up is you haven’t killed anyone yet.” “Yet.” “Pop. We are not having this conversation. Either you work the way we’ve discussed or you can’t go out, at all.” He looks down at the stunner and taking it between his hands, he proceeds to bend it into a pretzel. I wince. Those things aren’t cheap. Tossing the gun on the counter amid the orange peels, he gives me that bone-chilling look I remember the first night we ever patrolled together. “Boy, did you forget, I was once the Black Terror. I have killed more people than you have saved in your career. The people I killed deserved to die and I hope they are burning in hell right now.” Turning around he proceeds to strip out of his Black Terror costume and drops it in the trash on his way out of the kitchen. “Now I am going to go in the back and put on that nanby-pamby Sand Man costume and I intend to go into the most crime-ridden parts of the city, where people are dying because no one in the Justice Legion can be bothered to go there and dispense some good old fashioned, two-fisted justice. You got a problem with that?” I follow him into the back and driven by his frustration, watch him put on the protective Sand Man gear. This is the fastest I have seen him do so for quite some time. “No, Pop. I don’t have a problem with that. Promise me you won’t kill anyone.” “Does maiming count?” He threw down a smoke grenade and disappeared. Compromise reached. I guess I better call the Justice Legion crime monitoring desk and see whose on duty. They won’t catch him, he’s been avoiding them for the last twenty years, but they should at least know where to start cleaning up. Better go get that glider pack ready. Sounds like it might be a long night. Thaddeus Howze is a writer, essayist, author and professional storyteller for mysterious beings who exist in non-Euclidean realms beyond our understanding. You can follow him on Twitter or support his writings on Patreon. But one of the best ways to show you care is to share this story. "}