{"parent": "", "timestamp": "Apr 3", "title": "When Fathers Fail", "sentences": [{"a42e": "When Fathers Fail"}, {"9c43": "When your natural example is a disaster, how long before your feet find their way off the cliff?"}, {"fc54": "I grew up with a father and then I did not, because there is a difference between having a father and being raised by one."}, {"98af": "My mother tried to fill this father vacuum in all the ways she could, and watching her stretch herself every day was awe-inspiring as it was gut-wrenching."}, {"96ed": "But there are some things that even superwomen cannot do, conversations you cannot have with your mother even when you both want to."}, {"0b0d": "Like there is a way about a woman and her daughter, there is a way about a man and his son."}, {"8d2b": "Debit my heart of a father’s guidance and credit it with a man-sized hole I still don’t know how to deal with."}, {"6742": "I feel like a chunk of my life is missing, like there are things I should know that I have no clue about: lessons I never learned dancing on the fringes of my memory, tormenting me. I should know these things, I should, but I do not and the existence of the nonexistent haunts me."}, {"b39e": "I worry for people like me."}, {"9573": "I worry that our dreams are incomplete, like our fractured realities."}, {"6d20": "I worry that we are sick, afflicted by the same disease that led our fathers astray."}, {"8a87": "The fruit and the tree it fell from are the same. Can you not see the mark of the stalk at the base of the fruit?"}, {"5f06": "We are branded, in places the world does not see."}, {"6d8c": "This is not like ink you can wash off, not like the dirt that leaves as feet are scrubbed clean."}, {"623e": "It is in the soul."}, {"5fb0": "My father left because he could not bear the truth, and maybe he is still running from it."}, {"c41a": "I am facing my own truth now. I hope I am not too late."}, {"7b8b": "I am flawed. I am inadequate. I am dangerous to my own self."}, {"1b39": "I have seen shades of a monster in me. I have been the nightmare that wakes me on some nights."}, {"385d": "How can I be anyone’s comfort when I am the terror they run from, just veiled by a thin mask of perfunctory politeness?"}, {"d5b4": "Can I be my mother’s son instead of my father’s, maybe that might save me?"}, {"29b3": "Can I trade the set of footprints I have been following for another that doesn’t end catastrophically?"}, {"c042": "When fathers fail, what hope do the sons have?"}, {"1ace": "Broken fathers raise broken sons, like the poisoned tree and its bitter fruit."}, {"9b65": "There is a kola tree in my childhood home, tall and almost majestic."}, {"9c18": "But its nuts are slimy."}, {"133e": "Appearances are nothing."}, {"bb2a": "When fathers fail, they cut their sons with the jagged edges of their brokenness and we bear the scars beneath our skins."}, {"7dc0": "I am afraid for the women we love."}, {"687b": "They do not yet know how much saving we will need, and how fiercely we will cling to them because we are afraid of being alone with my fears."}, {"2c5b": "We are afraid of failing too."}, {"0b44": "I pray we never do."}], "author": "Oreoluwa Fakorede", "child": "1216_1\t1216_2\t1216_3\t1216_4\t1216_5\t1216_6\t1216_7\t1216_8\t1216_9\t1216_10\t1216_11\t1216_12\t1216_13\t1216_14\t1216_15\t1216_16\t1216_17", "name": "1216", "content": "When Fathers Fail When your natural example is a disaster, how long before your feet find their way off the cliff? I grew up with a father and then I did not, because there is a difference between having a father and being raised by one. My mother tried to fill this father vacuum in all the ways she could, and watching her stretch herself every day was awe-inspiring as it was gut-wrenching. But there are some things that even superwomen cannot do, conversations you cannot have with your mother even when you both want to. Like there is a way about a woman and her daughter, there is a way about a man and his son. Debit my heart of a father’s guidance and credit it with a man-sized hole I still don’t know how to deal with. I feel like a chunk of my life is missing, like there are things I should know that I have no clue about: lessons I never learned dancing on the fringes of my memory, tormenting me. I should know these things, I should, but I do not and the existence of the nonexistent haunts me. I worry for people like me. I worry that our dreams are incomplete, like our fractured realities. I worry that we are sick, afflicted by the same disease that led our fathers astray. The fruit and the tree it fell from are the same. Can you not see the mark of the stalk at the base of the fruit? We are branded, in places the world does not see. This is not like ink you can wash off, not like the dirt that leaves as feet are scrubbed clean. It is in the soul. My father left because he could not bear the truth, and maybe he is still running from it. I am facing my own truth now. I hope I am not too late. I am flawed. I am inadequate. I am dangerous to my own self. I have seen shades of a monster in me. I have been the nightmare that wakes me on some nights. How can I be anyone’s comfort when I am the terror they run from, just veiled by a thin mask of perfunctory politeness? Can I be my mother’s son instead of my father’s, maybe that might save me? Can I trade the set of footprints I have been following for another that doesn’t end catastrophically? When fathers fail, what hope do the sons have? Broken fathers raise broken sons, like the poisoned tree and its bitter fruit. There is a kola tree in my childhood home, tall and almost majestic. But its nuts are slimy. Appearances are nothing. When fathers fail, they cut their sons with the jagged edges of their brokenness and we bear the scars beneath our skins. I am afraid for the women we love. They do not yet know how much saving we will need, and how fiercely we will cling to them because we are afraid of being alone with my fears. We are afraid of failing too. I pray we never do. "}