{"parent": "", "timestamp": "Apr 14", "title": "Discipline, that’s how you get an upside-down, pineapple cake sundae.", "sentences": [{"0af7": "Discipline, that’s how you get an upside-down, pineapple cake sundae."}, {"3891": "Near the end of a hike that started off as a shutter clicking festival, I stated, “I need ice cream.”"}, {"67ec": "My girlfriend was also completely spent. I understood her immediate dismissal, but she had offered on the way to the hike; that lasted for miles, and destroyed my knees."}, {"8e0d": "The last thing we ate, well before the turn around point, was; cashews, pretzels, cheese, other salty snacks, some melon, and I had some canned herring. It was enough to stop being hungry."}, {"c1ff": "Mind you, we were still fairly frisky at the turn around point. My knees were not in their death throws, and my back was still being quiet."}, {"518f": "Anyway, by the halfway point on our death march back to the car, I had totally stopped snapping pictures. We had been attempting to preserve every detail, and then, it was all about getting back to the car."}, {"1e15": "She still straggled behind at that point, determined to use up every, last drop of juice in the second camera battery. My body had been waging a war of pain, my ignorance was not about to be forgiven. Then I went into meditation. I know, but I am a Buddhist, and that shit can help when done properly."}, {"4b62": "However, this time the meditation helped my spirits, and cleared my mind, but my knees, they laughed and laughed and laughed."}, {"7ec7": "So, I went straight to the best walking mantra on the earth. I mean this was a fight. I was dying to call it quits. Find a soft log to put my head on, and call it a night."}, {"17c1": "What’s that mantra?"}, {"0a69": "Your left,"}, {"df64": "Your left,"}, {"d206": "Your left, right, left."}, {"0949": "Yup, having been in the Army, it was easily drilled into my head. I managed to buck the pain, and even increase my speed. It was a much needed second wind."}, {"b57c": "Back at the car we debated the finer points of stopping before we could plop our wounded bodies in bed. I, naturally won. I mean, c’mon it was on the way home, and Sonic had a drive thru."}, {"78fa": "Now, I know what you are thinking. That sundae looks like it is lacking cake. You are correct, but what else do you call a sundae with pineapple and caramel toppings?"}, {"bdb7": "Ok, ok, you want some pictures. Here is the first wave. This is just a few of the ones captured with my phone. I have one I cropped for a future poem, and some others taken with a DSLR. Some with auto lens, and some totally manual, including; shutter, iso, and f-stop."}], "author": "BHD", "child": "1220_1\t1220_21220_1\t1220_2", "name": "1220", "content": "Discipline, that’s how you get an upside-down, pineapple cake sundae. Near the end of a hike that started off as a shutter clicking festival, I stated, “I need ice cream.” My girlfriend was also completely spent. I understood her immediate dismissal, but she had offered on the way to the hike; that lasted for miles, and destroyed my knees. The last thing we ate, well before the turn around point, was; cashews, pretzels, cheese, other salty snacks, some melon, and I had some canned herring. It was enough to stop being hungry. Mind you, we were still fairly frisky at the turn around point. My knees were not in their death throws, and my back was still being quiet. Anyway, by the halfway point on our death march back to the car, I had totally stopped snapping pictures. We had been attempting to preserve every detail, and then, it was all about getting back to the car. She still straggled behind at that point, determined to use up every, last drop of juice in the second camera battery. My body had been waging a war of pain, my ignorance was not about to be forgiven. Then I went into meditation. I know, but I am a Buddhist, and that shit can help when done properly. However, this time the meditation helped my spirits, and cleared my mind, but my knees, they laughed and laughed and laughed. So, I went straight to the best walking mantra on the earth. I mean this was a fight. I was dying to call it quits. Find a soft log to put my head on, and call it a night. What’s that mantra? Your left, Your left, Your left, right, left. Yup, having been in the Army, it was easily drilled into my head. I managed to buck the pain, and even increase my speed. It was a much needed second wind. Back at the car we debated the finer points of stopping before we could plop our wounded bodies in bed. I, naturally won. I mean, c’mon it was on the way home, and Sonic had a drive thru. Now, I know what you are thinking. That sundae looks like it is lacking cake. You are correct, but what else do you call a sundae with pineapple and caramel toppings? Ok, ok, you want some pictures. Here is the first wave. This is just a few of the ones captured with my phone. I have one I cropped for a future poem, and some others taken with a DSLR. Some with auto lens, and some totally manual, including; shutter, iso, and f-stop. "}