{"parent": "", "timestamp": "Mar 30", "title": "Doug & Lou’s Exceptional Adventure : More Beautiful Rocks …. but I want to go home!", "sentences": [{"0fd4": "Doug & Lou’s Exceptional Adventure : More Beautiful Rocks …. but I want to go home!"}, {"d7c4": "It’s been more than a week since I wrote anything. Some of you will think that we actually fell over one of those cliffs we keep raving about! That didn’t happen, (Only because I didn’t go near the edge) but we did fit a whirlwind of activity into our last few days in ‘AMERICA’."}, {"be33": "March 17th, after our Bryce adventure, we didn’t go very far before finding a nice little KOA for the night. It was a beautiful day….there were people milling about and there were SHOWERS!! A comfortable night of sitting around the Rig, sipping cocktails and telling each other how good it would be to get home!…..but…..not quite yet…..because we had not seen ARCHES National Park…the last biggie on the bucket list!"}, {"6bab": "Green River did not look too far on the map….so we made a reservation there for the night and headed out to see new sights. It ended up being about 220 miles, but because of the winding roads and frequent ‘plaque attack’ stops, it took us an entire day."}, {"5682": "Layers and layers of colour"}, {"4750": "We stopped to see an ancient Puebloan granary in the cliffs."}, {"fe7a": "The Puebloans stored grain and other harvests way up there on the side of a cliff — AMAZING! ( If you look at the top of the arch, below is another arch, then look at the far right of the 2nd arch. See the granary with a window like opening top middle. Follow the ledge that it is on, to the left in the middle you will see a wider wall. Both areas were used for grain storage. probably 800 to 1500 yrs old.)"}, {"fe4b": "….and then stopped by a petrified forest"}, {"66b1": "This long rock was once a tree"}, {"9819": "Our home away from home …… TAKE ME HOME!"}, {"cdcf": "We travelled along Highway 12 for much of the morning. After the petrified forest we passed over the ‘HOGBACK’…..oh my….I am sure it was absolutely breathtaking…..it certainly took MY breath away!! Two lanes of traffic going over big drop offs on both sides!"}, {"13cb": "Hogback Ridge, Utah…..photo stolen from Google images"}, {"bd7a": "I can’t take credit for the above photo…..someone donated it to Google Images and I used it. Camera shake would have been too noticeable if I had even tried to snap a photo ….. those drop offs are much steeper than they look in this photo. I will have to say, after all these miles and miles of crazy roads, my hubby is a pretty good driver!! Thanks HONEY!! Sorry I grabbed the dash so many times! (The garage says they can work out the dents in the dash.)"}, {"cec3": "We made it over Hogback….Utah’s Highway 12 really is very, very scenic! We stopped at a few more scenic wonders"}, {"9df3": "…… but then we turned onto Highway 24 and the scenery got even better…"}, {"d288": "These images cropped up beside the road! How can you drive past these pinnacles? Utah is one BEAUTIFUL state! Put it on your BUCKET LIST…you won’t be sorry."}, {"8f94": "We made it to our little KOA campground in Green River! Not impressed with the town, or the KOA….but it was a place to park for the night. Next morning we headed to our final destination: ARCHES NATIONAL PARK in Moab, Utah!"}, {"2cb1": "This is the lineup of cars waiting to go through the park gates! SLOW…..but worth it! ( Fossil Dunes at the bottom then sediment layers from ancient seas on top.)"}, {"4a52": "There is construction happening in Arches National Park. Hopefully it is going to address the entrance to the park. So many cars…..so little time!"}, {"0ffb": "Don’t stand under that one!"}, {"109f": "There’s an ARCH"}, {"460a": "This rock won’t be too bad to hike on, will it???"}, {"268a": "And there are neat petroglyphs down here at the bottom…."}, {"37d0": "Come on, Louise….it is just a short climb up (I lied. ha) to the top there…..and then we will get to see the best arch in the park!"}, {"7879": "Okay, Doug….Let’s hike. It was hot out….and no one told us it was uphill all the way. We went back to the rig for a bottle of water, just as an after thought before climbing!. See those little specks on top of that hill….those are people….and that is only about 1/2 way to the Delicate Arch! WHEW!!….I think I am out of shape…..or something!"}, {"1fe3": "Delicate ARCH….worth the climb!"}, {"0b0b": "After reaching the top of that huge hill (rock)….we hiked in the shade for a bit, along the top of a cliff. Luckily it was wide enough and the trail was good and solid…..I kept close to the inside near the rock, because it was a good drop off. Such bravery! Delicate Arch is very beautiful and worth the 2 hour hike! (Half of the world’s known arches are found on the Colorado Plateau. If water caused the erosion these structures would be cut off at the bottom and fall over. Some water is involved but wind and pulverizing sand cuts a lot of this away. Just like Niagara Falls, the top layer is shale — sand stone or lime stone with clay. The clay is from river run off and it makes the shale harder, heavier and the least erosive. Looking at the arch, you can see that the weight on top pushes down and out to the sides, making the sides stronger and harder. Some water could puddle in the middle making that sandstone softer. Eventually the middle cracks away, working its way to the top and in time the whole structure collapses. Several arches fall every 20 to 30 yrs. Go see them while they’re hot! But many small holes that we saw will be next centuries arches, so your grand kids can get to see them too.)"}, {"e85e": "And then I snapped a few more photos before we left…."}, {"7c42": "We stopped in Moab for a couple brew and a lovely meal….found our KOA and spent our last night in Utah."}, {"9b0d": "Homeward Bound! Left Utah on Monday, March 20th and arrived in Orillia on Thursday March 23rd!. Thank you Maureen, for letting us spend the night with you before returning the RIG to Barrie on Friday. (Shortly after we left Mo’s, I turned to Louise in the van and said:”Isn’t it good to be just the two of us again!” She got the joke. We had a good chuckle.)"}, {"dda7": "It is so good to be home! Made it back to Cobourg in time to surprise Emma at her birthday party on Saturday. It is now Thursday, March 30th. We have been home almost a week. I still dream (every night) of being in the vehicle. Doug and I both have vertigo…..but oh…..the memories we have made! Amazing!"}, {"3d74": "I thought I should say my good bye before Louise. She took many, many excellent pictures, kept this blog and cooked all our meals. Hey, come on, I made tea some mornings. Oh, and she did our laundry in little KOA laundry rooms. She’s my sweet heart. In spite of all my rude sarcastic comments — they’re the most fun — we got along well for 3 months squeezed into about 20 sq. ft. of space."}, {"2851": "We travelled a lot of the way with Donald, we tried to leave him behind, but that man just has no couth especially in very crowded quarters. He never had the decency to get out of the Rig, even for a few minutes. BUT, last night just before we went to bed Carl Bernstein (Of Watergate fame and very reputable) said on CNN that yesterday’s announcement of an FBI investigation will be looking at Russian Oligarchs laundering of money through Manafort’s (Trump’s 1st campaign manager) purchasing and reselling of ‘Apartments’ in Trump buildings. Numbered companies and large amounts of money were moved around. Trump was bailed out by the Russians when he went bankrupt 4 times over 2 yrs awhile back. These Russian billionaires would have many reasons to launder money and transfer it into American dollars. The noose is tightening. Was the election rigged? MY prediction: At best Trump will be a lame duck president for 4 years, or gone sooner. But as Andrew points out there will still be the Republican Party with a double majority to contend with — If they can get their act together. Hope springs eternal. XXX DOUG"}, {"972f": "Thanks for travelling with us. There are still places we did not see on this trip that were on the Bucket List. I told Doug that when he goes back next year he will be able to rent a smaller vehicle….because I am not going with him!! I think we might take a year off. 17,000 km in a little less than 3 months is enough. Please come and visit us this summer at the cottage. Life is Rich!"}], "author": "Louise Weldon", "child": "1226_1", "name": "1226", "content": "Doug & Lou’s Exceptional Adventure : More Beautiful Rocks …. but I want to go home! It’s been more than a week since I wrote anything. Some of you will think that we actually fell over one of those cliffs we keep raving about! That didn’t happen, (Only because I didn’t go near the edge) but we did fit a whirlwind of activity into our last few days in ‘AMERICA’. March 17th, after our Bryce adventure, we didn’t go very far before finding a nice little KOA for the night. It was a beautiful day….there were people milling about and there were SHOWERS!! A comfortable night of sitting around the Rig, sipping cocktails and telling each other how good it would be to get home!…..but…..not quite yet…..because we had not seen ARCHES National Park…the last biggie on the bucket list! Green River did not look too far on the map….so we made a reservation there for the night and headed out to see new sights. It ended up being about 220 miles, but because of the winding roads and frequent ‘plaque attack’ stops, it took us an entire day. Layers and layers of colour We stopped to see an ancient Puebloan granary in the cliffs. The Puebloans stored grain and other harvests way up there on the side of a cliff — AMAZING! ( If you look at the top of the arch, below is another arch, then look at the far right of the 2nd arch. See the granary with a window like opening top middle. Follow the ledge that it is on, to the left in the middle you will see a wider wall. Both areas were used for grain storage. probably 800 to 1500 yrs old.) ….and then stopped by a petrified forest This long rock was once a tree Our home away from home …… TAKE ME HOME! We travelled along Highway 12 for much of the morning. After the petrified forest we passed over the ‘HOGBACK’…..oh my….I am sure it was absolutely breathtaking…..it certainly took MY breath away!! Two lanes of traffic going over big drop offs on both sides! Hogback Ridge, Utah…..photo stolen from Google images I can’t take credit for the above photo…..someone donated it to Google Images and I used it. Camera shake would have been too noticeable if I had even tried to snap a photo ….. those drop offs are much steeper than they look in this photo. I will have to say, after all these miles and miles of crazy roads, my hubby is a pretty good driver!! Thanks HONEY!! Sorry I grabbed the dash so many times! (The garage says they can work out the dents in the dash.) We made it over Hogback….Utah’s Highway 12 really is very, very scenic! We stopped at a few more scenic wonders …… but then we turned onto Highway 24 and the scenery got even better… These images cropped up beside the road! How can you drive past these pinnacles? Utah is one BEAUTIFUL state! Put it on your BUCKET LIST…you won’t be sorry. We made it to our little KOA campground in Green River! Not impressed with the town, or the KOA….but it was a place to park for the night. Next morning we headed to our final destination: ARCHES NATIONAL PARK in Moab, Utah! This is the lineup of cars waiting to go through the park gates! SLOW…..but worth it! ( Fossil Dunes at the bottom then sediment layers from ancient seas on top.) There is construction happening in Arches National Park. Hopefully it is going to address the entrance to the park. So many cars…..so little time! Don’t stand under that one! There’s an ARCH This rock won’t be too bad to hike on, will it??? And there are neat petroglyphs down here at the bottom…. Come on, Louise….it is just a short climb up (I lied. ha) to the top there…..and then we will get to see the best arch in the park! Okay, Doug….Let’s hike. It was hot out….and no one told us it was uphill all the way. We went back to the rig for a bottle of water, just as an after thought before climbing!. See those little specks on top of that hill….those are people….and that is only about 1/2 way to the Delicate Arch! WHEW!!….I think I am out of shape…..or something! Delicate ARCH….worth the climb! After reaching the top of that huge hill (rock)….we hiked in the shade for a bit, along the top of a cliff. Luckily it was wide enough and the trail was good and solid…..I kept close to the inside near the rock, because it was a good drop off. Such bravery! Delicate Arch is very beautiful and worth the 2 hour hike! (Half of the world’s known arches are found on the Colorado Plateau. If water caused the erosion these structures would be cut off at the bottom and fall over. Some water is involved but wind and pulverizing sand cuts a lot of this away. Just like Niagara Falls, the top layer is shale — sand stone or lime stone with clay. The clay is from river run off and it makes the shale harder, heavier and the least erosive. Looking at the arch, you can see that the weight on top pushes down and out to the sides, making the sides stronger and harder. Some water could puddle in the middle making that sandstone softer. Eventually the middle cracks away, working its way to the top and in time the whole structure collapses. Several arches fall every 20 to 30 yrs. Go see them while they’re hot! But many small holes that we saw will be next centuries arches, so your grand kids can get to see them too.) And then I snapped a few more photos before we left…. We stopped in Moab for a couple brew and a lovely meal….found our KOA and spent our last night in Utah. Homeward Bound! Left Utah on Monday, March 20th and arrived in Orillia on Thursday March 23rd!. Thank you Maureen, for letting us spend the night with you before returning the RIG to Barrie on Friday. (Shortly after we left Mo’s, I turned to Louise in the van and said:”Isn’t it good to be just the two of us again!” She got the joke. We had a good chuckle.) It is so good to be home! Made it back to Cobourg in time to surprise Emma at her birthday party on Saturday. It is now Thursday, March 30th. We have been home almost a week. I still dream (every night) of being in the vehicle. Doug and I both have vertigo…..but oh…..the memories we have made! Amazing! I thought I should say my good bye before Louise. She took many, many excellent pictures, kept this blog and cooked all our meals. Hey, come on, I made tea some mornings. Oh, and she did our laundry in little KOA laundry rooms. She’s my sweet heart. In spite of all my rude sarcastic comments — they’re the most fun — we got along well for 3 months squeezed into about 20 sq. ft. of space. We travelled a lot of the way with Donald, we tried to leave him behind, but that man just has no couth especially in very crowded quarters. He never had the decency to get out of the Rig, even for a few minutes. BUT, last night just before we went to bed Carl Bernstein (Of Watergate fame and very reputable) said on CNN that yesterday’s announcement of an FBI investigation will be looking at Russian Oligarchs laundering of money through Manafort’s (Trump’s 1st campaign manager) purchasing and reselling of ‘Apartments’ in Trump buildings. Numbered companies and large amounts of money were moved around. Trump was bailed out by the Russians when he went bankrupt 4 times over 2 yrs awhile back. These Russian billionaires would have many reasons to launder money and transfer it into American dollars. The noose is tightening. Was the election rigged? MY prediction: At best Trump will be a lame duck president for 4 years, or gone sooner. But as Andrew points out there will still be the Republican Party with a double majority to contend with — If they can get their act together. Hope springs eternal. XXX DOUG Thanks for travelling with us. There are still places we did not see on this trip that were on the Bucket List. I told Doug that when he goes back next year he will be able to rent a smaller vehicle….because I am not going with him!! I think we might take a year off. 17,000 km in a little less than 3 months is enough. Please come and visit us this summer at the cottage. Life is Rich! "}