{"parent": "", "timestamp": "Apr 14", "title": "The 10 Rules For Successful Entrepreneurs", "sentences": [{"a665": "The 10 Rules For Successful Entrepreneurs"}, {"37a5": "These rules for living will contribute to lifelong success as an entrepreneur."}, {"e45d": "Entrepreneurship isn’t always simple, but as a lifelong focus, it is profoundly worthwhile."}, {"3b8d": "Today I have an adaptation of the 10 Rules for Being Human by Dr. Cherie Carter-Scott that I would like to apply to entrepreneurs. These are timeless rules for success in living an entrepreneurial life, as follows:"}, {"0dde": "1. You will receive entrepreneurial opportunities."}, {"9d53": "You may like them or not, but if you choose them they will be yours for the entire period, however long it is."}, {"7657": "2. You will learn lessons."}, {"f3f6": "You are enrolled in a full-time informal school called life…and your school of life goes by the title of Entrepreneur. Each day in this school you will have the opportunity to learn lessons, experience failure and occasionally to savor success. You may like the lessons or think them irrelevant, stupid and unfair."}, {"d5aa": "3. There are no mistakes, only lessons."}, {"d32e": "The growth and maturing of an entrepreneur is a process of trial, error and experimentation. The “failed” experiments are as much a part of the process as the experiments that ultimately “work.”"}, {"1464": "4. A lesson is repeated until it is learned."}, {"e41f": "Each lesson will be presented to you in various forms until you have learned it. Then you can go on to the next."}, {"be8f": "5. Learning lessons does not end."}, {"478f": "There is no part of life that does not contain its lessons, particularly if you enter the world of Entrepreneurship. If you are alive, there are lessons to be learned."}, {"f686": "6. “There” is no better than “here.”"}, {"02d9": "When your “there” has become your “here,” you will simply obtain another “there” that will, again, look better than “here.”"}, {"aabe": "7. Others are merely mirrors of you."}, {"4420": "You cannot love or hate something about another person, partner, employee, employer, key stakeholder, etc. unless it reflects to you something you love or hate about yourself."}, {"eda1": "8. What you make of your life is up to you."}, {"22b5": "You have all the tools and resources you need to be an entrepreneur. What you do with them is up to you. The choice and opportunity is yours."}, {"aac6": "9. The answers lie inside you."}, {"992c": "The answers to being a successful entrepreneur lie inside you. All you need to do is look, listen and trust."}, {"7210": "10. Whether you think you can or can’t, in either case you’ll be right."}, {"805a": "This is one of my favorite sayings of all time as an Entrepreneur."}, {"8953": "With these simple rules, regardless of where you currently stand on the entrepreneurial path, you are poised to begin a path to success. So what are you waiting for? Start today!"}, {"4443": "Call to Action"}, {"86b6": "Would you like to know more? You can follow my weekly Forbes.com columns (where this originally appeared) on life, leadership and entrepreneurship here."}, {"31a8": "You can learn more about my company, Fishbowl Inventory, by visiting our website here. I look forward to hearing from you."}], "author": "David K. Williams", "child": "1229_1\t1229_2", "name": "1229", "content": "The 10 Rules For Successful Entrepreneurs These rules for living will contribute to lifelong success as an entrepreneur. Entrepreneurship isn’t always simple, but as a lifelong focus, it is profoundly worthwhile. Today I have an adaptation of the 10 Rules for Being Human by Dr. Cherie Carter-Scott that I would like to apply to entrepreneurs. These are timeless rules for success in living an entrepreneurial life, as follows: 1. You will receive entrepreneurial opportunities. You may like them or not, but if you choose them they will be yours for the entire period, however long it is. 2. You will learn lessons. You are enrolled in a full-time informal school called life…and your school of life goes by the title of Entrepreneur. Each day in this school you will have the opportunity to learn lessons, experience failure and occasionally to savor success. You may like the lessons or think them irrelevant, stupid and unfair. 3. There are no mistakes, only lessons. The growth and maturing of an entrepreneur is a process of trial, error and experimentation. The “failed” experiments are as much a part of the process as the experiments that ultimately “work.” 4. A lesson is repeated until it is learned. Each lesson will be presented to you in various forms until you have learned it. Then you can go on to the next. 5. Learning lessons does not end. There is no part of life that does not contain its lessons, particularly if you enter the world of Entrepreneurship. If you are alive, there are lessons to be learned. 6. “There” is no better than “here.” When your “there” has become your “here,” you will simply obtain another “there” that will, again, look better than “here.” 7. Others are merely mirrors of you. You cannot love or hate something about another person, partner, employee, employer, key stakeholder, etc. unless it reflects to you something you love or hate about yourself. 8. What you make of your life is up to you. You have all the tools and resources you need to be an entrepreneur. What you do with them is up to you. The choice and opportunity is yours. 9. The answers lie inside you. The answers to being a successful entrepreneur lie inside you. All you need to do is look, listen and trust. 10. Whether you think you can or can’t, in either case you’ll be right. This is one of my favorite sayings of all time as an Entrepreneur. With these simple rules, regardless of where you currently stand on the entrepreneurial path, you are poised to begin a path to success. So what are you waiting for? Start today! Call to Action Would you like to know more? You can follow my weekly Forbes.com columns (where this originally appeared) on life, leadership and entrepreneurship here. You can learn more about my company, Fishbowl Inventory, by visiting our website here. I look forward to hearing from you. "}