{"parent": "", "timestamp": "Apr 3", "title": "3 Indispensable Tools, Strategies, and Resources to Super-charge Medium Writers of All Calibers", "sentences": [{"4052": "3 Indispensable Tools, Strategies, and Resources to Super-charge Medium Writers of All Calibers"}, {"06dd": "Occasionally, it’s easy to forget how young Medium really is. To many, including myself, who are active on it every day it feels like it’s been around much longer than it has."}, {"e95f": "Despite its youth, there are a fair amount of Medium-specific tools out there which you may or may not know about, which is exactly why I wanted to write this article."}, {"a188": "Already, there are developers who have created awesome platforms, Chrome extensions, apps, and more designed solely for Medium. Over time, the trend will continue and only grow more common — which I’m excited as hell for."}, {"a05c": "Whether you’re a veteran Medium writer with 100,000 followers, or a reader who secretly wants to be a Medium writer (you know you are!), I think you’ll find value in this post. I’ve also added my favorite resources and strategies for writing on Medium."}, {"89d5": "Let’s dive in…"}, {"3386": "Top 3 Tools"}, {"42a0": "#1.) SMedian (formerly known as SuperMeditor)"}, {"9e30": "SMedian is a platform to make the lives of Medium writers and editors a hell of a lot easier. It explains how writers can promote themselves and seamlessly request to contribute to their favorite publications."}, {"55ff": "*To learn more about the nuts & bolts of the platform, check out this article here."}, {"94f5": "For editors, SMedian allows you to promote your publication to writers."}, {"49c1": "This platform was developed by Lincoln W Daniel after he experienced the cumbersome tasks associated with being an editor of a Medium publication (you can read more about his inspiration for the tool here)."}, {"6c5c": "For each email I receive, I have to parse it for the user’s Medium username or ask for it if they failed to provide it. I then have to open a new browser tab to navigate to Medium, find my publication, open the edit page and finally scroll to the bottom to add the user as a writer. I have to do this too many times a week. On top of all of that, I have to deal with my inbox being cluttered by the same types of emails. — Lincoln W. Daniel, on why he created SMedian."}, {"2ff8": "He also is the author of Java for Humans beginner’s book, founder of Marketing & Growth Hacking, and will become an engineer at Medium this upcoming summer."}, {"0177": "So basically, he’s an all around bad ass and wants to make all of our lives easier on our favorite platform."}, {"5abb": "Lincoln’s vision for SMedian: Lincoln told me he envisions SMedian to live on and provide Medium editors and writers with help to grow and nurture their audiences via additional features in the future."}, {"cb34": "Check out SMedian, and see what you think!"}, {"1d4e": "#2.) Rabbut & Upscribe"}, {"8fb5": "*Special thanks to Benjamin Foley for telling me about Upscribe."}, {"af7f": "If you aren’t building up your email list on Medium, you’re missing out on one of the most valuable success metrics on the platform. Because there aren’t yet any Buy Now or Install App buttons on Medium, perhaps the best way to gauge interest is through an email signup."}, {"7442": "As a writer, you could use this metric to quantify real engagement. Real enthusiasm for your material if you have a call to action following your piece."}, {"1a26": "More importantly, as much as we love Medium, no one knows how long any social media platform will survive. Look what happened to Myspace, and Friendster, and Meerkat and Vine and more. Not trying to be a negative Nancy here, but…"}, {"3484": "One thing that is, more or less, secure though is an email address. You can use email addresses to build up your business for years to come, long after the death of present and future social media platforms."}, {"4c7b": "Rabbut and Upscribe provide Medium writers with an easy way to collect email addresses without users having to leave the page of the article."}, {"06be": "Example of Rabbut form — just a picture."}, {"e841": "Example of Upscribe form —also just a picture."}, {"678a": "For more on Rabbut, check out Kate Chan’s announcement article on Medium here."}, {"a280": "For more on how to create an Upscribe form, check out this article here."}, {"1028": "Final Note: Lastly, lucky for all of us, Medium absolutely crushes it in terms of long tail traffic, so you could receive email sign ups months, or even years, after you initially post an article."}, {"a0d3": "Final FINAL Note: There is also a method to build email signup forms directly into Medium using Google Forms. One of my favorite Medium writers, Quincy Larson, explains how he did it in this article here."}, {"b455": "#3.) Top Publications Leaderboard"}, {"bc8c": "This is a real-time leaderboard for Medium publications based on number of subscribers. What’s great is this tool also provides you with external social links for the publications."}, {"1fbb": "If you’re a writer, have your email templates created, canned responses on Gmail enabled, and articles ready to go. Then, use this leaderboard to find your favorite publications and reach out to the editors, either through email or social media."}, {"6bc0": "Pumped to see the home team (The Mission) coming in so high! Step aside, Washington Post ;)"}, {"c19a": "Side Note: Top Publications also has a feature that lists top Medium authors by number of followers. If you are a brand trying to connect with writers solely based on scale/reach, it could be a useful tool to connect with Medium influencers."}, {"5565": "Top 3 Resources covering writing on Medium"}, {"bfed": "#1.) A style guide for writing on Medium by Quincy Larson."}, {"b890": "This is a must-read for all Medium writers, either active or aspiring. My personal favorite part of this piece is towards the end:"}, {"1942": "Remember that when you publish on Medium, you’re asking thousands of people to give you several minutes of their lives. Don’t take your readers for granted."}, {"918c": "Before you publish a story, I recommend you sleep, wake up, then proof-read it again."}, {"a4d7": "Medium is different from other platforms. When you watch a YouTube video, you can also be cooking scrambled eggs and discussing the Dow Jones with your cat. All simultaneously."}, {"5b32": "When you scroll through Twitter, Facebook, or Instagram, a shitty piece of content only takes away a fraction of a second away from your life."}, {"4883": "On Medium, when you publish a half-ass article, you’re ROBBING your users of their 100% undivided attention."}, {"4a37": "When people read, they are zoned in on the article, even if they’re skimming it. This is the double-edged sword of Medium — it’s what makes the platform so powerful but also makes it an unforgiving platform. Your readers will not stay long if you keep publishing half-ass pieces."}, {"c212": "#2.) How to Win at Medium by Elizabeth Tobey"}, {"533e": "#3.) An Infallible Guide: How You Can Become a Top Medium Writer by me ;)"}, {"6de1": "Definitely a shameless plug here, but I received a good deal of positive feedback on this article from Medium writers so I’m proud of that."}, {"bb74": "Let me know what you think of the article and where I can improve!"}, {"bb2f": "3 Strategies for writing your next killer Medium piece"}, {"e9ab": "#1.) Use Google Trends & Google Alerts"}, {"cc1b": "Go to Google Trends, and see if any of the trending topics fit the niche you cover in your Medium content."}, {"72f0": "What Google Trends does is give you a pulse on what the world is speaking about outside of Medium. This is how I wrote one of my most popular articles letting the Medium community know the subscription model was coming to the platform (article here)."}, {"0aaa": "I am a huge fan of Josh Constine’s (editor at TechCrunch), and read one of his pieces covering Ev Williams’ announcement of the subscription model. I realized, to my surprise, no one in the Medium community was talking about the upcoming feature at all yet."}, {"db20": "I decided what I thought about the switch, brainstormed some of the implications, went to my favorite cafe/bar down the street (Rooz Cafe, for anyone interested) and hammered that shit out. Within three hours, I had submitted the article to The Mission."}, {"d3b4": "The point here is not to toot my own horn, but to emphasize the importance of timeliness when it comes to Medium."}, {"c50b": "Because Medium content has such a long shelf-life relative to other social media platforms, it seems timeliness is an element many are either overlooking or not taking full advantage of."}, {"ca99": "Medium will never be as real-time as Twitter is (thank God for that). Quality will always reign supreme. However, being first to a topic can provide you with massive leverage over the competition."}, {"e3a2": "#2.) Provide a counterargument"}, {"b3ca": "Always read (or at least check) the Top Stories on Medium. Get an idea of what issues the community is talking about and how they feel about them."}, {"7719": "After you do that, take a step back. Think critically whether you agree or disagree with the consensus. This worked wonders for me on my Snapchat article after I observed how everyone was talking up Snapchat as if it were the incandescent lamp."}, {"1450": "I decided I didn’t necessarily agree, and provided a counter-argument."}, {"95ea": "But I’m not the only one who it’s worked for:"}, {"1658": "Dear Democrats, Read This If You Do Not Understand Why Trump WonTrump Is What Happens When You Nominate A Cheater and Live In An Echo Chamber—Please Learn From Thismedium.com"}, {"624c": "Why I’m Voting for TrumpSeeing things from the other sidearcdigital.media"}, {"c98e": "This Is What I Do Before 8 AM.Don’t try and life-hack your way to post human status.medium.com"}, {"e27b": "All three of these examples challenged the general consensus on topics popular in the Medium community."}, {"6a09": "#3.) Leverage others"}, {"6b08": "Tag other writers in your articles. Feature editors, influencers, and industry leaders in your articles."}, {"f33c": "A great example of this is Jessica Guzik’s article covering how Chad Grills built a top Medium publication:"}, {"a71c": "How Chad Grills Built a Top Medium Publication 🎧I started a podcast because I wanted to know more about the people in this community: Who they are, why they’re writing…medium.com"}, {"ae78": "Pro Tip: I can only speak for myself, but I’ve never NOT recommended an article where my work was quoted or featured. I’m sure many other writers are similar in that regard ;)"}, {"0871": "You can also feature industry leaders who might not be that active on Medium. Benjamin Foley did this recently in an article covering lessons from Ryan Holiday:"}, {"fcf7": "17 Things I Learned From Ryan Holiday On Life, Love, and Strategy“There is no good or bad without us, there is only perception. There is the event itself and the story we tell…medium.com"}, {"b38f": "By positioning yourself as the observer, not only do you learn with your audience but you also you become 100% more relatable to your audience."}, {"4a6d": "Medium is still a very young platform and one of the most beautiful things about it is it’s blindness."}, {"a155": "Medium doesn’t care who you are, it only cares about what you have to say. It’s largely blind to your credentials."}, {"2f9d": "So why am I saying this? The reason I’m saying this is because we have a rare opportunity to network with amazing people on this platform. Industry leaders. Politicians. World-class artists."}, {"8496": "So don’t blow it! Take this opportunity to reach out to these people and connect. As Medium becomes more popular by the day, it will only get more difficult to do so."}, {"61b5": "I’m stoked to see the Medium community develop into something special. I’m excited for more Medium-specific apps. I’m excited for meetups. For collaborations. For books deals. For everything."}, {"0803": "But let’s not just be here to witness it. Let’s be here to create it."}, {"d4f4": "Thanks for reading!"}, {"d32e": "In the comment section: Do you know any more tools or resources for Medium writers? If so, please drop them in the comments below — I’d love to learn more about them!"}, {"4f54": "Call to Action"}, {"9b81": "If you want to put yourself in the best position possible to succeed on social media, check out my booklet titled: “The 7 Mindset Shifts for Successful Social Media Marketing”."}, {"9c4b": "In these 12 short pages, you’ll discover the indispensable strategies needed to unlock your full potential on social media for your business, personal brand and more."}, {"324c": "Click here to receive your free booklet now!"}], "author": "Dakota Shane", "child": "1235_1\t1235_2\t1235_3\t1235_4\t1235_5\t1235_61235_1\t1235_2\t1235_3\t1235_4\t1235_5\t1235_61235_1\t1235_2\t1235_3\t1235_4\t1235_5\t1235_61235_1\t1235_2\t1235_3\t1235_4\t1235_5\t1235_61235_1\t1235_2\t1235_3\t1235_4\t1235_5\t1235_6", "name": "1235", "content": "3 Indispensable Tools, Strategies, and Resources to Super-charge Medium Writers of All Calibers Occasionally, it’s easy to forget how young Medium really is. To many, including myself, who are active on it every day it feels like it’s been around much longer than it has. Despite its youth, there are a fair amount of Medium-specific tools out there which you may or may not know about, which is exactly why I wanted to write this article. Already, there are developers who have created awesome platforms, Chrome extensions, apps, and more designed solely for Medium. Over time, the trend will continue and only grow more common — which I’m excited as hell for. Whether you’re a veteran Medium writer with 100,000 followers, or a reader who secretly wants to be a Medium writer (you know you are!), I think you’ll find value in this post. I’ve also added my favorite resources and strategies for writing on Medium. Let’s dive in… Top 3 Tools #1.) SMedian (formerly known as SuperMeditor) SMedian is a platform to make the lives of Medium writers and editors a hell of a lot easier. It explains how writers can promote themselves and seamlessly request to contribute to their favorite publications. *To learn more about the nuts & bolts of the platform, check out this article here. For editors, SMedian allows you to promote your publication to writers. This platform was developed by Lincoln W Daniel after he experienced the cumbersome tasks associated with being an editor of a Medium publication (you can read more about his inspiration for the tool here). For each email I receive, I have to parse it for the user’s Medium username or ask for it if they failed to provide it. I then have to open a new browser tab to navigate to Medium, find my publication, open the edit page and finally scroll to the bottom to add the user as a writer. I have to do this too many times a week. On top of all of that, I have to deal with my inbox being cluttered by the same types of emails. — Lincoln W. Daniel, on why he created SMedian. He also is the author of Java for Humans beginner’s book, founder of Marketing & Growth Hacking, and will become an engineer at Medium this upcoming summer. So basically, he’s an all around bad ass and wants to make all of our lives easier on our favorite platform. Lincoln’s vision for SMedian: Lincoln told me he envisions SMedian to live on and provide Medium editors and writers with help to grow and nurture their audiences via additional features in the future. Check out SMedian, and see what you think! #2.) Rabbut & Upscribe *Special thanks to Benjamin Foley for telling me about Upscribe. If you aren’t building up your email list on Medium, you’re missing out on one of the most valuable success metrics on the platform. Because there aren’t yet any Buy Now or Install App buttons on Medium, perhaps the best way to gauge interest is through an email signup. As a writer, you could use this metric to quantify real engagement. Real enthusiasm for your material if you have a call to action following your piece. More importantly, as much as we love Medium, no one knows how long any social media platform will survive. Look what happened to Myspace, and Friendster, and Meerkat and Vine and more. Not trying to be a negative Nancy here, but… One thing that is, more or less, secure though is an email address. You can use email addresses to build up your business for years to come, long after the death of present and future social media platforms. Rabbut and Upscribe provide Medium writers with an easy way to collect email addresses without users having to leave the page of the article. Example of Rabbut form — just a picture. Example of Upscribe form —also just a picture. For more on Rabbut, check out Kate Chan’s announcement article on Medium here. For more on how to create an Upscribe form, check out this article here. Final Note: Lastly, lucky for all of us, Medium absolutely crushes it in terms of long tail traffic, so you could receive email sign ups months, or even years, after you initially post an article. Final FINAL Note: There is also a method to build email signup forms directly into Medium using Google Forms. One of my favorite Medium writers, Quincy Larson, explains how he did it in this article here. #3.) Top Publications Leaderboard This is a real-time leaderboard for Medium publications based on number of subscribers. What’s great is this tool also provides you with external social links for the publications. If you’re a writer, have your email templates created, canned responses on Gmail enabled, and articles ready to go. Then, use this leaderboard to find your favorite publications and reach out to the editors, either through email or social media. Pumped to see the home team (The Mission) coming in so high! Step aside, Washington Post ;) Side Note: Top Publications also has a feature that lists top Medium authors by number of followers. If you are a brand trying to connect with writers solely based on scale/reach, it could be a useful tool to connect with Medium influencers. Top 3 Resources covering writing on Medium #1.) A style guide for writing on Medium by Quincy Larson. This is a must-read for all Medium writers, either active or aspiring. My personal favorite part of this piece is towards the end: Remember that when you publish on Medium, you’re asking thousands of people to give you several minutes of their lives. Don’t take your readers for granted. Before you publish a story, I recommend you sleep, wake up, then proof-read it again. Medium is different from other platforms. When you watch a YouTube video, you can also be cooking scrambled eggs and discussing the Dow Jones with your cat. All simultaneously. When you scroll through Twitter, Facebook, or Instagram, a shitty piece of content only takes away a fraction of a second away from your life. On Medium, when you publish a half-ass article, you’re ROBBING your users of their 100% undivided attention. When people read, they are zoned in on the article, even if they’re skimming it. This is the double-edged sword of Medium — it’s what makes the platform so powerful but also makes it an unforgiving platform. Your readers will not stay long if you keep publishing half-ass pieces. #2.) How to Win at Medium by Elizabeth Tobey #3.) An Infallible Guide: How You Can Become a Top Medium Writer by me ;) Definitely a shameless plug here, but I received a good deal of positive feedback on this article from Medium writers so I’m proud of that. Let me know what you think of the article and where I can improve! 3 Strategies for writing your next killer Medium piece #1.) Use Google Trends & Google Alerts Go to Google Trends, and see if any of the trending topics fit the niche you cover in your Medium content. What Google Trends does is give you a pulse on what the world is speaking about outside of Medium. This is how I wrote one of my most popular articles letting the Medium community know the subscription model was coming to the platform (article here). I am a huge fan of Josh Constine’s (editor at TechCrunch), and read one of his pieces covering Ev Williams’ announcement of the subscription model. I realized, to my surprise, no one in the Medium community was talking about the upcoming feature at all yet. I decided what I thought about the switch, brainstormed some of the implications, went to my favorite cafe/bar down the street (Rooz Cafe, for anyone interested) and hammered that shit out. Within three hours, I had submitted the article to The Mission. The point here is not to toot my own horn, but to emphasize the importance of timeliness when it comes to Medium. Because Medium content has such a long shelf-life relative to other social media platforms, it seems timeliness is an element many are either overlooking or not taking full advantage of. Medium will never be as real-time as Twitter is (thank God for that). Quality will always reign supreme. However, being first to a topic can provide you with massive leverage over the competition. #2.) Provide a counterargument Always read (or at least check) the Top Stories on Medium. Get an idea of what issues the community is talking about and how they feel about them. After you do that, take a step back. Think critically whether you agree or disagree with the consensus. This worked wonders for me on my Snapchat article after I observed how everyone was talking up Snapchat as if it were the incandescent lamp. I decided I didn’t necessarily agree, and provided a counter-argument. But I’m not the only one who it’s worked for: Dear Democrats, Read This If You Do Not Understand Why Trump WonTrump Is What Happens When You Nominate A Cheater and Live In An Echo Chamber—Please Learn From Thismedium.com Why I’m Voting for TrumpSeeing things from the other sidearcdigital.media This Is What I Do Before 8 AM.Don’t try and life-hack your way to post human status.medium.com All three of these examples challenged the general consensus on topics popular in the Medium community. #3.) Leverage others Tag other writers in your articles. Feature editors, influencers, and industry leaders in your articles. A great example of this is Jessica Guzik’s article covering how Chad Grills built a top Medium publication: How Chad Grills Built a Top Medium Publication 🎧I started a podcast because I wanted to know more about the people in this community: Who they are, why they’re writing…medium.com Pro Tip: I can only speak for myself, but I’ve never NOT recommended an article where my work was quoted or featured. I’m sure many other writers are similar in that regard ;) You can also feature industry leaders who might not be that active on Medium. Benjamin Foley did this recently in an article covering lessons from Ryan Holiday: 17 Things I Learned From Ryan Holiday On Life, Love, and Strategy“There is no good or bad without us, there is only perception. There is the event itself and the story we tell…medium.com By positioning yourself as the observer, not only do you learn with your audience but you also you become 100% more relatable to your audience. Medium is still a very young platform and one of the most beautiful things about it is it’s blindness. Medium doesn’t care who you are, it only cares about what you have to say. It’s largely blind to your credentials. So why am I saying this? The reason I’m saying this is because we have a rare opportunity to network with amazing people on this platform. Industry leaders. Politicians. World-class artists. So don’t blow it! Take this opportunity to reach out to these people and connect. As Medium becomes more popular by the day, it will only get more difficult to do so. I’m stoked to see the Medium community develop into something special. I’m excited for more Medium-specific apps. I’m excited for meetups. For collaborations. For books deals. For everything. But let’s not just be here to witness it. Let’s be here to create it. Thanks for reading! In the comment section: Do you know any more tools or resources for Medium writers? If so, please drop them in the comments below — I’d love to learn more about them! Call to Action If you want to put yourself in the best position possible to succeed on social media, check out my booklet titled: “The 7 Mindset Shifts for Successful Social Media Marketing”. In these 12 short pages, you’ll discover the indispensable strategies needed to unlock your full potential on social media for your business, personal brand and more. Click here to receive your free booklet now! "}