{"parent": "", "timestamp": "Mar 18", "title": "Want to learn Web Development all on your own? You are at the right place.", "sentences": [{"44f2": "Want to learn Web Development all on your own? You are at the right place."}, {"3d92": "Being a self-taught developer I know the struggle and confusion involved in exploring and trying out resources to learn. Below I have catered some resources which I found valuable in my journey until now:"}, {"423c": "If you are one of those YouTube/Netflix guys, these video tutorials might work for you:"}, {"8011": "Ø The Complete Web Developer Course, Udemy — If you are just starting out, this is the course for you. It covers all the basics of HTML, CSS, Bootstrap, JavaScript, jQuery, php, Wordpress and APIs. Also at the end of each section you build something, that’s the part I like the most about this course. The instructor is a well-spoken and clear in his communication. If you are brand new to web development this is the fastest learning path."}, {"d4b7": "Link: https://www.udemy.com/the-complete-web-developer-course-2/"}, {"858e": "Ø The Complete Bootstrap Master class Course Build 4 Projects, Udemy — Bootstrap is one of the most widely used mobile-friendly responsive framework. This course covers every important aspect of Bootstrap and also you get hands on some cool websites which the instructor creates. I recommend creating the same simultaneously."}, {"3bed": "Link: https://www.udemy.com/bootstrapcourse/"}, {"3b82": "Ø Projects in JavaScript & JQuery, Udemy — If you want to master JavaScript and JQuery while creating some really cool projects. This is the course for you. This covers every concept starting from basics, also includes projects related to APIs and Ajax. And the best part is, at the end of this course you have enough projects which highlights your skills."}, {"84e3": "Link: https://www.udemy.com/projects-in-javascript-jquery/"}, {"5a46": "Ø Learn in One Series by Derek Banas — If you are aware of technologies and just want to revisit the concepts, this is the one stop solution. The Learn in One Series covers all concepts at a glance. But this is not the point from where you start if you are a complete beginner as it doesn’t imparts much practical knowledge but focuses on concepts instead.  It also has a huge library of tutorials of programming languages other than web technologies."}, {"e8e0": "Link: https://www.youtube.com/playlist?list=PLGLfVvz_LVvSX7fVd4OUFp_ODd86H0ZIY"}, {"505f": "Instead if you are one of those book lovers, then following resources are for you:"}, {"d045": "Ø HTML and CSS: Design and Build Websites by John Duckett — If you are new to web development and looking for a book with every concept related to HTML and CSS thoroughly explained then this is the book for you. The language is simple and easy to understand, the book also includes detailed illustrations with examples."}, {"357e": "Link (Amazon): http://www.amazon.in/HTML-CSS-Design-Build-Websites/dp/1118008189"}, {"91f4": "Ø JavaScript and JQuery: Interactive Front-End Web Development by John Duckett — Another book by John Duckett which I recommend for complete reference of JavaScript and JQuery. It covers each and every concept in detail illustrated using some great examples. It also stretches the learner to Ajax, JSON and APIs."}, {"2c29": "Link (Amazon): http://www.amazon.in/JavaScript-JQuery-Interactive-Front-End-Development/dp/1118531647"}, {"5cb5": "Thanks for reading! :) If you found it useful, hit that heart button below. Would mean a lot to me and it helps other people see the story."}, {"b60b": "To know more about me or connect with me, find me at http://www.pratiksingh.xyz/"}, {"9da9": "Sign up for weekly newsletter to get awesome content delivered to your inbox :)"}, {"094d": "If you liked these tips, be sure to see more on my Medium profile."}, {"6b92": "Websites worth giving a shot if you are learning front end developmentAs promised, I am back with some great websites which you can refer to while you are learning front end development.medium.com"}, {"84f5": "Bootstrap — The essential partsBootstrap is the most popular HTML, CSS, and JS framework for developing responsive, mobile first projects on the web.medium.com"}, {"2e4d": "4 periodicals to follow in order to keep yourself up to dateAnjali Ramachandran, one of UK’s most inspiring champions of gender diversity in the technology sector and the co…medium.com"}], "author": "Pratik Singh", "child": "1238_1\t1238_2\t1238_3", "name": "1238", "content": "Want to learn Web Development all on your own? You are at the right place. Being a self-taught developer I know the struggle and confusion involved in exploring and trying out resources to learn. Below I have catered some resources which I found valuable in my journey until now: If you are one of those YouTube/Netflix guys, these video tutorials might work for you: Ø The Complete Web Developer Course, Udemy — If you are just starting out, this is the course for you. It covers all the basics of HTML, CSS, Bootstrap, JavaScript, jQuery, php, Wordpress and APIs. Also at the end of each section you build something, that’s the part I like the most about this course. The instructor is a well-spoken and clear in his communication. If you are brand new to web development this is the fastest learning path. Link: https://www.udemy.com/the-complete-web-developer-course-2/ Ø The Complete Bootstrap Master class Course Build 4 Projects, Udemy — Bootstrap is one of the most widely used mobile-friendly responsive framework. This course covers every important aspect of Bootstrap and also you get hands on some cool websites which the instructor creates. I recommend creating the same simultaneously. Link: https://www.udemy.com/bootstrapcourse/ Ø Projects in JavaScript & JQuery, Udemy — If you want to master JavaScript and JQuery while creating some really cool projects. This is the course for you. This covers every concept starting from basics, also includes projects related to APIs and Ajax. And the best part is, at the end of this course you have enough projects which highlights your skills. Link: https://www.udemy.com/projects-in-javascript-jquery/ Ø Learn in One Series by Derek Banas — If you are aware of technologies and just want to revisit the concepts, this is the one stop solution. The Learn in One Series covers all concepts at a glance. But this is not the point from where you start if you are a complete beginner as it doesn’t imparts much practical knowledge but focuses on concepts instead.  It also has a huge library of tutorials of programming languages other than web technologies. Link: https://www.youtube.com/playlist?list=PLGLfVvz_LVvSX7fVd4OUFp_ODd86H0ZIY Instead if you are one of those book lovers, then following resources are for you: Ø HTML and CSS: Design and Build Websites by John Duckett — If you are new to web development and looking for a book with every concept related to HTML and CSS thoroughly explained then this is the book for you. The language is simple and easy to understand, the book also includes detailed illustrations with examples. Link (Amazon): http://www.amazon.in/HTML-CSS-Design-Build-Websites/dp/1118008189 Ø JavaScript and JQuery: Interactive Front-End Web Development by John Duckett — Another book by John Duckett which I recommend for complete reference of JavaScript and JQuery. It covers each and every concept in detail illustrated using some great examples. It also stretches the learner to Ajax, JSON and APIs. Link (Amazon): http://www.amazon.in/JavaScript-JQuery-Interactive-Front-End-Development/dp/1118531647 Thanks for reading! :) If you found it useful, hit that heart button below. Would mean a lot to me and it helps other people see the story. To know more about me or connect with me, find me at http://www.pratiksingh.xyz/ Sign up for weekly newsletter to get awesome content delivered to your inbox :) If you liked these tips, be sure to see more on my Medium profile. Websites worth giving a shot if you are learning front end developmentAs promised, I am back with some great websites which you can refer to while you are learning front end development.medium.com Bootstrap — The essential partsBootstrap is the most popular HTML, CSS, and JS framework for developing responsive, mobile first projects on the web.medium.com 4 periodicals to follow in order to keep yourself up to dateAnjali Ramachandran, one of UK’s most inspiring champions of gender diversity in the technology sector and the co…medium.com "}