{"parent": "", "timestamp": "Apr 10", "title": "Earth prepares to snap first-ever image of a black hole’s event horizon", "sentences": [{"9f0e": "Theoretical calculations predict an event horizon to all black holes, obscuring the central region in accordance with General Relativity. This is a prediction that has never been tested observationally. Image credit: Ute Kraus, Physics education group Kraus, Universität Hildesheim; Axel Mellinger (background)."}, {"1387": "Earth prepares to snap first-ever image of a black hole’s event horizon"}, {"2517": "We’ve never seen an event horizon, nor directly imaged a black hole. Thanks to a worldwide effort, victory may at last be in sight."}, {"67ac": "“Never look down to test the ground before taking your next step; only he who keeps his eye fixed on the far horizon will find the right road.” -Dag Hammarskjold"}, {"548e": "Perhaps gravity’s oddest prediction is the existence of black holes: regions of space where gravity is so strong that nothing, not even light, can escape."}, {"90d9": "Only through gravitational effects, such as by influencing stars, have they ever been seen."}, {"f689": "The core of galaxy NGC 4261, like the core of a great many galaxies, show signs of a supermassive black hole in both infrared and X-ray observations. The evidence for a supermassive black hole is strong, but indirect. Image credit: NASA / Hubble and ESA."}, {"737b": "X-ray signatures can locate and be used to weigh black holes as well, but that evidence is indirect."}, {"7d6f": "An X-ray / Infrared composite image of the black hole at the center of our galaxy: Sagittarius A*. It has not been imaged directly. Image credit: X-ray: NASA/UMass/D.Wang et al., IR: NASA/STScI."}, {"12af": "Actively merging black holes can be detected through their gravitational waves, but cannot produce direct images."}, {"ba15": "The gravitational wave signal from the first pair of detected, merging black holes from the LIGO collaboration. Although a large amount of information can be extracted, no images or the presence/absence of an event horizon can be gleaned. Image credit: B. P. Abbott et al. (LIGO Scientific Collaboration and Virgo Collaboration)."}, {"754c": "But all of that is about to change, with the impending activation of the Event Horizon Telescope."}, {"7a82": "The Atacama Large Millimeter submillimeter Array (ALMA) are some of the most powerful radio telescopes on Earth. They are only one small part of the array forming the Event Horizon Telescope. Image credit: ESO/C. Malin."}, {"29ed": "Instead of a single telescope, 15-to-20 radio telescopes are arrayed across the globe, observing the same target simultaneously."}, {"f313": "The locations of the radio dishes that are planned be part of the Event Horizon Telescope array. Image credit: Event Horizon Telescope / University of Arizona."}, {"37cf": "With up to 12,000 kilometers separating the most distant telescopes, objects as small as 15 microarcseconds (μas) can be resolved: the size of a fly on the Moon."}, {"ad7e": "The second-largest black hole as seen from Earth, the one at the center of the galaxy M87, is show in three views here. Despite its mass of 6.6 billion Suns, it is over 2000 times farther away than Sagittarius A*. It will not be resolvable by the EHT. Image credit: Top, optical, Hubble Space Telescope / NASA / Wikisky; lower left, radio, NRAO / Very Large Array (VLA); lower right, X-ray, NASA / Chandra X-ray telescope."}, {"7625": "The largest black hole as viewed from Earth is Sagittarius A*: at the center of the Milky Way."}, {"adad": "Despite being 26,000 light years away, its mass of 4 million Suns gives it an angular size of 37 μas."}, {"3d77": "The supermassive black hole (Sgr A*) at the center of our galaxy is shrouded in a dusty, gaseous environment. X-rays and infrared observations can partially see through it, but radio waves might finally be able to resolve it directly. Image credit: NASA’s Chandra X-Ray Observatory."}, {"d687": "The Event Horizon Telescope turns on this week."}, {"bda9": "Simulations of how the black hole at the center of the Milky Way may appear to the Event Horizon Telescope, depending on its orientation relative to us. These simulations assume the event horizon exists. Imaging an Event Horizon: submm-VLBI of a Super Massive Black Hole, S. Doeleman et al."}, {"be92": "For the first time ever, we will directly image a black hole, testing whether event horizons truly exist."}, {"365f": "Mostly Mute Monday tells the story of an astronomical object or phenomenon in images, visuals and no more than 200 words."}, {"b852": "Starts With A Bang is based at Forbes, and republished on Medium thanks to our Patreon supporters. Order Ethan’s first book, Beyond The Galaxy, and pre-order his new one, Treknology: The Science of Star Trek from Tricorders to Warp Drive!"}], "author": "Ethan Siegel", "child": "1254_1\t1254_2\t1254_3\t1254_4\t1254_5\t1254_6\t1254_71254_1\t1254_2\t1254_3\t1254_4\t1254_5\t1254_6\t1254_71254_1\t1254_2\t1254_3\t1254_4\t1254_5\t1254_6\t1254_7", "name": "1254", "content": "Theoretical calculations predict an event horizon to all black holes, obscuring the central region in accordance with General Relativity. This is a prediction that has never been tested observationally. Image credit: Ute Kraus, Physics education group Kraus, Universität Hildesheim; Axel Mellinger (background). Earth prepares to snap first-ever image of a black hole’s event horizon We’ve never seen an event horizon, nor directly imaged a black hole. Thanks to a worldwide effort, victory may at last be in sight. “Never look down to test the ground before taking your next step; only he who keeps his eye fixed on the far horizon will find the right road.” -Dag Hammarskjold Perhaps gravity’s oddest prediction is the existence of black holes: regions of space where gravity is so strong that nothing, not even light, can escape. Only through gravitational effects, such as by influencing stars, have they ever been seen. The core of galaxy NGC 4261, like the core of a great many galaxies, show signs of a supermassive black hole in both infrared and X-ray observations. The evidence for a supermassive black hole is strong, but indirect. Image credit: NASA / Hubble and ESA. X-ray signatures can locate and be used to weigh black holes as well, but that evidence is indirect. An X-ray / Infrared composite image of the black hole at the center of our galaxy: Sagittarius A*. It has not been imaged directly. Image credit: X-ray: NASA/UMass/D.Wang et al., IR: NASA/STScI. Actively merging black holes can be detected through their gravitational waves, but cannot produce direct images. The gravitational wave signal from the first pair of detected, merging black holes from the LIGO collaboration. Although a large amount of information can be extracted, no images or the presence/absence of an event horizon can be gleaned. Image credit: B. P. Abbott et al. (LIGO Scientific Collaboration and Virgo Collaboration). But all of that is about to change, with the impending activation of the Event Horizon Telescope. The Atacama Large Millimeter submillimeter Array (ALMA) are some of the most powerful radio telescopes on Earth. They are only one small part of the array forming the Event Horizon Telescope. Image credit: ESO/C. Malin. Instead of a single telescope, 15-to-20 radio telescopes are arrayed across the globe, observing the same target simultaneously. The locations of the radio dishes that are planned be part of the Event Horizon Telescope array. Image credit: Event Horizon Telescope / University of Arizona. With up to 12,000 kilometers separating the most distant telescopes, objects as small as 15 microarcseconds (μas) can be resolved: the size of a fly on the Moon. The second-largest black hole as seen from Earth, the one at the center of the galaxy M87, is show in three views here. Despite its mass of 6.6 billion Suns, it is over 2000 times farther away than Sagittarius A*. It will not be resolvable by the EHT. Image credit: Top, optical, Hubble Space Telescope / NASA / Wikisky; lower left, radio, NRAO / Very Large Array (VLA); lower right, X-ray, NASA / Chandra X-ray telescope. The largest black hole as viewed from Earth is Sagittarius A*: at the center of the Milky Way. Despite being 26,000 light years away, its mass of 4 million Suns gives it an angular size of 37 μas. The supermassive black hole (Sgr A*) at the center of our galaxy is shrouded in a dusty, gaseous environment. X-rays and infrared observations can partially see through it, but radio waves might finally be able to resolve it directly. Image credit: NASA’s Chandra X-Ray Observatory. The Event Horizon Telescope turns on this week. Simulations of how the black hole at the center of the Milky Way may appear to the Event Horizon Telescope, depending on its orientation relative to us. These simulations assume the event horizon exists. Imaging an Event Horizon: submm-VLBI of a Super Massive Black Hole, S. Doeleman et al. For the first time ever, we will directly image a black hole, testing whether event horizons truly exist. Mostly Mute Monday tells the story of an astronomical object or phenomenon in images, visuals and no more than 200 words. Starts With A Bang is based at Forbes, and republished on Medium thanks to our Patreon supporters. Order Ethan’s first book, Beyond The Galaxy, and pre-order his new one, Treknology: The Science of Star Trek from Tricorders to Warp Drive! "}