{"parent": "", "timestamp": "Apr 14", "title": "Can muons — which live for microseconds — save experimental particle physics?", "sentences": [{"a45d": "A four-muon candidate event in the ATLAS detector at the Large Hadron Collider. The muon/anti-muon tracks are highlighted in red, as the long-lived muons travel farther than any other unstable particle. Image credit: ATLAS Collaboration / CERN."}, {"1d6b": "Can muons — which live for microseconds — save experimental particle physics?"}, {"281e": "You lose whether you use protons or electrons in your collider, for different reasons. Could the unstable muon solve both problems?"}, {"2c05": "“It does not matter how slowly you go as long as you do not stop.” -Confucius"}, {"e10e": "High-energy physics is facing its greatest crisis ever. The Standard Model is complete, as all the particles our most successful physics theories have predicted have been discovered. The Large Hadron Collider at CERN, the most energetic particle collider ever developed (with more than six times the energies of any prior collider), discovered the long-sought-after Higgs boson, but nothing else. Traditionally, the way to discover new particles has been to go to higher energies with one of two strategies:"}, {"50fb": "Both methods have their limitations, but one unstable particle might give us a third option to make the elusive breakthrough we desperately need: the muon."}, {"00a2": "The known particles in the Standard Model. These are all the fundamental particles that have been directly discovered. Image credit: E. Siegel."}, {"fee6": "The Standard Model is made up of all the fundamental particles and antiparticles we’ve ever discovered. They include six quarks and antiquarks, each in three colors, three charged leptons and three types of neutrino, along with their antiparticle counterparts, and the bosons: the photon, the weak bosons (W+, W-, Z0), the eight gluons (with color/anticolor combinations attached), and the Higgs boson. While countless different combinations of these particles exist in nature, only a precious few are stable. The electron, photon, proton (made of two up and one down quark), and, if they’re bound together in nuclei, the neutron (with two down and one up quark) are stable, along with their antimatter counterparts. That’s why all the normal matter we see in the Universe is made up of protons, neutrons, and electrons; nothing else with any significant interactions is stable."}, {"7950": "While many unstable particles, both fundamental and composite, can be produced in particle physics, only protons, neutrons (bound in nuclei) and the electron are stable, along with their antimatter counterparts and the photon. Everything else is short-lived. Image credit: Contemporary Physics Education Project (CPEP), U.S. Department of Energy / NSF / LBNL."}, {"f485": "The way you create these unstable particles is by colliding the stable ones together at high enough energies. Because of a fundamental principle of nature — mass/energy equivalence, given by Einstein’s E = mc2 — you can turn pure energy into mass if you have enough of it. (So long as you obey all the other conservation laws.) This is exactly the way we’ve created almost all the other particles of the Standard Model: by colliding particles into one another at enough energy that the energy you get out (E) is high enough to create the new particles (of mass m) you’re attempting to discover."}, {"5209": "The particle tracks emanating from a high energy collision at the LHC in 2014 show the creation of many new particles. It’s only because of the high-energy nature of this collision that new masses can be created."}, {"98fa": "We know there are almost certainly more particles beyond the ones we’ve discovered; we expect there to be particle explanations for mysteries like the baryon asymmetry (why there’s more matter than antimatter), the missing mass problem in the Universe (what we suspect will be solved by dark matter), the neutrino mass problem (why they’re so incredibly light), the quantum nature of gravity (i.e., there should be a force-carrying particle for the gravitational interaction, like the graviton), and the strong-CP problem (why certain decays don’t happen), among others. But our colliders haven’t reached the energies necessary to uncover those new particles, if they even exist. What’s even worse: both of the current methods have severe drawbacks that may prohibit us from building colliders that go to significantly higher energies."}, {"4125": "An aerial view of CERN, with the Large Hadron Collider’s circumference (27 kilometers in all) outlined. Image credit: Maximilien Brice (CERN)."}, {"cb1d": "The Large Hadron Collider is the current record-holder, accelerating protons up to energies of 6.5 TeV apiece before smashing them together. The energy you can reach is directly proportional to two things only: the radius of your accelerator (R) and the strength of the magnetic field used to bend the protons into a circle (B). Collide those two protons together, and they hit with an energy of 13 TeV. But you’ll never make a 13 TeV particle colliding two protons at the LHC; only a fraction of that energy is available to create new particles via E = mc². The reason? A proton is made of multiple, composite particles — quarks, gluons, and even quark/antiquark pairs inside — meaning that only a tiny fraction of that energy goes into making new, massive particles."}, {"89b9": "A candidate Higgs event in the ATLAS detector. Note how even with the clear signatures and transverse tracks, there is a shower of other particles; this is due to the fact that protons are composite particles. Image credit: The ATLAS collaboration / CERN."}, {"5db9": "You might think to use fundamental particles instead, then, like electrons and positrons. If you were to put them in the same ring (with the same R) and subject them to the same magnetic field (the same B), you might think you could reach the same energies, only this time, 100% of the energy could make new particles. And that would be true, if it weren’t for one factor: synchrotron radiation. You see, when you accelerate a charged particle in a magnetic field, it gives off radiation. Because a proton is so massive compared to its electric charge, that radiation is negligible, and you can take protons up to the highest energies we’ve ever reached without worrying about it. But electrons and positrons are only 1/1836th of a proton’s mass, and synchrotron radiation would limit them to only about 0.114 TeV of energy under the same conditions."}, {"b64d": "Relativistic electrons and positrons can be accelerated to very high speeds, but will emit synchrotron radiation (blue) at high enough energies, preventing them from moving faster. Image credit: Chung-Li Dong, Jinghua Guo, Yang-Yuan Chen, and Chang Ching-Lin, ‘Soft-x-ray spectroscopy probes nanomaterial-based devices’."}, {"d437": "But there’s a third option that’s never been put into practice: use muons and anti-muons. A muon is just like an electron in the sense that it’s a fundamental particle, it’s charged, it’s a lepton, but it’s 206 times heavier than the electron. This is massive enough that synchrotron radiation doesn’t matter for muons or anti-muons, which is great! The only downside? The muon is unstable, with a mean lifetime of only 2.2 microseconds before decaying away."}, {"6f8d": "The prototype MICE 201-megahertz RF module, with the copper cavity mounted, is shown during assembly at Fermilab. This apparatus could focus and collimate a muon beam, enabling the muons to be accelerated and survive for much longer than 2.2 microseconds. Image credit: Y. Torun / IIT / Fermilab Today."}, {"4124": "That might be okay, though, because special relativity can rescue us! When you bring an unstable particle close to the speed of light, the amount of time that it lives increases dramatically, thanks to the relativistic phenomenon of time dilation. If you brought a muon all the way up to 6.5 TeV of energy, it would live for 135,000 microseconds: enough time to circle the Large Hadron Collider 1,500 times before decaying away. And this time, your hopes would be absolutely true: 100% of that energy, 6.5 TeV + 6.5 TeV = 13 TeV, would be available for particle creation."}, {"1aab": "A design plan for a full-scale muon-antimuon collider at Fermilab, the source of the world’s second-most powerful particle accelerator. Image credit: Fermilab."}, {"2c98": "We can always build a bigger ring or invent stronger magnets, and we may well do exactly that. But there’s no cure for synchrotron radiation except to use heavier particles, and there’s no cure for energy spreading out among the components of composite particles other than not to use them at all. Muons are unstable and difficult to keep alive for a long time, but as we get to higher and higher energies, that task gets progressively easier. Muon colliders have long been touted as a mere pipe dream, but recent progress by the MICE collaboration — for Muon Ionization Cooling Experiment — has demonstrated that this may be possible after all. A circular muon/anti-muon collider may be the particle accelerator that takes us beyond the LHC’s reach, and, if we’re lucky, into the realm of the new physics we’re so desperately seeking."}, {"f10c": "Starts With A Bang is based at Forbes, and republished on Medium thanks to our Patreon supporters. Order Ethan’s first book, Beyond The Galaxy, and pre-order his new one, Treknology: The Science of Star Trek from Tricorders to Warp Drive!"}], "author": "Ethan Siegel", "child": "1257_1\t1257_21257_1\t1257_21257_1\t1257_2", "name": "1257", "content": "A four-muon candidate event in the ATLAS detector at the Large Hadron Collider. The muon/anti-muon tracks are highlighted in red, as the long-lived muons travel farther than any other unstable particle. Image credit: ATLAS Collaboration / CERN. Can muons — which live for microseconds — save experimental particle physics? You lose whether you use protons or electrons in your collider, for different reasons. Could the unstable muon solve both problems? “It does not matter how slowly you go as long as you do not stop.” -Confucius High-energy physics is facing its greatest crisis ever. The Standard Model is complete, as all the particles our most successful physics theories have predicted have been discovered. The Large Hadron Collider at CERN, the most energetic particle collider ever developed (with more than six times the energies of any prior collider), discovered the long-sought-after Higgs boson, but nothing else. Traditionally, the way to discover new particles has been to go to higher energies with one of two strategies: Both methods have their limitations, but one unstable particle might give us a third option to make the elusive breakthrough we desperately need: the muon. The known particles in the Standard Model. These are all the fundamental particles that have been directly discovered. Image credit: E. Siegel. The Standard Model is made up of all the fundamental particles and antiparticles we’ve ever discovered. They include six quarks and antiquarks, each in three colors, three charged leptons and three types of neutrino, along with their antiparticle counterparts, and the bosons: the photon, the weak bosons (W+, W-, Z0), the eight gluons (with color/anticolor combinations attached), and the Higgs boson. While countless different combinations of these particles exist in nature, only a precious few are stable. The electron, photon, proton (made of two up and one down quark), and, if they’re bound together in nuclei, the neutron (with two down and one up quark) are stable, along with their antimatter counterparts. That’s why all the normal matter we see in the Universe is made up of protons, neutrons, and electrons; nothing else with any significant interactions is stable. While many unstable particles, both fundamental and composite, can be produced in particle physics, only protons, neutrons (bound in nuclei) and the electron are stable, along with their antimatter counterparts and the photon. Everything else is short-lived. Image credit: Contemporary Physics Education Project (CPEP), U.S. Department of Energy / NSF / LBNL. The way you create these unstable particles is by colliding the stable ones together at high enough energies. Because of a fundamental principle of nature — mass/energy equivalence, given by Einstein’s E = mc2 — you can turn pure energy into mass if you have enough of it. (So long as you obey all the other conservation laws.) This is exactly the way we’ve created almost all the other particles of the Standard Model: by colliding particles into one another at enough energy that the energy you get out (E) is high enough to create the new particles (of mass m) you’re attempting to discover. The particle tracks emanating from a high energy collision at the LHC in 2014 show the creation of many new particles. It’s only because of the high-energy nature of this collision that new masses can be created. We know there are almost certainly more particles beyond the ones we’ve discovered; we expect there to be particle explanations for mysteries like the baryon asymmetry (why there’s more matter than antimatter), the missing mass problem in the Universe (what we suspect will be solved by dark matter), the neutrino mass problem (why they’re so incredibly light), the quantum nature of gravity (i.e., there should be a force-carrying particle for the gravitational interaction, like the graviton), and the strong-CP problem (why certain decays don’t happen), among others. But our colliders haven’t reached the energies necessary to uncover those new particles, if they even exist. What’s even worse: both of the current methods have severe drawbacks that may prohibit us from building colliders that go to significantly higher energies. An aerial view of CERN, with the Large Hadron Collider’s circumference (27 kilometers in all) outlined. Image credit: Maximilien Brice (CERN). The Large Hadron Collider is the current record-holder, accelerating protons up to energies of 6.5 TeV apiece before smashing them together. The energy you can reach is directly proportional to two things only: the radius of your accelerator (R) and the strength of the magnetic field used to bend the protons into a circle (B). Collide those two protons together, and they hit with an energy of 13 TeV. But you’ll never make a 13 TeV particle colliding two protons at the LHC; only a fraction of that energy is available to create new particles via E = mc². The reason? A proton is made of multiple, composite particles — quarks, gluons, and even quark/antiquark pairs inside — meaning that only a tiny fraction of that energy goes into making new, massive particles. A candidate Higgs event in the ATLAS detector. Note how even with the clear signatures and transverse tracks, there is a shower of other particles; this is due to the fact that protons are composite particles. Image credit: The ATLAS collaboration / CERN. You might think to use fundamental particles instead, then, like electrons and positrons. If you were to put them in the same ring (with the same R) and subject them to the same magnetic field (the same B), you might think you could reach the same energies, only this time, 100% of the energy could make new particles. And that would be true, if it weren’t for one factor: synchrotron radiation. You see, when you accelerate a charged particle in a magnetic field, it gives off radiation. Because a proton is so massive compared to its electric charge, that radiation is negligible, and you can take protons up to the highest energies we’ve ever reached without worrying about it. But electrons and positrons are only 1/1836th of a proton’s mass, and synchrotron radiation would limit them to only about 0.114 TeV of energy under the same conditions. Relativistic electrons and positrons can be accelerated to very high speeds, but will emit synchrotron radiation (blue) at high enough energies, preventing them from moving faster. Image credit: Chung-Li Dong, Jinghua Guo, Yang-Yuan Chen, and Chang Ching-Lin, ‘Soft-x-ray spectroscopy probes nanomaterial-based devices’. But there’s a third option that’s never been put into practice: use muons and anti-muons. A muon is just like an electron in the sense that it’s a fundamental particle, it’s charged, it’s a lepton, but it’s 206 times heavier than the electron. This is massive enough that synchrotron radiation doesn’t matter for muons or anti-muons, which is great! The only downside? The muon is unstable, with a mean lifetime of only 2.2 microseconds before decaying away. The prototype MICE 201-megahertz RF module, with the copper cavity mounted, is shown during assembly at Fermilab. This apparatus could focus and collimate a muon beam, enabling the muons to be accelerated and survive for much longer than 2.2 microseconds. Image credit: Y. Torun / IIT / Fermilab Today. That might be okay, though, because special relativity can rescue us! When you bring an unstable particle close to the speed of light, the amount of time that it lives increases dramatically, thanks to the relativistic phenomenon of time dilation. If you brought a muon all the way up to 6.5 TeV of energy, it would live for 135,000 microseconds: enough time to circle the Large Hadron Collider 1,500 times before decaying away. And this time, your hopes would be absolutely true: 100% of that energy, 6.5 TeV + 6.5 TeV = 13 TeV, would be available for particle creation. A design plan for a full-scale muon-antimuon collider at Fermilab, the source of the world’s second-most powerful particle accelerator. Image credit: Fermilab. We can always build a bigger ring or invent stronger magnets, and we may well do exactly that. But there’s no cure for synchrotron radiation except to use heavier particles, and there’s no cure for energy spreading out among the components of composite particles other than not to use them at all. Muons are unstable and difficult to keep alive for a long time, but as we get to higher and higher energies, that task gets progressively easier. Muon colliders have long been touted as a mere pipe dream, but recent progress by the MICE collaboration — for Muon Ionization Cooling Experiment — has demonstrated that this may be possible after all. A circular muon/anti-muon collider may be the particle accelerator that takes us beyond the LHC’s reach, and, if we’re lucky, into the realm of the new physics we’re so desperately seeking. Starts With A Bang is based at Forbes, and republished on Medium thanks to our Patreon supporters. Order Ethan’s first book, Beyond The Galaxy, and pre-order his new one, Treknology: The Science of Star Trek from Tricorders to Warp Drive! "}