{"parent": "", "timestamp": "Mar 21", "title": "The 3 ways that parallel Universes could be real", "sentences": [{"ba66": "A huge number of separate regions where Big Bangs occur are separated by continuously inflating space in eternal inflation. But unless there’s a truly infinite amount of space out there, the number of possible outcomes grows faster than the number of possible Universes like ours. Image credit: Karen46 of http://www.freeimages.com/profile/karen46."}, {"832c": "The 3 ways that parallel Universes could be real"}, {"6bd0": "When a quantum interaction happens, one interpretation leads to an infinite number of parallel Universes. Here’s how that could be true."}, {"2c68": "“As an analogy one can imagine an intelligent amoeba with a good memory. As time progresses the amoeba is constantly splitting, each time the resulting amoebas having the same memories as the parent. Our amoeba hence does not have a life line, but a life tree.” -Hugh Everett"}, {"2056": "The idea that things exist in a particular, well-defined state at all times where their properties can be determined so long as you can measure them well enough was fundamental to how we conceived of the Universe. When quantum physics came along, that idea went right out the window, never to return. The Universe, at a fundamental level, is indeterminate. One possible interpretation — that of infinite parallel Universes — holds that every time a quantum interaction occurs, all possible outcomes do actually occur somewhere, with only one of them reflecting what happens in our observable Universe. But if the right conditions exist, these parallel Universes will actually be real."}, {"dd2a": "An interference pattern results if you pass electrons, photons or any other particle through a double slit. But only if you don’t check which slit they passed through! Image credit: Wikimedia Commons user inductiveload."}, {"fb80": "Quantum indeterminism is a fundamental fact of the Universe, but how we interpret it is up to us. If you fire a single electron through a double slit, you’d like for it to go through either one slit or the other, but that’s not how the Universe works. Instead, the electron acts as a wave, passing through both slits simultaneously and interfering with itself. There’s a probability distribution describing where each individual electron will wind up, but each one will only make a single “hit” on a background screen. If you take thousands of these electrons in a row, the interference pattern will emerge."}, {"3cb6": "The wave pattern for electrons passing through a double slit, one-at-a-time. If you measure “which slit” the electron goes through, you destroy the quantum interference pattern shown here. Note that more than one electron is required to reveal the interference pattern. Image credit: Dr. Tonomura and Belsazar of Wikimedia Commons."}, {"6363": "There are lots of processes that are inherently indeterminate in exactly this fashion. Some are discrete: when you collide a particle and antiparticle to create two photons, one of the photons will have spin +1 and the other will have a spin of -1, but which is which has a 50:50 shot. Other indeterminate processes are continuous: colliding a particle and antiparticle creates two photons, and those two photons will be created in opposite directions (oriented 180 degrees) relative to one another in the particle/antiparticle’s center-of-mass frame. But what direction will those photons pick? North/South? East/West? Up/Down? Anything in between? It’s entirely random."}, {"b073": "Particle-antiparticle annihilation will produce two photons of equal energy in opposite directions. But which direction that will be is completely random. Image credit: Andrew Deniszczyc, 2017."}, {"6496": "Every interaction between two particles in the Universe has this quantum indeterminism, at some level, inherent to it. Every particle has an inherent uncertainty to both its position and momentum, and when two of them interacts, that uncertainty propagates into the final position and momentum, too. We have a lot of different ways to try and understand this indeterminism, many of which are equally valid."}, {"beda": "The idea of parallel Universes, as applied to Schrödinger’s cat. Image credit: Christian Schirm."}, {"9952": "These interpretations of quantum mechanics cannot be distinguished from one another, and include ideas like wavefunction collapse (where an observation triggers the collapse of the wavefunction), an ensemble approach to possible outcomes (where all outcomes are possible, and the Universe selects one when an observation is made), and the many-worlds approach, where all possible outcomes do occur in some Universe, but we only have the one Universe to observe."}, {"6404": "The multiverse idea states that there are infinite numbers of Universes like our own, and infinite ones with differences. Image credit: Lee Davy of flickr."}, {"0426": "This last one has a fantastic consequence, if true: there must exist a number of parallel Universes that’s so great, it approaches infinity as time goes on. There are some 10⁹⁰ particles in the observable Universe, which has been around for 13.8 billion years since the Big Bang, and each particle has undergone anywhere from millions of interactions to many quadrillions (or more) over that time. The number of possible outcomes is ridiculously huge — a number greater than (10⁹⁰)! — but that doesn’t mean the many-worlds approach is ridiculous. In fact, there are a number of ways in which it could be exactly true."}, {"f3b7": "The observable Universe might be 46 billion light years in all directions from our point of view, but there’s certainly more, unobservable Universe, perhaps even an infinite amount, just like ours beyond that. Image credit: Frédéric MICHEL and Andrew Z. Colvin, annotated by E. Siegel."}, {"f848": "1.) The Universe, of which our observable Universe is a small part, was born infinite. No matter how many particles we have in our Universe, no matter how arbitrary their initial configurations and no matter how many possible outcomes their interactions could have given rise to, that number will still be finite. But the Universe could have been born infinite! Beyond the stars, galaxies, matter and energy that we can see, we have every reason to believe that there is more “Universe” just like our own, and that it’s simply not observable to us due to the fact that the speed of light and the age of the Universe (since the Big Bang) are both finite. If there’s an infinite amount of Universe like this, then the exact configuration starting off our Universe occurred an infinite amount of times, and everything that was ever possible happened somewhere."}, {"3fd2": "Inflation set up the hot Big Bang and gave rise to the observable Universe we have access to, but we can only measure the last tiny fraction of a second of inflation’s impact on our Universe. Image credit: Bock et al. (2006, astro-ph/0604101); modifications by E. Siegel."}, {"fc0a": "2.) Our Universe was born finite, but there were an infinite number of them born. The Big Bang was not the very beginning of everything, as we once thought, but was merely the birth of our observable Universe. It was the first moment that our Universe could be described as hot, dense, full of matter/antimatter/radiation, and simultaneously expanding and cooling. This happened a finite amount of time ago — 13.8 billion years — and was preceded by a period of cosmic inflation. Inflation creates an exponentially growing spacetime, which means, if it occurred for an infinite amount of time to the past, could have created an infinite number of finite Universes, one of which contains ours."}, {"b5be": "Even though inflation may end in more than 50% of any of the regions at any given time (denoted by red X’s), enough regions continue to expand forever that inflation continues for an eternity, with no two Universes ever colliding. Image credit: E. Siegel."}, {"d71c": "3.) Our Universe was born finite, there are a finite number of Universes, but there are enough of them around that all possible outcomes still occur. This is the trickiest case of all, because nothing — not even exponentially-growing, inflating spacetime — grows as fast as the number of possible quantum outcomes for the Universe. But a big enough, possibility-rich enough multiverse will have created a Universe with identical initial conditions to our enough times that all the possible outcomes to date have been realized somewhere. This will change, given enough time; as interactions continue and quantum systems evolve, we will eventually see the number of possibilities surpass the number of Universes available to realize all of them."}, {"356e": "A representation of the different parallel “worlds” that might exist in other pockets of the multiverse. Image credit: Public domain."}, {"0314": "Somewhere, the Nazis won World War II; somewhere, Hillary Clinton is president; somewhere, humans have driven themselves to extinction; somewhere, we’ve achieved world peace. We still have just the one Universe, though, and still have no prospects for gathering information outside of what’s observable to us. But if the Universe was born infinite, if the state that gave rise to it existed for an infinite amount of time, or we simply created enough pocket Universes for these parallel Universes to exist today, then they’re real. And they could be real if any of these three possibilities are true; there are three different paths to success. But until we have some way of testing it, we have no way of knowing what the ultimate truth of the matter is, and whether parallel Universes truly are real."}, {"c001": "This post first appeared at Forbes, and is brought to you ad-free by our Patreon supporters. Comment on our forum, & buy our first book: Beyond The Galaxy!"}], "author": "Ethan Siegel", "child": "1258_1\t1258_2\t1258_3\t1258_4\t1258_5\t1258_6\t1258_7\t1258_8\t1258_9\t1258_10\t1258_11\t1258_12\t1258_13\t1258_14\t1258_15\t1258_16\t1258_17\t1258_18\t1258_19\t1258_201258_1\t1258_2\t1258_3\t1258_4\t1258_5\t1258_6\t1258_7\t1258_8\t1258_9\t1258_10\t1258_11\t1258_12\t1258_13\t1258_14\t1258_15\t1258_16\t1258_17\t1258_18\t1258_19\t1258_201258_1\t1258_2\t1258_3\t1258_4\t1258_5\t1258_6\t1258_7\t1258_8\t1258_9\t1258_10\t1258_11\t1258_12\t1258_13\t1258_14\t1258_15\t1258_16\t1258_17\t1258_18\t1258_19\t1258_20", "name": "1258", "content": "A huge number of separate regions where Big Bangs occur are separated by continuously inflating space in eternal inflation. But unless there’s a truly infinite amount of space out there, the number of possible outcomes grows faster than the number of possible Universes like ours. Image credit: Karen46 of http://www.freeimages.com/profile/karen46. The 3 ways that parallel Universes could be real When a quantum interaction happens, one interpretation leads to an infinite number of parallel Universes. Here’s how that could be true. “As an analogy one can imagine an intelligent amoeba with a good memory. As time progresses the amoeba is constantly splitting, each time the resulting amoebas having the same memories as the parent. Our amoeba hence does not have a life line, but a life tree.” -Hugh Everett The idea that things exist in a particular, well-defined state at all times where their properties can be determined so long as you can measure them well enough was fundamental to how we conceived of the Universe. When quantum physics came along, that idea went right out the window, never to return. The Universe, at a fundamental level, is indeterminate. One possible interpretation — that of infinite parallel Universes — holds that every time a quantum interaction occurs, all possible outcomes do actually occur somewhere, with only one of them reflecting what happens in our observable Universe. But if the right conditions exist, these parallel Universes will actually be real. An interference pattern results if you pass electrons, photons or any other particle through a double slit. But only if you don’t check which slit they passed through! Image credit: Wikimedia Commons user inductiveload. Quantum indeterminism is a fundamental fact of the Universe, but how we interpret it is up to us. If you fire a single electron through a double slit, you’d like for it to go through either one slit or the other, but that’s not how the Universe works. Instead, the electron acts as a wave, passing through both slits simultaneously and interfering with itself. There’s a probability distribution describing where each individual electron will wind up, but each one will only make a single “hit” on a background screen. If you take thousands of these electrons in a row, the interference pattern will emerge. The wave pattern for electrons passing through a double slit, one-at-a-time. If you measure “which slit” the electron goes through, you destroy the quantum interference pattern shown here. Note that more than one electron is required to reveal the interference pattern. Image credit: Dr. Tonomura and Belsazar of Wikimedia Commons. There are lots of processes that are inherently indeterminate in exactly this fashion. Some are discrete: when you collide a particle and antiparticle to create two photons, one of the photons will have spin +1 and the other will have a spin of -1, but which is which has a 50:50 shot. Other indeterminate processes are continuous: colliding a particle and antiparticle creates two photons, and those two photons will be created in opposite directions (oriented 180 degrees) relative to one another in the particle/antiparticle’s center-of-mass frame. But what direction will those photons pick? North/South? East/West? Up/Down? Anything in between? It’s entirely random. Particle-antiparticle annihilation will produce two photons of equal energy in opposite directions. But which direction that will be is completely random. Image credit: Andrew Deniszczyc, 2017. Every interaction between two particles in the Universe has this quantum indeterminism, at some level, inherent to it. Every particle has an inherent uncertainty to both its position and momentum, and when two of them interacts, that uncertainty propagates into the final position and momentum, too. We have a lot of different ways to try and understand this indeterminism, many of which are equally valid. The idea of parallel Universes, as applied to Schrödinger’s cat. Image credit: Christian Schirm. These interpretations of quantum mechanics cannot be distinguished from one another, and include ideas like wavefunction collapse (where an observation triggers the collapse of the wavefunction), an ensemble approach to possible outcomes (where all outcomes are possible, and the Universe selects one when an observation is made), and the many-worlds approach, where all possible outcomes do occur in some Universe, but we only have the one Universe to observe. The multiverse idea states that there are infinite numbers of Universes like our own, and infinite ones with differences. Image credit: Lee Davy of flickr. This last one has a fantastic consequence, if true: there must exist a number of parallel Universes that’s so great, it approaches infinity as time goes on. There are some 10⁹⁰ particles in the observable Universe, which has been around for 13.8 billion years since the Big Bang, and each particle has undergone anywhere from millions of interactions to many quadrillions (or more) over that time. The number of possible outcomes is ridiculously huge — a number greater than (10⁹⁰)! — but that doesn’t mean the many-worlds approach is ridiculous. In fact, there are a number of ways in which it could be exactly true. The observable Universe might be 46 billion light years in all directions from our point of view, but there’s certainly more, unobservable Universe, perhaps even an infinite amount, just like ours beyond that. Image credit: Frédéric MICHEL and Andrew Z. Colvin, annotated by E. Siegel. 1.) The Universe, of which our observable Universe is a small part, was born infinite. No matter how many particles we have in our Universe, no matter how arbitrary their initial configurations and no matter how many possible outcomes their interactions could have given rise to, that number will still be finite. But the Universe could have been born infinite! Beyond the stars, galaxies, matter and energy that we can see, we have every reason to believe that there is more “Universe” just like our own, and that it’s simply not observable to us due to the fact that the speed of light and the age of the Universe (since the Big Bang) are both finite. If there’s an infinite amount of Universe like this, then the exact configuration starting off our Universe occurred an infinite amount of times, and everything that was ever possible happened somewhere. Inflation set up the hot Big Bang and gave rise to the observable Universe we have access to, but we can only measure the last tiny fraction of a second of inflation’s impact on our Universe. Image credit: Bock et al. (2006, astro-ph/0604101); modifications by E. Siegel. 2.) Our Universe was born finite, but there were an infinite number of them born. The Big Bang was not the very beginning of everything, as we once thought, but was merely the birth of our observable Universe. It was the first moment that our Universe could be described as hot, dense, full of matter/antimatter/radiation, and simultaneously expanding and cooling. This happened a finite amount of time ago — 13.8 billion years — and was preceded by a period of cosmic inflation. Inflation creates an exponentially growing spacetime, which means, if it occurred for an infinite amount of time to the past, could have created an infinite number of finite Universes, one of which contains ours. Even though inflation may end in more than 50% of any of the regions at any given time (denoted by red X’s), enough regions continue to expand forever that inflation continues for an eternity, with no two Universes ever colliding. Image credit: E. Siegel. 3.) Our Universe was born finite, there are a finite number of Universes, but there are enough of them around that all possible outcomes still occur. This is the trickiest case of all, because nothing — not even exponentially-growing, inflating spacetime — grows as fast as the number of possible quantum outcomes for the Universe. But a big enough, possibility-rich enough multiverse will have created a Universe with identical initial conditions to our enough times that all the possible outcomes to date have been realized somewhere. This will change, given enough time; as interactions continue and quantum systems evolve, we will eventually see the number of possibilities surpass the number of Universes available to realize all of them. A representation of the different parallel “worlds” that might exist in other pockets of the multiverse. Image credit: Public domain. Somewhere, the Nazis won World War II; somewhere, Hillary Clinton is president; somewhere, humans have driven themselves to extinction; somewhere, we’ve achieved world peace. We still have just the one Universe, though, and still have no prospects for gathering information outside of what’s observable to us. But if the Universe was born infinite, if the state that gave rise to it existed for an infinite amount of time, or we simply created enough pocket Universes for these parallel Universes to exist today, then they’re real. And they could be real if any of these three possibilities are true; there are three different paths to success. But until we have some way of testing it, we have no way of knowing what the ultimate truth of the matter is, and whether parallel Universes truly are real. This post first appeared at Forbes, and is brought to you ad-free by our Patreon supporters. Comment on our forum, & buy our first book: Beyond The Galaxy! "}