{"parent": "", "timestamp": "Apr 14", "title": "28 Product Backlog and Refinement Anti-Patterns", "sentences": [{"042f": "28 Product Backlog and Refinement Anti-Patterns"}, {"fbae": "TL;DR: 28 Product Backlog and Refinement Anti-Patterns"}, {"ca8c": "Scrum is a practical framework to build products, provided you identified in advance what to build. But even after a successful product discovery phase, you may struggle to make the right thing in the right way if your product backlog is not up to the job. Garbage in, garbage out — as the saying goes."}, {"61b9": "The following article points at the most common product backlog anti-patterns — including the product backlog refinement process — that limit your Scrum team’s success."}, {"7b27": "The Product Backlog Refinement According to the Scrum Guide"}, {"f1d6": "Frist of all, let’s have a look at the current issue of the Scrum Guide on the product backlog refinement:"}, {"c7f3": "“Product Backlog refinement is the act of adding detail, estimates, and order to items in the Product Backlog. This is an ongoing process in which the Product Owner and the Development Team collaborate on the details of Product Backlog items. During Product Backlog refinement, items are reviewed and revised. The Scrum Team decides how and when refinement is done. Refinement usually consumes no more than 10% of the capacity of the Development Team. However, Product Backlog items can be updated at any time by the Product Owner or at the Product Owner’s discretion."}, {"40f8": "Higher ordered Product Backlog items are usually clearer and more detailed than lower ordered ones. More precise estimates are made based on the greater clarity and increased detail; the lower the order, the less detail. Product Backlog items that will occupy the Development Team for the upcoming Sprint are refined so that any one item can reasonably be “Done” within the Sprint time-box. Product Backlog items that can be “Done” by the Development Team within one Sprint are deemed “Ready” for selection in a Sprint Planning. Product Backlog items usually acquire this degree of transparency through the above-described refining activities."}, {"86c1": "The Development Team is responsible for all estimates. The Product Owner may influence the Development Team by helping it understand and select trade-offs, but the people who will perform the work make the final estimate.”"}, {"b2de": "Source & Copyright: ©2016 Scrum.Org and ScrumInc. Offered for license under the Attribution Share-Alike license of Creative Commons, accessible here and also described in summary form."}, {"a22e": "A Typical Product Backlog Refinement Process"}, {"65fa": "Based on the Scrum Guide, a typical process looks as follows:"}, {"432b": "(1) The product owner prioritizes the backlog in advance, so it reflects the best possible use of the development team’s resources:"}, {"d34d": "a) The product owner creates and pre-populates the two upcoming sprints with user stories, using the team’s project management software (or a spreadsheet or any other organizational tool the team applies)"}, {"1ac4": "b) The product owner maintains this pattern continuously."}, {"b3e8": "c) The product owner also adds new user stories that he or she may have identified since the previous refinement session."}, {"9765": "(2) The product owner and the development team are jointly working on user stories:"}, {"ac0d": "a) The product owner provides the answer to the ‘why’ question (business purpose),"}, {"cb12": "b) The team answers the ‘how’ question (technical implementation),"}, {"5219": "c) And both collaborate on the ‘what’ question: what scope is necessary to achieve the desired purpose?"}, {"23fa": "(3) The whole team agrees to time-box discussions. A typical time-box per user story would be around five minutes on average per cycle."}, {"3d9a": "(4) The product owner provides the acceptance criteria to user stories."}, {"9748": "(5) The development team defines what is required to consider a user story to be ready for becoming a sprint backlog item."}, {"d325": "(6) The product owner clarifies questions of the team or invites subject matter experts to refinement sessions who can answer the team’s questions."}, {"1ff1": "(7) Consecutive refinement cycles last until each user story meets the definition of ready, or is no longer pursued."}, {"6444": "(8) Lastly, the team may estimate the available user stories that meet the “definition of ready” criteria. The product owner can now choose from those user stories to become part of an upcoming sprint. (Alternatively, you do not estimate.)"}, {"0107": "Please hit the “heart button” 💚 below, if you found this post useful–it would mean a lot to me!"}, {"4fbf": "If you prefer a notification by email, please sign-up for my weekly newsletter and join 7,302 peers…"}, {"a3df": "Common Product Backlog (Refinement) Anti-Patterns"}, {"6ed2": "Despite being a relatively straightforward, the process of creating and refining a product backlog often suffers from various anti-patterns. I have identified five different categories:"}, {"1f2b": "General Product Backlog Anti-Patterns"}, {"382e": "Product Backlog Anti-Patterns at Portfolio and Product Roadmap Level"}, {"93b0": "Agile Transition — A Manual from the Trenches"}, {"dad0": "The latest, 116 pages strong version of “Agile Transition — A Hands-on Manual from the Trenches” is available right here, and it is FREE!"}, {"24cb": "Download your copy of “Agile Transition — A Hands-on Manual from the Trenches” now…"}, {"6277": "Product Backlog Anti-Patterns of the Product Owner"}, {"8be1": "Product Backlog Anti-Patterns of the Development Team"}, {"a624": "Product Backlog Anti-Patterns of the Scrum Team"}, {"71e0": "Conclusion:"}, {"8308": "Even in the case, you have successfully identified what to build next, your product backlog, as well as its refinement process, will likely provide room for improvement. Just take it to the team and address the issue."}, {"4517": "What product backlog and refinement anti-patterns are missing? Please share with us in the comments."}, {"0a70": "Related Posts"}, {"aa55": "16 Stand-up Anti-Patterns Threatening Your Transition to Scrum"}, {"d7b0": "Why Engineers Despise Agile"}, {"9203": "Please hit the “heart button” 💚 below, if you found this post useful–it would mean a lot to me!"}, {"36e2": "Do you want to read more like this? Well:"}], "author": "Stefan Wolpers", "child": "1270_11270_11270_11270_11270_11270_1", "name": "1270", "content": "28 Product Backlog and Refinement Anti-Patterns TL;DR: 28 Product Backlog and Refinement Anti-Patterns Scrum is a practical framework to build products, provided you identified in advance what to build. But even after a successful product discovery phase, you may struggle to make the right thing in the right way if your product backlog is not up to the job. Garbage in, garbage out — as the saying goes. The following article points at the most common product backlog anti-patterns — including the product backlog refinement process — that limit your Scrum team’s success. The Product Backlog Refinement According to the Scrum Guide Frist of all, let’s have a look at the current issue of the Scrum Guide on the product backlog refinement: “Product Backlog refinement is the act of adding detail, estimates, and order to items in the Product Backlog. This is an ongoing process in which the Product Owner and the Development Team collaborate on the details of Product Backlog items. During Product Backlog refinement, items are reviewed and revised. The Scrum Team decides how and when refinement is done. Refinement usually consumes no more than 10% of the capacity of the Development Team. However, Product Backlog items can be updated at any time by the Product Owner or at the Product Owner’s discretion. Higher ordered Product Backlog items are usually clearer and more detailed than lower ordered ones. More precise estimates are made based on the greater clarity and increased detail; the lower the order, the less detail. Product Backlog items that will occupy the Development Team for the upcoming Sprint are refined so that any one item can reasonably be “Done” within the Sprint time-box. Product Backlog items that can be “Done” by the Development Team within one Sprint are deemed “Ready” for selection in a Sprint Planning. Product Backlog items usually acquire this degree of transparency through the above-described refining activities. The Development Team is responsible for all estimates. The Product Owner may influence the Development Team by helping it understand and select trade-offs, but the people who will perform the work make the final estimate.” Source & Copyright: ©2016 Scrum.Org and ScrumInc. Offered for license under the Attribution Share-Alike license of Creative Commons, accessible here and also described in summary form. A Typical Product Backlog Refinement Process Based on the Scrum Guide, a typical process looks as follows: (1) The product owner prioritizes the backlog in advance, so it reflects the best possible use of the development team’s resources: a) The product owner creates and pre-populates the two upcoming sprints with user stories, using the team’s project management software (or a spreadsheet or any other organizational tool the team applies) b) The product owner maintains this pattern continuously. c) The product owner also adds new user stories that he or she may have identified since the previous refinement session. (2) The product owner and the development team are jointly working on user stories: a) The product owner provides the answer to the ‘why’ question (business purpose), b) The team answers the ‘how’ question (technical implementation), c) And both collaborate on the ‘what’ question: what scope is necessary to achieve the desired purpose? (3) The whole team agrees to time-box discussions. A typical time-box per user story would be around five minutes on average per cycle. (4) The product owner provides the acceptance criteria to user stories. (5) The development team defines what is required to consider a user story to be ready for becoming a sprint backlog item. (6) The product owner clarifies questions of the team or invites subject matter experts to refinement sessions who can answer the team’s questions. (7) Consecutive refinement cycles last until each user story meets the definition of ready, or is no longer pursued. (8) Lastly, the team may estimate the available user stories that meet the “definition of ready” criteria. The product owner can now choose from those user stories to become part of an upcoming sprint. (Alternatively, you do not estimate.) Please hit the “heart button” 💚 below, if you found this post useful–it would mean a lot to me! If you prefer a notification by email, please sign-up for my weekly newsletter and join 7,302 peers… Common Product Backlog (Refinement) Anti-Patterns Despite being a relatively straightforward, the process of creating and refining a product backlog often suffers from various anti-patterns. I have identified five different categories: General Product Backlog Anti-Patterns Product Backlog Anti-Patterns at Portfolio and Product Roadmap Level Agile Transition — A Manual from the Trenches The latest, 116 pages strong version of “Agile Transition — A Hands-on Manual from the Trenches” is available right here, and it is FREE! Download your copy of “Agile Transition — A Hands-on Manual from the Trenches” now… Product Backlog Anti-Patterns of the Product Owner Product Backlog Anti-Patterns of the Development Team Product Backlog Anti-Patterns of the Scrum Team Conclusion: Even in the case, you have successfully identified what to build next, your product backlog, as well as its refinement process, will likely provide room for improvement. Just take it to the team and address the issue. What product backlog and refinement anti-patterns are missing? Please share with us in the comments. Related Posts 16 Stand-up Anti-Patterns Threatening Your Transition to Scrum Why Engineers Despise Agile Please hit the “heart button” 💚 below, if you found this post useful–it would mean a lot to me! Do you want to read more like this? Well: "}