{"parent": "", "timestamp": "Apr 14", "title": "What’s wrong with The New Pornographers?", "sentences": [{"4bbb": "What’s wrong with The New Pornographers?"}, {"dd0f": "Turns out it’s us, not them — Fox Theater, Oakland, Calif., April 13, 2017"}, {"3d90": "My date informed me that she intended to take some pills before we walked from our restaurant to the Fox Theater to catch The New Pornographers in concert. I didn’t know what she meant."}, {"4ac6": "“I need to take my fiber pills,” she re-stated."}, {"1ea9": "Ah. Rock ’n’ roll, man. When in Oakland …."}, {"9228": "The end of all the medicine"}, {"dfe5": "Alas, we are the dominant demographic for The New Pornographers. There are a lot of gray and/or balding and fiber-enhanced TNP fans at their shows. Me and the wife, included."}, {"0975": "Thank God (or at the very least, Canada) for this band and their uncommonly catchy ear candy. Who else to bring the middle-aged out into the darkness and overwhelm our tinnitus with a deep catalog of tightly harmonized, power-pop confections? I feel the need to apologize to The New Pornographers on behalf of the audience for not being younger and better looking. But what do you expect when you hang around for 18 years and seven studio albums?"}, {"7803": "Your audience gets old, that’s what. Nobody feels worse about that than I do."}, {"bb4c": "So there’s your first problem. We’re there for the show. The songs. But we’re going to be reasonable about it. Because we got work tomorrow and more pills to take."}, {"0700": "So do The New Pornographers, too. If this is not a band of introverts, then they are a band of the severely repressed. Showmanship is not their thing — TNP is Carl “A.C.” Newman’s baby and all performance cues stem from his initiation. Which runs the gamut from petite, unassuming 40-something man in a t-shirt to the same man with a twitching leg. Freddie Mercury, he is not. Or Billy Squier (warning: you cannot unsee this). Eye contact between band members appears to be rationed. Straying from your spot doesn’t happen. Which is fine."}, {"60d1": "“Fine” is not what propels one to passion, of course. For The New Pornographers and their fans in the 3/4-filled Fox Theater, it was all about the songs — a vast, deep selection of brainy, if lyrically abstract, soul-lifting bounces with a thick layer of sugary vocal harmonies. If there is one pop songsmith that knows how to consistently top an A-level, hook-laden verse with an even more compelling chorus, it’s Newman."}, {"538a": "As proof, I offer 2014’s “Brill Bruisers,” — for my money, one of the finest power-pop constructions of the last decade, 2003’s “The New Face of Zero and One,” “From Blown Speakers,” “The Laws Have Changed,” “July Jones,” or about two-thirds of 2005’s Twin Cinema or 2007’s (underrated) Challengers albums."}, {"c797": "Power pop perfection"}, {"e2a1": "Shut up and tell us about the concert"}, {"7df5": "The show kicked off with the first single from Whiteout Conditions, their newest album, “High Ticket Attractions.” I’ll nitpick a bit. While “Attractions” ticks off every box — high energy, throbbing beat, soaring synthesizer atop choppy guitars — the song doesn’t do much for me. From the new record, I prefer “This is the World of the Theater,” “Avalanche Alley” and the title track — each of which got a workout at last night’s show."}, {"ffed": "For those of us oldies awaiting the goodies, we didn’t have to wait long with serviceable renditions of (the afore-mentioned) “The Laws Have Changed” and “Use It” — two long-held favorites in the Pornographers’ canon."}, {"061d": "But these were not scintillating live versions. The mix was off early on. Keyboardists Blaine Thurler and Kathryn Calder’s playing could barely be heard on “Laws” and “Use It,” and Newman’s vocals strained on some high notes as it appeared he wasn’t warmed up. Both issues worked themselves out in short order."}, {"0024": "Were they just a little flat, energy-wise? Maybe. Not a good sign being only a few shows in to a tour that will take them through much of the U.S. through early May, and then on to Europe after that."}, {"289b": "A highlight: guest touring performer Simi Stone brought some stage sizzle as she sang harmony and added violin and percussion. Placed up front and center alongside Newman and vocal goddess Neko Case, Stone’s enthusiasm for performing clearly contrasted from the more, let’s say Canadian, performing style of the regular Pornographers. But The New Pornographers know their catalog is beloved and will deliver it as required, very true to the original recordings; no more, no less."}, {"4ae4": "As to be expected, the set list was top-heavy with a handful of songs from the just-released Whiteout Conditions and the triumphant Brill Bruisers albums. Newman and company also unearthed a few less common oldies, including “Adventures in Solitude” (2007), “Sweet Talk, Sweet Talk” (2010) and “All the Old Showstoppers” (2007)— an oldie I had forgotten how much I liked. Love, actually."}, {"ad6c": "The plodding-but-still-catchy “Testament to Youth in Verse” — a curious addition at the mid-point of the Oakland set list — was delivered with Newman on vocals, which were originally handled by original/occasional Pornographer Dan Bejar, who remains absent on this tour and TNP’s most recent record. I’m going to nitpick again. If you’re going to fill a Bejar song on the tour, how do you not pick the delightfully whimsical, transcendent “Myriad Harbour” or the hard-rocking (for them) “Jackie Dressed in Cobras,” both of which killed on the 2014 tour?"}, {"74a6": "What I’m saying is my wife fell asleep at one point. But I feel confident that if TNP had picked one or both of those two songs mid-show, things might have been different. (Don’t be too hard on her. She works hard and had a glass of wine.)"}, {"1cae": "It’s our fault, really. We’re just the prevailing demographic for The New Pornographers in 2017. The songs are an irresistible draw. So much so that we played more of them on the drive back home. Until my wife fell asleep again, of course."}, {"3243": "Catch The New Pornographers on tour this spring. And make sure you’re well rested."}], "author": "julian rogers", "child": "1290_1\t1290_2", "name": "1290", "content": "What’s wrong with The New Pornographers? Turns out it’s us, not them — Fox Theater, Oakland, Calif., April 13, 2017 My date informed me that she intended to take some pills before we walked from our restaurant to the Fox Theater to catch The New Pornographers in concert. I didn’t know what she meant. “I need to take my fiber pills,” she re-stated. Ah. Rock ’n’ roll, man. When in Oakland …. The end of all the medicine Alas, we are the dominant demographic for The New Pornographers. There are a lot of gray and/or balding and fiber-enhanced TNP fans at their shows. Me and the wife, included. Thank God (or at the very least, Canada) for this band and their uncommonly catchy ear candy. Who else to bring the middle-aged out into the darkness and overwhelm our tinnitus with a deep catalog of tightly harmonized, power-pop confections? I feel the need to apologize to The New Pornographers on behalf of the audience for not being younger and better looking. But what do you expect when you hang around for 18 years and seven studio albums? Your audience gets old, that’s what. Nobody feels worse about that than I do. So there’s your first problem. We’re there for the show. The songs. But we’re going to be reasonable about it. Because we got work tomorrow and more pills to take. So do The New Pornographers, too. If this is not a band of introverts, then they are a band of the severely repressed. Showmanship is not their thing — TNP is Carl “A.C.” Newman’s baby and all performance cues stem from his initiation. Which runs the gamut from petite, unassuming 40-something man in a t-shirt to the same man with a twitching leg. Freddie Mercury, he is not. Or Billy Squier (warning: you cannot unsee this). Eye contact between band members appears to be rationed. Straying from your spot doesn’t happen. Which is fine. “Fine” is not what propels one to passion, of course. For The New Pornographers and their fans in the 3/4-filled Fox Theater, it was all about the songs — a vast, deep selection of brainy, if lyrically abstract, soul-lifting bounces with a thick layer of sugary vocal harmonies. If there is one pop songsmith that knows how to consistently top an A-level, hook-laden verse with an even more compelling chorus, it’s Newman. As proof, I offer 2014’s “Brill Bruisers,” — for my money, one of the finest power-pop constructions of the last decade, 2003’s “The New Face of Zero and One,” “From Blown Speakers,” “The Laws Have Changed,” “July Jones,” or about two-thirds of 2005’s Twin Cinema or 2007’s (underrated) Challengers albums. Power pop perfection Shut up and tell us about the concert The show kicked off with the first single from Whiteout Conditions, their newest album, “High Ticket Attractions.” I’ll nitpick a bit. While “Attractions” ticks off every box — high energy, throbbing beat, soaring synthesizer atop choppy guitars — the song doesn’t do much for me. From the new record, I prefer “This is the World of the Theater,” “Avalanche Alley” and the title track — each of which got a workout at last night’s show. For those of us oldies awaiting the goodies, we didn’t have to wait long with serviceable renditions of (the afore-mentioned) “The Laws Have Changed” and “Use It” — two long-held favorites in the Pornographers’ canon. But these were not scintillating live versions. The mix was off early on. Keyboardists Blaine Thurler and Kathryn Calder’s playing could barely be heard on “Laws” and “Use It,” and Newman’s vocals strained on some high notes as it appeared he wasn’t warmed up. Both issues worked themselves out in short order. Were they just a little flat, energy-wise? Maybe. Not a good sign being only a few shows in to a tour that will take them through much of the U.S. through early May, and then on to Europe after that. A highlight: guest touring performer Simi Stone brought some stage sizzle as she sang harmony and added violin and percussion. Placed up front and center alongside Newman and vocal goddess Neko Case, Stone’s enthusiasm for performing clearly contrasted from the more, let’s say Canadian, performing style of the regular Pornographers. But The New Pornographers know their catalog is beloved and will deliver it as required, very true to the original recordings; no more, no less. As to be expected, the set list was top-heavy with a handful of songs from the just-released Whiteout Conditions and the triumphant Brill Bruisers albums. Newman and company also unearthed a few less common oldies, including “Adventures in Solitude” (2007), “Sweet Talk, Sweet Talk” (2010) and “All the Old Showstoppers” (2007)— an oldie I had forgotten how much I liked. Love, actually. The plodding-but-still-catchy “Testament to Youth in Verse” — a curious addition at the mid-point of the Oakland set list — was delivered with Newman on vocals, which were originally handled by original/occasional Pornographer Dan Bejar, who remains absent on this tour and TNP’s most recent record. I’m going to nitpick again. If you’re going to fill a Bejar song on the tour, how do you not pick the delightfully whimsical, transcendent “Myriad Harbour” or the hard-rocking (for them) “Jackie Dressed in Cobras,” both of which killed on the 2014 tour? What I’m saying is my wife fell asleep at one point. But I feel confident that if TNP had picked one or both of those two songs mid-show, things might have been different. (Don’t be too hard on her. She works hard and had a glass of wine.) It’s our fault, really. We’re just the prevailing demographic for The New Pornographers in 2017. The songs are an irresistible draw. So much so that we played more of them on the drive back home. Until my wife fell asleep again, of course. Catch The New Pornographers on tour this spring. And make sure you’re well rested. "}