{"parent": "", "timestamp": "Apr 16", "title": "Nintendo Shouldn’t Be Running Nintendo", "sentences": [{"8c26": "image via ApertureGames"}, {"e37e": "Nintendo Shouldn’t Be Running Nintendo"}, {"0a59": "The Absolutely Insane Death of the NES Classic"}, {"2f9e": "It’s hard for me to remember being as mad at a tech company announcement as I was a few days ago when Nintendo announced they were killing the NES Classic. You know, their retro gaming device that was so popular when it went on sale last year that it instantly sold out, broke Amazon,¹ and was still impossible to find months later."}, {"a73d": "Yes, after releasing a number of decidedly unpopular products for years, Nintendo is now killing off one of its biggest hits. Yes, it’s infuriating."}, {"11dd": "The theories as to why they’re doing this range from silly to insane (read some of the replies here). But no one seems to want to come out and give the Occam’s Razor take: Nintendo doesn’t know what they’re doing."}, {"3ebb": "I used to get a lot of shit for being an Apple apologist back in the day. Nintendo apologists are far worse. They’re absolutely batshit crazy in their thinking that this latest move by their favorite company is a brilliant marketing maneuver. Or better: a masterful game of mind manipulation. This will only lead to bigger and better things for Nintendo, they say."}, {"8f93": "It’s neither of those things. It’s incompetence."}, {"19ce": "Just read Nintendo’s own statement on the matter:"}, {"95d5": "“Throughout April, NOA territories will receive the last shipments of Nintendo Entertainment System: NES Classic Edition systems for this year. We encourage anyone interested in obtaining this system to check with retail outlets regarding availability. We understand that it has been difficult for many consumers to find a system, and for that we apologize. We have paid close attention to consumer feedback, and we greatly appreciate the incredible level of consumer interest and support for this product.”"}, {"0112": "My rough translation:"}, {"4493": "We’re killing the product, the last shipments are going out now. Don’t ask us if we have anymore, go complain to your local stores. We know most consumers that wanted one couldn’t find a system for the past several months. And now they undoubtedly will never be able to. Whoops. But after reading over the feedback and excitement about the system, we realize we have no idea how to ever please our fans. So instead, we’re aiming our NES Zapper right at our own feet and pulling the trigger. But thanks."}, {"ebf0": "This is a company that drunkenly stumbled down the right path, and once it sobered up, realized they were on the right path, freaked out, and ran back the other way. They accidentally launched a hit product and then literally didn’t know what to do."}, {"8cee": "Whenever I rip the company, I feel the need to reiterate that I love Nintendo. They have some of the best IP ever created by mankind. I desperately want them to succeed. But they’ve done so many dumb things over the years that I’d really just prefer some other entity ran the company. Nintendo, at some point, is going to fuck this up in a way that can’t be unfucked."}, {"ebbc": "The Switch is fine. I’m now a few weeks into owning it. Zelda is amazing. The console itself is fairly “meh.” Mario Kart can’t come soon enough. In about a month, we’ll be saying the same thing about the next Super Mario game. They were so goddamn close."}, {"2a9d": "Where the fuck are the virtual console games? You could have argued Nintendo was saving those for the NES Classic. You can no longer argue that. At this point, I think we all have to acknowledge that balls might exist simply for Nintendo to drop them. Their other favorite ball game."}, {"8446": "Please buy them, Apple. Or Disney. Someone take this IP out of its company’s misery."}, {"fed2": "¹ I actually tried to buy the NES Classic the moment it went on sale. For about an hour, you couldn’t get the page to load. When you could, it was say it wasn’t yet on sale. It was. It was just already sold out."}], "author": "M.G. Siegler", "child": "1291_1\t1291_2\t1291_31291_1\t1291_2\t1291_3", "name": "1291", "content": "image via ApertureGames Nintendo Shouldn’t Be Running Nintendo The Absolutely Insane Death of the NES Classic It’s hard for me to remember being as mad at a tech company announcement as I was a few days ago when Nintendo announced they were killing the NES Classic. You know, their retro gaming device that was so popular when it went on sale last year that it instantly sold out, broke Amazon,¹ and was still impossible to find months later. Yes, after releasing a number of decidedly unpopular products for years, Nintendo is now killing off one of its biggest hits. Yes, it’s infuriating. The theories as to why they’re doing this range from silly to insane (read some of the replies here). But no one seems to want to come out and give the Occam’s Razor take: Nintendo doesn’t know what they’re doing. I used to get a lot of shit for being an Apple apologist back in the day. Nintendo apologists are far worse. They’re absolutely batshit crazy in their thinking that this latest move by their favorite company is a brilliant marketing maneuver. Or better: a masterful game of mind manipulation. This will only lead to bigger and better things for Nintendo, they say. It’s neither of those things. It’s incompetence. Just read Nintendo’s own statement on the matter: “Throughout April, NOA territories will receive the last shipments of Nintendo Entertainment System: NES Classic Edition systems for this year. We encourage anyone interested in obtaining this system to check with retail outlets regarding availability. We understand that it has been difficult for many consumers to find a system, and for that we apologize. We have paid close attention to consumer feedback, and we greatly appreciate the incredible level of consumer interest and support for this product.” My rough translation: We’re killing the product, the last shipments are going out now. Don’t ask us if we have anymore, go complain to your local stores. We know most consumers that wanted one couldn’t find a system for the past several months. And now they undoubtedly will never be able to. Whoops. But after reading over the feedback and excitement about the system, we realize we have no idea how to ever please our fans. So instead, we’re aiming our NES Zapper right at our own feet and pulling the trigger. But thanks. This is a company that drunkenly stumbled down the right path, and once it sobered up, realized they were on the right path, freaked out, and ran back the other way. They accidentally launched a hit product and then literally didn’t know what to do. Whenever I rip the company, I feel the need to reiterate that I love Nintendo. They have some of the best IP ever created by mankind. I desperately want them to succeed. But they’ve done so many dumb things over the years that I’d really just prefer some other entity ran the company. Nintendo, at some point, is going to fuck this up in a way that can’t be unfucked. The Switch is fine. I’m now a few weeks into owning it. Zelda is amazing. The console itself is fairly “meh.” Mario Kart can’t come soon enough. In about a month, we’ll be saying the same thing about the next Super Mario game. They were so goddamn close. Where the fuck are the virtual console games? You could have argued Nintendo was saving those for the NES Classic. You can no longer argue that. At this point, I think we all have to acknowledge that balls might exist simply for Nintendo to drop them. Their other favorite ball game. Please buy them, Apple. Or Disney. Someone take this IP out of its company’s misery. ¹ I actually tried to buy the NES Classic the moment it went on sale. For about an hour, you couldn’t get the page to load. When you could, it was say it wasn’t yet on sale. It was. It was just already sold out. "}