{"parent": "", "timestamp": "Nov 16, 2016", "title": "Lo que necesitas saber sobre la PS4 Pro y PlayStation VR", "sentences": [{"a958": "Lo que necesitas saber sobre la PS4 Pro y PlayStation VR"}, {"36a5": "Noviembre es un buen mes para los jugones. De la mano de PlayStation tenemos dos nuevos dispositivos para disfrutar de lo lindo. España es líder en ventas de PlayStation así que es un mercado muy valioso para la compañía y se han redoblado los esfuerzos para anunciar el lanzamiento de las nuevas plataformas. Sin embargo, todavía muchos usuarios tienen un buen montón de dudas acerca de los novedades y particulares de cada dispositivo. Con un poco de suerte este artículo arrojará luz sobre las sombras."}, {"0d38": "Antes de continuar me parece que lo más correcto es informar al lector que soy un empleado de PlayStation. Sin embargo, estas líneas solo reflejan mi opinión personal y no representan a la empresa. Nada en este artículo es una filtración o adelanto de ninguna tecnología que no este ya disponible al público general. Una vez expuesto el conflicto de intereses, vamos a resolver algunas de esas dudas que he visto por la red de redes."}, {"74e0": "Si ya tengo una PS4, ¿necesito la PS4 Pro?"}, {"fb9a": "No es obligatorio ni necesario adquirir una PS4 Pro. La política de la compañía es que todo juego sea compatible en ambas plataformas. Así que si esta era tu principal preocupación descansa tranquilo sabiendo que todo juego de esta generación podrá ser jugado en ambas. Eso sí, habrá diferencias visuales notables."}, {"50de": "Hablemos entonces sobre las ventajas particulares de poseer una PS4 Pro. Voy a hablar principalmente de las dos novedades visuales que más pueden interesar a los jugones, dejando de lado mejoras en el hardware que no dejan de ser más que números que muchas veces se malinterpretan."}, {"c284": "En su momento pudo decepcionar a algunos que la PlayStation 4 no ofreciera soporte para que los juegos corriesen en resoluciones de 4K. Uno de los objetivos primordiales para el diseño de la PS4 Pro era dar soporte a esta tecnología. La PS4 Pro está capacitada técnicamente para proporcionar vídeo en 4K al contrario que la básica. Sin embargo, el aumento de la potencia de la esta nueva consola, aunque significativo, no es suficiente para ofrecer una resolución 4K real en juegos, sino que se logra de manera simulada. Me gustaría recordar a los lectores que los juegos en la PS4 base tienen como resolución máxima de 1K (llamada comúnmente de alta resolución)."}, {"522a": "Los ingenieros se estrujaron el cerebro y dieron algunas soluciones para que los juegos alcancen visualmente la excelencia de las resoluciones 4K nativas, y así satisfacer a una buena cantidad de usuarios que poseen nuevos y flamantes televisores compatibles. ¿Cómo se logra entonces y cuán real es? PlayStation ha ofrecido a los desarrolladores varios caminos para lograrlo, un scaling de la resolución, una técnica de renderizacion eficiente o el uso de texturas de mayor resolución. El resultado es notable pero apenas se publican imágenes porque muy dificilmente vas a apreciar la diferencia entre 4K y 1K en una pantalla pequeña. Esta comparación solo es sostenible realmente en un televisor que permita dichas resoluciones y tenga un tamaño considerable. Juzga por ti mismo."}, {"744d": "La diferencia visual solo es apreciable en televisores de 4K ya que hablamos de calidad de detalle en pantalla grande."}, {"85a8": "La segunda mejora visual se debe que la PS4 Pro tiene soporte para HDR. Esto proporciona a la consola la capacidad de ofrecer unas imagenes que tienen una mayor profundidad y riqueza de colores y contrastes. Gracias al uso de una gama HDR, los colores son más naturales, especialmente los tonos blancos. La diferencia salta a la vista en este caso."}, {"b292": "PS4 PRO HDR vs PS4 PRO SDR"}, {"ae8a": "Bueno, ¿y todo esto vale la pena?"}, {"dc33": "El mayor poder de computación de la PS4 Pro permite resoluciones más nítidas y una gama de colores más llamativa. ¿Tienes un televisor 4K? ¿Le echas muchas horas? ¿Tienes expectativas de ver contentido en 4K con servicios de vídeo como Netflix? Si respondes a estas preguntas afirmativamente es muy posible que quieras considerar la compra."}, {"a777": "¿Y si no tengo ninguna, cual compro?"}, {"21c6": "Comprar la PS4 básica no es de perdedores. Esto es como las gamas de móviles dentro de una misma marca que ofrecen la misma versión con diferencias en el hardware para diferentes bolsillos. Ambas consolas son capaces de satisfaces las necesidades de cualquier usuario y ambas tienen acceso a las mismas aplicaciones. Es una cuestión de dinero y prioridad. Cuanto de tu presupuesto le dedicas a la tecnología."}, {"547a": "Además ha salido la PS4 Slim, una versión más ligera de la PS4 original. En términos de hardware es el mismo pero tiene un par de mejoras valiosas como un ventilador menos ruidoso y efectivo, y un WiFi mejorado respecto a la básica."}, {"c4e9": "Los precios son indicativos ya que en realidad las tiendas especialistas tendrán variadas ofertas y packs, así que una búsqueda concienzuda en la red es más que conveniente."}, {"a36b": "Las tres opciones disponibles en el mercado"}, {"3235": "Si me compro la PS VR, ¿necesito algo más?"}, {"0fe8": "¡Sí! Necesitas una PS4. PS VR utilizará la capacidad gráfica de la PS4 para traer una nueva experiencia visual a tu casa. Y cuando digo nueva lo reitero con alevosía. Es una experiencia difícil de explicar porque ningún vídeo que te puede hacer entender lo que significa estar dentro del juego y vivirlo en primera persona hasta que lo hagas tu mismo."}, {"897d": "Da igual si tienes una PS4 base o Pro. Ambas son válidas para sumergirte en la realidad virtual. Por otro lado, es un requisito esencial tener una PlayStation Camera, asegurate de tener una antes de llevarte un chasco en casa."}, {"8764": "¡Cuando abras la caja y veas el conjunto de componentes VR verás unos diez ítems, pero no te asustes! Es muy fácil de conectar y empezar a jugar ya que en cuanto la PS4 detecta el nuevo hardware, el software de instalación es automático. Además, PS VR viene con seis minijuegos (PlayRoom) que te ayudarán a acostumbrarte y familiarizarte con el dispositivo."}, {"98d1": "¿Merece la pena el ‘Virtual Reality’? ¿Está sobrevalorado? ¿No será otro pésimo 3D?"}, {"1763": "En corto no, no tiene nada que ver y es algo realmente innovador. Es difícil explicar la inmersión que proporciona y ninguna imagen o anuncio podrá mostrartelo sino lo pruebas tu mismo. Tal vez sea un aspecto que haga de esta tecnología un desafio para los comerciales pero por otro lado, es una experiencia que no deja indiferente. Olvídate del absurdo y barato 3D de los cines. VR es estar dentro de la imaginación de los creadores de contenido, y tu subconsciente se lo cree."}, {"1970": "Los desarrolladores han puesto especial cuidado y dedicación a que la experiencia sea para bien, y es raro aunque posible experimentar mareos y fobias en las primeras inmersiones. Un ejemplo que me llamó la atención fue durante el desarrollo de un juego en el que los jugadores vuelan a lomos de un gran animal pero cuando estos se estrellaban contra el suelo, mencionaban en su feedback un alto nivel de tensión y estrés en ese momento. Aunque los gráficos no son realistas, la experiencia es más íntima que en consola, y no era agradable para el subconsciente del jugador tener pensamientos del tipo «Me caigo, me voy a destrozar contra el suelo». Así que los desarrolladores cambiaron esa parte de la mecánica del juego para que cuando el jugador fuera a estrellarse se abriese un portal que teletransportase al animal al cielo como si nada. Los usuarios no reportaron ningún nivel de estrés. Un poco como si el subsconciente, al que solo le preocupa tu bienestar y no el realismo, dijera «Ah bueno, un portal mágico. Que bien, estoy salvado»."}, {"241e": "Quizás parezca un poco farragoso pero el casco es ligero y confortable."}, {"0c17": "En cuanto a como será el vídeo en VR está un poco por ver. No hay grandes anuncios al respecto aunque el interés es grande. Todavía no está nada claro que se podrá hacer, y de buen seguro que hay muchas iniciativas al respecto. ¿Te imaginas viendo el partido en vivo desde el cesped o el palco del Camp Nou sin haber tenido que desembolsar un buen dineral? Pues no lo imagines tanto porque ideas del estilo están ya a la vuelta de la esquina."}, {"15df": "¿Hay un controlador PS Move específico para VR? ¿Es obligatorio su uso?"}, {"f61c": "No, es el mismo controlador que utilizas para el resto de las plataformas. Y su uso no es obligatorio, si no te sientes cómodo con el mismo o sino es tu estilo puedes utilizar el controlador Dualshock de toda la vida para tus juegos en VR. Aunque siendo realistas lo más factible es que los juegos estén diseñados para que el uso del PS Move sea el más indicado para una mejor jugabilidad."}, {"ffad": "¿Puedo jugar a mis juegos de PS4 en VR?"}, {"a90f": "No, la portabilidad no es obvia ni directa. Los requisitos para desarrollar un juego en VR son mucho más altos. VR require procesar y mostrar dos imagenes (una para cada ojo) y hacerlo manteniendo un muy exigente framerate superior a los 60 imágenes por segundo. Es decir, que los gráficos serán más bien como la PS3."}, {"c8ad": "¿Y qué catálogo de juegos se espera?"}, {"f7f9": "El número de juegos en lanzamiento se espera que sea superior a cincuenta y eso es mucho más de lo usual. Y algunos lanzamientos son de nivel, ¡prepárate para conducir de manera hiperrealista!"}, {"27ec": "Algunos otros juegos disponibles en lanzamiento son:"}, {"bee6": "Y los juegos por llegar tampoco pintan nada mal. Pongamos por ejemplo, Resient Evil. El juego anunciado aunque una vez más, lo tendrás que probar para entender que significa jugar con realidad virtual."}, {"9f1b": "Si tienes alguna duda y puedo ayudar, estaré encantado de responder a cualquier pregunta hasta donde yo sepa."}], "author": "Hugo Aguirre", "child": "1309_1\t1309_2", "name": "1309", "content": "Lo que necesitas saber sobre la PS4 Pro y PlayStation VR Noviembre es un buen mes para los jugones. De la mano de PlayStation tenemos dos nuevos dispositivos para disfrutar de lo lindo. España es líder en ventas de PlayStation así que es un mercado muy valioso para la compañía y se han redoblado los esfuerzos para anunciar el lanzamiento de las nuevas plataformas. Sin embargo, todavía muchos usuarios tienen un buen montón de dudas acerca de los novedades y particulares de cada dispositivo. Con un poco de suerte este artículo arrojará luz sobre las sombras. Antes de continuar me parece que lo más correcto es informar al lector que soy un empleado de PlayStation. Sin embargo, estas líneas solo reflejan mi opinión personal y no representan a la empresa. Nada en este artículo es una filtración o adelanto de ninguna tecnología que no este ya disponible al público general. Una vez expuesto el conflicto de intereses, vamos a resolver algunas de esas dudas que he visto por la red de redes. Si ya tengo una PS4, ¿necesito la PS4 Pro? No es obligatorio ni necesario adquirir una PS4 Pro. La política de la compañía es que todo juego sea compatible en ambas plataformas. Así que si esta era tu principal preocupación descansa tranquilo sabiendo que todo juego de esta generación podrá ser jugado en ambas. Eso sí, habrá diferencias visuales notables. Hablemos entonces sobre las ventajas particulares de poseer una PS4 Pro. Voy a hablar principalmente de las dos novedades visuales que más pueden interesar a los jugones, dejando de lado mejoras en el hardware que no dejan de ser más que números que muchas veces se malinterpretan. En su momento pudo decepcionar a algunos que la PlayStation 4 no ofreciera soporte para que los juegos corriesen en resoluciones de 4K. Uno de los objetivos primordiales para el diseño de la PS4 Pro era dar soporte a esta tecnología. La PS4 Pro está capacitada técnicamente para proporcionar vídeo en 4K al contrario que la básica. Sin embargo, el aumento de la potencia de la esta nueva consola, aunque significativo, no es suficiente para ofrecer una resolución 4K real en juegos, sino que se logra de manera simulada. Me gustaría recordar a los lectores que los juegos en la PS4 base tienen como resolución máxima de 1K (llamada comúnmente de alta resolución). Los ingenieros se estrujaron el cerebro y dieron algunas soluciones para que los juegos alcancen visualmente la excelencia de las resoluciones 4K nativas, y así satisfacer a una buena cantidad de usuarios que poseen nuevos y flamantes televisores compatibles. ¿Cómo se logra entonces y cuán real es? PlayStation ha ofrecido a los desarrolladores varios caminos para lograrlo, un scaling de la resolución, una técnica de renderizacion eficiente o el uso de texturas de mayor resolución. El resultado es notable pero apenas se publican imágenes porque muy dificilmente vas a apreciar la diferencia entre 4K y 1K en una pantalla pequeña. Esta comparación solo es sostenible realmente en un televisor que permita dichas resoluciones y tenga un tamaño considerable. Juzga por ti mismo. La diferencia visual solo es apreciable en televisores de 4K ya que hablamos de calidad de detalle en pantalla grande. La segunda mejora visual se debe que la PS4 Pro tiene soporte para HDR. Esto proporciona a la consola la capacidad de ofrecer unas imagenes que tienen una mayor profundidad y riqueza de colores y contrastes. Gracias al uso de una gama HDR, los colores son más naturales, especialmente los tonos blancos. La diferencia salta a la vista en este caso. PS4 PRO HDR vs PS4 PRO SDR Bueno, ¿y todo esto vale la pena? El mayor poder de computación de la PS4 Pro permite resoluciones más nítidas y una gama de colores más llamativa. ¿Tienes un televisor 4K? ¿Le echas muchas horas? ¿Tienes expectativas de ver contentido en 4K con servicios de vídeo como Netflix? Si respondes a estas preguntas afirmativamente es muy posible que quieras considerar la compra. ¿Y si no tengo ninguna, cual compro? Comprar la PS4 básica no es de perdedores. Esto es como las gamas de móviles dentro de una misma marca que ofrecen la misma versión con diferencias en el hardware para diferentes bolsillos. Ambas consolas son capaces de satisfaces las necesidades de cualquier usuario y ambas tienen acceso a las mismas aplicaciones. Es una cuestión de dinero y prioridad. Cuanto de tu presupuesto le dedicas a la tecnología. Además ha salido la PS4 Slim, una versión más ligera de la PS4 original. En términos de hardware es el mismo pero tiene un par de mejoras valiosas como un ventilador menos ruidoso y efectivo, y un WiFi mejorado respecto a la básica. Los precios son indicativos ya que en realidad las tiendas especialistas tendrán variadas ofertas y packs, así que una búsqueda concienzuda en la red es más que conveniente. Las tres opciones disponibles en el mercado Si me compro la PS VR, ¿necesito algo más? ¡Sí! Necesitas una PS4. PS VR utilizará la capacidad gráfica de la PS4 para traer una nueva experiencia visual a tu casa. Y cuando digo nueva lo reitero con alevosía. Es una experiencia difícil de explicar porque ningún vídeo que te puede hacer entender lo que significa estar dentro del juego y vivirlo en primera persona hasta que lo hagas tu mismo. Da igual si tienes una PS4 base o Pro. Ambas son válidas para sumergirte en la realidad virtual. Por otro lado, es un requisito esencial tener una PlayStation Camera, asegurate de tener una antes de llevarte un chasco en casa. ¡Cuando abras la caja y veas el conjunto de componentes VR verás unos diez ítems, pero no te asustes! Es muy fácil de conectar y empezar a jugar ya que en cuanto la PS4 detecta el nuevo hardware, el software de instalación es automático. Además, PS VR viene con seis minijuegos (PlayRoom) que te ayudarán a acostumbrarte y familiarizarte con el dispositivo. ¿Merece la pena el ‘Virtual Reality’? ¿Está sobrevalorado? ¿No será otro pésimo 3D? En corto no, no tiene nada que ver y es algo realmente innovador. Es difícil explicar la inmersión que proporciona y ninguna imagen o anuncio podrá mostrartelo sino lo pruebas tu mismo. Tal vez sea un aspecto que haga de esta tecnología un desafio para los comerciales pero por otro lado, es una experiencia que no deja indiferente. Olvídate del absurdo y barato 3D de los cines. VR es estar dentro de la imaginación de los creadores de contenido, y tu subconsciente se lo cree. Los desarrolladores han puesto especial cuidado y dedicación a que la experiencia sea para bien, y es raro aunque posible experimentar mareos y fobias en las primeras inmersiones. Un ejemplo que me llamó la atención fue durante el desarrollo de un juego en el que los jugadores vuelan a lomos de un gran animal pero cuando estos se estrellaban contra el suelo, mencionaban en su feedback un alto nivel de tensión y estrés en ese momento. Aunque los gráficos no son realistas, la experiencia es más íntima que en consola, y no era agradable para el subconsciente del jugador tener pensamientos del tipo «Me caigo, me voy a destrozar contra el suelo». Así que los desarrolladores cambiaron esa parte de la mecánica del juego para que cuando el jugador fuera a estrellarse se abriese un portal que teletransportase al animal al cielo como si nada. Los usuarios no reportaron ningún nivel de estrés. Un poco como si el subsconciente, al que solo le preocupa tu bienestar y no el realismo, dijera «Ah bueno, un portal mágico. Que bien, estoy salvado». Quizás parezca un poco farragoso pero el casco es ligero y confortable. En cuanto a como será el vídeo en VR está un poco por ver. No hay grandes anuncios al respecto aunque el interés es grande. Todavía no está nada claro que se podrá hacer, y de buen seguro que hay muchas iniciativas al respecto. ¿Te imaginas viendo el partido en vivo desde el cesped o el palco del Camp Nou sin haber tenido que desembolsar un buen dineral? Pues no lo imagines tanto porque ideas del estilo están ya a la vuelta de la esquina. ¿Hay un controlador PS Move específico para VR? ¿Es obligatorio su uso? No, es el mismo controlador que utilizas para el resto de las plataformas. Y su uso no es obligatorio, si no te sientes cómodo con el mismo o sino es tu estilo puedes utilizar el controlador Dualshock de toda la vida para tus juegos en VR. Aunque siendo realistas lo más factible es que los juegos estén diseñados para que el uso del PS Move sea el más indicado para una mejor jugabilidad. ¿Puedo jugar a mis juegos de PS4 en VR? No, la portabilidad no es obvia ni directa. Los requisitos para desarrollar un juego en VR son mucho más altos. VR require procesar y mostrar dos imagenes (una para cada ojo) y hacerlo manteniendo un muy exigente framerate superior a los 60 imágenes por segundo. Es decir, que los gráficos serán más bien como la PS3. ¿Y qué catálogo de juegos se espera? El número de juegos en lanzamiento se espera que sea superior a cincuenta y eso es mucho más de lo usual. Y algunos lanzamientos son de nivel, ¡prepárate para conducir de manera hiperrealista! Algunos otros juegos disponibles en lanzamiento son: Y los juegos por llegar tampoco pintan nada mal. Pongamos por ejemplo, Resient Evil. El juego anunciado aunque una vez más, lo tendrás que probar para entender que significa jugar con realidad virtual. Si tienes alguna duda y puedo ayudar, estaré encantado de responder a cualquier pregunta hasta donde yo sepa. "}