{"parent": "", "timestamp": "Aug 22, 2016", "title": "Konami profanó la serie Metal Gear? En serio?", "sentences": [{"5d35": "Konami profanó la serie Metal Gear? En serio?"}, {"8752": "La hipocresía, el amarillismo y toda clase de pasiones variopintas se han apoderado del medio de los videojuegos los últimos años, y mas aún cuando la internet dota de mayor poder de opinión al público en general. Ahora los publishers y los desarrolladores la tienen que pensar muy bien a la hora de presentar el último tráiler o adelanto en gameplay de su juego, y esto debido a que puede desatar una oleada de odio, discordia, negativismo y toda clase de comentarios negativos que encienden de manera muy furiosa la caja de comentarios de youtube, twitch, twitter y cualquier aplicación web social."}, {"2639": "Desde el segundo trimestre del 2015 se desató la polémica sobre la partida de Konami por parte de Hideo Kojima, y se le dice puntualmente polémica puesto que internet presentó este hecho como la violación mas profunda a los derechos humanos desde el holocausto nazi. Al haber despedido a Kojima, Konami fue blanco de todo el odio por parte de la comunidad gamer en todo el mundo (y mas aún de los fans), puesto que esto aseguraba no solo el fin de la saga, (que igual ya estaba aparentemente cerrada y terminada con MGSV), sino que nadie sabia a ciencia cierta que iba a pasar con lo que quedaba del desarrollo de MGSV y de los siguientes proyectos de Kojima como Sillent Hills y Zone of the Enders 3 (este último es el que mas me duele personalmente y nadie habla de el)."}, {"bb55": "Metal Gear Solid 5 salió, provoco todas las eyaculaciones habidas y por haber en todos los PS4, PS3, Xbox 360 y Xbox One que existen en el mundo, y las cosas mostraron el verdadero matiz que tenían conforme pasaba el tiempo a partir de ese septiembre 1 de 2016."}, {"ff69": "Soy fan de Metal Gear Solid, los he jugado absolutamente todos y hasta los spin off como Metal Gear Rising y Portable Ops (porque según Kojima este juego ya no califica como canónico); y te puedo decir con autoridad de que aunque The Phantom Pain es un juego realmente excelente, con muchísimo contenido, mucho por hacer y muy divertido (honestamente MUY DIVERTIDO), no es realmente un Metal Gear Solid puesto que no cumplió con lo que se supone que tenia que pasar en términos de narrativa para cerrar la saga de la manera correcta y teniendo en cuenta todo lo que se había contado en los 6 juegos anteriores: Metal Gear Solid, Metal Gear Solid 2, Metal Gear Solid 3, Metal Gear Solid 4, Metal Gear Solid, Portable Ops, y Metal Gear Solid Peace Walker."}, {"83c9": "En un post anterior escribí muy extensamente de lo que pudo ser y no fue MGSV, y no voy a ahondar tanto en este tema, de modo que te invito a que lo leas. Lo que si haré ahora de la manera mas breve posible, es decirte a ti que estas leyendo esto, y que muy probablemente piensas que Konami está profanando vulgarmente a la saga Metal Gear con el anuncio de un nuevo juego que lleva por nombre “Survive”, y que le realidad es que el mismo Kojima es el que profanó la saga Metal Gear Solid con The Phanton Pain. Si te sientes muy ofendido porque estoy hablando “mal” de tu macho alfa japonés, es mejor que dejes de leer ahora, porque seguiré hablando objetivamente (ósea mal, para los fans acérrimos de Kojima), y te daré mis argumentos (algunos especulaciones, otros muy objetivos u otros muy subjetivos) por los cuales pienso que el mismo creador de Metal Gear Solid fue el que se burló de su propia obra."}, {"9034": "Empezaré por darte una muy resumida reseña de lo que presentó cada juego en cuestión de la historia hasta Metal Gear Solid 5 TPP:"}, {"3ebc": "Un tanque de guerra nuclear que camina en dos patas y que lanza misles nucleares invisibles al radar. WTF!"}, {"6988": "2. Metal Gear Solid 2: La continuación de la locura y mas confusa aun. operaciones encubiertas, mas nanomáquinas, ahora hay un tercer clon que era el presidente y por ende tiene cierto patriotismo, Inteligencia artificial, tecnologías de la información, hackers, otra vez filosofía existencial (lo que he aprendido culturalmente dicta quien soy?), otra unidad militar renegada con habilidades sobrehumanas (una inmortal suertuda, un vampiro también inmortal, un loco por las bombas en patines y un ex presidente muy molesto) y otro tanque bípedo nuclear que esta vez se construye en serie y por lo que debes destruirlos a todos (30) con tu lanza cohetes; y lo mejor, una conspiración llevada a cabo por un grupo de hombres súper poderosos que están por encima del gobierno y que terminan siendo una IA. Este juego es prácticamente una copia memética del anterior (muy brillante en términos de narrativa, de hecho el mejor a mi parecer)."}, {"7ac0": "La batalla final de Raiden contra 30 unidades Metal Gear Ray, encima de Arsenal Gear… Sip otro Metal Gear"}, {"6d8e": "3. Metal Gear Solid 3: Ahora estamos en plena guerra fría y juegas con el soldado legendario del cual sacaron copias solo que en ese entonces era un novato con mucho potencial, espías, dobles, espías triples, tecnología emergente a partir de la segunda guerra mundial, una unidad militar legendaria con habilidades sobrehumanas que llevo al éxito de los aliados en la segunda guerra mundial (un domador de avispas, un mutante rana, un pirómano cosmonauta, y un anciano vegetal francotirador; todos al mando de la maestra del protagonista del juego), el inicio de la organización secreta súper poderosa, y otra vez un tanque bípedo (no tan bípedo) nuclear. Y por ultimo, mas filosofía existencial (el contexto histórico en el que vivo determina quien soy?)."}, {"3e1e": "4. Metal Gear Solid Portable Ops: El novato ya no es novato, es un experimentado y legendario soldado que lleva consigo mucho arrepentimiento por matar a su mentora, una base militar rusa dentro de Colombia, agentes dobles y triples, el inicio de personajes que luego se ven en MGS y MGS2, un cohete balístico nuclear con una cabeza robótica, una unidad militar con poderes sobrehumanos, y un loco que quiere pertenecer a la organización poderosa súper secreta a la fuerza."}, {"8b17": "Portable Ops, el juego que según Kojima ya no es canónico y tiene mas personajes importantes que en Phantom Pain. Si o no Sigint?"}, {"921a": "5. Metal Gear Solid 4: ahora volvemos al futuro justo después del MGS2 (bueno 10 años después), y ahora hay mas ciencia ficción que nunca; vuelven las nanomáquinas, un sistema de información súper inteligente que lo controla todo, hasta lo que puedes sentir o no, lo que puedes disparar o no, o lo que puedes defecar o no. Una unidad militar con mucho stress post-traumático, y con trajes, prótesis de alta tecnología o exoesqueletos (ni idea), tu hermano clon se le mete a un espía por medio de su brazo y lo controla (WTF) y busca destruir para siempre a la organización súper poderosa secreta y que ya todos saben que es una IA; Ah y además, peleas a bordo del primer tanque nuclear bípedo para destruir al segundo tanque nuclear bípedo (pero ya no son 30). Vuelve la filosofía existencial (lo que siento determina quien soy?)."}, {"776b": "En el futuro presentan la innovación de tanques bípedos erguidos en sus patas, que ya fueron creados en la guerra fria ¬¬"}, {"131c": "6. Metal Gear Solid Peace Walker: Volvemos a la guerra fría donde se terminan los eventos de Portable Ops, y ahora el soldado legendario inicia una startup como compañía de mercenarios a sueldo con un soldado que conoció en las FARC de Colombia (……………). Hay un científico y una científica que están construyendo un robot cuadrúpedo (ahora si innovaron) y que tiene como cerebro una IA (en 1975) que lleva los pensamientos y sentimientos de la mentora del soldado legendario. Ahora no hay unidad militar renegada, pero si hay un grupo de robots gigantes guiados con la misma IA. Al final destruyen el cuadrúpedo y todos quedan felices en su base militar ubicada en las aguas de Costa Rica y que iniciaron en las playas de Barranquilla (cerca de mi casa)."}, {"f21d": "El par de emprendedores en el negocio de los ejercitos a sueldo o PMC como se llamarán en el futuro. Estas ideas de negocios!"}, {"e814": "Uff!!! Sip este es mi jocoso resumen de la serie, y puede leerse loco y hasta chistoso, pero Hideo Kojima ha sabido contarla muy bien, con un pedigrí militar bastante creíble, enlaza muy bien eventos históricos con los fictícios (como la batalla de Bahía de Cochinos, la crisis e misiles en Cuba, la tensión entre Rusia y EU durante la guerra fría, la guerra del Golfo y la locura del /2K), y adicionalmente argumenta muy bien temas de filosofía existencial, ciencia ficción, y mucho porno de armas."}, {"b01d": "Lo que se esperaba con Metal Gear Solid 5 (o al menos eso esperaba yo como fan de la serie), era que se contara como es que Big Boss realmente formó Outher Heaven, como Cypher dió forma a los Patriotas modernos convertidos en IA, como es que Sigint, Paramedic, Eva, Ocelot, Zero y Big Boss finalmente deciden como poner en marcha dicha IA y finalmente como es que Liquid Snake y Solid Snake son formados luego del nacimiento mediante el proyecto Les Enfant Terrible."}, {"9fae": "El prologo, Metal Gear Solid V Ground Zeroes, a pesar de ser un juego muy pequeño (prácticamente un demo), tiene toda esa esencia de la serie, hay un background de la historia, que incluso se presenta con el hermoso arte de Yoji Shinkawa, hay escena cinemáticas excelentes, hay un enemigo psicótico que se ve bien malo, y hay un aura o ambiente de que todo se va a ir al demonio pronto. Y en realidad así es, todo se fue al demonio, pero en la vida real!"}, {"2d5d": "Cuando llego el juego en Septiembre 1 de 2016 y me fui a la tienda a comprarlo DAY ONE y jugué la primera hora o mas bien las primeras 2 horas, todo iba súper bien, sin duda era Metal Gear Solid y las cosas pintaban bien, los personajes militares con poderes sobre humanos, los sucesos paranormales y todo el porno de armas y escenas cinemáticas bien logradas, todo aderezado con el poderoso Fox Engine (ya hablaré de este tema mas adelante). Pero luego, o sorpresa, pase 60 horas de juego donde me terminé la línea argumental principal, y no vi la unidad militar renegada, no vi ciencia ficción creíble o bien cimentada, no vi nada acerca de lo que quedó con Peace Walker y Portable Ops y que enlazara con Metal Gear Solid 1."}, {"a89c": "Lo que vi en cambio es un festival de ideas experimentales con la narrativa, un virus que vuelve a los soldados en zombis si hablan determinado idioma, el malo de Ground Zeroes, no es tan malo y de hecho ni peleas con el, la unidad paranormal de la primera hora tampoco se enfrenta a ti, y el robot bípedo (que ahora es totalmente erguido) resulta ser demasiado avanzado como para que el Metal Gear Rex en el año 2010 represente toda una innovación el pleno siglo XXI."}, {"3fc4": "En resumidas cuentas, Kojima no cumplió, y no solo eso, sino que también ingreso tantas ideas locas inconclusas e incoherentes que prácticamente la internet pedía a gritos teorías que soportaran los fans mas acérrimos de la serie para poder concluir en nuestras propias cabezas lo que debía ser la serie. Esto, mis amigos, es algo realmente injusto."}, {"129d": "La serie Metal Gear Solid fue profanada desde el propio The Phantom Pain, y ahora me vienes a decir tu que te decepciono el tráiler de Metal Gear Survive?"}, {"b4c9": "Que tiene Metal Gear Survive?"}, {"05e7": "Mother Base? También está en TPP"}, {"01b4": "Zombis? También están en TPP"}, {"7b69": "Agujeros negros? También están en TPP."}, {"d601": "Además!!! En TPP encuentras el brazo de Jehuty para que lo uses como prótesis para Big boss."}, {"4f44": "Entonces? De que te estas quejando?"}, {"6d8a": "Voy a tocar el tema ahora acerca de tu macho alfa, Hideo Kojima. Resulta que dices que Konami lo echo injustamente? Es así?"}, {"99c6": "Dime algo, si tu trabajas para una multinacional de cualquier producto que las masas consumen, tienes un puesto importante, es tu responsabilidad que los productos que vendan sean rentables para la empresa en términos de venta, y en determinado momento presentas un proyecto a tus jefes que lo argumentas como la panacea en el mercado y haces gastar muchísimo dinero (mas de la cuenta) a la empresa y que luego resulta que no se puede recuperar, como crees que reaccionaran tus jefes? TE ECHAN!"}, {"e4a2": "Como vas a despilfarrar tanto dinero en un producto que no va a colmar las expectativas o que de plano, no va a vender lo suficiente como para recuperar la inversión?"}, {"d06b": "Eso paso precisamente con Kojima. Este sujeto es prácticamente una diva, un rockstar, si tu lo sigues en twitter notarás que se la pasa todo el día posteando lo que come, lo que bebe, con que estrella de cine lo hace y en donde anda viajando; en que momento trabaja?"}, {"b129": "Hay que tener mucho cuidado de adular tanto a una persona que le encanta figurar…. Hasta en las tapas de los juegos."}, {"d863": "No me mal interpretes ni te lo tomes a mal, el tipo tiene derecho, y la reputación que tiene como maestro en el diseño de videojuegos se la tiene bien ganada, pero hey, si tu desangras el presupuesto de tu empresa y todo tiene que llevar tu nombre para inflar tu ego y cotizarte mas artificialmente, eso honestamente no se ve tan bien. Miyamoto tiene el mismo renombre (o hasta mas) que Kojima, del mismo modo que lo tiene Notch, Kamiya, Jeff Bleskinski, Neil Druckman, Kelle Santiago, Jenova Chen y otros. Quien sabe que exigencias tenia Hideo en Konami que simplemente la burbuja estalló y lo pusieron de patitas en la calle. Y la realidad dicta (aunque te duela) que la serie Metal Gear no vende lo que vende GTA, o Call of Duty, o FIFA. El que tu lo compres, ames la saga, y realmente sean buenos videojuegos no quiere decir que sean comercialmente exitosos (Wii U estas ahí?). Kojima lideró el desarrollo de Fox Engine durante 2 años, y luego se gasto otros 3 liderando el desarrollo de TPP cuanto dinero crees que eso le costó a Konami en recursos humanos, software y demás, eso sin mencionar de que la música la hizo Harry Gregson Williams, y la voz de Big Boss ahora corría por parte de Kieffer Sutherland, que para quienes no lo conozcan no es otro mas que Jack Bauer en la serie 24; por cierto porque será que David Hayter habla tan mal de Kojima luego de estos sucesos? Será solamente porque le quito el papel luego de que este lo tuviera durante tanto tiempo (18 años muchachos, que no es poco)."}, {"7bc0": "Entonces dime, realmente el malo es Konami?"}, {"dedb": "Pero volvamos a Metal Gear Survive, merece tanto odio? Si aun no ha salido!"}, {"9673": "Como juego quizá sea excelente, y estoy seguro que así sea, porque el mismo equipo que diseño y desarrollo TPP está detrás otra vez, exceptuando claro está, a su padre y al director de arte de cabecera Shinkawa."}, {"e220": "Todo este post no es promoviendo el odio hacia Kojima ni dejando a Konami como un ángel, esta empresa también obró mal al hacer cero control de daños al momento de cancelar dos proyectos importantes, pero hay que entender que para ellos todo se traduce en plata, y para nosotros todo se traduce en juegos que cumplan y sobrepasen nuestras expectativas. Pero quiero que pongas las cosas en perspectiva y con cabeza fría pienses, realmente Konami profanó y destruyó la saga Metal Gear con un juego que sigue las mismas directrices artísticas y narrativas, y las mismas ideas locas que el mismo Kojima planteo en TPP?"}, {"e67a": "Oye, como Hideo va a decir que Portable Ops ya no es canónico, solo porque el no dirigió el juego y porque los eventos contados en este juego no se engranan perfectamente con las locuras que tenia pendientes para TPP? Eso en sí es una burla."}, {"c124": "Y ya que comento eso de que el no dirigió Portable Ops, resulta que uno de los Metal Gear mas memorables que existen, no lo dirigió completamente Hideo, y este es: Metal Gear Solid 3 Snake Eater; además de claro Portable Ops y Rising."}, {"c311": "Entonces? Konami profano y destruyó la saga?"}, {"54ac": "La excusa de que a Kojima no le dieron tiempo de terminar el desarrollo de TPP tampoco es válida, porque como te comento, como juego es muy excelente, de hecho raya en la perfección, pero el error y el pecado de TPP es que simplemente es un buen juego mas no un MGS, y esto es un problema mas de narrativa y de concepto mas que de desarrollo, y eso ya venía establecido por el mismo Kojima desde el momento en que empezó a escribir el guión, y eso es en etapa de planeación y diseño, no de desarrollo."}, {"8d6e": "Es mas, sabes lo que creó? Que al mediano y/o largo plazo, Konami puede reiniciar la serie y darle un mucho mejor enfoque que el que estableció Kojima con TPP."}, {"dc66": "Esta dicho por Konami oficialmente que el juego es un spin off, luego de los eventos que ocurrieron inmediatamente después de Ground Zeroes, y que será un juego colaborativo y que se venderá a precio reducido puesto que es como especie de DLC o extensión de la experiencia total de TPP. Y sabes que? Tiene hasta todo el sentido del mundo, porque si ya terminaste TPP junto con todas las Side Ops, notaras que hay varias de estas que te mandan a rescatar a “los soldados deambulantes de la base madre” y cuando tu vas a rescatarlos como se comportan? SON UNOS ZOMBIES!"}, {"465f": "Así que deja de quejarte cada vez que hay un tráiler de un juego perteneciente a una saga que amas, y que no te pasa por la garganta a la primera, dale chance, es solo un tráiler, aun no lo juegas; no tiene sentido decir que MG Survive será como el Umbrela Corps de Konami porque sencillamente aun no tienes bases para eso. Lo que tienes ahora es el ego herido al creer que dañaron la saga MGS pero resulta que el mismo creador nunca la respeto todo el tiempo que duro el desarrollo de TPP."}], "author": "Mauricio Rivero", "child": "1310_1", "name": "1310", "content": "Konami profanó la serie Metal Gear? En serio? La hipocresía, el amarillismo y toda clase de pasiones variopintas se han apoderado del medio de los videojuegos los últimos años, y mas aún cuando la internet dota de mayor poder de opinión al público en general. Ahora los publishers y los desarrolladores la tienen que pensar muy bien a la hora de presentar el último tráiler o adelanto en gameplay de su juego, y esto debido a que puede desatar una oleada de odio, discordia, negativismo y toda clase de comentarios negativos que encienden de manera muy furiosa la caja de comentarios de youtube, twitch, twitter y cualquier aplicación web social. Desde el segundo trimestre del 2015 se desató la polémica sobre la partida de Konami por parte de Hideo Kojima, y se le dice puntualmente polémica puesto que internet presentó este hecho como la violación mas profunda a los derechos humanos desde el holocausto nazi. Al haber despedido a Kojima, Konami fue blanco de todo el odio por parte de la comunidad gamer en todo el mundo (y mas aún de los fans), puesto que esto aseguraba no solo el fin de la saga, (que igual ya estaba aparentemente cerrada y terminada con MGSV), sino que nadie sabia a ciencia cierta que iba a pasar con lo que quedaba del desarrollo de MGSV y de los siguientes proyectos de Kojima como Sillent Hills y Zone of the Enders 3 (este último es el que mas me duele personalmente y nadie habla de el). Metal Gear Solid 5 salió, provoco todas las eyaculaciones habidas y por haber en todos los PS4, PS3, Xbox 360 y Xbox One que existen en el mundo, y las cosas mostraron el verdadero matiz que tenían conforme pasaba el tiempo a partir de ese septiembre 1 de 2016. Soy fan de Metal Gear Solid, los he jugado absolutamente todos y hasta los spin off como Metal Gear Rising y Portable Ops (porque según Kojima este juego ya no califica como canónico); y te puedo decir con autoridad de que aunque The Phantom Pain es un juego realmente excelente, con muchísimo contenido, mucho por hacer y muy divertido (honestamente MUY DIVERTIDO), no es realmente un Metal Gear Solid puesto que no cumplió con lo que se supone que tenia que pasar en términos de narrativa para cerrar la saga de la manera correcta y teniendo en cuenta todo lo que se había contado en los 6 juegos anteriores: Metal Gear Solid, Metal Gear Solid 2, Metal Gear Solid 3, Metal Gear Solid 4, Metal Gear Solid, Portable Ops, y Metal Gear Solid Peace Walker. En un post anterior escribí muy extensamente de lo que pudo ser y no fue MGSV, y no voy a ahondar tanto en este tema, de modo que te invito a que lo leas. Lo que si haré ahora de la manera mas breve posible, es decirte a ti que estas leyendo esto, y que muy probablemente piensas que Konami está profanando vulgarmente a la saga Metal Gear con el anuncio de un nuevo juego que lleva por nombre “Survive”, y que le realidad es que el mismo Kojima es el que profanó la saga Metal Gear Solid con The Phanton Pain. Si te sientes muy ofendido porque estoy hablando “mal” de tu macho alfa japonés, es mejor que dejes de leer ahora, porque seguiré hablando objetivamente (ósea mal, para los fans acérrimos de Kojima), y te daré mis argumentos (algunos especulaciones, otros muy objetivos u otros muy subjetivos) por los cuales pienso que el mismo creador de Metal Gear Solid fue el que se burló de su propia obra. Empezaré por darte una muy resumida reseña de lo que presentó cada juego en cuestión de la historia hasta Metal Gear Solid 5 TPP: Un tanque de guerra nuclear que camina en dos patas y que lanza misles nucleares invisibles al radar. WTF! 2. Metal Gear Solid 2: La continuación de la locura y mas confusa aun. operaciones encubiertas, mas nanomáquinas, ahora hay un tercer clon que era el presidente y por ende tiene cierto patriotismo, Inteligencia artificial, tecnologías de la información, hackers, otra vez filosofía existencial (lo que he aprendido culturalmente dicta quien soy?), otra unidad militar renegada con habilidades sobrehumanas (una inmortal suertuda, un vampiro también inmortal, un loco por las bombas en patines y un ex presidente muy molesto) y otro tanque bípedo nuclear que esta vez se construye en serie y por lo que debes destruirlos a todos (30) con tu lanza cohetes; y lo mejor, una conspiración llevada a cabo por un grupo de hombres súper poderosos que están por encima del gobierno y que terminan siendo una IA. Este juego es prácticamente una copia memética del anterior (muy brillante en términos de narrativa, de hecho el mejor a mi parecer). La batalla final de Raiden contra 30 unidades Metal Gear Ray, encima de Arsenal Gear… Sip otro Metal Gear 3. Metal Gear Solid 3: Ahora estamos en plena guerra fría y juegas con el soldado legendario del cual sacaron copias solo que en ese entonces era un novato con mucho potencial, espías, dobles, espías triples, tecnología emergente a partir de la segunda guerra mundial, una unidad militar legendaria con habilidades sobrehumanas que llevo al éxito de los aliados en la segunda guerra mundial (un domador de avispas, un mutante rana, un pirómano cosmonauta, y un anciano vegetal francotirador; todos al mando de la maestra del protagonista del juego), el inicio de la organización secreta súper poderosa, y otra vez un tanque bípedo (no tan bípedo) nuclear. Y por ultimo, mas filosofía existencial (el contexto histórico en el que vivo determina quien soy?). 4. Metal Gear Solid Portable Ops: El novato ya no es novato, es un experimentado y legendario soldado que lleva consigo mucho arrepentimiento por matar a su mentora, una base militar rusa dentro de Colombia, agentes dobles y triples, el inicio de personajes que luego se ven en MGS y MGS2, un cohete balístico nuclear con una cabeza robótica, una unidad militar con poderes sobrehumanos, y un loco que quiere pertenecer a la organización poderosa súper secreta a la fuerza. Portable Ops, el juego que según Kojima ya no es canónico y tiene mas personajes importantes que en Phantom Pain. Si o no Sigint? 5. Metal Gear Solid 4: ahora volvemos al futuro justo después del MGS2 (bueno 10 años después), y ahora hay mas ciencia ficción que nunca; vuelven las nanomáquinas, un sistema de información súper inteligente que lo controla todo, hasta lo que puedes sentir o no, lo que puedes disparar o no, o lo que puedes defecar o no. Una unidad militar con mucho stress post-traumático, y con trajes, prótesis de alta tecnología o exoesqueletos (ni idea), tu hermano clon se le mete a un espía por medio de su brazo y lo controla (WTF) y busca destruir para siempre a la organización súper poderosa secreta y que ya todos saben que es una IA; Ah y además, peleas a bordo del primer tanque nuclear bípedo para destruir al segundo tanque nuclear bípedo (pero ya no son 30). Vuelve la filosofía existencial (lo que siento determina quien soy?). En el futuro presentan la innovación de tanques bípedos erguidos en sus patas, que ya fueron creados en la guerra fria ¬¬ 6. Metal Gear Solid Peace Walker: Volvemos a la guerra fría donde se terminan los eventos de Portable Ops, y ahora el soldado legendario inicia una startup como compañía de mercenarios a sueldo con un soldado que conoció en las FARC de Colombia (……………). Hay un científico y una científica que están construyendo un robot cuadrúpedo (ahora si innovaron) y que tiene como cerebro una IA (en 1975) que lleva los pensamientos y sentimientos de la mentora del soldado legendario. Ahora no hay unidad militar renegada, pero si hay un grupo de robots gigantes guiados con la misma IA. Al final destruyen el cuadrúpedo y todos quedan felices en su base militar ubicada en las aguas de Costa Rica y que iniciaron en las playas de Barranquilla (cerca de mi casa). El par de emprendedores en el negocio de los ejercitos a sueldo o PMC como se llamarán en el futuro. Estas ideas de negocios! Uff!!! Sip este es mi jocoso resumen de la serie, y puede leerse loco y hasta chistoso, pero Hideo Kojima ha sabido contarla muy bien, con un pedigrí militar bastante creíble, enlaza muy bien eventos históricos con los fictícios (como la batalla de Bahía de Cochinos, la crisis e misiles en Cuba, la tensión entre Rusia y EU durante la guerra fría, la guerra del Golfo y la locura del /2K), y adicionalmente argumenta muy bien temas de filosofía existencial, ciencia ficción, y mucho porno de armas. Lo que se esperaba con Metal Gear Solid 5 (o al menos eso esperaba yo como fan de la serie), era que se contara como es que Big Boss realmente formó Outher Heaven, como Cypher dió forma a los Patriotas modernos convertidos en IA, como es que Sigint, Paramedic, Eva, Ocelot, Zero y Big Boss finalmente deciden como poner en marcha dicha IA y finalmente como es que Liquid Snake y Solid Snake son formados luego del nacimiento mediante el proyecto Les Enfant Terrible. El prologo, Metal Gear Solid V Ground Zeroes, a pesar de ser un juego muy pequeño (prácticamente un demo), tiene toda esa esencia de la serie, hay un background de la historia, que incluso se presenta con el hermoso arte de Yoji Shinkawa, hay escena cinemáticas excelentes, hay un enemigo psicótico que se ve bien malo, y hay un aura o ambiente de que todo se va a ir al demonio pronto. Y en realidad así es, todo se fue al demonio, pero en la vida real! Cuando llego el juego en Septiembre 1 de 2016 y me fui a la tienda a comprarlo DAY ONE y jugué la primera hora o mas bien las primeras 2 horas, todo iba súper bien, sin duda era Metal Gear Solid y las cosas pintaban bien, los personajes militares con poderes sobre humanos, los sucesos paranormales y todo el porno de armas y escenas cinemáticas bien logradas, todo aderezado con el poderoso Fox Engine (ya hablaré de este tema mas adelante). Pero luego, o sorpresa, pase 60 horas de juego donde me terminé la línea argumental principal, y no vi la unidad militar renegada, no vi ciencia ficción creíble o bien cimentada, no vi nada acerca de lo que quedó con Peace Walker y Portable Ops y que enlazara con Metal Gear Solid 1. Lo que vi en cambio es un festival de ideas experimentales con la narrativa, un virus que vuelve a los soldados en zombis si hablan determinado idioma, el malo de Ground Zeroes, no es tan malo y de hecho ni peleas con el, la unidad paranormal de la primera hora tampoco se enfrenta a ti, y el robot bípedo (que ahora es totalmente erguido) resulta ser demasiado avanzado como para que el Metal Gear Rex en el año 2010 represente toda una innovación el pleno siglo XXI. En resumidas cuentas, Kojima no cumplió, y no solo eso, sino que también ingreso tantas ideas locas inconclusas e incoherentes que prácticamente la internet pedía a gritos teorías que soportaran los fans mas acérrimos de la serie para poder concluir en nuestras propias cabezas lo que debía ser la serie. Esto, mis amigos, es algo realmente injusto. La serie Metal Gear Solid fue profanada desde el propio The Phantom Pain, y ahora me vienes a decir tu que te decepciono el tráiler de Metal Gear Survive? Que tiene Metal Gear Survive? Mother Base? También está en TPP Zombis? También están en TPP Agujeros negros? También están en TPP. Además!!! En TPP encuentras el brazo de Jehuty para que lo uses como prótesis para Big boss. Entonces? De que te estas quejando? Voy a tocar el tema ahora acerca de tu macho alfa, Hideo Kojima. Resulta que dices que Konami lo echo injustamente? Es así? Dime algo, si tu trabajas para una multinacional de cualquier producto que las masas consumen, tienes un puesto importante, es tu responsabilidad que los productos que vendan sean rentables para la empresa en términos de venta, y en determinado momento presentas un proyecto a tus jefes que lo argumentas como la panacea en el mercado y haces gastar muchísimo dinero (mas de la cuenta) a la empresa y que luego resulta que no se puede recuperar, como crees que reaccionaran tus jefes? TE ECHAN! Como vas a despilfarrar tanto dinero en un producto que no va a colmar las expectativas o que de plano, no va a vender lo suficiente como para recuperar la inversión? Eso paso precisamente con Kojima. Este sujeto es prácticamente una diva, un rockstar, si tu lo sigues en twitter notarás que se la pasa todo el día posteando lo que come, lo que bebe, con que estrella de cine lo hace y en donde anda viajando; en que momento trabaja? Hay que tener mucho cuidado de adular tanto a una persona que le encanta figurar…. Hasta en las tapas de los juegos. No me mal interpretes ni te lo tomes a mal, el tipo tiene derecho, y la reputación que tiene como maestro en el diseño de videojuegos se la tiene bien ganada, pero hey, si tu desangras el presupuesto de tu empresa y todo tiene que llevar tu nombre para inflar tu ego y cotizarte mas artificialmente, eso honestamente no se ve tan bien. Miyamoto tiene el mismo renombre (o hasta mas) que Kojima, del mismo modo que lo tiene Notch, Kamiya, Jeff Bleskinski, Neil Druckman, Kelle Santiago, Jenova Chen y otros. Quien sabe que exigencias tenia Hideo en Konami que simplemente la burbuja estalló y lo pusieron de patitas en la calle. Y la realidad dicta (aunque te duela) que la serie Metal Gear no vende lo que vende GTA, o Call of Duty, o FIFA. El que tu lo compres, ames la saga, y realmente sean buenos videojuegos no quiere decir que sean comercialmente exitosos (Wii U estas ahí?). Kojima lideró el desarrollo de Fox Engine durante 2 años, y luego se gasto otros 3 liderando el desarrollo de TPP cuanto dinero crees que eso le costó a Konami en recursos humanos, software y demás, eso sin mencionar de que la música la hizo Harry Gregson Williams, y la voz de Big Boss ahora corría por parte de Kieffer Sutherland, que para quienes no lo conozcan no es otro mas que Jack Bauer en la serie 24; por cierto porque será que David Hayter habla tan mal de Kojima luego de estos sucesos? Será solamente porque le quito el papel luego de que este lo tuviera durante tanto tiempo (18 años muchachos, que no es poco). Entonces dime, realmente el malo es Konami? Pero volvamos a Metal Gear Survive, merece tanto odio? Si aun no ha salido! Como juego quizá sea excelente, y estoy seguro que así sea, porque el mismo equipo que diseño y desarrollo TPP está detrás otra vez, exceptuando claro está, a su padre y al director de arte de cabecera Shinkawa. Todo este post no es promoviendo el odio hacia Kojima ni dejando a Konami como un ángel, esta empresa también obró mal al hacer cero control de daños al momento de cancelar dos proyectos importantes, pero hay que entender que para ellos todo se traduce en plata, y para nosotros todo se traduce en juegos que cumplan y sobrepasen nuestras expectativas. Pero quiero que pongas las cosas en perspectiva y con cabeza fría pienses, realmente Konami profanó y destruyó la saga Metal Gear con un juego que sigue las mismas directrices artísticas y narrativas, y las mismas ideas locas que el mismo Kojima planteo en TPP? Oye, como Hideo va a decir que Portable Ops ya no es canónico, solo porque el no dirigió el juego y porque los eventos contados en este juego no se engranan perfectamente con las locuras que tenia pendientes para TPP? Eso en sí es una burla. Y ya que comento eso de que el no dirigió Portable Ops, resulta que uno de los Metal Gear mas memorables que existen, no lo dirigió completamente Hideo, y este es: Metal Gear Solid 3 Snake Eater; además de claro Portable Ops y Rising. Entonces? Konami profano y destruyó la saga? La excusa de que a Kojima no le dieron tiempo de terminar el desarrollo de TPP tampoco es válida, porque como te comento, como juego es muy excelente, de hecho raya en la perfección, pero el error y el pecado de TPP es que simplemente es un buen juego mas no un MGS, y esto es un problema mas de narrativa y de concepto mas que de desarrollo, y eso ya venía establecido por el mismo Kojima desde el momento en que empezó a escribir el guión, y eso es en etapa de planeación y diseño, no de desarrollo. Es mas, sabes lo que creó? Que al mediano y/o largo plazo, Konami puede reiniciar la serie y darle un mucho mejor enfoque que el que estableció Kojima con TPP. Esta dicho por Konami oficialmente que el juego es un spin off, luego de los eventos que ocurrieron inmediatamente después de Ground Zeroes, y que será un juego colaborativo y que se venderá a precio reducido puesto que es como especie de DLC o extensión de la experiencia total de TPP. Y sabes que? Tiene hasta todo el sentido del mundo, porque si ya terminaste TPP junto con todas las Side Ops, notaras que hay varias de estas que te mandan a rescatar a “los soldados deambulantes de la base madre” y cuando tu vas a rescatarlos como se comportan? SON UNOS ZOMBIES! Así que deja de quejarte cada vez que hay un tráiler de un juego perteneciente a una saga que amas, y que no te pasa por la garganta a la primera, dale chance, es solo un tráiler, aun no lo juegas; no tiene sentido decir que MG Survive será como el Umbrela Corps de Konami porque sencillamente aun no tienes bases para eso. Lo que tienes ahora es el ego herido al creer que dañaron la saga MGS pero resulta que el mismo creador nunca la respeto todo el tiempo que duro el desarrollo de TPP. "}