{"parent": "", "timestamp": "Nov 29, 2016", "title": "Yo robé los planos de la Death Star hace 20 años", "sentences": [{"7866": "Yo robé los planos de la Death Star hace 20 años"}, {"4244": "Un sentido recuento de “Dark Forces” y aquellos maravillosos años de los videojuegos de Star Wars"}, {"5134": "Star Wars: Dark Forces fue el First Person Shooter más innovador de su época. La referencia directa de un FPS en los noventa quizá sea Doom, pero la lista de elementos de juego que introdujo SWDF es fenomenal: la inserción de cutscenes entre niveles, la habilidad de ver hacia arriba y abajo, agacharse, nadar y utilizar goggles de night vision, así como lanzar granadas y crear estrategias con armas de distintas características. Dark Forces se lanzó para PC en 1995, pero no fue sino hasta un 30 de noviembre de 1996 que llegó al Sony PlayStation. O sea, que cayó en mis manos."}, {"7223": "Bueno, no fue exactamente hace veinte años que robé los planos de la Death Star. Seguramente lo hice en algún momento de 1997, pero sonaba bien para el título, qué quieren."}, {"3ac7": "Kyle Katarn, el mercenario y personaje legendario del universo expandido de Star Wars, se presentaba en el primer nivel de SWDF como el encargado de llevar a cabo una acción de alto octanaje, que a la postre resultaría ser… el robo de los planos de la primera Estrella de la Muerte (lo hizo en un planeta olvidado de nombre Danuta, en una misión olvidada de nombre “Operation Skyhook”)."}, {"1785": "(Después sabríamos que el robo de Katarn fue solo parcial, y otros agentes rebeldes hurtaron planos de la Death Star para crear el esquema completo que vimos en A New Hope, pero esa ñoñería no viene al caso con este post)."}, {"3a05": "Dos décadas después: Disney se deshace, por una estrategia de “alinear el canon”, de la noción de que Kyle Katarn fue el mercenario responsable en primera instancia de aquel triunfo de la Alianza Rebelde, y hoy ha actualizado uno de los mitos originales de Star Wars en manos de un escuadrón que, veremos en Rogue One, es el encargado de robar los planos de la Death Star."}, {"3653": "No hay señales de Kyle Katarn en este nuevo filme. ¿Quizá un cameo? No lo sé."}, {"d0d4": "No, el personaje de Diego Luna en Rogue One no es Kyle Katarn (izquierda), fans."}, {"da32": "De vuelta en 1996 o 1997, Kyle Katarn se nos mostraba solo como un par de guantes que, en la mira de primera persona y con adorables escenarios pixelados, nos permitía, al menos por vez primera en mi caso, disparar blasters de Stormtroopers, aniquilar oficiales imperiales y visitar planetas que solo había visto en películas o leído en los libros."}, {"435b": "La música de SWDF era inefablemente electrónica, retacada de “ruiditos” como de 8 bits, pero nada intrusivos, sobre todo porque se trataba de interpretaciones del score del venerable John Williams. Los efectos de sonido eran hermosos: los rayos láser sonaban perfectamente idénticos a los de los filmes, y la inclusión de elementos secundarios de estos, como los Probots de Empire o los Dianoga de A New Hope era, pfff, maravilloso."}, {"85a8": "Uno de los niveles sucedía en un planeta del sistema Anoat, el cual se encuentra localizado entre Hoth y Bespin, y que era una especie de mundo-coladera:"}, {"e051": "La acción era precisa; los acertijos, bastante simples. Para triunfar había que saber combinar armas y dominar el timing entre enemigos. Por supuesto, hay que tener en cuenta que SWDF para el PlayStation era solo un puerto de un FPS de 1995, género que para fines de 1997 sería brutalmente revolucionado por una joya llamada GoldenEye 007 del N64."}, {"edc4": "Pero aunque también amé GoldenEye, les voy a decir por qué Dark Forces guarda un lugar especial en mi corazón."}, {"9e6e": "El momento en el que Kyle Katarn descubre los planos de la Death Star. Súper lol."}, {"d30c": "Creo que tiene que ver con la cantidad de referencias a los filmes originales. Sí, SWDF era en esencia un producto del universo expandido con mafufadas nuevas como los Dark Troopers (cuyo hallazgo es el objetivo final del juego) o el pedorrísimo general Rom Mohc (no mamen con el nombre), pero también podíamos encontrar a viejos conocidos como el siempre peinado Crix Madine, los Trandoshan, la especie reptiliana a la que pertenece Bossk, o a los Gran, la especie triocular a la que pertenece Ree-Yees. ¡También peleabas con Boba Fett, y de repente te veías en la nave de Jabba (en un nivel que era sorprendentemente largo y divertido)! También incluia algunos easter eggs: podías convertir tu mapa en la silueta de Sam del videojuego Sam & Max, y en otro momento y con ayuda de algunos cheat codes, hallar a un ewok escondido en una pared y chamuscarle la cara a blasterazos."}, {"f52b": "Este el ewok al que le partías su mandarina en gajos adentro de Dark Forces."}, {"edd7": "Dark Forces en el PlayStation estaba lejos de ser perfecto: la narrativa ni la trama eran las mejores (por ejemplo, aunque era genial subirse a la nave de Jabba, para efectos de la historia era una estupidez que sobraba por completo), e incluso recuerdo que, si bien no estaba plagado de bugs, sí contaba con algunos errores que provocaban que te quedaras atorado de vez en vez en sitios. Para colmo, al compararlo con los FPS que llegarían poco tiempo después al N64 o al PS2, los gráficos de SWDF se volvieron una cosa vintage muy rápidamente. Es probable, pues, que mi amor pro SWDF venga del simple hecho de que en aquel momento era algo nuevo de Star Wars —porque en 1996 o 1997, créanme, no había muchas cosas nuevas de Star Wars en el mundo."}, {"c67b": "No: hace exactamente veinte años solo podíamos aspirar a leer la Thrawn Trilogy (que comenzó con Heir to the Empire de Timothy Zahn en 1991) o pachequeces del tipo Dark Empire (cómics de Dark Horse que corrieron de 1991 a 1995, y que en México eran MUY difíciles de conseguir). Vector Prime, la muy maravillosa novela de R.A. Salvatore que inauguró la invasión de los Yuuzhan Vong a la galaxia y abrió los horizontes de SW de múltiples maneras, no llegaría sino hasta 1999. Mismo año en el que se estrenó La amenaza fantasma."}, {"e913": "Pero esa es otra historia."}, {"ac57": "Aquí un cutscene de Rebel Assault II. Por si tienen estómago para ver algo horrible de Star Wars."}, {"bf21": "Para 1996 ya habíamos pasado por la etapa dogfighting de LucasArts: títulos como X-Wing y Tie Fighter, que no eran realmente… buenos juegos. Rebel Assault II, en la edición especial para PlayStation, era una cosa espectacular que combinaba gráficos de computadora con video producido especialmente para el título. Esperen, ¿dije espectacular? En realidad Rebel Assault II era un videojuego horriblemente aburrido. Y ñoño. Los cutscenes eran de lo más teto."}, {"03d8": "Siento que todo eso cambió con Dark Forces. Era un shooter, ¡andabas a pie, no arriba de una impersonal Y-Wing! Era lo suficientemente bueno y envolvente como para hacerte sentir en el universo Star Wars."}, {"9248": "Y daría paso a tiempos mejores. Con el N64 llegaron tres videojuegos maravillosos: Shadows of the Empire (1997), un sueño húmedo de fanboy que con tan solo saber de su existencia me hizo correr compulsivamente a comprarme una de las nuevas consolas de Nintendo, Rogue Squadron (1998) el (ahora sí) perfeccionado juego de combate aéreo de LucasArts y Star Wars: Racer (1999), un adictivo título de carreras de pods basado en la escena climática del Episodio I, pero con toneladas extra de pistas para correr."}, {"0b5e": "La segunda mitad de los noventa fueron tan generosos para los fans. Fueron momentos emocionantes, en los que la expectativa por el retorno de Star Wars a los cines era gigantesca, y Lucasfilm y sus filiales nos llenaron de juegos interactivos, nuevas líneas de figuras de acción, libros y cómics."}, {"1f0d": "Por supuesto, me siento agradecido y emocionado por poder ver este nuevo Rogue One ahora en cines. Mis expectativas son amplias. Sin embargo, debo confesar que no me siento ni la mitad de emocionado o hypeado en comparación con los noventa. Sí: quiero ver cómo roban los planos de la Death Star, pero de alguna forma es una historia que ya viví."}, {"9d8b": "No lo sé. Quizá es que siempre seré Team Kyle Katarn."}, {"bead": "Ruy comparte contenido en Twitter, Facebook e Instagram:"}, {"23ce": "Ruy Xoconostle (@Ruys) | TwitterThe latest Tweets from Ruy Xoconostle (@Ruys). Escribo libros: algunos son de ciencia ficción, otros de gente suburbana…twitter.com"}, {"7e67": "Ruy Xoconostle W. (@ruys) * Instagram photos and videosEscribo libros: algunos son de ciencia ficción, otros de gente suburbana neurótica * Head of Editorial & Content en Ma…www.instagram.com"}], "author": "Ruy Xoconostle", "child": "1313_1\t1313_2\t1313_31313_1\t1313_2\t1313_3", "name": "1313", "content": "Yo robé los planos de la Death Star hace 20 años Un sentido recuento de “Dark Forces” y aquellos maravillosos años de los videojuegos de Star Wars Star Wars: Dark Forces fue el First Person Shooter más innovador de su época. La referencia directa de un FPS en los noventa quizá sea Doom, pero la lista de elementos de juego que introdujo SWDF es fenomenal: la inserción de cutscenes entre niveles, la habilidad de ver hacia arriba y abajo, agacharse, nadar y utilizar goggles de night vision, así como lanzar granadas y crear estrategias con armas de distintas características. Dark Forces se lanzó para PC en 1995, pero no fue sino hasta un 30 de noviembre de 1996 que llegó al Sony PlayStation. O sea, que cayó en mis manos. Bueno, no fue exactamente hace veinte años que robé los planos de la Death Star. Seguramente lo hice en algún momento de 1997, pero sonaba bien para el título, qué quieren. Kyle Katarn, el mercenario y personaje legendario del universo expandido de Star Wars, se presentaba en el primer nivel de SWDF como el encargado de llevar a cabo una acción de alto octanaje, que a la postre resultaría ser… el robo de los planos de la primera Estrella de la Muerte (lo hizo en un planeta olvidado de nombre Danuta, en una misión olvidada de nombre “Operation Skyhook”). (Después sabríamos que el robo de Katarn fue solo parcial, y otros agentes rebeldes hurtaron planos de la Death Star para crear el esquema completo que vimos en A New Hope, pero esa ñoñería no viene al caso con este post). Dos décadas después: Disney se deshace, por una estrategia de “alinear el canon”, de la noción de que Kyle Katarn fue el mercenario responsable en primera instancia de aquel triunfo de la Alianza Rebelde, y hoy ha actualizado uno de los mitos originales de Star Wars en manos de un escuadrón que, veremos en Rogue One, es el encargado de robar los planos de la Death Star. No hay señales de Kyle Katarn en este nuevo filme. ¿Quizá un cameo? No lo sé. No, el personaje de Diego Luna en Rogue One no es Kyle Katarn (izquierda), fans. De vuelta en 1996 o 1997, Kyle Katarn se nos mostraba solo como un par de guantes que, en la mira de primera persona y con adorables escenarios pixelados, nos permitía, al menos por vez primera en mi caso, disparar blasters de Stormtroopers, aniquilar oficiales imperiales y visitar planetas que solo había visto en películas o leído en los libros. La música de SWDF era inefablemente electrónica, retacada de “ruiditos” como de 8 bits, pero nada intrusivos, sobre todo porque se trataba de interpretaciones del score del venerable John Williams. Los efectos de sonido eran hermosos: los rayos láser sonaban perfectamente idénticos a los de los filmes, y la inclusión de elementos secundarios de estos, como los Probots de Empire o los Dianoga de A New Hope era, pfff, maravilloso. Uno de los niveles sucedía en un planeta del sistema Anoat, el cual se encuentra localizado entre Hoth y Bespin, y que era una especie de mundo-coladera: La acción era precisa; los acertijos, bastante simples. Para triunfar había que saber combinar armas y dominar el timing entre enemigos. Por supuesto, hay que tener en cuenta que SWDF para el PlayStation era solo un puerto de un FPS de 1995, género que para fines de 1997 sería brutalmente revolucionado por una joya llamada GoldenEye 007 del N64. Pero aunque también amé GoldenEye, les voy a decir por qué Dark Forces guarda un lugar especial en mi corazón. El momento en el que Kyle Katarn descubre los planos de la Death Star. Súper lol. Creo que tiene que ver con la cantidad de referencias a los filmes originales. Sí, SWDF era en esencia un producto del universo expandido con mafufadas nuevas como los Dark Troopers (cuyo hallazgo es el objetivo final del juego) o el pedorrísimo general Rom Mohc (no mamen con el nombre), pero también podíamos encontrar a viejos conocidos como el siempre peinado Crix Madine, los Trandoshan, la especie reptiliana a la que pertenece Bossk, o a los Gran, la especie triocular a la que pertenece Ree-Yees. ¡También peleabas con Boba Fett, y de repente te veías en la nave de Jabba (en un nivel que era sorprendentemente largo y divertido)! También incluia algunos easter eggs: podías convertir tu mapa en la silueta de Sam del videojuego Sam & Max, y en otro momento y con ayuda de algunos cheat codes, hallar a un ewok escondido en una pared y chamuscarle la cara a blasterazos. Este el ewok al que le partías su mandarina en gajos adentro de Dark Forces. Dark Forces en el PlayStation estaba lejos de ser perfecto: la narrativa ni la trama eran las mejores (por ejemplo, aunque era genial subirse a la nave de Jabba, para efectos de la historia era una estupidez que sobraba por completo), e incluso recuerdo que, si bien no estaba plagado de bugs, sí contaba con algunos errores que provocaban que te quedaras atorado de vez en vez en sitios. Para colmo, al compararlo con los FPS que llegarían poco tiempo después al N64 o al PS2, los gráficos de SWDF se volvieron una cosa vintage muy rápidamente. Es probable, pues, que mi amor pro SWDF venga del simple hecho de que en aquel momento era algo nuevo de Star Wars —porque en 1996 o 1997, créanme, no había muchas cosas nuevas de Star Wars en el mundo. No: hace exactamente veinte años solo podíamos aspirar a leer la Thrawn Trilogy (que comenzó con Heir to the Empire de Timothy Zahn en 1991) o pachequeces del tipo Dark Empire (cómics de Dark Horse que corrieron de 1991 a 1995, y que en México eran MUY difíciles de conseguir). Vector Prime, la muy maravillosa novela de R.A. Salvatore que inauguró la invasión de los Yuuzhan Vong a la galaxia y abrió los horizontes de SW de múltiples maneras, no llegaría sino hasta 1999. Mismo año en el que se estrenó La amenaza fantasma. Pero esa es otra historia. Aquí un cutscene de Rebel Assault II. Por si tienen estómago para ver algo horrible de Star Wars. Para 1996 ya habíamos pasado por la etapa dogfighting de LucasArts: títulos como X-Wing y Tie Fighter, que no eran realmente… buenos juegos. Rebel Assault II, en la edición especial para PlayStation, era una cosa espectacular que combinaba gráficos de computadora con video producido especialmente para el título. Esperen, ¿dije espectacular? En realidad Rebel Assault II era un videojuego horriblemente aburrido. Y ñoño. Los cutscenes eran de lo más teto. Siento que todo eso cambió con Dark Forces. Era un shooter, ¡andabas a pie, no arriba de una impersonal Y-Wing! Era lo suficientemente bueno y envolvente como para hacerte sentir en el universo Star Wars. Y daría paso a tiempos mejores. Con el N64 llegaron tres videojuegos maravillosos: Shadows of the Empire (1997), un sueño húmedo de fanboy que con tan solo saber de su existencia me hizo correr compulsivamente a comprarme una de las nuevas consolas de Nintendo, Rogue Squadron (1998) el (ahora sí) perfeccionado juego de combate aéreo de LucasArts y Star Wars: Racer (1999), un adictivo título de carreras de pods basado en la escena climática del Episodio I, pero con toneladas extra de pistas para correr. La segunda mitad de los noventa fueron tan generosos para los fans. Fueron momentos emocionantes, en los que la expectativa por el retorno de Star Wars a los cines era gigantesca, y Lucasfilm y sus filiales nos llenaron de juegos interactivos, nuevas líneas de figuras de acción, libros y cómics. Por supuesto, me siento agradecido y emocionado por poder ver este nuevo Rogue One ahora en cines. Mis expectativas son amplias. Sin embargo, debo confesar que no me siento ni la mitad de emocionado o hypeado en comparación con los noventa. Sí: quiero ver cómo roban los planos de la Death Star, pero de alguna forma es una historia que ya viví. No lo sé. Quizá es que siempre seré Team Kyle Katarn. Ruy comparte contenido en Twitter, Facebook e Instagram: Ruy Xoconostle (@Ruys) | TwitterThe latest Tweets from Ruy Xoconostle (@Ruys). Escribo libros: algunos son de ciencia ficción, otros de gente suburbana…twitter.com Ruy Xoconostle W. (@ruys) * Instagram photos and videosEscribo libros: algunos son de ciencia ficción, otros de gente suburbana neurótica * Head of Editorial & Content en Ma…www.instagram.com "}