{"parent": "", "timestamp": "Jan 30, 2016", "title": "How I Became Addicted to a Farming Simulation Game from the Year 2000", "sentences": [{"21ae": "How I Became Addicted to a Farming Simulation Game from the Year 2000"}, {"3fc4": "Fifteen years ago, Natsume quietly released one of the best entries in its long-running Harvest Moon franchise. But can a farming simulator this good re-emerge in the current industry landscape and be considered a truly great game?"}, {"29e0": "What, exactly, makes a video game a ‘classic’? Is it an enduring impression left on the genre by massively successful franchises such as Super Mario Bros., Final Fantasy or the Legend of Zelda? Must games invent refreshing approaches to a medium that often finds itself mired in predictable (and thus, bankable) formulas? To become a classic, must a company impress players with deft storytelling, cinematic panache and literary ambitions? Or are there just various, nebulous combinations of these qualities which, ramshackle, ensure a video game’s entry into the canon of time-honored, enduring titles? In light of a recent replay of an old entry in the now-twenty-year old simulation franchise Harvest Moon, I asked myself: Does this deceptively addictive video game have the stuff to be reconsidered a standalone classic?"}, {"204b": "What’s Hampering It"}, {"8cf9": "Released in 1999 in Japan and 2000 in North America, Harvest Moon: Back to Nature is the sixth installment in the Harvest Moon series, now re-branded as Story of Seasons. It is the only Harvest Moon game to be released on the original PlayStation platform, disregarding a female companion title only released in Japan (later re-released in the US as part of a bundle in 2007 for PSP), and it marks the first release outside of its native Nintendo platform. Back to Nature, essentially a tweaked port of the 1999 Nintendo 64 title Harvest Moon 64, holds one of the series’ highest scores on Metacritic, and is considered overall to be among the best entries in the twenty-year-old franchise by critics and gamers. In North America, it sold 110,000 copies; globally, 320,000."}, {"e1a0": "While those aren’t the worst numbers for the era, consider that on one end of the field, contemporary heavyweights Final Fantasy IX and Perfect Dark sold a whopping 5.3 million and 2.5 million copies worldwide, respectively. Playfully inventive niche titles, such as the tragically Japanese Incredible Crisis (a paltry 400,000 copies globally), sold close to Back to Nature’s figures. Even an entry in the well-established, popular Tomb Raider franchise (Tomb Raider Chronicles) sold just above half a million copies worldwide. To put these numbers into perspective, consider that Call of Duty: Black Ops 3 has currently sold over ten million copies around the globe."}, {"b14a": "My gut tells me Back to Nature had more than a few obstacles frustrating its U.S. publication, chief among them being the misfortune of Sony’s tremendously exciting North American debut of the PlayStation 2 in October of 2000, a month before Nature’s November release date. Although Sony continued production of the PlayStation console (under its new moniker, PSOne) until 2005, the number of titles published for the platform dropped significantly after 2001; it’s difficult to determine exact numbers, but it appears less than twenty titles were published for the PlayStation in 2003 alone. Back to Nature was haplessly riding its dying platform’s wave into technological obsolescence."}, {"74d9": "Who would drop $40 on the sixth title in a game series that basically asks you to endlessly repeat chores you’d be loathe to do in your own life?"}, {"4aea": "Back to Nature didn’t exactly wow in the graphics department, either, cribbing Igusa Mastsuyama’s cutsie chibi aesthetic introduced in Harvest Moon 64 and essentially remixing many of that game’s characters and elements, updating and streamlining the design and features in the process. There does exist disagreement over which title is superior. Although Back to Nature looks and feels much lighter and more efficient than its N64 predecessor/older sibling, it offers little visual stimulation in comparison to other titles in a medium just beginning to narrow its focus on the formal evolution of realistic computer graphics."}, {"8878": "Back to Nature in no way made use of the PlayStation’s visual capabilities, opting to mostly recycle the limited vocabulary of the 1999 Nintendo 64 iteration at a cultural moment in gaming when one of the most exciting new titles of the sixth generation was the (at the time) ultra-realistic Gran Turismo 2."}, {"17dc": "Also: It’s a farming simulator. Assuming that, in 2000, new PlayStation games were commanding something like $40 a pop ($55 now, adjusted for inflation), who would drop that kind of dough on the sixth title in a game series that basically asks you to endlessly repeat chores you’d be loathe to do in your own life?"}, {"ccd7": "The Game Itself: A Re-View"}, {"1c38": "Back to Nature is sublimely addictive, if only because it both subverts and confirms expectations for a game in its genre. Foremost, it is a solid development of the formula set in place by the original Harvest Moon (SNES, 1996) and refined by Harvest Moon 64. The premise of the game is simple: You return to the farm a decade after spending summers there as a young boy freely roaming about whilst your grandfather toils endlessly. The farm has fallen into disrepair, and the Mayor informs you that the townsfolk have allowed you three years to return the homestead to its former glory, otherwise you’ll be asked to leave."}, {"9929": "‘Harvest Moon’ is a series of games about waiting. It’s about systemic tactics, planning, and financial smarts."}, {"76dd": "The empty farm you inherit is ravaged by years of neglect, covered in weeds, stones and branches. Slowly you uncover a field where you can, piece by piece, till some of the soil to begin planting and watering your crops. If you’re wise, you’ll plant a mix of time-sucking re-harvestables with the quicker, single-harvest crops. (Ex: In Summer, mixing a few plots of Corn and Tomatoes with larger plots of Turnips.) Slowly, you accrue cash, enhance your primary tools (hoe, watering can, hammer, etc.), and expand your planting acreage. Your neighbor Barley from Yodel Ranch gives you a horse to take care of. There’s an opportunity to Chicken sit. If you’re diligent and thoughtful with your money, much of the game’s obstacles can be cleared away by the end of the first year, including nearly all of the housing expansions."}, {"b519": "Harvest Moon, after all, is a series of games about waiting. It’s about systemic tactics, planning, and financial smarts. Although it may not be on the level of more modern installments of the Sim City franchise, it nonetheless requires players make decisions which might forestall instant gratification for a much more beneficial reward in the near (and sometimes far) future. Particularly in the first year, time management becomes a crucial evil — there’s only so much time in the day to water and harvest plants, all while remaining below your stamina cut-off point (which can be raised). You are still required to attend festivals and town events, and interact with the townspeople on at least a semi-daily basis if you want to ingratiate yourself with subjects who will eventually decide whether you stay or not. You have to balance maximum profitability with maintaining a comfortable social life, a problem which still has yet to be solved."}, {"efe9": "It’s precisely this nature of the game that had me convinced I’d grow bored of it quickly. I picked it up because I’d recently come into possession of a copy and, serendipitously, an enormous world-historic blizzard was rallying to batter the east coast."}, {"654e": "I popped in Back to Nature out of nostalgia for an earlier time when I could spend snow days burning my eyeballs out of the sockets staring at a TV in the dark for hours; I did not expect to repeat this behavior. But it’s the wait-and-see philosophy of the game which fosters its addictive nature — “I’ll just play one more day, until the barn is finished.” I actually said that to myself. The first day I played the game, I marathoned nearly non-stop from 5pm until 7am the next morning. I neglected to eat (which is a positive, seeing as eating is all I do now), and I staved off bathroom breaks because I just needed to harvest those last few ears of corn before Zach swooped in mercilessly at five to collect my produce and pay me for my handsome effort."}, {"d08e": "And then it’s on to the next day, and the day after that, until the next season begins anew and you’re forced to readjust. Before you know it, you’re down a timeless hole of harvesting crops, feeding the chickens, brushing the sheep and horse, watering the crops, picking up that jewelry at the blacksmith you ordered three days ago, gathering wild mushrooms in the woods (because they are so outrageously expensive), splitting stumps to gather lumber for that next housing addition you’ve set your eyes on, and maybe — if there’s time left — tracking down the special someone you’re attempting to woo and gifting her a flower (or something more precious)."}, {"5777": "You create a routine, and you do whatever you can not to deviate from it, otherwise decrepitude sneaks in. You pray for rain so you might find time to relax in-game just once; and when it does rain, you make sure not to waste the day."}, {"ba13": "Find out which woman truly vibes with your inner feminine spirit, pick her to be your lawfully wedded beard, and then live out your days presenting Gotz with flowers."}, {"1ebc": "Marriage is, perhaps, the longest-range goal in the game. You are tasked to decide on a girl, woo her by presenting her with gifts, remember her birthday, and talk to her wherever and whenever you see her to remind her that, yes, you exist, and the other guy already elbowing his way in is unwelcome here."}, {"dccb": "Like most video games, it’s aggressively heterosexual to a fault."}, {"0fa2": "The player has five girls to choose from — the tomboyish, relatively assertive Ann who lives at the Inn; prissy, inane flower girl Popuri who lives next door at the chicken farm under the patriarchal watch of her asshole older brother, Rick; quiet, mousey Mary, the girl who works at the library, blushes constantly, and never fails to remind you her father is the one who wrote all those books in the library (which was built to house them, mind you); polite, career-conscious Elli, whose extraordinarily boundary-pushing notions of desiring to work challenges the doctor’s narrow worldview; and Karen, the sexy lush with bleach blonde bangs, courtesy of the year 1999."}, {"d29f": "If you’re a gay man like me, this feature of the game presents marriage as a frustrating obstacle. Clearly, the goal is to find out which woman truly vibes with your inner feminine spirit (are you more of a Tina Fey or an Amy Poehler?), pick her to be your lawfully wedded beard, and then live out the rest of your days presenting the lonely contractor Gotz with flowers and jewelry, only to be rewarded with either blank Oh, Thank Yous or vague offense at suggesting you’re into him."}, {"e82f": "Coincidentally, the issue of same-sex attraction has been brought up by the developers of the Harvest Moon franchise in recently, suggesting it’s a concept that has crossed their minds. Until then, women and gay men may at least play the ‘female version’ of the game, made available in English in 2007, featuring a protagonist who desires an Eat Pray Love-style return to simplicity after she meets an anonymous poet aboard a cruise ship which subsequently sinks, leaving her beached on the shores of Mineral Town, suffering amnesia — clearly the perfect candidate for running a dilapidated farm. (Sadly, Gotz is still not eligible.)"}, {"12f1": "Back to Nature is a formulaic game; formula reigns king in this land. That formula, and how the developers have tweaked it, are necessarily the draw for a simulation franchise based on agriculture. Nature’s spin on it happens to be the best due to several factors, including the complexity of that formula and the appropriateness of the game’s aesthetics. This is a game whose look and feel are remarkably integral to the overall gaming experience and not merely a trivial feature of it. Games, for the most part, are experienced visually — the rest is audio and the feel of the controls. In his recent article for Gamasutra, Christian Nutt surveys the difficulties facing an updated remake of the beloved RPG classic Final Fantasy VII, noting the issue of recreating Cloud Strife’s humorous cross-dressing challenge:"}, {"9768": "…Is a scene like that even possible in a modern retelling? I don’t mean because it’s out-of-step with today’s social mores (though this is, of course, significant.) I mean it in the sense that the original game’s theatrical style and comic spirit seems most likely to be jettisoned in an attempt to make a more photorealistic game, and to live up to the series’ current-day, self-serious image."}, {"a334": "Although Nutt hints at it (and goes on to discuss the importance of the game’s now-primitive 3D graphics to its overall experience), he never directly explores the implications of this problem: If that game’s humor is what he’s so afraid will be missing in the remake, does photorealism play a larger role in that conundrum? Much of that game’s comedy and heart came from the limits its basic polygonal characters and blue-window, text-based dialogue required be projected onto them. In some ways, it’s a similar argument to the one teachers usually offer their students: Reading is great because you can use your imagination. Just follow the on-page instructions and you can project your own inventions onto the rest of the text. In their quest to hand everything players, contemporary video games sometimes rob their audience of this component. We hear characters’ voices and see them perfectly rendered. There’s little room for the fantasy portion."}, {"db55": "Top: ‘Magical Melody’, Bottom: ‘A Wonderful Life’"}, {"65b9": "Many franchises have benefitted from the gradual freedom from hardware restrictions, the greatest example being the Metal Gear series, which has always lead in the (sometimes too ambitious) cinematic thread of gaming. Photorealism, though, is not analogous to a totally immersive experience. For a game that strives to offer open-world, thrilling espionage, the difficulty and scope of a game like Metal Gear Solid V: The Phantom Pain seems positively correlated to the realism of it’s visual presentation. Those two elements compliment each other well, which makes sense for a gaming series that has always prized reality-based storytelling. To what degree does a farming simulator need to imitate reality? It’s questionable that, even considering it’s most recent installments, the Harvest Moon franchise would ever need to imitate reality. It’s formula simplifies farming to it’s most basic notions — plant, water, harvest, feed the animals, make sure nobody in town hates you, and make money. That simplification is the formula’s draw, and it’s hard to imagine a platform like the PlayStation 4 hosting a title that claims to give players the most realistic farming experience imaginable."}, {"e4aa": "Are titles in a franchise shadows on the wall of Plato’s proverbial cave, suggesting an ideal form of the game exists developers are attempting to create?"}, {"e0ad": "The aesthetic engine of the game, then, is relatively perfected. After the release of Back to Nature, the Harvest Moon series quickly veered into slightly less cartoonish depictions in titles such as Save the Homeland and A Wonderful Life, featuring characters who look like stunted teenagers and environments rendered with overzealous detail. The pared down, childish aesthetic was reclaimed both in most of the series’ later handheld titles as well as 2005’s Wii/Gamecube title Magical Melody, which slaughters it in an obvious attempt to emulate the popular 2001 Nintendo title Animal Crossing. As for the Friends of Mineral Town Game Boy Advance port of Back to Nature, that game’s reduction of its aesthetic to two dimensions, while at times admirably beautiful (the pixelated artwork and menu screens are more pleasing to the eye), ultimately hampers its experience, never fully bringing you into the game."}, {"9eb0": "The winding, tightly repetitive structure of Back to Nature is perfectly complimented by the small yet varied world the game takes place in. It feels warm and cozy, but never claustrophobic; the player is aware of a world which exists outside the boundaries of its playing field, but never yearns for it. What we’re given is what we require, and there’s plenty to do within it. Too much game and the aesthetic threatens to collapse under its weight; too developed an aesthetic, however, could easily reveal the shortcomings of its simple formula. Busying oneself with the farm, developing relationships with fellow citizens, chasing down a budding romance, making sure the animals are safe and alive."}, {"8acc": "The game thrives on a controlled, habit-forming economy that always rewards its completion, a pleasurable monotony, dangling its next goal in front of the player which could be months away from realization. When game critics write about “replayability,” what they’re essentially talking about is the incentive for players to continue progressing through the world of the game long after its narrative has closed. Back to Nature is a case study in replayability, offering a glimpse at what five or ten (in-game) years of playing will provide. This game is a well-oiled version of the formula at the heart of its origin."}, {"1fd6": "Outwit, Outplay, Outlast"}, {"e784": "Do classics truly matter? And if so, why do they endure? Although Harvest Moon as a franchise seems to have a canonical lock on the farming simulator genre (threatened only by the parentally-beloved social media game FarmVille’s brief, depressing flareup in 2010), Back to Nature requires certain qualities in order to stand head-and-shoulders above its contemporaries and make it a compelling argument for inclusion in the canon over 15 years after its practically silent release. Although I cannot answer whether or not the game can or even should be regarded as a classic, I have listed a few questions to refer to when considering whether a particular title deserves the honor."}, {"8d6d": "What does it present?"}, {"f4e7": "Does this game represent a perfection of its formula? Regardless of how former and subsequent installments in the Harvest Moon franchise handled this basic recipe, did any of those installments approach a perfection of its elements? Can such a thing exist? Are titles in a franchise shadows on the wall of Plato’s proverbial cave, suggesting an ideal form of the game exists that developers are attempting to create? And if so, has that ideal form come to pass, or is it yet to be? Is Super Mario Bros. honestly the best distillation of that franchise’s possibilities, or is it a sketchy suggestion of what it could have truly achieved through updated sequels Super Mario Bros. 3 or Super Mario World? Or is every game a separate beast? Is Ocarina of Time just an unnecessarily complex retread of The Legend of Zelda, or are the similarities only surface deep, requiring the narrative familiarity of an established franchise to introduce an otherwise entirely novel gaming experience?"}, {"0457": "Does its obscurity matter?"}, {"b346": "Although many of the world’s most beloved and important games also sold outrageous numbers of units, that fact doesn’t necessarily preclude their inclusion in the canon. Truly original, inventive and boundary-pushing video games do oftentimes strike a chord with consumers and go on to sell an absolutely bonkers amount of plastic discs and cartridges. Many of those games define not only their respective genres, they reset the limitations of their medium, find new ways to utilize its capacity for storytelling and entertainment, and create rich, memorable characters and worlds that leave an indelible impression on consumers for decades. The same goes for many of the most monumental record albums and films of the last century, and literature for the last few hundred years."}, {"280d": "What do today’s youth owe the deep back catalog of video games upon which the seventh and eighth generation gaming systems they’ve grown up with rest?"}, {"42e4": "Much of what we consider today to be classic has a contentious history when placed under this light, however. Rock groups such as Pixies, Belle & Sebastian, and Velvet Underground labored in obscurity for decades before they were rewarded with a wider fanbase and adoring critics, not to mention top spots on greatest album lists. When Gene Kelly’s Singin’ in the Rain debuted in 1952, it underwhelmed and fell into the dustbin of cinematic history, only to be rescued by film critics decades later. Both Vincent Van Gogh and Henry David Thoreau were virtually unknown in their fields during their unusually productive lifetimes. Examples abound of books, film and television that did not fly out of the gate with a bang, yet slowly wound up defining their respective canons. Why haven’t we seen this happen to a video game?"}, {"4fcb": "Is it truly obsolete?"}, {"5200": "For starters, video game culture is ridiculously front-heavy — emphasis is placed largely on whatever comes next, regardless of the medium’s deepening history. Certainly, there have been concerns about the backwards compatibility of emerging systems, the introduction of online services through which consumers may download classic ‘content’, and the re-packaging of older titles on handheld systems, as was Back to Nature in 2007 on the PlayStation Portable, moving a scant 80,000 copies in North America. Due to the up- and outward trajectory of gaming capabilities in graphics, sound, computing and social interactivity, the murky past of gaming seems relegated to nostalgia, limited by the primitive capabilities of the systems that once supported them. In theory, despite how important a game like Super Mario Bros. was, it cannot compete with the level of popularity enjoyed by, say, Fallout 4. Games, after all, are intended to improve on past inadequacies, even as gamers lionize classic franchises and entrench them in culture through reference."}, {"6c0f": "At this point, teenagers just now earning their driver’s licenses might have picked up a Wiimote by first grade, which means they were born fifteen years after the introduction of the Nintendo Entertainment System in North America and just shy of a decade after the debut of the Super NES. What do today’s youth owe the deep back catalog of video games upon which the seventh and eighth generation gaming systems they’ve grown up with rest? Can anything be gained or appreciated by picking up a game like Back to Nature when so many brighter, more complex options are available?"}, {"7a77": "With the increasingly complex technology of gaming, the introduction of more components to the experience of gaming, and the expansion of titles being released to the three major platforms (Xbox, PlayStation and Nintendo), does the interest exist among gamers to reach back into history and pluck out titles that seemingly offer less? Or will games eventually develop to a point that playing an old PlayStation title will be a useless, futile exercise? The jury still seems to be out on whether dusty old NES and SNES titles will truly live on in the hearts of gamers. The practical knowledge of systems prior to the third generation seems to drop off as gamers get younger, which suggests the cultural import of classic yet significantly less totemic titles such as BurgerTime, Battletoads and Clu Clu Land are in danger of falling into actual obscurity."}, {"28ea": "Final Thoughts"}, {"bfe8": "Games like Harvest Moon may not survive another decade of system evolution. Mario, Zelda and Pokémon, regardless of the relative success of their releases, seem to be capable of changing with the times, but it is possible less singular franchises cannot keep up enough interest in future releases that younger gamers will feel compelled to reach back into the franchise’s past. The formula at the heart of a franchise should be capable of sustaining itself through the years without changing so much as to be unrecognizable. The fact that the Harvest Moon franchise was recently rebranded to Story of Seasons suggests something of an identity crisis for the developers, a lack of confidence. This may not, however, imperil a title strong enough in personal merit to withstand the failure of the bloodline it sprang from. It’s my personal belief that Back to Nature is strong enough to survive the collapse of the Harvest Moon/Story of Seasons franchise should the next decade bring such an unfortunate event."}, {"6c38": "I love Harvest Moon: Back to Nature. I think it’s a strong, deeply enjoyable, terrific game to play. I think Harvest Moon taps into a human (or at least Type A) desire to plan, arrange, and organize the world around us into something manageable and tame. To that tend, Back to Nature achieves its goal admirably, and of the titles I’ve played (admittedly not every one) in the franchise, few come close to what it offers. That is my honest opinion. But I am still mostly unsure about what qualifies a video game as a classic, although I believe some of the qualities outlined in this essay can be used to assess whether a title is truly important based on its contributions to the medium, its popularity with gamers, its ability to withstand the test of time, and its influence on subsequent titles both within its franchise and without it."}, {"4eb9": "Not all classics are perfect, but they are important; many of the most enjoyable, creative and inventive video games out there languish in obscurity without an audience. Some, such as Vib Ribbon, were condemned to hardware and regional limitations and suddenly blessed with a fresh new audience after years of technical irrelevance. The burgeoning indie game scene has increased the variety and types of video games available to a gaming market that is both broader and more diverse than ever. As these forces combine to create today’s gaming environment, is it possible that a future classic is currently available unbeknownst to us? Do games exist now speaking a language most of us have yet to learn?"}, {"9bf1": "We will just have to wait and see."}], "author": "Tag W.R. Hartman-Simkins", "child": "1315_11315_1", "name": "1315", "content": "How I Became Addicted to a Farming Simulation Game from the Year 2000 Fifteen years ago, Natsume quietly released one of the best entries in its long-running Harvest Moon franchise. But can a farming simulator this good re-emerge in the current industry landscape and be considered a truly great game? What, exactly, makes a video game a ‘classic’? Is it an enduring impression left on the genre by massively successful franchises such as Super Mario Bros., Final Fantasy or the Legend of Zelda? Must games invent refreshing approaches to a medium that often finds itself mired in predictable (and thus, bankable) formulas? To become a classic, must a company impress players with deft storytelling, cinematic panache and literary ambitions? Or are there just various, nebulous combinations of these qualities which, ramshackle, ensure a video game’s entry into the canon of time-honored, enduring titles? In light of a recent replay of an old entry in the now-twenty-year old simulation franchise Harvest Moon, I asked myself: Does this deceptively addictive video game have the stuff to be reconsidered a standalone classic? What’s Hampering It Released in 1999 in Japan and 2000 in North America, Harvest Moon: Back to Nature is the sixth installment in the Harvest Moon series, now re-branded as Story of Seasons. It is the only Harvest Moon game to be released on the original PlayStation platform, disregarding a female companion title only released in Japan (later re-released in the US as part of a bundle in 2007 for PSP), and it marks the first release outside of its native Nintendo platform. Back to Nature, essentially a tweaked port of the 1999 Nintendo 64 title Harvest Moon 64, holds one of the series’ highest scores on Metacritic, and is considered overall to be among the best entries in the twenty-year-old franchise by critics and gamers. In North America, it sold 110,000 copies; globally, 320,000. While those aren’t the worst numbers for the era, consider that on one end of the field, contemporary heavyweights Final Fantasy IX and Perfect Dark sold a whopping 5.3 million and 2.5 million copies worldwide, respectively. Playfully inventive niche titles, such as the tragically Japanese Incredible Crisis (a paltry 400,000 copies globally), sold close to Back to Nature’s figures. Even an entry in the well-established, popular Tomb Raider franchise (Tomb Raider Chronicles) sold just above half a million copies worldwide. To put these numbers into perspective, consider that Call of Duty: Black Ops 3 has currently sold over ten million copies around the globe. My gut tells me Back to Nature had more than a few obstacles frustrating its U.S. publication, chief among them being the misfortune of Sony’s tremendously exciting North American debut of the PlayStation 2 in October of 2000, a month before Nature’s November release date. Although Sony continued production of the PlayStation console (under its new moniker, PSOne) until 2005, the number of titles published for the platform dropped significantly after 2001; it’s difficult to determine exact numbers, but it appears less than twenty titles were published for the PlayStation in 2003 alone. Back to Nature was haplessly riding its dying platform’s wave into technological obsolescence. Who would drop $40 on the sixth title in a game series that basically asks you to endlessly repeat chores you’d be loathe to do in your own life? Back to Nature didn’t exactly wow in the graphics department, either, cribbing Igusa Mastsuyama’s cutsie chibi aesthetic introduced in Harvest Moon 64 and essentially remixing many of that game’s characters and elements, updating and streamlining the design and features in the process. There does exist disagreement over which title is superior. Although Back to Nature looks and feels much lighter and more efficient than its N64 predecessor/older sibling, it offers little visual stimulation in comparison to other titles in a medium just beginning to narrow its focus on the formal evolution of realistic computer graphics. Back to Nature in no way made use of the PlayStation’s visual capabilities, opting to mostly recycle the limited vocabulary of the 1999 Nintendo 64 iteration at a cultural moment in gaming when one of the most exciting new titles of the sixth generation was the (at the time) ultra-realistic Gran Turismo 2. Also: It’s a farming simulator. Assuming that, in 2000, new PlayStation games were commanding something like $40 a pop ($55 now, adjusted for inflation), who would drop that kind of dough on the sixth title in a game series that basically asks you to endlessly repeat chores you’d be loathe to do in your own life? The Game Itself: A Re-View Back to Nature is sublimely addictive, if only because it both subverts and confirms expectations for a game in its genre. Foremost, it is a solid development of the formula set in place by the original Harvest Moon (SNES, 1996) and refined by Harvest Moon 64. The premise of the game is simple: You return to the farm a decade after spending summers there as a young boy freely roaming about whilst your grandfather toils endlessly. The farm has fallen into disrepair, and the Mayor informs you that the townsfolk have allowed you three years to return the homestead to its former glory, otherwise you’ll be asked to leave. ‘Harvest Moon’ is a series of games about waiting. It’s about systemic tactics, planning, and financial smarts. The empty farm you inherit is ravaged by years of neglect, covered in weeds, stones and branches. Slowly you uncover a field where you can, piece by piece, till some of the soil to begin planting and watering your crops. If you’re wise, you’ll plant a mix of time-sucking re-harvestables with the quicker, single-harvest crops. (Ex: In Summer, mixing a few plots of Corn and Tomatoes with larger plots of Turnips.) Slowly, you accrue cash, enhance your primary tools (hoe, watering can, hammer, etc.), and expand your planting acreage. Your neighbor Barley from Yodel Ranch gives you a horse to take care of. There’s an opportunity to Chicken sit. If you’re diligent and thoughtful with your money, much of the game’s obstacles can be cleared away by the end of the first year, including nearly all of the housing expansions. Harvest Moon, after all, is a series of games about waiting. It’s about systemic tactics, planning, and financial smarts. Although it may not be on the level of more modern installments of the Sim City franchise, it nonetheless requires players make decisions which might forestall instant gratification for a much more beneficial reward in the near (and sometimes far) future. Particularly in the first year, time management becomes a crucial evil — there’s only so much time in the day to water and harvest plants, all while remaining below your stamina cut-off point (which can be raised). You are still required to attend festivals and town events, and interact with the townspeople on at least a semi-daily basis if you want to ingratiate yourself with subjects who will eventually decide whether you stay or not. You have to balance maximum profitability with maintaining a comfortable social life, a problem which still has yet to be solved. It’s precisely this nature of the game that had me convinced I’d grow bored of it quickly. I picked it up because I’d recently come into possession of a copy and, serendipitously, an enormous world-historic blizzard was rallying to batter the east coast. I popped in Back to Nature out of nostalgia for an earlier time when I could spend snow days burning my eyeballs out of the sockets staring at a TV in the dark for hours; I did not expect to repeat this behavior. But it’s the wait-and-see philosophy of the game which fosters its addictive nature — “I’ll just play one more day, until the barn is finished.” I actually said that to myself. The first day I played the game, I marathoned nearly non-stop from 5pm until 7am the next morning. I neglected to eat (which is a positive, seeing as eating is all I do now), and I staved off bathroom breaks because I just needed to harvest those last few ears of corn before Zach swooped in mercilessly at five to collect my produce and pay me for my handsome effort. And then it’s on to the next day, and the day after that, until the next season begins anew and you’re forced to readjust. Before you know it, you’re down a timeless hole of harvesting crops, feeding the chickens, brushing the sheep and horse, watering the crops, picking up that jewelry at the blacksmith you ordered three days ago, gathering wild mushrooms in the woods (because they are so outrageously expensive), splitting stumps to gather lumber for that next housing addition you’ve set your eyes on, and maybe — if there’s time left — tracking down the special someone you’re attempting to woo and gifting her a flower (or something more precious). You create a routine, and you do whatever you can not to deviate from it, otherwise decrepitude sneaks in. You pray for rain so you might find time to relax in-game just once; and when it does rain, you make sure not to waste the day. Find out which woman truly vibes with your inner feminine spirit, pick her to be your lawfully wedded beard, and then live out your days presenting Gotz with flowers. Marriage is, perhaps, the longest-range goal in the game. You are tasked to decide on a girl, woo her by presenting her with gifts, remember her birthday, and talk to her wherever and whenever you see her to remind her that, yes, you exist, and the other guy already elbowing his way in is unwelcome here. Like most video games, it’s aggressively heterosexual to a fault. The player has five girls to choose from — the tomboyish, relatively assertive Ann who lives at the Inn; prissy, inane flower girl Popuri who lives next door at the chicken farm under the patriarchal watch of her asshole older brother, Rick; quiet, mousey Mary, the girl who works at the library, blushes constantly, and never fails to remind you her father is the one who wrote all those books in the library (which was built to house them, mind you); polite, career-conscious Elli, whose extraordinarily boundary-pushing notions of desiring to work challenges the doctor’s narrow worldview; and Karen, the sexy lush with bleach blonde bangs, courtesy of the year 1999. If you’re a gay man like me, this feature of the game presents marriage as a frustrating obstacle. Clearly, the goal is to find out which woman truly vibes with your inner feminine spirit (are you more of a Tina Fey or an Amy Poehler?), pick her to be your lawfully wedded beard, and then live out the rest of your days presenting the lonely contractor Gotz with flowers and jewelry, only to be rewarded with either blank Oh, Thank Yous or vague offense at suggesting you’re into him. Coincidentally, the issue of same-sex attraction has been brought up by the developers of the Harvest Moon franchise in recently, suggesting it’s a concept that has crossed their minds. Until then, women and gay men may at least play the ‘female version’ of the game, made available in English in 2007, featuring a protagonist who desires an Eat Pray Love-style return to simplicity after she meets an anonymous poet aboard a cruise ship which subsequently sinks, leaving her beached on the shores of Mineral Town, suffering amnesia — clearly the perfect candidate for running a dilapidated farm. (Sadly, Gotz is still not eligible.) Back to Nature is a formulaic game; formula reigns king in this land. That formula, and how the developers have tweaked it, are necessarily the draw for a simulation franchise based on agriculture. Nature’s spin on it happens to be the best due to several factors, including the complexity of that formula and the appropriateness of the game’s aesthetics. This is a game whose look and feel are remarkably integral to the overall gaming experience and not merely a trivial feature of it. Games, for the most part, are experienced visually — the rest is audio and the feel of the controls. In his recent article for Gamasutra, Christian Nutt surveys the difficulties facing an updated remake of the beloved RPG classic Final Fantasy VII, noting the issue of recreating Cloud Strife’s humorous cross-dressing challenge: …Is a scene like that even possible in a modern retelling? I don’t mean because it’s out-of-step with today’s social mores (though this is, of course, significant.) I mean it in the sense that the original game’s theatrical style and comic spirit seems most likely to be jettisoned in an attempt to make a more photorealistic game, and to live up to the series’ current-day, self-serious image. Although Nutt hints at it (and goes on to discuss the importance of the game’s now-primitive 3D graphics to its overall experience), he never directly explores the implications of this problem: If that game’s humor is what he’s so afraid will be missing in the remake, does photorealism play a larger role in that conundrum? Much of that game’s comedy and heart came from the limits its basic polygonal characters and blue-window, text-based dialogue required be projected onto them. In some ways, it’s a similar argument to the one teachers usually offer their students: Reading is great because you can use your imagination. Just follow the on-page instructions and you can project your own inventions onto the rest of the text. In their quest to hand everything players, contemporary video games sometimes rob their audience of this component. We hear characters’ voices and see them perfectly rendered. There’s little room for the fantasy portion. Top: ‘Magical Melody’, Bottom: ‘A Wonderful Life’ Many franchises have benefitted from the gradual freedom from hardware restrictions, the greatest example being the Metal Gear series, which has always lead in the (sometimes too ambitious) cinematic thread of gaming. Photorealism, though, is not analogous to a totally immersive experience. For a game that strives to offer open-world, thrilling espionage, the difficulty and scope of a game like Metal Gear Solid V: The Phantom Pain seems positively correlated to the realism of it’s visual presentation. Those two elements compliment each other well, which makes sense for a gaming series that has always prized reality-based storytelling. To what degree does a farming simulator need to imitate reality? It’s questionable that, even considering it’s most recent installments, the Harvest Moon franchise would ever need to imitate reality. It’s formula simplifies farming to it’s most basic notions — plant, water, harvest, feed the animals, make sure nobody in town hates you, and make money. That simplification is the formula’s draw, and it’s hard to imagine a platform like the PlayStation 4 hosting a title that claims to give players the most realistic farming experience imaginable. Are titles in a franchise shadows on the wall of Plato’s proverbial cave, suggesting an ideal form of the game exists developers are attempting to create? The aesthetic engine of the game, then, is relatively perfected. After the release of Back to Nature, the Harvest Moon series quickly veered into slightly less cartoonish depictions in titles such as Save the Homeland and A Wonderful Life, featuring characters who look like stunted teenagers and environments rendered with overzealous detail. The pared down, childish aesthetic was reclaimed both in most of the series’ later handheld titles as well as 2005’s Wii/Gamecube title Magical Melody, which slaughters it in an obvious attempt to emulate the popular 2001 Nintendo title Animal Crossing. As for the Friends of Mineral Town Game Boy Advance port of Back to Nature, that game’s reduction of its aesthetic to two dimensions, while at times admirably beautiful (the pixelated artwork and menu screens are more pleasing to the eye), ultimately hampers its experience, never fully bringing you into the game. The winding, tightly repetitive structure of Back to Nature is perfectly complimented by the small yet varied world the game takes place in. It feels warm and cozy, but never claustrophobic; the player is aware of a world which exists outside the boundaries of its playing field, but never yearns for it. What we’re given is what we require, and there’s plenty to do within it. Too much game and the aesthetic threatens to collapse under its weight; too developed an aesthetic, however, could easily reveal the shortcomings of its simple formula. Busying oneself with the farm, developing relationships with fellow citizens, chasing down a budding romance, making sure the animals are safe and alive. The game thrives on a controlled, habit-forming economy that always rewards its completion, a pleasurable monotony, dangling its next goal in front of the player which could be months away from realization. When game critics write about “replayability,” what they’re essentially talking about is the incentive for players to continue progressing through the world of the game long after its narrative has closed. Back to Nature is a case study in replayability, offering a glimpse at what five or ten (in-game) years of playing will provide. This game is a well-oiled version of the formula at the heart of its origin. Outwit, Outplay, Outlast Do classics truly matter? And if so, why do they endure? Although Harvest Moon as a franchise seems to have a canonical lock on the farming simulator genre (threatened only by the parentally-beloved social media game FarmVille’s brief, depressing flareup in 2010), Back to Nature requires certain qualities in order to stand head-and-shoulders above its contemporaries and make it a compelling argument for inclusion in the canon over 15 years after its practically silent release. Although I cannot answer whether or not the game can or even should be regarded as a classic, I have listed a few questions to refer to when considering whether a particular title deserves the honor. What does it present? Does this game represent a perfection of its formula? Regardless of how former and subsequent installments in the Harvest Moon franchise handled this basic recipe, did any of those installments approach a perfection of its elements? Can such a thing exist? Are titles in a franchise shadows on the wall of Plato’s proverbial cave, suggesting an ideal form of the game exists that developers are attempting to create? And if so, has that ideal form come to pass, or is it yet to be? Is Super Mario Bros. honestly the best distillation of that franchise’s possibilities, or is it a sketchy suggestion of what it could have truly achieved through updated sequels Super Mario Bros. 3 or Super Mario World? Or is every game a separate beast? Is Ocarina of Time just an unnecessarily complex retread of The Legend of Zelda, or are the similarities only surface deep, requiring the narrative familiarity of an established franchise to introduce an otherwise entirely novel gaming experience? Does its obscurity matter? Although many of the world’s most beloved and important games also sold outrageous numbers of units, that fact doesn’t necessarily preclude their inclusion in the canon. Truly original, inventive and boundary-pushing video games do oftentimes strike a chord with consumers and go on to sell an absolutely bonkers amount of plastic discs and cartridges. Many of those games define not only their respective genres, they reset the limitations of their medium, find new ways to utilize its capacity for storytelling and entertainment, and create rich, memorable characters and worlds that leave an indelible impression on consumers for decades. The same goes for many of the most monumental record albums and films of the last century, and literature for the last few hundred years. What do today’s youth owe the deep back catalog of video games upon which the seventh and eighth generation gaming systems they’ve grown up with rest? Much of what we consider today to be classic has a contentious history when placed under this light, however. Rock groups such as Pixies, Belle & Sebastian, and Velvet Underground labored in obscurity for decades before they were rewarded with a wider fanbase and adoring critics, not to mention top spots on greatest album lists. When Gene Kelly’s Singin’ in the Rain debuted in 1952, it underwhelmed and fell into the dustbin of cinematic history, only to be rescued by film critics decades later. Both Vincent Van Gogh and Henry David Thoreau were virtually unknown in their fields during their unusually productive lifetimes. Examples abound of books, film and television that did not fly out of the gate with a bang, yet slowly wound up defining their respective canons. Why haven’t we seen this happen to a video game? Is it truly obsolete? For starters, video game culture is ridiculously front-heavy — emphasis is placed largely on whatever comes next, regardless of the medium’s deepening history. Certainly, there have been concerns about the backwards compatibility of emerging systems, the introduction of online services through which consumers may download classic ‘content’, and the re-packaging of older titles on handheld systems, as was Back to Nature in 2007 on the PlayStation Portable, moving a scant 80,000 copies in North America. Due to the up- and outward trajectory of gaming capabilities in graphics, sound, computing and social interactivity, the murky past of gaming seems relegated to nostalgia, limited by the primitive capabilities of the systems that once supported them. In theory, despite how important a game like Super Mario Bros. was, it cannot compete with the level of popularity enjoyed by, say, Fallout 4. Games, after all, are intended to improve on past inadequacies, even as gamers lionize classic franchises and entrench them in culture through reference. At this point, teenagers just now earning their driver’s licenses might have picked up a Wiimote by first grade, which means they were born fifteen years after the introduction of the Nintendo Entertainment System in North America and just shy of a decade after the debut of the Super NES. What do today’s youth owe the deep back catalog of video games upon which the seventh and eighth generation gaming systems they’ve grown up with rest? Can anything be gained or appreciated by picking up a game like Back to Nature when so many brighter, more complex options are available? With the increasingly complex technology of gaming, the introduction of more components to the experience of gaming, and the expansion of titles being released to the three major platforms (Xbox, PlayStation and Nintendo), does the interest exist among gamers to reach back into history and pluck out titles that seemingly offer less? Or will games eventually develop to a point that playing an old PlayStation title will be a useless, futile exercise? The jury still seems to be out on whether dusty old NES and SNES titles will truly live on in the hearts of gamers. The practical knowledge of systems prior to the third generation seems to drop off as gamers get younger, which suggests the cultural import of classic yet significantly less totemic titles such as BurgerTime, Battletoads and Clu Clu Land are in danger of falling into actual obscurity. Final Thoughts Games like Harvest Moon may not survive another decade of system evolution. Mario, Zelda and Pokémon, regardless of the relative success of their releases, seem to be capable of changing with the times, but it is possible less singular franchises cannot keep up enough interest in future releases that younger gamers will feel compelled to reach back into the franchise’s past. The formula at the heart of a franchise should be capable of sustaining itself through the years without changing so much as to be unrecognizable. The fact that the Harvest Moon franchise was recently rebranded to Story of Seasons suggests something of an identity crisis for the developers, a lack of confidence. This may not, however, imperil a title strong enough in personal merit to withstand the failure of the bloodline it sprang from. It’s my personal belief that Back to Nature is strong enough to survive the collapse of the Harvest Moon/Story of Seasons franchise should the next decade bring such an unfortunate event. I love Harvest Moon: Back to Nature. I think it’s a strong, deeply enjoyable, terrific game to play. I think Harvest Moon taps into a human (or at least Type A) desire to plan, arrange, and organize the world around us into something manageable and tame. To that tend, Back to Nature achieves its goal admirably, and of the titles I’ve played (admittedly not every one) in the franchise, few come close to what it offers. That is my honest opinion. But I am still mostly unsure about what qualifies a video game as a classic, although I believe some of the qualities outlined in this essay can be used to assess whether a title is truly important based on its contributions to the medium, its popularity with gamers, its ability to withstand the test of time, and its influence on subsequent titles both within its franchise and without it. Not all classics are perfect, but they are important; many of the most enjoyable, creative and inventive video games out there languish in obscurity without an audience. Some, such as Vib Ribbon, were condemned to hardware and regional limitations and suddenly blessed with a fresh new audience after years of technical irrelevance. The burgeoning indie game scene has increased the variety and types of video games available to a gaming market that is both broader and more diverse than ever. As these forces combine to create today’s gaming environment, is it possible that a future classic is currently available unbeknownst to us? Do games exist now speaking a language most of us have yet to learn? We will just have to wait and see. "}