{"parent": "", "timestamp": "Feb 9", "title": "The Perks of Small Things — Solid State Group", "sentences": [{"578e": "The Perks of Small Things — Solid State Group"}, {"fa90": "*This is a guest post written by Solid State Group*"}, {"de84": "After 14 years Solid State Group has decided it’s about bloody time we hired a marketer."}, {"6394": "Ordinarily we’d have some lovely marketing spiel about who we are, what we stand for, but that’s not how we operate."}, {"e64c": "So, we thought we take some time to talk to you about who we actually are, without all the “cruft” that normally goes with the territory."}, {"915b": "All that glitter’s ain’t gold."}, {"1437": "I pity the fool…"}, {"683f": "There’s not a company in the world that doesn’t offer customary socialising events, enforced fun we call them, so of course we love getting on the beers, breaking up to play FIFA or Rocket League, occasionally throwing axes … but we have no time for inter-floor play slides, ball pits or other bollocks. It’s a waste of money that could be better spent on the things that matter."}, {"d18f": "We give back to our staff properly with a weekly open invite to The Princess Pub, 2 full on parties a year and taking the whole company to SXSW."}, {"16de": "And while that’s fun, like I said, it’s the small things that matter most to us."}, {"22d3": "Of top priority to us is the work is challenging and fun, the camaraderie is tight and the people we work with are seen as just that — people. We hire for culture first and foremost. And, that’s what the Solid State team feel too."}, {"f9bb": "One of our most vital values is that We take things to heart. Our team means a lot to us. We won’t force people to work long hours and we protect team members from overbearing demands. Our clients are an extension of that team. This doesn’t mean we’re overly sensitive, we’re pragmatic, and we’re radically honest, we believe that our work matters, and we respect that, but most of we expect you to feel the same."}, {"0cc5": "Throwing axes & throwing shapes."}, {"9087": "🙊 Values are bullshit if they are not lived up to 🙊"}, {"a018": "Perks are not the things we listed above — even if they do beat most companies by a country mile — for us our values are the perks."}, {"99a0": "Over the last 14 years we’ve come to identify the values that matter to us all, these can be broken down in to 4 key pints — sorry, points."}, {"db21": "Oh, and speaking of values"}, {"11d8": "This is some of the things we value -"}, {"6754": "So if you want to work somewhere that understands you’re human, that you want to do great work with other people who believe in craft, passion, empathy and doing great work, then get it touch. We’d love to hear from you."}, {"7d2b": "Here’s the Link to apply"}], "author": "Benjamin Southworth", "child": "1325_1\t1325_2\t1325_3", "name": "1325", "content": "The Perks of Small Things — Solid State Group *This is a guest post written by Solid State Group* After 14 years Solid State Group has decided it’s about bloody time we hired a marketer. Ordinarily we’d have some lovely marketing spiel about who we are, what we stand for, but that’s not how we operate. So, we thought we take some time to talk to you about who we actually are, without all the “cruft” that normally goes with the territory. All that glitter’s ain’t gold. I pity the fool… There’s not a company in the world that doesn’t offer customary socialising events, enforced fun we call them, so of course we love getting on the beers, breaking up to play FIFA or Rocket League, occasionally throwing axes … but we have no time for inter-floor play slides, ball pits or other bollocks. It’s a waste of money that could be better spent on the things that matter. We give back to our staff properly with a weekly open invite to The Princess Pub, 2 full on parties a year and taking the whole company to SXSW. And while that’s fun, like I said, it’s the small things that matter most to us. Of top priority to us is the work is challenging and fun, the camaraderie is tight and the people we work with are seen as just that — people. We hire for culture first and foremost. And, that’s what the Solid State team feel too. One of our most vital values is that We take things to heart. Our team means a lot to us. We won’t force people to work long hours and we protect team members from overbearing demands. Our clients are an extension of that team. This doesn’t mean we’re overly sensitive, we’re pragmatic, and we’re radically honest, we believe that our work matters, and we respect that, but most of we expect you to feel the same. Throwing axes & throwing shapes. 🙊 Values are bullshit if they are not lived up to 🙊 Perks are not the things we listed above — even if they do beat most companies by a country mile — for us our values are the perks. Over the last 14 years we’ve come to identify the values that matter to us all, these can be broken down in to 4 key pints — sorry, points. Oh, and speaking of values This is some of the things we value - So if you want to work somewhere that understands you’re human, that you want to do great work with other people who believe in craft, passion, empathy and doing great work, then get it touch. We’d love to hear from you. Here’s the Link to apply "}