{"parent": "", "timestamp": "Apr 13", "title": "Simulation theory says more about human nature than it does the universe", "sentences": [{"d977": "Simulation theory says more about human nature than it does the universe"}, {"cfa8": "“We are almost certainly living in a computer simulation.” states the abstract of a 2003 philosophy paper by Nick Bostrom."}, {"2aa1": "There’s a theory which exists where the entirety of our reality is a synthesis of a greater world. It has found popularity among the general public and great minds alike. Nick Bostrom’s theory was thrust into the spotlight after Elon Musk stated, ‘Chances are we’re all living in a simulation’. The idea held people captive, the fact that a man such as Musk bought into the theory seemed encouraging to many."}, {"4667": "Simulation theory"}, {"6f16": "Simulation theory is the hypothesis that we exist in a simulated reality indistinguishable from ‘real’ reality. This is different from current virtual realities. The VR of today, even at it’s best, is distinguishable from the experience of real life. A virtual reality in the context of simulation theory would be impossible to separate from true reality."}, {"0fe4": "The dilemma of simulation theory"}, {"d7c8": "If the simulation of an entire universe were possible; it would also be possible for more simulations to exists than actual reality. In this scenario, there is no reason to assume we’re in ‘base’ reality as it’s a billion times more likely we aren’t. As Bostrom’s 2003 paper details, the inevitabilities of this reasoning are three fold;"}, {"d4c6": "Our ability to comprehend simulation theory may have more to do with its popularity than anything else. Many of the analogies used to describe the theory are relatable to most who hear them. Trends such as the increase in computing power or the creation of virtual realities. The growth of the video game industry and the creation of artificial intelligence. Movies like The Matrix and Total Recall provide visual context for the theory. It is easier to imagine the word as a VR only because we already have metaphorical and visual references to base our presumptions on."}, {"6369": "Simulation theory before simulations"}, {"33bf": "Simulation theory is the latest iteration of a common theory of reality. One of the more similar versions of the theory is an example from the 15th century. Before the invention of the printing press, a German shoemaker with little education postulated a theory that unified religion and contemporary quantum theories in a single moment of intuition. Jacob Böhme had many mystical experiences culminating in a vision when he focused his attention on a beam of sunlight reflected in a pewter dish. In that moment he became aware that the universe was a binary, fractal, self-replicating algorithm."}, {"494a": "Although Böhme did not use those words the concepts he expressed equate to the same meaning. He expressed these ideas in a religious context, the only vocabulary available to him. Böhme presented the universe as consisting of two parts good and evil, this is equal to binary computer code. He saw all things to be a microcosm of the divine model, equal to an infinite fractal. He concluded that everything in creation must follow the same replicating pattern observed in nature. This can equate to a procedural algorithm which makes and re-makes itself forever."}, {"71cf": "Other theories of reality"}, {"8a58": "Throughout humanity, our ancestors attempted to rationalize experience with various theories. The concepts balanced between the areas of science, religion, and philosophy."}, {"969d": "Plato’s allegory of the cave explored the concept that reality is the shadow of a more perfect reality. The Buddhist Dhamma portrays a concept of reality which is a dream-like experiential projection of a cosmic force know as karma. The Hindu Brahma is a concept of a more perfect and unchanging reality beyond the experiential reality of existence. The Zohar of Kabbalah states that everything in the physical world is illusionary, including time. These are but a few of the many ancestral concepts of our experiential reality."}, {"ef2b": "The common bond of these concepts is the idea that reality is a synthesis of some greater reality. The similarity of these older theories to simulation theory is striking. Our ancestors arrived at the same conclusion as the most forward-thinking minds of the current time."}, {"73c8": "What theories of reality really say about us"}, {"f515": "The fact that many theories of reality proposed throughout time share an incredibly similar theme may or may not be important. The fact that we theorize and attempt to understand reality may say more about us than they do about experiential reality."}, {"68a9": "We comprehend our reality relative to the totality of our experience. The importance of our relative experience is evident in the metaphorical descriptions of concepts throughout time. Wherein the comprehension of a concept is always based in the context of the time in which the concept was introduced. Reality is described as a shadow of another world in Plato’s cave, a dream by the Buddhist Dhamma, a holographic projection by Jacob Böhme, and a virtual creation by Simulation Theory."}, {"0c8f": "The only difference in these theories is the metaphor used to explain the same concept. Modern theories use technological metaphors, whereas older ones use religious or natural metaphors. We interpret the world through the technological mindset of the time."}, {"aa09": "A stark conclusion to the complex theory"}, {"2116": "The most conclusive observation one could arrive at with regard to simulation theory is Musks elaboration. “If we aren’t already in a simulation, the most probable reason isn’t that we are the first civilization; it’s that no civilization has ever advanced far enough to simulate reality.” A stark conclusion to the complex theory; either we are already living in a simulation or we’re doomed extinction. In this light, it is easy to understand why the prospect of living in a virtual world is compelling for many. It may be easier to theorize within an abstract construct comprised of metaphor than confront a know-unknown. Perhaps this is the motivation for all contemplation on the nature of reality."}], "author": "Eric Schmidt", "child": "1342_1", "name": "1342", "content": "Simulation theory says more about human nature than it does the universe “We are almost certainly living in a computer simulation.” states the abstract of a 2003 philosophy paper by Nick Bostrom. There’s a theory which exists where the entirety of our reality is a synthesis of a greater world. It has found popularity among the general public and great minds alike. Nick Bostrom’s theory was thrust into the spotlight after Elon Musk stated, ‘Chances are we’re all living in a simulation’. The idea held people captive, the fact that a man such as Musk bought into the theory seemed encouraging to many. Simulation theory Simulation theory is the hypothesis that we exist in a simulated reality indistinguishable from ‘real’ reality. This is different from current virtual realities. The VR of today, even at it’s best, is distinguishable from the experience of real life. A virtual reality in the context of simulation theory would be impossible to separate from true reality. The dilemma of simulation theory If the simulation of an entire universe were possible; it would also be possible for more simulations to exists than actual reality. In this scenario, there is no reason to assume we’re in ‘base’ reality as it’s a billion times more likely we aren’t. As Bostrom’s 2003 paper details, the inevitabilities of this reasoning are three fold; Our ability to comprehend simulation theory may have more to do with its popularity than anything else. Many of the analogies used to describe the theory are relatable to most who hear them. Trends such as the increase in computing power or the creation of virtual realities. The growth of the video game industry and the creation of artificial intelligence. Movies like The Matrix and Total Recall provide visual context for the theory. It is easier to imagine the word as a VR only because we already have metaphorical and visual references to base our presumptions on. Simulation theory before simulations Simulation theory is the latest iteration of a common theory of reality. One of the more similar versions of the theory is an example from the 15th century. Before the invention of the printing press, a German shoemaker with little education postulated a theory that unified religion and contemporary quantum theories in a single moment of intuition. Jacob Böhme had many mystical experiences culminating in a vision when he focused his attention on a beam of sunlight reflected in a pewter dish. In that moment he became aware that the universe was a binary, fractal, self-replicating algorithm. Although Böhme did not use those words the concepts he expressed equate to the same meaning. He expressed these ideas in a religious context, the only vocabulary available to him. Böhme presented the universe as consisting of two parts good and evil, this is equal to binary computer code. He saw all things to be a microcosm of the divine model, equal to an infinite fractal. He concluded that everything in creation must follow the same replicating pattern observed in nature. This can equate to a procedural algorithm which makes and re-makes itself forever. Other theories of reality Throughout humanity, our ancestors attempted to rationalize experience with various theories. The concepts balanced between the areas of science, religion, and philosophy. Plato’s allegory of the cave explored the concept that reality is the shadow of a more perfect reality. The Buddhist Dhamma portrays a concept of reality which is a dream-like experiential projection of a cosmic force know as karma. The Hindu Brahma is a concept of a more perfect and unchanging reality beyond the experiential reality of existence. The Zohar of Kabbalah states that everything in the physical world is illusionary, including time. These are but a few of the many ancestral concepts of our experiential reality. The common bond of these concepts is the idea that reality is a synthesis of some greater reality. The similarity of these older theories to simulation theory is striking. Our ancestors arrived at the same conclusion as the most forward-thinking minds of the current time. What theories of reality really say about us The fact that many theories of reality proposed throughout time share an incredibly similar theme may or may not be important. The fact that we theorize and attempt to understand reality may say more about us than they do about experiential reality. We comprehend our reality relative to the totality of our experience. The importance of our relative experience is evident in the metaphorical descriptions of concepts throughout time. Wherein the comprehension of a concept is always based in the context of the time in which the concept was introduced. Reality is described as a shadow of another world in Plato’s cave, a dream by the Buddhist Dhamma, a holographic projection by Jacob Böhme, and a virtual creation by Simulation Theory. The only difference in these theories is the metaphor used to explain the same concept. Modern theories use technological metaphors, whereas older ones use religious or natural metaphors. We interpret the world through the technological mindset of the time. A stark conclusion to the complex theory The most conclusive observation one could arrive at with regard to simulation theory is Musks elaboration. “If we aren’t already in a simulation, the most probable reason isn’t that we are the first civilization; it’s that no civilization has ever advanced far enough to simulate reality.” A stark conclusion to the complex theory; either we are already living in a simulation or we’re doomed extinction. In this light, it is easy to understand why the prospect of living in a virtual world is compelling for many. It may be easier to theorize within an abstract construct comprised of metaphor than confront a know-unknown. Perhaps this is the motivation for all contemplation on the nature of reality. "}