{"parent": "", "timestamp": "Apr 9", "title": "Niche Networks", "sentences": [{"fa69": "Niche Networks"}, {"9949": "Rethinking scale for social networks in the era of app inundation"}, {"6074": "For many entrepreneurs, the allure of creating the next great social network may seem impossible to avoid. Creating the next Twitter, Instagram, Facebook means hundreds of millions — or billions — of active users. When your goal is to get your product in the hands of the most people possible, this is the game you play."}, {"5dc2": "But that game is over."}, {"2a7e": "It’s starting to feel more and more like the last “great” social network was Snapchat.¹ It was founded just over five years ago. And, of course, it just went public with over 150 million active users. There have been many other networks that have launched in the intervening years, and some have gotten some nice traction. But, at least in the U.S. market, it feels like the window is shut to reach such a massive scale."}, {"8725": "The reason why is both obvious and not. It’s not that these newer networks aren’t as compelling as the ones that came before — some are far better in terms of features, speed, and polish. Certainly, many now start out far better than the networks of yesteryear. But the reality of our current situation is that many countries have reached smartphone saturation. And, as such, many of those users now already have their go-to social networks. They’re the ones we all know."}, {"661e": "Obviously, it’s dangerous to think that incumbents can’t fall — that’s the history of our world in basically every facet of life, after all. But change requires a catalyst. That’s why so many people have been waiting and searching for the next platform after mobile. New platforms are the best catalysts for change because they not only change the game, they reset it."}, {"df1d": "And while sometimes incumbents can use their massive scale and talent to make a platform leap (see: Facebook to mobile, despite missing the boat very badly, early on), there will always be new powers that rise (Twitter, Instagram, Snapchat, etc)."}, {"00b9": "But while we’ve seen the launch of a few would-be “next” platforms — tablets, connected watches, connected TVs, VR, etc — nothing has yet caught on in a way that will birth a new massive network ecosystem.² And so more recently, we’ve been seeing a push towards sub-platforms. That is, platforms that leverage other platforms. Think: bots and other “micro apps” built on top of the chat apps. Also, vocal/audible computing may end up falling in this camp, it’s too early to tell."}, {"f9f3": "The aforementioned chat apps were the last push toward massive network scale. It’s why Facebook bought WhatsApp and why they tried (and failed) many times to buy Snapchat. Others are still trying to make a play here — a bunch with slightly different video twists, for example. But as we’re all seeing, Facebook has figured out how to effectively (and not so effectively) throw its billion-plus users around when it sees a new social paradigm."}, {"d9d2": "But, backing up for a second, far more problematic for any new social network is the fact that many people already have the handful of apps they now use in a given day. We’ve reached app saturation. (Which was obvious years ago.) The barrier to entry isn’t building a better or more compelling service — that’s actually not good enough any more. Because the true barrier is the one that ends everything: time."}, {"da31": "There’s simply not enough hours in a day for everyone to use every social network out there. And so you have to choose the two or three or four that all your friends are on. And again, those are already established. So you see why this is such a mountain to climb. In the early days of the App Store, the mountain was more of a molehill. Now it’s Mount Everest."}, {"bf42": "To stretch the analogy a bit further: time and time again we see services that think they can scale the mountain by getting dropped off in a helicopter at one of the camps closer to the peak. That is, getting featured in the App Store, buying downloads, etc. This doesn’t work anymore. Even Snapchat summited by putting in the actual work and you know, climbing."}, {"52d9": "So, this sounds pretty grim. The good news is that such things do tend to be cyclical in nature. While it’s hard to see it now, eventually, there will be a new platform that rises up to replace mobile. But for now, nothing on the horizon can reach such scale. Mobile remains the mountain."}, {"9c7f": "This is daunting. But it can be advantageous in a different way. A decade ago, relatively few people had a smartphone, so if you were building a service to run on it, you were best positioned if you built an app with as broad of an appeal as possible. Now, because everyone has a smartphone, the opposite can be true."}, {"88ee": "If I was to give advice to anyone looking to build a social network right now, it would be pretty simple: go granular. Niche, even. The road to massive scale is closed, but another one has opened. A large percentage of a small base is still small. But a small percentage of a massive base is large."}, {"0dd9": "And again, the true competition here is time. The way to attack that is no longer with broad appeal, it’s by way of highly targeted passion.³"}, {"8eb4": "Further, beyond the vanity of having a billion active users, social networks aim for scale in order to monetize. That’s because they all monetize through advertising. And that’s easiest to do at scale. But this world is also shifting."}, {"d5df": "It’s still nascent, but other forms of monetization are starting to have some tailwinds. Footholds will be gotten eventually, one way or another. At the same time, the hysteria around fake news and the like is pushing back against advertising at massive scale. A niche network, with a highly targeted user base, can create unique, new advertising options."}, {"e362": "Of course, it’s hard to come out of the gate with a mentality to “go small” — again, meaning here: simply not going after acquiring the most users possible — it requires patience, focus, and a hell of a lot of confidence. And the knowledge that often, big things have small beginnings. Some even aim to start in such a way, with other paths opening up along the journey."}, {"69df": "¹ “Great” simply meaning “massive” here in terms of scale. Quantity, not necessarily quality."}, {"f120": "² Which isn’t to say certain platforms are failures — certainly you can make the argument that things like the Apple Watch and iPad are massive in their own right. But they’re not massive on the mobile scale."}, {"5205": "³ GV has a bet directly in this space with Amino."}], "author": "M.G. Siegler", "child": "1353_1\t1353_2\t1353_3\t1353_4\t1353_5\t1353_6\t1353_7\t1353_8\t1353_9\t1353_10\t1353_11\t1353_12\t1353_13\t1353_14\t1353_15\t1353_16\t1353_17\t1353_18\t1353_19\t1353_20\t1353_21\t1353_22\t1353_23\t1353_24\t1353_251353_1\t1353_2\t1353_3\t1353_4\t1353_5\t1353_6\t1353_7\t1353_8\t1353_9\t1353_10\t1353_11\t1353_12\t1353_13\t1353_14\t1353_15\t1353_16\t1353_17\t1353_18\t1353_19\t1353_20\t1353_21\t1353_22\t1353_23\t1353_24\t1353_25", "name": "1353", "content": "Niche Networks Rethinking scale for social networks in the era of app inundation For many entrepreneurs, the allure of creating the next great social network may seem impossible to avoid. Creating the next Twitter, Instagram, Facebook means hundreds of millions — or billions — of active users. When your goal is to get your product in the hands of the most people possible, this is the game you play. But that game is over. It’s starting to feel more and more like the last “great” social network was Snapchat.¹ It was founded just over five years ago. And, of course, it just went public with over 150 million active users. There have been many other networks that have launched in the intervening years, and some have gotten some nice traction. But, at least in the U.S. market, it feels like the window is shut to reach such a massive scale. The reason why is both obvious and not. It’s not that these newer networks aren’t as compelling as the ones that came before — some are far better in terms of features, speed, and polish. Certainly, many now start out far better than the networks of yesteryear. But the reality of our current situation is that many countries have reached smartphone saturation. And, as such, many of those users now already have their go-to social networks. They’re the ones we all know. Obviously, it’s dangerous to think that incumbents can’t fall — that’s the history of our world in basically every facet of life, after all. But change requires a catalyst. That’s why so many people have been waiting and searching for the next platform after mobile. New platforms are the best catalysts for change because they not only change the game, they reset it. And while sometimes incumbents can use their massive scale and talent to make a platform leap (see: Facebook to mobile, despite missing the boat very badly, early on), there will always be new powers that rise (Twitter, Instagram, Snapchat, etc). But while we’ve seen the launch of a few would-be “next” platforms — tablets, connected watches, connected TVs, VR, etc — nothing has yet caught on in a way that will birth a new massive network ecosystem.² And so more recently, we’ve been seeing a push towards sub-platforms. That is, platforms that leverage other platforms. Think: bots and other “micro apps” built on top of the chat apps. Also, vocal/audible computing may end up falling in this camp, it’s too early to tell. The aforementioned chat apps were the last push toward massive network scale. It’s why Facebook bought WhatsApp and why they tried (and failed) many times to buy Snapchat. Others are still trying to make a play here — a bunch with slightly different video twists, for example. But as we’re all seeing, Facebook has figured out how to effectively (and not so effectively) throw its billion-plus users around when it sees a new social paradigm. But, backing up for a second, far more problematic for any new social network is the fact that many people already have the handful of apps they now use in a given day. We’ve reached app saturation. (Which was obvious years ago.) The barrier to entry isn’t building a better or more compelling service — that’s actually not good enough any more. Because the true barrier is the one that ends everything: time. There’s simply not enough hours in a day for everyone to use every social network out there. And so you have to choose the two or three or four that all your friends are on. And again, those are already established. So you see why this is such a mountain to climb. In the early days of the App Store, the mountain was more of a molehill. Now it’s Mount Everest. To stretch the analogy a bit further: time and time again we see services that think they can scale the mountain by getting dropped off in a helicopter at one of the camps closer to the peak. That is, getting featured in the App Store, buying downloads, etc. This doesn’t work anymore. Even Snapchat summited by putting in the actual work and you know, climbing. So, this sounds pretty grim. The good news is that such things do tend to be cyclical in nature. While it’s hard to see it now, eventually, there will be a new platform that rises up to replace mobile. But for now, nothing on the horizon can reach such scale. Mobile remains the mountain. This is daunting. But it can be advantageous in a different way. A decade ago, relatively few people had a smartphone, so if you were building a service to run on it, you were best positioned if you built an app with as broad of an appeal as possible. Now, because everyone has a smartphone, the opposite can be true. If I was to give advice to anyone looking to build a social network right now, it would be pretty simple: go granular. Niche, even. The road to massive scale is closed, but another one has opened. A large percentage of a small base is still small. But a small percentage of a massive base is large. And again, the true competition here is time. The way to attack that is no longer with broad appeal, it’s by way of highly targeted passion.³ Further, beyond the vanity of having a billion active users, social networks aim for scale in order to monetize. That’s because they all monetize through advertising. And that’s easiest to do at scale. But this world is also shifting. It’s still nascent, but other forms of monetization are starting to have some tailwinds. Footholds will be gotten eventually, one way or another. At the same time, the hysteria around fake news and the like is pushing back against advertising at massive scale. A niche network, with a highly targeted user base, can create unique, new advertising options. Of course, it’s hard to come out of the gate with a mentality to “go small” — again, meaning here: simply not going after acquiring the most users possible — it requires patience, focus, and a hell of a lot of confidence. And the knowledge that often, big things have small beginnings. Some even aim to start in such a way, with other paths opening up along the journey. ¹ “Great” simply meaning “massive” here in terms of scale. Quantity, not necessarily quality. ² Which isn’t to say certain platforms are failures — certainly you can make the argument that things like the Apple Watch and iPad are massive in their own right. But they’re not massive on the mobile scale. ³ GV has a bet directly in this space with Amino. "}