{"parent": "", "timestamp": "Apr 14", "title": "Five Films About Technology in Five Minutes", "sentences": [{"dbd1": "Short of the Day"}, {"049d": "Five Films About Technology in Five Minutes"}, {"9e24": "It’s like ‘Black Mirror’ the comedy."}, {"6513": "Technology is awesome, and technology sucks, it both connects us and disconnects us, it makes us feel a part of the global society while simultaneously increasing our individualism, and as a result of all this, technology is the sharpest double-edged sword maybe of all-time."}, {"4fc8": "Under that technological umbrella, social media is its own separate black hole, a virtual construct that has almost entirely replaced old forms of socialization. The people with whom I interact most in a week — my FSR/OPS colleagues — are people I have never been in the same room with, and until we started the One Perfect Podcast a few weeks ago, I had never even heard most of their voices."}, {"7c4b": "Point is, modern technology is a conundrum, a force for good and a divisive force at the same time, a field whose every advance comes with at least one trap door. This is often explored in media, with Black Mirror being the most poignant contemporary example, but as with that series, most often the kerfuffles associated with technology and social media are treated dramatically, and dystopically so. In 5 Films About Technology, a series of minute-long vignettes, writer-director Peter Huang has opted for a comic but still dystopic look at the perils of technology, including device addiction, the inherent and pointless competitiveness of social media, and the ubiquitous dangers of accidentally sharing pornography (don’t act like you haven’t ever had a scare or two)."}, {"0bab": "While drama is of course effective as a deterrent to over-reliance on technology, it’s also dour and heavy-handed, which makes it all kind of one-note. By filtering his themes through comedy, though, Huang has made them not only more palatable, but also more relatable. So grab your favorite device and get this one in front of your eyes toot suite, and don’t forget to share the good word with all your “friends.”"}, {"dbe1": "And yes, I get the irony."}, {"f759": "Courtesy The New Yorker and ShortOfTheWeek.com"}], "author": "H. Perry Horton", "child": "1354_1\t1354_2", "name": "1354", "content": "Short of the Day Five Films About Technology in Five Minutes It’s like ‘Black Mirror’ the comedy. Technology is awesome, and technology sucks, it both connects us and disconnects us, it makes us feel a part of the global society while simultaneously increasing our individualism, and as a result of all this, technology is the sharpest double-edged sword maybe of all-time. Under that technological umbrella, social media is its own separate black hole, a virtual construct that has almost entirely replaced old forms of socialization. The people with whom I interact most in a week — my FSR/OPS colleagues — are people I have never been in the same room with, and until we started the One Perfect Podcast a few weeks ago, I had never even heard most of their voices. Point is, modern technology is a conundrum, a force for good and a divisive force at the same time, a field whose every advance comes with at least one trap door. This is often explored in media, with Black Mirror being the most poignant contemporary example, but as with that series, most often the kerfuffles associated with technology and social media are treated dramatically, and dystopically so. In 5 Films About Technology, a series of minute-long vignettes, writer-director Peter Huang has opted for a comic but still dystopic look at the perils of technology, including device addiction, the inherent and pointless competitiveness of social media, and the ubiquitous dangers of accidentally sharing pornography (don’t act like you haven’t ever had a scare or two). While drama is of course effective as a deterrent to over-reliance on technology, it’s also dour and heavy-handed, which makes it all kind of one-note. By filtering his themes through comedy, though, Huang has made them not only more palatable, but also more relatable. So grab your favorite device and get this one in front of your eyes toot suite, and don’t forget to share the good word with all your “friends.” And yes, I get the irony. Courtesy The New Yorker and ShortOfTheWeek.com "}