{"parent": "", "timestamp": "Apr 16", "title": "Blocked", "sentences": [{"119e": "Blocked"}, {"338a": "And It Feels So Good"}, {"121e": "I woke up to a block this morning, and it felt like the Easter Bunny had left me a chocolate elephant."}, {"8e24": "I would never have known (because Medium doesn’t send out Apprentice-like notices: You’ve been blocked by X— though that would be a nice feature) if I hadn’t checked on yesterday’s satirical poem, Owed to the IRS (Owed/Ode — satire, get it?). I’ve found I need to check on my offspring, because I don’t always get a squawk on the baby monitor alerting me of a response, especially if it’s from someone I don’t follow (annoying — hear me, Medium Staff?)"}, {"3997": "Much to my surprise, an entire thread of responses and my replies had disappeared. Did the respondent take down his comments? I thought I’d better go on an egg-hunt."}, {"3968": "Posting anything tagged #Taxes, I expected a few comments of a fist-shaking, down-with-taxes, the-IRS-is-a-bunch-of-jackbooted-thugs comments. Whatever. If you can’t laugh along with me, I can’t help you."}, {"f846": "The response that started the disappeared thread said sarcastically, in essence: Those on the two coasts should be happy to pay taxes to support our welfare state. In fact, they should add an extra tip and celebrate the day rather than complain about their paltry contribution."}, {"97c3": "This was from someone who I have had oodles of exchanges with. Someone I know is conservative and wears his Christianity on his sleeve."}, {"bf2c": "Lots of my peeps have recommended I block him. “Don’t go down that rabbit hole!” they urge. “There’s no point. Don’t waste your breath.”"}, {"8a4b": "To which I have always replied that he seems to be a nice guy, one I agree with on some things and disagree with on others. Our conversations on politics and religion have always been civil. And I have a policy. I have dedicated myself to having conversations with those with whom I disagree, because expanding my world view is part of why I am on this platform in the first place."}, {"d779": "I want to know how others think, how they reached a conclusion different from mine. I want to learn. But I also want to nudge, persuade and call bullshit when I see it, if not for the sake of the recipient, then for the sake of the passing reader."}, {"3776": "And so I replied:"}, {"640c": "I don’t mind contributing my bit to the health, welfare, infrastructure, education, defense, and general functioning of our nation. I believe, as Justice Oliver Wendell Holmes, Jr. said:"}, {"b921": "Taxes are the price we pay for a civilized society."}, {"2227": "What I do mind is how freakin’ complex, time-consuming, and (in the case of the self-employed) unpredictable the process is."}, {"41b0": "Hence my satire."}, {"4f90": "He responded to the effect: You are a good citizen, and yes we need to contribute something. But the majority would never vote to have their taxes raised. On every ballot, we should be given the opportunity to vote on, “Do you want to have your taxes raised?”"}, {"56c1": "Me:"}, {"6da0": "People do get to vote on exactly this question every time state, municipal or school bonds are on the ballot."}, {"89e2": "The fact that any bond passes ever indicates that a majority of those who voted were willing to saddle themselves with additional taxes for a cause they find worth supporting, such as the construction of public infrastructure or the acquisition of a public amenity."}, {"d354": "To which he retorted something like: People are ignorant. Do you really think they know, when they approve a bond, they are voting to raise their taxes?"}, {"7757": "Me:"}, {"5e20": "I hardly know everyone. I can only speak for my experience of the voters in my community, who I find, on average, to be well informed and who debate bond issues at great length in casual conversation, public meetings and letters to the editor."}, {"e31e": "And lest you develop some idea that my community is a bunch of hoity-toity eggheads, I’ll have you know that my auto mechanic, who is also our Select Board Chair, is one of the most well informed people I know."}, {"7875": "I am really not down with disparaging my fellow citizens, Larry Couch . Sorry."}, {"188a": "But the conversation was not to end there."}, {"b337": "He shot back approximately (I really wish I had a screen shot of this one): Get out of your bubble and watch Judge Judy or Dr. Phil. You will see how poorly educated and misguided most Americans are. I thought you had an open mind."}, {"3da3": "Me:"}, {"8cf0": "I am convinced those appearing on Judge Judy, Dr. Phil, etc. are specifically selected by management for their outrageous behavior, opinions, eccentricities, etc. That’s a lot of entertainment value right there, and the audience gets to feel smug in their superiority."}, {"ea8b": "Of course there are poorly educated people. I have known a few who never learned to read. But being poorly educated doesn’t make a person stupid."}, {"0595": "We all know people we think are misguided. But there are others who think the same of us."}, {"f5a9": "Public schools were invented to create an educated citizenry because, without that, a democracy flounders. If we have, as you believe, a country of poorly educated, illogical, under-informed, misguided people, our public education system is to blame."}, {"dcf6": "Which gets back to taxes."}, {"1278": "BOOM! BLOCKED!"}, {"01f7": "What was it that I said, after all our many conversations, after his heart-felt outpourings of what Christianity meant to him, that warranted a block this time around? What nerve did I touch? Did I find the painful crack between his beliefs about his fellow man and his professed creed? Was the dissonance between the obvious good of education and his loathing of government expense too much for his delicate ears to bear?"}, {"8a16": "I have no idea. You’ll have to draw your own conclusions."}, {"746f": "I’m just relieved. These conversations, however necessary, are exhausting. I’m glad this one has reached it’s mysterious conclusion."}, {"6bad": "To those who celebrate the day, Happy Easter!"}, {"172d": "CORRECTION/UPDATE"}, {"d8ca": "Thanks to alert peeps (thanks Michael Ramsburg, Randomly Me and Classical Sass), I realize I haven’t given Larry enough credit. His account itself has disappeared."}, {"c960": "Why? Was it Larry’s doing, without so much as a fare thee well or goodbye cruel Medium, or was his account taken down by the Medium gods?"}, {"6cde": "Larry didn’t seem like a person on the verge of throwing in the towel. Given Michael’s experience with Medium Trust and Safety, I wonder if Larry was suspended because someone complained about his interactions."}, {"344d": "In none of my exchanges with Larry have I ever found him to be less than polite. His attempts at sarcastic humor were not always well constructed (such as the one I can’t link about coastal people re taxes), as he himself would admit, making them come off as obnoxious rather than funny. But he added a different perspective on this platform that was more unique and nuanced that the usual conservative boilerplate. And that’s valuable, more so now than ever."}, {"ed07": "So what the hell happened? Did someone take offense and complain, leading to Larry’s account’s disappearance? If so, that’s a shame."}, {"cd2d": "I spent a good part of the morning “drewing” (wink, Violet — still working on it’s entry into the lexicon), trying to find Larry on other platforms with no luck. It turns out Larry Couch is not that unusual a name, and I’m not about to start phoning random people in West Virginia (at least I think that’s where he lives) on Easter. If anyone reading this knows how to contact him, please find out what happened."}, {"510c": "If Larry simply had enough and bowed out, all is right with the world. But, if Larry was taken down, I want to know why. What led to the action?"}, {"9dd8": "I want know just how hair-trigger Medium has become, despite Medium Trust and Safety assuring us, via the note they sent to Michael: We do understand that discourse and disagreement is part of this process, and is often a very necessary part indeed."}], "author": "Meg", "child": "1355_1\t1355_2\t1355_3\t1355_4\t1355_5\t1355_6\t1355_7\t1355_8\t1355_9\t1355_10\t1355_11\t1355_12\t1355_13\t1355_14\t1355_15\t1355_16\t1355_17\t1355_18\t1355_19\t1355_20\t1355_21\t1355_221355_1\t1355_2\t1355_3\t1355_4\t1355_5\t1355_6\t1355_7\t1355_8\t1355_9\t1355_10\t1355_11\t1355_12\t1355_13\t1355_14\t1355_15\t1355_16\t1355_17\t1355_18\t1355_19\t1355_20\t1355_21\t1355_221355_1\t1355_2\t1355_3\t1355_4\t1355_5\t1355_6\t1355_7\t1355_8\t1355_9\t1355_10\t1355_11\t1355_12\t1355_13\t1355_14\t1355_15\t1355_16\t1355_17\t1355_18\t1355_19\t1355_20\t1355_21\t1355_221355_1\t1355_2\t1355_3\t1355_4\t1355_5\t1355_6\t1355_7\t1355_8\t1355_9\t1355_10\t1355_11\t1355_12\t1355_13\t1355_14\t1355_15\t1355_16\t1355_17\t1355_18\t1355_19\t1355_20\t1355_21\t1355_221355_1\t1355_2\t1355_3\t1355_4\t1355_5\t1355_6\t1355_7\t1355_8\t1355_9\t1355_10\t1355_11\t1355_12\t1355_13\t1355_14\t1355_15\t1355_16\t1355_17\t1355_18\t1355_19\t1355_20\t1355_21\t1355_22", "name": "1355", "content": "Blocked And It Feels So Good I woke up to a block this morning, and it felt like the Easter Bunny had left me a chocolate elephant. I would never have known (because Medium doesn’t send out Apprentice-like notices: You’ve been blocked by X— though that would be a nice feature) if I hadn’t checked on yesterday’s satirical poem, Owed to the IRS (Owed/Ode — satire, get it?). I’ve found I need to check on my offspring, because I don’t always get a squawk on the baby monitor alerting me of a response, especially if it’s from someone I don’t follow (annoying — hear me, Medium Staff?) Much to my surprise, an entire thread of responses and my replies had disappeared. Did the respondent take down his comments? I thought I’d better go on an egg-hunt. Posting anything tagged #Taxes, I expected a few comments of a fist-shaking, down-with-taxes, the-IRS-is-a-bunch-of-jackbooted-thugs comments. Whatever. If you can’t laugh along with me, I can’t help you. The response that started the disappeared thread said sarcastically, in essence: Those on the two coasts should be happy to pay taxes to support our welfare state. In fact, they should add an extra tip and celebrate the day rather than complain about their paltry contribution. This was from someone who I have had oodles of exchanges with. Someone I know is conservative and wears his Christianity on his sleeve. Lots of my peeps have recommended I block him. “Don’t go down that rabbit hole!” they urge. “There’s no point. Don’t waste your breath.” To which I have always replied that he seems to be a nice guy, one I agree with on some things and disagree with on others. Our conversations on politics and religion have always been civil. And I have a policy. I have dedicated myself to having conversations with those with whom I disagree, because expanding my world view is part of why I am on this platform in the first place. I want to know how others think, how they reached a conclusion different from mine. I want to learn. But I also want to nudge, persuade and call bullshit when I see it, if not for the sake of the recipient, then for the sake of the passing reader. And so I replied: I don’t mind contributing my bit to the health, welfare, infrastructure, education, defense, and general functioning of our nation. I believe, as Justice Oliver Wendell Holmes, Jr. said: Taxes are the price we pay for a civilized society. What I do mind is how freakin’ complex, time-consuming, and (in the case of the self-employed) unpredictable the process is. Hence my satire. He responded to the effect: You are a good citizen, and yes we need to contribute something. But the majority would never vote to have their taxes raised. On every ballot, we should be given the opportunity to vote on, “Do you want to have your taxes raised?” Me: People do get to vote on exactly this question every time state, municipal or school bonds are on the ballot. The fact that any bond passes ever indicates that a majority of those who voted were willing to saddle themselves with additional taxes for a cause they find worth supporting, such as the construction of public infrastructure or the acquisition of a public amenity. To which he retorted something like: People are ignorant. Do you really think they know, when they approve a bond, they are voting to raise their taxes? Me: I hardly know everyone. I can only speak for my experience of the voters in my community, who I find, on average, to be well informed and who debate bond issues at great length in casual conversation, public meetings and letters to the editor. And lest you develop some idea that my community is a bunch of hoity-toity eggheads, I’ll have you know that my auto mechanic, who is also our Select Board Chair, is one of the most well informed people I know. I am really not down with disparaging my fellow citizens, Larry Couch . Sorry. But the conversation was not to end there. He shot back approximately (I really wish I had a screen shot of this one): Get out of your bubble and watch Judge Judy or Dr. Phil. You will see how poorly educated and misguided most Americans are. I thought you had an open mind. Me: I am convinced those appearing on Judge Judy, Dr. Phil, etc. are specifically selected by management for their outrageous behavior, opinions, eccentricities, etc. That’s a lot of entertainment value right there, and the audience gets to feel smug in their superiority. Of course there are poorly educated people. I have known a few who never learned to read. But being poorly educated doesn’t make a person stupid. We all know people we think are misguided. But there are others who think the same of us. Public schools were invented to create an educated citizenry because, without that, a democracy flounders. If we have, as you believe, a country of poorly educated, illogical, under-informed, misguided people, our public education system is to blame. Which gets back to taxes. BOOM! BLOCKED! What was it that I said, after all our many conversations, after his heart-felt outpourings of what Christianity meant to him, that warranted a block this time around? What nerve did I touch? Did I find the painful crack between his beliefs about his fellow man and his professed creed? Was the dissonance between the obvious good of education and his loathing of government expense too much for his delicate ears to bear? I have no idea. You’ll have to draw your own conclusions. I’m just relieved. These conversations, however necessary, are exhausting. I’m glad this one has reached it’s mysterious conclusion. To those who celebrate the day, Happy Easter! CORRECTION/UPDATE Thanks to alert peeps (thanks Michael Ramsburg, Randomly Me and Classical Sass), I realize I haven’t given Larry enough credit. His account itself has disappeared. Why? Was it Larry’s doing, without so much as a fare thee well or goodbye cruel Medium, or was his account taken down by the Medium gods? Larry didn’t seem like a person on the verge of throwing in the towel. Given Michael’s experience with Medium Trust and Safety, I wonder if Larry was suspended because someone complained about his interactions. In none of my exchanges with Larry have I ever found him to be less than polite. His attempts at sarcastic humor were not always well constructed (such as the one I can’t link about coastal people re taxes), as he himself would admit, making them come off as obnoxious rather than funny. But he added a different perspective on this platform that was more unique and nuanced that the usual conservative boilerplate. And that’s valuable, more so now than ever. So what the hell happened? Did someone take offense and complain, leading to Larry’s account’s disappearance? If so, that’s a shame. I spent a good part of the morning “drewing” (wink, Violet — still working on it’s entry into the lexicon), trying to find Larry on other platforms with no luck. It turns out Larry Couch is not that unusual a name, and I’m not about to start phoning random people in West Virginia (at least I think that’s where he lives) on Easter. If anyone reading this knows how to contact him, please find out what happened. If Larry simply had enough and bowed out, all is right with the world. But, if Larry was taken down, I want to know why. What led to the action? I want know just how hair-trigger Medium has become, despite Medium Trust and Safety assuring us, via the note they sent to Michael: We do understand that discourse and disagreement is part of this process, and is often a very necessary part indeed. "}