{"parent": "", "timestamp": "Sep 8, 2016", "title": "Ketchup sandwiches and other things stupid poor people eat", "sentences": [{"d84c": "Ketchup sandwiches and other things stupid poor people eat"}, {"20ab": "Please, Mrs. Conservative… please don’t yell at our daddy for using food stamps. Also, can we have a cookie? CREDIT: ANASTASIA BASIL"}, {"6713": "I met this woman named Mae. She’s a van driver for a production company. She works 14-hour days but says she doesn’t mind, says she keeps one eye on the road and the other on the prize — a paycheck that has to last through the dead months."}, {"11fd": "We’re driving through a poor stretch of Atlanta. Dirty streets. Old houses. Plastic toys upturned in front yards, no kids though. The neighborhood is quiet. I live in L.A., land of nannies and gardeners where the hills are alive with the sound of toddlers and leaf blowers. I prefer Atlanta. You can find parking at the grocery store in the middle of the day. In L.A. it doesn’t matter what time it is, the Trader Joe’s is packed with SAHs and WAHs (stay-at-homes and work-at-homes.)"}, {"f22f": "We pass a decades-old Buick Skylark. I point it out."}, {"943a": "“You into cars?” Mae asks."}, {"67c0": "I’m not into cars, but my dad and I once abandoned one of those Buicks on the side of a Florida highway when I was a teenager. That’s how my family did cars — we bought them on their last leg and left them where they died. I tell her how I’d come home from high school and there’d be nothing in the fridge but a bottle of red wine vinegar and a head of lettuce. On the counter, there’d be a bag of potatoes and a bottle of olive oil from the Dollar Store. That was dinner, potatoes and lettuce."}, {"39a8": "“I hear you,” she says. “We had ketchup sandwiches all the time growing up. We didn’t complain. We ate them.”"}, {"9e9f": "Mae’s voice is rich, melodic, it’s Maya Angelou meets Gladys Knight. I tell her about the time I borrowed red stirrup pants. (Remember stirrup pants from the 80s?) I borrowed them from my friend Marla. Her two older brothers drove Corvettes, one each. Marla drove a more sensible car for a 16-year-old, an Oldsmobile Cutlass Supreme. But it was new. And it was hers. She let me borrow the pants for a party in her neighborhood. (God knows I couldn’t go in my own shit clothes.) Long and short of it, the pants ripped in the calf. My mother wept like death had come, struggling with red thread, looking at me like I’d done the worst thing ever. Marla wanted $17 to replace them."}, {"97b2": "Mae invites me to sit up front with her. The traffic to my hotel is bad, we’re in for a haul. I switch out at the next red light."}, {"1199": "“So her brothers drive corvettes?” Yup."}, {"7fb3": "“One each?” Yup."}, {"6a3d": "“Lord Almighty,” she says, “folks of privilege don’t understand how $17 can ruin you.”"}, {"33d4": "Mae tells me how she’d come home from school and her mother would hustle her and her sisters upstairs to pick out clothes for the next day before the utilities cut off. Too many red notices."}, {"dde5": "I was poor in Florida. Mae’s from Detroit. I ask what she did to keep warm. “Poor kids just do what they gotta do. Privileged kids panic if they can’t have new this and new that, or if they can’t be on a sport team. Sports and heat, those are luxuries.”"}, {"710f": "I ask if she’s heard of John Prine, the folk singer. I sing his line: It’s a half an inch of water and you think you’re gonna drown. She howls, “Rich folks standing in a puddle screaming!”"}, {"7817": "I tell her about my parents shaking me awake in the middle of the night whispering, we have to go now. There’s a difference between going and getting out. What we were doing was getting out before morning, before the neighbors would see us evicted."}, {"ec32": "“I hear you,” she says. “Lord Almighty, I hear you.”"}, {"35b5": "America loves helping the shoeless, iphoneless, voteless, bug-infested Street Jesuses. These are the lost-cause poor; all they want is your pocket change. (Bless their hearts.) But the working poor? Those who claim to not have enough money for food because they also need clothes for work, water for bathing and laundry, rent for housing, heat in the winter, money for daycare, a smartphone for their job, car insurance and gas — those are some shifty motherfuckers."}, {"5aed": "If you’re on food stamps America has every right to hate you, as evidenced by this angry conservative yelling at a father and child for using food stamps. This lady proves conservatives love a good hate like they love a good steak. I assume she thinks of herself as a nice person, a good person, a church-goer. We all think everyone else is the asshole, right? There isn’t a lot of self-directed road rage out there. How often do we key our own cars? It’s always okay to hate the other guy when the hate is justified — like child predators, rapists, and food stamp users."}, {"a146": "Huddled round the Fox News campfire are those who love tall tales of poor people using tax dollars to buy drugs and alcohol and Gucci shoes. That’s not how it works. I’ve been on food stamps. The government doesn’t hand out wads of cash. When you qualify for food stamps you receive a plastic grocery card that only works for food transactions. Key word: qualify. You don’t just sign up. It’s not a tennis lesson at the club. What’s scary about the woman in the video is that she sees what’s in the dad’s cart (food for his kid) and she hates him for it."}, {"f6fe": "Stupid fucking poor people. If only we’d been engineer majors in college. If only we’d gone to college. If only our parents hadn’t been poor. If only they spoke English. If only we worked harder. If only we were more like conservatives who believe everything they have today is a direct result from the sweat of their own brow."}, {"4bfa": "When looking at a spider’s web can you point to the 8th spun web, or the 108th? There are those who claim this astounding ability — those who take full credit for crafting, spin by spin, a better life than ours, a life without aid. If you had help paying for college, if someone bought you your first car, if you had health insurance growing up, if your mom never cried over $17, you were lucky. The Hail Mary toss of birth landed you in a family that could put you on a soccer team and buy cleats as your foot grew. And someone was home to help you with your math and give you a gummy vitamin each morning. That’s called aid, by the way. And not all kids get it, but all kids should."}, {"84e3": "Don’t confuse aid with charity. Charity is old coats. Donating a coat doesn’t make you a good person but I bet it makes you feel like one. You didn’t even want that coat anymore, what you wanted was the closet space. Sure, you could have sold it at a garage sale and made, like, twenty bucks. It was an expensive coat, damn it. But you, with your heart of gold, gave it away. There’s a twinkle in God’s eye just for you."}, {"d09b": "What makes you a good person to others (and not just to yourself) is the same thing that makes me, or anyone who can afford the occasional $12 cocktail, a good person: Your vote. Not your coat."}, {"dbd8": "Vote for a Living Wage for others. Vote for health insurance for others. Don’t get in the way of food stamps for others. Understand how important $17 might be to others. That poor stretch of Atlanta is quiet because people are working and paying for day care. They’re clocking the same hours you’re clocking, but they make a shit wage."}, {"7aab": "Take a good long look at your feet. If you were born at the starting line wearing a nice pair of running shoes, that was luck. Sheer luck. The most important thing you can do now is help those who had to start the race a mile behind you, barefoot."}, {"f2e7": "Editor’s Note: This piece was originally published on the author’s own Medium page and has been republished on ThinkProgress with her permission."}], "author": "Anastasia Basil", "child": "1361_1\t1361_2\t1361_3\t1361_4\t1361_5\t1361_6\t1361_7\t1361_8\t1361_9\t1361_10\t1361_11\t1361_12\t1361_13\t1361_14\t1361_15\t1361_16\t1361_17\t1361_18\t1361_19\t1361_20\t1361_21\t1361_22\t1361_23\t1361_24", "name": "1361", "content": "Ketchup sandwiches and other things stupid poor people eat Please, Mrs. Conservative… please don’t yell at our daddy for using food stamps. Also, can we have a cookie? CREDIT: ANASTASIA BASIL I met this woman named Mae. She’s a van driver for a production company. She works 14-hour days but says she doesn’t mind, says she keeps one eye on the road and the other on the prize — a paycheck that has to last through the dead months. We’re driving through a poor stretch of Atlanta. Dirty streets. Old houses. Plastic toys upturned in front yards, no kids though. The neighborhood is quiet. I live in L.A., land of nannies and gardeners where the hills are alive with the sound of toddlers and leaf blowers. I prefer Atlanta. You can find parking at the grocery store in the middle of the day. In L.A. it doesn’t matter what time it is, the Trader Joe’s is packed with SAHs and WAHs (stay-at-homes and work-at-homes.) We pass a decades-old Buick Skylark. I point it out. “You into cars?” Mae asks. I’m not into cars, but my dad and I once abandoned one of those Buicks on the side of a Florida highway when I was a teenager. That’s how my family did cars — we bought them on their last leg and left them where they died. I tell her how I’d come home from high school and there’d be nothing in the fridge but a bottle of red wine vinegar and a head of lettuce. On the counter, there’d be a bag of potatoes and a bottle of olive oil from the Dollar Store. That was dinner, potatoes and lettuce. “I hear you,” she says. “We had ketchup sandwiches all the time growing up. We didn’t complain. We ate them.” Mae’s voice is rich, melodic, it’s Maya Angelou meets Gladys Knight. I tell her about the time I borrowed red stirrup pants. (Remember stirrup pants from the 80s?) I borrowed them from my friend Marla. Her two older brothers drove Corvettes, one each. Marla drove a more sensible car for a 16-year-old, an Oldsmobile Cutlass Supreme. But it was new. And it was hers. She let me borrow the pants for a party in her neighborhood. (God knows I couldn’t go in my own shit clothes.) Long and short of it, the pants ripped in the calf. My mother wept like death had come, struggling with red thread, looking at me like I’d done the worst thing ever. Marla wanted $17 to replace them. Mae invites me to sit up front with her. The traffic to my hotel is bad, we’re in for a haul. I switch out at the next red light. “So her brothers drive corvettes?” Yup. “One each?” Yup. “Lord Almighty,” she says, “folks of privilege don’t understand how $17 can ruin you.” Mae tells me how she’d come home from school and her mother would hustle her and her sisters upstairs to pick out clothes for the next day before the utilities cut off. Too many red notices. I was poor in Florida. Mae’s from Detroit. I ask what she did to keep warm. “Poor kids just do what they gotta do. Privileged kids panic if they can’t have new this and new that, or if they can’t be on a sport team. Sports and heat, those are luxuries.” I ask if she’s heard of John Prine, the folk singer. I sing his line: It’s a half an inch of water and you think you’re gonna drown. She howls, “Rich folks standing in a puddle screaming!” I tell her about my parents shaking me awake in the middle of the night whispering, we have to go now. There’s a difference between going and getting out. What we were doing was getting out before morning, before the neighbors would see us evicted. “I hear you,” she says. “Lord Almighty, I hear you.” America loves helping the shoeless, iphoneless, voteless, bug-infested Street Jesuses. These are the lost-cause poor; all they want is your pocket change. (Bless their hearts.) But the working poor? Those who claim to not have enough money for food because they also need clothes for work, water for bathing and laundry, rent for housing, heat in the winter, money for daycare, a smartphone for their job, car insurance and gas — those are some shifty motherfuckers. If you’re on food stamps America has every right to hate you, as evidenced by this angry conservative yelling at a father and child for using food stamps. This lady proves conservatives love a good hate like they love a good steak. I assume she thinks of herself as a nice person, a good person, a church-goer. We all think everyone else is the asshole, right? There isn’t a lot of self-directed road rage out there. How often do we key our own cars? It’s always okay to hate the other guy when the hate is justified — like child predators, rapists, and food stamp users. Huddled round the Fox News campfire are those who love tall tales of poor people using tax dollars to buy drugs and alcohol and Gucci shoes. That’s not how it works. I’ve been on food stamps. The government doesn’t hand out wads of cash. When you qualify for food stamps you receive a plastic grocery card that only works for food transactions. Key word: qualify. You don’t just sign up. It’s not a tennis lesson at the club. What’s scary about the woman in the video is that she sees what’s in the dad’s cart (food for his kid) and she hates him for it. Stupid fucking poor people. If only we’d been engineer majors in college. If only we’d gone to college. If only our parents hadn’t been poor. If only they spoke English. If only we worked harder. If only we were more like conservatives who believe everything they have today is a direct result from the sweat of their own brow. When looking at a spider’s web can you point to the 8th spun web, or the 108th? There are those who claim this astounding ability — those who take full credit for crafting, spin by spin, a better life than ours, a life without aid. If you had help paying for college, if someone bought you your first car, if you had health insurance growing up, if your mom never cried over $17, you were lucky. The Hail Mary toss of birth landed you in a family that could put you on a soccer team and buy cleats as your foot grew. And someone was home to help you with your math and give you a gummy vitamin each morning. That’s called aid, by the way. And not all kids get it, but all kids should. Don’t confuse aid with charity. Charity is old coats. Donating a coat doesn’t make you a good person but I bet it makes you feel like one. You didn’t even want that coat anymore, what you wanted was the closet space. Sure, you could have sold it at a garage sale and made, like, twenty bucks. It was an expensive coat, damn it. But you, with your heart of gold, gave it away. There’s a twinkle in God’s eye just for you. What makes you a good person to others (and not just to yourself) is the same thing that makes me, or anyone who can afford the occasional $12 cocktail, a good person: Your vote. Not your coat. Vote for a Living Wage for others. Vote for health insurance for others. Don’t get in the way of food stamps for others. Understand how important $17 might be to others. That poor stretch of Atlanta is quiet because people are working and paying for day care. They’re clocking the same hours you’re clocking, but they make a shit wage. Take a good long look at your feet. If you were born at the starting line wearing a nice pair of running shoes, that was luck. Sheer luck. The most important thing you can do now is help those who had to start the race a mile behind you, barefoot. Editor’s Note: This piece was originally published on the author’s own Medium page and has been republished on ThinkProgress with her permission. "}