{"parent": "", "timestamp": "Apr 8", "title": "We depend on others", "sentences": [{"3c8a": "We depend on others"}, {"f099": "Conversation with an Uber driver"}, {"c307": "I was in San Jose this week on a work trip but thankfully found some time with my friends too. It was a beautiful trip. But I did have to work on one of the days and that made me take an Uber."}, {"6d43": "The driver was Mexican and he missed his home. He asked me where I was from since it was quite obvious that I was here for work — I was dressed in a business suit and was picked up outside the office complex. When I told him that I was from India, he did one of those sighs that seems to communicate empathy, without using too many words. “That’s far,” he said. “Yes,” I replied. “Very far.”"}, {"ab70": "“Half way across the world, isn’t it?”"}, {"3882": "“That is correct.”"}, {"9941": "“Did you take a direct flight?”"}, {"2db1": "“No,” I said. “I had a stopover in Abu Dhabi.”"}, {"7666": "“They made you check-in your laptop?”"}, {"4fd3": "“Yes,” I replied. “And one of the passengers on the flight was very upset because he found his laptop crushed. Apparantly, the airlines staff is not gentle with the bags. Who knew!”"}, {"cc69": "Laughs. “But I would never take a direct flight,” he said. “I am afraid that they might run out of fuel. It is a really long direct flight, yes?”"}, {"5cd6": "“Yes,” I said, thinking, “but they must really plan for these things, I guess. They won’t take any undue risk.”"}, {"6a9e": "“Maybe,” he replied, thinking. “But I would still be scared.”"}, {"4fb7": "Silence."}, {"ef5b": "“You know what,” he said, after a long pause, “I just realized that we depend on other people to get anywhere.”"}, {"d109": "“Exactly,” I said. “Like I depend on you bringing me home safely right now.”"}, {"38d7": "Laughs. “Yes,” he said, “that too. But you know whenever we are taking any flight or train or cab for that matter, we are putting our lives in the hands of other people hoping that they know what they are doing. It’s a little scary, no?”"}, {"0be2": "“I’ve never really thought about it,” I said. “But that is definitely correct.”"}, {"3f4c": "“Hmm,” he said, thinking."}, {"f3c2": "Of course we spoke of other things on the ride. But they were mundane (population of India — compared to the US, size of the country — compared to the US and Uber in India — compared to the competition) and this is the segment that stuck with me."}, {"bb74": "Needless to say, I gave him 5 stars and tons of complements on the app. Apparently, in the US Uber you can actually select a feedback option that says “Great Conversation”! That’s thoughtful."}, {"21d7": "No matter how individualistic the society becomes, we depend on other people around us more and more. We use lesser words, we don’t socialize over dinners as much as we did a generation ago. We don’t randomly walk over to our neighbour’s house anymore at 5:30 PM to have tea with them. But we do depend on people to get anything done. The biggest change, however, is that the people we depend on now are strangers — car makers, train makers, plane makers and people who are involved in fuelling and flying them. Among several others, of course. We depend increasingly little our neighbours or cousins or the closest friends for survival. We do depend on them for good times, though."}, {"4bf2": "Not surprising then that we are also starting to have stimulating, thought provoking conversations with these strangers too! I may not know (or remember) the names of my pilots, airline staff, etc. but Jorge — the driver of a Subaru Forester, I do know yours now."}], "author": "Kartik Sharma", "child": "1364_1\t1364_2", "name": "1364", "content": "We depend on others Conversation with an Uber driver I was in San Jose this week on a work trip but thankfully found some time with my friends too. It was a beautiful trip. But I did have to work on one of the days and that made me take an Uber. The driver was Mexican and he missed his home. He asked me where I was from since it was quite obvious that I was here for work — I was dressed in a business suit and was picked up outside the office complex. When I told him that I was from India, he did one of those sighs that seems to communicate empathy, without using too many words. “That’s far,” he said. “Yes,” I replied. “Very far.” “Half way across the world, isn’t it?” “That is correct.” “Did you take a direct flight?” “No,” I said. “I had a stopover in Abu Dhabi.” “They made you check-in your laptop?” “Yes,” I replied. “And one of the passengers on the flight was very upset because he found his laptop crushed. Apparantly, the airlines staff is not gentle with the bags. Who knew!” Laughs. “But I would never take a direct flight,” he said. “I am afraid that they might run out of fuel. It is a really long direct flight, yes?” “Yes,” I said, thinking, “but they must really plan for these things, I guess. They won’t take any undue risk.” “Maybe,” he replied, thinking. “But I would still be scared.” Silence. “You know what,” he said, after a long pause, “I just realized that we depend on other people to get anywhere.” “Exactly,” I said. “Like I depend on you bringing me home safely right now.” Laughs. “Yes,” he said, “that too. But you know whenever we are taking any flight or train or cab for that matter, we are putting our lives in the hands of other people hoping that they know what they are doing. It’s a little scary, no?” “I’ve never really thought about it,” I said. “But that is definitely correct.” “Hmm,” he said, thinking. Of course we spoke of other things on the ride. But they were mundane (population of India — compared to the US, size of the country — compared to the US and Uber in India — compared to the competition) and this is the segment that stuck with me. Needless to say, I gave him 5 stars and tons of complements on the app. Apparently, in the US Uber you can actually select a feedback option that says “Great Conversation”! That’s thoughtful. No matter how individualistic the society becomes, we depend on other people around us more and more. We use lesser words, we don’t socialize over dinners as much as we did a generation ago. We don’t randomly walk over to our neighbour’s house anymore at 5:30 PM to have tea with them. But we do depend on people to get anything done. The biggest change, however, is that the people we depend on now are strangers — car makers, train makers, plane makers and people who are involved in fuelling and flying them. Among several others, of course. We depend increasingly little our neighbours or cousins or the closest friends for survival. We do depend on them for good times, though. Not surprising then that we are also starting to have stimulating, thought provoking conversations with these strangers too! I may not know (or remember) the names of my pilots, airline staff, etc. but Jorge — the driver of a Subaru Forester, I do know yours now. "}