{"parent": "", "timestamp": "Apr 16", "title": "Letter #50: I need your help — let me hear your ideas!", "sentences": [{"bde7": "Letter #50: I need your help — let me hear your ideas!"}, {"c4b8": "The winner is…"}, {"83d7": "Hi,"}, {"47cc": "Thanks again for reading last week’s letter and putting your votes in."}, {"f619": "There weren’t as many to count this time round, which made my job easier. Our gladiator from Round 1 lives to see another day:"}, {"28c2": "Newsletter — 14 votes"}, {"6625": "E-course — 5 votes"}, {"8ca6": "The winner in Round 2 is… Newsletter!"}, {"cdf7": "I’ll be honest, I haven’t had a lot of time to think of a new contender for Round 3, what with being sick on Wednesday and all."}, {"64a1": "Now it’s Easter Sunday and I’ve been relaxing after mowing the lawn and spending the day with my daughter. Charlotte had to make an emergency dash back overseas due to the passing of her grandfather."}, {"274b": "Honestly, some of the ideas I’ve read from people who cared to share have got me stroking my chin thoughtfully."}, {"dfec": "So I’d love to open the doors to the 32,000 followers. Give your pitches and proposals in the comments section. Make it long and detailed if you really want it to feature in Year 2."}, {"5b8b": "Then when people read this Letter and read your comment if they like the sound of it, they’ll heart it naturally."}, {"be1c": "It’s pretty open-ended, but let me give you some points so that suggestions have some focus:"}, {"9229": "The newsletter is still the forerunner, but I’m really keen to see what everyone else has to offer. This publication is written by the people, for the people."}, {"85c9": "As a reminder, here is the pitch for the Newsletter:"}, {"1166": "Newsletter"}, {"fc49": "I’m thinking of writing a newsletter where I talk about ways to improve writing skills, such as:"}, {"6756": "writing for impact,"}, {"68ed": "story telling,"}, {"3d5f": "how to create a headline/book title that gets attention, etc"}, {"4665": "I know how busy you are, but I also know that you are keen on building powerful daily habits that stick, so it will be a daily newsletter. but to make it useful, I envision that it will be solid, actionable tips that you can use in your writing right away, not long, rambling emails."}, {"b2aa": "This is Round 2. Which choice will you bring into Round 3?"}, {"0c0d": "Share your ideas with me so I know what you want to see in the second year of 100 Naked Words!"}, {"0b4c": "Til next week,"}, {"0faa": "-J."}], "author": "Johnson Kee", "child": "1368_1\t1368_2\t1368_3\t1368_4", "name": "1368", "content": "Letter #50: I need your help — let me hear your ideas! The winner is… Hi, Thanks again for reading last week’s letter and putting your votes in. There weren’t as many to count this time round, which made my job easier. Our gladiator from Round 1 lives to see another day: Newsletter — 14 votes E-course — 5 votes The winner in Round 2 is… Newsletter! I’ll be honest, I haven’t had a lot of time to think of a new contender for Round 3, what with being sick on Wednesday and all. Now it’s Easter Sunday and I’ve been relaxing after mowing the lawn and spending the day with my daughter. Charlotte had to make an emergency dash back overseas due to the passing of her grandfather. Honestly, some of the ideas I’ve read from people who cared to share have got me stroking my chin thoughtfully. So I’d love to open the doors to the 32,000 followers. Give your pitches and proposals in the comments section. Make it long and detailed if you really want it to feature in Year 2. Then when people read this Letter and read your comment if they like the sound of it, they’ll heart it naturally. It’s pretty open-ended, but let me give you some points so that suggestions have some focus: The newsletter is still the forerunner, but I’m really keen to see what everyone else has to offer. This publication is written by the people, for the people. As a reminder, here is the pitch for the Newsletter: Newsletter I’m thinking of writing a newsletter where I talk about ways to improve writing skills, such as: writing for impact, story telling, how to create a headline/book title that gets attention, etc I know how busy you are, but I also know that you are keen on building powerful daily habits that stick, so it will be a daily newsletter. but to make it useful, I envision that it will be solid, actionable tips that you can use in your writing right away, not long, rambling emails. This is Round 2. Which choice will you bring into Round 3? Share your ideas with me so I know what you want to see in the second year of 100 Naked Words! Til next week, -J. "}