{"parent": "", "timestamp": "Mar 26", "title": "274. Life is about choices, we just don’t know it", "sentences": [{"4bdd": "274. Life is about choices, we just don’t know it"}, {"a758": "None of us choose the life we are born into. But after that everything about our life is based on the choices that we make."}, {"6a4f": "Regardless of whether you are born into a rich family or a poor family the outcome of your life is dependent on the choices that you make, not the start that you were given."}, {"e845": "The problem is that most of us don’t even know we have options."}, {"e09d": "No doubt, somebody born into privilege and money will have an easier start, and probably easier choices to make. But they still have to make those choices. Their are countless stories that we never hear of rich kids who make the bad choices and waste away their lives."}, {"9011": "Sadly those born into poorer communities aren’t even aware that they have options, that there are other life paths that they can follow. They simply see the paths that the people around them have taken and automatically assume that they have to take the same path."}, {"72aa": "We always blame our circumstances or other people when we complain about our lives. If only I was born into a rich family, if only I was better and speaking in public, if only I could get a new car…"}, {"e119": "The thing is, aside from the rich family, we all have the choice to make our lives better."}, {"5789": "I can choose to complain about my life while watching Netflix and eating popcorn. Or I can choose to spend that time learning a new skill that will help me get paid more or I could go to the gym."}, {"b163": "I can choose to get annoyed at the car that cut me up on my drive this morning and allow it to ruin my whole day, or I can choose to acknowledge the annoyance, and then let it go in the knowledge that holding onto it does me no good at all."}, {"21c0": "Even if I am born into a bad neighbourhood I have the choice to spend my time with the “bad” kids or to focus on sports or school."}, {"0924": "This is how some people come from nothing to become something. They make the right choices, sometimes they make choices that they didn’t even know they had."}, {"f327": "I guess the challenge is how to we help people see the choices that they don’t know exist?"}], "author": "Hiong", "child": "1374_1\t1374_2", "name": "1374", "content": "274. Life is about choices, we just don’t know it None of us choose the life we are born into. But after that everything about our life is based on the choices that we make. Regardless of whether you are born into a rich family or a poor family the outcome of your life is dependent on the choices that you make, not the start that you were given. The problem is that most of us don’t even know we have options. No doubt, somebody born into privilege and money will have an easier start, and probably easier choices to make. But they still have to make those choices. Their are countless stories that we never hear of rich kids who make the bad choices and waste away their lives. Sadly those born into poorer communities aren’t even aware that they have options, that there are other life paths that they can follow. They simply see the paths that the people around them have taken and automatically assume that they have to take the same path. We always blame our circumstances or other people when we complain about our lives. If only I was born into a rich family, if only I was better and speaking in public, if only I could get a new car… The thing is, aside from the rich family, we all have the choice to make our lives better. I can choose to complain about my life while watching Netflix and eating popcorn. Or I can choose to spend that time learning a new skill that will help me get paid more or I could go to the gym. I can choose to get annoyed at the car that cut me up on my drive this morning and allow it to ruin my whole day, or I can choose to acknowledge the annoyance, and then let it go in the knowledge that holding onto it does me no good at all. Even if I am born into a bad neighbourhood I have the choice to spend my time with the “bad” kids or to focus on sports or school. This is how some people come from nothing to become something. They make the right choices, sometimes they make choices that they didn’t even know they had. I guess the challenge is how to we help people see the choices that they don’t know exist? "}