{"parent": "", "timestamp": "Apr 8", "title": "If You Are Struggling to do Creative Work, You Are Probably Choosing The Wrong Time of Day to Focus", "sentences": [{"a692": "If You Are Struggling to do Creative Work, You Are Probably Choosing The Wrong Time of Day to Focus"}, {"ef6b": "Believe it or not, there are certain times of the day when your body is better at performing certain tasks than others. And once you discover your peak times, you can do a lot more creative work and make significant progress every day."}, {"b515": "You can pack more into each day if you did everything at the optimal time."}, {"6423": "The human body operates on cycles called “ultradian rhythms.” According to research, during each of these cycles, there is a peak when we are most energized and a period when we are exhausted. It’s in your best interest to do your best work whilst you have willpower and energy at its peak."}, {"858b": "David Rock, Author of “Your Brain at Work” explains:"}, {"bed3": "“Every time you focus your attention you use a measurable amount of glucose and other metablic resources. Studies show that each task you do tends to make you less effective at the next task, and this is especially true for high-energy tasks like self control or decision making. So distractions really take their toll.”"}, {"0fa8": "In other words, when our brains are “on,” “we’re better at concentrating on a single task and we tend to do it well. It’s your job to find your peak times to perform better when working on creative projects."}, {"8f37": "Listen to your body"}, {"c7db": "A growing number of studies suggest that paying close attention to your body clock, and its effects on your energy and alertness, can help you find the best times of the day to do your most creative work."}, {"2f35": "According to Steve Kay, a professor of molecular and computational biology at the University of Southern California, you can have the edge you need to do your best work when you body’s clock can synchronize functioning of all its metabolic, cardiovascular and behavioral rhythms in response to light and other natural stimuli."}, {"0160": "At a particular time in the day, if you find yourself crashing before the day ends, it’s possible your circadian rhythms (24 hour cycle in the physiological processes of living beings) are working against you."}, {"352f": "Cindi May, is a Professor of Psychology at the College of Charleston, says if the problem you intend to solve at any given time of the day requires that you consider different options, you won’t benefit from the optimal approach to creative work. She writes:"}, {"4d0b": "To be sure, if your task requires strong focus and careful concentration — like balancing spreadsheets or reading a textbook — you are better off scheduling that task for your peak time of day. However, if you need to open your mind to alternative approaches and consider diverse options, it may be wise to do so when your filter is not so functional. You just may be able to see what you’ve been missing."}, {"2c3b": "Start and maintain a creative routine"}, {"5061": "Chances are you already know whether you’re a morning person or a night person. Morning larks and night owls have very different opinions on the best time of day to do important tasks."}, {"0b6a": "If you pay attention to your body’s response to work for a period of time, you will be able to find out what works best for you and when you are more likely to be creative."}, {"db3d": "You are most active in the morning, hence your ability to concentrate, focus and get challenging tasks done. Your body is at a perfect physiological state (being well rested and recovered from previous day’s work) for optimum performance. Many people believe that morning is the best time to create."}, {"4b50": "Benjamin Franklin, once advocated for a lark lifestyle in a famous saying: “early to bed and early to rise makes a man healthy, wealthy, and wise.”"}, {"304c": "Charles Dickens was a morning person. He finished his writing by 2:00pm each day."}, {"62cd": "Barack Obama, on the other hand chooses to stay up reading past midnight despite his incredibly long days."}, {"de7f": "If early morning creative sessions aren’t your cup of tea, you might be interested in a study from Mareike Wietha and Rose Zacks that found creative ideas often come at our least optimal times."}, {"8876": "What Wieth and Zacks found was that strong morning-types were better at solving the more mysterious insight problems in the evening, when they apparently weren’t at their best. Exactly the same pattern, but in reverse, was seen for people who felt their brightest in the evening: they performed better on the insight task when they were unfocused in the morning."}, {"71ab": "If you are not sure what time of day boosts your creativity, try this experiment:"}, {"180b": "Spend a few night on your creative work and then try the same thing a few mornings later. Ask yourself which session felt most productive and creatively fulfilling."}, {"596e": "Working steadily on one task over an extended time is a good sign that you were in the creative zone. Stick to the routine that work best for your creative work."}, {"6d57": "One more thing…"}, {"7c48": "If you enjoyed this post, you will love Postanly Weekly."}, {"ff58": "It’s my FREE weekly digest of the best research-based productivity, and life improvement posts from around the web. And my best post of the week. Postanly is for anyone who aspires to be awesome!"}, {"f3a9": "Join 15,600+ readers who get my weekly newsletter! Here is what you missed last week! Subscribe to the FREE Postanly Weekly digest here!"}], "author": "Thomas Oppong", "child": "1376_1\t1376_2\t1376_3\t1376_4\t1376_5", "name": "1376", "content": "If You Are Struggling to do Creative Work, You Are Probably Choosing The Wrong Time of Day to Focus Believe it or not, there are certain times of the day when your body is better at performing certain tasks than others. And once you discover your peak times, you can do a lot more creative work and make significant progress every day. You can pack more into each day if you did everything at the optimal time. The human body operates on cycles called “ultradian rhythms.” According to research, during each of these cycles, there is a peak when we are most energized and a period when we are exhausted. It’s in your best interest to do your best work whilst you have willpower and energy at its peak. David Rock, Author of “Your Brain at Work” explains: “Every time you focus your attention you use a measurable amount of glucose and other metablic resources. Studies show that each task you do tends to make you less effective at the next task, and this is especially true for high-energy tasks like self control or decision making. So distractions really take their toll.” In other words, when our brains are “on,” “we’re better at concentrating on a single task and we tend to do it well. It’s your job to find your peak times to perform better when working on creative projects. Listen to your body A growing number of studies suggest that paying close attention to your body clock, and its effects on your energy and alertness, can help you find the best times of the day to do your most creative work. According to Steve Kay, a professor of molecular and computational biology at the University of Southern California, you can have the edge you need to do your best work when you body’s clock can synchronize functioning of all its metabolic, cardiovascular and behavioral rhythms in response to light and other natural stimuli. At a particular time in the day, if you find yourself crashing before the day ends, it’s possible your circadian rhythms (24 hour cycle in the physiological processes of living beings) are working against you. Cindi May, is a Professor of Psychology at the College of Charleston, says if the problem you intend to solve at any given time of the day requires that you consider different options, you won’t benefit from the optimal approach to creative work. She writes: To be sure, if your task requires strong focus and careful concentration — like balancing spreadsheets or reading a textbook — you are better off scheduling that task for your peak time of day. However, if you need to open your mind to alternative approaches and consider diverse options, it may be wise to do so when your filter is not so functional. You just may be able to see what you’ve been missing. Start and maintain a creative routine Chances are you already know whether you’re a morning person or a night person. Morning larks and night owls have very different opinions on the best time of day to do important tasks. If you pay attention to your body’s response to work for a period of time, you will be able to find out what works best for you and when you are more likely to be creative. You are most active in the morning, hence your ability to concentrate, focus and get challenging tasks done. Your body is at a perfect physiological state (being well rested and recovered from previous day’s work) for optimum performance. Many people believe that morning is the best time to create. Benjamin Franklin, once advocated for a lark lifestyle in a famous saying: “early to bed and early to rise makes a man healthy, wealthy, and wise.” Charles Dickens was a morning person. He finished his writing by 2:00pm each day. Barack Obama, on the other hand chooses to stay up reading past midnight despite his incredibly long days. If early morning creative sessions aren’t your cup of tea, you might be interested in a study from Mareike Wietha and Rose Zacks that found creative ideas often come at our least optimal times. What Wieth and Zacks found was that strong morning-types were better at solving the more mysterious insight problems in the evening, when they apparently weren’t at their best. Exactly the same pattern, but in reverse, was seen for people who felt their brightest in the evening: they performed better on the insight task when they were unfocused in the morning. If you are not sure what time of day boosts your creativity, try this experiment: Spend a few night on your creative work and then try the same thing a few mornings later. Ask yourself which session felt most productive and creatively fulfilling. Working steadily on one task over an extended time is a good sign that you were in the creative zone. Stick to the routine that work best for your creative work. One more thing… If you enjoyed this post, you will love Postanly Weekly. It’s my FREE weekly digest of the best research-based productivity, and life improvement posts from around the web. And my best post of the week. Postanly is for anyone who aspires to be awesome! Join 15,600+ readers who get my weekly newsletter! Here is what you missed last week! Subscribe to the FREE Postanly Weekly digest here! "}