{"parent": "", "timestamp": "Apr 6", "title": "Why We’ve Stopped Saying “Culture Fit” — and What We’re Saying Instead", "sentences": [{"3979": "Why We’ve Stopped Saying “Culture Fit” — and What We’re Saying Instead"}, {"0c5d": "By Courtney Seiter"}, {"31f3": "The phrase “culture fit” is a bit of an Inkblot test in the world of work — even when we all hear the same two words, we might be thinking entirely different things."}, {"63ab": "There are countless filters and interpretations of the phrase — and a growing amount of interest in figuring out just what it means."}, {"d5f4": "When the phrase “culture fit” is thoughtfully and deliberately applied, it can mean a gauge for your company’s essential values. At other companies, it might simply mean, “Is this a person with whom you want to have a beer after work?”"}, {"7ecc": "Wondering where that leaves people who don’t drink, people who don’t like beer or people who have after-work responsibilities like kids? Then you’re asking some great questions."}, {"c8db": "Image courtesy of Pixabay"}, {"0ecf": "Culture fit can be an exclusive term, perhaps even a new way to discriminate without even realizing we’re doing it."}, {"31e1": "“It is an incredibly vague term, and it’s a vague term often based on gut instinct,” says Wharton management professor Katherine Klein. “The biggest problem is that while we invoke cultural fit as a reason to hire someone, it is far more common to use it to not hire someone. People can’t tell you what aspect of the culture they are worried about.”"}, {"f034": "The challenges of ‘culture fit’"}, {"9c1d": "There are often good reasons to look for teammates who will “fit in” — they might feel more comfortable, they could be happier and more engaged, they might stay in the role longer."}, {"6901": "The challenge is, we don’t know how to measure or define a culture fit."}, {"7acf": "Even though culture fit is incredibly tough to define, most of us seem to think it’s important."}, {"5cf6": "In a survey by Cubiks on job and culture fit, 82 percent of those asked said they believed measuring cultural fit was an important part of the recruitment process. But only 54 percent said that their organization has a clearly defined culture."}, {"8e49": "That means many of us are trying to measure potential newcomers to a company according to a broken scale that we wouldn’t even know how to use on ourselves. Here are some of the ways the Cubiks study participants try to measure culture fit:"}, {"3ae5": "…so we come up with our own flawed ‘metrics’"}, {"142f": "Without a real scale, things like gut feeling and the “airport test” (aka, “Would I want to be stuck at an airport with this person?”) are able to gain prominence to test cultural fit, even though they’re far from scientific and can introduce tons of bias."}, {"8561": "When Lauren Rivera interviewed 120 decision makers at top U.S. investment banks, management consultancies and law firms about their recruiting practices, she learned that “shared experiences” was one of the biggest factors those hiring were using to check culture fit."}, {"214e": "“Shared experiences was one of the most powerful sources of chemistry, but interviewers were primarily interested in new hires whose hobbies, hometowns and biographies matched their own. Bonding over rowing college crew, getting certified in scuba, sipping single-malt Scotches in the Highlands or dining at Michelin-starred restaurants was evidence of fit; sharing a love of teamwork or a passion for pleasing clients was not. Some (former) athletes fit exclusively with other athletes; others fit only with those who played the same sport. At one hiring committee meeting I attended, I watched a partner who was an avid Red Sox fan argue for rejecting a Yankees supporter on the grounds of misfit.”"}, {"9145": "When we use these kinds of methods — gut feeling, the “airport test,” or looking for shared experiences, we run the risk of creating a culture in which everyone is similar. In the best-case scenario, this leads to a lack of creativity and stunts a company’s problem-solving capacity. In the worst-case scenario, it creates a faulty feedback loop that fulfills existing prejudices."}, {"b692": "Back to the Cubiks study: Although a significant number of respondents said their organization doesn’t have a definition of its culture or methods in place to measure how individuals fit with it, 59 percent said they have rejected a candidate because they lacked cultural fit."}, {"036d": "Two new phrases we’re trying instead"}, {"951f": "While we’re phasing the idea of “culture fit” out of Buffer, we still need a common language to express how a teammate works within our values and what they bring to our organization. There are two specific terms that feel like a better fit for us right now — we’re learning that they’re particularly powerful when used together."}, {"e6f7": "Cultural contribution: What do you add?"}, {"ed70": "One of the most resonant articles I’ve read about the importance of diversity in building a team is Hiring: It’s About Cultural Contribution, Not Cultural Fit by Diego Rodriguez of IDEO."}, {"59f3": "In the post, Rodriguez explains why he chooses candidates not because they fit in today but because they could make a positive contribution to the future of his company’s culture."}, {"d72d": "“I don’t optimize for fit with our existing culture, because over time that will lead to uniformity and irrelevancy. Instead, I try to envision a future where this person’s unique point of view has shifted how we work and what we value. I hire for an individual’s potential cultural contribution.”"}, {"2335": "This wording tweak seems to a ripe area for improvement. Jeff Vijungco, VP Employee Experience at Adobe, calls it a “culture complement.” Pandora employs a similar phrasing, focusing on “cultural add.”"}, {"c9b0": "“We believe that ‘culture add’ goes beyond recruiting,” Pandora’s Director of Employee Experience & Marketing, Marta Riggins, told Forbes. “It’s about creating an integrated B2E (business to employee) marketing strategy to engage and attract great talent from all communities and backgrounds, develop programs to uncover and overcome bias, and fostering a culture of inclusiveness and belonging.”"}, {"a5be": "Prioritizing cultural contribution over present-day fit is an exciting shift! Asking, as Rodriguez suggests, questions like “What’s lacking?” and “Where do we want to go?” opens up honest conversations about gaps in culture."}, {"2399": "At Buffer, this has allowed us to name aspects of our culture that aren’t where we would like them to be, and then strive to improve on those areas. We ask questions like:"}, {"b93d": "Ideally, we’re always asking what perspectives we’re lacking as we make a decision or build a product. We also ask how we can make Buffer a better place to work for parents, LGBT teammates, those with disabilities, those for whom English is not their first language, and other aspects of identity. Working towards improving Buffer’s culture where we’re lacking is a strategic decision and one that feels positive to us."}, {"197c": "Values fit: Are you aligned with specific values?"}, {"97c2": "Bringing in diverse viewpoints is great, but without any common ground to unite teammates, we could end up with a lot of division and inclusion challenges."}, {"b6ff": "That’s where the other phrase getting a lot of play at Buffer comes in. “Values fit” is a slight but meaningful iteration on culture fit that came to us via Aubrey Blanche of Atlassian."}, {"dd6f": "“Shifting our focus from ‘culture fit’ to ‘values fit’ helps us hire people who share our goals, not necessarily our viewpoints or backgrounds,” Blanche explained to Fast Company in 2016."}, {"5a63": "Making this shift led to improved diversity among more teams at Atlassian. For us at Buffer, it has provided us with a way to stay true to our values and united in the core beliefs that make Buffer the company that we know and love, while also leaving plenty of room for bringing your authentic self to work, including all the perspectives and experiences that make you unique."}, {"a954": "We don’t all have to have the same background, life experiences or abilities to focus on the values that guide our work."}, {"4272": "We try to be specific about how we measure values fit, too. We ask specific, deliberate interview questions (the same ones, in the same order, for every candidate) designed to speak to each of our core values, and everyone who interviews at Buffer knows how to test a good, not-so-good or just OK answer for every question."}, {"2a2b": "It’s quite encouraging to see this phrase inching up in popularity over time–it might even be primed to take over “culture fit,” which would be a positive change in my mind."}, {"1106": "I’m not convinced “values fit” is a 100% bias-free framework to evaluate potential teammates, but when we combine it with the concept of cultural contribution, it feels like a healthy step forward."}, {"f2f3": "Over to you!"}, {"3f6e": "Like many elements of Buffer, our vocabulary around culture and “culture fit” is constantly evolving, and I imagine it will continue to do so. We learn so much from our community, so I’d love to hear from you if you have thoughts on this topic."}, {"8e57": "How does the phrase “culture fit” feel to you? Do you use it or another phrase?"}, {"9146": "Tell us all about in the comments!"}, {"48bf": "Originally published at open.buffer.com on April 6, 2017."}], "author": "Buffer", "child": "1377_1\t1377_2\t1377_3\t1377_4\t1377_5\t1377_61377_1\t1377_2\t1377_3\t1377_4\t1377_5\t1377_6", "name": "1377", "content": "Why We’ve Stopped Saying “Culture Fit” — and What We’re Saying Instead By Courtney Seiter The phrase “culture fit” is a bit of an Inkblot test in the world of work — even when we all hear the same two words, we might be thinking entirely different things. There are countless filters and interpretations of the phrase — and a growing amount of interest in figuring out just what it means. When the phrase “culture fit” is thoughtfully and deliberately applied, it can mean a gauge for your company’s essential values. At other companies, it might simply mean, “Is this a person with whom you want to have a beer after work?” Wondering where that leaves people who don’t drink, people who don’t like beer or people who have after-work responsibilities like kids? Then you’re asking some great questions. Image courtesy of Pixabay Culture fit can be an exclusive term, perhaps even a new way to discriminate without even realizing we’re doing it. “It is an incredibly vague term, and it’s a vague term often based on gut instinct,” says Wharton management professor Katherine Klein. “The biggest problem is that while we invoke cultural fit as a reason to hire someone, it is far more common to use it to not hire someone. People can’t tell you what aspect of the culture they are worried about.” The challenges of ‘culture fit’ There are often good reasons to look for teammates who will “fit in” — they might feel more comfortable, they could be happier and more engaged, they might stay in the role longer. The challenge is, we don’t know how to measure or define a culture fit. Even though culture fit is incredibly tough to define, most of us seem to think it’s important. In a survey by Cubiks on job and culture fit, 82 percent of those asked said they believed measuring cultural fit was an important part of the recruitment process. But only 54 percent said that their organization has a clearly defined culture. That means many of us are trying to measure potential newcomers to a company according to a broken scale that we wouldn’t even know how to use on ourselves. Here are some of the ways the Cubiks study participants try to measure culture fit: …so we come up with our own flawed ‘metrics’ Without a real scale, things like gut feeling and the “airport test” (aka, “Would I want to be stuck at an airport with this person?”) are able to gain prominence to test cultural fit, even though they’re far from scientific and can introduce tons of bias. When Lauren Rivera interviewed 120 decision makers at top U.S. investment banks, management consultancies and law firms about their recruiting practices, she learned that “shared experiences” was one of the biggest factors those hiring were using to check culture fit. “Shared experiences was one of the most powerful sources of chemistry, but interviewers were primarily interested in new hires whose hobbies, hometowns and biographies matched their own. Bonding over rowing college crew, getting certified in scuba, sipping single-malt Scotches in the Highlands or dining at Michelin-starred restaurants was evidence of fit; sharing a love of teamwork or a passion for pleasing clients was not. Some (former) athletes fit exclusively with other athletes; others fit only with those who played the same sport. At one hiring committee meeting I attended, I watched a partner who was an avid Red Sox fan argue for rejecting a Yankees supporter on the grounds of misfit.” When we use these kinds of methods — gut feeling, the “airport test,” or looking for shared experiences, we run the risk of creating a culture in which everyone is similar. In the best-case scenario, this leads to a lack of creativity and stunts a company’s problem-solving capacity. In the worst-case scenario, it creates a faulty feedback loop that fulfills existing prejudices. Back to the Cubiks study: Although a significant number of respondents said their organization doesn’t have a definition of its culture or methods in place to measure how individuals fit with it, 59 percent said they have rejected a candidate because they lacked cultural fit. Two new phrases we’re trying instead While we’re phasing the idea of “culture fit” out of Buffer, we still need a common language to express how a teammate works within our values and what they bring to our organization. There are two specific terms that feel like a better fit for us right now — we’re learning that they’re particularly powerful when used together. Cultural contribution: What do you add? One of the most resonant articles I’ve read about the importance of diversity in building a team is Hiring: It’s About Cultural Contribution, Not Cultural Fit by Diego Rodriguez of IDEO. In the post, Rodriguez explains why he chooses candidates not because they fit in today but because they could make a positive contribution to the future of his company’s culture. “I don’t optimize for fit with our existing culture, because over time that will lead to uniformity and irrelevancy. Instead, I try to envision a future where this person’s unique point of view has shifted how we work and what we value. I hire for an individual’s potential cultural contribution.” This wording tweak seems to a ripe area for improvement. Jeff Vijungco, VP Employee Experience at Adobe, calls it a “culture complement.” Pandora employs a similar phrasing, focusing on “cultural add.” “We believe that ‘culture add’ goes beyond recruiting,” Pandora’s Director of Employee Experience & Marketing, Marta Riggins, told Forbes. “It’s about creating an integrated B2E (business to employee) marketing strategy to engage and attract great talent from all communities and backgrounds, develop programs to uncover and overcome bias, and fostering a culture of inclusiveness and belonging.” Prioritizing cultural contribution over present-day fit is an exciting shift! Asking, as Rodriguez suggests, questions like “What’s lacking?” and “Where do we want to go?” opens up honest conversations about gaps in culture. At Buffer, this has allowed us to name aspects of our culture that aren’t where we would like them to be, and then strive to improve on those areas. We ask questions like: Ideally, we’re always asking what perspectives we’re lacking as we make a decision or build a product. We also ask how we can make Buffer a better place to work for parents, LGBT teammates, those with disabilities, those for whom English is not their first language, and other aspects of identity. Working towards improving Buffer’s culture where we’re lacking is a strategic decision and one that feels positive to us. Values fit: Are you aligned with specific values? Bringing in diverse viewpoints is great, but without any common ground to unite teammates, we could end up with a lot of division and inclusion challenges. That’s where the other phrase getting a lot of play at Buffer comes in. “Values fit” is a slight but meaningful iteration on culture fit that came to us via Aubrey Blanche of Atlassian. “Shifting our focus from ‘culture fit’ to ‘values fit’ helps us hire people who share our goals, not necessarily our viewpoints or backgrounds,” Blanche explained to Fast Company in 2016. Making this shift led to improved diversity among more teams at Atlassian. For us at Buffer, it has provided us with a way to stay true to our values and united in the core beliefs that make Buffer the company that we know and love, while also leaving plenty of room for bringing your authentic self to work, including all the perspectives and experiences that make you unique. We don’t all have to have the same background, life experiences or abilities to focus on the values that guide our work. We try to be specific about how we measure values fit, too. We ask specific, deliberate interview questions (the same ones, in the same order, for every candidate) designed to speak to each of our core values, and everyone who interviews at Buffer knows how to test a good, not-so-good or just OK answer for every question. It’s quite encouraging to see this phrase inching up in popularity over time–it might even be primed to take over “culture fit,” which would be a positive change in my mind. I’m not convinced “values fit” is a 100% bias-free framework to evaluate potential teammates, but when we combine it with the concept of cultural contribution, it feels like a healthy step forward. Over to you! Like many elements of Buffer, our vocabulary around culture and “culture fit” is constantly evolving, and I imagine it will continue to do so. We learn so much from our community, so I’d love to hear from you if you have thoughts on this topic. How does the phrase “culture fit” feel to you? Do you use it or another phrase? Tell us all about in the comments! Originally published at open.buffer.com on April 6, 2017. "}