{"parent": "", "timestamp": "Mar 17", "title": "Dlaczego polscy programiści pracują za granicą?", "sentences": [{"ca1a": "Dlaczego polscy programiści pracują za granicą?"}, {"9df3": "Czy Ciebie też nachodzą czasem myśli, żeby rzucić swoją dotychczasową pracę i wyjechać za granicę? Mimo, że na brak ofert na polskim rynku IT narzekać raczej nie można, wielu programistów zdecydowało się opuścić kraj z powodu bardziej korzystnej oferty, proponowanej przez zachodnie firmy. Dlaczego tak się dzieje? Czy programiści także wyjeżdżają do pracy za przysłowiowym chlebem? Jaki jest powód tego, że najbardziej poszukiwani specjaliści z najbardziej dochodowej branży decydują się opuścić nasz kraj?"}, {"6a90": "Zdobywanie wartościowego doświadczenia"}, {"ad10": "Jedną z najczęstszych przyczyn wyjazdów polskich programistów za granicę jest zdobycie cennego doświadczenia. Hm, a w Polsce się da? Oczywiście, że się da, ale nie tylko o samo pracowanie tu chodzi. Praca w innym kraju poszerza horyzonty, buduje perspektywy. Czasem też daje poczucie spełnienia i sprawia, że zaczynamy inaczej patrzeć na nasze życie. Szczególnie ludzie młodzi, nie mający jeszcze większych zobowiązań, decydują się na ten krok, aby nawet po powrocie do kraju mieć po prostu, zwyczajną satysfakcję, że zdobyło się tak cenne, międzynarodowe doświadczenie."}, {"7e08": "Wyższe wynagrodzenie"}, {"f454": "Źródło: opracowanie Sedlak & Sedlak na podstawie glassdoor.com"}, {"268c": "No dobrze, zaczęłam trochę idealistycznie, ale czas do powrotu na ziemię, a tu — jak wiadomo — liczy się kasa. Kolejnym czynnikiem wpływającym na decyzję o pracy za granicą jest właśnie duże zróżnicowanie w wynagrodzeniu, które najlepiej obrazuje wykres powyżej."}, {"459a": "Jak wynika z opracowania przygotowanego przez Sedlak & Sedlak, Specjaliści ds. IT w naszym kraju pracują za stawki niemalże najmniejsze w Europie. Tylko Słowacy zarabiają o 30% mniej, a Grecy i Portugalczycy mają bardzo podobne pensje. Włosi otrzymują wynagrodzenia wyższe o około 34%, natomiast Hiszpanie i Irlandczycy o połowę. Dwa razy więcej od polskich specjalistów zarabiają Francuzi, a o 2,5 Holendrzy oraz Niemcy."}, {"865b": "Takie dane nie motywują raczej do zostania w naszym kraju i w sumie, patrząc na to zestawienie, pozwalają lepiej zrozumieć, co kierowało polskimi programistami, którzy zdecydowali się pracować na Zachodzie."}, {"81dd": "Chęć zmiany"}, {"4c6c": "Czasem wyjeżdżamy, bo po prostu nudzi nas życiowa rutyna i chcemy coś zmienić. Dzięki pracy za granicą, mamy możliwość poznania innej kultury pracy, a także zdobycia doświadczenia w międzynarodowym środowisku. Czasem dzięki takim wyjazdom, zaczynamy bardziej wyrozumiale spoglądać na polskie realia, ponieważ — jak wiadomo “wszędzie dobrze, gdzie nas ma”, a praca na Zachodzie także ma minusy, które poznamy dopiero wtedy, kiedy jej doświadczymy."}, {"328f": "Ciekawe projekty i większe perspektywy rozwoju"}, {"9756": "Wiadomo, programiści to osoby ambitne, dla których bardzo ważne są także fajne i rozwojowe projekty. Mimo, że w Polsce też raczej takich nie brakuje, Zachód wciąż daje więcej możliwości. Duża różnorodność projektów, innowacyjne metody i narzędzia pracy, dostępność najnowszych rozwiązań technologicznych, praca u rozpoznawalnych marek— to wszystko przyciąga polskich specjalistów, aby spróbować swoich sił za granicą. Wielu programistów podkreśla, że to własnie atrakcyjność realizowanego projektu, umożliwiająca zdobycie doświadczenia i rozwinięcia swoich umiejętności, miała decydujący wpływ na to, że postanowili wyjechać z kraju."}, {"67b5": "Badania"}, {"5c1b": "Źródło: antal.pl"}, {"c9e4": "A co na to sami zainteresowani?"}, {"c86a": "Aby lepiej zrozumieć powody wyjazdów polskich programistów za granicę, poprosiłam o wypowiedź Łukasza, który przez 3 lata pracował w Austrii na stanowisku JavaScript Developera."}, {"f4fb": "Główną przyczyną mojego wyjazdu do Austrii było po prostu zdobycie fajnego doświadczenia, nie tylko zawodowego, ale również życiowego. Dostałem wiadomość od kolegi, że firma, w której pracuje szuka pracowników i to w sumie za jego namową, zdecydowałem się na wyjazd z kraju. Nie żałuje tej decyzji, rzeczywiście zdobyłem super doświadczenie, a przede wszystkim poznałem wielu świetnych ludzi, z którymi utrzymuję kontakt, nawet po powrocie do kraju. W Austrii jest zupełnie inna kultura pracy, inny poziom i stosunek do życia. Nawet nie wiem — lepszy czy gorszy, po prostu inny, trochę bardziej oficjalny i poważny. Było fajnie, cieszę się, że tam pracowałem, ale jeszcze bardziej cieszę się, że wróciłem. Polecam wszystkim — zarówno wyjazdy, jak i powroty!"}, {"4de6": "Mimo, że Zachód, spoglądając chociażby na oferowane zarobki, rzeczywiście kusi polskich programistów, zadecydowana większość nie zakłada wyjazdu za granicę na stałe. Coraz bardziej zauważalny jest wręcz odwrotny trend — w Polsce powstaje coraz więcej filii międzynarodowych firm informatycznych i z roku na rok przybywa do nas coraz więcej obcokrajowców. Polscy specjaliści IT pracujący za granicą, często decydują się na powrót do kraju, czego przykładem jest chociażby historia założycieli No Fluff Jobs. Bo jak mówi stare, polskie przysłowie “wszędzie dobrze, ale w domu najlepiej”!"}, {"c7fb": "A czy Wy próbowaliście swoich sił za granicą? A może ktoś z Was nadal pracuje poza krajem? Jeśli tak — koniecznie podzielcie się z nami swoimi doświadczeniami!"}], "author": "Katarzyna Rojewska", "child": "1379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_61379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_61379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_61379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_61379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_61379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_61379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_61379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_61379_1\t1379_2\t1379_3\t1379_4\t1379_5\t1379_6", "name": "1379", "content": "Dlaczego polscy programiści pracują za granicą? Czy Ciebie też nachodzą czasem myśli, żeby rzucić swoją dotychczasową pracę i wyjechać za granicę? Mimo, że na brak ofert na polskim rynku IT narzekać raczej nie można, wielu programistów zdecydowało się opuścić kraj z powodu bardziej korzystnej oferty, proponowanej przez zachodnie firmy. Dlaczego tak się dzieje? Czy programiści także wyjeżdżają do pracy za przysłowiowym chlebem? Jaki jest powód tego, że najbardziej poszukiwani specjaliści z najbardziej dochodowej branży decydują się opuścić nasz kraj? Zdobywanie wartościowego doświadczenia Jedną z najczęstszych przyczyn wyjazdów polskich programistów za granicę jest zdobycie cennego doświadczenia. Hm, a w Polsce się da? Oczywiście, że się da, ale nie tylko o samo pracowanie tu chodzi. Praca w innym kraju poszerza horyzonty, buduje perspektywy. Czasem też daje poczucie spełnienia i sprawia, że zaczynamy inaczej patrzeć na nasze życie. Szczególnie ludzie młodzi, nie mający jeszcze większych zobowiązań, decydują się na ten krok, aby nawet po powrocie do kraju mieć po prostu, zwyczajną satysfakcję, że zdobyło się tak cenne, międzynarodowe doświadczenie. Wyższe wynagrodzenie Źródło: opracowanie Sedlak & Sedlak na podstawie glassdoor.com No dobrze, zaczęłam trochę idealistycznie, ale czas do powrotu na ziemię, a tu — jak wiadomo — liczy się kasa. Kolejnym czynnikiem wpływającym na decyzję o pracy za granicą jest właśnie duże zróżnicowanie w wynagrodzeniu, które najlepiej obrazuje wykres powyżej. Jak wynika z opracowania przygotowanego przez Sedlak & Sedlak, Specjaliści ds. IT w naszym kraju pracują za stawki niemalże najmniejsze w Europie. Tylko Słowacy zarabiają o 30% mniej, a Grecy i Portugalczycy mają bardzo podobne pensje. Włosi otrzymują wynagrodzenia wyższe o około 34%, natomiast Hiszpanie i Irlandczycy o połowę. Dwa razy więcej od polskich specjalistów zarabiają Francuzi, a o 2,5 Holendrzy oraz Niemcy. Takie dane nie motywują raczej do zostania w naszym kraju i w sumie, patrząc na to zestawienie, pozwalają lepiej zrozumieć, co kierowało polskimi programistami, którzy zdecydowali się pracować na Zachodzie. Chęć zmiany Czasem wyjeżdżamy, bo po prostu nudzi nas życiowa rutyna i chcemy coś zmienić. Dzięki pracy za granicą, mamy możliwość poznania innej kultury pracy, a także zdobycia doświadczenia w międzynarodowym środowisku. Czasem dzięki takim wyjazdom, zaczynamy bardziej wyrozumiale spoglądać na polskie realia, ponieważ — jak wiadomo “wszędzie dobrze, gdzie nas ma”, a praca na Zachodzie także ma minusy, które poznamy dopiero wtedy, kiedy jej doświadczymy. Ciekawe projekty i większe perspektywy rozwoju Wiadomo, programiści to osoby ambitne, dla których bardzo ważne są także fajne i rozwojowe projekty. Mimo, że w Polsce też raczej takich nie brakuje, Zachód wciąż daje więcej możliwości. Duża różnorodność projektów, innowacyjne metody i narzędzia pracy, dostępność najnowszych rozwiązań technologicznych, praca u rozpoznawalnych marek— to wszystko przyciąga polskich specjalistów, aby spróbować swoich sił za granicą. Wielu programistów podkreśla, że to własnie atrakcyjność realizowanego projektu, umożliwiająca zdobycie doświadczenia i rozwinięcia swoich umiejętności, miała decydujący wpływ na to, że postanowili wyjechać z kraju. Badania Źródło: antal.pl A co na to sami zainteresowani? Aby lepiej zrozumieć powody wyjazdów polskich programistów za granicę, poprosiłam o wypowiedź Łukasza, który przez 3 lata pracował w Austrii na stanowisku JavaScript Developera. Główną przyczyną mojego wyjazdu do Austrii było po prostu zdobycie fajnego doświadczenia, nie tylko zawodowego, ale również życiowego. Dostałem wiadomość od kolegi, że firma, w której pracuje szuka pracowników i to w sumie za jego namową, zdecydowałem się na wyjazd z kraju. Nie żałuje tej decyzji, rzeczywiście zdobyłem super doświadczenie, a przede wszystkim poznałem wielu świetnych ludzi, z którymi utrzymuję kontakt, nawet po powrocie do kraju. W Austrii jest zupełnie inna kultura pracy, inny poziom i stosunek do życia. Nawet nie wiem — lepszy czy gorszy, po prostu inny, trochę bardziej oficjalny i poważny. Było fajnie, cieszę się, że tam pracowałem, ale jeszcze bardziej cieszę się, że wróciłem. Polecam wszystkim — zarówno wyjazdy, jak i powroty! Mimo, że Zachód, spoglądając chociażby na oferowane zarobki, rzeczywiście kusi polskich programistów, zadecydowana większość nie zakłada wyjazdu za granicę na stałe. Coraz bardziej zauważalny jest wręcz odwrotny trend — w Polsce powstaje coraz więcej filii międzynarodowych firm informatycznych i z roku na rok przybywa do nas coraz więcej obcokrajowców. Polscy specjaliści IT pracujący za granicą, często decydują się na powrót do kraju, czego przykładem jest chociażby historia założycieli No Fluff Jobs. Bo jak mówi stare, polskie przysłowie “wszędzie dobrze, ale w domu najlepiej”! A czy Wy próbowaliście swoich sił za granicą? A może ktoś z Was nadal pracuje poza krajem? Jeśli tak — koniecznie podzielcie się z nami swoimi doświadczeniami! "}