{"parent": "", "timestamp": "Apr 8", "title": "Seventeen No’s. To Free Or Not To Free", "sentences": [{"760d": "Seventeen No’s. To Free Or Not To Free"}, {"8732": "Armstrong Economics"}, {"93c1": "For those of you who think that writing on Medium will get you other writing offers, I have good news. It will."}, {"b58f": "Since I began on Medium in December 2016, I have gotten 17 offers to write for other sites. The last one was yesterday."}, {"3115": "I have looked into them all. All appear (who knows on the Internet) to be real. Many are sound and interesting."}, {"d1f0": "I have said no to all of them."}, {"4906": "Why? Simply because they have all wanted me to write for free."}, {"4fc0": "I write for free on Medium. That’s my choice. It won’t ever change."}, {"e685": "Writing for 17 more publications for free would mean 17 times more work for, well, nothing."}, {"328a": "Or maybe for more exposure that would get me more offers to write for free."}, {"f719": "So what’s the point?"}, {"5fbe": "I live on Social Security, $1205 per month. If I’d been paid one dollar for every read I’ve had on Medium I’d be (in my life) rich. Of course, that is not in the stars."}, {"ac8a": "Why would I want to provide free “content” to 17 more publications to stay as poor as I am?"}, {"cb04": "It’s not about the money, not really. It’s about the arrogance of publications who think I should be happy to do work they can profit from without any profit for myself. It’s as if they are saying:"}, {"be40": "Hey, Mike. Here’s an opportunity to help us out by being a slave!"}, {"0e86": "Medium does the same thing, of course. But If you are going to be a slave, it’s probably a good thing to only have one master."}, {"4293": "So no thanks folks, one owner is enough for me."}, {"9d35": "Mike"}, {"1f28": "If you value my work, and can afford it, please consider occasionally sending me a buck or two at Paypal. Even poets have to eat. :)"}, {"c8e1": "Pay Mike Essig using PayPal.MeGo to paypal.me/bookgardener and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me"}], "author": "Mike Essig", "child": "1380_1\t1380_2\t1380_3\t1380_4\t1380_5\t1380_6\t1380_7\t1380_8\t1380_9\t1380_10\t1380_11\t1380_12\t1380_13\t1380_14\t1380_15\t1380_16\t1380_17\t1380_18\t1380_19\t1380_20\t1380_21\t1380_221380_1\t1380_2\t1380_3\t1380_4\t1380_5\t1380_6\t1380_7\t1380_8\t1380_9\t1380_10\t1380_11\t1380_12\t1380_13\t1380_14\t1380_15\t1380_16\t1380_17\t1380_18\t1380_19\t1380_20\t1380_21\t1380_22", "name": "1380", "content": "Seventeen No’s. To Free Or Not To Free Armstrong Economics For those of you who think that writing on Medium will get you other writing offers, I have good news. It will. Since I began on Medium in December 2016, I have gotten 17 offers to write for other sites. The last one was yesterday. I have looked into them all. All appear (who knows on the Internet) to be real. Many are sound and interesting. I have said no to all of them. Why? Simply because they have all wanted me to write for free. I write for free on Medium. That’s my choice. It won’t ever change. Writing for 17 more publications for free would mean 17 times more work for, well, nothing. Or maybe for more exposure that would get me more offers to write for free. So what’s the point? I live on Social Security, $1205 per month. If I’d been paid one dollar for every read I’ve had on Medium I’d be (in my life) rich. Of course, that is not in the stars. Why would I want to provide free “content” to 17 more publications to stay as poor as I am? It’s not about the money, not really. It’s about the arrogance of publications who think I should be happy to do work they can profit from without any profit for myself. It’s as if they are saying: Hey, Mike. Here’s an opportunity to help us out by being a slave! Medium does the same thing, of course. But If you are going to be a slave, it’s probably a good thing to only have one master. So no thanks folks, one owner is enough for me. Mike If you value my work, and can afford it, please consider occasionally sending me a buck or two at Paypal. Even poets have to eat. :) Pay Mike Essig using PayPal.MeGo to paypal.me/bookgardener and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me "}