{"parent": "", "timestamp": "Dec 23, 2016", "title": "M2M Day 53: Smoothing out my face", "sentences": [{"4488": "M2M Day 53: Smoothing out my face"}, {"9660": "This post is part of Month to Master, a 12-month accelerated learning project. For December, my goal is to draw a realistic self-portrait with only pencil and paper."}, {"2eb5": "I picked up some new blending stumps today, and went to work smoothing the value changes over my face and neck. Here’s the result…"}, {"0312": "When compared with the before, the difference is pretty striking. In the before portrait, I look like a sickly, pencil-sketched version of myself, while the after version has a much nicer roundness and weight to it."}, {"5607": "Tomorrow, I’ll make some minor tweaks, sign it, and hang it on the wall."}, {"4e3c": "Read the next post. Read the previous post."}, {"9e19": "Max Deutsch is a product manager at Intuit, the creator of Somebody.io and Rightspeed, and the guinea pig for Month to Master."}, {"1e64": "If you want to follow along with Max’s year-long accelerated learning project, make sure to follow this Medium account."}], "author": "Max Deutsch", "child": "1388_1\t1388_21388_1\t1388_2", "name": "1388", "content": "M2M Day 53: Smoothing out my face This post is part of Month to Master, a 12-month accelerated learning project. For December, my goal is to draw a realistic self-portrait with only pencil and paper. I picked up some new blending stumps today, and went to work smoothing the value changes over my face and neck. Here’s the result… When compared with the before, the difference is pretty striking. In the before portrait, I look like a sickly, pencil-sketched version of myself, while the after version has a much nicer roundness and weight to it. Tomorrow, I’ll make some minor tweaks, sign it, and hang it on the wall. Read the next post. Read the previous post. Max Deutsch is a product manager at Intuit, the creator of Somebody.io and Rightspeed, and the guinea pig for Month to Master. If you want to follow along with Max’s year-long accelerated learning project, make sure to follow this Medium account. "}