{"parent": "", "timestamp": "Dec 28, 2016", "title": "MY ART COLLECTION EXPOSÉ", "sentences": [{"124b": "MY ART COLLECTION EXPOSÉ"}, {"95de": "This is an attempt at showing my fellow bloggers my art pieces, I mostly used pencil, pen and watercolour for them."}, {"d63b": "Ready? Go!"}, {"0ce2": "This was my first art work. This was an eye opener that I could actually do it. That it was in me. I drew this while in Secondary School."}, {"57b6": "This was my second, still in Secondary School. This was an encouragement to proceed with art. I was really proud of myself after this."}, {"5428": "Lol! This was my first attempt to draw an actual being. My little nephew. It was a bit scrawny. Pardon for the usage of that word. But I never gave up. I guess the only thing I got right were the word AUTHENTIC."}, {"9a98": "This was my first attempt to enlarge a particular drawing and it worked. Don’t ask me how I did, because even I don’t know. Disney Princesses. I love them!"}, {"533c": "Oh LA LA! I drew this piece two. I learned how to distort images by myself with this piece. The second picture was the real picture I drew it from, just made my own little change. It was interesting trust me."}, {"60cd": "I actually drew this off my Aunty’s pillowcase. Loved the cartoon and since I couldn’t have it, I drew it."}, {"7839": "A lot of you know this. It’s Anna and Elsa. One of my favs."}, {"6ab1": "My Christmas painting last two years. I drew it off a magazine I couldn’t have."}, {"bf44": "The former president of Nigeria (1993–2007)— Olusegun Obasanjo."}, {"841b": "Christmas painting from last two years."}, {"0cbe": "Christmas painting from last two years."}, {"9dbb": "Cash madam, was just playing with my pencil and this was the result."}, {"54c7": "I named this funky gal. It’s also one of my favourites."}, {"17d8": "I drew this with so much love for my family."}, {"bcaf": "Last but not the least an attempt at drawing an Italian woman. Don’t blame me for the face!"}], "author": "Favour Uche", "child": "1389_1\t1389_2", "name": "1389", "content": "MY ART COLLECTION EXPOSÉ This is an attempt at showing my fellow bloggers my art pieces, I mostly used pencil, pen and watercolour for them. Ready? Go! This was my first art work. This was an eye opener that I could actually do it. That it was in me. I drew this while in Secondary School. This was my second, still in Secondary School. This was an encouragement to proceed with art. I was really proud of myself after this. Lol! This was my first attempt to draw an actual being. My little nephew. It was a bit scrawny. Pardon for the usage of that word. But I never gave up. I guess the only thing I got right were the word AUTHENTIC. This was my first attempt to enlarge a particular drawing and it worked. Don’t ask me how I did, because even I don’t know. Disney Princesses. I love them! Oh LA LA! I drew this piece two. I learned how to distort images by myself with this piece. The second picture was the real picture I drew it from, just made my own little change. It was interesting trust me. I actually drew this off my Aunty’s pillowcase. Loved the cartoon and since I couldn’t have it, I drew it. A lot of you know this. It’s Anna and Elsa. One of my favs. My Christmas painting last two years. I drew it off a magazine I couldn’t have. The former president of Nigeria (1993–2007)— Olusegun Obasanjo. Christmas painting from last two years. Christmas painting from last two years. Cash madam, was just playing with my pencil and this was the result. I named this funky gal. It’s also one of my favourites. I drew this with so much love for my family. Last but not the least an attempt at drawing an Italian woman. Don’t blame me for the face! "}