{"parent": "", "timestamp": "Apr 14", "title": "She was Leaving", "sentences": [{"2c40": "She was Leaving"}, {"b6ab": "www.pixabay.com"}, {"be33": "She was leaving."}, {"720c": "She couldn’t stay, not here, not now, not any longer."}, {"63f9": "She was tired and frustrated and lonely and sad and trapped."}, {"c0e0": "She was done with him; his smell, his smile, those eyes, that feeling she got each time he was there."}, {"c409": "She had wanted so badly to go for days, weeks, months, but couldn’t because she always stayed."}, {"9d05": "She was emotionally and physically spent; her reserve was empty, she was done."}, {"5eb2": "She ran."}, {"4a7d": "~~~~~"}, {"46aa": "He knew she was gone."}, {"a2bb": "He smoldered, literally as he stood in their, his empty place."}, {"0f12": "He had really screwed up; broken the one thing in the world that made him feel sane."}, {"a9c4": "He missed her, them, what they once were but hadn’t been in so long."}, {"e0cd": "He should have loved her, the way she needed, but just couldn’t and didn’t know why."}, {"bd73": "He wanted to go back, to fabricate one less lie, to hold her, to caress her hair just so."}, {"b18c": "He fumed."}, {"b1a2": "~~~~~"}, {"b359": "She finally breathed."}, {"b3f2": "She melted into her sister’s arms."}, {"9fcc": "She sat in the big chair by the window; crying, yet finally happy."}, {"b1ae": "She wasn’t sure where to go or what to do or who this person sitting here even was anymore."}, {"088f": "She needed to find herself, again; rebuilding from the bottom floor, brick by brick."}, {"284e": "She knew that as low as now was, that it was temporary and that bouncing back was inevitable."}, {"265a": "She dreamed."}, {"52b5": "~~~~~"}, {"8d93": "He was lost."}, {"0458": "He had never really been on his own, ever."}, {"6166": "He was the sort of guy who needed someone, to feel accepted and whole."}, {"406f": "He always chased them away; his own worst enemy friends told him."}, {"e2ae": "He kept busy by throwing himself into work, the gym, the sidewalks at night; trying to think."}, {"8d7d": "He prayed for one last chance to win her back, to show the improvement he had made for her."}, {"4af1": "He longed."}, {"f4a7": "~~~~~"}, {"92c8": "She was a new person."}, {"7eb4": "She felt alive and free and happy."}, {"0ac3": "She used to believe that life was something that happened to her, that she was but a passenger."}, {"4c18": "She was finally moving up and going places and not looking back at her old self and life and sadness."}, {"a102": "She thought of him here and there; a song, a movie, a fragrance, but the thoughts were fleeting."}, {"ec46": "She enjoyed being single, no compromises or concessions; totally able to be herself all the time."}, {"d0b4": "She laughed."}, {"85d2": "~~~~~"}, {"b827": "He was a new person."}, {"1ca9": "He struggled and struggled, felt pain, but time did heal his wounds."}, {"5e30": "He looked like a whole different man; new clothes, new apartment, new approach, new life."}, {"0543": "He listened to others when they spoke, really listened and really cared unlike he ever had before."}, {"6106": "He thought of her; hoping she was happy, holding no grudges, remembering all the good about her."}, {"10be": "He saw now that she had helped him, when they were together and by leaving; ripping off the bandage."}, {"b883": "He grew."}], "author": "Tommy Paley", "child": "1394_1\t1394_2", "name": "1394", "content": "She was Leaving www.pixabay.com She was leaving. She couldn’t stay, not here, not now, not any longer. She was tired and frustrated and lonely and sad and trapped. She was done with him; his smell, his smile, those eyes, that feeling she got each time he was there. She had wanted so badly to go for days, weeks, months, but couldn’t because she always stayed. She was emotionally and physically spent; her reserve was empty, she was done. She ran. ~~~~~ He knew she was gone. He smoldered, literally as he stood in their, his empty place. He had really screwed up; broken the one thing in the world that made him feel sane. He missed her, them, what they once were but hadn’t been in so long. He should have loved her, the way she needed, but just couldn’t and didn’t know why. He wanted to go back, to fabricate one less lie, to hold her, to caress her hair just so. He fumed. ~~~~~ She finally breathed. She melted into her sister’s arms. She sat in the big chair by the window; crying, yet finally happy. She wasn’t sure where to go or what to do or who this person sitting here even was anymore. She needed to find herself, again; rebuilding from the bottom floor, brick by brick. She knew that as low as now was, that it was temporary and that bouncing back was inevitable. She dreamed. ~~~~~ He was lost. He had never really been on his own, ever. He was the sort of guy who needed someone, to feel accepted and whole. He always chased them away; his own worst enemy friends told him. He kept busy by throwing himself into work, the gym, the sidewalks at night; trying to think. He prayed for one last chance to win her back, to show the improvement he had made for her. He longed. ~~~~~ She was a new person. She felt alive and free and happy. She used to believe that life was something that happened to her, that she was but a passenger. She was finally moving up and going places and not looking back at her old self and life and sadness. She thought of him here and there; a song, a movie, a fragrance, but the thoughts were fleeting. She enjoyed being single, no compromises or concessions; totally able to be herself all the time. She laughed. ~~~~~ He was a new person. He struggled and struggled, felt pain, but time did heal his wounds. He looked like a whole different man; new clothes, new apartment, new approach, new life. He listened to others when they spoke, really listened and really cared unlike he ever had before. He thought of her; hoping she was happy, holding no grudges, remembering all the good about her. He saw now that she had helped him, when they were together and by leaving; ripping off the bandage. He grew. "}