{"parent": "", "timestamp": "Apr 11", "title": "8 Steps You Must Take to Write a Book", "sentences": [{"c7b9": "8 Steps You Must Take to Write a Book"}, {"8e33": "If you’re a writer, then there’s a strong chance you pay a lot of attention to getting your work published. And rightly so. It’s important for writers to know their options so that they can make the best choice for their completed work."}, {"d4a9": "But publishing isn’t the hardest part of writing a book. Not even close. It’s the writing."}, {"da83": "If you’re not a full-time writer, living in a cabin in the woods, how will you actually write your book?"}, {"f5a8": "How will you do the work of writing when the demands of real life threaten to overwhelm your already busy schedule?"}, {"7239": "I struggled with this for years. As an aspiring writer, I dreamed of one day sharing my words with the world. But the truth is I was kidding myself."}, {"f449": "Why? Because I wasn’t writing. I didn’t even know where to start."}, {"99a9": "Fast forward seven years, and now I’m the best-selling author of four books and living the life I always dreamed of. I haven’t gotten everything right along the way, but I have gathered some helpful advice that has kept me going."}, {"1be4": "It takes a lot more than a dream to make it as a writer. It takes knowing what you’re doing, or at least knowing the next step."}, {"40a5": "So here are the first eight steps I take toward writing my first book. This is what I did when I didn’t know what to do next. This is what it looked like for me to move from aspiring writer with a day job to full-time writer and bestselling author. It really is this easy. And this hard."}, {"d9dc": "1. Choose a topic"}, {"d05a": "You must have something important to share before you start writing. Like F. Scott Fitzgerald said, “You don’t write because you want to say something. You write because you have something to say.” What will you write about?"}, {"8e21": "When I was struggling with this, I went one level deeper and started writing about writing. Turns out, that was the perfect first step for me, because I’m still doing it today."}, {"01b2": "You need a topic that you care enough about to sustain it for the length of a book, a blog, or newsletter. Sometimes all three, and more. You’re not imprisoned by that first idea, of course — you can pivot without losing your audience — but this gives you an idea of how big your topic needs to be. Here are some ideas to get you started."}, {"7942": "2. Develop a premise"}, {"daa9": "You need an angle, a hook. There are no new ideas, but you can do something original in the way you present your idea."}, {"30cc": "Consider how Seth Godin writes about marketing, or how Ernest Hemingway wrote about bullfighting."}, {"f387": "Everything’s been done before, but you haven’t done it before. That’s the difference. That’s your premise."}, {"c676": "3. Think about your reader"}, {"7b13": "The golden rule of writing is that you must know your audience. You must know a lot about them and their needs so that when you write, they know you understand where they’re coming from. If you do that, if you meet them where they are, you can lift them up to where you want them to be."}, {"10f3": "And they’ll be forever loyal to you because of it."}, {"02b3": "4. Create an outline"}, {"6f9a": "An outline often feels like the boring part of writing. Maybe you think it’s limiting your creativity or holding you back from just getting started. But the truth is, taking the time to create an outline will make the rest of your writing go so much faster and more smoothly."}, {"821d": "I know from experience. While writing my fifth book this summer, I realized two-thirds of the way through — after writing 40,000 words — that everything was suddenly coming more easily than they had in previous chapters. Why? Because I’d accidentally given myself an outline: Five things, in order, that I wanted to make sure to cover in that chapter. And with that outline in front of me, writing became a simple exercise of filling in the blanks. (Simple, but not easy, of course.)"}, {"db60": "5. Read, read, read"}, {"0b56": "If you want to be a writer, reading is not a luxury. It is a necessity. You must read widely and frequently both to see how it’s done, and to see how you can do it differently."}, {"fa3f": "There’s no shortcut to this, but I do know of a few ways to get more reading time into your day."}, {"ab99": "6. Set a due date"}, {"54de": "When my wife was pregnant earlier this year, we knew the day that our daughter would be arriving. That due date set in motion all kinds of activity for our family and my business. We knew we had to be done by a specific date because ready or not, we would be adding to our family that day. There was no opportunity to procrastinate, no leeway for laziness."}, {"4f86": "Treat your writing the same way, with the same dedication to a due date."}, {"c3d7": "Once you’ve decided what you want to write and who it’s for, it’s time to be a professional and commit to a completion date. If you don’t, life has a way of interrupting and overshadowing our best intentions."}, {"a52b": "If an arbitrary completion date isn’t sufficient motivation for you, attach a consequence to not accomplishing your goal."}, {"2d3d": "A friend of mine, a talented writer, did this recently when he wanted to finish a book he’d been thinking about for years. Fearing he might never reach the last page, he wrote a check to a political candidate he hated, and post-dated it for X months in the future. Then he gave the check to a friend with strict instructions to mail it if he had not completed his book by that date."}, {"61d1": "The result? He’s done with his book."}, {"35bc": "7. Create a writing schedule"}, {"2f66": "Your season of life will dictate the writing schedule that works for you, so there’s no use in trying to copy what another author is doing."}, {"5358": "We can find inspiration in how others structure their days, but the point is this: Find a regular schedule that works for you, and commit to showing up on that schedule from now until the day your book is complete."}, {"baab": "There will be days it’s tempting to skip, and those, of course, are the days it’s probably most important that you keep showing up. That’s what a schedule is, after all. It’s a way to remove your own willpower and whims from the work of being an author. Because yes, even a dream job is still a job."}, {"a2c2": "8. Write, don’t edit"}, {"6dac": "We hear this one all the time, but it bears repeating because it’s almost always the thing that’s keeping you from finishing your book."}, {"5767": "If you’re obsessing over every sentence as you write it, you’re not just being a perfectionist. You’re actually withholding momentum from yourself; you’re preventing yourself from entering into that all-important state of “flow” where the words come easily and the goal feels achievable."}, {"f9d7": "If you’re trying to write entirely perfect sentences and a perfect book, you’re pursuing the wrong goal. Instead, find a strategy that will allow you to write first, and edit later. I use what I call the three-bucket system, and maybe that will help you, too."}, {"4fd5": "What makes a writer is the writing. So you’d better get started."}, {"1819": "Call to Action"}, {"3b46": "Want to become a professional writer in less than 18 months? If so, get my free strategy-guide where I teach everything I know."}, {"d6b3": "Get your strategy-guide right now."}], "author": "Jeff Goins", "child": "1405_1\t1405_2\t1405_3\t1405_4\t1405_5\t1405_6\t1405_7\t1405_8\t1405_9\t1405_10\t1405_11\t1405_12\t1405_13\t1405_14\t1405_15\t1405_16\t1405_17\t1405_18\t1405_19\t1405_20\t1405_21", "name": "1405", "content": "8 Steps You Must Take to Write a Book If you’re a writer, then there’s a strong chance you pay a lot of attention to getting your work published. And rightly so. It’s important for writers to know their options so that they can make the best choice for their completed work. But publishing isn’t the hardest part of writing a book. Not even close. It’s the writing. If you’re not a full-time writer, living in a cabin in the woods, how will you actually write your book? How will you do the work of writing when the demands of real life threaten to overwhelm your already busy schedule? I struggled with this for years. As an aspiring writer, I dreamed of one day sharing my words with the world. But the truth is I was kidding myself. Why? Because I wasn’t writing. I didn’t even know where to start. Fast forward seven years, and now I’m the best-selling author of four books and living the life I always dreamed of. I haven’t gotten everything right along the way, but I have gathered some helpful advice that has kept me going. It takes a lot more than a dream to make it as a writer. It takes knowing what you’re doing, or at least knowing the next step. So here are the first eight steps I take toward writing my first book. This is what I did when I didn’t know what to do next. This is what it looked like for me to move from aspiring writer with a day job to full-time writer and bestselling author. It really is this easy. And this hard. 1. Choose a topic You must have something important to share before you start writing. Like F. Scott Fitzgerald said, “You don’t write because you want to say something. You write because you have something to say.” What will you write about? When I was struggling with this, I went one level deeper and started writing about writing. Turns out, that was the perfect first step for me, because I’m still doing it today. You need a topic that you care enough about to sustain it for the length of a book, a blog, or newsletter. Sometimes all three, and more. You’re not imprisoned by that first idea, of course — you can pivot without losing your audience — but this gives you an idea of how big your topic needs to be. Here are some ideas to get you started. 2. Develop a premise You need an angle, a hook. There are no new ideas, but you can do something original in the way you present your idea. Consider how Seth Godin writes about marketing, or how Ernest Hemingway wrote about bullfighting. Everything’s been done before, but you haven’t done it before. That’s the difference. That’s your premise. 3. Think about your reader The golden rule of writing is that you must know your audience. You must know a lot about them and their needs so that when you write, they know you understand where they’re coming from. If you do that, if you meet them where they are, you can lift them up to where you want them to be. And they’ll be forever loyal to you because of it. 4. Create an outline An outline often feels like the boring part of writing. Maybe you think it’s limiting your creativity or holding you back from just getting started. But the truth is, taking the time to create an outline will make the rest of your writing go so much faster and more smoothly. I know from experience. While writing my fifth book this summer, I realized two-thirds of the way through — after writing 40,000 words — that everything was suddenly coming more easily than they had in previous chapters. Why? Because I’d accidentally given myself an outline: Five things, in order, that I wanted to make sure to cover in that chapter. And with that outline in front of me, writing became a simple exercise of filling in the blanks. (Simple, but not easy, of course.) 5. Read, read, read If you want to be a writer, reading is not a luxury. It is a necessity. You must read widely and frequently both to see how it’s done, and to see how you can do it differently. There’s no shortcut to this, but I do know of a few ways to get more reading time into your day. 6. Set a due date When my wife was pregnant earlier this year, we knew the day that our daughter would be arriving. That due date set in motion all kinds of activity for our family and my business. We knew we had to be done by a specific date because ready or not, we would be adding to our family that day. There was no opportunity to procrastinate, no leeway for laziness. Treat your writing the same way, with the same dedication to a due date. Once you’ve decided what you want to write and who it’s for, it’s time to be a professional and commit to a completion date. If you don’t, life has a way of interrupting and overshadowing our best intentions. If an arbitrary completion date isn’t sufficient motivation for you, attach a consequence to not accomplishing your goal. A friend of mine, a talented writer, did this recently when he wanted to finish a book he’d been thinking about for years. Fearing he might never reach the last page, he wrote a check to a political candidate he hated, and post-dated it for X months in the future. Then he gave the check to a friend with strict instructions to mail it if he had not completed his book by that date. The result? He’s done with his book. 7. Create a writing schedule Your season of life will dictate the writing schedule that works for you, so there’s no use in trying to copy what another author is doing. We can find inspiration in how others structure their days, but the point is this: Find a regular schedule that works for you, and commit to showing up on that schedule from now until the day your book is complete. There will be days it’s tempting to skip, and those, of course, are the days it’s probably most important that you keep showing up. That’s what a schedule is, after all. It’s a way to remove your own willpower and whims from the work of being an author. Because yes, even a dream job is still a job. 8. Write, don’t edit We hear this one all the time, but it bears repeating because it’s almost always the thing that’s keeping you from finishing your book. If you’re obsessing over every sentence as you write it, you’re not just being a perfectionist. You’re actually withholding momentum from yourself; you’re preventing yourself from entering into that all-important state of “flow” where the words come easily and the goal feels achievable. If you’re trying to write entirely perfect sentences and a perfect book, you’re pursuing the wrong goal. Instead, find a strategy that will allow you to write first, and edit later. I use what I call the three-bucket system, and maybe that will help you, too. What makes a writer is the writing. So you’d better get started. Call to Action Want to become a professional writer in less than 18 months? If so, get my free strategy-guide where I teach everything I know. Get your strategy-guide right now. "}