{"parent": "", "timestamp": "Mar 7", "title": "Jogos ilocalizáveis", "sentences": [{"72fa": "Jogos ilocalizáveis"}, {"80d4": "E se eu contar para vocês que há jogos impossíveis de localizar?"}, {"cde7": "Um localizador de jogos quase sempre é também um gamer. Eu sou. Meus colegas localizadores que conheço também são. Não dá para generalizar, porque sempre há uma exceção à regra, mas vocês entenderam a ideia. Serve para conhecermos novas referências, compreender o trabalho dos nossos clientes, saber as tendências do mercado, essas coisas. Como eu amo jogar, sempre estou me aventurando por novos (ou antigos) universos em alguma tela. E hoje eu queria falar sobre um jogo que conheci há algum tempo e finalizei há pouco: Undertale. E queria falar também sobre como ele é ilocalizável. Antes que alguém fale que é possível sim localizar todo e qualquer jogo, desde que haja tempo, orçamento e bons tradutores, eu queria relembrar o que acabei de escrever, que não dá para generalizar, porque sempre há uma exceção à regra. Undertale é essa exceção."}, {"4939": "ATENÇÃO! ESTRAGADORES, digo, SPOILERS! Se você não jogou Undertale e pretende jogar, aviso agora: eu vou estragar uma das maiores surpresas do jogo. E Undertale é um jogo que deve ser jogado no escuro, ou seja, é melhor não saber de nada antes, para sentir as emoções que o desenvolvedor pretendeu que o jogador sentisse. É melhor não ler nenhum “estragador” antes (gostei desse termo bizarro). O jogo é curto, dá para finalizar em cerca de seis horas, então pare de ler aqui, jogue até o final pela primeira vez e depois volte."}, {"0883": "Eu avisei."}, {"07cc": "Eu vou começar devagar com essa história do “ilocalizável”, porque grande parte do que eu falar aqui tem solução, nem sempre linguística, mas ainda assim uma solução."}, {"811a": "O primeiro problema, e uma das características mais marcantes do jogo, é o humor. Há pelo menos dois personagens que são esqueletos (talvez haja mais, há várias teorias da conspiração). Um deles, chamado Sans, é um grande piadista. E ele mesmo diz que adora trocadilhos. Aí começa o pesadelo do localizador, traduzir os trocadilhos pastelônicos que falam de esqueletos, como estes:"}, {"8d48": "My favorite instrument? the TromBONE, of course."}, {"b5ad": "What do skeletons say before they begin dining? Bone-Appetit!"}, {"21e3": "These aren’t all of them. I’ve got a skeleTON more!"}, {"5a5e": "Tem vários outros mais fáceis de traduzir, eu escolhi alguns exemplos realmente mais difíceis. Undertale é um caso extremo do uso de trocadilhos, porque há muuuuuuuuuuitos outros. Em quase toda cena, Sans solta uma piada (ruim) dessas. Mas não é isso que torna o jogo impossível de localizar. Por enquanto ainda está só “difícil”."}, {"11c9": "O que começa a complicar de verdade é o fato de que o desenvolvedor usou algo que nós localizadores e tradutores adoramos: texto salvo como imagem. Basicamente todos os botões do modo batalha do jogo são imagens com o texto dentro. Então já começamos com alguns textos impossíveis de traduzir dentro do jogo, certo? Mais ou menos. Isso é sempre algo consertável. Se o desenvolvedor tivesse lido o texto Práticas recomendadas para localização de jogos, publicado pela IGDA e do qual eu participei na equipe da revisão da tradução, não teríamos esse problema. O desenvolvedor poderia alterar o código do jogo para em vez de carregar tudo como imagem, carregar a base dos botões (sem texto) por baixo, e em seguida renderizar texto por cima. Resolvido? Quase. O penúltimo chefe do jogo, Asgore, destrói um dos botões."}, {"ade3": "NO MERCY!"}, {"7d9e": "Reparem que o texto se distorce todo dentro da imagem. Isso complica tudo. E mais um detalhe: quando a batalha chega ao fim, o botão MERCY volta a aparecer, assim:"}, {"2a56": "MERCY again?"}, {"6287": "O botão é reconstruído a partir dos “cacos”. Essa é a parte fácil, pois é só renderizar por cima do texto as linhas que dão a aparência de “cacos colados”. Mas ainda temos o grande problema da destruição do botão, que é uma grande parte da experiência do jogo como um todo, pois é uma das surpresas dos momentos finais do jogo. Talvez se o desenvolvedor desse o texto aos tradutores, criasse um botão novo para cada idioma, e criasse a animação de destruição para cada um dos novos botões? Uma bela de uma trabalheira, mas ainda assim, é uma solução."}, {"d121": "O jogo tem mais texto dentro de imagem: um jogo de palavras cruzadas (todo em inglês, aliás, mas isso dá para resolver), placas de identificação e até um “cartão de fidelidade” de uma loja, com um agradecimento. Ainda assim, com solução."}, {"8767": "Mas há sim um problema impossível (até onde eu consigo ver). Eu deixei a pior parte para o final: as siglas usadas nos atributos do jogador."}, {"b625": "Por se tratar de um RPG, o jogo usa siglas como LV e EXP, que significam normalmente level (nível) e experience points (pontos de experiência), dentre outras não importantes agora. E para dar um toque de humor, logo no início do jogo, uma personagem chamada Flowey, uma amigável florzinha (?) explica que LV é na verdade a abreviação de LOVE. Fofo, né? Agora traduza."}, {"1f19": "Mas o pior de tudo nem é isso. LOVE é usado sempre em letra maiúscula, o que passa despercebido até chegarmos à grande surpresa do jogo: LOVE também é uma sigla, assim como EXP, mas não para aquilo que o jogador poderia imaginar. Não, Undertale é um jogo profundo e subversivo, que fala sobre escolhas, morte, mercy (como vocês viram no botão lá em cima), assassinato, etc, e bem no final da história o mesmo esqueleto cheio de graça, Sans, explica que LOVE é a sigla para Level of Violence e que EXP significa Execution Points."}, {"39c2": "Como em qualquer RPG, ao matar monstros, seus valores para EXP e LV aumentam. Em Undertale, vale a mesma regra, mas o jogo tem uma mensagem moral, então quanto mais monstros o jogador mata, maior o nível de violência e os pontos de execução acumulados. E no final, Sans se revela o personagem que realiza um julgamento final com base nas escolhas do jogador. Profundo e interessante, né? Agora traduza."}, {"1fbb": "Eu desisto."}, {"8d5b": "Quando cheguei nesta parte do jogo, fiquei estático olhando para a tela. Isso deve fazer umas três semanas. De lá para cá, eu penso todo dia em como eu conseguiria traduzir esse trio LV + LOVE + Level of Violence. Impossível. O caso EXP + Execution Points tem saída, eu diria que poderia ser P.EX desde o início, já que execuções e experiência começam com as mesmas letras."}, {"8955": "Ainda assim, sem resolver o caso LV, não chegamos ao fim da localização, não é? Não dá para entregar um trabalho quase pronto. Por isso, Undertale continua ilocalizável, na minha opinião. Agora, por favor, emitam as de vocês. Alguém aí consegue uma solução para tudo isso?"}], "author": "Thiago Hilger", "child": "1431_1", "name": "1431", "content": "Jogos ilocalizáveis E se eu contar para vocês que há jogos impossíveis de localizar? Um localizador de jogos quase sempre é também um gamer. Eu sou. Meus colegas localizadores que conheço também são. Não dá para generalizar, porque sempre há uma exceção à regra, mas vocês entenderam a ideia. Serve para conhecermos novas referências, compreender o trabalho dos nossos clientes, saber as tendências do mercado, essas coisas. Como eu amo jogar, sempre estou me aventurando por novos (ou antigos) universos em alguma tela. E hoje eu queria falar sobre um jogo que conheci há algum tempo e finalizei há pouco: Undertale. E queria falar também sobre como ele é ilocalizável. Antes que alguém fale que é possível sim localizar todo e qualquer jogo, desde que haja tempo, orçamento e bons tradutores, eu queria relembrar o que acabei de escrever, que não dá para generalizar, porque sempre há uma exceção à regra. Undertale é essa exceção. ATENÇÃO! ESTRAGADORES, digo, SPOILERS! Se você não jogou Undertale e pretende jogar, aviso agora: eu vou estragar uma das maiores surpresas do jogo. E Undertale é um jogo que deve ser jogado no escuro, ou seja, é melhor não saber de nada antes, para sentir as emoções que o desenvolvedor pretendeu que o jogador sentisse. É melhor não ler nenhum “estragador” antes (gostei desse termo bizarro). O jogo é curto, dá para finalizar em cerca de seis horas, então pare de ler aqui, jogue até o final pela primeira vez e depois volte. Eu avisei. Eu vou começar devagar com essa história do “ilocalizável”, porque grande parte do que eu falar aqui tem solução, nem sempre linguística, mas ainda assim uma solução. O primeiro problema, e uma das características mais marcantes do jogo, é o humor. Há pelo menos dois personagens que são esqueletos (talvez haja mais, há várias teorias da conspiração). Um deles, chamado Sans, é um grande piadista. E ele mesmo diz que adora trocadilhos. Aí começa o pesadelo do localizador, traduzir os trocadilhos pastelônicos que falam de esqueletos, como estes: My favorite instrument? the TromBONE, of course. What do skeletons say before they begin dining? Bone-Appetit! These aren’t all of them. I’ve got a skeleTON more! Tem vários outros mais fáceis de traduzir, eu escolhi alguns exemplos realmente mais difíceis. Undertale é um caso extremo do uso de trocadilhos, porque há muuuuuuuuuuitos outros. Em quase toda cena, Sans solta uma piada (ruim) dessas. Mas não é isso que torna o jogo impossível de localizar. Por enquanto ainda está só “difícil”. O que começa a complicar de verdade é o fato de que o desenvolvedor usou algo que nós localizadores e tradutores adoramos: texto salvo como imagem. Basicamente todos os botões do modo batalha do jogo são imagens com o texto dentro. Então já começamos com alguns textos impossíveis de traduzir dentro do jogo, certo? Mais ou menos. Isso é sempre algo consertável. Se o desenvolvedor tivesse lido o texto Práticas recomendadas para localização de jogos, publicado pela IGDA e do qual eu participei na equipe da revisão da tradução, não teríamos esse problema. O desenvolvedor poderia alterar o código do jogo para em vez de carregar tudo como imagem, carregar a base dos botões (sem texto) por baixo, e em seguida renderizar texto por cima. Resolvido? Quase. O penúltimo chefe do jogo, Asgore, destrói um dos botões. NO MERCY! Reparem que o texto se distorce todo dentro da imagem. Isso complica tudo. E mais um detalhe: quando a batalha chega ao fim, o botão MERCY volta a aparecer, assim: MERCY again? O botão é reconstruído a partir dos “cacos”. Essa é a parte fácil, pois é só renderizar por cima do texto as linhas que dão a aparência de “cacos colados”. Mas ainda temos o grande problema da destruição do botão, que é uma grande parte da experiência do jogo como um todo, pois é uma das surpresas dos momentos finais do jogo. Talvez se o desenvolvedor desse o texto aos tradutores, criasse um botão novo para cada idioma, e criasse a animação de destruição para cada um dos novos botões? Uma bela de uma trabalheira, mas ainda assim, é uma solução. O jogo tem mais texto dentro de imagem: um jogo de palavras cruzadas (todo em inglês, aliás, mas isso dá para resolver), placas de identificação e até um “cartão de fidelidade” de uma loja, com um agradecimento. Ainda assim, com solução. Mas há sim um problema impossível (até onde eu consigo ver). Eu deixei a pior parte para o final: as siglas usadas nos atributos do jogador. Por se tratar de um RPG, o jogo usa siglas como LV e EXP, que significam normalmente level (nível) e experience points (pontos de experiência), dentre outras não importantes agora. E para dar um toque de humor, logo no início do jogo, uma personagem chamada Flowey, uma amigável florzinha (?) explica que LV é na verdade a abreviação de LOVE. Fofo, né? Agora traduza. Mas o pior de tudo nem é isso. LOVE é usado sempre em letra maiúscula, o que passa despercebido até chegarmos à grande surpresa do jogo: LOVE também é uma sigla, assim como EXP, mas não para aquilo que o jogador poderia imaginar. Não, Undertale é um jogo profundo e subversivo, que fala sobre escolhas, morte, mercy (como vocês viram no botão lá em cima), assassinato, etc, e bem no final da história o mesmo esqueleto cheio de graça, Sans, explica que LOVE é a sigla para Level of Violence e que EXP significa Execution Points. Como em qualquer RPG, ao matar monstros, seus valores para EXP e LV aumentam. Em Undertale, vale a mesma regra, mas o jogo tem uma mensagem moral, então quanto mais monstros o jogador mata, maior o nível de violência e os pontos de execução acumulados. E no final, Sans se revela o personagem que realiza um julgamento final com base nas escolhas do jogador. Profundo e interessante, né? Agora traduza. Eu desisto. Quando cheguei nesta parte do jogo, fiquei estático olhando para a tela. Isso deve fazer umas três semanas. De lá para cá, eu penso todo dia em como eu conseguiria traduzir esse trio LV + LOVE + Level of Violence. Impossível. O caso EXP + Execution Points tem saída, eu diria que poderia ser P.EX desde o início, já que execuções e experiência começam com as mesmas letras. Ainda assim, sem resolver o caso LV, não chegamos ao fim da localização, não é? Não dá para entregar um trabalho quase pronto. Por isso, Undertale continua ilocalizável, na minha opinião. Agora, por favor, emitam as de vocês. Alguém aí consegue uma solução para tudo isso? "}