{"parent": "", "timestamp": "Sep 7, 2016", "title": "A exagerada sutileza ambiental de Sonic CD", "sentences": [{"9231": "A exagerada sutileza ambiental de Sonic CD"}, {"07a3": "Às vezes são os toques sutis que passam mensagens visualmente poderosas, ainda que você não perceba. E talvez não tenha percebido mesmo: afinal de contas, maioria das franquias icônicas dos videogames são da época onde a importância da história era algo ínfimo ou beirando o inexistente, salvo um ou outro gênero, como os RPG’s."}, {"68c7": "Com o Sonic não foi diferente: gostava do jogo pelo visual do personagem, velocidade, gráficos coloridos e bem detalhados e música meticulosamente pensada para caber nos hardwares limitados da época. Ao jogar videogame minha última preocupação como criança, tanto em Sonic quanto em qualquer outro jogo, era esperar um roteiro mirabolante, reviravoltas ou qualquer tipo de mensagem de efeito que os jogos de hoje em dia são cheios, mas que não necessariamente cumprem o que deveriam. Naquela época, eu queria coletar todas as esmeraldas e habilitar a forma super, queria passar pela maldita fase Tubular no Super Mario World, queria enfrentar o chefe final de Streets of Rage sem entender o que diabos ele desejava. E nem precisava."}, {"9478": "Foi então que na adolescência, em época de internet discada, emuladores e MSN Messenger um colega comentou qual era a do Sonic: “é um jogo sobre desastre ambiental” — ora, essa… a história em Sonic sempre foi tão rasa quanto poça d’água, de onde tiraram isso?"}, {"7352": "E assim percebi que eu não questionava o que consumia."}, {"0f89": "Sonic é um jogo sobre desastre ambiental. Sobre preservação da natureza mais especificamente. Deixando algumas informações de lado, como controlar um ouriço azul antropomorfo que usa sapatos baseados no Michael Jackson e tem sua personalidade inspirada no ex-presidente Bill Clinton (???), a ideia principal é confrontar o inimigo Dr. Robotnik que encapsulou os animais da floresta, transformando-os em robôs que não curtem muito uma amizade. Os primeiros jogos tem uma certa historinha que se desenvolve em segundo plano, mas só entende os meros detalhes quem lê o manual de instruções. Pra dizer a verdade, são bastante superficiais e não acrescentam nada em relação ao que a dinâmica dos jogos, e por sua vez a mensagem deles, querem passar."}, {"dafa": "Vai dizer que não é a cara do Bill Clinton?"}, {"7ef1": "Essa mensagem ambiental não acontece por acaso: uma das várias séries animadas que Sonic teve, veiculada no Brasil pelo SBT inclusive, tinha essa temática bastante explorada nos episódios. Sonic e seus amigos formavam um grupo contra resistência ao Robotnik e seu império. A preocupação dos personagens com a preservação do meio ambiente era nítida, ainda mais em um planeta pós-apocalíptico em que as máquinas já dominavam boa parte do território. O roteiro era infantilizado, óbvio, mas tinha boa qualidade e deixava nítida a sua mensagem. No caso dos jogos, essa mensagem fica escondida em camadas e mais camadas de molas, inimigos e anéis para coletar."}, {"c91d": "A progressão dos jogos ocorre de maneira natural. O jogador vai passando por fases com dois a três atos de curta duração até chegar à base final, residência do Dr. Robotnik e de suas máquinas transformadoras. Diferente do Bowser, que geralmente envia seus comparsas, o próprio Robotnik em pessoa tenta impedir que Sonic chegue ao seu “castelo” no último ato de cada fase. Basta chegar até o final do jogo para perceber que o castelo na verdade é uma puta fábrica com produção 100% automatizada de robôs e armadilhas que qualquer comitê interno de prevenção de acidentes teria infarto só de olhar. É um caos tão organizado que resume a personalidade do vilão — melhor ainda— muito do que o ser humano fez em tão pouco tempo: destruir a natureza. Chega a ser belo analisar a progressão das fases: vemos paisagens de florestas e montanhas trocarem de lugar com pequenos vestígios de civilização, como uma cidade luminosa lotada de máquinas caça-níquel e pinball aonde Sonic é a bolinha, seguindo para uma usina de petróleo até o coração de um maquinário que nunca dorme. As cores mudam gradativamente do colorido berrante para algo mais pastel e padronizado, ao mesmo tempo que desorganizado. Como se não bastasse, as músicas seguem perfeitamente cada mudança de ambientação ao longo do jogo."}, {"7b07": "Fica perceptível então que a razão de Sonic não é apenas derrotar o Dr. Robotnik. Na verdade isso é uma consequência do objetivo de salvar seus amigos e, por sua vez, o meio ambiente."}, {"7f2b": "O jogo foca duas oposições em dois personagens distintos. De um lado, um animal que vive em natureza buscando sobrevivência; de outro, um humano que busca experiência, tecnologia e progresso acima de tudo. Não é necessário falas ou cenas de apoio em nenhum momento, já que a ideia é auto-explicativa."}, {"9638": "Tão explicativa que às vezes me pergunto como não absorvi isso nas primeiras 358 vezes que terminei Sonic na infância. Dependendo do jogo, é uma progressão brusca em certos momentos, mas que ainda soa natural. Além disso, não é como se fosse uma temática investida apenas em um jogo da franquia — muito pelo contrário — repete-se em praticamente todos os outros da era Mega Drive e Master System (e em poucos jogos mais modernos), porém com suas peculiaridades. Por sua vez, o tema é repetido à exaustão em Sonic CD."}, {"657c": "“Pratique muito esporte! Jogue a garrafinha no lixo! Vamos cuidar do nosso meio ambiente!”"}, {"b7f3": "Sonic CD foi o suprassumo do conceito apresentado no primeiro jogo: seja por seu maior poder de hardware no Sega CD, o que permitiu mais processamento de imagens e paleta de cores; ou pela mídia de CD-ROM que incentivou a inclusão de música com maior qualidade digital e vídeos animados na abertura e encerramento — fato é que muito mais coisas acontecem ao mesmo tempo na tela do que acontecia em outros jogos da época. Alguns momentos são desesperadores de tanto que Sonic ricocheteia no cenário, pega velocidade e literalmente some da tela ao entrar em loops, o que me faz agradecer toda vez por não ter labirintite."}, {"3e1a": "Para ser sincero, as primeiras vezes que joguei Sonic CD, não gostei muito. Talvez seja porque diferente de todos os outros jogos de Sonic na época, Sonic CD priorizou a exploração em um cenário que é extenso verticalmente ao invés de horizontalmente. Com isso, as fases parecem um tanto quanto sem inspiração e bastante curtas de início, caso instintivamente seu objetivo seja apenas chegar até a plaquinha no final do ato. Foi exatamente o que fiz por várias vezes, esbarrando nas plaquinhas de Past e Future que me deixavam mais perdido do que o cenário já fazia habitualmente, sem muito esforço."}, {"3b26": "Foi querendo compreender Sonic CD que eu entendi qual é a dele e, consequentemente, o que ele quer passar: o fato das fases serem um deturpado parque de diversões vertical convida o jogador a usar a mecânica de velocidade e momentum do jogo, igual à de todos os outros jogos de Sonic da época, a favor da exploração e percepção de cenário. Não que isso seja algo único, até porque a série recompensa desde sempre quem explora o cenário em busca de itens escondidos ou estágios especiais. Mas nesse caso a exploração está incorporada à mensagem que o jogo evoca ao jogador através do gameplay. A exploração é intrinsecamente relacionada com as tais placas de Past ou Future distribuídas ao longo dos atos. Dependendo da placa coletada e adquirindo velocidade o suficiente em pontos estratégicos, Sonic é propulsionado para o passado ou o futuro — eis aí o efeito Sonic Boom. De maneira quase instantânea, a ecologia do jogo muda conforme a passagem do tempo. E isso influencia tudo: música, gráfico, estrutura de fase e narrativa inserida ao gameplay. É exatamente aí que Sonic CD se importa."}, {"6e1e": "Passado, presente e futuro da mesma fase em Sonic CD, respectivamente"}, {"7754": "Indo para o futuro em uma primeira oportunidade, há de se encontrar um cenário distópico, quase sempre com ambientação destruída ou vestígios de poluição de responsabilidade do ser humano, nesse caso, o Dr. Robotnik. O progresso humano significa regresso ambiental, que na pele de Sonic, o jogador enxerga como ruim. A ordem natural das coisas é visivelmente alterada quando saímos do presente e vamos para o futuro. A música, junto ao ambiente, talvez seja o maior indicador de mudança já que a mesma se torna metalizada, caótica, suja. É algo tão sublime que fica impossível não elogiar o esmero de cada faixa representando o que vemos na tela e influenciando o que se interpreta sobre certo e o errado em Sonic CD."}, {"7436": "O que resta de um futuro destruído é a esperança de consertar o seu passado. Isso encoraja Sonic e o jogador retornarem no tempo para encontrar uma solução que garanta a preservação da natureza. Essa solução é resultado de uma das três alternativas:"}, {"27ca": "Ao efetuar qualquer uma das três ações, o jogo não explica ao jogador o que será alcançado até chegar ao final do ato:"}, {"2386": "Há controvérsias…"}, {"989a": "“SONIC MADE A GOOD FUTURE”"}, {"be67": "Esse é o momento ESSENCIAL de Sonic CD. É único feedback disponível que resume em uma frase qual o seu progresso e, principalmente, qual a narrativa que será destrinchada no final da fase: Sonic fez um bom futuro dessa vez? A natureza está salva? O futuro do Dr. Robotnik prevaleceu? Todas essas perguntas surgem e são solucionadas em puro gameplay — o terceiro e último ato é o futuro incontestável, ou seja, a realidade final conquistada em cada fase. Se o jogador, através de suas ações no passado, fez um bom futuro nos dois primeiros atos, será recompensado com uma bela paisagem no terceiro ato, precisando lidar apenas com um Robotnik furioso tentando impedir o Sonic de concretizar uma vez por todas a preservação da natureza. Caso contrário, falhando em salvar o futuro num dos primeiros atos, o jogador terá acesso ao mesmo futuro distópico de antes, povoado de poluição e um sentimento de fracasso. O jogo segue e nada mais poderá ser feito para corrigir o futuro da fase anterior."}, {"7c11": "O final depende unicamente de seus atos. Isso significa que para salvar a natureza é preciso a garantia de salvar o futuro em todas as fases."}, {"a081": "Ressalto que em momento algum Sonic CD explica isso de maneira direta ao jogador, muito menos na sensacional animação de abertura que resume basicamente as qualidades de Sonic como personagem. É algo inerente ao fato de jogar, uma sutileza tão grande que chega a ser exagerada. Terminar as fases sem explorar o cenário e sem mudar o futuro soa errado porque realmente é, mesmo que não seja proibido ou limitado fazê-lo em momento algum. Ignorar o pedido de ajuda da natureza, cedendo espaço involuntariamente à destruição humana é se tornar complacente à poluição e ao desmatamento imposto por Robotnik. Cabe ao Sonic, e implicitamente ao jogador, ajudar a natureza e garantir o seu futuro."}, {"bc02": "Tal exagero está justamente no diferencial que Sonic CD traz em relação a todos os outros jogos do Sonic. Ele não se importa nem um pouco por se livrar de certos vícios nos gêneros de plataforma em prol da exploração e velocidade, mesmo que isso traga incoerência de boa parte das fases e da mecânica do jogo em si. Muito menos poupa detalhes nos cenários que beiram o psicodélico em vários momentos, nos inimigos que explodem e viram flores, trazendo ainda mais vida em um planeta brega e ao mesmo tempo acolhedor. Não se limita nem na trilha sonora, que na versão japonesa (evitem a versão americana a todo custo), é cheia de sintetizadores que simulam o pop e techno da época, trazendo um trabalho incrível ao utilizar samples de diferentes artistas de música eletrônica, que vão aparecer anos depois em obras mais que cultuadas musicalmente, como no disco Endtroducing… do DJ Shadow."}, {"f1a4": "Sonic não é rápido porque pode, em Sonic CD. Ele é rápido porque deve, acima de tudo, salvar o futuro e o meio ambiente. Essa é a mensagem a se passar. Você pode entender notoriamente ou não captar nas primeiras vezes, mas ela estará lá toda vez que você se deparar com a frase “Sonic made a good future”."}, {"aa4e": "Trata-se de um feito e tanto para um jogo de videogame, principalmente se pensarmos que ele saiu em 1993 e a mensagem continua atual e de grande relevância, levando em conta o tanto que ouvimos sobre aquecimento global, desmatamento e desastres ambientais de grandes empresas."}, {"0b45": "Acidente ambiental em 2015 de responsabilidade da empresa Samarco, após o rompimento das barragens em Mariana (MG)"}, {"28ee": "Será que realmente estamos fazendo um bom futuro? Sonic CD continua a nos questionar, desde 1993, até hoje."}, {"3524": "PS: O jogo recebeu uma remasterização sensacional para Playstation 3, Xbox 360, PC e celulares, feitas pelo Christian Whitehead (Taxman) que traz a trilha sonora americana e japonesa juntas, além de alguns extras como a possibilidade de jogar com o Tails. Recomendo."}, {"78df": "PS 2: A maior birra com a versão original americana do jogo está no fato de ter sido produzida com músicas completamente diferentes da versão japonesa, que não mudam nas passagens entre passado e futuro e são bastante razoáveis. Evite a todo custo."}], "author": "Rafael-DFL", "child": "1432_1", "name": "1432", "content": "A exagerada sutileza ambiental de Sonic CD Às vezes são os toques sutis que passam mensagens visualmente poderosas, ainda que você não perceba. E talvez não tenha percebido mesmo: afinal de contas, maioria das franquias icônicas dos videogames são da época onde a importância da história era algo ínfimo ou beirando o inexistente, salvo um ou outro gênero, como os RPG’s. Com o Sonic não foi diferente: gostava do jogo pelo visual do personagem, velocidade, gráficos coloridos e bem detalhados e música meticulosamente pensada para caber nos hardwares limitados da época. Ao jogar videogame minha última preocupação como criança, tanto em Sonic quanto em qualquer outro jogo, era esperar um roteiro mirabolante, reviravoltas ou qualquer tipo de mensagem de efeito que os jogos de hoje em dia são cheios, mas que não necessariamente cumprem o que deveriam. Naquela época, eu queria coletar todas as esmeraldas e habilitar a forma super, queria passar pela maldita fase Tubular no Super Mario World, queria enfrentar o chefe final de Streets of Rage sem entender o que diabos ele desejava. E nem precisava. Foi então que na adolescência, em época de internet discada, emuladores e MSN Messenger um colega comentou qual era a do Sonic: “é um jogo sobre desastre ambiental” — ora, essa… a história em Sonic sempre foi tão rasa quanto poça d’água, de onde tiraram isso? E assim percebi que eu não questionava o que consumia. Sonic é um jogo sobre desastre ambiental. Sobre preservação da natureza mais especificamente. Deixando algumas informações de lado, como controlar um ouriço azul antropomorfo que usa sapatos baseados no Michael Jackson e tem sua personalidade inspirada no ex-presidente Bill Clinton (???), a ideia principal é confrontar o inimigo Dr. Robotnik que encapsulou os animais da floresta, transformando-os em robôs que não curtem muito uma amizade. Os primeiros jogos tem uma certa historinha que se desenvolve em segundo plano, mas só entende os meros detalhes quem lê o manual de instruções. Pra dizer a verdade, são bastante superficiais e não acrescentam nada em relação ao que a dinâmica dos jogos, e por sua vez a mensagem deles, querem passar. Vai dizer que não é a cara do Bill Clinton? Essa mensagem ambiental não acontece por acaso: uma das várias séries animadas que Sonic teve, veiculada no Brasil pelo SBT inclusive, tinha essa temática bastante explorada nos episódios. Sonic e seus amigos formavam um grupo contra resistência ao Robotnik e seu império. A preocupação dos personagens com a preservação do meio ambiente era nítida, ainda mais em um planeta pós-apocalíptico em que as máquinas já dominavam boa parte do território. O roteiro era infantilizado, óbvio, mas tinha boa qualidade e deixava nítida a sua mensagem. No caso dos jogos, essa mensagem fica escondida em camadas e mais camadas de molas, inimigos e anéis para coletar. A progressão dos jogos ocorre de maneira natural. O jogador vai passando por fases com dois a três atos de curta duração até chegar à base final, residência do Dr. Robotnik e de suas máquinas transformadoras. Diferente do Bowser, que geralmente envia seus comparsas, o próprio Robotnik em pessoa tenta impedir que Sonic chegue ao seu “castelo” no último ato de cada fase. Basta chegar até o final do jogo para perceber que o castelo na verdade é uma puta fábrica com produção 100% automatizada de robôs e armadilhas que qualquer comitê interno de prevenção de acidentes teria infarto só de olhar. É um caos tão organizado que resume a personalidade do vilão — melhor ainda— muito do que o ser humano fez em tão pouco tempo: destruir a natureza. Chega a ser belo analisar a progressão das fases: vemos paisagens de florestas e montanhas trocarem de lugar com pequenos vestígios de civilização, como uma cidade luminosa lotada de máquinas caça-níquel e pinball aonde Sonic é a bolinha, seguindo para uma usina de petróleo até o coração de um maquinário que nunca dorme. As cores mudam gradativamente do colorido berrante para algo mais pastel e padronizado, ao mesmo tempo que desorganizado. Como se não bastasse, as músicas seguem perfeitamente cada mudança de ambientação ao longo do jogo. Fica perceptível então que a razão de Sonic não é apenas derrotar o Dr. Robotnik. Na verdade isso é uma consequência do objetivo de salvar seus amigos e, por sua vez, o meio ambiente. O jogo foca duas oposições em dois personagens distintos. De um lado, um animal que vive em natureza buscando sobrevivência; de outro, um humano que busca experiência, tecnologia e progresso acima de tudo. Não é necessário falas ou cenas de apoio em nenhum momento, já que a ideia é auto-explicativa. Tão explicativa que às vezes me pergunto como não absorvi isso nas primeiras 358 vezes que terminei Sonic na infância. Dependendo do jogo, é uma progressão brusca em certos momentos, mas que ainda soa natural. Além disso, não é como se fosse uma temática investida apenas em um jogo da franquia — muito pelo contrário — repete-se em praticamente todos os outros da era Mega Drive e Master System (e em poucos jogos mais modernos), porém com suas peculiaridades. Por sua vez, o tema é repetido à exaustão em Sonic CD. “Pratique muito esporte! Jogue a garrafinha no lixo! Vamos cuidar do nosso meio ambiente!” Sonic CD foi o suprassumo do conceito apresentado no primeiro jogo: seja por seu maior poder de hardware no Sega CD, o que permitiu mais processamento de imagens e paleta de cores; ou pela mídia de CD-ROM que incentivou a inclusão de música com maior qualidade digital e vídeos animados na abertura e encerramento — fato é que muito mais coisas acontecem ao mesmo tempo na tela do que acontecia em outros jogos da época. Alguns momentos são desesperadores de tanto que Sonic ricocheteia no cenário, pega velocidade e literalmente some da tela ao entrar em loops, o que me faz agradecer toda vez por não ter labirintite. Para ser sincero, as primeiras vezes que joguei Sonic CD, não gostei muito. Talvez seja porque diferente de todos os outros jogos de Sonic na época, Sonic CD priorizou a exploração em um cenário que é extenso verticalmente ao invés de horizontalmente. Com isso, as fases parecem um tanto quanto sem inspiração e bastante curtas de início, caso instintivamente seu objetivo seja apenas chegar até a plaquinha no final do ato. Foi exatamente o que fiz por várias vezes, esbarrando nas plaquinhas de Past e Future que me deixavam mais perdido do que o cenário já fazia habitualmente, sem muito esforço. Foi querendo compreender Sonic CD que eu entendi qual é a dele e, consequentemente, o que ele quer passar: o fato das fases serem um deturpado parque de diversões vertical convida o jogador a usar a mecânica de velocidade e momentum do jogo, igual à de todos os outros jogos de Sonic da época, a favor da exploração e percepção de cenário. Não que isso seja algo único, até porque a série recompensa desde sempre quem explora o cenário em busca de itens escondidos ou estágios especiais. Mas nesse caso a exploração está incorporada à mensagem que o jogo evoca ao jogador através do gameplay. A exploração é intrinsecamente relacionada com as tais placas de Past ou Future distribuídas ao longo dos atos. Dependendo da placa coletada e adquirindo velocidade o suficiente em pontos estratégicos, Sonic é propulsionado para o passado ou o futuro — eis aí o efeito Sonic Boom. De maneira quase instantânea, a ecologia do jogo muda conforme a passagem do tempo. E isso influencia tudo: música, gráfico, estrutura de fase e narrativa inserida ao gameplay. É exatamente aí que Sonic CD se importa. Passado, presente e futuro da mesma fase em Sonic CD, respectivamente Indo para o futuro em uma primeira oportunidade, há de se encontrar um cenário distópico, quase sempre com ambientação destruída ou vestígios de poluição de responsabilidade do ser humano, nesse caso, o Dr. Robotnik. O progresso humano significa regresso ambiental, que na pele de Sonic, o jogador enxerga como ruim. A ordem natural das coisas é visivelmente alterada quando saímos do presente e vamos para o futuro. A música, junto ao ambiente, talvez seja o maior indicador de mudança já que a mesma se torna metalizada, caótica, suja. É algo tão sublime que fica impossível não elogiar o esmero de cada faixa representando o que vemos na tela e influenciando o que se interpreta sobre certo e o errado em Sonic CD. O que resta de um futuro destruído é a esperança de consertar o seu passado. Isso encoraja Sonic e o jogador retornarem no tempo para encontrar uma solução que garanta a preservação da natureza. Essa solução é resultado de uma das três alternativas: Ao efetuar qualquer uma das três ações, o jogo não explica ao jogador o que será alcançado até chegar ao final do ato: Há controvérsias… “SONIC MADE A GOOD FUTURE” Esse é o momento ESSENCIAL de Sonic CD. É único feedback disponível que resume em uma frase qual o seu progresso e, principalmente, qual a narrativa que será destrinchada no final da fase: Sonic fez um bom futuro dessa vez? A natureza está salva? O futuro do Dr. Robotnik prevaleceu? Todas essas perguntas surgem e são solucionadas em puro gameplay — o terceiro e último ato é o futuro incontestável, ou seja, a realidade final conquistada em cada fase. Se o jogador, através de suas ações no passado, fez um bom futuro nos dois primeiros atos, será recompensado com uma bela paisagem no terceiro ato, precisando lidar apenas com um Robotnik furioso tentando impedir o Sonic de concretizar uma vez por todas a preservação da natureza. Caso contrário, falhando em salvar o futuro num dos primeiros atos, o jogador terá acesso ao mesmo futuro distópico de antes, povoado de poluição e um sentimento de fracasso. O jogo segue e nada mais poderá ser feito para corrigir o futuro da fase anterior. O final depende unicamente de seus atos. Isso significa que para salvar a natureza é preciso a garantia de salvar o futuro em todas as fases. Ressalto que em momento algum Sonic CD explica isso de maneira direta ao jogador, muito menos na sensacional animação de abertura que resume basicamente as qualidades de Sonic como personagem. É algo inerente ao fato de jogar, uma sutileza tão grande que chega a ser exagerada. Terminar as fases sem explorar o cenário e sem mudar o futuro soa errado porque realmente é, mesmo que não seja proibido ou limitado fazê-lo em momento algum. Ignorar o pedido de ajuda da natureza, cedendo espaço involuntariamente à destruição humana é se tornar complacente à poluição e ao desmatamento imposto por Robotnik. Cabe ao Sonic, e implicitamente ao jogador, ajudar a natureza e garantir o seu futuro. Tal exagero está justamente no diferencial que Sonic CD traz em relação a todos os outros jogos do Sonic. Ele não se importa nem um pouco por se livrar de certos vícios nos gêneros de plataforma em prol da exploração e velocidade, mesmo que isso traga incoerência de boa parte das fases e da mecânica do jogo em si. Muito menos poupa detalhes nos cenários que beiram o psicodélico em vários momentos, nos inimigos que explodem e viram flores, trazendo ainda mais vida em um planeta brega e ao mesmo tempo acolhedor. Não se limita nem na trilha sonora, que na versão japonesa (evitem a versão americana a todo custo), é cheia de sintetizadores que simulam o pop e techno da época, trazendo um trabalho incrível ao utilizar samples de diferentes artistas de música eletrônica, que vão aparecer anos depois em obras mais que cultuadas musicalmente, como no disco Endtroducing… do DJ Shadow. Sonic não é rápido porque pode, em Sonic CD. Ele é rápido porque deve, acima de tudo, salvar o futuro e o meio ambiente. Essa é a mensagem a se passar. Você pode entender notoriamente ou não captar nas primeiras vezes, mas ela estará lá toda vez que você se deparar com a frase “Sonic made a good future”. Trata-se de um feito e tanto para um jogo de videogame, principalmente se pensarmos que ele saiu em 1993 e a mensagem continua atual e de grande relevância, levando em conta o tanto que ouvimos sobre aquecimento global, desmatamento e desastres ambientais de grandes empresas. Acidente ambiental em 2015 de responsabilidade da empresa Samarco, após o rompimento das barragens em Mariana (MG) Será que realmente estamos fazendo um bom futuro? Sonic CD continua a nos questionar, desde 1993, até hoje. PS: O jogo recebeu uma remasterização sensacional para Playstation 3, Xbox 360, PC e celulares, feitas pelo Christian Whitehead (Taxman) que traz a trilha sonora americana e japonesa juntas, além de alguns extras como a possibilidade de jogar com o Tails. Recomendo. PS 2: A maior birra com a versão original americana do jogo está no fato de ter sido produzida com músicas completamente diferentes da versão japonesa, que não mudam nas passagens entre passado e futuro e são bastante razoáveis. Evite a todo custo. "}