{"parent": "", "timestamp": "Apr 4", "title": "20 Marketing Experts You Should Follow Now", "sentences": [{"40d5": "20 Marketing Experts You Should Follow Now"}, {"e2c8": "By Eugine Dychko, Storyteller at Depositphotos"}, {"f372": "Being a digital marketer today is like building a plane mid-air: requirements are constantly changing, and one can easily feel lost with all the new tools, formats and platforms. However, there are always people who skillfully navigate the ever changing marketing streams and successfully transfer their wisdom to others."}, {"af2e": "We have gathered a list of upcoming marketing stars from different industries, all of which deserve to be heard, seen and read about in 2017."}, {"d69c": "Dan Siroker — Optimizely"}, {"3e83": "As the CEO to Optimizely, Dan specializes in optimizing sites and mobile apps through data analysis and personalization. Dan was also a Director of Analytics with the 2008 Obama campaign. He writes about his company’s news, digital A/B testing technology and general social issues. Read Dan’s articles on Medium. My personal favourite is Three Timeless Truths Entrepreneurs can Learn from Alexander Hamilton. You can also follow him on Twitter and Linkedin."}, {"fb0c": "Quinn Whissen — Vertical Measures"}, {"b04c": "Quinn is the Director of Marketing at a marketing agency Vertical Measures. She is an expert in developing content strategies for B2B companies and implementing efficient digital marketing tactics. Quinn does a lot of public speaking on the topics of content marketing and brand identity. Follow her on Linkedin, Facebook or meet her on one of the workshops."}, {"2666": "Tommy Walker — Shopify"}, {"b8ec": "Tommy is not only a successful digital marketer, but also a talented author and a great performer. He writes guest blogs for Hubspot, Unbounce and ProBlogger, on the topics of conversion optimization, and hosts the Inside The Mind show about marketing. Here is Tommy’s Twitter and Linkedin and also his articles on Shopify Plus blog."}, {"0ebb": "Michael Litt — Vidyard"}, {"a214": "Michael has in-depth knowledge of video marketing: he is the CEO of Vidyard, an online video platform for marketers. Michael writes articles for MarketingLand on personalized marketing and efficient use of video formats and streaming media. Here is a pretty interesting interview where he talks about the Vidyard foundation, and also his Twitter and Linkedin."}, {"2dff": "Blake Pinkser - MVMT"}, {"c95a": "Director of Marketing at MVMT Watches, Blake was behind the rapid growth of the brand, based on successful social media advertising activity. Blake designed a separate strategy for each platform, focusing on engagement through the latest platform’s features, like On-Demand Geofilters in Snapchat. He has a lot to say about data-driven marketing and the importance of content strategy for Ecommerce brands. Follow Blake on Instagram, Linkedin and Facebook."}, {"1f79": "Eden Chen — Fisherman Labs"}, {"4027": "Eden has founded an app development agency Fisherman Labs, which became one of the fastest growing in US, and gained unique insight of the mobile app environment, augmented reality development, design and digital marketing. He shares his experience by contributing to Entrepreneur, Venture Beat and posting to Twitter."}, {"126a": "Susan Dong — A&W Canada"}, {"051c": "One of the 30 under 30 by Marketing mag, Susan is a marketer and brand manager at A&W Canada. She manages brand positioning for more than 850 restaurants and creates incredible storytelling for clients. Her strategy is based on building omni-channel experience for customers, which includes brand videos, packaging and UX. Follow Susan on Linkedin."}, {"33c9": "Kelsey Libert — Fractl"}, {"3af5": "A seasoned expert in media relations and content marketing, Kesley shares her insights on efficient digital PR in Harvard Business Review, Inc, Fast Company, Entrepreneur, HubSpot and Moz. She is a partner at Fractl PR agency and also a co-founder of the dating app Sapio. Read her articles on HBR, especially the one about influencer marketing, and follow her on Twitter and Linkedin."}, {"3159": "Kerry Jones — Fractl"}, {"8cf5": "Kerry is a Marketing Director, also from Fractl, and she has a lot to offer on the topics of viral content, digital marketing, link building and community management. Here are her helpful articles about creating content that keeps earning links, tailoring content to different generations and a brilliant AMA session on GrowthHackers. Follow Kerry on Twitter and Linkedin."}, {"ff7d": "Stoney deGeyter — Pole Position Marketing"}, {"dbf0": "An early digital marketing pioneer, Stoney writes and speaks about web marketing strategies, SEO, content marketing and PPC. He has years of experience in the industry, being the president of Pole Position Marketing, one of the longest running SEO companies. Stoney is the author of The Best Damn Web Marketing Checklist, Period book and has written numerous articles being published on Search Engine Land and Web Pro News. Follow him on Twitter and Linkedin."}, {"182d": "Laura Collins — Merkle|Periscopix"}, {"6525": "Laura is a Paid Social Director at Merkle|Periscopix media agency. She has many years of experience in digital marketing, particularly PPC, Facebook and Adwords advertising. Laura contributes articles to SearchEngineLand and provides advanced conversion tracking advice in her company’s blog. Follow Laura on Twitter and Linkedin."}, {"7483": "Chad White — Litmus"}, {"943b": "Chad is master Yoda of email marketing. He is a research director at an email marketing platform Litmus, an author of a book, numerous marketing guides, articles and posts. Chad uses his journalistic past with insightful email marketing knowledge to produce great content for The New York Times, The Wall Street Journal and USA Today. Read his Email Marketing Rules guide, and follow him on Linkedin and Twitter."}, {"6b1c": "Tamar Weinberg — Namecheap"}, {"cdae": "Tamar is a legend who helped Mashable and Lifehacker grow into what they are today. Now she is focused on data-driven digital marketing and works as a Social Media Customer Experience and Success Lead at Namecheap. She shares helpful articles on how to build a community and work with influencers. Here are Tamar’s Twitter and Linkedin."}, {"720b": "Megan Hannay — ZipSprout"}, {"9bef": "Megan is a co-founder and CEO of ZipSprout, a local marketing agency that brings together nonprofit organizations with enterprise businesses. She has in-depth knowledge of brand positioning, social media and marketing tactics for local businesses and shares her views in articles and interviews, which are both fun and useful. Here are Megan’s Twitter and Linkedin."}, {"54b2": "Brian Patterson — Go Fish Digital"}, {"05da": "Brian has a lot of expertise in both SEO techniques and brand reputation management, which allows him to provide an extremely unique view of digital marketing strategies and their implementation. Brian is a contributing author at MOZ and Marketing Land, where he writes practical tips on link building and reputation management. Follow Brian’s Twitter and Linkedin."}, {"272b": "Jayson DeMers — AudienceBloom"}, {"2dcc": "Jayson is a CEO at digital marketing company AudienceBloom and a very productive columnist at Inc, Entrepreneur and Forbes. In his articles he shares advice on SEO, content marketing, productivity and social media activity. Here is his latest article on Instagram as the best platform for user engagement, and also his Twitter, Linkedin."}, {"19d9": "Jordan Kasteler — Consultant"}, {"3957": "Jordan has the most impressive marketing experience: PETA marketing strategist, co-founder of BlueGlass Interactive, SEO at Overstock.com. Now he works as a digital marketing consultant, writes enlightening articles for high-tier media and speaks at industry events. His article 11 Helpful Social Media Tools for Marketers on Social Media Examiner gathered over 6K shares. Follow Jordan on Twitter and Linkedin."}, {"c56a": "Blaise Lucey — Bitly"}, {"8beb": "Listed in Top 40 Content & Digital Marketing Influencers by The Content Standard and working as Director of Product & Content Marketing at Bitly, Blaise is a must-follow digital marketer in the US. He specializes in developing products and content marketing strategies for tech companies. Here are a great post from Blaise on user-generated content, his Twitter and Linkedin."}, {"a660": "Sarah Esterman — Simple"}, {"113d": "Sarah is a Lifecycle Marketing Manager at Simple Finance and a speaker at Marketing Sherpa Summit. She advocates customer-first approach in marketing strategies and building a long-term relationship with customers for brands. At the Summit, Sarah will talk about how email marketing helps to reduce customer friction and increase engagement 407%. Follow Sarah on Linkedin and Twitter."}, {"522a": "Brian Fanzo — iSocialFanz"}, {"d1f9": "Brian is a CEO of a social strategy consulting agency iSocialFanz LLC that specializes in promoting brands in Periscope, Snapchat, and Facebook Live. He has some truly inspiring and insightful speeches on social media marketing, the millennial mindset, gadgets and new formats of storytelling for brands. Follow his Youtube channel, Linkedin and Twitter."}, {"8840": "This story was originally published at blog.depositphotos.com"}], "author": "Depositphotos", "child": "1436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_51436_1\t1436_2\t1436_3\t1436_4\t1436_5", "name": "1436", "content": "20 Marketing Experts You Should Follow Now By Eugine Dychko, Storyteller at Depositphotos Being a digital marketer today is like building a plane mid-air: requirements are constantly changing, and one can easily feel lost with all the new tools, formats and platforms. However, there are always people who skillfully navigate the ever changing marketing streams and successfully transfer their wisdom to others. We have gathered a list of upcoming marketing stars from different industries, all of which deserve to be heard, seen and read about in 2017. Dan Siroker — Optimizely As the CEO to Optimizely, Dan specializes in optimizing sites and mobile apps through data analysis and personalization. Dan was also a Director of Analytics with the 2008 Obama campaign. He writes about his company’s news, digital A/B testing technology and general social issues. Read Dan’s articles on Medium. My personal favourite is Three Timeless Truths Entrepreneurs can Learn from Alexander Hamilton. You can also follow him on Twitter and Linkedin. Quinn Whissen — Vertical Measures Quinn is the Director of Marketing at a marketing agency Vertical Measures. She is an expert in developing content strategies for B2B companies and implementing efficient digital marketing tactics. Quinn does a lot of public speaking on the topics of content marketing and brand identity. Follow her on Linkedin, Facebook or meet her on one of the workshops. Tommy Walker — Shopify Tommy is not only a successful digital marketer, but also a talented author and a great performer. He writes guest blogs for Hubspot, Unbounce and ProBlogger, on the topics of conversion optimization, and hosts the Inside The Mind show about marketing. Here is Tommy’s Twitter and Linkedin and also his articles on Shopify Plus blog. Michael Litt — Vidyard Michael has in-depth knowledge of video marketing: he is the CEO of Vidyard, an online video platform for marketers. Michael writes articles for MarketingLand on personalized marketing and efficient use of video formats and streaming media. Here is a pretty interesting interview where he talks about the Vidyard foundation, and also his Twitter and Linkedin. Blake Pinkser - MVMT Director of Marketing at MVMT Watches, Blake was behind the rapid growth of the brand, based on successful social media advertising activity. Blake designed a separate strategy for each platform, focusing on engagement through the latest platform’s features, like On-Demand Geofilters in Snapchat. He has a lot to say about data-driven marketing and the importance of content strategy for Ecommerce brands. Follow Blake on Instagram, Linkedin and Facebook. Eden Chen — Fisherman Labs Eden has founded an app development agency Fisherman Labs, which became one of the fastest growing in US, and gained unique insight of the mobile app environment, augmented reality development, design and digital marketing. He shares his experience by contributing to Entrepreneur, Venture Beat and posting to Twitter. Susan Dong — A&W Canada One of the 30 under 30 by Marketing mag, Susan is a marketer and brand manager at A&W Canada. She manages brand positioning for more than 850 restaurants and creates incredible storytelling for clients. Her strategy is based on building omni-channel experience for customers, which includes brand videos, packaging and UX. Follow Susan on Linkedin. Kelsey Libert — Fractl A seasoned expert in media relations and content marketing, Kesley shares her insights on efficient digital PR in Harvard Business Review, Inc, Fast Company, Entrepreneur, HubSpot and Moz. She is a partner at Fractl PR agency and also a co-founder of the dating app Sapio. Read her articles on HBR, especially the one about influencer marketing, and follow her on Twitter and Linkedin. Kerry Jones — Fractl Kerry is a Marketing Director, also from Fractl, and she has a lot to offer on the topics of viral content, digital marketing, link building and community management. Here are her helpful articles about creating content that keeps earning links, tailoring content to different generations and a brilliant AMA session on GrowthHackers. Follow Kerry on Twitter and Linkedin. Stoney deGeyter — Pole Position Marketing An early digital marketing pioneer, Stoney writes and speaks about web marketing strategies, SEO, content marketing and PPC. He has years of experience in the industry, being the president of Pole Position Marketing, one of the longest running SEO companies. Stoney is the author of The Best Damn Web Marketing Checklist, Period book and has written numerous articles being published on Search Engine Land and Web Pro News. Follow him on Twitter and Linkedin. Laura Collins — Merkle|Periscopix Laura is a Paid Social Director at Merkle|Periscopix media agency. She has many years of experience in digital marketing, particularly PPC, Facebook and Adwords advertising. Laura contributes articles to SearchEngineLand and provides advanced conversion tracking advice in her company’s blog. Follow Laura on Twitter and Linkedin. Chad White — Litmus Chad is master Yoda of email marketing. He is a research director at an email marketing platform Litmus, an author of a book, numerous marketing guides, articles and posts. Chad uses his journalistic past with insightful email marketing knowledge to produce great content for The New York Times, The Wall Street Journal and USA Today. Read his Email Marketing Rules guide, and follow him on Linkedin and Twitter. Tamar Weinberg — Namecheap Tamar is a legend who helped Mashable and Lifehacker grow into what they are today. Now she is focused on data-driven digital marketing and works as a Social Media Customer Experience and Success Lead at Namecheap. She shares helpful articles on how to build a community and work with influencers. Here are Tamar’s Twitter and Linkedin. Megan Hannay — ZipSprout Megan is a co-founder and CEO of ZipSprout, a local marketing agency that brings together nonprofit organizations with enterprise businesses. She has in-depth knowledge of brand positioning, social media and marketing tactics for local businesses and shares her views in articles and interviews, which are both fun and useful. Here are Megan’s Twitter and Linkedin. Brian Patterson — Go Fish Digital Brian has a lot of expertise in both SEO techniques and brand reputation management, which allows him to provide an extremely unique view of digital marketing strategies and their implementation. Brian is a contributing author at MOZ and Marketing Land, where he writes practical tips on link building and reputation management. Follow Brian’s Twitter and Linkedin. Jayson DeMers — AudienceBloom Jayson is a CEO at digital marketing company AudienceBloom and a very productive columnist at Inc, Entrepreneur and Forbes. In his articles he shares advice on SEO, content marketing, productivity and social media activity. Here is his latest article on Instagram as the best platform for user engagement, and also his Twitter, Linkedin. Jordan Kasteler — Consultant Jordan has the most impressive marketing experience: PETA marketing strategist, co-founder of BlueGlass Interactive, SEO at Overstock.com. Now he works as a digital marketing consultant, writes enlightening articles for high-tier media and speaks at industry events. His article 11 Helpful Social Media Tools for Marketers on Social Media Examiner gathered over 6K shares. Follow Jordan on Twitter and Linkedin. Blaise Lucey — Bitly Listed in Top 40 Content & Digital Marketing Influencers by The Content Standard and working as Director of Product & Content Marketing at Bitly, Blaise is a must-follow digital marketer in the US. He specializes in developing products and content marketing strategies for tech companies. Here are a great post from Blaise on user-generated content, his Twitter and Linkedin. Sarah Esterman — Simple Sarah is a Lifecycle Marketing Manager at Simple Finance and a speaker at Marketing Sherpa Summit. She advocates customer-first approach in marketing strategies and building a long-term relationship with customers for brands. At the Summit, Sarah will talk about how email marketing helps to reduce customer friction and increase engagement 407%. Follow Sarah on Linkedin and Twitter. Brian Fanzo — iSocialFanz Brian is a CEO of a social strategy consulting agency iSocialFanz LLC that specializes in promoting brands in Periscope, Snapchat, and Facebook Live. He has some truly inspiring and insightful speeches on social media marketing, the millennial mindset, gadgets and new formats of storytelling for brands. Follow his Youtube channel, Linkedin and Twitter. This story was originally published at blog.depositphotos.com "}